{
  "ticker": "GOOG",
  "cik": "0001652044",
  "company_name": "Alphabet Inc.",
  "filing_date": "2025-02-05",
  "accession": "0001652044-25-000014",
  "primary_doc": "goog-20241231.htm",
  "item_sections": {
    "item1": "Item 1 \"Business,\" Part I,",
    "item1a": "Item 1A Risk Factors and Legal Matters in Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n•\nOur employees are critical to our success and we expect to continue investing in them.\nOur employees are among our best assets and are critical for our continued success. We expect to continue hiring talented employees around the globe and to provide competitive compensation programs. For additional information, see Culture and Workforce in Part I, Item 1 Business of this Annual Report on Form 10-K.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nIn addition to the long-term trends and their financial effect on our business discussed above, fluctuations in our revenues have been and may continue to be affected by a combination of factors, including:\n•\nchanges in foreign currency exchange rates;\n•\nchanges in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\n•\ngeneral economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending; \n•\nnew product, service, and market launches; and\n31.  \nTable of Contents\nAlphabet Inc.\n•\nseasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following: \n•\nGoogle Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\n•\nYouTube ads, which includes revenues generated on YouTube properties; and\n•\nGoogle Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\n•\nadvertiser competition for keywords;\n•\nchanges in advertising quality, formats, delivery or policy;\n•\nchanges in device mix;\n•\nseasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\n•\ntraffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n•\nconsumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n•\nplatforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n•\ndevices, which primarily include sales of the Pixel family of devices; and\n•\nother products and services.\n32.  \nTable of Contents\nAlphabet Inc.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n•\nGoogle Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini for Google Cloud; cybersecurity; and data and analytics;\n•\nGoogle Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and\n•\nother enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of healthcare-related services, and internet services.\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount, due to factors such as annual stock-based compensation (SBC) awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n•\nTAC includes: \n◦\namounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\n◦\namounts paid to Google Network partners primarily for ads displayed on their properties.\n•\nOther cost of revenues primarily includes:\n◦\ncontent acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\n◦\ndepreciation expense related to our technical infrastructure;\n◦\nemployee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\n◦\ninventory and other costs related to the devices we sell; and\n◦\nother technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nOperating Expenses\n33.  \nTable of Contents\nAlphabet Inc.\nOperating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n•\ndepreciation;\n•\nemployee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and \n•\nthird-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n•\nemployee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\n•\nspend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n•\nemployee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions; \n•\nexpenses relating to legal and other matters, including certain fines and settlements; and \n•\nthird-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nOther Income (Expense), Net \nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Item 8 as well as Item 7A Quantitative and Qualitative Disclosures About Market Risk of this Annual Report on Form 10-K.\nProvision for Income Taxes\n \nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, including a reconciliation of the U.S. federal statutory rate to our effective tax rate, see Note 14 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n34.  \nTable of Contents\nAlphabet Inc.\nExecutive Overview\nThe following table summarizes our consolidated financial results (in millions, except for per share information and percentages):\nYear Ended December 31,\n2023\n2024\n$ Change\n% Change\nConsolidated revenues\n$\n307,394 \n$\n350,018 \n$\n42,624 \n14 \n%\nChange in consolidated constant currency revenues\n(1)\n15 \n%\nCost of revenues\n$\n133,332 \n$\n146,306 \n$\n12,974 \n10 \n%\nOperating expenses\n$\n89,769 \n$\n91,322 \n$\n1,553 \n2 \n%\nOperating income\n$\n84,293 \n$\n112,390 \n$\n28,097 \n33 \n%\nOperating margin\n27 \n%\n32 \n%\n5 \n%\nOther income (expense), net\n$\n1,424 \n$\n7,425 \n$\n6,001 \n421 \n%\nNet income\n$\n73,795 \n$\n100,118 \n$\n26,323 \n36 \n%\nDiluted EPS\n(2)\n$\n5.80 \n$\n8.04 \n$\n2.24 \n39 \n%\n(1)\n    See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information. \n(2)    \nFor additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n•\nRevenues were\n $350.0 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $32.4 billion, or 12%, and an increase in Google Cloud revenues of $10.1 billion, or 31%.\n•\nTotal constant currency revenues, which exclude the effect of hedging, increased 15% year over year.\n•\nCost of revenues wa\ns $146.3 billion, an increase of 10% year over year, primarily driven by increases in content acquisition costs, TAC, and depreciation expense. \n•\nOperating expenses were $91.3 billion, an increase of 2% year over year, primarily driven by increases in de\npreciation expense, \nemployee compensation expenses,\n and third-party services fees. These increases were partially offset by reductions in charges related to legal and other matters and charges related to our office space optimization efforts. The overall increase in employee compensation expenses was partially offset by a reduction in employee severance and related charges.\nOther Information:\n•\nDividend payments to stockholders of Class A, Class B, and Class C shares, which were first paid in June 2024, were $3.5 billion, $519 million, and $3.3 billion, respectively, totaling $7.4 billion for the year ended December 31, 2024. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n•\nRepurchases of Class A and Class C shares were $11.9 billion and $50.2 billion, respectively, totaling $62.0 billion for the year ended December 31, 2024. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n•\nEmployee severance and related charges for the year ended December 31, 2024 were $1.0 billion, a decrease of $1.1 billion as compared to the year ended December 31, 2023. Office space charges, including accelerated rent and accelerated depreciation, for the year ended December 31, 2024 were $796 million, a decrease of $1.3 billion as compared to the year ended December 31, 2023. Substantially all of these charges were included in Alphabet-level activities. \n•\nOperating cash flow was $125.3 billion for the year ended December 31, 2024.\n•\nCapital expenditures, which primarily reflected investments in technical infrastructure, were $52.5 billion for the year ended December 31, 2024.\n•\nAs of \nDecember 31, 2024, we had\n 183,323 employees.\n35.  \nTable of Contents\nAlphabet Inc.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nYear Ended December 31,\n2023\n2024\nGoogle Search & other\n$\n175,033 \n$\n198,084 \nYouTube ads\n31,510 \n36,147 \nGoogle Network\n31,312 \n30,359 \nGoogle advertising\n237,855 \n264,590 \nGoogle subscriptions, platforms, and devices\n34,688 \n40,340 \nGoogle Services total\n272,543 \n304,930 \nGoogle Cloud\n33,088 \n43,229 \nOther Bets\n1,527 \n1,648 \nHedging gains (losses)\n236 \n211 \nTotal revenues\n$\n307,394 \n$\n350,018 \nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $23.1 billion from 2023 to 2024. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $4.6 billion from 2023 to 2024. The growth was driven by our brand advertising products followed by our direct response advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $953 million from 2023 to 2024, primarily driven by a decrease in Google Ad Manager and AdMob revenues. Additionally, Google Network revenues were adversely affected by changes in foreign currency exchange rates.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from 2023 to 2024:\nGoogle Search & other\nPaid clicks change\n5 \n%\nCost-per-click change\n7 \n%\nGoogle Network\nImpressions change\n(11)\n%\nCost-per-impression change\n10 \n%\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates.\n36.  \nTable of Contents\nAlphabet Inc.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $5.7 billion from 2023 to 2024. The growth was primarily driven by an increase in subscription revenues, largely from growth in the number of paid subscribers for YouTube services followed by Google One. \nGoogle Cloud\nGoogle Cloud revenues increased\n $10.1 billion \nfrom 2023 to 2024 primarily driven by growth in Google Cloud Platform largely from infrastructure services.\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers:\n \nYear Ended December 31,\n \n2023\n2024\nUnited States\n47 \n%\n49 \n%\nEMEA\n30 \n%\n29 \n%\nAPAC\n17 \n%\n16 \n%\nOther Americas\n6 \n%\n6 \n%\nHedging gains (losses)\n0 \n%\n0 \n%\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to U.S. Generally Accepted Accounting Principles (GAAP) results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\n37.  \nTable of Contents\nAlphabet Inc.\nThe following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages):\nYear Ended December 31, 2024\n% Change from Prior Period\nYear Ended December 31,\nLess FX Effect\nConstant Currency Revenues\nAs Reported\nLess Hedging Effect\nLess FX Effect\nConstant Currency Revenues\n2023\n2024\nUnited States\n$\n146,286 \n$\n170,447 \n$\n0 \n$\n170,447 \n17 \n%\n0 \n%\n17 \n%\nEMEA\n91,038 \n102,127 \n41 \n102,086 \n12 \n%\n0 \n%\n12 \n%\nAPAC\n51,514 \n56,815 \n(1,369)\n58,184 \n10 \n%\n(3)\n%\n13 \n%\nOther Americas\n18,320 \n20,418 \n(1,608)\n22,026 \n11 \n%\n(9)\n%\n20 \n%\nRevenues, excluding hedging effect\n307,158 \n349,807 \n(2,936)\n352,743 \n14 \n%\n(1)\n%\n15 \n%\nHedging gains (losses)\n236 \n211 \nTotal revenues\n(1)\n$\n307,394 \n$\n350,018 \n$\n352,743 \n14 \n%\n0 \n%\n(1)\n%\n15 \n%\n(1)\nTotal constant currency revenues of $352.7 billion for 2024 increased $45.6 billion compared to $307.2 billion in revenues, excluding hedging effect, for 2023.\nEMEA revenue growth was not materially affected by changes in foreign currency exchange rates, as the effect of the U.S. dollar strengthening relative to the Turkish lira was offset by the U.S. dollar weakening relative to the British pound and the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso and the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\n \nYear Ended December 31,\n \n2023\n2024\nTAC\n$\n50,886 \n$\n54,900 \nOther cost of revenues\n82,446 \n91,406 \nTotal cost of revenues\n$\n133,332 \n$\n146,306 \nTotal cost of revenues as a percentage of revenues\n43 \n%\n42 \n%\nCost of revenues increased\n $13.0 billion from 2023 to 2024 due to an increase in other cost of revenues and TAC of $9.0 billion and $4.0 billion, res\npectively.\nThe increase in TAC from 2023 to 2024 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.4% to 20.7% from 2023 to 2024 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues increased from 2023 to 2024 primarily due to increases related to mobile searches, which carries higher TAC because more mobile searches are channeled through paid access points. The TAC rate on Google Network revenues was substantially consistent from 2023 to 2024.\nThe increase in other cost of revenues from 2023 to 2024 was primarily due to increases in content acquisition costs, largely for YouTube, depreciation expense, and other technical infrastructure operations costs.\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\n38.  \nTable of Contents\nAlphabet Inc.\n \nYear Ended December 31,\n \n2023\n2024\nResearch and development expenses\n$\n45,427 \n$\n49,326 \nResearch and development expenses as a percentage of revenues\n15 \n%\n14 \n%\nR&D expenses increased \n$3.9 billion\n from 2023 to 2024, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $1.4 billion, and third-party services fees of $698 million, partially offset by a reduction in charges related to our office space optimization efforts of $640 million. The increase in employee compensation expenses was primarily driven by a $1.3 billion increase in SBC expenses, which includes the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period, partially offset by a $537 million decrease in severance and related charges.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\n \nYear Ended December 31,\n \n2023\n2024\nSales and marketing expenses\n$\n27,917 \n$\n27,808 \nSales and marketing expenses as a percentage of revenues\n9 \n%\n8 \n%\nSales and marketing expenses decreased $109 million from 2023 to 2024, due to a combination of factors, none of which were individually significant.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\n \nYear Ended December 31,\n \n2023\n2024\nGeneral and administrative expenses\n$\n16,425 \n$\n14,188 \nGeneral and administrative expenses as a percentage of revenues\n5 \n%\n4 \n%\nGeneral and administrative expenses decreased \n$2.2 billion\n from 2023 to 2024, primarily driven by a reduction in charges related to legal and other matters of $1.3 billion and a decrease in employee compensation expenses of $285 million, primarily due to a decrease in average headcount, in addition to a combination of factors, none of which were individually significant. \nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs are not allocated to our segments because they represent Alphabet-level activities. For further details on our segments, see Part I, Item 1 Business and \nNote 15\n of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nThe following table presents segment operating income (loss) (in millions).\nYear Ended December 31,\n2023\n2024\nOperating income (loss):\nGoogle Services\n$\n95,858 \n$\n121,263 \nGoogle Cloud\n1,716 \n6,112 \nOther Bets\n(4,095)\n(4,444)\nAlphabet-level activities\n(1)\n(9,186)\n(10,541)\nTotal income from operations\n$\n84,293 \n$\n112,390 \n(1)\nIn addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were \n$236 million and \n$211 million\n in \n2023\n and \n2024\n, respectively. For the years ended December 31, \n2023 and 2024\n, Alphabet-level activities included substantially all of the charges related to employee severance and our office spa\nce charges.\n \n39.  \nTable of Contents\nAlphabet Inc.\nGoogle Services\nGoogle Services operating income increased $25.4 billion from 2023 to 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in content acquisition costs and TAC. Additionally, a reduction in employee compensation expenses contributed to the increase in operating income.\nGoogle Cloud\nGoogle Cloud operating income increased $4.4 billion from 2023 to 2024. The increase in operating income was primarily driven by an increase in revenues, partially offset by increases in usage costs for technical infrastructure as well as employee compensation expenses, largely driven by headcount growth.\nOther Bets \nOther Bets operating loss increased $349 million from 2023 to 2024. The increase in operating loss was primarily due to an increase in expenses, largely driven by employee compensation expenses in addition to a combination of factors, none of which were individually significant. The increase in employee compensation expenses was primarily as a result of the reduction in valuation-based compensation liabilities related to certain Other Bets recognized in the prior year comparable period.\nOther Income (Expense), Net\nThe following table presents OI&E, (in millions):\n \nYear Ended December 31,\n \n2023\n2024\nInterest income\n$\n3,865 \n$\n4,482 \nInterest expense\n(308)\n(268)\nForeign currency exchange gain (loss), net\n(1,238)\n(409)\nGain (loss) on debt securities, net\n(1,215)\n(1,043)\nGain (loss) on equity securities, net\n392 \n3,714 \nPerformance fees\n257 \n218 \nIncome (loss) and impairment from equity method investments, net\n(628)\n(188)\nOther\n299 \n919 \nOther income (expense), net\n$\n1,424 \n$\n7,425 \nOI&E, net increased $6.0 billion from 2023 to 2024 primarily due to an increase in net gains on equity securities and a decrease in net losses on foreign currency exchange. The net gains on equity securities were primarily due to net unrealized gains on non-marketable equity securities driven by fair value adjustments related to observable transactions, partially offset by a decrease in net unrealized gains on marketable equity securities due to market-driven changes. Foreign currency exchange net losses decreased compared to the prior year primarily due to prior year losses in unhedged currencies.\nIn January 2025, we recognized an $8.0 billion unrealized gain on our non-marketable equity securities related to our investment in a private company. The unrealized gain reflects an increase in the fair value measurement of our investment following an observable transaction in January 2025. \nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\n \nYear Ended December 31,\n \n2023\n2024\nIncome before provision for income taxes\n$\n85,717 \n$\n119,815 \nProvision for income taxes\n$\n11,922 \n$\n19,697 \nEffective tax rate\n13.9 \n%\n16.4 \n%\nThe effective tax rate increased from 2023 to 2024. This increase was primarily due to a one-time adjustment for tax rule changes issued by the Internal Revenue Service (IRS) that affected the 2023 rate related to U.S. federal foreign tax credits, as well as a separate rule change with guidance on the capitalization and amortization of R&D \n40.  \nTable of Contents\nAlphabet Inc.\nexpenses. Additionally, a decrease in the 2024 U.S. federal Foreign Derived Intangible Income tax deduction contributed to an increase in the effective tax rate. These factors were partially offset by an increase in stock-based compensation-related tax benefits in 2024.\nThe OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect others to follow, however this did not have a material effect on our income tax provision for the 2024 fiscal year. \nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of \nDecember 31, 2024\n, we had $95.7 billion in cash, cash equivalents, and short-term marketable securities. Ca\nsh equivalents and marketable securities a\nre comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders.\nThe following table presents our cash flows (in millions):\n \nYear Ended December 31,\n \n2023\n2024\nNet cash provided by operating activities\n$\n101,746 \n$\n125,299 \nNet cash used in investing activities\n$\n(27,063)\n$\n(45,536)\nNet cash used in financing activities\n$\n(72,093)\n$\n(79,733)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we generate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and other cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nNet cash provided by operating activities increased from 2023 to 2024 \ndue to an increase in cash received from customers, partially offset by an increase in cash payments for cost of revenues and operating expenses.\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from 2023 to 2024\n primarily due to an increase in purchases of property and equipment and purchases of marketable securities, partially offset by increases in maturities and sales of marketable securities. The increase in purchases of property and equipment is primarily driven by investments in technical infrastructure. \nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities increased from 2023 to 2024\n due to dividend payments and net payments related to stock-based award activities, partially offset by an increase in proceeds from issuance of debt, net of repayments.\n41.  \nTable of Contents\nAlphabet Inc.\nLiquidity and Material Cash Requirements\nWe expect exist\ning cash, cash equivalents, short-term marketable securities, and cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n•\ntechnical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, and data center land and building construction; and\n•\noffice facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of construction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install servers and network equipment.\nDuring the years ended December 31, 2023 and 2024, we spent $32.3 billion and $52.5 billion on capital expenditures, respectively. We \nexpect to increase, relative to 2024, our i\nnvestment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. For the years ended December 31, 2023 and 2024, our depreciation on property and equipment was $11.9 billion and $15.3 billion, respectively.\nLeases \nFor the years ended December 31, 2023 and 2024, we recognized additional operating lease assets of $2.9 billion and $2.5 billion, and additional finance lease assets of $564 million and $313 million, respectively. As of December 31, 2024, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of 7.8 years, was $17.0 billion, of which $3.2 billion is short-term, and total future lease payments under finance leases, which had a weighted average remaining lease term of 10.4 years, was $1.9 billion, of which $257 million is short-term. As of December 31, 2024, we have entered into leases that have not yet commenced with future short-term and long-term lease payments of $773 million and $6.5 billion, respectively, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2028 with non-cancelable lease terms of one to 25 years. \nFor the years ended December 31, 2023 and 2024, our operating lease expenses (including variable lease costs) were $4.5 billion and $4.7 billion, respectively. Finance lease costs were $504 million and $444 million for the years ended December 31, 2023 and 2024, respectively. For additional information, see Note 4 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nFinancing\nWe have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of December 31, 2024, we ha\nd $2.3 billion \nof short-term commercial paper outstanding.\nAs of December 31, 2024, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion with short-term and long-term future interest payments of $197 million and $3.4 billion, respectively.\nAs of December 31, 2024, we had $10.0 billion of revolving credit facilities, \n$4.0 billion expiring in April 2025 and $6.0 billion expiring in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability  goals\n. No amounts \nhave been borrowed under the credit facilities. \nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n42.  \nTable of Contents\nAlphabet Inc.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 8 of this Annual Report on Form 10-K.\nShare Repurchase Program\nDuring 2024, we repurchased and subsequently retired \n379 million\n shares for \n$62.0 billion\n.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of \nDecember 31, 2024\n, \n$44.7 billion\n remained available for Class A and Class C share repurchases.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nYear Ended December 31, 2023\nYear Ended December 31, 2024\nShares\nAmount\nShares\nAmount\nClass A share repurchases\n78\n$\n9,316 \n73\n$\n11,855 \nClass C share repurchases\n450\n52,868 \n306\n50,192 \nTotal share repurchases\n(1)\n528\n$\n62,184 \n379\n$\n62,047 \n(1)         \nShares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nDividend Program\nDuring the year ended \nDecember 31, 2024\n total cash dividends, which were first paid in June 2024, were \n$3.5 billion, $519 million, and $3.3 billion\n for Class A, Class B, and Class C shares, respectively.\nThe company intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion. \nEuropean Commission Fines\nIn 2017, 2018, and 2019, the European Commission (EC) announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €2.4 billion ($2.7 billion as of June 27, 2017), €4.3 billion ($5.1 billion as of June 30, 2018), and €1.5 billion ($1.7 billion as of March 20, 2019), respectively. \nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending.\nIn September 2024, the European Court of Justice rejected our appeal of the 2017 decision and upheld the €2.4 billion fine. In the third quarter of 2024, we made a cash payment of $3.0 billion for the 2017 shopping fine.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision to the European Court of Justice.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current liabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTaxes\nAs of \nDecember 31, 2024\n, we had income taxes payable of $2.7 billion related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act, which is due in 2025. We also had long-term taxes payable of $8.8 billion primarily related to uncertain tax positions as of \nDecember 31, 2024\n.\nPurchase Commitments and Other Contractual Obligations\nAs of December 31, 2024, we had material purchase commitments and other contractual obligations of $55.4 billion, of which $32.5 billion was short-term.\n These amounts primarily consist of purchase orders for certain technical infrastructure as well as \nthe non-cancelable portion or the minimum cancellation fee in certain agreements related to commitments to purchase licenses, including content licenses, inventory, and network capacity. For those agreements \n43.  \nTable of Contents\nAlphabet Inc.\nwith variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of December 31, 2024. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable.\nCritical Accounting Estimates\nWe prepare our consolidated financial statements in accordance with GAAP. In doing so, we have to make estimates and assumptions. Our critical accounting estimates are those estimates that involve a significant level of uncertainty at the time the estimate was made, and changes in them have had or are reasonably likely to have a material effect on our financial condition or results of operations. Accordingly, actual results could differ materially from our estimates. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We have reviewed our critical accounting estimates with the Audit and Compliance Committee of our Board of Directors.\nFor a summary of significant accounting policies and the effect on our financial statements, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nFair Value Measurements of Non-Marketable Equity Securities\nWe measure certain financial instruments at fair value on a nonrecurring basis, consisting primarily of our non-marketable equity securities. These investments are accounted for under the measurement alternative method (\"the measurement alternative\") and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer. These adjustments require quantitative assessments of the fair value of our securities, which may require the use of unobservable inputs. Adjustments are determined primarily based on a market approach as of the transaction date and involve the use of estimates using the best information available, which may include cash flow projections or other available market data.\nNon-marketable equity securities are also evaluated for impairment, based on qualitative factors including the companies' financial and liquidity position and access to capital resources, among others. When indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach, which requires judgment and the use of unobservable inputs, including discount rates, investee revenues and costs, and comparable market data of private and public companies, among others. When the quantitative remeasurements of fair value indicate an impairment exists, we write down the investment to its current fair value.\nWe also have compensation arrangements with payouts based on realized returns from certain investments, i.e. performance fees. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs.\nProperty and Equipment\nWe assess the reasonableness of the useful lives of our property and equipment periodically as well as when other changes occur, such as when there are changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements, that could indicate a change in the period over which we expect to benefit from the asset.\nIncome Taxes\nWe are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes.\nRecording an uncertain tax position involves various qualitative considerations, including evaluation of comparable and resolved tax exposures, applicability of tax laws, and likelihood of settlement. We evaluate uncertain tax positions periodically, considering changes in facts and circumstances, such as new regulations or recent judicial opinions, as well as the status of audit activities by taxing authorities. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different. To the extent that the final tax outcome of these matters is different than the amounts recorded, such \n44.  \nTable of Contents\nAlphabet Inc.\ndifferences will affect the provision for income taxes and the effective tax rate in the period in which such determination is made.\nThe provision for income taxes includes the effect of reserve provisions and changes to reserves as well as the related net interest and penalties. In addition, we are subject to the continuous examination of our income tax returns by the IRS and other tax authorities which may assert assessments against us. We regularly assess the likelihood of adverse outcomes resulting from these examinations and assessments to determine the adequacy of our provision for income taxes.\nLoss Contingencies\nWe are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. We record a liability when we believe that it is probable that a loss has been incurred and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the possible loss in Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. \nWe evaluate, on a regular basis, developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments and changes to our disclosures. Significant judgment is required to determine both the likelihood and the estimated amount of a loss related to such matters. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material.\nITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to financial market risks, including changes in foreign currency exchange rates, interest rates, and equity investment risks. \nForeign Currency Exchange Risk\nWe transact business globally in multiple currencies. International revenues, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. As discussed below, we enter into derivative instruments to hedge foreign currency risk. Principal currencies hedged included the Australian dollar, British pound, Canadian dollar, Euro, and Japanese yen. For the purpose of analyzing foreign currency exchange risk, we considered the historical trends in foreign currency exchange rates and determined that it was reasonably possible that adverse changes in exchange rates of 10% could be experienced.\nWe use foreign currency forward and option contracts to offset the foreign exchange risk on monetary assets and liabilities denominated in currencies other than the functional currency of the subsidiary. These forward and option contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements on our assets and liabilities. The foreign currency gains and losses on these assets and liabilities are recorded in OI&E, which are offset by the gains and losses on the forward and option contracts.\nIf an adverse 10% foreign currency exchange rate change was applied to net monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approxima\ntely $503 million \nand $135 million as of \nDecember 31, 2023\n and 2024, respectively, after consideration of the effect of foreign exchange contracts in place for the years ended \nDecember 31, 2023\n and 2024.\nWe use foreign currency forward and option contracts, including collars (an option strategy comprised of a combination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in foreign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option contacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign currency forward and option contracts offset the foreign currency gains related to our earnings. These hedging contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate these contracts as cash flow hedges for accounting purposes. We reflect the gains and losses of foreign currency spot rate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them into revenues to offset the hedged exposures as they occur. \nI\nf the U.S. dollar weakened by 10% as of December 31, 2023 and 2024, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately\n $1.5 billion and $1.6 billion\n lower as of \n45.  \nTable of Contents\nAlphabet Inc.\nDecember 31, 2023 and 2024, respectively. The change in the value recorded in AOCI would be expected to offset a corresponding foreign currency change in forecasted hedged revenues when recognized.\nWe use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency risks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency translation risk from our foreign operations.\nIf the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $946 million and \n$660 million\n lower as of December 31, 2023 and 2024, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries.\nInterest Rate Risk\nOur Corporate Treasury investment strategy is to achieve a return that w\nill allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains and losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses. \nWe use value-at-risk (VaR) analysis to determine the potential effect of fluctuations in interest rates on the value of our investment portfolio. The VaR is the expected loss in fair value, for a given confidence interval, for our investment portfolio due to adverse movements in interest rates. We use a variance/covariance VaR model with 95% confidence interval. The estimated one-day loss in fair value of our investment portfolio as of December 31, 2023 and 2024 are shown below (in millions):\n \nAs of December 31,\n12-Month Average \nAs of December 31,\n \n2023\n2024\n2023\n2024\nRisk category - interest rate\n$\n296 \n$\n208 \n$\n271 \n$\n230 \nActual future gains and losses associated with our investment portfolio may differ materially from the sensitivity analyses performed as of December 31, 2023 and 2024 due to the inherent limitations associated with predicting the timing and amount of changes in interest rates and our actual exposures and positions. VaR analysis is not intended to represent actual losses but is used as a risk estimation.\nEquity Investment Risk\nOur marketable and non-marketable equity securities are subject to a wide variety of market-related risks that could substantially reduce or increase the fair value of our holdings.\nOur marketable equity securities are publicly traded stocks or funds and our non-marketable equity securities are investments in privately held companies, some of which are in the startup or development stages.\nWe record marketable equity securities not accounted for under the equity method at fair value based on readily determinable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and represent $6.0 billion and $5.1 billion of our investments as of December 31, 2023 and 2024, respectively. A hypothetical adverse price change of 10% on our December 31, 2024 balance would decrease the fair value of marketable equity securities by $508 million. From time to time, we may enter into derivatives to hedge the market price risk on certain of our marketable equity securities.\nOur non-marketable equity securities not accounted for under the equity method are primarily adjusted to fair value for observable transactions for identical or similar investments of the same issuer or impairment (referred to as the measurement alternative). The fair value measured at the time of the observable transaction is not necessarily an indication of the current fair value as of the balance sheet date. These investments, especially those that are in the early stages, are inherently risky because the technologies or products these companies have under development are typically in the early phases and may never materialize, and they may experience a decline in financial condition, which could result in a loss of a substantial part of our investment in these companies. Valuations of our equity investments in private companies are inherently more complex due to the lack of readily available market data and \n46.  \nTable of Contents\nAlphabet Inc.\nobservable transactions at lower valuations could result in significant losses. In addition, global economic conditions could result in additional volatility. The success of our investment in any private company is also typically dependent on the likelihood of our ability to realize appreciation in the value of investments through liquidity events such as public offerings, acquisitions, private sales or other market events. Changes in the valuation of non-marketable equity securities may not directly correlate with changes in valuation of marketable equity securities. As of December 31, 2023 and 2024, the carrying value of our non-marketable equity securities, which were accounted for under the measurement alternative, was $28.8 billion and $35.5 billion, respectively. \nThe carrying values of our equity method investments, which totaled approximately $1.7 billion and \n$2.0 billion as of December 31, 2023 and 2024\n, respectively, generally do not fluctuate based on market price changes. However, these investments could be impaired if the carrying value exceeds the fair value and is not expected to recover.\nFor additional information about our equity investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n47.  \nTable of Contents\nAlphabet Inc.\nITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAlphabet Inc.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage\nReports of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n49\nFinancial Statements:\nConsolidated Balance Sheets\n52\nConsolidated Statements of Income\n53\nConsolidated Statements of Comprehensive Income\n54\nConsolidated Statements of Stockholders’ Equity\n55\nConsolidated Statements of Cash Flows\n56\nNotes to Consolidated Financial Statements\n57\n48.  \nTable of Contents\nAlphabet Inc.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Alphabet Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Alphabet Inc. (the Company) as of December 31, 2023 and 2024, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2023 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended \nDecember 31, 2024\n, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 4, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\n49.  \nTable of Contents\nAlphabet Inc.\nLoss Contingencies \nDescription of the Matter\nThe Company is subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by its users, goods and services offered by advertisers or publishers using their platforms, personal injury, and other matters. As described in Note 10 to the consolidated financial statements “Commitments and Contingencies” such claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and orders could result in adverse consequences.\nSignificant judgment is required to determine both the likelihood and the estimated amount of a loss related to such matters. Auditing management’s accounting for and disclosure of loss contingencies from these matters involved challenging and subjective auditor judgment in assessing the Company’s evaluation of the probability of a loss, and the estimated amount or range of loss.\nHow We Addressed the Matter in Our Audit\nWe tested relevant controls over the identified risks associated with management’s accounting for and disclosure of these matters. This included controls over management’s assessment of the probability of incurrence of a loss and whether the loss or range of loss was reasonably estimable and the development of related disclosures.\nOur audit procedures included gaining an understanding of previous rulings and the status of ongoing lawsuits, reviewing letters from internal and external legal counsel addressing the matters, meeting with internal legal counsel to discuss the allegations, and obtaining a representation letter from management on these matters. We also evaluated the Company’s disclosures in relation to these matters.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1999.\nSan Jose, California\nFebruary 4, 2025\n50.  \nTable of Contents\nAlphabet Inc.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Alphabet Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Alphabet Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Alphabet Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2024 consolidated financial statements of the Company and our report dated February 4, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nSan Jose, California\nFebruary 4, 2025\n51.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except par value per share amounts)\nAs of December 31,\n2023\n2024\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n24,048\n \n$\n23,466\n \nMarketable securities\n86,868\n \n72,191\n \nTotal cash, cash equivalents, and marketable securities\n110,916\n \n95,657\n \nAccounts receivable, net\n47,964\n \n52,340\n \nOther current assets\n12,650\n \n15,714\n \nTotal current assets\n171,530\n \n163,711\n \nNon-marketable securities\n31,008\n \n37,982\n \nDeferred income taxes\n12,169\n \n17,180\n \nProperty and equipment, net\n134,345\n \n171,036\n \nOperating lease assets\n14,091\n \n13,588\n \nGoodwill\n29,198\n \n31,885\n \nOther non-current assets\n10,051\n \n14,874\n \nTotal assets\n$\n402,392\n \n$\n450,256\n \nLiabilities and Stockholders’ Equity\nCurrent liabilities:\nAccounts payable\n$\n7,493\n \n$\n7,987\n \nAccrued compensation and benefits\n15,140\n \n15,069\n \nAccrued expenses and other current liabilities\n46,168\n \n51,228\n \nAccrued revenue share\n8,876\n \n9,802\n \nDeferred revenue\n4,137\n \n5,036\n \nTotal current liabilities\n81,814\n \n89,122\n \nLong-term debt\n11,870\n \n10,883\n \nIncome taxes payable, non-current\n8,474\n \n8,782\n \nOperating lease liabilities\n12,460\n \n11,691\n \nOther long-term liabilities\n4,395\n \n4,694\n \nTotal liabilities\n119,013\n \n125,172\n \nCommitments and Contingencies (Note 10)\nStockholders’ equity:\nPreferred stock, $\n0.001\n par value per share, \n100\n shares authorized; \nno\n shares issued and outstanding\n0\n \n0\n \nClass A, Class B, and Class C stock and additional paid-in capital, $\n0.001\n par value per share: \n300,000\n shares authorized (Class A \n180,000\n, Class B \n60,000\n, Class C \n60,000\n); \n12,460\n (Class A \n5,899\n, Class B \n870\n, Class C \n5,691\n) and \n12,211\n (Class A \n5,835\n, Class B \n861\n, Class C \n5,515\n) shares issued and outstanding\n76,534\n \n84,800\n \nAccumulated other comprehensive income (loss)\n(\n4,402\n)\n(\n4,800\n)\nRetained earnings\n211,247\n \n245,084\n \nTotal stockholders’ equity\n283,379\n \n325,084\n \nTotal liabilities and stockholders’ equity\n$\n402,392\n \n$\n450,256\n \nSee accompanying notes.\n52.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts)\n \nYear Ended December 31,\n \n2022\n2023\n2024\nRevenues\n$\n282,836\n \n$\n307,394\n \n$\n350,018\n \nCosts and expenses:\nCost of revenues\n126,203\n \n133,332\n \n146,306\n \nResearch and development\n39,500\n \n45,427\n \n49,326\n \nSales and marketing\n26,567\n \n27,917\n \n27,808\n \nGeneral and administrative\n15,724\n \n16,425\n \n14,188\n \nTotal costs and expenses\n207,994\n \n223,101\n \n237,628\n \nIncome from operations\n74,842\n \n84,293\n \n112,390\n \nOther income (expense), net\n(\n3,514\n)\n1,424\n \n7,425\n \nIncome before income taxes\n71,328\n \n85,717\n \n119,815\n \nProvision for income taxes\n11,356\n \n11,922\n \n19,697\n \nNet income\n$\n59,972\n \n$\n73,795\n \n$\n100,118\n \nBasic net income per share (Note 12)\n$\n4.59\n \n$\n5.84\n \n$\n8.13\n \nDiluted net income per share (Note 12)\n$\n4.56\n \n$\n5.80\n \n$\n8.04\n \nSee accompanying notes.\n53.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\n \nYear Ended December 31,\n \n2022\n2023\n2024\nNet income\n$\n59,972\n \n$\n73,795\n \n$\n100,118\n \nOther comprehensive income (loss):\nChange in foreign currency translation adjustment, net of income tax benefit (expense) of $(\n134\n), $\n63\n and $(\n49\n)\n(\n1,836\n)\n735\n \n(\n1,673\n)\nAvailable-for-sale investments:\nChange in net unrealized gains (losses)\n(\n4,720\n)\n1,344\n \n(\n116\n)\nLess: reclassification adjustment for net (gains) losses included in net income\n1,007\n \n1,168\n \n782\n \nNet change, net of income tax benefit (expense) of $\n1,056\n, $(\n698\n), and $(\n190\n)\n(\n3,713\n)\n2,512\n \n666\n \nCash flow hedges:\nChange in net unrealized gains (losses)\n1,275\n \n168\n \n775\n \nLess: reclassification adjustment for net (gains) losses included in net income\n(\n1,706\n)\n(\n214\n)\n(\n166\n)\nNet change, net of income tax benefit (expense) of $\n110\n, $\n2\n, and $(\n151\n)\n(\n431\n)\n(\n46\n)\n609\n \nOther comprehensive income (loss)\n(\n5,980\n)\n3,201\n \n(\n398\n)\nComprehensive income\n$\n53,992\n \n$\n76,996\n \n$\n99,720\n \nSee accompanying notes.\n54.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in millions)\n \nClass A, Class B, Class C Stock and\nAdditional Paid-In Capital\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nRetained\nEarnings\nTotal\nStockholders’\nEquity\n \nShares\nAmount\nBalance as of December 31, 2021\n13,242\n \n$\n61,774\n \n$\n(\n1,623\n)\n$\n191,484\n \n$\n251,635\n \nStock issued\n137\n \n8\n \n0 \n0 \n8\n \nStock-based compensation\n0 \n19,525\n \n0 \n0 \n19,525\n \nTax withholding related to vesting of restricted stock units and other\n0 \n(\n9,754\n)\n0 \n(\n1\n)\n(\n9,755\n)\nRepurchases of stock\n(\n530\n)\n(\n3,404\n)\n0 \n(\n55,892\n)\n(\n59,296\n)\nSale of interest in consolidated entities\n0 \n35\n \n0 \n0 \n35\n \nNet income\n0 \n0 \n0 \n59,972\n \n59,972\n \nOther comprehensive income (loss)\n0 \n0 \n(\n5,980\n)\n0 \n(\n5,980\n)\nBalance as of December 31, 2022\n12,849\n \n68,184\n \n(\n7,603\n)\n195,563\n \n256,144\n \nStock issued\n139\n \n0 \n0 \n0 \n0\n \nStock-based compensation\n0 \n22,578\n \n0 \n0 \n22,578\n \nTax withholding related to vesting of restricted stock units and other\n0 \n(\n10,164\n)\n0 \n9\n \n(\n10,155\n)\nRepurchases of stock\n(\n528\n)\n(\n4,064\n)\n0 \n(\n58,120\n)\n(\n62,184\n)\nNet income\n0 \n0 \n0 \n73,795\n \n73,795\n \nOther comprehensive income (loss)\n0 \n0 \n3,201\n \n0 \n3,201\n \nBalance as of December 31, 2023\n12,460\n \n76,534\n \n(\n4,402\n)\n211,247\n \n283,379\n \nStock issued\n130\n \n0 \n0 \n0 \n0 \nStock-based compensation\n0 \n22,937\n \n0 \n0 \n22,937\n \nTax withholding related to vesting of restricted stock units and other\n0 \n(\n12,507\n)\n0 \n(\n16\n)\n(\n12,523\n)\nRepurchases of stock\n(\n379\n)\n(\n3,359\n)\n0 \n(\n58,688\n)\n(\n62,047\n)\nDividends and dividend equivalents declared ($\n0.60\n per share)\n0 \n41\n \n0 \n(\n7,577\n)\n(\n7,536\n)\nSale of interest in consolidated entities\n0 \n1,154\n \n0 \n0 \n1,154\n \nNet income\n0 \n0 \n0 \n100,118\n \n100,118\n \nOther comprehensive income (loss)\n0 \n0 \n(\n398\n)\n0 \n(\n398\n)\nBalance as of December 31, 2024\n12,211\n \n$\n84,800\n \n$\n(\n4,800\n)\n$\n245,084\n \n$\n325,084\n \nSee accompanying notes.\n55.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\n \nYear Ended December 31,\n \n2022\n2023\n2024\nOperating activities\nNet income\n$\n59,972\n \n$\n73,795\n \n$\n100,118\n \nAdjustments:\nDepreciation of property and equipment\n13,475\n \n11,946\n \n15,311\n \nStock-based compensation expense\n19,362\n \n22,460\n \n22,785\n \nDeferred income taxes\n(\n8,081\n)\n(\n7,763\n)\n(\n5,257\n)\nLoss (gain) on debt and equity securities, net\n5,519\n \n823\n \n(\n2,671\n)\nOther\n3,483\n \n4,330\n \n3,419\n \nChanges in assets and liabilities, net of effects of acquisitions:\nAccounts receivable, net\n(\n2,317\n)\n(\n7,833\n)\n(\n5,891\n)\nIncome taxes, net\n584\n \n523\n \n(\n2,418\n)\nOther assets\n(\n5,046\n)\n(\n2,143\n)\n(\n1,397\n)\nAccounts payable\n707\n \n664\n \n359\n \nAccrued expenses and other liabilities\n3,915\n \n3,937\n \n(\n1,161\n)\nAccrued revenue share\n(\n445\n)\n482\n \n1,059\n \nDeferred revenue\n367\n \n525\n \n1,043\n \nNet cash provided by operating activities\n91,495\n \n101,746\n \n125,299\n \nInvesting activities\nPurchases of property and equipment\n(\n31,485\n)\n(\n32,251\n)\n(\n52,535\n)\nPurchases of marketable securities\n(\n78,874\n)\n(\n77,858\n)\n(\n86,679\n)\nMaturities and sales of marketable securities\n97,822\n \n86,672\n \n103,428\n \nPurchases of non-marketable securities\n(\n2,531\n)\n(\n3,027\n)\n(\n5,034\n)\nMaturities and sales of non-marketable securities\n150\n \n947\n \n882\n \nAcquisitions, net of cash acquired, and purchases of intangible assets\n(\n6,969\n)\n(\n495\n)\n(\n2,931\n)\nOther investing activities\n1,589\n \n(\n1,051\n)\n(\n2,667\n)\nNet cash used in investing activities\n(\n20,298\n)\n(\n27,063\n)\n(\n45,536\n)\nFinancing activities\nNet payments related to stock-based award activities\n(\n9,300\n)\n(\n9,837\n)\n(\n12,190\n)\nRepurchases of stock\n(\n59,296\n)\n(\n61,504\n)\n(\n62,222\n)\nDividend payments\n0\n \n0\n \n(\n7,363\n)\nProceeds from issuance of debt, net of costs\n52,872\n \n10,790\n \n13,589\n \nRepayments of debt\n(\n54,068\n)\n(\n11,550\n)\n(\n12,701\n)\nProceeds from sale of interest in consolidated entities, net\n35\n \n8\n \n1,154\n \nNet cash used in financing activities\n(\n69,757\n)\n(\n72,093\n)\n(\n79,733\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n506\n)\n(\n421\n)\n(\n612\n)\nNet increase (decrease) in cash and cash equivalents\n934\n \n2,169\n \n(\n582\n)\nCash and cash equivalents at beginning of period\n20,945\n \n21,879\n \n24,048\n \nCash and cash equivalents at end of period\n$\n21,879\n \n$\n24,048\n \n$\n23,466\n \nSee accompanying notes.\n56.  \nTable of Contents\nAlphabet Inc.\nAlphabet Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1.    \nSummary of Significant Accounting Policies\nNature of Operations\nGoogle was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google.\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices.\nBasis of Consolidation\nThe consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated.\nUse of Estimates\nPreparation of consolidated financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates due to uncertainties. On an ongoing basis, we evaluate our estimates, including those related to the allowance for credit losses; contingent liabilities; fair values of financial instruments and goodwill; income taxes; inventory; and useful lives of property and equipment, among others. We base our estimates on assumptions, both historical and forward looking, that are believed to be reasonable, and the results of which form the basis for making judgments about the carrying values of assets and liabilities.\nRevenue Recognition\nRevenues are recognized when control of the promised goods or services is transferred to our customers, and the collectibility of an amount that we expect in exchange for those goods or services is probable. Sales and other similar taxes are excluded from revenues. \nAdvertising Revenues\nWe generate advertising revenues primarily by delivering advertising on:\n•\nGoogle Search and other properties, including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc. and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\n•\nYouTube properties; and\n•\nGoogle Network properties, including revenues from Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nOur customers generally purchase advertising inventory through Google Ads, Google Ad Manager, Google Display & Video 360, and Google Marketing Platform, among others.\nWe offer advertising by delivering both performance and brand advertising. We recognize revenues for performance advertising when a user engages with the advertisement. For brand advertising, we recognize revenues when the ad is displayed, or a user views the ad.\nFor ads placed on Google Network properties, we evaluate whether we are the principal (i.e., report revenues on a gross basis) or agent (i.e., report revenues on a net basis). Generally, we report advertising revenues for ads placed on Google Network properties on a gross basis, that is, the amounts billed to our customers are recorded as revenues, and amounts paid to Google Network partners are recorded as cost of revenues. Where we are the principal, we control the advertising inventory before it is transferred to our customers. Our control is evidenced by our sole ability to monetize the advertising inventory before it is transferred to our customers and is further supported by us being primarily responsible to our customers and having a level of discretion in establishing pricing.\nGoogle Subscriptions, Platforms, and Devices\nGoogle subscriptions, platforms, and devices revenues consist of revenues from:\n57.  \nTable of Contents\nAlphabet Inc.\n•\nconsumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n•\nplatforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n•\ndevices, which primarily include sales of the Pixel family of devices; and\n•\nother products and services.\nSubscription revenues are recognized ratably over the period of the subscription, primarily monthly. We report revenues from Google Play sales of apps and in-app purchases on a net basis because our performance obligation is to facilitate a transaction between app developers and end users for which we earn a service fee. \nGoogle Cloud Revenues\nGoogle Cloud revenues consist of revenues from:\n•\nGoogle Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini for Google Cloud; cybersecurity; and data and analytics;\n•\nGoogle Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and\n•\nother enterprise services.\nOur cloud services are generally provided on either a consumption or subscription basis and may have contract terms longer than a year. Revenues related to cloud services provided on a consumption basis are recognized when the customer utilizes the services, based on the quantity of services consumed. Revenues related to cloud services provided on a subscription basis are recognized ratably over the contract term as the customer receives and consumes the benefits of the cloud services.\nArrangements with Multiple Performance Obligations\nOur contracts with customers may include multiple performance obligations. For such arrangements, we allocate revenues to each performance obligation based on its relative standalone selling price. We generally determine standalone selling prices based on the prices charged to customers.\nCustomer Incentives and Credits\nCertain customers receive cash-based incentives or credits, which are accounted for as variable consideration. We estimate these amounts based on the expected amount to be provided to customers and reduce revenues. We believe that there will not be significant changes to our estimates of variable consideration related to customer incentives and credits.\nSales Commissions\nWe expense sales commissions when incurred when the period of the expected benefit is one year or less. We recognize an asset for certain sales commissions and amortize if the expected benefit period is greater than one year. These costs are recorded within sales and marketing expenses.\nCost of Revenues\nCost of revenues consists of TAC and other costs of revenues.\n•\nTAC includes:\n◦\namounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\n◦\namounts paid to Google Network partners primarily for ads displayed on their properties.\n•\nOther cost of revenues includes:\n◦\ncontent acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\n◦\ndepreciation expense related to our technical infrastructure;\n58.  \nTable of Contents\nAlphabet Inc.\n◦\nemployee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\n◦\ninventory and other costs related to the devices we sell; and\n◦\nother technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nSoftware Development Costs\nWe expense software development costs, including costs to develop software products or the software component of products to be sold, leased, or marketed to external users, before technological feasibility is reached. Technological feasibility is typically reached shortly before the release of such products. As a result, development costs that meet the criteria for capitalization were not material for the periods presented.\nSoftware development costs also include costs to develop software to be used solely to meet internal needs and cloud-based applications used to deliver our services. We capitalize development costs related to these software applications once the preliminary project stage is complete and it is probable that the project will be completed and the software will be used to perform the function intended. Costs capitalized for developing such software applications were not material for the periods presented.\nStock-based Compensation\nStock-based compensation (SBC) primarily consists of Alphabet restricted stock units (RSUs). RSUs are equity classified and measured at the fair market value of the underlying stock at the grant date. We recognize RSU expense using the straight-line attribution method over the requisite service period and account for forfeitures as they occur. RSUs are awarded dividend equivalents, which are subject to the same vesting conditions as the underlying award, and settled in Class C shares.\nFor RSUs, shares are issued on the vesting dates net of the applicable statutory income tax withholding to be paid by us on behalf of our employees. As a result, fewer shares are issued than the number of RSUs outstanding, and the income tax withholding is recorded as a reduction to additional paid-in capital.\nAdditionally, SBC includes other stock-based awards, such as performance stock units (PSUs) that include market conditions and awards that may be settled in cash or the stock of certain Other Bet companies. PSUs and certain awards granted by Other Bet companies are equity classified and expense is recognized over the requisite service period. Certain awards granted by Other Bet companies are liability classified and remeasured at fair value through settlement. The fair value of awards granted by Other Bet companies is based on the equity valuation of the respective Other Bet company.\nAdvertising and Promotional Expenses\nWe expense advertising and promotional costs in the period in which they are incurred.\n For the years ended \nDecember 31, 2022\n, 2023, and 2024, advertising and promotional expenses totaled approximately $\n9.2\n billion, $\n8.7\n billion, and $\n8.7\n billion, respectively.\nPerformance Fees\nPerformance fees refer to compensation arrangements with payouts based on realized returns from certain investments. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs. Performance fees are recorded as a component of OI&E.\nFair Value Measurements \nFair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. Assets and liabilities recorded at fair value are measured and classified in accordance with a three-tier fair value hierarchy based on the observability of the inputs available in the market used to measure fair value:\nLevel 1 - Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2 - Inputs that are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be derived from observable market data. Where applicable, \n59.  \nTable of Contents\nAlphabet Inc.\nthese models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, foreign exchange rates, and credit ratings.\nLevel 3 - Unobservable inputs that are supported by little or no market activities.\nThe fair value hierarchy requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The determination of fair value involves the use of appropriate valuation methods and relevant inputs into valuation models.\nOur financial assets and liabilities that are measured at fair value on a recurring basis include cash equivalents, marketable securities, derivative financial instruments, and certain non-marketable debt securities. Our financial assets measured at fair value on a nonrecurring basis include non-marketable equity securities. Other financial assets and liabilities are carried at cost with fair value disclosed, if required.\nWe measure certain other instruments, and certain assets and liabilities acquired in a business combination, also at fair value on a nonrecurring basis.\nFinancial Instruments\nOur financial instruments include cash, cash equivalents, marketable and non-marketable securities, derivative financial instruments, accounts receivable, and convertible notes.\nCredit Risks\nWe are subject to credit risk primarily from cash equivalents, marketable debt securities, derivative financial instruments, including foreign exchange contracts, accounts receivable, and convertible notes. We manage our credit risk exposure through timely assessment of our counterparty creditworthiness, credit limits, and use of collateral management. Foreign exchange contracts are transacted with various financial institutions with high credit standing. Accounts receivable are typically unsecured and are derived from revenues earned from customers located around the world. We manage our credit risk exposure by performing ongoing evaluations to determine customer credit and we limit the amount of credit we extend. We generally do not require collateral from our customers.\nCash Equivalents\nWe invest excess cash primarily in asset-backed and mortgage-backed securities, corporate debt securities, government bonds, money market funds, and time deposits.\nMarketable Securities\nWe classify all marketable debt securities that have effective maturities of three months or less from the date of purchase as cash equivalents and those with effective maturities of greater than three months as marketable securities on our Consolidated Balance Sheets. We determine the appropriate classification of our investments in marketable debt securities at the time of purchase and reevaluate such designation at each balance sheet date. We have classified and accounted for our marketable debt securities as available-for-sale. After consideration of our risk versus reward objectives, as well as our liquidity requirements, we may sell these debt securities prior to their effective maturities. As we view these securities as available to support current operations, we classify highly liquid securities with maturities beyond 12 months as current assets under the caption marketable securities on the Consolidated Balance Sheets. We carry these securities at fair value, and report the unrealized gains and losses, net of taxes, as a component of stockholders’ equity, except for the changes in allowance for expected credit losses, which are recorded in OI&E. For certain marketable debt securities we have elected the fair value option, for which changes in fair value are recorded in OI&E. We determine any realized gains and losses on the sale of marketable debt securities on a specific identification method, and we record such gains and losses as a component of OI&E.\nOur investments in marketable equity securities are measured at fair value with the related gains and losses, including unrealized, recognized in OI&E. We classify our marketable equity securities subject to long-term lock-up restrictions beyond 12 months as other non-current assets on the Consolidated Balance Sheets.\nNon-Marketable Securities\nNon-marketable securities primarily consist of equity securities. We account for non-marketable equity securities through which we exercise significant influence but do not have control over the investee under the equity method. Other non-marketable equity securities that we hold are primarily accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost, less any impairment, plus or minus changes resulting from observable price changes in orderly transactions for identical or similar investments of the same issuer. Adjustments are determined primarily based on a market approach as of the transaction date and are recorded as a component of OI&E.\n60.  \nTable of Contents\nAlphabet Inc.\nNon-marketable securities that do not have effective contractual maturity dates are classified as other non-current assets on the Consolidated Balance Sheets.\nDerivative Financial Instruments\nSee Note 3 for the accounting policy pertaining to derivative financial instruments. \nAccounts Receivable\nOur payment terms for accounts receivable vary by the types and locations of our customers and the products or services offered. The term between invoicing and when payment is due is not significant. For certain products or services and customers, we require payment before the products or services are delivered to the customer. Additionally, accounts receivable includes amounts for services performed in advance of the right to invoice the customer.\nWe maintain an allowance for credit losses for accounts receivable, which is recorded as an offset to accounts receivable, and changes in such are classified as general and administrative expense in the Consolidated Statements of Income. We assess collectibility by reviewing accounts receivable on a collective basis where similar characteristics exist and on an individual basis when we identify specific customers with known disputes or collectibility issues. In determining the amount of the allowance for credit losses, we consider historical collectibility based on past due status and make judgments about the creditworthiness of customers based on ongoing credit evaluations. We also consider customer-specific information, current market conditions, and reasonable and supportable forecasts of future economic conditions.\nConvertible Notes\nOur investments in convertible notes are primarily recorded at amortized cost which includes unpaid principal balances, deferred origination costs, and any related discount or premium, net of allowances for credit losses, and are included within other non-current assets on our Consolidated Balance Sheets.\nOther\nOur financial instruments also include debt and equity investments in companies with which we also entered into commercial arrangements at or near the same time. For these transactions, judgment is required in assessing the substance of the arrangements, including assessing whether the components of the arrangements should be accounted for as separate transactions under the applicable GAAP, and determining the value of the components of the arrangements, including the fair value of the investments. Additionally, if our investment in such companies becomes impaired, we may need to re-evaluate the accounting for the commercial arrangement, including reducing any remaining performance obligations.\nImpairment of Investments\nWe periodically review our debt and non-marketable equity securities for impairment. \nFor debt securities in an unrealized loss position, we determine whether a credit loss exists. The credit loss is estimated by considering available information relevant to the collectibility of the security and information about past events, current conditions, and reasonable and supportable forecasts. Any credit loss is recorded as a charge to OI&E, not to exceed the amount of the unrealized loss. Unrealized losses other than the credit loss are recognized in AOCI. If we have an intent to sell, or if it is more likely than not that we will be required to sell a debt security in an unrealized loss position before recovery of its amortized cost basis, we will write down the security to its fair value and record the corresponding charge as a component of OI&E.\nFor non-marketable equity securities, including equity method investments, we consider whether impairment indicators exist by evaluating the companies' financial and liquidity position and access to capital resources, among other indicators. If the assessment indicates that the investment is impaired, we write down the investment to its fair value by recording the corresponding charge as a component of OI&E. We prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach.\nInventory\nInventory consists primarily of finished goods and is stated at the lower of cost and net realizable value. Cost is computed using the first-in, first-out method.\nVariable Interest Entities\nWe determine at the inception of each arrangement whether an entity in which we have made an investment or in which we have other variable interests is considered a variable interest entity (VIE). We consolidate VIEs when we are \n61.  \nTable of Contents\nAlphabet Inc.\nthe primary beneficiary. We are the primary beneficiary of a VIE when we have the power to direct activities that most significantly affect the economic performance of the VIE and have the obligation to absorb the majority of their losses or benefits. If we are not the primary beneficiary in a VIE, we account for the investment or other variable interests in a VIE in accordance with applicable GAAP.\nPeriodically, we assess whether any changes in our interest or relationship with the entity affect our determination of whether the entity is a VIE and, if so, whether we are the primary beneficiary. \nProperty and Equipment\nProperty and equipment is comprised of technical infrastructure, office space, corporate and other assets currently in service, and assets not yet in service. Technical infrastructure includes data center land, buildings and leasehold improvements, and servers and network equipment. Office space includes office land, buildings and leasehold improvements. Assets not yet in service are those that are not ready for our intended use, including data center buildings and servers in the process of construction or assembly. \nProperty and equipment are stated at cost less accumulated depreciation. Depreciation commences once assets are ready for our intended use and is recorded using the straight-line method over the estimated useful lives of the assets, which we regularly evaluate for factors such as technological obsolescence and our planned use and utilization. We depreciate data center and office buildings over periods of \nseven\n to \n40\n years. We depreciate servers and network equipment generally over a period of \nsix years\n. We depreciate corporate and other assets over periods of \ntwo\n to \n25\n years. We depreciate leasehold improvements over the shorter of the remaining lease term or the estimated useful lives of the assets. Land is not depreciated.\n \nGoodwill\nWe allocate goodwill to reporting units based on the expected benefit from the business combination. We evaluate our reporting units periodically, as well as when changes in our operating segments occur. For changes in reporting units, we reassign goodwill using a relative fair value allocation approach. We test our goodwill for impairment at least annually, or more frequently if events or changes in circumstances indicate that the asset may be impaired. Goodwill impairments were \nno\nt material for the periods presented.\nLeases\nWe determine if an arrangement is a lease at inception. Our lease agreements generally contain lease and non-lease components. Payments under our lease arrangements are primarily fixed. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities.\nCertain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These amounts primarily include payments affected by the Consumer Price Index, and payments for maintenance and utilities.\nLease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is our incremental borrowing rate, because the interest rate implicit in our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in economic environments where the leased asset is located. Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancelable, lease term when determining the lease assets and liabilities. Lease assets also include any prepaid lease payments and lease incentives.\nLease assets and liabilities are included on our Consolidated Balance Sheets. The current portion of our operating lease liabilities is included in accrued expenses and other current liabilities, and the long-term portion is included in operating lease liabilities. Finance lease assets are included in property and equipment, net. Finance lease liabilities are included in accrued expenses and other current liabilities or other long-term liabilities.\nOperating lease expense (excluding variable lease costs) is recognized on a straight-line basis over the lease term. Finance lease expense is recognized on a straight-line basis over the shorter of the lease term or the useful life of the asset, and interest expense is recognized based on the incremental borrowing rate.\nImpairment of Long-Lived Assets\nWe review leases, property and equipment, and intangible assets, excluding goodwill, for impairment when events or changes in circumstances indicate the carrying amount may not be recoverable. The evaluation is performed \n62.  \nTable of Contents\nAlphabet Inc.\nat the lowest level of identifiable cash flows independent of other assets. We measure recoverability of these assets by comparing the carrying amounts to the future undiscounted cash flows that the assets or the asset group are expected to generate. If the carrying value of the assets or asset group is not recoverable, the impairment recognized is measured as the amount by which the carrying value exceeds its fair value.\nIncome Taxes\nWe account for income taxes using the asset and liability method, under which we recognize the amount of taxes payable or refundable for the current year and deferred tax assets and liabilities for the future tax consequences of events that have been recognized in our financial statements or tax returns. We measure current and deferred tax assets and liabilities based on provisions of enacted tax law. We evaluate the likelihood of future realization of our deferred tax assets based on all available evidence and establish a valuation allowance to reduce deferred tax assets when it is more likely than not that they will not be realized or release a valuation allowance to increase deferred tax assets when it is more likely than not that they will be realized. We have elected to account for the tax effects of the global intangible low tax income provision as a current period expense.\nWe recognize the financial statement effects of a tax position when it is more likely than not that, based on technical merits, the position will be sustained upon examination. The tax benefits of the position recognized in the financial statements are then measured based on the largest amount of benefit that is greater than 50% likely to be realized upon settlement with a taxing authority. In addition, we recognize interest and penalties related to unrecognized tax benefits as a component of the income tax provision.\nBusiness Combinations\nWe include the results of operations of the businesses that we acquire as of the acquisition date. We allocate the purchase price of the acquisitions to the assets acquired and liabilities assumed based on their estimated fair values, except for revenue contracts acquired, which are recognized in accordance with our revenue recognition policy. The excess of the purchase price over the fair values of identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred.\nForeign Currency\nWe translate the financial statements of our international subsidiaries to U.S. dollars using month-end exchange rates for assets and liabilities, and average rates for the period derived from month-end exchange rates for revenues, costs, and expenses. We record translation gains and losses in AOCI as a component of stockholders’ equity. We reflect net foreign exchange transaction gains and losses resulting from the conversion of the transaction currency to functional currency as a component of foreign currency exchange gain (loss) in OI&E.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard can be applied either prospectively or retrospectively. We will adopt the standard in our 2025 annual period and are currently assessing the effect that the updated standard will have on our financial statement disclosures.\nIn November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures.\nRecently Adopted Accounting Pronouncements\nIn November 2023, the FASB issued ASU No. 2023-07 “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures” which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. We adopted this ASU for our 2024 annual period with the comparative periods updated to reflect additional disclosures. See Note 15 for further details.\nPrior Period Reclassifications\nCertain amounts in prior periods have been reclassified to conform with current period presentation.\n63.  \nTable of Contents\nAlphabet Inc.\nNote 2.    \nRevenues \nDisaggregated Revenues\nThe following table presents revenues disaggregated by type (in millions):\nYear Ended December 31,\n2022\n2023\n2024\nGoogle Search & other\n$\n162,450\n \n$\n175,033\n \n$\n198,084\n \nYouTube ads\n29,243\n \n31,510\n \n36,147\n \nGoogle Network\n32,780\n \n31,312\n \n30,359\n \nGoogle advertising\n224,473\n \n237,855\n \n264,590\n \nGoogle subscriptions, platforms, and devices\n29,055\n \n34,688\n \n40,340\n \nGoogle Services total\n253,528\n \n272,543\n \n304,930\n \nGoogle Cloud\n26,280\n \n33,088\n \n43,229\n \nOther Bets\n1,068\n \n1,527\n \n1,648\n \nHedging gains (losses)\n1,960\n \n236\n \n211\n \nTotal revenues\n$\n282,836\n \n$\n307,394\n \n$\n350,018\n \nNo in\ndividual customer or groups of affiliated customers represented more than 10% of our revenues in 2022, 2023, or 2024. \nThe following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions):\nYear Ended December 31,\n \n2022\n2023\n2024\nUnited States\n$\n134,814\n \n48\n \n%\n$\n146,286\n \n47\n \n%\n$\n170,447\n \n49\n \n%\nEMEA\n(1)\n82,062\n \n29\n \n91,038\n \n30\n \n102,127\n \n29\n \nAPAC\n(1)\n47,024\n \n16\n \n51,514\n \n17\n \n56,815\n \n16\n \nOther Americas\n(1)\n16,976\n \n6\n \n18,320\n \n6\n \n20,418\n \n6\n \nHedging gains (losses)\n1,960\n \n1\n \n236\n \n0\n \n211\n \n0\n \nTotal revenues\n$\n282,836\n \n100\n \n%\n$\n307,394\n \n100\n \n%\n$\n350,018\n \n100\n \n%\n(1)\n    \nRegions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\").\nRevenue Backlog\nAs of December 31, 2024, we had $\n93.2\n billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog represents commitments in customer contracts for future services that have not yet been recognized as revenue. We expect to recognize approximately half of the revenue backlog as revenues over the next \n24\n months with the remainder to be recognized thereafter. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts.\nDeferred Revenues\nWe record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google subscriptions, platforms, and devices.\n Total deferred revenue as of December 31, 2023 was $\n5.0\n billion, of which $\n3.9\n billion was recognized as revenues for the year ended December 31, 2024. Total deferred revenue as of December 31, 2024 was $\n6.0\n billion.\n \nNote 3.    \nFinancial Instruments\n \n64.  \nTable of Contents\nAlphabet Inc.\nFair Value Measurements\nInvestments Measured at Fair Value on a Recurring Basis\nCash, cash equivalents, and marketable equity securities are measured at fair value and classified within Level 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets.\nDebt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts.\nThe following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions):\nAs of December 31, 2023\nFair Value Hierarchy\nAdjusted Cost\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nCash and Cash Equivalents\nMarketable Securities\nFair value changes recorded in other comprehensive income\nTime deposits\nLevel 2\n$\n2,628\n \n$\n0\n \n$\n0\n \n$\n2,628\n \n$\n2,628\n \n$\n0\n \nGovernment bonds\nLevel 2\n38,106\n233\n \n(\n679\n)\n37,660\n \n1,993\n \n35,667\n \nCorporate debt securities\nLevel 2\n22,457\n112\n \n(\n637\n)\n21,932\n \n0\n \n21,932\n \nMortgage-backed and asset-backed securities\nLevel 2\n17,243\n88\n \n(\n634\n)\n16,697\n \n0\n \n16,697\n \nTotal investments with fair value change reflected in other comprehensive income\n(1)\n80,434\n \n433\n \n(\n1,950\n)\n78,917\n \n4,621\n \n74,296\n \nFair value adjustments recorded in net income\nMoney market funds\nLevel 1\n6,480\n \n6,480\n \n0\n \nCurrent marketable equity securities\n(2)\nLevel 1\n4,282\n \n0\n \n4,282\n \nMutual funds\nLevel 2\n311\n \n0\n \n311\n \nGovernment bonds\nLevel 2\n1,952\n \n347\n \n1,605\n \nCorporate debt securities\nLevel 2\n3,782\n \n91\n \n3,691\n \nMortgage-backed and asset-backed securities\nLevel 2\n2,683\n \n0\n \n2,683\n \nTotal investments with fair value change recorded in net income\n19,490\n \n6,918\n \n12,572\n \nCash\n0 \n12,509\n \n0 \nTotal\n$\n80,434\n \n$\n433\n \n$\n(\n1,950\n)\n$\n98,407\n \n$\n24,048\n \n$\n86,868\n \n(1)\nRepresents gross unrealized gains and losses for debt securities recorded to AOCI.\n(2)\nThe long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $\n1.4\n billion as of December 31, 2023 is included within other non-current assets.\n65.  \nTable of Contents\nAlphabet Inc.\nAs of December 31, 2024\nFair Value Hierarchy\nAdjusted Cost\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nCash and Cash Equivalents\nMarketable Securities\nFair value changes recorded in other comprehensive income\nTime deposits\nLevel 2\n$\n2,217\n \n$\n0\n \n$\n0\n \n$\n2,217\n \n$\n2,081\n \n$\n136\n \nGovernment bonds\nLevel 2\n27,551\n \n83\n \n(\n214\n)\n27,420\n \n50\n \n27,370\n \nCorporate debt securities\nLevel 2\n18,300\n \n79\n \n(\n222\n)\n18,157\n \n0\n \n18,157\n \nMortgage-backed and asset-backed securities\nLevel 2\n14,437\n \n63\n \n(\n385\n)\n14,115\n \n0\n \n14,115\n \nTotal investments with fair value change reflected in other comprehensive income\n(1)\n62,505\n \n225\n \n(\n821\n)\n61,909\n \n2,131\n \n59,778\n \nFair value adjustments recorded in net income\nMoney market funds\nLevel 1\n$\n8,154\n \n$\n8,154\n \n$\n0\n \nCurrent marketable equity securities\n(2)\nLevel 1\n4,708\n0\n \n4,708\nMutual funds\nLevel 2\n105\n0\n \n105\nGovernment bonds\nLevel 2\n2,035\n696\n \n1,339\nCorporate debt securities\nLevel 2\n3,037\n78\n \n2,959\nMortgage-backed and asset-backed securities\nLevel 2\n3,302\n0\n \n3,302\nTotal investments with fair value change recorded in net income\n21,341\n \n8,928\n \n12,413\n \nCash\n0 \n12,407\n \n0 \nTotal\n$\n62,505\n \n$\n225\n \n$\n(\n821\n)\n$\n83,250\n \n$\n23,466\n \n$\n72,191\n \n(1)\nRepresents gross unrealized gains and losses for debt securities recorded to AOCI.\n(2)\nThe long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $\n266\n million as of December 31, 2024 is included within other non-current assets.\nInvestments Measured at Fair Value on a Nonrecurring Basis\nOur non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy. Non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. Our valuation methods include option pricing models, market comparable approach, and common stock equivalent method, which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, expected time to exit, risk free rate, and the rights and obligations of the securities we hold. These inputs vary significantly based on investment type.\nAs of December 31, 2024, the carrying value of our non-marketable equity securities was $\n35.5\n billion, of which $\n19.9\n billion were remeasured at fair value during the year ended December 31, 2024, and were primarily classified within Level 2 of the fair value hierarchy at the time of measurement.\nDebt Securities\nThe following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions):\n66.  \nTable of Contents\nAlphabet Inc.\nAs of\nDecember 31, 2024\nDue in 1 year or less\n$\n6,341\n \nDue in 1 year through 5 years\n37,221\n \nDue in 5 years through 10 years\n10,920\n \nDue after 10 years\n12,896\n \nTotal\n$\n67,378\n \nThe following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions):\n \nAs of December 31, 2023\n \nLess than 12 Months\n12 Months or Greater\nTotal\n \nFair Value\nUnrealized\nLoss\nFair Value\nUnrealized\nLoss\nFair Value\nUnrealized\nLoss\nGovernment bonds\n$\n1,456\n \n$\n(\n22\n)\n$\n13,897\n \n$\n(\n657\n)\n$\n15,353\n \n$\n(\n679\n)\nCorporate debt securities\n827\n \n(\n5\n)\n15,367\n \n(\n592\n)\n16,194\n \n(\n597\n)\nMortgage-backed and asset-backed securities\n2,945\n \n(\n26\n)\n7,916\n \n(\n608\n)\n10,861\n \n(\n634\n)\nTotal\n$\n5,228\n \n$\n(\n53\n)\n$\n37,180\n \n$\n(\n1,857\n)\n$\n42,408\n \n$\n(\n1,910\n)\n \nAs of December 31, 2024\n \nLess than 12 Months\n12 Months or Greater\nTotal\n \nFair Value\nUnrealized\nLoss\nFair Value\nUnrealized\nLoss\nFair Value\nUnrealized\nLoss\nGovernment bonds\n$\n11,119\n \n$\n(\n126\n)\n$\n2,576\n \n$\n(\n88\n)\n$\n13,695\n \n$\n(\n214\n)\nCorporate debt securities\n4,228\n \n(\n17\n)\n6,838\n \n(\n168\n)\n11,066\n \n(\n185\n)\nMortgage-backed and asset-backed securities\n5,222\n \n(\n106\n)\n3,813\n \n(\n279\n)\n9,035\n \n(\n385\n)\nTotal\n$\n20,569\n \n$\n(\n249\n)\n$\n13,227\n \n$\n(\n535\n)\n$\n33,796\n \n$\n(\n784\n)\nWe determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method. \nThe following table summarizes gains and losses for debt securities, reflected as a component of OI&E (in millions):    \nYear Ended December 31,\n \n2022\n2023\n2024\nUnrealized gain (loss) on fair value option debt securities\n$\n(\n557\n)\n$\n386\n \n$\n30\n \nGross realized gain on debt securities\n103\n \n182\n \n482\n \nGross realized loss on debt securities\n(\n1,588\n)\n(\n1,833\n)\n(\n1,553\n)\n(Increase) decrease in allowance for credit losses\n(\n22\n)\n50\n \n(\n2\n)\nTotal gain (loss) on debt securities recognized in other income (expense), net\n$\n(\n2,064\n)\n$\n(\n1,215\n)\n$\n(\n1,043\n)\nEquity Investments\nThe carrying value of equity securities is measured as the total initial cost plus the cumulative net gain (loss). Gains and losses, including impairments, are included as a component of OI&E in the Consolidated Statements of Income. See\n Note 7 for further details on OI&E.\n Certain of our non-marketable equity securities include our investments in VIE where we are not the primary beneficiary. See Note 5 for further details on VIE.\nThe carrying values for marketable and non-marketable equity securities are summarized below (in millions):\n67.  \nTable of Contents\nAlphabet Inc.\nAs of December 31, 2023\nAs of December 31, 2024\nMarketable Equity Securities\nNon-Marketable Equity Securities\nTotal\nMarketable Equity Securities\nNon-Marketable Equity Securities\nTotal\nTotal initial cost\n$\n5,418\n \n$\n17,616\n \n$\n23,034\n \n$\n4,767\n \n$\n21,240\n \n$\n26,007\n \nCumulative net gain (loss)\n(1)\n555\n \n11,150\n \n11,705\n \n312\n \n14,291\n \n14,603\n \nCarrying value\n$\n5,973\n \n$\n28,766\n \n$\n34,739\n \n$\n5,079\n \n$\n35,531\n \n$\n40,610\n \n(1)\nNon-marketable equity securities cumulative net gain (loss) is comprised of $\n18.1\n billion and $\n22.7\n billion of gains and $\n6.9\n billion and $\n8.4\n billion of losses (including impairments) as of December 31, 2023 and 2024, respectively.\n \nGains and Losses on Marketable and Non-marketable Equity Securities\nGains and losses (including impairments), net, for marketable and non-marketable equity securities included in OI&E are summarized below (in millions):\nYear Ended December 31,\n \n2022\n2023\n2024\nRealized net gain (loss) on equity securities sold during the period\n$\n(\n442\n)\n$\n690\n \n$\n186\n \nUnrealized net gain (loss) on marketable equity securities\n(\n3,242\n)\n790\n \n156\n \nUnrealized net gain (loss) on non-marketable equity securities\n(1)\n229\n \n(\n1,088\n)\n3,372\n \nTotal gain (loss) on equity securities in other income (expense), net\n$\n(\n3,455\n)\n$\n392\n \n$\n3,714\n \n(1)\nUnrealized gain (loss) on non-marketable equity securities accounted for under the measurement alternative is comprised of $\n3.3\n billion, $\n1.8\n billion, and $\n5.6\n billion of upward adjustments and $\n3.0\n billion, $\n2.9\n billion, and $\n2.2\n billion of downward adjustments (including impairments) for the years ended December 31, 2022, 2023, and 2024, respectively.\nIn the table above, realized net gain (loss) on equity securities sold during the period reflects the difference between the sale proceeds and the carrying value of the equity securities at the beginning of the period or the purchase date, if later. \nCumulative net gains (losses) on equity securities sold during the period, which is summarized in the following table (in millions), represents the total net gains (losses) recognized after the initial purchase date of the equity security sold during the period. While these net gains (losses) may have been reflected in periods prior to the period of sale, we believe they are important supplemental information as they reflect the economic net gains (losses) on the securities sold during the period. Cumulative net gains (losses) are calculated as the difference between the sale price and the initial purchase price for the equity security sold during the period.\n \n2023\n2024\nTotal sale price\n$\n1,981\n \n$\n2,827\n \nTotal initial cost\n1,512\n \n2,079\n \nCumulative net gains (losses)\n$\n469\n \n$\n748\n \nEquity Securities Accounted for Under the Equity Method\nAs of \nDecember 31, 2023\n and 2024, equity securities accounted for under the equity method had a carrying value of approximately $\n1.7\n billion and $\n2.0\n billion, respectively. Our share of gains and losses, including impairments, are included as a component of OI&E, in the Consolidated Statements of Income. See Note 7 for further details on OI&E.\n \nCertain of our equity method securities include our investments in VIEs where we are not the primary beneficiary. See Note 4 for further details on VIEs.\nConvertible Notes\nAs of December 31, 2023 and \nDecember 31, 2024\n, we had investments in convertible notes of $\n921\n million and $\n2.9\n billion, respectively, the majority of which are convertible notes held for investment. \nOur convertible notes held for investment are recorded at amortized cost which includes unpaid principal balances, deferred origination costs, and any related discount or premium, net of allowances for credit losses, and are included within other non-current assets on our Consolidated Balance Sheets.\n68.  \nTable of Contents\nAlphabet Inc.\nDerivative Financial Instruments\nWe use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nWe recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation.\nCash Flow Hedges\nWe designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have maturities of \n24\n months or less.\nCash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI.\nAs of \nDecember 31, 2024\n, the net accumulated gain on our foreign currency cash flow hedges before tax effect was $\n731\n million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nFair Value Hedges\nWe designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nNet Investment Hedges\nWe designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nOther Derivatives\nWe enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and liabilities.\nWe also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, and credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details. \n69.  \nTable of Contents\nAlphabet Inc.\nThe gross notional amounts of outstanding derivative instruments were as follows (in millions):\nAs of December 31,\n2023\n2024\nDerivatives designated as hedging instruments:\nForeign exchange contracts\nCash flow hedges  \n$\n18,039\n \n$\n20,315\n \nFair value hedges\n$\n2,065\n \n$\n1,562\n \nNet investment hedges\n$\n9,472\n \n$\n6,986\n \nDerivatives not designated as hedging instruments:\nForeign exchange contracts\n$\n39,722\n \n$\n44,227\n \nOther contracts\n$\n10,818\n \n$\n15,082\n \nThe fair values of outstanding derivative instruments were as follows (in millions):\n \nAs of December 31, 2023\nAs of December 31, 2024\n \nAssets\n(1)\nLiabilities\n(2)\nAssets\n(1)\nLiabilities\n(2)\nDerivatives designated as hedging instruments:\n     Foreign exchange contracts\n$\n205\n \n$\n242\n \n$\n1,054\n \n$\n0\n \nDerivatives not designated as hedging instruments:\n     Foreign exchange contracts\n134\n \n156\n \n200\n \n593\n \n     Other contracts\n114\n \n47\n \n474\n \n19\n \nTotal derivatives not designated as hedging instruments\n248\n \n203\n \n674\n \n612\n \nTotal\n$\n453\n \n$\n445\n \n$\n1,728\n \n$\n612\n \n(1)\n    Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets.\n(2)\n    Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets.\nThe gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions):\n \nYear Ended December 31,\n2022\n2023\n2024\nDerivatives in cash flow hedging relationship:\nForeign exchange contracts\nAmount included in the assessment of effectiveness\n$\n1,699\n \n$\n90\n \n$\n857\n \nAmount excluded from the assessment of effectiveness\n(\n188\n)\n84\n \n77\n \nDerivatives in net investment hedging relationship:\nForeign exchange contracts\nAmount included in the assessment of effectiveness\n608\n \n(\n287\n)\n223\n \nTotal\n$\n2,119\n \n$\n(\n113\n)\n$\n1,157\n \n70.  \nTable of Contents\nAlphabet Inc.\nThe table below presents the gains (losses) of our derivatives included in the Consolidated Statements of Income: (in millions):\nYear Ended December 31,\n2022\n2023\n2024\nRevenues\nOther income (expense), net\nRevenues\nOther income (expense), net\nRevenues\nOther income (expense), net\nTotal amounts included  in the Consolidated Statements of Income\n$\n282,836\n \n$\n(\n3,514\n)\n$\n307,394\n \n$\n1,424\n \n$\n350,018\n \n$\n7,425\n \nEffect of cash flow hedges:\nForeign exchange contracts\nAmount reclassified from AOCI to income\n$\n2,046\n \n$\n0\n \n$\n213\n \n$\n0\n \n$\n174\n \n$\n0\n \nAmount excluded from the assessment of effectiveness (amortized)\n(\n85\n)\n0\n \n24\n \n0\n \n37\n \n0\n \nEffect of fair value hedges:\nForeign exchange contracts\nHedged items\n0\n \n(\n162\n)\n0\n \n59\n \n0\n \n(\n59\n)\nDerivatives designated as hedging instruments\n0\n \n163\n \n0\n \n(\n59\n)\n0\n \n58\n \nAmount excluded from the assessment of effectiveness\n0\n \n16\n \n0\n \n15\n \n0\n \n13\n \nEffect of net investment hedges:\nForeign exchange contracts\nAmount excluded from the assessment of effectiveness\n0\n \n171\n \n0\n \n187\n \n0\n \n137\n \nEffect of non designated hedges:\nForeign exchange contracts\n0\n \n(\n395\n)\n0\n7\n \n0\n \n335\n \nOther contracts\n0\n \n144\n \n0\n \n53\n \n0\n \n174\n \nTotal gains (losses)\n$\n1,961\n \n$\n(\n63\n)\n$\n237\n \n$\n262\n \n$\n211\n \n$\n658\n \nOffsetting of Derivatives\nWe enter into master netting arrangements and collateral security arrangements to reduce credit risk. Cash collateral received related to derivative instruments under our collateral security arrangements are included in \nother current assets\n with a corresponding \nliability\n. Cash and non-cash collateral pledged related to derivative instruments under our collateral security arrangements are included in other current assets.\n71.  \nTable of Contents\nAlphabet Inc.\nThe gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions):\nAs of December 31, 2023\nGross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset\nGross Amounts Recognized\nGross Amounts Offset in the Consolidated Balance Sheets\nNet Amounts  Presented in the Consolidated Balance Sheets\nFinancial Instruments\n(1)\nCash and Non-Cash Collateral Received or Pledged\nNet Amounts\nDerivatives assets\n$\n535\n \n$\n(\n82\n)\n$\n453\n \n$\n(\n213\n)\n$\n(\n75\n)\n$\n165\n \nDerivatives liabilities\n$\n527\n \n$\n(\n82\n)\n$\n445\n \n$\n(\n213\n)\n$\n(\n16\n)\n$\n216\n \nAs of December 31, 2024\nGross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset\nGross Amounts\nRecognized\nGross Amounts Offset in the Consolidated Balance Sheets\nNet Amounts Presented in the Consolidated Balance Sheets\nFinancial Instruments\n(1)\nCash and Non-Cash Collateral Received or Pledged\nNet Amounts\nDerivatives assets\n$\n1,776\n \n$\n(\n48\n)\n$\n1,728\n \n$\n(\n516\n)\n$\n(\n721\n)\n$\n491\n \nDerivatives liabilities\n$\n660\n \n$\n(\n48\n)\n$\n612\n \n$\n(\n516\n)\n$\n(\n9\n)\n$\n87\n \n(1)\n    The balances as of December 31, 2023 and 2024 were related to derivatives allowed to be net settled in accordance with our master netting agreements.\nNote 4.        \nLeases \nWe have entered into operating and finance lease agreements primarily for data centers, land, and offices throughout the world with varying lease terms.\nComponents of lease costs were as follows (in millions):\nYear Ended December 31,\n2022\n2023\n2024\nOperating lease cost\n$\n2,900\n \n$\n3,362\n \n$\n3,304\n \nFinance lease cost:\nAmortization of lease assets\n474\n \n469\n \n413\n \nInterest on lease liabilities\n34\n \n35\n \n31\n \nFinance lease cost\n508\n \n504\n \n444\n \nVariable lease cost\n838\n \n1,182\n \n1,425\n \nTotal lease cost\n$\n4,246\n \n$\n5,048\n \n$\n5,173\n \nSupplemental balance sheet information related to leases was as follows (in millions):\nDecember 31,\n2023\n2024\nWeighted average remaining lease term\nOperating leases\n8.1\n years\n7.8\n years\nFinance leases\n10.7\n years\n10.4\n years\nWeighted average discount rate\nOperating leases\n3.1\n \n%\n3.4\n \n%\nFinance leases\n2.0\n \n%\n2.8\n \n%\n72.  \nTable of Contents\nAlphabet Inc.\nDecember 31,\n2023\n2024\nOperating leases:\nOperating lease assets\n$\n14,091\n \n$\n13,588\n \nAccrued expenses and other liabilities\n$\n2,791\n \n$\n2,887\n \nOperating lease liabilities\n12,460\n \n11,691\n \nTotal operating lease liabilities\n$\n15,251\n \n$\n14,578\n \nFinance Leases:\nProperty and equipment, at cost\n$\n4,403\n \n$\n4,622\n \nAccumulated depreciation\n(\n1,652\n)\n(\n2,037\n)\nProperty and equipment, net\n$\n2,751\n \n$\n2,585\n \nAccrued expenses and other liabilities\n$\n283\n \n$\n235\n \nOther long-term liabilities\n1,383\n \n1,442\n \nTotal finance lease liabilities\n$\n1,666\n \n$\n1,677\n \nSupplemental cash flow information related to leases was as follows (in millions):\nYear Ended December 31,\n2022\n2023\n2024\nCash payments for lease liabilities:\nOperating cash flows used for operating leases\n$\n2,722\n \n$\n3,173\n \n$\n3,425\n \nOperating cash flows used for finance leases\n$\n34\n \n$\n35\n \n$\n31\n \nFinancing cash flows used for finance leases\n(1)\n$\n586\n \n$\n705\n \n$\n405\n \nAssets obtained in exchange for lease liabilities:\nOperating leases\n$\n4,383\n \n$\n2,877\n \n$\n2,510\n \nFinance leases\n$\n577\n \n$\n564\n \n$\n313\n \n(1)\nFinancing cash flows used for financing leases are included within financing activities of the Consolidated Statements of Cash Flows as repayments of debt.\nFuture lease payments as of December 31, 2024 were as follows (in millions):\nOperating Leases\nFinance \nLeases\n2025\n$\n3,162\n \n$\n257\n \n2026\n2,824\n \n208\n \n2027\n2,311\n \n208\n \n2028\n1,838\n \n197\n \n2029\n1,448\n \n166\n \nThereafter\n5,455\n \n852\n \nTotal future lease payments\n17,038\n \n1,888\n \nLess imputed interest\n(\n2,460\n)\n(\n211\n)\nTotal lease liability balance\n$\n14,578\n \n$\n1,677\n \nAs of \nDecember 31, 2024\n, we have entered into leases that have not yet commenced with short-term and long-term future lease payments of $\n773\n million and $\n6.5\n billion, respectively, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2028 with non-cancelable lease terms between \none\n and \n25\n years.\nNote 5.        \nVariable Interest Entities \nConsolidated VIEs\n73.  \nTable of Contents\nAlphabet Inc.\nWe consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements.\n \nFor certain consolidated VIEs, their assets are not available to us, and their creditors do not have recourse to us. As of December 31, 2023 and 2024, assets that can only be used to settle obligations of these VIEs were $\n4.9\n billion and $\n8.7\n billion, respectively and are primarily included in cash and cash equivalents on our Consolidated Balance Sheets. As of December 31, 2023 and 2024, liabilities for which creditors only have recourse to the VIEs were $\n2.5\n billion and $\n2.3\n billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets.\nWaymo, a fully autonomous driving technology company and a consolidated VIE, received $\n5.6\n billion in funding during the year ended December 31, 2024, the majority of which was funded by Alphabet. Investments from external parties were accounted for as equity transactions and resulted in recognition of noncontrolling interests.\nAs of December 31, 2023 and 2024, total noncontrolling interests (NCI) in our consolidated subsidiaries were $\n3.4\n billion and $\n4.2\n billion, respectively, of which $\n1.1\n billion was redeemable noncontrolling interests (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included\n within the \"other\" component of OI&E. \nSee Note 7 for further details on OI&E.\nUnconsolidated VIEs\nWe have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources.\nWe have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments primarily as non-marketable equity securities or equity method investments, which are included within non-marketable securities on our Consolidated Balance Sheets. The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. As of December 31, 2023 and 2024, our future funding commitments related to unconsolidated VIE investments were $\n1.7\n billion and $\n1.5\n billion, respectively.\n \nNote 6.       \nDebt \nShort-Term Debt\nWe have a debt financing program of up to\n \n$\n10.0\n billion\n through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had\n \nno\n \nc\nommercial paper outstanding\n as of \nDecember 31, 2023 and $\n2.3\n billion of commercial paper outstanding with a weighted-average effective interest rate of \n4.4\n% as of \nDecember 31, 2024\n.The estimated fair value of the commercial paper approximated its carrying value as of \nDecember 31, 2024\nOur short-term debt balance also includes the current portion of certain long-term debt.\nLong-Term Debt\nTotal outstanding long-term debt is summarized below (in millions, except percentages):\nEffective Interest Rate\nAs of December 31,\nMaturity\nCoupon Rate\n2023\n2024\nDebt\n2014 Notes issuance\n2024\n3.38\n%\n3.38\n%\n$\n1,000\n \n$\n0\n \n2016 Notes issuance\n2026\n2.00\n%\n2.23\n%\n2,000\n \n2,000\n \n2020 Notes issuance\n2025 - 2060\n0.45\n% - \n2.25\n%\n0.57\n% - \n2.33\n%\n10,000\n \n10,000\n \n      Total face value of long-term debt\n13,000\n \n12,000\n \nUnamortized discount and debt issuance costs\n(\n130\n)\n(\n118\n)\nLess: Current portion of long-term notes\n(1)\n(\n1,000\n)\n(\n999\n)\n       Total long-term debt\n$\n11,870\n \n$\n10,883\n \n74.  \nTable of Contents\nAlphabet Inc.\n(1)\nTotal current portion of long-term debt is included within accrued expenses and other current liabilities. See Note 7 for further details.\nThe notes in the table above are fixed-rate senior unsecured obligations and rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually.\nThe total estimated fair value of the outstanding notes was approximately $\n10.3\n billion and \n$\n9.0\n billion\n as of December 31, 2023 and December 31, 2024, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy.\nAs of December 31, 2024, the future principal payments for long-term debt were as follows (in millions):\n2025\n$\n1,000\n \n2026\n2,000\n2027\n1,000\n2028\n0\n2029\n0\nThereafter\n8,000\nTotal\n$\n12,000\n \nCredit Facility\nAs of December 31, 2024, we had $\n10.0\n billion of revolving credit facilities, of which \n$\n4.0\n billion expires in April 2025 and $\n6.0\n billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goa\nls. \nNo\n amounts were outstanding under the credit facilities as of December 31, 2023 and 2024.\nNote 7.        \nSupplemental Financial Statement Information \nAccounts Receivable\nThe allowance for credit losses on accounts receivable was \n$\n771\n million\n and $\n879\n million as of December 31, 2023 and 2024, respectively.\nProperty and Equipment, Net\nProperty and equipment, net, consisted of the following (in millions):\nAs of December 31,\n2023\n2024\nTechnical infrastructure\n$\n112,504\n \n$\n139,596\n \nOffice space\n40,435\n \n43,714\n \nCorporate and other assets\n13,728\n \n16,519\n \nProperty and equipment, in service\n166,667\n \n199,829\n \nLess: accumulated depreciation\n(\n67,458\n)\n(\n79,390\n)\nAdd: assets not yet in service\n35,136\n \n50,597\n \nProperty and equipment, net\n$\n134,345\n \n$\n171,036\n \nAccrued Expenses and Other Current Liabilities\nAccrued expenses and other current liabilities consisted of the following (in millions):\n75.  \nTable of Contents\nAlphabet Inc.\nAs of December 31,\n2023\n2024\nEuropean Commission fines\n(1)\n$\n9,525\n \n$\n6,322\n \nAccrued purchases of property and equipment\n(2)\n4,679\n \n7,104\n \nAccrued customer liabilities\n4,140\n \n4,304\n \nCurrent operating lease liabilities\n2,791\n \n2,887\n \nIncome taxes payable, net\n2,748\n \n2,905\n \nOther accrued expenses and current liabilities\n22,285\n \n27,706\n \nAccrued expenses and other current liabilities\n$\n46,168\n \n$\n51,228\n \n(1)    \nThe amounts related to the EC fines, including any under appeal, are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets. Amounts include the effects of foreign exchange and interest. In the third quarter of 2024 we made a cash payment of $\n3.0\n billion for the 2017 EC shopping fine. See Note 10 for further details.\n(2)\n    Additional property and equipment purchases of $\n2.8\n billion and $\n3.2\n billion\n \nas of December 31, 2023 and 2024, respectively, were included in accounts payable.\nAccumulated Other Comprehensive Income (Loss)\nComponents of AOCI, net of income tax, were as follows (in millions):\nForeign Currency Translation Adjustments\nUnrealized Gains (Losses) on Available-for-Sale Investments\nUnrealized Gains (Losses) on Cash Flow Hedges\nTotal\nBalance as of December 31, 2021\n$\n(\n2,306\n)\n$\n236\n \n$\n447\n \n$\n(\n1,623\n)\nOther comprehensive income (loss) before reclassifications\n(\n1,836\n)\n(\n4,720\n)\n1,463\n \n(\n5,093\n)\nAmounts excluded from the assessment of hedge effectiveness recorded in AOCI\n0\n \n0\n \n(\n188\n)\n(\n188\n)\nAmounts reclassified from AOCI\n0\n \n1,007\n \n(\n1,706\n)\n(\n699\n)\nOther comprehensive income (loss)\n(\n1,836\n)\n(\n3,713\n)\n(\n431\n)\n(\n5,980\n)\nBalance as of December 31, 2022\n(\n4,142\n)\n(\n3,477\n)\n16\n \n(\n7,603\n)\nOther comprehensive income (loss) before reclassifications\n735\n \n1,344\n \n84\n \n2,163\n \nAmounts excluded from the assessment of hedge effectiveness recorded in AOCI\n0\n \n0\n \n84\n \n84\n \nAmounts reclassified from AOCI\n0\n \n1,168\n \n(\n214\n)\n954\n \nOther comprehensive income (loss)\n735\n \n2,512\n \n(\n46\n)\n3,201\n \nBalance as of December 31, 2023\n(\n3,407\n)\n(\n965\n)\n(\n30\n)\n(\n4,402\n)\nOther comprehensive income (loss) before reclassifications\n(\n1,673\n)\n(\n116\n)\n698\n \n(\n1,091\n)\nAmounts excluded from the assessment of hedge effectiveness recorded in AOCI\n0\n \n0\n \n77\n \n77\n \nAmounts reclassified from AOCI\n0\n \n782\n \n(\n166\n)\n616\n \nOther comprehensive income (loss)\n(\n1,673\n)\n666\n \n609\n \n(\n398\n)\nBalance as of December 31, 2024\n$\n(\n5,080\n)\n$\n(\n299\n)\n$\n579\n \n$\n(\n4,800\n)\nThe effects on net income of amounts reclassified from AOCI were as follows (in millions):\n76.  \nTable of Contents\nAlphabet Inc.\nYear Ended December 31,\n AOCI Components\nLocation\n2022\n2023\n2024\nUnrealized gains (losses) on available-for-sale investments\nOther income (expense), net\n$\n(\n1,291\n)\n$\n(\n1,497\n)\n$\n(\n1,008\n)\nBenefit (provision) for income taxes\n284\n \n329\n \n226\n \nNet of income tax\n(\n1,007\n)\n(\n1,168\n)\n(\n782\n)\nUnrealized gains (losses) on cash flow hedges\nForeign exchange contracts\nRevenue\n2,046\n \n213\n \n174\n \nInterest rate contracts\nOther income (expense), net\n6\n \n6\n \n1\n \nBenefit (provision) for income taxes\n(\n346\n)\n(\n5\n)\n(\n9\n)\nNet of income tax\n1,706\n \n214\n \n166\n \nTotal amount reclassified, net of income tax\n$\n699\n \n$\n(\n954\n)\n$\n(\n616\n)\nOther Income (Expense), Net \nComponents of OI&E were as follows (in millions): \n \nYear Ended December 31,\n \n2022\n2023\n2024\nInterest income\n$\n2,174\n \n$\n3,865\n \n$\n4,482\n \nInterest expense\n(1)\n(\n357\n)\n(\n308\n)\n(\n268\n)\nForeign currency exchange gain (loss), net\n(\n654\n)\n(\n1,238\n)\n(\n409\n)\nGain (loss) on debt securities, net\n(\n2,064\n)\n(\n1,215\n)\n(\n1,043\n)\nGain (loss) on equity securities, net\n(\n3,455\n)\n392\n \n3,714\n \nPerformance fees\n798\n \n257\n \n218\n \nIncome (loss) and impairment from equity method investments, net\n(\n337\n)\n(\n628\n)\n(\n188\n)\nOther\n381\n \n299\n \n919\n \nOther income (expense), net\n$\n(\n3,514\n)\n$\n1,424\n \n$\n7,425\n \n(1)    \nInterest expense is net of interest capitalized of $\n128\n million, $\n181\n million, and $\n194\n million for the years ended December 31, 2022, 2023, and 2024, respectively.\nNote 8.        \nBusiness Combinations\ncharacter.ai\nIn accordance with the accounting requirements under Accounting Standards Codification Topic 805, for the year ended December 31, 2024, we recorded $\n2.7\n billion of goodwill and $\n413\n million of intangible assets resulting from a transaction with character.ai (“Character”). In August 2024, we entered into a license agreement with Character pursuant to which we obtained a non-exclusive license to its then current large language model technology. We paid Character $\n2.7\n billion in cash and canceled our convertible instruments. We also hired certain employees of Character. Goodwill was recorded in Google Services and Google Cloud and is deductible for tax purposes.\nNote 9.        \nGoodwill\nChanges in the carrying amount of goodwill for the years ended \nDecember 31, 2023\n and 2024 were as follows (in millions):\n77.  \nTable of Contents\nAlphabet Inc.\nGoogle Services\nGoogle Cloud\nOther Bets\nTotal\nBalance as of December 31, 2022\n$\n20,847\n \n$\n7,205\n \n$\n908\n \n$\n28,960\n \nAdditions\n240\n \n3\n \n0\n \n243\n \nForeign currency translation and other adjustments\n31\n \n(\n9\n)\n(\n27\n)\n(\n5\n)\nBalance as of December 31, 2023\n21,118\n \n7,199\n \n881\n \n29,198\n \nAdditions\n2,441\n \n295\n \n0\n \n2,736\n \nForeign currency translation and other adjustments\n(\n38\n)\n(\n4\n)\n(\n7\n)\n(\n49\n)\nBalance as of December 31, 2024\n$\n23,521\n \n$\n7,490\n \n$\n874\n \n$\n31,885\n \nNote 10.        \nCommitments and Contingencies \nCommitments\nWe have content licensing agreements with future fixed or minimum guaranteed commitments of $\n8.8\n billion as of December 31, 2024, of which the majority is paid quarterly through the first quarter of 2030.\nIndemnifications\nIn the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents.\nIt is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period.\nAs of December 31, 2024, we did not have any material indemnification claims that were probable or reasonably possible.\nLegal Matters\nWe record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate.\nCertain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect.\nWe expense legal fees in the period in which they are incurred.\nAntitrust Matters\nWe are subject to formal and informal inquiries and investigations as well as litigation on various competition matters by regulatory authorities and private parties in the U.S., Europe, and other jurisdictions globally, including the following:\n•\nShopping:\n In June 2017, the EC announced its decision that certain actions taken by Google relating to its display and ranking of shopping search results and ads infringed European antitrust laws and imposed a €\n2.4\n billion fine. We appealed the EC decision and implemented product changes to bring shopping ads into \n78.  \nTable of Contents\nAlphabet Inc.\ncompliance with the EC's decision. In September 2024, the European Court of Justice rejected our appeal and upheld the €\n2.4\n billion fine. In the third quarter of 2024, we made a cash payment of $\n3.0\n billion for the fine. \n•\nAndroid: \nIn July 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European antitrust laws, imposed a €\n4.3\n billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €\n4.3\n billion to €\n4.1\n billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $\n5.1\n billion for the fine, which we reduced by $\n217\n million in 2022.\n•\nAdSense for Search: \nIn March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €\n1.5\n billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $\n1.7\n billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €\n1.5\n billion fine. The EC has appealed the General Court's decision with the European Court of Justice.\n•\nSearch:\n In October 2020, the DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. In August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such U.S. antitrust laws. A separate proceeding is being held to determine remedies, the range of which vary widely. The DOJ has proposed a high level remedy framework, which includes alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes, some of which could have a material adverse effect on our business. We have filed our own remedies proposal ahead of a hearing on remedies in April 2025. We expect a decision likely in the second half of 2025, after which we intend to appeal.\nFurther, in June 2022, the Australian Competition and Consumer Commission and in October 2023, the Japanese Fair Trade Commission each opened an investigation into Search distribution practices.\nGiven the nature of these matters, we cannot estimate a possible loss.\n•\nAdvertising Technology: \nIn December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, in January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia alleging that Google violated U.S. antitrust laws relating to its advertising technology, and a number of additional state Attorneys General subsequently joined the lawsuit. The trial ended in September 2024, and we expect a decision in early 2025. \nFurther, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology, to which we responded. \nGiven the nature of these matters, we cannot estimate a possible loss.\n•\nGoogle Play: \nIn July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent. \nIn December 2023, a California jury delivered a verdict in \nEpic Games v. Google\n finding that Google violated U.S. antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. \nWe are appealing the verdict and the trial court judge temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. Given the nature of this matter, we cannot estimate a possible loss.\n79.  \nTable of Contents\nAlphabet Inc.\n•\nEuropean Digital Markets Act:\n In March 2024, the EC opened \ntwo\n investigations regarding Google's compliance with certain provisions of EU's Digital Markets Act relating to Google Play and Search. Given the preliminary stages of this matter, we cannot estimate a possible loss.\nIn addition to these proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions. \nWe believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world.\nPrivacy Matters\nWe are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes.\nPatent and Intellectual Property Claims\nWe have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Further, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business.\nOther\nWe are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results.\nWe have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect.\nNon-Income Taxes\nWe are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations.\nSee Note 14 for information regarding income tax contingencies.\n80.  \nTable of Contents\nAlphabet Inc.\nNote 11.        \nStockholders' Equity \nClass A and Class B Common Stock and Class C Capital Stock\nOur Board of Directors has authorized \nthree\n classes of stock, Class A and Class B common stock, and Class C capital stock. The rights of the holders of each class of our common and capital stock are identical, except with respect to voting. Each share of Class A common stock is entitled to \none\n vote per share. Each share of Class B common stock is entitled to \n10\n votes per share. Class C capital stock has \nno\n voting rights, except as required by applicable law. Shares of Class B common stock may be converted at any time at the option of the stockholder and automatically convert upon sale or transfer to Class A common stock.\nShare Repurchases\nIn the \nyears ended December 31, 2022, 2023, and 2024\n, we continued to repurchase both Class A and Class C shares in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. During the \nyears ended December 31, 2022, 2023, and 2024, \nwe repurchased\n $\n59.3\n billion, $\n62.2\n billion, and $\n62.0\n billion, respectively, of Alphabet's Class A and Class C shares.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $\n70.0\n billion of its Class A and Class C shares. As of December 31, 2024, $\n44.7\n billion remained available for Class A and Class C share repurchases. \nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nYear Ended December 31, 2023\nYear Ended December 31, 2024\nShares\nAmount\nShares\nAmount\nClass A share repurchases\n78\n$\n9,316\n \n73\n$\n11,855\n \nClass C share repurchases\n450\n52,868\n \n306\n50,192\n \nTotal share repurchases\n(1)\n528\n$\n62,184\n \n379\n$\n62,047\n \n(1)         \nShares repurchased include unsettled repurchases.\nRepurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date.\nDividends\nDuring the year ended December 31, 2024, total cash dividends, which were first paid in June 2024, were $\n3.5\n billion, $\n519\n million, and $\n3.3\n billion for Class A, Class B, and Class C shares, respectively.\nThe company intends to pay quarterly cash dividends in the future, subject to review and approval by the company’s Board of Directors in its sole discretion.\nNote 12.        \nNet Income Per Share \nWe compute net income per share of Class A, Class B, and Class C stock using the two-class method. Basic net income per share is computed using the weighted-average number of shares outstanding during the period. Diluted net income per share is computed using the weighted-average number of shares and the effect of potentially dilutive securities outstanding during the period. Potentially dilutive securities consist of RSUs and other contingently issuable shares. The dilutive effect of outstanding RSUs and other contingently issuable shares is reflected in diluted earnings per share by application of the treasury stock method. The computation of the diluted net income per share of Class A stock assumes the conversion of Class B stock, while the diluted net income per share of Class B stock does not assume the conversion of those shares.\nIn accordance with our certificate of incorporation, the rights, including the liquidation and dividend rights, of the holders of our Class A, Class B, and Class C stock are identical, except with respect to voting. Furthermore, there are a number of safeguards built into our certificate of incorporation, as well as Delaware law, which preclude our Board of Directors from declaring or paying unequal per share dividends on our Class A, Class B, and Class C stock. Specifically, Delaware law provides that amendments to our certificate of incorporation which would have the effect of adversely altering the rights, powers, or preferences of a given class of stock must be approved by the class of stock adversely affected by the proposed amendment. In addition, our certificate of incorporation provides that before any such amendment may be put to a stockholder vote, it must be approved by the unanimous consent of our Board of Directors. \n81.  \nTable of Contents\nAlphabet Inc.\nImmaterial differences in net income per share across our Class A, Class B, and Class C shares may arise due to the allocation of distributed earnings, which is based on the holders as of the record date, compared with the allocation of undistributed earnings and number of shares, which is based on the weighted average shares outstanding over the periods.\nThe following tables set forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts):\n \nYear Ended December 31, 2022\n \nClass A\nClass B\nClass C\nConsolidated\nBasic net income per share:\nNumerator\nAllocation of distributed earnings (cash dividends paid)\n$\n0\n \n$\n0\n \n$\n0\n \n$\n0\n \nAllocation of undistributed earnings \n27,518\n \n4,072\n \n28,382\n \n59,972\n \nNet income\n$\n27,518\n \n$\n4,072\n \n$\n28,382\n \n$\n59,972\n \nDenominator\nNumber of shares used in per share computation\n5,994\n \n887\n \n6,182\n \n13,063\n \nBasic net income per share\n$\n4.59\n \n$\n4.59\n \n$\n4.59\n \n$\n4.59\n \nDiluted net income per share:\nNumerator\nAllocation of total earnings for basic computation \n$\n27,518\n \n$\n4,072\n \n$\n28,382\n \n$\n59,972\n \nReallocation of total earnings as a result of conversion of Class B to Class A shares\n4,072\n \n0\n \n0\n \n_\n(1)\nReallocation of undistributed earnings\n(\n230\n)\n(\n30\n)\n230\n \n_\n(1)\nNet income\n$\n31,360\n \n$\n4,042\n \n$\n28,612\n \n$\n59,972\n \nDenominator\nNumber of shares used in basic computation\n5,994\n \n887\n \n6,182\n \n13,063\n \nWeighted-average effect of dilutive securities\nAdd:\nConversion of Class B to Class A shares outstanding\n887\n \n0\n \n0\n \n_\n(1)\nRestricted stock units and other contingently issuable shares\n0\n \n0\n \n96\n \n96\n \nNumber of shares used in per share computation\n6,881\n \n887\n \n6,278\n \n13,159\n \nDiluted net income per share\n$\n4.56\n \n$\n4.56\n \n$\n4.56\n \n$\n4.56\n \n \n(1)\n      Not applicable for consolidated net income per share.\n82.  \nTable of Contents\nAlphabet Inc.\n \nYear Ended December 31, 2023\n \nClass A\nClass B\nClass C\nConsolidated\nBasic net income per share:\nNumerator\nAllocation of distributed earnings (cash dividends paid)\n$\n0\n \n$\n0\n \n$\n0\n \n$\n0\n \nAllocation of undistributed earnings \n34,601\n \n5,124\n \n34,070\n \n73,795\n \nNet income\n$\n34,601\n \n$\n5,124\n \n$\n34,070\n \n$\n73,795\n \nDenominator\nNumber of shares used in per share computation\n5,922\n \n877\n \n5,831\n \n12,630\n \nBasic net income per share\n$\n5.84\n \n$\n5.84\n \n$\n5.84\n \n$\n5.84\n \nDiluted net income per share:\nNumerator\nAllocation of total earnings for basic computation \n$\n34,601\n \n$\n5,124\n \n$\n34,070\n \n$\n73,795\n \nReallocation of total earnings as a result of conversion of Class B to Class A shares\n5,124\n \n0\n \n0\n \n_\n(1)\nReallocation of undistributed earnings\n(\n287\n)\n(\n37\n)\n287\n \n_\n(1)\nNet income\n$\n39,438\n \n$\n5,087\n \n$\n34,357\n \n$\n73,795\n \nDenominator\nNumber of shares used in basic computation\n5,922\n \n877\n \n5,831\n \n12,630\n \nWeighted-average effect of dilutive securities\nAdd:\nConversion of Class B to Class A shares outstanding\n877\n \n0\n \n0\n \n_\n(1)\nRestricted stock units and other contingently issuable shares\n0\n \n0\n \n92\n \n92\n \nNumber of shares used in per share computation\n6,799\n \n877\n \n5,923\n \n12,722\n \nDiluted net income per share\n$\n5.80\n \n$\n5.80\n \n$\n5.80\n \n$\n5.80\n \n(1)\n      Not applicable for consolidated net income per share.\n \nYear Ended December 31, 2024\n \nClass A\nClass B\nClass C\nConsolidated\nBasic net income per share:\nNumerator\nAllocation of distributed earnings (cash dividends paid)\n$\n3,509\n \n$\n519\n \n$\n3,335\n \n$\n7,363\n \nAllocation of undistributed earnings \n44,085\n \n6,520\n \n42,150\n \n92,755\n \nNet income\n$\n47,594\n \n$\n7,039\n \n$\n45,485\n \n$\n100,118\n \nDenominator\nNumber of shares used in per share computation\n5,855\n \n866\n \n5,598\n \n12,319\n \nBasic net income per share\n$\n8.13\n \n$\n8.13\n \n$\n8.13\n \n$\n8.13\n \nDiluted net income per share:\nNumerator\nAllocation of total earnings for basic computation \n$\n47,594\n \n$\n7,039\n \n$\n45,485\n \n$\n100,118\n \nReallocation of total earnings as a result of conversion of Class B to Class A shares\n7,039\n \n0\n \n0\n \n_\n(1)\nReallocation of undistributed earnings\n(\n520\n)\n(\n67\n)\n520\n \n_\n(1)\nNet income\n$\n54,113\n \n$\n6,972\n \n$\n46,005\n \n$\n100,118\n \nDenominator\nNumber of shares used in basic computation\n5,855\n \n866\n \n5,598\n \n12,319\n \nWeighted-average effect of dilutive securities\nAdd:\nConversion of Class B to Class A shares outstanding\n866\n \n0\n \n0\n \n_\n(1)\nRestricted stock units and other contingently issuable shares\n0\n \n0\n \n128\n \n128\n \nNumber of shares used in per share computation\n6,721\n \n866\n \n5,726\n \n12,447\n \nDiluted net income per share\n$\n8.05\n \n$\n8.05\n \n$\n8.03\n \n$\n8.04\n \n(1)\nNot applicable for consolidated net income per share.\n83.  \nTable of Contents\nAlphabet Inc.\nNote 13.        \nCompensation Plans \nStock Plans\nOur stock plans include the Alphabet Amended and Restated 2021 Stock Plan (\"Alphabet 2021 Stock Plan\") and Other Bets stock-based plans. Under our stock plans, RSUs and other types of awards may be granted. Under the Alphabet 2021 Stock Plan, an RSU award is an agreement to issue shares of our Class C stock at the time the award vests. RSUs generally vest over \nfour years\n contingent upon employment on the vesting date. RSUs are awarded dividend equivalents, which are subject to the same vesting conditions as the underlying award, and settled in Class C shares.\nAs of December 31, 2024, there were \n633\n million shares of Class C stock reserved for future issuance under the Alphabet 2021 Stock Plan.\nStock-Based Compensation\nFor the years ended December 31, 2022, 2023, and 2024, total SBC expense was $\n19.5\n billion, $\n22.1\n billion, and $\n22.8\n billion, including amounts associated with awards we expect to settle in Alphabet stock of $\n18.8\n billion, $\n21.7\n billion, and $\n22.0\n billion, respectively.\nFor the years ended December 31, 2022, 2023, and 2024, we recognized tax benefits on total SBC expense, which are reflected in the provision for income taxes in the Consolidated Statements of Income, of $\n3.9\n billion, $\n4.5\n billion, and $\n4.6\n billion, respectively.\nFor the years ended December 31, 2022, 2023, and 2024, tax benefit realized related to awards vested or exercised during the period was $\n4.7\n billion, $\n5.6\n billion, and $\n6.8\n billion, respectively. These amounts do not include the indirect effects of stock-based awards, which primarily relate to the R&D tax credit.\nStock-Based Award Activities\nThe following table summarizes the activities for unvested Alphabet RSUs, which include dividend equivalents awarded to holders of unvested stock, for the year ended \nDecember 31, 2024\n (in millions, except per share amounts):\n \n    Number of    \nShares\nWeighted-\nAverage\nGrant-Date\nFair Value\nUnvested as of December 31, 2023\n338\n \n$\n104.93\n \nGranted\n195\n \n$\n140.04\n \nVested\n(\n199\n)\n$\n110.89\n \nForfeited/canceled\n(\n35\n)\n$\n113.52\n \nUnvested as of December 31, 2024\n299\n \n$\n122.77\n \nThe weighted-average grant-date fair value of RSUs granted during the years ended \nDecember 31,\n 2022 and 2023 was $\n127.22\n and $\n97.59\n, respectively. Total fair value of RSUs, as of their respective vesting dates, during the years ended December 31, 2022, 2023, and 2024, were $\n23.9\n billion, $\n26.6\n billion, and $\n33.3\n billion, respectively.\nAs of December 31, 2024, there was $\n34.8\n billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of \n2.5\n years.\n \nNote 14.        \nIncome Taxes \nIncome from continuing operations before income taxes consisted of the following (in millions):\nYear Ended December 31,\n \n2022\n2023\n2024\nDomestic operations\n$\n61,307\n \n$\n73,600\n \n$\n108,076\n \nForeign operations\n10,021\n \n12,117\n \n11,739\n \nTotal\n$\n71,328\n \n$\n85,717\n \n$\n119,815\n \n84.  \nTable of Contents\nAlphabet Inc.\nProvision for income taxes consisted of the following (in millions):\nYear Ended December 31,\n \n2022\n2023\n2024\nCurrent:\nFederal and state\n$\n17,120\n \n$\n17,125\n \n$\n22,485\n \nForeign\n2,434\n \n2,526\n \n2,468\n \nTotal\n19,554\n \n19,651\n \n24,953\n \nDeferred:\nFederal and state\n(\n8,052\n)\n(\n7,482\n)\n(\n5,350\n)\nForeign\n(\n146\n)\n(\n247\n)\n94\n \nTotal\n(\n8,198\n)\n(\n7,729\n)\n(\n5,256\n)\nProvision for income taxes\n$\n11,356\n \n$\n11,922\n \n$\n19,697\n \nThe reconciliation of federal statutory income tax rate to our effective income tax rate was as follows:\nYear Ended December 31,\n \n2022\n2023\n2024\nU.S. federal statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nForeign income taxed at different rates\n3.0\n \n0.3\n \n0.5\n \nForeign-derived intangible income deduction\n(\n5.4\n)\n(\n4.6\n)\n(\n3.8\n)\nStock-based compensation expense\n(\n1.2\n)\n(\n0.8\n)\n(\n1.5\n)\nFederal research credit\n(\n2.2\n)\n(\n1.8\n)\n(\n1.5\n)\nDeferred tax asset valuation allowance\n0.9\n \n0.6\n \n0.4\n \nState and local income taxes\n0.8\n \n1.0\n \n1.1\n \nEffect of tax law change\n0.0\n \n(\n1.4\n)\n0.0\n \nOther\n(\n1.0\n)\n(\n0.4\n)\n0.2\n \nEffective tax rate\n15.9\n \n%\n13.9\n \n%\n16.4\n \n%\nIn 2023, the IRS issued a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits as well as a separate rule change with guidance on the capitalization and amortization of R&D expenses. A cumulative one-time adjustment for these tax rule changes was recorded in 2023.\n85.  \nTable of Contents\nAlphabet Inc.\nDeferred Income Taxes\nDeferred income taxes reflect the net effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. \nSignificant components of our deferred tax assets and liabilities were as follows (in millions):\nAs of December 31,\n2023\n2024\nDeferred tax assets:\nAccrued employee benefits\n$\n1,855\n \n$\n1,834\n \nAccruals and reserves not currently deductible\n2,481\n \n2,552\n \nTax credits\n6,609\n \n6,384\n \nNet operating losses\n2,965\n \n3,472\n \nOperating leases\n3,526\n \n3,336\n \nCapitalized research and development\n17,757\n \n25,903\n \nOther\n1,951\n \n1,376\n \nTotal deferred tax assets\n37,144\n \n44,857\n \nValuation allowance\n(\n10,999\n)\n(\n11,493\n)\nTotal deferred tax assets net of valuation allowance\n26,145\n \n33,364\n \nDeferred tax liabilities:\nProperty and equipment, net\n(\n8,189\n)\n(\n9,932\n)\nNet investment gains\n(\n2,405\n)\n(\n2,978\n)\nOperating leases\n(\n2,965\n)\n(\n2,986\n)\nOther\n(\n902\n)\n(\n1,008\n)\nTotal deferred tax liabilities\n(\n14,461\n)\n(\n16,904\n)\nNet deferred tax assets (liabilities)\n$\n11,684\n \n$\n16,460\n \nAs of December 31, 2024, our federal, state, and foreign net operating loss carryforwards for income tax purposes were approximately $\n8.4\n billion, $\n19.4\n billion, and $\n2.5\n billion respectively. If not utilized, the federal net operating loss carryforwards will begin to expire in 2025, foreign net operating loss carryforwards will begin to expire in 2025 and the state net operating loss carryforwards will begin to expire in 2033. It is more likely than not that the majority of the net operating loss carryforwards will not be realized. The net operating loss carryforwards are subject to various annual limitations under the tax laws of the different jurisdictions.\nAs of \nDecember 31, 2024\n, our Federal and California research and development credit carryforwards for income tax purposes were approximately $\n700\n million and $\n6.4\n billion, respectively. If not utilized, the Federal R&D credit will begin to expire in 2037 and the California R&D credit can be carried over indefinitely. We believe the majority of the federal tax credit and state tax credit is not likely to be realized.\nAs of \nDecember 31, 2024\n, our investment tax credit carryforwards for state income tax purposes were approximately $\n1.2\n billion and will begin to expire in 2030. We use the flow-through method of accounting for investment tax credits. We believe this tax credit is not likely to be realized.\nAs of December 31, 2024, we maintained a valuation allowance with respect to California deferred tax assets, certain federal net operating losses, certain state net operating losses and tax credits, net deferred tax assets relating to Other Bet companies, and certain foreign net operating losses that we believe are not likely to be realized. We continue to reassess the remaining valuation allowance quarterly, and if future evidence allows for a partial or full release of the valuation allowance, a tax benefit will be recorded accordingly. \nCash paid for income taxes, net of refunds, was $\n18.9\n billion, $\n19.2\n billion, and $\n27.4\n billion as of December 31, 2022, 2023, and 2024, respectively.\n86.  \nTable of Contents\nAlphabet Inc.\nUncertain Tax Positions\nThe following table summarizes the activity related to our gross unrecognized tax benefits (in millions):\nYear Ended December 31,\n \n2022\n2023\n2024\nBeginning gross unrecognized tax benefits\n$\n5,158\n \n$\n7,055\n \n$\n9,438\n \nIncreases related to prior year tax positions\n253\n \n740\n \n896\n \nDecreases related to prior year tax positions\n(\n437\n)\n(\n682\n)\n(\n83\n)\nDecreases related to settlement with tax authorities\n(\n140\n)\n(\n21\n)\n(\n311\n)\nIncreases related to current year tax positions\n2,221\n \n2,346\n \n2,679\n \nEnding gross unrecognized tax benefits\n$\n7,055\n \n$\n9,438\n \n$\n12,619\n \nWe are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $\n7.1\n billion, $\n9.4\n billion, and $\n12.6\n billion as of \nDecember 31, 2022\n, 2023, and 2024, respectively, of which $\n5.3\n billion, $\n7.4\n billion, and $\n10.0\n billion, if recognized, would affect our effective tax rate, respectively. \nAs of \nDecember 31, 2023\n and 2024, we accrued $\n622\n million and $\n1.1\n billion in interest and penalties in provision for income taxes, respectively.\nWe file income tax returns in the U.S. federal jurisdiction and in many state and foreign jurisdictions. Our \ntwo\n major tax jurisdictions are the U.S. federal and Ireland. We are subject to the continuous examination of our income tax returns by the IRS and other tax authorities. The IRS is currently examining our 2016 through 2021 tax returns. We have also received tax assessments in multiple foreign jurisdictions asserting transfer pricing adjustments or permanent establishment. We continue to defend such claims as presented.\nThe tax years 2016 through 2023 remain subject to examination by the appropriate governmental agencies for Irish tax purposes. There are other ongoing audits in various other jurisdictions that are not material to our financial statements.\nWe regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. We continue to monitor the progress of ongoing discussions with tax authorities and the effect, if any, of the expected expiration of the statute of limitations in various taxing jurisdictions.\nWe believe that an adequate provision has been made for any adjustments that may result from tax examinations. However, the outcome of tax audits cannot be predicted with certainty. If any issues addressed in our tax audits are resolved in a manner not consistent with management's expectations, we could be required to adjust our provision for income taxes in the period such resolutions occur. Although the timing of resolution, settlement, and closure of audits is not certain, we do not believe it is reasonably possible that our unrecognized tax benefits from certain U.S. federal, state, and non U.S. tax positions will materially change in the next 12 months.\n \nNote 15.        \nInformation about Segments and Geographic Areas \nWe report our segment results as Google Services, Google Cloud, and Other Bets:\n•\nGoogle Services includes products and services such as ads, Android, Chrome, devices, Google Maps, Google Play, Search, and YouTube. Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One; the sale of apps and in-app purchases; and devices.\n•\nGoogle Cloud includes infrastructure and platform services, applications, and other services for enterprise customers. Google Cloud generates revenues primarily from consumption-based fees and subscriptions received for Google Cloud Platform services, Google Workspace communication and collaboration tools, and other enterprise services.\n•\nOther Bets is a combination of multiple operating segments that are not individually material. Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services.\nRevenues, certain costs, such as costs associated with content and traffic acquisition, certain engineering activities, and devices, as well as certain operating expenses are directly attributable to our segments. Due to the integrated nature of Alphabet, other costs and expenses, such as technical infrastructure and office facilities, are managed centrally at a consolidated level. These costs, including the associated depreciation, are allocated to operating segments as a service cost generally based on usage, headcount, or revenue.\n87.  \nTable of Contents\nAlphabet Inc.\nAs announced in April 2024, we consolidated teams that focus on building general AI models across Google Research and Google DeepMind to further accelerate our progress in AI. General AI model development teams previously under Google Research in our Google Services segment are reported within Alphabet-level activities prospectively beginning in the second quarter of 2024. As further announced, in October 2024, the Gemini app team that is developing the direct consumer interface to our Gemini models joined Google DeepMind. The costs associated with the Gemini app team continue to be reported within our Google Services segment.\nCertain costs are not allocated to our segments because they represent Alphabet-level activities. These costs primarily include certain AI-focused shared R&D activities, including development costs of our general AI models; corporate initiatives such as our philanthropic activities; corporate shared costs such as certain finance, human resource, and legal costs, including certain fines and settlements. Charges associated with employee severance and office space reductions during 2023 and 2024 were also not allocated to our segments. Additionally, hedging gains (losses) related to revenue are not allocated to our segments.\nOur Chief Operating Decision Maker (CODM) is our Chief Executive Officer, Sundar Pichai. Our CODM uses segment operating income (loss) to allocate resources to our segments in our annual planning process and to assess the performance of our segments, primarily by monitoring actual results versus the annual plan. Our operating segments are not evaluated using asset information.\nThe following table presents revenue, profitability, and expense information about our segments (in millions):\nYear Ended December 31,\n2022\n2023\n2024\nRevenues:\nGoogle Services\n$\n253,528\n \n$\n272,543\n \n$\n304,930\n \nGoogle Cloud\n26,280\n \n33,088\n \n43,229\n \nOther Bets\n1,068\n \n1,527\n \n1,648\n \nHedging gains (losses)\n1,960\n \n236\n \n211\n \nTotal revenues\n$\n282,836\n \n$\n307,394\n \n$\n350,018\n \nOperating income (loss):\nGoogle Services\n$\n82,699\n \n$\n95,858\n \n$\n121,263\n \nGoogle Cloud\n(\n1,922\n)\n1,716\n \n6,112\n \nOther Bets\n(\n4,636\n)\n(\n4,095\n)\n(\n4,444\n)\nAlphabet-level activities\n(\n1,299\n)\n(\n9,186\n)\n(\n10,541\n)\nTotal income from operations\n$\n74,842\n \n$\n84,293\n \n$\n112,390\n \nSupplemental information about our segment expenses:\nGoogle Services:\nEmployee compensation expenses\n$\n43,529\n \n$\n46,224\n \n$\n44,560\n \nOther costs and expenses\n127,300\n \n130,461\n \n139,107\n \nTotal Google Services costs and expenses\n$\n170,829\n \n$\n176,685\n \n$\n183,667\n \nGoogle Cloud:\nEmployee compensation expenses\n$\n16,132\n \n$\n19,054\n \n$\n20,519\n \nOther costs and expenses\n12,070\n \n12,318\n \n16,598\n \nTotal Google Cloud costs and expenses\n$\n28,202\n \n$\n31,372\n \n$\n37,117\n \nGoogle Services and Google Cloud employee compensation expenses include the costs associated with direct and allocated employees. Google Services and Google Cloud other costs and expenses primarily include direct costs, such as advertising and promotional activities and third party services fees as well as allocated costs, such as technical infrastructure and office facilities usage costs. Additionally, Google Services other costs and expenses include content and traffic acquisition costs and device costs.\nSee Note 2 for information relating to revenues by geography.\n88.  \nTable of Contents\nAlphabet Inc.\nThe following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions):\nAs of December 31,\n \n2023\n2024\nLong-lived assets:\nUnited States\n$\n110,053\n \n$\n138,993\n \nInternational\n38,383\n \n45,631\n \nTotal long-lived assets\n$\n148,436\n \n$\n184,624\n \nNote 16.        \nSubsequent Event \nIn January 2025, we recognized an $\n8.0\n billion unrealized gain on our non-marketable equity securities related to our investment in a private company. The unrealized gain reflects an increase in the fair value measurement of our investment following an observable transaction in January 2025. See Note 3 and Note 7 for further details on equity investments and OI&E.\n \n89.  \nTable of Contents\nAlphabet Inc.\nITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our chief executive officer and chief financial officer, evaluated the effectiveness of our disclosure controls and procedures pursuant to Rule 13a-15 under the Exchange Act, as of the end of the period covered by this Annual Report on Form 10-K.\nBased on this evaluation, our chief executive officer and chief financial officer concluded that, as of \nDecember 31, 2024\n, our disclosure controls and procedures are designed at a reasonable assurance level and are effective to provide reasonable assurance that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) of the Exchange Act. Our management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \nInternal Control—Integrated Framework\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on this evaluation, management concluded that our internal control over financial reporting was effective as of December 31, 2024. Management reviewed the results of its assessment with our Audit and Compliance Committee. The effectiveness of our internal control over financial reporting as of \nDecember 31, 2024\n has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in its report which is included in Item 8 of this Annual Report on Form 10-K.\nLimitations on Effectiveness of Controls and Procedures\nIn designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs.\nITEM 9B.\nOTHER INFORMATION\n10b5-1 Trading Plans\nDuring the quarter ended December 31, 2024, each of the following Section 16 director and officer \nadopted\n, modified, or \nterminated\n a “Rule 10b5-1 trading arrangement” (as defined in Item 408 of Regulation S-K of the Exchange Act):\n•\nJohn Hennessy\n, \nChair of the Board of Directors\n of Alphabet, through the John L. Hennessy & Andrea J. Hennessy Revocable Trust \nadopted\n a trading plan on \nNovember 5, 2024\n (with the first trade under the plan scheduled for March 13, 2025). The trading plan will be effective until \nMarch 13, 2026\n to sell \n6,000\n shares of Class C Capital Stock and \n1,200\n shares of Class A Common Stock.\n•\nSundar Pichai\n, \nChief Executive Officer\n, together with the Pichai Family Foundation, \nadopted\n a trading plan on \nDecember 2, 2024\n (with the first trade under the plan scheduled for April 2, 2025). The trading plan will be effective until \nApril 18, 2026\n to sell an aggregate of \n876,000\n shares of Class C Capital Stock.\nThere were no \"non-Rule 10b5-1 trading arrangements\" (as defined in Item 408 of Regulation S-K of the Exchange Act) adopted, modified, or terminated during the quarter ended December 31, 2024 by our directors and Section 16 officers. Each of the Rule 10b5-1 trading arrangements are in accordance with our Policy Against Insider \n90.  \nTable of Contents\nAlphabet Inc.\nTrading and actual sale transactions made pursuant to such trading arrangements will be disclosed publicly in Section 16 filings with the SEC in accordance with applicable securities laws, rules, and regulations.\nCompensatory Arrangements of Certain Officers\nOn April 16, 2024, the Leadership Development, Inclusion and Compensation Committee of the Board of Directors of Alphabet approved the accrual of dividend equivalent units to current and future holders of all unvested stock units in connection with any regular cash dividend that may be declared by the Board of Directors of Alphabet from time to time. As stock units are not outs\ntanding shares of stock and thus would not otherwise be entitled to participate in any dividends, the crediting of dividend equivalent units is intended to preserve the equity-based incentives intended by the company when the stock units were granted and to treat the holders of unvested stock units consistently with all stockholders.\nRequired Disclosure Pursuant to Section 13(r) of the Exchange Act\nAs previously disclosed, Google LLC, a subsidiary of Alphabet, filed notifications with the Russian Federal Security Service (FSB) pursuant to Russian encryption control requirements, which must be complied with prior to the import of covered items. The information provided pursuant to Section 13(r) of the Exchange Act in Part II, Item 5 of our Quarterly Report on Form 10-Q for the quarter ended September 30, 2024 is incorporated herein by reference.\nITEM 9C.     DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n91.  \nTable of Contents\nAlphabet Inc.\nPART III\nITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nThe information required by this item will be included under the caption “Directors, Executive Officers, and Corporate Governance” in our Proxy Statement for the 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended \nDecember 31, 2024\n (2025 Proxy Statement) and is incorporated herein by reference. The information required by this item regarding delinquent filers pursuant to Item 405 of Regulation S-K will be included under the caption “Delinquent Section 16(a) Reports” in the 2025 Proxy Statement and is incorporated herein by reference.\nWe have \nadopted insider trading policies\n and procedures governing the purchase, sale, and other dispositions of securities of Alphabet by directors, officers, and employees that we believe are reasonably designed to promote compliance with insider trading laws, rules and regulations, and applicable Nasdaq listing standards. Our insider trading policy states, among other things, that our directors, officers, and employees are prohibited from trading in such securities while in possession of material, nonpublic information. The foregoing summary of our insider trading policies and procedures does not purport to be complete and is qualified by reference to our Policy Against Insider Trading filed as an exhibit to this Annual Report on Form 10-K.\nITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by this item will be included under the captions “Director Compensation,” “Executive Compensation” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Compensation Committee Interlocks and Insider Participation” in the 2025 Proxy Statement and is incorporated herein by reference, except as to information disclosed therein pursuant to Item 402(v) of Regulation S-K relating to pay versus performance.\nITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item will be included under the captions “Common Stock Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in the 2025 Proxy Statement and is incorporated herein by reference.\nITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be included under the captions “Certain Relationships and Related Transactions” and “Directors, Executive Officers, and Corporate Governance—Corporate Governance and Board Matters—Director Independence” in the 2025 Proxy Statement and is incorporated herein by reference.\nITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item will be included under the caption “Independent Registered Public Accounting Firm” in the 2025 Proxy Statement and is incorporated herein by reference.\n92.  \nTable of Contents\nAlphabet Inc.\nPART IV\nITEM 15.\nEXHIBITS, FINANCIAL STATEMENT SCHEDULES\nWe have filed the following documents as part of this Annual Report on Form 10-K:\n1. Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firm\n49\nFinancial Statements:\nConsolidated Balance Sheets\n52\nConsolidated Statements of Income\n53\nConsolidated Statements of Comprehensive Income\n54\nConsolidated Statements of Stockholders’ Equity\n55\nConsolidated Statements of Cash Flows\n56\nNotes to Consolidated Financial Statements\n57\n2. Financial Statement Schedules\nSchedule II: Valuation and Qualifying Accounts\nThe table below details the activity of the allowance for credit losses and sales credits for the years ended December 31, 2022, 2023, and 2024 (in millions):\nBalance at\nBeginning of Year\nAdditions\nUsage\nBalance at\nEnd of Year\nYear ended December 31, 2022\n$\n1,389\n \n$\n2,125\n \n$\n(\n2,301\n)\n$\n1,213\n \nYear ended December 31, 2023\n$\n1,213\n \n$\n3,115\n \n$\n(\n2,737\n)\n$\n1,591\n \nYear ended December 31, 2024\n$\n1,591\n \n$\n2,895\n \n$\n(\n2,850\n)\n$\n1,636\n \nNote:\nAdditions to the allowance for credit losses are charged to expense. Additions to the allowance for sales credits are charged against revenues.\nAll other schedules have been omitted because they are not required, not applicable, or the required information is otherwise included.\n3. Exhibits\nExhibit\nNumber\nDescription\nIncorporated by reference herein\nForm\nDate\n2.01\nAgreement and Plan of Merger, dated October 2, 2015, by and among Google Inc., the Registrant and Maple Technologies Inc.\nCurrent Report on Form 8-K (File No. 001-37580) \nOctober 2, 2015\n3.01\nAmended and Restated Certificate of Incorporation of the Registrant\nCurrent Report on Form 8-K (File No. 001-37580) \nJune 3, 2022\n3.02\nAmended and Restated Bylaws of the Registrant, dated October 19, 2022\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 25, 2022\n4.01\nSpecimen Class A Common Stock certificate\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.02\nSpecimen Class C Capital Stock certificate\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.03\nu\nAlphabet Inc. Deferred Compensation Plan\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.04\nTransfer Restriction Agreement, dated October 2, 2015, between the Registrant and Larry Page and certain of his affiliates \nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.05\nTransfer Restriction Agreement, dated October 2, 2015, between the Registrant and Sergey Brin and certain of his affiliates \nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.06\nJoinder Agreement, dated December 31, 2021, among the Registrant, Sergey Brin and certain of his affiliates\n \nAnnual Report on Form 10-K (File No. 001-37580)\nFebruary 2, 2022\n93.  \nTable of Contents\nAlphabet Inc.\nExhibit\nNumber\nDescription\nIncorporated by reference herein\nForm\nDate\n4.07\nTransfer Restriction Agreement, dated October 2, 2015, between the Registrant and Eric E. Schmidt and certain of its affiliates\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.08\nClass C Undertaking, dated October 2, 2015, executed by the Registrant\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n4.09\nIndenture, dated February 12, 2016, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee\nRegistration Statement on Form S-3 \n(File No. 333-209510)\nFebruary 12, 2016\n4.10\nRegistrant Registration Rights Agreement dated December 14, 2015\nRegistration Statement on Form S-3 \n(File No. 333-209518)\nFebruary 12, 2016\n4.11\nFirst Supplemental Indenture, dated April 27, 2016, between the Registrant and The Bank of New York Mellon Trust Company, N.A., as trustee\nCurrent Report on Form 8-K\n(File No. 001-37580)\nApril 27, 2016\n4.12\nForm of the Registrant’s 1.998% Note due 2026\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 9, 2016\n4.13\nForm of Global Note representing the Registrant’s 0.450% notes due 2025\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.14\nForm of Global Note representing the Registrant’s 0.800% notes due 2027\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.15\nForm of Global Note representing the Registrant’s 1.100% notes due 2030\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.16\nForm of Global Note representing the Registrant’s 1.900% notes due 2040\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.17\nForm of Global Note representing the Registrant’s 2.050% notes due 2050\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.18\nForm of Global Note representing the Registrant’s 2.250% notes due 2060\nCurrent Report on Form 8-K (File No. 001-37580)\nAugust 5, 2020\n4.19\nDescription of Registrant’s Securities\nAnnual Report on Form 10-K (File No. 001-37580)\nFebruary 3, 2023\n10.01\nu\nForm of Indemnification Agreement entered into between the Registrant, its affiliates and its directors and officers \nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n10.02\nu\nForm of Offer Letter for Directors\nAnnual Report on Form 10-K (File No. 001-37580)\nJanuary 31, 2024\n10.03\nu\nLetter Agreement dated June 3, 2024, between Anat Ashkenazi and Alphabet\nCurrent Report on Form 8-K (File No. 001-36380)\nJune 7, 2024\n10.04\nu\nCompensation Plan Agreement, dated October 2, 2015, between Google Inc. and the Registrant\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n10.05\nu\nDirector Arrangements Agreement, dated October 2, 2015, between Google Inc. and the Registrant\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n10.06\nu\nAlphabet Inc. Deferred Compensation Plan\nCurrent Report on Form 8-K (File No. 001-37580)\nOctober 2, 2015\n10.07\nu\nAlphabet Inc. Amended and Restated 2012 Stock Plan\nCurrent Report on Form 8-K\n(File No. 001-37580)\nJune 5, 2020\n10.07.1\nu\nAlphabet Inc. Amended and Restated 2012 Stock Plan - Form of Alphabet Restricted Stock Unit Agreement\nAnnual Report on Form 10-K\n(File No. 001-37580)\nFebruary 4, 2020\n10.08\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan\nCurrent Report on Form 8-K (file No. 001-37580)\nJune 8, 2023\n10.08.1\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan - Form of Alphabet Restricted Stock Unit Agreement\nQuarterly Report on Form 10-Q (file No. 001-37580)\nJuly 28, 2021\n94.  \nTable of Contents\nAlphabet Inc.\nExhibit\nNumber\nDescription\nIncorporated by reference herein\nForm\nDate\n10.08.2\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan - Form of Alphabet Restricted Stock Unit Agreement\nQuarterly Report on Form 10-Q (File No. 001-37580)\nJuly 26, 2023\n10.08.3\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan – Form of Alphabet Restricted Stock Unit Agreement\nQuarterly Report on Form 10-Q (File No. 001-37580)\nApril 26, 2024\n10.08.4\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan - Form of Alphabet 2022 CEO Performance Stock Unit Agreement\nAnnual Report on Form 10-K (File No. 001-37580) \nFebruary 3, 2023\n10.08.5\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan – Form of Alphabet CEO Performance Stock Unit Agreement\nQuarterly Report on Form 10-Q (File No. 001-37580)\nApril 26, 2024\n10.08.6\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan - Form of Alphabet 2022 Non-CEO Performance Stock Unit Agreement\nAnnual Report on Form 10-K\n(File No. 001-37580)\nFebruary 2, 2022\n10.08.7\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan - Form of Alphabet 2023 Non-CEO Performance Stock Unit Agreement\nQuarterly Report on Form 10-Q (File No. 001-37580)\nJuly 26, 2023\n10.08.8\nu\nAlphabet Inc. Amended and Restated 2021 Stock Plan – Form of Alphabet Non-CEO Performance Stock Unit Agreement\nQuarterly Report on Form 10-Q (File No. 001-37580)\nApril 26, 2024\n10.09\nu\nAlphabet Inc. Company Bonus Plan, as amended\nAnnual Report on Form 10-K\n(File No. 001-37350)\nFebruary 2, 2023\n19.01\n*\nAlphabet Inc. Policy Against Insider Trading\n21.01\n*\nSubsidiaries of the Registrant\n23.01\n*\nConsent of Independent Registered Public Accounting Firm\n24.01\n*\nPower of Attorney (incorporated by reference to the signature page of this Annual Report on Form 10-K)\n31.01\n*\nCertification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.02\n*\nCertification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.01\n‡\nCertifications of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.01\nu\nClawback Policy\nAnnual Report on Form 10-K\n(File No. 001-37350)\nJanuary 31, 2024\n101.INS\n*\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n101.SCH\n*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\n*\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\n*\nInline XBRL Taxonomy Extension Definition Linkbase Document\n95.  \nTable of Contents\nAlphabet Inc.\nExhibit\nNumber\nDescription\nIncorporated by reference herein\nForm\nDate\n101.LAB\n*\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\n*\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\n*\nCover Page Interactive Data File (embedded within the Inline XBRL document and contained in Exhibit 101)\n_________________\nu\nIndicates management compensatory plan, contract, or arrangement.\n*\nFiled herewith.\n‡\nFurnished herewith.\nITEM 16.\nFORM 10-K SUMMARY\nNone.\n96.  \nTable of Contents\nAlphabet Inc.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 4, 2025 \n \nALPHABET INC.\nBy:\n/\nS\n/    S\nUNDAR\n P\nICHAI        \nSundar Pichai\nChief Executive Officer\n(Principal Executive Officer of the Registrant)\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Sundar Pichai and Anat Ashkenazi, jointly and severally, his or her attorney-in-fact, with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his or her substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n \n \n97.  \nTable of Contents\nAlphabet Inc.\nSignature\nTitle\nDate\n/\nS\n/    S\nUNDAR\n P\nICHAI\nChief Executive Officer and Director (Principal Executive Officer)\nFebruary 4, 2025\nSundar Pichai\n/\nS\n/    A\nNAT\n A\nSHKENAZI        \nSenior Vice President and Chief Financial Officer (Principal Financial Officer)\nFebruary 4, 2025\nAnat Ashkenazi\n/\nS\n/    A\nMIE\n T\nHUENER\n O'T\nOOLE        \nVice President, Corporate Controller and Principal Accounting Officer\nFebruary 4, 2025\nAmie Thuener O'Toole\n/\nS\n/    F\nRANCES \nH. A\nRNOLD   \n     \nDirector\nFebruary 4, 2025\nFrances H. Arnold\n/\nS\n/    S\nERGEY\n B\nRIN   \n     \nCo-Founder and Director\nFebruary 4, 2025\nSergey Brin\n/\nS\n/   R. M\nARTIN\n C\nHAVEZ       \nDirector\nFebruary 4, 2025\nR. Martin Chávez\n/\nS\n/    L. J\nOHN\n D\nOERR        \nDirector\nFebruary 4, 2025\nL. John Doerr\n/\nS\n/    R\nOGER\n W. F\nERGUSON \nJ\nR\n.\n       \nDirector\nFebruary 4, 2025\nRoger W. Ferguson Jr.\n/\nS\n/    J\nOHN\n L. H\nENNESSY\n        \nDirector, Chair\nFebruary 4, 2025\nJohn L. Hennessy\n/\nS\n/    L\nARRY\n P\nAGE        \nCo-Founder and Director\nFebruary 4, 2025\nLarry Page\n/\nS\n/    K. R\nAM\n S\nHRIRAM       \nDirector\nFebruary 4, 2025\nK. Ram Shriram\n/\nS\n/    R\nOBIN\n L. W\nASHINGTON\n      \nDirector\nFebruary 4, 2025\nRobin L. Washington\n98."
  }
}