{
  "ticker": "GPC",
  "cik": "0000040987",
  "company_name": "GENUINE PARTS CO",
  "filing_date": "2025-02-21",
  "accession": "0000040987-25-000026",
  "primary_doc": "gpc-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n84\nSignatures\n85\nTable of \nContents\nPART I.\nITEM 1\n.    \nBUSINESS.\nIncorporated in the State of Georgia in 1928, Genuine Parts Company is a global service organization engaged in the distribution of automotive and industrial replacement parts. We serve our customers from more than 10,700 locations, primarily in North America, Europe, as well as Australia and New Zealand (\"Australasia\"). We offer outstanding service, an industry-leading assortment of replacement parts, extensive supply chain and distribution capabilities, and enhanced technology solutions.\nAs used in this report, \"we,\" \"us,\" \"our,\" \"GPC,\" and the “company” refers to GPC and its subsidiaries, except as otherwise indicated by the context; and the terms “automotive parts” and “industrial parts” refer to replacement parts in each respective category.\nOUR BUSINESS\nWe are one global team unified by our mission to be an employer of choice, supplier of choice, valued customer, responsible corporate citizen and investment of choice for our shareholders. In order to execute this mission, we focus our businesses on delivering excellent customer service, profitable growth, operational efficiencies and strong cash flow. In 2024, we had net sales of $23.5 billion and our revenue mix was 74% in North America, 16% in Europe and 10% in Australasia.\nWe are organized into two business segments: our Automotive Parts Group (“Automotive”) and our Industrial Parts Group (“Industrial”). Our main Automotive customers are repair and maintenance shops, and our main Industrial customers are businesses operating distribution, manufacturing and production equipment.\nIn Automotive, we see long-term growth opportunities across each of the markets we serve which are supported by an increasing number of miles driven, a growing and aging car parc, increasing vehicle complexity, and an emerging opportunity with electric vehicles. In Industrial, growth drivers include disruptions in the global supply chain creating opportunities with nearshoring, a strong outlook for automation and robotics solutions, the need for industrial expertise due to an aging technical workforce and diversified end market opportunities. Together, our business segments create a competitive differentiation in two distinct and growing markets with compelling shareholder value.\nWe believe our primary competitive advantages are our: (1) global presence and brand strength; (2) industry-leading positions in each of the markets we serve; (3) extensive supply chain and distribution capabilities; and (4) enhanced technology solutions.\nOur strategic financial objectives complement our mission and drive value for all our stakeholders. These financial objectives include: (1) revenue growth in excess of market growth; (2) continuously improving operating margins; (3) maintaining a strong balance sheet and cash flows; and (4) effective capital allocation.\nAs we look to the future, our strategy is built to position us for long-term, profitable growth. By staying true to our purpose, leveraging our strengths, and executing on our strategic priorities, we are confident in our ability to deliver sustainable growth and create lasting value for our shareholders, customers, employees, and communities.\nOUR SEGMENTS\nAUTOMOTIVE\nOur Automotive segment, which represents 63% of total GPC net sales, is the largest global automotive network of parts and autocare. We distribute automotive parts, accessories and solutions in North America, Europe and Australasia. Our Automotive businesses offer extensive inventory depth and assortment, cataloging, marketing, training and other programs to the aftermarket in each of these regions, distinguishing our business from the competition.\nOur global Automotive network sells to customers in both commercial do-it-for-me (“DIFM”) and retail do-it-yourself (“DIY”) segments of the market and covers substantially all global motor vehicle models. Our DIFM customers include local, regional and national repair centers, auto dealers, service stations and both private and public sector accounts. Our DIY customers are primarily served over-the-counter at our global stores or digitally. Our DIFM and DIY customers represent approximately 80% and 20% of total Automotive sales, respectively, and channel mix varies by geography.\nOur Automotive network consists of over one million customer locations. We have diversity amongst our commercial customer base with no specific customer type representing an outsized concentration of our overall business. Our Automotive segment operates in large and fragmented markets with a combined total addressable \n2\nTable of \nContents\nmarket of over $200 billion. The majority of the automotive aftermarket is comprised of small, local competitors and our scale, advanced technology, and supply chain efficiency differentiates us from competitors. \nOur Automotive distribution network provides access to hundreds of thousands of replacement parts (other than collision parts and tires) and accessory items for substantially all motor vehicle makes and models, including hybrid and electric vehicles, trucks, and SUVs, as well as for buses, motorcycles, farm equipment, and heavy duty equipment. We supply certain equipment parts and technologies used by repair shops, service stations, fleet operators, automobile and truck dealers, leasing companies, farms, and individuals who perform their own maintenance and parts installation. \nInventory availability is critical to the success of our business and our teams utilize data and analytics to have the right parts, in the right place and at the right time. The majority of products distributed in North America utilize the NAPA brand, which we believe is a competitive differentiator. In Australasia and Europe, products are distributed under several brand names, including many of the national brands, as well as the NAPA brand. Our U.S. Automotive business offers approximately 800,000 different parts and related supply items. These items are purchased from hundreds of different suppliers, with approximately 55% of 2024 automotive parts inventories purchased from 10 major suppliers.\nRegional Operations & Products.\n  \n  In North America, our U.S. operations are headquartered in Atlanta, Georgia and our Canadian operations are headquartered in Montreal, Quebec. We are differentiated from many of our North American competitors because our revenues are primarily generated with commercial DIFM customers. We service the U.S. and Canadian markets primarily through company-owned and independent auto part stores, heavy vehicle stores, and specialty paint and equipment stores. Our North American auto parts stores sell a comprehensive range of automotive parts, including brakes, batteries, filters, engine components, tools, accessories, and fluids. Some locations offer custom services such as paint mixing, hydraulic hose assembly, battery testing, and key cutting. Our heavy vehicle stores sell parts, accessories, and tools and equipment for servicing heavy duty and diesel vehicles, and we operate service and mechanical repair centers for heavy vehicles. We serve the heavy vehicle market under the banners Traction, TruckPro, TW, and Cadel. In Canada, our specialty stores operate paint and body care equipment and supply under the banner NAPA/CMAX and high-quality replacement parts and lubricants for imported vehicles under the banners Altrom and Auto‑Camping. \nSeparately, we provide a unique NAPA Auto Care program available to independent repair shops and auto care centers across the U.S. and Canada where they can leverage the NAPA brand to increase visibility as well as receive part discounts and other product and technology benefits. We also offer technical expertise by training and employing knowledgeable staff who can provide technical assistance, product recommendations, and guidance on automotive repairs and maintenance, and we organize DIY workshops and training sessions to educate customers on automotive repair and maintenance tasks. Our online platform in North America is NAPA online, which provides our customers an option to browse, purchase, and have automotive products bought online and picked up in store or delivered to their homes or businesses. Through NAPA Online, customers can also locate nearby participating NAPA Auto Care locations. \nWe believe that the quality and the range of products and services provided to our North American customers constitute a significant advantage for our automotive parts distribution system. Our goal is to properly stock our locations with the right parts to ensure we provide quick and quality service to our customers whose orders are often filled and shipped the same day they are received. Our services also include up to date parts cataloging (including the use of electronic NAPA Auto Parts catalogs) and stock adjustments through a continuous parts classification system which, as initiated by us, allows independently-owned stores to return certain merchandise on a scheduled basis. We offer our NAPA Auto Parts stores various management aids, marketing aids and service on topics such as selling and promotional tools, inventory control, pricing and cost analysis, as well as marketing conferences and seminars, sales and advertising manuals and training programs. We have developed and refined an inventory classification system to determine the most advantageous distribution center and auto parts store inventory levels for automotive parts stocking based on automotive registrations, usage rates, production statistics, technological advances, including predictive analytics, and other similar factors. This system, which undergoes continuous analytical review, is an integral part of our inventory control procedures and comprises an important feature of the inventory management services that we make available to our NAPA Auto Parts stores. Losses from inventory obsolescence have not been significant historically which we attribute to the successful operation of our classification system, including product return privileges with most of our suppliers.\nIn Europe, we operate Alliance Automotive Group (“AAG”), headquartered in London, England. Europe is predominantly a DIFM market, with very few over-the-counter sales. We serve thousands of vehicle repairers, collision shops and auto-centers from over 2,500 distributor outlets across Europe, supported by a logistics infrastructure of national and regional distribution centers. Our distributor outlets include company-owned and independent auto part stores and outlets, heavy vehicle outlets, and online and specialty outlets. Our European \n3\nTable of \nContents\nbanners include Groupauto, Precisium and Pièces Auto in France; Coler, Busch, Hennig and Knoll in Germany; Groupauto, UAN, FPS Distribution, APEC Braking, BTN Turbo, Platinum International, Alliance Automotive U.K. Subsidiaries, and J&S Automotive Distributors in the U.K. and Republic of Ireland; PartsPoint in Belgium and the Netherlands; Lausan, Soulima and Gaudi in Spain and Portugal; and GroupAuto in Poland. In France, we also provide parts and services for heavy duty and diesel vehicles under the Todd banner and we operate Back2Car, which distributes recycled car parts. In the Netherlands and Belgium, we offer programs for repair shops that want to join our installer network to increase their visibility and brand awareness while remaining independent. Separately in Europe, we operate WinParts, an online platform for customers to browse, purchase, and have automotive products delivered to their homes or businesses. \nIn Australia and New Zealand, we operate GPC Asia Pacific – the region’s largest automotive aftermarket parts supplier. We resell and distribute automotive replacement parts, accessories and related tools and equipment through a network of company-owned retail stores and advanced distribution centers. In our Australasian operations, we go to market solely with a company-owned store model. GPC Asia Pacific operates three main lines of business: Automotive Australia, Automotive New Zealand and Two Wheel Division. Automotive Australia and Automotive New Zealand operate our auto parts stores in Australia and New Zealand under two banners: (i) Repco, which operates a nationwide dual-format store network across both countries, providing parts, equipment, tools, batteries, technology, and oil to both trade and retail customers, and (ii) NAPA Auto Parts, which offers automotive electrical and mechanical parts to trade, fleet, industrial, commercial and mining specialist customers. Both Repco and NAPA compliment their network with the market's leading digital capability, providing our customers with a seamless omni-channel transactional capability. Our Two Wheel Division is a whole seller and retails motorcycle parts, apparel and accessories, with the market's leading range of the world’s most respected motorcycle brands, many of which are supplied under exclusive distribution agreements. Two Wheel Division operates two wholesale banners (McLeod Accessories and John Titman Racing), and also operates Australia's largest and fastest growing motorcycle accessories and apparel retailer (AMX Super Stores).\nDistribution Network.\n    Our independently-owned and company-owned stores located in every region are sourced by our distribution networks. Both types of automotive stores sell to a wide variety of customers in the automotive aftermarket. We strategically locate our stores close to repair shops and autocare service centers, which are our primary customers, and we deliver products to our customers routinely throughout each business day by delivery vehicles. Traditional over-the-counter retail sales make up a smaller part of our overall business and vary by geography. \nIndependently-owned stores purchase inventory from our company-operated distribution centers. These independently-owned stores are responsible for operating and managing their businesses, including operating costs and capital expenditures. We generally do not receive a royalty from independently-owned stores. Independently-owned stores, which represent 63% of our total automotive store network, provide a competitive advantage in certain markets by allowing for local market knowledge and insights, enabling quicker adaptation to local customer preferences.\nThe mix of independently-owned versus company-owned stores in a given market varies based on several factors including our overall market strategy, the ability to access desirable local retail space, the complexity, profitability and expected ultimate size of the market and our ability to provide operational support within a geographic region. In 2024, as part of our strategic financial objectives to grow revenue and improve operating margins, we made a pivot in strategy in the U.S. to own more stores in priority markets. We made significant progress on this initiative in 2024, including the acquisition of our two largest independently owned stores groups, Motor Parts & Equipment Corporation (\"MPEC\") and Walker Automotive Supply, Inc (\"Walker\"), and completed strategic acquisitions of more than 500 NAPA stores from independent owners, as well as competitive stores, bringing our company owned store count to approximately 35% of our store mix. These acquisitions are in key markets where we can provide synergies and resources for these stores to further drive revenue growth. \nDuring 2024, we expanded our network with the addition of 41 net new stores during the year. The following table details the breakdown of our Automotive distribution network including our distribution centers, company-owned and independently-owned automotive stores by geographic region as of December 31, 2024.\nNorth America\nEurope\nAustralasia\nTotal\nDistribution centers\n75 \n73 \n14 \n162 \nCompany-owned stores\n2,279 \n782 \n561 \n3,622 \nIndependently-owned stores\n4,464 \n1,760 \n— \n6,224 \nTotal automotive locations\n6,818 \n2,615 \n575 \n10,008 \n4\nTable of \nContents\nRepair Center Networks\n.\n    We provide programs for repair centers to join regional networks to leverage our branding and supply network to increase their visibility and awareness while remaining independent. The largest of these is our independent NAPA Auto Care center network in the U.S. and Canada, which includes over 19,000 locations nationwide. \nNAPA\n.\n    We are the sole member of the National Automotive Parts Association, LLC a voluntary association formed in 1925 to promote the distribution of automotive parts for its members. NAPA, which neither buys nor sells automotive parts, functions as a trade association that develops marketing concepts and programs for its sole member.\nAmong the automotive products purchased by us from various manufacturers for distribution are certain lines designated, cataloged, advertised and promoted as “NAPA” lines. Generally, we are not required to purchase any specific quantity of parts and we may purchase competitive lines from the same as well as other supply sources.\nWe use the federally registered trademark NAPA\n®\n as part of the trade name of many of our distribution centers and parts stores in the U.S., Canada and Australia. We fund NAPA’s advertising program, which is designed to increase public recognition of the NAPA brand and to promote NAPA product lines.\nWe are a party to, together with the former members of NAPA, a consent decree entered by the Federal District Court in Detroit, Michigan, on May 4, 1954. The consent decree enjoins certain practices under the federal antitrust laws, including the use of exclusive agreements with manufacturers of automotive parts, allocation or division of territories among us and former NAPA members, fixing of prices or terms of sale for such parts among such members, and agreements to adhere to any uniform policy in selecting parts customers or determining the number and location of, or arrangements with, auto parts customers.\nCompetition.\n    The automotive aftermarket is highly competitive. We compete with other national, regional and local automotive parts chains, automobile manufacturers (some of which sell replacement parts for vehicles built by other manufacturers as well as those that they build themselves), automobile dealers, and warehouse clubs. In addition, we compete with the distributing outlets of parts manufacturers, mass merchandisers (including national retail chains) and other parts distributors and retailers, including online retailers. We compete primarily on availability of product offering, service, brand recognition and price. Our automotive competitors include AutoZone, Inc., O-Reilly Auto Parts, Inc., Advance Auto Parts, Inc., LKQ Corporation (predominantly in Europe) and Bapcor (Australasia), among many others. Further information regarding competition in the industry is set forth in “",
    "item1a": "Item 1A. Risk Factors — Strategic and Operational Risks.”\n16\nTable of \nContents",
    "item1b": "ITEM 1B\n. \nUNRESOLVED STAFF COMMENTS\n.\nNot applicable.",
    "item1c": "ITEM 1C\n. \nCYBERSECURITY.\nOur information security program is managed by a dedicated Chief Information Security Officer (\"CISO\"), whose team is responsible for leading enterprise-wide cybersecurity strategy, risk assessment and management policies, standards, architecture, and processes. \nThe \nCISO\n, along with the Chief Information and Digital Officer (\"CIDO\"), each have over 20 years of prior work experience in various roles involving information technology, including security, compliance, and systems.\n \nThe CISO provides periodic reports, which take into account information from internal stakeholders, known privacy and security vulnerabilities, threat detection plans, and information from external sources such as reported security incidents, industry trends, and \nthird-party evaluations to our executive leadership team and, as well as regular updates to our Audit Committee.\n The Audit Committee receives regular updates specific to the company’s cyber security program and IT security risk, including threat protection posture, IT compliance reporting, and IT risk posture. \nThe Board of Directors (\"Board\") has ultimate oversight for risks relating to our information security program and practices and receives periodic updates from the Audit Committee Chair on cybersecurity and IT security risk and mitigation strategies, as well as periodic updates directly from the CIDO and CISO.\n Our program is regularly evaluated by internal and external resources with the results of those reviews reported to senior management, the Audit Committee and the Board.\n We also actively engage with key vendors, industry participants, and intelligence and law enforcement communities for benchmarking and awareness of best practices as part of our continuing efforts to evaluate and enhance the effectiveness of our information security policies and procedures. \nAs part of our cybersecurity risk management system, our governance, risk and compliance team tracks and logs privacy and security incidents across GPC as well as performs third-party risk management to identify and mitigate risks from third parties such as vendors and suppliers.\n The results of our evaluations and the feedback from our engagements are used to drive alignment on, and prioritization of, initiatives to enhance our cybersecurity strategies, policies, and processes and make recommendations to improve processes.\nOur policies, standards, processes and practices for assessing, identifying, and managing material risks from cybersecurity threats are integrated into our overall risk management program to ensure that cybersecurity considerations are an integral part of our decision-making processes and are based on frameworks established by the National Institute of Standards and Technology Cybersecurity Framework (“NIST CSF”) and other applicable industry standards.\n In connection with our information security program, we perform ongoing internal and external risk assessment activities, and deploy systems, processes, and procedures across our global business units in response to identified risks. As cybersecurity events are detected via our global processes, the potential impact of the events is assessed based on criticality, and mitigation and remediation actions are taken in accordance with our incident response plan. The incident response plan is periodically evaluated by our cybersecurity team as well as by independent advisors using simulated security exercises. Security awareness training is also key component of our information security program and involves required training for all our teammates and contingent workers.\nAlthough we have not experienced a material breach of cybersecurity to date, our computer systems and the computer systems of our third-party service providers have been, and will likely continue to be, subjected to unauthorized access or phishing attempts, computer viruses, malware, ransomware or other malicious codes. Despite our security measures, there can be no assurance that we, or the third parties with which we interact, will not experience a cybersecurity incident in the future that will materially affect us. For more information about these and other information security risks we face, see “"
  }
}