{
  "ticker": "GRMN",
  "cik": "0001121788",
  "company_name": "GARMIN LTD",
  "filing_date": "2025-02-19",
  "accession": "0000950170-25-022760",
  "primary_doc": "grmn-20241228.htm",
  "item_sections": {
    "item1": "Item 1.\t\nBusiness\n\n\n \n\n\nCompany Overview\n \n\n\n \n\n\nFor more than 35 years, Garmin Ltd. and its subsidiaries (collectively, we, our, us, the Company or Garmin) have pioneered new products, many of which feature location technology such as Global Positioning System (GPS), and applications that are designed for people who live an active lifestyle. Garmin serves five primary markets: fitness, outdoor, aviation, marine, and auto OEM. We design, develop, manufacture, market, and distribute a diverse family of GPS-enabled products and other navigation, communications, sensor-based and information products for these markets, as well as products installed by original equipment manufacturers (OEMs) and for aftermarket applications. Since the inception of its business, Garmin has delivered over 300 million products, which included more than\n \n18 million products delivered during fiscal 2024.\n\n\n \n\n\nAvailable Information\n \n\n\n \n\n\nGarmin’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statement and Forms 3, 4 and 5 filed by Garmin’s directors and executive officers and all amendments to those reports will be made available free of charge through the Investor Relations section of Garmin’s website (www.garmin.com) as soon as reasonably practicable after such material is electronically filed with, or furnished to, the Securities and Exchange Commission (the SEC). The SEC maintains a website (\nwww.sec.gov\n) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The reference to Garmin’s website address does not constitute incorporation by reference of the information contained on this website, and such information should not be considered part of this report on Form 10-K or in any other report or document we file with the SEC, and any references to our website are intended to be inactive textual references only.\n\n\n \n\n\nThis discussion of Garmin should be read in conjunction with, and is qualified by reference to, “Management's Discussion and Analysis of Financial Condition and Results of Operations” under Item 7 herein and the information set forth in response to Item 101 of Regulation S-K in such Item 7 is incorporated herein by reference in partial response to this Item 1.\n\n\n \n\n\nProducts\n \n\n\n \n\n\nGarmin offers a broad range of solutions across its reportable segments as outlined below. In general,\n \nGarmin believes that its products are known for their value, high performance, ease of use, innovation, and appealing design.\n \n\n\n \n\n\nMany of the Company’s products utilize GPS and other global navigation satellite systems (GNSS) receivers to support product features such as navigation, global positioning, and tracking. GPS is a United States owned satellite network constellation that supports global positioning, timing, and navigation, providing precise geographic location and related data to both commercial and government GPS receivers. Access to and use of the GPS systems commercial signal bands is provided free of charge.\n \n\n\n \n\n\nIn addition to GPS, Garmin products utilize other GNSS including the Russian Global Navigation Satellite System (GLONASS), the European Union Galileo system (Galileo), and the Chinese BeiDou Navigation Satellite System (BDS). Garmin products also use satellite-based augmentation systems (SBAS) including the U.S. Wide Area Augmentation System (WAAS), the Japanese MTSAT-based Satellite Augmentation System (MSAS), and the European Geostationary Navigation Overlay Service (EGNOS) for aviation Safety of Life (SoL) services. Garmin also uses localized satellite-based systems including the Quasi-Zenith Satellite System (QZSS) and the Indian Regional Navigation Satellite System (IRNSS), with an operational name of NavIC (Navigation with Indian Constellation).\n\n\n \n\n\nOn a subscription basis, certain Garmin products offer access to private satellite networks such as the Iridium satellite network, a synchronized constellation of 66 low Earth orbit (LEO) satellites offering global data communication coverage. Iridium’s satellite constellation offers global coverage to enable reliable satellite-based communication.\n\n\n4\n\n\n\n\n \n\n\n \n\n\nFitness\n\n\n \n\n\nGarmin offers a broad range of products designed for use in health, wellness, and fitness activities. Garmin currently offers the following product categories within the Fitness segment to consumers around the world:\n\n\n \n\n\n•\nRunning and Multi-sport Watches: \nGarmin running and multi-sport watches are offered under the Forerunner® product series. The Forerunner series offers GPS-enabled watches with features unique to each model. Depending on the model, features include wrist-based heart rate monitoring, wrist-based pulse oximeter, AMOLED displays, music storage capabilities, mapping capabilities, LTE Connectivity, solar charging, and Garmin Pay™ contactless payment.\n\n\n \n\n\n•\nCycling Products:\n Garmin cycling products include cycling computers (with solar charging on select models), power meters, bike radars, cameras, smart lights, and speed and cadence sensors. Additionally, Garmin offers Tacx® indoor training equipment including smart and basic trainers, and a smart bike. \n\n\n \n\n\n•\nSmartwatch Devices:\n Garmin offers a wide range of smartwatch devices. The Garmin product offerings include GPS-enabled smartwatches, fashion-forward hybrid smartwatches with analog style displays, and activity tracking fitness bands. The smartwatch devices offered by Garmin are the Venu® series, vívoactive® series, vívomove® series, Lily® series, vívosmart® series, and Bounce™ series. Each series of smartwatch devices offered has unique features, all to enhance and promote healthy and active lifestyles. Features of the smartwatch devices, depending on the series and model, include wrist-based heart rate monitoring, AMOLED displays, ECG app, Garmin Pay, music storage capabilities, and 24/7 health monitoring. \n\n\n \n\n\n•\nScales and Monitors:\n Garmin offers a range of fitness accessories including chest strap heart rate monitors, smart scales, and blood pressure monitors.\n\n\n \n\n\n•\nGarmin Connect and Garmin Connect Mobile:\n Garmin Connect™ and Garmin Connect™ Mobile are web and mobile platforms where users can track and analyze their fitness, activities and workouts, and wellness data. In addition, users can share their accomplishments, create training groups and group challenges, and get feedback and encouragement from the Connect community.\n\n\n \n\n\n•\nConnect IQ:\n The Connect IQ™ application development platform enables third parties to create a variety of applications that run on a wide assortment of Garmin devices. Connect IQ provides developers with an easy-to-use software development kit (SDK) to facilitate development efforts in creating watch faces, applications, widgets, and data fields. These third-party applications are available for download by Garmin users via their mobile phone or computer and run on their compatible Garmin wearable, bike computer, golf, or outdoor handheld devices.\n\n\n \n\n\nOutdoor\n\n\n \n\n\nGarmin offers a broad range of products designed for use in outdoor activities. Garmin currently offers the following product categories within the Outdoor segment to consumers around the world:\n\n\n \n\n\n•\nAdventure Watches:\n Garmin adventure watches offer a wide range of features, including wrist-based biometrics, sports apps, solar charging, music storage capabilities, preloaded full-color purpose-built adventure mapping of topography, ski resorts, and golf courses, built-in LED flashlights, speakers, microphones, and Garmin Pay™, depending on the model. The fēnix® series is for active lifestyle users seeking a premium smartwatch experience. The Instinct® series offers features for users seeking a rugged and reliable outdoor GPS smartwatch. The tactix® series is for users looking for tactical-inspired features, such as night vision compatibility and stealth mode. The Enduro™ series is for users who want additional battery and solar charging enhancements to extend battery life. The MARQ® series collection of watches is for users seeking a luxury smart tool watch with premium materials\n.\n\n\n \n\n\n5\n\n\n\n\n \n\n\n•\ninReach® and Garmin Response: \nGarmin offers several product lines that feature Garmin’s inReach capabilities. These devices include Iridium’s global satellite communication technology which, when combined with an active service plan, offers two-way text messaging, photo and voice messaging, weather forecasts, and S.O.S. capabilities while anywhere in the world, depending on the model. These S.O.S. capabilities are supported 24/7 by Garmin’s professionally trained associates at Garmin Response, our global emergency response coordination center.\n\n\n \n\n\n•\nOutdoor Handhelds and Satellite Communicators:\n Garmin offers devices under the Montana®, eTrex®, GPSMAP®, and inReach product lines. Devices range from basic waypoints navigators to advanced color touchscreen devices offering barometric altimeter, 3-axis compass, camera, preloaded maps, wi-fi and smartphone connectivity, two-way satellite communication using InReach technology, solar charging, and other features.\n\n\n \n\n\n•\nGolf Devices:\n Garmin golf devices are offered under the Approach® product line. The Approach series includes watches, laser range finders, launch monitors, simulators, club sensors, and handhelds. Garmin maintains a comprehensive collection of over 43,000 golf course maps to provide useful information during real or simulated rounds. Wearable and handheld golf devices provide yardage distances to the front, back, and middle of the green. In addition to course maps, the Approach R50 portable launch monitor and simulator provides swing metrics utilizing three different cameras, which can track more than 15 ball and club metrics, including measured spin rate and spin axis, providing precision analytics for every club, as well as the ability to play a simulated round on the built-in 10-inch touchscreen. The Garmin Golf™ mobile app also offers scoring, shot tracking, and performance tracking features, in addition to the Home Tee Hero virtual round simulator for subscribers.\n\n\n \n\n\n•\nConsumer Automotive:\n Garmin is a leading manufacturer of personal navigation devices (PNDs), integrated and standalone dash cams, and auto accessories that include specialized features dedicated to a wide variety of vehicle and driver needs. Both the Drive series of full-featured traditional PNDs and the Garmin Dash Cam™ series of GPS-enabled dash cams serve a wide range of consumers. The dēzl™ ecosystem offers a broad range of products for professional truck drivers including headsets, electronic logging devices, and PNDs with over-the-road trucking features. The zūmo® series of PNDs is for users seeking motorcycle-specific features. The RV series of PNDs offers features specific to the RV enthusiast. Tread® is a line of rugged, all-terrain navigators with mapping specific for off-road guidance for overlanding, off-roading, and Baja racing, as well as live team tracking through integrated inReach technology in certain models. The Garmin Catalyst™ is an industry-first racing coach and driving performance optimizer.\n\n\n \n\n\n•\nSportsman and Dog Devices\n: Garmin offers sportsman devices under the Xero® product line, including the Xero® C1 Pro Chronograph, which can measure projectile speeds from 100 to 5,000 feet per second. Garmin also offers a variety of dog tracking and training devices, including those under the Alpha®, PRO, BarkLimiter™, and Delta® product lines. \n\n\n \n\n\n•\nDive Devices\n: Garmin offers the Descent™ dive computer watch series for users wanting diving functionality, including integrated air pressure monitoring, support for up to six gasses, and multiple dive modes. The Descent X50i large-format wearable dive computer provides additional functionality through a vibrant 3-inch touchscreen display. Garmin Descent transceivers allow users to monitor up to eight tanks when under water, viewing air pressure, depth, use rate and time remaining for multiple types of diving when paired with a compatible air-integrated Descent dive computer. \n\n\n \n\n\nAviation\n \n\n\n \n\n\nGarmin designs, manufactures, and markets a wide range of innovative aircraft avionics solutions to the broad and diverse aviation sector. Avionics are sold directly into aircraft OEM applications as well as through Garmin’s worldwide dealer network for retrofit installations on existing aircraft.\n\n\n \n\n\nGarmin has developed innovative products and technologies serving general aviation, business aviation, rotorcraft, and experimental/light sport markets. Our solutions are available for all aircraft categories and classes; from small piston and electric-powered general aviation aircraft to large business jet aircraft, as well as a wide-ranging variety of helicopters, including those serving critical public service and oil/gas missions.\n\n\n6\n\n\n\n\n \n\n\n \n\n\nGarmin also provides highly differentiated products and service solutions to other growth markets such as commercial air-carrier, military and defense, electric aircraft, and the Advanced Air Mobility / eVTOL space. By offering products such as Commercial Off-The-Shelf (COTS) and mission-optimized solutions to military and defense contractors/customers, and products tested and optimized for high duty cycle commercial aviation operations, Garmin is emerging as a strong competitor in these business arenas.\n\n\n \n\n\nGarmin currently offers the following products, systems, and services to the global aviation market:\n\n\n \n\n\n•\nIntegrated Flight Decks:\n \nKnown for defining the integrated flight deck (IFD) space in general aviation and light business aviation applications, Garmin recently introduced its third-generation IFD offering to OEMs and retrofit IFD applications. These solutions can be scaled for any size aircraft and rotorcraft, featuring communication and navigation, weather information, terrain and traffic awareness and avoidance, aircraft performance, and automated safety solutions.\n\n\n \n\n\n•\nElectronic Flight Displays and Instrumentation: \nGarmin flight display and instrument solutions can serve as primary or back-up systems, which also provide a wealth of valuable information in the cockpit, dramatically increasing situational awareness and capability.\n\n\n \n\n\n•\nNavigation and Communication Products: \nGarmin offers a wide range of integrated and stand-alone GPS navigation and very high frequency (VHF) radio communication products, with a variety of capabilities, available for all market segments. \n\n\n \n\n\n•\nAutomatic Flight Control Systems and Safety-Enhancing Technologies:\n \nGarmin offers scalable flight control systems with unique integrated safety features for aircraft and rotorcraft. Our Autopilots, and Autonomí™ safety-enhancing solutions cover a wide spectrum of aircraft, from super mid-size cabin business jets and helicopters to light general aviation aircraft. Garmin’s award-winning Autoland system will autonomously land the aircraft in the event the pilot is not able to do so, and Smart Glide™ will assist a pilot to get to the nearest airport in the event of the loss of engine power. We also offer an innovative Smart Rudder Bias system that can help the pilot maintain control of a twin-engine aircraft in the event of an engine failure. \n\n\n \n\n\n•\nAudio Control Systems:\n \nGarmin produces a broad array of cutting-edge audio systems, including panel-mount and remote-mounted units, incorporating features such as Bluetooth connectivity, voice command technology, and integrated intercoms.\n\n\n \n\n\n•\nEngine Indication Systems:\n \nGarmin offers a variety of stand-alone and integrated advanced engine indication systems for piston and turbine-powered aircraft with comprehensive data-logging capabilities as well as wireless data offloading, cloud storage and analysis capability through our flyGarmin.com online services portal.\n\n\n \n\n\n•\nTraffic Awareness and Avoidance Solutions:\n \nGarmin offers an array of traffic advisory and collision avoidance systems, including TAS and TCAS / ACAS solutions, with applications in all types of aircraft.\n\n\n \n\n\n•\nADS-B and Transponders:\n \nGarmin offers a full lineup of ADS-B and transponder solutions, including ADS-B “Out” compliant solutions as well as ADS-B “In” and Bluetooth capable units that allow pilots to connect to their mobile device to display ADS-B traffic and weather. Our ADS-B solutions also enable safety technologies like Runway Occupancy Awareness and CDTI-Assisted Visual Separation.\n\n\n \n\n\n•\nWeather Information and Avoidance Solutions:\n \nGarmin offers multiple weather solutions, including onboard Doppler digital radar products, along with satellite-based SiriusXM, ground-based ADS-B, as well as Garmin Connext® global satellite weather options.\n\n\n \n\n\n•\nDatalink and Connectivity:\n \nGarmin datalink and connectivity solutions allow pilots to download global weather data, communication via text/voice, as well as select mobile apps to transfer flight plans, manage database subscriptions, perform automatic database updates, monitor aircraft systems in real time 24/7, and stream weather and traffic data from installed avionics solutions.\n\n\n \n\n\n7\n\n\n\n\n \n\n\n•\nPortable GPS Navigators and Wearables:\n \nGarmin offers portable GPS navigators, smartwatches for pilots, satellite communicators, and portable traffic and weather solutions, providing pilots tools they can take with them from aircraft to aircraft.\n\n\n \n\n\n•\nServices:\n \nGarmin offers a variety of services products to the aviation market. Web and mobile app-based products offered via FltPlan.com and our Garmin Pilot™ electronic flight bag application, help pilots plan, file, fly, and log flights and offer a wealth of information across all phases of flight. Business and commercial aviation customers also benefit from our FltPlan® safety management system, and our AeroData solutions consisting of runway analysis and performance data, weight and balance, obstacle clearance, load planning, and navigation database products. Garmin continues to provide industry-leading product support, and offers a wide selection of databases, training products, extended warranties, and subscription services for all aviation segments.\n\n\n \n\n\nMarine\n\n\n \n\n\nGarmin is a leading manufacturer of recreational marine electronics and offers a broad range of products. Garmin currently offers the following product categories within the Marine segment to consumers around the world:\n\n\n \n\n\n•\nChartplotters and Multi-Function Displays (MFDs):\n Garmin offers \nnumerous chartplotters/MFDs under the GPSMAP® and ECHOMAP™ product lines. The offerings range from 4-inch portable and fix-mounted products to 27-inch fully integrated Glass Helm offerings with 4k resolution displays and include wireless connectivity to the ActiveCaptain® mobile app.\n\n\n \n\n\n•\nCartography\n: Garmin is a leading supplier of cartography for the recreational marine market. Garmin Navionics Vision+\n™\n and Navionics Platinum+\n™\n charts are compatible with most major chartplotters and MFDs on the market. Major features include the patented Auto Guidance+™ routing technology, satellite imagery, and 3D views\n.\n\n\n \n\n\n•\nFishfinders:\n \nGarmin offers an advanced line of fishfinders, the Striker™ series, which incorporates GPS technology enabling Garmin Quickdraw™ Contours, and wireless features through the ActiveCaptain and StrikerCast mobile apps.\n\n\n \n\n\n•\nSONAR:\n Garmin offers the LiveScope™ sonar system producing high resolution, live sonar views showing the true action under water. LiveScope provides real-time, high-resolution images that can be seen in downward, perspective, and forward-looking views for locating the fish and seeing what is coming before you get there. The Panoptix™ line shows detailed 3D underwater views of fish and structure under your boat with real-time images up to 1,000 feet deep. Garmin’s CHIRP “black-box” sounders and CHIRP transducers interface with Garmin MFDs to enhance their utility by providing the deep-water sounders and fishfinder functions in a remote mounted package.\n\n\n \n\n\n•\nAutopilot Systems: \nGarmin offers full-featured marine autopilot systems designed for sailboats and powerboats. The systems incorporate such features as remote steering, speed control, and Garmin’s patented Shadow Drive™ technology, which automatically disengages the autopilot if the helm is turned. Garmin has also introduced steer-by-wire autopilot capabilities for various types of steering systems.\n\n\n \n\n\n•\nRADAR: \nGarmin offers high-tech solid state Fantom™ radar with MotionScope™ Doppler technology, lowering system power consumption and increasing reliability, while greatly improving situational awareness of the captain. Fantom radars are available in both radome and open array radar products with compatibility to any network-compatible Garmin chartplotter. Garmin also offers a full line of magnetron radars with up to 25kW of transmit power.\n\n\n \n\n\n•\nInstruments\n: Garmin offers NMEA 2000 and NMEA 0183 compliant instrument displays and sensors that show data from multiple remote sources on one screen.\n\n\n \n\n\n•\nVHF Communication Radios:\n Garmin offers a full line-up of marine VHF radios and Automatic Identification System (AIS) transceivers with the latest feature sets including integrated GPS receivers \n\n\n8\n\n\n\n\n \n\n\nfor the communication needs of all types of mariners. Garmin radios are NMEA 2000 compatible, offer multi-station support, and monitor all AIS channels.\n\n\n \n\n\n•\nHandhelds and Wearable Devices:\n Garmin offers the quatix® series wearable, GPS-enabled smartwatches designed for mariners, which include marine features for navigation, sailing, stereo control, autopilot functions, tidal information, a built-in LED flashlight, and solar charging, depending on model. Garmin also offers floating marine GPS handhelds with wireless data transfer between compatible units and preloaded cartography. Some handhelds contain built-in inReach\n®\n satellite communication and support Connect IQ™ applications.\n\n\n \n\n\n•\nSailing:\n \nGarmin has integrated many basic and advanced sailing features into our MFD and instrument systems. These Garmin SailAssist™ features include enhanced wind rose with true and apparent wind data, POLAR tables, pre-race guidance, synchronized race timer, virtual starting line, time to burn and lay line data fields. \n\n\n \n\n\n•\nAudio:\n \nGarmin’s audio brands, Fusion® and JL Audio®, offer premium audio products and accessories, including head units, speakers, amplifiers, subwoofers, and other audio components. These products are designed specifically for the marine, powersports, aftermarket automotive, RV, and home environments, offering premium sound quality and supporting many connectivity options for integrating with MFDs, smartphones, and Garmin wearables.\n\n\n \n\n\n•\nDigital Switching:\n \nGarmin offers digital switching products under the EmpirBus™ product line. The Garmin EmpirBus products provide power distribution and control solutions for marine and RV applications which enable advanced logic controls and automation to add smart electrical system features in a boat or RV. The system features fully customizable graphics and user interface that can be controlled through Garmin’s marine multi-function displays and RV OEM products.\n\n\n \n\n\n•\nTrolling Motors:\n \nGarmin offers the Force\n®\n Trolling Motor series, powerful, efficient trolling motors with built-in CHIRP and Ultra High-Definition ClearVü™ and SideVü™ sonar. The product line includes the Force Kraken with sizes from 48” to 90” shaft length and a smaller mounting footprint. The Force product line also connects wirelessly to Garmin chartplotters/MFDs to provide navigation, autopilot, and anchor lock integration.\n\n\n \n\n\n•\nLighting:\n \nGarmin is a premier supplier of above water and below water lighting for marine and RV markets under the Lumishore\n®\n name. The Lumishore product lines include single color, dual color, and full RGB lighting opens in a variety of power levels and installation options. These high-performance products offer zone control, automation, including audio inputs and integrate with Garmin’s MFD/mobile app systems.\n\n\n \n\n\nAuto OEM\n\n\n \n\n\n\tGarmin has cultivated key relationships with leading automobile manufacturers to be the provider of a variety of hardware and software solutions for their vehicles. Garmin currently offers the following product categories to the global auto market:\n\n\n \n\n\n•\nDomain Controllers: \nGarmin is a tier-one supplier of domain controllers, offering remote computing modules that control various systems throughout a vehicle including infotainment, instrumentation, key advanced driver-assistance systems (ADAS) functionality, and rear seat entertainment.\n\n\n \n\n\n•\nInfotainment Units:\n \nGarmin is a tier-one supplier of infotainment solutions, with offerings including centralized control and integrated multi-display platforms for premium audio and multimedia, navigation, cameras, smartphone links, customized voice recognition and personal assistants, and rear-seat entertainment instrument clusters.\n\n\n \n\n\n•\nOther: \nGarmin offers a collection of software, map database, camera, wearable, and other automotive solutions.\n\n\n9\n\n\n\n\n \n\n\n \n\n\nSales and Marketing\n \n\n\n \n\n\nGarmin’s distribution strategy is to support a broad and diverse network of sales channels for our products while maintaining high quality standards to ensure end-user satisfaction. Our products are sold through a variety of indirect distribution channels, including a large worldwide network of independent retailers, dealers, distributors, installation and repair shops, and OEMs. We also sell our products and services directly through our online webshop (garmin.com), subscriptions for connected services, and our own retail stores. During 2024, the Company’s net sales through its direct distribution channels accounted for greater than 10% of total net sales. Marketing support is provided geographically from Garmin’s offices around the world.\n\n\n \n\n\nCompetition\n \n\n\n \n\n\nWe operate in highly competitive markets, though competitive conditions vary among our diverse target markets and geographies. Garmin believes the principal competitive factors impacting the market for its products are design, functionality, quality and reliability, customer service, brand, price, time-to-market and availability. Garmin believes that it generally competes favorably in each of these areas and as such, is generally a significant competitor in each of our major markets.\n\n\n \n\n\nGarmin believes that its principal competitors for fitness products are Apple, Bryton, Coros, Elite, Fitbit (Google), Huawei, Oura, Polar, Samsung, SRAM, Suunto, Wahoo Fitness, Whoop, Xiaomi, Zepp Health, and Zwift. Garmin believes that its principal competitors for outdoor product lines are Apple, Casio, Coros, Dogtra, Globalstar, Infinition, Rand McNally, Samsung, Shearwater Research, SportDOG, Suunto, TAG Heuer, Tissot, TomTom, Trackman, Uneekor, Vista Outdoor, and Zoleo. Garmin considers its principal avionics competitors to be Aspen Avionics, Avidyne, Dynon Avionics, ForeFlight / Jeppesen (Boeing), Genesys Aerosystems, Honeywell Aerospace & Defense, Innovative Solutions and Support Inc., Collins Aerospace (Raytheon), Safran, Thales, and Universal Avionics Systems Corporation. For marine products, Garmin believes that its principal competitors are Furuno, Johnson Outdoors, Navico (Brunswick), and Raymarine (Teledyne). Garmin believes that its principal competitors for auto OEM infotainment solutions are Alpine Electronics, Aptiv, Bosch, Continental, Harman (Samsung), Panasonic, and Visteon.\n \n\n\n \n\n\nResearch and Development\n\n\n \n\n\nGarmin’s product innovations are driven by its strong emphasis on research and development and the close partnership between Garmin’s engineering and manufacturing teams. Garmin’s products are created by its engineering and development staff. Garmin’s manufacturing staff includes manufacturing process engineers who work closely with Garmin’s design engineers to ensure manufacturability and manufacturing cost control for its products. Garmin’s development staff includes industrial designers, as well as software engineers, electrical engineers, mechanical engineers, and cartographic engineers.\n \n\n\n \n\n\nManufacturing and Operations\n \n\n\n \n\n\nGarmin believes one of its core technology competencies is its vertically integrated manufacturing capabilities at its facilities in Taiwan, the U.S., the Netherlands, Poland, and China. Garmin believes that operation of its own manufacturing facilities and distribution networks provides significant capability and flexibility to address the breadth and depth of resources necessary to serve its diverse products and markets.\n\n\n \n\n\nSpecifically, Garmin believes that the vertical integration of its manufacturing capabilities provides advantages to product cost, quality, and time to market.\n \n\n\n \n\n\nCost: \nGarmin’s manufacturing resources rapidly and iteratively prototype designs, concepts, products and processes, achieving higher efficiency and resulting in lower cost. Garmin’s vertical integration approach enables leveraging of manufacturing resources across high, mid, and low volume products. Sharing of these resources across product lines favorably affects Garmin’s costs to produce its range of products, with lower volume products realizing the economies of scale of higher volume products. The ownership and integration of its resources allows\n \nGarmin to optimize the design for manufacturing of its products, yielding improved cost.\n \n\n\n \n\n\n10\n\n\n\n\n \n\n\nQuality:\n Garmin’s automation and advanced production processes provide in-service robustness and consistent reliability standards that enable Garmin to maintain strict process and quality control of the products manufactured, thereby improving the overall quality of our products. Additionally, the immediate feedback throughout the manufacturing processes is shared with the development teams, providing integrated continuous improvement throughout design and supply chain.\n\n\n \n\n\nGarmin’s design, manufacturing, distribution, and service functions in its U.S., Taiwan, China, Netherlands, and U.K. facilities are certified to ISO 9001, an international quality standard developed by the International Organization for Standardization (ISO). Garmin’s automotive operations in Taiwan, China, Poland, and Olathe have achieved IATF 16949 certification, a quality standard for automotive suppliers. Garmin’s Olathe, Kansas and Salem, Oregon aviation operations in the U.S. have achieved certification to AS9100, a quality standard for the aviation industry. Garmin has also implemented multiple health and safety management systems and achieved certification to the ISO 45001 standard for Health and Safety Management at facilities in the U.S., Taiwan, Poland, and China.\n\n\n \n\n\nTime to Market:\n Garmin uses multi-disciplinary teams of design engineers, process engineers, and supply chain specialists to develop products, allowing them to quickly move from concept to manufacturing. This integrated ownership provides inherent flexibility to enable faster time to market.\n \n\n\n \n\n\nMaterials\n\n\n \n\n\nGarmin purchases components from a large number of qualified suppliers. Although many components essential to Garmin’s business are generally available from multiple sources, certain key components are currently obtained by the Company from single or limited sources, which subjects Garmin to supply and pricing risks. For these components, we have limited near-term flexibility to use other suppliers if a current vendor becomes unavailable or is unable to meet our requirements. Extended disruptions at these suppliers could impact our ability to meet customer demand due to component shortages or increased lead times, or cause us to incur higher product costs. However, we mitigate this risk by holding safety stock, and we believe these potential disruptions would not disproportionately disadvantage us relative to our competitors due to our vertical integration strategy, which provides opportunities to quickly deploy new product designs.\n \n\n\n \n\n\nSeasonality\n\n\n \n\n\nOur net sales are subject to seasonal fluctuation. Sales of our consumer products are generally highest in the fourth quarter due to increased demand during the holiday buying season, and many marine products experience increased demand in the first and second quarters in advance of the summer boating season. Sales of our consumer products are also influenced by the timing of the release of new products. Our aviation and auto OEM products do not experience much seasonal variation, but are more influenced by the timing of aircraft certifications, regulatory mandates, auto program manufacturing, and the release of new products when the initial demand is typically the strongest.\n\n\n \n\n\nIntellectual Property\n \n\n\n \n\n\nOur success and ability to compete is dependent in part on our proprietary technology. We rely on a combination of patent, copyright, trademark and trade secret laws, as well as confidentiality agreements, to establish and protect our proprietary rights. In addition, Garmin often relies on licenses of intellectual property for use in its business.\n \n\n\n \n\n\nAs of December 28, 2024, Garmin has been issued over 1,970 patents throughout the world and holds more than 1,190 trademark registrations. The duration of patents varies in accordance with the provisions of applicable local law. We believe that our continued success depends on the intellectual skills of our employees and their ability to continue to innovate. Garmin will continue to file and prosecute patent applications when appropriate to attempt to protect Garmin’s rights in its proprietary technologies.\n \n\n\n \n\n\n11\n\n\n\n\n \n\n\nThere is no assurance that our current patents, or patents that we may later acquire, may successfully withstand any challenge, in whole or in part. It is also possible that any patent issued to us may not provide us with any competitive advantages, or that the patents of others will preclude us from manufacturing and marketing certain products. Despite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our products or to obtain and use information that we regard as proprietary. Litigation may be necessary in the future to enforce our intellectual property rights, to protect our trade secrets, to determine the validity and scope of the proprietary rights of others or to defend against claims of infringement or invalidity.\n\n\n \n\n\nEnvironmental Matters\n \n\n\n \n\n\nGarmin has a global environmental policy and is committed to protecting the environment throughout various aspects of our business. Garmin has implemented multiple environmental management systems and achieved certification to the ISO 14001 standard for Environmental Management at facilities in the U.S., U.K., Taiwan, Poland, and China.\n \n\n\n \n\n\nGarmin strives to reduce our environmental impact by increasing our environmental sustainability efforts. Garmin is committed to reducing greenhouse gas emissions through direct carbon emissions reduction and elimination strategies. Garmin utilizes renewable electricity where it is available to us under reasonable terms and conditions, including at our facilities in Olathe, Kansas. Garmin also continuously works to reduce waste and increase recycling and composting.\n\n\n \n\n\nGarmin’s operations are subject to various environmental laws, including laws addressing air and water pollution and management of hazardous substances and wastes. Substantial noncompliance with applicable environmental laws could have a material adverse effect on our business. Capital expenditures for environmental controls are included in our normal capital budget. Historically, capital expenditures associated with environmental controls have not been material and compliance with environmental laws has not had a material impact on the Company’s competitive position.\n \n\n\n \n\n\nMany of Garmin's products are subject to laws relating to the chemical and material composition of our products and their energy efficiency. Garmin is also subject to extended producer responsibility laws and regulations requiring manufacturers to be responsible for collection, recovery, and recycling of wastes from certain electronic products. Historically, compliance with environmental laws has not had a material impact on our profitability. We have processes to monitor environmental law changes and to evaluate the potential impact of such laws to our business, but the impact of future enactment of environmental laws cannot yet be fully determined and could be substantial.\n\n\n \n\n\nHuman Capital\n \n\n\n \n\n\nSuccessful execution of our strategy is dependent on attracting, developing, and retaining key employees and members of our management team. To facilitate talent attraction and retention, we provide opportunities for our employees to grow and develop in their careers, supported by generous compensation and benefits, and through programs that build connections between our employees and their communities.\n \n\n\n \n\n\nAs of December 28, 2024, the Company had approximately 21,800 full and part-time employees worldwide, of whom approximately 7,700 were in the Americas region, 11,100 were in APAC (Asia Pacific and Australian Continent), and 3,000 were in EMEA (Europe, the Middle East, and Africa). Garmin’s vertical integration model enables us to provide a variety of opportunities across many different professions including engineering, human resources, information technology, marketing, sales, and operations. The Company’s products are created by its engineering and development staff, which numbered approximately 6,000 people worldwide as of December 28, 2024. Garmin’s manufacturing staff, which numbered approximately 10,100 people worldwide as of December 28, 2024, includes manufacturing process engineers who work closely with Garmin’s design engineers to ensure manufacturability and manufacturing cost control for its products.\n\n\n \n\n\nGarmin respects the right of all employees to form and join an association to represent their interests as employees, to organize, and to bargain collectively or individually. We also respect any employee’s choice to refrain from joining a union. Except for some of Garmin’s employees in Sweden, none of Garmin’s employees are represented by a labor union and none of Garmin's North American or Taiwan employees are covered by a collective bargaining agreement. We believe our efforts in managing our workforce have been effective, as evidenced by a strong company culture and positive relations between the Company and our employees.\n\n\n12\n\n\n\n\n \n\n\n \n\n\nWe offer a range of generous benefits programs to our employees that enable us to attract and retain leading talent. In addition to salaries, these programs (which vary by country/region) include stock compensation, savings plans, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, family leave, and an Employee Stock Purchase Plan, which provides employees an opportunity to acquire company ownership for a discounted price. We also invest significant resources in our talent development programs to provide employees with the training and education they need to help achieve their career goals, build relevant skills, and lead their organizations. Business Resource Groups provide opportunities for employees to connect, network, and become involved in community engagement initiatives.\n \n\n\n \n\n\nWe support local community engagement initiatives where we have a business presence, and we provide opportunities for employees to give back to those communities. One such initiative is through active engagement in Science, Technology, Engineering, and Math (“STEM”) community outreach programs. Our strategic aim in these educational programs is to educate and encourage local students of all backgrounds to pursue careers in the engineering field.",
    "item1a": "Item 1A.\tRi\nsk Factors\n\n\nThe risks described below are not the only ones facing our company. Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also impair our business operations. If any of the following risks occur, our business, financial condition or operating results could be materially adversely affected.\n\n\nBusiness Risks\n\n\nIf we are not successful in the continued development, timely manufacture, and introduction of new products or product categories, overall demand for our products could decrease to the extent that lost sales and profits are not entirely offset.\n \n\n\nA significant portion of our revenue has been, and we expect in the future will continue to be, derived from sales of newly introduced products. The market for our products is characterized by rapidly changing technology, evolving industry standards and regulations and changes in customer needs. If we fail to introduce new products, or to modify or improve our existing products, in response to changes in technology, industry standards, regulatory requirements or customer needs, our products could rapidly become less competitive or obsolete. We must continue to make significant investments in research and development in order to continue to develop new products, enhance existing products and achieve market acceptance for such products. However, there can be no assurance that development stage products will be successfully completed or, if developed, will achieve significant customer acceptance.\n \n\n\nIf we are unable to successfully develop and introduce competitive new products, and enhance our existing products, our future results of operations would be materially adversely affected. Our pursuit of necessary technology may require substantial time and expense. We may need to license new technologies to respond to technological change. These licenses may not be available to us on terms that we can accept or may materially change the gross profits that we are able to obtain on our products. We may not succeed in adapting our products to new technologies as they emerge. Development and manufacturing schedules for technology products are difficult to predict, and there can be no assurance that we will achieve timely initial customer shipments of new products. The timely availability of these products in volume and their acceptance by customers are important to our future success. Any future challenges related to new products, whether due to product development delays, manufacturing delays, supply chain constraints, lack of market acceptance, delays in regulatory approval, or otherwise, could have a material adverse effect on our business, financial condition and results of operations.\n \n\n\n13\n\n\n\n\n \n\n\n \n\n\nIf we are unable to compete effectively with existing or new competitors, the associated loss of competitive position could result in price reductions, fewer customer orders, reduced margins and loss of market share.\n \n\n\n \n\n\nThe markets for many of our products and services are highly competitive, and we expect competition to increase in the future. Some of our competitors have significantly greater financial, technical and marketing resources than we do. These competitors have been able to replicate certain features offered by some of our products and services or respond more rapidly to emerging technologies or changes in customer requirements. They may also be able to devote greater resources to the development, promotion and sale of their products or secure better product positioning with retailers. In addition, some of our original equipment manufacturer (OEM) customers may develop in-house equipment and components that they currently purchase from us. Increased competition could result in price reductions, fewer customer orders, reduced margins and loss of market share. Our failure to compete successfully against current or future competitors could materially adversely affect our business, financial condition and results of operations.\n \n\n\n \n\n\nWe may experience unique economic and political risks associated with companies that operate in Taiwan.\n \n\n\n \n\n\nOur principal manufacturing facilities for consumer products are located in Taiwan. The People’s Republic of China, also referred to as the PRC, asserts sovereignty over all of China, including Taiwan, certain other islands, and all of mainland China. The PRC government does not recognize the legitimacy of the Taiwan government. Although significant economic and cultural relations exist between Taiwan and the PRC, the PRC government has indicated that it may use military force to gain control over Taiwan in certain circumstances, such as the declaration of independence by Taiwan. There is also a risk that the PRC government may unilaterally seek to occupy Taiwan, by force if necessary, without a clear triggering event. In this scenario, Garmin’s manufacturing facilities and suppliers based in Taiwan could be subject to disruptions that could have a material negative impact to our operations. The United States' relations with Taiwan are governed by the 1979 Taiwan Relations Act, which signifies when the U.S. switched diplomatic recognition from Taiwan to the PRC, referred to as the \"one-China\" policy. China's relations with Taiwan may also be influenced by changes in relations between the U.S. and China. Deviations from the \"one-China\" policy or other conflicts or disputes could lead to adverse changes in China-U.S. and China-Taiwan relations and could materially adversely affect our manufacturing operations and suppliers based in Taiwan, which could materially adversely affect our business, financial condition and results of operations and the market price and the liquidity of our shares.\n\n\n \n\n\nWe have made and expect to continue making significant investments in the auto OEM segment, the associated cost of which may negatively impact total company profits if auto OEM segment revenue significantly declines.\n\n\n \n\n\nWe have been awarded several tier-one and tier-two auto OEM supplier contracts. To fulfill the associated program commitments, we have invested significantly in facilities, research and development, and other operating expenses and expect to continue doing so. Operating margins associated with these auto OEM programs will negatively impact consolidated operating margin as auto OEM revenue increases as a percentage of consolidated revenue. If we are not successful in winning additional contracts, substantially leveraging our past and future investments, and implementing and maintaining efficient manufacturing processes, the auto OEM segment’s contributions to total company profits may be negatively impacted. We may incur substantial restructuring costs if we are unable to generate profits from auto OEM contracts.\n\n\n \n\n\nWe depend on third party suppliers and licensors, some of which are sole source, for technology and components used in our products. Our production and business would be seriously harmed if these suppliers or licensors are not able to meet our demand and alternative sources are not available, or if the costs of components rise.\n \n\n\n \n\n\nWe are dependent on third party suppliers for various components used in our current products. Some of the components that we procure from third party suppliers include semiconductors, liquid crystal displays, memory chips, batteries and microprocessors. The availability of high-quality components at reasonable cost is essential to the successful production and sale of our products. Some components we use are from sole source suppliers.\n \n\n\n \n\n\n14\n\n\n\n\n \n\n\nWe have experienced and may in the future experience shortages of certain components as well as delays in procuring certain components. In addition, a shortage in supply of components may result in an increase of the costs of procuring these components. If suppliers are unable to meet our demand for components on a timely basis or if we are unable to obtain components from an alternative source, or if the price of alternative components is prohibitive, our ability to maintain timely and cost-effective production of our products would be seriously harmed.\n \n\n\n \n\n\nOur products are also dependent on certain licensed technology and content. If we are unable to continue sourcing such technology and content from our licensors and are unable to obtain an alternative source, or if our relationships with our licensors change detrimentally, our ability to provide certain features in our products would be seriously harmed.\n \n\n\n \n\n\nOur business and reputation have been and are expected to continue to be impacted by information technology system failures and network disruptions.\n\n\n \n\n\nThe Company and its global supply chain have experienced and are expected to continue to be exposed to information technology system failures and network disruptions including those caused by natural disasters, human error, accidents, power disruptions, telecommunications failures, acts of terrorism or war, computer viruses, physical or electronic break-ins, and ransomware or other cybersecurity incidents.\n \n\n\n \n\n\nWe have technology and processes in place designed to detect and respond to such failures and disruptions. However, because the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems, and the nature of other potential incidents change frequently and may be difficult to detect for long periods of time, our detection and response measures may be ineffective or inadequate. Furthermore, even with appropriate training conducted in support of such measures, human errors and omissions may still occur resulting in system failures and/or disruptions to our information technology infrastructure. Therefore, the Company’s business continuity and disaster recovery planning, or those of others in our global supply chain, may not be able to sufficiently mitigate all threats.\n\n\n \n\n\nSuch failures or disruptions can materially adversely affect our business, reputation, results of operations, and financial condition through, among other things, a disruption of internal operations, including order processing, invoicing, and manufacturing and distribution of products, and a loss of functionality of critical systems and online services. Actual or anticipated attacks and risks have caused, and are expected to continue to cause, us to incur increasing costs, including costs to deploy additional personnel and protection technologies, to conduct additional employee training, and to engage third party security experts and consultants. Although we maintain cyber insurance coverage that, subject to policy terms and conditions and significant self-insured retentions, is designed to address certain aspects of cyber risks, such insurance coverage may be insufficient to cover all losses or all types of claims that may arise.\n\n\n \n\n\nLosses or unauthorized access to or releases of proprietary or confidential information, including personal information, could result in significant reputational, financial, legal, and operational consequences.\n\n\n \n\n\nWe have in the past experienced, and expect to continue to experience, malicious attacks and other attempts to gain unauthorized access to our systems that seek to compromise the confidentiality, integrity or availability of proprietary and confidential information. A breach of our security systems and procedures or those of others in our global supply chain could result in significant data losses or theft of our intellectual property, confidential and proprietary information, or that of our business partners, as well as our users’ or employees' personal information, which could compromise our competitive position, reputation, operating results, and financial condition. Also, if we fail to reasonably maintain the security of our intellectual property, confidential and proprietary information, or that of our business partners, or the personal information of our users or employees, we may be subject to private litigation, government investigations, regulatory proceedings, enforcement actions, and cause us to incur potentially significant liability, damages, or remediation costs. Although we maintain cyber insurance coverage that, subject to policy terms and conditions and significant self-insured retentions, is designed to address certain aspects of cyber risks, such insurance coverage may be insufficient to cover all losses or all types of claims that may arise.\n\n\n15\n\n\n\n\n \n\n\n \n\n\nOur business would suffer if we are not able to hire and retain sufficient qualified personnel or if we lose our key personnel.\n\n\n \n\n\nOur future success depends significantly on the continued contribution of our key executive, engineering, sales, marketing, manufacturing, and administrative personnel. Recruiting and retaining the skilled personnel we require to maintain and grow our market position has been and is expected to continue to be difficult. The overall shortage in qualified workforce personnel has increased and in the future may continue to increase our compensation costs in order for us to retain such personnel. If we fail to hire and retain qualified employees, our business and growth prospects will be harmed.\n\n\n \n\n\nWe currently do not have employment agreements with any of our key executive officers. Swiss law prohibits us from paying certain severance payments to our senior executive officers, which may impair our ability to recruit for these positions. We do not have key person life insurance on any of our key executive officers and do not currently intend to obtain such insurance. The loss of the services of any of our senior level management, or other key employees, could harm our business.\n\n\n \n\n\nIf we do not correctly anticipate demand for our products, we may not be able to secure sufficient quantities or cost-effective production of our products or we could have costly excess production or inventories.\n \n\n\n \n\n\nThe demand for our products depends on many factors and may be difficult to forecast due to our increasingly diverse product portfolio, intensifying competition in the markets for our products, and the maturing of markets for some of our products. Significant unanticipated fluctuations in demand have caused and could in the future cause the following challenges to our operations:\n \n\n\n \n\n\n•\nIf demand increases beyond what we forecast, we may not be able to adequately increase production to meet demand. We would depend on suppliers to provide additional volumes of components and those suppliers might not be able to increase production rapidly enough, due to supply chain issues or other constraints, to meet unexpected demand. \n\n\n•\nAdditionally, rapid increases in production levels to meet unanticipated demand could result in higher costs for manufacturing and supply of components, higher freight costs associated with urgent distribution of the products, and other expenses. These higher costs could lower our profit margins. Further, if production is increased rapidly, manufacturing quality could decline, which may also lower our margins and reduce customer satisfaction.\n\n\n•\nIf forecasted demand does not develop, we could have excess inventories of finished products and components, which would use cash and could lead to write-offs of some or all of the excess inventories. Lower than forecasted demand could also result in excess manufacturing capacity or reduced manufacturing efficiencies at our facilities, which could result in lower margins.\n\n\n \n\n\nOur products and services may be affected by design and manufacturing defects that could materially adversely affect our business, financial condition, and results of operations.\n \n\n\n \n\n\nOur products and services, or those of our OEM customers in which our products are installed, could be affected by design and manufacturing defects. There can be no assurance we will be able to detect and fix all issues and defects in our products and services, and may have limited ability to respond to those impacting our OEM customers. Failure to do so can result, and in the past has resulted in recalls, product replacements or modifications, and may cause reputational harm, and significant warranty and other expenses, which could have a material adverse impact on our business, financial condition and results of operations.\n\n\n \n\n\nIf our products malfunction or contain errors or defects, we could also be subject to significant liability for personal injury and property damage and, under certain circumstances, could be subject to a judgment for punitive damages. We maintain insurance against accident-related risks involving our products. However, there can be no assurance that such insurance would be sufficient to cover the cost of litigation or damages to others or that such insurance will continue to be available at commercially reasonable rates. In addition, insurance coverage may not cover awards of punitive damages and may not cover the cost of associated legal fees and defense costs, which could result in lower margins. If we are unable to maintain sufficient insurance to cover product liability costs or if our insurance coverage does not cover the award, this could have a material adverse impact on our business, financial condition and results of operations.\n \n\n\n \n\n\n16\n\n\n\n\n \n\n\nOur products may contain undetected security vulnerabilities, which could result in damage to our reputation, lost revenue, diverted development resources, increased warranty claims, and litigation.\n\n\n \n\n\nUndiscovered vulnerabilities in our products could expose them to hackers or other unscrupulous third parties who develop and deploy viruses and other malicious software programs that could attack our products. Actual or perceived security vulnerabilities in our products could harm our reputation and lead some customers to return products, to reduce or delay future purchases, or use competing products.\n\n\n \n\n\nNatural disasters, catastrophic events, or climate change and associated requirements and pressures could affect our financial results.\n \n\n\n \n\n\nNatural disasters and extreme weather events, such as tsunamis, typhoons, floods, wildfires, or earthquakes, could occur in a region where we have a manufacturing or warehousing facility which could cause disruptions in our business operations, loss of inventory, or affect the sale of our products. Global climate change could also result in certain types of these natural disasters occurring more frequently or with more intense effects. For descriptions and locations of our principal properties, see"
  }
}