{
  "ticker": "HAS",
  "cik": "0000046080",
  "company_name": "HASBRO, INC.",
  "filing_date": "2025-02-27",
  "accession": "0000046080-25-000027",
  "primary_doc": "has-20241229.htm",
  "item_sections": {
    "item1": "Item 1.    \nBusiness.\nOverview\nHasbro, Inc. (“Hasbro”) is a leading game, intellectual property (\"IP\"), and toy company whose mission is to create joy and community through the magic of play. With over 100 years of expertise, we deliver play experiences to kids, families, and fans around the world, through physical and digital games, video games, toys, licensed consumer products, location-based entertainment, film, TV and more.     \nThrough our franchise-first approach, we unlock value from both new and legacy IP, including MAGIC: THE GATHERING, DUNGEONS & DRAGONS, MONOPOLY, HASBRO GAMES, NERF, TRANSFORMERS, PLAY-DOH and PEPPA PIG, as well as premier partner brands. Powered by our portfolio of  iconic brands and a diversified network of partners and subsidiary studios, we bring fans together wherever they are, from tabletop to screen.  \nFor more than a decade, Hasbro has been consistently recognized for its corporate citizenship, including being named one of the 100 Best Corporate Citizens by 3BL Media, a 2025 JUST Capital Industry Leader, one of the 50 Most Community-Minded Companies in the U.S. by the Civic 50, and a Brand that Matters by Fast Company.\nRecent Developments\nFiscal year 2024 was a year of continued transformation for our business and we began to see tangible results from our initiatives. Specifically, we focused our efforts on strategic investments in our most valuable and profitable franchises across games, licensing, toys and entertainment. We also made significant progress in our cost-savings initiatives, and further strengthened our leadership team with industry veterans and turnaround experts. \n2024 Business Results\nWe finished 2024 with momentum, led by another record year in our Wizards of the Coast and Digital Games segment, continued success in licensing, and operating profit improvement across the Company. \n•\nMAGIC: THE GATHERING had a solid year, nearly matching 2023’s record despite fewer set releases. Modern Horizons 3, Bloomburrow, and Duskmourn led performance in tentpole sets with backlist and Secret Lair demand also exceeding expectations. \n•\nDigital licensing growth was led by Monopoly Go! from our partners at Scopely, Inc., closing the year with a successful TV campaign and the launch of Tycoon Club. We also continued to see sales from Baldur's Gate 3 after its successful release in 2023 by our partners at Larian Studios.  \n•\nFor DUNGEONS & DRAGONS, we celebrated the brand’s 50th Anniversary with the 2024 Players Handbook and Dungeon Master’s Guide, both top selling products in D&D’s history.\n•\nIn our Consumer Products segment, we saw solid performance from BEYBLADE and TRANSFORMERS led by innovation and the animated film Transformers One with our partners at Paramount. \n•\nLicensing in our Consumer Products segment grew on the back of MY LITTLE PONY trading cards.\n•\nOur toys business had improved profitability behind supply chain productivity and lean inventory management. \nOperational Excellence Program\nIn 2024, we continued to execute on our Operational Excellence program, an ongoing enterprise-wide cost-savings initiative that includes targeted cost-savings, supply chain transformation and certain other restructuring actions designed to drive growth and enhance shareholder value. Since this program was initiated in 2022, we have delivered approximately $600 million of gross cost savings and $320 million of net cost savings.\nBoard and Executive Leadership\nIn March 2024, we brought additional skills and experience to our Board of Directors with the addition of Frank Gibeau, Darin Harris, and Owen Mahoney, each of whom has significant executive and relevant operational leadership expertise. Three longer-tenured directors, Michael Burns, Tracy Leinbach and Linda Zecher Higgins, retired from the Board in May 2024. \nOn July 18, 2024, we announced the appointment of John Hight as the new President of Wizards of the Coast and Digital Gaming. Mr. Hight previously served as Senior Vice President and General Manager of the Warcraft Franchise at Blizzard Entertainment, overseeing all development and commercial activities for World of Warcraft, Hearthstone, and Warcraft Rumble. \n6\nTable of Contents\nOn July 18, 2024, we also announced the appointment of Holly Barbacovi, a seasoned HR leader, as our new Chief People Officer. Ms. Barbacovi previously served as Wizards of the Coast’s Vice President of Human Resources from 2016 to 2020. She rejoined Hasbro from Bungie, where she most recently served as Chief Operating Officer and prior to that was their Chief People Officer. \nOur Mission and Strategy\nOur mission is to create joy and community through the magic of play, a universal need that lies at the heart of our brands.\nGames, IP, and toys each play an important role in driving our play-focused mission. Toys are often the first handshake we have with consumers, providing an opportunity for consumers at all ages to enjoy our brands. Games offer consumers additional channels to experience our brands, both in traditional format and through digital games. Licensing our intellectual property and strategic partnerships provide further opportunities to extend the reach of our brands across digital games, consumer products categories, entertainment, location-based experiences, and more. We believe our diversified portfolio positions us for continuous and extended reach with consumers and long-term growth. \nWe are Playing to Win.\n In 2025, we launched our refreshed strategy \"Playing to Win\" to refocus the Company on play and partnership. Through play fueled brand engagement and partner scaled co-investment, we plan to expand our consumer reach as a games, IP, and toy company. We have set goals and objectives to be one of the most profitable and diverse toy and game companies globally, powered by multi-segment and multi-generational franchises. To significantly extend our consumer reach and drive for revenue and profit growth, we are focusing on five key strategic building blocks:\n•\nProfitable Franchises:\n Focus on improving the fundamentals of profitable, play-focused brands, through innovation, partnership, operational excellence, managed cost-discipline and retail execution.\n•\nAging Up\n: Expand our consumer base and drive play and collectible experiences for fans of all ages, recognizing that consumers aged 13 and above are gaining purchase share.\n•\nEveryone Plays:\n Engage across the play spectrum to where we under-index and capture new consumers across demographics and markets.\n•\nDigital and Direct:\n Embrace new ways to engage with our consumers through video games, digital technology and direct-to-consumer interactions.\n•\nPartner Scale:\n Capitalize on our partners’ investments and scale to enhance our brands through strategic relationships and licensing arrangements.\nOur Business: Games, IP, and Toys. \nWe operate in three lines of business: games, IP, and toys, each playing a role in driving our play-focused mission.\nGames\nIP – Licensing & Entertainment\nToys\nOur high profit, high growth investment center. As consumers embrace digital, our game portfolio offers new channels to express our brands.\nOur capital-lite, partner scale opportunity. Licensing drives our brands across consumer product categories, screens and experiences.\nOur first handshake with consumers; a cash generative business in a stable category driven by brands, innovation and licenses.\nAs a Company, we possess three competitive advantages: 1) a broad and deep brand portfolio rooted in play; 2) one of the biggest and most diverse licensing businesses in the world and 3) a profitable games business anchored by MAGIC: THE GATHERING, MONOPOLY, DUNGEONS & DRAGONS, and Hasbro gaming classics. \nOur competitive advantages reinforce one another. Our toy and game brands fuel our licensing business. Our licensing business receives external capital and marketing investments which strengthen our brands and our bottom line. Our games business adds further strength to our balance sheet giving us the investment dollars to upgrade core capabilities like design, supply chain, and marketing and gives us new ways to expand our brands’ reach, particularly in digital.\nOperational Excellence: Transforming Hasbro. \nWe are midway through a turnaround. Over the past two years our transformation initiatives have focused on:\n•\nDivestiture of eOne (as defined below) which returned “play” to the center of our mission and investment priorities, ultimately reducing content spend by over 90%.\n7\nTable of Contents\n•\nReducing complexity across the business, including significantly reducing SKU count, reducing owned inventory levels and reducing the cost structure.\n•\nReinvigorating licensing and expanding into new partnerships across toys, gaming and experiences.\n•\nAccelerating digital initiatives and digitally-orientated partnerships.\n•\nRight-sizing our organizational structure.\nNow we are continuing to transform the business by upgrading our systems and talent with an emphasis on:\n•\nProcess and systems modernization across IT, accounting, finance and HR.\n•\nSupply chain excellence to continue improving predictability, costs and services across the network.\n•\nDesign acceleration to improve the time to market, improve agility and reduce costs.\n•\nAdoption of artificial intelligence (“AI”) and digital solutions to innovate, improve operational efficiency, and go to market digitally.\nOur Brand Portfolio.  \nBelow is a summary of the brands and business models where we compete.\n•\nToys and Games\n. We market and sell toys and games based on our owned and controlled brands globally at retail stores, through ecommerce platforms and through our fan-based direct-to-consumer platforms Hasbro PULSE and SECRET LAIR. Our key brands are:\n•\nMAGIC: THE GATHERING\n•\nHasbro Games\n•\nPLAY-DOH\n•\nTRANSFORMERS\n•\nDUNGEONS & DRAGONS\n•\nPEPPA PIG\n•\nNERF\nAdditionally, through license agreements with third parties, we develop and sell products based on popular third-party brands through these channels. Key partner brands include: \n•\nMARVEL, including SPIDER-MAN and THE AVENGERS\n(1)\n•\nLUCASFILMS' STAR WARS\n(1)\n•\nBEYBLADE\n•\nSECRET LAIR partners such as Final Fantasy, The Lord of the Rings, and Fallout\n \n(\n1) \nOwned by The Walt Disney Company (“Disney”).\nOur products include a wide range of games, trading cards and collectibles, action figures, arts and crafts and creative play products, dolls, play sets, preschool toys, plush products, vehicles and toy-related specialty products, sports action products and accessories and many other consumer products which represent an array of internationally recognizable brands that capture the imagination of our consumers worldwide.\nOur gaming business continues to transform game play with new and innovative games and play experiences. To successfully execute our gaming strategy, we focus on brands that capitalize on existing trends while evolving our approach using consumer insights and data analytics, technology advancements and offering game-play experiences addressed to consumer demand for face-to-face, trading card and digital game experiences played as board, off-the-board, digital, card, electronic, trading card and role-playing games.\nOur subsidiary, Wizards of the Coast (“Wizards”), is a critical part of our gaming business, driving innovation and growth through its popular role-playing and fantasy card-collecting games. These games include:\n•\nMAGIC: THE GATHERING, one of the original collectible card games, is a strategic trading card game with compelling characters in multiple universes that continue to expand through new card sets, including with well-known third-party properties such as The Lord of the Rings: Tales of Middle-Earth card set released in 2023. MAGIC: THE GATHERING became Hasbro’s first billion-dollar brand in 2022.\n•\nDUNGEONS & DRAGONS, one of the world’s most popular tabletop role-playing games, is a cooperative, storytelling game where players take on the roles of different characters within a \n8\nTable of Contents\nstory. There are dice and basic rules involved, and often maps and miniatures or tokens, but the tools that come into play most often are the imaginations of the players. An update to the fifth edition of the D&D rule set was published in 2024.\nOur other iconic game brands include long-time favorites such as MONOPOLY, JENGA, CONNECT 4, THE GAME OF LIFE, SCRABBLE, CLUE and TRIVIAL PURSUIT, as well as many other well-known game brands and newer games that are geared toward a mature consumer.\n•\nDigital Gaming\n.\n Key to our success is the continued investment in, growth and development of, our digital gaming business, including development of AAA games, games as a service and licensed games. Spanning action role-playing games for web-based play, PC and gaming consoles, to Hasbro branded mobile application-based games, our digital gaming business helps to unlock the full value of our brands and achieve our mission of storytelling and bringing our brands to life. Recent examples include:\n◦\nthe popular Monopoly Go! free-to-play mobile game, released by Scopely, Inc. during 2023 and based on the classic board game, MONOPOLY;\n◦\nthe 2023 release of Baldur's Gate 3, the DUNGEONS & DRAGONS-based role-playing video game from our partners at Larian Studios which won several awards, including Game of the Year at the 10th annual Game Awards; and \n◦\nour 2022 acquisition of D&D Beyond, the premier digital content platform for DUNGEONS & DRAGONS. \nWe continue to develop and enhance other digital games internally and through third parties. For example, we have developed and launched the digital version of the MAGIC: THE GATHERING card game, \nMagic: The Gathering Arena \nand its related mobile application, both of which complement the Company's direct-to-customer relationships with our new and long-time MAGIC: THE GATHERING fan-base. Developing and publishing our own games requires a substantial amount of time and investment, and there are risks that the games we develop will not be successful. We believe, however, that our brands and characters together with our studios and partners provide us a competitive edge and this has the potential to be a high growth area for us.\n•\nLicensing IP\n. Hasbro is one of the world’s largest and most diverse licensors, and a growing part of our Playing to Win strategy is to extend the reach of our brands through the out-licensing of our intellectual properties to third parties for consumer products, digital games and entertainment. \n◦\nConsumer Products Licensing\n:\n  We license our intellectual property for a variety of consumer products, including apparel, publishing, home goods and electronics, or in certain situations, toy products where the out-licensing of brands is more effective and profitable than developing and marketing the products ourselves. A recent example of this includes the return of our LITTLEST PET SHOP brand through our partnership with Basic Fun!, a global marketer of toys and consumer products. Together we relaunched LITTLEST PET SHOP through a Roblox experience in December 2023, a refreshed LITTLEST PET SHOP product lineup in the first half of 2024 featuring new characters, collectables, and playsets. Another recent example, in 2024, we saw a resurgence from MY LITTLE PONY through licensing across merchandising categories, music, and trading card products. \n◦\nDigital Games Licensing\n: \n We out-license certain of our brands to other third-party digital game developers who transform Hasbro brand-based characters and other intellectual properties into digital gaming experiences such as Monopoly Go! and Baldur's Gate 3 discussed above. \n◦\nLocation-Based Entertainment\n:\n Location-based entertainment (“LBE”) includes licensing our brands to theme parks, water parks, hotels and resorts, family entertainment centers, retail, dining and entertainment, shows, exhibits and exhibitions such as Hasbro City, the recently-opened Hasbro-themed family entertainment center located in Paseo Interlomas, Mexico featuring thrilling theme park rides and experiences, live shows, food and beverage options and the region's first Hasbro-themed retail location. These experiences bring our brands to life and further immerse our consumers in our storytelling in a capital efficient manner. \n•\nEntertainment\n. Reinforcing storylines associated with our owned and controlled brands through entertainment mediums, including television, film, digital content and other programming is our primary entertainment strategy. With our cross-platform capabilities, our entertainment business leverages film and television production and sales, digital content and children's programming to create compelling \n9\nTable of Contents\nentertainment and drive creativity and overall awareness across brands with merchandising and licensing tie-ins. Principal brands include PEPPA PIG and MY LITTLE PONY whose content entertains children worldwide and generates revenues through licensing and merchandising programs across multiple retail categories. Another recent example is \nTransformers One\n, an animated film featuring the untold origin story of Optimus Prime and Megatron released in September 2024 in partnership with Paramount Pictures.  \n•\nHasbro Direct\n. Our Hasbro Direct business adopts a \"Fans Come First\" approach, intended to create direct connections with our consumers. It includes the following platforms:\n◦\nMagic: The Gathering Arena - \nthe free-to-play online adaptation of the MAGIC: THE GATHERING card game where players can explore the fantasy worlds of \nMagic: The Gathering Arena\n, play a variety of game formats to collect cards and test skills against friends and other players around the world, or enter in-game tournaments.\n◦\nSECRET LAIR - our internet-based storefront where MAGIC: THE GATHERING fans can purchase exclusive and limited versions of cards.\n◦\nD&D Beyond - the premier digital content platform for DUNGEONS & DRAGONS where fans can access online versions of official rule books, character sheets and catalogs, adventures, and other digital tools such as character builders and official D&D content available for purchase.\n◦\nHasbro PULSE - Hasbro's ultimate fan ecommerce destination.\nWith these platforms, we are expanding and enhancing our capabilities beyond traditional ecommerce to serve our consumers and activate brands. Connecting with fans directly makes our products more accessible in more markets and enables us to sell brands and showcase selected items, creating more brand awareness while gaining a deeper understanding of our fans and what they want and expect from Hasbro.\n•\nOther Elements of our Strategy\n. Other aspects of our strategy that help drive our consumer reach and storytelling experiences include digital content. We understand the importance of digital content to drive fan engagement, including in gaming and across other media, and of integrating such content with our products. Digital media encompasses digital gaming applications and the creation of digital environments for traditional products through the use of complementary digital applications, social media and websites which extend storylines and enhance play.\nProduct Development and Royalties\nDevelopment\nOur success is dependent on continuous innovation in our play offerings and requires ongoing development of new brands and products alongside the redesign of existing products to drive consumer interest and market acceptance. Our products are developed by a global development function, which is responsible for the development, design and engineering of new products and their packaging and the innovation, improvement or modification of ongoing products. Much of this work is performed by our internal staff of designers, artists, model makers and engineers. The pace of change in innovation and complexity of our product offerings is expected to continue to evolve as we adopt artificial intelligence in the development new brands and products.\nIn addition to the design and development work performed by our own staff, we work with a number of independent toy and game designers and compete for their designs and ideas with other toy and game manufacturers. Rights to such designs and ideas, when acquired or licensed by us, are usually exclusive for particular categories and the agreements require us to pay the designer a royalty on our net sales of the item. These designer royalty agreements may also provide for advance royalties and minimum guarantees.\nRoyalties and Participations\nWe produce an array of products under licenses based on our partners’ trademarks and copyrights for the names or likenesses of characters from movies, television shows and other entertainment media. We compete with other toy and game manufacturers for these licensed rights. Licensing fees for these rights are generally paid as a royalty on our net sales of the item. Licenses for the use of characters may be exclusive for specific products or product lines in specified territories, or may be non-exclusive, in which case our product offerings may be competing with the product offerings of other licensees. In many instances, advance royalties and minimum \n10\nTable of Contents\nguarantees are required by these license agreements. Our royalty expense in any given year may vary depending upon product mix and the timing of movie releases and other entertainment media.\nWe are increasingly promoting our brands through the out-licensing of our intellectual properties to third parties for a wide range of digital games, consumer products and location-based experiences. Under these agreements, licensees either pay us a sales-based or usage-based royalty, or a combination of both, for use of our brands, and, in some cases, the license arrangements are subject to minimum guaranteed amounts or fixed fees, over the term of the license.\nOur entertainment offerings also require us to pay royalties and participations to those involved in the creation of the content, such as producers, writers, directors and actors.\nMarketing and Sales, Customer Concentration and Advertising\nMarketing and Sales\n \nOur global marketing function establishes brand direction and messaging and assists the selling entities in establishing local marketing programs. The global marketing group works with the global development function to deliver unified, brand-specific consumer experiences. In addition to the global marketing function, our local selling entities employ sales and marketing functions responsible for local market activities and execution.\nOur products are sold globally to a broad spectrum of customers, including mass-market retailers, distributors, wholesalers, discount stores, specialty hobby stores, drug stores, mail order houses, catalog stores, department stores and other traditional retailers, large and small, as well as ecommerce retailers and direct-to-customer through our fan-focused Hasbro Direct business. Our own sales forces account for the majority of sales of our products with remaining sales generated by independent distributors who, for the most part, sell our products in areas of the world where we do not otherwise maintain a direct presence. The majority of our product sales are to large chain stores, distributors, e-retailers and wholesalers.\nCustomer Concentration\nDuring 2024, net revenues from our top five customers accounted for approximately 36% of our consolidated global net revenues, including our largest customers, Wal-Mart, Inc. and Amazon.com, Inc. who together represented 23% of consolidated global net revenues, with each accounting for 12% and 11%, respectively. Please see Part I,",
    "item1a": "Item 1A. Risk Factors.",
    "item1b": "Item 1B.    \nUnresolved Staff Comments.\nNone.",
    "item1c": "Item 1C.  \nCybersecurity.\nWe have an in-depth approach to monitoring and addressing cybersecurity risk. Members of management together with our Board, the Audit Committee of the Board (the \"Audit Committee\"), our internal Cybersecurity and Data Privacy Steering Committee (a cross-functional team which includes members of our Executive Leadership Team), and the members of an enterprise risk management team (a task force comprised of senior representatives of the company assessing risk in the organization)\n, have developed cybersecurity and risk management processes to adapt to the changing cybersecurity landscape and respond to emerging threats in a timely and effective manner.\n \nOur cybersecurity program leverages various industry standards like the National Institute of Standards and Technology (\"NIST\") and Center for Internet Security (\"CIS\") Program framework, which organizes cybersecurity risks into five categories: identify, protect, detect, respond and recover. We regularly assess the threat landscape and take a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection, mitigation and continuous process improvements. Our enterprise risk management team reviews cybersecurity risks, and key cybersecurity risks are incorporated into the enterprise risk management (\"ERM\") reports reviewed and discussed internally and with the Board. In addition, we have several avenues to gather risk intelligence, and potential threats identified by various services, internal and external assessments, and capabilities to adjust our security strategy. We also have a set of Company-wide policies and procedures concerning cybersecurity and technology standards, which include a Technology Use policy, as well as other policies that directly or indirectly relate to cybersecurity, such as policies related to endpoint and network protection, encryption standards, malware/ransomware protection, remote access, multi-factor authentication, confidential information and the use of the internet, social media, email and wireless devices. These policies go through an internal review process and are approved by appropriate members of management.\n \nThe Company’s \nChief Information Security Officer (“CISO”)\n and the Cybersecurity and Data Privacy Steering Committee are responsible for developing, implementing and evaluating our information security program. The CISO regularly reports on cybersecurity matters to the Cybersecurity and Data Privacy Steering Committee, as well as to the Board and the Audit Committee.\n \nOur Chief Digital and Information Officer is an Executive Sponsor of the Cyber Security Program, has over two decades of experience leading cyber security oversight, and others on our cyber security team have cybersecurity experience and certifications, such as the Certified Information Systems Security Professional, or other industry leading certifications.\nWe have invested in IT security, including additional end-user training, using layered defenses, identifying and protecting critical assets, strengthening monitoring and alerting, and engaging experts. We regularly test defenses by performing simulations and drills at both a technical level (including through penetration tests), tabletop exercises and by reviewing our operational policies and procedures with third-party experts. At the management level, our IT security team regularly monitors alerts and meets to discuss threat levels, trends and remediation. The team also prepares a cyber scorecard, regularly collects data on cybersecurity threats and risk areas and conducts an annual risk assessment. Further, we conduct periodic external penetration tests, red team testing and maturity testing to assess our processes and procedures and the threat landscape. These tests and assessments are useful tools for maintaining a robust cybersecurity program to protect our investors, customers, employees, vendors, and intellectual property. In addition to assessing our own cybersecurity preparedness, \nwe also consider and evaluate cybersecurity risks associated with use of \nthird-party\n vendors and service providers.\n The internal business owners of the hosted critical applications are required to document user access reviews at least annually and provide from the vendor a System and Organization Controls (\"SOC\") 1 or SOC 2 report. If a third-party vendor is not able to provide a SOC 1 or SOC 2 report, we take additional steps to assess their cybersecurity preparedness and assess our relationship on that basis. Our assessment of risks associated with use of third-party providers is part of our overall cybersecurity risk management framework.\nThe Audit Committee and the full Board actively participate in discussions with management and amongst themselves regarding cybersecurity risks. The Audit Committee meets during the year and discusses cyber-related \n29\nTable of Contents\nindustry events, critical cyber incidents, alignment with our information security framework, threat assessment, security capabilities, response readiness and training efforts. The Audit Committee conducts an ongoing review of the Company’s cybersecurity program, which includes discussion of management’s actions to identify and detect threats, planned actions in the event of a response or recovery situation, as well as a review of recent enhancements to the Company’s security detection, prevention and response capabilities, and management’s progress on its cybersecurity strategic roadmap. The Cybersecurity team also subscribes to various threat intelligence services to evaluate our security strategy or defense mechanism against such threats.\nThe \nBoard\n receives regular updates from the Audit Committee, as well as from the Cybersecurity team, including a summary of key risk indicators, test results and related remediation, and recent threats and how the Company is managing those threats.\n \nWe face a number of cybersecurity risks in connection with our business. \nDuring the past three years we have not suffered a material breach or a reportable incident, and cybersecurity risks (including breach of third parties with whom we work) have not materially affected us, including our business strategy, results of operations or financial condition\n. For more information about the cybersecurity risks we face, see"
  }
}