{
  "ticker": "HD",
  "cik": "0000354950",
  "company_name": "HOME DEPOT, INC.",
  "filing_date": "2025-03-21",
  "accession": "0000354950-25-000085",
  "primary_doc": "hd-20250202.htm",
  "item_sections": {
    "item1": "Item 1.  Business.\nINTRODUCTION\nThe Home Depot, Inc. is the world’s largest home improvement retailer based on net sales for fiscal 2024. We offer our customers a wide assortment of building materials, home improvement products, lawn and garden products, décor products, and facilities MRO products, in stores and online. We also provide a number of services, including home improvement installation services, and tool and equipment rental. As of the end of fiscal 2024, we operated 2,347 stores located throughout the U.S. (including the Commonwealth of Puerto Rico and the territories of the U.S. Virgin Islands and Guam), Canada, and Mexico. The Home Depot stores average approximately 104,000 square feet of enclosed space, with approximately 24,000 additional square feet of outside garden area. We also maintain a network of distribution and fulfillment centers, as well as a number of e-commerce websites in the U.S., Canada and Mexico. For disclosure purposes, the geographic operating segments of the U.S., Canada and Mexico are aggregated into one reportable segment (the “Primary segment”).\nIn fiscal 2024, we acquired SRS, a leading residential specialty trade distribution company engaged in the distribution of residential and commercial roofing products, complementary building products, landscape supplies and swimming pool supplies serving the professional roofer, landscaper, and pool contractor. At the end of fiscal 2024, SRS operated over 780 branch locations throughout the U.S., each of which has a distribution center, material handling and delivery equipment, and inventory. SRS is organized as three different lines of business: roofing and complementary building products, landscape, and pool. Each line of business was determined to represent an operating segment, none of which are deemed reportable segments. \nUnless otherwise indicated or the context otherwise requires, when we refer to “The Home Depot,” “Home Depot,” the “Company,” “we,” “us” or “our” in this report, we are referring to The Home Depot, Inc. and its consolidated subsidiaries.\nThe Home Depot, Inc. is a Delaware corporation that was incorporated in 1978. Our Store Support Center (corporate headquarters) is located at 2455 Paces Ferry Road, Atlanta, Georgia 30339. Our telephone number at that address is (770) 433-8211.\nOUR BUSINESS\nOUR STRATEGY\nThe retail landscape has changed rapidly over the past several years, with a complex macroeconomic environment and customer expectations continually evolving. In fiscal 2024, our strategy allowed us to continue to execute at a high level despite continued pressure on home improvement demand from high interest rates and macroeconomic uncertainty. We continued our strategic investments aimed at creating an interconnected, frictionless shopping experience that enables our customers to seamlessly blend the digital and physical worlds, growing our market share with Pros through our ecosystem of capabilities, and building new stores. Going forward, we will continue to leverage the momentum of these investments and invest in our business in support of the following goals: \n•\nWe intend to provide the best customer experience in home improvement and develop differentiated capabilities for our customers;\n•\nWe intend to extend our position as the low-cost provider in home improvement; and\n•\nWe intend to be the most efficient investor of capital in home improvement. \nWe believe that these goals will help us grow faster than the market and deliver value to our shareholders. We are steadfast in our commitments to focus on our people, operate sustainably, and strengthen our communities, and we believe being informed by other stakeholder perspectives will drive shareholder value creation.\nDELIVER SHAREHOLDER VALUE\n \nWe seek to deliver on our objective to create shareholder value through our disciplined approach to capital allocation. Our capital allocation principles are as follows:\n•\nFirst, we intend to reinvest in our business to drive growth faster than the market.\n•\nSecond, after meeting the needs of the business, we look to pay a quarterly dividend.\n•\nThird, after reinvesting in our business and paying our dividend, we intend to return excess cash to our shareholders through share repurchases.\nFiscal 2024 Form 10-K\n1\nTable\n of \nContents\nIn fiscal 2024, we invested $3.5 billion in capital expenditures to support our business, advance our goals, and continue to build an interconnected customer experience. We also acquired SRS to accelerate our growth with Pros. We continue to focus on driving productivity throughout the business by lowering our product and transportation costs, and in fiscal 2024 we \nexecuted a plan to reduce our fixed cost structure by approximately $500 million. The combination of reinvesting in our business to drive higher sales and driving productivity to lower costs allows us to improve our customer experience, increase our competitiveness in the market, and deliver shareholder value.\nIn fiscal 2024, we returned $8.9 billion to shareholders in the form of cash dividends. We also returned $0.6 billion to shareholders in the form of share repurchases prior to pausing share repurchases in March 2024 in anticipation of the SRS acquisition. Our capital allocation is discussed further in \nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOUR CUSTOMERS\nWe serve two primary customer groups — consumers (including both DIY and DIFM customers) and Pros — and have developed varying approaches to meet their diverse needs:\nDIY Customers\nThese customers are typically homeowners who purchase products and complete their own projects and installations. Our associates assist these customers both in our stores and through online resources and other media designed to provide product and project knowledge. We also offer a variety of clinics and workshops to share this knowledge and to build an emotional connection with our DIY customers. As the preferences and behaviors of our DIY customers are changing, we are investing in capabilities to better meet the evolving expectations of these customers.\nProfessional Customers (or “Pros”)\nThese customers are primarily professional renovators/remodelers, general contractors, small to medium homebuilders, maintenance professionals, handymen, property managers, building service contractors and specialty tradespeople, such as electricians, landscapers, plumbers, painters, pool contractors, and roofers. These customers build, renovate, remodel, repair, and maintain residential properties, multifamily properties, hospitality properties, and commercial facilities, including education, healthcare, government, institutional, and office buildings. \nWe have a number of initiatives designed to drive growth with Pros, including those working on both simple and complex projects. In fiscal 2024, we acquired SRS, which sells products to specialty trade roofers, landscapers, and pool contractors. We remain focused on providing a customized online experience, a dedicated sales force, a broad assortment of Pro-focused products and brands, an extensive delivery network, our Pro Xtra loyalty program, and enhanced credit offerings. Building on our historical strength as a destination for urgent purchase needs, we are investing in differentiated capabilities that will help us better serve our Pros’ complex purchase needs, including differentiated fulfillment options, additional trade credit offerings including our Pro House Account program, more showroom space, and an enhanced order management system. We also provide MRO products and related value-added services to multifamily, hospitality, healthcare, and government housing facilities, among others, primarily through our subsidiary HD Supply. \nDIFM Customers\nIntersecting our DIY customers and our Pros are our DIFM customers. These customers are typically homeowners who use Pros to complete their projects or installations. Currently, we offer installation services in a variety of categories, such as flooring, water heaters, bath, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. DIFM customers can purchase these services in our stores, online, or in their homes through in-home consultations. In addition to serving our DIFM customer needs, we believe our focus on the Pros who perform services for these customers helps us drive higher product sales.\nFiscal 2024 Form 10-K\n2\nTable\n of \nContents\nOUR PRODUCTS AND SERVICES\nA typical Home Depot store stocks approximately 30,000 to 40,000 items during the year, including both national brand name and proprietary products, across the following merchandising departments: Appliances, Bath, Building Materials, Electrical, Flooring, Hardware, Indoor Garden, Kitchen & Blinds, Lighting, Lumber, Millwork, Outdoor Garden, Paint, Plumbing, Power, and Storage & Organization. Our online product offerings complement our stores by serving as an extended aisle, and we offer a significantly broader product assortment through our websites and mobile applications, including homedepot.com, our primary website; homedepot.ca and homedepot.com.mx, our websites in Canada and Mexico, respectively; hdsupply.com, our website for our MRO products and related services; our websites for custom window coverings including blinds.com, justblinds.com and americanblinds.com; thecompanystore.com, our website featuring textiles and décor products; and srsdistribution.com, heritagelandscapesupplygroup.com, and heritagepoolsupplygroup.com, our websites serving the roofing and building materials, landscape and pool product needs of specialty Pros, respectively. \nWe believe our merchandising organization is a key competitive advantage, delivering product innovation, assortment and value, which reinforces our position as the product authority in home improvement. At the same time, we remain focused on offering the right products at everyday values in our stores and online. To remain the product authority, we must continue to bring new and innovative products to our customers that help simplify their projects, from the Pro’s need for job-lot quantities of specialized products to DIY customers seeking products to reduce their environmental impacts. To help our merchandising organization keep pace with changing customer expectations and increasing desire for innovation, localization, and personalization, we are continuing to invest in tools to better leverage our data and drive a deeper level of collaboration with our suppliers. As a result, we continue to focus on enhanced merchandising information technology tools to help us: (1) enhance an interconnected shopping experience that remains tailored to our customers’ shopping intent and location; (2) provide the best value in the market; and (3) optimize our product assortments. Our merchandising team leverages technology and works closely with our inventory and supply chain teams, as well as our suppliers, to manage our assortments, drive innovation, manage the cost environment, and adjust inventory levels to respond to fluctuations in demand. \nTo complement our merchandising efforts, we offer a number of services for our customers, including installation services for our DIY and DIFM customers, as noted above. We also provide tool and equipment rentals at locations across the U.S. and Canada, providing value and convenience for both Pros and consumers. To improve the customer experience and continue to grow this differentiated service offering, we are continuing to invest in more tool rental locations, more tools, and better technology.\nSourcing and Quality Assurance\nWe maintain a global sourcing program to obtain high-quality and innovative products directly from manufacturers in the U.S. and around the world. During fiscal 2024, in addition to our U.S. sourcing operations, we maintained sourcing offices in Mexico, Canada, China, India, Vietnam, Taiwan, and Europe. To ensure that suppliers adhere to our high standards of social and environmental responsibility, we also have a global responsible sourcing program. Under our standard supplier buying agreement, our suppliers are obligated to ensure that their products comply with applicable international, federal, state and local laws. This standard agreement also requires compliance with our responsible sourcing standards, which cover a variety of expectations, including supply chain transparency, compliance with applicable laws and regulations addressing prohibitions on child and forced labor, health and safety, environmental matters, compensation, and hours of work. To drive accountability with our suppliers, our standard supplier buying agreement also includes a factory audit right related to these standards, and we conduct risk-based factory audits and compliance visits with non-Canada and non-U.S. suppliers of private branded and direct import products. Our 2024 Responsible Sourcing Report, available on our website at https://corporate.homedepot.com under “Responsibility > Sourcing Responsibly,” provides more information about this program. In addition, we have both quality assurance and engineering resources dedicated to establishing criteria and overseeing compliance with safety, quality and performance standards for our private branded products. \nIntellectual Property\nOur business has one of the most recognized brands in North America. As a result, we believe that The Home Depot\n®\n trademark has significant value and is an important factor in the marketing of our products, e-commerce, stores and business. We have registered or applied for registration of trademarks, service marks, copyrights and internet domain names, both domestically and internationally, for use in our business, including our proprietary brands such as HDX\n®\n, Husky\n®\n, Hampton Bay\n®\n, Home Decorators Collection\n®\n, Glacier Bay\n®\n, Vigoro\n®\n, Everbilt\n®\n and Lifeproof\n®\n. The duration of trademark registrations varies from country to country. However, trademarks are generally valid and may be renewed indefinitely as long as they are in use and/or their registrations are properly maintained.\nFiscal 2024 Form 10-K\n3\nTable\n of \nContents\nWe also maintain patent portfolios relating to our business operations, retail services, and products, and we seek to patent or otherwise protect innovations we incorporate into our business. Patents generally have a term of twenty years from the date they are filed. As our patent portfolio has been built over time, the remaining terms of individual patents across our patent portfolio vary. Although our patents have value, no single patent is essential to our business. We continuously assess our merchandising departments and product lines for opportunities to expand the assortment of products offered within The Home Depot’s portfolio of proprietary and exclusive brands.\nCOMPETITION AND SEASONALITY\nOur industry is highly competitive, highly fragmented, and evolving. As a result, we face competition for customers for our products and services from a variety of retailers, suppliers, service providers, and distributors and manufacturers that sell products directly to their respective customer bases. These competitors range from traditional brick-and-mortar, to multichannel, to exclusively online, and they include a number of other home improvement retailers; local, regional and national hardware stores; electrical, plumbing and building materials supply houses; and lumber yards. With respect to some products and services, we also compete with specialty design stores, showrooms, discount stores, paint stores, specialty and mass digital retailers, warehouse clubs, MRO distributors, national and local wholesale supply distributors, home décor retailers, and other retailers, as well as with providers of home improvement services and tool and equipment rental. The internet facilitates competitive entry, price transparency, and comparison shopping, increasing the level of competition we face.\nBoth in-store and online, we compete primarily based on customer experience; price; quality; product availability, assortment, and innovation; and delivery options and capabilities. We also compete based on store and branch location and appearance, presentation of merchandise, and ease of shopping experience throughout every step of the project, from inspiration and research to any post-purchase support. Our Pros also look for dedicated sales support, competitive credit and pricing options, project planning tools, and product depth and job-lot quantities, particularly for their complex purchase needs. Furthermore, with respect to delivery options, customers are seeking faster and/or guaranteed delivery times, low-price or free shipping, and/or convenient pickup options. Our ability to be competitive on delivery and pickup times, options and costs depends on many factors, including the success of our supply chain investments, described more fully under “Our Supply Chain” below, and our interconnected retail strategy. \nOur business is subject to seasonal influences. Generally, our highest volume of sales occurs in our second fiscal quarter, as we move into the spring season in the regions in which we operate.\nINTERCONNECTED SHOPPING EXPERIENCE\nWe continue to enhance our capabilities to provide our customers with a frictionless interconnected shopping experience across our stores, branches, online, on the job site, and in their homes, focusing on continued investments in our websites and mobile apps to enhance the customer experience. \nDigital Experience\nEnhancements to our digital platforms are critical for our increasingly interconnected customers, who often research products and check available inventory online before going into one of our stores to view products in person or talk to an associate and then making their purchase either in store or online. While in the store, customers may also go online to access ratings and reviews, compare prices, view our extended assortment, and purchase additional products. Our investments in a truly interconnected experience are focused on bringing together the power of our physical presence and the frictionless interaction of our digital capabilities.\nA significant majority of the traffic in Home Depot’s digital channels is on mobile devices. Mobile users expect more simplicity and relevancy in their digital interactions. In addition to supporting our DIY and DIFM customers on their shopping journeys, mobile devices can also help serve the needs of Pros working on complex projects. As a result, we have made investments in our digital platforms to improve the overall presentation and ease of navigation for the user. We have also enhanced the “shopability” of an online product by including more information on the product’s landing page, including related products and/or parts of a collection, as well as various fulfillment options. We believe our focus on improving search capabilities, site functionality, category presentation, product content such as customer product review summaries, speed to checkout, and fulfillment options has yielded higher traffic, better conversion and continued sales growth. As our customers expect a more personalized experience, our ability to collect, use, retain, and protect relevant customer data is important for our ability to effectively meet their expectations.\nFiscal 2024 Form 10-K\n4\nTable\n of \nContents\nFurther, we do not view the interconnected shopping experience as a specific transaction; rather, we believe it encompasses an entire journey from inspiration and know-how, to purchase and fulfillment, to post-purchase care and support. Customers expect more personalized messaging, so we are continuing to focus on connecting marketing activities with the online and in-store experiences to create seamless engagement across channels. From the inspirational point of the purchase journey to providing product know-how, we continue to invest in the infrastructure and capabilities needed to deliver the most relevant marketing messages to our customers based on what is important to them today.\nStore Experience\nOur stores remain the hub of our business, and we continue to invest to improve the customer shopping experience through easier navigation and increased convenience and speed of checkout. In fiscal 2024, we continued to leverage the investments made in our stores over the past several years to operate effectively and meet customer expectations. These investments included wayfinding signage and store refresh packages; self-service lockers, online order storage areas and curbside service to enable convenient online order pickup options; electronic shelf label capabilities; and the re-design of front-end areas, including reconfigured service desks, improved layouts in checkout areas, and expanded and enhanced self-checkout options. We have also empowered our customers with additional self-help tools, including mobile app-enabled store navigation. Our app provides store-specific maps that allow customers to pinpoint the exact location of an item on their mobile devices. \nWe believe these investments are driving higher customer satisfaction scores, and we will continue to invest to improve the customer experience. In addition, we have identified areas that have experienced significant population growth or where market voids exist. In fiscal 2023, we initiated a plan to open approximately \n80\n new stores over a five-year period to address those opportunities, and in fiscal 2024, we op\nened 12 new\n stores. These new stores will continue to help relieve pressure at existing high-volume stores and add stores in areas with less store coverage, helping us to improve the customer experience and drive sales growth.\nInvesting in Associate Productivity.\n We continually strive to improve our store operations to remove complexity and inefficient processes, allowing our associates to spend more of their time serving our customers. To this end, we have continued to focus on process improvements like optimizing product flow to improve on-shelf product availability and thus decrease the amount of time store associates spend locating products; creating an enhanced order management system; expanding in-aisle, real-time mobile learning tools for our associates’ development and assistance with customer questions; and using labor model tools to better align associate activity with customer needs. For a number of years, our Home Depot store associates have used web-enabled handheld devices to help them more efficiently meet the needs of the business and serve customers. Our current generation of these digital “hdPhone” devices offers enhanced functionality that allows associates to readily query inventory, access applications that support customer service, and assist with locating products. Our hdPhones also give our U.S. Home Depot store associates access to Sidekick, an application that directs associates to bays where product is low or out of stock and helps our associates prioritize the highest value tasks more effectively. To further support productivity, we leverage Computer Vision in our U.S. Home Depot stores, which provides greater visibility into where product is located, including both on the shelves and in the overhead space, enabling strategically-directed tasking and improving on-shelf availability. \nInvesting in Safety.\n We remain committed to maintaining a safe shopping and working environment for our customers and associates. We accomplish this by creating a strong culture of safety, building on our core value of Taking Care of Our People, that starts from the top with engaged leaders who empower associates to make decisions that prioritize the safety of everyone. We use data to identify areas of greatest risk, including emerging risks, and invest in tools, equipment and technology to reduce those risks in our packaging, processes, and behaviors. Our associate training and awareness initiatives target individual roles and responsibilities, integrating with overall strategies that promote physical and psychological safety and mental wellness. \nWe empower trained EH&S associates to continuously evaluate, develop, implement and enforce policies, processes and programs in our stores, facilities and offices across the Company. Our EH&S policies are woven into our everyday operations for site, district and regional teams, and integrate with operating platforms to provide safety line-of-sight to all leaders and associates. Common program elements include daily store inspection checklists; routine follow-up audits from our store-based safety team members; preventative maintenance programs to promote equipment and physical space safety; and departmental merchandising safety standards.\nFiscal 2024 Form 10-K\n5\nTable\n of \nContents\nOUR SUPPLY CHAIN\nWe continue to focus on building best-in-class competitive advantages in our supply chain to be responsive to our customers’ expectations for how, when and where they choose to receive our products and services. As part of enhancing the interconnected shopping experience, we continue to invest in our supply chain network, with the goal of achieving the fastest, most efficient and most reliable delivery capabilities in home improvement. Our efforts are focused on ensuring product availability and increasing the speed and reliability of delivery for our customers while managing our costs. Our supply chain investments have helped us to operate effectively and meet our customers’ needs, even with the challenging economic environment over the past few years. \nWe centrally forecast and replenish the vast majority of our Home Depot store products through sophisticated inventory management systems and utilize our network of distribution centers to serve both our stores’ and customers’ needs. Our supply chain includes multiple distribution center platforms in the U.S., Canada, and Mexico tailored to meet the needs of our stores and customers based on types of products, location, transportation, and delivery requirements. These include rapid deployment centers, stocking distribution centers, bulk distribution centers, flatbed distribution centers, and direct fulfillment centers, among others. Over the past several years, we have invested to further automate and mechanize our rapid deployment center network to drive greater efficiency and faster movement of product. \nWe are also continuing to enhance our supply chain network with our expanded fulfillment facilities designed to drive speed and reliability of delivery for our customers. In many markets, we offer same day or next day delivery of a multitude of products through our stores and fulfillment centers. We also have omni-channel fulfillment centers that deliver product directly to customers, and market delivery operations that function as local hubs to consolidate freight for dispatch to customers for the final mile of delivery, with a focus on appliances. We have invested in our capabilities to control more of our appliance delivery end-to-end, manage all of our appliance delivery volume through our market delivery operations, and expand our last mile delivery capacity. We have also opened additional flatbed distribution centers that handle large items like lumber and building materials that are transported on flatbed trucks. Our network is designed to create a competitive advantage with unique, industry-leading capabilities for home improvement needs for both our Pros and consumers. We will continue to invest in our supply chain network as needed to support our business. \nIn addition to our distribution and fulfillment centers, we leverage our stores as a network of convenient customer pickup, return, and delivery fulfillment locations. We believe our premium real estate footprint provides a distinct structural and competitive advantage. For customers who shop online and want to pick up or return merchandise at a store, or have product delivered from a store, we have four interconnected retail programs: BOSS, BOPIS, BODFS, and BORIS. We also provide curbside pickup to complement our BOPIS offerings, in addition to the self-service lockers at the front entrance of many of our stores. We also offer car and van delivery service from the majority of our U.S. stores. For fiscal 2024, approximately 50% of our U.S. online orders were fulfilled through a store. SRS branch locations throughout the U.S. also enable deliveries direct to customer job sites on their preferred timelines. We continue to focus on developing new capabilities to improve both efficiency and customer experience for delivery from our stores and branches. Our strategic intent is to have a portfolio of efficient, timely and reliable sources and methods of delivery to choose from, optimizing order fulfillment and delivery based on customer needs, inventory locations, and available transportation options.\nSUSTAINABILITY AND HUMAN CAPITAL MANAGEMENT\nWe view sustainability and human capital management matters through the lens of our business, with an understanding that if we support our associates, our customers, our suppliers, and the communities we serve, we also support our business and create value for our shareholders. Our sustainability and human capital management priorities build on the culture and values on which Home Depot was founded, and our initiatives are embedded in our business strategy and activities. We organize our efforts around three pillars: (1) Focus on Our People, (2) Operate Sustainably, and (3) Strengthen Our Communities. Highlights of each of these pillars are set forth below. For further information on our three pillars, including related goals, see our 2024 Environmental, Social and Governance Report (the “2024 ESG Report”), available on our investor relations website at https://ir.homedepot.com/sustainability.\nFiscal 2024 Form 10-K\n6\nTable\n of \nContents\nFocus on Our People\nOur culture and our associates provide intangible and hard-to-replicate competitive advantages, which have been key to helping us navigate challenging market conditions. Our associates are essential to providing the experience and service that our customers demand. To preserve and protect that customer experience, we focus on cultivating a compelling associate experience, which we believe supports our ability to attract and retain our associates. This includes investing in competitive wages and benefits while also providing the culture, tools, training, and development opportunities that make working at The Home Depot an enjoyable and rewarding experience. These actions are the foundation of our core values of taking care of our associates, entrepreneurial spirit, building strong relationships, and respect for all people. \nCulture and Values.\n The Home Depot has a strong commitment to ethics and integrity, and we are a values- and culture-centric business. Our commitment to our core values drives our approach to human capital management. Our culture is based on our servant leadership philosophy represented by the inverted pyramid, which puts primary importance on our customers and our associates by positioning them at the top, with senior management at the base in a support role. We bring our culture to life through our core values, which serve as the foundation of our business and as the guiding principles behind the decisions we make every day.\nOur values also guide our efforts to create an environment that will help us attract and retain skilled associates in the competitive marketplace for talent. We empower our associates to deliver a superior customer experience by living our values, and we position our associates to embody our core values by integrating the importance of our culture into ongoing development programs and rewards programs. Leaders participate in programs designed to build and strengthen our culture, such as training on leadership skills, cross-functional collaboration, leading with our values, and associate engagement. Our core values are at the root of our human capital management programs.\nOur Workforce.\n At the end of fiscal 2024, we employed approximately 470,100 associates, of whom approximately 50,600 were salaried, with the remainder compensated on an hourly basis. Set forth below is the geographic makeup of our workforce: \nGeographic Location\nNumber of Associates\n% of Total Workforce\nUnited States\n419,600 \n89.3 \n%\nCanada\n32,000\n6.8 \n%\nMexico\n18,200\n3.9 \n%\nOther \n(1)\n300\n0.1 \n%\nTotal\n470,100\n100%\n————\n(1)    Includes associates in our sourcing organization located in China, Vietnam, India, Taiwan, Italy, Poland and Türkiye. \nFiscal 2024 Form 10-K\n7\nTable\n of \nContents\nBelow is the demographic data for our U.S. associates as of the end of fiscal 2024:\nAssociate Population\nRace/Ethnicity\nGender\n% Minority\n% White\n% Undisclosed\n% Female\n% Male\n% Undisclosed\nU.S. Workforce\n50%\n48%\n2%\n36%\n63%\n1%\nU.S. Managers & Above \n(1)\n39%\n60%\n1%\n34%\n65%\n1%\nU.S. Officers\n27%\n72%\n1%\n32%\n68%\n1%\n————\n(1)    Does not include officers.\nNote: Certain percentages in these tables may not sum to totals due to rounding.\nTalent Attraction and Development.\n As we attract and hire new associates, we strive to create a customer-like experience for jobseekers by focusing on speed and personalization as they progress through the steps of our recruiting process. Our careers website personalizes the user’s experience based on jobseeker location and searching behavior. Jobseekers can also apply for roles from anywhere using desktop or mobile devices. Once a jobseeker has applied for a role and has been selected to move forward in the recruiting process, we provide self-service for many of our positions by allowing jobseekers to schedule or reschedule pre-hire activities directly from their mobile device.\nWe offer our associates the opportunity to benefit from robust development opportunities. Our Home Depot University, or “HDU,” program, is a key part of this development, offering relevant content through multiple platforms, including instructor-led classes, e-learning, mobile learning, and additional online resources. We also invest in ongoing growth and development by providing coaching through continuous leader support and empowering our associates to learn new skills at their own pace through mobile applications our associates can access at any time. We equip our leaders with the tools they need to develop themselves and their teams through several programs designed to help them lead effectively, empower their teams, and serve as mentors for our associates. We continually assess and refine our leadership structure throughout the organization to allow our associates to focus on training and development and better serve our customers.\nAssociate Engagement.\n Associate engagement is the emotional commitment associates have to The Home Depot. It is vital to our culture and to our success. We create an engaging workplace by continuously listening to and acting on associate feedback. We provide several pulse check surveys to associates throughout the year that help us determine how emotionally connected those associates are to our customers, the Company, their jobs, fellow associates, and leaders. In addition, our annual Voice of the Associate survey serves as our primary means of gauging associates’ level of engagement within their roles. We use the feedback from these surveys to help improve the overall associate experience. We also maintain digital associate engagement platforms that link associates with common interests and fuels connections to co-workers and Company leaders. Additionally, we have a number of programs to recognize stores and individual associates for exceptional customer service and demonstrating our core values. \nRespect For All People.\n We strive to maintain a culture that welcomes everyone, and we believe it helps us achieve our business goals by driving excellent customer service and innovation, empowering our associates to thrive and excel, and enriching the communities in which we operate. This includes creating an environment where our associates feel valued and respected and providing equal opportunity for all of our associates.\nCompensation and Benefits.\n Consistent with our core values, we take care of our people by offering competitive compensation and comprehensive benefits programs. We continuously make wage investments to ensure our compensation packages reflect the evolving circumstances across our markets. Our profit-sharing programs for hourly associates also provide awards for performance against our business plan. Our associates can take advantage of a range of benefits, including healthcare and wellness programs, vacation and leave of absence benefits, including parental leave and paid sick/personal time off, a 401(k) match, our ESPPs, personal finance education and advisory services, assistance programs to help with managing personal and work-life challenges, family support programs, and educational assistance.\nFiscal 2024 Form 10-K\n8\nTable\n of \nContents\nOperate Sustainably\nWe have a long-standing commitment to\n \nreduce the impact that our operations and products have on the environment, which we believe helps make our business stronger, more agile, and more resilient. This approach extends from the products and services we offer to our customers; to our store construction, maintenance and operations; to our supply chain and packaging initiatives; to our responsible sourcing program. As we strive to operate sustainably, we focus on sourcing products responsibly, protecting our business operations from climate-related risks, and reducing our environmental impact. \nStrengthen Our Communities\nOne of our core values is “Giving Back,” and we support our communities in a number of ways. The Home Depot Foundation, a nonprofit supported by Home Depot, focuses on improving the homes and lives of U.S. veterans, assisting communities affected by natural disasters, and training skilled tradespeople to fill the labor gap. The Company and The Home Depot Foundation are partnering with industry leaders on training programs to train the next generation of skilled tradespeople and help them find careers in the home improvement industry through our Path to Pro programs, which include a career networking site to connect skilled tradespeople to industry Pros. Our Team Depot associate volunteers also extend the mission of The Home Depot Foundation in communities across the country, donating thousands of volunteer hours each year to serve the needs of our communities. We also partner with a variety of suppliers and organizations to further support our efforts to strengthen the communities in which our customers and associates live. \nGOVERNMENT REGULATION\nAs a company with both U.S. and international operations, we are subject to the laws of the U.S. and foreign jurisdictions in which we operate and the rules and regulations of various governing bodies, which may differ among jurisdictions. Compliance with these laws, rules and regulations has not had, and is not expected to have, a material effect on our capital expenditures, results of operations, or competitive position as compared to prior periods.\nAVAILABLE INFORMATION\nOur primary internet website is www.homedepot.com. We make available on the Investor Relations section of our website, free of charge, our Annual Reports to shareholders, Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements, and Forms 3, 4 and 5 for our directors and certain of our officers, and amendments to those reports, as soon as reasonably practicable after filing such documents with, or furnishing such documents to, the SEC.\nWe include website addresses throughout this report for reference only. The information contained on these websites, including any document posted on or accessible through them, is not incorporated by reference into this report.",
    "item1a": "Item 1A. “Risk Factors.”\n \nFiscal 2024 Form 10-K\n22\nTable\n of \nContents\nGovernance\nOur efforts to create a secure digital environment start with the governance and oversight of our data security and privacy policies and strategy. \nAt the Board of Directors (the “Board”) level, cybersecurity is overseen by the Board and by the Board’s Audit Committee, which has primary responsibility for overseeing cybersecurity and privacy risks.\n \nDuring fiscal 2024, the Board and/or the Audit Committee received quarterly reports on privacy, data protection and/or cybersecurity matters from \nsenior information technology (“IT”) leaders, including our Chief Information Officer (“CIO”) and CISO, as well as the Chair of our Data Security and Privacy Governance Committee (discussed below).\n In addition, our Board held a meeting dedicated to cybersecurity topics. Periodically, our Board receives presentations on cybersecurity matters from third-party cybersecurity experts.\n \nOur CISO, who reports to our CIO, joined the Company in 2021 after working with the Company as a third-party consultant since 2019. During a nearly two-decade tenure at a leading professional services firm, he worked with clients on managing information security, developing cybersecurity strategy, and implementing effective information and cybersecurity programs and initiatives addressing emerging cybersecurity threats. Our CISO has significant prior cybersecurity experience, including experience protecting company, customer and associate data across a diverse set of industries. He holds a Bachelor of Science degree in Information Systems and has achieved several relevant certifications, including Certified Information Security Manager, Certified Information Systems Security Professional, and Certified Information Privacy Professional. Our CISO leads a team of over 500 associates focused on cybersecurity.\n \nWe have three management-level committees that support our cybersecurity, privacy and data governance efforts. They are led by our Data Security and Privacy Governance Committee, which provides management-level governance over cybersecurity matters, including discussion of cybersecurity priorities, emerging risks, awareness and training programs, risk mitigation efforts, and regulatory compliance. This committee is chaired by our Vice President – Internal Audit and Corporate Compliance and is composed of a cross-functional team of senior leaders, including our CEO. \nThe committee generally meets quarterly and is supported by our Security and Technology Risk Leadership Committee and our Privacy and Data Governance Committee. The activities of the Data Security and Privacy Governance Committee are reported to the Board or the Audit Committee by the Chair of the committee, as appropriate. \nThe Security and Technology Risk Leadership Committee provides leadership and oversight of our cybersecurity program. It is chaired by our CISO and composed of Company technology leaders as well as a cross-functional group of representatives from other departments. Our Privacy and Data Governance Committee provides leadership and oversight of our privacy and data governance programs. It is chaired by our Chief Privacy Officer and composed of a cross-functional group across approximately 20 departments. \nThese committees generally meet monthly or every other month and report to the Data Security and Privacy Governance Committee on a regular basis.",
    "item1b": "Item 1B.  Unresolved Staff Comments.\nNot applicable.\nFiscal 2024 Form 10-K\n21\nTable\n of \nContents",
    "item1c": "Item 1C.  Cybersecurity.\nRisk Management and Strategy\nWe recognize the importance of assessing, identifying, and managing material risks associated with cybersecurity threats. We have implemented cybersecurity processes, technologies, and controls to aid in our efforts to assess, identify, and manage such risks. Our cybersecurity program prioritizes threat mitigation, while focusing on maintaining the integrity and resilience of our \nsystems\n. We leverage the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework as guidelines in the development of our cybersecurity program. We also adhere to applicable Payment Card Industry Data Security Standards. \nThe cybersecurity risk management process and related governance processes are integrated into our broader enterprise risk management framework, which is designed to appropriately identify, prioritize, manage, and oversee risks.\n \nOverseeing our cybersecurity efforts on a day-to-day basis is our cybersecurity team, led by our Chief Information Security Officer (“CISO”)\n. \nOur cybersecurity team, in partnership with third parties, designs and implements our data security and cybersecurity programs, risk assessments, monitoring procedures, and training programs for our associates. We continue to make investments to enhance our ability to identify, protect from and detect security risks within our environment.\nMonitoring and Mitigation.\n  We maintain a range of tools and services to aid in and inform our monitoring and mitigation of cyber risks. Throughout the year, internal teams conduct targeted audits and penetration tests. \nWe engage third parties to independently evaluate our cybersecurity maturity on an annual basis and perform a risk assessment, as well as to provide expertise as needed on various cybersecurity programs and issues\n. We maintain a security operations center that is staffed around the clock to detect, mitigate, and respond to cyber threats. In the event we identify a cybersecurity incident, we have defined procedures to respond to and recover from such incident as quickly as possible. Our policies and procedures are reviewed periodically to ensure they remain aligned with current regulatory requirements and the current threat landscape. We also have established classification and retention policies focused on limiting the risk of unauthorized exposure of customer, associate, and business data. We maintain cybersecurity insurance to help provide protection against losses arising from significant security incidents.\nThe Company has an Incident Response Team (“IRT”), a cross-functional group with the expertise, authority and resources to act quickly, efficiently and appropriately to investigate, coordinate the response to, remediate, and communicate regarding a cybersecurity incident. The IRT uses a detailed incident response plan that outlines and coordinates the actions we take to prepare for, detect, respond to and recover from cybersecurity incidents, which include processes to triage, assess the severity of, escalate, contain, investigate, and remediate an incident, as well as to comply with potentially applicable legal obligations and mitigate brand and reputational damage. In addition, our IRT engages in tabletop exercises at least annually to simulate a response to a cybersecurity incident and uses the findings to improve our processes, plans and technologies.\nTraining.  \nWe provide data security and privacy awareness and training to all associates upon hire and on an annual basis, with additional customized, role-based training provided to targeted internal audiences. In addition, we conduct periodic awareness campaigns and regular phishing email simulation tests to reinforce our new-hire and annual training and promote ongoing awareness of risks.\nVendor Security.  \nWe have a vendor risk management program that works to classify service provider or business partner risk based on several factors, including but not limited to data type accessed and/or retained. Using a risk-based approach, we perform diligence and security risk assessments for certain vendors and service providers and include appropriate obligations in our contractual arrangements.\nCybersecurity Risks.\n \nWe have not experienced any material cybersecurity incidents in the past fiscal year. We face risks from cybersecurity threats that, if realized, may materially affect our business strategy, results of operations or financial condition\n. Despite our efforts, our cybersecurity risk management processes may not be fully implemented, complied with or effective in preventing or mitigating future cybersecurity risks. We describe whether and how risks from identified cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or, if realized, are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition, in \nPart I,"
  }
}