{
  "ticker": "HII",
  "cik": "0001501585",
  "company_name": "HUNTINGTON INGALLS INDUSTRIES, INC.",
  "filing_date": "2025-02-06",
  "accession": "0001501585-25-000006",
  "primary_doc": "hii-20241231.htm",
  "item_sections": {
    "item1": "Item 1A. \"Risk Factors.\"\nBusiness Environment\nWe continue to see uncertainty in the economy, our industry, and our company. Our customers, suppliers and subcontractors continue to face challenges, and our results for the year were adversely affected by significant challenges relating to labor availability, our supply chain, and inflation, among other challenges. We cannot predict how long these challenges will continue, whether these challenges will change over time, or whether our actions to address these challenges will be successful. \nU.S. Political and Economic Environment\n – The November 2024 elections, which resulted in Republican control of the executive and legislative branches, has resulted in a range of policy changes both domestically and internationally as Republicans seek to reorient U.S. priorities. The new Administration has employed, and is expected to continue to employ, executive actions and other methods, including regulations and policy proposals that impact trade, tax, immigration, energy policies, and other areas. \nThe debt ceiling is expected to continue to be an area of considerable debate. High debt levels may impose fiscal constraints on many policy objectives, complicating efforts to deliver on promises made during the elections. \nDomestically, we expect that national debt levels, inflationary pressures, gross domestic product growth, among other considerations, could impact U.S. budgets and priorities, including with respect to discretionary spending. While monthly inflation rates have declined since peaking at 9.1% in June of 2022, rising military personnel and operations and maintenance costs continue to pressure the Pentagon’s investment portfolio buying power. If above-\n33\nTable of Contents\n                                                    \n \n \naverage inflationary conditions continue over the long-term, additional resources may be required to address contract and labor cost growth. \nGlobal supply chain and labor markets continue to experience high levels of disruption, causing significant materials and parts shortages, including raw material, microelectronics and commodity shortages, as well as delivery delays, labor shortages, and price increases. The labor market continues to present significant challenges for our Company, our industry, and the supply chain. Our ability to increase throughput and meet production schedules is directly impacted by labor availability and performance. We monitor labor market conditions and trends and work to mitigate the effects of labor challenges through a variety of measures. Challenges in the labor market are addressed through targeted talent acquisition, partnerships with community colleges, apprentice school sourcing and recruiting, workforce succession planning, and initiatives to retain current employees. Labor shortages and retention also are impacting our supply chain, resulting in longer lead times for materials, parts, and other supplies. Our supply chain has been impacted further by delivery delays, raw material shortages and price increases caused by continued inflationary pressures.\nThe shipbuilding defense industry is unique in many ways. It is heavily capital and skilled labor intensive. The U.S. Navy, a large single customer with many needs and requirements, dominates the industry's customer base and is served by a fragile supplier base that has trended toward exclusive providers. The DoD continues to adjust its procurement practices and streamline acquisition organizations and processes in an ongoing effort to reduce costs, gain efficiencies, and enhance program management and control. Additionally, the U.S. Navy must compete with other national priorities, including other defense activities, non-defense discretionary spending, and entitlement programs, for a share of federal budget funding. While the impact to our business resulting from these developments remains uncertain, they could have a material impact on current programs, as well as new business opportunities with the DoD. \nDefense Spending Environment\n – On March 11, 2024, the Biden Administration proposed a Fiscal Year (FY) 2025 budget request of $849.8 billion for the DoD, consistent with the discretionary funding cap for defense approved by Congress under the Financial Responsibility Act (“FRA”) of 2023. Additionally, the FRA included a sequestration mechanism to incentivize Congress to enact regular, full-year appropriations legislation instead of relying on continuing resolutions (\"CR\"). Although the Federal government is operating under a CR through March 14, 2025, sequestration would not be enforced until April 30, 2025 and would be reversed upon the enactment of full-year appropriations. The emergency national security supplemental funding legislation enacted during fiscal year 2025 is not subject to the FRA budget caps. \nThe House and Senate reached a compromise agreement on the National Defense Authorization Act (\"NDAA\") for fiscal year 2025 in December 2024. Overall, the fiscal year 2025 NDAA authorizes $883.7 billion in national security spending, including $849.9 billion for the Pentagon, consistent with the spending caps directed in the FRA. The compromise legislation supports our shipbuilding priorities with a total authorization of $32.7 billion for shipbuilding programs, including procurement authorization of the \nTravis Manion \n(LPD 33) Flight II amphibious ship, one \nVirginia\n class (SSN 774) submarine, three \nArleigh Burke\n class (DDG 51) destroyers and the RCOH of USS \nHarry S. Truman\n (CVN 75). Additionally, the fiscal year 2025 NDAA supports the amphibious warship bundle contract signed in 2024 by authorizing advanced procurement funding for LPD 34 (unnamed), LPD 35 (unnamed), and \nHelmand Province\n (LHA 10). \nBoth House and Senate appropriations bills have passed out of committee, and the House defense appropriations bill has been approved by the full House. The House defense appropriations bill funds the Defense Department within the spending caps in the 2023 debt limit deal and supports the President’s budget request by funding one \nVirginia\n class (SSN 774) submarine, two \nArleigh Burke\n class (DDG 51) destroyers, one LPD Flight II amphibious ship, and one CVN RCOH. The Senate Appropriations Committee added approximately $21 billion in emergency funding not subject to the FRA caps and included fiscal year 2025 funding for three \nArleigh Burke\n class (DDG 51) destroyers, one \nVirginia\n class (SSN 774) submarine, one LPD Flight II amphibious ship, one CVN RCOH, one FFG-62 frigate, and advanced procurement funding for an additional \nArleigh Burke\n class destroyer in fiscal year 2026. \nAlthough a new fiscal year began on October 1, 2024, annual appropriations to fund the federal government for fiscal year 2025 have not been enacted. To provide Congress additional time to reach agreements on funding levels for federal agencies, a continuing resolution was enacted extending funding through December 20, 2024, at fiscal year 2024 levels. Congress passed a second CR in December 2024 that extended federal funding through March 14, 2025.\n34\nTable of Contents\n                                                    \n \n \nWhile the DoD is normally prohibited from starting new programs or increasing funding on existing programs under a CR, the current CR includes anomalies that will allow the DoD to deviate from typical restrictions and obligate funding to support procurement of the \nVirginia\n class and \nColumbia\n class submarine programs. A $5.7 billion emergency appropriations anomaly supports fiscal year 2024 and fiscal year 2025 \nVirginia\n class submarines as well as workforce wages and shipyard investments. This funding does not count against the FRA fiscal year 2025 funding cap. \nWe cannot predict the outcome of the fiscal year 2025 budget process or whether additional short-term funding will be required in the event annual appropriations measures are not finalized by the expiration date of the current CR. \nGlobal Geopolitical Environment\n – The global geopolitical environment continues to be impacted by uncertainty, heightened tensions, and instability, all of which drive the increasing need for defense offerings, including those provided by our company. Global geopolitical relationships continue to evolve. The U.S. and its allies face a global security environment that is impacted by threats from state and non-state actors, including major global powers, as well as terrorist organizations, emerging nuclear tensions, diverse regional security concerns, and political instability. \nThe ongoing conflict in Ukraine and the associated sanctions have impacted the global economy, caused heightened cyber and other security risks, exacerbated supply chain challenges, resulted in higher energy costs, and further impacted inflationary pressures. In addition, tensions with China, along with hostilities in the Middle East, continued conflicts globally, and changes in international trade policies have impacted, and could continue to impact, the global market for defense products, services, and solutions.\nProgram Descriptions\n \nFor convenience, a brief description of certain programs discussed in this Annual Report on Form 10-K is included in the Glossary of Programs.\nCONTRACTS\nWe generate most of our revenues from long-term U.S. Government contracts for the production of goods and services. Government contracts typically include the following cost elements: direct material, labor and subcontracting costs, and certain indirect costs, including allowable general and administrative expenses. Unless otherwise specified in a contract, costs billed to contracts with the U.S. Government are treated as allowable and allocable costs under the FAR and CAS regulations. Examples of costs incurred by us that are not allowable under the FAR and CAS regulations include certain legal costs, lobbying costs, charitable donations, interest expense, organizational costs, including certain merger and acquisition costs, and advertising costs.\nWe monitor our policies and procedures with respect to our contracts on a regular basis to ensure consistent application under similar terms and conditions, as well as compliance with all applicable government regulations. In addition, the DCAA routinely audits the costs we incur that are allocated to U.S. Government contracts.\nOur contracts typically fall into one of four categories: firm fixed-price, fixed-price incentive, cost-type, and time and materials. See Note 6: Revenue in Item 8.\n•\nFirm Fixed-Price Contracts \n- A firm fixed-price contract is a contract in which the specified scope of work is agreed to for a price that is predetermined by bid or negotiation and not generally subject to adjustment regardless of costs incurred by the contractor. \n•\nFixed-Price Incentive Contracts\n - Fixed-price incentive contracts provide for reimbursement of the contractor's allowable costs, but are subject to a cost-share limit that affects profitability. Fixed-price incentive contracts effectively become firm fixed-price contracts once the cost-share limit is reached.\n•\nCost-Type Contracts \n- Cost-type contracts provide for reimbursement of the contractor's allowable costs plus a fee that represents profit. Cost-type contracts generally require that the contractor use its reasonable efforts to accomplish the scope of the work within some specified time and some stated dollar limitation. \n35\nTable of Contents\n                                                    \n \n \n•\nTime and Materials \n- Time and materials contracts specify a fixed hourly billing rate for each direct labor hour expended and reimbursement for allowable material costs and expenses.\nContract Fees \n- Negotiated contract fee structures include: fixed fee amounts, cost sharing arrangements to reward or penalize contractors for under- or over-cost target performance, respectively, positive award fees, and negative penalty arrangements. Profit margins may vary materially depending on the negotiated contract fee arrangements, percentage-of-completion of the contract, the achievement of performance objectives, and the stage of performance at which the right to receive fees, particularly under incentive and award fee contracts, is finally determined.\nAward Fees \n- Certain contracts contain award fees based on performance criteria such as cost, schedule, quality, and technical performance. Award fees are determined and earned based on an evaluation by the customer of our performance against such negotiated criteria. We consider award fees to be variable consideration and generally include these fees in the transaction price using a most likely amount approach. Award fees are limited to the extent of funding allotted by the customer and available for performance and those amounts for which a significant reversal of revenue is not probable.\nCRITICAL ACCOUNTING POLICIES, ESTIMATES, AND JUDGMENTS\nOur consolidated financial statements are prepared in accordance with U.S. GAAP, which requires management to make estimates, judgments, and assumptions that affect the amounts reported in the consolidated financial statements and the accompanying notes. Management considers an accounting policy to be critical if it is important to our financial condition and results of operations and requires significant judgment and estimates by management in its application. The development and selection of these critical accounting policies have been determined by our management. We have reviewed our critical accounting policies and estimates with the audit committee of our board of directors. Due to the significant judgment involved in selecting certain of the assumptions used in these policies, it is possible that different parties could choose different assumptions and reach different conclusions. While we base estimates and assumptions on our knowledge of current events and actions we may undertake in the future, actual results may ultimately differ from these estimates and assumptions. We consider our policies relating to the following matters to involve our most critical accounting policies and estimates:\n•\nRevenue recognition;\n•\nRetirement related benefit plans; and\n•\nWorkers' compensation.\nRevenue Recognition\nMost of our revenues are derived from long-term contracts for the production of goods and services provided to the U.S. Government, which are generally accounted for by recognizing revenues over time using a cost-to-cost measure of progress. In estimating contract costs, we utilize a profit-booking rate based upon performance expectations that incorporate a number of assumptions and estimates regarding risks related to technical requirements, feasibility, schedule, and contract costs. Management performs periodic reviews of the contracts to evaluate the underlying risks, which may increase the profit-booking rate as we are able to mitigate and retire such risks. For the impacts of changes in estimates on our consolidated statements of operations and comprehensive income, see Note 6: Revenue in Item 8.\nRetirement Related Benefit Plans\nWe recognize, on a plan-by-plan basis, the funded status of our retirement related benefit plans as an asset or liability on our balance sheet, with corresponding adjustments to after-tax accumulated other comprehensive loss and deferred tax assets or liabilities. The funded status represents the difference between the benefit obligation and the fair value of plan assets. See Note 16: Employee Pension and Other Postretirement Benefits in Item 8.\nWe calculate our retirement related benefit plan costs under both CAS and U.S. GAAP Financial Accounting Standards (\"FAS\"). The calculations under CAS and FAS require significant judgment. CAS prescribes the determination, allocation, and recovery of retirement related benefit plan costs on U.S. Government contracts through the pricing of products and services. FAS prescribes the methodology used to determine retirement related benefit plan expense or income, as well as the liability, for financial reporting purposes. The CAS requirements for these costs and their calculation methodologies differ from FAS. As a result, while both CAS and FAS use \n36\nTable of Contents\n                                                    \n \n \nassumptions in their calculation methodologies, each method results in different calculated amounts of retirement related benefit plan costs.\nWe recover our CAS costs through the pricing of products and services on U.S. Government contracts, so that the CAS cost is recognized in segment product sales and service revenues and in the costs of those product sales and service revenues. In order to present our consolidated financial statements in accordance with FAS, we record the difference between our FAS expense and CAS cost (“FAS/CAS Adjustment”) as operating income within segment operating income and non-operating retirement benefit (expense).\nThe minimum funding requirements for our qualified pension plans are determined under the Employee Retirement Income Security Act of 1974 (\"ERISA\"), which is primarily based on the year's expected service cost and amortization of other previously unfunded liabilities. Effective January 1, 2011, we were subject to the funding requirements under the Pension Protection Act of 2006 (the \"PPA\"), which amended ERISA. Under the PPA and the American Rescue Plan Act of 2021, we are required to fully fund our pension plans over a rolling 15-year period as determined annually based upon the funded status at the beginning of each year. The PPA also introduced a variety of benefit restrictions that apply if a plan falls below certain funded percentages, as defined by the Internal Revenue Code. In funding our plans, we consider various factors, including the minimum funding requirements, the funded status needed to avoid potential benefit restrictions and other adverse consequences, minimum CAS funding requirements, and the current and anticipated funding levels of each plan.\nEffective January 1, 2021, we adopted the Safe Harbor methodology for determining CAS pension costs. As a result, the interest rates used to calculate pension liabilities under CAS are consistent with those used in the determination of minimum funding requirements under ERISA.\nPension funding requirements for plan sponsors under ERISA are subject to pension relief in the form of higher interest rate assumptions introduced by the Moving Ahead for Progress in the 21st Century Act and subsequently extended by the American Rescue Plan Act of 2021. Using these minimum funding interest rates for the purposes of determining pension costs under CAS reduces volatility in CAS costs year-over-year and provides more predictable costs for our customers, while better aligning reimbursements of pension costs under our contracts with our required pension plan contributions under ERISA.\nDue to the differences in requirements and calculation methodologies between FAS and CAS, our FAS pension expense is not necessarily indicative of the funding requirements under the PPA or the amounts we recover from the U.S. Government under CAS.\nAssumption\ns - We account for our retirement related benefit plans on the accrual basis under FAS. The measurements of obligations, costs, assets, and liabilities require significant judgment. We annually review our assumptions, which are set at each year end and generally not changed during the following year unless a major plan event occurs, such as an amendment, curtailment, or settlement that would trigger a remeasurement. The key assumptions in these measurements are the interest rate used to discount future benefit payments and the expected long-term rate of return on plan assets.\nDiscount Rate \n- The assumed discount rate under FAS is used to determine the retirement related benefit plan obligations and expense, and represents the hypothetical rate at which plan benefit obligations could be effectively settled at the measurement date. Consequently, the discount rate can be volatile from year to year. The discount rate assumption is determined for each plan by constructing a hypothetical portfolio of high-quality bonds with cash flows that match the estimated outflows for future benefit payments to determine a single equivalent discount rate. Benefit payments are not only contingent on the terms of a plan but also on the underlying participant demographics, including current age and assumed mortality. We use only bonds that are denominated in U.S. Dollars, are rated Aa or better by nationally recognized statistical rating agencies, have a minimum outstanding issue of $50 million as of the measurement date, and are not convertible or index-linked. \nExpected Long-Term Rate of Return \n- The expected long-term rate of return on assets is used to calculate net periodic expense, based on such factors as historical returns, targeted asset allocations, investment policy, duration, expected future long-term performance of individual asset classes, interest rates, inflation, portfolio volatility, investment management and administrative fees, and risk management strategies. Historical plan asset performance alone has inherent limitations in predicting future returns. While studies are helpful in understanding past and current trends and performance, the rate of return assumption is based more on long-term prospective views to avoid short-term market influences. Unless plan assets and benefit obligations are subject to re-\n37\nTable of Contents\n                                                    \n \n \nmeasurement during the year, the expected return on pension assets is based on the fair value of plan assets at the beginning of the year.\nMortality\n - Mortality assumptions are used to determine the retirement related benefit obligations and expense, and represent the likelihood and duration of benefit payments to plan participants based on historical experience and projected longevity. We periodically update our mortality assumptions as circumstances warrant.\nDifferences arising from actual experience or changes in assumptions might materially affect retirement related benefit plan obligations and the funded status. Actuarial gains and losses arising from differences between assumptions and actual experience or changes in assumptions are deferred in accumulated other comprehensive loss. This unrecognized amount is amortized as a component of net expense to the extent it exceeds 10% of the greater of the plan's benefit obligation or plan assets. The amortization period for actuarial gains and losses is the estimated average remaining service life of the plan participants. In 2024, the actual return on assets was approximately 7.7%, which was less than the expected return assumption of 8.00%. For the year ended December 31, 2024, the weighted average discount rates for our pension and other postretirement benefit plans increased by 70 and 44 basis points, respectively. The differences in asset returns resulted in an actuarial loss of $24 million, and the differences in discount rates resulted in an actuarial gain of $500 million for the year ended December 31, 2024.\nAn increase or decrease of 25 basis points in the discount rate and the expected long-term rate of return assumptions would have had the following approximate impacts on pension expense and obligations:\n($ in millions)\nIncrease (Decrease) in 2025 Expense\nIncrease (Decrease) in December 31, 2024 Obligations\n25 basis point decrease in discount rate\n$\n3 \n$\n163 \n25 basis point increase in discount rate\n— \n(156)\n25 basis point decrease in expected return on assets\n17 \n25 basis point increase in expected return on assets\n(17)\nAssuming an 8.00% expected return on assets assumption, a $50 million pension plan contribution is generally expected to favorably impact the current year expected return on assets by approximately $2 million, depending on the timing of the contribution. \nSensitivities to assumptions are not necessarily linear and are specific to the time periods noted.\nCAS Cost\n - In addition to providing the methodology for calculating retirement related benefit plan costs, CAS also prescribes the method for assigning those costs to specific periods. While the ultimate liability for such costs under FAS and CAS is similar, the pattern of cost recognition is different. The key drivers of CAS pension cost include the funded status and the method used to calculate CAS reimbursement for each of our plans. A plan’s CAS pension cost can only be allocated until the plan is fully funded as defined under the CAS requirements.\nOther FAS and CAS Pension Considerations -\n A key driver of the difference between FAS expense and CAS cost (and consequently the FAS/CAS Adjustment) is the pattern of earnings and expense recognition for actuarial gains and losses that arise when our asset and liability experiences differ from our assumptions under each set of requirements. Under FAS, our net actuarial gains and losses exceeding the 10% corridor are amortized over the estimated average remaining service life of the plan participants. Under CAS Harmonization, the amortization period is 10 years for actuarial gains and losses. Both FAS and CAS use a \"market-related value\" of plan assets approach to calculate the amount of deferred asset gains or losses to be amortized. Under CAS, actual asset gains and losses are systematically smoothed over five years, subject to certain limitations. For FAS, we do not use this smoothing method, and instead use fair value in determining our FAS expense. Accordingly, FAS expense generally reflects recent asset gains and losses sooner than CAS. \nAdditionally, CAS cost is only recognized for plans that are not fully funded as defined under CAS. If a plan becomes or ceases to be fully funded due to our asset or liability experience, our CAS cost will change accordingly. \nRetirement Plan Assets - \nRetirement plan assets are stated at fair value. Investments in equity securities (common and preferred) are valued at the last reported sales price when an active market exists. Investments in fixed-income \n38\nTable of Contents\n                                                    \n \n \nsecurities are generally valued based on market transactions for comparable securities and various relationships between securities that are generally recognized by institutional traders. Investments in hedge funds, real estate investment funds, private partnerships, collective trust funds, and commingled funds are generally valued at their Net Asset Values (\"NAV\") or equivalent, which are based on the current fair values of the fund's underlying assets.\nManagement reviews independently appraised values, audited financial statements, and additional pricing information to evaluate the NAV or its equivalent. \nFor the limited group of investments for which market quotations are not readily available or for which the above valuation procedures are deemed not to reflect fair value, additional information is obtained from the investment manager and evaluated internally to determine whether any adjustments are required to reflect fair value. See Note 16: Employee Pension and Other Postretirement Benefits in Item 8.\nAccumulated Other Comprehensive Loss - \nChanges in assumptions and changes to plan assets and benefit obligations due to differences between actuarial assumptions and actual results are reported as actuarial gains and losses and recorded in accumulated other comprehensive loss, along with unrecognized prior service costs arising from plan amendments. As disclosed in Note 16: Employee Pension and Other Postretirement Benefits in Item 8, net pre-tax unrecognized actuarial gains as of December 31, 2024 were $59 million and unrecognized actuarial losses as of December 31, 2023 were $455 million. The increase in actuarial gains in 2024 was primarily driven by higher discount rates used to determine benefit obligations of $500 million and amortization of previously unrecognized actuarial losses of $5 million, which were offset by lower than expected asset returns of $24 million.\nNet pre-tax unrecognized prior service costs (credits) as of December 31, 2024 and 2023 were $111 million and $125 million, respectively. These net deferred costs (credits) primarily originated from plan amendments, including those resulting from collective bargaining agreements. The change in unrecognized prior service costs (credits) in 2024 resulted from plan amendments and the amortization of previously accumulated prior service costs (credits). \nWorkers' Compensation\n \nOur operations are subject to federal and state workers' compensation laws. We maintain self-insured workers' compensation plans and participate in federally administered second injury workers' compensation funds. We estimate the liability for such claims and funding requirements on a discounted basis utilizing actuarial methods based on various assumptions, which include our historical loss experience and projected loss development factors. We periodically, and at least annually, update our assumptions based on an actuarial analysis. For further information on workers’ compensation, see Environmental, Health & Safety in Item 1 and Note 16: Commitments and Contingencies in Item 8.\nAccounting Standards Updates\n \nSee Note 3: Accounting Standards Updates in Item 8 for further information.\n39\nTable of Contents\n                                                    \n \n \nCONSOLIDATED OPERATING RESULTS\nThe following table presents selected financial highlights:\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nSales and service revenues\n$\n11,535\n \n$\n11,454 \n$\n10,676 \n$\n81 \n1 \n%\n$\n778 \n7 \n%\nCost of product sales and service revenues\n10,085\n \n9,808 \n9,236 \n277 \n3 \n%\n572 \n6 \n%\nIncome from operating investments, net\n49\n \n37 \n48 \n12 \n32 \n%\n(11)\n(23)\n%\nOther income and gains, net\n9\n \n120 \n1 \n(111)\n(93)\n%\n119 \n11,900 \n%\nGeneral and administrative expenses\n973\n \n1,022 \n924 \n(49)\n(5)\n%\n98 \n11 \n%\nOperating income\n535\n \n781 \n565 \n(246)\n(31)\n%\n216 \n38 \n%\nInterest expense\n(95)\n(95)\n(102)\n— \n— \n%\n7 \n7 \n%\nNon-operating retirement benefit\n179\n \n148 \n276 \n31 \n21 \n%\n(128)\n(46)\n%\nOther, net\n24\n \n19 \n(20)\n5 \n26 \n%\n39 \n195 \n%\nFederal and foreign income taxes\n93\n \n172 \n140 \n(79)\n(46)\n%\n32 \n23 \n%\nNet earnings\n$\n550\n \n$\n681 \n$\n579 \n$\n(131)\n(19)\n%\n$\n102 \n18 \n%\nOperating Performance Assessment and Reporting\nWe manage and assess the performance of our business based on our performance on individual contracts and programs using the financial measures referred to below, with consideration given to the Critical Accounting Policies, Estimates, and Judgments referred to in this section. Our portfolio of long-term contracts is largely flexibly-priced. Therefore, sales tend to fluctuate in concert with costs across our large portfolio of active contracts, with operating income being a critical measure of operating performance. Under FAR rules that govern our business with the U.S. Government, most types of costs are allowable, and we do not focus on individual cost groupings, such as cost of sales or general and administrative expenses, as much as we do on total contract costs, which are a key factor in determining contract operating income. As a result, in evaluating our operating performance, we look primarily at changes in sales and service revenues, as well as operating income, including the effects of significant changes in operating income as a result of changes in contract financial estimates and the use of the cumulative catch-up method of accounting in accordance with GAAP. This approach is consistent with the long-term life cycle of our contracts, as management assesses the bidding of each contract by focusing on net sales and operating profit and monitors performance in a similar manner through contract completion. Consequently, our discussion of business segment performance focuses on net sales and operating profit, consistent with our approach for managing our business.\nSales and Service Revenues\nPeriod-to-period revenues reflect performance under new and ongoing contracts. Changes in sales and service\nrevenues are typically expressed in terms of volume. Unless otherwise described, volume generally refers to\nincreases (or decreases) in reported revenues due to varying production activity levels, delivery rates, or service\nlevels on individual contracts. Volume changes will typically carry a corresponding income change based on the\nprofit margin rate for a particular contract.\nSales and service revenues for the year ended December 31, 2024, increased $81 million, or 1%, compared to the same period in 2023, due to higher volumes at Mission Technologies and Ingalls, partially offset by lower volumes at Newport News.\nCost of Sales and Service Revenues\nCost of sales for both product sales and service revenues consists of materials, labor, and subcontracting costs, as well as an allocation of indirect costs for overhead. We manage the type and amount of costs at the contract level, which is the basis for estimating our total costs at completion of our contracts. Unusual fluctuations in operating performance driven by changes in a specific cost element across multiple contracts are described in our analysis.\n40\nTable of Contents\n                                                    \n \n \nRefer to \"Segment Operating Results\" and \"Product and Service Revenues and Cost Analysis\" in this section for details related to cost of sales for both product sales and service revenues.\n \nIncome from Operating Investments, Net\nThe activities of our operating investments are closely aligned with the operations of the segments holding the investments. We therefore record income related to earnings from equity method investments in our operating income.\nRefer to \"Segment Operating Results\" in this section for details related to income from operating investments.\nOther Income and Gains, Net\nOther income and gains, net in 2024 was $9 million, compared to $120 million in 2023. The decrease was due to the sale of a court judgment in 2023 and the settlement of a representations and warranties insurance claim related to the acquisition of Hydroid in 2023, partially offset by the settlement of an insurance claim in 2024.\nGeneral and Administrative Expenses\nIn accordance with industry practice and the regulations that govern the cost accounting requirements for government contracts, most general and administrative expenses are considered allowable and allocable costs on government contracts. These costs are allocated to contracts in progress on a systematic basis, and contract performance factors include this cost component as an element of cost.\nGeneral and administrative expenses in 2024 decreased $49 million, or 5%, compared to 2023. The decrease was primarily due to lower state taxes.\nOperating Income \nWe consider operating income an important measure for evaluating our operating performance, and, consistent with industry practice, we define operating income as revenues less the related costs of producing the revenues and general and administrative expenses.\nWe internally manage our operations by reference to \"segment operating income,\" which is defined as operating income before the Operating FAS/CAS Adjustment and non-current state income taxes, neither of which affects contract performance. Segment operating income is not a recognized measure under GAAP. When analyzing our operating performance, investors should use segment operating income in addition to, and not as an alternative for, operating income or any other performance measure presented in accordance with GAAP. It is a measure we use to evaluate our core operating performance. We believe segment operating income reflects an additional way of viewing aspects of our operations that, when viewed with our GAAP results, provides a more complete understanding of factors and trends affecting our business. We believe the measure is used by investors and is a useful indicator to measure our performance. Because not all companies use identical calculations, our presentation of segment operating income may not be comparable to similarly titled measures of other companies. Refer to \"Segment Operating Results\" in this section for details related to segment operating income, as well as activity within each segment.\nThe following table reconciles operating income to segment operating income:\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nOperating income\n$\n535\n \n$\n781 \n$\n565 \n$\n(246)\n(31)\n%\n$\n216 \n38 \n%\nOperating FAS/CAS Adjustment\n62\n \n72 \n145 \n(10)\n(14)\n%\n(73)\n(50)\n%\nNon-current state income taxes\n(24)\n(11)\n2 \n(13)\n(118)\n%\n(13)\n(650)\n%\nSegment operating income\n$\n573\n \n$\n842 \n$\n712 \n$\n(269)\n(32)\n%\n$\n130 \n18 \n%\n    \n41\nTable of Contents\n                                                    \n \n \nFAS/CAS Adjustment and Operating FAS/CAS Adjustment\nThe FAS/CAS Adjustment reflects the difference between expenses for pension and other postretirement benefits determined in accordance with GAAP and the expenses for these items included in segment operating income in accordance with CAS. The Operating FAS/CAS Adjustment excludes the following components of net periodic benefit costs: interest cost, expected return on plan assets, amortization of prior service cost (credit) and actuarial loss (gain), and settlement and curtailment effects.\nThe components of the Operating FAS/CAS Adjustment were as follows:\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nFAS benefit (expense)\n$\n64\n \n$\n30 \n$\n86 \n$\n34 \n113 \n%\n$\n(56)\n(65)\n%\nCAS cost\n53\n \n46 \n45 \n7 \n15 \n%\n1 \n2 \n%\nFAS/CAS Adjustment\n117\n \n76 \n131 \n41 \n54 \n%\n(55)\n(42)\n%\nNon-operating retirement benefit\n(179)\n(148)\n(276)\n(31)\n(21)\n%\n128 \n46 \n%\nOperating FAS/CAS Adjustment (expense) benefit\n$\n(62)\n$\n(72)\n$\n(145)\n$\n10 \n14 \n%\n$\n73 \n50 \n%\nThe Operating FAS/CAS Adjustment in 2024 was a net expense of $62 million, compared to a net expense of $72 million in 2023. The favorable change was primarily driven by higher interest rates under FAS.\nWe expect the FAS/CAS Adjustment in 2025 to be a net benefit of approximately $148 million (($100) million FAS and $48 million CAS), primarily driven by higher discount rates under FAS.\nWe expect the Operating FAS/CAS Adjustment in 2025 to be a net expense of approximately $43 million ($91 million FAS and $48 million CAS), primarily driven by higher interest rates under FAS. \nThe expected FAS/CAS Adjustment is subject to change during 2025, when we remeasure our actuarial estimate of the unfunded benefit obligation with updated census data and other items later in the year.\nNon-current State Income Taxes\nNon-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities, and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period. These amounts are recorded within operating income. Current period state income taxes are charged to contract costs and included in cost of sales and service revenues in segment operating income.\nNon-current state income tax benefit in 2024 was $24 million, compared to non-current state income tax benefit of $11 million in 2023. The favorable change in non-current state income taxes was driven by a decrease in deferred state income tax expense, primarily attributable to the reduction in the blended state income tax rate applied to our deferred tax balances.\nSEGMENT OPERATING RESULTS\nBasis of Presentation\nOur discussion of business segment performance focuses on sales and service revenues and operating income,\nconsistent with our approach for managing our business. We are aligned into three reportable segments: Ingalls, Newport News, and Mission Technologies. \n42\nTable of Contents\n                                                    \n \n \nThe following table presents segment operating results:\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nSales and Service Revenues\nIngalls\n$\n2,767\n \n$\n2,752 \n$\n2,570 \n$\n15 \n1 \n%\n$\n182 \n7 \n%\nNewport News\n5,969\n \n6,133 \n5,852 \n(164)\n(3)\n%\n281 \n5 \n%\nMission Technologies\n2,937\n \n2,699 \n2,387 \n238 \n9 \n%\n312 \n13 \n%\nIntersegment eliminations\n(138)\n(130)\n(133)\n(8)\n(6)\n%\n3 \n2 \n%\nSales and service revenues\n$\n11,535\n \n$\n11,454 \n$\n10,676 \n$\n81 \n1 \n%\n$\n778 \n7 \n%\nOperating Income\nIngalls\n$\n211\n \n$\n362 \n$\n292 \n$\n(151)\n(42)\n%\n$\n70 \n24 \n%\nNewport News\n246\n \n379 \n357 \n(133)\n(35)\n%\n22 \n6 \n%\nMission Technologies\n116\n \n101 \n63 \n15 \n15 \n%\n38 \n60 \n%\nSegment operating income\n573\n \n842 \n712 \n(269)\n(32)\n%\n130 \n18 \n%\nNon-segment factors affecting operating income\nOperating FAS/CAS Adjustment\n(62)\n(72)\n(145)\n10 \n14 \n%\n73 \n50 \n%\nNon-current state income taxes\n24\n \n11 \n(2)\n13 \n118 \n%\n13 \n650 \n%\nOperating income\n$\n535\n \n$\n781 \n$\n565 \n$\n(246)\n(31)\n%\n$\n216 \n38 \n%\nKEY SEGMENT FINANCIAL MEASURES\nSales and Service Revenues\nPeriod-to-period revenues reflect performance under new and ongoing contracts. Changes in sales and service revenues are typically expressed in terms of volume. Unless otherwise described, volume generally refers to increases (or decreases) in reported revenues due to varying production activity levels, delivery rates, or service levels on individual contracts. Volume changes will typically carry a corresponding income change based on the profit margin rate for a particular contract.\nSegment Operating Income\nSegment operating income reflects the aggregate performance results of contracts within a segment. Excluded from this measure are certain costs not directly associated with contract performance, such as the Operating FAS/CAS Adjustment and non-current state income taxes. Changes in segment operating income are typically expressed in terms of volume, as discussed above, or performance. Performance refers to changes in contract profit margin rates. These changes typically relate to profit recognition associated with revisions to estimated costs at completion (\"EAC\"), which reflect improved or deteriorated operating performance on that contract. Operating income changes are accounted for on a cumulative to date basis at the time an EAC change is recorded. Segment operating income may also be affected by, among other things, contract performance, inflationary pressures on our supply chain, the effects of workforce stoppages and other labor-related shortfalls, the availability of raw materials, the effects of natural disasters such as hurricanes, resolution of disputed items with the customer, recovery of insurance proceeds, and other discrete events. At the completion of a long-term contract, any originally estimated costs not incurred or reserves not fully utilized, such as warranty reserves, could also impact contract earnings. Where such items have occurred and the effects are material, a separate description is provided.\n43\nTable of Contents\n                                                    \n \n \nNet Cumulative Catch-up Revenue Adjustments\nFor the years ended December 31, 2024, 2023, and 2022, gross favorable and unfavorable cumulative catch-up revenue adjustments were as follows:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nGross favorable adjustments\n$\n287\n \n$\n309 \n$\n325 \nGross unfavorable adjustments\n(413)\n(191)\n(212)\nNet adjustments\n$\n(126)\n$\n118 \n$\n113 \nFor the years ended December 31, 2024, 2023, and 2022, net cumulative catch-up revenue adjustments by segment were as follows:\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nIngalls\n$\n14\n \n$\n91 \n$\n109\n \nNewport News\n(154)\n9 \n(13)\nMission Technologies\n14\n \n18 \n17\n \nNet adjustments\n$\n(126)\n$\n118 \n$\n113\n \nIngalls\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nSales and service revenues\n$\n2,767\n \n$\n2,752 \n$\n2,570 \n$\n15 \n1 \n%\n$\n182 \n7 \n%\nSegment operating income\n211\n \n362 \n292 \n(151)\n(42)\n%\n70 \n24 \n%\nAs a percentage of segment sales\n7.6\n \n%\n13.2 \n%\n11.4 \n%\nSales and Service Revenues\n \nIngalls sales and service revenues, including intersegment sales, increased $15 million, or 1%, in 2024 compared to 2023, primarily driven by higher volumes in surface combatants, partially offset by lower volumes in amphibious assault ships and the NSC program.\nSegment Operating Income\nIngalls segment operating income in 2024 was $211 million, compared to segment operating income of $362 million in 2023. The decrease was primarily driven by the sale of a court judgment in 2023 and lower performance on amphibious assault ships and surface combatants.\n \nNewport News\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nSales and service revenues\n$\n5,969\n \n$\n6,133 \n$\n5,852 \n$\n(164)\n(3)\n%\n$\n281 \n5 \n%\nSegment operating income\n246\n \n379 \n357 \n(133)\n(35)\n%\n22 \n6 \n%\nAs a percentage of segment sales\n4.1\n \n%\n6.2 \n%\n6.1 \n%\nSales and Service Revenues\nNewport News sales and service revenues, including intersegment sales, decreased $164 million, or 3%, in 2024 compared to 2023, primarily driven by cumulative catch-up adjustments on the \nVirginia\n class (SSN 774) submarine program, and lower volumes on aircraft carriers and naval nuclear support services, partially offset by higher volumes in the \nColumbia\n class (SSBN 826) program.\n44\nTable of Contents\n                                                    \n \n \n \nSegment Operating Income\nNewport News segment operating income in 2024 was $246 million, compared to segment operating income of $379 million in 2023. The decrease was primarily driven by lower performance on the \nVirginia\n class (SSN 774) submarine program and aircraft carriers, partially offset by contract incentives on the \nColumbia\n class (SSBN 826) program.\nMission Technologies\n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nSales and service revenues\n$\n2,937\n \n$\n2,699 \n$\n2,387 \n$\n238 \n9 \n%\n$\n312 \n13 \n%\nSegment operating income\n116\n \n101 \n63 \n15 \n15 \n%\n38 \n60 \n%\nAs a percentage of segment sales\n3.9\n \n%\n3.7 \n%\n2.6 \n%\nSales and Service Revenues\nMission Technologies sales and service revenues, including intersegment sales, for the year ended December 31, 2024, increased $238 million, or 9%, compared to 2023, primarily due to higher volumes in CEW&S and C5ISR contracts.\nSegment Operating Income\nMission Technologies segment operating income for the year ended December 31, 2024, was $116 million, compared to segment operating income of $101 million in 2023. The increase was primarily driven by higher volume and performance in CEW&S, higher performance in fleet sustainment, and higher equity income from operating investments, partially offset by the settlement of a representations and warranties insurance claim related to the acquisition of Hydroid in 2023.\n45\nTable of Contents\n                                                    \n \n \nPRODUCT AND SERVICE REVENUES AND COST ANALYSIS\nThe following table presents segment sales and service revenues by both product and service:\nSegment Sales and Service Revenues\n($ in millions)\nYear Ended December 31\n2024 over 2023\n2023 over 2022\nSegment Information\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nIngalls\nProduct\n$\n2,424\n \n$\n2,495\n \n$\n2,372\n \n$\n(71)\n(3)\n%\n$\n123 \n5 \n%\nService\n335\n \n248\n \n186\n \n87 \n35 \n%\n62 \n33 \n%\nIntersegment\n8\n \n9\n \n12\n \n(1)\n(11)\n%\n(3)\n(25)\n%\nTotal Ingalls\n2,767 \n2,752 \n2,570 \n15 \n1 \n%\n182 \n7 \n%\nNewport News\nProduct\n4,921\n \n5,053\n \n4,821\n \n$\n(132)\n(3)\n%\n232 \n5 \n%\nService\n1,045\n \n1,077\n \n1,026\n \n$\n(32)\n(3)\n%\n51 \n5 \n%\nIntersegment\n3\n \n3\n \n5\n \n$\n— \n— \n%\n(2)\n(40)\n%\nTotal Newport News\n5,969 \n6,133 \n5,852 \n(164)\n(3)\n%\n281 \n5 \n%\nMission Technologies\nProduct\n119\n \n116\n \n90\n \n$\n3 \n3 \n%\n26 \n29 \n%\nService\n2,691\n \n2,465\n \n2,181\n \n$\n226 \n9 \n%\n284 \n13 \n%\nIntersegment\n127\n \n118\n \n116\n \n$\n9 \n8 \n%\n2 \n2 \n%\nTotal Mission Technologies\n2,937 \n2,699 \n2,387 \n238 \n9 \n%\n312 \n13 \n%\nSegment Totals\nProduct\n$\n7,464 \n$\n7,664 \n$\n7,283 \n$\n(200)\n(3)\n%\n$\n381 \n5 \n%\nService\n4,071 \n3,790 \n3,393 \n$\n281 \n7 \n%\n397 \n12 \n%\nTotal Segment\n$\n11,535 \n$\n11,454 \n$\n10,676 \n$\n81 \n1 \n%\n$\n778 \n7 \n%\n46\nTable of Contents\n                                                    \n \n \nThe following table presents segment cost of sales and service revenues by both product and service:\nSegment Cost of Sales and Service Revenues\n($ in millions)\nYear Ended December 31\n2024 over 2023\n2023 over 2022\nSegment Information\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nIngalls\nProduct\n$\n2,070\n \n$\n2,031\n \n$\n1,931\n \n$\n39 \n2 \n%\n$\n100 \n5 \n%\nService\n294\n \n207\n \n162\n \n87 \n42 \n%\n45 \n28 \n%\nIntersegment\n8\n \n9\n \n12\n \n(1)\n(11)\n%\n(3)\n(25)\n%\nTotal Ingalls\n2,372 \n2,247 \n2,105 \n125 \n6 \n%\n142 \n7 \n%\nNewport News\nProduct\n4,276\n \n4,254\n \n4,097\n \n$\n22 \n1 \n%\n157 \n4 \n%\nService\n865\n \n900\n \n858\n \n$\n(35)\n(4)\n%\n42 \n5 \n%\nIntersegment\n3\n \n3\n \n5\n \n$\n— \n— \n%\n(2)\n(40)\n%\nTotal Newport News\n5,144 \n5,157 \n4,960 \n(13)\n— \n%\n197 \n4 \n%\nMission Technologies\nProduct\n102\n \n121\n \n73\n \n$\n(19)\n(16)\n%\n48 \n66 \n%\nService\n2,416\n \n2,223\n \n1,970\n \n$\n193 \n9 \n%\n253 \n13 \n%\nIntersegment\n127\n \n118\n \n116\n \n$\n9 \n8 \n%\n2 \n2 \n%\nTotal Mission Technologies\n2,645 \n2,462 \n2,159 \n183 \n7 \n%\n303 \n14 \n%\nSegment Totals\nProduct\n$\n6,448 \n$\n6,406 \n$\n6,101 \n$\n42 \n1 \n%\n$\n305 \n5 \n%\nService\n3,575 \n3,330 \n2,990 \n$\n245 \n7 \n%\n340 \n11 \n%\nTotal Segment \n(1)\n$\n10,023 \n$\n9,736 \n$\n9,091 \n$\n287 \n3 \n%\n$\n645 \n7 \n%\n(1)\n Operating FAS/CAS Adjustment is excluded from segment cost of product sales and service revenues.\nProduct Sales and Segment Cost of Product Sales \nProduct sales in 2024 decreased $200 million, or 3%, from 2023, primarily due to lower volumes on aircraft carriers and cumulative catch-up adjustments on the \nVirginia\n class (SSN 774) submarine program at Newport News and lower volumes at Ingalls in amphibious assault ships, partially offset by higher volumes in the \nColumbia\n class (SSBN 826) program at Newport News and higher volumes at Ingalls in surface combatants. \nSegment cost of product sales in 2024 increased $42 million, or 1%, compared to 2023, primarily due to higher volumes at Ingalls in surface combatants and higher volumes in the \nColumbia\n class (SSBN 826) program at Newport News, partially offset by lower volumes on aircraft carriers at Newport News. \nService Revenues and Segment Cost of Service Revenues\nService revenues in 2024 increased $281 million, or 7%, from 2023, primarily as a result of higher volumes at Mission Technologies in CEW&S and C5ISR. \nCost of service revenues in 2024 increased $245 million, or 7%, compared to 2023, consistent with the higher service volumes described above.\nOTHER FINANCIAL INFORMATION\nInterest Expense\nInterest expense for each of the years ended December 31, 2024 and 2023 was $95 million. \n47\nTable of Contents\n                                                    \n \n \nNon-Operating Retirement Benefit\nThe non-operating retirement benefit includes the following components of net periodic benefit costs: interest cost, expected return on plan assets, amortization of prior service cost (credit) and actuarial loss (gain), and settlement and curtailment effects. \nThe non-operating retirement benefit in 2024 was $179 million, compared to $148 million in 2023. The favorable change was primarily driven by higher 2023 returns on plan assets. \nOther, Net\nOther, net income in 2024 was $24 million, compared to other, net income of $19 million in 2023. There were no individually significant drivers for the increase in Other, net for the year ended December 31, 2024.\nFederal and Foreign Income Taxes\n \nOur effective tax rate on earnings from continuing operations was 14.5% in 2024, compared to 20.2% in 2023. The decrease in our effective tax rate for 2024 was primarily attributable to current and prior period research and development tax credits recorded in 2024.\nFor the year ended December 31, 2024, our effective tax rate differed from the federal statutory corporate income tax rate of 21% primarily due to research and development tax credits for the current and prior periods.\nIn October 2021, the Organization for Economic Co-operation and Development (the \"OECD\") announced the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting (the \"Framework\"), which agreed to a two-pillar solution to address tax challenges arising from digitalization of the economy. In December 2021, the OECD released Pillar Two Model Rules defining the global minimum tax rules, which contemplate a minimum tax rate of 15%. To date, various jurisdictions have enacted, or are in the process of enacting, legislation on these rules, and the OECD continues to release additional guidance. While it is uncertain whether the U.S. will enact legislation to adopt the minimum tax directive, certain countries in which we operate have adopted legislation, and other countries are in the process of introducing legislation to implement the minimum tax directive. Further, the OECD issued administrative guidance providing transition and safe harbor rules that could delay the impact of the minimum tax directive. We will continue to monitor the implementation of the Framework by the countries in which we operate. We currently do not expect the Framework to have a material impact on our effective tax rate or our consolidated results of operation, financial position, and cash flows.\nBACKLOG\nTotal backlog as of December 31, 2024, was approximately $48.7 billion. Total backlog includes both funded backlog (firm orders for which funding is contractually obligated by the customer) and unfunded backlog (firm orders for which funding is not currently contractually obligated by the customer). Backlog excludes unexercised contract options and unfunded indefinite delivery/indefinite quantity orders. For contracts having no stated contract values, backlog includes only the amounts committed by the customer as of December 31, 2024 and 2023, respectively.\nThe following table presents funded and unfunded backlog by segment as of December 31, 2024 and 2023:\n \nDecember 31, 2024\nDecember 31, 2023\n \n \n \nTotal\n \n \nTotal\n($ in millions)\nFunded\nUnfunded\nBacklog\nFunded\nUnfunded\nBacklog\nIngalls\n$\n13,519\n \n$\n2,333\n \n$\n15,852\n \n$\n12,546 \n$\n3,201 \n$\n15,747 \nNewport News\n12,079\n \n14,666\n \n26,745\n \n11,890 \n15,349 \n27,239 \nMission Technologies\n1,824\n \n4,292\n \n6,116\n \n1,545 \n3,590 \n5,135 \nTotal backlog\n$\n27,422\n \n$\n21,291\n \n$\n48,713\n \n$\n25,981 \n$\n22,140 \n$\n48,121 \nWe expect approximately 21% of the $48.7 billion total backlog as of December 31, 2024, to be converted into sales during the year ending December 31, 2025. U.S. Government orders comprised substantially all of the backlog as of December 31, 2024 and 2023.\n48\nTable of Contents\n                                                    \n \n \nContract Awards\nThe value of new contract awards during the year ended December 31, 2024, was approximately $12.1 billion, including an award for the maintenance and overhaul of USS \nBoise\n (SSN 764), an award for an advanced planning contract for the RCOH of USS \nHarry S. Truman\n (CVN 75) and an award for construction of USS \nRichard J. Danzig \n(DDG 143).\nLIQUIDITY AND CAPITAL RESOURCES\nWe seek to efficiently convert operating results into cash for deployment in operating our businesses, implementing our business strategy, and maximizing stockholder value. We use various financial measures to inform our capital deployment strategy, including net cash provided by operating activities and free cash flow. We believe these measures are useful to investors in assessing our financial performance. \nThe following table summarizes key components of cash flow provided by operating activities: \n \nYear Ended December 31\n2024 over 2023\n2023 over 2022\n($ in millions)\n2024\n2023\n2022\nDollars\nPercent\nDollars\nPercent\nNet earnings\n$\n550\n \n$\n681 \n$\n579 \n$\n(131)\n(19)\n%\n$\n102 \n18 \n%\nDepreciation and amortization of purchased intangible assets\n326\n \n347 \n358 \n(21)\n(6)\n%\n(11)\n(3)\n%\nOther non-cash transactions, net\n10\n \n29 \n15 \n(19)\n(66)\n%\n14 \n93 \n%\nStock-based compensation\n23\n \n34 \n36 \n(11)\n(32)\n%\n(2)\n(6)\n%\nDeferred income taxes\n(122)\n(113)\n2 \n(9)\n(8)\n%\n(115)\n(5,750)\n%\nLoss (gain) on investments in marketable securities\n(22)\n(23)\n25 \n1 \n4 \n%\n(48)\n(192)\n%\nRetiree benefits\n(112)\n(75)\n(127)\n(37)\n(49)\n%\n52 \n41 \n%\nTrade working capital decrease (increase)\n(260)\n90 \n(122)\n(350)\n(389)\n%\n212 \n174 \n%\nNet cash provided by operating activities\n$\n393\n \n$\n970 \n$\n766 \n$\n(577)\n(59)\n%\n$\n204 \n27 \n%\n \nWe have historically maintained a capital structure comprised of a mix of equity and debt financing. We vary our leverage both to optimize our equity return and to pursue acquisitions. We expect to meet our current debt obligations as they come due through internally generated funds from current levels of operations, existing borrowing facilities, and/or through refinancing in the debt markets prior to the maturity dates of our debt.\n \nCash Flows\nWe discuss below our significant operating, investing, and financing activities affecting cash flows for each of the three years in the period ended December 31, 2024, as classified in our consolidated statements of cash flows.\nOperating Activities\nCash provided by operating activities in 2024 was $393 million, compared to $970 million provided by operating activities in 2023. The unfavorable change in operating cash flow was primarily due to an unfavorable change in trade working capital driven by the timing of billings across programs and lower earnings, partially offset by lower payments for income taxes. \nWe expect cash generated from operations in 2025, in combination with our current cash and cash equivalents, as well as existing borrowing facilities, to be sufficient to service debt and retiree benefit plans, meet contractual obligations, and fund capital expenditures for at least the next 12 calendar months beginning January 1, 2025 and beyond such 12-month period based on our current business plans.\n \nInvesting Activities\nCash used in investing activities in 2024 was $348 million, compared to $236 million used in investing activities in 2023. The change in investing cash was primarily driven by an increase in capital expenditures and the sale of our \n49\nTable of Contents\n                                                    \n \n \ninterest in an unconsolidated ship repair and specialty fabrication joint venture in 2023, partially offset by additional investment in one of our unconsolidated nuclear and environmental joint ventures in 2023. \nFor 2025, we expect our capital expenditures for maintenance and sustainment to be approximately 1.5% of annual revenues and our discretionary capital expenditures to be approximately 2.0% to 2.5% of annual revenues.\nFinancing Activities\nCash provided by financing activities in 2024 was $356 million, compared to $771 million used in financing activities in 2023. The change in cash provided by financing activities was primarily due to $1 billion in proceeds from the issuance of long term debt and lower repayment of long term debt in the current year, which was partially offset by increased repurchases of common stock. \nFree Cash Flow\nFree cash flow represents cash provided by (used in) operating activities less capital expenditures net of related grant proceeds. Free cash flow is not a measure recognized under GAAP. Free cash flow has limitations as an analytical tool and should not be considered in isolation from, or as a substitute for, net earnings as a measure of our performance or net cash provided by operating activities as a measure of our liquidity. We believe free cash flow is an important liquidity measure for our investors because it provides them insight into our current and period-to-period performance and our ability to generate cash from continuing operations. We also use free cash flow as a key operating metric in assessing the performance of our business and as a key performance measure in evaluating management performance and determining incentive compensation. Free cash flow may not be comparable to similarly titled measures of other companies.\n \nThe following table reconciles net cash provided by operating activities to free cash flow:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n393\n \n$\n970 \n$\n766 \nLess capital expenditures:\nCapital expenditure additions\n(367)\n(292)\n(284)\nGrant proceeds for capital expenditures\n14\n \n14 \n12 \nFree cash flow\n$\n40\n \n$\n692 \n$\n494 \nFree cash flow in 2024 decreased $652 million from 2023, primarily due to an unfavorable change in trade working capital driven by the timing of billings across programs, lower earnings, and higher capital expenditures, which was partially offset by lower payments for income taxes.\nRetirement Related Benefit Plan Contributions\nERISA, including amendments under pension relief legislation, defines the minimum amount we must contribute to our qualified defined benefit pension plans. In determining whether to make discretionary contributions to these plans above the minimum required amounts, we consider various factors, including maintaining the funded status needed to avoid potential benefit restrictions and other adverse consequences, maintaining minimum CAS funding requirements, and the current and anticipated future funding levels of each plan. The contributions to our qualified defined benefit pension plans are affected by a number of factors, including published IRS interest rates, the actual return on plan assets, actuarial assumptions, and demographic experience. These factors and our resulting contributions also impact the funded status of the plans. \n50\nTable of Contents\n                                                    \n \n \nWe made the following minimum and discretionary contributions to our pension and other postretirement benefit plans in the years ended December 31, 2024, 2023, and 2022: \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nPension plans\nDiscretionary\nQualified\n$\n—\n \n$\n— \n$\n— \nNon-qualified\n11\n \n12 \n10 \nOther benefit plans\n36\n \n32 \n31 \nTotal contributions\n$\n47\n \n$\n44 \n$\n41 \nAs of December 31, 2024 and 2023, our qualified pension plans were funded 125% and 114%, respectively on a FAS basis. As of December 31, 2024 and 2023, these plans were sufficiently funded on an ERISA basis so as not to be subject to benefit payment restrictions. The funded percentages under ERISA and FAS vary due to inherent differences in the assumptions and methodologies used to calculate the respective obligations. We expect our 2025 cash contributions to our qualified defined benefit pension plans to be less than $1 million, all of which we anticipate will be discretionary and which are exclusive of CAS cost recoveries in our contracts. Due to the differences in calculation methodologies, our FAS expense is not necessarily representative of our funding requirements or CAS cost recoveries.\nWe expect 2025 contributions to our other postretirement benefit plans to be approximately $34 million, which are exclusive of CAS cost recoveries under our contracts. Contributions for other postretirement benefit plans are not required to be funded in advance and are paid on an as-incurred basis.\nOther Sources and Uses of Capital\nStockholder Distributions - \nIn November 2024, our board of directors authorized an increase in our quarterly cash dividend to $\n1.35\n per share. The board previously increased the quarterly cash dividend to $\n1.30\n per share in November 2023 and $\n1.24\n per share in November 2022. We paid cash dividends totaling $\n206\n million ($5.25 per share), $\n200\n million ($5.02 per share), and $\n192\n million ($4.78 per share) in the years ended December 31, 2024, 2023, and 2022, respectively.\nIn January 2024, our board of directors authorized an increase to our stock repurchase program from $\n3.2\n billion to $\n3.8\n billion and an extension of the term of the program to December 31, 2028.\n Repurchases are made from time to time at management's discretion in accordance with applicable federal securities laws. For the year ended December 31, 2024, we repurchased \n607,841\n shares at an aggregate cost of $\n163\n million, including $\n1\n million of accrued excise tax. For the years ended December 31, 2023 and 2022, we repurchased \n337,007\n and \n244,561\n shares, respectively, at aggregate costs of $\n75\n million and $\n52\n million, respectively. The cost of repurchased shares is recorded as treasury stock in the consolidated statements of financial position.\nAdditional Capital \n- In November 2024, we issued $\n500\n million aggregate principal amount of 5.353% senior notes due 2030 and $\n500\n million aggregate principal amount of 5.749% senior notes due 2035. The net proceeds from these senior notes were expected to be used for general corporate purposes, including debt repayment (which may include repayment of our \n3.844\n% senior notes due 2025 and commercial paper borrowings) and working capital.\nIn September 2024, we amended and restated our existing $\n1.5\n billion credit facility, increasing the capacity thereunder to $\n1.7\n billion and extending the maturity date to September 2029 (the \"Second Amended and Restated Revolving Credit Facility\"). The Second Amended and Restated Revolving Credit Facility includes a letter of credit sub-facility of $\n300\n million. \nIn September 2024, our borrowing capacity under our unsecured commercial paper note program increased from $\n1\n billion to $\n1.7\n billion. As of December 31, 2024, the Company had no outstanding debt under the commercial paper program.\nContractual Obligations\n - Our future contractual obligations are related to debt, leases, pension liabilities, unrecognized tax benefits, workers compensation, and purchase obligations. See Note 12: Debt, Note 14: Leases, \n51\nTable of Contents\n                                                    \n \n \nNote 16: Employee Pension and Other Postretirement Benefits, Note 11: Income Taxes, and Note 2: Summary of Significant Accounting Policies in Item 8 for information about those obligations. Our purchase obligations as of December 31, 2024, were approximately $5,794 million, with approximately $2,708 million expected to be paid in 2025 and $3,086 million thereafter. A purchase obligation is defined as an agreement to purchase goods or services that is enforceable and legally binding on us and that specifies all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. As of December 31, 2024, future scheduled periodic interest payments on our outstanding long-term debt, including commitment fees that we are obligated to pay on our existing $\n1.7\n billion Second Amended and Restated Revolving Credit Facility, were approximately $687 million, with approximately $105 million expected to be paid in 2025 and $582 million thereafter.\nOff-Balance Sheet Arrangements\nIn the ordinary course of business, we use letters of credit issued by commercial banks to support certain leases, insurance policies, and contractual performance obligations, as well as surety bonds issued by insurance companies principally to support our self-insured workers' compensation plans. As of December 31, 2024, $\n11\n million in letters of credit were issued but undrawn and $\n360\n million of surety bonds were outstanding. As of December 31, 2024, we had no other significant off-balance sheet arrangements.\n52\nTable of Contents\n                                                    \n \n \nGLOSSARY OF PROGRAMS\nIncluded below are brief descriptions of some of the programs discussed in this Annual Report on Form 10-K.\nProgram Name\n  \nProgram Description\nAircraft carrier RCOH\nPerform refueling and complex overhaul (\"RCOH\") of nuclear-powered aircraft carriers, which is required at the mid-point of their 50-year life cycle. USS \nJohn C. Stennis\n (CVN 74) arrived at Newport News for the start of its RCOH in May 2021, and USS \nGeorge Washington\n (CVN 73) was redelivered to the U.S. Navy in May 2023.\nAmerica \nclass (LHA 6) amphibious assault ships\n  \nDesign and build large deck amphibious assault ships that provide forward presence and power projection as an integral part of joint, interagency and multinational maritime expeditionary forces. The \nAmerica\n class (LHA 6) ships, together with the \nWasp\n class (LHD 1) ships, are the successors to the decommissioned \nTarawa\n class (LHA 1) ships. The \nAmerica\n class (LHA 6) ships optimize aviation operations and support capabilities. In 2023, we were awarded a long-lead-time material contract for \nHelmand Province\n (LHA 10), and in 2024, we were awarded a contract modification for the detail design and construction of\n Helmand Province\n (LHA 10). We are currently constructing \nBougainville\n (LHA 8) and \nFallujah\n (LHA 9).\nArleigh Burke \nclass (DDG 51) destroyers\n  \nBuild guided missile destroyers designed for conducting anti-air, anti-submarine, anti-surface, and strike operations. The Aegis-equipped \nArleigh Burke\n class (DDG 51) destroyers are the U.S. Navy's primary surface combatant, and have been constructed in variants, allowing technological advances during construction. We delivered USS\n Frank E. Petersen Jr.\n (DDG 121), USS \nLenah H. Sutcliffe Higbee\n (DDG 123), and USS \nJack H. Lucas\n (DDG 125) in 2021, 2022, and 2023, respectively. We have contracts to construct the following \nArleigh Burke\n class (DDG 51) destroyers: \nTed Stevens\n (DDG 128), \nJeremiah Denton\n (DDG 129), \nGeorge M. Neal\n (DDG 131), \nSam Nunn\n (DDG 133), \nThad Cochran\n (DDG 135), \nJohn F. Lehman\n (DDG 137), \nTelesforo Trinidad\n (DDG 139), \nErnest E. Evans\n (DDG 141), \nCharles J. French\n (DDG 142), and \nRichard J. Danzig\n (DDG 143).\nColumbia \nclass (SSBN 826) submarines\nDesign and construct modules for \nColumbia\n class (SSBN 826) nuclear ballistic missile submarines (\"SSBNs\") as a subcontractor to Electric Boat. SSBNs are the most secure and survivable of our nation’s nuclear deterrent triad. \nColumbia\n class SSBNs will carry approximately 70 percent of the nation’s nuclear arsenal. The \nColumbia\n class (SSBN 826) program plan of record is to construct 12 new SSBNs to replace the current aging \nOhio\n class. We have a teaming agreement with Electric Boat to build modules for the entire \nColumbia\n class (SSBN 826) submarine program that leverages our \nVirginia\n class (SSN 774) experience. We have been awarded contracts from Electric Boat for integrated product and process development, providing long–lead–time material and advance construction, and construction of the first two boats of the \nColumbia\n class (SSBN 826) submarine program. Construction of the first \nColumbia\n class (SSBN 826) submarine began in 2020. In 2023, we received an award modification for long-lead-time material and advance construction for the next five boats.\n53\nTable of Contents\n                                                    \n \n \nUSS \nGerald R. Ford \nclass (CVN 78) aircraft carriers\n  \nDesign and construction for the \nFord\n class program, which is the aircraft carrier replacement program for the decommissioned \nEnterprise\n (CVN 65) and \nNimitz\n class (CVN 68) aircraft carriers. USS \nGerald R. Ford\n (CVN 78), the first ship of the \nFord\n class, was delivered to the U.S. Navy in the second quarter of 2017. In June 2015, we were awarded a contract for the detail design and construction of \nJohn F. Kennedy\n (CVN 79), following several years of engineering, advance construction, and purchase of long-lead-time components and material. In addition, we have received awards for detail design and construction of \nEnterprise\n (CVN 80) and \nDoris Miller\n (CVN 81). This category also includes the class' non-recurring engineering. The class is expected to bring improved warfighting capability, quality of life improvements for sailors, and reduced life cycle costs.\nLegend \nclass National Security Cutter\nDesign and build the U.S. Coast Guard's National Security Cutters (\"NSCs\"), the largest and most technically advanced class of cutter in the U.S. Coast Guard. The NSC is equipped to carry out maritime homeland security, maritime safety, protection of natural resources, maritime mobility, and national defense missions. There were 11 ships planned for this program, of which the first ten ships have been delivered.\nNaval nuclear support services\nProvide services to and in support of the U.S. Navy, ranging from services supporting the Navy's carrier and submarine fleets to maintenance services at U.S. Navy training facilities. Naval nuclear support services include design, construction, maintenance, and disposal activities for in-service U.S. Navy nuclear ships worldwide through mobile and in-house capabilities. Services include maintenance services on nuclear reactor prototypes.\nSan Antonio \nclass (LPD 17) amphibious transport dock ships\nDesign and build amphibious transport dock ships, which are warships that embark, transport, and land elements of a landing force for a variety of expeditionary warfare missions, and also serve as the secondary aviation platform for Amphibious Readiness Groups. The \nSan Antonio\n class (LPD 17) is the newest addition to the U.S. Navy's 21st century amphibious assault force, and these ships are a key element of the U.S. Navy's seabase transformation. In 2022, we delivered USS \nFort Lauderdale\n (LPD 28), and we were awarded a long-lead-time material contract for \nPhiladelphia\n (LPD 32). In 2023, we received an award modification for the detail design and construction of \nPhiladelphia\n (LPD 32). In 2024, we delivered USS \nRichard M. McCool Jr.\n (LPD 29), and we were awarded a multi-ship procurement contract for the construction of \nTravis Manion\n (LPD 33), LPD 34 (unnamed), and LPD 35 (unnamed). We are currently constructing \nHarrisburg\n (LPD 30), \nPittsburgh\n (LPD 31), and \nPhiladelphia\n (LPD 32).\nVirginia \nclass (SSN 774) fast attack submarines\n  \nConstruct attack submarines as the principal subcontractor to Electric Boat. The \nVirginia\n class (SSN 774) is a post-Cold War design tailored to excel in a wide range of warfighting missions, including anti-submarine and surface ship warfare; special operation forces; strike; intelligence, surveillance, and reconnaissance; carrier and expeditionary strike group support; and mine warfare.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to certain market risks, including those relating to interest rates and inflation.\nInterest Rates \n- Our floating rate financial instruments subject to interest rate risk include a $\n1.7\n billion credit facility and a $\n1.7\n billion commercial paper program. As of December 31, 2024, we had no indebtedness outstanding under our credit facility or our commercial paper program.\nInflation\n - Macroeconomic factors have contributed, and we expect will continue to contribute, to increasing cost inflation for raw materials, components, and supplies. We mitigate some cost inflation risk by negotiating long-term agreements with certain raw material suppliers and incorporating price escalation provisions in customer contracts to the extent possible. We include assumptions of anticipated cost growth in the development of our cost of \n54\nTable of Contents\n                                                    \n \n \ncompletion estimates, but if inflationary conditions continue over the long-term, our cost assumptions may not be sufficient to cover all cost escalation or may impact the availability of resources to execute the respective contracts. Persistent cost inflation over the long-term may have an adverse impact on our financial position, results of operations, or cash flows.\n55\nTable of Contents\n                                                    \n \n \nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of\nHuntington Ingalls Industries, Inc.\nNewport News, Virginia \nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of financial position of Huntington Ingalls Industries, Inc. and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of operations and comprehensive income, changes in equity, and cash flows for each of the three years in the period ended December 31, 2024, the related notes and the financial statement schedule listed in the Index at Item 15 (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024, and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with the accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 6, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.   \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue – Shipbuilding Contracts — Refer to Notes 2 and 6 to the financial statements\nCritical Audit Matter Description\nThe Company recognizes revenue on shipbuilding contracts with U.S. Government customers over time as the construction of the ship progresses because transfer of control to the customer is continuous. Ordinarily the Company’s contracts represent a single distinct performance obligation due to the highly interdependent and interrelated nature of the underlying goods. The use of the cost-to-cost method to measure performance progress over time is supported by clauses in the related contracts that allow the customer to unilaterally terminate the contract for convenience, pay the Company for costs incurred plus a reasonable profit, and take control of any work in process. The accounting for these contracts involves judgment, particularly as it relates to the process of \n56\nTable of Contents\n                                                    \n \n \nestimating total material costs, labor costs, and profit for the performance obligation. Cost of sales is recognized as incurred, and revenues are determined by adding a proportionate amount of the estimated profit to the amount reported as cost of sales. \nGiven the judgments necessary to estimate total material costs, labor costs, and profit in order to recognize revenue for certain shipbuilding contracts, auditing such estimates required extensive audit effort due to the complexity of the contracts and a high degree of auditor’s judgment, especially for contracts where there is limited historical data.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to management’s estimates of total material costs, labor costs, and profit in order to recognize revenue for certain shipbuilding contracts included the following, among others:\n \n•\nWe tested the effectiveness of controls over shipbuilding contract revenue, including management’s controls over the estimates of total material costs, labor costs, and profit for performance obligations. \n•\nWe developed independent estimates of revenue based on historical profit margins and current year recorded costs. We compared those estimates to revenue recognized by the Company.\n•\nWe obtained the population of contracts during 2024 and assessed the financial and performance risk of the contracts based on our knowledge gained through prior-year audits of the Company, industry experience, and ongoing conversations with members of program management regarding the contract performance to identify contracts that we believe were riskier. For such contracts selected, we performed tailored audit procedures to address the specific characteristics of audit interest identified. Procedures performed included:\n◦\nRead the relevant portions of contracts including any recent contract modifications to understand contract terms, including incentives, fee arrangement, scope of work, and other unusual contract terms.\n◦\nEvaluated the estimates of total costs and profit for the performance obligation by performing some combination of the following: \n◦\nPerformed inquiries with the business managers and corroborated the information gained from these inquiries with other parties who have detailed knowledge of the contract’s progress, issues being encountered, and overall production status.\n◦\nEvaluated the appropriateness and consistency of management’s material and labor estimates against historical performance, underlying performance metrics, and metrics of similar performance obligations.\n◦\nEvaluated the range and probabilities of reasonably possible outcomes and where management set its point estimate within the range and tested the accuracy and completeness of the key data used in developing estimates.\n◦\nPerformed retrospective reviews when evaluating the thoroughness and precision of management’s estimation process by comparing costs incurred to date to previous estimates.\n◦\nTested the appropriateness of the timing and accuracy of changes in estimates, including inspection of underlying source documentation, and consideration of any contradictory information.\n◦\nEvaluated the necessity and appropriateness of any constraints applied against any variable consideration. \n/s/ \nDeloitte & Touche LLP\nRichmond, Virginia\nFebruary 6, 2025\nWe have served as the Company’s auditor since 2011.\n57\nTable of Contents\n                                                    \n \n \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of\nHuntington Ingalls Industries, Inc.\nNewport News, Virginia \nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Huntington Ingalls Industries, Inc. and subsidiaries (the \"Company\") as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 6, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nRichmond, Virginia\nFebruary 6, 2025\n58\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\nYear Ended December 31\n(in millions, except per share amounts)\n2024\n2023\n2022\nSales and service revenues\nProduct sales\n$\n7,464\n \n$\n7,664\n \n$\n7,283\n \nService revenues\n4,071\n \n3,790\n \n3,393\n \nSales and service revenues\n11,535\n \n11,454\n \n10,676\n \nCost of sales and service revenues\nCost of product sales\n6,500\n \n6,467\n \n6,225\n \nCost of service revenues\n3,585\n \n3,341\n \n3,011\n \nIncome from operating investments, net\n49\n \n37\n \n48\n \nOther income and gains, net\n9\n \n120\n \n1\n \nGeneral and administrative expenses\n973\n \n1,022\n \n924\n \nOperating income\n535\n \n781\n \n565\n \nOther income (expense)\nInterest expense\n(\n95\n)\n(\n95\n)\n(\n102\n)\nNon-operating retirement benefit\n179\n \n148\n \n276\n \nOther, net\n24\n \n19\n \n(\n20\n)\nEarnings before income taxes\n643\n \n853\n \n719\n \nFederal and foreign income taxes\n93\n \n172\n \n140\n \nNet earnings\n$\n550\n \n$\n681\n \n$\n579\n \nBasic earnings per share\n$\n13.96\n \n$\n17.07\n \n$\n14.44\n \nWeighted-average common shares outstanding\n39.4\n \n39.9\n \n40.1\n \nDiluted earnings per share\n$\n13.96\n \n$\n17.07\n \n$\n14.44\n \nWeighted-average diluted shares outstanding\n39.4\n \n39.9\n \n40.1\n \nNet earnings from above\n$\n550\n \n$\n681\n \n$\n579\n \nOther comprehensive income\nChange in unamortized benefit plan costs\n528\n \n238\n \n436\n \nTax expense for items of other comprehensive income\n(\n134\n)\n(\n61\n)\n(\n112\n)\nOther comprehensive income, net of tax\n394\n \n177\n \n324\n \nComprehensive income\n$\n944\n \n$\n858\n \n$\n903\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n59\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF FINANCIAL POSITION\nDecember 31\n($ in millions)\n2024\n2023\nAssets\nCurrent Assets\nCash and cash equivalents\n$\n831\n \n$\n430\n \nAccounts receivable, net\n212\n \n461\n \nContract assets\n1,683\n \n1,537\n \nInventoried costs, net\n208\n \n186\n \nIncome taxes receivable\n204\n \n183\n \nPrepaid expenses and other current assets\n90\n \n83\n \nTotal current assets\n3,228\n \n2,880\n \nProperty, Plant, and Equipment\nLand and land improvements\n377\n \n351\n \nBuildings and leasehold improvements\n3,182\n \n2,954\n \nMachinery and other equipment\n2,267\n \n2,197\n \nCapitalized software costs\n207\n \n261\n \n6,033\n \n5,763\n \nAccumulated depreciation and amortization\n(\n2,583\n)\n(\n2,467\n)\nProperty, plant, and equipment, net\n3,450\n \n3,296\n \nOther Assets\nOperating lease assets\n239\n \n262\n \nGoodwill\n2,618\n \n2,618\n \nOther intangible assets, net of accumulated amortization of $\n1,118\n million as of 2024 and $\n1,009\n million as of 2023\n782\n \n891\n \nPension plan assets\n1,422\n \n888\n \nMiscellaneous other assets\n402\n \n380\n \nTotal other assets\n5,463\n \n5,039\n \nTotal assets\n$\n12,141\n \n$\n11,215\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n \n60\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF FINANCIAL POSITION - CONTINUED\nDecember 31\n($ in millions)\n2024\n2023\nLiabilities and Stockholders' Equity\nCurrent Liabilities\nTrade accounts payable\n$\n598\n \n$\n554\n \nAccrued employees’ compensation\n392\n \n382\n \nCurrent portion of long-term debt\n503\n \n231\n \nCurrent portion of postretirement plan liabilities\n124\n \n129\n \nCurrent portion of workers’ compensation liabilities\n201\n \n224\n \nContract liabilities\n774\n \n1,063\n \nOther current liabilities\n399\n \n449\n \nTotal current liabilities\n2,991\n \n3,032\n \nLong-term debt\n2,700\n \n2,214\n \nPension plan liabilities\n142\n \n212\n \nOther postretirement plan liabilities\n209\n \n241\n \nWorkers’ compensation liabilities\n443\n \n449\n \nLong-term operating lease liabilities\n205\n \n228\n \nDeferred tax liabilities\n378\n \n367\n \nOther long-term liabilities\n407\n \n379\n \nTotal liabilities\n7,475\n \n7,122\n \nCommitments and Contingencies (Note 15)\nStockholders’ Equity\nCommon stock, $\n0.01\n par value; \n150,000,000\n shares authorized; \n53,714,128\n issued and \n39,129,419\n outstanding as of 2024, and \n53,595,748\n issued and \n39,618,880\n outstanding as of 2023\n1\n \n1\n \nAdditional paid-in capital\n2,045\n \n2,045\n \nRetained earnings\n5,097\n \n4,755\n \nTreasury stock\n(\n2,449\n)\n(\n2,286\n)\nAccumulated other comprehensive loss\n(\n28\n)\n(\n422\n)\nTotal stockholders’ equity\n4,666\n \n4,093\n \nTotal liabilities and stockholders’ equity\n$\n12,141\n \n$\n11,215\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n61\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nOperating Activities\nNet earnings\n$\n550\n \n$\n681\n \n$\n579\n \nAdjustments to reconcile to net cash provided by operating activities\nDepreciation\n217\n \n219\n \n218\n \nAmortization of purchased intangibles\n109\n \n128\n \n140\n \nOther non-cash transactions, net\n10\n \n29\n \n15\n \nStock-based compensation\n23\n \n34\n \n36\n \nDeferred income taxes\n(\n122\n)\n(\n113\n)\n2\n \nLoss (gain) on investments in marketable securities\n(\n22\n)\n(\n23\n)\n25\n \nChange in\nAccounts receivable\n256\n \n168\n \n(\n196\n)\nContract assets\n(\n146\n)\n(\n297\n)\n70\n \nInventoried costs\n(\n22\n)\n(\n3\n)\n(\n22\n)\nPrepaid expenses and other current assets\n(\n33\n)\n(\n42\n)\n20\n \nAccounts payable and accruals\n(\n315\n)\n264\n \n6\n \nRetiree benefits\n(\n112\n)\n(\n75\n)\n(\n127\n)\nNet cash provided by operating activities\n393\n \n970\n \n766\n \nInvesting Activities\nCapital expenditures\nCapital expenditure additions\n(\n367\n)\n(\n292\n)\n(\n284\n)\nGrant proceeds for capital expenditures\n14\n \n14\n \n12\n \nInvestment in affiliates\n—\n \n(\n24\n)\n(\n5\n)\nProceeds from equity method investment\n—\n \n63\n \n6\n \nOther investing activities, net\n5\n \n3\n \n3\n \nNet cash used in investing activities\n(\n348\n)\n(\n236\n)\n(\n268\n)\nFinancing Activities\nProceeds from issuance of long-term debt\n1,000\n \n— \n— \nRepayment of long-term debt\n(\n229\n)\n(\n480\n)\n(\n400\n)\nProceeds from line of credit borrowings\n42\n \n— \n24\n \nRepayment of line of credit borrowings\n(\n42\n)\n— \n(\n24\n)\nDebt issuance costs\n(\n17\n)\n— \n— \nDividends paid\n(\n206\n)\n(\n200\n)\n(\n192\n)\nRepurchases of common stock\n(\n162\n)\n(\n75\n)\n(\n52\n)\nEmployee taxes on certain share-based payment arrangements\n(\n25\n)\n(\n13\n)\n(\n14\n)\nOther financing activities, net\n(\n5\n)\n(\n3\n)\n— \nNet cash provided by (used in) financing activities\n356\n \n(\n771\n)\n(\n658\n)\nChange in cash and cash equivalents\n401\n \n(\n37\n)\n(\n160\n)\nCash and cash equivalents, beginning of period\n430\n \n467\n \n627\n \nCash and cash equivalents, end of period\n$\n831\n \n$\n430\n \n$\n467\n \nSupplemental Cash Flow Disclosure\nCash paid for interest\n$\n101\n \n$\n101\n \n$\n100\n \nNon-Cash Investing and Financing Activities\nCapital expenditures accrued in accounts payable\n$\n23\n \n$\n29\n \n$\n12\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n62\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY\n($ in millions)\nCommon Stock\nAdditional Paid-in Capital\nRetained Earnings (Deficit)\nTreasury Stock\nAccumulated Other Comprehensive Income (Loss)\nTotal Stockholders' Equity\nBalance as of December 31, 2021\n$\n1\n \n$\n1,998\n \n$\n3,891\n \n$\n(\n2,159\n)\n$\n(\n923\n)\n$\n2,808\n \nNet earnings \n— \n— \n579\n \n— \n— \n579\n \nDividends declared ($\n4.78\n per share)\n— \n— \n(\n192\n)\n— \n— \n(\n192\n)\nStock compensation\n— \n24\n \n(\n2\n)\n— \n— \n22\n \nOther comprehensive income, net of tax\n— \n— \n— \n— \n324\n \n324\n \nTreasury stock activity\n— \n— \n— \n(\n52\n)\n— \n(\n52\n)\nBalance as of December 31, 2022\n1\n \n2,022\n \n4,276\n \n(\n2,211\n)\n(\n599\n)\n3,489\n \nNet earnings\n— \n— \n681\n \n— \n— \n681\n \nDividends declared ($\n5.02\n per share)\n— \n— \n(\n200\n)\n— \n— \n(\n200\n)\nStock compensation\n— \n23\n \n(\n2\n)\n— \n— \n21\n \nOther comprehensive income, net of tax\n— \n— \n— \n— \n177\n \n177\n \nTreasury stock activity\n— \n— \n— \n(\n75\n)\n— \n(\n75\n)\nBalance as of December 31, 2023\n1\n \n2,045\n \n4,755\n \n(\n2,286\n)\n(\n422\n)\n4,093\n \nNet earnings\n—\n \n—\n \n550\n \n—\n \n—\n \n550\n \nDividends declared ($\n5.25\n per share)\n—\n \n—\n \n(\n206\n)\n—\n \n—\n \n(\n206\n)\nStock compensation\n—\n \n—\n \n(\n2\n)\n—\n \n—\n \n(\n2\n)\nOther comprehensive income, net of tax\n—\n \n—\n \n—\n \n—\n \n394\n \n394\n \nTreasury stock activity\n—\n \n—\n \n—\n \n(\n163\n)\n—\n \n(\n163\n)\nBalance as of December 31, 2024\n$\n1\n \n$\n2,045\n \n$\n5,097\n \n$\n(\n2,449\n)\n$\n(\n28\n)\n$\n4,666\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n63\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nTABLE OF CONTENTS\nPage\nItem 8.\nN\nOTES\n \nTO THE CONSOLIDATED FINANC\nIAL STATEMENTS\n64\n1.\nD\nESCRIPTION OF BUSINESS\n65\n2.\nS\nUMM\nARY OF SIGNIFICANT ACCOUNTING POLICIES\n65\n3.\nA\nCCOUNTING STANDARDS UPDAT\nES\n71\n4.\nS\nTOCKHOLDERS' EQUITY\n72\n5.\nE\nARNINGS PER SHARE\n73\n6.\nR\nEVENUE\n74\n7.\nS\nEGMENT INFORMATION\n78\n8.\nA\nCCOUNTS RECEIVABLE\n81\n9.\nI\nNVENTORIED COSTS, NET\n82\n10.\nG\nOODWILL AND OTHER INTANGIBLE\n \nASSETS\n82\n11.\nI\nNCOME TAXES\n83\n12.\nD\nEBT\n87\n13.\nI\nNVESTI\nGATIONS\n, CLAIMS, AND L\nITIGATION\n88\n14.\nL\nEASES\n89\n15.\nC\nOMMITMENTS AND CONTINGENCIES\n90\n16.\nE\nMPLOYEE PENSION AND OTHER POSTRETIREMENT\n BENE\nFITS\n91\n17.\nS\nTOCK COMPENSATION P\nLANS\n99\n18.\nS\nUBSIDIARY GUARANTORS\n101\n19.\nSUBSEQUENT EVENTS\n102\n64\nTable of Contents\n                                                    \n \n \nHUNTINGTON INGALLS INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. \nDESCRIPTION OF BUSINESS\nHuntington Ingalls Industries, Inc. (\"HII\" or the \"Company\") is a global, all-domain defense partner, building and delivering the world's most powerful, survivable naval ships and technologies that safeguard America's seas, sky, land, space, and cyber. HII is organized into \nthree\n reportable segments: Ingalls Shipbuilding (\"Ingalls\"), Newport News Shipbuilding (\"Newport News\"), and Mission Technologies. For more than a century, the Company's Ingalls segment in Mississippi and Newport News segment in Virginia have built more ships in more ship classes than any other U.S. naval shipbuilder, making HII America’s largest shipbuilder. The Mission Technologies segment develops integrated solutions that enable today's connected, all-domain force.\n2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\n - The consolidated financial statements of HII and its subsidiaries have been prepared in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") and the instructions to Form 10-K promulgated by the Securities and Exchange Commission (\"SEC\"). As used in the Notes to the Consolidated Financial Statements, the terms \"HII\" and \"the Company\" refer to HII and its subsidiaries. All intercompany transactions and balances are eliminated in consolidation. For classification of current assets and liabilities related to its long-term production contracts, the Company uses the duration of these contracts as its operating cycle, which is generally longer than \none year\n. Additionally, certain prior year amounts have been reclassified to conform to the current year presentation.\nAccounting Estimates \n- The preparation of the Company's consolidated financial statements requires management to make estimates and judgments that affect the reported amounts of assets and liabilities and the disclosure of contingencies at the date of the financial statements, as well as the reported amounts of revenues and expenses during the reporting period. Estimates have been prepared on the basis of the most current and best available information, and actual results could differ materially from those estimates.\n \nRevenue Recognition \n- Most of the Company's revenues are derived from long-term contracts for the production of goods and services provided to its U.S. Government customers. The Company generally recognizes revenues on contracts with U.S. Government customers over time using a cost-to-cost measure of progress. The use of the cost-to-cost method to measure performance progress over time is supported by clauses in the related contracts that allow the customer to unilaterally terminate the contract for convenience, pay the Company for costs incurred plus a reasonable profit, and take control of any work in process. The Company utilizes the cost-to-cost method to measure performance progress because it best reflects the continuous transfer of control over the related goods and services to the customer as the Company satisfies its performance obligations.\nWhen the customer is not a U.S. Government entity, the Company may recognize revenue over time or at a point in time when control transfers upon delivery, depending upon the facts and circumstances of the related arrangement. When the Company determines that revenue should be recognized over time, the Company utilizes a measure of progress that best depicts the transfer of control of the relevant goods and services to the customer. Generally, the terms and conditions of the contracts result in a transfer of control of the related goods and services as the Company satisfies its performance obligations. Accordingly, the Company recognizes revenue over time using the cost-to-cost method to measure performance progress. The Company may, however, utilize a measure of progress other than cost-to-cost, such as a labor-based measure of progress, if the terms and conditions of the arrangement require such accounting. \nWhen using the cost-to-cost method to measure performance progress, certain contracts may include costs that are not representative of performance progress, such as large upfront purchases of uninstalled materials, unexpected waste, or inefficiencies. In these cases, the Company adjusts its measure of progress to exclude such costs, with the goal of better reflecting the transfer of control over the related goods or services to the customer and recognizing revenue only to the extent of the costs incurred that reflect the Company's performance under the contract.\n65\nTable of Contents\n                                                    \n \n \nIn addition, for time and material arrangements, the Company often utilizes the practical expedient allowing the recognition of revenue in the amount the Company invoices, which corresponds with the value provided to the customer and to which the Company is entitled to payment for performance to date.\nA performance obligation is a promise to transfer a distinct good or service to the customer and is the unit of account for which revenue is recognized. To determine the proper revenue recognition method, consideration is given to whether two or more contracts should be combined and accounted for as one contract and whether a single contract consists of more than one performance obligation. For contracts with multiple performance obligations, the contract transaction price is allocated to each performance obligation using an estimate of the standalone selling price based upon expected cost plus a margin at contract inception, which is generally the price disclosed in the contract. Contracts are often modified to account for changes in contract specifications and requirements. In the majority of circumstances, modifications do not result in additional performance obligations that are distinct from the existing performance obligations in the contract, and the effects of the modifications are recognized as an adjustment to revenue on a cumulative catch-up basis. Alternatively, in instances in which the performance obligations in the modifications are deemed distinct, contract modifications are accounted for prospectively.\nThe amount of revenue recognized as the Company satisfies performance obligations associated with contracts with customers is based upon the determination of transaction price. Transaction price reflects the amount of consideration to which the Company expects to be entitled for performance under the terms and conditions of the relevant contract and may reflect fixed and variable components, including shareline incentive fees whereby the value of the contract is variable based upon the amount of costs incurred, as well as other incentive fees based upon achievement of contractual schedule commitments or other specified criteria in the contract. Shareline incentive fees are determined based upon the formula under the relevant contract using the Company’s estimated cost to complete for each period. The Company generally utilizes a most likely amount approach to estimate variable consideration. In all such instances, the estimated revenues represent those amounts for which the Company believes a significant reversal of revenue is not probable.\nContract Estimates\n - In estimating contract costs, the Company utilizes a profit-booking rate based upon performance expectations that takes into consideration a number of assumptions and estimates regarding risks related to technical requirements, feasibility, schedule, and contract costs. Management performs periodic reviews of the contracts to evaluate the underlying risks, which may increase the profit-booking rate as the Company is able to mitigate and retire such risks. Conversely, if the Company is not able to retire these risks, cost estimates may increase, resulting in a lower profit-booking rate.\nThe cost estimation process requires significant judgment based upon the professional knowledge and experience of the Company’s engineers, program managers, and financial professionals. Factors considered in estimating the work to be completed and ultimate contract recovery include the availability, productivity, and cost of labor, the nature and complexity of the work to be performed, the effect of change orders, the availability of materials, the effect of any performance delays, the availability and timing of funding from the customer, and the recoverability of any claims included in the estimates to complete.\nChanges in estimates of sales, costs, and profits on a performance obligation are recognized using the cumulative catch-up method of accounting, which recognizes in the current period the cumulative effect of the changes in current and prior periods. A significant change in an estimate on one or more contracts in a period could have a material effect on the Company's consolidated financial position or results of operations for that period.\nWhen estimates of total costs to be incurred exceed estimates of total revenue to be earned on a complex, construction-type contract or a performance obligation related to such a contract, a provision for the entire loss on the contract or the performance obligation is recognized in the period the loss is determined. The determination of whether the loss is identified at the contract or performance obligation level is an accounting policy election that is applied consistently to similar contract types.\nAccounts Receivable \n- Accounts receivable include amounts related to any unconditional Company right to receive consideration and are presented as accounts receivable, net in the consolidated statements of financial position, separate from other contract balances. Accounts receivable are comprised of amounts billed and currently due from customers. The Company reports accounts receivable net of an allowance for expected credit losses. Because the Company's accounts receivable are primarily with the U.S. Government or with companies \n66\nTable of Contents\n                                                    \n \n \nacting as a contractor to the U.S. Government, the Company does not have material exposure to accounts receivable credit risk.\nContract Assets\n - Contract assets primarily relate to the Company’s right to consideration for work completed but not billed as of the reporting date when the right to payment is not subject only to the passage of time, including retention amounts. Contract assets are classified as current assets and, in accordance with industry practice, include amounts that may be billed and collected beyond one year due to the long-term nature of many of the Company's contracts. Contract assets are transferred to accounts receivable when the right to consideration becomes unconditional.\n \nContract Liabilities \n- Contract liabilities are comprised of advance payments, billings in excess of revenues, and deferred revenue amounts. Such advances are generally not considered a significant financing component, because they are utilized to pay for contract costs within a one-year period. Contract liability amounts are recognized as revenue once the requisite performance progress has occurred.\n \nInventoried Costs \n- Inventoried costs primarily relate to company-owned raw materials, which are stated at the lower of cost or net realizable value, generally using the average-cost method, and costs capitalized pursuant to applicable provisions of the Federal Acquisition Regulation (\"FAR\") and U.S. Cost Accounting Standards (\"CAS\"). Under the Company's U.S. Government contracts, the customer asserts title to, or a security interest in, inventories related to such contracts as a result of contract advances, performance-based payments, and progress payments. In accordance with industry practice, inventoried costs are classified as current assets and include amounts related to contracts having production cycles longer than one year.\n \n \nCosts to Obtain or Fulfill a Contract\n \n- \nCosts to obtain a contract are incremental direct costs incurred to obtain a contract with a customer and are capitalized if material. Costs to fulfill a contract include costs directly related to a contract or a specific anticipated contract (for example, mobilization and set-up) that generate or enhance the Company's ability to satisfy its performance obligations under a contract. These costs are capitalized to the extent they are expected to be recovered from the associated contract. Capitalized costs to obtain or fulfill a contract are amortized to expense over the expected period of benefit. Costs to obtain or fulfill a contract are reported within prepaid expenses and other current assets on the consolidated statements of financial position and are not material as of December 31, 2024 and 2023.\nWarranty Costs\n - Certain of the Company’s contracts contain assurance-type warranty provisions, which generally promise that the service or vessel will comply with agreed upon specifications. In such instances, the Company accrues the estimated loss by a charge to income in the relevant period. In limited circumstances, the Company's complex construction type contracts may provide the customer with an option to purchase a warranty or provide an extended assurance service coupled with the primary assurance warranty. In such cases, the Company accounts for the warranty as a separate performance obligation to the extent it is material within the context of the contract. Warranty liabilities are reported within other current liabilities and are not material as of December 31, 2024 and 2023.\nGovernment Grants - \nThe Company recognizes incentive grants, inclusive of transfers of depreciable assets, from federal, state, and local governments at fair value upon compliance with the conditions of their receipt and reasonable assurance that the grants will be received or the depreciable assets will be transferred. Grants related to specific expenses are recognized in the period in which the expenses are incurred as an offset to the related expenses. Grants related to depreciable assets are recognized over the periods and in the proportions in which depreciation expense on those assets is recognized. Government grants are reported within other current liabilities and other long term liabilities and are not material as of December 31, 2024 and 2023.\nGeneral and Administrative Expenses \n- In accordance with industry practice and regulations that govern the cost accounting requirements for government contracts, most general corporate expenses incurred at both the segment and corporate locations are allowable and allocable costs on government contracts. These costs are allocated to contracts in progress on a systematic basis, and contract performance factors include this as an element of cost.\nGeneral and administrative expenses also include certain other costs that do not affect segment operating income, primarily non-current state income taxes. Non-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities, and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period.\n67\nTable of Contents\n                                                    \n \n \nResearch and Development \n- Company-sponsored research and development activities primarily include independent research and development (\"IR&D\") related to experimentation, design, development, and test activities for government programs. IR&D expenses are included in general and administrative expenses and are generally allocable to government contracts. Company-sponsored IR&D expenses totaled $\n27\n million, $\n35\n million, and $\n40\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Expenses for research and development sponsored by the customer are charged directly to the related contracts.\nFair Value of Financial Instruments \n- The accounting standard for fair value measurements provides a framework for measuring fair value and requires expanded disclosures regarding fair value measurements. Fair value is defined as the price that would be received for an asset or the exit price that would be paid to transfer a liability in the principal or most advantageous market in an orderly transaction between market participants on the measurement date. The accounting standard provides a fair value hierarchy, which requires an entity to maximize the use of observable inputs, where available. The three levels of inputs consist of:\nLevel 1:    Quoted prices in active markets for identical assets and liabilities.\nLevel 2:    Observable inputs, other than Level 1 prices, such as: quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or that the Company corroborates with observable market data for substantially the full term of the related assets or liabilities.\nLevel 3:    Unobservable inputs supported by little or no market activity that are significant to the fair value of the assets and liabilities.\nExcept for the Company's long-term debt, the carrying amounts of the Company's financial instruments that are recorded at historical cost approximate fair value due to the short-term nature of the instruments and low credit risk associated with the respective counterparties.\nThe Company maintains multiple grantor trusts to fund certain non-qualified pension plans. These trusts were valued at $\n233\n million and $\n220\n million as of December 31, 2024 and 2023, respectively, and are presented within miscellaneous other assets on the consolidated statements of financial position. These trusts consist primarily of investments in marketable securities, which are held at fair value within Level 1 of the fair value hierarchy.\n \nAsset Retirement Obligations \n- Asset decommissioning and/or remediation activities may be required when the Company ceases to utilize certain facilities. The Company records, within other current liabilities or other long-term liabilities as appropriate, all known asset retirement obligations for which the liability's fair value can be reasonably estimated, including certain asbestos removal, asset decommissioning, and lease restoration obligations. Asset retirement obligations for which the liability's fair value can be reasonably estimated are not material as of December 31, 2024 and 2023.\nIncome Taxes \n- Income tax expense and other related information are based on the prevailing statutory rates for U.S. federal income taxes and the composite state income tax rate for the Company for each period presented. Non-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities, and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period. These amounts are recorded within operating income, while the current period state income tax expense, which is generally allowable and allocable to contracts, is charged to contract costs and included in cost of sales and service revenues in segment operating income.\nDeferred income taxes are recorded when revenues and expenses are recognized in different periods for financial statement purposes and for tax return purposes. Deferred tax asset or liability account balances are calculated at the balance sheet date using current tax laws and rates expected to be in effect when the deferred tax items reverse in future periods.\nThe Company recognizes deferred tax assets to the extent it believes these assets are more likely than not to be realized. In making such a determination, the Company considers all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, and results of recent operations. Based on the Company's evaluation of these deferred tax assets, valuation allowances of $\n26\n million and $\n29\n million were recognized as of December 31, 2024 and 2023, respectively.\n68\nTable of Contents\n                                                    \n \n \nUncertain tax positions meeting the more-likely-than-not recognition threshold, based on the merits of the position, are recognized in the financial statements. The Company recognizes the amount of tax benefit that is more than \n50\n% likely to be realized upon ultimate settlement with the related tax authority. If a tax position does not meet the minimum statutory threshold to avoid payment of penalties, the Company recognizes an expense for the amount of the penalty in the period the tax position is claimed or expected to be claimed in its tax return. Penalties and accrued interest related to unrecognized tax benefits are recognized as a component of income tax expense. Changes in accruals associated with unrecognized tax benefits are recorded in earnings in the period in which they are determined.\nCash and Cash Equivalents \n- The carrying amounts of cash and cash equivalents approximate fair value due to the short-term nature of these assets, which have original maturity dates of \n90\n days or less.\nConcentration Risk \n- The Company’s assets that are exposed to concentrations of credit risk consist primarily of cash and cash equivalents. The Company places its cash and cash equivalents with reputable financial institutions and limits the amount of credit exposure with any one of them. The Company regularly evaluates the creditworthiness of these financial institutions and mitigates this credit risk by entering into transactions with high-quality counterparties, limiting the exposure to each counterparty, and monitoring the financial condition of its counterparties.\nIn connection with its U.S. Government contracts, the Company is required to procure certain raw materials, components, and parts from supply sources approved by the U.S. Government. Only one supplier may exist for certain components and parts required to manufacture the Company's products.\nProperty, Plant, and Equipment - \nDepreciable properties owned by the Company are recorded at cost and depreciated over the estimated useful lives of individual assets. Major improvements are capitalized while expenditures for maintenance, repairs, and minor improvements are expensed. Costs incurred for computer software developed or purchased for internal use are capitalized and amortized over the expected useful life of the software, not to exceed \nten\n years. Leasehold improvements are amortized over the shorter of their useful lives or the term of the lease. \nThe remaining assets are depreciated using the straight-line method, with the following lives: \nYears\nLand improvements\n2\n-\n40\nBuildings and improvements\n2\n-\n60\nCapitalized software costs\n3\n-\n10\nMachinery and other equipment\n2\n-\n40\nThe Company evaluates the recoverability of its property, plant, and equipment when changes in economic circumstances or business objectives indicate the carrying value may not be recoverable. The Company's evaluations include estimated future cash flows, profitability, and other factors affecting fair value. As these assumptions and estimates may change over time, it may or may not be necessary to record impairment charges.\n \nLeases \n- The Company determines if an arrangement is a lease at contract inception. A lease exists when a contract conveys to a party the right to control the use of identified property, plant, or equipment for a period of time in exchange for consideration. The Company recognizes a lease liability at the lease commencement date, as the present value of future lease payments, using an estimated rate of interest that the Company would pay to borrow equivalent funds over an equivalent term on a collateralized basis. A lease asset is recognized based on the lease liability value and adjusted for any prepaid lease payments, initial direct costs, or lease incentive amounts. The lease term at the commencement date includes any renewal options or termination options when it is reasonably certain that the Company will exercise or not exercise those options, respectively.\nRight of use assets associated with operating leases are recognized in operating lease assets in the consolidated statements of financial position. Lease liabilities associated with operating leases are recognized in long-term operating lease liabilities, with short-term lease liability amounts included in other current liabilities in the consolidated statements of financial position. Right of use assets associated with finance leases are included in miscellaneous other assets in the consolidated statements of financial position. Finance lease liabilities are included in the current portion of long-term debt and long-term debt in the consolidated statements of financial position. \n69\nTable of Contents\n                                                    \n \n \nRent expense for operating leases is recognized on a straight-line basis over the lease term and included in cost of sales and service revenues in the consolidated statements of operations and comprehensive income. Variable lease payments are generally recognized to expense as incurred and are not included in the right of use assets or lease liabilities.\nThe Company elected, for all asset classes, to exclude from its consolidated statements of financial position leases having terms of 12 months or less (short-term leases) and elected not to separate lease and non-lease components in the determination of lease payment obligations for its long-term lease contracts.\nGoodwill and Other Intangible Assets \n- The Company performs impairment tests for goodwill annually as of October 31 and between annual impairment tests if an event occurs or circumstances of potential impairment exist. The Company tests for impairment of goodwill by assessing qualitative factors to determine whether it is more likely than not that the fair value of the goodwill allocated to the reporting unit is less than its carrying amount. If the qualitative assessment indicates a possible impairment, the carrying value of the reporting unit is compared to its fair value. If the fair value is determined to be less than the carrying value, the Company records an impairment charge to the reporting unit.\nThe Company evaluates the recoverability of its intangible long-lived assets when changes in economic circumstances or business objectives indicate the carrying value may not be recoverable. The Company's purchased intangible assets are amortized on a straight-line basis or a method based on the pattern of benefits over their estimated useful lives.\nEquity Method Investments \n- Investments in which the Company has the ability to exercise significant influence over the investee, but does not own a majority interest or otherwise control, are accounted for under the equity method of accounting and are included in miscellaneous other assets in the consolidated statements of financial position. The Company's equity method investments align strategically and are integrated with the Company's operations. Accordingly, the Company's share of the net earnings or losses of the investee is included in income from operating investments, net within the consolidated statements of operations and comprehensive income. The Company evaluates its equity method investments for other than temporary impairment whenever events or changes in business circumstances indicate that the carrying amounts of such investments may not be fully recoverable. If a decline in the value of an equity method investment is determined to be other than temporary, a loss is recorded in earnings in the current period. \nIn 2021, the Company contributed its San Diego Shipyard business to a joint venture, Titan Acquisition Holdings, L.P. (\"Titan\"), in exchange for a \n10\n% non-controlling interest, which was recorded under the equity method of accounting. In 2023, the Company sold its investment in Titan. For the year ended December 31, 2023, the Company received $\n63\n million in proceeds and recognized an immaterial loss on sale.\nSelf-Insured Group Medical Insurance \n- The Company maintains a self-insured group medical insurance plan. The plan is designed to provide a specified level of coverage for employees and their dependents. Estimated liabilities for incurred but not paid claims utilize actuarial methods based on various assumptions, which include, but are not limited to, HII's historical loss experience and projected loss development factors. These liabilities are recorded in other current liabilities on the consolidated statements of financial position and are not material as of December 31, 2024 and 2023.\nSelf-Insured Workers' Compensation Plan \n- The Company's operations are subject to federal and state workers' compensation laws. The Company maintains self-insured workers' compensation plans and participates in federally administered second injury workers' compensation funds. The Company estimates the liability for claims and funding requirements on a discounted basis utilizing actuarial methods based on various assumptions, which include, but are not limited to, the Company's historical loss experience and projected loss development factors as compiled in an annual actuarial study. Self-insurance accruals include amounts related to liabilities for reported claims and an estimated accrual for claims incurred but not reported. The Company's workers' compensation liability was discounted at \n4.58\n% and \n3.93\n% as of December 31, 2024 and 2023, respectively. These discount rates were determined using a risk-free rate based on future payment streams. Workers' compensation benefit obligations on an undiscounted basis were $\n780\n million and $\n784\n million as of December 31, 2024 and 2023, respectively.\n70\nTable of Contents\n                                                    \n \n \nLitigation, Commitments, and Contingencies \n- Amounts associated with litigation, commitments, and contingencies are recorded as charges to earnings when management, after taking into consideration the facts and circumstances of each matter, including any settlement offers and projected loss or claim development factors, has determined it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated.\nLoan Receivable\n - The Company holds a loan receivable in connection with the financing of the sale of its previously owned Avondale Shipyard facility. The receivable was carried at amortized cost of $\n44\n million, net of $\n7\n million of loan discount, as of December 31, 2024, and at amortized cost of $\n41\n million, net of $\n9\n million loan discount, as of December 31, 2023. The loan receivable approximates fair value and is recorded in miscellaneous other assets on the consolidated statements of financial position. Interest income is recognized on an accrual basis using the effective yield method and reported within other, net on the consolidated statements of operations and comprehensive income and is not material for the years ended December 31, 2024, 2023, and 2022. The discount is accreted into income using the effective yield method over the estimated life of the loan receivable.\nRetirement Related Benefit Costs \n- The Company accounts for its retirement related benefit plans on the accrual basis. The measurements of obligations, costs, assets, and liabilities require significant judgment. The costs of benefits provided by defined benefit pension plans are recorded in the period participating employees provide service. The costs of benefits provided by other postretirement benefit plans are recorded in the period participating employees attain full eligibility. The discount rate assumption is defined under GAAP as the rate at which a plan's obligation could be effectively settled. A discount rate is established for each of the retirement related benefit plans at its respective measurement date. \nThe expected return on plan assets component of retirement related costs is used to calculate net periodic expense. Unless plan assets and benefit obligations are subject to re-measurement during the year, the expected return on assets is based on the fair value of plan assets at the beginning of the year. The costs of plan amendments that provide benefits already earned by plan participants (prior service costs and credits) are deferred in accumulated other comprehensive loss and amortized over the expected future service period of active participants as of the date of amendment. Actuarial gains and losses arising from differences between assumptions and actual experience or changes in assumptions are deferred in accumulated other comprehensive loss. This unrecognized amount is amortized to the extent it exceeds \n10\n% of the greater of the plan's benefit obligation or plan assets. The amortization period for actuarial gains and losses is the estimated remaining service life of the plan participants. \nThe Company recognizes the funded status of each retirement related benefit plan as an asset or liability in its consolidated statements of financial position. The funded status represents the difference between the plan's benefit obligation and the fair value of the plan's assets. Unrecognized deferred amounts, such as demographic or asset gains or losses and the impacts of plan amendments, are included in accumulated other comprehensive loss and amortized as described above.\nStock Compensation \n- Stock-based compensation value is determined based on the closing market price of the Company's common stock on grant date, and the expense is recognized over the vesting period. At each reporting date, the number of shares is adjusted to equal the number ultimately expected to vest based on the Company's expectations regarding the relevant performance and service criteria.\n3. \nACCOUNTING STANDARDS UPDATES\nRecently Adopted Guidance\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which requires, among other things, segment disclosures of significant expenses that are regularly reported to the chief operating decision maker and the nature of segment expense information used to manage operations. The guidance was effective on a retrospective basis for annual reporting periods beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. The Company’s adoption of the guidance did not have a material impact on its consolidated financial statements. See Note 7: Segment Information. \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which requires disaggregated information about the effective tax rate reconciliation and taxes paid, including additional information on taxes paid that meet a quantitative threshold. The guidance is effective for annual \n71\nTable of Contents\n                                                    \n \n \nreporting periods beginning after December 15, 2024, with early adoption permitted. The Company early adopted the guidance on a retrospective basis for the annual reporting period ending December 31, 2024, and the guidance did not have a material impact on the Company’s consolidated financial statements. See Note 11: Income Taxes.\nAccounting Guidance Issued But Not Adopted as of December 31, 2024\nIn November 2024, the FASB issued ASU 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. The new guidance requires, among other things, tabular and qualitative disclosure of disaggregated expense information that is included in certain expense line items presented on the consolidated statement of operations. The new guidance also requires that the total amount and definition of selling expenses be disclosed. The new guidance is effective on a prospective basis for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027, with early adoption and retrospective application permitted. The Company is currently evaluating the impacts of the new guidance on its consolidated financial statements.\nOther accounting pronouncements issued but not effective until after December 31, 2024, are not expected to have a material impact on the Company's consolidated financial position, results of operations, or cash flows.\n4. \nSTOCKHOLDERS' EQUITY\nCommon Stock\n - Changes in the number of Company outstanding shares for the year ended December 31, 2024, resulted from shares purchased in the open market under the Company's stock repurchase program and share activity under its stock compensation plans. See Note 17: Stock Compensation Plans. \nTreasury Stock\n - In \nJanuary 2024, the Company's board of directors authorized an increase in the Company's stock repurchase program from $\n3.2\n billion to $\n3.8\n billion and an extension of the term of the program to December 31, 2028. \nRepurchases are made from time to time at management's discretion in accordance with applicable federal securities laws. For the year ended December 31, 2024, the Company repurchased \n607,841\n shares at an aggregate cost of $\n163\n million, including $\n1\n million of accrued excise tax. For the years ended December 31, 2023 and 2022, the Company repurchased \n337,007\n and \n244,561\n shares, respectively, at aggregate costs of $\n75\n million and $\n52\n million, respectively. The cost of purchased shares is recorded as treasury stock in the consolidated statements of financial position.\nDividends \n- In November 2024, the Company's board of directors authorized an increase in the Company's quarterly cash dividend from $\n1.30\n per share to $\n1.35\n per share. In November 2023, the Company's board of directors authorized an increase in the Company's quarterly cash dividend from $\n1.24\n per share to $\n1.30\n per share. In November 2022, the Company's board of directors authorized an increase in the Company's quarterly cash dividend from $\n1.18\n per share to $\n1.24\n per share. The Company paid cash dividends totaling $\n206\n million ($\n5.25\n per share), $\n200\n million ($\n5.02\n per share), and $\n192\n million ($\n4.78\n per share) in the years ended December 31, 2024, 2023, and 2022, respectively.\nAccumulated Other Comprehensive Loss\n - Other comprehensive loss refers to gains and losses recorded as an element of stockholders' equity but excluded from net earnings. The accumulated other comprehensive loss was comprised of unamortized benefit plan costs of $\n28\n million and $\n422\n million as of December 31, 2024 and 2023, respectively.\n72\nTable of Contents\n                                                    \n \n \nThe changes in accumulated other comprehensive loss by component for the years ended December 31, 2024, 2023, and 2022, were as follows: \n($ in millions)\nBenefit Plans\nTotal\nBalance as of December 31, 2021\n$\n(\n923\n)\n$\n(\n923\n)\nOther comprehensive income before reclassifications\n390\n \n390\n \nAmounts reclassified from accumulated other comprehensive loss\nAmortization of prior service cost\n1\n18\n \n18\n \nAmortization of net actuarial loss\n1\n32\n \n32\n \nSettlement gain\n1\n(\n4\n)\n(\n4\n)\nTax benefit (expense) for items of other comprehensive income\n(\n112\n)\n(\n112\n)\nNet current period other comprehensive income\n324\n \n324\n \nBalance as of December 31, 2022\n(\n599\n)\n(\n599\n)\nOther comprehensive income before reclassifications\n221\n \n221\n \nAmounts reclassified from accumulated other comprehensive loss\nAmortization of prior service cost\n1\n15\n \n15\n \nAmortization of net actuarial loss\n1\n2\n \n2\n \nTax expense for items of other comprehensive income\n(\n61\n)\n(\n61\n)\nNet current period other comprehensive income\n177\n \n177\n \nBalance as of December 31, 2023\n(\n422\n)\n(\n422\n)\nOther comprehensive income before reclassifications\n509\n \n509\n \nAmounts reclassified from accumulated other comprehensive loss\nAmortization of prior service cost\n1\n14\n \n14\n \nAmortization of net actuarial loss\n1\n5\n \n5\n \nTax expense for items of other comprehensive income\n(\n134\n)\n(\n134\n)\nNet current period other comprehensive income\n394\n \n394\n \nBalance as of December 31, 2024\n$\n(\n28\n)\n$\n(\n28\n)\n1\n \nThese accumulated comprehensive loss components are included in the computation of net periodic benefit cost. See Note 16: Employee Pension and Other Postretirement Benefits. The tax expense recorded in stockholders' equity for the amounts reclassified from accumulated other comprehensive loss for the years ended December 31, 2024, 2023, and 2022, was $\n5\n million, $\n4\n million, and $\n12\n million, respectively.\n5. \nEARNINGS PER SHARE\nBasic and diluted earnings per common share were calculated as follows:\n \nYear Ended December 31\n(in millions, except per share amounts)\n2024\n2023\n2022\nNet earnings\n$\n550\n \n$\n681\n \n$\n579\n \nWeighted-average common shares outstanding\n39.4\n \n39.9\n \n40.1\n \nNet effect of dilutive stock options and awards\n—\n \n— \n— \nDilutive weighted-average common shares outstanding\n39.4\n \n39.9\n \n40.1\n \nEarnings per share - basic\n$\n13.96\n \n$\n17.07\n \n$\n14.44\n \nEarnings per share - diluted\n$\n13.96\n \n$\n17.07\n \n$\n14.44\n \nThe Company's calculation of diluted earnings per common share includes the dilutive effects of the assumed exercise of stock options and vesting of restricted stock based on the treasury stock method. Under the treasury stock method, the Company has excluded from the diluted share amounts presented above the effects of \n0.4\n million \n73\nTable of Contents\n                                                    \n \n \nRestricted Performance Stock Rights (\"RPSRs\") and \n0.1\n million Restricted Stock Rights (\"RSRs\") for the year ended December 31, 2024, and \n0.4\n million RPSRs for each of the years ended December 31, 2023 and 2022.\n6. \nREVENUE\nThe following is a description of principal activities from which the Company generates its revenues. For more detailed information regarding reportable segments, see Note 7: Segment Information. For more detailed information regarding the Company's significant accounting policy for revenue, see Note 2: Summary of Significant Accounting Policies.\nU.S. Government Contracts\nThe Ingalls and Newport News segments generate revenue primarily from performance under multi-year contracts with the U.S. Government, generally the U.S. Navy and U.S. Coast Guard, or prime contractors to contracts with the U.S. Government, relating to the advance planning, design, construction, repair, maintenance, refueling, overhaul, or inactivation of nuclear-powered ships and non-nuclear ships. The period over which the Company performs may extend past five years. The Mission Technologies segment also generates the majority of its revenue from contracts with the U.S. Government, including U.S. Government agencies. The Company generally invoices and receives related payments based upon performance progress no less frequently than monthly.\nShipbuilding \n- For most of the Company's shipbuilding contracts, the customer contracts with the Company to provide a comprehensive service of designing, procuring long-lead-time materials, manufacturing, and integrating complex equipment and technologies into a single ship or project, often resulting in a single performance obligation. Contract modifications to account for changes in specifications and requirements are recognized when approved by the customer. In the majority of circumstances, modifications do not result in additional performance obligations that are distinct from the existing performance obligations in the contract, and the effects of the modifications are recognized as an adjustment to revenue on a cumulative catch-up basis. Alternatively, in instances in which the performance obligations in the modifications are deemed distinct, contract modifications are accounted for prospectively. \nThe Company’s multi-year shipbuilding contracts with the U.S. Government are routinely modified as the result of unpriced change orders arising in the ordinary course of business. These anticipated changes are accounted for as contract modifications when the scope of the work has been approved and it is probable that the price will be approved. The Company recognizes variable consideration included in the transaction price for a modified contract to the extent the Company believes a significant reversal of revenue is not probable.\nThe Company considers incentive and award fees to be variable consideration and includes in the transaction price at inception the consideration to which the Company expects to be entitled under the terms and conditions of the contract, generally estimated using a most likely amount approach. Estimated revenues represent those amounts for which the Company believes a significant reversal of revenue is not probable. \nThe Company recognizes revenues related to shipbuilding contracts as it satisfies the related performance obligations over time using a cost-to-cost input method to measure performance progress, which best reflects the transfer of control to the customer. \nServices\n - The Mission Technologies segment generates revenue primarily under U.S. Government contracts. Contracts generally are structured using either an Indefinite Delivery/Indefinite Quantity (\"IDIQ\") vehicle, under which orders are issued, or a standalone contract. Contracts may be fixed-price or cost-type, include variable consideration such as incentives and awards, and structured as task orders under an IDIQ contract vehicle or requirements contract vehicle. In either case, the Company generally performs services over a shorter duration and may continue to perform upon exercise of related period of performance options that are also shorter in duration. The Company’s performance obligations vary in nature and may be stand-ready, in which case the Company responds to the customer’s needs on the basis of its demand, a recurring service, typically recurring maintenance services, or a single performance obligation that does not comprise a series of distinct services. \nIn determining transaction price, the Company considers incentives and other contingencies to be variable consideration and includes in the initial transaction price the consideration to which the Company expects to be entitled under the terms and conditions of the contract, generally estimated using a most likely amount approach. Transaction price is limited to the extent of funding allotted by the customer and available for performance, and \n74\nTable of Contents\n                                                    \n \n \nestimated revenues represent those amounts for which the Company believes a significant reversal of revenue is not probable. Where a series of distinct services has been identified, the Company generally allocates variable consideration to distinct time increments of service. \nThe Company generally recognizes revenue as it satisfies the related performance obligations over time using a cost-to-cost input method to measure performance progress, because, even when the Company has identified a series of services, its cost incurrence pattern generally is not ratable given the complex nature of the services the Company provides. Invoices are issued and related payments are received, on the basis of performance progress, no less frequently than monthly. In addition, many of the Company's U.S. Government services contracts are time and material arrangements. As a result, the Company often utilizes the practical expedient allowing the recognition of revenue in the amount the Company invoices, which corresponds with the value provided to the customer and to which the Company is entitled to payment for performance to date.\nNon-U.S. Government Contracts\nRevenues generated under commercial and state and local government agency contracts are primarily derived from the provision of nuclear and environmental services. Non-U.S. Government contracts typically are one or two years in duration.\nIn determining transaction price, the Company considers incentives and other contingencies to be variable consideration and includes in the initial transaction price the consideration to which the Company expects to be entitled under the terms and conditions of the contract, generally estimated using a most likely amount approach. In the context of variable consideration, the Company limits the transaction price to amounts for which the Company believes a significant reversal of revenue is not probable. Such amounts may relate to transaction price in excess of funding, a lack of history with the customer, a lack of history with the goods or services being provided, or other items. \nRevenue generally is recognized over time given the terms and conditions of the related contracts. The Company generally utilizes a cost-to-cost input method to measure performance progress, which best reflects the transfer of control to the customer. The Company’s non-U.S. Government contract portfolio is comprised of a large number of time and material arrangements. As a result, the Company often utilizes the practical expedient allowing the recognition of revenue in the amount the Company invoices, which corresponds with the value provided to the customer and to which the Company is entitled to payment for performance to date.\nDisaggregation of Revenue\nThe following tables present revenues on a disaggregated basis, in a manner that reconciles with the Company's reportable segment disclosures, for the following categories: product versus service type, customer type, contract type, and major program. See Note 7: Segment Information. The Company believes that this level of disaggregation provides investors with information to evaluate the Company’s financial performance and provides the Company with information to make capital allocation decisions in the most appropriate manner.\n75\nTable of Contents\n                                                    \n \n \nThe following tables present revenues on a disaggregated basis:\nYear Ended December 31, 2024\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nRevenue Type\nProduct sales\n$\n2,424\n \n$\n4,921\n \n$\n119\n \n$\n— \n$\n7,464\n \nService revenues\n335\n \n1,045\n \n2,691\n \n— \n4,071\n \nIntersegment\n8\n \n3\n \n127\n \n(\n138\n)\n— \nSales and service revenues\n$\n2,767\n \n$\n5,969\n \n$\n2,937\n \n$\n(\n138\n)\n$\n11,535\n \nCustomer Type\nFederal\n$\n2,759\n \n$\n5,964\n \n$\n2,804\n \n$\n— \n$\n11,527\n \nCommercial\n— \n2\n \n5\n \n— \n7\n \nState and local government agencies\n— \n— \n1\n \n— \n1\n \nIntersegment\n8\n \n3\n \n127\n \n(\n138\n)\n— \nSales and service revenues\n$\n2,767\n \n$\n5,969\n \n$\n2,937\n \n$\n(\n138\n)\n$\n11,535\n \nContract Type\nFirm fixed-price\n$\n7\n \n$\n7\n \n$\n343\n \n$\n— \n$\n357\n \nFixed-price incentive\n2,417\n \n3,127\n \n9\n \n— \n5,553\n \nCost-type\n335\n \n2,832\n \n2,281\n \n— \n5,448\n \nTime and materials\n— \n— \n177\n \n— \n177\n \nIntersegment\n8\n \n3\n \n127\n \n(\n138\n)\n— \nSales and service revenues\n$\n2,767\n \n$\n5,969\n \n$\n2,937\n \n$\n(\n138\n)\n$\n11,535\n \nYear Ended December 31, 2023\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nRevenue Type\nProduct sales\n$\n2,495\n \n$\n5,053\n \n$\n116\n \n$\n— \n$\n7,664\n \nService revenues\n248\n \n1,077\n \n2,465\n \n— \n3,790\n \nIntersegment\n9\n \n3\n \n118\n \n(\n130\n)\n— \nSales and service revenues\n$\n2,752\n \n$\n6,133\n \n$\n2,699\n \n$\n(\n130\n)\n$\n11,454\n \nCustomer Type\nFederal\n$\n2,743\n \n$\n6,129\n \n$\n2,558\n \n$\n— \n$\n11,430\n \nCommercial\n— \n1\n \n22\n \n— \n23\n \nState and local government agencies\n— \n— \n1\n \n— \n1\n \nIntersegment\n9\n \n3\n \n118\n \n(\n130\n)\n— \nSales and service revenues\n$\n2,752\n \n$\n6,133\n \n$\n2,699\n \n$\n(\n130\n)\n$\n11,454\n \nContract Type\nFirm fixed-price\n$\n2\n \n$\n4\n \n$\n322\n \n$\n— \n$\n328\n \nFixed-price incentive\n2,497\n \n3,364\n \n6\n \n— \n5,867\n \nCost-type\n244\n \n2,762\n \n2,039\n \n— \n5,045\n \nTime and materials\n— \n— \n214\n \n— \n214\n \nIntersegment\n9\n \n3\n \n118\n \n(\n130\n)\n— \nSales and service revenues\n$\n2,752\n \n$\n6,133\n \n$\n2,699\n \n$\n(\n130\n)\n$\n11,454\n \n76\nTable of Contents\n                                                    \n \n \nYear Ended December 31, 2022\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nRevenue Type\nProduct sales\n$\n2,372\n \n$\n4,821\n \n$\n90\n \n$\n— \n$\n7,283\n \nService revenues\n186\n \n1,026\n \n2,181\n \n— \n3,393\n \nIntersegment\n12\n \n5\n \n116\n \n(\n133\n)\n— \nSales and service revenues\n$\n2,570\n \n$\n5,852\n \n$\n2,387\n \n$\n(\n133\n)\n$\n10,676\n \nCustomer Type\nFederal\n$\n2,558\n \n$\n5,846\n \n$\n2,221\n \n$\n— \n$\n10,625\n \nCommercial\n— \n1\n \n49\n \n— \n50\n \nState and local government agencies\n— \n— \n1\n \n— \n1\n \nIntersegment\n12\n \n5\n \n116\n \n(\n133\n)\n— \nSales and service revenues\n$\n2,570\n \n$\n5,852\n \n$\n2,387\n \n$\n(\n133\n)\n$\n10,676\n \nContract Type\nFirm fixed-price\n$\n8\n \n$\n14\n \n$\n277\n \n$\n— \n$\n299\n \nFixed-price incentive\n2,369\n \n3,009\n \n— \n— \n5,378\n \nCost-type\n181\n \n2,824\n \n1,725\n \n— \n4,730\n \nTime and materials\n— \n— \n269\n \n— \n269\n \nIntersegment\n12\n \n5\n \n116\n \n(\n133\n)\n— \nSales and service revenues\n$\n2,570\n \n$\n5,852\n \n$\n2,387\n \n$\n(\n133\n)\n$\n10,676\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nMajor Programs\nAmphibious assault ships\n$\n1,426\n \n$\n1,511\n \n$\n1,415\n \nSurface combatants and coast guard cutters\n1,330\n \n1,225\n \n1,138\n \nOther\n11\n \n16\n \n17\n \nTotal Ingalls\n2,767\n \n2,752\n \n2,570\n \nAircraft carriers\n3,239\n \n3,374\n \n3,203\n \nSubmarines\n2,206\n \n2,161\n \n2,002\n \nOther\n524\n \n598\n \n647\n \nTotal Newport News\n5,969\n \n6,133\n \n5,852\n \nC5ISR, CEW&S, LVC\n2,458\n \n2,232\n \n1,950\n \nOther\n479\n \n467\n \n437\n \nTotal Mission Technologies\n2,937\n \n2,699\n \n2,387\n \nIntersegment eliminations\n(\n138\n)\n(\n130\n)\n(\n133\n)\nSales and service revenues\n$\n11,535\n \n$\n11,454\n \n$\n10,676\n \nAs of December 31, 2024, the Company had $\n48.7\n billion of remaining performance obligations. The Company expects to recognize approximately \n21\n% of its remaining performance obligations as revenue through 2025, an additional \n35\n% through 2027, and the balance thereafter.\n77\nTable of Contents\n                                                    \n \n \nCumulative Catch-up Revenue Adjustments\nThe following table presents the effect of net cumulative catch-up revenue adjustments on operating income and diluted earnings per share:\nYear Ended December 31\n($ in millions, except per share amounts)\n2024\n2023\n2022\nEffect on operating income\n$\n(\n126\n)\n$\n118\n \n$\n113\n \nEffect on diluted earnings per share\n$\n(\n2.51\n)\n$\n2.33\n \n$\n2.22\n \nFor each of the years ended December 31, 2024, 2023, and 2022, no individual favorable cumulative catch-up revenue adjustment was material to the Company's consolidated statements of operations and comprehensive income. For each of the years ended December 31, 2024, 2023, and 2022, no individual unfavorable cumulative catch-up revenue adjustment was material to the Company's consolidated statements of operations and comprehensive income.\nContract Balances\nContract assets primarily relate to the Company's right to consideration for work completed but not billed as of the reporting date when the right to payment is not subject only to the passage of time. Contract liabilities relate to advance payments, billings in excess of revenues, and deferred revenue amounts. \nContract assets include retention amounts, substantially all of which were under U.S. Government contracts, and were comprised of the following:\nDecember 31\n($ in millions)\n2024\n2023\nDue from U.S. Government\n$\n1,638\n \n$\n1,471\n \nDue from other customers\n45\n \n66\n \nTotal contract assets\n$\n1,683\n \n$\n1,537\n \nThe Company reports contract balances in a net contract asset or contract liability position on a contract-by-contract basis at the end of each reporting period. Net contract assets were comprised as follows:\nDecember 31\n($ in millions)\n2024\n2023\nContract assets\n$\n1,683\n \n$\n1,537\n \nContract liabilities\n774\n \n1,063\n \nNet contract assets\n$\n909\n \n$\n474\n \n \nThe Company recognized revenue related to its prior year-end contract liabilities of $\n938\n million, $\n690\n million, and $\n562\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n7. \nSEGMENT INFORMATION\nThe Company is organized into \nthree\n operating segments, which are also its reportable segments: Ingalls, Newport News, and Mission Technologies, consistent with HII’s principal lines of business. Ingalls includes the Company’s non-nuclear ship design, construction, repair, and maintenance businesses. Newport News includes all of the Company’s nuclear ship design, construction, overhaul, refueling, and repair and maintenance businesses. The Mission Technologies segment provides a wide range of services and products, including command, control, computers, communications, cyber, intelligence, surveillance, and reconnaissance systems and operations; the application of artificial intelligence and machine learning to battlefield decisions; defense and offensive cyberspace strategies and electronic warfare; uncrewed autonomous systems; live, virtual, and constructive training solutions; fleet sustainment; and critical nuclear operations.\n78\nTable of Contents\n                                                    \n \n \nThe Company’s operations are managed by senior executives reporting to the Company’s President and Chief Executive Officer, the chief operating decision maker, who regularly reviews the reportable segments’ operating results to assess performance and allocate resources. \nThe Company internally manages operations by reference to segment operating income, which is defined as operating income before the Operating FAS/CAS Adjustment and non-current state income taxes, neither of which affects contract performance. In evaluating operating performance, the chief operating decision maker looks primarily at changes in sales and service revenues, as well as segment operating income. This approach is consistent with the long-term life cycle of the Company’s contracts, as management assesses the bidding of each contract by focusing on net sales and operating profit and monitors performance in a similar manner through contract completion.\nU.S. Government Sales \n- Revenues from the U.S. Government include revenues from contracts for which HII is the prime contractor, as well as contracts for which the Company is a subcontractor and the ultimate customer is the U.S. Government. The Company derived substantially all of its revenues from the U.S. Government for each of the years ended December 31, 2024, 2023, and 2022.\nAssets \n- Substantially all of the Company's assets are located or maintained in the United States.\n \nResults of Operations by Segment\nThe following tables present the Company's operating results by segment:\nYear Ended December 31, 2024\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nSales and Service Revenues\nProduct sales\n$\n2,424\n \n$\n4,921\n \n$\n119\n \n$\n— \n$\n7,464\n \nService Revenues\n335\n \n1,045\n \n2,691\n \n— \n4,071\n \nIntersegment\n8\n \n3\n \n127\n \n(\n138\n)\n— \nTotal sales and service revenues\n2,767\n \n5,969\n \n2,937\n \n(\n138\n)\n11,535\n \nSegment Operating Income\nIncome from operating investments, net\n1\n \n— \n48\n \n— \n49\n \nOther income and gains, net\n— \n10\n \n(\n1\n)\n— \n9\n \nLess:\nCost of sales and service revenues\nProduct\n2,070\n \n4,276\n \n102\n \n— \n6,448\n \nService\n294\n \n865\n \n2,416\n \n— \n3,575\n \nIntersegment\n8\n \n3\n \n127\n \n(\n138\n)\n— \nOther segment items\n185\n \n589\n \n223\n \n— \n997\n \nTotal segment operating income\n$\n211\n \n$\n246\n \n$\n116\n \n$\n— \n$\n573\n \nNon-segment factors affecting operating\nOperating FAS/CAS Adjustment\n(\n62\n)\nNon-current state income taxes\n24\n \nTotal operating income\n$\n535\n \n79\nTable of Contents\n                                                    \n \n \nYear Ended December 31, 2023\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nSales and Service Revenues\nProduct sales\n$\n2,495\n \n$\n5,053\n \n$\n116\n \n$\n— \n$\n7,664\n \nService Revenues\n248\n \n1,077\n \n2,465\n \n— \n3,790\n \nIntersegment\n9\n \n3\n \n118\n \n(\n130\n)\n— \nTotal sales and service revenues\n2,752\n \n6,133\n \n2,699\n \n(\n130\n)\n11,454\n \nSegment Operating Income\nIncome from operating investments, net\n— \n— \n37\n \n— \n37\n \nOther income and gains, net\n71\n \n— \n49\n \n— \n120\n \nLess:\nCost of sales and service revenues\nProduct\n2,031\n \n4,254\n \n121\n \n— \n6,406\n \nService\n207\n \n900\n \n2,223\n \n— \n3,330\n \nIntersegment\n9\n \n3\n \n118\n \n(\n130\n)\n— \nOther segment items\n214\n \n597\n \n222\n \n— \n1,033\n \nTotal segment operating income\n$\n362\n \n$\n379\n \n$\n101\n \n$\n— \n$\n842\n \nNon-segment factors affecting operating\nOperating FAS/CAS Adjustment\n(\n72\n)\nNon-current state income taxes\n11\n \nTotal operating income\n$\n781\n \nYear Ended December 31, 2022\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nIntersegment Eliminations\nTotal\nSales and Service Revenues\nProduct sales\n$\n2,372\n \n$\n4,821\n \n$\n90\n \n$\n— \n$\n7,283\n \nService Revenues\n186\n \n1,026\n \n2,181\n \n— \n3,393\n \nIntersegment\n12\n \n5\n \n116\n \n(\n133\n)\n— \nTotal sales and service revenues\n2,570\n \n5,852\n \n2,387\n \n(\n133\n)\n10,676\n \nSegment Operating Income\nIncome from operating investments, net\n— \n— \n48\n \n— \n48\n \nOther income and gains, net\n— \n— \n1\n \n— \n1\n \nLess:\nCost of sales and service revenues\nProduct\n1,931\n \n4,097\n \n73\n \n— \n6,101\n \nService\n162\n \n858\n \n1,970\n \n— \n2,990\n \nIntersegment\n12\n \n5\n \n116\n \n(\n133\n)\n— \nOther segment items\n173\n \n535\n \n214\n \n— \n922\n \nTotal segment operating income\n$\n292\n \n$\n357\n \n$\n63\n \n$\n— \n$\n712\n \nNon-segment factors affecting operating\nOperating FAS/CAS Adjustment\n(\n145\n)\nNon-current state income taxes\n(\n2\n)\nTotal operating income\n$\n565\n \nSales transactions between segments are generally recorded at cost.\n80\nTable of Contents\n                                                    \n \n \nOther segment items consist of general and administrative expenses. \nOther Financial Information\nThe following tables present the Company's capital expenditures, as presented to the chief operating decision maker, and depreciation and amortization by segment:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nCapital Expenditures\n(1)\nIngalls\n$\n60\n \n$\n65\n \n$\n69\n \nNewport News\n268\n \n196\n \n182\n \nMission Technologies\n18\n \n11\n \n20\n \nTotal segment capital expenditures\n346\n \n272\n \n271\n \nCorporate\n7\n \n6\n \n1\n \nTotal capital expenditures\n$\n353\n \n$\n278\n \n$\n272\n \n(1)\n \nNet of grant proceeds for capital expenditures\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nDepreciation and Amortization\nIngalls\n$\n78\n \n$\n76\n \n$\n79\n \nNewport News\n136\n \n150\n \n148\n \nMission Technologies\n110\n \n120\n \n130\n \nTotal segment depreciation and amortization\n324\n \n346\n \n357\n \nCorporate\n2\n \n1\n \n1\n \nTotal depreciation and amortization\n$\n326\n \n$\n347\n \n$\n358\n \nAsset information by segment is not disclosed because it is not a key measure of performance used by the chief operating decision maker.\n \n8. \nACCOUNTS RECEIVABLE\nAccounts receivable include amounts related to any unconditional Company right to receive consideration. Substantially all amounts included in accounts receivable as of December 31, 2024, are expected to be collected in 2025. The Company's accounts receivable are primarily with the U.S. Government and include amounts from companies acting as a prime contractor to the U.S. Government. The Company does not have material exposure to accounts receivable credit risk. \nAccounts receivable were comprised of the following:\nDecember 31\n($ in millions)\n2024\n2023\nDue from U.S. Government\n$\n210\n \n$\n464\n \nDue from other customers\n4\n \n5\n \nTotal accounts receivable\n214\n \n469\n \nAllowance for expected credit losses\n(\n2\n)\n(\n8\n)\nTotal accounts receivable, net\n$\n212\n \n$\n461\n \n \n81\nTable of Contents\n                                                    \n \n \n9. \nINVENTORIED COSTS, NET\nInventoried costs are principally associated with contracts for which the U.S. government is the primary customer. As a result, the Company does not believe it has significant exposure to recoverability risk related to inventoried costs.\nInventoried costs were comprised of the following:\nDecember 31\n($ in millions)\n2024\n2023\nProduction costs of contracts in process\n$\n27\n \n$\n40\n \nRaw material inventory\n181\n \n146\n \nTotal inventoried costs, net\n$\n208\n \n$\n186\n \n10. \nGOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill\nHII performs impairment tests for goodwill each year and between annual impairment tests if an event occurs or circumstances change that would more likely than not reduce the fair values of the Company's reporting units below their carrying values. Reporting units are aligned with the Company's segments. The Company assesses qualitative factors to determine whether it is more likely than not that the fair value of the goodwill allocated to the reporting unit is less than its carrying amount. If the qualitative assessment indicates a possible impairment, then the Company utilizes a combination of discounted cash flow analysis and comparative market multiples to determine the fair values of its businesses for comparison to their corresponding book values. \nIn connection with the Company’s annual goodwill impairment test as of October 31, 2024, management tested goodwill for each of its \nthree\n reporting units with goodwill balances. Based on the annual goodwill impairment analysis, the Company determined that the estimated fair values of all reporting units exceeded by more than \n10\n% their corresponding carrying values as of October 31, 2024.\nAs of both December 31, 2024 and 2023, accumulated goodwill impairment losses were $\n2,755\n million, comprised of $\n1,568\n million and $\n1,187\n million at Ingalls and Newport News, respectively.\nFor the years ended December 31, 2024 and 2023, the carrying amounts of goodwill were as follows:\n($ in millions)\nIngalls\nNewport News\nMission Technologies\nTotal\nBalance as of December 31, 2022\n$\n175\n \n$\n721\n \n$\n1,722\n \n$\n2,618\n \nAdjustments\n— \n— \n— \n— \nBalance as of December 31, 2023\n175\n \n721\n \n1,722\n \n2,618\n \nAdjustments\n—\n \n—\n \n—\n \n—\n \nBalance as of December 31, 2024\n$\n175\n \n$\n721\n \n$\n1,722\n \n$\n2,618\n \nOther Intangible Assets\nThe Company evaluates the recoverability of its intangible long-lived assets when changes in economic circumstances or business objectives indicate the carrying value may not be recoverable. The Company's purchased intangible assets are being amortized on a straight-line basis or a method based on the pattern of benefits over their estimated useful lives. Net intangible assets consist primarily of amounts relating to acquired customer relationships and contract backlog within Mission Technologies, as well as nuclear-powered aircraft carrier and submarine program intangible assets, with an aggregate weighted-average useful life of \n29\n years based on the long life cycle of the related programs. Amortization expense for the years ended December 31, 2024, 2023, and 2022, was $\n109\n million, $\n128\n million, and $\n140\n million, respectively.\nThe Company expects amortization for currently recorded purchased intangible assets of $\n99\n million in 2025, $\n80\n million in 2026, $\n60\n million in 2027, $\n53\n million in 2028, and $\n48\n million in 2029.\n82\nTable of Contents\n                                                    \n \n \n11. \nINCOME TAXES\nThe Company's earnings are primarily domestic, and its effective tax rate on earnings from operations for the year ended December 31, 2024, was \n14.5\n%, compared with \n20.2\n% and \n19.5\n% for 2023 and 2022, respectively. \nFor the years ended December 31, 2024, 2023, and 2022, the Company's effective tax rate differed from the statutory federal corporate income tax rate primarily as a result of research and development tax credits.\nNon-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period. These amounts are recorded within operating income. Current period state income tax expense is charged to contract costs and included in cost of sales and service revenues in segment operating income. For the years ended December 31, 2024, 2023, and 2022, state income taxes in Virginia make up the majority of the state income tax expense. \nFederal and foreign income tax expense for the years ended December 31, 2024, 2023, and 2022, consisted of the following:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nIncome Taxes on Operations\nFederal and foreign income taxes currently payable (receivable)\n$\n193\n \n$\n273\n \n$\n138\n \nChange in deferred federal and foreign income taxes\n(\n100\n)\n(\n101\n)\n2\n \nTotal federal and foreign income taxes\n$\n93\n \n$\n172\n \n$\n140\n \nEarnings and income tax from foreign operations are not material for any periods presented.\nThe following table reconciles the Company's actual income tax expense to income tax expense based on the statutory federal corporate income tax rate:\nYear Ended December 31\n2024\n2023\n2022\n($ in millions)\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nU.S. federal statutory tax rate\n$\n135\n \n21.0\n \n%\n$\n179\n \n21.0\n \n%\n$\n151\n \n21.0\n \n%\nForeign tax effects\n2\n \n0.3\n \n%\n— \n— \n%\n— \n— \n%\nEffect of cross-border tax laws\n(\n3\n)\n(\n0.5\n)\n%\n(\n1\n)\n(\n0.1\n)\n%\n— \n— \n%\nTax credits:\nResearch and development tax credit\n(\n49\n)\n(\n7.6\n)\n%\n(\n22\n)\n(\n2.6\n)\n%\n(\n22\n)\n(\n3.1\n)\n%\nOther\n(\n2\n)\n(\n0.3\n)\n%\n(\n2\n)\n(\n0.2\n)\n%\n(\n1\n)\n(\n0.1\n)\n%\nNontaxable or nondeductible items\n1\n \n0.2\n \n%\n6\n \n0.7\n \n%\n6\n \n0.8\n \n%\nChanges in unrecognized tax benefits\n18\n \n2.8\n \n%\n10\n \n1.2\n \n%\n8\n \n1.1\n \n%\nInterest accrual on tax refunds\n(\n8\n)\n(\n1.2\n)\n%\n(\n6\n)\n(\n0.7\n)\n%\n(\n3\n)\n(\n0.4\n)\n%\nOther adjustments\n(\n1\n)\n(\n0.2\n)\n%\n8\n \n0.9\n \n%\n1\n \n0.2\n \n%\nEffective income tax rate\n$\n93\n \n14.5\n \n%\n$\n172\n \n20.2\n \n%\n$\n140\n \n19.5\n \n%\n83\nTable of Contents\n                                                    \n \n \nCash paid for income taxes (net of refunds) consisted of the following:\nDecember 31\n($ in millions)\n2024\n2023\n2022\nFederal\n$\n182\n \n$\n273\n \n$\n96\n \nState\n:\nVirginia\n56\n \n30\n \n13\n \nMississippi\n(a)\n(a)\n8\n \nOther\n17\n \n26\n \n10\n \nTotal state\n73\n \n56\n \n31\n \nForeign\n—\n \n1\n \n— \nCash paid for income taxes (net of refunds)\n$\n255\n \n$\n330\n \n$\n127\n \n(a) \nThe amount of income taxes paid during the year does not meet the \n5\n% disaggregation threshold and is included in 'Other.\n'\nUnrecognized Tax Benefits - \nUnrecognized tax benefits represent the gross value of the Company's uncertain tax positions that have not been reflected in the consolidated statements of operations and comprehensive income. If the income tax benefits from federal tax positions are ultimately realized, such realization would affect the Company's income tax expense, while the realization of state tax benefits would be recorded in general and administrative expenses. \nThe changes in unrecognized tax benefits (exclusive of interest and penalties) for the years ended December 31, 2024, 2023, and 2022 are summarized in the following table:\nDecember 31\n($ in millions)\n2024\n2023\n2022\nUnrecognized tax benefits at beginning of the year\n$\n98\n \n$\n90\n \n$\n81\n \nAdditions based on tax positions related to the current year\n13\n \n11\n \n8\n \nAdditions based on tax positions related to prior years\n4\n \n— \n3\n \nLapse of statute of limitations\n(\n5\n)\n(\n3\n)\n(\n2\n)\nNet change in unrecognized tax benefits\n12\n \n8\n \n9\n \nUnrecognized tax benefits at end of the year\n$\n110\n \n$\n98\n \n90\n \nAssuming sustainment of these positions, as of December 31, 2024, 2023, and 2022, the reversal of $\n91\n million, $\n76\n million, and $\n70\n million, respectively, of the accrued amounts would favorably affect the Company's effective federal income tax rate in future periods.\nThe Company recognizes interest and penalties related to unrecognized tax benefits as income tax expense. As a result of the unrecognized tax benefits noted above, income tax expense increased by $\n5\n million in 2024 for interest, resulting in an interest liability of $\n14\n million as of December 31, 2024. In 2023, income tax expense increased $\n4\n million for interest, resulting in an interest liability of $\n9\n million as of December 31, 2023. In 2022, income tax expense increased $\n2\n million for interest, resulting in an interest liability of $\n5\n million as of December 31, 2022.\n84\nTable of Contents\n                                                    \n \n \nThe following table summarizes the tax years that are either currently under examination or remain open under the applicable statute of limitations and subject to examination by the major tax jurisdictions in which the Company operates:\nJurisdiction\nYears\nUnited States - Federal\n(1)\n2016\n-\n2023\nConnecticut\n2021\n-\n2023\nMississippi\n2018\n-\n2023\nVirginia\n2021\n-\n2023\n(1)\n \nReturns for the 2016, 2018, 2019, 2021, and 2022 tax years were filed under the Compliance Assurance Process (\"CAP\") program and accepted by the IRS with the exception of the research and development tax credit. The 2017 tax year was also filed under the CAP program and was accepted by the IRS with the exception of the manufacturing deduction and the research and development tax credit. The statute of limitations for the 2020 tax year has been extended to October 8, 2025.\nIRS Audits - \nThe Company was part of the IRS CAP program for the 2014 through 2023 tax years. Tax years through 2015 have been closed with the IRS. In calendar years 2020, 2021, and 2022, the Company filed refund claims for the research and development (\"R&D\") tax credit for tax years 2016-2019. Since these are refund claims, any adjustments to the amount claimed would not result in cash tax payments to the IRS. In addition, the Company has claimed R&D tax credits on its original filed returns since 2020. The status of the pending R&D tax credits is reviewed below.\n2016-2017 claims\n - In December 2024, following an audit, an IRS examination team issued a Notice of Proposed Adjustment (\"NOPA\") proposing to disallow the Company’s 2016-2017 R&D tax credit refund claims. The Company plans to pursue IRS administrative appeals in an effort to resolve issues raised by the NOPA. If acceptable resolutions are not achieved through IRS administrative processes, the Company intends to vigorously defend its positions through litigation, which will likely take several years to achieve resolution.   \n2018 claim - \nIn March 2023, the IRS notified the Company that the IRS would not process its 2018 refund claim for the R&D tax credit because the agency determined the claim did not satisfy the requirements of Chief Counsel Memorandum 20214101F, an internal agency memorandum addressing the required contents of R&D tax credit refund claims. The Company disagrees with that determination and believes the 2018 claim was well-supported, met all applicable requirements, and should have been processed. The Company will take all necessary steps to pursue the 2018 refund claim including litigation, which will likely take several years to resolve.   \n2019 claim - \nThe IRS has processed the company’s amended R&D tax credit refund claim for 2019 and assigned it to IRS exam for audit. The amended refund claim was filed in October 2023 with a claimed credit amount that was substantively the same as the Company’s original refund claim for the 2019 tax year. \n2020-2023 credits -\n \nThe IRS initiated audits for the 2020, 2021, and 2022 tax years, with minimal activity to date. The audits for 2021 and 2022 are limited to the R&D tax credit as the returns for those years were filed under the CAP program and were accepted by the IRS with the exception of the R&D tax credit.\nThe Company’s conclusion that it is more likely than not the Company’s R&D tax credit positions will ultimately be sustained is unchanged as of December 31, 2024. While the Company believes it has adequately provided for all unrecognized tax benefits, the Company might ultimately settle any disputed item for amounts greater than or less than the Company's accrued position. Accordingly, additional provisions for federal and state income tax related matters could be recorded in the future, and may be material, as revised estimates are made or the underlying matters are effectively settled or otherwise resolved.  \nDeferred Income Taxes - \nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and for income tax purposes. As described above, deferred tax assets and liabilities are calculated as of the balance sheet date using current tax laws and rates expected to be in effect when the deferred tax items reverse in future periods. Net deferred tax liabilities are classified as long-term deferred tax liabilities in the consolidated statements of financial position.\n85\nTable of Contents\n                                                    \n \n \nThe tax effects of significant temporary differences and carry-forwards that resulted in year-end deferred tax balances, as presented in the consolidated statements of financial position, were as follows:\nDecember 31\n($ in millions)\n2024\n2023\nDeferred Tax Assets\nWorkers' compensation\n$\n150\n \n$\n157\n \nOperating lease liabilities\n67\n \n77\n \nReserves not currently deductible for tax purposes\n71\n \n61\n \nStock compensation\n8\n \n7\n \nNet operating losses, tax credit and other carry-forwards\n33\n \n35\n \nCapitalized research and development expenses\n315\n \n200\n \nOther\n11\n \n10\n \nGross deferred tax assets\n655\n \n547\n \nLess valuation allowance\n26\n \n29\n \nNet deferred tax assets\n629\n \n518\n \nDeferred Tax Liabilities\nDepreciation and amortization\n457\n \n447\n \nContract accounting differences\n47\n \n78\n \nPurchased intangibles\n212\n \n234\n \nOperating lease assets\n62\n \n72\n \nRetirement benefits\n216\n \n54\n \nOther\n13\n \n— \nGross deferred tax liabilities\n1,007\n \n885\n \nTotal net deferred tax liabilities\n$\n(\n378\n)\n$\n(\n367\n)\nAs of December 31, 2024, the Company had state income tax credit carry-forwards of approximately $\n17\n million, which expire from 2025 through 2027. A deferred tax asset of approximately $\n14\n million (net of federal benefit) related to these state income tax credit carry-forwards has been recorded, with a valuation allowance of $\n12\n million against such deferred tax asset as of December 31, 2024. State net operating loss carry-forwards are individually and cumulatively immaterial to the Company’s deferred tax balances and expire from 2030 through 2043.\n86\nTable of Contents\n                                                    \n \n \n12. \nDEBT\nThe Company's long-term debt consisted of the following:\nDecember 31\n($ in millions)\n2024\n2023\nSenior notes due May 1, 2025, 3.844%\n$\n500\n \n$\n500\n \nSenior notes due December 1, 2027, 3.483%\n600\n \n600\n \nSenior notes due August 16, 2028, 2.043%\n600\n \n600\n \nSenior notes due January 15, 2030, 5.353%\n500\n \n— \nSenior notes due May 1, 2030, 4.200%\n500\n \n500\n \nSenior notes due January 15, 2035, 5.749%\n500\n \n— \nMississippi economic development revenue bonds due May 1, 2024, 7.81%\n—\n \n84\n \nTerm loan due August 19, 2024\n—\n \n145\n \nGulf opportunity zone industrial development revenue bonds due December 1, 2028, 4.55%\n21\n \n21\n \nFinance lease obligations\n9\n \n12\n \nLess unamortized debt issuance costs\n(\n27\n)\n(\n17\n)\nTotal long-term debt\n$\n3,203\n \n$\n2,445\n \nLess current portion\n503\n \n231\n \nLong-term debt, net of current portion\n$\n2,700\n \n$\n2,214\n \nDebt Facilities\n - In September 2024, the Company amended its existing $\n1.5\n billion credit facility, increasing the capacity thereunder to $\n1.7\n billion and extending the maturity date for \nfive years\n from signing (the \"Second Amended and Restated Revolving Credit Facility\"). The Second Amended and Restated Revolving Credit Facility has a variable interest rate on outstanding borrowings based on the Secured Overnight Financing Rate (\"SOFR\") plus an interest spread, currently \n1.475\n%  based upon the Company's credit rating, which may vary between \n1.225\n% and \n2.100\n%. The commitment fee rate on the Second Amended and Restated Revolving Credit Facility as of December 31, 2024, was \n0.200\n% and may vary between \n0.125\n% and \n0.300\n%. The Second Amended and Restated Revolving Credit Facility includes a letter of credit sub-facility of $\n300\n million. \nAs of December 31, 2024, the Company had $\n11\n million in issued but undrawn letters of credit and $\n1,689\n million unutilized under the Second Amended and Restated Revolving Credit Facility. The Company had unamortized debt issuance costs associated with its debt facilities of $\n10\n million and $\n6\n million as of December 31, 2024 and 2023, respectively. \nThe Second Amended and Restated Revolving Credit Facility contains customary affirmative and negative covenants and events of default, as well as a financial covenant based on a maximum total leverage ratio. The maximum total leverage ratio covenant limits our borrowing capacity under the Second Amended and Restated Revolving Credit Facility to $\n1,474\n million as of December 31, 2024.\nIn September 2024, the Company's borrowing capacity under its unsecured commercial paper note program increased from $\n1\n billion to $\n1.7\n billion. As of December 31, 2024, the Company had no outstanding debt under the commercial paper program. \nSenior Notes\n - In November 2024, the Company issued $\n500\n million aggregate principal amount of 5.353% senior notes due 2030 and $\n500\n million aggregate principal amount of 5.749% senior notes due 2035. The net proceeds from these senior notes were expected to be used for general corporate purposes, including debt repayment (which may include repayment of its \n3.844\n% senior notes due 2025 and commercial paper borrowings) and working capital. \nThe terms of the Company's senior notes limit the Company’s ability and the ability of certain of its subsidiaries to create liens, enter into sale and leaseback transactions, sell assets, and effect consolidations or mergers. Interest on the senior notes is payable semiannually. The Company had unamortized debt issuance costs associated with the senior notes of $\n17\n million and $\n11\n million as of December 31, 2024 and 2023, respectively.\n87\nTable of Contents\n                                                    \n \n \nIn May 2024, the Company repaid $\n84\n million aggregate principal amount of \n7.81\n% Mississippi Economic Development Revenue Bonds upon their maturity. \nInterest on the Gulf Opportunity Zone Industrial Development Revenue Bonds is payable semiannually. \nThe agreements governing the Company's debt contain customary affirmative and negative covenants. The Company was in compliance with all debt covenants during the year ended December 31, 2024. Each of the Company's existing and future materially wholly owned domestic subsidiaries, except those that are specifically designated as unrestricted subsidiaries, are and will be guarantors under existing debt facilities, with the exception of the Gulf Opportunity Zone Industrial Development Revenue Bonds.\nThe estimated fair values of the Company's total long-term debt, including the current portion of long-term debt and excluding finance lease liabilities, as of December 31, 2024, and December 31, 2023, were $\n3,110\n million and $\n2,309\n million, respectively. The estimated fair values of the current portion of the Company's long-term debt, excluding finance lease liabilities, were $\n497\n million and $\n229\n million as of December 31, 2024, and December 31, 2023, respectively. The fair values of the Company's long-term debt were calculated based on recent trades of the Company's debt instruments in inactive markets, which fall within Level 2 under the fair value hierarchy. \nAs of December 31, 2024, the aggregate amounts of principal payments due on long-term debt, excluding finance lease liabilities, within the next five years consisted of $\n500\n million due in 2025, $\n600\n million due in 2027, and $\n621\n million due in 2028. In January 2024, the Company prepaid the remaining $\n145\n million balance of the Term Loan.\n \n13. \nINVESTIGATIONS, CLAIMS, AND LITIGATION\nThe Company is involved in legal proceedings before various courts and administrative agencies, and is periodically subject to government examinations, inquiries and investigations. The Company accrues for losses associated with legal proceedings when, and to the extent that, loss amounts related to the legal proceedings are probable and can be reasonably estimated. The actual losses that might be incurred to resolve such legal proceedings may be higher or lower than the amounts accrued. The Company also provides footnote disclosure for matters for which a material loss is reasonably possible but a reserve has not been accrued because the likelihood of a material loss is not probable.\nAntitrust Complaint -\n On October 6, 2023, a class action antitrust lawsuit was filed against the Company and other defendants in the U.S. District Court for the Eastern District of Virginia. The lawsuit names several HII companies, among other companies, as defendants. The named plaintiffs generally allege that the defendant companies have adhered to a “gentlemen’s agreement” that prohibits any defendant from actively recruiting naval engineers from other defendants. The complaint seeks class certification, treble damages, and any other relief to which the plaintiffs are entitled. Depending on the outcome of the lawsuit, the Company could be subject to penalties and damages that could have a material adverse effect on its consolidated financial position, results of operations, or cash flows. The case is at an early stage, and, as a result, the Company currently is unable to estimate an amount or range of reasonably possible loss or to express an opinion regarding the ultimate outcome of the matter.\nInsurance Claims - \nIn September 2020, the Company filed a complaint against \n32\n reinsurers in the Superior Court, State of Vermont, Franklin Unit, seeking a judgment declaring that the Company's business interruption and other losses associated with COVID-19 are covered by the Company's property insurance program. The Company also initiated arbitration proceedings against \nsix\n other reinsurers seeking similar relief. In July 2021, the Vermont court granted the reinsurers’ motion for judgment on the pleadings, which would have ended the Company’s claim. The Company appealed the decision to the Vermont Supreme Court, which reversed and remanded the lower court's decision in September 2022, allowing the Company's claim to proceed. No assurances can be provided regarding the ultimate resolution of this matter. \nIn September 2021, the Company filed a complaint in the Superior Court of Delaware, seeking a judgment against certain insurers for breach of contract and breach of the implied covenant of good faith and fair dealing under three representations and warranties insurance policies purchased in connection with the Company’s acquisition of Hydroid. The policies insured the Company against losses relating to the seller’s breach of certain representations and warranties in the Hydroid acquisition agreement. In December 2023, the Company and the insurers settled the matter for a payment of $\n49.5\n million to the Company, recognized in the Mission Technologies segment's other income and gains, net in the consolidated statements of operations and comprehensive income.\n \n88\nTable of Contents\n                                                    \n \n \nU.S. Government Investigations and Claims\n - Departments and agencies of the U.S. Government have the authority to investigate various transactions and operations of the Company, and the results of such investigations may lead to administrative, civil, or criminal proceedings, the ultimate outcome of which could be fines, penalties, repayments or compensatory, treble, or other damages. U.S. Government regulations provide that certain findings against a contractor may also lead to suspension or debarment from future U.S. Government contracts or the loss of export privileges. Any suspension or debarment would have a material effect on the Company because of its reliance on government contracts.\nDuring the third quarter of 2024, the Company identified certain quality issues involving noncompliance with welding procedures at Newport News. The Company has commenced an investigation and disclosed the matter to the U.S. Government. The Company is working with its U.S. Navy customer to evaluate the full extent of the matter and its potential impact on operations. Based upon the early stage of the Company’s investigation, the Company cannot at this time predict or reasonably estimate the outcome of this matter, including its financial impact.\nAsbestos Related Claims\n - HII and its predecessors-in-interest are defendants in a longstanding series of cases that have been and continue to be filed in various jurisdictions around the country, wherein former and current employees and various third parties allege exposure to asbestos containing materials while on or associated with HII premises or while working on vessels constructed or repaired by HII. In some instances, partial or full insurance coverage is available for the Company's liabilities. The costs to resolve cases during the years ended December 31, 2024, 2023, and 2022 were not material individually or in the aggregate. The Company’s estimate of asbestos-related liabilities is subject to uncertainty because liabilities are influenced by many variables that are inherently difficult to predict. Although the Company believes the ultimate resolution of current cases will not have a material effect on its consolidated financial position, results of operations, or cash flows, it cannot predict what new or revised claims or litigation might be asserted or what information might come to light and can, therefore, give no assurances regarding the ultimate outcome of asbestos related litigation.\nOther Litigation \n- The Company and its predecessor-in-interest have been in litigation with the Bolivarian Republic of Venezuela (the \"Republic\") since 2002 over a contract for the repair, refurbishment, and modernization at Ingalls of \ntwo\n foreign-built frigates. Following an arbitration proceeding between the parties, in February 2018 the arbitral tribunal awarded the Company approximately $\n151\n million on its claims and awarded the Republic approximately $\n22\n million on its counterclaims. In November 2023, the Company sold its judgment against the Republic to a third party in exchange for an initial cash payment of $\n70.5\n million, recognized in the Ingalls segment's other income and gains, net in the consolidated statements of operations and comprehensive income. The Company's consideration also includes a contingent participating interest in the final amount recovered. \nThe Company is party to various other claims, arbitrations, investigations, and other legal proceedings that arise in the ordinary course of business, including U.S. Government investigations and claims that could result in administrative, civil, or criminal proceedings involving the Company. The Company is a contractor with the U.S. Government, and such proceedings can therefore include False Claims Act allegations against the Company. Although, based on the information available to the Company to date, the Company believes that the resolution of these other claims, legal proceedings, and investigations will not have a material effect on its consolidated financial position, results of operations, or cash flows, the Company cannot predict what new or revised claims or litigation might be asserted or what information might come to light and can, therefore, give no assurances regarding the ultimate outcome of these matters.\n14. \nLEASES\nThe Company leases certain land, warehouses, office space, and production, office, and technology equipment, among other items. Most equipment is leased on a monthly basis. Many land, warehouse, and office space leases include renewal terms that can extend the lease term. The exercise of lease renewal options is at the Company's sole discretion. The depreciable life of assets and leasehold improvements is generally limited by the expected lease term. The Company's lease agreements do not generally contain material residual value guarantees, material restrictive covenants, or purchase options. The Company's lease portfolio consists primarily of operating leases and an immaterial finance lease included in the consolidated financial statements. See Note 2: Summary of Significant Accounting Policies and Note 12: Debt.\n89\nTable of Contents\n                                                    \n \n \nThe following table presents costs and other information related to the Company's leases:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nOperating lease costs\n$\n72\n \n$\n67\n \n$\n69\n \nShort-term operating lease costs\n$\n57\n \n$\n54\n \n$\n44\n \nVariable operating lease costs\n$\n5\n \n$\n7\n \n$\n6\n \nOperating cash flows from operating leases\n$\n(\n70\n)\n$\n(\n66\n)\n$\n(\n65\n)\nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n41\n \n$\n80\n \n$\n111\n \nWeighted-average remaining lease term (years) - operating leases\n8\n years\n9\n years\n9\n years\nWeighted-average discount rate - operating leases\n5.2\n \n%\n5.0\n \n%\n4.5\n \n%\nThe undiscounted future non-cancellable lease payments under the Company's operating leases as of December 31, 2024, were as follows:\n($ in millions)\nDecember 31, 2024\n2025\n$\n62\n \n2026\n51\n \n2027\n43\n \n2028\n31\n \n2029\n26\n \nThereafter\n109\n \nTotal lease payments\n322\n \nLess: Imputed interest\n66\n \nPresent value of operating lease liabilities\n$\n256\n \nLease liabilities included in the Company's consolidated statements of financial position as of December 31, 2024 and 2023, were as follows:\nDecember 31\n($ in millions)\n2024\n2023\nShort-term operating lease liabilities\n$\n51\n \n$\n51\n \nLong-term operating lease liabilities\n205\n \n228\n \nTotal operating lease liabilities\n$\n256\n \n$\n279\n \n15. \nCOMMITMENTS AND CONTINGENCIES\nContract Performance Contingencies \n- Contract profit margins may include estimates of revenues for matters on which the customer and the Company have not reached agreement, such as settlements in the process of negotiation, contract changes, claims, and requests for equitable adjustment for unanticipated contract costs. These estimates are based upon management's best assessment of the underlying causal events and circumstances and recognized to the extent of expected recovery based upon contractual entitlements and the probability of successful negotiation with the customer. The Company believes its outstanding customer settlements will be resolved without material impact to its financial position, results of operations, or cash flows.\nEnvironmental Matters \n- The estimated costs to complete environmental remediation are accrued when it is probable that the Company will incur such costs in the future to address environmental conditions at currently or formerly owned or leased operating facilities, or at sites where it has been named a Potentially Responsible Party by the Environmental Protection Agency or similarly designated by another environmental agency, and the related costs can be reasonably estimated by management. When only a range of costs is established and no amount within the range is more probable than another, the minimum amount in the range is accrued. Environmental liabilities are recorded on an undiscounted basis and are expensed or capitalized as appropriate. Capitalized expenditures, if any, relate to long-lived improvements in currently operating facilities. The Company does not \n90\nTable of Contents\n                                                    \n \n \nrecord insurance recoveries before collection is probable. As of December 31, 2024 and 2023, the Company did not have any accrued receivables related to insurance reimbursements or recoveries for environmental matters.\nThe Company’s environmental liability accruals do not include any litigation costs related to environmental matters, nor do they include amounts recorded as asset retirement obligations. Management estimates that as of December 31, 2024, the probable estimable future cost for environmental remediation is not material. Although management cannot predict whether new information gained as remediation progresses or the Company incurs additional remediation obligations will materially affect the estimated liability accrued, management does not believe that future remediation expenditures will have a material effect on the Company's consolidated financial position, results of operations, or cash flows.\nFinancial Arrangements \n- In the ordinary course of business, HII uses letters of credit issued by commercial banks to support certain leases, insurance policies, and contractual performance obligations, as well as surety bonds issued by insurance companies principally to support the Company's self-insured workers' compensation plans. As of December 31, 2024, the Company had $\n11\n million in issued but undrawn letters of credit, as indicated in Note 12: Debt, and $\n360\n million of surety bonds outstanding.\nU.S. Government Claims\n - From time to time, the U.S. Government communicates to the Company potential claims, disallowed costs, and penalties concerning prior costs incurred by the Company with which the U.S. Government disagrees. When such preliminary findings are presented, the Company and U.S. Government representatives engage in discussions, from which the Company evaluates the merits of the claims and assesses the amounts being questioned. Although the Company believes that the resolution of any of these matters will not have a material effect on its consolidated financial position, results of operations, or cash flows, it cannot predict the ultimate outcome of these matters.\nOther Matters - \nThe Company began negotiations with a Mission Technologies customer in January 2023 to address issues related to a manufacturing contract, and the parties settled the matter in May 2024. The Company has recorded losses relating to the contract that were not material to the Company's consolidated financial position, results of operations, or cash flows.\nThe Company previously disclosed an issue regarding the degree of corrosion of certain steel plates used to fabricate\n Friedman\n (NSC 11). The Company’s expectation regarding the resolution of the matter with the customer is included in contract cost and profit estimates. Those estimates include management's best assessment of the underlying causal events, contractual entitlements, and the probability of successful resolution with the customer. During the fourth quarter of 2024, the Company updated its estimates to reflect recent developments and progress made in ongoing negotiations with the customer regarding alternatives to resolve the matter. The Company does not expect the final resolution of the matter to have a material impact to the Company's consolidated financial position, results of operations, or cash flows.\nCollective Bargaining Agreements \n- Of the Company's over \n44,000\n employees, approximately \n45\n% are covered by a total of \nnine\n collective bargaining agreements. Newport News has \nthree\n collective bargaining agreements covering represented employees, which expire in February 2027, December 2027 and April 2029. Ingalls has \nfive\n collective bargaining agreements covering represented employees, all of which expire in March 2026. Approximately \n15\n Mission Technologies employees in Klamath Falls, Oregon are covered by \none\n collective bargaining agreement that expires in June 2025. \nCollective bargaining agreements generally expire after \nthree\n to \nfive years\n and are subject to renegotiation at that time. The Company believes its relationship with its employees is satisfactory.\n16. \nEMPLOYEE PENSION AND OTHER POSTRETIREMENT BENEFITS\nThe Company provides eligible employees defined benefit pension plans, defined contribution benefit plans, and other postretirement benefit plans. Non-collectively bargained defined benefit pension plans accruing benefits under the traditional years of service and compensation formula were amended in 2009 to freeze future service accruals and were replaced with a cash balance benefit for all current non-collectively bargained employees. Except for the major collectively bargained plan at Ingalls, the Company's qualified defined benefit pension plans are frozen to new entrants. The Company's policy is to fund its qualified defined benefit pension plans at least to the minimum amounts required under U.S. Government regulations. \n91\nTable of Contents\n                                                    \n \n \nDefined benefit plan obligations are measured based on the present value of projected future benefit payments to participants for services rendered to date. The measurement of projected future benefits is dependent on the terms of each individual plan, demographics, and valuation assumptions. No assumption is made regarding any potential changes to the benefit provisions beyond those to which the Company is currently committed, for example under existing collective bargaining agreements. \nThe Company also sponsors 401(k) defined contribution pension plans in which most employees are eligible to participate. Company contributions for most defined contribution pension plans are based on the matching of employee contributions up to \n4\n% of eligible compensation. In addition to the 401(k) defined contribution pension benefit formula, non-collectively bargained employees hired after June 30, 2008, and certain collectively bargained employees hired after July 10, 2017, are eligible to participate in a defined contribution benefit program in lieu of a defined benefit pension plan. The Company's contributions to the qualified defined contribution pension plans for the years ended December 31, 2024, 2023, and 2022, were $\n166\n million, $\n158\n million, and $\n153\n million, respectively.\nThe Company also sponsors defined benefit and defined contribution pension plans to provide benefits in excess of the tax-qualified limits. The liabilities related to these plans as of December 31, 2024, were $\n189\n million and $\n51\n million, respectively, and as of December 31, 2023, were $\n202\n million and $\n44\n million, respectively. Grantor trust assets, primarily in the form of Level 1 marketable securities, are intended to fund certain of these obligations. The trusts’ fair values supporting these liabilities as of December 31, 2024 and 2023, were $\n233\n million and $\n220\n million, respectively, of which $\n179\n million and $\n174\n million, respectively, were related to the non-qualified defined benefit pension plans.\nThe Company provides contributory postretirement health care and life insurance benefits to a dominantly closed group of eligible employees, retirees, and their qualifying dependents. Covered employees achieve eligibility to participate in these contributory plans upon retirement from active service if they meet specified age, years of service, and grandfathered requirements. Benefits are not guaranteed, and the Company reserves the right to amend or terminate coverage at any time. The Company's contributions for retiree health care benefits are subject to caps, which limit Company contributions when spending thresholds are reached.\nThe measurement date for all of the Company's retirement related plans is December 31. \nThe costs of the Company's defined benefit pension plans and other postretirement benefit plans for the years ended December 31, 2024, 2023, and 2022, were as follows:\nPension Benefits\nOther Benefits\nYear Ended December 31\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nComponents of net periodic benefit cost\nService cost\n$\n109\n \n$\n112\n \n$\n181\n \n$\n6\n \n$\n6\n \n$\n9\n \nInterest cost\n321\n \n343\n \n258\n \n19\n \n21\n \n14\n \nExpected return on plan assets\n(\n538\n)\n(\n529\n)\n(\n594\n)\n—\n \n— \n— \nAmortization of prior service cost (credit)\n16\n \n17\n \n22\n \n(\n2\n)\n(\n2\n)\n(\n4\n)\nAmortization of net actuarial loss (gain)\n18\n \n17\n \n35\n \n(\n13\n)\n(\n15\n)\n(\n3\n)\nSettlement gain\n—\n \n— \n(\n4\n)\n—\n \n— \n— \nNet periodic benefit (income) cost\n$\n(\n74\n)\n$\n(\n40\n)\n$\n(\n102\n)\n$\n10\n \n$\n10\n \n$\n16\n \n92\nTable of Contents\n                                                    \n \n \nThe funded status of these plans as of December 31, 2024 and 2023, was as follows:\n Pension Benefits\n Other Benefits\nDecember 31\nDecember 31\n($ in millions)\n2024\n2023\n2024\n2023\nChange in benefit obligation\nBenefit obligation at beginning of year\n$\n6,242\n \n$\n6,438\n \n$\n370\n \n$\n394\n \nService cost\n109\n \n112\n \n6\n \n6\n \nInterest cost\n321\n \n343\n \n19\n \n21\n \nPlan participants' contributions\n5\n \n10\n \n9\n \n9\n \nPlan amendments\n—\n \n— \n—\n \n— \nActuarial loss (gain)\n(\n499\n)\n62\n \n(\n26\n)\n(\n19\n)\nBenefits paid\n(\n307\n)\n(\n333\n)\n(\n45\n)\n(\n41\n)\nSettlement\n(\n80\n)\n(\n390\n)\n—\n \n— \nBenefit obligation at end of year\n5,791\n \n6,242\n \n333\n \n370\n \nChange in plan assets\nFair value of plan assets at beginning of year\n6,873\n \n6,781\n \n—\n \n— \nActual return on plan assets\n514\n \n793\n \n—\n \n— \nEmployer contributions\n11\n \n12\n \n36\n \n32\n \nPlan participants' contributions\n5\n \n10\n \n9\n \n9\n \nBenefits paid\n(\n307\n)\n(\n333\n)\n(\n45\n)\n(\n41\n)\nTransfers\n2\n \n— \n—\n \n— \nSettlement\n(\n74\n)\n(\n390\n)\n—\n \n— \nFair value of plan assets at end of year\n7,024\n \n6,873\n \n—\n \n— \nFunded status\n$\n1,233\n \n$\n631\n \n$\n(\n333\n)\n$\n(\n370\n)\nAmounts recognized in the consolidated statements of financial position:\nPension plan assets\n$\n1,422\n \n$\n888\n \n$\n—\n \n$\n— \nCurrent liability \n(1)\n(\n47\n)\n(\n45\n)\n(\n124\n)\n(\n129\n)\nNon-current liability \n(2)\n(\n142\n)\n(\n212\n)\n(\n209\n)\n(\n241\n)\nAccumulated other comprehensive loss (income) (pre-tax) related to:\nPrior service costs (credits)\n122\n \n138\n \n(\n11\n)\n(\n13\n)\nNet actuarial loss (gain)\n60\n \n562\n \n(\n119\n)\n(\n107\n)\n(1)    \nIncluded in other current liabilities and current portion of postretirement plan liabilities, respectively.\n(2)\n     \nIncluded in pension plan liabilities and other postretirement plan liabilities, respectively.\nIn 2024, the Company offered a bulk lump sum window for participants not currently receiving benefits where the present value of the deferred benefit is less than $\n75\n thousand. Approximately \n3,900\n participants received lump sum distributions of approximately $\n80\n million. The transaction did not trigger settlement accounting under FASB Accounting Standards Codification (\"ASC\") 715 – “Compensation – Retirement Benefits.”\nIn 2023, the Company purchased an annuity contract to transfer $\n411\n million of gross defined benefit pension obligations and related plan assets to an insurance company for approximately \n10,000\n retirees and beneficiaries. The annuity contract was purchased using assets from the pension master trust, and no additional funding contribution was required. This transaction had no impact on the amount, timing, or form of the monthly retirement benefit payments to the affected retirees and beneficiaries. The transaction did not trigger settlement accounting under FASB ASC 715 – “Compensation – Retirement Benefits.”\nIn 2022, the Company purchased annuity contracts to transfer $\n32\n million of gross defined benefit pension obligations and related plan assets to an insurance company for approximately \n500\n retirees and beneficiaries. The annuity contracts were purchased using assets from the pension master trust, and no additional funding contribution \n93\nTable of Contents\n                                                    \n \n \nwas required. This transaction had no impact on the amount, timing, or form of the monthly retirement benefit payments to the affected retirees and beneficiaries. In connection with this transaction, the Company recognized a noncash, non-operating pension settlement gain of $\n4\n million for the affected plan, which represents the accelerated recognition of actuarial losses that were included in accumulated other comprehensive loss within stockholders' equity.\nThe Projected Benefit Obligation (\"PBO\"), Accumulated Benefit Obligation (\"ABO\"), and asset values for the Company's qualified pension plans were $\n5,602\n million, $\n5,424\n million, and $\n7,024\n million, respectively, as of December 31, 2024, and $\n6,040\n million, $\n5,820\n million, and $\n6,873\n million, respectively, as of December 31, 2023. The PBO represents the present value of pension benefits earned through the end of the year, with allowance for future salary increases. The ABO is similar to the PBO, but does not provide for future salary increases.\nThe PBOs and fair values of plan assets for all qualified and non-qualified pension plans with PBOs in excess of plan assets were $\n189\n million and zero, respectively, as of December 31, 2024, and $\n864\n million and $\n607\n million, respectively, as of December 31, 2023.\nThe ABOs for all qualified and non-qualified pension plans with ABOs in excess of plan assets were $\n178\n million and $\n186\n million as of December 31, 2024, and 2023, respectively. The ABOs for all pension plans were $\n5,602\n million and $\n6,006\n million as of December 31, 2024 and 2023, respectively.\nThe changes in amounts recorded in accumulated other comprehensive income (loss) were as follows:\nPension Benefits\nOther Benefits\nYear Ended December 31\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nPrior service credit (cost)\n$\n—\n \n$\n— \n$\n(\n97\n)\n$\n—\n \n$\n— \n$\n— \nAmortization of prior service cost (credit)\n16\n \n17\n \n22\n \n(\n2\n)\n(\n2\n)\n(\n4\n)\nNet actuarial gain\n475\n \n202\n \n384\n \n26\n \n19\n \n103\n \nAmortization of net actuarial loss (gain)\n18\n \n17\n \n35\n \n(\n13\n)\n(\n15\n)\n(\n3\n)\nOther\n9\n \n— \n(\n4\n)\n(\n1\n)\n— \n(\n1\n)\nTotal changes in accumulated other comprehensive income (loss)\n$\n518\n \n$\n236\n \n$\n340\n \n$\n10\n \n$\n2\n \n$\n95\n \nThe weighted average assumptions used to determine the net periodic benefit costs for each year ended December 31 were as follows:\n Pension Benefits\n2024\n2023\n2022\nDiscount rate\n5.28\n \n%\n5.47\n \n%\n3.00\n \n%\nExpected long-term rate on plan assets\n8.00\n \n%\n8.00\n \n%\n7.25\n \n%\nRate of compensation increase\n3.63\n \n%\n3.63\n \n%\n3.58\n \n%\n Other Benefits\n2024\n2023\n2022\nDiscount rate\n5.35\n \n%\n5.50\n \n%\n2.94\n \n%\nInitial health care cost trend rate assumed for next year\n6.00\n \n%\n6.00\n \n%\n5.50\n \n%\nGradually declining to a rate of\n4.50\n \n%\n4.50\n \n%\n4.50\n \n%\nYear in which the rate reaches the ultimate rate\n2029\n \n2028\n \n2027\n \n94\nTable of Contents\n                                                    \n \n \nThe weighted average assumptions used to determine the benefit obligations as of December 31 of each year were as follows:\n Pension Benefits\n Other Benefits\nDecember 31\nDecember 31\n2024\n2023\n2024\n2023\nDiscount rate\n5.98\n \n%\n5.28\n \n%\n5.79\n \n%\n5.35\n \n%\nWeighted average interest crediting rate\n3.54\n \n%\n3.58\n \n%\nRate of compensation increase\n3.76\n \n%\n3.63\n \n%\nInitial health care cost trend rate assumed for next year\n6.00\n \n%\n6.00\n \n%\nGradually declining to a rate of\n4.50\n \n%\n4.50\n \n%\nYear in which the rate reaches the ultimate rate\n2030\n \n2029\n \nHealth Care Cost Trend Rate - \nThe health care cost trend rate represents the annual rates of change in the cost of health care benefits based on estimates of health care inflation, changes in health care utilization or delivery patterns, technological advances, government mandated benefits, and other considerations. Using a combination of market expectations and economic projections as of December 31, 2024, the Company selected an expected initial health care cost trend rate of \n6.00\n% and an ultimate health care cost trend rate of \n4.50\n% to be reached in \n2030\n. As of December 31, 2023, the Company assumed an expected initial health care cost trend rate of \n6.00\n% and an ultimate health care cost trend rate of \n4.50\n% to be reached in \n2029\n. \nThe Employee Retirement Income Security Act of 1974 (\"ERISA\"), including amendments under pension relief legislation, defines the minimum amount the Company must contribute to its qualified defined benefit pension plans. In determining whether to make discretionary contributions to these plans above the minimum required amounts, the Company considers various factors, including attainment of the funded percentage needed to avoid benefit restrictions and other adverse consequences, minimum CAS funding requirements, and the current and anticipated future funding levels of each plan. The Company's contributions to its qualified defined benefit pension plans are affected by a number of factors, including published IRS interest rates, the actual return on plan assets, actuarial assumptions, and demographic experience. These factors and the Company's resulting contributions also impact the funded status of each plan. \nThe Company made the following contributions to its defined benefit pension plans and other postretirement benefit plans for the years ended December 31, 2024, 2023, and 2022: \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nPension plans\nDiscretionary\nQualified\n$\n—\n \n$\n— \n$\n— \nNon-qualified\n11\n \n12\n \n10\n \nOther benefit plans\n36\n \n32\n \n31\n \nTotal contributions\n$\n47\n \n$\n44\n \n$\n41\n \nFor the year ending December 31, 2025, the Company expects its cash contributions to its qualified defined benefit pension plans to be less than $\n1\n million, all of which will be discretionary. For the year ending December 31, 2025, the Company expects its cash contributions to its other postretirement benefit plans to be approximately $\n34\n million.\n95\nTable of Contents\n                                                    \n \n \nThe following table presents estimated future benefit payments, using the same assumptions used in determining the Company's benefit obligations, as of December 31, 2024. Benefit payments depend on future employment and compensation levels, years of service, and mortality. Changes in any of these factors could significantly affect these estimated amounts.\n($ in millions)\nPension Benefits\nOther Benefit Payments\n2025\n$\n343\n \n$\n34\n \n2026\n362\n \n35\n \n2027\n380\n \n35\n \n2028\n397\n \n34\n \n2029\n411\n \n32\n \nYears 2030 to 2034\n$\n2,202\n \n$\n133\n \nPension Plan Assets\nPension assets include public equities, government and corporate bonds, cash and cash equivalents, private real estate funds, private partnerships, hedge funds, and other assets. Plan assets are held in a master trust and overseen by the Company's Investment Committee. All assets are externally managed through a combination of active and passive strategies. Managers may only invest in the asset classes for which they have been appointed.\n \nThe Investment Committee is responsible for setting the policy that provides the framework for management of the plan assets. \nThe Investment Committee set the minimum and maximum permitted values for each asset class in the Company's pension plan master trust for the year ended December 31, 2024, as follows:\nRange\nU.S. and international equities\n30\n \n-\n55\n%\nFixed income securities\n25\n \n-\n45\n%\nAlternative investments\n10\n \n-\n35\n%\nThe general objectives of the Company's pension asset strategy are to earn a rate of return over time to satisfy the benefit obligations of the plans, meet minimum ERISA funding requirements, and maintain sufficient liquidity to pay benefits and address other cash requirements within the master trust. Specific investment objectives include reducing the volatility of pension assets relative to benefit obligations, achieving a competitive total investment return, achieving diversification between and within asset classes, and managing other risks. Investment objectives for each asset class are determined based on specific risks and investment opportunities identified. Decisions regarding investment policies and asset allocations are made with the understanding of the historical and prospective return and risk characteristics of various asset classes, the effect of asset allocations on funded status, future Company contributions, and projected expenditures, including benefit payments. The Company updates its asset allocations periodically. The Company uses various analytics to determine the optimal asset mix and considers plan obligation characteristics, duration, liquidity characteristics, funding requirements, expected rates of return, regular rebalancing, and the distribution of returns. Actual allocations to each asset class could vary from target allocations due to periodic investment strategy changes, short-term market value fluctuations, the length of time it takes to fully implement investment allocation positions, such as real estate and other alternative investments, and the timing of benefit payments and Company contributions. \nTaking into account the asset allocation ranges, the Company determines the specific allocation of the master trust's investments within various asset classes. The master trust utilizes select investment strategies, which are executed through separate account or fund structures with external investment managers who demonstrate experience and expertise in the appropriate asset classes and styles. The selection of investment managers is done with careful evaluation of all aspects of performance and risk, demonstrated fiduciary responsibility, investment management experience, and a review of investment manager policies and processes. Investment performance is monitored frequently against appropriate benchmarks and tracked to compliance guidelines with the assistance of third-party consultants and performance evaluation tools and metrics.\n96\nTable of Contents\n                                                    \n \n \nPlan assets are stated at fair value. The Company employs a variety of pricing sources to estimate the fair value of its pension plan assets, including independent pricing vendors, dealer or counterparty-supplied valuations, third-party appraisals, and appraisals prepared by the Company's investment managers or other experts.\nInvestments in equity securities, common and preferred, are valued at the last reported sales price when an active market exists. Securities for which official or last trade pricing on an active exchange is available are classified as Level 1. If closing prices are not available, securities are valued at the last trade price, if deemed reasonable, or a broker's quote in a non-active market, and are typically categorized as Level 2.\nInvestments in fixed-income securities are generally valued by independent pricing services or dealers who make markets in such securities. Pricing methods are based upon market transactions for comparable securities and various relationships between securities that are generally recognized by institutional traders, and fixed-income securities typically are categorized as Level 2.\nInvestments in collective trust funds and commingled funds that use Net Asset Values (“NAV”) are valued based on the redemption price of units owned by the master trust, which is based on the current fair values of the fund assets, as reported by the investment manager. \nInvestments in hedge funds generally do not have readily available market quotations and are estimated at fair value, which primarily utilizes NAV or the equivalent, as a practical expedient, as reported by the investment manager. Hedge funds usually have restrictions on redemptions that might affect the ability to sell the investment at NAV in the short term. \nReal estate funds are typically valued through updated independent third-party appraisals, which are adjusted for changes in cash flows, market conditions, property performance, and leasing status. Since real estate funds do not have readily available market quotations, they are generally valued at NAV or its equivalent, as a practical expedient, as reported by the asset manager. Redemptions from real estate funds are also subject to various restrictions. \nPrivate partnership interests include debt and equity investments. These investments are valued based on NAVs or their equivalents, adjusted for capital calls and distributions, reported by the respective general partners. The terms of the partnerships range from seven to ten or more years, and investors do not have the option to redeem their interests in these partnerships. As of December 31, 2024, unfunded commitments to private partnerships were $\n535\n million.\nManagement reviews independently appraised values, audited financial statements, and additional pricing information to evaluate the NAVs. For the very limited group of investments for which market quotations are not readily available or for which the above valuation procedures are deemed not to reflect fair value, additional information is obtained from the investment manager and evaluated internally to determine whether any adjustments are required to reflect fair value. \nThe Company might be unable to quickly liquidate some assets at amounts close or equal to fair value in order to meet plan liquidity requirements or respond to specific events, such as the creditworthiness of any particular issuer or counterparty. Illiquid assets are generally long-term investments that complement the long-term nature of the Company's pension obligations and are generally not used to fund benefit payments in the short term. Management monitors liquidity risk on an ongoing basis and has procedures designed to maintain adequate liquidity for plan requirements. \nThe master trust has considerable investments in fixed income securities for which changes in the relevant interest rate of a particular instrument might result in the inability to secure similar returns upon the maturity or sale of the instrument. Changes in prevailing interest rates might result in an increase or decrease in fair value of the instrument. Investment managers are permitted to use interest rate swaps and other financial derivatives to manage interest rate and credit risks.\nCounterparty risk is the risk that a counterparty to a financial instrument held by the master trust will default on its commitment. Counterparty risk is generally related to over-the-counter derivative instruments used to manage risk exposure to interest rates on long-term debt securities. Certain agreements with counterparties employ set-off agreements, collateral support arrangements, and other risk mitigation practices designed to reduce the net credit risk exposure in the event of a counterparty default. The Company has credit policies and processes that manage \n97\nTable of Contents\n                                                    \n \n \nconcentrations of risk by seeking to undertake transactions with large well-capitalized counterparties and by monitoring the creditworthiness of these counterparties. \nCertain investments that are measured at fair value using NAV per share (or its equivalent) as a practical expedient are not required to be categorized in the fair value hierarchy table. The total fair value of these investments is included in the table below to permit reconciliation of the fair value hierarchy to amounts presented in the funded status table above.\nDecember 31, 2024\n($ in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nPlan assets subject to leveling\nU.S. and international equities\n$\n1,499\n \n$\n1,499\n \n$\n— \n$\n— \nGovernment and agency debt securities\n777\n \n— \n777\n \n— \nCorporate and other debt securities\n1,487\n \n— \n1,487\n \n— \nGroup annuity contract\n3\n \n— \n3\n \n— \nCash and cash equivalents, net\n21\n \n21\n \n— \n— \nNet plan assets subject to leveling\n$\n3,787\n \n$\n1,520\n \n$\n2,267\n \n$\n— \nPlan assets not subject to leveling\nU.S. and international equities (a)\n1,199\n \nCorporate and other debt securities\n242\n \nReal estate investments\n469\n \nPrivate partnerships\n926\n \nHedge funds\n275\n \nCash and cash equivalents, net (b)\n126\n \nTotal plan assets not subject to leveling\n3,237\n \nNet plan assets\n$\n7,024\n \n(a) \nU.S. and international equity securities include investments in small, medium, and large capitalization stocks of public companies held in commingled trust funds.\n(b)\n \nCash and cash equivalents are liquid short-term investment funds and include net receivables and payables of the trust. These funds are available for immediate use to fund daily operations, execute investment policies, and serve as a temporary investment vehicle.\n98\nTable of Contents\n                                                    \n \n \nDecember 31, 2023\n($ in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nPlan assets subject to leveling\nU.S. and international equities\n$\n1,723\n \n$\n1,723\n \n$\n— \n$\n— \nGovernment and agency debt securities\n448\n \n— \n448\n \n— \nCorporate and other debt securities\n1,469\n \n— \n1,469\n \n— \nGroup annuity contract\n3\n \n— \n3\n \n— \nNet plan assets subject to leveling\n$\n3,643\n \n$\n1,723\n \n$\n1,920\n \n$\n— \nPlan assets not subject to leveling\nU.S. and international equities (a)\n1,134\n \nCorporate and other debt securities\n234\n \nReal estate investments\n532\n \nPrivate partnerships\n828\n \nHedge funds\n388\n \nCash and cash equivalents, net (b)\n114\n \nTotal plan assets not subject to leveling\n3,230\n \nNet plan assets\n$\n6,873\n \n(a) \nU.S. and international equity securities include investments in small, medium, and large capitalization stocks of public companies held in commingled trust funds.\n(b) \nCash and cash equivalents are liquid short-term investment funds and include net receivables and payables of the trust. These funds are available for immediate use to fund daily operations, execute investment policies, and serve as a temporary investment vehicle.\n \nThere was no activity attributable to Level 3 retirement plan assets during the years ended December 31, 2024 and 2023.\n17. \nSTOCK COMPENSATION PLANS\nAs of December 31, 2024, HII had stock-based compensation awards outstanding under the following plans: the Huntington Ingalls Industries, Inc. 2011 Long-Term Incentive Stock Plan (the \"2011 Plan\"), the Huntington Ingalls Industries, Inc. 2012 Long-Term Incentive Stock Plan (the \"2012 Plan\"), and the Huntington Ingalls Industries, Inc. 2022 Long-Term Incentive Stock Plan (the \"2022 Plan\").\nStock Compensation Plans\nOn March 1, 2022, the Company's board of directors adopted the 2022 Plan, subject to stockholder approval, and the Company's stockholders approved the 2022 Plan on May 3, 2022. Award grants made on or after May 3, 2022, were made under the 2022 Plan. Award grants made prior to May 3, 2022, were made under the 2011 Plan or the 2012 Plan. No future grants will be made under the 2011 Plan or the 2012 Plan.\nThe 2022 Plan permits awards of stock options, stock appreciation rights, and other stock awards. Stock awards, in the form of RPSRs, RSRs, and stock rights, are granted to key employees and members of the board of directors without payment to the Company. The 2022 Plan authorized (i) \n1.3\n million new shares; plus (ii) any shares subject to outstanding awards under the 2012 Plan or 2011 Plan that were subsequently forfeited to the Company; plus (iii) any shares subject to outstanding awards under the 2012 Plan or 2011 Plan that were subsequently exchanged by the participant as full or partial payment to the Company in connection with any such award or exchanged by a participant or withheld by the Company to satisfy the tax withholding obligations related to any such award. As of December 31, 2024, the remaining aggregate number of shares of the Company's common stock authorized for issuance under the 2022 Plan was \n1.1\n million. \n99\nTable of Contents\n                                                    \n \n \nThe 2012 Plan permitted awards of stock options, stock appreciation rights, and other stock awards. Stock awards, in the form of RPSRs, RSRs, and stock rights were granted to key employees and members of the board of directors without payment to the Company.\nThe 2011 Plan permitted the awards of stock options and other stock awards. Stock awards, in the form of stock rights, were granted to members of the board of directors without payment to the Company. \nStock Awards\nStock awards include RPSRs, RSRs, and stock rights. The fair value of stock awards is determined based on the closing market price of the Company's common stock on the grant date. Compensation expense for stock awards is measured based on the grant date fair value and recognized over the vesting period, generally \nthree years\n. \nFor purposes of measuring compensation expense, the amount of shares ultimately expected to vest is estimated at each reporting date based on management's expectations regarding the relevant service or performance criteria.\nThe Company issued the following stock awards in the years ended December 31, 2024, 2023, and 2022:\nRestricted Performance Stock Rights \n- For the year ended December 31, 2024, the Company granted approximately \n0.1\n million RPSRs at a weighted average share price of $\n288.26\n. These rights are subject to cliff vesting on December 31, 2026. For the year ended December 31, 2023, the Company granted approximately \n0.2\n million RPSRs at a weighted average share price of $\n215.24\n. These rights are subject to cliff vesting on December 31, 2025. For the year ended December 31, 2022, the Company granted approximately \n0.2\n million RPSRs at a weighted average share price of $\n204.41\n. These rights were fully vested as of December 31, 2024. All of the RPSRs are subject to the achievement of performance-based targets at the end of the respective vesting periods and will ultimately vest between \n0\n% and \n200\n% of grant date value.\nCompensation Restricted Stock Rights \n- For the year ended December 31, 2024, the Company granted approximately \n0.1\n million compensation RSRs at a weighted average share price of $\n287.38\n. These rights vest 33 1/3% upon each of the first, second, and third anniversaries of the grant date. No compensation RSRs were granted for the years ended December 31, 2023 and 2022.\nRetention Restricted Stock Rights - \nRetention stock awards are granted to key employees primarily to incentivize continued employment with the Company. In 2024, the Company granted approximately \n2,200\n retention RSRs at a weighted average share price of $\n281.01\n, with cliff vesting \none\n to \nthree years\n from the grant date. In 2023, the Company granted approximately \n9,500\n retention RSRs at a weighted average share price of $\n213.37\n, with cliff vesting \ntwo\n to \nthree years\n from the grant date. In 2022, the Company granted approximately \n2,400\n retention RSRs at a weighted average share price of $\n208.81\n, with cliff vesting \none\n to \nthree years\n from the grant date. As of December 31, 2024, approximately \n9,200\n retention RSRs were outstanding. \nThe Company also received transfers of stock awards from employees in satisfaction of minimum tax withholding obligations associated with the vesting of stock awards during the period. The Company does not consider these transfers as treasury stock because the stock is not issued; rather, the award is surrendered in lieu of payments of cash to settle tax obligations.\nStock Rights and Stock Issuances \n- The Company granted stock rights to its non-employee directors on a quarterly basis in 2024, with each grant less than \n10,000\n shares. All stock rights granted to non-employee directors are fully vested on the grant date. If a non-employee director has met certain stock ownership requirements, the non-employee director may elect under the terms of the Amended and Restated Directors’ Compensation Policy and Amended and Restated Board Deferred Compensation Policy to receive their annual equity award for the following calendar year in the form of either shares of the Company’s common stock or stock units that are payable in the fifth calendar year after the year in which the annual equity award is earned, or, if earlier, upon termination of the director’s board service.\nNon-employee directors may also elect to receive their annual cash retainers in the form of stock units that become payable upon termination of the director’s board service. Non-employee directors who elect to receive their annual cash retainers in the form of stock units and have met their stock ownership requirements may elect under the terms of the Amended and Restated Directors’ Compensation Policy and Amended and Restated Board Deferred Compensation Policy to receive in the following calendar year either shares of the Company's common stock or \n100\nTable of Contents\n                                                    \n \n \nstock units that are payable in the fifth calendar year after the year in which the stock units are earned, or, if earlier, upon termination of the director’s board service.\nStock award activity for the years ended December 31, 2024, 2023, and 2022, was as follows:\nStock Awards\n(in thousands)\nWeighted-Average\nGrant Date Fair\nValue\nWeighted\nAverage\nRemaining\nContractual Term\nOutstanding as of December 31, 2021\n485\n \n$\n190.36\n \n1.0\n year\nGranted\n166\n \n204.65\n \nAdjustment due to performance\n52\n \n209.04\n \nVested\n(\n170\n)\n209.04\n \nForfeited\n(\n27\n)\n199.40\n \nOutstanding as of December 31, 2022\n506\n \n189.68\n \n1.0\n year\nGranted\n177\n \n215.16\n \nAdjustment due to performance\n32\n \n224.35\n \nVested\n(\n155\n)\n224.35\n \nForfeited\n(\n25\n)\n178.68\n \nOutstanding as of December 31, 2023\n535\n \n189.98\n \n1.0\n year\nGranted\n174\n \n286.14\n \nAdjustment due to performance\n61\n \n181.76\n \nVested\n(\n206\n)\n181.76\n \nForfeited\n(\n14\n)\n240.77\n \nOutstanding as of December 31, 2024\n550\n \n$\n221.59\n \n1.0\n year\nVested awards include stock awards that fully vested during the year based on the level of achievement of the relevant performance goals. The performance goals for outstanding RPSRs granted in 2024, 2023, and 2022 were based on three metrics as defined in the grant agreements: earnings before interest, taxes, depreciation, amortization, and pension (\"EBITDAP\"), weighted at \n40\n%, pension-adjusted return on invested capital (\"ROIC\"), weighted at \n40\n%, and relative EBITDAP growth, weighted at \n20\n%. The Company's EBITDAP growth is measured against EBITDAP growth of the S&P Aerospace and Defense Select Index.\nCompensation Expense \nThe Company recorded $\n23\n million, $\n34\n million, and $\n36\n million of expense related to stock awards for the years ended December 31, 2024, 2023, and 2022, respectively. The Company recorded $\n7\n million, $\n10\n million, and $\n9\n million as tax benefits related to stock awards for the years ended December 31, 2024, 2023, and 2022, respectively. \nThe Company recognized tax benefits for the years ended December 31, 2024, 2023, and 2022, of $\n6\n million, $\n7\n million, and $\n8\n million, respectively, from the issuance of stock in settlement of stock awards.\nUnrecognized Compensation Expense\nAs of December 31, 2024, the Company had $\n16\n million of unrecognized compensation expense associated with RSRs granted in 2024 and 2023, which will be recognized over a weighted average period of \n1.1\n years, and $\n29\n million of unrecognized expense associated with RPSRs granted in 2024 and 2023, which will be recognized over a weighted average period of \n1\n year\n.\n18. \nSUBSIDIARY GUARANTORS\nAs described in Note 12: Debt, the Company issued senior notes through the consolidating parent company, HII. Performance of the Company's obligations under its senior notes outstanding as of December 31, 2024, including any repurchase obligations resulting from a change of control, is fully and unconditionally guaranteed, jointly and severally, on an unsecured basis, by each of HII's existing and future material domestic subsidiaries (\"Subsidiary \n101\nTable of Contents\n                                                    \n \n \nGuarantors\"). The Subsidiary Guarantors are \n100\n% owned by HII. Each HII subsidiary that did not provide a guarantee (\"Non-Guarantors\") is not material and HII, as the parent company issuer, did not have independent assets or operations. There are no significant restrictions on the ability of the parent company and the Subsidiary Guarantors to obtain funds from their respective subsidiaries by dividend or loan, except those imposed by applicable law.\n \n19. \nSUBSEQUENT EVENTS\nIn December 2024, the Company entered into a definitive agreement to acquire substantially all of the assets of W International, a South Carolina-based complex metal fabricator specializing in the manufacture of shipbuilding structures, modules, and assemblies, for a purchase price of $\n140\n million, subject to customary purchase price adjustments. The transaction closed in January 2025 using cash on hand, and the Company is in the process of completing its purchase accounting evaluation and other related disclosures. The acquired manufacturing facility operates within the Newport News segment.\n \nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nThe Company's management, with the participation of the Company's Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Company's disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\")) as of December 31, 2024. Based on that evaluation, the Company's Chief Executive Officer (principal executive officer) and Chief Financial Officer (principal financial officer) concluded that, as of December 31, 2024, the Company's disclosure controls and procedures were effective to ensure that information required to be disclosed in reports the Company files or submits under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (ii) accumulated and communicated to management to allow their timely decisions regarding required disclosure.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the three months ended December 31, 2024, that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. In order to evaluate the effectiveness of internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act, management, with the participation of Company's Chief Executive Officer (principal executive officer) and Chief Financial Officer (principal financial officer), has conducted an assessment, including testing, using the criteria in \nInternal Control – Integrated Framework \n(\n2013\n), issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\"). The Company’s system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nBased on its assessment, management has concluded that the Company maintained effective internal control over financial reporting as of December 31, 2024, based on criteria in \nInternal Control – Integrated Framework \n(\n2013\n), issued by the COSO. The effectiveness of the Company’s internal control over financial reporting as of \n102\nTable of Contents\n                                                    \n \n \nDecember 31, 2024, has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report, which is included in Item 8.\nITEM 9B. OTHER INFORMATION\nAdoption\n or \nTermination\n of Trading Arrangements\nDuring the quarter ended December 31, 2024, none of our directors or officers (as defined in Rule 16a-1(f) of the Exchange Act) \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as those terms are defined in Item 408 of Regulation S-K.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n103\nTable of Contents\n                                                    \n \n \nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nDirectors \nInformation regarding our directors will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders, to be filed with the SEC within 120 days after the end of the Company's fiscal year. \nInformation about our Executive Officers\nOur executive officers as of February 6, 2025 are listed below, along with their ages, position currently held, and business experience during at least the last five years. \nName\nAge\nPosition(s)\nChristopher D. Kastner\n61\nPresident and Chief Executive Officer\nBrian D. Blanchette\n50\nExecutive Vice President and President, Ingalls Shipbuilding\nTodd R. Borkey\n61\nExecutive Vice President and Chief Technology Officer\nChad N. Boudreaux\n51\nExecutive Vice President and Chief Legal Officer\nJennifer R. Boykin\n60\nExecutive Vice President, Special Projects\nEric D. Chewning\n47\nExecutive Vice President, Strategy and Development\nEdgar A. Green III\n59\nExecutive Vice President and President, Mission Technologies\nPaul C. Harris\n60\nExecutive Vice President, Chief Sustainability and Compliance Officer\nBrooke A. Hart\n54\nExecutive Vice President, Communications\nStewart H. Holmes\n63\nExecutive Vice President, Government and Customer Relations\nEdmond E. Hughes\n61\nExecutive Vice President and Chief Human Resources Officer\nStephen R. Powell\n60\n \nCorporate Vice President and Treasurer \nNicolas G. Schuck\n51\nCorporate Vice President, Controller and Chief Accounting Officer\nChristopher W. Soong\n52\nExecutive Vice President and Chief Information Officer\nThomas E. Stiehle\n59\nExecutive Vice President and Chief Financial Officer\nKara R. Wilkinson\n50\nExecutive Vice President and President, Newport News Shipbuilding\nChristopher D. Kastner\n, \nPresident and Chief Executive Officer \n– \nMr. Kast\nner has served as President and Chief Executive Officer since March 2022. Prior to becoming CEO, he served as Executive Vice President and Chief Operating Officer from February 2021 to February 2022, and as Executive Vice President and Chief Financial Officer from March 2016 to February 2021. Mr. Kastner served as Corporate Vice President and General Manager, Corporate Development from August 2012 to March 2016, and as Vice President and Chief Financial Officer, Ingalls Shipbuilding, from March 2011 to August 2012. Prior to the spin-off, Mr. Kastner held various positions, including as Vice President, Business Management and Chief Financial Officer, Northrop Grumman Shipbuilding, Gulf Coast, and as Vice President, Contracts and Risk Management, Northrop Grumman Ship Systems.\nBrian D. Blanchette, Executive Vice President and President, Ingalls Shipbuilding \n– Mr. Blanchette has served as Executive Vice President and President, Ingalls Shipbuilding since January 2025. He previously served as Vice President, Quality and Engineering for Ingalls Shipbuilding from July 2021 to December 2024. From February 2015 to July 2021, he served as Director of Technical and Design Engineering at Ingalls Shipbuilding. Mr. Blanchette began his career at Ingalls Shipbuilding in 1996 and has held various positions of increasing responsibility during his tenure in Engineering, Program Management and Business Development. \nTodd A. Borkey, Executive Vice President and Chief Technology Officer\n – Mr. Borkey has served as Executive Vice President and Chief Technology Officer since September 2022. Prior to that, he served as he served as Chief Technology Officer at Alion Science and Technology from October 2017 and continued in that role following the Company's acquisition of Alion until September 2022. Before joining Alion, Mr. Borkey served as CTO for Thales Defense and Security and DRS Defense Solutions.\n104\nTable of Contents\n                                                    \n \n \nChad N. Boudreaux, Executive Vice President and Chief Legal Officer \n–\n \nMr. Boudreaux has served as Executive Vice President and Chief Legal Officer since April 2020. He joined the Company in 2011 as Corporate Vice President for Litigation, Investigations and Compliance and was named Chief Compliance Officer in 2013, serving in these roles until being named to his current position. Before joining the Company, Mr. Boudreaux practiced law at Baker Botts LLP, where he established the law firm’s Global Security and Corporate Risk Counseling practice group. Prior to that, he held various high-ranking positions in the U.S. government, including deputy chief of staff of the U.S. Department of Homeland Security and leadership positions at the U.S. Department of Justice. \nJennifer R. Boykin, Executive Vice President, Special Projects \n–\n \nMs. Boykin has served as Executive Vice President, Special Projects since January 2025. She began her career in the Newport News Shipbuilding nuclear engineering division in 1987 and held positions of increasing responsibility at Newport News Shipbuilding, including as Vice President of Engineering and Design and Vice President of Quality and Process Excellence, until serving as Executive Vice President and President, Newport News Shipbuilding from July 2017 to December 2024. \nEric D. Chewning, Executive Vice President, Strategy and Development\n – Mr. Chewning has served as Executive Vice President, Strategy and Development since January 2023. Before joining HII, Mr. Chewning co-led McKinsey & Company's Aerospace & Defense practice in the Americas from April 2020 to January 2023. From January 2019 to January 2020, Mr. Chewning served as the Chief of Staff to the U.S. Secretary of Defense. Mr. Chewning is a former U.S. Army military intelligence officer and previously worked as an investment banker with Morgan Stanley & Co.  \nEdgar A. Green III, Executive Vice President and President, Mission Technologies \n–\n \nMr. Green has served as Executive Vice President and President, Mission Technologies since December 2016. Prior to that, from January 2015 to December 2016, he served as Corporate Vice President, Corporate Development. From January 2013 to January 2015, Mr. Green served as Vice President, Component Manufacturing, for Newport News Shipbuilding, and, from March 2011 to January 2013, as Corporate Vice President, Investor Relations. Mr. Green served as a U.S. Navy nuclear submarine officer on board USS Tecumseh (SSBN-628).\nPaul C. Harris, Executive Vice President and Chief Sustainability and Compliance Officer\n – Mr. Harris has served as Executive Vice President and Chief Sustainability and Compliance Officer since March 2022, and from September 2020 to March 2022, he served as Corporate Vice President, Chief Compliance and Privacy Officer. Before joining HII, Mr. Harris served as Senior Vice President at Hampton University from September 2016 to September 2020. Mr. Harris was a Member of the Virginia House of Delegates from 1998 to 2001.\nBrooke A. Hart, Executive Vice President, Communications\n – Ms. Hart has served as Executive Vice President, Communications since September 2021. Prior to joining HII, she served as Vice President of Communications and Brand at Sierra Nevada Corporation, a defense contractor, from August 2015 until September 2021. In prior roles, Ms. Hart served as Vice President at Disruption Corporation and Crystal Tech Fund and as Senior Communications Officer at The Pew Charitable Trusts. \nStewart H. Holmes, Executive Vice President, Government and Customer Relations\n – Mr. Holmes has served as Executive Vice President, Government and Customer Relations since September 2021. From April 2017 until September 2021, he served as Senior Vice President of Washington Operations for Textron Inc.. In prior roles, Mr. Holmes served as the staff director/minority clerk for the Senate Appropriations Subcommittee on Defense, a staff member for the Senate Appropriations Committee and as an aide to Sen. Thad Cochran of Mississippi. Mr. Holmes served in the U.S. Marine Corps for more than two decades.\nEdmond E. Hughes, Executive Vice President and Chief Human Resources Officer \n– Mr. Hughes has served as Executive Vice President and Chief Human Resources Officer since April 2022. From March 2006 until March 2022, he served as the Vice President of Human Resources and Administration for Ingalls Shipbuilding. Before joining Ingalls Shipbuilding, Mr. Hughes served in human resources roles of increasing responsibilities at General Motors and TRW Automotive.  \nStephen R. Powell\n, \nCorporate Vice President and Treasurer\n – Mr. Powell has served as Corporate Vice President and Treasurer since January 2025. He previously served as Corporate Director and Assistant Treasurer from March 2011 to December 2024. From 2001 to 2011, Mr. Powell was responsible for treasury, overhead and capital planning for Northrop Grumman Shipbuilding.\n105\nTable of Contents\n                                                    \n \n \nNicolas G. Schuck, Corporate Vice President, Controller and Chief Accounting Officer\n – Mr. Schuck has served as Corporate Vice President, Controller and Chief Accounting Officer since August 2015. Prior to that, he served as the Assistant Controller at our Newport News Shipbuilding division and as Corporate Assistant Controller. \nChristopher W. Soong, Executive Vice President and Chief Information Officer\n – Mr. Soong has served as Executive Vice President and Chief Information Officer since April 2023. Prior to that, he served as Chief Information Officer for Mission Technologies from August 2021 to April 2023. From October 2018 to August 2021, Mr. Soong served as Senior Vice President and Chief Information Officer at Alion Science and Technology. \nThomas E. Stiehle, Executive Vice President and Chief Financial Officer\n – Mr. Stiehle has served as Executive Vice President and Chief Financial Officer since February 2021. Mr. Stiehle is responsible for the Company’s business management functions, including investor relations, treasury, internal audit, contracts, accounting, financial reporting, planning and analysis, rates and budgets and mergers and acquisitions. From October 2012 until he assumed his current role, he served as Vice President and Chief Financial Officer of Ingalls Shipbuilding and, prior to that, served as Vice President, Contracts and Pricing at Ingalls. \nKara R. Wilkinson, Executive Vice President and President, Newport News Shipbuilding\n – Ms. Wilkinson has served as Executive Vice President and President, Newport News Shipbuilding since January 2025. Prior to that, she served as Executive Vice President and President, Ingalls Shipbuilding, from April 2021 to December 2024. From May 2016 until April 2021, she served as Vice President of Program Management at Ingalls Shipbuilding. Prior to that, Ms. Wilkinson held various positions in Business Development and Engineering at Ingalls Shipbuilding after beginning her career at Ingalls Shipbuilding in 1996 as a naval architect. \nAudit Committee Financial Expert \nInformation as to the Audit Committee and the Audit Committee Financial Expert will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nCode of Ethics\nWe have adopted a Code of Ethics and Business Conduct for all of our employees, including the principal executive officer, principal financial officer, and principal accounting officer. The Code of Ethics and Business Conduct can be found on our internet website at HII.com under \"Investors—Company—Corporate Governance.\" A copy of the Code of Ethics and Business Conduct is available to any stockholder who requests it by writing to: Huntington Ingalls Industries, Inc., c/o Office of the Secretary, 4101 Washington Avenue, Newport News, VA 23607. If we make any substantive amendments to the Code of Ethics and Business Conduct or grant any waivers to the Code of Ethics and Business Conduct, including any implicit waiver, to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions, we will disclose the nature of the amendment or waiver on our website. \nReferences to our websites in this report are provided as a matter of convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, the website. Accordingly, such information should not be considered part of this report.. \nInsider Trading Policy\nInformation concerning our Insider Trading Policy, will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nOther Disclosures \nOther disclosures required by this Item will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nITEM 11. EXECUTIVE COMPENSATION\nInformation concerning executive compensation (other than information related to pay-for-performance), including information concerning compensation committee interlocks, insider participation, and the compensation committee \n106\nTable of Contents\n                                                    \n \n \nreport, will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation as to security ownership of certain beneficial owners and management and related stockholder matters will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nEquity Compensation Plan Information\nThe following table provides information regarding the equity securities available for issuance under our equity compensation plans as of December 31, 2024:\nEquity Compensation Plan Information\nPlan category\nNumber of Securities to be Issued Upon Exercise of Outstanding Options, Warrants and Rights\n(1)\nWeighted-Average Exercise Price of Outstanding Options,\nWarrants and Rights\nNumber of Securities Remaining Available for Future Issuance Under Equity Compensation Plans (Excluding Securities\nReflected in Column (a))\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n549,706 \n$0.00\n1,107,849 \nEquity compensation plans not approved by security holders\n(2)\n— \n— \n— \nTotal\n549,706 \n$0.00\n1,107,849 \n(1)\n Includes grants made under the Huntington Ingalls Industries, Inc. 2022 Long-Term Incentive Stock Plan (the \"2022 Plan\"), which was approved by our stockholders on May 3, 2022, Huntington Ingalls Industries, Inc. 2012 Long-Term Incentive Stock Plan (the \"2012 Plan\"), which was approved by our stockholders on May 2, 2012, and the Huntington Ingalls Industries, Inc. 2011 Long-Term Incentive Stock Plan (the \"2011 Plan\"), which was approved by the sole stockholder of HII prior to its spin-off from Northrop Grumman Corporation. These shares were comprised of 14,972 stock rights granted under the 2011 Plan, 50,216 stock rights and 144,515 restricted performance stock rights granted under the 2012 Plan, and 16,199 stock rights, 82,346 restricted stock rights, and 241,458 restricted performance stock rights granted under the 2022 Plan, assuming target performance achievement. \n(2) \nNo awards have been granted under plans not approved by security holders.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation as to certain relationships and related transactions and director independence will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation as to principal accountant fees and services will be incorporated herein by reference to the Proxy Statement for our 2025 Annual Meeting of Stockholders. \n107\nTable of Contents\n                                                    \n \n \nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES \n(a)     1.  Report of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\nFinancial Statements \nConsolidated Statements of Operations and Comprehensive Income\nConsolidated Statements of Financial Position \nConsolidated Statements of Cash Flows \nConsolidated Statements of Changes in Equity \nNotes to Consolidated Financial Statements \n2.  Financial Statement Schedules \nSchedule II - Valuation and Qualifying Accounts\nAll other schedules have been omitted because they are not applicable, not required, or the information has been otherwise supplied in the financial statements or notes to the financial statements. \nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\nBalance at Beginning of Period\n(Benefits)/Charges to Income\nOther\nBalance at End of Period\nYear Ended December 31, 2022\nValuation allowance for deferred tax assets\n$\n22\n \n$\n2\n \n$\n4\n \n$\n28\n \nYear Ended December 31, 2023\nValuation allowance for deferred tax assets\n28\n \n1\n \n— \n29\n \nYear Ended December 31, 2024\nValuation allowance for deferred tax assets\n$\n29\n \n$\n(\n3\n)\n$\n—\n \n$\n26\n \n3. Exhibits \n2.1\nSeparation and Distribution Agreement, dated as of March 29, 2011, among Titan II Inc. (formerly Northrop Grumman Corporation), Northrop Grumman Corporation (formerly New P, Inc.), Huntington Ingalls Industries, Inc., Northrop Grumman Shipbuilding, Inc. and Northrop Grumman Systems Corporation (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on April 4, 2011).\n3.1\nRestated Certificate of Incorporation of Huntington Ingalls Industries, Inc., filed March 30, 2011 (incorporated by reference to Exhibit 3.1 to the Company's Current Report on Form 8-K filed on April 4, 2011).\n3.2\nCertificate of Amendment to the Restated Certificate of Incorporation of Huntington Ingalls Industries, Inc., dated May 28, 2014 (incorporated by reference to Exhibit 3.2 to the Company’s Quarterly Report on Form 10-Q filed on August 7, 2014). \n3.3\nCertificate of Amendment to the Restated Certificate of Incorporation of Huntington Ingalls Industries, Inc., dated May 21, 2015 (incorporated by reference to Exhibit 3.3 to the Company’s Quarterly Report on Form 10-Q filed on August 6, 2015).\n3.4\nCertificate of Amendment to the Restated Certificate of Incorporation of Huntington Ingalls Industries, Inc., dated May 12, 2021 (incorporated by reference to Annex B to the Proxy Statement filed on March 19, 2021).\n3.5\nRestated Bylaws of Huntington Ingalls Industries, Inc. (incorporated by reference to Exhibit 3.1 to the Company's Current Report on Form 8-K filed on November 8, 2022). \n108\nTable of Contents\n                                                    \n \n \n4.1\nIndenture, dated as of December 1, 2017, by and among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to \nForm 8-K filed on December 4, 2017). \n4.2\nFirst Supplemental Indenture, dated as of August 27, 2019, to the Indenture, dated as of December 1, 2017, among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.2 to \nForm 10-Q filed on November 7, 2019). \n4.3\nSecond Supplemental Indenture, dated as of June 30, 2020, to the Indenture, dated as of December 1, 2017, among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.3 to\n Form 10-K filed on February 11, 2021).\n4.4\nThird Supplemental Indenture, dated as of December 14, 2021, to the Indenture, dated as of December 1, 2017, among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.4 to \nForm 10-K filed on February 10, 2022).\n \n4.5\nIndenture, dated March 30, 2020, by and among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.1 to\n Form 8-K filed on March 30, 2020).\n4.6\nFirst Supplemental Indenture, dated as of June 30, 2020, to the Indenture, dated as of March 30, 2020, among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.5 to the Company's Annual Report on Form 10-K filed on February 11, 2021).\n4.7\nSecond Supplemental Indenture, dated as of December 14, 2021, to the Indenture, dated as of March 30, 2020, among Huntington Ingalls Industries, Inc., the guarantors party thereto, and Wells Fargo Bank, National Association, as trustee (incorporated by reference to Exhibit 4.7 to the Company's Annual Report on Form 10-K filed on February 10, 2022).\n4.8\nIndenture, dated as of August 16, 2021, by and among Huntington Ingalls Industries, Inc., certain subsidiaries of Huntington Ingalls Industries, Inc., and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.1 to \nForm 8–K filed on August 16, 2021).\n4.9\nFirst Supplemental Indenture, dated as of December 14, 2021, to the Indenture, dated as of August 16, 2021, by and among Huntington Ingalls Industries, Inc., certain subsidiaries of Huntington Ingalls Industries, Inc. and U.S. Bank National Association, as trustee (incorporated by reference to Exhibit 4.9 to \nForm 10-K filed on February 10, 2022).\n4.10\nDescription of Securities\n4.11\nIndenture, dated as November 18, 2024, among Huntington Ingalls Industries, Inc., the guarantors named therein and U.S. Bank Trust Company, National Association, as trustee (incorporated by reference to Exhibit 4.1 to Form 8-K filed November 18, 2024\n).\n4.12\nFirst Supplemental Indenture, dated as of November 18, 2024, among Huntington Ingalls Industries, Inc., the guarantors named therein and U.S. Bank Trust Company, National Association, as trustee, relating to 5.353% Senior Notes due 2030 and 5.749% Senior Notes due 2035 (incorporated by reference to Exhibit 4.2 to Form 8-K filed November 18, 2024\n).\n4.13\nForm of 5.353% Senior Notes due 2030 (incorporated by reference to Exhibit 4.2 to Form 8-K filed November 18, 2024\n).\n109\nTable of Contents\n                                                    \n \n \n4.14\nForm of 5.749% Senior Notes due 2035 (incorporated by reference to Exhibit 4.2 to Form 8-K filed November 18, 2024\n)\n.\n10.1\nAmended and Restated Revolving Credit Agreement, dated as of August 2, 2021, among Huntington Ingalls Industries, Inc., the lenders party thereto, and JPMorgan Chase Bank, N.A., as Administrative Agent and an Issuing Bank (incorporated by reference to Exhibit 10.1 to \nForm 10-Q filed on August 5, 2021\n, File No. 001-34910\n).\n10.2\nCredit Agreement, dated as of August 2, 2021, among Huntington Ingalls Industries, Inc., the lenders party thereto, and JPMorgan Chase Bank, N.A., as Administrative Agent \n(incorporated by reference to Exhibit 10.2 to \nForm 10-Q filed on August 5, 2021\n, File No. 001-34910\n).\n10.3\nForm of Amended and Restated Indemnification Agreement and Schedule of directors and officers who have entered into such agreement (incorporated by reference to Exhibit 10.2 to \nForm 10-K filed on February 19, 2015\n, File No. 001-34910\n).\n10.4\nIntellectual Property License Agreement, dated as of March 29, 2011, between Northrop Grumman Systems Corporation and Northrop Grumman Shipbuilding, Inc. (incorporated by reference to Exhibit 10.4 to Form 8-K filed on April 4, 2011, File No. 001-34910).\n10.5\nTax Matters Agreement, dated as of March 29, 2011, among Northrop Grumman Corporation (formerly New P, Inc.), Huntington Ingalls Industries, Inc. and Titan II Inc. (formerly Northrop Grumman Corporation) (incorporated by reference to Exhibit 10.5 to Form 8-K filed on April 4, 2011,  File No. 001-34910).\n10.6\nLoan Agreement, dated as of May 1, 1999, between Ingalls Shipbuilding, Inc. and the Mississippi Business Finance Corporation relating to the Economic Development Revenue Bonds (Ingalls Shipbuilding, Inc. Project) Taxable Series 1999A due 2024 (incorporated by reference to Exhibit 10.6 to the Company's Amendment No. 1 to Registration Statement on Form 10 filed on November 24, 2010).\n10.7\nIndenture of Trust, dated as of May 1, 1999, between the Mississippi Business Finance Corporation and the First National Bank of Chicago, as Trustee, relating to the Economic Development Revenue Bonds (Ingalls Shipbuilding, Inc. Project) Taxable Series 1999A due 2024 (incorporated by reference to Exhibit 10.7 to the Company's Amendment No. 1 to Registration Statement on Form 10 filed on November 24, 2010).\n10.8\nLoan Agreement, dated as of December 1, 2006, between Northrop Grumman Ship Systems, Inc. and the Mississippi Business Finance Corporation relating to the Gulf Opportunity Zone Industrial Development Revenue Bonds (Northrop Grumman Ship Systems, Inc. Project), Series 2006 due 2028 (incorporated by reference to Exhibit 10.8 to the Company's Amendment No. 1 to Registration Statement on Form 10 filed on November 24, 2010).\n10.9\nTrust Indenture, dated as of December 1, 2006, between the Mississippi Business Finance Corporation and The Bank of New York Trust Company, N.A., as Trustee, relating to the Gulf Opportunity Zone Industrial Development Revenue Bonds (Northrop Grumman Ship Systems, Inc. Project), Series 2006 due 2028 (incorporated by reference to Exhibit 10.9 to the Company's Amendment No. 1 to Registration Statement on Form 10 filed on November 24, 2010).\n10.10\nGuaranty Agreement, dated as of May 1, 1999, between Litton Industries, Inc. and The First National Bank of Chicago, as Trustee (incorporated by reference to Exhibit 10.10 to the Company's Amendment No. 2 to Registration Statement on Form 10 filed on December 21, 2010).\n10.11\nAssumption of Guaranty of Litton Industries, Inc., dated as of January 1, 2003, by Northrop Grumman Systems Corporation (incorporated by reference to Exhibit 10.11 to the Company's Amendment No. 2 to Registration Statement on Form 10 filed on December 21, 2010).\n10.12\nGuaranty Agreement, dated as of December 1, 2006, between Northrop Grumman Corporation and The Bank of New York Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 10.12 to the Company's Amendment No. 2 to Registration Statement on Form 10 filed on December 21, 2010).\n110\nTable of Contents\n                                                    \n \n \n10.13\n \nPerformance and Indemnity Agreement, dated as of March 30, 2011, between Huntington Ingalls Industries, Inc. and Titan II Inc. (formerly Northrop Grumman Corporation) relating to the Gulf Opportunity Zone Industrial Development Revenue Bonds (incorporated by reference to Exhibit 10.6 to the Company's Quarterly Report on Form 10-Q filed on May 11, 2011).\n10.14\n \nPerformance and Indemnity Agreement, dated as of March 30, 2011, between Huntington Ingalls Industries, Inc. and Titan II Inc. (formerly Northrop Grumman Corporation) relating to certain performance guarantees associated with certain U.S. Navy shipbuilding contracts (incorporated by reference to Exhibit 10.7 to Form 10-Q filed on May 11, 2011,  File No. 001-34910).\n10.15\n \nIngalls Guaranty Performance, Indemnity and Termination Agreement, dated as of March 29, 2011, among Huntington Ingalls Industries, Inc., Northrop Grumman Systems Corporation and Northrop Grumman Shipbuilding, Inc. (incorporated by reference to Exhibit 10.8 to Form 10-Q filed on May 11, 2011,  File No. 001-34910).\n10.16\nHuntington Ingalls Industries Supplemental Plan 2 (incorporated by reference to Exhibit 10.16 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011) and Amendment to Appendix G to the plan.\n10.17*\nSecond Amendment to Appendix G to Huntington Ingalls Industries Supplemental Plan 2-Officers Supplemental Executive Retirement Plan, as amended January 7, 2015 (incorporated by reference to Exhibit 10.1 to Form 8-K filed on December 19, 2018,  File No. 001-34910).\n10.18*\n \nHuntington Ingalls Industries ERISA Supplemental Plan (incorporated by reference to Exhibit 10.17 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.19*\n \nSeverance Plan for Elected and Appointed Officers of Huntington Ingalls Industries, as amended and restated effective January 1, 2019 (incorporated by reference to Exhibit 10.2 to Form 8-K filed on December 19, 2018,  File No. 001-34910).\n10.20*\n \nHuntington Ingalls Industries Deferred Compensation Plan (incorporated by reference to Exhibit 10.19 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.21*\n \nHuntington Ingalls Industries Savings Excess Plan (incorporated by reference to Exhibit 10.20 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.22*\nFirst Amendment to the Huntington Ingalls Industries Savings Excess Plan (incorporated by reference to Exhibit 10.1 to Form 10-Q filed on August 3, 2017,  File No. 001-34910).\n10.23*\nHuntington Ingalls Industries Officers Retirement Account Contribution Plan (incorporated by reference to Exhibit 10.21 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.24*\nHII Newport News Shipbuilding Inc. Retirement Benefit Restoration Plan (incorporated by reference to Exhibit 10.22 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.25*\nHuntington Ingalls Industries Electronic Systems Executive Pension Plan (incorporated by reference to Exhibit 10.23 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.26*\nHuntington Ingalls Industries, Inc. Special Officer Retiree Medical Plan (incorporated by reference to Exhibit 10.24 to the Company's Amendment No. 4 to Registration Statement on Form 10 filed on January 18, 2011).\n10.27*\nHuntington Ingalls Industries, Inc. 2011 Long-Term Incentive Stock Plan (incorporated by reference to Exhibit 10.25 to the Company's Amendment No. 8 to Registration Statement on Form 10 filed on March 15, 2011).\n111\nTable of Contents\n                                                    \n \n \n10.28*\nHuntington Ingalls Industries, Inc. Annual Incentive Plan, as amended and restated December 13, 2018 (incorporated by reference to Exhibit 10.3 to Form 8-K filed on December 19, 2018,  File No. 001-34910).\n10.29*\nForm of Award Certificate applicable to Non-Employee Director Stock Units Granted Under the 2011 and 2012 Long-Term Incentive Stock Plans (incorporated by reference to Exhibit 10.30 to Form 10-K filed on February 27, 2013,  File No. 001-34910).\n10.30*\nForm of Award Certificate applicable to Restricted Performance Stock Rights Granted Under the 2011 and 2012 Long-Term Incentive Stock Plans (incorporated by reference to Exhibit 10.31 to Form 10-K filed on February 27, 2014,  File No. 001-34910).\n10.31*\nForm of Award Certificate applicable to Restricted Stock Rights Granted Under the 2011 and 2012 Long-Term Incentive Stock Plans (incorporated by reference to Exhibit 10.32 to Form 10-K filed on February 27, 2014,  File No. 001-34910).\n10.32*\nForm of Award Certificate applicable to Stock Options Granted Under the 2011 and 2012 Long-Term Incentive Stock Plans (incorporated by reference to Exhibit 10.33 to Form 10-K filed on February 27, 2014,  File No. 001-34910).\n10.33*\nHuntington Ingalls Industries, Inc. 2012 Long-Term Incentive Stock Plan (incorporated by reference to Annex A to the Proxy Statement filed on April 3, 2012,  File No. 001-34910).\n10.34*\nPerformance-Based Compensation Policy of Huntington Ingalls Industries, Inc (incorporated by reference to Annex B to the Proxy Statement filed on April 3, 2012,  File No. 001-34910).\n10.35*\nHuntington Ingalls Industries, Inc. 2022 Long-Term Incentive Stock Plan (incorporated herein by reference to Annex B to the Company's definitive proxy statement filed on March 21, 2022,  File No. 001-34910).\n10.36*\nTerms and Conditions Applicable to Restricted Performance Stock Rights Granted Under the 2022 Long-Term Incentive Stock Plan, as amended\n \n(incorporated by reference to Exhibit \n10.36\n to Form 10-K filed on February \n1\n, 2024, File No. 001-34910)\n.\n10.37*\nTerms and Conditions Applicable to Ratable Vesting Restricted Stock Rights Granted Under the 2022 Long-Term Incentive Stock Plan (incorporated by reference to Exhibit 10.37 to Form 10-K filed on February \n1\n, 2024, File No. 001-34910).\n10.38*\nTerms and Conditions Applicable to Cliff Vesting Restricted Stock Rights Granted Under the 2022 Long-Term Incentive Stock Plan\n \n(incorporated by reference to Exhibit 10.3\n8\n to Form 10-K filed on February \n1\n, 2024, File No. 001-34910)\n.\n10.39*\nTerms and Conditions Applicable to Non-Employee Director Stock Units Granted Under the 2022 Long-Term Incentive Stock Plan (incorporated by reference to Exhibit 10.2 to \nForm 10-Q filed on November 2, 2023\n, File No. 001-34910\n).\n10.40*\nTerms and Conditions Applicable to Non-Employee Director Stock Grants Under the 2022 Long-Term Incentive Stock Plan, as amended (incorporated herein by reference to Exhibit 10.1 to \nForm 10-Q filed on November 2, 2023\n, File No. 001-34910\n).\n10.41*\nHuntington Ingalls Industries, Inc. Amended and Restated Directors' Compensation Policy\n \n(incorporated by reference to Exhibit 10.\n41\n to Form 10-K filed on February \n1\n, 2024, File No. 001-34910)\n.\n10.42*\nHuntington Ingalls Industries, Inc. Directors Compensation Policy--Amended and Restated Board Deferred Compensation Policy (incorporated by reference to Exhibit 10.42 to \nForm 10-K filed on February 9, 2023\n, File No. 001-34910\n).\n112\nTable of Contents\n                                                    \n \n \n10.43\nAmendment No. 1, dated April 24, 2023, to the Company’s Amended and Restated Credit Agreement, dated August 2, 2021, among Huntington Ingalls Industries, Inc., the lenders party thereto, JPMorgan Chase Bank, N.A., as administrative agent and an issuing bank, and certain other issuing banks (incorporated by reference to Exhibit 10.1 to\n Form 8-K filed on April 28, 2023\n, File No. 001-34910\n).\n10.44\nAmendment No. 1, dated April 24, 2023, to the Company’s Credit Agreement, dated August 2, 2021, among Huntington Ingalls Industries, Inc., the lenders party thereto, and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.2 to \nForm 8-K filed on April 28, 2023\n, File No. 001-34910\n).\n10.45\nSecond Amended and Restated Credit Agreement, dated September 17, 2024, among the Company, the lenders party thereto, JPMorgan Chase Bank, N.A., as administrative agent and an issuing bank and certain other issuing banks (incorporated by reference to Exhibit 10.1 to Form 8-K filed on September 17, 2024, File No. 001-34910)\n.\n19\nInsider Trading Policy.\n21.1\nList of subsidiaries of Huntington Ingalls Industries, Inc.\n22\nList of subsidiary guarantors of registered securities of Huntington Ingalls Industries, Inc.\n23.1\nConsent of Deloitte & Touche LLP.\n31.1\nCertification of the Chief Executive Officer Pursuant to Exchange Act Rule 13a-14(a)/15d-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the Chief Financial Officer Pursuant to Exchange Act Rule 13a-14(a)/15d-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertificate of the Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertificate of the Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97*\nHuntington Ingalls Industries, Inc. Compensation Recovery Policy (incorporated by reference to Exhibit 97 to Form 10-K filed on February \n1\n, 2024, File No. 001-34910).\n101\n \nThe following financial information for the company, formatted in XBRL (Extensible Business Reporting Language): (i) the Consolidated Statements of Operations and Comprehensive Income (Loss), (ii) the Consolidated Statements of Financial Position, (iii) the Consolidated Statements of Cash Flows, (iv) the Consolidated Statements of Changes in Equity, and (v) the Notes to Consolidated Financial Statements.\n104\nThe cover page from the Company's Annual Report on form 10-K, formatted in Inline XBRL and contained in Exhibit 101.\n*Indicates management contract or compensatory plan or arrangement.\nITEM 16. FORM 10-K SUMMARY\nNone.\n113\nTable of Contents\n                                                    \n \n \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 6th day of February, 2025.\nHuntington Ingalls Industries, Inc.\n/s/ Christopher D. Kastner\nChristopher D. Kastner\nPresident and Chief Executive Officer\n114\nTable of Contents\n                                                    \n \n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nSignature\nTitle\nDate\n/s/ Christopher D. Kastner\nPresident, Chief Executive Officer and Director\nChristopher D. Kastner\n(Principal Executive Officer)\nFebruary 6, 2025\n/s/ Thomas E. Stiehle\nExecutive Vice President and\nThomas E. Stiehle\nChief Financial Officer\n(Principal Financial Officer)\nFebruary 6, 2025\n/s/ Nicolas Schuck\nCorporate Vice President, Controller\nNicolas Schuck\nand Chief Accounting Officer\n(Principal Accounting Officer)\nFebruary 6, 2025\n/s/ Kirkland H. Donald\nKirkland H. Donald\nChairman\nFebruary 6, 2025\n/s/ Augustus L. Collins\nAugustus L. Collins\nDirector\nFebruary 6, 2025\n/s/ Leo P. Denault\nLeo P. Denault\nDirector\nFebruary 6, 2025\n/s/ Craig S. Faller\nCraig S. Faller\nDirector\nFebruary 6, 2025\n/s/ Victoria D. Harker\nVictoria D. Harker\nDirector\nFebruary 6, 2025\n/s/ Frank R. Jimenez\nFrank R. Jimenez\nDirector\nFebruary 6, 2025\n/s/ Anastasia D. Kelly\nAnastasia D. Kelly\nDirector\nFebruary 6, 2025\n/s/ Tracy B. McKibben\nTracy B. McKibben\nDirector\nFebruary 6, 2025\n115\nTable of Contents\n                                                    \n \n \n/s/ Stephanie L. O'Sullivan\nStephanie L. O'Sullivan\nDirector\nFebruary 6, 2025\n/s/ Thomas C. Schievelbein\nThomas C. Schievelbein\nDirector\nFebruary 6, 2025\n/s/ John K. Welch\nJohn K. Welch\nDirector\nFebruary 6, 2025\n116"
  }
}