{
  "ticker": "HLT",
  "cik": "0001585689",
  "company_name": "Hilton Worldwide Holdings Inc.",
  "filing_date": "2025-02-06",
  "accession": "0001585689-25-000008",
  "primary_doc": "hlt-20241231.htm",
  "item_sections": {
    "item1": "Item 1.        Business\nOverview\nHilton is one of the largest global hospitality companies, with 8,447\n properties comprising \n1,268,206 \nrooms in \n140 countries and territories as of December 31, 2024. Founded in 1919, Hilton has been an innovator in the industry for over 105 years, driven by the vision of founder Conrad Hilton \"to fill the earth with the light and warmth of hospitality.\" Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of December 31, 2024, we had 211 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 17 percent from December 31, 2023; refer to \"—Our Brand Portfolio\" and \"—Our Guest Loyalty Program\" below for additional information on our brands, including Hilton Honors.\nWe operate our business through: (i) a management and franchise segment and (ii) an ownership segment, each of which is reported as a segment based on (a) delivering a similar set of products and services and (b) being managed separately given its distinct economic characteristics. The management and franchise segment includes all of the hotels we manage for third-party owners, as well as all properties that license our intellectual property (\"IP\") and/or use our booking channels and related programs, and where we provide other contracted services, but the day-to-day services of the hotels are operated or managed by someone other than us. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers, strategic partner hotels and Hilton Grand Vacations Inc. (\"HGV\"); and (iii) fees for managing hotels in our ownership segment. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated owned and leased hotels. For more information regarding our segments, refer to \"—Our Business—Management and Franchise\" and \"—Our Business—Ownership\" below.\n3\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity: \nAs of or for the Year Ended December 31, 2024\nHotels\nRooms\n(1)\nHotel system\nOpenings\n(2)\n973 \n98,400 \nNet additions\n(3)\n904 \n83,000 \nDevelopment pipeline\nAdditions\n(4)\n1,432 \n154,200 \nCount as of period end\n(5)\n3,578 \n498,600 \n____________\n(1)\nRounded to the nearest hundred.\n(2)\nOpenings include 411 hotels and approximately 19,500 rooms from strategic partner hotels.\n(3)\nRepresents room additions, net of rooms removed from our system. During 2024, 409 hotels and approximately 19,400 rooms added were from strategic partner hotels. Net unit growth for the year ended December 31, 2024 was 7.3 percent.\n(4)\nAdditions include 423 hotels and approximately 20,100 rooms from strategic partner hotels.\n(5)\nThe hotels in our development pipeline were under development throughout 118 countries and territories, including 25 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nWe continue to drive customer loyalty, including participation in our Hilton Honors guest loyalty program, through: (i) our experience in the hospitality industry, which spans more than a century of customer service and entrepreneurship, and continues to evolve to meet the tastes, preferences and demands of our guests; (ii) our strong, well-defined brands that operate throughout the hospitality industry chain scales; (iii) our dedicated and collaborative workforce, built to focus on providing exceptional customer experiences; and (iv) our commercial service offerings. We believe that satisfied customers will generate additional business at our properties, yielding strong overall hotel performance for us and our hotel owners. Strong results at our existing properties will encourage further development of additional hotels under our brands and conversions of existing hotels to our brands with both (i) owners who currently have properties in our system and (ii) new owners who sign management or franchise contracts with us in the future, which further supports our growth and future financial performance. We believe that our existing hotel system and development pipeline, which will require minimal capital investment from us, positions us to further improve and grow our business, allocate capital effectively and meet our customers' demands and preferences in the future.\n4\nOur Brand Portfolio\nThe goal of each of our brands is to deliver exceptional customer experiences and superior operating performance. \nDecember 31, 2024\n(1)\nBrand\n(1)\nCountries/ Territories\nProperties\nRooms\nPercentage of Total Rooms\nSelected Competitors\n(2)\n17\n34\n8,796\n0.7%\nFour Seasons, Mandarin Oriental, Peninsula, Ritz-Carlton, \nRosewood Hotels & Resorts, St. Regis\n24\n49\n17,195\n1.4%\nJW Marriott, Intercontinental, Sofitel, Grand Hyatt, Shangri-La, Fairmont\n7\n15\n2,619\n0.2%\nLeading Hotels of the World, Legend Preferred Hotels & Resorts, Belmond, The Luxury Collection\n1\n1\n91\n—%\nFirmdale Hotels, EDITION Hotels, Rosewood Hotels, One Aldwych\n2\n4\n2,797\n0.2%\nJW Marriott, Grand Hyatt, Fairmont, Intercontinental, Omni\n13\n43\n7,581\n0.6%\nKimpton, Thompson Hotels, W Hotels, Virgin Hotels, \nThe Hoxton, SO/\n98\n617\n227,467\n17.9%\nHyatt Regency, Marriott,\n Omni, Sheraton, Westin\n44\n180\n33,734\n2.7%\nAutograph Collection, The Unbound Collection, Independent Hotels, MGallery, Kimpton\n2\n34\n5,788\n0.5%\nLe Meridien, Hyatt Centric, 25h, Hotel Indigo\n59\n695\n156,943\n12.4%\nMarriott, Crowne Plaza, Delta, Holiday Inn, Radisson, Sheraton, Wyndham\n21\n151\n17,768\n1.4%\nJoie de Vivre, Tribute Portfolio, Kimpton, Hotel Indigo, Ascend, Trademark\n8\n269\n61,974\n4.9%\nHyatt Regency, Marriott, Sheraton, Westin\n1\n4\n1,224\n0.1%\nAC Hotels, Aloft Hotels, Cambria, Hotel Indigo, Hyatt Centric\n4\n8\n1,727\n0.1%\nMAMA Shelter, CitizenM, Ace Hotels, Yotel, Freehand\n64\n1,060\n156,471\n12.3%\nAloft, Courtyard by Marriott, Four Points, Holiday Inn, Hyatt Place\n43\n3,072\n342,737\n27.0%\nComfort Suites, Courtyard by Marriott, \nFairfield Inn, Holiday Inn Express, Springhill Suites\n5\n283\n27,605\n2.2%\nBest Western, Comfort Inn, La Quinta, Sleep Inn, Wingate, Avid\n4\n96\n8,710\n0.7%\nQuality Inn, Baymont, Travelodge, Howard Johnson, Super 8, Days Inn\n4\n544\n62,319\n4.9%\nElement, Hyatt House, Residence Inn, Staybridge Suites\n3\n757\n82,515\n6.5%\nTownePlace Suites, Staybridge Suites, Hyatt Studios\n—\n—\n—\n—%\nStudioRes, Candlewood Suites, Stay Apt Suites, ECHO Suites, Extended Stay America Premiere Suites\n8\n105\n18,392\n1.5%\nDisney Vacation Club, Holiday Inn Club Vacations, \nMarriott Vacations Worldwide, \nTravel & Leisure Co.\n____________\n(1)\nExcludes 17 unbranded properties with 4,392 rooms, representing approximately 0.3% of total rooms and 409 strategic partner hotels with 19,361 rooms, representing approximately 1.5% of total rooms. Hilton Grand Vacations is inclusive of Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club.\n(2)\nThese selected competitors exclude lesser-known regional competitors. \n5\nWaldorf Astoria Hotels & Resorts\n: Waldorf Astoria Hotels & Resorts is a luxury brand with an award-winning portfolio of iconic properties with a relentless commitment to elegant service, one-of-a-kind experiences and culinary expertise in landmark destinations around the world. Waldorf Astoria hotels deliver an effortless experience seamlessly, creating a true sense of place for guests through stunning architecture and design, the signature Peacock Alley restaurant, refined art collections, Michelin-starred dining restaurants and chef partnerships and elevated in-room amenities.\nConrad Hotels & Resorts\n: Conrad Hotels & Resorts is a luxury brand that connects bold design, impactful experiences and curated contemporary art to inspire the conscientious traveler. Found in major urban centers and resort destinations, Conrad is a place where guests are empowered to explore through intuitive service and experiences that authentically connect them with local culture.\nLXR Hotels & Resorts: \nLXR Hotels & Resorts is a hand-picked collection of independent and spirited luxury properties celebrating the timeless pursuit of personal adventure. Found in alluring destinations, LXR connects legendary properties into an exclusive network of hotels that are set apart by individual design, an unrivaled commitment to personalized service and elegant, yet locally immersive, experiences for guests.\nNoMad Hotels\n: NoMad Hotels is a luxury brand that brings guests sophisticated offerings in some of the world's most sought-after locations. NoMad Hotels are both grand and intimate, creating a unique blend of luxury and lifestyle experiences throughout the stay with special touches like unique local art collections featured in each property. \nSignia by Hilton: \nSignia by Hilton is a luxury brand with a portfolio of exceptional hotels in gateway cities and resort destinations around the world. Each Signia by Hilton property infuses sophistication into every stay, offering top-tier meetings and event spaces, a vibrant atmosphere, exceptional amenities and personalized service catered to the needs of today's global traveler.\nCanopy by Hilton: \nCanopy by Hilton is an upper upscale brand that delivers elevated, boutique hotel experiences that celebrate the best of the locale. Inviting, sophisticated design, bespoke food and beverage and crafted touchpoints deliver a locally inspired, high-end and welcoming stay.\nHilton Hotels & Resorts\n: As Hilton’s flagship brand, Hilton Hotels & Resorts is the trusted global leader in hospitality. An upper upscale brand with more than 600 hotels and resorts in nearly 100 countries and territories, Hilton Hotels & Resorts continues to set the standard for the industry and upholds Conrad Hilton’s vision to fill the earth with the light and warmth of hospitality by elevating every celebration and event, creating real human connections, and immersing guests in the best of global and local cultures in the world’s most desired destinations. \nCurio Collection by Hilton\n: Curio Collection by Hilton is an upper upscale brand with a global portfolio of individually remarkable hotels hand-picked to immerse guests in one-of-a-kind moments in sought-after destinations. Each hotel in the Curio Collection evokes a bespoke story through distinctive architecture and design, world-class food and beverage and curated experiences. \nGraduate by Hilton\n: Graduate by Hilton is an upper upscale lifestyle brand of handcrafted hotels in dynamic, university-anchored towns. Each Graduate hotel brings stories and traditions to life and offers the perfect setting for game days, reunions, graduations, campus visits and more.\nDoubleTree by Hilton\n: DoubleTree by Hilton is a fast-growing global upscale brand that continues to be a symbol of comfort for business and leisure travelers around the world, offering contemporary accommodations and amenities. DoubleTree by Hilton is renowned for its warm, caring service, beginning with its signature welcome that includes the hotel’s famous original chocolate chip cookie, now available in an allergy-friendly option. The inclusive service experience offers upscale food and beverage experiences and features a variety of flexible meeting spaces for events of all sizes.\nTapestry Collection by Hilton\n: Tapestry Collection by Hilton is an upper upscale brand with a portfolio of original hotels that offer guests unique style and vibrant personality, encouraging travelers to connect to their destination and enjoy authentic off-the-beaten-path experiences. While each property is unique, every Tapestry Collection by Hilton property is united by the reliability that comes with the Hilton name.\nEmbassy Suites by Hilton\n: Embassy Suites by Hilton offers both leisure and business travelers an approachable, upper upscale experience. As a full-service hotel, every Embassy Suites provides spacious two-room suites with separate bedroom \n6\nand living room spaces, free made-to-order breakfast each morning, complimentary drinks and snacks during evening reception every night, flexible meetings and events spaces and 24-hour fitness centers.\nTempo by Hilton:\n Tempo by Hilton is an upscale, stylish and contemporary lifestyle hotel brand designed for the ambitious traveler looking to maintain a sense of balance and momentum. Tempo by Hilton offers re-imagined guest rooms designed with well-being in mind, dynamic communal spaces for collaboration or focused work, healthy cafe-style dining, a leading-edge beverage program and next-level fitness facilities.\nMotto by Hilton\n: Motto by Hilton is an upper midscale brand with an urban, lifestyle feel designed to connect guests to the center of it all – buzz-worthy spaces and the pulse of the community. Through its efficient guest rooms, lively common spaces and locally inspired food and beverage options catering to guests and locals alike, Motto is a launchpad to destinations around the globe and delivers a flexible and innovative hospitality experience through elements like first-of-its-kind connecting rooms for up to nine rooms.\nHilton Garden Inn\n: Hilton Garden Inn is an award-winning, upscale brand where guests find an open, inviting atmosphere with warm, glowing service and simple, thoughtful touches that allow them to socialize and unwind. As a recognized leader in food and beverage offerings, Hilton Garden Inn caters to guests' dining needs by serving cooked-to-order breakfast and offering handcrafted cocktails, shareable small plates and full meals at its on-site restaurants and bars. Flexible meeting space, free Wi-Fi, wireless printing and fitness centers are offered to help guests stay productive. \nHampton by Hilton\n: Hampton by Hilton is our largest brand and includes both Hampton Inn and Hampton Inn & Suites hotels, with properties located on five continents. Recognized as a leading upper midscale brand in the lodging industry, Hampton has been ranked the #1 lodging brand to franchise by Entrepreneur for 16 consecutive years. Hampton by Hilton hotels around the world provide guests high-quality and thoughtfully designed accommodations, friendly and authentic service and value-added amenities, like complimentary hot breakfast and free Wi-Fi, all backed by the 100% Hampton Guarantee.\nTru by Hilton:\n Tru by Hilton is a game-changing, midscale hotel brand where guests don't have to compromise between a consistent, fun and affordable hotel stay. Spirited, simplified and grounded in value, Tru by Hilton is designed for cross-generational appeal, with a large, reimagined public space where guests can work, play, lounge and eat. Intuitively designed modern guest rooms feature a rolling desk, oversized windows for natural light and bright, spacious bathrooms. Guests can enjoy complimentary amenities, including the build-your-own \"Top It\" breakfast bar featuring our tasty pancakes, a multifunctional fitness center and fast Wi-Fi. Premium snacks, light meal options and single-serve wine and beer are available for purchase at the 24/7 Eat. & Sip. market. \nSpark by Hilton: \nSpark by Hilton is a premium economy hotel brand at the intersection of value and consistency. Spark by Hilton provides a reliable and comfortable stay at a hotel with friendly service for every guest, all at an accessible price. Offering simple design with splashes of color and cheer, Spark by Hilton hotels provide a welcoming sense of arrival with colorful exterior statement walls and inspiring artwork. The public spaces provide multi-functional seating, from communal tables to rocking chairs, and guest rooms are comfortable and relaxing with simple, streamlined furniture. Travelers can enjoy complimentary breakfast with premium coffee and a signature bagel bar.\nHomewood Suites by Hilton\n: Homewood Suites by Hilton is an upscale, award-winning, all-suites, extended-stay hotel brand that delivers the comforts of home. This brand offers home-like accommodations for guests and their pets traveling for an extended stay or quick overnight trip. Guests enjoy inviting, generous-sized suites featuring separate living and sleeping areas and fully equipped kitchens with full-size refrigerators as well as value-driven amenities including free breakfast and complimentary evening receptions every week.\nHome2 Suites by Hilton\n: Home2 Suites by Hilton is an upper midscale, all-suites, award-winning extended-stay hotel brand offering stylish accommodations with flexible guest room configurations and home-like amenities. With a focus on environmentally friendly products and hotel operations, Home2 Suites by Hilton offers laundry and fitness areas, outdoor spaces, pet-friendly environments and complimentary breakfast.\nLivSmart Studios by Hilton: \nLivSmart Studios by Hilton is a midscale, long-stay hotel brand for guests looking for comfortable apartment-style accommodations for 10 nights or more. Offering simplicity, consistency and convenience, LivSmart Studios by Hilton will create a space where guests can seamlessly maintain their daily routines while also immersing themselves in the local community. In addition to studio suites with ample storage space and fully equipped kitchens, the hotel will feature a streamlined public area filled with natural light that includes a retail market, a large guest laundry room and a state-of-the-art fitness center. There will also be a spacious outdoor gathering area and comfortable seating for guests looking to \n7\nconnect. LivSmart Studios' pioneering vision for transforming the extended-stay segment is credited with Hilton’s recognition as one of Fast Company’s 2024 Most Innovative Companies. We expect to open our first LivSmart hotel in 2025 and as of December 31, 2024 had over 75 hotels in our development pipeline.\nHilton Grand Vacations\n: Our timeshare brands, including Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club, are premier vacation ownership brands known for delivering a consistently exceptional standard of service, maximum flexibility for members and guests and elegant, family-friendly resorts in desirable locations around the world. Signature elements include spacious, well-appointed accommodations and resorts with extensive on-site amenities. A special points-based reservation system gives owners the flexibility to vacation when, where and how they prefer. HGV has the exclusive right to use our timeshare brands, subject to the terms of a long-term license agreement with us.\nOur Guest Loyalty Program\nHilton Honors\n \nis our award-winning guest loyalty program that supports our portfolio of brands. The program generates significant repeat business by rewarding guests with points for each stay at our owned, leased, managed, franchised and timeshare properties, as well as each stay at strategic partner hotels when the stay is reserved through our booking channels, which are then redeemable for free or discounted room nights at our properties and other goods and services. Hilton Honors members can also use points earned to transact with strategic partner hotels as well as many strategic partners, including credit card providers, such as American Express, airlines, rail and car rental companies, Amazon, Lyft and others. Hilton Honors members who book through preferred Hilton channels also have access to instant benefits, including a flexible payment slider that allows members to choose nearly any combination of points and money to book a stay, an exclusive member discount and free standard Wi-Fi. Members also have access to contactless technology exclusively through the Hilton Honors app, where members can check in, choose their room and access their room using Digital Key. The program provides targeted marketing, promotions and customized guest experiences to 211 million members. Affiliation with our loyalty program encourages members to allocate more of their travel spend to our hotels. The percentage of travel spend we capture from loyalty members increases as they move up the tiers of our program. The program is funded by contributions from eligible revenues generated by Hilton Honors members and collected from properties in our system, as well as our strategic partnerships. The funds collected by the Hilton Honors program are subsequently applied to reimburse properties and strategic partners for Hilton Honors points redemptions by loyalty members and to pay for administrative expenses and marketing initiatives that support the program. \n8\nOur Business\nAs of December 31, 2024, our existing system included the following properties and rooms, by type, brand and region:\nOwned / Leased\n(1)\nManaged\nFranchised / Licensed\nTotal\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nWaldorf Astoria Hotels & Resorts\n2 \n463 \n32 \n8,333 \n— \n— \n34 \n8,796 \nConrad Hotels & Resorts\n2 \n779 \n43 \n13,920 \n4 \n2,496 \n49 \n17,195 \nLXR Hotels & Resorts\n— \n— \n7 \n1,155 \n8 \n1,464 \n15 \n2,619 \nNoMad\n— \n— \n1 \n91 \n— \n— \n1 \n91 \nSignia by Hilton\n— \n— \n4 \n2,797 \n— \n— \n4 \n2,797 \nCanopy by Hilton\n— \n— \n11 \n1,850 \n32 \n5,731 \n43 \n7,581 \nHilton Hotels & Resorts\n46 \n15,896 \n298 \n127,317 \n273 \n84,254 \n617 \n227,467 \nCurio Collection by Hilton\n— \n— \n27 \n6,055 \n153 \n27,679 \n180 \n33,734 \nGraduate by Hilton\n— \n— \n— \n— \n34 \n5,788 \n34 \n5,788 \nDoubleTree by Hilton\n— \n— \n170 \n46,265 \n525 \n110,678 \n695 \n156,943 \nTapestry Collection by Hilton\n— \n— \n5 \n694 \n146 \n17,074 \n151 \n17,768 \nEmbassy Suites by Hilton\n— \n— \n40 \n10,551 \n229 \n51,423 \n269 \n61,974 \nTempo by Hilton\n— \n— \n1 \n661 \n3 \n563 \n4 \n1,224 \nMotto by Hilton\n— \n— \n— \n— \n8 \n1,727 \n8 \n1,727 \nHilton Garden Inn\n— \n— \n126 \n24,736 \n934 \n131,735 \n1,060 \n156,471 \nHampton by Hilton\n— \n— \n53 \n8,549 \n3,019 \n334,188 \n3,072 \n342,737 \nTru by Hilton\n— \n— \n— \n— \n283 \n27,605 \n283 \n27,605 \nSpark by Hilton\n— \n— \n— \n— \n96 \n8,710 \n96 \n8,710 \nHomewood Suites by Hilton\n— \n— \n8 \n1,020 \n536 \n61,299 \n544 \n62,319 \nHome2 Suites by Hilton\n— \n— \n2 \n210 \n755 \n82,305 \n757 \n82,515 \nStrategic partner hotels\n(2)\n— \n— \n— \n— \n409 \n19,361 \n409 \n19,361 \nOther\n(3)\n— \n— \n3 \n1,087 \n14 \n3,305 \n17 \n4,392 \nTotal hotels\n50\n \n17,138\n \n831\n \n255,291\n \n7,461\n \n977,385\n \n8,342\n \n1,249,814\n \nHilton Grand Vacations\n(4)\n— \n— \n— \n— \n105 \n18,392 \n105 \n18,392 \nTotal system\n50\n \n17,138\n \n831\n \n255,291\n \n7,566\n \n995,777\n \n8,447\n \n1,268,206\n \nOwned / Leased\n(1)\nManaged\nFranchised / Licensed\nTotal\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nProperties\nRooms\nU.S.\n— \n— \n187 \n81,173 \n5,700 \n735,705 \n5,887 \n816,878 \nAmericas (excluding U.S.)\n1 \n405 \n70 \n17,819 \n393 \n54,446 \n464 \n72,670 \nEurope\n39 \n11,579 \n111 \n27,920 \n665 \n83,727 \n815 \n123,226 \nMiddle East & Africa\n4 \n1,991 \n112 \n31,153 \n36 \n5,796 \n152 \n38,940 \nAsia Pacific\n6 \n3,163 \n351 \n97,226 \n667 \n97,711 \n1,024 \n198,100 \nTotal hotels\n50\n \n17,138\n \n831\n \n255,291\n \n7,461\n \n977,385\n \n8,342\n \n1,249,814\n \nHilton Grand Vacations\n(4)\n— \n— \n— \n— \n105 \n18,392 \n105 \n18,392 \nTotal system\n50\n \n17,138\n \n831\n \n255,291\n \n7,566\n \n995,777\n \n8,447\n \n1,268,206\n \n____________\n(1)\nIncludes hotels owned or leased by entities in which we own a noncontrolling financial interest.\n(2)\nIncludes hotels that are included in our booking channels and participate in the Hilton Honors guest loyalty program through strategic partnership arrangements.\n(3)\nIncludes other hotels in our system that are not distinguished by a specific Hilton brand. \n(4)\nIncludes properties under timeshare brands including Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club.\n9\nManagement and Franchise\nWe manage hotels and license our brands through our management and franchise segment. This segment generates its revenue primarily from fees charged to hotel owners under management and franchise contracts, as well as from fees associated with license agreements, which include arrangements with strategic partner hotels. We grow our management and franchise business by attracting owners to become a part of our system and participate in our commercial services to support their properties. Our management and franchise contracts provide significant return on investment for us as we earn and collect fees.\nHotel Management\nOur core management services consist of operating hotels under management contracts for the benefit of third parties who either own or lease the hotels and the associated personal property. Often, particularly in the U.S., we employ the individuals working at these locations. Terms of our management contracts vary, but our fees generally consist of a base management fee, which is generally based on a percentage of the hotel’s monthly gross operating revenue, and, when applicable, an incentive management fee, which is generally based on a percentage of the hotel's operating profits, normally over a one calendar year period, and, in some cases, may be subject to a stated return threshold to the hotel owner. In general, the owner pays all operating and other expenses and reimburses any of our out-of-pocket expenses. In turn, our managerial discretion is subject to approval by the owner in certain major areas, including the approval of annual operating and capital expenditure budgets and, in most instances, the appointment of certain key personnel. Additionally, the owners generally pay monthly program fees based on the underlying hotel's sales or usage, as reimbursement for the costs related to our: (i) advertising and marketing programs; (ii) internet, technology and reservation systems; and (iii) quality assurance programs. Owners are also responsible for various other fees and charges, including payments for participation in our Hilton Honors guest loyalty program, training, consultation and procurement of certain goods and services. As of December 31, 2024, we m\nanaged\n 831 hotels with 255,291 \nr\nooms, which does not include hotels in our ownership segment. \nThe initial terms of our management contracts are typically 20 to 30 years. In certain cases, we are both the franchisor and manager of the hotel, when we enter into a franchise contract in addition to the management contract, and, in these cases, we classify the hotel as managed in our system. Extension options for our management contracts are negotiated and vary, but typically are more prevalent in full service hotels. Generally, these contracts contain one or two extension options that are for either five or 10 years and can be exercised at our or the hotel owner's option or by mutual agreement, as specified by the contract.\nSome of our management contracts provide early termination rights to hotel owners upon certain events, including the failure to meet certain financial or performance criteria. Performance test measures typically are based upon the hotel’s performance individually and/or in comparison to specified competitive hotels. We often have an optional cure right to pay an amount equal to the performance shortfall over a specified period, although in some cases our cure rights are limited. \nFranchising\nWe license our IP, including our brand names, trademarks and service marks, and our operating systems to hotel owners under franchise contracts. We do not own, manage or operate franchised properties, do not employ the individuals working at these properties and do not have any legal responsibility for the employees or the liabilities associated with operating these properties. We conduct periodic inspections of our franchised hotels to ensure that brand standards that we establish are maintained. For newly franchised hotels, including both new construction and conversions of existing hotels outside of our system, we approve the location, as well as the plans for the facilities, to ensure the hotels meet our brand standards. For existing franchised hotels, we provide franchisees with property improvement plans that must be completed to keep the hotels in compliance with our brand standards, so that they can remain in our hotel system.\nEach franchisee pays us an application, initiation or other fee in conjunction with the inception of a franchise contract. Franchisees also pay a royalty fee, generally based on a percentage of the hotel’s monthly gross room revenue and, in some cases, may also include a percentage of gross food and beverage revenues and other revenues, as applicable. Additionally, franchised properties generally pay monthly program fees based on the underlying property's sales or usage, as reimbursement for the costs related to our: (i) advertising and marketing programs; (ii) internet, technology and reservation systems; and (iii) quality assurance programs. They are also responsible for various other fees and charges, including payments for participation in our Hilton Honors guest loyalty program, training, consultation and procurement of certain goods and services. We also earn license fees from license agreements with strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV. As of December 31, 2024, including timeshare properties and strategic partner hotels, we franchised or licensed 7,566 hotels and resorts with 995,777 rooms.\n10\nOur franchise contracts typically have initial terms of approximately 20 years for new hotels and approximately 10 to 20 years for hotels converting from hotels outside of our system. At the expiration of the initial term, we may relicense the hotel to the franchisee, at our or the hotel owner's option or by mutual agreement, for an additional term generally ranging from 10 to 15 years. We have the right to terminate a franchise contract upon specified events of default, including nonpayment of fees or noncompliance with brand standards. If a franchise contract is terminated by us because of a franchisee’s default, the franchisee is contractually required to pay us liquidated damages.\nOwnership\nAs a hotel owner and lessee, we focus on maximizing cost efficiency and profitability of the portfolio by, among other things, maximizing hotel revenues, implementing cost-effective labor management practices and systems and reducing fixed costs. Through our disciplined approach to hotel and asset management, we develop and execute on strategic plans for each of our hotels to enhance their competitive position and we invest in renovating guest rooms and public spaces and adding or enhancing meeting and retail space for properties where we believe such investments will improve profitability. As of December 31, 2024, the ownership segment included 50 hotels totaling 17,138 rooms, comprising 43 hotels that we leased, two hotels that were each leased by a consolidated variable interest entity (\"VIE\") and five hotels owned or leased by unconsolidated affiliates. \nCorporate Responsibility\nHilton strives to create long-term value for all our stakeholders and strengthen the resilience of our business while also advancing responsible travel and tourism globally through our Travel with Purpose strategy. As one of the world’s largest hospitality companies, Hilton recognizes its responsibility to create positive environmental and social impacts across our operations, supply chain and communities to ensure our properties and surrounding communities remain vibrant and resilient for generations of travelers to come. We have established and maintain a governance structure that supports our strategy by overseeing the management of the business in a manner consistent with the best interests of Hilton and our stakeholders. \nWe continue to make progress towards our Travel with Purpose goals, including: (i) building a more sustainable future through destination stewardship and well-defined targets for emissions, water and waste; (ii) supporting positive social impact by advancing careers, communities and responsible conduct; and (iii) advancing and measuring our goals with integrity and transparency through our company policies and reporting mechanisms. \nOur efforts are supported by a governance structure that is designed to ensure the objectives are an important part of our business and strategic priorities. Our executive committee receives at least quarterly updates on our Travel with Purpose programs and progress, and one of the three standing committees of Hilton's board of directors also receives quarterly reports on this progress, reviews and assesses our related strategy and makes recommendations to the board and management as appropriate. The board of directors also receives annual updates on our Travel with Purpose strategy and impact.\nLightStay is our proprietary system for measuring and reporting our progress toward our Travel with Purpose goals. Our properties track energy, water, waste and associated utility cost reduction projects under way, as well as community volunteerism and charitable donations. Robust reports inform our properties of their progress on a regular basis.\nThe Hilton Global Foundation supports nonprofits and local community organizations that serve as partners to amplify our positive environmental and social impact around the world. The Hilton Global Foundation, created in 2019, is our primary international philanthropic arm and is registered as a U.S.-based 501(c)(3) charitable organization. In 2024, the Hilton Global Foundation announced $5.3 million in grants to support environmental sustainability, hospitality career development, and community resilience. \nMore details about our Travel with Purpose goals and our progress toward them are reported annually in our Travel with Purpose Report, available at cr.hilton.com.\n11\nEnvironmental Impact\nWe remain focused on our goal of reducing emissions, water and waste intensity at the hotels we operate. These efforts are supported by utility cost savings measures including HVAC controls, building automation system technologies and turnkey LED lighting, fueled by utility incentives wherever possible, to strengthen the return on investment and deliver cost savings to owners and enhance the guest experience. We also continued to create resources that will help facilitate the efficient operation of our hotels and take steps to increase our sourcing of renewable electricity at our hotels around the world. Additionally, through our Meet with Purpose offering, we partner with our corporate customers to quantify and plan sustainable meetings by providing them, upon request, with reporting that estimates emissions for their event, as well as options to reduce those estimated emissions.\nSocial Impact\nWith a presence in 140 countries and territories, we use our global scale to be an engine of opportunity by positively impacting our communities through local support and volunteering, creating learning and career growth opportunities, disaster relief and other economic support initiatives.\nDuring 2024, Hilton and the Hilton Global Foundation supported our hotel teams and surrounding communities through disasters and crises, including the floods in Brazil and Hurricanes Helene and Milton that devastated parts of the southeastern U.S. This included making a series of contributions to World Central Kitchen, supporting the delivery of meals to those in need. \nHilton also remains committed to combating human trafficking, and we require all hotel-based employees to complete an annual training on identifying signs of trafficking. We partner with PACT, an organization dedicated to reducing trafficking and exploitation, to help prevent trafficking, and similarly collaborate on human rights initiatives through the World Sustainable Hospitality Alliance, World Travel and Tourism Council, American Hotel & Lodging Association (\"AHLA\") and United Kingdom (\"U.K.\") Stop Slavery Hotel Industry Network. The Hilton Global Foundation continues to support the AHLA Foundation's No Room for Trafficking Survivor Fund, which aims to equip community-based organizations to engage and support trafficking survivors. \nAt Hilton, we prioritize responsible sourcing by requiring suppliers to comply with the standards in our Hilton Responsible Sourcing Policy, which include integrity and fair dealing, human rights, protecting personal and business information, commitment to the environment and providing a safe and healthy work environment.\nSee \"—Human Capital Management—Career Opportunities, Development and Training\" below for information on learning and career growth opportunities.\nHuman Capital Management\nAs of December 31, 2024, we employed or managed approximately 181,000 individuals at our owned, leased and managed hotels and corporate offices. There were approximately 311,000 additional individuals employed by third-party owners working at our franchised properties.\nOur human capital management strategy focuses on attracting, developing and retaining the best talent in the industry, and our executive committee reviews talent strategy and succession plans on a quarterly basis to assess current and future talent needs. We want to build a strong employee-centered culture that creates connectivity, camaraderie and trust among all employees, which then supports our employees to deliver positive experiences to guests at our hotels. Hilton's commitment to building strong culture focuses on creating a workplace that offers strong growth opportunities and is driven by purpose and earned Hilton recognition by Fortune magazine and Great Place to Work as the 2024 #2 World's Best Workplace and top hospitality company in the world for the eighth consecutive year.\nDuring the year ended December 31, 2024 we saw improvements in workforce stability, with both hiring and retention volumes normalizing in comparison to pre-pandemic levels. We continue to review our benefits and programmatic offerings to ensure we remain competitive, are investing in our employees' development and well-being and are enhancing our recruiting strategies to tap into new pools of talent.\n12\nCompensation and Benefits\nHilton offers competitive pay and benefits to its employees, including a variety of compensation programs and comprehensive benefit programs. We regularly review pay parity across various workforce segments as part of our ongoing talent processes. Through our employee stock purchase plan, eligible employees can purchase Hilton stock through after-tax payroll deductions at a 15 percent discount from the market stock price. \nAs of December 31, 2024, approximately 25 percent of people employed or managed by us globally and approximately 40 percent of people working in the U.S. were covered by various collective bargaining agreements that generally address pay rates, working hours, other terms and conditions of employment, certain employee benefits and orderly settlement of labor disputes.\nOur benefits and programs include paid time off, parental leave, adoption assistance, subsidized health insurance, education assistance, flexible work arrangements and Go Hilton travel programs, which make discounted rooms available to hotel and corporate employees, as well as their families and friends.\nOur medical and mental health care programs include a global platform focused on caregiving that provides resources for employee self-care, as well as enabling employees to care for others, including sick, disabled or elderly family members, children and pets; a concierge service supporting eligible employees with logistical and administrative tasks related to caregiving; education, training and resources on substance use disorders to eligible employees; an Employee Assistance Program; and parental and bereavement leave and education resources for expecting and new parents.\nWe regularly survey our employees to monitor levels of engagement, trust, and management effectiveness, among other targeted topics, and use their feedback to inspire program enhancements and new offerings. We strive to maximize employee retention and minimize attrition with these and other measures. Approximately 32 percent of our U.S. employees have been with Hilton for at least 10 years. \nCareer Opportunities, Development and Training\nWe take a broad, long-term and business-aligned approach to develop a dedicated and collaborative workforce to better serve our guests. Our Pathway Programs help foster economic mobility in the communities in which we operate and create a more robust talent pipeline for our business drawing from underrepresented groups including veterans, which consists of individuals who have served in the military and the caregivers and spouses of those who have served in the military, as well as people with disabilities and displaced persons.\nThe advancement of our employees is important to us and we provide them with robust learning and development opportunities, as well as mentorship opportunities to corporate employees at all levels. We are focused on providing opportunities for the internal movement of our employees and the promotion from entry level positions into management positions at our hotels or corporate offices across the organization. Our career development approach emphasizes customized experiences so that employees can follow a training and career path best suited to their goals including a wide array of general business, industry or function-specific technical skills and leadership development courses and programs.\nOur leadership development programs aim to build leadership skills through structured levels of self-paced learning and live facilitated sessions with focus areas of leading self, leading individuals and leading teams. Additionally, our People Leader Essential training offers a self-paced curriculum to employees, with content on key leadership topics, including effective communication, delegation, prioritization, coaching and talent development to support current, new and future people leaders at Hilton. One of our targeted programs for developing General Managers (“GMs”), GM Academy, is centered on nine core GM business capabilities, some of which include leadership and people management, asset management, customer engagement and commercial performance. Additionally, Hilton's global Signature Leadership Development programs and mentorship programs focus on building effective leaders across the enterprise to grow our leadership bench strength. These programs provide opportunities for participants to develop key competencies, network with and learn from senior leaders and enhance business acumen.\nGovernance, Ethics and Regulatory Compliance\nAs a core underpinning of our entire organization, our board of directors oversees our ethics and compliance program, which requires all Hilton employees to conduct themselves at the highest standards with respect to all ethics and compliance matters. Our Code of Conduct establishes a set of global business principles, with our compliance organization, training, risk \n13\nmanagement and monitoring activities tailored to address unique risks by geography, business line, function and level. Our Code of Conduct is supported by robust compliance policies addressing risk areas such as corruption, trade sanctions, insider trading, privacy, confidential information, antitrust and escalation of concerns. Our legal and compliance training program, which is an annual requirement for all of our employees, conveys consistent compliance standards across the organization in formats designed to target different knowledge levels, learning styles and functional needs. Our annual training calendar includes mandatory training and supplemental training that is supported by periodic company-wide awareness campaigns highlighting Hilton-specific risks and scenarios.\nIn governing the physical safety of our properties and teams, to help ensure the safety and security of our employees and guests, we constantly monitor threats and incidents around the world through online tools and external networks and partnerships; support our properties globally with crisis alert communications, crisis plans and area crisis teams; provide employees with safety and security training resources; and conduct safety and security audits annually using a risk-based approach.\nOur legal compliance team administers a third-party risk management program so that we understand the qualifications, reputation and associations of third parties with whom we transact, particularly third parties who interface with government officials and third parties who act in Hilton’s name, such as owners of our hotels. The third-party risk management program includes due diligence, education materials for third parties, ongoing monitoring of relationships and appropriate contract audit and termination rights. Our legal compliance team also monitors a comprehensive and confidential reporting tool to assist management and employees in addressing fraud, abuse and other misconduct in the workplace. The Audit Committee of our board of directors receives regular updates from our legal compliance team on third-party risk and information from our confidential reporting tool.\nCompetition\nWe encounter active and robust competition as a hotel and resort manager, franchisor, owner and lessee. Competition in the hospitality industry is based on several criteria, generally including: the attractiveness of the facility; location; level of service; quality of accommodations; amenities; food and beverage options and outlets; public and meeting spaces and other guest services; consistency of service; room rate; brand reputation; and the ability to earn and redeem loyalty program points through a global system. Our properties and brands compete with other hotels, resorts, motels, inns and other accommodation rental services in their respective geographic markets or customer segments, including facilities owned by local interests, individuals, national and international chains, institutions, investment and pension funds and real estate investment trusts (\"REITs\"). We believe that our capabilities as a multi-branded manager, franchisor, owner and lessee of hotels with an associated global, system-wide guest loyalty program and commercial platform help us continue to maintain our position as one of the largest and most geographically diverse hospitality companies in the world. \nOur principal competitors include other branded and independent hotel operating companies, national and international hotel brands and ownership companies. While local and independent brand competitors vary, on a global scale, our primary competitors are Accor S.A., Choice Hotels International, Hongkong and Shanghai Hotels, Hyatt Hotels Corporation, Intercontinental Hotel Group, Marriott International, Radisson Hotel Group and Wyndham Hotels & Resorts.\nSeasonality\nThe hospitality industry is seasonal in nature. The periods during which our properties experience higher or lower levels of demand vary from property to property, depending principally upon their location, type of property and competitive mix within the specific location. Based on historical results, we generally expect our revenues to be lower in the first quarter of each year than in each of the three subsequent quarters.\nCyclicality\nThe hospitality industry is cyclical, and demand generally follows, on a lagged basis, key macroeconomic indicators. There is a history of increases and decreases in the development and supply of and demand for hotel rooms, occupancy levels and room rates realized by hotel owners through economic cycles. The combination of changes in economic conditions and in the supply of hotel rooms can result in significant volatility in results for owners and managers of hotel properties. The costs of running a hotel, including personnel costs, rent, property taxes, insurance and utilities, tend to be more fixed than variable. As a result of such fixed costs, in a negative economic environment, the rate of decline in earnings can be higher than the rate of decline in revenues.\n14\nIntellectual Property\nIn the highly competitive hospitality industry in which we operate, trademarks, service marks, trade names, logos and patents are very important to the success of our business. We have a significant number of trademarks, service marks, trade names, logos, patents and pending registrations and expend significant resources each year on surveillance, registration and protection of our IP, which we believe has become synonymous in the hospitality industry with a reputation for excellence in service and authentic hospitality.\nGovernment Regulation\nOur business is subject to various foreign and U.S. federal and state laws and regulations, including laws and regulations that govern the offer and sale of franchises, many of which impose substantive requirements on franchise contracts and require that certain materials be registered before franchises can be offered or sold in a particular jurisdiction.\nIn addition, a number of states regulate the activities of hospitality properties and restaurants, including safety and health standards, as well as the sale of liquor at such properties, by requiring licensing, registration, disclosure statements and compliance with specific standards of conduct. Operators of hospitality properties also are subject to laws governing their relationship with employees, including minimum wage requirements, overtime, working conditions and work permit requirements. Our franchisees are responsible for their own compliance with laws, including with respect to their employees, minimum wage requirements, overtime, working conditions and work permit requirements. Compliance with, or changes in, these laws could reduce the revenue and profitability of our properties and could otherwise adversely affect our operations.\nWe also manage hotels with casino gaming operations as part of or adjacent to the hotels, which are typically managed and operated by third parties. If we manage and operate the casinos, we employ third-party compliance consultants and service providers and hold and maintain the casino gaming license. As a result, our business operations at such facilities are subject to the licensing and regulatory control of the local regulatory agency responsible for gaming licenses and operations in those jurisdictions.\nFor additional information on government regulation, including environmental regulations and requirements, refer to \"Part I—",
    "item1a": "Item 1A. Risk Factors,\" specifically the risks titled \"Failures in, material damage to or interruptions in our information technology systems, software or websites, including as a result of cyber-attacks on our systems or systems operated by third parties that provide operational and technical services to us, costs associated with protecting the integrity and security of personal data and other sensitive information and difficulties in updating our existing software or developing or implementing new software could have a material adverse effect on our business or results of operations\" and \"Cyber-attacks could have a disruptive effect on our business,\" the sophistication of cyber threats continues to increase, and the preventative actions we take to reduce the risk of cyber incidents and protect our systems and information may be insufficient. Accordingly, no matter how well designed or implemented our controls are, we will not be able to anticipate all security breaches, and we may not be able to implement effective preventive measures against such security breaches in a timely manner.\n \n34",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nCybersecurity Governance\nHilton has a dedicated Global Information Security team (collectively, the \"GIS team\") led by our \nChief Information Security Officer (\"CISO\")\n that is responsible for identifying, assessing, monitoring, managing and communicating the Company's cybersecurity risks.\n The GIS team is organized into five functional areas: (i) cloud, network and infrastructure architecture security; (ii) application security; (iii) incident response; (iv) endpoint security and vulnerability management; and (v) governance, risk and compliance (\"GRC\"). \nCollectively, the GIS team has decades of dedicated cybersecurity experience with personnel certified in various disciplines, including data privacy, enterprise risk management, cloud security and ethical hacking.\n \nWhile the full board of directors has overall responsibility for risk oversight, for cyber security matters, it is supported by its Audit Committee, \nwhich regularly reports to the full board of directors\n.\n \nThe Audit Committee assists the board of directors in monitoring cybersecurity risk by receiving quarterly reports and as needed updates from the Chief Information Officer and the CISO, that cover, among other things, our information security framework, threat assessment, response readiness and training efforts. \nHilton has adopted a Cybersecurity Policy that requires all employees to immediately report a potential cybersecurity incident to the GIS team, and all employees are required to certify their understanding of the Cybersecurity Policy on an annual basis. Our Global Cybersecurity Incident Response Plan (\"CIRP\") includes the criteria for determining if a cybersecurity incident is considered a qualifying cybersecurity incident (\"QCI\"), which requires management escalation and review, identifies the first response team and the leadership team responsible for supervising the response and provides guidelines for when and how to communicate such incident to the appropriate members of management and the Audit Committee.\n \nCybersecurity Strategy and Risk Management \nThe GIS team leverages several mechanisms to continuously identify and assess cybersecurity risks across the Company and utilizes a GRC platform to monitor identified risks and mitigation and remediation activities. The GIS team uses defined industry accepted risk management and controls frameworks to determine the potential likelihood and impact of each risk. Monitoring activities are designed and executed based on the materiality of the assessed likelihood and magnitude of impact of the risks that are identified.\n The GIS team, \nwith the assistance of third-party consultants\n, performs application security reviews, penetration tests and gap assessments against certain cybersecurity frameworks. Management reviews any assessments performed by the third-party consultants and determines the final evaluations and communication plan, which the GIS team executes.\n \nIn the event of a reported potential cybersecurity incident, a first response team, which includes leaders of the GIS team, other members of management and the legal team, determines without undue delay whether it is a QCI as defined in the CIRP. If an incident is determined to be a QCI, the process included in the CIRP is initiated and such incident is communicated to the designated leadership team, including Hilton's general counsel. Further, appointed leaders collaborate on determining if the incident is material, as well as the resulting response, including any legal and financial reporting obligations of the Company. Information also is provided to additional members of senior management as appropriate. The remediation plan for the QCI is entered within Hilton's GRC platform and monitored and reviewed at least monthly to ensure effective implementation; depending upon the type of incident, additional reporting may be produced and monitored by the GIS team to ensure the effectiveness of the remediation plan. All cybersecurity incidents are tracked within our incident response platform, regardless of the potential materiality of the impact.\nWe also have a process in place to manage cybersecurity risks associated with third-party service providers. However, we rely on the third parties we use to implement security programs commensurate with their risk, and we cannot ensure in all circumstances that their efforts will be successful.\n33\nAs of the date of this report, we are not aware of any cybersecurity threats that have materially affected or are reasonably likely to materially affect the Company, including our business strategy, results of operations or financial condition.\n However, as discussed under \"Part I—"
  }
}