{
  "ticker": "HOLX",
  "cik": "0000859737",
  "company_name": "HOLOGIC INC",
  "filing_date": "2025-11-18",
  "accession": "0000859737-25-000072",
  "primary_doc": "holx-20250927.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOverview\nWe are a developer, manufacturer and supplier of premium diagnostics products, medical imaging systems, and surgical products focused on women’s health and well-being through early detection and treatment. We sell and service our products through a combination of direct sales and service personnel and a network of independent distributors and sales representatives. We operate in four segments: Diagnostics, Breast Health, GYN Surgical and Skeletal Health. \nThrough our Diagnostics segment, we offer a wide range of diagnostic products, which are used primarily to aid in the screening and diagnosis of human diseases. Our primary Diagnostics products include our molecular diagnostic assays, which run on our advanced instrumentation systems (Panther and Panther Fusion), our cytology systems, including the ThinPrep System, and the Genius Digital Diagnostics System, and the Rapid fFN Test. Our Aptima family of molecular diagnostic assays is used to detect, among other things, the infectious microorganisms that cause common sexually transmitted diseases, or STDs, such as chlamydia and gonorrhea, or CT/NG; certain high-risk strains of human papillomavirus, or HPV;\n Trichomonas vaginalis\n, the parasite that causes trichomoniasis; Mycoplasma genitalium; and Herpes Simplex viruses 1 and 2. We also offer viral load tests for the quantitation of Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, or HIV-1, and human cytomegalo virus, or CMV, for use on our Panther instrument system. In addition, we offer bacterial vaginosis and candida vaginitis assays, or BV/CV, for the diagnosis of vaginitis, a common and complex ailment affecting millions of women a year. Our assay portfolio also includes diagnostic tests for a range of acute respiratory infections, including SARS-CoV-2, various strains of influenza and parainfluenza, and respiratory syncytial virus, as well as a test for the detection of Group B Streptococcus, or GBS, as well as two assays that detect several bacterial gastrointestinal (GI) pathogens that commonly cause acute gastroenteritis; all of which are run on the Panther Fusion system, a field upgradeable instrument addition to the base Panther system. We also offer two CE-marked molecular assays, the Panther Fusion EBV Quant assay for quantitation of Epstein-Barr virus, and the Panther Fusion BKV Quant assay for quantitation of the BK virus. These two assays are the first quantitative real-time PCR assays on the Panther Fusion system, and, together with the Aptima CMV Quant assay, comprise our menu of transplant monitoring assays. The ThinPrep System and the Genius Digital Diagnostics System are primarily used in cytology applications, such as cervical cancer screening, and the Rapid fFN Test assists physicians in assessing the risk of pre-term birth. We also generate service revenues from our CLIA-certified laboratory for testing related to breast cancer using our Breast Cancer Index or BCI test. The open access functionality on the Panther Fusion system allows customers to consolidate lab developed tests (LDTs) and in vitro diagnostic (IVD) assays on the same fully-automated, sample-to-result system.\nOur Breast Health segment offers a broad portfolio of solutions for breast imaging, biopsy, breast surgery and pathology. These solutions include 3D digital mammography systems, image analysis software utilizing artificial intelligence, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology systems. Our most advanced breast imaging platforms, Selenia Dimensions and 3Dimensions systems, utilize tomosynthesis to produce 3D images that show multiple contiguous slice images of the breast. \nOur GYN Surgical products include our MyoSure hysteroscopic tissue removal system, our NovaSure endometrial ablation system, our Fluent fluid management system, our Sonata transcervical radiofrequency ablation system, our Acessa ProVu laparoscopic radiofrequency ablation system, and our CoolSeal vessel sealing portfolio and our JustRight surgical stapler. The MyoSure suite of devices offers four options to provide incision-less removal of fibroids, polyps, and other pathology within the uterus. The NovaSure portfolio is comprised of the NovaSure ADVANCED device and the NovaSure V5 device for the treatment of abnormal uterine bleeding. The Fluent and Fluent Pro fluid management systems provide liquid distention during diagnostic and operative hysteroscopic procedures. The Sonata system uses transcervical, intrauterine ultrasound guidance to treat a wide range of fibroid types without the need for incisions. The Acessa ProVu system is a fully integrated system that uses laparoscopic ultrasound, guidance mapping and radiofrequency ablation to treat nearly all types of fibroids. The CoolSeal portfolio includes the CoolSeal Trinity, CoolSeal Reveal, and CoolSeal Mini advanced bipolar vessel sealing devices. The JustRight 5 mm stapler features a smaller instrument profile and is used for laparoscopic general and pediatric surgery.\nOur Skeletal Health segment’s products include the Horizon DXA, a dual energy x-ray system, which evaluates bone density and performs body composition assessments, and the Fluoroscan Insight FD mini C-arm, which assists in performing minimally invasive orthopedic surgical procedures on a patient’s extremities, such as the hand, wrist, knee, foot, and ankle. Effective in fiscal 2026, we are discontinuing the sale of our Fluoroscan Insight FD systems.\nUnless the context otherwise requires, references to “we”, “us”, “Hologic” or “the Company” refer to Hologic, Inc. and its consolidated subsidiaries. \n5\nTable of Contents\nAvailable Information\nOur internet website address is \nwww.hologic.com\n. Through our website, we make available, free of charge, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports, as well as proxy statements, and, from time to time, other documents as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (SEC). These SEC reports can be accessed through the investor relations section of our website. The information found on our website is not part of this or any other report we file with or furnish to the SEC. \nInvestors and others should note that we announce material financial information to our investors using our investor relations website (\ninvestors.hologic.com\n), SEC filings, press releases, public conference calls and webcasts. We use these channels as well as social media to communicate with the public about our Company, our services and other issues. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage investors, the media, and others interested in our Company to review the information we post on the social media channels listed on our investor relations website. We have used, and intend to continue to use, our investor relations website, as well as our X (formerly Twitter) account (@Hologic), as means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. Additional corporate governance information, including our certificate of incorporation, bylaws, governance guidelines, board committee charters, and code of business conduct and ethics, is also available on our investor relations website under the heading “Governance.” The contents of our websites are not intended to be incorporated by reference into this Annual Report or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only. Although we reference the availability of our U.S. Federal Employment Information Report (EEO-1) on our website, our EEO-1 and any other materials on our website are not incorporated by reference into this Annual Report or any of our other filings under the Securities Act of 1933, as amended, or the Exchange Act. While matters discussed in such EEO-1, other website materials and our X and other social media accounts may be significant, any significance should not be read as necessarily rising to the level of materiality used for the purposes of our compliance with the U.S. federal securities law, even if we use the word “material” or “materiality” in such materials.\nThe SEC maintains an internet website that contains reports, proxy and information statements, and other information regarding Hologic and other issuers that file electronically with the SEC. The SEC’s internet website address is \nwww.sec.gov\n.\nProposed Merger\nOn October 21, 2025, the Company entered into a definitive agreement to be acquired by funds managed by Blackstone Inc. (“Blackstone”) and TPG Capital (“TPG”). Under the terms of the agreement, Blackstone and TPG will acquire all outstanding Hologic shares for $76.00 per share in cash, without interest, plus a non-tradable contingent value right (“CVR”) to receive up to $3.00 per share in cash, for total potential consideration of $79.00 per share in cash. The non-tradable CVR will be issued to Hologic stockholders at closing and paid, in whole or in part, following achievement of certain global revenue metrics for our Breast Health business in fiscal years 2026 and 2027. The transaction is expected to close in the first half of calendar year 2026, subject to the approval of Hologic’s stockholders, the receipt of required regulatory approvals and the satisfaction of certain other customary closing conditions. Please see Note 2 to our consolidated financial statements for additional information related to the acquisition. For additional information on risks relating to the transaction, please refer to the “Risk Factors” in Part I,",
    "item1a": "Item 1A. of this Form 10-K.\nGovernance\nOur cybersecurity risk management program is led by our Chief Information Security Officer (\nCISO\n), who oversees a dedicated cybersecurity and risk management team, which works in partnership across the Company, under the direction of our Chief Information Officer (CIO).\n \nOur CISO has over 20 years of experience working in defense and cybersecurity and has served in various cybersecurity leadership roles within Fortune 500 companies. He and our cybersecurity team have extensive experience in leading and addressing IT risk management, security architecture and engineering, security operations, data security, and identity and access management. Our CISO also works closely with our legal team to oversee compliance with legal, regulatory and contractual security requirements.\nAs part of management’s oversight of our cybersecurity program, we also maintain an executive-level cybersecurity steering committee, comprised of Hologic’s Chief Financial Officer, General Counsel, Head of Internal Audit, Chief Information Officer, Head of Human Resources, Head of Global Supply Chain, and Division President of Breast and Skeletal Health, to help address cybersecurity risks at an enterprise level. The cybersecurity steering committee is a decision-making body that coordinates and communicates the direction, current state, and oversight of our cybersecurity and risk management programs.\nWhile our Board oversees our overall risk management process, as part of its oversight, the Board has delegated primary responsibility for the oversight of cybersecurity risks, including management’s steps to monitor and control such risks, to our Audit and Finance Committee.\n \nOn a quarterly basis, our CIO and CISO provide updates to the Audit and Finance Committee on \n33\nTable of Contents\nthe cybersecurity and related risk management programs, including recent developments and current risk assessments. Our CIO and CISO typically also meet in person with the Audit and Finance Committee twice annually for a more detailed discussion of significant threats, risk mitigation strategies, any security program assessments and identified improvements. \nAdditionally, our CIO and CISO meet at least annually with the full Board and report on the Company’s Information Technology program and more specifically, cybersecurity matters.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.\n32\nTable of Contents",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy \nWe recognize the critical importance of developing, implementing, and maintaining robust cybersecurity measures designed to protect the security, confidentiality, integrity, and availability of our business systems and information. We base our cybersecurity risk management program upon and measure it against the National Institute of Standards and Technology (NIST) Cybersecurity Framework 2.0.\nOur cybersecurity risk management program includes the following:\n•\nA dedicated staff of cybersecurity and risk management professionals; \n•\nDefined security policies and standards;\n•\nAnnual mandatory employee cybersecurity and privacy compliance awareness training;\n•\nCybersecurity tooling for detecting and responding to cyber incidents;\n•\nCybersecurity incident response and major crisis plans that govern activities such as detection, coordination, remediation, recovery, and escalation to senior management and, where appropriate, our Audit and Finance Committee and our Board;\n•\nBack-up & recovery plans; \n•\nPeriodic tabletop exercises to promote awareness and improve internal processes;\n•\nPeriodic penetration testing and vulnerability management processes; and\n•\nThird-party\n risk assessments for suppliers and vendors, which may require such third parties to sign data processing agreements, comply with particular security controls, or complete an additional security and privacy assessment.\nOur program also utilizes third-party security providers for specialized areas, including penetration testing, staff augmentation, consulting and other on-demand cybersecurity services. We also leverage a managed security service provider to augment our cybersecurity organization and to provide additional monitoring and response capabilities.\nWe have integrated cybersecurity related risks into our enterprise risk management program, which is designed to identify, prioritize, assess, monitor and mitigate the various risks confronting our Company, including both external and internal cybersecurity risks.\n When identified, risks are reported to relevant business and governance leaders within the Company for appropriate action. When potential improvements are identified, we weigh the costs and benefits of such improvements (including against other potential improvements) and, if selected, the improvements are added to a roadmap for possible implementation.\nAs a global company, we manage a variety of cybersecurity threats and cannot wholly eliminate the risk of adverse impacts from such incidents. Further, the scope and impact of any future incident cannot be predicted. \nHowever, as of the date of this Form 10-K, we are not aware of cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of our operations or financial condition. For additional information on the risks from cybersecurity threats that we face, please refer to the “Risk Factors” in Part I,"
  }
}