{
  "ticker": "HPE",
  "cik": "0001645590",
  "company_name": "Hewlett Packard Enterprise Co",
  "filing_date": "2024-12-19",
  "accession": "0001645590-24-000139",
  "primary_doc": "hpe-20241031.htm",
  "item_sections": {
    "item1": "ITEM 1. Business\nWe are a global technology leader focused on developing intelligent solutions that allow customers to capture, analyze and act upon data seamlessly from edge to cloud. We enable customers to accelerate business outcomes by driving new business models, creating new customer and employee experiences, and increasing operational efficiency today and into the future. Our customers range from small-and-medium-sized businesses to large global enterprises and governmental entities. Our legacy dates back to a partnership founded in 1939 by William R. Hewlett and David Packard, and we strive every day to uphold and enhance that legacy through our dedication to providing innovative technological solutions to our customers.\nWe use the terms “Hewlett Packard Enterprise,” “HPE,” “the Company,” “we,” “us,” and “our” to refer to Hewlett Packard Enterprise Company.\nOur Strategy\n \nOver the last several years, new megatrends around edge, cloud, data, and artificial intelligence (“AI”) have emerged to shape customer expectations for enterprise technology. First, data at the edge is increasing exponentially, driven by the proliferation of devices that require secure connectivity to enable reliable digital experiences. Second, enterprises need a cloud experience everywhere to manage data and workloads wherever they live across a distributed enterprise. Third, data growth is creating countless new opportunities to generate meaningful business insights. Finally, HPE is seeing a significant technology shift as customers realize the fundamental potential of AI technology to deliver business transformation.  \nIn concert with these trends, enterprises are consuming their technology differently. Increasingly, customers want to digitally transform while preserving capital and eliminating operating expense by paying only for the information technology (“IT”) they use. \nThe megatrends are ushering in long-lasting changes to IT, including accelerating hybrid multi-cloud adoption. Customers across industry verticals are interested in unifying all the applications and data with a consistent cloud experience.\nCustomers also want to better extract value from their growing stores of rapidly evolving data, knowing that actionable insights from data are critical to deliver business transformations. Data is becoming more unstructured, more time-sensitive, and more distributed. Frequently, data is siloed and spread across different multi-generational IT systems, often trapped in critical legacy architecture. Many organizations cannot adequately gain insights from their data at the edge or face cloud migration challenges because of their legacy applications. Customers need a data-first modernization approach across edge to data center to cloud.\nHPE has deployed an edge-to-cloud strategy that capitalizes on emergent megatrends and delivers a data-first modernization approach for customers. Our vision to be the edge-to-cloud company has led us to innovate our solutions across networking connectivity, cloud, and data, delivered as-a-service (“aaS”) through the HPE GreenLake cloud. We have shifted our mix of products and services, and how we deliver that mix to customers. HPE has evolved to a platform-based model, fueled by a portfolio richer in software and services. In hybrid cloud, we have redefined the cloud space by delivering an experience that is hybrid by design with our HPE GreenLake cloud as the centerpiece of our strategy; it accelerates multi-generation IT transformation through a unified cloud-native and AI-driven experience that empowers customers to access, analyze, and extract value from their data across public clouds, data centers, colocation facilities, and at the edge. The AI market requires a modern and high-performing networking fabric as a core foundation to deliver a more efficient data-center cloud, which we offer through our AI-driven portfolio of networking solutions. Our server business supports both traditional servers and those meant to enable AI workloads with decades of large-scale infrastructure expertise, including technologies like direct liquid cooling that are powering some of our largest AI systems. Our Financial Services (“FS”) business complements our solution offerings by helping customers unlock financial capacity.\nWe recognize the AI market will be driven by computational capability, data-intensive workloads, and the need for specialized architecture; thus, we have been targeting, and continue to target three areas: supercomputing, AI infrastructure, and AI platform software. We seek to seize this AI market opportunity by innovating in networking, hybrid cloud and AI – which are all essential building blocks to deliver a unified technology experience. We believe that we are differentiated from our competition by our unique and compelling value proposition, which positions us to capture significant value from the growing AI market through our intellectual property portfolio, trusted expertise, and long-term sustained market leadership in supercomputing. \nThe pending acquisition of Juniper Networks, Inc. (\"Juniper Networks\") further supports the aforementioned strategies and enables us to execute on them. We believe this acquisition will accelerate our edge-to-cloud vision with a full networking IP stack: from silicon, to infrastructure, to the operating system, to security, to software and services, in a cloud-native and AI-\n2\nTable of Conte\nn\nt\ndriven approach. Furthermore, through this strategic acquisition, we seek to deliver secure, AI-driven networking solutions, which will be foundational to delivering fully integrated hybrid cloud and AI solutions.\nOur Business Segments, Products and Services \nOur operations are organized into five reportable business segments: Server, Hybrid Cloud, Intelligent Edge, Financial Services, and Corporate Investments and Other. The class of similar product categories within each segment which accounted for more than 10% of our consolidated net revenue in each of the past three years was as follows:\n•\nFiscal 2024 - Server products, Server services, Intelligent Edge products, Hybrid Cloud products\n•\nFiscal 2023 - Server products, Intelligent Edge products, Server services, Hybrid Cloud products\n•\nFiscal 2022 - Server products, Server services, Hybrid Cloud products, Intelligent Edge products\nThe Company had\n \ntwo distributors which represented approximately 14% and 11% of the Company's total net revenue in fiscal 2024, primarily within the Intelligent Edge and Server segments. \nA summary of our net revenue, earnings from operations and assets for our segments can be found in Note 2, “Segment Information,” to our Consolidated Financial Statements in Item 8 of Part II. A discussion of certain factors potentially affecting our operations is set forth in",
    "item1a": "Item 1A of Part I of this Annual Report on Form 10-K.\nOur prior Global CISO departed HPE at the end of October 2024. We have identified a successor, who will join HPE in January 2025, previously served in relevant leadership positions at other public and private companies, and will bring over two decades of technology experience spanning information security and IT, including serving as CISO at other large companies. In the interim, our CDRM organization has been and will be led by our CISO of Cyber Defense and CISO of Cyber Governance, both reporting directly to our COLO.",
    "item1b": "ITEM 1B. Unresolved Staff Comments.\nNone.",
    "item1c": "ITEM 1C. Cybersecurity.\nRisk Management and Strategy \nOur Cybersecurity and Digital Risk Management (“CDRM”) organization, under the leadership of a Global Chief Information Security Officer (“Global CISO”), operates a cybersecurity program that is designed to help us assess, identify, manage, and mitigate risks relating to cybersecurity threats and incidents. We design our cybersecurity standards, policies, processes and controls to operate in an integrated manner, leveraging applicable industry standards and security frameworks, including the NIST Cybersecurity Framework, as guides in supporting our ability to perform such functions.  \nCDRM manages our cybersecurity program, including by fostering collaboration with partners across business units and functional areas to identify and assess material cybersecurity threats, evaluate their severity, and explore ways to mitigate and manage such risks. Business units and functional areas are responsible for managing risks and implementing our policies and standards within the respective business unit or function. Compliance with our policies and standards is assessed by CDRM in conjunction with our internal audit function, through periodic cybersecurity audits.  \nAs part of our cybersecurity program, we maintain a Cyber Risk Management Program that seeks to address key risk management concepts, including mission and vision, escalation path for risk mitigation, risk assessments, and risk treatment. We do so by conducting a variety of planning and preparedness activities, including employing monitoring tools to identify suspicious or anomalous activity, vulnerabilities, or signs of compromise across our networks, systems, and data. We utilize data from attack surface management tools to produce a prioritized set of vulnerabilities for remediation. We also require mandatory cybersecurity training for employees and periodically conduct Company-wide phishing simulations.  \nTo aide in assessing material risks from cybersecurity threats, our enterprise risk management (“ERM”) program incorporates cybersecurity risks as part of its process to assess overall risk of the Company. The ERM organization supports management by facilitating a semi-annual risk assessment, which documents the priority and status of these risks and aligns them with our strategic mitigation efforts. ERM is structured using a framework based on guidance from the Committee of Sponsoring Organizations of the Treadway Commission on Enterprise Risk Management Integrating Strategy with Performance. \nWithin CDRM, our Cybersecurity Defense Center (“CDC”) has established policies, processes, and controls that are designed to monitor, detect, investigate, respond to, and escalate management of cybersecurity threats and incidents. If we experience a cybersecurity incident, the CDC activates an incident response plan, which includes processes to enable us to triage, assess severity of, escalate, contain, investigate, and remediate the incident, as well as to comply with applicable legal obligations and mitigate brand and reputational harm. Based on initial investigation into such incident’s impact to the Company, the actor(s) involved, and other factors, the CDC assigns a severity level to an incident, which dictates the escalation path for a given incident. For incidents rising to higher levels of severity, the Cyber Governance and Incident Disclosure Committee, a cross-functional committee spanning cybersecurity, IT, legal, finance, enterprise risk management, and compliance teams, assesses the severity and potential materiality of such incidents and, as appropriate, escalates to designated members of our senior management for further assessment, response, and remediation. Additionally, we have established a Cyber Crisis Management Team, responsible for addressing and responding to the most severe cyber incidents. If warranted, senior management notifies the Audit Committee and/or the full Board of Directors, as appropriate. Throughout this process, the CDC continues to investigate the incident and, as its understanding of the incident evolves, updates its severity assessment, as necessary. \nWe engage third-party security experts, assessors, and consultants, as appropriate, to assess our cybersecurity risk management processes; support our ongoing certification efforts; help identify areas for continued focus, improvement, and compliance; and support incident response functions, to the extent necessary, all of which support our cybersecurity program. From time to time, we conduct third-party-administered, as well as internally administered, tabletop exercises, which simulate cybersecurity threats, to assess our existing cybersecurity infrastructure and incident response processes. We also periodically conduct offensive security assessments and vulnerability tests, and continuously monitor our computing environments to gain visibility into our security posture and detect vulnerabilities, abnormalities, or signs of compromise. \nIn addition to monitoring risks from threats to our own assets, we administer third-party risk management practices that endeavor to help identify and manage supply chain and vendor risk arising from some of our key suppliers and other service provider organizations. We do so in a variety of ways, such as gathering information on third parties’ cybersecurity programs and controls, performing due diligence, undertaking cybersecurity reviews and/or audits, and/or mandating certain contractual requirements, such as notification of cybersecurity incidents.  \n36\nTable of Conte\nn\nt\nGovernance\n \nOur Global CISO, who reports to our Chief Operating and Legal Officer (“COLO”), has principal management-level responsibility for our cybersecurity program, which includes assessing and managing our cybersecurity risks, along with developing and implementing cybersecurity processes, policies, and controls that are used for managing cybersecurity risk across the Company. Our Global CISO is supported by the CISO of Cyber Defense and the CISO of Cyber Governance – both of whom have extensive experience in private sector cybersecurity roles – and a team of cybersecurity professionals with relevant educational and industry experience. The Global CISO periodically meets with the Cyber Governance and Incident Disclosure Committee, our enterprise risk management function and chief-level executives to discuss cybersecurity risks, as well as related mitigation and remediation activities. The CDC monitors the prevention, detection, investigation, mitigation, response to, and remediation of cybersecurity incidents, and regularly reports to our CISO of Cyber Defense, who then subsequently reports to the Global CISO.\nOur Board of Directors is responsible for overseeing cybersecurity risk, primarily through the Audit Committee. Cybersecurity reviews by the Audit Committee and the Board of Directors are scheduled to occur at least quarterly and annually, respectively, or more frequently, as deemed necessary or advisable. Such presentations to the Audit Committee and Board of Directors, as applicable, are made by our COLO and Global CISO and address topics such as cybersecurity threats, incidents, risks, results from internal and third-party assessments, progress towards risk-mitigation goals, the functioning of our incident response program, and regulatory developments. At times, the Audit Committee may receive additional cybersecurity risk reviews from other members of management and/or internal cybersecurity experts on certain of our key business segments and products. The Audit Committee regularly reports to our Board of Directors regarding the committee’s oversight of such cybersecurity matters. Additionally, the COLO and Global CISO may provide ad hoc updates to the Board of Directors and/or the Audit Committee if necessitated by a security incident or other significant developments. \nHPE, like all organizations operating in the technology landscape, faces significant and persistent cybersecurity risks. To date, no risks from cybersecurity threats, including as a result of any previous cybersecurity incident, have materially affected us, including our business strategy, results of operations, or financial condition. Notwithstanding our cybersecurity program, we may not be successful in identifying a cybersecurity risk or preventing or mitigating a cybersecurity incident or vulnerability, which if realized, could reasonably likely materially affect us. Additional information on the cybersecurity risks we face can be found in the section titled “Risk Factors” in"
  }
}