{
  "ticker": "HPQ",
  "cik": "0000047217",
  "company_name": "HP INC",
  "filing_date": "2024-12-13",
  "accession": "0000047217-24-000080",
  "primary_doc": "hpq-20241031.htm",
  "item_sections": {
    "item1": "ITEM 1. Business.\nOverview\nHP is a global technology leader and creator of solutions that enable people to bring their ideas to life and connect to the things that matter most. Operating in more than 170 countries, HP delivers innovative and sustainable devices, services and subscriptions for personal computing, printing, 3D printing, hybrid work, gaming and other related technologies.\nWe believe artificial intelligence (“AI”) is playing a critical role in the transformation of how people live and work, and customers are beginning to recognize the benefits in security, speed and cost. Our high-performing product portfolio includes HP’s new line of AI PCs and workstations built with the computing power to enable local AI processing for enhanced performance and features as well as intelligent print features incorporated into our home, office and graphics solutions.\nOur broad range of security capabilities are designed to protect an increasingly distributed user base through security enhanced PCs and printers, hardware-enforced endpoint security software (for both HP and non-HP PCs), and endpoint security services. Our security solutions provide layered resiliency using enhanced features such as containment and isolation technology as well as the use of AI deep-learning to identify and remove malware threats.\nWe have three reportable segments: Personal Systems, Printing and Corporate Investments.\nPersonal Systems\nPersonal Systems offers desktops, notebooks, and workstations (including HP’s portfolio of AI PCs and workstations), thin clients, retail point-of-sale (“POS”) systems, displays, hybrid systems, software, solutions including endpoint security and services. Personal Systems includes support and deployment, configurations and extended warranty services and maintains multi-operating system and multi-architecture strategies using Microsoft Windows and Google Chrome operating systems, and predominantly uses processors from Intel, AMD, and NVIDIA. \nPersonal Systems groups its global business capabilities into the following business units when reporting business performance:\n•\nCommercial PS\n consists of endpoint computing devices and hybrid systems, for use by enterprise, public sector (which includes education), and small- and medium-sized business (“SMB”) customers. These devices include our Pro and Elite commercial PC portfolio, our Z line of workstations, thin clients, retail POS systems, and HP’s Dragonfly and Chromebook PCs. HP offers a range of secure services and solutions to commercial customers to help them manage the lifecycle of their PCs and mobility installed base.\n•    \nConsumer PS\n consists of devices, accessories and services which are optimized for consumer usage, focusing on gaming, learning and working remotely, consuming multi-media for entertainment, managing personal life activities, sharing information and staying connected, informed, and secure. These devices include our new Omni consumer PC portfolio, the Omen and Victus gaming lines, and HP’s Spectre, Envy, Pavilion and Chromebook PCs.\nPrinting\nPrinting provides consumer and commercial printer hardware, supplies, services and solutions. Printing is also focused on Graphics and 3D Printing and Personalization in the commercial and industrial markets. Our global business capabilities within Printing are described below:\n•\nOffice Printing Solutions\n delivers HP’s security enhanced office printers, supplies, services, and solutions to SMBs, public sector and large enterprises. It also includes Original Equipment Manufacturer (“OEM”) hardware and solutions. \n•\nHome Printing Solution\ns delivers innovative and security enhanced printing products, supplies, services and solutions for the home, home business and micro business customers utilizing both HP’s Ink and Laser technologies.\n•\nGraphics Solutions \ndelivers large-format, commercial and industrial solutions and supplies to print service providers and packaging converters through a wide portfolio of printers and presses. \n•\n3D Printing & Personalization\n offers a portfolio of additive manufacturing solutions and supplies to help customers succeed in their additive and digital manufacturing journey. HP offers complete solutions in collaboration with an ecosystem of partners.\nPrinting groups its global business capabilities into the following business units when reporting business performance:\n•\nCommercial Printing \nconsists of office printing solutions, graphics solutions and 3D printing and personalization, excluding supplies;\n•\nConsumer Printing \nconsists of home printing solutions, excluding supplies; and\n5\nTable of Contents\n•\nSupplies\n comprises a set of highly innovative consumable products, ranging from ink and laser cartridges to media, industrial graphics supplies and 3D printing and personalization supplies, for recurring use in consumer and commercial hardware.\nCorporate Investments\nCorporate Investments\n includes certain business incubation and investment projects.\nCompetition\nWe encounter strong competition in all areas of our business activity. We compete on the basis of technology, innovation, performance, price, quality, reliability, brand, reputation, distribution, range of products and services, ease of use of our products, account relationships, customer training, service, support and solutions including subscription-based offerings and financing, security, availability of application software, and our sustainable impact. \nThe markets for each of our key business segments are characterized by strong competition among major corporations with long-established positions and a large number of new and rapidly growing firms. Most product life cycles are short, and to remain competitive we must develop new products and services, periodically enhance our existing products and services and compete effectively based on the factors listed above. In addition, we compete with many of our current and potential partners, including OEMs that design, manufacture and often market their products under their own brand names. Our successful management of these competitive partner relationships will be critical to our future success. Moreover, we anticipate that we will have to continue to adjust prices on many of our products and services to stay competitive.\nThe competitive environment in which each key segment operates is described below:\nPersonal Systems. \nThe markets in which Personal Systems operates are highly competitive and are characterized by price competition and introduction of new products and solutions. Our primary competitors are Acer Inc., Apple Inc., ASUSTeK Computer Inc., Dell Inc., Huawei Technologies Co., Ltd., Lenovo Group Limited, Logitech International S.A., Microsoft Corporation, Samsung Electronics Co., Ltd., and Toshiba Corporation. In certain geographies, we also experience competition from local companies and from generically-branded or “white box” manufacturers. Our competitive advantages include our broad product portfolio, our innovation, and research and development capabilities including security features, our innovative design work, our brand and procurement leverage, our ability to cross-sell our portfolio of offerings, our extensive service and support offerings, the accessibility of our products and the execution of our broad-based distribution strategy from retail and commercial channels to direct sales.\nPrinting\n. \nThe markets for printer hardware and associated supplies are highly competitive. Printing’s key customer segments each face competitive market pressures in pricing and the introduction of new products. Our primary competitors include Brother Industries, Ltd., Canon Inc., Lexmark International, Inc., Pantum, Seiko Epson Corporation, The Ricoh Company Ltd., and Xerox Corporation Ltd. In addition, independent suppliers offer non-original supplies (including imitation, refill and remanufactured alternatives), which are often available for lower prices, but which can also offer lower print quality and reliability compared to HP original inkjet and toner supplies. These and other competing products are often sold alongside our products through online or omnichannel resellers,\n \nretailers or distributors, or such resellers, retailers and distributors may highlight the availability of lower cost non-original supplies. Our competitive advantages include our comprehensive high-quality solutions for the home, office and publishing environments, our innovation, and research and development capabilities including security features, sustainability, our brand, and the accessibility of our products through a broad-based distribution strategy from retail and commercial channels to direct sales.\nSales, Marketing and Distribution\nWe manage our business and report our financial results based on the business segments described above. Our customers are organized by consumer and commercial groups, and purchases of HP products, solutions and services may be fulfilled directly by HP or indirectly through a variety of partners, utilizing their own physical or internet stores or an omnichannel combination of the two, including:\n•\nretailers that sell our products to the public focusing on consumers and SMBs;\n•\nresellers that sell our products and services, frequently with their own value-added products or services, to targeted customer groups;\n•\ndistribution partners that supply our products and solutions to resellers and retailers in certain geographies; and\n•\nsystem integrators and other business intermediaries that provide various levels of services, including systems integration work and as-a-service solutions, and typically partner with us on client solutions that require our products and services.\n6\nTable of Contents\nThe mix of our business conducted by direct sales or channel sales differs by business and geographic market. We believe that customer buying patterns and different geographic market conditions require us to tailor our sales, marketing and distribution efforts to the geographic market and sub-geographic specificities for each of our businesses. We are focused on driving the depth and breadth of our market coverage while identifying efficiencies and productivity gains in both our direct and indirect routes to market. Our businesses collaborate to accomplish strategic and process alignment where appropriate. For example, we typically assign an account manager to manage relationships across our business with large enterprise customers. The account manager is supported by a team of specialists with product and services expertise and drives both direct and indirect sales to their assigned customers. For other customers and for consumers, we typically manage both direct online sales as well as channel relationships with retailers mainly targeting consumers and SMBs and commercial resellers mainly targeting SMBs, mid-market accounts, public sector and large enterprises.\nManufacturing and Materials\nWe utilize outsourced manufacturers (“OMs”) around the world to manufacture HP-designed products to generate cost efficiencies, reduce time to market, and maintain flexibility in our supply chain and manufacturing processes. We also manufacture finished products from components and sub-assemblies that we acquire from a wide range of vendors.\nWe utilize two primary methods of fulfilling demand for products: building products to order and configuring products to order. Building products to order maximizes manufacturing and logistics efficiencies by producing high volumes of basic product configurations. Alternatively, configuring products to order enables products to match a customer’s hardware and software customization requirements.\nLike other participants in the information technology (“IT”) industry, we ordinarily acquire materials and components through a combination of blanket and scheduled purchase orders to support our demand requirements for periods averaging 90 to 120 days. We also may acquire component inventory in times of growth or in anticipation of significant price volatility or supply constraints for certain components that are not available from multiple sources. Additionally, while most of our products have existing or readily available alternative sources of supply, some of our components are obtained from a single source due to technology, availability, price, quality or other considerations. \nResearch and Development\nInnovation across products, services, business models and processes is a key element of our culture and success. We are focused on developing products, services and solutions that anticipate customers’ changing needs and desires, and emerging technological trends, including accelerating the delivery of AI throughout our product portfolio. We continue to invest in innovation in both the areas where we believe we can make a unique contribution and where strategic partnerships will leverage our cost structure and maximize our customers’ experiences.\nIntellectual Property\nWe seek patent protection for inventions likely to be incorporated into our products and services or where obtaining such proprietary rights will maintain or improve our competitive position. As of October 31, 2024, our worldwide patent portfolio included over 22,000 patents which expire at various dates, generally 20 years from their original filing dates. \nWe believe that our patents and patent applications are important for maintaining the competitive differentiation of our products and services, enhancing our freedom of action to sell our products and services in markets in which we choose to participate, and maximizing our return on research and development investments. No single patent is essential to HP as a whole or to any of HP’s business segments.\nIn addition to developing our patent portfolio, we license intellectual property (“IP”) from third parties. We have also granted and continue to grant to others licenses, and other rights, under our patents when we consider these arrangements to be in our interest. These license arrangements include a number of cross-licenses with third parties.\n7\nTable of Contents\nSeasonality\nWe experience some seasonal trends in the sale of our products and services. For example, European sales are often weaker in the summer months and consumer sales are often stronger in the fourth calendar quarter. Demand during the spring and early summer months also may be adversely impacted by market anticipation of seasonal trends. Historical seasonal patterns may be impacted by supply constraints, shifts in customer behavior and the evolving impacts of macroeconomic challenges.\nSustainability and Environmental, Social, and Governance Activities\nAt HP, we believe how we do things is just as important as what we do. Our Sustainable Impact goals reflect our efforts to tackle key issues in Climate, Human Rights, and Digital Equity. For more information on our sustainability goals, programs, and performance, including our methodology for calculating progress towards our GHG and other sustainability goals, we refer you to our annual Sustainable Impact Report, available on our website (which is not incorporated by reference herein).\nEnvironment\nOur operations are subject to regulation under various federal, state, local and foreign laws concerning the environment, including laws addressing the discharge of pollutants into the air and water, the management and disposal of hazardous substances and wastes, and the cleanup of contaminated sites. \nWe proactively evaluate and at times replace materials in our products and supply chain, taking into account, among other things, published lists of substances of concern, new and upcoming legal requirements, customer preferences and scientific analysis that indicates a potential impact to human health or the environment.  \nWe are committed to complying with all environmental laws applicable to our operations, products and services and to reducing our environmental impact across all aspects of our business. This commitment is reflected and outlined in our Sustainable Impact goals, our comprehensive environmental, health and safety policy, strict environmental management of our operations and worldwide environmental programs and services.\nHuman Capital\nHP employs approximately 58,000 employees in 59 countries. Together, they power HP innovation by applying their diverse skills and perspectives to create transformative solutions for our partners and customers worldwide. Our aim is to attract and retain exceptional talent by providing engaging work experiences that help our employees thrive. We promote ongoing learning and development, offer comprehensive compensation and benefits, and focus on health, safety, and well-being to set employees up to do their best work and achieve their career aspirations. To deliver on these priorities, HP senior leaders are accountable for meeting management by objective (“MBO”) goals for employee engagement, diversity and inclusion, and leadership development. \nEmployee Engagement\nWe regularly collect feedback from employees to better understand and improve their workplace experiences and to identify ways to strengthen our culture. In fiscal year 2024, 90% of employees participated in our annual survey, and we continued to see strong overall engagement, exceeding top quartile benchmarks for most of the external comparisons we track. We saw similar strength in our internal inclusion index, and employees demonstrated their engagement by providing a high volume of written comments in this year’s survey. Beyond the annual survey, we regularly seek out employee feedback through a variety of pulse polls and take action to address their ideas, suggestions, and concerns.  \nTalent Development\nWe have a multi-faceted talent, learning, and skill-development strategy. First, we emphasize diversity of backgrounds, experience, and perspectives in our senior talent pipeline, and invest in targeted approaches such as leadership assessments, external education opportunities, coaching, job rotations, and immersive, experiential learning to ensure our executives are equipped to lead HP, both now and in the future. We also support talent through an extensive portfolio of internal and external development programs designed to accelerate their career growth. Additionally, we prepare new people managers with development experiences designed, among other things, to build coaching skills and champion inclusion.\nWe are committed to the continuous growth of employees. We provide enterprise-wide skill development solutions and resources that focus on the critical skills all employees need to perform at their best in their jobs today and in the future. In partnership with industry thought partners and internal experts, HP offers learning opportunities in key areas such as software development, artificial intelligence, data science, product management, communications, change agility, and strategic thinking. HP prioritizes skill development experiences that accommodate employee-specific needs and demanding schedules, with an emphasis on learning that drives immediate application and measurable behavior change. \nIn addition to skill development resources, HP also offers formal education assistance through our Degree Assistance Program which provides employees with the opportunity to participate in higher academic education.\n8\nTable of Contents\nHybrid Work Strategy\nAt HP, hybrid work balances workplace flexibility with time working together to collaborate and connect in person at our sites. Our goal is to provide the ability to work seamlessly across a diverse ecosystem of workplaces, enabled\n \nby enhanced tools and technology designed to optimize productivity and collaboration.\nDiversity, Equity, and Inclusion\nWe strive to create an inclusive workplace where everyone can bring their unique perspectives to work and reach their full potential. This commitment is at the heart of our innovation model, where people with diverse backgrounds, knowledge, and experiences collaborate to create breakthrough technologies and deliver valued solutions to our customers.\nWe also strive to ensure equal opportunities and access for all employees. We continue to work on removing barriers through external hiring and outreach and by providing internal programs and development opportunities and training for managers on inclusive leadership.\nPay Equity\nPeople should be paid equitably for what they do and how they do it, regardless of their gender, race, or other protected characteristics. We benchmark and set pay ranges based on relevant market data and consider factors such as an employee’s role, experience, skills, and performance. We also regularly review our compensation practices, both in terms of our overall workforce and individual employees, to make sure our pay is fair and equitable.\nSince 2016, we have reviewed employees’ compensation with the support of independent third-party experts to ensure consistent pay practices. In fiscal year 2024, we continued to expand our annual pay equity assessment to include additional countries representing a majority of our global workforce. The independent analysis did not reveal any systemic issues and we addressed areas of potential concern as part of our off-cycle compensation process. \nHealth, Safety, and Wellness\nThe holistic wellbeing of our employees is vital to HP’s success. Our environmental, health, and safety leadership team uses our global injury and illness reporting system to assess worldwide and regional trends as a part of quarterly reviews. We focus on reducing and effectively managing risks at HP-owned and partner-owned manufacturing facilities, and injury rates continue to be low.\nWe sponsor a global wellness program designed to enhance wellbeing for all HP employees. Throughout the year, we encourage healthy behaviors across our five pillars of wellness—physical, financial, emotional, life balance, and social/community—through regular communications, educational sessions, voluntary progress tracking, wellness challenges, and other incentives. In addition to our regular annual wellbeing programs, we provide specialized programs and campaigns in line with employee needs at the time. Our campaign this year, “Elevate Your Everyday,” encouraged employees to challenge themselves to embrace new experiences and opportunities for personal development, all with the help of HP-provided mindfulness apps, targeted mental health support, individual assessments, and expanded financial wellbeing programs.\n \n9\nTable of Contents\nInformation about our Executive Officers\nThe following are our current executive officers:\nAlex Cho; age 52; President, Personal Systems\nMr. Cho has served as President, Personal Systems since June 2018. From 2014 to 2018, Mr. Cho served as Global Head and General Manager of Commercial Personal Systems. Prior to that role, Mr. Cho served as the Vice President and General Manager of the LaserJet Supplies team from 2010 to 2014.\nJulie Jacobs; age 58; Chief Legal Officer and General Counsel\nMs. Jacobs has served as Chief Legal Officer and General Counsel since October 2022. Previously, Ms. Jacobs served as Senior Executive Vice President, General Counsel and Corporate Secretary of Yahoo, a leading internet, media, and technology company, from September 2021 to October 2022. Prior to Yahoo, Ms. Jacobs served as Executive Vice President and General Counsel of Verizon Media, a global media and technology company, from June 2017 to September 2021. Prior to Verizon Media, Ms. Jacobs spent over 16 years in various senior legal roles at AOL, a global internet, media and technology company, including serving as AOL’s Executive Vice President, General Counsel, and Corporate Secretary from May 2010 to June 2017. \nStephanie Liebman; age 55; Global Controller\nMs. Liebman has served as Global Controller since December 2023 and as Senior Vice President and Finance Chief Operations Officer at HP since February 2023. Prior to rejoining HP, she served as Senior Vice President at NTT Data Services, a provider of IT and business services, from March 2019 to January 2023. Before that she spent over 21 years at HP in various roles including Chief Audit Executive and Vice President of Enterprise Services Financial Operations.\n \nMs. Liebman is a Certified Public Accountant.\nEnrique Lores; age 59; President and Chief Executive Officer\nMr. Lores has served as President and Chief Executive Officer since November 2019. Throughout his over 30-year tenure with the company, Mr. Lores held leadership positions across the organization, serving as President, Printing, Solutions and Services from November 2015 to November 2019, and prior to that role, leading the Separation Management Office for HP Inc. Previously, Mr. Lores was the Senior Vice President and General Manager for Business Personal Systems. Before his Business Personal Systems role, Mr. Lores was Senior Vice President of Customer Support and Services.\nKristen Ludgate; age 62; Chief People Officer\nMs. Ludgate has served as Chief People Officer since July 2021. Previously, Ms. Ludgate served as Executive Vice President and Chief Human Resources Officer at 3M,\n a global technology company\n, from June 2018 until July 2021. Ms. Ludgate held a wide range of leadership positions during her 17 years with 3M, leading global teams in human resources, legal, compliance, and communications.\nDavid McQuarrie; age 49; Chief Commercial Officer\nMr. McQuarrie has served as Chief Commercial Officer since November 2022. Previously, Mr. McQuarrie served as Senior Vice President & General Manager, Personal Systems Category, from November 2021 to November 2022, Global Head of Customer Support from November 2019 to November 2021, and Global Head of Print Business Management from January 2017 to October 2019.  Prior to joining HP, Mr. McQuarrie served in various sales leadership positions at global personal computer and technology companies Lenovo (2008 to 2016) and Dell (1998 to 2007). \nAnneliese Olson; age 53; President of Imaging, Printing & Solutions\nMs. Olson has served as President of Imaging, Printing and Solutions since November 2024 and has over 28 years of experience at the Company. Previously, she served as Senior Vice President & Managing Director, North America Market, and prior to that as Senior Vice President & Chief Operating Officer, Worldwide Print.\nKaren L. Parkhill; age 59; Chief Financial Officer\nMs. Parkhill has served as Chief Financial Officer since August 2024. Previously, she served as Executive Vice President and Chief Financial Officer of Medtronic plc, a healthcare technology company, a position she held since June 2016.\n \nPrior to Medtronic, Ms. Parkhill served as Vice Chairman and Chief Financial Officer of Comerica Incorporated, a financial services company, from 2011 to 2016. Ms. Parkhill was a member of Comerica’s Management Executive Committee and the Comerica Bank Board of Directors. Prior to joining Comerica, Ms. Parkhill worked for J.P. Morgan Chase & Co., a financial services company, in various capacities from 1992 to 2011, including serving as Chief Financial Officer of the Commercial Banking business from 2007 to 2011.\n10\nTable of Contents\nAvailable Information\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge on our website at http://investor.hp.com, as soon as reasonably practicable after HP electronically files such reports with, or furnishes those reports to, the Securities and Exchange Commission. HP’s Corporate Governance Guidelines, Board of Directors’ committee charters (including the charters of the Audit Committee, Finance, Investment and Technology Committee, HR and Compensation Committee, and Nominating, Governance and Social Responsibility Committee) and code of ethics entitled “Integrity at HP” (none of which are incorporated by reference herein) are also available at that same location on our website. If the Board grants any waivers from Integrity at HP to any of our directors or executive officers, or if we amend Integrity at HP, we will, if required, disclose these matters via updates to our website at http://investor.hp.com on a timely basis. We encourage investors to visit our website from time to time, as information is updated and new information is posted. The content of our website is not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC, and any references to our website are intended to be inactive textual references only.\nStockholders may request free copies of these documents from:\nHP Inc.\nAttention: Investor Relations\n1501 Page Mill Road,\nPalo Alto, CA 94304\nhttp://investor.hp.com/resources/information-request/default.aspx\nAdditional Information\nMicrosoft® and Windows® are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries. Intel® is a trademark of Intel Corporation or its subsidiaries in the United States and/or other countries. AMD is a trademark of Advanced Micro Devices, Inc. Google™ and Google Chrome™ are trademarks of Google LLC. NVIDIA is a trademark of NVIDIA Corporation in the United States and/or other countries. All other trademarks are the property of their respective owners.\n11\nTable of Contents",
    "item1a": "Item 1A of Part I of this report under the heading “System security risks, data protection breaches, cyberattacks, system outages and systems integration issues could disrupt our internal operations or services provided to customers, and could reduce our revenue, increase our expenses, damage our reputation and adversely affect our cash flows and stock price,” which should be read in conjunction with the foregoing information.\nOur Board, in coordination with the Audit Committee, oversees the Company’s enterprise risk management process, including the management of risks arising from cybersecurity threats. Our Board has delegated the primary responsibility to oversee cybersecurity matters to the Audit Committee. The Board and Audit Committee regularly review the measures implemented by the Company to identify and mitigate data protection and cybersecurity risks. As part of such reviews, the Board and Audit Committee regularly receive reports and presentations from management regarding our information and technology security program, including the CISO, which address a wide range of topics including recent developments, evolving standards, vulnerability assessments, third-party and independent reviews, the threat environment, technological trends and information security considerations arising with respect to the Company’s peers and third parties. We have protocols by which certain cybersecurity incidents that meet established reporting thresholds are escalated within the Company and, where appropriate, reported promptly to the Board and Audit Committee, as well as ongoing updates regarding any such incident until it has been addressed.",
    "item1b": "ITEM 1B.    Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C. Cybersecurity\nHP’s work to defend against cybersecurity threats is occurring against the backdrop of an evolving global threat landscape. Like other Fortune 500 companies, we face a substantial number of cybersecurity threats—ranging from common cyberattacks such as phishing to more evolved threats that incorporate the use of AI. Our products and processes pose an attractive challenge for the most advanced of threat actors—including but not limited to those who are state-sponsored. As a global corporation with a wide range of systems and networks in place, and with customers who threat actors might also wish to target, we could face attacks not only on our own structures, but also on those of our many third-party providers and partners. In response to this threat environment, we have implemented a comprehensive cybersecurity program to assess, identify, and manage risks from cybersecurity threats. Our holistic approach is designed to integrate cybersecurity across the value chain, including in the design, development, and delivery of our products, services, solutions, and operations.\nOur Chief Information Security Officer (“CISO”) has responsibility for HP’s global cybersecurity program, including infrastructure and technology platforms, overseeing governance, regulatory and compliance, operations, strategy, and architecture. The CISO reports to our Chief Financial Officer. This role is responsible for building out a cybersecurity organization that is designed to enable robust security coupled with productivity for more than 70,000 global employees, contractors, and partners. The CISO supports HP’s business acceleration and transformation by identifying and managing cybersecurity risks, balancing them with business priorities, and using a contemporary security posture to support HP’s position as an industry leader. As part of this, the CISO receives reports on cybersecurity threats from a number of experienced information security officers responsible for various parts of the business on an ongoing basis and in conjunction with management, regularly reviews risk management measures implemented by the Company to identify and mitigate data protection and cybersecurity risks.\nOur cybersecurity organization collaborates heavily with technology, business and legal stakeholders to enable secure business strategy, maintain, and grow proper security oversight, enhance security monitoring and response, and quantify and reduce risks and compliance gaps. There are six key focus areas within the cybersecurity organization: enterprise security operations, architecture and security engineering, identity access management, IT risk management and compliance, governance, risk and compliance, and strategy and program delivery. Additionally, we aim to incorporate a broad range of industry-standard cybersecurity best practices throughout our cybersecurity organization. These include, among other things:\n•\nan insider threat program that coordinates resources to discourage, identify, and mitigate cybersecurity threats;\n•\nregular audits of HP cybersecurity systems and annual risk assessments of related HP systems and processes, including our information security management systems;\n•\nan incident response plan that sets out a coordinated approach to investigating, containing, documenting and mitigating incidents, including reporting findings and keeping senior management and other key stakeholders informed and involved as appropriate;\n•\nannual and ongoing security awareness training for employees; \n•\na cybersecurity/information security policy, as well as an acceptable use policy that defines the permitted usage of company-provided technology and contains consequences for noncompliance;\n•\ncompany-wide privacy policies as well as a physical security program that secures our offices and data center facilities;\n•\nsystems and processes designed to oversee, identify, and reduce the potential impact of a security incident at a third-party vendor, service provider or customer or otherwise implicating the third-party technology and systems we use; and\n•\nengagement with industry peers and participation in cybersecurity forums to share knowledge and learn from best practices.\nOn an annual basis, the cybersecurity organization also enlists the aid of an independent third party to assess our alignment with the National Institute of Standards & Technology’s Cyber Security Framework. The assessment examines our information/cybersecurity program and its associated controls and delivers a report that documents assessment results and provides recommendations for further enhancements. The cybersecurity organization is responsible for presenting an overview of the Cybersecurity Risk Assessment Report to the Board of Directors on at least an annual basis, and the HP executive leadership team is heavily involved in implementing and resolving recommendations. From time to time, we also engage assessors, consultants, auditors, or other third parties to assist with assessing, identifying, and managing cybersecurity risks.\nOur cybersecurity risks are evaluated by senior leadership, including as part of our enterprise risk assessments that are reviewed by the Audit Committee and our Board of Directors, and our Internal Audit function, which is an objective, independent assurance and advisory organization that helps HP achieve business objectives and conducts regular assessments, audits, and testing of the cybersecurity program and its associated controls.\n28\nTable of Contents\nAs of the date of this Form 10-K, risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have not materially affected us, including our business strategy, results of operations or financial condition. However, there can be no guarantee that we will not experience such an event moving forward and if realized, these risks are reasonably likely to materially affect us. Additional information on cybersecurity risks we face can be found in “Risk Factors” in"
  }
}