{
  "ticker": "HRL",
  "cik": "0000048465",
  "company_name": "HORMEL FOODS CORP /DE/",
  "filing_date": "2024-12-05",
  "accession": "0000048465-24-000051",
  "primary_doc": "hrl-20241027.htm",
  "item_sections": {
    "item1": "Item 16.\nF\norm \n10-K S\nummary\n74\nSIGNATURES\n75\n2\nTable of Contents\nPART I\nItem 1.  BUSINESS\nGeneral Development of Business\nHormel Foods Corporation, a Delaware corporation (collectively, the \"Company\", \"we,\" \"us,\" and \"our\"), was founded by George A. Hormel in 1891 in Austin, Minnesota, as Geo. A. Hormel & Company. The Company started as a processor of meat and food products and continues in this line of business with emphasis on the manufacturing and distribution of branded, value-added consumer items. The Company builds on its founder’s legacy of innovation, quality, and integrity with focus on its purpose statement \n—\n Inspired People. Inspired Food.™\n The Company has continually expanded its product portfolio through organic growth and acquisitions. Today, the Company is a global branded food company bringing some of the most trusted and iconic brands to tables across the globe with approximately $12 billion in annual revenue generated from more than 80 countries.\nDescription of Business\nSegments\nThe Company currently operates with the following three operating and reportable segments: Retail, Foodservice, and International.\nRetail\nThe Retail segment consists primarily of the processing, marketing, and sale of food products sold predominantly in the retail market in the United States. This segment also includes the results from the Company’s MegaMex Foods, LLC joint venture.\nFoodservice\nThe Foodservice segment consists primarily of the processing, marketing, and sale of food products for foodservice, convenience store, and commercial customers located in the United States.\nInternational\nThe International segment processes, markets, and sells Company products internationally. This segment also includes the results from the Company’s international joint ventures, international equity method investments, and international royalty arrangements.\nNet sales to unaffiliated customers, segment profit, and certain other financial information by segment are reported in Note P - Segment Reporting of the Notes to the Consolidated Financial Statements and in Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nProducts and Distribution\nThe Company develops, processes, and distributes a wide array of food products in a variety of markets and manufactures its products through various processing facilities and trusted co-manufacturers. The Company’s products primarily consist of meat, nuts, and other food products sold across multiple distribution channels, such as United States (U.S.) retail, U.S. foodservice, and internationally.\nThe Company sells its products in all 50 U.S. states. The Company’s products are sold through its sales personnel, who operate in assigned territories or in dedicated teams serving major customers and who are coordinated from sales offices predominately located in major U.S. cities. The sales team is also responsible for the product portfolio of MegaMex Foods, LLC (MegaMex Foods), a U.S. based Mexican food company, of which the Company owns a minority interest. Additionally, the Company utilizes independent brokers and distributors. Products are primarily distributed by common carrier.\nThe Company has a global presence within several major international markets, including Australia, Brazil, Canada, China, England, Indonesia, Japan, Mexico, the Philippines, Singapore, and South Korea. Distribution of export sales to customers is by third party carriers, while the China and Brazil operations also rely on company-owned and operated delivery systems. The Company has licensed companies to manufacture various products internationally on a royalty basis. The Company also has minority positions in food companies in the Philippines (The Purefoods-Hormel Company, Inc., 40 percent holding) and Indonesia (PT Garudafood Putra Putri Jaya Tbk (Garudafood), approximately 30 percent holding). \nRaw Materials\nThe Company concentrates on the marketing and sale of branded, value-added food products. The principal raw materials used by the Company include pork, turkey, beef, chicken, and nuts. The Company takes what it believes is a balanced approach to sourcing its raw materials. To meet its needs for pork raw materials, the Company purchases hogs for the Austin, Minnesota processing facility, enters into long-term supply agreements for pork, and supplements this with spot market purchases of pork. \n3\nTable of Contents\nThe majority of the turkeys needed to meet raw material requirements are raised by the Company. Production costs from raising turkeys are subject to fluctuations in grain prices and fuel costs. To manage input cost risks, the Company uses futures, swaps, and options contracts to hedge a portion of its anticipated purchases. \nThe Company also purchases raw materials from various suppliers. As the Company has shifted its focus toward a more value-added portfolio, it has become increasingly dependent on these suppliers to meet its raw material needs. Certain raw materials, such as cashews, are sourced internationally, which may cause additional risks to pricing and availability. The Company utilizes supply contracts and forward buying strategies in its effort to ensure an adequate supply and mitigate price fluctuations. \nHuman Capital\nThe Company’s employees are the driving force behind innovation, improvement, and success. As of October 27, 2024, the Company had approximately 20,000 active employees, with over 90 percent located within the U.S. Approximately 20 percent of employees are covered by collective bargaining agreements. Contracts at two of the Company's facilities, covering approximately 300 employees, expire in the next fiscal year. The Company believes it has good relations with its workforce.\nTalent Acquisition, Development, and Retention\nHormel’s team members are the cornerstone of the Company and of the fulfillment of its purpose — \nInspired People. Inspired Food.™\n The Company places great importance on the growth, development, and engagement of its team members. \nThe Company offers competitive compensation packages to its employees and provides a multitude of benefits, including medical, life and disability insurance, contributory and non-contributory retirement savings plans, free post-secondary tuition and tuition reimbursement programs, and two years of tuition-free community and technical college for U.S. employees’ dependent children. In fiscal 2024, the Company provided financial support for a new, third-party operated childcare center in Austin, Minnesota, providing a needed service for team members and the Austin community.\nThe Company believes investing in the education, training, and development of employees contributes to the overall success of the business. The Company provides learning opportunities for employees through various training courses, including instructor-led internal and external programs and on-the-job training.\nThe Company considers the tenure of its team members to be an important indicator of overall performance and is proud of its tenure figures. As of October 27, 2024, approximately 50 percent of the Company’s team members had five or more years of service, and the 37-person officer team had an average of 23 years of service.\nCreating an Inclusive Environment\nThe Company welcomes the diversity, unique skills, thoughts, and experiences of its team members, customers, and consumers. As of October 27, 2024, the Company’s U.S. workforce for majority-owned operations was made up of approximately 40 percent female and approximately 60 percent underrepresented minorities. The Company’s U.S. salaried employees for majority-owned operations as of October 27, 2024 was made up of approximately 35 percent female and approximately 25 percent underrepresented minorities. By fostering an inclusive culture, the Company enables every member of the workforce to leverage unique talents and high-performance standards to drive innovation and success.\nThe Company has twelve employee resource groups (ERGs) that support the Company’s mission to create a workplace where all people feel welcomed, respected, and valued. These employee-driven groups play a critical role in the Company’s efforts to create an inclusive environment and provide professional development and mentorship opportunities. \nSafety, Health, and Wellness\nThe Company’s dedicated corporate safety department develops and administers company-wide policies to ensure the safety of each employee and compliance with Occupational Safety and Health Administration standards and comparable global requirements internationally. The corporate safety department also conducts regular audits of Company-owned production facilities to ensure compliance with Company safety policies. The Company conducts safety training for all team members and, during fiscal 2024, completed approximately 1,200 safety assessments each month.\nThe Company recognizes that team members perform best when they are healthy, and that optimal performance is necessary for the Company to achieve its key results. In addition to the health care benefits package, the Company’s Inspired Health program aims to cultivate and maintain a culture of health and wellness that is focused on encouraging and empowering team members to make healthy lifestyle choices through awareness, prevention, and positive health behavior changes. This program includes biometric screenings, on-site fitness centers and fitness center discounts, an online health university with robust information and resources, a tobacco cessation program, wellness challenges, and confidential health and wellness support.\nGovernmental Regulation and Environmental Matters\nThe Company’s operations are subject to regulation by various governmental agencies which oversee areas such as food safety, workforce mobility, environmental laws, animal welfare, financial and tax regulations, and the processing, packaging, storage, distribution, advertising, and labeling of the Company’s products. The Company believes it is in compliance with current laws and regulations and does not expect continued compliance to have a material impact on its capital expenditures, earnings, or \n4\nTable of Contents\ncompetitive position. The Company continues to monitor existing and pending laws and regulations and, while the impact of regulatory changes cannot be predicted with certainty, the Company does not expect compliance to have a material adverse effect on the Company’s business. In addition to compliance with environmental laws and regulations, the Company has set aspirational goals to further improve its sustainability efforts and reduce its environmental impact. These goals are outlined in the Company’s 20 by 30 Challenge and address topics such as renewable sourcing, reducing organic waste and greenhouse gas emissions, supporting regenerative agriculture, packaging sustainability, and reducing food waste. The Company’s greenhouse gas emissions reduction targets were validated by the Science Based Targets initiative.\nSignificant Customers\nThe Company serves many customers throughout the world across various sales channels. Sales to the Company’s largest customer, Walmart Inc. and its subsidiaries (Walmart), accounted for approximately 16 percent of consolidated gross sales less returns and allowances during fiscal 2024. Walmart is a customer for the Company’s Retail and International segments. The Company’s top five customers collectively represented approximately 37 percent of consolidated gross sales less returns and allowances during fiscal 2024. The loss of one or more of the top customers in any of the reportable segments could have a material adverse effect upon such segment’s financial results.\nCompetition\nThe production and sale of meat and food products in the U.S. and internationally is highly competitive. The Company primarily competes with manufacturers of pork and turkey products as well as national and regional producers of other meat and protein sources, such as beef, chicken, fish, nuts, and plant-based proteins.\nAll operating segments compete on the basis of price, product quality and attributes, brand identification, breadth of product line, and customer service. Through effective marketing, a dedicated network of direct and indirect sales personnel, and robust quality assurance programs, the Company’s strategy is to provide high quality products that possess strong brand recognition supported by reliable customer service, to support a higher value proposition for customers. To grow and maintain its competitive position, the Company focuses on meeting consumer preferences, delivering product innovation, and maintaining long-term and lasting relationships with industry partners.\nPatents and Trademarks\nThere are numerous patents and trademarks important to the Company’s business. As of October 27, 2024, the Company held 22 U.S. and eight foreign patents. Most of the trademarks the Company uses are registered in the U.S. and other countries. Some of the more significant owned or licensed trademarks used by the Company or its affiliates are:\nHORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI’S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN’S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST ‘N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN’S, LA VICTORIA, LAYOUT, LLOYD’S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER’S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY.\nThe Company’s patents expire after a term that is typically 20 years from the date of filing, with earlier expiration possible based on the Company’s decision whether to pay required maintenance fees. As long as the Company continues to use its trademarks, they are renewed indefinitely.\nAvailable Information\nThe Company makes available its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 on its website at \nwww.hormelfoods.com\n. These reports are accessible under the caption, “Investors – Financials – SEC Filings” on the Company’s website and are available as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission (SEC). These filings are also available on the SEC’s website at \nwww.sec.gov\n. The documents are available in print, free of charge, to any shareholder who requests them.\nFORWARD-LOOKING STATEMENTS\nThis report contains “forward-looking” information within the meaning of the federal securities laws. The “forward-looking” information may include statements concerning the Company’s outlook for the future as well as other statements of beliefs, future plans, strategies, or anticipated events and similar expressions concerning matters that are not historical facts.\nThe Private Securities Litigation Reform Act of 1995 (the Reform Act) provides a “safe harbor” for forward-looking statements to encourage companies to provide prospective information. The Company is filing this cautionary statement in connection with the Reform Act. When used in the Company’s Annual Report to Stockholders, other filings by the Company with the SEC, the Company’s press releases, and oral statements made by the Company’s representatives, the words or phrases “should result,” “believe,” “intend,” “plan,” “are expected to,” “targeted,” “will continue,” “will approximate,” “is anticipated,” “estimate,” “project,” or \n5\nTable of Contents\nsimilar expressions are intended to identify forward-looking statements within the meaning of the Reform Act. Such statements are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results and those anticipated or projected.\nIn connection with the “safe harbor” provisions of the Reform Act, the Company is identifying risk factors that could affect financial performance and cause the Company’s actual results to differ materially from opinions or statements expressed with respect to future periods. The following discussion of risk factors contains certain cautionary statements regarding the Company’s business, which should be considered by investors and others. Such risk factors should be considered in conjunction with any discussions of operations or results by the Company or its representatives, including any forward-looking discussion, as well as comments contained in press releases, presentations to securities analysts or investors, or other communications by the Company.\nThough the Company has attempted to list comprehensively these important cautionary risk factors, the Company cautions that other factors may in the future prove to be important in affecting the Company’s business or results of operations.\nThe Company cautions readers not to place undue reliance on forward-looking statements, which represent current views as of the date made. Forward-looking statements are inherently at risk to changes in the Company’s business as well as the national and worldwide economic environment. The risks and uncertainties that could cause actual results to differ from those anticipated or projected include, among other things, risks related to the deterioration of economic conditions; risks associated with acquisitions, joint ventures, equity investments, and divestitures; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; the risk of disruption of operations, including at owned facilities, co-manufacturers, suppliers, logistics providers, customers, or other third-party service providers; the risk that the Company may fail to realize anticipated cost savings or operating profit improvements associated with strategic initiatives, including the Transform and Modernize initiative; risk of loss of a significant contract or unfavorable changes in the Company’s relationships with significant customers; risk of the Company’s inability to protect information technology systems against, or effectively respond to, cyber attacks, security breaches or other IT interruptions, against or involving the Company’s IT systems or those of others with whom it does business; risk of the Company’s failure to timely replace legacy technologies; deterioration of labor relations or labor availability or increases to labor costs; general risks of the food industry, including those related to food safety, such as costs resulting from food contamination, product recalls, the remediation of food safety events at its facilities, including the production disruption at the Suffolk, Virginia, facility, or outbreaks of disease among livestock and poultry flocks; fluctuations in commodity prices and availability of raw materials and other inputs; fluctuations in market demand for the Company’s products, including due to private label products and lower-priced alternatives; risks related to the Company’s ability to respond to changing consumer preferences, diets and eating patterns, and the success of innovation and marketing investments; damage to the Company’s reputation or brand image; risks associated with climate change, or legal, regulatory, or market measures to address climate change; risks of litigation; potential sanctions and compliance costs arising from government regulation; compliance with stringent environmental regulations and potential environmental litigation; and risks arising from the Company’s foreign operations, including geopolitical risk, exchange rate risk, legal, tax, and regulatory risk, and risks associated with tariffs.",
    "item1a": "Item 1A. Risk Factors under the heading “The Company may be adversely impacted if the Company is affected by cybersecurity attacks, security breaches, or other IT interruptions, involving its own systems or those with whom it does business.”",
    "item1b": "Item 1B.  UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "Item 1C.  CYBERSECURITY\nRisk Management and Strategy\nAs a global organization, the Company’s information systems are subject to various risks, including, but not limited to risks associated with ransomware, system disruption, data theft, unauthorized access to information, and misuse of data. To identify, address, and mitigate these risks, the Company has developed and maintains a cybersecurity program. The Company’s cybersecurity program is informed by the National Institute of Standards and Technology (NIST) Cybersecurity Framework and the Company’s Enterprise Risk Management (ERM) process and relies on internal and external expertise.\nIntegration with ERM Processes\nThe Company maintains an ERM program with a governance structure that is designed to identify, assess, prioritize, and mitigate risks across the organization. The ERM Executive Committee, comprised of the Company’s senior leadership team, has the ultimate responsibility for overseeing the identification of the key risks facing the Company and meets regularly to discuss the Company’s approach to mitigating those risks. Through the ERM process, cybersecurity has been identified as an important risk facing the Company. As a result, the cybersecurity program is an important component of the Company’s ERM processes. \nIn addition to discussing the cybersecurity program at ERM Executive Committee meetings, members of the ERM Executive Committee participate in the cybersecurity incident response process. This process includes a governance model and procedures for identifying, categorizing, containing, and responding to cybersecurity incidents. As a component of the cybersecurity incident response process, the Company conducts attack simulations and exercises and has used third parties to support this work. The Company also maintains business continuity and disaster recovery plans to prepare for potential technology disruptions and to better position the Company to recover from any cybersecurity incident. The Company’s Disclosure Committee also includes a member of the ERM Executive Committee, helping to ensure timely analysis of disclosure obligations relating to cybersecurity events.\nCybersecurity Program Components\nThe Company’s cybersecurity program includes a focus on governance, processes, technology, and people. Components of the program include the following:\n•\nInvestments in security technology, such as vulnerability management tools, malicious software protection, email security, and around-the-clock monitoring;\n•\nRegular monitoring and updating of the Company’s IT infrastructure, to respond to the dynamic cybersecurity threat environment;\n•\nUse of third parties to assess, test, validate, and strengthen the cybersecurity program, including penetration testing and the periodic use of a third party to assess the quality and maturity of the program against the NIST Cybersecurity Framework; and\n•\nAssessing and managing cybersecurity risks associated with the Company’s relationships with third parties, including technology and service providers, through due diligence efforts and the imposition of contractual obligations.\n12\nTable of Contents\nThe Company’s cybersecurity program also includes employee training and education. Frequent employee training topics include social engineering, phishing, password protection, confidential data protection, asset use, and mobile security. Training emphasizes the importance of reporting incidents promptly to the Company’s security operations team. The Company also conducts periodic phishing tests with employees and provides employees with easy-to-use tools to report potential phishing emails.\nCybersecurity Governance and Oversight\nManagement\nThe Company’s management is responsible for identifying, assessing, and managing the Company’s exposure to cybersecurity risk. The Company has an internal team that is supported by security technologies, third-party experts, and threat intelligence resources in support of cybersecurity risk reduction. The Company's internal cybersecurity team is led by the Company’s Director of Information Security and Compliance, who acts in the capacity of a chief information security officer and is responsible for overseeing the execution of cybersecurity strategy and maturing the Company’s cybersecurity posture. The Director of Information Security and Compliance reports to the Company’s Vice President of IT Services and has education, training, and experience pertinent to cybersecurity, including more than 25 years of IT experience with over 15 years in Information Security and holds the Certified Information Security Systems Professional (CISSP) certification.\nBoard of Directors\nThe Company’s Board of Directors (Board) and its Audit Committee exercise oversight of the Company’s ERM program, including the cybersecurity program. Management, led by the Director of Information Security and Compliance, provides at least three updates per year to the Audit Committee on cybersecurity topics, and the Audit Committee regularly reports to the Board on these presentations. In addition, the Director of Information Security and Compliance provides an annual cybersecurity update to the full Board. Management’s updates cover relevant cybersecurity topics, both ongoing and unique in nature, including risk exposures and management’s actions to monitor and mitigate such risks, emerging threats or regulations, and status updates on projects to strengthen and mature the Company’s systems and cybersecurity programs. Management’s escalation protocol includes reporting of certain cybersecurity threats or incidents to the Audit Committee in a prompt and timely manner.\nImpact of Cybersecurity Risks and Threats\nWhile some of the Company’s third-party service providers have experienced cybersecurity incidents and the Company has experienced threats to its data and systems, as of the date of this report, the Company’s management is not aware of any cybersecurity threats or incidents that have materially affected its business strategy, results of operations, or financial condition. This does not guarantee that future incidents or threats will not have a material impact by interrupting operations, causing reputational harm, increasing operating costs, or exposing the Company to litigation. For additional commentary on cybersecurity risks, see Part 1,"
  }
}