{
  "ticker": "HUBB",
  "cik": "0000048898",
  "company_name": "HUBBELL INC",
  "filing_date": "2025-02-13",
  "accession": "0001628280-25-005311",
  "primary_doc": "hubb-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1\n6\nForm 10-K Summary\n101\nSIGNATURES\n102\n2\nHUBBELL INCORPORATED\n - \nForm 10-K\nPART I\n \nITEM 1    \nBusiness\n \nHubbell Incorporated (herein referred to as “Hubbell”, the “Company”, the “registrant”, “we”, “our” or “us”, which references shall include its divisions and subsidiaries as the context may require) was founded as a proprietorship in 1888, and was incorporated in Connecticut in 1905. Recognized for our innovation, quality, and deep commitment to serving our customers for over 135 years, Hubbell is a world-class manufacturer of electrical and utility solutions, with more than 75 brands used around the world. We provide utility and electrical solutions that enable our customers to operate critical infrastructure reliably and efficiently, and we empower and energize communities through innovative solutions supporting energy infrastructure In Front of the Meter, on The Edge, and Behind the Meter. In Front of the Meter is where utilities transmit and distribute energy to their customers. The Edge connects utilities with owners and operators and allows energy and data to be distributed back and forth. Behind the Meter is where owners and operators of building and other critical infrastructure consume energy. \nOur products are either sourced complete, manufactured or assembled by subsidiaries in the United States, Canada, Puerto Rico, Mexico, the People’s Republic of China (“China”), the United Kingdom (“UK”), Brazil, Australia, Spain, Ireland, and the Republic of the Philippines. Hubbell also participates in joint ventures in Hong Kong and the Republic of the Philippines, and maintains offices in Singapore, Italy, China, India, Mexico, South Korea, Chile, and countries in the Middle East.\nThe Company’s reporting segments consist of the Utility Solutions segment and the Electrical Solutions segment. \nThe Company’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports are made available free of charge through the Investor Relations section of the Company’s website at \nhttp://www.hubbell.com\n as soon as practicable after such material is electronically filed with, or furnished to, the SEC. The information contained on the Company’s website or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this report.\nHUBBELL INCORPORATED\n \n- Form 10-K\n3\nUtility Solutions Segment\nHubbell Utility Solutions has leading positions In Front of the Meter and on The Edge. The Utility Solutions segment (64% of consolidated revenues in 2024, 61% in 2023 and 58% in 2022) consists of businesses that design, manufacture, and sell a wide variety of electrical distribution, transmission, substation, and telecommunications products, which support applications In Front of the Meter. This includes utility transmission & distribution (T&D) components such as arresters, insulators, connectors, anchors, bushings, enclosures, cutouts and switches. The Utility Solutions segment also offers solutions that serve The Edge of the utility infrastructure, including smart meters, communications systems, and protection and control devices. Hubbell Utility Solutions supports the electrical distribution, electrical transmission, water, gas distribution, telecommunications, and solar and wind markets. While Hubbell believes its sales in this area are not materially dependent upon any customer or group of customers, a substantial variability in purchases by electrical utilities would affect this segment.\nProducts of the Utility Solutions segment are sold under various brands and/or trademarks into the electrical distribution, substation and transmission markets as well as, markets for grid protection and controls, utility meters and advanced metering infrastructure and telcom and gas distribution markets. The products are sold into these markets primarily through distributors, or directly to utilities. Brands and/or trademarks of products of the Utility Solutions segment include:\n•\nAclara®\n•\nChance®\n•\nAnderson®\n•\nPenCell®\n•\nFargo®\n•\nHubbell®\n•\nPolycast®\n•\nOpti-loop Design®\n•\nQuazite®\n•\nQuadri*sil®\n•\nTrinetics®\n•\nReuel®\n•\nElectro Composites®\n•\nUSCO™\n•\nCDR™\n•\nRFL Design®\n•\nHot Box®\n•\nPCORE®\n•\nDelmar™\n•\nTurner Electric®\n•\nEMC™\n•\nLongbow™\n•\nOhio Brass®\n•\nMeramec®\n•\nReliaguard®\n•\nGreenjacket®\n•\nArmorcast®\n•\nBeckwith Electric™\n•\nContinental®\n•\nR.W. Lyall™\n•\nGas Breaker®\n•\nAEC™\n•\nRipley®\n•\nElectro Industries / Gauge Tech™\n•\nBalestro™\n•\nSystems Control™\n4\nHUBBELL INCORPORATED\n - \nForm 10-K\nElectrical Solutions Segment\nHubbell Electrical Solutions is positioned Behind the Meter, providing key components to building operators and industrial customers that enable them to manage their energy and operate critical infrastructure more efficiently and effectively. The Electrical Solutions segment (36% of consolidated revenues in 2024, 39% in 2023 and 42% in 2022) comprises businesses that sell stock and custom products including standard and special application wiring device products, rough-in electrical products, and connector and grounding products, as well as other electrical equipment. \nProducts of the Electrical Solutions segment have applications in the light industrial, non-residential, wireless communications, transportation, data center, and heavy industrial markets. Electrical Solutions segment products are typically used in and around industrial, commercial and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies. In addition, certain of our businesses design and manufacture industrial controls and communication systems used in the non-residential and industrial markets. Many of these products are designed such that they can also be used in harsh and hazardous locations where a potential for fire and explosion exists due to the presence of flammable gasses and vapors. Harsh and hazardous products are primarily used in the oil and gas (onshore and offshore) and mining industries. We also offer a variety of wiring devices and electrical products that have residential and utility applications. \nIn December 2023, the Company entered into a definitive agreement to sell its residential lighting business for a cash purchase price of $131 million, subject to customary adjustments. The residential lighting business sells indoor and outdoor lighting solutions. The business generated $187.1 million in sales in 2023. The assets and liabilities of this business are recorded in assets and liabilities held for sale in the Consolidated Balance Sheet as of December 31, 2023. \nThe transaction closed in the first quarter of 2024 and the Company recorded a pre-tax loss on the sale of $5.3 million, which is recorded within Total other expense in the Company\n’\ns Consolidated Statement of Income. \n \nProducts of the Electrical Solutions segment are sold under various brands and/or trademarks and are primarily sold through electrical and industrial distributors, home centers, retail and hardware outlets, and residential product oriented internet sites. Special application products are primarily sold through wholesale distributors to contractors, industrial customers and original equipment manufacturers (“OEMs”). Brands and/or trademarks of products of the Electrical Solutions segment include:\n•\nHubbell®\n•\nBell®\n•\nRaco®\n•\nGleason Reel®\n•\nACME Electric®\n•\nKellems®\n•\nTayMac®\n•\nHipotronics®\n•\nPowerohm®\n•\nEC&M Design®\n•\nBryant®\n•\nWiegmann®\n•\nAccelTex Solutions™\n•\niDevices®\n•\nAustdac™\n•\nBurndy®\n•\nKillark®\n•\nGAI-Tronics®\n•\nConnector Products™\n•\nChalmit™\n•\nCMC®\n•\nHawke™\n•\nPCX™\nHUBBELL INCORPORATED\n \n- Form 10-K\n5\nInformation Applicable to Our Business\nInternational Operations\n \nThe Company has several operations located outside of the United States. These operations manufacture, assemble and/or procure and market Hubbell products and services for both the Utility Solutions and Electrical Solutions segments.\n \nSee Note 21 — Industry Segments and Geographic Area Information in the Notes to Consolidated Financial Statements and",
    "item1a": "ITEM 1A    \nRisk Factors\n \nOur business, operating results, financial condition, and cash flows may be affected by a number of factors including, but not limited to those set forth below. Any one of these factors could cause our actual results to vary materially from recent results or future anticipated results. See also Item 7. Management’s Discussion and Analysis — “Executive Overview of the Business” and “Results of Operations”.\nIndustry and Economic Risks\nInflation and other unfavorable economic conditions may adversely affect our business results of operations and financial condition. \nOur operating results can be sensitive to changes in general economic conditions, macro-economic effects of the U.S. government federal deficit, inflation, economic slowdowns, stagflation and recessions. Our sales are subject to market conditions that may cause customer demand for our products to be volatile and unpredictable. Product demand can be affected by fluctuations in domestic and international economic conditions, as well as currency fluctuations, commodity costs, and a variety of other factors.\nWe have in the past experienced, and may continue to experience, significant inflationary pressure across much of our business. Global supply chain issues and increased demand have in the past led to, and may continue to lead to, increased freight, labor and commodity costs. In addition, various factors, including the level of economic activity in China, the war between Ukraine and Russia and the conflict in the Middle East, have added, and may continue to add, to the volatility in energy costs. We have had to take various pricing actions to cover the increase in our costs associated with inflationary pressure and protect our margin profile. There can be no assurance that we will be able to maintain our margins in response to further changes in inflationary pressures.\nIn addition, macroeconomic effects such as increases in interest rates and other measures taken by central banks and other policy makers could have a negative effect on overall economic activity that could reduce our customers’ demand for our products. Adverse changes in demand could impact our business, collection of accounts receivable and our expected cash flow generation from current and acquired businesses, which may adversely impact our financial condition and results of operations.\nWe operate in markets that are subject to competitive pressures that could affect selling prices or demand for our products.\n \nWe compete on the basis of product performance, quality, service and/or price. Competitors behavior related to these, among other areas, could potentially have significant impacts on our financial results. Our competitive strategy is to design and manufacture high quality products at the lowest possible cost. Our strategy is to also increase selling prices to offset rising costs of raw materials and components when necessary. Competitive pricing pressures may not allow us to offset some or all of our increased costs through pricing actions. Alternatively, if raw material and component costs decline, the Company may not be able to maintain current pricing levels. We may face increased competition due to the rapid development and rising use of artificial intelligence (AI) and machine learning technologies. Failure to adopt and incorporate such technologies to improve productivity, manufacturing technology or support functional teams may put us at a long-term competitive disadvantage. Competition could also affect future selling prices or demand for our products which could have an adverse impact on our results of operations, financial condition and cash flows.\nVolatility in currency exchange rates may adversely affect our financial condition, results of operations and cash flows.\n \nOur international operations accounted for approximatel\ny 8% \nof our Net sales in 2024. We are exposed to the effects (both positive and negative) that fluctuating exchange rates have on translating the financial statements of our international operations, most of which are denominated in local currencies, into the U.S. dollar. Fluctuations in exchange rates may affect product demand and reported profits in our international  operations. In addition, currency fluctuations may affect \nthe prices we pay suppliers for materials used in our products, along with other local costs incurred in foreign countries for foreign entities with U.S. dollar functional currency. As a result, fluctuating exchange rates may adversely impact our results of operations and cash flows. \n10\nHUBBELL INCORPORATED\n - \nForm 10-K\nBusiness and Operational Risks\n  \nOur ability to effectively develop and introduce new products could adversely affect our ability to compete.\n \nNew product introductions and the enhancement of existing products and services are key to the Company’s competitive strategy. The success of new product introductions is dependent on a number of factors, including, but not limited to, timely and successful development of new products, including software development, market acceptance of these products and the Company’s ability to manage the risks associated with these introductions. These risks include development and production capabilities, management of inventory levels to support anticipated demand, the risk that new products may have quality defects in the early stages of introduction, and obsolescence risk of existing products. The Company cannot predict with certainty the ultimate impact new product introductions could have on our results of operations, financial condition or cash flows.\nWe manufacture and source products and materials from various countries throughout the world. A disruption in the availability, price or quality of these products or materials could adversely affect our operating results.\nOur business is subject to risks associated with global manufacturing and sourcing. We use a variety of raw materials in the production of our products including steel, aluminum, brass, copper, bronze, zinc, nickel, plastics, elastomers and petrochemicals. We also purchase certain electrical and electronic components, including solenoids, printed circuit boards, integrated circuit chips and cord sets from a number of suppliers. Certain of these materials are sourced from a limited number of suppliers. These materials may also be a key source of materials for many other companies in our industry or within industrial manufacturers in general. As such in periods of rising demand for these materials, we my experience both increase costs and limited supply. Significant shortages in the availability of these materials or significant price increases could increase our operating costs and adversely impact the competitive positions of our products, which could adversely impact our results of operations. See also Risk Factor, “Changes in U.S. and international trade policies may adversely impact our business and operating results; changes in U.S. trade policies could have a material adverse effect on us.” We rely on materials, components and finished goods that are sourced from or manufactured in foreign countries including Mexico, China, and other international countries. Political instability in any country where we do business could have an adverse impact on our results of operations.\n \nWe rely on our suppliers to produce high quality materials, components and finished goods according to our specifications, including timely delivery. There is a risk that products may not meet our quality control procedure specifications which could adversely affect our ability to ship quality products to our customers on a timely basis and, could adversely affect our results of operations.\nWe may be required to recognize impairment charges for our goodwill and other intangible assets.\n \nAs of December 31, 2024, the net carrying value of our goodwill and other intangible assets totaled approximately $3,581 million. As required by generally accepted \naccounting\n principles, we periodically assess these assets to determine if they are impaired. Impairment of intangible assets may be triggered by developments both within and outside the Company’s control. Deteriorating economic conditions, technological changes, disruptions to our business, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in use of the assets, intensified competition, divestitures, market capitalization declines and other factors may impair our goodwill and other intangible assets. Any charges relating to such impairments could adversely affect our results of operations in the periods an impairment is recognized.\nWe engage in acquisitions and strategic investments and may encounter difficulty in obtaining appropriate acquisitions and in integrating these businesses.\n \nPart of the Company’s growth strategy involves acquisitions. We have pursued and will continue to seek acquisitions and other strategic investments to complement and expand our existing businesses. The rate and extent to which acquisitions become available may affect our growth rate. The success of these transactions will depend on our ability to integrate these businesses into our operations and realize the planned synergies. We may encounter difficulties in integrating acquisitions into our operations and in managing strategic investments and foreign acquisitions and joint ventures may also present additional risk related to the integration of operations across different cultures and languages. Failure to effectively complete or manage acquisitions may adversely affect our existing businesses as well as our results of operations, financial condition and cash flows.\nWe may fail to realize all of the anticipated benefits of the Acquisition of Systems Control or those benefits may take longer to realize than expected. \nThe full benefits of the acquisition of Systems Control, including the anticipated sales or growth opportunities, may not be realized as expected or may not be achieved within the anticipated time frame, or at all. Failure to achieve the anticipated benefits of the acquisition of Systems Control could adversely affect our results of operations or cash flows and decrease or delay the expected accretive effects of the acquisition of Systems Control.\nHUBBELL INCORPORATED\n \n- Form 10-K\n11\nWe may not be able to successfully implement initiatives, including our restructuring activities that improve productivity and streamline operations to control or reduce costs.\n \nAchieving our long-term profitability goals depends significantly on our ability to control or reduce our operating costs. Because many of our costs are affected by factors completely, or substantially outside our control, we generally must seek to control or reduce costs through productivity initiatives. If we are not able to identify and implement initiatives that control or reduce costs and increase operating efficiency, or if the cost savings initiatives we have implemented to date do not generate expected cost savings, our financial results could be adversely affected. Our efforts to control or reduce costs may include restructuring activities involving workforce reductions, facility consolidations and other cost reduction initiatives. If we do not successfully manage our current restructuring activities, or any other restructuring activities that we may undertake in the future, expected efficiencies and benefits may be delayed or not realized, and our operations and business could be disrupted, which could have an adverse effect on our results of operations, financial condition and cash flows.\nWe are subject to risks surrounding our information technology systems and industrial controls systems failures, network disruptions, breaches in data security and compliance with data privacy laws or regulations.\n \nWe are highly dependent on various software and information technology systems to record and process operational, human resources and financial transactions. The proper functioning of Hubbell’s information technology systems is critical to the successful operation of our business. Our information technology systems are susceptible to cyber threats, malware, phishing attacks, break-ins and similar events, breaches of physical security or tampering and manipulation of these systems by employees or unauthorized third parties. Information security risks also exist with respect to the use of portable electronic devices, such as smartphones and laptops, which are particularly vulnerable to loss and theft. Hubbell may also be subject to disruptions of any of our systems and our vendor’s systems arising from events that are wholly or partially beyond our control, such as natural disasters, acts of terrorism, cyber-attacks, computer viruses, and electrical/telecommunications outages or failures\n.\n All of these risks are also applicable where Hubbell relies on outside vendors to provide services, which may operate in an online, or “cloud,” environment. A failure of our information technology systems could adversely affect our ability to process orders, maintain proper levels of inventory, collect accounts receivable and pay expenses; all of which could have an adverse effect on our results of operations, financial condition and cash flows. In addition, security breaches could result in unauthorized disclosure of confidential information that may result in financial or reputational damage to the Company, as well as expose the Company to litigation and regulatory enforcement actions.\nHubbell also provides customers with industrial controls systems, or solutions that include software components that allow for the control and/or the communication of data from those solutions to Hubbell or customer systems. In addition to the risks noted above, there are other risks associated with these solutions. For example, control and/or data from these solutions may be integral to a customer’s operations. A failure of our technology to operate as designed or as a result of cyber threats could impact those operations, including by loss or destruction of data. Likewise, a customer’s failure to properly configure its own network are outside of the Company’s control and could result in a failure in functionality or security of our technology.\nHubbell is also subject to an increasing number of evolving data privacy and security laws and regulations that impose requirements on the Company and our technology prior to certain use or transfer, storing, processing, disclosure, and protection of data and prior to sale or use of certain technologies. Failure to comply with such laws and regulations could result in the imposition of fines, penalties and other costs. For example, the European Union’s implementation of the General Data Protection Regulation in 2018, the European Union’s pending ePrivacy Regulation and the implementation of the ePrivacy Directive by the various European Union member states, and California’s implementation of its Consumer Privacy Act of 2018 and Connected Device Privacy Act of 2018, as well as data privacy statutes implemented by other states, could all disrupt our ability to sell products and solutions or use and transfer data because such activities may not be in compliance with applicable law in certain jurisdictions.\n  \nWe have continued to work on improving our utilization of our enterprise resource planning system, expanding standardization of business processes and performing implementations at our remaining businesses, as well as acquired businesses, for example, the implementation of our enterprise resource planning system in 2024 at Aclara. We expect to incur additional costs related to future implementations, process reengineering efforts as well as enhancements and upgrades to the system. These system modifications and implementations could result in operating inefficiencies which could adversely impact our operating results and/or our ability to perform necessary business transactions.\nSystem failures, ineffective system implementation or disruptions, failure to comply with data privacy and security laws or regulations, IT system risk arising from the Company’s acquisition activity or the compromise of security with respect to internal or external systems or portable electronic devices could damage the Company’s systems or infrastructure, subject us to liability claims, or regulatory fines, penalties, or intervention, harm our reputation, interrupt our operations, disrupt customer operations, and adversely affect the Company’s internal control over financial reporting, business, financial condition, results of operations, or cash flows. \n12\nHUBBELL INCORPORATED\n - \nForm 10-K\nOur ability to access capital markets or failure to maintain our credit ratings may adversely affect our business.\n \nOur ability to invest in our business and make strategic acquisitions may require access to the capital markets. If general economic and capital market conditions deteriorate significantly, it could impact our ability to access capital. Failure to maintain our credit ratings could also impact our ability to access credit markets and could increase our cost of borrowing. The capital and credit markets could deteriorate and market conditions could make it more difficult for us to access capital to finance our investments and acquisitions, which could adversely affect our results of operations, financial condition and cash flows.\nDeterioration in the credit quality of, loss of, significant decline in business with, or pricing pressure from, our customers could have a material adverse effect on our operating results and financial condition.\n \nWe have an extensive customer base of distributors, wholesalers, electric utilities, OEMs, electrical contractors, telecommunications companies and retail and hardware outlets. We are not dependent on a single customer, however, our top ten customers account for approximately 41% of our Net sales. Deterioration in the credit quality of, loss of, significant decline in business with, or pricing pressure from, one or more of our major customers could adversely affect our results of operations, financial condition and cash flows.  \nWe have outstanding indebtedness; our indebtedness may increase as we engage in acquisitions and other activities to support our growth strategies.\nAn increase in indebtedness and related debt service obligations could have negative consequences, including (i) requiring us to dedicate significant cash flow from operations to the payment of principal and interest on our indebtedness, which would reduce the funds we have available for other purposes, (ii) reducing our flexibility in planning for or reacting to changes in our business and market conditions and (iii) exposing us to interest rate risk since a portion of our debt obligations are at variable rates. These risks could increase if we are required to re-finance existing indebtedness at higher rates of interest.\nWe may incur significantly more indebtedness in the future. If we add new indebtedness and do not retire existing indebtedness, the risks described above could increase.\nIf the underlying investments of our defined benefit plans do not perform as expected, we may have to make additional contributions to these plans.\n \nWe sponsor certain pension and other postretirement defined benefit plans. The performance of the financial markets and interest rates impact these plan expenses and funding obligations. Significant changes in market interest rates, investment losses on plan assets and reductions in discount rates may increase our funding obligations and could adversely impact our results of operations, cash flows, and financial condition. Furthermore, there can be no assurance that the value of the defined benefit plan assets will be sufficient to meet future funding requirements.\nLegal, Tax and Regulatory Risks\nChanges in tax law relating to multinational corporations could adversely affect our tax position.\nGovernment agencies and the Organisation for Economic Co-operation and Development (“OECD”) have focused on issues related to the taxation of multinational corporations. One example is in the area of “base erosion and profit shifting,” for which the OECD has released several components of its comprehensive plan that have been adopted and expanded by many taxing authorities to address perceived tax abuse and inconsistencies between tax jurisdictions. As a result, the tax laws and policies in countries in which we do business could change on a prospective or retroactive basis, and any such changes, including any changes in the current U.S. income tax rates, may materially impact the Company’s business and financial statements.\nBecause tax laws and regulations are subject to interpretation, uncertainty, and change, tax payments may ultimately differ from amounts currently recorded by the Company.\n \nWe are subject to income taxes as well as non-income based taxes, in both the United States and numerous foreign jurisdictions. The determination of the Company’s worldwide provision for income taxes and other tax liabilities requires judgment and is based on diverse legislative and regulatory structures that exist in the various jurisdictions where the company operates. As a result of the U.S. federal elections, there may also be changes in tax policy pursued by the new administration, and the nature and outcome of those potential changes is uncertain at this time. Although management believes its estimates are reasonable, the ultimate tax outcome may differ from the amounts recorded in the Company’s financial statements and may materially impact the Company’s financial results for the period when such determination is made.  We are subject to ongoing tax audits in various jurisdictions. Tax authorities may disagree with certain positions we have taken and assess additional taxes. We regularly assess the likely outcomes of these audits in order to determine the appropriateness of our tax provisions. However, there can be no assurance that we will accurately predict the outcomes of these audits, and the future outcomes of these audits could adversely affect our results of operations, financial condition and cash flows.\nHUBBELL INCORPORATED\n \n- Form 10-K\n13\nChanges in U.S. and international trade policies may adversely impact our business and operating results; changes in U.S. trade policies could have a material adverse effect on us.\nWe cannot predict what changes to trade policy will be made, or the economic impact that changes to trade policy will have, including significant increases in tariffs on goods imported into the United States, particularly tariffs on products manufactured in Canada, Mexico and China, and the length of time such tariffs may remain in place, or whether the entry into new bilateral or multilateral trade agreements will occur. The imposition of new tariffs, changes in trade policy or agreements, or the escalation of trade tensions between the United States and other countries could adversely impact our business, financial condition and results of operations.\nIn prior years, the U.S. government has announced and, in some cases, implemented new approaches to trade policy, including renegotiating, or potentially terminating, certain existing bilateral or multi-lateral trade agreements, such as the North American Free Trade Agreement (“NAFTA”), which was replaced by the U.S.-Mexico-Canada Agreement on July 1, 2020, and is currently up for review in 2026, as well as implementing the imposition of additional tariffs on certain foreign goods, including finished products and raw materials such as steel and aluminum. Additionally, on February 1, 2025 the President of the United States issued executive orders directing the United States to impose new tariffs on imports from Canada, Mexico and China. Although a portion of these new tariffs have been temporarily suspended, other parts of these new tariffs are now in effect, and it is unclear for how long and to what extent such suspensions will remain in effect. The U.S. has also announced new tariffs on foreign steel and aluminum, with such tariffs taking effect in early March. The U.S. has further raised the possibility of new tariffs on imports from additional countries, including those in Europe. These and other changes in the U.S. trade policy, U.S. social, political, regulatory and economic conditions or in laws and policies governing foreign trade, manufacturing, development and investment in the territories and countries where we currently manufacture and sell products, and any resulting negative sentiments towards the United States as a result of such changes, could have an adverse effect on our business, financial condition and results of operation.\n  \nWe rely on materials, components and finished goods\n,\n such as steel and aluminum, that are sourced from or manufactured in foreign countries\n,\n including China, Mexico and those in Europe. Import tariffs and potential additional import tariffs have resulted or may result in increased prices for these imported goods and materials and, in some cases\n,\n may result or have resulted in price increases for domestically sourced goods and materials. Changes in U.S. trade policy have resulted and could result in additional reactions from U.S. trading partners, including adopting responsive trade policies making it more difficult or costly for us to export our products or import goods and materials from those countries. These measures could also result in increased costs for goods imported into the U.S. or may lead to disruptions in the supply of good and materials that cause us to adjust our worldwide supply chain. Either of these could require us to increase prices to our customers which may reduce demand, or, if we are unable to increase prices, result in lowering our margin on products sold. \nIn recent years, various countries, and regions, including, without limitation, China, Mexico, Canada and Europe, have announced plans or intentions to impose or have imposed tariffs on a wide range of U.S. products in retaliation for new U.S. tariffs. These actions could, in turn, result in additional tariffs being adopted by the U.S. These conditions and future actions could have a significant adverse effect on world trade and the world economy. To the extent that trade tariffs and other restrictions imposed by the United States increase the price of, or limit the amount of, raw materials and finished goods imported into the United States, the costs of our raw materials may be adversely affected and the demand from our customers for products and services may be diminished, which could adversely affect our revenues and profitability.\nWe cannot predict future trade policy or the terms of any renegotiated trade agreements and their impacts on our business. The adoption and expansion of trade restrictions, the occurrence of a trade war, or other governmental action related to new tariffs or trade agreements or policies has the potential to adversely impact demand for our products, our costs, our customers, our suppliers, and the U.S. economy, which in turn could adversely impact our business, financial condition and results of operations.\nOur business and results of operations may be materially adversely effected by compliance with import and export laws.\nWe must comply with various laws and regulations relating to the import and export of products, services and technology from the U.S. and other countries having jurisdiction over our operations, which may affect our transactions with certain customers, business partners and other persons. In certain circumstances, export control and economic sanctions regulations may prohibit the export of certain products, services and technologies and in other circumstances, we may be required to obtain an export license before exporting a controlled item. The length of time required by the licensing processes can vary, potentially delaying the shipment of products or performance of services and the recognition of the corresponding revenue. In addition, failure to comply with any of these regulations could result in civil and criminal, monetary and non-monetary penalties, disruptions to our business, limitations on our ability to import and export products and services and damage to our reputation. Moreover, any changes in export control or sanctions regulations may further restrict the export of our products or services, and the possibility of such changes requires constant monitoring to ensure we remain compliant. Any restrictions on the export of our products or product lines could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\n14\nHUBBELL INCORPORATED\n - \nForm 10-K\nWe could incur significant and/or unexpected costs in our efforts to successfully avoid, manage, defend and litigate intellectual property matters.\n \nThe Company relies on certain patents, trademarks, copyrights, trade secrets and other intellectual property of which the Company cannot be certain that others have not and will not infringe upon. Intellectual property litigation could be costly and time consuming and the Company could incur significant legal expenses pursuing these claims against others.\n \nFrom time to time, we receive notices from third parties alleging intellectual property infringement. Any dispute or litigation involving intellectual property could be costly and time-consuming due to the complexity and the uncertainty of intellectual property litigation. Our intellectual property portfolio may not be useful in asserting a counterclaim, or negotiating a license, in response to a claim of infringement or misappropriation. In addition, as a result of such claims, the Company may lose its rights to utilize critical technology or may be required to pay substantial damages or license fees with respect to the infringed rights or be required to redesign our products at a substantial cost, any of which could negatively impact our operating results. Even if we successfully defend against claims of infringement, we may incur significant costs that could adversely affect our results of operations, financial condition and cash flow. See Item 3 “Legal Proceedings” for a discussion of our legal proceedings.\nWe are subject to litigation and environmental regulations that may adversely impact our operating results.\nWe are a party to a number of legal proceedings and claims, including those involving product liability, intellectual property and environmental matters, which could be significant. It is not possible to predict with certainty the outcome of every claim and lawsuit. In the future, we could incur judgments or enter into settlements of lawsuits and claims that could have a materially adverse effect on our results of operations, cash flows, and financial condition. In addition, we maintain insurance coverage with respect to certain claims, which insurance may not provide adequate coverage against such claims. We establish reserves based on our assessment of contingencies, including contingencies related to legal claims asserted against us. Subsequent developments in legal proceedings may affect our assessment and estimates of the loss contingency recorded as a reserve and require us to make additional payments, which could have a materially adverse effect on our results of operations, financial condition and cash flow.\nWe are also subject to various laws and regulations relating to environmental protection and the discharge of materials into the environment, and we could incur substantial costs as a result of the noncompliance with or liability for clean up or other costs or damages under environmental laws. In addition, we could be affected by future laws or regulations, including those imposed in response to climate change concerns. Environmental laws and regulations have generally become stricter in recent years. Compliance with any future laws and regulations could result in a materially adverse effect on our business and financial results. See Item 3 “Legal Proceedings” for a discussion of our legal proceedings.\nOur reputation and our ability to conduct business may be impaired by improper conduct by any of our employees, agents or business partners.\n \nWe cannot provide absolute assurance that our internal controls and compliance systems will always protect us from acts committed by our employees, agents or business partners that would violate U.S. and/or non-U.S. laws, including the laws governing payments to government officials, bribery, fraud, anti-kickback and false claims rules, competition, export and import compliance, money laundering and data privacy. In particular, the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, and similar anti-bribery laws in other jurisdictions generally prohibit companies and their intermediaries from making improper payments to government officials for the purpose of obtaining or retaining business, and we operate in parts of the world that have experienced governmental corruption to some degree. Despite meaningful measures that we undertake to facilitate lawful conduct, which include training and internal control policies, these measures may not always prevent reckless or criminal acts by our employees or agents. Any such improper actions could damage our reputation and subject us to civil or criminal investigation in the United States and in other jurisdictions, could lead to substantial civil and criminal, monetary and non-monetary penalties and could cause us to incur significant legal and investigative fees.\nRegulations related to conflict-free minerals may cause us to incur additional expenses and may create challenges with our customers.\n \nThe Dodd-Frank Wall Street Reform and Consumer Protection Act contains provisions to improve transparency and accountability regarding the use of “conflict” minerals mined from the Democratic Republic of Congo and adjoining countries (“DRC”). The SEC has established annual disclosure and reporting requirements for those companies who use “conflict” minerals sourced from the DRC in their products. These requirements could limit the pool of suppliers who can provide conflict-free minerals and as a result, we cannot ensure that we will be able to obtain these conflict-free minerals at competitive prices. Compliance with these requirements may also increase our costs. In addition, we may face challenges with our customers if we are unable to sufficiently verify the origins of the minerals used in our products.\nHUBBELL INCORPORATED\n \n- Form 10-K\n15\nGeneral Risk Factors\nOur success depends on attracting and retaining qualified personnel.\n \nOur ability to sustain and grow our business requires us to hire, retain and develop a highly skilled and diverse management team and workforce. Failure to ensure that we have the depth and breadth of personnel with the necessary skill set and experience, or the loss of key employees, could impede our ability to deliver our growth objectives and execute our strategy.\nWe face the potential harms of natural disasters, terrorism, acts of war, international conflicts or other disruptions to our operations.\nNatural disasters, the economic uncertainty resulting from the spread of global pandemics, acts or threats of war or terrorism, international conflicts, and the actions taken by the United States and other governments in response to such events have in the past, and could in the future cause damage to or disrupt our business operations, our suppliers or our customers, and could create political or economic instability, any of which could have an adverse effect on our business. For example, increases in energy demand and supply disruptions caused by the conflict in Ukraine have resulted in significantly higher energy prices, particularly in Europe. Additionally, the conflict in the Middle East has added to the volatility in energy costs. Persistent high energy prices and the potential for further supply disruptions, may have an adverse impact on our business.  Although it is not possible to predict such events or their consequences, these events could decrease demand for our products, make it difficult or impossible for us to deliver products, or disrupt our supply chain.\nGlobal economic uncertainty could adversely affect us.\n \nDuring periods of prolonged slow growth, or a downturn in conditions in the worldwide or domestic economies, we could experience reduced orders, payment delays, supply chain disruptions or other factors caused by economic challenges faced by our customers, prospective customers and suppliers. Depending upon their severity and duration, these conditions could have an adverse impact on our results of operations, financial condition and cash flows.\n16\nHUBBELL INCORPORATED\n - \nForm 10-K",
    "item1b": "ITEM 1B    \nUnresolved Staff Comments\n \nNone.",
    "item1c": "ITEM 1C    \nCybersecurity \nRisk Management and Strategy\n \nHubbell recognizes the importance of maintaining cybersecurity measures to safeguard our information systems and protect the confidentiality, integrity, and availability of our data, networks and technology assets. Cybersecurity related risks are included in the risk universe that our enterprise risk management program evaluates to assess top risks to the enterprise on an annual basis. To the extent the enterprise risk management process identifies a heightened cybersecurity-related risk, risk owners are assigned to develop mitigation plans, which are then tracked to completion. Cybersecurity related risks are also considered as part of our business continuity and resiliency planning. \nBusiness continuity plans establish risk management processes and procedures to mitigate interruptions to business activities, including from cybersecurity incidents.\nGiven the complexity and evolving nature of the cybersecurity threat landscape, Hubbell has a dedicated team of internal and external cybersecurity professionals, led by Hubbell’s \nChief Information Security Officer (“CISO”),\n that regularly monitor alerts and meet to discuss threat levels, trends, and remediation. We engage a range of external experts, including cybersecurity assessors, consultants, and auditors in evaluating and testing our cybersecurity program. \nThe engagement of \nthird parties\n includes regular audits, threat assessments, and information system penetration tests. We also actively engage with key vendors, industry participants, legal counsel, and intelligence and law enforcement communities as part of our continuing efforts to evaluate and enhance the effectiveness of our cybersecurity policies and procedures. Hubbell further recognizes risks associated with the use of third-party service providers and has processes to identify material risks related to third parties. We conduct security assessments of third-party providers prior to their engagement and perform ongoing monitoring to ensure compliance with our cybersecurity standards. Our monitoring includes periodic assessments by the CISO and a team of cybersecurity professionals. Our cybersecurity risk management program is aligned to the National Institute of Standards and Technology Cyber Security Framework (NIST CSF).\n \nWe have not encountered any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to affect our business strategy, results of operations or financial condition. Notwithstanding the extensive approach we take to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us.\n See Item IA. Risk Factors for potential risks related to our information technology systems that we are subject to and that may materially adversely affect our business (“We are subject to risks surrounding our information technology systems failures, network disruptions, breaches in data security and compliance with data privacy laws or regulations.”).\nGovernance\n \n \nHubbell’s Board of Directors (the “\nBoard\n”) recognizes the critical nature of managing risks associated with cybersecurity threats. The Audit Committee of the Board has been delegated oversight of risks associated with cybersecurity threats and has developed mechanisms to ensure effective oversight in managing such cybersecurity risks. The Audit Committee is composed of Board members with diverse expertise, including cybersecurity and technology, financial, and risk management experience.\n \nHubbell’s cybersecurity program is managed by a dedicated CISO who has over a decade of information technology and program management experience.\n The CISO is responsible for leading our enterprise-wide cybersecurity program and assessing, monitoring, and managing our cybersecurity risks. These responsibilities include overseeing cybersecurity governance programs, testing our compliance with standards, remediating known risks, completing cybersecurity risk management activities related to acquisition due diligence and integration, and leading our employee cybersecurity training program. The CISO stays current with the latest developments in cybersecurity and the evolving threat landscape to inform cybersecurity prevention, detection, mitigation, and remediation efforts. The CISO implements and oversees processes for the regular monitoring of our information systems. This includes processes to identify potential vulnerabilities. In the event of a cybersecurity incident, the CISO is equipped with a detailed incident response plan which outlines the steps to be followed from incident detection to mitigation, notifications, and recovery. Notifications include functional areas (including legal), senior management and the Board, as applicable. We have adopted and enforce various enterprise-wide policies relating to cybersecurity, to ensure the ongoing protection of our systems including, policies to identify, classify, and protect company data, manage vulnerabilities, and perform user access reviews. We further conduct drills of our incident response plan to prepare incident response teams and provide cybersecurity training and phishing simulations throughout the year via our enterprise learning management systems.\n \nHUBBELL INCORPORATED\n \n- Form 10-K\n17\nThe CISO provides regular (but not less than quarterly) updates to the Audit Committee. These updates include a broad range of topics, including the current cybersecurity and emerging threat landscape, the status of ongoing cybersecurity initiatives and strategies, incident reports, and the results of internal and external assessments of our information systems. The CISO, in his capacity, regularly informs our Chairman, President and Chief Executive Officer; EVP, Chief Financial Officer; and SVP, General Counsel and Secretary on aspects related to cybersecurity risks and incidents. This ensures that the highest levels of management, including the Company’s Disclosure Committee, are made aware of Hubbell’s cybersecurity posture and potential cybersecurity risks. Furthermore, any material cybersecurity matters, and strategic cybersecurity risk management matters are promptly escalated to the Audit Committee of the Board."
  }
}