{
  "ticker": "HUM",
  "cik": "0000049071",
  "company_name": "HUMANA INC",
  "filing_date": "2025-02-20",
  "accession": "0000049071-25-000007",
  "primary_doc": "hum-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS \n General\nHeadquartered in Louisville, Kentucky, Humana Inc. and its subsidiaries, referred to throughout this document as “we,” “us,” “our,” the “Company” or “Humana,” is committed to putting health first – for our teammates, our customers, and our company. Through our Humana insurance services, and our CenterWell health care services, we make it easier for the millions of people we serve to achieve their best health – delivering the care and service they need, when they need it. These efforts are leading to a better quality of life for people with Medicare, Medicaid, families, individuals, military service personnel, and communities at large. \n As of December 31, 2024, we had approximately 16 million members in our medical benefit plans, as well as approximately 5 million members in our specialty products. During 2024, 85% of our total premiums and services revenue were derived from contracts with the federal government, including 14% derived from our individual Medicare Advantage contracts in Florida with the Centers for Medicare and Medicaid Services, or CMS, under which we provide health insurance coverage to approximately 924,800 members as of December 31, 2024.\nHumana Inc. was organized as a Delaware corporation in 1964. Our principal executive offices are located at 500 West Main Street, Louisville, Kentucky 40202, the telephone number at that address is (502) 580-1000, and our website address is www.humana.com. We have made available free of charge through the Investor Relations section of our web site our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and, if applicable, amendments to those reports filed or furnished pursuant to Section 13(a) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission.\nThis Annual Report on Form 10-K, or 2024 Form 10-K, contains both historical and forward-looking information. See Part I,",
    "item1a": "Item 1A, \"Risk Factors\" of this Form 10-K.\nGovernance\nAs part of its overall responsibility for oversight of our enterprise risk management, our Board of Directors reviews material risks to our Company, including risks from cybersecurity threats.\n \nThe Board has designated our Audit Committee and Technology Committee with joint oversight over our information technology internal controls, cybersecurity, business continuity and disaster recovery programs.\n \nManagement is responsible for designing and implementing our governance framework and controls for managing our material risks from cybersecurity threats, under the oversight of our Board of Directors.  \nOur \nChief Information Security Officer\n is responsible for assessing and managing identified cybersecurity risks, evaluating and remediating cybersecurity incidents, and sharing information directly with the Audit Committee and Technology Committee, or \nfull Board of Directors\n, when appropriate. Our Chief Information Security Officer reports to our \n35\nChief Information Officer, who is in turn responsible for the management of Humana’s data and information technology risks more generally.\n \nOur Chief Information Officer is a senior executive with more than two decades of experience leading technology teams in large, regulated industries. Our Chief Information Security Officer is an experienced cybersecurity executive and leader in the field, with many years of relevant experience working in highly regulated industries.\n \nAmong our cybersecurity and risk teams, we utilize established governance mechanisms to enable a transparent and holistic approach to cybersecurity risk management, and the evaluation and remediation of cybersecurity incidents. These processes enable cross-functional engagement from our enterprise information protection, enterprise risk management, enterprise compliance, information technology, legal, privacy, and data governance teams.  \nAs a key component of this governance framework, the Audit Committee and Technology Committee also receive regular updates regarding our cybersecurity program and cybersecurity incidents from our Chief Information Security Officer.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\n34",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nIn the ordinary course of our business, we process, store and transmit large amounts of data, and rely on third-party service providers to do the same, including sensitive personal information as well as proprietary or confidential information relating to our business or a third-party with which we do business. \nThe protection of information and business processes is an integrated component in our overall risk management program, and reflected in our Code of Ethics, security standards, and privacy policies.\n We employ processes to safeguard information and protect our customers’ data, including by deploying both proactive and defensive practices against the evolving cyber threat landscape.\n Examples of these processes include:\na.\nEmploying a qualified Chief Information Security Officer.\nb.\nMaintaining tools to identify malicious cyber activity. \nc.\nMonitoring risks posed by threat actors, including through partnerships with industry groups and government agencies. \nd.\nProviding annual cybersecurity training to our associates. \ne.\nTesting our associates’ knowledge through internal phishing simulations. \nf.\nEngaging an independent third-party audit firm to perform an Annual Service Organizational Controls (SOC) 2 audit of enterprise claims platforms.\n \ng.\nReporting data breaches, as required by law, to the U.S. Department of Health and Human Services (HHS), Office for Civil Rights (OCR), and various state agencies; our reports are publicly available, free of charge, and can be obtained through the OCR Portal at https://ocrportal.hhs.gov/ocr/breach.\nh.\nMaintaining a program to identify cybersecurity risks associated with certain third-party vendors, which is one component of an overall vendor risk management program.\nWe also enhance our information technology infrastructure and security protocols to assess, identify, protect against, and manage material risks from cybersecurity threats following a risk-based approach. In addition, we conduct cybersecurity risk assessments at least annually, and periodically engage an independent auditor or other external assessors to aid in pro-active risk identification, prevention, detection, mitigation, and remediation.  Our efforts to manage against cybersecurity threats are further guided by Federal and state laws, as well as contractual commitments with third parties, which regulate our collection, use and disclosure of confidential information such as protected health information and personally identifiable information. \nAlthough we have been subject to breaches of our information technology systems, including breaches of the information technology systems of third-party service providers, the impact of such attacks has not been material to our business strategy, operations or results of operations, financial position, or cash flows through December 31, 2024. We do not believe that cybersecurity threats resulting from any previous cybersecurity incidents of which we are aware are reasonably likely to materially affect the Company.\n For additional information on the risks we face from cybersecurity threats, please refer to Part I,"
  }
}