{
  "ticker": "HWM",
  "cik": "0000004281",
  "company_name": "Howmet Aerospace Inc.",
  "filing_date": "2025-02-14",
  "accession": "0000004281-25-000011",
  "primary_doc": "hwm-20241231.htm",
  "item_sections": {
    "item1": "Item 1\n (Business).\nItem 3. Legal Proceedings.\nIn the ordinary course of its business, Howmet is involved in a number of lawsuits and claims, both actual and potential. For a discussion of legal proceedings, see \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n of this Form 10-K.\nItem 4. Mine Safety Disclosures.\nNot applicable.\nPART II\nItem 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nThe Company’s common stock is listed on the New York Stock Exchange under the symbol “HWM.”\nThe number of holders of record of common stock was 8,656 as of February 10, 2025.\n18\nTable\n \nof\n Contents\nStock Performance Graph\nThe following graph compares the most recent five-year performance of the Company’s common stock with (1) the Standard & Poor’s (“S&P”) 500\n®\n Index, (2) the S&P 500\n®\n Industrials Index, a group of 78 companies categorized by Standard & Poor’s as active in the “industrials” market sector, and (3) the S&P 500\n®\n Aerospace & Defense Index, which comprises Axon Enterprise, Inc., General Dynamics Corporation, General Electric Company (operating as GE Aerospace), Howmet Aerospace Inc., Huntington Ingalls Industries, Inc., L3Harris Technologies, Inc., Lockheed Martin Corporation, Northrop Grumman Corporation, RTX Corporation, Textron Inc., The Boeing Company, and Transdigm Group Incorporated. \nThe graph assumes, in each case, an initial investment of $100 on December 31, 2019, and the reinvestment of dividends. The historical prices of the Company presented in the graph and table have been adjusted to reflect the impact of the April 2020 Arconic Inc. Separation Transaction by removing the estimated value of Arconic Corporation rather than reflecting the value of Arconic Corporation as a dividend as of April 1, 2020. The graph, table and related information shall not be deemed to be “filed” with the SEC, nor shall such information be incorporated by reference into future filings under the Securities Act of 1933 or Securities Exchange Act of 1934, each as amended, except to the extent that the Company specifically incorporates it by reference into such filing.\nAs of December 31,\n2019\n2020\n2021\n2022\n2023\n2024\nHowmet Aerospace Inc.\n$\n100.00 \n$\n121.11 \n$\n135.24 \n$\n167.93 \n$\n231.48 \n$\n469.20 \nS&P 500\n®\n Index\n100.00 \n118.40 \n152.39 \n124.79 \n157.59 \n197.02 \nS&P 500\n®\n Industrials Index\n100.00 \n111.06 \n134.52 \n127.15 \n150.20 \n176.44 \nS&P 500\n®\n Aerospace & Defense Index\n100.00 \n83.94 \n95.03 \n111.54 \n119.09 \n136.24 \n19\nTable\n \nof\n Contents\nSupplemental Stock Performance Graph Beginning with Arconic Inc. Separation Transaction\nIn addition, the Company is providing the following supplemental graph which begins on April 1, 2020, the effective date of the Arconic Inc. Separation Transaction. The graph compares the Company’s common stock performance from April 1, 2020 to December 31, 2024 with (1) the S&P 500\n®\n Index, (2) the S&P 500\n®\n Industrials Index and (3) the S&P 500\n®\n Aerospace & Defense Index. \nThe graph assumes, in each case, an initial investment of $100 on April 1, 2020, the date of the Arconic Inc. Separation Transaction and the reinvestment of dividends. The historical prices of the Company presented in the graph and table have been adjusted to reflect the impact of the April 2020 Arconic Inc. Separation Transaction by removing the estimated value of Arconic Corporation rather than reflecting the value of Arconic Corporation as a dividend as of April 1, 2020.\nAs of\n4/1/2020\n12/31/2020\n12/31/2021\n12/31/2022\n12/31/2023\n12/31/2024\nHowmet Aerospace Inc.\n$\n100.00 \n$\n216.21 \n$\n241.44 \n$\n299.80 \n$\n413.25 \n$\n837.65 \nS&P 500\n®\n Index\n100.00 \n147.26 \n189.53 \n155.20 \n196.00 \n245.04 \nS&P 500\n®\n Industrials Index\n100.00 \n152.24 \n184.39 \n174.29 \n205.89 \n241.86 \nS&P 500\n®\n Aerospace & Defense Index\n100.00 \n126.52 \n143.25 \n168.13 \n179.51 \n205.36 \n20\nTable\n \nof\n Contents\nIssuer Purchases of Equity Securities\nThe following table presents information with respect to the Company’s open-market repurchases of its common stock during the quarter ended December 31, 2024:\nPeriod\nTotal Number \nof Shares Purchased\nAverage\nPrice Paid\nPer Share\n(1)\nTotal Number\nof Shares\nPurchased as\nPart of Publicly\nAnnounced\nRepurchase\nPlans or\nPrograms\nApproximate\nDollar Value\nof Shares that\nMay Yet Be\nPurchased Under\nthe Plans or\nPrograms (in millions)\n(1)(2)\nOctober 1 - October 31, 2024\n872,490 \n$\n103.15 \n872,490 \n$\n2,297 \nNovember 1 - November 30, 2024\n386,401 \n$\n116.46 \n386,401 \n$\n2,252 \nDecember 1 - December 31, 2024\n472,302 \n$\n116.45 \n472,302 \n$\n2,197 \nTotal for quarter ended December 31, 2024\n1,731,193 \n$\n109.75 \n1,731,193 \n(1)\nExcludes commissions cost.\n(2)\nThe Company has a share repurchase program (the “Share Repurchase Program”) that, after giving effect to the additional $50 million share repurchases made in January 2025 at an average price per share of $116.39, retiring approximately 0.4 million shares, has approximately $2,147 million in Board authorization remaining available as of January 31, 2025. The current Share Repurchase Program was authorized by the Company’s Board of Directors on August 18, 2021 at $1,500 million, which was increased by the Board by $2,000 million on July 30, 2024. Under the Company’s Share Repurchase Program, the Company may repurchase shares by means of trading plans established from time to time in accordance with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, block trades, private transactions, open market repurchases and/or accelerated share repurchase agreements or other derivative transactions. There is no stated expiration for the Share Repurchase Program. Under its Share Repurchase Program, the Company may repurchase shares from time to time, in amounts, at prices, and at such times as the Company deems appropriate, subject to market conditions, legal requirements and other considerations. The Company is not obligated to repurchase any specific number of shares or to do so at any particular time, and the Share Repurchase Program may be suspended, modified, or terminated at any time without prior notice.\nItem 6. Selected Financial Data.\nReserved.\n21\nTable\n \nof\n Contents\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n(dollars in millions, except share and per-share amounts)\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and notes thereto included in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nOverview\nOur Business\nHowmet is a global leader in lightweight metals engineering and manufacturing. Howmet’s innovative, multi-material products, which include nickel, titanium, aluminum, and cobalt, are used worldwide in the aerospace (commercial and defense), commercial transportation, and industrial and other markets. \nHowmet is a global company operating in 19 countries. Based upon the country where the point of shipment occurred, North America and Europe generated 71% and 23%, respectively, of Howmet’s sales in 2024. In addition to the United States, Canada, and Mexico in North America and France, United Kingdom, Hungary, and Germany in Europe, Howmet has operating activities in numerous other countries and regions, including Japan and China. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, affect the results of operations in countries with such activities.\nManagement Review of 2024 and Outlook\nThe Company derived approximately 52% of its revenue from products sold to the commercial aerospace market for the year ended December 31, 2024. Aircraft production in the commercial aerospace industry continues to grow based on increases in demand for narrow body and wide body aircraft. We expect our commercial aerospace wide body and narrow body demand, including engine spares, also to continue to grow. Quality control issues at The Boeing Company (“Boeing”) have had and are expected to continue to have a negative impact on narrow body and wide body production rates in the near term. For instance, the Federal Aviation Administration stated that it will not approve production rate increases above 38 aircraft per month or additional production lines for the Boeing 737 MAX until it is satisfied that Boeing is in full compliance with required quality control procedures. In addition, a labor union work stoppage and ensuing production restart at Boeing has negatively impacted results. Boeing production levels have had and are expected to have a material impact on the financial performance of Howmet. The timing and level of future aircraft builds by OEMs are subject to changes and uncertainties, which may cause our future results to differ from prior periods due to changes in product mix in certain segments.\nIn 2024, Sales increased 12% from 2023 primarily as a result of higher volumes in the commercial aerospace, defense aerospace, and industrial and other markets, and favorable product pricing, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of material and inflationary cost pass through to our customers.\nIncome before income taxes increased 42% from 2023. Total Segment Adjusted EBITDA\n(1)\n increased 27% from 2023 primarily due to favorable sales in the commercial aerospace, defense aerospace, and industrial and other markets as well as favorable product pricing.\nManagement continued its focus on liquidity and cash flows as well as improving its operating performance through profitable revenue, efficient operations, and margin enhancement. Management has also continued its intensified focus on capital efficiency. Management’s focus and the related results enabled Howmet to end 2024 with a solid financial position.\nThe following financial information reflects certain key highlights of Howmet’s 2024 results:\n•\nSales of $7,430, an increase of 12% from 2023, driven by higher sales in the commercial aerospace, defense aerospace, and industrial and other markets, partially offset by lower sales in the commercial transportation market; \n•\nNet income of $1,155, or $2.81 per diluted share;\n•\nIncome before income taxes of $1,383, an increase of $408, or 42%, from 2023;\n•\nTotal Segment Adjusted EBITDA\n(1)\n of $2,009, an increase of $422, or 27%, from 2023;\n•\nCash on hand and restricted cash at the end of the year of $565;\n•\nCash provided from operations of $1,298; cash used for financing activities of $1,026; and cash used for investing activities of $316;\n•\nRepurchased the Company’s common stock of approximately 6 million shares under the Share Repurchase Program for approximately $500;\n22\nTable\n \nof\n Contents\n•\nTotal debt of $3,315, a net decrease of $391 from 2023, reflecting repurchases and redemption of $600 aggregate principal amount of the 6.875% Notes due May 2025 (the “2025 Notes”), redemption of $205 aggregate principal amount of the 5.125% Notes due October 2024 (the “\n2024 Notes”)\n, \nearly partial prepayment of $60 aggregate principal amount of its USD term loan, partially offset by the \nissuance of $500 aggregate principal amount of the 4.850% Notes due October 2031 (the “2031 Notes”), net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability; and\n•\nThe Company’s common stock had a closing price of $109.37 per share as of December 31, 2024, an increase of $96.17 per share, or 729%, since the Arconic Inc. Separation Transaction on April 1, 2020, compared to an increase of 138% for the S&P 500\n®\n Index and 99% for the S&P 500\n®\n Aerospace & Defense Index over the same period.\n(1)\nSee below in Results of Operations for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nIn 2025, management projects sales to increase as we expect solid growth in the commercial aerospace market, and the Company’s strong position in that market is expected to continue, including engines spares. Earnings per share is expected to grow as management continues to focus on revenue growth and operational performance. Cash provided from operations is expected to increase for the full year in 2025 compared with 2024, resulting from a continued focus on operating performance and on capital efficiency. Capital expenditures are expected to increase with additional investments in capacity expansions. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nResults of Operations\nEarnings Summary\nSales. \nSales for 2024 were $7,430 compared with $6,640 in 2023, an increase of $790, or 12%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, and industrial and other markets, including engine spares, and favorable product pricing, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of inflationary cost pass through to our customers.\nSales for 2023 were $6,640 compared with $5,663 in 2022, an increase of $977, or 17%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, commercial transportation, and industrial and other markets, favorable product pricing, and an increase in material cost pass through. Product price increases are in excess of inflationary pass through to our customers.\nCost of goods sold (“COGS”). \nCOGS as a percentage of Sales was 68.9% in 2024 compared with 71.9% in 2023. The decrease was primarily due to higher volumes and favorable product pricing, partially offset by increased net headcount, primarily in the Engine Products segment, in support of expected revenue increases. The Company had total COGS net reimbursements of $18 in 2024 due to the final settlement of the insurance claim related to a mechanical failure that occurred in 2022 resulting in substantial heat and fire-related damage to equipment at the Forged Wheels’ cast house in Barberton, Ohio (the “Barberton Cast House Incident”) in the second quarter of 2024 and the final settlement of the insurance claim related to the fires that occurred in 2019 at a Fastening Systems plant in France (the “France Plant Fire”) in the fourth quarter of 2024, compared to total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7 in 2023, related to the France Plant Fire and Barberton Cast House Incident. The insurance claims related to the Barberton Cast House Incident and the France Plant Fire have now been completed. All cash related to the insurance claims has been collected as of January 2025.\nCOGS as a percentage of Sales was 71.9% in 2023 compared with 72.5% in 2022. The decrease was primarily due to higher volumes, favorable product pricing, and lower costs related to three plant fires, partially offset by material cost pass through and increased net headcount, primarily in the Engine Products and Fastening Systems segments, in support of expected revenue increases. The Company had total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7, related the France Plant Fire and the Barberton Cast House Incident, compared to total COGS charges of $59 in 2022, offset by partial insurance claims reimbursements of $23, related to a fire at a Forged Wheels plant in Barberton, Ohio in mid-February 2020 (the “Barberton Plant Fire”) and the France Plant Fire. The insurance claims related to these three plant fires were in excess of the insurance deductible. During the fourth quarter of 2022, the Company settled the insurance claim related to the Barberton Plant Fire.\nSelling, general administrative, and other expenses (“SG&A”). \nSG&A expenses were $347, or 4.7% of Sales, in 2024 compared with $333, or 5.0% of Sales, in 2023. The increase in SG&A of $14, or 4%, was primarily due to higher employment costs.\nSG&A expenses were $333, or 5.0% of Sales, in 2023 compared with $288, or 5.1% of Sales, in 2022. The increase in SG&A of $45, or 16%, was primarily due to higher employment costs and legal fees.\n23\nTable\n \nof\n Contents\nResearch and development expenses (“R&D”). \nR&D expenses were $33 in 2024 compared with $36 in 2023. The decrease of $3, or 8%, was primarily due to the timing of spending on technology projects.\nR&D expenses were $36 in 2023 compared with $32 in 2022. The increase of $4, or 13%, was primarily due to higher spending on technology projects to support the aerospace business.\nProvision for depreciation and amortization (“D&A”). \nThe provision for D&A was $277 in 2024 compared with $272 in 2023. The increase of $5, or 2%, was primarily driven by the disposal of unused assets in the Engine Products segment.\nThe provision for D&A was $272 in 2023 compared with $265 in 2022. The increase of $7, or 3%, was primarily driven by higher depreciation in the Engine Products segment.\nRestructuring and other charges. \nRestructuring and other charges were $21 in 2024 compared with $23 in 2023 and $56 in 2022.\nRestructuring and other charges in 2024 consisted primarily of a $13 net loss on the sale of a small U.K. manufacturing facility in Engineered Structures and $10 charge for layoff costs.\nRestructuring and other charges in 2023 consisted primarily of a $12 charge for impairment of assets primarily related to decommissioned fixed assets in Engineered Structures, a $5 charge for U.S. and Canadian pension plans’ settlement accounting, a $3 charge for layoff costs, a $3 charge for various other exit related costs primarily for the closures of small manufacturing facilities, and a $2 charge for accelerated depreciation primarily related to the closure of a small Engineered Structures facility in the U.K. The Company has closed or sold some small manufacturing facilities including three in the U.K. and may, in the future, close additional small facilities in order to consolidate operations, reduce fixed costs, and exit less profitable businesses.\nRestructuring and other charges in 2022 consisted primarily of\n a $58 charge for U.K. and U.S. pension plans’ settlement accounting and a $6 charge for various other exit costs. These charges were partially offset by a gain of $8 on the sale of assets at a small U.S. manufacturing facility in Engine Products.\nSee \nNote D\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\nInterest expense, net. \nInterest expense, net was $182 in 2024 compared with $218 in 2023. The decrease of $36, or 17%, was primarily due to the early redemptions of the 6.875% Notes due May 2025 (the “2025 Notes”) during various periods in 2024, the early redemptions of the 5.125% Notes due October 2024 (the “\n2024 Notes\n”) during various periods during 2023 and 2024, and the \nearly partial prepayment of its USD term loan\n, partially offset by the August 2024 issuance of $500 aggregate principal amount of the 2031 Notes, net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability. Long-term debt, including long-term debt due within one year, has been reduced by $847 from December 31, 2022 to December 31, 2024. On an annual basis, the debt reduction and refinancing activities in 2024 will decrease Interest expense, net by approximately $37.\nInterest expense, net was $218 in 2023 compared with $229 in 2022. The decrease of $11, or 5%, was primarily due to a reduced average level of debt for the year ended December 31, 2023 compared to the year ended December 31, 2022.\nSee \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail related to the Company’s debt.\nLoss on debt redemption.\n \nDebt redemption or tender premiums include the cost to redeem or repurchase certain of the Company’s notes at a price which may be equal to the greater of the principal amount or the sum of the present values of the remaining scheduled payments, discounted using a defined treasury rate plus a spread, or a price based on the market price of its notes. \nLoss on debt redemption was $6 in 2024 compared with $2 in 2023. The increase of $4, or 200%, was primarily due to the debt premiums paid on the early redemption of the 2025 Notes in the third quarter of 2024.\nLoss on debt redemption was $2 in both 2023 and 2022 due to the debt premiums paid on the early redemption of the 2024 Notes. \nSee \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail related to the Company’s debt.\n24\nTable\n \nof\n Contents\nOther expense, net. \nOther expense, net was $62 in 2024 compared with $8 in 2023. The increase in expense of $54 was primarily due to the reversal in the second quarter ended June 30, 2023 of $25, net of legal fees of $1, of the $65 pre-tax charge taken in the third quarter of 2022 related to the Lehman Brothers International (Europe) (“LBIE”) legal proceeding as a result of the final settlement of such proceeding in June 2023 (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n) (Financial Statements and Supplementary Data), increases in foreign currency losses, net of $15, and an increase in the impacts of deferred compensation arrangements of $5. Non-service related net periodic benefit costs related to defined benefit plans and other postretirement benefit plans is expected to remain relatively flat from 2024 to 2025.\nOther expense, net was $8 in 2023 compared with $82 in 2022. The decrease in expense of $74 was primarily due to the reversal of $25 of the $65 pre-tax charge taken in the third quarter of 2022 related to the LBIE legal proceeding which was settled in the second quarter of 2023 (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n) (Financial Statements and Supplementary Data) and higher interest income of $17, partially offset by the impacts of deferred compensation arrangements of $18, higher non-service related net periodic benefit costs related to pension and other postretirement benefit plans in 2023 of $13, and an increase from net realized and unrealized losses of $4, primarily related to mark-to-market adjustments on exchange-traded fixed income securities and losses on sales of receivables.\nSee \nNote F\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\nIncome taxes. \nHowmet’s effective tax rate was 16.5% (provision on pre-tax income) in 2024 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily due to the completion of an R&D study which resulted in a $44 net benefit related to prior years of U.S. federal and state R&D credits and related impacts, a $15 net benefit related to current year U.S. federal and state R&D credits and related impacts, a $25 benefit related to a U.S. deduction on Foreign Derived Intangible Income, an $11 net benefit related to various other credits, a $10 excess benefit for stock compensation, a $6 benefit to release a valuation allowance related to U.S. state tax losses and credits, and a $4 benefit to release a valuation allowance related to U.S. foreign tax credits, partially offset by $12 of U.S. tax on Global Intangible Low-Taxed Income (“GILTI”) and other foreign earnings, $15 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, $11 of charges related to nondeductible expenses, and $8 of net foreign tax cost related to foreign earnings subject to withholding tax and local tax in high tax rate jurisdictions. On October 8, 2021, the Organization for Economic Cooperation and Development (“OECD”) released the Pillar Two model rules introducing a 15% global minimum tax under the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting. The Pillar Two directive has been implemented, or is expected to be implemented, through domestic legislation in multiple countries where the Company operates. While the Company does not expect the adoption of the Pillar Two framework to have a material impact on its effective tax rate, we continue to monitor any additional guidance released by the OECD, along with the pending and adopted legislation in the countries where we operate. \nHowmet anticipates that the effective tax rate in 2025 will be between 20.5% and 21.5%. However, changes in the current economic environment, tax legislation or rate changes, currency fluctuations, ability to realize deferred tax assets, movements in stock price impacting tax benefits or deficiencies on stock-based payment awards, and the results of operations in certain taxing jurisdictions may cause this estimated rate to fluctuate.\nHowmet’s effective tax rate was 21.5% (provision on pre-tax income) in 2023 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily as a result of a $21 charge for a tax reserve established in France, $10 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, and $8 of charges related to nondeductible expenses, partially offset by a $14 benefit to release a valuation allowance related to U.S. foreign tax credits, a $9 excess benefit for stock compensation, $7 of benefits related to tax credits, a $2 benefit to release a valuation allowance related to U.S. state tax losses and credits, and a $2 benefit to revalue deferred taxes for changes to apportioned U.S. state tax rates. \nHowmet’s effective tax rate was 22.6% (provision on pre-tax income) in 2022 compared with the U.S. federal statutory rate of 21%. The effective tax rate differs from the U.S. federal statutory rate primarily as a result of a $12 charge related to an increase in the valuation allowance on a foreign tax credit carryforward in the U.S., $8 of charges related to U.S. tax on GILTI and other foreign earnings, $8 of charges related to nondeductible expenses, and $5 of incremental state tax and foreign taxes on earnings also subject to U.S. federal income tax, partially offset by a $6 benefit for the release of a valuation allowance on interest deduction carryforwards in the U.K., a $5 benefit related to a tax accounting method change, a $5 excess benefit for stock compensation, and a $3 benefit related to a distribution of foreign earnings. The Inflation Reduction Act of 2022 (the “Act”) was signed into law on August 16, 2022. The Act includes various tax provisions, including a 1% excise tax on net stock repurchases, expanded tax credits for clean energy incentives, and a corporate alternative minimum tax that generally applies to U.S. corporations with average adjusted financial statement income over a three-year period in excess of $1,000. The Company does not expect the Act to materially impact its financial statements.\nSee \nNote H\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for additional detail.\n25\nTable\n \nof\n Contents\nNet income. \nNet income\n \nwas $1,155, or $2.81 per diluted share, for 2024 compared to $765, or $1.83 per diluted share, in 2023. The increase in results of $390, or 51%, was primarily due to higher volumes in the commercial aerospace, defense aerospace, and industrial and other markets, including engines spares, favorable product pricing, a reduction in interest expense due to lower long-term debt levels, and a lower tax rate due to the completion of an R&D study, partially offset by lower volumes in the commercial transportation market and net impacts of foreign currency.\nNet income was $765, or $1.83 per diluted share, for 2023 compared to $469, or $1.11 per diluted share, in 2022. The increase in results of $296, or 63%, was primarily due to higher sales in the commercial aerospace market, favorable product pricing, a change of $90 due to the reversal of $25 of the $65 pre-tax charge taken in the third quarter of 2022 related to the LBIE legal proceeding (See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n), a decrease in Restructuring and other charges of $33, and a decrease in Interest expense, net of $11, partially offset by an increase in the Provision for income taxes primarily driven by an increase in income before income taxes.\nSegment Information\nThe Company’s operations consist of four worldwide reportable segments: Engine Products, Fastening Systems, Engineered Structures and Forged Wheels. Segment performance under Howmet’s management reporting system is evaluated based on Segment Adjusted EBITDA. The Company’s Chief Executive Officer, who has been determined to be our Chief Operating Decision Maker (“CODM”), believes that Segment Adjusted EBITDA provides information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Howmet’s definition of Segment Adjusted EBITDA (Earnings before interest, taxes, depreciation, and amortization) is net margin plus an add-back for depreciation and amortization. Net margin is equivalent to Sales minus the following items: Cost of goods sold; Selling, general administrative, and other expenses; Research and development (“R&D”) expenses; and Provision for depreciation and amortization. Special items, including Restructuring and other charges, are excluded from net margin and Segment Adjusted EBITDA. The Company’s CODM considers forecast-to-actual variances for Segment Adjusted EBITDA when allocating resources across the Company’s reportable segments. Segment Adjusted EBITDA may not be comparable to similarly titled measures of other companies. Differences between the total segment and consolidated totals are in Corporate. (See \nNote C\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K). \nThe Company has aligned its operations consistent with how the CEO assesses operating performance and allocates capital.\nIncome before income taxes totaled $1,383 in 2024, $975 in 2023, and $606 in 2022. Segment Adjusted EBITDA for all reportable segments totaled $2,009 in 2024, $1,587 in 2023, and $1,352 in 2022. See below for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nThe following information provides Sales, Segment Adjusted EBITDA, and Segment Adjusted EBITDA Margin for each reportable segment for each of the three years in the period ended December 31, 2024.\nEngine Products \n2024\n2023\n2022\nThird-party sales\n$\n3,735 \n$\n3,266 \n$\n2,698 \nSegment Adjusted EBITDA\n1,150 \n887 \n729 \nSegment Adjusted EBITDA Margin\n30.8 \n%\n27.2 \n%\n27.0 \n%\nEngine Products produces investment castings, including airfoils, and seamless rolled rings primarily for aircraft engines (aerospace commercial and defense) and industrial gas turbine applications. Engine Products produces rotating parts as well as structural parts, which are sold directly to customers. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, euro, and Japanese yen.\nThird-party sales for the Engine Products segment increased $469, or 14%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets, including spares growth.\nThird-party sales for the Engine Products segment increased $568, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets.\nSegment Adjusted EBITDA for the Engine Products segment increased $263, or 30%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets. The segment absorbed approximately 1,205 net headcount since the end of 2023 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\n26\nTable\n \nof\n Contents\nSegment Adjusted EBITDA for the Engine Products segment increased $158, or 22%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets. The segment absorbed approximately 1,030 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 360 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 20 basis points in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets, partially offset by an increase in headcount and inflationary costs.\nIn 2025, as compared to 2024, demand in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nFastening Systems\n2024\n2023\n2022\nThird-party sales\n$\n1,576 \n$\n1,349 \n$\n1,117 \nSegment Adjusted EBITDA\n406 \n278 \n234 \nSegment Adjusted EBITDA Margin\n25.8 \n%\n20.6 \n%\n20.9 \n%\nFastening Systems produces aerospace and industrial fastening systems, as well as commercial transportation fasteners. The business’s high-tech, multi-material fastening systems are found nose to tail on aircraft and aero engines. The business’s products are also critical components of commercial transportation vehicles and construction and industrial equipment. Fastening Systems are sold directly to customers and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, and euro.\nThird-party sales for the Fastening Systems segment increased $227, or 17%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, including wide body recovery.\nThird-party sales for the Fastening Systems segment increased $232, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, including the emerging wide body recovery, commercial transportation, defense aerospace, and industrial markets.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $128, or 46%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, productivity gains which included reduced net headcount of approximately 135, and impacts of foreign currency.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $44, or 19%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets. The segment absorbed approximately 435 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment increased approximately 520 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace market as well as productivity gains.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment decreased approximately 30 basis points in 2023 compared with 2022, primarily due to an increase in headcount and inflationary costs, partially offset by higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets.\nIn 2025, as compared to 2024, demand in the commercial aerospace market is expected to increase. Demand in the commercial transportation market is not expected to recover before mid year of 2025 with some growth starting in the second half of 2025. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\n27\nTable\n \nof\n Contents\nEngineered Structures\n2024\n2023\n2022\nThird-party sales\n$\n1,065 \n$\n878 \n$\n790 \nSegment Adjusted EBITDA\n166 \n113 \n111 \nSegment Adjusted EBITDA Margin\n15.6 \n%\n12.9 \n%\n14.1 \n%\nEngineered Structures produces titanium ingots and mill products for aerospace and defense applications and is vertically integrated to produce titanium forgings, titanium extrusions, and machining services for airframe, wing, aero-engine, and landing gear components. Engineered Structures also produces aluminum forgings, nickel forgings, and aluminum machined components, and assemblies for aerospace and defense applications. The segment’s products are sold directly to customers and through distributors, and sales and costs and expenses of this segment are generally transacted in the local currency of the respective operations, which are mostly the U.S. dollar.\nThird-party sales for the Engineered Structures segment increased $187, or 21%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nThird-party sales for the Engineered Structures segment increased $88, or 11%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace market, including Russian titanium share gains and the emerging wide body recovery, partially offset by lower volumes in the defense aerospace market associated with legacy fighter programs.\nSegment Adjusted EBITDA for the Engineered Structures\n \nsegment increased $53, or 47%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability.\nSegment Adjusted EBITDA for the Engineered Structures\n \nsegment increased $2, or 2%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace market, partially offset by lower volumes in the defense aerospace market and additional operating costs from production rate increases not realized due to production bottlenecks at a plant. The segment absorbed approximately 280 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment increased approximately 270 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace and defense aerospace markets. The Engineered Structures segment is focusing on the optimization of its manufacturing footprint and rationalization of product mix in order to maximize profitability. \nSegment Adjusted EBITDA Margin for the Engineered Structures\n \nsegment decreased approximately 120 basis points in 2023 compared with 2022, primarily due to lower volumes in the defense aerospace market, material and inflationary cost pass through, additional operating costs from production rate increases not realized due to production bottlenecks at a plant, and an increase in headcount, partially offset by higher volumes in the commercial aerospace market.\nIn 2025, as compared to 2024, demand in the defense aerospace and commercial aerospace markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nForged Wheels\n2024\n2023\n2022\nThird-party sales\n$\n1,054 \n$\n1,147 \n$\n1,058 \nSegment Adjusted EBITDA\n287 \n309 \n278 \nSegment Adjusted EBITDA Margin\n27.2 \n%\n26.9 \n%\n26.3 \n%\nForged Wheels produces forged aluminum wheels and related products globally for heavy-duty trucks, trailers, and buses. Forged Wheels’ products are sold directly to OEMs and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar and euro.\nThird-party sales for the Forged Wheels segment decreased $93, or 8%, in 2024 compared with 2023, primarily due to lower volumes in the commercial transportation market as well as a decrease in aluminum and other inflationary cost pass through.\nThird-party sales for the Forged Wheels segment increased $89, or 8%, in 2023 compared with 2022, primarily due to higher volumes in the commercial transportation market.\n28\nTable\n \nof\n Contents\nSegment Adjusted EBITDA for the Forged Wheels\n \nsegment decreased $22, or 7%, in 2024 compared with 2023, primarily due to lower volumes in the commercial transportation market. The segment reduced approximately 160 net headcount since the end of 2023 as a result of lower production.\nSegment Adjusted EBITDA for the Forged Wheels\n \nsegment increased $31, or 11%, in 2023 compared with 2022, primarily due to higher volumes in the commercial transportation market, partially offset by a supply chain disruption and unfavorable foreign currency movements.\nSegment Adjusted EBITDA Margin for the Forged Wheels\n \nsegment increased approximately 30 basis points in 2024 compared with 2023, primarily due to lower aluminum and other inflationary cost pass through, partially offset by lower volumes in the commercial transportation market.\nSegment Adjusted EBITDA Margin for the Forged Wheels\n \nsegment increased approximately 60 basis points in 2023 compared with 2022, primarily due to higher volumes, partially offset by a supply chain disruption and unfavorable foreign currency movements. The favorable impact of lower aluminum prices was partially offset by other inflationary cost pass through.\nIn 2025, as compared to 2024, demand in the commercial transportation markets served by Forged Wheels is not expected to recover before mid year of 2025 with some growth starting in the second half of 2025. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nReconciliation of Total Segment Adjusted EBITDA to Income before income taxes\n2024\n2023\n2022\nIncome before income taxes\n$\n1,383 \n$\n975 \n$\n606 \nLoss on debt redemption\n6 \n2 \n2 \nInterest expense, net\n182 \n218 \n229 \nOther expense, net\n(1)\n62 \n8 \n82 \nOperating income\n$\n1,633 \n$\n1,203 \n$\n919 \nSegment provision for depreciation and amortization\n270 \n262 \n258 \nUnallocated amounts:\nRestructuring and other charges\n21 \n23 \n56 \nCorporate expense\n85 \n99 \n119 \nTotal Segment Adjusted EBITDA\n$\n2,009 \n$\n1,587 \n$\n1,352 \n(1)\nSee \nNote F\n to the Consolidated Financial Statements in \nPart II, Item 8\n of this Form 10-K.\nTotal Segment Adjusted EBITDA is a non-GAAP financial measure. Management believes that this measure is meaningful to investors because it provides additional information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Differences between the total segment and consolidated totals are in Corporate. \nSee Restructuring and other charges, D&A, Loss on debt redemption, Interest expense, net, and Other expense, net discussions above under “Results of Operations” for reference.\nCorporate expense decreased $14, or 14%, in 2024 compared with 2023, primarily due to lower costs associated with closures, supply chain disruptions, and other items of $13, lower costs related to the collective bargaining agreement negotiations of $8, and higher net reimbursements related to the France Plant Fire and the Barberton Cast House Incident of $6, partially offset by higher employment costs in 2024.\nCorporate expense decreased $20, or 17%, in 2023 compared with 2022, primarily due to lower net costs related to the France Plant Fire, the Barberton Plant Fire, and the Barberton Cast House Incident of $48, partially offset by costs associated with closures, shutdowns, and other items of $10, costs related to collective bargaining agreement negotiations of $8, legal and other advisory reimbursements received in 2022 of $3 which did not recur in 2023, and higher employment costs in 2023.\nEnvironmental Matters\nSee the Environmental Matters section of \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n of this Form 10-K.\nLiquidity and Capital Resources\nHowmet maintains a disciplined approach to cash management and the strengthening of its balance sheet. Management continued to focus on actions to improve Howmet’s cost structure and liquidity, providing the Company with the ability to \n29\nTable\n \nof\n Contents\noperate effectively. Such actions included procurement efficiencies and overhead rationalization to reduce costs, working capital initiatives, and maintaining a sustainable level of capital expenditures.\nCash provided from operations and financing activities is expected to be adequate to cover Howmet’s operational and business needs over the next 12 months. For an analysis of long-term liquidity, see “Contractual Obligations and Off-Balance Sheet Arrangements” below.\nAs of December 31, 2024, cash and cash equivalents of Howmet were $564, of which $284 was held by Howmet’s non-U.S. subsidiaries. If the cash held by non-U.S. subsidiaries were to be repatriated to the U.S., the Company does not expect there to be material income tax consequences.\nOperating Activities\nCash provided from operations in 2024 was $1,298 compared with $901 in 2023 and $733 in 2022.\nThe increase in cash provided from operations of $397, or 44%, between 2024 and 2023 was due to higher operating results of $361 and lower working capital of $72, partially offset by higher pension contributions of $43. The components of the change in working capital included favorable changes in receivables of $107, inventories of $36, prepaid expenses and other current assets of $10, partially offset by accounts payable of $42, compensation related payments and other accrued expenses of $32, and taxes, including income taxes, of $7.\nThe increase in cash provided from operations of $168, or 23%, between 2023 and 2022 was due to higher operating results of $303, lower payments on noncurrent liabilities of $26, and lower pension contributions of $7, partially offset by higher working capital of $163. The components of the change in working capital included unfavorable changes in accounts payable of $253, prepaid expenses and other current assets of $18, and receivables of $3, including collections of employee retention credit receivables, partially offset by inventories of $92, accrued expenses of $14 and taxes, including income taxes, of $5.\nFinancing Activities\nCash used for financing activities was $1,026 in 2024 compared with $868 in 2023 and $526 in 2022.\nThe use of cash in 2024 was primarily related to the repayments on the aggregate outstanding principal amount of long-term debt of approximately $870, the repurchase of common stock of $500, dividends paid to shareholders of $109, taxes paid for net share settlement of equity awards of $49, and debt issuance costs for the 2031 Notes of $5, partially offset by proceeds from the 2031 Notes debt issuance of $500 and the exercise of employee stock options of $8. On an annual basis, the 2024 debt reduction and refinancing activities will decrease Interest expense, net by approximately $37.\nThe use of cash in 2023 was primarily related to the repayments on the aggregate outstanding principal amount of long-term debt of approximately $876, the repurchase of common stock of $250, taxes paid for net share settlement of equity awards of $77, and dividends paid to shareholders of $73. These items were partially offset by proceeds from term loan facilities of $400 and the exercise of employee stock options of $11.\nThe use of cash in 2022 was primarily related to the repurchase of common stock of $400, the repayments on the aggregate outstanding principal amount of long-term debt of approximately $69, and dividends paid to shareholders of $44. These items were partially offset by proceeds from the exercise of employee stock options of $16.\nFor further details regarding the Company’s debt reduction and refinancing activities and stock repurchases, see \nNote Q\n and \nNote I\n, respectively, to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nOn July 30, 2024, the Board of Directors of Howmet Aerospace approved the establishment of a 2025 dividend policy to pay cash dividends on the Company’s common stock in 2025 at a rate of 15% plus or minus 5% of net income excluding special items. The declaration of future common stock dividends is subject to the discretion and approval of the Board of Directors of Howmet after the Board’s consideration of all factors it deems relevant and subject to applicable law. The Company may modify, suspend, or cancel the dividend policy in any manner and at any time that it may deem necessary or appropriate.\nThe Company maintains a credit facility (the “Credit Facility”) pursuant to its Five-Year Revolving Credit Agreement (the “Credit Agreement”) with a syndicate of lenders and issuers named therein (See \nNote Q\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for reference). \nThere were no amounts outstanding under the Credit Agreement as of December 31, 2024 or December 31, 2023, and no amounts were borrowed during 2024 or 2023 under the Credit Agreement. \nOn April 4, 2024, the Company established a commercial paper program under which the Company may issue unsecured commercial paper from time to time up to a maximum aggregate face amount of \n$1,000\n. The Company’s commercial paper will be sold on customary terms in the U.S. commercial paper market on a private placement basis. The proceeds of the commercial \n30\nTable\n \nof\n Contents\npaper will be used for general corporate purposes. In conjunction with the commercial paper program, the Company was assigned short-term credit ratings by Moody’s Investors Service, Inc., S&P Global Ratings, and Fitch Ratings, Inc.\nThe Company has an effective shelf registration statement on Form S-3, filed with the SEC, which allows for offerings of debt securities from time to time. The Company may opportunistically issue new debt securities in accordance with securities laws or utilize commercial paper in order to, but not limited to, refinance existing indebtedness.\nIn the future, the Company may, from time to time, redeem portions of its debt securities or repurchase portions of its debt or equity securities in either the open market or through privately negotiated transactions, in accordance with applicable SEC and other legal requirements. The timing, prices, and sizes of purchases depend upon prevailing trading prices, general economic and market conditions, and other factors, including applicable securities laws. Such purchases may be completed by means of trading plans established from time to time in accordance with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, block trades, private transactions, open market repurchases, tender offers, and/or accelerated share repurchase agreements or other derivative transactions. \nThe Company’s costs of borrowing and ability to access the capital markets are affected not only by market conditions but also by the short-term and long-term debt ratings assigned to the Company by the major credit rating agencies. The Company believes that its cash on hand, cash provided from operations and availability of its Credit Facility, its commercial paper program, and its accounts receivables securitization program will continue to be sufficient to fund our operating and capital allocation activities.\nThe three major credit rating agencies have rated Howmet’s debt with investment grade ratings. The Company’s most recent short-term and long-term credit ratings, as well as the current outlook from the three major credit rating agencies are as follows: \n \nShort-Term\nLong-Term\nOutlook\nS&P Global Ratings (“S&P”)\nA-2\nBBB\nStable\nMoody’s Investors Service (“Moody’s”)\nP-2\nBaa1\nStable\nFitch Investors Service (“Fitch”)\nF2\nBBB\nPositive\nOn November 26, 2024, S&P upgraded Howmet’s short-term debt rating from A-3 to A-2 and long-term debt rating from BBB- to BBB, and affirmed the current outlook at stable, citing strong demand for commercial aerospace components and debt reduction.\nOn August 6, 2024, Moody’s upgraded Howmet’s short-term debt rating from P-3 to P-2 and further upgraded Howmet’s long-term debt rating two notches from Baa3 to Baa1, which was previously upgraded to Baa3 from Ba1 on February 29, 2024 citing demand in the markets served by Howmet along with the Company’s improved financial leverage and updated the current outlook from positive to stable. \nOn August 6, 2024, Fitch affirmed Howmet’s short-term debt rating at F2 and long-term debt rating at BBB and updated the current outlook from stable to positive.\nInvesting Activities\nCash used for investing activities was $316, $215, and $135 in 2024, 2023, and 2022, respectively.\nThe use of cash in 2024 was capital expenditures of $321 primarily related to Engine Products capacity expansion, various automation projects, and sustaining and return seeking capital projects across all segments and an acquisition in Engine Products, net of cash acquired of $5, partially offset by proceeds from the sale of assets in Engine Products and a business in Engineered Structures of $9.\nThe use of cash in 2023 was capital expenditures of $219 primarily related to various automation projects, information technology upgrades, and sustaining and return seeking capital projects across all segments, partially offset by proceeds from the sale of assets and investments of $4.    \nThe use of cash in 2022 was capital expenditures of $193 primarily related to various automation projects, information technology upgrades, and sustaining capital projects across all segments, partially offset by proceeds from the sale of assets of $58, which was primarily due to the sale of the corporate center and a manufacturing facility in Engine Products. In the second quarter of 2022, the Company sold the corporate headquarters in Pittsburgh, PA. The proceeds from the sale of the corporate headquarters were $44, excluding $3 of transaction costs, and a carrying value of $41. The Company entered into a 12-year lease with the purchaser for a portion of the property. Additionally, in the fourth quarter of 2022, the Company sold the property of a manufacturing facility in the Engine Products segment. The proceeds from the sale of this property were $15 and a carrying value of $7.\n31\nTable\n \nof\n Contents\nContractual Obligations and Off-Balance Sheet Arrangements\nContractual Obligations\nHowmet is required to make future payments under various contracts, including long-term purchase obligations, financing arrangements, and lease agreements. Howmet also has commitments to fund its pension plans, provide payments for other postretirement benefit plans, and fund capital projects. \nIn order to better understand Howmet’s outstanding contractual obligations, the table below represents a summary of these commitments as of December 31, 2024 (these contractual obligations are grouped in the same manner as they are classified in the Statement of Consolidated Cash Flows in order to provide a better understanding of the nature of the obligations and to provide a basis for comparison to historical information):\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nOperating activities:\nRaw material purchase obligations\n$\n379 \n$\n218 \n$\n82 \n$\n79 \n$\n— \nPurchase and other payment obligations\n30 \n19 \n11 \n— \n— \nOperating leases\n189 \n46 \n68 \n36 \n39 \nInterest related to total debt\n1,133 \n165 \n298 \n189 \n481 \nEstimated minimum required pension funding\n352 \n45 \n154 \n153 \n— \nOther postretirement benefit payments\n56 \n6 \n12 \n12 \n26 \nLayoff and other restructuring payments\n4 \n4 \n— \n— \n— \nUncertain tax positions\n6 \n— \n— \n— \n6 \nFinancing activities:\nTotal debt\n3,328 \n5 \n948 \n1,000 \n1,375 \n   Dividends to shareholders\n42 \n42 \n— \n— \n— \nInvesting activities:\nCapital projects\n417 \n270 \n147 \n— \n— \nTotals\n$\n5,936 \n$\n820 \n$\n1,720 \n$\n1,469 \n$\n1,927 \nObligations for Operating Activities\nRaw material purchase obligations consist mostly of aluminum, titanium, cobalt, nickel, and various other metals with expiration dates ranging from less than one year to five years. Many of these purchase obligations contain variable pricing components, and, as a result, actual cash payments may differ from the estimates provided in the preceding table. The Company generally passes through material costs in customer contracts with limited exceptions. \nIn connection with the \nArconic Inc. Separation Transaction\n, the Company entered into several agreements with Arconic Corporation that \ngovern the relationship \nbetween\n the Company and Arconic Corporation following the separation, including raw material supply agreements.\n \nPurchase and other payment obligations include public utility purchase obligations, and future payments of tax-related interest and penalties.\nOperating leases represent multi-year obligations for certain land and buildings, plant equipment, vehicles, and computer equipment.\nDeferred revenue was $60 as of December 31, 2024. Deferred revenue arrangements require Howmet to deliver product to certain customers over a specified contract period, which is expected to be within one year. While these obligations are not expected to result in cash payments and are not included in the table above, they represent contractual obligations for which the Company would be obligated if the specified product deliveries could not be made.\nInterest related to total debt with maturities that extend to 2042, including cross-currency and interest rate swaps, is based on fixed rates as of December 31, 2024.\nEstimated minimum required pension funding and other postretirement benefit payments are based on actuarial estimates using current assumptions for discount rates, long-term rate of return on plan assets, and health care cost trend rates, among others. It is Howmet’s policy to fund amounts for pension plans sufficient to meet the minimum requirements set forth in the benefits laws and tax laws of the applicable country. Periodically, Howmet contributes additional amounts as deemed appropriate. Howmet has determined that it is not practicable to present pension funding and other postretirement benefit payments beyond 2030 and 2034, respectively.\nLayoff and other restructuring payments to be paid within one year primarily relate to severance costs.\n32\nTable\n \nof\n Contents\nUncertain tax positions taken or expected to be taken on an income tax return may result in additional payments to tax authorities. The amounts in the preceding table include interest and penalties accrued related to such positions as of December 31, 2024. Amounts for uncertain tax positions in which the timing of future potential payments are not reasonably estimable are included in the “Thereafter” column. If a tax authority agrees with the tax position taken or expected to be taken or the applicable statute of limitations expires, then additional payments will not be necessary. Tax assessments received may also result in payments to be made in order to preserve our right to appeal any tax positions challenged by tax authorities for which we have concluded that we are more likely than not to prevail. See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for further discussion on tax payments made.\nContingencies such as ongoing legal proceedings and environmental matters may also result in additional cash payments. The timing of these payments, if necessary, depends on several factors, including the timing of litigation and settlements of liability claims. Accordingly, amounts have not been included in the preceding table. Amounts for settled legal proceedings and other such payables are included within Purchase and other payment obligations in the preceding table. See \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K for further discussion.\nObligations for Financing Activities\nHowmet has historically paid quarterly dividends on its preferred and common stock. The Company paid an aggregate of $109 in common stock and preferred stock dividends to shareholders during 2024. Because all dividends are subject to approval by Howmet’s Board of Directors, amounts are not included in the preceding table unless such authorization has occurred. As of December 31, 2024, there were 405,431,361 shares of outstanding common stock and 546,024 shares of outstanding Class A preferred stock. In 2024, the preferred stock dividend was $3.75 per share. A dividend of $0.26 per share on the Company’s common stock was paid in 2024 ($0.05 per share in each of the first and second quarters of 2024 and $0.08 in the third and fourth quarters of 2024). Fully diluted shares outstanding as of December 31, 2024 were 408 million.\nThe Company has a share repurchase program (the “Share Repurchase Program”) that, after giving effect to the additional $50 share repurchases made in January 2025 at an average price per share of $116.39, retiring approximately 0.4 million shares, has approximately $2,147 in Board authorization remaining available as of January 31, 2025. The current Share Repurchase Program was authorized by the Company’s Board of Directors on August 18, 2021 at $1,500, which was increased by the Board by $2,000 on July 30, 2024. There is no stated expiration for the Share Repurchase Program. Accordingly, amounts have not been included in the preceding table. See “Liquidity and Capital Resources” for additional information.\nObligations for Investing Activities\nCapital projects in the preceding table only include amounts approved by management as of December 31, 2024. Funding levels may vary in future years based on the anticipated construction schedules of the projects. It is expected that significant expansion projects will be funded through various sources, including cash provided from operations. Total capital expenditures are anticipated to be approximately 4% of sales in 2025 and include additional capital expenditures related to the Engine Products capacity expansions.\nOff-Balance Sheet Arrangements\nAs of December 31, 2024, Howmet had outstanding bank guarantees related to tax matters, customs duties, rental, plant expansion, and environmental obligations. The total amount committed under these guarantees, which expire at various dates between 2025 and 2027, was $6 as of December 31, 2024.\nPursuant to the Separation and Distribution Agreement, dated as of October 31, 2016, between Howmet and Alcoa Corporation, Howmet was required to provide certain guarantees for Alcoa Corporation, which were included in Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet. The remaining guarantee, which had a fair value of \n$6 as of both December 31, 2024 and 2023, \nrelates to a long-term energy supply agreement that expires in \n2047\n at an Alcoa Corporation f\nacility, for which the Company is secondarily liable in the event of a payment default by Alcoa Corporation. If the Company incurs any liability under this guarantee, Arconic Corporation is obligated to indemnify the Company for 50% of such liability\n. \nThe Company currently views the risk of an Alcoa Corporation payment default on its obligations under the contract to be remote. \nThe Company is required to provide a guarantee up to \nan estimated present value amount of approximately $1,121 and $1,131 as of December 31, 2024 and 2023, respectively, in the event of an Alcoa Corporation default. In December 2022, December 2023, and December 2024, a surety bond with a limit of $80 relating to this guarantee was obtained by Alcoa Corporation to protect Howmet's obligation. This surety bond will be renewed on an annual basis by Alcoa Corporation.\nThe Company has outstanding letters of credit, primarily related to workers’ compensation, environmental obligations, insurance obligations, and tax matters. The total amount committed under these letters of credit, which automatically renew or expire at various dates, primarily in 2025, was $90 as of \nDecember 31, 2024\n.\n33\nTable\n \nof\n Contents\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to retain letters of credit of $48 (which are included in the \n$90\n in the above paragraph) that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation and letters of credit fees paid by the Company are proportionally billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively. Also, the Company was required to provide letters of credit for certain Arconic Corporation and Alcoa Corporation environmental obligations and, as a result, the Company has $17 of outstanding letters of credit relating to such liabilities (which are also included in the \n$90\n in the above paragraph). Arconic Corporation is being billed for these letter of credit fees paid by the Company and will reimburse the Company for any payments made under these letters of credit.\nThe Company has outstanding surety bonds primarily related to customs duties, workers’ compensation, environmental-related matters, and contract performance. The total amount committed under these annual surety bonds, which automatically renew or expire at various dates, primarily in 2025 and 2026, was $44 as of December 31, 2024.\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to provide surety bonds of $21, which are included in the $44 in the above paragraph, that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation claims and surety bond fees paid by the Company are proportionately billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively.\nCritical Accounting Policies and Estimates\nThe preparation of the Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America requires management to make certain judgments, estimates, and assumptions regarding uncertainties that affect the amounts reported in the Consolidated Financial Statements and disclosed in the accompanying Notes. These estimates are based on historical experience and, in some cases, assumptions based on current and future market experience, including considerations relating to changes in the aerospace industry. Areas that require significant judgments, estimates, and assumptions include the testing of goodwill, properties, plants, and equipment, and other intangible assets for impairment; pension plans and other postretirement benefits obligations; income taxes; and litigation and contingent liabilities.\nManagement uses historical experience and all available information to make these judgments, estimates, and assumptions, and actual results may differ from those used to prepare the Company’s Consolidated Financial Statements at any given time. Despite these inherent limitations, management believes that Management’s Discussion and Analysis of Financial Condition and Results of Operations and the Consolidated Financial Statements and accompanying Notes provide a meaningful and fair perspective of the Company.\nA summary of the Company’s significant accounting policies is included in \nNote A\n to the Consolidated Financial Statements of this Form 10-K. Management believes that the application of these policies on a consistent basis enables the Company to provide the users of the Consolidated Financial Statements with useful and reliable information about the Company’s operating results and financial condition.\nGoodwill. \nHowmet reviews goodwill for impairment annually (in the fourth quarter) or more frequently if indicators of impairment exist or if a decision is made to sell or realign a business. The Company has the option to assess impairment through qualitative assessment, which includes factors such as general economic conditions, negative developments in equity and credit markets, adverse changes in the markets in which an entity operates, increases in input costs that have a negative effect on earnings and cash flows, or a trend of negative or declining cash flows over multiple periods, among others. Howmet can also assess goodwill impairment through a quantitative analysis, using a discounted cash flow (“DCF”) model to estimate a reporting unit’s fair value. Assumptions and estimates utilized in the DCF model include weighted average cost of capital (“WACC”) rates, revenue, future profitability, working capital, cash flows, and a number of other items. For more information on these matters, see \nNote A\n to the Consolidated Financial Statements of this Form 10-K. \nProperties, Plants, and Equipment and Other Intangible Assets. \nProperties, plants, and equipment and Other intangible assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets (asset group) may not be recoverable. Recoverability of assets is determined by comparing the estimated undiscounted net cash flows of the operations related to the assets (asset group) to their carrying amount. An impairment loss would be recognized when the carrying amount of the assets (asset group) exceeds the estimated undiscounted net cash flows. The amount of the impairment loss to be recorded is measured as the excess of the carrying value of the assets (asset group) over their fair value, with fair value determined using the best information available, which generally is a DCF model. The determination of what constitutes an asset group, the associated estimated undiscounted net cash flows, and the estimated useful lives of the assets also require significant judgments.\n34\nTable\n \nof\n Contents\nPension and Other Postretirement Benefits.\n Liabilities and expenses for pension and other postretirement benefits are determined using actuarial methodologies and incorporate significant assumptions, including the interest rate used to discount the future estimated liability, the expected long-term rate of return on plan assets, and several assumptions relating to the employee workforce (health care cost trend rates, retirement age, and mortality). The pension and other postretirement benefits obligation was $1,556 and $1,695, with a funded status of $(670) and $(770) as of December 31, 2024 and 2023, respectively. The total benefit obligation reduction of $133 was primarily driven by benefit payments. The improvement in the funded status of $100 was primarily driven by contributions and changes in discount rates. Excluding settlements and curtailments, net periodic benefit cost of pension and other postretirement benefits is expected to be approximately $35 in 2025 compared to $33 in 2024 and 2023.\nEmployer contributions for pension benefits were \n$79 and $36\n for the years ended December 31, 2024 and 2023, respectively. Benefits paid for other postretirement benefits were $11 and $14 for the years ended December 31, 2024 and 2023, respectively. Total pension contributions and other postretirement benefits paid increased by $40, or 80%, in 2024 compared to 2023 primarily driven by additional discretionary contributions in addition to actual asset returns falling short of the plans’ estimated return on assets assumption. Cash pension contributions in 2025 are expected to be approximately $60. Howmet’s estimated funded status under the Employee Retirement Income Security Act was approximately 68% as of January 1, 2024.\nThe interest rate used to discount future estimated liabilities for the U.S. is determined using a Company-specific yield curve model (above-median) developed with the assistance of an external actuary, while both the U.K. and Canada utilize models developed by the respective actuary. The cash flows of the plans’ projected benefit obligations are discounted using a single equivalent rate derived from yields on high quality corporate bonds, which represent a broad diversification of issuers in various sectors, including finance and banking, industrials, transportation, and utilities, among others. The yield curve models parallel the plans’ projected cash flows, which have a global average duration of 9 years. The underlying cash flows of the \nbonds included in the models exceed the cash flows needed to satisfy the Company’s plans’ obligations multiple times. In 2024, 2023, and 2022, the discount rate used to determine benefit obligations for pension and other postretirement benefit plans was 5.60%, 5.10%, and 5.40%, respectively. \nThe impact on the liabilities of a change in the discount rate of 1/4 of 1% would be approximately $32 and either a charge or credit of less than $1 to earnings in the following year.\nThe expected long-term rate of return on plan assets is generally applied to a five-year market-related value of plan assets. The process used by management to develop this assumption is one that relies on a combination of historical asset return information and forward-looking returns by asset class. As it relates to historical asset return information, management focuses on various historical moving averages when developing this assumption. While consideration is given to recent performance and historical returns, the assumption represents a long-term, prospective return. Management also incorporates expected future returns on current and planned asset allocations using information from various external investment managers and consultants, as well as management’s own judgment.\nManagement used 6.70% for \n2024,\n \n2023, and\n \n2022\n as its weighted-average global expected long-term rate of return on plan assets, which was based on the prevailing and planned strategic asset allocations, as well as estimates of future returns by asset class for each plan. T\nhese rates were within the respective range of the 20-year moving average of actual performance and the expected future return developed by asset class for each plan. For 2025, management anticipates that the expected long-term rate of return for global plan assets will remain at approximately 7%.\n A change in the assumption for the expected long-term rate of return on plan assets of 1/4 of 1% would impact earnings by approximately $3 for \n2025\n.\nIn \n2024\n, net income of $17 (after-tax) was recorded in other comprehensive loss, primarily due to the increase in the discount rate, partially offset by plan asset returns that were less than expected. In \n2023\n, net loss of $36 (after-tax) was recorded in other comprehensive loss, primarily due to the decrease in the discount rate.\n \nIn \n2022\n, net income of $146 (after-tax) was recorded in other comprehensive loss, primarily due to the increase in the discount rate and amortization of actuarial losses, partially offset by plan asset returns that were less than expected.\nIncome Taxes.\n The provision (benefit) for income taxes is determined using the asset and liability approach of accounting for income taxes. Under this approach, the provision (benefit) for income taxes represents income taxes paid or payable (or received or receivable) based on current year pre-tax income plus the change in deferred taxes during the year. Deferred taxes represent the future tax consequences expected to occur when the reported amounts of assets and liabilities are recovered or paid, and result from differences between the financial and tax bases of Howmet’s assets and liabilities and are adjusted for changes in tax rates and tax laws when enacted.\nValuation allowances are recorded to reduce deferred tax assets when it is more likely than not that a tax benefit will not be realized. In evaluating the need for a valuation allowance, management considers all potential sources of taxable income, including income available in carry-back periods, future reversals of taxable temporary differences, projections of taxable income, and income from tax planning strategies, as well as all available positive and negative evidence. Positive evidence includes factors such as a history of profitable operations, projections of future profitability within the carryforward period, including from tax planning strategies, and Howmet’s experience with similar operations. Existing favorable contracts and the \n35\nTable\n \nof\n Contents\nability to sell products into established markets are additional positive evidence. Negative evidence includes items such as cumulative losses, projections of future losses, or carryforward periods that are not long enough to allow for the utilization of a deferred tax asset based on existing projections of income. Deferred tax assets for which no valuation allowance is recorded may not be realized upon changes in facts and circumstances, resulting in a future charge to establish a valuation allowance. Existing valuation allowances are re-examined under the same standards of positive and negative evidence. If it is determined that it is more likely than not that a deferred tax asset will be realized, the appropriate amount of the valuation allowance, if any, is released. Deferred tax assets and liabilities are also remeasured to reflect changes in underlying tax rates due to law changes and the granting and lapse of tax holidays.\nIt is Howmet’s policy to apply a tax law ordering approach when considering the need for a valuation allowance on net operating losses expected to offset GILTI inclusions. Under this approach, reductions in cash tax savings are not considered as part of the valuation allowance assessment. Instead, future GILTI inclusions are considered a source of taxable income that support the realizability of deferred tax assets.\nIt is Howmet’s policy to treat taxes due from future inclusions in U.S. taxable income related to GILTI as a current period expense when incurred.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more likely than not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed their examination even though the statute of limitations remains open. Interest and penalties related to uncertain tax positions are recognized as part of the provision for income taxes and are accrued beginning in the period that such interest and penalties would be applicable under relevant tax law until such time that the related tax benefits are recognized.\nLitigation and Contingent Liabilities.\n From time to time, we are involved in various lawsuits, claims, investigations, and proceedings. These matters may include speculative claims for substantial or indeterminate amounts of damages. Management determines the likelihood of an unfavorable outcome based on many factors, such as the nature of the matter, available defenses and case strategy, progress of the matter, views and opinions of legal counsel and other advisors, applicability and success of appeals processes, and the outcome of similar historical matters, among others. If an unfavorable outcome is deemed probable and the amount of the potential loss can be estimated, the most reasonable loss estimate is recorded. If an unfavorable outcome of a matter is deemed probable but the loss is not reasonably estimable, or if an unfavorable outcome is deemed reasonably possible, then the matter is disclosed but no liability is recorded. Legal matters are reviewed on a continuous basis to determine if there has been a change in management’s judgment regarding the likelihood of an unfavorable outcome or the estimate of a potential loss. For more information on these matters, see \nNote U\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nRecently Adopted and Recently Issued Accounting Guidance. \nSee the Recently Adopted and Recently Issued Accounting Guidance section of \nNote B\n to the Consolidated Financial Statements in \nPart II, Item 8\n (Financial Statements and Supplementary Data) of this Form 10-K.\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk.\nNot material.\n36\nTable\n \nof\n Contents\nItem 8. Financial Statements and Supplementary Data.\nPage\nManagement’s Reports to Howmet Shareholders\n38\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n39\nStatement of Consolidated Operations for the Years Ended December 31, 2024, 2023, and 2022\n41\nStatement of Consolidated Comprehensive Income for the Years Ended December 31, 2024, 2023, and 2022\n42\nConsolidated Balance Sheet as of December 31, 2024 and 2023\n43\nStatement of Consolidated Cash Flows for the Years Ended December 31, 2024, 2023, and 2022\n44\nStatement of Changes in Consolidated Equity for the Years Ended December 31, 2024, 2023, and 2022\n45\nNotes to the Consolidated Financial Statements\n46\n37\nTable\n \nof\n Contents\nManagement’s Reports to Howmet Shareholders\nManagement’s Report on Financial Statements and Practices\nThe accompanying Consolidated Financial Statements of Howmet Aerospace Inc. and its subsidiaries (the “Company”) were prepared by management, which is responsible for their integrity and objectivity. The statements were prepared in accordance with accounting principles generally accepted in the United States of America and include amounts that are based on management’s best judgments and estimates. The other financial information included in the annual report is consistent with that in the financial statements.\nManagement also recognizes its responsibility for conducting the Company’s affairs according to the highest standards of personal and corporate conduct. This responsibility is characterized and reflected in key policy statements issued from time to time regarding, among other things, conduct of its business activities within the laws of the host countries in which the Company operates and potentially conflicting outside business interests of its employees. The Company maintains a systematic program to assess compliance with these policies.\nManagement’s Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. In order to evaluate the effectiveness of internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act, management has conducted an assessment, including testing, using the criteria in \nInternal Control—Integrated Framework \n(2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). The Company’s system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The Company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nBased on the assessment, management has concluded that the Company maintained effective internal control over financial reporting as of December 31, 2024, based on criteria in \nInternal Control—Integrated Framework \n(2013) issued by the COSO.\nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report, which is included herein.\n/s/ John C. Plant\nJohn C. Plant\nExecutive Chairman and Chief Executive Officer\n/s/ Ken Giacobbe\nKen Giacobbe\nExecutive Vice President and Chief Financial Officer\n38\nTable\n \nof\n Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Howmet Aerospace Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Howmet Aerospace Inc. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of operations, of comprehensive income, of changes in equity, and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n39\nTable\n \nof\n Contents\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill Impairment Assessment – Engineered Structures Reporting Unit\nAs described in Notes A and O to the consolidated financial statements, the Company’s consolidated goodwill balance was $4,010 million as of December 31, 2024, and the amount of the goodwill associated with the Engineered Structures reporting unit was $303 million. Goodwill is reviewed for impairment annually (in the fourth quarter) or more frequently if indicators of impairment exist or if a decision is made to sell or realign a business. Howmet uses a discounted cash flow (“DCF”) model to estimate the current fair value of the reporting unit, which is compared to its carrying value, when testing for impairment. The determination of fair value using this technique requires management to use significant estimates and assumptions related to forecasting operating cash flows, including sales growth, production costs and discount rate.\nThe principal considerations for our determination that performing procedures relating to the goodwill impairment assessment of the Engineered Structures reporting unit is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of the Engineered Structures reporting unit; and (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to sales growth and production costs.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s goodwill impairment assessment, including controls over the valuation of the Company’s Engineered Structures reporting unit. These procedures also included, among others (i) testing management’s process for determining the fair value of the reporting unit; (ii) evaluating the appropriateness of the discounted cash flow model; (iii) testing the completeness and accuracy of underlying data used in the model; and (iv) evaluating the reasonableness of the significant assumptions used by management related to sales growth and production costs. Evaluating management’s significant assumptions related to sales growth and production costs involved evaluating whether the significant assumptions used by management were reasonable by considering: (i) the current and past performance of the reporting unit; (ii) the consistency with relevant industry data; and (iii) considering whether the assumptions were consistent with evidence obtained in other areas of the audit.\n/s/ \nPricewaterhouseCoopers LLP\nPittsburgh, Pennsylvania\nFebruary 13, 2025\nWe have served as the Company’s auditor since 1950.\n40\nTable\n \nof\n Contents\nHowmet Aerospace Inc. and subsidiaries\nStatement of Consolidated Operations\n(in millions, except per-share amounts)\n \nFor the year ended December 31,\n2024\n2023\n2022\nSales (\nC\n)\n$\n7,430\n \n$\n6,640\n \n$\n5,663\n \nCost of goods sold (exclusive of expenses below)\n5,119\n \n4,773\n \n4,103\n \nSelling, general administrative, and other expenses\n347\n \n333\n \n288\n \nResearch and development expenses\n33\n \n36\n \n32\n \nProvision for depreciation and amortization\n277\n \n272\n \n265\n \nRestructuring and other charges (\nD\n)\n21\n \n23\n \n56\n \nOperating income\n1,633\n \n1,203\n \n919\n \nLoss on debt redemption (\nQ\n)\n6\n \n2\n \n2\n \nInterest expense, net (\nE\n)\n182\n \n218\n \n229\n \nOther expense, net (\nF\n)\n62\n \n8\n \n82\n \nIncome before income taxes\n1,383\n \n975\n \n606\n \nProvision for income taxes (\nH\n)\n228\n \n210\n \n137\n \nNet income\n$\n1,155\n \n$\n765\n \n$\n469\n \nAmounts Attributable to Howmet Aerospace Inc. Common Shareholders (\nJ\n):\nNet income\n$\n1,153\n \n$\n763\n \n$\n467\n \nEarnings per share:\nBasic\n$\n2.83\n \n$\n1.85\n \n$\n1.12\n \nDiluted\n$\n2.81\n \n$\n1.83\n \n$\n1.11\n \nAverage Shares Outstanding (\nI\n):\nBasic\n408\n \n412\n \n416\n \nDiluted\n410\n \n416\n \n421\n \nThe accompanying notes are an integral part of the consolidated financial statements.\n41\nTable\n \nof\n Contents\nHowmet Aerospace Inc. and subsidiaries\nStatement of Consolidated Comprehensive Income\n(in millions)\n \nFor the year ended December 31,\n2024\n2023\n2022\nNet income\n$\n1,155\n \n$\n765\n \n$\n469\n \nOther comprehensive (loss) income, net of tax \n(\nK\n)\n:\nChange in unrecognized net actuarial loss and prior service cost (benefit) related to pension and other postretirement benefits\n17\n \n(\n36\n)\n146\n \nForeign currency translation adjustments \n(\n71\n)\n57\n \n(\n131\n)\nNet change in unrecognized gains (losses) on cash flow hedges\n6\n \n(\n10\n)\n7\n \nTotal Other comprehensive (loss) income, net of tax \n(\n48\n)\n11\n \n22\n \nComprehensive income\n$\n1,107\n \n$\n776\n \n$\n491\n \nThe accompanying notes are an integral part of the consolidated financial statements.\n42\nTable\n \nof\n Contents\nHowmet Aerospace Inc. and subsidiaries\nConsolidated Balance Sheet\n(in millions)\n \nDecember 31,\n2024\n2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n564\n \n$\n610\n \nReceivables from customers, less allowances of $\n—\n in both 2024 and 2023 (\nL\n)\n689\n \n675\n \nOther receivables (\nL\n)\n20\n \n17\n \nInventories (\nM\n)\n1,840\n \n1,765\n \nPrepaid expenses and other current assets\n249\n \n249\n \nTotal current assets\n3,362\n \n3,316\n \nProperties, plants, and equipment, net (\nN\n)\n2,386\n \n2,328\n \nGoodwill (\nA\n and \nO\n)\n4,010\n \n4,035\n \nDeferred income taxes (\nH\n)\n35\n \n46\n \nIntangibles, net (\nO\n)\n475\n \n505\n \nOther noncurrent assets (\nA\n and \nP\n)\n251\n \n198\n \nTotal assets\n$\n10,519\n \n$\n10,428\n \nLiabilities\nCurrent liabilities:\nAccounts payable, trade\n$\n948\n \n$\n982\n \nAccrued compensation and retirement costs\n305\n \n263\n \nTaxes, including income taxes\n60\n \n68\n \nAccrued interest payable\n59\n \n65\n \nOther current liabilities (\nA\n and \nP\n)\n171\n \n200\n \nLong-term debt due within one year (\nQ\n and \nR\n)\n6\n \n206\n \nTotal current liabilities\n1,549\n \n1,784\n \nLong-term debt, less amount due within one year (\nQ\n and \nR\n)\n3,309\n \n3,500\n \nAccrued pension benefits (\nG\n)\n625\n \n664\n \nAccrued other postretirement benefits (\nG\n)\n54\n \n92\n \nOther noncurrent liabilities and deferred credits (\nA\n and \nP\n)\n428\n \n351\n \nTotal liabilities\n5,965\n \n6,391\n \nContingencies and commitments (\nU\n)\nEquity\nHowmet Aerospace Inc. shareholders’ equity:\nPreferred stock (\nI\n)\n55\n \n55\n \nCommon stock (\nI\n)\n405\n \n410\n \nAdditional capital (\nI\n)\n3,206\n \n3,682\n \nRetained earnings (\nA\n)\n2,766\n \n1,720\n \nAccumulated other comprehensive loss (\nA\n and \nK\n)\n(\n1,878\n)\n(\n1,830\n)\nTotal equity\n4,554\n \n4,037\n \nTotal liabilities and equity\n$\n10,519\n \n$\n10,428\n \nThe accompanying notes are an integral part of the consolidated financial statements.\n43\nTable\n \nof\n Contents\n Howmet Aerospace Inc. and subsidiaries\nStatement of Consolidated Cash Flows\n(in millions)\nFor the year ended December 31,\n2024\n2023\n2022\nOperating activities \nNet income\n$\n1,155\n \n$\n765\n \n$\n469\n \nAdjustments to reconcile net income to cash provided from operations:\nDepreciation and amortization\n277\n \n272\n \n265\n \nDeferred income taxes\n55\n \n108\n \n79\n \nRestructuring and other charges\n21\n \n23\n \n56\n \nNet realized and unrealized losses\n25\n \n22\n \n18\n \nNet periodic pension cost (\nG\n)\n40\n \n37\n \n24\n \nStock-based compensation\n63\n \n50\n \n54\n \nLoss on debt redemption (\nQ\n)\n6\n \n2\n \n2\n \nOther\n1\n \n3\n \n12\n \nChanges in assets and liabilities, excluding effects of acquisitions, divestitures, and foreign currency translation adjustments:\n       Increase in receivables (\nL\n)\n(\n57\n)\n(\n164\n)\n(\n161\n)\nIncrease in inventories\n(\n106\n)\n(\n142\n)\n(\n234\n)\nIncrease in prepaid expenses and other current assets\n(\n14\n)\n(\n24\n)\n(\n6\n)\n(Decrease) increase in accounts payable, trade\n(\n49\n)\n(\n7\n)\n246\n \nIncrease in accrued expenses \n5\n \n37\n \n23\n \nDecrease in taxes, including income taxes\n(\n14\n)\n(\n7\n)\n(\n12\n)\nPension contributions \n(\n79\n)\n(\n36\n)\n(\n43\n)\n(Increase) decrease in noncurrent assets\n(\n3\n)\n(\n4\n)\n1\n \nDecrease in noncurrent liabilities\n(\n28\n)\n(\n34\n)\n(\n60\n)\nCash provided from operations\n1,298\n \n901\n \n733\n \nFinancing Activities\nNet change in short-term borrowings\n—\n \n—\n \n(\n5\n)\nAdditions to debt (\nQ\n)\n500\n \n400\n \n—\n \nRepurchases and payments on debt (\nQ\n)\n(\n865\n)\n(\n876\n)\n(\n69\n)\nDebt issuance costs (\nQ\n)\n(\n5\n)\n(\n2\n)\n—\n \nPremiums paid on early redemption of debt (\nQ\n)\n(\n5\n)\n(\n1\n)\n(\n2\n)\nRepurchases of common stock (\nI\n)\n(\n500\n)\n(\n250\n)\n(\n400\n)\nProceeds from exercise of employee stock options\n8\n \n11\n \n16\n \nDividends paid to shareholders (\nI\n)\n(\n109\n)\n(\n73\n)\n(\n44\n)\nTaxes paid for net share settlement of equity awards\n(\n49\n)\n(\n77\n)\n(\n22\n)\nOther\n(\n1\n)\n—\n \n—\n \nCash used for financing activities\n(\n1,026\n)\n(\n868\n)\n(\n526\n)\nInvesting Activities\nCapital expenditures (\nC\n and \nS\n)\n(\n321\n)\n(\n219\n)\n(\n193\n)\n  Acquisitions, net of cash acquired\n(\n5\n)\n—\n \n—\n \n  Proceeds from the sale of assets and businesses (\nD\n and \nT\n)\n9\n \n2\n \n58\n \nOther\n1\n \n2\n \n—\n \nCash used for investing activities \n(\n316\n)\n(\n215\n)\n(\n135\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(\n1\n)\n—\n \n(\n2\n)\nNet change in cash, cash equivalents and restricted cash\n(\n45\n)\n(\n182\n)\n70\n \nCash, cash equivalents and restricted cash at beginning of year\n610\n \n792\n \n722\n \nCash, cash equivalents and restricted cash at end of year\n$\n565\n \n$\n610\n \n$\n792\n \nThe accompanying notes are an integral part of the consolidated financial statements.\n44\nTable\n \nof\n Contents\nHowmet Aerospace Inc. and subsidiaries\nStatement of Changes in Consolidated Equity\n(in millions, except per-share amounts)\n  \nPreferred\nstock\nCommon\nstock\nAdditional\ncapital\nRetained earnings\nAccumulated\nother\ncomprehensive\nloss\nTotal\nequity\nBalance at December 31, 2021\n$\n55\n \n$\n422\n \n$\n4,291\n \n$\n603\n \n$\n(\n1,863\n)\n$\n3,508\n \nNet income\n— \n— \n— \n469\n \n— \n469\n \nOther comprehensive income (\nK\n)\n— \n— \n— \n— \n22\n \n22\n \nCash dividends declared:\nPreferred–Class A @ $\n3.75\n per share\n— \n— \n— \n(\n2\n)\n— \n(\n2\n)\nCommon @ $\n0.10\n per share\n— \n— \n— \n(\n42\n)\n— \n(\n42\n)\nRepurchase and retirement of common stock (\nI\n)\n— \n(\n12\n)\n(\n388\n)\n— \n— \n(\n400\n)\nStock-based compensation (\nI\n)\n— \n— \n54\n \n— \n— \n54\n \nCommon stock issued: compensation plans (\nI\n)\n— \n2\n \n(\n10\n)\n— \n— \n(\n8\n)\nBalance at December 31, 2022\n$\n55\n \n$\n412\n \n$\n3,947\n \n$\n1,028\n \n$\n(\n1,841\n)\n$\n3,601\n \nNet income\n— \n— \n— \n765\n \n— \n765\n \nOther comprehensive income (\nK\n)\n— \n— \n— \n— \n11\n \n11\n \nCash dividends declared:\nPreferred–Class A @ $\n3.75\n per share\n— \n— \n— \n(\n2\n)\n— \n(\n2\n)\nCommon @ $\n0.17\n per share\n— \n— \n— \n(\n71\n)\n— \n(\n71\n)\nRepurchase and retirement of common stock (\nI\n)\n— \n(\n5\n)\n(\n246\n)\n— \n— \n(\n251\n)\nStock-based compensation (\nI\n)\n— \n— \n50\n \n— \n— \n50\n \nCommon stock issued: compensation plans (\nI\n)\n— \n3\n \n(\n69\n)\n— \n— \n(\n66\n)\nBalance at December 31, 2023\n$\n55\n \n$\n410\n \n$\n3,682\n \n$\n1,720\n \n$\n(\n1,830\n)\n$\n4,037\n \nNet income\n— \n— \n— \n1,155\n \n— \n1,155\n \nOther comprehensive loss (\nK\n)\n— \n— \n— \n— \n(\n48\n)\n(\n48\n)\nCash dividends declared:\nPreferred–Class A @ $\n3.75\n per share\n— \n— \n— \n(\n2\n)\n— \n(\n2\n)\nCommon @ $\n0.26\n per share\n— \n— \n— \n(\n107\n)\n— \n(\n107\n)\nRepurchase and retirement of common stock (\nI\n)\n— \n(\n6\n)\n(\n498\n)\n— \n— \n(\n504\n)\nStock-based compensation (\nI\n)\n— \n— \n63\n \n— \n— \n63\n \nCommon stock issued: compensation plans (\nI\n)\n— \n1\n \n(\n41\n)\n— \n— \n(\n40\n)\nBalance at December 31, 2024\n$\n55\n \n$\n405\n \n$\n3,206\n \n$\n2,766\n \n$\n(\n1,878\n)\n$\n4,554\n \nThe accompanying notes are an integral part of the consolidated financial statements.\n45\nTable\n \nof\n Contents\nHowmet Aerospace Inc. and subsidiaries\nNotes to the Consolidated Financial Statements\n(dollars in millions, except share and per-share amounts)\nA. \nSummary of Significant Accounting Policies\nBasis of Presentation.\n The Consolidated Financial Statements of Howmet Aerospace Inc. (formerly known as Arconic Inc.) and subsidiaries (“Howmet” or the “Company” or “we” or “our”) are prepared in conformity with accounting principles generally accepted in the United States of America (“GAAP”) and require management to make certain judgments, estimates, and assumptions. These estimates are based on historical experience and, in some cases, assumptions based on current and future market expectations, including considerations relating to changes in the aerospace industry. The impact of these changes, including the macroeconomic considerations, remains highly uncertain. Management has made its best estimates using all relevant information available at the time, but it is possible that our estimates will differ from our actual results and affect the Consolidated Financial Statements in future periods and potentially require adverse adjustments to the recoverability of goodwill, intangible and long-lived assets, the realizability of deferred tax assets, and other judgments and estimations and assumptions. These may affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements. They also may affect the reported amounts of sales and expenses during the reporting period. Actual results could differ from those estimates upon subsequent resolution of identified matters. Certain amounts in previously issued financial statements were reclassified to conform to the current period presentation.\nThe Company derived approximately \n52\n%\n, \n49\n%, and \n46\n%\n of its revenue from products sold to the commercial aerospace market for the years ended December 31, 2024, 2023, and 2022, respectively. Aircraft production in the commercial aerospace industry continues to grow based on increases in demand for narrow body and wide body aircraft. We expect our commercial aerospace wide body and narrow body demand, including engine spares, also to continue to grow. Quality control issues at The Boeing Company (“Boeing”) have had and are expected to continue to have a negative impact on narrow body and wide body production rates in the near term. For instance, the Federal Aviation Administration stated that it will not approve production rate increases above 38 aircraft per month or additional production lines for the Boeing 737 MAX until it is satisfied that Boeing is in full compliance with required quality control procedures. In addition, a labor union work stoppage and ensuing production restart at Boeing has negatively impacted results. Boeing production levels have had and are expected to have a material impact on the financial performance of Howmet. The timing and level of future aircraft builds by original equipment manufacturers are subject to changes and uncertainties, which may cause our future results to differ from prior periods due to changes in product mix in certain segments.\nPrinciples of Consolidation.\n The Consolidated Financial Statements include the accounts of Howmet Aerospace Inc. and companies in which Howmet Aerospace Inc. has a controlling interest. Intercompany transactions have been eliminated. Investments in affiliates in which Howmet Aerospace Inc. cannot exercise significant influence that do not have readily determinable fair values are accounted for at cost less impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer.\nManagement also evaluates whether a Howmet Aerospace Inc. entity or interest is a variable interest entity and whether Howmet Aerospace Inc. is the primary beneficiary. Consolidation is required if both of these criteria are met. Howmet Aerospace Inc. does not have any variable interest entities requiring consolidation.\nCash Equivalents.\n Cash equivalents are highly liquid investments purchased with an original maturity of three months or less.\nInventory Valuation.\n Inventories are carried at the lower of cost or net realizable value with the cost of inventories determined under a combination of the first-in, first-out (“FIFO”), last-in, first-out (“LIFO”) and average-cost methods. LIFO is used for inventory valuation for certain of the U.S. locations in the Engine Products, Engineered Structures, and Forged Wheels segments, See \nNote M\n for further details.\nProperties, Plants, and Equipment.\n Properties, plants, and equipment are recorded at cost. Depreciation is recorded principally on the straight-line method at rates based on the estimated useful lives of the assets. \nThe following table details the weighted-average useful lives of structures and machinery and equipment by reporting segment (numbers in years):\nStructures\nMachinery and equipment\n   Engine Products\n28\n16\n   Fastening Systems\n27\n17\n   Engineered Structures\n29\n20\n   Forged Wheels\n27\n18\n46\nTable\n \nof\n Contents\nGains or losses from the sale of asset groups or properties are generally recorded in Restructuring and other charges while the sale of individual assets are recorded in Other expense, net (see policy below for assets classified as discontinued operations and held for sale). Repairs and maintenance are charged to expense as incurred. Interest related to the construction of qualifying assets is capitalized as part of the construction costs.\nProperties, plants, and equipment are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets (asset group) may not be recoverable. Recoverability of assets is determined by comparing the estimated undiscounted net cash flows of the operations related to the assets (asset group) to their carrying amount. \nAn impairment loss would be recognized when the carrying amount of the assets (asset group) exceeds the estimated undiscounted net cash flows. The amount of the impairment loss to be recorded is measured as the excess of the carrying value of the assets (asset group) over their fair value, with fair value determined using the best information available, which generally is a discounted cash flow (“DCF”) model. The determination of what constitutes an asset group, the associated estimated undiscounted net cash flows, and the estimated useful lives of the assets also require significant judgments. See \nNote N\n for further details.\nGoodwill. \nGoodwill is not amortized; instead, it is reviewed for impairment annually (in the fourth quarter) or more frequently if indicators of impairment exist or if a decision is made to sell or realign a business. A significant amount of judgment is involved in determining if an indicator of impairment has occurred. Such indicators may include deterioration in general economic conditions, negative developments in equity and credit markets, adverse changes in the markets in which an entity operates, increases in input costs that have a negative effect on earnings and cash flows, or a trend of negative or declining cash flows over multiple periods, among others. The fair value that could be realized in an actual transaction may differ from that used to evaluate the impairment of goodwill.\nGoodwill is allocated among and evaluated for impairment at the reporting unit level, which is defined as an operating segment or one level below an operating segment. Howmet has \nfour\n reporting units composed of the Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels segments.\nHowmet determines annually, based on facts and circumstances, which of its reporting units will be subject to the qualitative assessment. Under the qualitative assessment, various events and circumstances (similar to the impairment indicators above) that would affect the estimated fair value of a reporting unit are identified to determine if a quantitative assessment should be performed. Management also considers the most recent forecasted cash flows and discount rates in determining if the prior fair value measurement estimate may be reduced to a level that would indicate impairment is more likely than not and compares the weighted average cost of capital (“WACC”) between the current and prior years for each reporting unit. If management concludes it is more likely than not (greater than \n50\n%) that the estimated fair value of a reporting unit is less than its carrying amount, we will proceed directly to the quantitative impairment test. Howmet will periodically refresh a reporting unit’s fair value measurement and this is based on a number of factors, including how much fair value exceeded carrying value in the most recent quantitative assessment and the reporting unit’s recent performance. Our policy is that a quantitative impairment test be performed for each reporting unit at least once during every \nthree-year\n period. For those reporting units where a qualitative assessment is either not performed or for which the conclusion is that an impairment is more likely than not, a quantitative impairment test will be performed.\nOther Intangible Assets. \nIntangible assets with indefinite useful lives are not amortized while intangible assets with finite useful lives are amortized generally on a straight-line basis over the periods benefited. \nThe following table details the weighted-average useful lives of software and other intangible assets by reporting segment (numbers in years):\nSoftware\nOther intangible assets\n   Engine Products\n7\n33\n   Fastening Systems\n5\n23\n   Engineered Structures\n3\n18\n   Forged Wheels\n4\n25\n47\nTable\n \nof\n Contents\nLeases. \nThe Company determines whether a contract contains a lease at inception. The Company leases land and buildings, plant equipment, vehicles, and computer equipment which have been classified as operating leases. Certain real estate leases include one or more options to renew; the exercise of lease renewal options is at the Company’s discretion. The Company includes renewal option periods in the lease term when it is determined that the options are reasonably certain to be exercised. Certain of Howmet’s real estate lease agreements include rental payments that either have fixed contractual increases over time or adjust periodically for inflation. Certain of the Company’s lease agreements include variable lease payments. The variable portion of payments is not included in the initial measurement of the right-of-use asset or lease liability due to the uncertainty of the payment amount and is recorded as lease cost in the period incurred. The Company also rents or subleases certain real estate to third parties, which is not material to the consolidated financial statements.\nOperating lease right-of-use assets and lease liabilities with an initial term greater than 12 months are recorded on the balance sheet at the present value of the future minimum lease payments over the lease term at the lease commencement date and are recognized as lease expense on a straight-line basis over the lease term. The Company uses an incremental collateralized borrowing rate based on the information available at the lease commencement date in determining the present value of future payments, as most of its leases do not provide an implicit rate. The operating lease right-of-use assets also include any lease prepayments made and are reduced by lease incentives and accrued exit costs.\nEnvironmental Matters.\n Expenditures for current operations are expensed or capitalized, as appropriate. Expenditures relating to existing conditions caused by past operations, which will not contribute to future sales, are expensed. Liabilities are recorded when remediation costs are probable and can be reasonably estimated. The liability may include costs such as site investigations, consultant fees, feasibility studies, outside contractors, and monitoring expenses. Estimates are generally not discounted or reduced by potential claims for recovery. Claims for recovery are recognized when probable and as agreements are reached with third parties. The estimates also include costs related to other potentially responsible parties to the extent that Howmet has reason to believe such parties will not fully pay their proportionate share. The liability is continuously reviewed and adjusted to reflect current remediation progress, prospective estimates of required activity, and other factors that may be relevant, including changes in technology or regulations.\nLitigation and Contingent Liabilities.\n From time to time, we are involved in various lawsuits, claims, investigations, and proceedings. These matters may include speculative claims for substantial or indeterminate amounts of damages. Management determines the likelihood of an unfavorable outcome based on many factors, such as the nature of the matter, available defenses and case strategy, progress of the matter, views and opinions of legal counsel and other advisors, applicability and success of appeals processes, and the outcome of similar historical matters, among others. If an unfavorable outcome is deemed probable and the amount of the potential loss can be estimated, the most reasonable loss estimate is recorded. If an unfavorable outcome of a matter is deemed probable but the loss is not reasonably estimable, or if an unfavorable outcome is deemed reasonably possible, then the matter is disclosed but no liability is recorded. Legal matters are reviewed on a continuous basis to determine if there has been a change in management’s judgment regarding the likelihood of an unfavorable outcome or the estimate of a potential loss.\nRevenue Recognition.\n The Company's contracts with customers are comprised of acknowledged purchase orders incorporating the Company’s standard terms and conditions, or for larger customers, may also generally include terms under negotiated multi-year agreements. These contracts with customers typically consist of the manufacturing of products which represent single performance obligations that are satisfied upon transfer of control of the product to the customer. The Company produces fastening systems; seamless rolled rings; investment castings, including airfoils; extruded, machined and formed aircraft parts; and forged aluminum commercial vehicle wheels. Transfer of control is assessed based on alternative use of the products we produce and our enforceable right to payment for performance to date under the contract terms. Transfer of control and revenue recognition generally occur upon shipment or delivery of the product, which is when title, ownership and risk of loss pass to the customer and is based on the applicable shipping terms. The shipping terms vary across all businesses and depend on the product, the country of origin, and the type of transportation (truck, train, or vessel). An invoice for payment is issued at the time of shipment. Our segments set commercial terms on which Howmet sells products to its customers. These terms are influenced by industry custom, market conditions, product line (specialty versus commodity products), and other considerations.\nIn certain circumstances, Howmet receives advanced payments from its customers for product to be delivered in future periods. These advanced payments are recorded as deferred revenue until the product is delivered and title and risk of loss have passed to the customer in accordance with the terms of the contract. Deferred revenue was $\n60\n and $\n64\n as of December 31, 2024 and 2023, respectively, and is included in Other current liabilities and Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet.\n48\nTable\n \nof\n Contents\nIncome Taxes.\n The provision for income taxes is determined using the asset and liability approach of accounting for income taxes. Under this approach, the provision for income taxes represents income taxes paid or payable (or received or receivable) for the current year plus the change in deferred taxes during the year. Deferred taxes represent the future tax consequences expected to occur when the reported amounts of assets and liabilities are recovered or paid, and result from differences between the financial and tax bases of Howmet’s assets and liabilities and are adjusted for changes in tax rates and tax laws when enacted.\nValuation allowances are recorded to reduce deferred tax assets when it is more likely than not (greater than 50%) that a tax benefit will not be realized. In evaluating the need for a valuation allowance, management considers all potential sources of taxable income, including income available in carryback periods, future reversals of taxable temporary differences, projections of taxable income, and income from tax planning strategies, as well as all available positive and negative evidence. Positive evidence includes factors such as a history of profitable operations, projections of future profitability within the carryforward period, including from tax planning strategies, and Howmet’s experience with similar operations. Existing favorable contracts and the ability to sell products into established markets are additional positive evidence. Negative evidence includes items such as cumulative losses, projections of future losses, or carryforward periods that are not long enough to allow for the utilization of a deferred tax asset based on existing projections of income. Deferred tax assets for which no valuation allowance is recorded may not be realized upon changes in facts and circumstances, resulting in a future charge to establish a valuation allowance. Existing valuation allowances are re-examined under the same standards of positive and negative evidence. If it is determined that it is more likely than not that a deferred tax asset will be realized, the appropriate amount of the valuation allowance, if any, is released. Deferred tax assets and liabilities are also remeasured to reflect changes in underlying tax rates due to law changes and the granting and lapse of tax holidays.\nIt is Howmet’s policy to apply a tax law ordering approach when considering the need for a valuation allowance on net operating losses expected to offset Global Intangible Low-Taxed Income (“GILTI”) inclusions. Under this approach, reductions in cash tax savings are not considered as part of the valuation allowance assessment. Instead, future GILTI inclusions are considered a source of taxable income that support the realizability of deferred tax assets.\nIt is Howmet’s policy to treat taxes due from future inclusions in United States (“U.S.”) taxable income related to GILTI as a current period expense when incurred.\nTax benefits related to uncertain tax positions taken or expected to be taken on a tax return are recorded when such benefits meet a more likely than not threshold. Otherwise, these tax benefits are recorded when a tax position has been effectively settled, which means that the statute of limitations has expired or the appropriate taxing authority has completed their examination even though the statute of limitations remains open. Interest and penalties related to uncertain tax positions are recognized as part of the provision for income taxes and are accrued beginning in the period that such interest and penalties would be applicable under relevant tax law until such time that the related tax benefits are recognized.\nStock-Based Compensation.\n Howmet recognizes compensation expense for employee equity grants using the non-substantive vesting period approach, in which the expense is recognized ratably over the requisite service period based on the grant date fair value. Forfeitures are accounted for as they occur. For restricted stock unit awards, the fair value is equivalent to the closing market price of Howmet’s common stock on the date of grant. The fair value of performance awards containing a market condition is valued using a Monte Carlo valuation model. Determining the fair value at the grant date requires judgment, including estimates for the average risk-free interest rate, dividend yield, volatility, and exercise behavior. These assumptions may differ significantly between grant dates because of changes in the actual results of these inputs that occur over time.\nForeign Currency.\n The local currency is the functional currency for Howmet’s significant operations outside the U.S., except for certain operations in Canada and the United Kingdom (“U.K.”), where the U.S. dollar is used as the functional currency. The determination of the functional currency for Howmet’s operations is made based on the appropriate economic and management indicators.\nDerivatives and Hedging. \nDerivatives are held for purposes other than trading and are part of a formally documented risk management program. The Company uses commodity derivative financial instruments to manage its economic risk. For interest rate exposures, we may use interest rate swaps and cross-currency swaps to effect a fixed rate payment and hedge the variability in future payment changes. \nThe Company records derivative instruments \non its consolidated balance sheets at fair value and evaluates hedge effectiveness when electing to apply hedge accounting. When electing to apply hedge accounting, the Company formally documents all derivative hedges at inception and the underlying hedged items, as well as the risk management objectives and strategies for undertaking the hedge transaction.\n49\nTable\n \nof\n Contents\nFor derivatives and debt instruments that are designated and qualify for hedge accounting, changes in the fair value are recorded in Accumulated other comprehensive income (loss). Derivatives that are designated as cash flow hedges are recorded in Accumulated other comprehensive income (loss) and reclassified to the Consolidated Statements of Operations when the effects of the item being hedged are recognized in the Consolidated Statements of Operations. The remeasurements of debt instruments designated as net investment hedges are recorded in Accumulated other comprehensive income (loss) and will be reclassified to earnings only upon the sale or liquidation of the Company’s hedged net investment. Cash flows from derivatives are recognized in the Statement of Consolidated Cash Flows in a manner consistent with the underlying transactions.\nAcquisitions.\n Howmet’s business acquisitions are accounted for using the acquisition method. The purchase price is allocated to the assets acquired and liabilities assumed based on their estimated fair values. Any excess purchase price over the fair value of the net assets acquired is recorded as goodwill. For all acquisitions, operating results are included in the Statement of Consolidated Operations from the date of the acquisition.\nDiscontinued Operations and Assets Held for Sale.\n For those businesses where management has committed to a plan to divest, each business is valued at the lower of its carrying amount or estimated fair value less cost to sell. If the carrying amount of the business exceeds its estimated fair value, an impairment loss is recognized. Fair value is estimated using accepted valuation techniques such as a DCF model, valuations performed by third parties, earnings multiples, or indicative bids, when available. A number of significant estimates and assumptions are involved in the application of these techniques, including the forecasting of markets and market share, sales volumes and prices, costs and expenses, and multiple other factors. Management considers historical experience and all available information at the time the estimates are made; however, the fair value that is ultimately realized upon the divestiture of a business may differ from the estimated fair value reflected in the Consolidated Financial Statements. Depreciation and amortization expense is not recorded on assets of a business to be divested once they are classified as held for sale. Businesses to be divested are generally classified in the Consolidated Financial Statements as either discontinued operations or held for sale.\nFor businesses classified as discontinued operations, the balance sheet amounts and results of operations are reclassified from their historical presentation to assets and liabilities of discontinued operations on the Consolidated Balance Sheet and to discontinued operations on the Statement of Consolidated Operations, respectively, for all periods presented. The gains or losses associated with these divested businesses are recorded in discontinued operations on the Statement of Consolidated Operations. The Statement of Consolidated Cash Flows is not required to be reclassified for discontinued operations for any period. Segment information does not include the assets or operating results of businesses classified as discontinued operations for all periods presented. These businesses are expected to be disposed of within \none year\n.\nFor businesses classified as held for sale that do not qualify for discontinued operations treatment, the balance sheet and cash flow amounts are reclassified from their historical presentation to assets and liabilities of operations held for sale for all periods presented. The results of operations continue to be reported in continuing operations. The gains or losses associated with these divested businesses are recorded in Restructuring and other charges on the Statement of Consolidated Operations. The segment information includes the assets and operating results of businesses classified as held for sale for all periods presented.\nB. \nRecently Adopted and Recently Issued Accounting Guidance\nRecently Adopted Accounting Guidance.\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued guidance to enhance disclosures related to significant segment expenses and other matters related to reportable segments. These changes become effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. The adoption of this new disclosure is reflected in \nNote C\n of the Consolidated Financial Statements.\nIn September 2022, the FASB issued guidance to enhance the transparency of disclosures regarding supplier finance programs. These changes became effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the amendment on rollforward information, which is effective for fiscal years beginning after December 15, 2023. The adoption of this new disclosure is reflected in \nNote S\n of the Consolidated Financial Statements.\nRecently Issued Accounting Guidance.\nIn November 2024, the FASB issued guidance to improve disclosures about an entity’s expenses including more detailed information about the components of expenses in commonly presented expense captions. These changes become effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027. Management is currently evaluating the impact of these changes on the Consolidated Financial Statements.\nIn December 2023, the FASB issued guidance to enhance the transparency of income tax disclosures including additional details on the rate reconciliation and taxes paid by jurisdiction. These changes become effective for fiscal years beginning after December 15, 2024. Management is currently evaluating the impact of these changes on the Consolidated Financial Statements.\n50\nTable\n \nof\n Contents\nC. \nSegment and Geographic Area Information\nHowmet is a global leader in lightweight metals engineering and manufacturing. Howmet’s innovative, multi-material products, which include nickel, titanium, aluminum, and cobalt, are used worldwide in the aerospace (commercial and defense), commercial transportation, and industrial and other markets. Segment performance under Howmet’s management reporting system is evaluated based on Segment Adjusted EBITDA. The Company’s Chief Executive Officer, who has been determined to be our Chief Operating Decision Maker (“CODM”), believes that Segment Adjusted EBITDA provides information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Howmet’s definition of Segment Adjusted EBITDA (Earnings before interest, taxes, depreciation, and amortization) is net margin plus an add-back for depreciation and amortization. Net margin is equivalent to Sales minus the following items: Cost of goods sold; Selling, general administrative, and other expenses; Research and development (“R&D”) expenses; and Provision for depreciation and amortization. Special items, including Restructuring and other charges, are excluded from net margin and Segment Adjusted EBITDA. The Company’s CODM considers forecast-to-actual variances for Segment Adjusted EBITDA when allocating resources across the Company’s reportable segments. Segment Adjusted EBITDA may not be comparable to similarly titled measures of other companies. Differences between the total segment and consolidated totals are in Corporate. \nHowmet’s operations consist of \nfour\n worldwide reportable segments as follows:\nEngine Products\nEngine Products produces investment castings, including airfoils, and seamless rolled rings primarily for aircraft engines and industrial gas turbine applications. Engine Products produces rotating parts as well as structural parts.\nFastening Systems\nFastening Systems produces aerospace fastening systems, as well as commercial transportation, industrial and other fasteners. The business’s high-tech, multi-material fastening systems are found nose to tail on aircraft and aero engines. Fastening Systems’ products are also critical components of commercial transportation vehicles, and construction, industrial, and renewable energy equipment.\nEngineered Structures\nEngineered Structures produces titanium ingots and mill products for aerospace and defense applications and is vertically integrated to produce titanium forgings, titanium extrusions, and machining services for airframe, wing, aero-engine, and landing gear components. Engineered Structures also produces aluminum forgings, nickel forgings, and aluminum machined components and assemblies for aerospace and defense applications.\nForged Wheels\nForged Wheels provides forged aluminum wheels and related products for heavy-duty trucks and the commercial transportation market.\n51\nTable\n \nof\n Contents\nThe operating results and assets of the Company's reportable segments were as follows:\nYear ended\nEngine Products\nFastening Systems\nEngineered Structures\nForged Wheels\nTotal\nSegment\n2024\nSales:\nThird-party sales\n$\n3,735\n \n$\n1,576\n \n$\n1,065\n \n$\n1,054\n \n$\n7,430\n \nInter-segment sales\n7\n \n1\n \n10\n \n—\n \n18\n \nTotal sales\n$\n3,742\n \n$\n1,577\n \n$\n1,075\n \n$\n1,054\n \n$\n7,448\n \nExpenses:\nSegment Adjusted cost of goods sold\n(1)\n$\n2,495\n \n$\n1,061\n \n$\n873\n \n$\n724\n \n$\n5,153\n \n   Other segment items\n(2)\n97\n \n110\n \n36\n \n43\n \n286\n \nProfit and loss:\nSegment Adjusted EBITDA\n$\n1,150\n \n$\n406\n \n$\n166\n \n$\n287\n \n$\n2,009\n \nRestructuring and other charges\n1\n \n5\n \n12\n \n1\n \n19\n \nProvision for depreciation and amortization\n139\n \n47\n \n42\n \n42\n \n270\n \nOther:\nCapital expenditures\n$\n219\n \n$\n26\n \n$\n20\n \n$\n45\n \n$\n310\n \nTotal assets\n5,145\n \n2,711\n \n1,355\n \n701\n \n9,912\n \n2023\nSales:\nThird-party sales\n$\n3,266\n \n$\n1,349\n \n$\n878\n \n$\n1,147\n \n$\n6,640\n \nInter-segment sales\n13\n \n—\n \n3\n \n—\n \n16\n \nTotal sales\n$\n3,279\n \n$\n1,349\n \n$\n881\n \n$\n1,147\n \n$\n6,656\n \nExpenses:\nSegment Adjusted cost of goods sold\n(1)\n$\n2,295\n \n$\n959\n \n$\n720\n \n$\n796\n \n$\n4,770\n \n   Other segment items\n(2)\n97\n \n112\n \n48\n \n42\n \n299\n \nProfit and loss:\nSegment Adjusted EBITDA\n$\n887\n \n$\n278\n \n$\n113\n \n$\n309\n \n$\n1,587\n \nRestructuring and other (credits) charges\n(\n2\n)\n1\n \n21\n \n—\n \n20\n \nProvision for depreciation and amortization\n130\n \n46\n \n47\n \n39\n \n262\n \nOther:\nCapital expenditures\n$\n112\n \n$\n31\n \n$\n26\n \n$\n36\n \n$\n205\n \nTotal assets\n4,926\n \n2,749\n \n1,415\n \n724\n \n9,814\n \n2022\nSales:\nThird-party sales\n$\n2,698\n \n$\n1,117\n \n$\n790\n \n$\n1,058\n \n$\n5,663\n \nInter-segment sales\n4\n \n—\n \n6\n \n—\n \n10\n \nTotal sales\n$\n2,702\n \n$\n1,117\n \n$\n796\n \n$\n1,058\n \n$\n5,673\n \nExpenses:\nSegment Adjusted cost of goods sold\n(1)\n$\n1,881\n \n$\n782\n \n$\n644\n \n$\n745\n \n$\n4,052\n \n   Other segment items\n(2)\n92\n \n101\n \n41\n \n35\n \n269\n \nProfit and loss:\nSegment Adjusted EBITDA\n$\n729\n \n$\n234\n \n$\n111\n \n$\n278\n \n$\n1,352\n \nRestructuring and other charges\n29\n \n8\n \n7\n \n2\n \n46\n \nProvision for depreciation and amortization\n125\n \n45\n \n48\n \n40\n \n258\n \n52\nTable\n \nof\n Contents\nOther:\nCapital expenditures\n$\n94\n \n$\n39\n \n$\n17\n \n$\n28\n \n$\n178\n \nTotal assets\n4,784\n \n2,661\n \n1,273\n \n701\n \n9,419\n \n(1)     \nSegment Adjusted cost of goods sold is exclusive of Provision for depreciation and amortization, Restructuring and other charges, and Corporate expenses.\n(2)     \nOther segment items includes Selling, general administrative, and other expenses, and Research and development expenses; exclusive of Provision for depreciation and amortization, and Restructuring and other charges. \nThe following table reconciles Total segment capital expenditures, which are presented on an accrual basis, with Capital expenditures as presented on the Statement of Consolidated Cash Flows. Differences between the total segment and consolidated totals are in Corporate, including the impact of changes in accrued capital expenditures during the period.\nFor the year ended December 31,\n2024\n2023\n2022\nTotal segment capital expenditures\n$\n310\n \n$\n205\n \n$\n178\n \nCorporate\n11\n \n14\n \n15\n \nCapital expenditures\n$\n321\n \n$\n219\n \n$\n193\n \nThe following tables reconcile certain segment information to consolidated totals. Differences between the total segment and consolidated totals are in Corporate.\nFor the year ended December 31,\n2024\n2023\n2022\nTotal Segment Adjusted EBITDA\n$\n2,009\n \n$\n1,587\n \n$\n1,352\n \nSegment provision for depreciation and amortization\n(\n270\n)\n(\n262\n)\n(\n258\n)\nUnallocated amounts:\nRestructuring and other charges (\nD\n)\n(\n21\n)\n(\n23\n)\n(\n56\n)\nCorporate expense\n(\n85\n)\n(\n99\n)\n(\n119\n)\nOperating income\n$\n1,633\n \n$\n1,203\n \n$\n919\n \nLoss on debt redemption\n(\n6\n)\n(\n2\n)\n(\n2\n)\nInterest expense, net\n(\n182\n)\n(\n218\n)\n(\n229\n)\nOther expense, net (\nF\n)\n(\n62\n)\n(\n8\n)\n(\n82\n)\nIncome before income taxes\n$\n1,383\n \n$\n975\n \n$\n606\n \nDecember 31,\n2024\n2023\nAssets:\nTotal segment assets\n$\n9,912\n \n$\n9,814\n \nUnallocated amounts:\nCash and cash equivalents\n564\n \n610\n \nDeferred income taxes\n36\n \n46\n \nCorporate fixed assets, net\n83\n \n83\n \nFair value of derivative contracts\n4\n \n—\n \nAccounts receivable securitization\n(\n250\n)\n(\n250\n)\nOther\n170\n \n125\n \nConsolidated assets\n$\n10,519\n \n$\n10,428\n \nSegment assets include third-party receivables while the accounts receivable securitization item includes the impact of sold receivables under the Company’s Accounts Receivable securitization programs. See \nNote L\n for further details. \n53\nTable\n \nof\n Contents\nGeographic information for sales was as follows (based upon the destination of the sale):\nFor the year ended December 31,\n2024\n2023\n2022\nSales:\nUnited States\n$\n3,713\n \n$\n3,273\n \n$\n2,928\n \nFrance\n678\n \n578\n \n394\n \nGermany\n458\n \n363\n \n292\n \nJapan\n355\n \n378\n \n319\n \nUnited Kingdom\n350\n \n283\n \n228\n \nItaly\n287\n \n220\n \n180\n \nMexico\n220\n \n263\n \n235\n \nCanada\n174\n \n145\n \n138\n \nPoland\n152\n \n130\n \n96\n \nChina\n103\n \n98\n \n111\n \nOther\n940\n \n909\n \n742\n \n$\n7,430\n \n$\n6,640\n \n$\n5,663\n \nGeographic information for long-lived tangible assets was as follows (based upon the physical location of the assets):\nDecember 31,\n2024\n2023\nLong-lived assets:\nUnited States\n$\n1,864\n \n$\n1,760\n \nHungary\n199\n \n200\n \nUnited Kingdom\n121\n \n120\n \nFrance\n112\n \n121\n \nMexico\n68\n \n71\n \nGermany\n54\n \n58\n \nChina\n41\n \n46\n \nOther\n82\n \n80\n \n \n$\n2,541\n \n$\n2,456\n \n54\nTable\n \nof\n Contents\nThe following table disaggregates segment revenue by major market served. Differences between the total segment and consolidated totals are in Corporate.\nEngine Products\nFastening Systems\nEngineered Structures\nForged Wheels\nTotal\nSegment\nYear ended December 31, 2024\nAerospace - Commercial\n$\n2,091\n \n$\n1,006\n \n$\n774\n \n$\n—\n \n$\n3,871\n \nAerospace - Defense \n766\n \n162\n \n236\n \n—\n \n1,164\n \nCommercial Transportation\n—\n \n254\n \n—\n \n1,054\n \n1,308\n \nIndustrial and Other\n878\n \n154\n \n55\n \n—\n \n1,087\n \nTotal end-market revenue\n$\n3,735\n \n$\n1,576\n \n$\n1,065\n \n$\n1,054\n \n$\n7,430\n \nYear ended December 31, 2023\nAerospace - Commercial\n$\n1,798\n \n$\n790\n \n$\n641\n \n$\n—\n \n$\n3,229\n \nAerospace - Defense \n670\n \n173\n \n172\n \n—\n \n1,015\n \nCommercial Transportation\n—\n \n255\n \n—\n \n1,147\n \n1,402\n \nIndustrial and Other\n798\n \n131\n \n65\n \n—\n \n994\n \nTotal end-market revenue\n$\n3,266\n \n$\n1,349\n \n$\n878\n \n$\n1,147\n \n$\n6,640\n \nYear ended December 31, 2022\nAerospace - Commercial\n$\n1,495\n \n$\n616\n \n$\n495\n \n$\n—\n \n$\n2,606\n \nAerospace - Defense \n526\n \n158\n \n239\n \n—\n \n923\n \nCommercial Transportation\n—\n \n225\n \n—\n \n1,058\n \n1,283\n \nIndustrial and Other\n677\n \n118\n \n56\n \n—\n \n851\n \nTotal end-market revenue\n$\n2,698\n \n$\n1,117\n \n$\n790\n \n$\n1,058\n \n$\n5,663\n \nThe Company derived \n68\n%, \n64\n%, and \n62\n% of its revenue from the aerospace (commercial and defense) markets for the years ended December 31, 2024, 2023, and 2022, respectively.\nOn April 2, 2024, General Electric Company, one of our largest customers, completed the spin-off of its energy-focused business into GE Vernova, a new publicly traded company. Since then, General Electric Company operates as GE Aerospace. RTX Corporation and GE Aerospace each represented approximately\n \n10\n% of the Company’s third-party sales for the year ended December 31, 2024. These sales were primarily from the Engine Products segment.\nD. \nRestructuring and Other Charges\nRestructuring and other charges were comprised of the following:\nFor the year ended December 31,\n2024\n2023\n2022\nLayoff costs\n$\n10\n \n$\n3\n \n$\n—\n \nNet reversals of previously recorded layoff reserves\n(\n3\n)\n(\n1\n)\n(\n1\n)\nPension and other post-retirement benefits - net settlements (\nG\n)\n—\n \n5\n \n58\n \nNon-cash asset impairments and accelerated depreciation\n2\n \n14\n \n1\n \nNet losses (gains) related to divestitures of assets and businesses (\nT\n)\n12\n \n(\n1\n)\n(\n8\n)\nOther\n—\n \n3\n \n6\n \nTotal restructuring and other charges\n$\n21\n \n$\n23\n \n$\n56\n \nLayoff costs were recorded based on approved, detailed action plans submitted by the operating locations that specified positions to be eliminated, benefits to be paid under existing severance plans, union contracts, or statutory requirements and the expected timetable for completion of the plans.\n2024 Actions. \nIn 2024, Howmet recorded Restructuring and other charges of $\n21\n, which were primarily due to a net loss on the sale of a small U.K. manufacturing facility in Engineered Structures of $\n13\n, a $\n10\n charge for layoff costs, including the separation of \n431\n employees (\n283\n in Fastening Systems, \n111\n in Engineered Structures and \n37\n in Forged Wheels), and  accelerated depreciation, of $\n2\n, partially offset by the reversal of $\n3\n for layoff reserves in Engineered Structures related to prior periods and a gain on the sale of assets at a small U.K. manufacturing facility in Engine Products of $\n1\n.\n55\nTable\n \nof\n Contents\nAs of \nDecember 31, 2024, \n355\n employees of the \n431\n employees were separated. \nThe remaining separations for the 2024 restructuring programs are expected to be completed in 2025.\n2023 Actions.\n \nIn 2023, Howmet recorded Restructuring and other charges of $\n23\n, which included a $\n12\n charge for impairment of assets primarily related to decommissioned fixed assets in Engineered Structures; a $\n5\n charge for U.S. and Canadian pension plans’ settlement accounting; a $\n3\n charge for layoff costs, including the separation of \n63\n employees in Engineered Structures; a $\n3\n charge for various other exit costs primarily for the closures of small manufacturing facilities and a $\n2\n charge for accelerated depreciation primarily related to the closure of a small Engineered Structures facility in the U.K. These charges were partially offset by a gain of $\n1\n on the sale of assets at a U.S. Engineered Structures facility and a benefit of $\n1\n related to the reversal of layoff reserves related to prior periods.\nAs of \nDecember 31, 2024\n, actions related to the 2023 restructuring programs were complete.\n2022 Actions.\n \nIn 2022, Howmet recorded Restructuring and other charges of $\n56\n, which included a $\n58\n charge for U.S. and U.K. pension plans’ settlement accounting; a $\n6\n charge for various other exit costs; and a $\n1\n charge for accelerated depreciation primarily related to the closure of small U.S. manufacturing facilities in Engineered Structures. These charges were partially offset by a gain of $\n8\n on the sale of assets at a small U.S. manufacturing facility in Engine Products and a benefit of $\n1\n related to the reversal of a number of layoff reserves related to prior periods. \nAs of \nDecember 31, 2024\n, actions related to the 2022 restructuring programs were complete.\nActivity and reserve balances for restructuring charges were as follows:\nLayoff\ncosts\nOther\nexit costs\nTotal\nReserve balances at December 31, 2021\n$\n17\n \n$\n2\n \n$\n19\n \n2022 Activity\nCash payments\n(\n9\n)\n(\n7\n)\n(\n16\n)\nRestructuring and other charges\n56\n \n—\n \n56\n \nOther\n(1)\n(\n58\n)\n7\n \n(\n51\n)\nReserve balances at December 31, 2022\n$\n6\n \n$\n2\n \n$\n8\n \n2023 Activity\nCash payments\n$\n(\n3\n)\n$\n(\n3\n)\n$\n(\n6\n)\nRestructuring and other charges\n7\n \n16\n \n23\n \nOther\n(2)\n(\n5\n)\n(\n13\n)\n(\n18\n)\nReserve balances at December 31, 2023\n$\n5\n \n$\n2\n \n$\n7\n \n2024 Activity\nCash payments\n$\n(\n8\n)\n$\n(\n2\n)\n$\n(\n10\n)\nRestructuring and other charges\n7\n \n14\n \n21\n \nOther\n(3)\n—\n \n(\n14\n)\n(\n14\n)\nReserve balances at December 31, 2024\n$\n4\n \n$\n—\n \n$\n4\n \n(1)\nIn 2022, other for layoff costs included $\n58\n in settlement accounting charges related to U.S. and U.K. pension plans; while other for other exit costs included a gain of $\n8\n on the sale of assets, which was offset by a $\n1\n charge for accelerated depreciation.\n(2)\nIn \n2023, \nother for layoff costs included $\n5\n in settlement accounting charges related to U.S. and Canadian pension plans; while other for other exit costs included charges of $\n12\n related to the impairment of assets and a $\n2\n charge for accelerated depreciation which was offset by a gain of $\n1\n on the sale of assets.\n(3)\nIn \n2024, other for other exit costs included a net loss of $\n13\n on the sale of a small U.K. manufacturing facility and a charge of $\n2\n for accelerated depreciation, partially offset by a gain on the sale of assets at a small U.K. manufacturing facility in Engine Products of $\n1\n.\nThe remaining reserves as of \nDecember 31, 2024\n are expected to be paid in cash during \n2025\n.\n56\nTable\n \nof\n Contents\nE. \nInterest Cost Components\nFor the year ended December 31,\n2024\n2023\n2022\nAmount charged to interest expense, net\n$\n182\n \n$\n218\n \n$\n229\n \nLoss on debt redemption (\nQ\n)\n6\n \n2\n \n2\n \nAmount capitalized\n7\n \n6\n \n6\n \n Total interest cost\n$\n195\n \n$\n226\n \n$\n237\n \nF. \nOther Expense, Net \nFor the year ended December 31,\n2024\n2023\n2022\nNon-service costs - pension and other postretirement benefits (\nG\n)\n$\n29\n \n$\n29\n \n$\n16\n \nInterest income\n(\n20\n)\n(\n23\n)\n(\n6\n)\nForeign currency losses (gains), net\n13\n \n(\n2\n)\n(\n1\n)\nNet realized and unrealized losses\n(1)\n25\n \n22\n \n18\n \nDeferred compensation\n15\n \n10\n \n(\n8\n)\nLegal proceeding\n(2)\n \n—\n \n(\n25\n)\n65\n \nOther, net \n—\n \n(\n3\n)\n(\n2\n)\nTotal other expense, net\n$\n62\n \n$\n8\n \n$\n82\n \n(1)    \nIn all periods presented, Net realized and unrealized losses primarily includes costs associated with sales under the Company’s accounts receivables securitization arrangement and sales of other customer receivables (See \nNote L\n).\n(2)    \nIn 2023, due to the final settlement of the Lehman Brothers International (Europe) legal proceeding \n(See \nNote U\n)\n, L\negal proceeding included the reversal of $\n25\n, net of legal fees of $\n1\n, of the $\n65\n pre-tax charge taken in 2022.\nG. \nPension and Other Postretirement Benefits\nHowmet maintains pension plans covering U.S. employees and certain employees in foreign locations. Defined pension benefits generally depend on length of service and job grade. The majority of benefits are paid through pension trusts that are sufficiently funded to ensure that all plans can pay benefits to retirees as they become due. Most salaried and non-bargaining hourly U.S. employees hired after March 1, 2006 participate in a defined contribution plan instead of a defined benefit plan.\nHowmet also maintains health care and life insurance postretirement benefit plans covering eligible U.S. retired employees. Generally, the medical plans are unfunded and pay a percentage of medical expenses, reduced by deductibles and other coverage. Life benefits are generally provided by insurance contracts. Howmet retains the right, subject to existing agreements, to change or eliminate these benefits. Effective May 1, 2019, salaried and non-bargaining hourly U.S. employees and retirees are not eligible for postretirement life insurance benefits. Effective July 1, 2024, salaried and non-bargaining hourly U.S. employees are not eligible for any postretirement medical benefits.\nIn 2023 and 2022, the Company applied settlement accounting to certain U.S., U.K., and Canadian pension plans due to lump sum payments to participants, which resulted in settlement charges\n of $\n2\n and $\n17\n, respectively, that were recorded in Restructuring and other charges.\nIn May and July 2023, Howmet entered into new collective bargaining agreements with the United Autoworkers and United Steel Workers, respectively. These agreements amended the existing health and welfare plans, resulting in an adjustment to the Company’s Accrued other postretirement benefits liability of $\n10\n, which was offset in Accumulated other comprehensive loss.\nIn June 2023, the Company undertook additional actions to reduce U.S. gross pension obligations by $\n19\n by purchasing group annuity contracts with a third-party carrier to pay and administer future annuity payments. These actions resulted in a settlement charge of $\n3\n and were recorded in Restructuring and other charges in the second quarter ended June 30, 2023 in the Statement of Consolidated Operations. The funded status of the plans have not been significantly impacted. \nIn 2022, a certain U.S. pension plan attained funding levels that allowed full lump sum payments. These payments resulted in settlement charges of $\n41\n that were recorded in Restructuring and other charges in the Statement of Consolidated Operations.\nIn December 2022, the Canadian pension plan was amended to provide for termination of the plan. As a result, the Company recognized a reduction of $\n2\n in the pension benefit obligation through curtailment, which was offset in Accumulated other comprehensive loss in the Consolidated Balance Sheet. The wind-up efforts and satisfaction of all plan liabilities are expected to be completed in 2025.\n57\nTable\n \nof\n Contents\nObligations and Funded Status\n \nPension benefits\nOther\npostretirement benefits\nDecember 31,\n2024\n2023\n2024\n2023\nChange in benefit obligation\nBenefit obligation at beginning of year\n$\n1,592\n \n$\n1,599\n \n$\n103\n \n$\n120\n \nService cost\n3\n \n3\n \n1\n \n1\n \nInterest cost\n75\n \n80\n \n5\n \n7\n \nAmendments\n—\n \n—\n \n(\n2\n)\n(\n10\n)\nActuarial (gains) losses\n(1)\n(\n58\n)\n50\n \n(\n36\n)\n(\n1\n)\nSettlements\n—\n \n(\n31\n)\n—\n \n—\n \nBenefits paid\n(\n112\n)\n(\n118\n)\n(\n11\n)\n(\n14\n)\nForeign currency translation impact\n(\n4\n)\n9\n \n—\n \n—\n \nBenefit obligation at end of year\n(2)\n$\n1,496\n \n$\n1,592\n \n$\n60\n \n$\n103\n \nChange in plan assets\n(2)\nFair value of plan assets at beginning of year\n$\n925\n \n$\n970\n \n$\n—\n \n$\n—\n \nActual (loss) return on plan assets\n(\n8\n)\n57\n \n—\n \n—\n \nEmployer contributions\n79\n \n36\n \n—\n \n—\n \nBenefits paid\n(\n95\n)\n(\n101\n)\n—\n \n—\n \nAdministrative expenses\n(\n12\n)\n(\n13\n)\n—\n \n—\n \nSettlement payments\n—\n \n(\n32\n)\n—\n \n—\n \nForeign currency translation impact\n(\n3\n)\n8\n \n—\n \n—\n \nFair value of plan assets at end of year\n(2)\n$\n886\n \n$\n925\n \n$\n—\n \n$\n—\n \nFunded status\n$\n(\n610\n)\n$\n(\n667\n)\n$\n(\n60\n)\n$\n(\n103\n)\nAmounts recognized in the Consolidated Balance Sheet consist of:\nNoncurrent assets\n$\n31\n \n$\n13\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n16\n)\n(\n16\n)\n(\n6\n)\n(\n11\n)\nNoncurrent liabilities\n(\n625\n)\n(\n664\n)\n(\n54\n)\n(\n92\n)\nNet amount recognized\n$\n(\n610\n)\n$\n(\n667\n)\n$\n(\n60\n)\n$\n(\n103\n)\nAmounts recognized in Accumulated Other Comprehensive Loss consist of:\nNet actuarial loss (gain)\n$\n956\n \n$\n960\n \n$\n(\n59\n)\n$\n(\n26\n)\nPrior service cost (benefit)\n2\n \n2\n \n(\n33\n)\n(\n41\n)\nNet amount recognized, before tax effect\n$\n958\n \n$\n962\n \n$\n(\n92\n)\n$\n(\n67\n)\nOther changes in plan assets and benefit obligations recognized in Other Comprehensive Loss consist of:\nNet actuarial cost (benefit)\n$\n28\n \n$\n86\n \n$\n(\n36\n)\n$\n(\n1\n)\nAmortization of accumulated net actuarial (loss) benefit\n(\n32\n)\n(\n33\n)\n3\n \n3\n \nPrior service benefit\n—\n \n—\n \n(\n2\n)\n(\n10\n)\nAmortization of prior service benefit\n—\n \n—\n \n10\n \n9\n \nNet amount recognized, before tax effect\n$\n(\n4\n)\n$\n53\n \n$\n(\n25\n)\n$\n1\n \n(1)\nAs of December 31, 2024, the actuarial gains impacting the benefit obligation were primarily due to changes in the discount rate, partially offset by asset returns being lower than expected. At \nDecember 31, 2023, \nthe actuarial losses impacting the benefit obligation were primarily due to changes in the discount rate as well as asset returns being lower than expected.\n(2)\nAs of December 31, 2024, the benefit obligation, fair value of plan assets, and funded status for U.S. pension plans were $\n1,356\n, $\n739\n, and $(\n617\n), respectively. As of December 31, 2023, the benefit obligation, fair value of plan assets, and funded status for U.S. pension plans were $\n1,434\n, $\n780\n, and $(\n654\n), respectively.\n58\nTable\n \nof\n Contents\nPension Plan Benefit Obligations\n \nPension benefits\n  \n2024\n2023\nThe projected benefit obligation and accumulated benefit obligation for all defined benefit pension plans were as follows:\nProjected benefit obligation\n$\n1,496\n \n$\n1,592\n \nAccumulated benefit obligation\n1,495\n \n1,591\n \nThe aggregate projected benefit obligation and fair value of plan assets for pension plans with projected benefit obligations in excess of plan assets were as follows:\nProjected benefit obligation\n1,380\n \n1,459\n \nFair value of plan assets\n739\n \n780\n \nThe aggregate accumulated benefit obligation and fair value of plan assets for pension plans with accumulated benefit obligations in excess of plan assets were as follows:\nAccumulated benefit obligation\n1,379\n \n1,459\n \nFair value of plan assets\n739\n \n780\n \nComponents of Net Periodic Benefit Cost\n \nPension benefits\n(1)\nOther postretirement benefits\nFor the year ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n3\n \n$\n3\n \n$\n4\n \n$\n1\n \n$\n1\n \n$\n2\n \nInterest cost\n75\n \n80\n \n51\n \n5\n \n7\n \n4\n \nExpected return on plan assets\n(\n70\n)\n(\n74\n)\n(\n80\n)\n—\n \n—\n \n—\n \nRecognized net actuarial loss (gain)\n32\n \n28\n \n49\n \n(\n3\n)\n(\n3\n)\n1\n \nAmortization of prior service benefit\n—\n \n—\n \n—\n \n(\n10\n)\n(\n9\n)\n(\n9\n)\nSettlements\n(2)\n—\n \n5\n \n58\n \n—\n \n—\n \n—\n \nNet periodic benefit cost\n(3)\n$\n40\n \n$\n42\n \n$\n82\n \n$\n(\n7\n)\n$\n(\n4\n)\n$\n(\n2\n)\n(1)\nIn 2024, 2023, and 2022, net periodic benefit cost for U.S. pension plans was $\n40\n, $\n40\n, and $\n79\n, respectively.\n(2)\nIn 2023, settlements were related to U.S. and Canadian actions including an annuity buyout and lump sum benefit payments. In 2022, settlements were related to U.S. and U.K. lump sum benefit payments. \n(3)\nService cost was included within Cost of goods sold and Selling, general administrative, and other expenses; settlements were included in Restructuring and other charges; all other cost components were recorded in Other expense, net\n \nin the Statement of Consolidated Operations.\nAssumptions\nWeighted average assumptions used to determine benefit obligations for pension and other postretirement benefit plans were as follows:\nDecember 31,\n2024\n2023\nDiscount rate\n5.60\n \n%\n5.10\n \n%\nCash balance plan interest crediting rate\n3.00\n \n%\n3.00\n \n%\nThe U.S. discount rate is determined using a Company-specific yield curve model (above-median) developed with the assistance of an external actuary, while both the U.K. and Canada utilize models developed internally by their respective actuary. The cash flows of the plans’ projected benefit obligations are discounted using a single equivalent rate derived from yields on \nhigh quality corporate bonds, which represent a broad diversification of issuers in various sectors, including finance and banking, industrials, transportation, and utilities, among others. The yield curve models parallel the plans’ projected cash flows, which have a global average duration o\nf \n9\n years. The underlying cash flows of the bonds included in the models exceed the cash flows needed to satisfy the Company’s plans’ obligations multiple times. \nBenefit accruals for future compensation under the Company’s major salaried and non-bargained hourly defined benefit pension plans have ceased. The rate of compensation increase no longer impacts the determination of the benefit obligation. \n59\nTable\n \nof\n Contents\nWeighted average assumptions used to determine net periodic benefit cost for pension and other postretirement benefit plans were as follows:\n2024\n2023\n2022\nDiscount rate to calculate service cost\n(1)\n5.10\n \n%\n5.50\n \n%\n2.80\n \n%\nDiscount rate to calculate interest cost\n(1)\n4.90\n \n%\n5.30\n \n%\n2.50\n \n%\nExpected long-term rate of return on plan assets\n6.70\n \n%\n6.70\n \n%\n6.70\n \n%\nCash balance plan interest crediting rate\n3.00\n \n%\n3.00\n \n%\n3.00\n \n%\n(1)\nIn all periods presented, the respective global discount rates were used to determine net periodic benefit cost for most pension plans for the full annual period. The discount rates for certain plans were updated during 2024, 2023, and 2022 to reflect the remeasurement of these plans due to amendments, settlements, and/or curtailments. The weighted-average rates reflecting these remeasurements does not significantly differ from the rates presented.\nThe expected long-term rate of return on plan assets (“EROA”) is generally applied to a \nfive-year\n market-related value of plan assets. The process used by management to develop this assumption is one that relies on a combination of historical asset return information and forward-looking returns by asset class. As it relates to historical asset return information, management focuses on various historical moving averages when developing this assumption. While consideration is given to recent performance and historical returns, the assumption represents a long-term, prospective return. Management also incorporates expected future returns on current and planned asset allocations using information from various external investment managers and consultants, as well as management’s own judgment.\nFor 2025, management anticipates that approximately \n7\n% will continue to be the expected long-term rate of return for global plan assets. EROA assumptions are developed by country. Annual changes in the weighted average EROA are impacted by the relative size of the assets by country.\nFor 2024, 2023, and 2022, the U.S. expected long-term rate of return used by management was based on the prevailing and planned strategic asset allocations, as well as estimates of future returns by asset class. These rates were within the respective range of the \n20-year\n moving average of actual performance and the expected future returns developed by asset class. \nAssumed health care cost trend rates for U.S. other postretirement benefit plans were as follows:\n2024\n2023\n2022\nHealth care cost trend rate assumed for next year\n5.50\n \n%\n5.50\n \n%\n5.50\n \n%\nRate to which the cost trend rate gradually declines\n4.50\n \n%\n4.50\n \n%\n4.50\n \n%\nYear that the rate reaches the rate at which it is assumed to remain\n2027\n2026\n2025\nThe assumed health care cost trend rate is used to measure the expected cost of gross eligible charges covered by Howmet’s other postretirement benefit plans. For 2025, a \n5.50\n% trend rate will be used, reflecting management’s best estimate of the change in future health care costs covered by the plans. The plans’ actual annual health care cost trend experience over the past \nthree years\n has ranged from (\n0.40\n)% to \n1.50\n%. Management’s best estimate considering actual and expected annual health care costs is to maintain the \n5.50\n% trend rate as indicative of expected increases for future health care costs over the long-term.\nPlan Assets\nHowmet’s pension plans’ investment policy as of December 31, 2024 by asset class, were as follows:\nAsset class\nPolicy range\n(1)\nEquities\n20\n–\n55\n%\nFixed income\n25\n–\n55\n%\nOther investments\n15\n–\n35\n%\n(1)\nPolicy range is for U.S. plan assets only, as both the U.K. and Canadian asset investment allocations are controlled by a third-party trustee with input from Howmet.\n60\nTable\n \nof\n Contents\nThe principal objectives underlying the investment of the pension plans’ assets are to ensure that Howmet can properly fund benefit obligations as they become due under a broad range of potential economic and financial scenarios, maximize the long-term investment return with an acceptable level of risk based on such obligations, and broadly diversify investments across and within various asset classes to protect asset values against adverse movements. Specific objectives for long-term investment strategy include reducing the volatility of pension assets relative to pension liabilities and attaining and maintaining a sufficiently funded status. The use of derivative instruments is permitted where appropriate and necessary for achieving overall investment policy objectives. The investment strategy uses long duration bonds and derivative instruments to offset a portion of the interest rate sensitivity of U.S. pension liabilities. Exposure to broad equity risk is decreased and diversified through investments in hedge funds, private equity, private credit, private real estate, high-yield bonds, global and emerging market debt, and global and emerging market equities. Investments are further diversified by strategy, asset class, geography, and sector to enhance returns and mitigate downside risk. A large number of external investment managers are used to gain broad exposure to the financial markets and to mitigate manager-concentration risk.\nInvestment practices comply with the requirements of the Employee Retirement Income Security Act (“ERISA”) and other applicable laws and regulations.\nThe following section describes the valuation methodologies used to measure the fair value of pension plan assets, including an indication of the level in the fair value hierarchy in which each type of asset is generally classified (See \nNote R\n for the definition of fair value and a description of the fair value hierarchy).\nEquities.\n These securities consist of: (i) direct investments in the stock of publicly traded U.S. and non-U.S. companies that are valued based on the closing price reported in an active market on which the individual securities are traded (generally classified in Level 1); (ii) the plans’ share of commingled funds that are invested in the stock of publicly traded companies and are valued at the net asset value of shares held at December 31 (included in Level 1 and Level 2); and (iii) direct investments in long/short equity hedge funds and private equity (limited partnerships and venture capital partnerships) that are valued at net asset value.\nFixed income.\n These securities consist of: (i) U.S. government debt that are generally valued using quoted prices (included in Level 1); (ii) cash and cash equivalents invested in publicly-traded funds and are valued based on the closing price reported in an active market on which the individual securities are traded (generally classified in Level 1); (iii) publicly traded U.S. and non-U.S. fixed interest obligations (principally corporate bonds and debentures) and are valued through consultation and evaluation with brokers in the institutional market using quoted prices and other observable market data (included in Level 2); (iv) fixed income derivatives that are generally valued using industry standard models with market-based observable inputs (included in Level 2); and (v) cash and cash equivalents invested in institutional funds and are valued at net asset value.\nOther investments.\n These investments include, among others: (i) real estate investment trusts that are valued based on the quoted prices and other observable market data (included in Level 2) and (ii) direct investments of discretionary and systematic macro hedge funds and private real estate (includes limited partnerships) that are valued at net asset value.\nThe fair value methods described above may not be indicative of net realizable value or reflective of future fair values. Additionally, while Howmet believes the valuation methods used by the plans’ trustees are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\n61\nTable\n \nof\n Contents\nThe following table presents the fair value of pension plan assets classified under the appropriate level of the fair value hierarchy or net asset value:\nDecember 31, 2024\nLevel 1\nLevel 2\nNet Asset Value\nTotal\nEquities:\nEquity securities\n$\n1\n \n$\n130\n \n$\n300\n \n$\n431\n \nLong/short equity hedge funds\n—\n \n—\n \n20\n \n20\n \nPrivate equity\n—\n \n—\n \n112\n \n112\n \n$\n1\n \n$\n130\n \n$\n432\n \n$\n563\n \nFixed income:\nIntermediate and long duration government/credit\n$\n71\n \n$\n57\n \n$\n—\n \n$\n128\n \nOther\n18\n \n66\n \n—\n \n84\n \n \n$\n89\n \n$\n123\n \n$\n—\n \n$\n212\n \nOther investments:\nReal estate\n$\n—\n \n$\n1\n \n$\n54\n \n$\n55\n \nDiscretionary and systematic macro hedge funds\n—\n \n—\n \n40\n \n40\n \nOther\n—\n \n—\n \n5\n \n5\n \n \n$\n—\n \n$\n1\n \n$\n99\n \n$\n100\n \nNet plan assets\n(1)\n$\n90\n \n$\n254\n \n$\n531\n \n$\n875\n \nDecember 31, 2023\nLevel 1\nLevel 2\nNet Asset Value\nTotal\nEquities:\nEquity securities\n$\n—\n \n$\n85\n \n$\n225\n \n$\n310\n \nLong/short equity hedge funds\n—\n \n—\n \n18\n \n18\n \nPrivate equity\n—\n \n—\n \n108\n \n108\n \n$\n—\n \n$\n85\n \n$\n351\n \n$\n436\n \nFixed income:\nIntermediate and long duration government/credit\n$\n199\n \n$\n151\n \n$\n—\n \n$\n350\n \nOther\n6\n \n63\n \n—\n \n69\n \n \n$\n205\n \n$\n214\n \n$\n—\n \n$\n419\n \nOther investments:\nReal estate\n$\n—\n \n$\n5\n \n$\n68\n \n$\n73\n \nDiscretionary and systematic macro hedge funds\n—\n \n—\n \n29\n \n29\n \nOther\n—\n \n—\n \n3\n \n3\n \n \n$\n—\n \n$\n5\n \n$\n100\n \n$\n105\n \nNet plan assets\n(2)\n$\n205\n \n$\n304\n \n$\n451\n \n$\n960\n \n(1)\nAs of December 31, 2024, the total fair value of pension plans’ assets excludes a net receivable\n of $\n11\n, which represents securities purchased and sold but not yet settled plus interest and dividends earned on various investments.\n(2)\nAs of December 31, 2023, the total fair value of pension plans’ assets excludes a net payable of $\n35\n, which represents securities purchased and sold but not yet settled offset by interest and dividends earned on various investments.\nFunding and Cash Flows\nIt is Howmet’s policy to fund amounts for pension plans sufficient to meet the minimum requirements set forth in the benefits laws and tax laws of the applicable country. Periodically, Howmet contributes additional amounts as deemed appropriate. In \n2024 and 2023\n, cash contributions to Howmet’s pension plans were $\n79\n and $\n36\n, respectively.\nThe contributions to the Company’s pension plans in \n2025\n are estimated to\n be $\n60\n (of w\nhich $\n44\n is for U.S. plans).\n62\nTable\n \nof\n Contents\nBenefit payments expected to be paid to pension and other postretirement benefit plans’ participants utilizing the current assumptions outlined above are as follows:\nFor the year ended December 31,\nPension\nbenefits\nOther post-\nretirement\nbenefits\n2025\n$\n138\n \n$\n6\n \n2026\n133\n \n6\n \n2027\n131\n \n6\n \n2028\n131\n \n6\n \n2029\n126\n \n6\n \n2030 - 2034\n576\n \n26\n \n Total\n$\n1,235\n \n$\n56\n \nDefined Contribution Plans\nHowmet sponsors savings and investment plans in various countries, primarily in the U.S. Howmet’s contributions and expenses related to these plans\n were $\n92\n, $\n82\n, and $\n76\n in 2024, 2023, and 2022, respectively. U.S. employees may contribute a portion of their compensation to the plans, and Howmet matches a portion of these contributions in equivalent form of the investments elected by the employee. Additionally, for certain U.S. employees, Howmet makes a contribution of either a percentage of applicable eligible compensation or per hour worked.\nH. \nIncome Taxes\nThe components of income before income taxes were as follows:\nFor the year ended December 31,\n2024\n2023\n2022\nUnited States\n$\n901\n \n$\n538\n \n$\n287\n \nForeign\n482\n \n437\n \n319\n \n Total\n$\n1,383\n \n$\n975\n \n$\n606\n \n63\nTable\n \nof\n Contents\nThe provision for income taxes consisted of the following:\nFor the year ended December 31,\n2024\n2023\n2022\nCurrent:\nFederal\n(1)\n$\n70\n \n$\n5\n \n$\n3\n \nForeign\n98\n \n94\n \n53\n \nState and local\n4\n \n2\n \n—\n \n \n172\n \n101\n \n56\n \nDeferred:\nFederal\n43\n \n92\n \n71\n \nForeign\n17\n \n16\n \n5\n \nState and local\n(\n4\n)\n1\n \n5\n \n \n56\n \n109\n \n81\n \nTotal\n$\n228\n \n$\n210\n \n$\n137\n \n(1)\nFederal includes U.S. taxes related to foreign income.\nA reconciliation of the U.S. federal statutory rate to Howmet’s effective tax rate was as follows (the effective tax rate for 2024, 2023, and 2022 was a provision on income):\nFor the year ended December 31,\n2024\n2023\n2022\nU.S. federal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nForeign tax rate differential\n0.7\n \n(\n0.1\n)\n0.1\n \nU.S. and residual tax on foreign earnings\n(1)\n(\n0.6\n)\n0.6\n \n1.2\n \nU.S. state and local taxes, net of federal income tax effect\n1.0\n \n0.7\n \n0.5\n \nNon-deductible officer compensation\n0.7\n \n0.7\n \n1.2\n \nTax holidays\n(\n0.4\n)\n(\n0.4\n)\n(\n0.5\n)\nTax credits\n(2)\n(\n5.1\n)\n(\n0.7\n)\n(\n0.9\n)\nChanges in valuation allowances\n(\n0.6\n)\n(\n1.1\n)\n1.4\n \nChanges in uncertain tax positions\n(3)\n—\n \n2.1\n \n—\n \nExcess benefit for stock compensation\n(\n0.7\n)\n(\n0.8\n)\n(\n0.8\n)\nOther\n0.5\n \n(\n0.5\n)\n(\n0.6\n)\nEffective tax rate\n16.5\n \n%\n21.5\n \n%\n22.6\n \n%\n(1)\nIt is Howmet’s policy to treat taxes due from future inclusions in U.S. taxable income related to GILTI as a current period expense when incurred.\n(2)\nIn 2024, the Company completed an R&D study, and as a result recorded a discrete tax benefit for $\n42\n of prior year federal R&D credits approved under audit by the U.S. Internal Revenue Service and $\n8\n of prior year state R&D credits. The Company also recorded a tax benefit for federal and state R&D credits earned during the current year of $\n13\n and $\n3\n, respectively.\n(3)\nIn 2023, the Company recorded an income tax reserve of $\n21\n related to an uncertain French tax position.\n64\nTable\n \nof\n Contents\nThe components of net deferred tax assets and liabilities were as follows:\n \n2024\n2023\nDecember 31,\nDeferred\ntax\nassets\nDeferred\ntax\nliabilities\nDeferred\ntax\nassets\nDeferred\ntax\nliabilities\nDepreciation\n$\n8\n \n$\n529\n \n$\n8\n \n$\n510\n \nR&D capitalization\n73\n \n—\n \n24\n \n—\n \nEmployee benefits\n232\n \n9\n \n240\n \n4\n \nLoss provisions\n11\n \n2\n \n28\n \n1\n \nDeferred income/expense\n46\n \n293\n \n32\n \n1,210\n \nInterest\n6\n \n—\n \n32\n \n—\n \nTax loss carryforwards\n1,941\n \n—\n \n2,905\n \n—\n \nTax credit carryforwards\n110\n \n—\n \n216\n \n—\n \nOther\n5\n \n8\n \n10\n \n4\n \n$\n2,432\n \n$\n841\n \n$\n3,495\n \n$\n1,729\n \nValuation allowance\n(\n1,705\n)\n— \n(\n1,821\n)\n— \n Total\n$\n727\n \n$\n841\n \n$\n1,674\n \n$\n1,729\n \nThe following table details the expiration periods of the deferred tax assets presented above:\nDecember 31, 2024\nExpires\nwithin\n10 years\nExpires\nwithin\n11-20 years\nNo\nExpiration\n(1)\nOther\n(2)\nTotal\nTax loss carryforwards\n$\n427\n \n$\n393\n \n$\n1,121\n \n$\n—\n \n$\n1,941\n \nTax credit carryforwards\n94\n \n7\n \n9\n \n—\n \n110\n \nOther\n(3)\n—\n \n—\n \n345\n \n36\n \n381\n \nValuation allowance\n(\n481\n)\n(\n324\n)\n(\n897\n)\n(\n3\n)\n(\n1,705\n)\n Total\n$\n40\n \n$\n76\n \n$\n578\n \n$\n33\n \n$\n727\n \n(1)\nDeferred tax assets with no expiration may still have annual limitations on utilization.\n(2)\nOther represents deferred tax assets whose expiration is dependent upon the reversal of the underlying temporary difference.\n(3)\nA substantial amount of Other deferred tax assets relates to employee benefits that will become deductible for tax purposes in jurisdictions with unlimited expiration over an extended period of time as contributions are made to employee benefit plans and payments are made to retirees.\nThe total deferred tax asset (net of valuation allowance) is supported by projections of future taxable income exclusive of reversing temporary differences (\n5\n%), and taxable temporary differences that reverse within the carryforward period (\n95\n%).\nValuation allowances are recorded to reduce deferred tax assets when it is more likely than not (greater than 50%) that a tax benefit will not be realized. In evaluating the need for a valuation allowance, management considers all potential sources of taxable income, including income available in carryback periods, future reversals of taxable temporary differences, projections of taxable income, and income from tax planning strategies, as well as all available positive and negative evidence. Positive evidence includes factors such as a history of profitable operations, projections of future profitability within the carryforward period, including from tax planning strategies, and Howmet’s experience with similar operations. Existing favorable contracts and the ability to sell products into established markets are additional positive evidence. Negative evidence includes items such as cumulative losses, projections of future losses, or carryforward periods that are not long enough to allow for the utilization of a deferred tax asset based on existing projections of income. Deferred tax assets for which no valuation allowance is recorded may not be realized upon changes in facts and circumstances, resulting in a future charge to establish a valuation allowance. Existing valuation allowances are re-examined under the same standards of positive and negative evidence. If it is determined that it is more likely than not that a deferred tax asset will be realized, the appropriate amount of the valuation allowance, if any, is released. Deferred tax assets and liabilities are also remeasured to reflect changes in underlying tax rates due to law changes and the granting and lapse of tax holidays.\nIt is Howmet’s policy to apply a tax law ordering approach when considering the need for a valuation allowance on net operating losses expected to offset GILTI income inclusions. Under this approach, reductions in cash tax savings are not \n65\nTable\n \nof\n Contents\nconsidered as part of the valuation allowance assessment. Instead, future GILTI inclusions are considered a source of taxable income that support the realizability of deferred tax assets.\nHowmet’s foreign tax credits in the U.S. have a 10-year carryforward period with expirations ranging from 2025 to 2027 (as of December 31, 2024). Valuation allowances were initially established in prior years on a portion of the foreign tax credit carryforwards, primarily due to insufficient foreign source income to allow for full utilization of the credits within the expiration period. Foreign tax credits of $\n46\n and $\n20\n expired at the end of 2024 and 2023, respectively, resulting in a corresponding decrease to the valuation allowance. Due to an increase in foreign source income, the Company decreased the valuation allowance accordingly by an additional $\n4\n and $\n14\n in 2024 and 2023, respectively. As of December 31, 2024, the cumulative amount of the valuation allowance was $\n41\n. The need for this valuation allowance will be reassessed on a continuous basis in future periods and, as a result, the allowance may increase or decrease based on changes in facts and circumstances.\nThe Company recorded a net $\n7\n decrease, $\n2\n decrease, and $\n1\n decrease to U.S. state valuation allowances in 2024, 2023, and 2022, respectively. After weighing all available positive and negative evidence, the Company determined the adjustments based on the underlying net deferred tax assets that were more likely than not realizable based on projected taxable income. Changes in fully reserved U.S. state tax losses, credits and other deferred tax assets resulting from expirations, audit adjustments, tax rate, and tax law changes also resulted in a corresponding net $\n30\n decrease, $\n49\n decrease, and $\n142\n decrease in the valuation allowance in 2024, 2023, and 2022, respectively. Valuation allowances of $\n401\n remain against state deferred tax assets expected to expire before utilization. The need for valuation allowances against state deferred tax assets will be reassessed on a continuous basis in future periods and, as a result, the allowance may increase or decrease based on changes in facts and circumstances. \nIn 2022, after weighing all available evidence, the Company released a $\n6\n valuation allowance in the U.K. related to interest deduction carryforwards. The need for valuation allowances will be reassessed by entity and by jurisdiction on a continuous basis in future periods and, as a result, the allowances may increase or decrease based on changes in facts and circumstances.\nThe following table details the changes in the valuation allowance:\nDecember 31,\n2024\n2023\n2022\nBalance at beginning of year\n$\n1,821\n \n$\n1,965\n \n$\n2,279\n \nIncrease to allowance\n20\n \n21\n \n40\n \nRelease of allowance\n(\n127\n)\n(\n198\n)\n(\n154\n)\nAcquisitions, divestitures and liquidations\n75\n \n(\n16\n)\n—\n \nTax apportionment, tax rate and tax law changes\n(\n2\n)\n(\n11\n)\n(\n110\n)\nForeign currency translation\n(\n82\n)\n60\n \n(\n90\n)\nBalance at end of year\n$\n1,705\n \n$\n1,821\n \n$\n1,965\n \nForeign U.S. GAAP earnings that have not otherwise been subject to U.S. tax, will generally be exempt from future U.S. tax under the 2017 Act when distributed. Such distributions, as well as distributions of previously taxed foreign earnings, could potentially be subject to U.S. state tax in certain states, and foreign withholding taxes. Foreign currency gains/losses related to the translation of previously taxed earnings from functional currency to U.S. dollars could also be subject to U.S. tax when distributed. Howmet would expect the potential withholding tax, U.S. state tax, and U.S. capital gains tax impacts to be immaterial and the potential deferred tax liability associated with future currency gains to be impracticable to determine.\nHowmet and its subsidiaries file income tax returns in the U.S. federal jurisdiction and various states and foreign jurisdictions. With a few minor exceptions, Howmet is no longer subject to income tax examinations by tax authorities for years prior to 2014. All U.S. tax years prior to 2024 have been audited by the Internal Revenue Service. Various state and foreign jurisdiction tax authorities are in the process of examining the Company’s income tax returns for various tax years through 2023. The Company had net cash income tax payments of $\n177\n, $\n104\n, and $\n50\n in 2024, 2023, and 2022, respectively.\n66\nTable\n \nof\n Contents\nA reconciliation of the beginning and ending amount of unrecognized tax benefits (excluding interest and penalties) was as follows:\nDecember 31,\n2024\n2023\n2022\nBalance at beginning of year\n$\n16\n \n$\n2\n \n$\n2\n \nAdditions for tax positions of the current year\n—\n \n1\n \n—\n \nAdditions for tax positions of prior years\n—\n \n13\n \n—\n \nSettlements with tax authorities\n(\n14\n)\n—\n \n—\n \nForeign currency translation\n(\n1\n)\n—\n \n—\n \nBalance at end of year\n$\n1\n \n$\n16\n \n$\n2\n \nFor all periods presented, a portion of the balance pertains to state tax liabilities, which are presented before any offset for federal tax benefits. The effect of unrecognized tax benefits, if recorded, that would impact the annual effective tax rate for 2024, 2023, and 2022 would be less than \n1\n%, \n2\n%, and less than \n1\n%, respectively, of pre-tax book income. Howmet does not anticipate that changes in its unrecognized tax benefits will have a material impact on the Statement of Consolidated Operations during 2025.\nIt is Howmet’s policy to recognize interest and penalties related to income taxes as a component of the Provision for income taxes in the Statement of Consolidated Operations. Howmet recognized interest and penalties of $\n1\n, $\n7\n, and less than $\n1\n in 2024, 2023, and 2022, respectively. Due to the expiration of the statute of limitations, settlements with tax authorities, reductions in prior accruals, and refunded overpayments, Howmet recognized interest income of $\n0\n, $\n2\n, and less than $\n1\n in 2024, 2023, and 2022, respectively. As of December 31, 2024, 2023, and 2022, the amount accrued for the payment of interest and penalties was $\n9\n, $\n11\n, and less than $\n1\n, respectively.\nI. \nPreferred and Common Stock\nPreferred Stock.\n Howmet has \ntwo\n classes of preferred stock: $\n3.75\n Cumulative Preferred Stock (“Class A Preferred Stock”) and Class B Serial Preferred Stock. Class A Preferred Stock has \n660,000\n shares authorized at a par value of $\n100\n per share with an annual $\n3.75\n cumulative dividend preference per share. There were \n546,024\n shares of Class A Preferred Stock outstanding as of both December 31, 2024 and 2023. Class B Serial Preferred Stock has \n10,000,000\n shares authorized at a par value of $\n1\n per share. There were \nno\n shares of Class B Serial Preferred Stock outstanding as of both December 31, 2024 and 2023.\nCommon Stock.\n As of December 31, 2024, there were \n600,000,000\n shares authorized at a par value of $\n1\n per share, and \n405,431,361\n shares issued and outstanding. Dividends paid were $\n0.26\n per share in 2024 ($\n0.05\n per share in each of the first and second quarters of 2024 and $\n0.08\n per share in each of the third and fourth quarter of 2024), $\n0.17\n per share in 2023 ($\n0.04\n per share in each of the first, second, and third quarters of 2023 and $\n0.05\n per share in the fourth quarter of 2023), and $\n0.10\n per share in 2022 ($\n0.02\n per share in each of the first, second, and third quarters of 2022 and $\n0.04\n per share in the fourth quarter of 2022).\nAs of December 31, 2024, \n47\n million shares of common stock were reserved for issuance under Howmet’s stock-based compensation plans. As of December 31, 2024, \n24\n million shares remain available for issuance. Howmet issues new shares to satisfy the exercise of stock options and the conversion of stock awards.\nCommon Stock Outstanding and Share Activity\n (number of shares)\nBalance at December 31, 2021\n421,691,912\n \nIssued for stock-based compensation plans\n1,819,651\n \nRepurchase and retirement of common stock\n(\n11,356,506\n)\nBalance at December 31, 2022\n412,155,057\n \nIssued for stock-based compensation plans\n2,993,340\n \nRepurchase and retirement of common stock\n(\n5,233,936\n)\nBalance at December 31, 2023\n409,914,461\n \nIssued for stock-based compensation plans\n1,287,412\n \nRepurchase and retirement of common stock\n(\n5,770,512\n)\nBalance at December 31, 2024\n405,431,361\n \n67\nTable\n \nof\n Contents\nThe following table provides details for share repurchases during 2024, 2023, and 2022:\nNumber of shares\nAverage price per share\n(1)\nTotal\nQ1 2024 open market repurchase\n2,243,259\n \n$\n66.87\n$\n150\nQ2 2024 open market repurchase\n734,737\n \n$\n81.66\n$\n60\nQ3 2024 open market repurchase\n1,061,323\n \n$\n94.22\n$\n100\nQ4 2024 open market repurchase\n1,731,193\n \n$\n109.75\n$\n190\n2024 Share repurchase total\n5,770,512\n \n$\n86.65\n$\n500\nQ1 2023 open market repurchase\n576,629\n \n$\n43.36\n$\n25\nQ2 2023 open market repurchase\n2,246,294\n \n$\n44.52\n$\n100\nQ3 2023 open market repurchase\n506,800\n \n$\n49.32\n$\n25\nQ4 2023 open market repurchase\n1,904,213\n \n$\n52.52\n$\n100\n2023 Share repurchase total\n5,233,936\n \n$\n47.76\n$\n250\nQ1 2022 open market repurchase\n5,147,307\n \n$\n34.00\n$\n175\nQ2 2022 open market repurchase\n1,770,271\n \n$\n33.89\n$\n60\nQ3 2022 open market repurchase\n2,764,846\n \n$\n36.17\n$\n100\nQ4 2022 open market repurchase\n1,674,082\n \n$\n38.83\n$\n65\n2022 Share repurchase total\n11,356,506\n \n$\n35.22\n$\n400\n(1)\nExcludes commissions cost.\nThe total value of shares repurchased during 2024, 2023, and 2022 were $\n500\n, $\n250\n, and $\n400\n, respectively. All of the shares repurchased during 2024, 2023, and 2022 were immediately retired. The Company has a share repurchase program (the “Share Repurchase Program”) that, after giving effect to the additional $\n50\n share repurchases made in January 2025 at an average price per share of $\n116.39\n, retiring approximately \n0.4\n million shares, has approximately $\n2,147\n in Board authorization remaining available as of January 31, 2025. The current Share Repurchase Program was authorized by the Company’s Board of Directors on August 18, 2021 at $\n1,500\n, which was increased by the Board by $\n2,000\n on July 30, 2024. Under the Company’s Share Repurchase Program, the Company may repurchase shares by means of trading plans established from time to time in accordance with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, block trades, private transactions, open market repurchases and/or accelerated share repurchase agreements, or other derivative transactions. There is no stated expiration for the Share Repurchase Program. Under its Share Repurchase Program, the Company may repurchase shares from time to time, in amounts, at prices, and at such times as the Company deems appropriate, subject to market conditions, legal requirements and other considerations. The Company is not obligated to repurchase any specific number of shares or to do so at any particular time, and the Share Repurchase Program may be suspended, modified, or terminated at any time without prior notice.\nThe Inflation Reduction Act of 2022 imposes a 1% excise tax on net stock repurchases after December 31, 2022. The Company recorded $\n4\n and $\n1\n to additional capital for excise tax on net repurchases in 2024 and 2023, respectively.\nStock-Based Compensation\nHowmet has a stock-based compensation plan under which stock options and/or restricted stock unit awards are granted, generally, in the first half of each year to eligible employees. Stock options are granted at the closing market price of Howmet’s common stock on the date of grant and typically vest over a \nthree-year\n service period (1/3 each year) with a \nten-year\n contractual term. Restricted stock unit awards typically vest over a \nthree-year\n service period from the date of grant. As part of Howmet’s stock-based compensation plan design, individuals who are retirement-eligible have a \nsix-month\n requisite service period in the year of grant. Certain of the restricted stock unit awards include performance and market conditions and are granted to certain eligible employees. For annual performance stock awards, the final number of shares earned will be based on Howmet’s achievement of profitability targets over the respective performance periods and will be earned at the end of the third year. \n68\nTable\n \nof\n Contents\nAdditionally, the annual performance stock awards include a total shareholder return (“TSR”) component, which depends upon relative performance against the TSRs of a group of peer companies.\nIn 2024, 2023, and 2022, Howmet recognized stock-based compensation expense of $\n63\n ($\n57\n after-tax), $\n50\n ($\n44\n after-tax), and $\n54\n ($\n49\n after-tax), respectively. Senior executive performance awards granted in April 2020 were modified in June 2020, resulting in incremental compensation expense of $\n12\n, which was amortized over the remaining service period that ended April 1, 2023. \nAll stock-based compensation expense recorded in 2024, 2023, and 2022 relates to restricted stock unit awards. \nNo\n stock-based compensation expense was capitalized in any of those years. As of December 31, 2024, there was $\n28\n (pre-tax) of unrecognized compensation expense related to non-vested restricted stock unit award grants. This expense is expected to be recognized over a weighted average period of \n1.6\n years.\nStock-based compensation expense is based on the grant date fair value of the applicable equity grant. For restricted stock unit awards, the fair value is equivalent to the closing market price of Howmet’s common stock on the date of grant. The weighted average grant date fair value per share of the 2024, 2023, and 2022 performance stock awards with a market condition including a TSR component is $\n72.65\n, $\n47.59\n, and $\n44.44\n, respectively. The 2024, 2023, and 2022 performance awards were valued using a Monte Carlo model. A Monte Carlo simulation uses assumptions of stock price behavior to estimate the probability of satisfying market conditions and the resulting fair value of the award. The risk-free interest rate (\n4.4\n% in 2024, \n4.4\n% in 2023, and \n2.0\n% in 2022) was based on a yield curve of interest rates at the time of the grant based on the remaining performance period. In 2024, 2023, and 2022, volatility of \n27.7\n%, \n39.0\n%, and \n39.4\n%, respectively, was estimated using Howmet's historical volatility. Stock options were last granted in 2018.\nThe activity for stock options and stock awards during 2024 was as follows (options and awards in millions in the table below):\n \nStock options\nStock awards\n  \nNumber of\noptions\nWeighted\naverage\nexercise price per option\nNumber of\nawards\nWeighted\naverage FMV\nper award\nOutstanding, December 31, 2023\n0.5\n \n$\n22.67\n \n3.0\n \n$\n34.23\n \nGranted \n—\n \n—\n \n0.7\n \n71.65\n \nExercised\n(\n0.4\n)\n23.41\n \n—\n \n—\n \nConverted\n—\n \n—\n \n(\n1.6\n)\n32.11\n \nExpired or forfeited\n—\n \n—\n \n(\n0.1\n)\n43.89\n \nPerformance share adjustment\n—\n \n—\n \n0.1\n \n35.97\n \nOutstanding, December 31, 2024\n0.1\n \n$\n20.98\n \n2.1\n \n$\n48.28\n \nAs of December 31, 2024, the stock options outstanding had a weighted average remaining contractual life of \n2.1\n and a total intrinsic value of $\n13\n. All of the stock options outstanding were fully vested and exercisable. In 2024, 2023, and 2022, the cash received from stock option exercises was $\n8\n, $\n11\n, and $\n16\n, respectively, and the total tax benefit realized from these exercises was $\n3\n, $\n2\n, and $\n2\n, respectively. The total intrinsic value of stock options exercised during 2024, 2023, and 2022 was $\n16\n, $\n9\n, and $\n10\n, respectively. The total intrinsic value of stock awards converted during 2024, 2023, and 2022 was $\n117\n, $\n187\n, and $\n61\n, respectively.\nJ. \nEarnings Per Share\nBasic earnings per share (“EPS”) amounts are computed by dividing earnings, after the deduction of preferred stock dividends declared, by the average number of common shares outstanding. Diluted EPS amounts assume the issuance of common stock for all potentially dilutive share equivalents outstanding.\n69\nTable\n \nof\n Contents\nThe information used to compute basic and diluted EPS attributable to Howmet common shareholders was as follows (shares in millions in the table below):\nFor the year ended December 31,\n2024\n2023\n2022\nNet income attributable to common shareholders\n$\n1,155\n \n$\n765\n \n$\n469\n \nLess: preferred stock dividends declared\n2\n \n2\n \n2\n \nNet income available to Howmet Aerospace common shareholders - basic and diluted\n$\n1,153\n \n$\n763\n \n$\n467\n \nAverage shares outstanding - basic\n408\n \n412\n \n416\n \nEffect of dilutive securities:\nStock and performance awards\n2\n \n4\n \n5\n \nAverage shares outstanding - diluted\n410\n \n416\n \n421\n \nCommon stock outstanding as of December 31, 2024, 2023, and 2022 was approximately \n405\n million, \n410\n million, and \n412\n million, respectively.\nAs average shares outstanding are used in the calculation for both basic and diluted EPS, the full impact of share repurchases and issuances was not fully realized in EPS in the period of repurchase or issuance since share activity may occur at varying points during a period.\nThere were \nno\n shares relating to outstanding stock options excluded from the calculation of average shares outstanding - diluted during 2024, 2023, and 2022.\n70\nTable\n \nof\n Contents\nK. \nAccumulated Other Comprehensive Loss\nThe following table details the activity of the three components that comprise Accumulated other comprehensive loss:\n  \n2024\n2023\n2022\nPension and other postretirement benefits (\nG\n)\nBalance at beginning of period\n$\n(\n689\n)\n$\n(\n653\n)\n$\n(\n799\n)\nOther comprehensive (loss) income:\nUnrecognized net actuarial gain (loss) and prior service cost/benefit\n3\n \n(\n68\n)\n87\n \nTax (expense) benefit\n(\n1\n)\n15\n \n(\n18\n)\nTotal Other comprehensive income (loss) before reclassifications, net of tax\n2\n \n(\n53\n)\n69\n \nAmortization of net actuarial loss and prior service cost\n(1)\n19\n \n21\n \n99\n \nTax expense\n(2)\n(\n4\n)\n(\n4\n)\n(\n22\n)\nTotal amount reclassified from Accumulated other comprehensive loss, net of tax\n(3)\n15\n \n17\n \n77\n \nTotal Other comprehensive income (loss)\n17\n \n(\n36\n)\n146\n \nBalance at end of period\n$\n(\n672\n)\n$\n(\n689\n)\n$\n(\n653\n)\nForeign currency translation\nBalance at beginning of period\n$\n(\n1,136\n)\n$\n(\n1,193\n)\n$\n(\n1,062\n)\nOther comprehensive (loss) income\n(4)\n(\n71\n)\n57\n \n(\n131\n)\nBalance at end of period\n$\n(\n1,207\n)\n$\n(\n1,136\n)\n$\n(\n1,193\n)\nCash flow hedges\nBalance at beginning of period\n$\n(\n5\n)\n$\n5\n \n$\n(\n2\n)\nOther comprehensive (loss) income:\nNet change from periodic revaluations\n—\n \n(\n19\n)\n(\n8\n)\nTax benefit (expense)\n—\n \n4\n \n2\n \nTotal Other comprehensive (loss) income before reclassifications, net of tax\n—\n \n(\n15\n)\n(\n6\n)\nNet amount reclassified to earnings \n(5)\n8\n \n6\n \n17\n \nTax (expense) benefit\n(2)\n(\n2\n)\n(\n1\n)\n(\n4\n)\nTotal amount reclassified from Accumulated other comprehensive income (loss), net of tax\n(3)\n6\n \n5\n \n13\n \nTotal Other comprehensive income (loss)\n6\n \n(\n10\n)\n7\n \nBalance at end of period\n$\n1\n \n$\n(\n5\n)\n$\n5\n \nAccumulated other comprehensive loss balance at end of period\n$\n(\n1,878\n)\n$\n(\n1,830\n)\n$\n(\n1,841\n)\n(1)\nThese amounts were recorded in Restructuring and other charges (See \nNote D\n) and Other expense, net (See \nNote F\n) in the Statement of Consolidated Operations.\n(2)\nThese amounts were included in Provision for income taxes (See \nNote H\n) in the Statement of Consolidated Operations.\n(3)\nA positive amount indicates a corresponding charge to earnings and a negative amount indicates a corresponding benefit to earnings.\n(4)\nIn all periods presented, no amounts were reclassified to earnings. \n(5)\nThese amounts were recorded in Cost of goods sold in the Statement of Consolidated Operations.\nL. \nReceivables\nSale of Receivables Programs\nThe Company maintains an accounts receivables securitization arrangement through a wholly-owned special purpose entity (“SPE”). The net cash funding from the sale of accounts receivable was neither a use of cash nor a source of cash during 2024 or 2023.\n71\nTable\n \nof\n Contents\nThe accounts receivables securitization arrangement is one in which the Company, through an SPE, has a receivables purchase agreement (the “Receivables Purchase Agreement”) pursuant to which the SPE may sell certain receivables to financial institutions until the earlier of\n January 2, 2026\n or a termination event. The Receivables Purchase Agreement contains customary representations and warranties, as well as affirmative and negative covenants. Pursuant to the Receivables Purchase Agreement, the Company does not maintain effective control over the transferred receivables, and therefore accounts for these transfers as sales of receivables. The Receivables Purchase Agreement also contains a provision that allows the Company to increase the facility limit to $\n325\n. \nThe facility limit under the Receivables Purchase Agreement was $\n250\n as of both December 31, 2024 and December 31, 2023, of which $\n250\n was drawn at both December 31, 2024 and December 31, 2023. As collateral against the sold receivables, the SPE maintains a certain level of unsold receivables, which were $\n201\n and $\n197\n as of December 31, 2024 and December 31, 2023, respectively.\nThe Company sold $\n1,625\n and $\n1,547\n of its receivables without recourse and received cash funding under this program during 2024 and 2023, respectively, resulting in derecognition of the receivables from the Company’s Consolidated Balance Sheet. Costs associated with the sales of receivables are reflected in the Company’s Statement of Consolidated Operations in Other expense, net for the periods in which the sales occur. Cash receipts from sold receivables under the Receivables Purchase Agreement are presented within operating activities in the Statement of Consolidated Cash Flows. \nOther Customer Receivable Sales\nIn 2024 and 2023, the Company sold $\n712\n and $\n593\n, respectively, of certain customers’ receivables in exchange for cash (of which $\n190\n and $\n158\n was outstanding from customers as of December 31, 2024 and December 31, 2023, respectively), the proceeds from which are presented in changes in receivables within operating activities in the Statement of Consolidated Cash Flows. Costs associated with the sales of receivables are reflected in the Company’s Statement of Consolidated Operations in Other expense, net for the periods in which the sales occur.\nM. \nInventories\nDecember 31,\n2024\n2023\nFinished goods\n$\n458\n \n$\n451\n \nWork-in-process\n903\n \n891\n \nPurchased raw materials\n408\n \n355\n \nOperating supplies\n71\n \n68\n \nTotal inventories\n$\n1,840\n \n$\n1,765\n \nAs of December 31, 2024 and 2023, the portion of inventories valued on a LIFO basis was $\n544\n and $\n446\n, respectively. If valued on an average-cost basis, total inventories would have been $\n280\n and $\n236\n higher as of December 31, 2024 and 2023, respectively. In 2024, we did not have any LIFO inventory layer liquidations. Reductions in LIFO inventory quantities caused partial liquidations of LIFO inventory layers resulting in the recognition of a benefit of $\n1\n in 2023 and recognition of expense of less than $\n1\n in 2022.\n \nN. \nProperties, Plants, and Equipment, Net \nDecember 31, 2024\nDecember 31, 2023\nLand and land rights\n$\n84\n \n$\n88\n \nStructures\n1,025\n \n1,018\n \nMachinery and equipment\n4,118\n \n4,079\n \n5,227\n \n5,185\n \nLess: accumulated depreciation and amortization\n3,150\n \n3,081\n \n2,077\n \n2,104\n \nConstruction work-in-progress\n309\n \n224\n \nProperties, plants, and equipment, net\n$\n2,386\n \n$\n2,328\n \nDepreciation expense related to Properties, plants, and equipment recorded in Provision for depreciation and amortization in the Statement of Consolidated Operations was $\n243\n, $\n236\n, and $\n227\n for the years ended December 31, 2024, 2023, and 2022, respectively.\n72\nTable\n \nof\n Contents\nO. \nGoodwill and Other Intangible Assets\nThe following table details the changes in the carrying amount of goodwill:\nEngine Products\nFastening Systems\nEngineered Structures\nForged Wheels\nTotal\nBalances at December 31, 2022\nGoodwill\n$\n2,830\n \n$\n1,595\n \n$\n306\n \n$\n7\n \n$\n4,738\n \nAccumulated impairment losses\n(\n719\n)\n(\n4\n)\n(\n2\n)\n—\n \n(\n725\n)\nGoodwill, net\n2,111\n \n1,591\n \n304\n \n7\n \n4,013\n \nTranslation and other\n13\n \n9\n \n—\n \n—\n \n22\n \nBalances at December 31, 2023\nGoodwill\n2,843\n \n1,604\n \n306\n \n7\n \n4,760\n \nAccumulated impairment losses\n(\n719\n)\n(\n4\n)\n(\n2\n)\n—\n \n(\n725\n)\nGoodwill, net\n2,124\n \n1,600\n \n304\n \n7\n \n4,035\n \nTranslation and other\n(\n17\n)\n(\n7\n)\n(\n1\n)\n—\n \n(\n25\n)\nBalances at December 31, 2024\nGoodwill\n2,826\n \n1,597\n \n305\n \n7\n \n4,735\n \nAccumulated impairment losses\n(\n719\n)\n(\n4\n)\n(\n2\n)\n—\n \n(\n725\n)\nGoodwill, net\n$\n2,107\n \n$\n1,593\n \n$\n303\n \n$\n7\n \n$\n4,010\n \nDuring the 2024 annual review of goodwill in the fourth quarter, management performed quantitative assessments on the Engine Products and Engineered Structures reporting units and qualitative assessments on the Fastening Systems and Forged Wheels reporting units. The estimated fair values of the reporting units exceeded their respective carrying values in excess of \n60\n%; thus, there were \nno\n goodwill impairments. Howmet uses a DCF model to estimate the current fair value of the reporting unit, which is compared to its carrying value, when testing for impairment. Management believes forecasted cash flows are the best indicator of such fair value. A number of significant assumptions and estimates are involved in the application of the DCF model to forecast operating cash flows, including sales growth, production costs, and discount rate. Assumptions can vary among the reporting units. Cash flow forecasts are generally based on approved business unit operating plans for the early years and historical relationships in later years. The WACC rate for the individual reporting units is estimated with the assistance of valuation experts. The annual goodwill impairment tests in the fourth quarters of 2024, 2023, and 2022 indicated that goodwill was not impaired for any of the Company’s reporting units. If actual results or external market factors decline significantly from management’s estimates, future goodwill impairment charges (or the amount by which the carrying amount exceeds the reporting unit’s fair value without exceeding the total amount of goodwill allocated to that reporting unit) may be necessary and could be material.\nOther intangible assets were as follows:\nDecember 31, 2024\nGross carrying amount\nAccumulated\namortization\nIntangibles, net\nComputer software\n$\n217\n \n$\n(\n185\n)\n$\n32\n \nPatents and licenses\n66\n \n(\n66\n)\n—\n \nOther intangibles\n689\n \n(\n268\n)\n421\n \nTotal amortizable intangible assets\n972\n \n(\n519\n)\n453\n \nIndefinite-lived trade names and trademarks\n22\n \n— \n22\n \nTotal intangible assets, net\n$\n994\n \n$\n(\n519\n)\n$\n475\n \nDecember 31, 2023\nGross carrying amount\nAccumulated\namortization\nIntangibles, net\nComputer software\n$\n217\n \n$\n(\n182\n)\n$\n35\n \nPatents and licenses\n67\n \n(\n66\n)\n1\n \nOther intangibles\n683\n \n(\n246\n)\n437\n \nTotal amortizable intangible assets\n967\n \n(\n494\n)\n473\n \nIndefinite-lived trade names and trademarks\n32\n \n— \n32\n \nTotal intangible assets, net\n$\n999\n \n$\n(\n494\n)\n$\n505\n \n73\nTable\n \nof\n Contents\nComputer software consists primarily of software costs associated with enterprise business solutions across Howmet's businesses.\nAmortization expense related to the intangible assets recorded in Provision for depreciation and amortization in the Statement of Consolidated Operations was $\n33\n, $\n35\n, and $\n36\n for the years ended December 31, 2024, 2023, and 2022, respectively, and is expected to be in the range of approximately $\n30\n to $\n36\n annually from 2025 to 2029.\nP. \nLeases\nOperating lease cost includes short-term leases and variable lease payments and approximates cash paid. Operating lease cost was $\n67\n, $\n63\n, and $\n61\n in 2024, 2023, and 2022, respectively. Operating lease cost in 2024, 2023, and the second half of 2022 includes the lease for the portion of the property in Pittsburgh, PA used as the corporate headquarters.\nOperating lease right-of-use assets and lease liabilities in the Consolidated Balance Sheet were as follows:\nDecember 31,\n2024\n2023\nRight-of-use assets classified in Other noncurrent assets\n$\n155\n \n$\n128\n \nCurrent portion of lease liabilities\n \nclassified in Other current liabilities\n$\n37\n \n$\n32\n \nLong-term portion of lease liabilities classified in Other noncurrent liabilities and deferred credits\n119\n \n97\n \nTotal lease liabilities\n$\n156\n \n$\n129\n \nFuture minimum contractual operating lease obligations were as follows at December 31, 2024:\n2025\n$\n46\n \n2026\n39\n \n2027\n29\n \n2028\n21\n \n2029\n15\n \nThereafter\n39\n \nTotal lease payments\n$\n189\n \nLess: Imputed interest\n(\n33\n)\nPresent value of lease liabilities\n$\n156\n \nDecember 31,\n2024\n2023\n2022\nRight-of-use assets obtained in exchange for operating lease obligations\n$\n66\n \n$\n68\n \n$\n34\n \nWeighted-average remaining lease term in years\n5.9\n6.4\n5.6\nWeighted-average discount rate\n5.7\n \n%\n5.9\n \n%\n5.4\n \n%\n74\nTable\n \nof\n Contents\nQ. \nDebt\nDebt.\nDecember 31,\n2024\n2023\n5.125\n% Notes, due 2024\n$\n—\n \n$\n205\n \n6.875\n% Notes, due 2025\n—\n \n600\n \nUSD Term Loan Agreement, due 2026\n140\n \n200\n \nJPY Term Loan Agreement, due 2026\n188\n \n211\n \n5.900\n% Notes, due 2027\n625\n \n625\n \n6.750\n% Bonds, due 2028\n300\n \n300\n \n3.000\n% Notes, due 2029\n700\n \n700\n \n4.850\n% Notes, due 2031\n(1)\n500\n \n—\n \n5.950\n% Notes, due 2037\n625\n \n625\n \n4.750\n% Iowa Finance Authority Loan, due 2042\n250\n \n250\n \nOther, net\n(2)\n(\n13\n)\n(\n10\n)\n3,315\n \n3,706\n \nLess: amount due within one year\n6\n \n206\n \n Total long-term debt\n$\n3,309\n \n$\n3,500\n \n(1)\nThe Company entered into a cross-currency swap to synthetically convert the 2031 Notes into a Euro liability of approximately €\n458\n million with a fixed annual interest rate of \n3.720\n%.\n(2)\nOther, net includes unamortized debt discounts and unamortized debt issuance costs related to outstanding notes and bonds listed in the table above and various financing arrangements related to subsidiaries.\nThe principal amount of long-term debt maturing in each of the next five years is $\n5\n in 2025, $\n323\n in 2026, $\n625\n in 2027, $\n300\n in 2028, and $\n700\n in 2029.\nPublic Debt. \nOn August 23, 2024, the Company completed the early redemption of all of the remaining outstanding principal amount of approximately $\n577\n of the \n6.875\n% Notes due May 2025 (the “2025 Notes”) in accordance with the terms of the notes. The Company completed the redemption with the net proceeds from the offering of the \n4.850\n% Notes due October 2031 (the “2031 Notes”) and cash on hand at an aggregate redemption price of approximately $\n594\n, including accrued interest and an early termination premium of approximately $\n12\n and $\n5\n, respectively, which were recorded in Interest expense, net, and Loss on debt redemption, respectively, in the Statement of Consolidated Operations.\nOn August 22, 2024, the Company completed an offering of $\n500\n aggregate principal amount of its 2031 Notes. The Company entered into a cross-currency swap to synthetically convert the 2031 Notes into a Euro liability of approximately €\n458\n million. The fixed interest rate on the Euro liability is approximately \n3.720\n% per annum.\nOn July 1, 2024, the Company completed the early redemption of all of the remaining outstanding principal amount of $\n205\n of the \n5.125\n% Notes due October 2024 (the “\n2024 Notes”)\n. The Company redeemed the \n2024 Notes\n at par value plus accrued interest. The \n2024 Notes\n were redeemed with cash on hand at an aggregate redemption price of approximately $\n208\n, including accrued interest of approximately $\n3\n.\nIn the second quarter of 2024, the Company repurchased approximately $\n23\n aggregate principal amount of the 2025 Notes through an open market repurchase (“OMR”). The OMR was settled at slightly more than par value.\nOn December 28, 2023, the Company completed an early partial redemption of its outstanding \n2024 Notes\n in the aggregate principal amount of $\n500\n. Such \n2024 Notes\n were redeemed at par with approximately $\n106\n of cash on hand and approximately $\n400\n from the Company’s term loan facilities at an aggregate redemption price of approximately $\n506\n, including accrued interest of approximately $\n6\n.\nOn September 28, 2023, the Company completed an early partial redemption of its outstanding \n2024 Notes\n in the aggregate principal amount of $\n200\n. Such \n2024 Notes\n were redeemed at par with cash on hand at an aggregate redemption price of approximately $\n205\n, including accrued interest of approximately $\n5\n.\nOn March 29, 2023, the Company completed the early partial redemption of an additional $\n150\n aggregate principal amount of the \n2024 Notes\n in accordance with the terms of the notes, and paid an aggregate of $\n155\n, including accrued interest and an early termination premium of approximately $\n4\n and $\n1\n, respectively, which were recorded in Interest expense, net, and Loss on debt redemption, respectively, in the Statement of Consolidated Operations.\n75\nTable\n \nof\n Contents\nIn January 2023, the Company repurchased approximately $\n26\n aggregate principal amount of its\n 2024 Notes \nthrough an OMR. The OMR was settled at slightly less than par value.\nIn the second and fourth quarters of 2022, the Company repurchased in the open market approximately $\n69\n aggregate principal amount of its \n2024 Notes\n and paid approximately $\n71\n, including an early termination premium of approximately $\n2\n, \nwhich was recorded in Loss on debt redemption \nin the Statement of Consolidated Operations.\nThe Company has the option to redeem certain of its notes and bonds in whole or part, at any time at a redemption price equal to the greater of principal amount or the sum of the present values of the remaining scheduled payments, discounted using a defined treasury rate plus a spread, plus in either case accrued and unpaid interest to the redemption date.\nTerm Loan Facilities.\n \nOn November 22, 2023, the Company entered into (i) a U.S. Dollar Term Loan Agreement, due 2026 (the “USD Term Loan Agreement”) and (ii) a Japanese Yen Term Loan Agreement, due 2026 (the “JPY Term Loan Agreement” and, together with the USD Term Loan Agreement, the “Term Loan Agreements” and each, individually, a “Term Loan Agreement”). Capitalized terms used in this “Term Loan Facilities” section but not otherwise defined shall have the meanings given to such terms in the applicable Term Loan Agreement.\nThe USD Term Loan Agreement provided for a $\n200\n senior unsecured delayed draw term loan facility (the “USD Term Loan Facility”), under which any borrowings mature on November 22, 2026, unless earlier terminated in accordance with the provisions of the USD Term Loan Agreement. Commencing in 2025, the USD Term Loan Facility requires quarterly principal payments through maturity based on a percentage of the original principal amount. The JPY Term Loan Agreement provided for a ¥\n33,000\n million senior unsecured delayed draw term loan facility (the “JPY Term Loan Facility” and, together with the USD Term Loan Facility, the “Term Loan Facilities”), under which any borrowings mature on November 22, 2026, unless earlier terminated in accordance with the provisions of the JPY Term Loan Agreement.\nEach of the Term Loan Facilities is unsecured and amounts payable thereunder rank pari passu with all other unsecured, unsubordinated indebtedness of the Company. Borrowings under the USD Term Loan Facility are denominated in U.S. dollars, and borrowings under the JPY Term Loan Facility are denominated in Japanese yen. Loans under each of the Term Loan Facilities may be prepaid without premium or penalty.\nUnder the USD Term Loan Facility, loans bear interest at a base rate or a rate equal to Term SOFR plus adjustment, plus, in each case, an applicable margin based on the credit ratings of the Company’s outstanding senior unsecured long-term debt. Based on the Company’s long-term debt ratings, the applicable margin on base rate loans was \n0.375\n% and \n0.500\n% per annum as of December 31, 2024 and December 31, 2023, respectively, and the applicable margin on Term SOFR loans was \n1.375\n% and \n1.500\n% per annum as of December 31, 2024 and December 31, 2023, respectively.\nUnder the JPY Term Loan Facility, loans bear interest at a rate equal to the Cumulative Compounded RFR Rate utilizing the Tokyo Overnight Average Rate plus an applicable margin based on the credit ratings of the Company’s outstanding senior unsecured long-term debt. Based on the Company’s long-term debt ratings, the applicable margin on loans under the JPY Term Loan Facility is \n1.500\n% and \n1.625\n% per annum as of December 31, 2024 and December 31, 2023, respectively.\nThe Company entered into interest rate swaps to exchange the floating interest rates of the Term Loan Facilities to fixed interest rates. The fixed interest rate on the USD Term Loan was \n5.670\n% and \n5.795\n% as of \nDecember 31, 2024\n and \nDecember 31, 2023\n, respectively. The fixed interest rate on the JPY Term Loan was \n1.919\n% and \n2.044\n% as of \nDecember 31, 2024\n and \nDecember 31, 2023\n, respectively. \nThe obligations of the Company to pay amounts outstanding under the respective Term Loan Facilities may be accelerated upon the occurrence of an “Event of Default” as defined therein. Such Events of Default include, among others, (a) non-payment of obligations; (b) breach of any representation or warranty in any material respect; (c) non-performance of covenants and obligations; (d) with respect to other indebtedness in a principal amount in excess of $\n100\n, a default thereunder that causes such indebtedness to become due prior to its stated maturity or a default in the payment at maturity of any principal of such indebtedness; (e) the bankruptcy or insolvency of the Company; and (f) a change in control of the Company.\nThe Term Loan Agreements contain respective covenants, including, among others, (a) limitations on the Company’s ability to incur liens securing indebtedness for borrowed money; (b) limitations on the Company’s ability to consummate a consolidation, merger, or sale of all or substantially all of its assets; (c) limitations on the Company’s ability to change the nature of its business; and (d) a limitation requiring the ratio of Consolidated Net Debt to Consolidated EBITDA as of the end of each fiscal quarter for the period of the four fiscal quarters most recently ended, to be less than or equal to \n3.75\n to 1.00.\nOn December 27, 2023, the Company borrowed $\n200\n under the USD Term Loan Facility. On December 20, 2024, the Company completed an early partial prepayment of its USD Term Loan in the aggregate principal amount of $\n60\n. This partial prepayment was made at par value plus accrued interest of less than $\n1\n. On December 1, 2023, the Company borrowed ¥\n29,702\n million under the JPY Term Loan Facility. \n76\nTable\n \nof\n Contents\nThe amounts outstanding under the USD Term Loan Facility were $\n140\n and $\n200\n as of December 31, 2024 and December 31, 2023, respectively. The amounts outstanding under the JPY Term Loan Facility were ¥\n29,702\n million ($\n188\n) and ¥\n29,702\n million ($\n211\n) as of December 31, 2024 and \nDecember 31, 2023, respectively. \nCredit Facility.\n On July 27, 2023, the Company entered into the Second Amended and Restated\n \nFive-Year\n Revolving Credit Agreement (as so amended and restated, the “Credit Agreement”) \nby and among the Company, a syndicate of lenders and issuers named therein, Citibank, N.A., as administrative agent for the lenders and issuers, and JPMorgan Chase Bank, N.A., as syndication agent. The Credit Agreement amended and restated the Company’s Amended and Restated \nFive-Year\n Revolving Credit Agreement, dated as of September 28, 2021, as amended by Amendment No. 1 to Credit Agreement, dated as of February 13, 2023. \nThe Credit Agreement provides a $\n1,000\n senior unsecured revolving credit facility (the “Credit Facility”) that matures on July 27, 2028, unless extended or earlier terminated in accordance with the provisions of the Credit Agreement. \nThe Company may make \ntwo\n \none-year\n extension requests during the term of the Credit Facility, \nwith any extension being subject to the lender consent requirements set forth in the Credit Agreement\n. \nSubject to the terms and conditions of the Credit Agreement, the Company may from time to time request increases in commitments under the Credit Facility, not to exceed $\n500\n in aggregate principal amount, and may also request the issuance of letters of credit, subject to a letter of credit sublimit of $\n500\n of the Credit Facility. \nUnder the provisions of the Credit Agreement, based on Howmet’s current long-term debt ratings, Howmet pays an annual fee of \n0.125\n% of the total commitment to maintain the Credit Facility.\nThe Credit Facility is unsecured and amounts payable under it will rank pari passu with all other unsecured, unsubordinated indebtedness of the Company. Borrowings under the Credit Facility may be denominated in U.S. dollars or euros. \nLoans will bear interest at a base rate or, in the case of U.S. dollar-denominated loans, a rate equal to the Term Secured Overnight Financing Rate (“SOFR”) plus adjustment or, in the case of euro-denominated loans, the Euro inter-bank offered rate (“EURIBOR”), plus, in each case, an applicable margin based on the credit ratings of the Company’s outstanding senior unsecured long-term debt.\n Based on Howmet’s current long-term debt ratings, there would be \nno\n applicable margin on base rate loans and the applicable margin on Term SOFR loans and EURIBOR loans would be \n1.000\n% per annum. The applicable margin is subject to change based on the Company’s long-term debt ratings. Loans may be prepaid without premium or penalty, subject to customary breakage costs. \nThe obligation of the Company to pay amounts outstanding under the Credit Facility may be accelerated upon the occurrence of an “Event of Default” as defined in the Credit Agreement. Such Events of Default include, among others, (a) non-payment of obligations; (b) breach of any representation or warranty in any material respect; (c) non-performance of covenants and obligations; (d) with respect to other indebtedness in a principal amount in excess of $\n100\n, a default thereunder that causes such indebtedness to become due prior to its stated maturity or a default in the payment at maturity of any principal of such indebtedness; (e) the bankruptcy or insolvency of Howmet; and (f) a change in control of the Company.\nThe Credit Agreement contains covenants, including, among others, (a) limitations on the Company’s ability to incur liens securing indebtedness for borrowed money; (b) limitations on the Company’s ability to consummate a consolidation, merger or sale of all or substantially all of its assets; (c) limitations on the Company’s ability to change the nature of its business; and (d) a limitation requiring the ratio of Consolidated Net Debt to Consolidated EBITDA (each as defined in the Credit Agreement) as of the end of each fiscal quarter for the period of the four fiscal quarters most recently ended, to be less than or equal to \n3.75\n to 1.00.\nThere were \nno\n amounts outstanding under the Credit Agreement as of \nDecember 31, 2024 and 2023\n, and \nno\n amounts were borrowed during \n2024, 2023 or 2022\n under the Credit Agreement. As of \nDecember 31, 2024, the Company was in compliance with all covenants under the Credit Agreement. \nAvailability under the Credit Agreement could be reduced in future periods if the Company fails to maintain the required ratio referenced above.\nCommercial Pape\nr.\n On April 4, 2024, the Company established a commercial paper program under which the Company may issue unsecured commercial paper notes (“commercial paper”) from time to time up to a maximum aggregate face amount of $\n1,000\n outstanding at any time. The maturities of the commercial paper may vary but will not exceed \n397\n days from the date of issue and will rank equal in right of payment with all other unsecured senior indebtedness of the Company. The proceeds of the commercial paper will be used for general corporate purposes.\nThere were \nno\n amounts outstanding under the commercial paper program as of \nDecember 31, 2024\n.\n77\nTable\n \nof\n Contents\nR. \nOther Financial Instruments\nFair Value.\n Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value hierarchy distinguishes between (i) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (ii) an entity’s own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\n•\nLevel 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n•\nLevel 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\n•\nLevel 3 - Inputs that are both significant to the fair value measurement and unobservable.\nThe carrying values of Cash and cash equivalents, restricted cash, derivatives, noncurrent receivables, and Long-term debt due within one year included in the Consolidated Balance Sheet approximate their fair value. The aforementioned derivatives are included in Prepaid expenses and other current assets, Other noncurrent assets, Other current liabilities, and Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet, as applicable. The Company holds exchange-traded fixed income securities which are considered available-for-sale securities and are carried at fair value based on quoted market prices. The aforementioned securities are classified in Level 1 of the fair value hierarchy and are included in Other noncurrent assets in the Consolidated Balance Sheet. The fair value of Long-term debt, less amount due within one year was based on quoted market prices for public debt and on interest rates that are currently available to Howmet for issuance of debt with similar terms and maturities for non-public debt. The fair value amounts for all Long-term debt were classified in Level 2 of the fair value hierarchy.\n \n2024\n2023\nDecember 31,\nCarrying\nvalue\nFair\nvalue\nCarrying\nvalue\nFair\nvalue\nLong-term debt, less amount due within one year\n$\n3,309\n \n$\n3,298\n \n$\n3,500\n \n$\n3,504\n \nRestricted cash was $\n1\n, less than $\n1\n, and $\n1\n in 2024, 2023, and 2022\n,\n respectively, and was recorded in Prepaid expenses and other current assets in the Consolidated Balance Sheet.\nS. \nCash Flow Information\nCash paid for interest and income taxes was as follows:\n2024\n2023\n2022\nInterest, net of amounts capitalized\n$\n180\n \n$\n221\n \n$\n224\n \nIncome taxes, net of amounts refunded\n$\n177\n \n$\n104\n \n$\n50\n \nThe Company incurred capital expenditures which remain unpaid at December 31, 2024, 2023, and 2022 of $\n97\n, $\n72\n, and $\n55\n, respectively, and will result in cash outflows within investing activities in the Statement of Consolidated Cash Flows in subsequent periods.\nIn September 2022, the FASB issued guidance to enhance the transparency of disclosures regarding supplier finance programs. These changes became effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the amendment on rollforward information, which is effective for fiscal years beginning after December 15, 2023.\n78\nTable\n \nof\n Contents\nOn January 1, 2023, the Company adopted the changes issued by the FASB related to disclosure requirements of supplier finance program obligations. We offer voluntary supplier finance programs to suppliers who may elect to sell their receivables to third parties at the sole discretion of both the supplier and the third parties. The program is at no cost to the Company and provides additional liquidity to our suppliers, if they desire, at their cost. Under these programs, the Company pays the third party bank, rather than the supplier, the stated amount of the confirmed invoices on the original maturity date of the invoices. The Company or the third party bank may terminate a program upon at least \n30\n days’ notice. Supplier invoices under the program require payment in full no more than approximately \n120\n days of the invoice date. As of December 31, 2024 and 2023, supplier invoices that are subject to future payment under these programs were $\n268\n and $\n258\n, respectively, and are included in Accounts payable, trade in the Consolidated Balance Sheet.\nThe rollforward of the Company’s outstanding obligations confirmed as valid under its \nsupplier financing program\n for the year ended December 31, 2024 is as follows:\nConfirmed obligations outstanding at December 31, 2023\n$\n258\n \nInvoices confirmed during the year\n877\n \nConfirmed invoices paid during the year\n(\n867\n)\nConfirmed obligations outstanding at December 31, 2024\n$\n268\n \nT. \nDivestitures\n2024 Divestiture\nOn May 31, 2024, the Company completed the sale of a small manufacturing facility in the U.K. within the Engineered Structures segment. The sale, including post-close adjustments, resulted in a year-to-date charge of $\n13\n that was recorded in Restructuring and other charges in the Statement of Consolidated Operations.\n The sale remains subject to certain post-closing adjustments.\nU. \nContingencies and Commitments\nContingencies\nEnvironmental Matters.\n Howmet participates in environmental assessments and/or cleanups at more than \n30\n locations. These include owned or operating facilities and adjoining properties, previously owned or operated facilities and adjoining properties, and waste sites, including Superfund (Comprehensive Environmental Response, Compensation and Liability Act (“CERCLA”)) sites.\nA liability is recorded for environmental remediation when a cleanup program becomes probable and the costs can be reasonably estimated. As assessments and cleanups proceed, the liability is adjusted based on progress made in determining the extent of remedial actions and related costs. The liability can change substantially due to factors such as the nature and extent of contamination, changes in remedial requirements, and technological changes, among others.\nThe Company's remediation reserve balance was $\n19\n and $\n17\n as of \nDecember 31, 2024 and 2023\n, respectively, and was recorded in Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet (of which $\n10\n and $\n7\n, respectively, was classified as a current liability), and reflects the most probable costs to remediate identified environmental conditions for which costs can be reasonably estimated. \nPayments related to remediation expenses applied against the reserve were $\n2\n and $\n3\n in 2024 and 2023, respectively, and included expenditures currently mandated, as well as those not required by any regulatory authority or third party.\nIncluded in annual operating expenses are the recurring costs of managing hazardous substances and environmental programs. These costs are estimated to be less than \n1\n% of Cost of goods sold.\n79\nTable\n \nof\n Contents\nTax.\n \nIn December 2013 and 2014, the Company received audit assessment notices from the French Tax Authority (“FTA”) for the 2010 through 2012 tax years. In 2016, the Company appealed to the Committee of the Abuse of Tax Law, where it received a favorable nonbinding decision. The FTA disagreed with the Committee of the Abuse of Tax Law’s opinion, and the Company appealed to the Montreuil Administrative Court, where in 2020 the Company prevailed on the merits. The FTA appealed this decision to the Paris Administrative Court of Appeal in 2021. On March 31, 2023, the Company received an adverse decision from the Paris Administrative Court of Appeal. The Company appealed this decision to the French Administrative Supreme Court. The assessment amount was $\n17\n (€\n16\n million), including $\n10\n (€\n9\n million) of tax and interest up through 2017 and $\n7\n (€\n7\n million) of penalties. The Company estimates additional interest to be $\n2\n (€\n2\n million). On July 23, 2024, the Company received the French Administrative Supreme Court’s decision. That decision upheld the assessment of $\n10\n (€\n9\n million) of tax and interest, while cancelling the penalties of $\n7\n (€\n7\n million) and remanding the penalty assessment issue to the Paris Administrative Court of Appeal for reexamination. As a result, the Company has no further right to appeal the assessment of tax and interest but will continue to protest the penalties. \nIn 2023, the Company recorded an income tax reserve in Provision for income taxes in the Statement of Consolidated Operations of $\n21\n (€\n19\n million), which includes tax, estimated interest and penalties, for the 2010 through 2012 tax years, as well as the remaining tax years open for reassessment (2020-2023). In accordance with FTA dispute resolution practices, the Company paid the assessment amount including tax, interest, and penalties, to the FTA in December 2023. The Company is expecting to pay the additional interest related to the assessment in 2025. The Company also paid the estimated tax related to the 2020-2023 tax years in 2023. As of the third quarter of 2024, the Company no longer recorded an uncertain tax position related to the tax and interest assessed. In October 2024, the Company received a refund of the penalties that were remanded. We will continue to record an income tax reserve for penalties determined more than likely to be upheld, until the uncertain tax position is settled. \nIndemnified Matters. \nThe Separation and Distribution Agreement, dated October 31, 2016, that the Company entered into with Alcoa Corporation in connection with its separation from Alcoa Corporation, and the Separation and Distribution Agreement, dated March 31, 2020, that the Company entered into with Arconic Corporation in connection with its separation from Arconic Corporation, provide for cross-indemnities for claims subject to indemnification between the Company and Alcoa Corporation and between the Company and Arconic Corporation, respectively. To date, Alcoa Corporation and Arconic Corporation have fulfilled their respective indemnification obligations to the Company, and claims subject to indemnification by Alcoa Corporation or Arconic Corporation have not impacted the Company financially. Among other claims that are covered by these indemnities, Arconic Corporation indemnifies the Company (previously named Arconic Inc. and, prior to that, Alcoa Inc.) for all potential liabilities associated with the fire that occurred at the Grenfell Tower in London, U.K. on June 14, 2017 (“Grenfell Fire”), including the following: \n(i) \nRegulatory Investigations\n.\n Arconic Architectural Products SAS (“AAP SAS”) (now a subsidiary of Arconic Corporation) supplied Reynobond PE to its customer who used the product as one component of the overall cladding system on Grenfell Tower. Regulatory Investigations into the overall Grenfell Fire are being conducted, including a criminal investigation by the London Metropolitan Police Service and a Public Inquiry by the British government (regarding which AAP SAS is a participant) (together, the “U.K. Proceedings”). On September 4, 2024, the Public Inquiry published its Phase 2 report on the Grenfell fire. (ii) \nUnited Kingdom Litigation\n. \nOn December 23, 2020, survivors and estates of decedents of the Grenfell Fire and emergency responders filed suit against \n23\n defendants, including the Company. The substantial majority of these suits were settled pursuant to the terms of a confidential settlement agreement and are now discontinued and closed. The claimants in the remaining suits are mediating their claims with the defendants. On June 21, 2024, the Company was joined as a party to proceedings initiated by the Royal Borough of Kensington and Chelsea (RBKC) and Chelsea Tenant Management Organisation Ltd. (KCTMO) that are currently pending against AAP SAS and Whirlpool. By February 14, 2025, RBKC and KCTMO must serve their Particulars of Claim and Schedule of Loss on defendants. (iii) \nRaul v. Albaugh, et al. \n(United States District Court for the District of Delaware)\n. On June 22, 2018, a derivative complaint was filed nominally on behalf of Arconic Inc. by a purported Arconic Inc. stockholder against the then members of Arconic Inc.’s Board of Directors, Klaus Kleinfeld and Ken Giacobbe, naming Arconic Inc. as a nominal defendant. The complaint alleged violations of the federal securities laws relating to the Grenfell Fire,\n as well as \nclaims under Delaware state law for breaches of fiduciary duty, gross mismanagement and abuse of control, and also alleges that the defendants improperly authorized the sale of Reynobond PE for unsafe uses. On October 22, 2024, the parties executed a settlement term sheet that set forth the material terms and conditions associated with the resolution of this derivative action. On October 28, 2024,\n November 27, 2024 and January 27, 2025, the parties filed joint status reports regarding this development. On January 28, 2025, the court ordered that the parties file a joint status report or a stipulation of dismissal on or before March 28, 2025. The parties plan to enter into a formal, final Stipulation and Agreement of Settlement, Compromise, and Release in the near term, which will be presented to the court for approval.\n80\nTable\n \nof\n Contents\nLegal Proceedings. \nLehman Brothers International (Europe) Legal Proceeding\n.\n \nOn June 26, 2020, Lehman Brothers International (Europe) (“LBIE”) filed proceedings in the High Court of Justice, Business and Property Courts of England and Wales against \ntwo\n subsidiaries of the Company, FR Acquisitions Corporation (Europe) Ltd and JFB Firth Rixson Inc. (collectively, the “Firth Rixson Entities”). The proceedings concerned \ntwo\n interest rate swap transactions that the Firth Rixson Entities entered into with LBIE in 2007 and 2008. As a result of the ruling issued by the Court in October 2022, the Company recorded $\n65\n in Other current liabilities in the Consolidated Balance Sheet and took a pre-tax charge of this amount in Other expense, net in the Statement of Consolidated Operations in the third quarter of 2022. The Firth Rixson Entities appealed the Court’s ruling. On June 15, 2023, the Company, the Firth Rixson Entities, and LBIE reached a full and final settlement of all claims arising out of the LBIE legal proceedings. The settlement provided for payment of $\n40\n: $\n15\n paid in July 2023 and $\n25\n paid in July 2024.\nLockheed Martin Corp. v. Howmet Aerospace Inc.\n On November 30, 2023, Lockheed Martin Corporation (“Lockheed Martin”) filed a complaint in federal district court in the Northern District of Texas against the Company and its subsidiary RTI Advanced Forming, Inc. (“RTI”) as defendants. The complaint alleged that the Company and RTI breached a Master Purchase Order between Lockheed Martin and RTI related to the F-35 Joint Strike Fighter production program between Lockheed Martin and the United States government (the “F-35 Program”) by seeking a fair market price adjustment for the provision of titanium mill products under RTI’s separate agreements with Lockheed Martin’s subcontractors for the F-35 Program. Following various claims and counterclaims and court-ordered mediation, the parties reached a confidential settlement agreement on April 2, 2024, to supply until December 31, 2026 subject to revised terms mutually agreed to by the parties. The settlement had no material impact on the results of operations in the current year. The parties stipulated to the dismissal of all claims and counterclaims with prejudice on April 2, 2024.\nOther. \nIn addition to the matters discussed above, various other lawsuits, claims, and proceedings have been or may be instituted or asserted against the\n \nCompany, including those pertaining to environmental, product liability, safety and health, employment, tax and antitrust matters. While the amounts claimed in these other matters may be substantial, the ultimate liability cannot currently be determined because of the considerable uncertainties that exist. Therefore, it is possible that the Company’s liquidity or results of operations in a period could be materially affected by one or more of these other matters. However, based on facts currently available, management believes that the disposition of these other matters that are pending or asserted will not have a material adverse effect, individually or in the aggregate, on the results of operations, financial position or cash flows of the Company.\nCommitments\nPurchase & Other Obligations.\n Howmet has entered into commitments for raw materials, energy and other obligations, which total $\n237\n in 2025, $\n51\n in 2026, $\n42\n in 2027, $\n40\n in 2028, $\n39\n in 2029  and \nnone\n thereafter.\nOperating Leases. \nSee \nNote P\n for the operating lease future minimum contractual obligations.\nGuarantees. \nAs of December 31, 2024, Howmet had outstanding bank guarantees related to tax matters, customs duties, rental, plant expansion, and environmental obligations. The total amount committed under these guarantees, which expire at various dates between 2025 and 2027, was $\n6\n as of December 31, 2024.\nPursuant to the Separation and Distribution Agreement, dated as of October 31, 2016, between Howmet and Alcoa Corporation, Howmet was required to provide certain guarantees for Alcoa Corporation, which were included in Other noncurrent liabilities and deferred credits in the Consolidated Balance Sheet. The remaining guarantee, which had a fair value of $\n6\n as of both December 31, 2024 and 2023, relates to a long-term energy supply agreement that expires in 2047 at an Alcoa Corporation facility, for which the Company is secondarily liable in the event of a payment default by Alcoa Corporation. If the Company incurs any liability under this guarantee, Arconic Corporation is obligated to indemnify the Company for \n50\n% of such liability. The Company currently views the risk of an Alcoa Corporation payment default on its obligations under the contract to be remote. The Company is required to provide a guarantee up to an estimated present value amount of approximately $\n1,121\n and $\n1,131\n as of December 31, 2024 and 2023, respectively, in the event of an Alcoa Corporation default. In the fourth quarter of 2024, 2023, and 2022, a surety bond with a limit of $\n80\n relating to this guarantee was obtained by Alcoa Corporation to protect Howmet's obligation. This surety bond will be renewed on an annual basis by Alcoa Corporation.\nLetters of Credit. \nThe Company has outstanding letters of credit, primarily related to workers’ compensation, environmental obligations, insurance obligations, and tax matters. The total amount committed under these letters of credit, which automatically renew or expire at various dates, primarily in 2025, was $\n90\n as of \nDecember 31, 2024\n.\n81\nTable\n \nof\n Contents\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to retain letters of credit of $\n48\n (which are included in the \n$\n90\n in the above paragraph) that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation and letters of credit fees paid by the Company are proportionally billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively. Also, the Company was required to provide letters of credit for certain Arconic Corporation and Alcoa Corporation environmental obligations and, as a result, the Company has $\n17\n of outstanding letters of credit relating to such liabilities (which are also included in the \n$\n90\n in the above paragraph). Arconic Corporation is being billed for these letter of credit fees paid by the Company and will reimburse the Company for any payments made under these letters of credit.\nSurety Bonds.\n The Company has outstanding surety bonds primarily related to customs duties, workers’ compensation, environmental-related matters, and contract performance. The total amount committed under these annual surety bonds, which automatically renew or expire at various dates, primarily in 2025 and 2026, was $\n44\n as of December 31, 2024.\nPursuant to the Separation and Distribution Agreements between the Company and Arconic Corporation and between the Company and Alcoa Corporation, the Company is required to provide surety bonds of $\n21\n, which are included in the $\n44\n in the above paragraph, that had previously been provided related to the Company, Arconic Corporation, and Alcoa Corporation workers’ compensation claims that occurred prior to the respective separation transactions of April 1, 2020 and November 1, 2016. Arconic Corporation and Alcoa Corporation workers’ compensation claims and surety bond fees paid by the Company are proportionately billed to, and are reimbursed by, Arconic Corporation and Alcoa Corporation, respectively.\nV. \nSubsequent Events\nManagement evaluated all activity of Howmet and concluded that no subsequent events have occurred that would require recognition in the Consolidated Financial Statements or disclosure in the Notes to the Consolidated Financial Statements, except as noted below:\nSee \nNote I\n regarding share repurchases made in January 2025.\n82\nTable\n \nof\n Contents\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone.\nItem 9A. Controls and Procedures.\n(a) Evaluation of Disclosure Controls and Procedures\nHowmet’s Chief Executive Officer and Chief Financial Officer have evaluated the Company’s disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as of the end of the period covered by this report, and they have concluded that these controls and procedures are effective.\n(b) Management’s Annual Report on Internal Control over Financial Reporting\nManagement’s Report on Internal Control over Financial Reporting is included in \nPart II, Item 8\n of this Form 10-K beginning on page \n38\n.\n(c) Attestation Report of the Registered Public Accounting Firm\nThe effectiveness of Howmet’s internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report, which is included in \nPart II, Item 8\n of this Form 10-K on page \n39\n.\n(d) Changes in Internal Control over Financial Reporting\nThere have been no changes in internal control over financial reporting during the fourth quarter of 2024, that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nItem 9B. Other Information.\nRule 105b5-1 Trading Plans. \nDuring the three months ended December 31, 2024, none of the Company’s directors or executive officers \nadopted\n or \nterminated\n any contract, instruction or written plan for the purchase or sale of Company securities that was intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) or any “non-Rule 10b5-1 trading arrangement” as defined in Item 408(c) of Regulation S-K.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspection.\nNot applicable.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance.\nThe information required by Item 401 of Regulation S-K regarding directors is contained under the caption “Item 1 Election of Directors” of the Proxy Statement and is incorporated by reference. The information required by Item 401 of Regulation S-K regarding executive officers is set forth in Part I, Item 1 of this report under “Executive Officers of the Registrant.”\nThe information required by Item 405 of Regulation S-K is contained under the caption “Section 16(a) Beneficial Ownership Reporting Compliance” of the Proxy Statement and is incorporated by reference.\nThe Company’s Code of Ethics for the CEO, CFO and Other Financial Professionals is publicly available on the Company’s Internet website at www.howmet.com under the section “Investors—Corporate Governance—Governance and Policies.” The remaining information required by Item 406 of Regulation S-K is contained under the captions “Corporate Governance” and “Corporate Governance—Code of Conduct and Code of Ethics” of the Proxy Statement and is incorporated by reference.\nThe information required by Items 407(c)(3), (d)(4) and (d)(5) of Regulation S-K is included under the captions “Item 1 Election of Directors—Nominating Board Candidates—Procedures and Director Qualifications” and “Corporate Governance—Committees of the Board—Audit Committee” of the Proxy Statement and is incorporated by reference.\nThe Company has an Insider Trading Policy\n governing the purchase, sale, and/or other dispositions of our securities by our directors, officers, employees and other covered persons, as well as by Howmet itself, that we believe is reasonably designed to promote compliance with insider trading laws, rules and regulations, and applicable listing standards. A copy of our Insider Trading Policy is filed as Exhibit 19 to this Annual Report on Form 10-K.\nItem 11. Executive Compensation.\nThe information required by Item 402 of Regulation S-K is contained under the captions “Director Compensation”, “Executive Compensation” and “Corporate Governance—Recovery of Incentive Compensation” of the Proxy Statement. Such information is incorporated by reference, except as to information required pursuant to Item 402(v) of Regulation S-K relating to pay versus performance.\n83\nTable\n \nof\n Contents\nThe information required by Items 407(e)(4) and (e)(5) of Regulation S-K is contained under the captions “Corporate Governance—Compensation Committee Interlocks and Insider Participation” and “Item 3 Advisory Approval of Executive Compensation—Compensation Committee Report” of the Proxy Statement. Such information (other than the Compensation Committee Report, which shall not be deemed to be “filed”) is incorporated by reference.\n84\nTable\n \nof\n Contents\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table gives information about Howmet’s common stock that could be issued under the Company’s equity compensation plans as of December 31, 2024:\nEquity Compensation Plan Information\nPlan Category\nNumber of securities to\nbe issued upon exercise of\noutstanding options, warrants and rights\nWeighted-average\nexercise price of\noutstanding options, warrants and rights\nNumber of securities remaining available for future issuance under\nequity compensation\nplans (excluding\nsecurities reflected in column (a))\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\n(1)\n2,286,559\n(1)\n$\n20.98 \n19,641,999\n(2)\nEquity compensation plans not approved by security holders \n— \n— \n— \nTotal\n2,286,559 \n$\n20.98 \n19,641,999 \n(1)\n    Equity compensation plans approved by security holders includes the 2013 Howmet Aerospace Stock Incentive Plan, as Amended and Restated (approved by shareholders in May 2024, May 2019, May 2018, May 2016 and May 2013) (the “2013 Plan”). Table amounts are comprised of the following:\n•\n146,308 stock options;\n•\n1,508,395 restricted share units; and\n•\n631,856 performance share awards (275,047 granted in 2024 at target).\n(2)\n      The 2013 Plan authorizes, in addition to stock options, other types of stock-based awards in the form of stock appreciation rights, restricted shares, restricted share units, performance awards and other awards. The shares that remain available for issuance under the 2013 Plan may be issued in connection with any one of these awards. Up to 66,666,666 shares may be issued under the plan. Any award other than an option or a stock appreciation right shall count as 2.33 shares. Options and stock appreciation rights shall be counted as one share for each option or stock appreciation right. In addition, the 2013 Plan provides the following are available to grant under the 2013 Plan: (i) shares that are issued under the 2013 Plan, which are subsequently forfeited, cancelled or expire in accordance with the terms of the award and (ii) shares that had previously been issued under prior plans that are outstanding as of the date of the 2013 Plan which are subsequently forfeited, cancelled or expire in accordance with the terms of the award.\nThe information required by Item 403 of Regulation S-K is contained under the captions “Stock Ownership Information—Stock Ownership of Certain Beneficial Owners” and “Stock Ownership Information—Stock Ownership of Directors and Executive Officers” of the Proxy Statement and is incorporated by reference.\nItem 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by Item 404 of Regulation S-K is contained under the captions “Executive Compensation” (excluding the information under the caption “Compensation Committee Report”) and “Corporate Governance— Related Person Transactions” of the Proxy Statement and is incorporated by reference.\nThe information required by Item 407(a) of Regulation S-K regarding director independence is contained under the captions “Item 1 Election of Directors” and “Corporate Governance” of the Proxy Statement and is incorporated by reference.\nItem 14. Principal Accounting Fees and Services.\nThe information required by Item 9(e) of Schedule 14A is contained under the captions “"
  }
}