{
  "ticker": "IBKR",
  "cik": "0001381197",
  "company_name": "Interactive Brokers Group, Inc.",
  "filing_date": "2025-02-27",
  "accession": "0001381197-25-000036",
  "primary_doc": "ibkr-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 1A of this Annual Report on Form 10\n-\nK.\n \nBusiness Overview\n \nWe are an automated global electronic broker. We custody and service accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers and individual investors. We specialize in routing orders and executing and processing trades in stocks, options, futures, forex, bonds, mutual funds, ETFs and precious metals on more than 160 electronic exchanges and market centers in 36 countries and 28 currencies around the world. In addition, our customers can use our trading platform to trade certain cryptocurrencies through third-party cryptocurrency service providers that execute, clear and custody the cryptocurrencies. In August 2024, we began offering trading in forecast contracts, which are event-based contracts traded on ForecastEx, a CFTC-registered exchange and clearinghouse we established.\n \n \nAs an electronic broker, we execute, clear and settle trades globally for both institutional and individual customers. Capitalizing on our proprietary technology, our systems provide our customers with the capability to monitor multiple markets around the world simultaneously and to execute trades electronically in these markets at a low cost, in multiple products and currencies from a single trading account. The ever-growing complexity of multiple market centers across diverse geographies provides us with ongoing opportunities to build and continuously adapt our order routing software to secure excellent execution prices.\nSince our inception in 1977, we have focused on developing proprietary software to automate broker\n-\ndealer functions. The proliferation of electronic exchanges and market centers has allowed us to integrate our software with an increasing number of trading venues – as well as with market data sources, securities lending platforms and regulatory reporting facilities – creating one automatically functioning, computerized platform that requires minimal human intervention.\n \nOur customer base is diverse with respect to geography and type. Currently, approximately 83%\n \nof our customers reside outside the U.S. in over 200\n \ncountries and territories, and over 85%\n \nof \nnew customers come from outside the U.S\n. Approximately 55%\n \nof our customers’ equity is in institutional accounts such as hedge funds, financial advisors, proprietary trading firms and introducing brokers. Specialized products and services that we have developed successfully attract these accounts. For example, we offer prime brokerage services, including financing and securities lending, to hedge funds; our model portfolio technology and automated share allocation and rebalancing tools are particularly attractive to financial advisors; and our trading platform, global access and low pricing attract introducing brokers. \n \nBusiness Environment \n \nIn 2024, most world equities markets, including the U.S., Canada, Europe, Japan, and Australia, continued to reach all-time highs. The S&P 500 index led major world indices with a 23% year-over-year gain. The dominance of a small number of technology stocks (the so-called “Magnificent 7”) diminished somewhat, with these stocks accounting for half of the S&P’s index’s gains in the current year, down from 63% in the prior year. Inflationary pressures eased gradually over the course of 2024 and, as a result, central banks in most countries cut their policy rates. Lower rates helped moderate economic conditions toward a “soft landing” for global economies, despite an ongoing backdrop of geopolitical uncertainty. Lower rates and the expectation of further rate reductions also contributed to higher market levels and volumes, with individual investors continuing their engagement with the securities markets, particularly in options and equities. \n \nThe following is a summary of the key economic drivers that affect our business and how they compared to the prior year:\n \nGlobal trading volumes\n. Worldwide, equities volumes at most major trading venues increased in the current year, while major market indices reached all-time highs in the U.S., Canada, Europe, U.K., Germany, Japan, and Australia. In the U.S., according to industry data, average daily volume in exchange-listed equity-based options increased by 10%, listed cash equities volume by 10%, and futures by 9%, compared to 2023. Options trading volumes have risen with the growing popularity of shorter-dated options contracts. In futures markets, volumes increased across all product segments, particularly in commodities such as the metals, energy and agriculture sectors, as investors sought to mitigate their exposure to ongoing economic and geopolitical uncertainties.\n \nThese factors led to mixed but generally positive results across our major product types. Our customer options, equities, and futures volumes were up 32%, 22%, and 4%, respectively, while foreign exchange volumes declined 9%, compared to the prior year.\n \n\n\n40\n \nTable of Contents\n \n\n\n \nNote that while U.S. options, futures and cash equities volumes are readily comparable measures, they reflect most but not all of the global volumes that generate our commission revenue. See ‘‘Trading Volumes and Customer Statistics’’ below in this Item 7 for additional details regarding our trade volumes, contract and share volumes, and customer statistics.\n \nVolatility\n. U.S. market volatility, as measured by the average Chicago Board Options Exchange Volatility Index (‘‘VIX®’’), declined by 8%, from an average of 16.8 in 2023 to 15.6 in the current year. Volatility levels remain below the levels reached in 2020 through 2022, as the world economic outlook has improved and recession fears have waned. \n \nIn general, higher volatility typically enhances our performance because it often correlates positively with customer trading activity across product types.\n \nInterest Rates\n. After holding rates steady since July 2023, the U.S. Federal Reserve cut the benchmark federal funds rate three times in 2024 (in September, November and December), by a cumulative 100 basis points. After a period of inversion, the U.S. Treasury yield curve began to revert toward a historically typical upward slope by year end, with long-term rates becoming higher than short-term rates. In most countries with developed financial markets, benchmark interest rates also declined over the course of the year as central banks’ concerns over inflation abated.\n \nLower U.S. benchmark rates reduce the interest we earn on our segregated cash, the majority of which is invested in short-term U.S. government securities and related instruments. Higher short-term rates, and uncertainty over future U.S. Federal Reserve rate policy, have led us to maintain a short duration portfolio, substantially all of which matured within three months at December 31, 2024, to more closely match our asset and liability maturities on our interest-sensitive assets. Further, our margin balances are tied to benchmark rates, so lower rates also limit the interest we earn on margin lending to our customers. We continue to offer among the lowest rates in the industry on margin lending, and we believe our low rates are an important feature that attracts customers to our platform.\n \nAs an offset, lower rates also reduce our interest expense. For example, in U.S. dollars we pay interest to customers on their qualified cash balances when the federal funds effective rate is above 0.50%, which it has been since May 2022. With benchmark rates at higher levels than they were during an extended period during and after the pandemic, we are able to earn our full 0.50% spread. We believe the attractive rates we pay on customer cash are among the highest in the industry and are another important feature that draws customers to our platform.\n \nNet interest income on margin loan balances rose compared to the prior year. This increase was due to the average federal funds effective rate increasing to 5.14% in the current year from 5.02% in the prior year, and the growth in margin loan balances in the current active market environment. \n \nHigher average balances contributed to a 13% rise in net interest income over the prior year, and our net interest margin held fairly steady, dipping slightly from 2.36% in the prior year to 2.35% in the current year.\n \nCurrency fluctuations\n. As a global electronic broker trading on exchanges around the world in multiple currencies, we are exposed to foreign currency risk. We actively manage this exposure by keeping our equity in proportion to a defined basket of 10 currencies we call the ‘‘GLOBAL’’ to diversify our risk and to align our hedging strategy with the currencies that we use in our business. Because we report our financial results in U.S. dollars, the change in the value of the GLOBAL versus the U.S. dollar affects our earnings. During the current year, the value of the GLOBAL, as measured in U.S. dollars, decreased 1.45% compared to its value at December 31, 2023, which had a negative impact on our comprehensive earnings for the current year. A discussion of our approach for managing foreign currency exposure is contained in Part I, Item 7A of this Quarterly Report on Form 10-Q entitled ‘‘Quantitative and Qualitative Disclosures about Market Risk.”\n \nFinancial Overview\n \nWe report non-GAAP financial measures, which exclude certain items that may not be indicative of our core operating results and business outlook and are useful in evaluating the operating performance of our business. See the “Non-GAAP Financial Measures” section below in this Item 7 for additional details.\n \nDiluted earnings per share were $6.93 for the year ended December 31, 2024 (“current year”), compared to $5.67 for the year ended December 31, 2023 (“prior year”). Adjusted diluted earnings per share were $7.03 for the current year, compared to $5.75 for the prior year. The calculation of diluted earnings per share is detailed in Note 4 – “Equity and Earnings Per Share” to the audited consolidated financial statements, in Part II, Item 8 of this Annual Report on Form 10-K.\n \nFor the current year, our net revenues were $5,185 million and income before income taxes was $3,695 million, compared to net revenues of $4,340 million and income before income taxes of $3,069 million in the prior year. Adjusted net revenues were $5,257 million and adjusted income before income taxes was $3,767 million, compared to adjusted net revenues of $4,367 million and adjusted income before income taxes of $3,101 million in the prior year. \n\n\n41\n \nTable of Contents\n \n\n\n \n \nThe financial highlights for the current year were: \n \n\nNet interest income increased 13% from the prior year to $3,148 million, driven by higher average customer margin loans and customer credit balances. \n \n\nCommission revenue increased 25% from the prior year to $1,697 million \non higher options, stock and futures volumes.\n \n\nOther fees and services increased 42% from the prior year to $280 million on higher risk exposure fees, payments for order flow \nfrom exchange-mandated programs,\n and Insured Bank Deposit Sweep Program fees (“FDIC sweep fees”). \n \n\nOther income increased \n$71 million from the \nprior year to a gain of $60 million.\n \n\nExecution, clearing and distribution fees expenses increased 16% to $447 million, driven by higher customer trading volume in options, stocks and futures.\n \n\nPretax profit margin was 71% in both the current and prior year. Adjusted pretax profit margin was\n \n72%, up from 71% in the prior year.\n \nIn connection with our currency diversification strategy\n \nas of December 31, 2024, approximately 23% of our equity was denominated in currencies other than the U.S. dollar. In the current year, our currency diversification strategy decreased our comprehensive earnings by $222 million (compared to an increase of $42 million in the prior year), as the U.S. dollar value of the GLOBAL decreased by approximately 1.45%, compared to its value as of December 31, 2023. The effects of our currency diversification strategy are reported as (1) a component of “Other Income” (loss of $15 million) in the consolidated statements of comprehensive income and (2) \nother comprehensive income\n (“OCI”) (loss of\n \n$207 million) in the consolidated statements of financial condition and the consolidated statements of comprehensive income. The full effect of the GLOBAL is captured in comprehensive income. \n \n‎\n \n\n\n42\n \nTable of Contents\n \n\n\nCertain Trends and Uncertainties\n \nWe believe that our current operations may be favorably or unfavorably impacted by the following trends and uncertainties that may affect our financial condition and results of operations:\n \n\nRetail participation in the equity markets has fluctuated in the past due to investor sentiment, market conditions and a variety of other factors. Retail transaction volumes may not be sustainable and are not predictable.\n \n\nConsolidation among market centers may adversely affect the value of our IB SmartRouting\nSM\n software.\n \n\nCompetition among broker-dealers may continue to intensify.\n \n\nBenchmark interest rates tend to fluctuate with economic conditions. Changes in interest rates may not be predictable. \n \n\nFiscal and/or monetary policy may change and impact the financial services business and securities markets.\n \n\nNew legislation or modifications to existing regulations and rules could occur in the future. Scrutiny in the use of artificial intelligence (AI) and information security by regulatory and legislative authorities has increased.\n \n\nThe impact of another pandemic or a public health emergency will depend on numerous evolving factors that cannot be accurately predicted, including the duration and spread of the pandemic, governmental regulations in response to the pandemic, and the effectiveness of vaccinations and other medical advancements. \n \n\nWe continue to be exposed to the risks and uncertainties of doing business in international markets, particularly in the heavily regulated brokerage industry. Such risks and uncertainties include political, economic and financial instability, and foreign policy changes. For example, tensions between the U.S. and China have escalated in recent years, and changes in Chinese governmental oversight of the Chinese and Hong Kong capital markets could result in adverse effects on our business and loss of assets we hold in the region.\n \nAdditionally, although our direct and indirect exposures to Russia and Ukraine are not material, the war in Ukraine and related sanctions have created substantial uncertainty in the global economy and financial markets. \n \n\nOur remaining market making activities will continue to be impacted by market structure changes, market conditions, the level of automation of competitors, and the relationship between actual and implied volatility in the equities markets.\n \nSee “Risk Factors” in Part I,",
    "item1a": "Item 1A of this Annual Report on Form 10\n-\nK for a discussion of other risks that may affect our financial condition and results of operations.\n‎\n \n\n\n43\n \nTable of Contents\n \n\n\n \n \n \nTrading Volumes and Customer Statistics\nThe tables below present historical trading volumes and customer statistics for our business. Trading volumes are the primary driver in our business. Information on our net interest income can be found elsewhere in this report.\n \nEXECUTED ORDER VOLUMES: \n(in thousands, except %)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCustomer\n \n%\n \nPrincipal\n \n%\n \nTotal\n \n%\nPeriod\n \nOrders\n \nChange\n \nOrders\n \nChange\n \nOrders\n \nChange\n2020\n \n 620,405 \n \n \n \n 27,039 \n \n \n \n 704,278 \n \n \n2021\n \n 646,440 \n \n4%\n \n 27,334 \n \n1%\n \n 673,774 \n \n(4%)\n2022\n \n 532,064 \n \n(18%)\n \n 26,966 \n \n(1%)\n \n 559,030 \n \n(17%)\n2023\n \n 483,015 \n \n(9%)\n \n 29,712 \n \n10%\n \n 512,727 \n \n(8%)\n2024\n \n 661,666 \n \n37%\n \n 63,348 \n \n113%\n \n 725,014 \n \n41%\n \nCONTRACT AND SHARE VOLUMES:\n(in thousands, except %)\n \nTOTAL\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions\n \n%\n \nFutures \n1\n \n%\n \nStocks\n \n%\nPeriod\n \n(contracts)\n \nChange\n \n(contracts)\n \nChange\n \n(shares)\n \nChange\n2020\n \n 624,035 \n \n \n \n 167,078 \n \n \n \n 338,513,068 \n \n \n2021\n \n 887,849 \n \n42%\n \n 154,866 \n \n(7%)\n \n 771,273,709 \n \n128%\n2022\n \n 908,415 \n \n2%\n \n 207,138 \n \n34%\n \n 330,035,586 \n \n(57%)\n2023\n \n 1,020,736 \n \n12%\n \n 209,034 \n \n1%\n \n 252,742,847 \n \n(23%)\n2024\n \n 1,344,855 \n \n32%\n \n 218,327 \n \n4%\n \n 307,489,711 \n \n22%\n \nCUSTOMER\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions\n \n%\n \nFutures \n1\n \n%\n \nStocks\n \n%\nPeriod\n \n(contracts)\n \nChange\n \n(contracts)\n \nChange\n \n(shares)\n \nChange\n2020\n \n 584,195 \n \n \n \n 164,555 \n \n \n \n 331,263,604 \n \n \n2021\n \n 852,169 \n \n46%\n \n 152,787 \n \n(7%)\n \n 766,211,726 \n \n131%\n2022\n \n 873,914 \n \n3%\n \n 203,933 \n \n33%\n \n 325,368,714 \n \n(58%)\n2023\n \n 981,172 \n \n12%\n \n 206,073 \n \n1%\n \n 248,588,960 \n \n(24%)\n2024\n \n 1,290,770 \n \n32%\n \n 214,864 \n \n4%\n \n 302,040,873 \n \n22%\n \nPRINCIPAL\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions\n \n%\n \nFutures \n1\n \n%\n \nStocks\n \n%\nPeriod\n \n(contracts)\n \nChange\n \n(contracts)\n \nChange\n \n(shares)\n \nChange\n2020\n \n 39,840 \n \n \n \n 2,523 \n \n \n \n 7,249,464 \n \n \n2021\n \n 35,680 \n \n(10%)\n \n 2,079 \n \n(18%)\n \n 5,061,983 \n \n(30%)\n2022\n \n 34,501 \n \n(3%)\n \n 3,205 \n \n54%\n \n 4,666,872 \n \n(8%)\n2023\n \n 39,564 \n \n15%\n \n 2,961 \n \n(8%)\n \n 4,153,887 \n \n(11%)\n2024\n \n 54,085 \n \n37%\n \n 3,463 \n \n17%\n \n 5,448,838 \n \n31%\n___________________________\n \n(1)\nFutures contract volume includes options on futures. \n‎\n \n\n\n44\n \nTable of Contents\n \n\n\n \nCUSTOMER STATISTICS: \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear over Year\n \n2024\n \n2023\n \n% Change\nTotal Accounts (in thousands)\n \n \n 3,337 \n \n \n 2,562 \n \n30%\nCustomer Equity (in billions) \n1\n \n$\n 568.2 \n \n$\n 426.0 \n \n33%\nTotal Customer DARTs (in thousands) \n2\n \n \n 2,641 \n \n \n 1,940 \n \n36%\n \n \n \n \n \n \n \n \n \nCleared Customers\n \n \n \n \n \n \n \n \nCommission per Cleared Commissionable Order \n3\n \n$\n 2.86 \n \n$\n 3.14 \n \n(9%)\nCleared Avg. DARTs per Account (Annualized)\n \n \n 213 \n \n \n 172 \n \n24%\n___________________________\n \n(1)\nExcludes non\n-\ncustomers. \n \n(2)\nDaily average revenue trades (\"DARTs\") are based on customer orders.\n \n(3)\nCommissionable order – a customer order that generates commissions.\n \n \n \n\n\n45\n \nTable of Contents\n \n\n\n \n \n \nResults of Operations\n \nThe table below presents our consolidated results of operations for the periods indicated. The period\n-\nto\n-\nperiod comparisons below of financial results are not necessarily indicative of future results. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions, except share and per share amounts)\n \n \n \n \n \n \n \n \n \n \nRevenues\n \n \n \n \n \n \n \n \n \nCommissions\n \n$\n 1,697 \n \n$\n 1,360 \n \n$\n 1,322 \nOther fees and services\n \n \n 280 \n \n \n 197 \n \n \n 184 \nOther income (loss)\n \n \n 60 \n \n \n (11)\n \n \n (107)\nTotal non-interest income\n \n \n 2,037 \n \n \n 1,546 \n \n \n 1,399 \n \n \n \n \n \n \n \n \n \n \nInterest income\n \n \n 7,339 \n \n \n 6,230 \n \n \n 2,686 \nInterest expense\n \n \n (4,191)\n \n \n (3,436)\n \n \n (1,018)\nTotal net interest income\n \n \n 3,148 \n \n \n 2,794 \n \n \n 1,668 \nTotal net revenues \n \n \n 5,185 \n \n \n 4,340 \n \n \n 3,067 \n \n \n \n \n \n \n \n \n \n \nNon-interest expenses\n \n \n \n \n \n \n \n \n \nExecution, clearing and distribution fees\n \n \n 447 \n \n \n 386 \n \n \n 324 \nEmployee compensation and benefits\n \n \n 574 \n \n \n 527 \n \n \n 454 \nOccupancy, depreciation and amortization\n \n \n 101 \n \n \n 99 \n \n \n 90 \nCommunications\n \n \n 39 \n \n \n 41 \n \n \n 33 \nGeneral and administrative\n \n \n 314 \n \n \n 211 \n \n \n 165 \nCustomer bad debt\n \n \n 15 \n \n \n 7 \n \n \n 3 \nTotal non-interest expenses \n \n \n 1,490 \n \n \n 1,271 \n \n \n 1,069 \nIncome before income taxes\n \n \n 3,695 \n \n \n 3,069 \n \n \n 1,998 \nIncome tax expense\n \n \n 288 \n \n \n 257 \n \n \n 156 \nNet income\n \n \n 3,407 \n \n \n 2,812 \n \n \n 1,842 \nLess net income attributable to noncontrolling interests\n \n \n 2,652 \n \n \n 2,212 \n \n \n 1,462 \nNet income available for common stockholders\n \n$\n 755 \n \n$\n 600 \n \n$\n 380 \n \n \n \n \n \n \n \n \n \n \nEarnings per share\n \n \n \n \n \n \n \n \n \nBasic \n \n$\n6.99\n \n$\n5.72\n \n$\n3.78\nDiluted\n \n$\n6.93\n \n$\n5.67\n \n$\n3.75\n \n \n \n \n \n \n \n \n \n \nWeighted average common shares outstanding\n \n \n \n \n \n \n \n \n \nBasic \n \n \n 108,112,199 \n \n \n 104,965,050 \n \n \n 100,460,016 \nDiluted\n \n \n 109,002,938 \n \n \n 105,846,877 \n \n \n 101,299,609 \n \n \n \n \n \n \n \n \n \n \nComprehensive income\n \n \n \n \n \n \n \n \n \nNet income available for common stockholders\n \n$\n755\n \n$\n600\n \n$\n380\nOther comprehensive income\n \n \n \n \n \n \n \n \n \n   Cumulative translation adjustment, before income taxes\n \n \n(53)\n \n \n30\n \n \n(26)\n   Income taxes related to items of other comprehensive income\n \n \n -\n \n \n -\n \n \n -\nOther comprehensive income (loss), net of tax\n \n \n(53)\n \n \n30\n \n \n(26)\nComprehensive income available for common stockholders\n \n$\n702\n \n$\n630\n \n$\n354\n \n \n \n \n \n \n \n \n \n \nComprehensive income attributable to noncontrolling interests\n \n \n \n \n \n \n \n \n \nNet income attributable to noncontrolling interests\n \n$\n2,652\n \n$\n2,212\n \n$\n 1,462 \nOther comprehensive income - cumulative translation adjustment\n \n \n(154)\n \n \n92\n \n \n(85)\nComprehensive income attributable to noncontrolling interests\n \n$\n2,498\n \n$\n2,304\n \n$\n1,377\n \n \n \n \n\n\n46\nTable of Contents\n \n\n\n \nThe table below presents our consolidated results of operations as a percent of our total net revenues for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \nYear Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \nRevenues\n \n \n \n \n \n \nCommissions\n \n33%\n \n31%\n \n43%\nOther fees and services\n \n5%\n \n5%\n \n6%\nOther income (loss)\n \n1%\n \n (0%)\n \n (3%)\nTotal non-interest income\n \n39%\n \n36%\n \n46%\n \n \n \n \n \n \n \nInterest income\n \n142%\n \n144%\n \n88%\nInterest expense\n \n (81%)\n \n (79%)\n \n (33%)\nTotal net interest income\n \n61%\n \n64%\n \n54%\nTotal net revenues \n \n100%\n \n100%\n \n100%\n \n \n \n \n \n \n \nNon-interest expenses\n \n \n \n \n \n \nExecution, clearing and distribution fees\n \n9%\n \n9%\n \n11%\nEmployee compensation and benefits\n \n11%\n \n12%\n \n15%\nOccupancy, depreciation and amortization\n \n2%\n \n2%\n \n3%\nCommunications\n \n1%\n \n1%\n \n1%\nGeneral and administrative\n \n6%\n \n5%\n \n5%\nCustomer bad debt\n \n0%\n \n0%\n \n0%\nTotal non-interest expenses \n \n29%\n \n29%\n \n35%\nIncome before income taxes\n \n71%\n \n71%\n \n65%\nIncome tax expense\n \n6%\n \n6%\n \n5%\nNet income\n \n66%\n \n65%\n \n60%\nLess net income attributable to noncontrolling interests\n \n51%\n \n51%\n \n48%\nNet income available for common stockholders\n \n15%\n \n14%\n \n12%\n \n \n \nYear Ended \nDecember 31\n, 2024 (“current year”) compared to the Year Ended December 31, 2023 (“prior year”)\n \nNet Revenues\n \nTotal net revenues, for the current year, increased $845 million, or 19%, compared to the prior year, to $5,185 million. The increase in net revenues was due to higher net interest income, commissions, other fees and services, and other income. \nCommissions\n \nWe earn commissions from our cleared customers for whom we act as an executing and clearing broker and also from our non\n-\ncleared customers for whom we act as an execution\n-\nonly broker. Our commission structure allows customers to choose between (1) an all\n-\ninclusive fixed, or “bundled”, rate; (2) a tiered, or “unbundled”, rate that offers lower commissions for high volume customers where we pass through regulatory and exchange fees; and (3) our \nIBKR Lite\nSM\n offering, \nwhich provides commission-free trades on U.S. exchange-listed stocks and ETFs. IBKR Lite\nSM\n trades generate payments from market makers and others to whom we route these orders, which are reported in commissions\n. \nOur commissions are geographically diversified. In 2024, 2023, and 2022 we generated 38%, 37% and 37%, respectively, of commissions from operations conducted by our subsidiaries outside the U.S.\n \nCommissions for the current year increased $337 million, or 25%, compared to the prior year, to $1,697 million, driven by higher customer trading volumes in options, stocks and futures. Total customer options and futures contract and stock share volumes increased 32%, 4% and 22%, respectively, from the prior year. Total DARTs for cleared and execution-only customers, for the current year, increased 36% to 2.6 million, compared to 1.9 million for the prior year. Average commission per commissionable order for cleared customers, for the current year, decreased 9% to $2.86, compared to $3.14\n \nfor the prior year, due to smaller order sizes across all products, lower average commissions per order in stocks, options and forex, and greater capture of exchange liquidity rebates passed through to customers.\n‎\n \n\n\n47\nTable of Contents\n \n\n\n \nOther Fees and Services\n \n \nWe earn fee income on services provided to customers, which includes market data fees, risk exposure fees, payments for order flow from exchange-mandated programs, FDIC sweep fees, and other fees and services charged to customers.\n \nOther fees and services, for the current year increased $83 million, or 42%, compared to the prior year, to $280 million, driven by a $54 million increase in risk exposure fees as customers exhibited more risk-on behavior, a $14 million increase in payments for order flow from exchange-mandated programs driven by higher customer trading volume, and a $9 million increase in FDIC sweep fees due to higher customer balances and benchmark interest rates.\n \nOther Income (Loss)\n \n \nOther income consists of foreign exchange gains (losses) from our currency diversification strategy, gains (losses) from principal transactions, gains (losses) from our equity method and other investments, and other revenue not directly attributable to our core business offerings. A discussion of our approach to managing foreign currency exposure is contained in Part II, Item 7A of this Annual Report on Form 10-K entitled “Quantitative and Qualitative Disclosures about Market Risk.”\n \nOther income, for the current year, increased $71 million, compared to the prior year, to a gain of $60 million. This increase was mainly comprised of $65 million related to our currency diversification strategy; $48 million \n from our principal trading and investment activities; and $23 million related to million related to our strategic investment in Up Fintech Holding Limited (“Tiger Brokers”)\n; partially offset by a $48 million loss on positions taken over as customer accommodation due to a technical issue at the New York Stock Exchange that occurred on the morning of June 3, 2024, as previously disclosed; and $16 million related to the remeasurement of our Tax Receivable Agreement liability, payable to Holdings, \nwhich went from a gain of $7 million in the prior year to a loss of $9 million in the current year, primarily due to changes in the Company’s effective tax rates\n.\n \nInterest Income and Interest Expense\n \n \nWe earn interest on margin lending to customers that is secured by marketable securities and currency balances these customers hold with us; from our investments in U.S. and foreign government securities; from borrowing and lending securities; on deposits (in positive interest rate currencies) with banks; and on certain customers’ cash balances in negative rate currencies. We pay interest on customer cash balances (in sufficiently positive interest rate currencies); for borrowing and lending securities; on deposits (in negative interest rate currencies) with banks; and on our borrowings.\n \nNet interest income (interest income less interest expense), for the current year, increased $354 million, or 13%, compared to the prior year, to $3,148 million. The increase in net interest income was driven by higher customer margin loans and customer credit balances, and higher benchmark interest rates.\n \nNet interest income on customer balances, for the current year, increased $497 million, compared to the prior year, driven by a $12.3 billion increase in average customer margin loans, a $9.8 billion increase in average customer credit balances, and an increase in the average federal funds effective rate to 5.14% from 5.02% in the prior year and. See the “Business Environment” section above in this Item 7 for a further discussion about the change in interest rates in the current year. \n \nThe Company measures return on interest-earning assets using net interest margin (“NIM”). NIM is computed by dividing the annualized net interest income by the average interest-earning assets for the period. Interest-earning assets consist of cash and securities segregated for regulatory purposes (including U.S. government securities and \nsecurities purchased under agreements to resell)\n, customer margin loans, securities borrowed, other interest-earning assets (solely firm assets) and customer cash balances swept into FDIC-insured banks as part of our Insured Bank Deposit Sweep Program. Interest-bearing liabilities consist of customer credit balances, securities loaned, and other interest-bearing liabilities.\n \nYields are generally a reflection of benchmark interest rates in each currency in which the Company and its customers hold cash balances. Because a meaningful portion of customer cash and margin loans are denominated in currencies other than the U.S. dollar, changes in U.S. benchmark interest rates do not impact the total amount of segregated cash and securities, customer margin loans and customer credit balances. Furthermore, because interest, when benchmark rates are at sufficiently high levels, is paid only on eligible cash credit balances (i.e., balances over $10 thousand or equivalent, in securities accounts with over $100 thousand in equity, and in smaller accounts at reduced rates), changes in benchmark interest rates are not passed through to the total amount of customer credit balances. Finally, the Company’s policies with respect to currencies with near zero or negative interest rates impact the overall yields on segregated cash and customer credit balances as effective interest rates in those currencies move above or below zero.\n \nWe earn income on securities loaned and borrowed to support customer long and short stock holdings in margin accounts.\n‎\n \n\n\n48\nTable of Contents\n \n\n\n \nA securities lending transaction generates (1) net interest earned on lending a security, which is based on supply and demand for that security, and (2) interest earned on the cash collateral deposited for the loan of that security, which is based on benchmark interest rates. Interest on this collateral is reported as net interest on segregated cash, since cash collateral from securities lending is held in specially-designated bank accounts for the benefit of customers, in accordance with U.S. customer protection rules. Generally, as benchmark interest rates rise, while the overall revenue generated from a securities lending transaction may not change, the portion derived from interest earned on the cash collateral, which is classified as net interest income on “Segregated cash and securities, net” increases, while the portion classified as “Securities borrowed and loaned, net” decreases. \n \nIn the current year, average securities borrowed balances increased 11%, to $5.9 billion, and average securities loaned balances increased 44%, to $13.7 billion, compared to the prior year. Net interest earned from securities lending is affected by the level of demand for securities positions held by our customers that investors are looking to sell short. During the current year, net interest earned from securities lending transactions decreased $184 million, or 67%, compared to the prior year, driven by lower demand for selling stocks short, as the stock market rose steadily in the current year, and by fewer so-called “hard to borrow” stocks industry wide. However, as noted above, the rise in benchmark interest rates has shifted a portion of the interest reported as generated by lending securities to interest income on segregated cash (see further explanation above). It should be noted that securities lending transactions entered into to support customer activity may produce interest income (expense) that is offset by interest expense (income) related to customer balances.\n \nWe estimate that if the interest earned and paid on cash collateral related to our securities lending transactions were included under “Securities borrowed and loaned, net” in the table below, the total net interest income related to our securities lending activities would have been $699 million in the current year, compared to $718 million in the prior year. Such additional interest attributed to our securities lending activities would be reclassified from net interest income on “Segregated cash and securities, net” and “Customer credit balances, net” in the table below, so it would have no effect on our overall net interest income or net interest margin.\n \nOur Stock Yield Enhancement Program provides an opportunity for customers with fully-paid stock to allow us to lend it out. \nWe pay customers a rebate on the cash collateral generally equal to 50% of a market-based rate for lending the shares.\n We place cash and/or U.S. Treasury securities as collateral securing the loans in the customer’s account, which is held in segregated accounts, or at an affiliate acting as collateral agent for the benefit of our customer.\n‎\n \n\n\n49\nTable of Contents\n \n\n\n \nThe table below presents net interest income information corresponding to interest-earning assets and interest-bearing liabilities for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nAverage interest-earning assets\n \n \n \n \n \n \n \n \n \nSegregated cash and securities\n \n$\n 62,117 \n \n$\n 59,582 \n \n$\n 51,644 \nCustomer margin loans\n \n \n 53,503 \n \n \n 41,229 \n \n \n 43,402 \nSecurities borrowed\n \n \n 5,899 \n \n \n 5,315 \n \n \n 3,961 \nOther interest-earning assets\n \n \n 11,180 \n \n \n 10,114 \n \n \n 9,000 \nFDIC sweeps \n1,3\n \n \n 4,214 \n \n \n 3,003 \n \n \n 2,229 \n \n \n$\n 136,913 \n \n$\n 119,242 \n \n$\n 110,235 \n \n \n \n \n \n \n \n \n \n \nAverage interest-bearing liabilities\n \n \n \n \n \n \n \n \n \nCustomer credit balances\n \n$\n 105,840 \n \n$\n 96,081 \n \n$\n 90,172 \nSecurities loaned\n \n \n 13,737 \n \n \n 9,518 \n \n \n 10,095 \nOther interest-bearing liabilities\n \n \n 26 \n \n \n 1 \n \n \n 4 \n \n \n$\n 119,603 \n \n$\n 105,600 \n \n$\n 100,271 \n \n \n \n \n \n \n \n \n \n \nNet Interest income\n \n \n \n \n \n \n \n \n \nSegregated cash and securities, net\n \n$\n 3,024 \n \n$\n2,791\n \n$\n742\nCustomer margin loans \n2\n \n \n 3,012 \n \n \n2,278\n \n \n1,083\nSecurities borrowed and loaned, net \n \n \n 92 \n \n \n276\n \n \n413\nCustomer credit balances, net \n2\n \n \n (3,595)\n \n \n (3,125)\n \n \n (763)\nOther net interest income \n1,3\n \n \n 690 \n \n \n600\n \n \n207\nNet interest income \n3\n \n$\n 3,223 \n \n$\n 2,820 \n \n$\n 1,682 \n \n \n \n \n \n \n \n \n \n \nNet interest margin (\"NIM\")\n \n \n2.35%\n \n \n2.36%\n \n \n1.53%\n \n \n \n \n \n \n \n \n \n \n Annualized Yields\n \n \n \n \n \n \n \n \n \nSegregated cash and securities\n \n \n4.87%\n \n \n4.68%\n \n \n1.44%\nCustomer margin loans\n \n \n5.63%\n \n \n5.53%\n \n \n2.50%\nCustomer credit balances\n \n \n3.40%\n \n \n3.25%\n \n \n0.85%\n___________________________\n \n(1)\nRepresents the average amount of customer cash swept into FDIC-insured banks as part of our Insured Bank Deposit Sweep Program. This item is not recorded in the Company’s consolidated statements of financial condition. Income derived from program deposits is reported in other net interest income in the table above.\n \n(2)\nInterest income and interest expense on customer margin loans and customer credit balances, respectively, are calculated on daily cash balances within each customer’s account on a net basis, which may result in an offset of balances across multiple account segments (e.g., between securities and commodities segments).\n \n(3)\nIncludes income from financial instruments that has the same characteristics as interest, but is reported in other fees and services and other income in the Company’s consolidated statements of comprehensive income. For the years ended December 31, 2024, 2023, and 2022, $28 million, $19 million and $10 million were reported in other fees and services, respectively. For the years ended December 31, 2024, 2023, and 2022, $47 million, $7 million and $4 million were reported in other income, respectively.\n \n‎\n \n\n\n50\nTable of Contents\n \n\n\n \nNon\n-\nInterest Expenses\n \nNon-interest expenses, for the current year, increased $219 million, or 17%, compared to the prior year, to $1,490 million, mainly due to a $103 million increase in general and administrative expenses; a $61 million increase in execution, clearing and distribution fees; and a $47 million increase in employee compensation and benefits. As a percentage of total net revenues, non-interest expenses were 29% for both the current year and the prior year.\n \nExecution, Clearing\n and Distribution Fees\n \n \nExecution, clearing and distribution fees include the costs of executing and clearing trades, net of liquidity rebates received from various exchanges and market centers, as well as regulatory fees and market data fees. Execution fees are paid primarily to electronic exchanges and market centers on which we trade. Clearing fees are paid to clearing houses and clearing agents. Market data fees, which are associated with market data revenue included in other fees and services, are paid to third parties to receive streaming price quotes and related information. \n \nExecution, clearing and distribution fees, for the current year, increased $61 million, or 16%, compared to the prior year, to $447 million, \nprimarily driven by (1) a $55 million increase in regulatory fees due to an increase in the SEC fee rate effective May 22, 2024,\n \na\n new FINRA Consolidated Audit Trail (“CAT”) fee initiated in October 2024, and \nhigher customer trading volumes\n; and (2) a $20 million increase in clearing and depository fees due to \nhigher customer trading volumes\n; partially offset by (3) a $19 million decrease in exchange fees due to greater capture of liquidity rebates from certain exchanges. As a percentage of total net revenues, execution, clearing and distribution fees were 9% for both the current year and the prior year.\n \nEmployee Compensation and Benefits\n \nEmployee compensation and benefits include salaries, bonuses and other incentive compensation plans, group insurance, contributions to benefit programs and other related employee costs. \n \nEmployee compensation and benefits expenses, for the current year, increased $47\n \nmillion, or 9%, compared to the prior year, to $574\n \nmillion, associated with a combination of staffing increases and inflation. The average number of employees increased 2% to 2,960\n \nfor the current year, compared to 2,892\n \nfor the prior year. We continued to add staff worldwide to support our business expansion. As we continue to grow, our focus on automation has allowed us to maintain a relatively small staff. As a percentage of total net revenues, employee compensation and benefits expenses were 11%\n \nfor the current year and 12% for the prior year. Employee compensation and benefits expenses as a percentage of adjusted net revenues were 11% for the current year and 12% for the prior year.\n \nOccupancy, Depreciation and Amortization\n \nOccupancy expenses consist primarily of rental payments on office and data center leases and related occupancy costs, such as utilities. Depreciation and amortization expenses result from the depreciation of fixed assets, such as computing and communications hardware, as well as amortization of leasehold improvements and capitalized in\n-\nhouse software development. \n \nOccupancy, depreciation and amortization expenses, for the current year, increased $2\n \nmillion, or 2%, compared to the prior year, to $101\n \nmillion, mainly due to higher costs related to the expansion of our physical space for both offices and data centers. As a percentage of total net revenues, occupancy, depreciation and amortization expenses were 2%\n \nfor both the current year and the prior year.\n \nCommunications\n \nCommunications expenses consist primarily of the cost of voice and data telecommunications lines supporting our business, including connectivity to exchanges and market centers around the world.\n \nCommunications expenses, for the current year, decreased $2 million, or 5%, compared to the prior year, to $39 million. As a percentage of total net revenues, communications expenses were 1%\n \nfor both the current year and the prior year.\n \nGeneral and Administrative\n \nGeneral and administrative expenses consist primarily of advertising; professional services expenses, such as legal and audit work; legal and regulatory matters; and other operating expenses.\n \nGeneral and administrative expenses, for the current year, increased $103\n \nmillion, or 49%, compared to the prior year, to $314\n \nmillion, primarily due to\n a $57 million increase related to legal and regulatory matters, a $20 million increase in advertising expenses, and a one-time charge of $12 million related to the consolidation of our European subsidiaries. \nAs a percentage of total net revenues, general and administrative expenses were 6% for the current year and 5% for the prior year.\n\n\n51\nTable of Contents\n \n\n\n \nCustomer Bad Debt\n \nCustomer bad debt expense consists primarily of losses incurred by customers in excess of their assets with us, net of amounts recovered by us. Customer bad debt expense, for the current year increased $8 million, or 114%, compared to the prior year, to $15 million\n.\n \nIncome Tax Expense\n \nWe pay U.S. federal, state and local income taxes on our taxable income, which is proportional to the percentage we own of IBG LLC. Also, our operating subsidiaries are subject to income tax in the respective jurisdictions in which they operate. \n \nIncome tax expense, for the current year, increased $31\n \nmillion, or 12%,\n \ncompared to the prior year,\n to $288\n \nmillion, \nprimarily due to (1) higher income before taxes at our operating subsidiaries outside the U.S. and higher income tax rates in Europe following the adoption of the minimum effective tax rate of 15% on January 1, 2024; (2) higher income before income taxes subject to U.S. income tax at IBG, Inc.; and (3) IBG, Inc.’s higher average ownership percentage of IBG LLC, which rose from 25.0% to 25.6%; partially offset by (4) an $11 million income tax benefit in the current year due to the remeasurement of deferred tax assets related to the step-up in basis arising from the acquisition of interests in IBG LLC, primarily due to changes in the Company’s effective tax rates.\n \nThe table below presents information about our income tax expense for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n(in millions, except %)\n \n \n \n \n \n \n \n \n \nConsolidated\n \n \n \n \n \n \n \n \nConsolidated income before income taxes\n$\n 3,695\n \n$\n 3,069\n \n$\n 1,998\nIBG, Inc. stand-alone income before income taxes and eliminations\n \n (18)\n \n \n 4\n \n \n 2\nOperating subsidiaries income before income taxes\n$\n 3,713\n \n$\n 3,065\n \n$\n 1,996\n \n \n \n \n \n \n \n \n \nOperating subsidiaries\n \n \n \n \n \n \n \n \nIncome before income taxes\n$\n 3,713\n \n$\n 3,065\n \n$\n 1,996\nIncome tax expense\n \n 142\n \n \n 115\n \n \n 69\nNet income available to members\n$\n 3,571\n \n$\n 2,950\n \n$\n 1,927\n \n \n \n \n \n \n \n \n \nIBG, Inc.\n \n \n \n \n \n \n \n \nAverage ownership percentage in IBG LLC\n \n25.6%\n \n \n25.0%\n \n \n24.0%\nNet income available to IBG, Inc. from operating subsidiaries\n$\n 915\n \n$\n 737\n \n$\n 463\nIBG, Inc. stand-alone income before income taxes\n \n (14)\n \n \n 5\n \n \n 4\nIncome before income taxes\n \n 901\n \n \n 742\n \n \n 467\nIncome tax expense\n \n 146\n \n \n 142\n \n \n 87\nNet income available to common stockholders\n$\n 755\n \n$\n 600\n \n$\n 380\n \n \n \n \n \n \n \n \n \nConsolidated income tax expense\n \n \n \n \n \n \n \n \nIncome tax expense attributable to operating subsidiaries\n$\n 142\n \n$\n 115\n \n$\n 69\nIncome tax expense attributable to IBG, Inc.\n \n 146\n \n \n 142\n \n \n 87\nConsolidated income tax expense\n$\n 288\n \n$\n 257\n \n$\n 156\n \n \n \n \n \nOperating Results\n \nIncome before income taxes, for the current year, increased $626 million, or 20%, compared to the prior year, to $3,695 million. Pretax profit margin was 71% for both the current year and the prior year. \n \nComparing our operating results for the current year to the prior year using non-GAAP financial measures, adjusted net revenues were $5,257 million, up 20%; adjusted income before income taxes was $3,767 million, up 21%; and adjusted pre-tax profit margin was 72% for the current year and 71% for the prior year. See the “Non-GAAP Financial Measures” section below in this Item 7 for additional details.\n \n\n\n52\nTable of Contents\n \n\n\n \nNoncontrolling Interest\n \nWe are the sole managing member of IBG LLC and, as such, operate and control all of the business and affairs of IBG LLC and its subsidiaries and consolidate IBG LLC’s financial results into our financial statements. As of December 31, 2024, we held approximately 25.8% ownership interest in IBG LLC. Holdings holds approximately 74.2% ownership interest in IBG LLC. We reflect Holdings’ ownership as a noncontrolling interest in our consolidated statements of financial condition, consolidated statements of comprehensive income, consolidated statements of changes in equity and consolidated statements of cash flows. Our share of IBG LLC’s net income, excluding Holdings’ noncontrolling interest, for the current year was approximately 25.6%, compared to approximately 25.0% for\n the prior\n year.\n \nYear Ended December 31, 2023 compared to the Year Ended December 31, 2022\n \nFor a discussion of changes for the year ended December 31, 2023 compared to the Year Ended December 31, 2022 refer to the Annual Report on Form 10-K filed with the SEC on February 27, 2024. \n \n‎\n \n\n\n53\nTable of Contents\n \n\n\n \nNon-GAAP Financial Measures\n \nWe use certain non-GAAP financial measures as additional measures to enhance the understanding of our financial results. These non-GAAP financial measures include adjusted net revenues, adjusted income before income taxes, adjusted net income available for common stockholders, and adjusted diluted earnings per share (“EPS”). We believe that these non-GAAP financial measures are important measures of our financial performance because they exclude certain items that may not be indicative of our core operating results and business outlook. \nWe believe these non-GAAP financial measures\n are useful to investors and analysts in evaluating the operating performance of the business.\n \n\nWe define adjusted net revenues as net revenues adjusted to remove the effect of our currency diversification strategy, our net mark-to-market gains (losses) on investments, and the remeasurement of our Tax Receivable Agreement (“TRA”) liability.\n \n\nWe define adjusted income before income taxes as income before income taxes adjusted to remove the effect of our currency diversification strategy, our net mark-to-market gains (losses) on investments, the remeasurement of our TRA liability, and unusual bad debt expense. \n \n\nWe define adjusted net income available to common stockholders as net income available for common stockholders adjusted to remove the after-tax effects attributable to IBG, Inc. of our currency diversification strategy, our net mark-to-market gains (losses) on investments, the remeasurement of our TRA liability, unusual bad debt expense, and the remeasurement of certain deferred tax assets.\n \n\nWe define adjusted diluted EPS as adjusted net income available for common stockholders divided by the diluted weighted average number of shares outstanding for the period.\n \nMark-to-market on investments represents the net mark-to-market gains (losses) on investments in equity securities that do not qualify for equity method accounting, which are measured at fair value; on our U.S. government and municipal securities portfolios, which are typically held to maturity; and on certain other investments, including equity securities taken over by the Company as a customer accommodation following unusual market events or technical issues. In the event an investment is sold prior to maturity, accumulated gains (losses) are realized and previously accumulated non-GAAP adjustments are reversed in the period of sale.\n \nRemeasurement of our TRA liability represents the change in the amount payable to IBG Holdings LLC under the TRA, primarily due to changes in the Company’s effective tax rates, which is related to the remeasurement of the deferred tax assets described below. For further information refer to Note 4 – Equity and Earnings per Share under Part II, Item 8 – Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n \nUnusual bad debt expense consists of a credit loss on a loan not related to margin lending.\n \nRemeasurement of certain deferred tax assets represents the change in the unamortized balance of deferred tax assets related to the step-up in basis arising from the acquisition of interests in IBG LLC, primarily due to changes in the Company’s effective tax rates. For further information refer to Note 4 – Equity and Earnings per Share under Part II, Item 8 – Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n \nWe also report compensation and benefits expenses as a percentage of adjusted net revenues, as we believe this measure is useful to investors and analysts in evaluating the growth of our workforce in relation to the growth of our core revenues. \n \nThese non-GAAP financial measures should be considered in addition to, rather than as a substitute for, measures of financial performance prepared in accordance with GAAP\n1\n.\n___________________________\n1\n Refers to generally accepted accounting principles in the United States.\n‎\n \n\n\n54\nTable of Contents\n \n\n\n \nThe tables below present a reconciliation of consolidated GAAP to non-GAAP financial measures for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \nAdjusted net revenues (in millions)\n \n \n \n \n \n \n \n \n \nNet revenues - GAAP\n \n$\n5,185\n \n$\n4,340\n \n$\n3,067\nNon-GAAP adjustments\n \n \n \n \n \n \n \n \n \nCurrency diversification strategy, net\n \n \n15\n \n \n80\n \n \n100\nMark-to-market on investments\n \n \n48\n \n \n (46)\n \n \n 52\nRemeasurement of TRA liability\n \n \n 9\n \n \n (7)\n \n \n (6)\nTotal non-GAAP adjustments\n \n \n72\n \n \n27\n \n \n146\nAdjusted net revenues\n \n$\n5,257\n \n$\n4,367\n \n$\n3,213\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAdjusted income before income taxes (in millions)\n \n \n \n \n \n \n \n \n \nIncome before income taxes - GAAP\n \n$\n3,695\n \n$\n3,069\n \n$\n1,998\nNon-GAAP adjustments\n \n \n \n \n \n \n \n \n \nCurrency diversification strategy, net\n \n \n15\n \n \n80\n \n \n100\nMark-to-market on investments\n \n \n 48\n \n \n (46)\n \n \n 52\nRemeasurement of TRA liability\n \n \n 9\n \n \n (7)\n \n \n (6)\nBad debt expense\n \n \n -\n \n \n 5\n \n \n -\nTotal non-GAAP adjustments\n \n \n 72\n \n \n 32\n \n \n 146\nAdjusted income before income taxes\n \n$\n3,767\n \n$\n3,101\n \n$\n2,144\n \n \n \n \n \n \n \n \n \n \nAdjusted pre-tax profit margin\n \n \n72%\n \n \n71%\n \n \n67%\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAdjusted net income available for common stockholders (in millions)\n \n \n \n \n \n \n \n \n \nNet income available for common stockholders - GAAP\n \n$\n755\n \n$\n600\n \n$\n380\nNon-GAAP adjustments\n \n \n \n \n \n \n \n \n \nCurrency diversification strategy, net\n \n \n 4\n \n \n20\n \n \n24\nMark-to-market on investments\n \n \n 12\n \n \n (12)\n \n \n 13\nRemeasurement of TRA liability\n \n \n 9\n \n \n (7)\n \n \n (6)\nBad debt expense\n \n \n -\n \n \n 1\n \n \n -\nIncome tax effect of above adjustments \n1\n \n \n (4)\n \n \n(2)\n \n \n(7)\nRemeasurement of deferred income taxes\n \n \n (11)\n \n \n 7\n \n \n 7\nTotal non-GAAP adjustments\n \n \n 11\n \n \n 8\n \n \n 30\nAdjusted net income available for common stockholders\n \n$\n766\n \n$\n608\n \n$\n410\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAdjusted diluted EPS (in dollars, except share amounts)\n \n \n \n \n \n \n \n \n \nDiluted EPS - GAAP\n \n$\n6.93\n \n$\n5.67\n \n$\n3.75\nNon-GAAP adjustments\n \n \n \n \n \n \n \n \n \nCurrency diversification strategy, net\n \n \n0.04\n \n \n0.19\n \n \n0.24\nMark-to-market on investments\n \n \n0.11\n \n \n(0.11)\n \n \n0.12\nRemeasurement of TRA liability\n \n \n0.08\n \n \n(0.07)\n \n \n(0.06)\nBad debt expense\n \n \n0.00\n \n \n0.01\n \n \n0.00\nIncome tax effect of above adjustments \n1\n \n \n(0.03)\n \n \n(0.01)\n \n \n(0.07)\nRemeasurement of deferred income taxes\n \n \n(0.10)\n \n \n0.07\n \n \n0.07\nTotal non-GAAP adjustments\n \n \n0.10\n \n \n0.08\n \n \n0.30\nAdjusted diluted EPS\n \n$\n7.03\n \n$\n5.75\n \n$\n4.05\n \n \n \n \n \n \n \n \n \n \nDiluted weighted average common shares outstanding\n \n \n109,002,938\n \n \n105,846,877\n \n \n101,299,609\n \n \n \nNote: Amounts may not add due to rounding.\n_________________________\n1 \nThe income tax effect is estimated using the statutory income tax rates applicable to the Company.\n‎\n \n\n\n55\nTable of Contents\n \n\n\n \n \nLiquidity and Capital Resources\n \nWe maintain a highly liquid balance sheet. The majority of our assets consists of investments of customer funds, collateralized receivables arising from customer\n-\nrelated and proprietary securities transactions, and exchange\n-\nlisted marketable securities, which are marked\n-\nto\n-\nmarket daily. Collateralized receivables consist primarily of customer margin loans, securities borrowed, and securities purchased under agreements to resell. As of December 31, 2024, total assets were $150.1 billion of which approximately $148.9 billion,\n \nor 99.2%, were considered liquid.\n \nDecisions on the allocation of capital are based upon, among other things, prudent risk management guidelines, potential liquidity and cash flow needs for current and future business activities, regulatory capital requirements, and projected profitability. Our Treasury department, Market Risk Committee, Enterprise Risk Management department and other management control groups assist in evaluating, monitoring and controlling the impact that our business activities have on our financial condition, liquidity and capital structure. The objective of these policies is to support our business strategies while ensuring ongoing and sufficient liquidity. Our significant capital comprises an aggregate across our many regulated subsidiaries, and in addition to supporting our current business and future expansion plans we believe this financial strength provides our customers with a source of confidence.\n \nDaily monitoring of liquidity needs and available collateral levels is undertaken to help ensure that an appropriate liquidity cushion, in the form of cash and unpledged collateral, is maintained at all times. We actively manage our excess liquidity and maintain significant borrowing capabilities through the securities lending markets and in the form of credit facilities with banks. As a general practice, we maintain sufficient levels of cash on hand to provide us with a buffer should we need immediately available funds for any reason. In addition, pursuant to our liquidity risk management plan we perform periodic liquidity stress tests, which are designed to identify and reserve liquid assets that would be available under market or idiosyncratic stress events. Based on our current level of operations, we believe our cash flows from operations, available cash and available borrowings will be adequate to meet our future liquidity needs for more than the next twelve months.\n \nAs of December 31, 2024, liability balances in connection with securities loaned and payables to customers were higher than the monthly average balances during the current year. Short-term borrowing balance was lower than the average monthly balance during the current year. \n \nCash and cash equivalents held by our non\n-\nU.S. operating \nsubsidiaries\n as of December 31, 2024 were $1,513 million ($1,625 million as of December 31, 2023). These funds are primarily intended to finance each individual operating \nsubsidiary\n’s local operations, and thus would not be available to fund U.S. domestic operations unless repatriated through payment of dividends to IBG LLC. As of December 31, 2024, we had no intention to repatriate any amounts from non\n-\nU.S. operating \nsubsidiaries\n. With the enactment of the U.S. Tax Cuts and Jobs Act on December 22, 2017, we recognized a liability for the one-time transition tax on deemed repatriation of earnings of some of our foreign subsidiaries for the year ended December 31, 2017. As a result, in the event dividends were to be paid to the Company in the future by a non\n-\nU.S. operating \nsubsidiaries\n, the Company would not be required to accrue and pay income taxes on such dividends, except for foreign taxes in the form of dividend withholding tax, and in connection with accumulated other comprehensive income/loss from currency exchange rate changes not previously taxed in the U.S., if any, imposed on the recipient of the distribution or dividend distribution tax imposed on the payor of the distribution.\n \nHistorically, our consolidated equity has consisted primarily of accumulated retained earnings, which to date have been sufficient to fund our operations and growth. Our consolidated equity increased 17% to $16.6 billion as of December 31, 2024, from $14.1 billion as of December 31, 2023. This increase is attributable to total comprehensive income, partially offset by distributions and dividends paid during 2024.\n \nCash Flows\n \n \nThe table below presents our cash flows from operating activities, investing activities and financing activities for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nNet cash provided by operating activities\n \n$\n 8,724\n \n$\n 4,544\n \n$\n 3,968\nNet cash used in investing activities\n \n \n (44)\n \n \n (52)\n \n \n (67)\nNet cash used in financing activities\n \n \n (833)\n \n \n (624)\n \n \n (470)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n \n \n (207)\n \n \n 122\n \n \n (111)\nIncrease in cash, cash equivalents, and restricted cash\n \n$\n 7,640\n \n$\n 3,990\n \n$\n 3,320\n \n \n \n \n \n\n\n56\nTable of Contents\n \n\n\n \nOur cash, cash equivalents, and restricted cash (i.e., cash and cash equivalents that are subject to withdrawal or usage restrictions) increased by $7,640 million to $40.2 billion for the year ended December31, 2024.\n \nOperating Activities\n \nOur cash flows from operating activities are largely a reflection of the changes in customer credit and margin loan balances. We raised $8.7 billion in net cash from operating activities mainly driven by customer credit balances which increased $14.3 billion, investments in securities segregated for regulatory purposes which decreased $7.5 billion, and securities loaned which increased $4.9 billion; partially offset by customer margin loans which increased $20.0 billion.\n \nInvesting Activities\n \nOur cash flows from investing activities are primarily related to other investments, capitalized internal software development, purchases and sales of memberships, trading rights and shares at exchanges where we trade, and strategic investments where such investments may enable us to offer better execution alternatives to our current and prospective customers, allow us to influence exchanges to provide competing products at better prices using sophisticated technology, or enable us to acquire either technology or customers faster than we could develop them on our own. We used net cash of $44 million in our investing activities primarily for purchases of property, equipment, and intangible assets and other investments.\n \nFinancing Activities\n \nOur cash flows from financing activities are comprised of short-term borrowings, capital transactions, and payments made to Holdings under the Tax Receivable Agreement. Short-term borrowings from banks are part of our daily cash management in support of operating activities. Capital transactions consist primarily of quarterly dividends paid to common stockholders and related distributions paid to Holdings. We used net cash of $833 million in our financing activities, primarily for dividends paid to common stockholders and proportionate distributions to noncontrolling interests.\n \nYear Ended December 31, 2023: \n \nFor a discussion of changes in cash flows for the year ended December 31, 2023 refer to our Annual Report on Form 10-K filed with the SEC on February 27, 2024. \n \nYear Ended December 31, 2022:\n \nFor a discussion of changes in cash flows for the year ended December 31, 2022 refer to our Annual Report on Form 10-K filed with the SEC on February 24, 2023. \n \nRegulatory Capital Requirements \n \nAs of December 31, 2024, all operating \nsubsidiaries\n were in compliance with their respective regulatory capital requirements. For additional information regarding our regulatory capital requirements see Note 16 – “Regulatory Requirements” to the audited consolidated financial statements in Part II, Item 8 of this Annual Report on Form 10\n-\nK.\n \nCapital Expenditures\n \nOur capital expenditures are comprised of compensation costs of our software engineering staff for development of software for internal use and expenditures for computer, networking and communications hardware, and leasehold improvements. These expenditure items are reported as property, equipment, and intangible assets. Capital expenditures for property, equipment, and intangible assets were approximately $49\n million\n, $49 million and $69 million for the three years ended December 31, 2024, 2023, and 2022, respectively. In the future, we plan to meet capital expenditure needs with cash from operations and cash on hand, as we continue our focus on technology infrastructure initiatives to further enhance our competitive position. In response to changing economic conditions, we believe we have the flexibility to modify our capital expenditures by adjusting them (either upward or downward) to match our actual performance. If we pursue any additional strategic acquisitions, we may incur additional capital expenditures.\n‎\n \n\n\n57\nTable of Contents\n \n\n\n \nContractual Obligations Summary\n \nOur contractual obligations principally include obligations associated with our outstanding indebtedness and interest payments as of December 31, 2024. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPayments Due by Year\n \n \nTotal\n \n2025-2026\n \n2027-2028\n \nThereafter\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nPayable to Holdings under Tax Receivable Agreement \n(1)\n \n$\n195\n \n$\n28\n \n$\n28\n \n$\n139\nOperating leases \n \n \n134\n \n \n57\n \n \n38\n \n \n39\nTransition Tax liability \n(2)\n \n \n18\n \n \n18\n \n \n -\n \n \n -\nTotal contractual cash obligations \n \n$\n347\n \n$\n103\n \n$\n66\n \n$\n178\n___________________________\n \n(1)\nAs of December 31, 2024, contractual amounts owed under the Tax Receivable Agreement of $195 million have been recorded in payable to affiliate in the consolidated financial statements, representing management’s best estimate of the amounts currently expected to be owed under the Tax Receivable Agreement. Through December 31, 2024, approximately $293 million of cumulative cash payments have been made.\n \n(2)\nThe Tax Act implemented a \nmodified territorial tax system that includes a one-time transition tax on deemed repatriated earnings of foreign subsidiaries to be paid over an eight-year period starting in 2018. We believe this tax will not have a material impact on our liquidity.\n \nSeasonality\n \nOur businesses are subject to seasonal fluctuations, reflecting varying numbers of market participants at times during the year, varying numbers of trading days from quarter\n-\nto\n-\nquarter, and declines in trading activity due to holidays. Typical seasonal trends may be superseded by market or world events, which can have a significant impact on prices and trading volume.\n \nInflation\n \nAlthough we cannot accurately anticipate the effects of inflation on our operations, we believe that for the past several years inflation may have indirectly had a material impact on our results of operations. Inflation has been one of the factors driving our employee compensation and benefits expenses higher during the current period, although as a percentage of net revenues these expenses remain stable. In an effort to stem inflation, central banks have increased benchmark interest rates in most currencies, which has contributed to our net interest income. Inflation may also be a contributing factor to general uncertainty in the markets in the foreseeable future. Statements about future inflation are subject to the risk that actual inflation and its effects may differ, possibly materially, due to, among other things, changes in economic growth, impact of supply chain disruptions, unemployment and consumer demand.\n \nInvestments in U.S. Government Securities\n \nWe invest in U.S. government securities to satisfy U.S. regulatory requirements. As a broker-dealer, unlike banks, we are required to mark these investments to market even though we intend to hold them to maturity. Sudden increases (decreases) in interest rates will cause mark-to-market losses (gains) on these securities, which are recovered (eliminated) if we hold them to maturity, as currently intended. As of December 31, 2024, substantially all of our U.S. government securities had maturities within three months. The impact of changes in interest rates is further described in Part II, Item 7A of this Annual Report on Form 10-K entitled “Quantitative and Qualitative Disclosures about Market Risk.”\n \nStrategic Investments and Acquisitions\n \nWe regularly evaluate potential strategic investments and acquisitions. We hold strategic investments in certain electronic trading exchanges, including BOX Options Exchange, LLC. We also hold strategic investments in certain businesses, including Zero Hash Holdings Ltd., a crypto-service provider, in which we held a beneficial ownership interest of 31.6%, as of December 31, 2024. \n \nWe intend to continue making acquisitions on an opportunistic basis, generally only when the acquisition candidate will, in our opinion, enable us to offer better execution alternatives to our current and prospective customers, allow us to influence exchanges to provide competing products at better prices using sophisticated technology, or enable us to acquire either technology or customers faster than we could develop them on our own. \n \nAs of December 31, 2024, there were no definitive agreements with respect to any material acquisition.\n\n\n58\nTable of Contents\n \n\n\n \nCertain Information Concerning Off\n-\nBalance\n-\nSheet Arrangements\n \nWe may be exposed to a risk of loss not reflected in our consolidated financial statements for futures products, which represent our obligations to settle at contracted prices, and which may require us to repurchase or sell in the market at prevailing prices. Accordingly, these transactions result in off\n-\nbalance sheet risk, as our cost to liquidate such futures contracts may exceed the amounts reported in our consolidated statements of financial condition.\n \nCritical Accounting Policies and Estimates\n \nOur consolidated financial statements have been prepared in accordance with U.S. GAAP, which requires management to make estimates and assumptions that affect the reported amounts and disclosures in the consolidated financial statements and accompanying notes. \nThese estimates and assumptions are based on judgment and the best available information at the time. \nTherefore, actual results could differ materially from those estimates. We believe that the critical policies listed below represent the most significant estimates used in the preparation of our consolidated financial statements. See Note 2 – “Significant Accounting Policies” to the audited consolidated financial statements for a summary of our significant accounting policies in Part II, Item 8 of this Annual Report on Form 10-K.\n \nContingencies\n \nOur policy is to estimate and accrue for potential losses that may arise out of litigation and regulatory proceedings, to the extent that such losses are probable and can be estimated. Significant judgment is required in making these estimates and our final liabilities may ultimately be materially different. Our total liability accrued with respect to litigation and regulatory proceedings is determined on a case by case basis and represents an estimate of probable losses based on, among other factors, the progress of each case, our experience with and industry experience with similar cases and the opinions and views of internal and external legal counsel. Given the inherent difficulty of predicting the outcome of litigation and regulatory matters, particularly in cases or proceedings in which substantial or indeterminate damages or fines are sought, or where cases or proceedings are in the early stages, we cannot estimate losses or ranges of losses for cases or proceedings where there is only a reasonable possibility that a loss may be incurred.\n \nIncome\n \nTaxes\n \n \nOur income tax expense, deferred tax assets and liabilities, and reserves for unrecognized tax benefits are based on enacted tax laws and reflect management’s best assessment of estimated future taxes to be paid. We are subject to income taxes in both the U.S. and numerous foreign jurisdictions. Determining income tax expense requires significant judgment and estimates.\n \nDeferred income tax assets and liabilities arise from temporary differences between the tax and financial statement recognition of the underlying assets and liabilities. In evaluating our ability to recover our deferred tax assets within the jurisdictions from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax\n-\nplanning strategies, and results of recent operations. \n \nIn projecting future taxable income, historical results are adjusted for changes in accounting policies and incorporate assumptions including the amount of future state, federal and foreign pre-tax operating income, the reversal of temporary differences, and the implementation of feasible and prudent tax\n-\nplanning strategies. These assumptions require significant judgment about the forecasts of future taxable income and are consistent with the plans and estimates we are using to manage the underlying businesses. In evaluating the objective evidence that historical results provide, three years of cumulative operating income (loss) are considered. Deferred income taxes have not been provided for U.S. tax liabilities or for additional foreign taxes on the unremitted earnings of foreign subsidiaries that have been indefinitely reinvested.\n \nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. Changes in tax laws and rates could also affect recorded deferred tax assets and liabilities in the future. For example, on December 15, 2022, the EU formally adopted the EU’s Pillar Two Directive, effective January 1, 2024, which provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Cooperation and Development (“OECD”) Pillar Two Framework. A significant number of other countries have either already or are expected to implement similar legislation with varying effective dates. We record tax liabilities in accordance with Financial Accounting Standards Board (“FASB”) ASC Topic 740 and adjust these liabilities when management’s judgment changes as a result of the evaluation of new information not previously available. Because of the complexity of some of these uncertainties, the ultimate resolution may result in payments that are different from the current estimates of these tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which new information becomes available.\n \nWe recognize that a tax benefit from an uncertain tax position may be recognized only when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, based on the technical merits. A tax position that meets this standard is measured at the largest amount of benefit that will more likely than not be realized on settlement.\n‎\n \n\n\n59\nTable of Contents\n \n\n\n \nAccounting\n \nPronouncements Issued but Not Yet Adopted\n \nFor additional information regarding FASB Accounting Standards Updates (“ASU”s) that have been issued but not yet adopted and that may impact the Company, refer to Note 2 – “Significant Accounting Policies” to the audited consolidated financial statements in Part II, Item 8 of this Annual Report on form 10-K.\n‎\n \n\n\n60\nTable of Contents\n \n\n\n \n \n \n \nITEM 7A.  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n \nWe are exposed to various market risks. Our exposures to market risks arise from assumptions built into our pricing models, equity price risk, foreign currency exchange rate fluctuations related to our international operations, changes in interest rates and risks relating to the extension of margin credit to our customers.\n \nMarket risk refers to the risk that a change in the level of one or more market prices, rates, indices, implied volatilities (the price volatility of the underlying instrument imputed from option prices), correlations or other market factors, such as market liquidity, will result in losses for a position or portfolio. Generally, we incur trading\n-\nrelated market risk as a result of our remaining market making activities, where the substantial majority of our Value\n-\nat\n-\nRisk (“VaR”) for market risk exposures is generated. In addition, we incur non\n-\ntrading\n-\nrelated market risk primarily from investment activities and from foreign currency exposure held in the equity of our foreign subsidiaries, i.e., our non\n-\nU.S. brokerage subsidiaries and information technology subsidiaries, and held to meet target balances in our currency diversification strategy.\n \nWe use various risk management tools in managing our market risk, which are embedded in our real\n-\ntime market making systems. We employ certain hedging and risk management techniques to protect us from a severe market dislocation. Our risk management policies are developed and implemented by our Steering Committee, which is chaired by our Chief Executive Officer and comprised of senior executives of our various operating subsidiaries. The strategy of our remaining market making activities is to calculate quotes a few seconds ahead of the market and execute small trades at a tiny but favorable differential as a result. This strategy is made possible by our proprietary pricing model, which evaluates and monitors the risks inherent in our portfolio, assimilates external market data and reevaluates the outstanding quotes in our portfolio many times per second. Our model automatically rebalances our positions throughout each trading day to manage risk exposures on our options and futures positions and the underlying securities and will price the increased risk that a position would add to the overall portfolio into the bid and offer prices we post. Under risk management policies implemented and monitored primarily through our computer systems, reports to management, including risk profiles, profit and loss analysis and trading performance, are prepared on a real\n-\ntime basis as well as daily and periodical bases. Although our remaining market making activities are completely automated, the trading process and our risk are monitored by a team of individuals who, in real time, observe various risk parameters of our consolidated positions. Our assets and liabilities are marked\n-\nto\n-\nmarket daily for financial reporting purposes and re\n-\nvalued continuously throughout the trading day for risk management and asset/liability management purposes.\n \nWe use a covariant VaR methodology to measure, monitor and review the market risk of our market making portfolios, with the exception of fixed income products, and our currency exposures. The risk of fixed income products, which comprise primarily U.S. government securities, is measured using a stress test.\n \nPricing Model Exposure\n \nAs described above, our proprietary pricing model, which continuously evaluates and monitors the risks inherent in our portfolio, assimilates external market data and reevaluates the outstanding quotes in our entire portfolio many times per second. Certain aspects of the model rely on historical prices of securities. If the behavior of price movements of individual securities diverges substantially from what their historical behavior would predict, we might incur trading losses. We attempt to limit such risks by diversifying our portfolio across many different options, futures and underlying securities and avoiding concentrations of positions based on the same underlying security. Historically, our losses from these events have been immaterial in comparison to our annual trading profits.\n \nForeign Currency Exposure\n \nAs a result of our international activities and accumulated earnings in our non-U.S. subsidiaries, our income and equity are exposed to fluctuations in foreign exchange rates. For example, our non-U.S. subsidiaries are exposed to foreign exchange risks as described below:\n \n\nSome of our non-U.S. subsidiaries \nsupport customer transactions in financial instruments, carry bank balances, and borrow and lend securities in various currencies in their regular course of business. At the end of each accounting period, these non-U.S. subsidiaries’ assets and liabilities are revalued into their respective functional currencies for presentation in their financial statements. The resulting foreign currency gains or losses are reported in their income statements and, as translated into U.S. dollars for U.S. GAAP purposes, in our consolidated statements of comprehensive income, as a component of “Other income.”\n \n\nThese non-U.S. subsidiaries’ financial statements are presented in their respective functional currencies, as noted above. For U.S. GAAP purposes, at the end of each accounting period, each non-U.S. subsidiary’s equity is translated at the then prevailing exchange rate into U.S. dollars and the resulting translation gain or loss is reported as OCI in our consolidated statements of financial condition and consolidated statements of comprehensive income.\n \nBy periodically converting currency balances into functional currency, we substantially reduce the foreign currency exposures for each of these non-U.S. subsidiaries, which minimizes the impact of exchange rate changes to its income statement. However, historically, we \n\n\n61\nTable of Contents\n \n\n\nhave taken the approach of not hedging our consolidated foreign currency exposures to the U.S. dollar, based on the notion that the cost of constantly hedging over the years would amount to more than the random impact of rate changes on our non\n-\nU.S. dollar balances.\n \nInstead, because we conduct business in many countries and many currencies and because we consider ourselves a global enterprise based in a diversified basket of currencies rather than a U.S. dollar-based company, we actively manage our global currency exposure by maintaining our equity in GLOBALs, a basket of currencies. Our risk management systems incorporate cash forex to hedge our currency exposure at little or no cost. \nCurrency spot positions entered into as part of our currency diversification strategy are held by the parent holding company, IBG LLC.\n \nThe U.S. dollar value of the GLOBAL decreased 1.45% as of December 31, 2024 compared to December 31, 2023. As of December 31, 2024, approximately 23% of our equity was denominated in currencies other than the U.S. dollar.\n \nThe effects of our currency diversification strategy appear in two places in the consolidated financial statements: (1) as a component of “Other income” in the consolidated statements of comprehensive income and (2) as OCI in the consolidated statements of financial condition and the consolidated statements of comprehensive income. The full effect of the GLOBAL is captured in the consolidated statements of comprehensive income.\n \nThe table below presents a comparison of the U.S. dollar equivalent of the GLOBAL for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAs of 12/31/2023\n \nAs of 12/31/2024\n \n \n \n \n \n \n \nGLOBAL in\n \n% of\nNet Equity\n \n \nGLOBAL in\n \n% of\nNet Equity\nCHANGE in\nCurrency\n \nComposition\nFX Rate\nUSD Equiv.\n \nComp.\n(in USD millions)\nFX Rate\nUSD Equiv.\n \nComp.\n(in USD millions)\n% of Comp.\nUSD\n \n0.72\n \n1.0000\n \n \n0.720\n \n75.5%\n \n$\n 10,619 \n \n1.0000\n \n \n0.720\n \n76.6%\n \n$\n 12,714 \n \n1.1%\nEUR\n \n0.09\n \n1.1037\n \n \n0.099\n \n10.4%\n \n \n 1,465 \n \n1.0353\n \n \n0.093\n \n9.9%\n \n \n 1,645 \n \n-0.5%\nJPY\n \n3.91\n \n0.0071\n \n \n0.028\n \n2.9%\n \n \n 409 \n \n0.0064\n \n \n0.025\n \n2.6%\n \n \n 439 \n \n-0.3%\nGBP\n \n0.02\n \n1.2731\n \n \n0.025\n \n2.7%\n \n \n 376 \n \n1.2513\n \n \n0.025\n \n2.7%\n \n \n 442 \n \n0.0%\nCHF\n \n0.02\n \n1.1881\n \n \n0.024\n \n2.5%\n \n \n 350 \n \n1.1019\n \n \n0.022\n \n2.3%\n \n \n 389 \n \n-0.1%\nCNH\n \n0.13\n \n0.1404\n \n \n0.018\n \n1.9%\n \n \n 269 \n \n0.1363\n \n \n0.018\n \n1.9%\n \n \n 313 \n \n0.0%\nINR\n \n1.10\n \n0.0120\n \n \n0.013\n \n1.4%\n \n \n 195 \n \n0.0117\n \n \n0.013\n \n1.4%\n \n \n 227 \n \n0.0%\nCAD\n \n0.02\n \n0.7549\n \n \n0.011\n \n1.2%\n \n \n 167 \n \n0.6953\n \n \n0.010\n \n1.1%\n \n \n 184 \n \n-0.1%\nAUD\n \n0.02\n \n0.6811\n \n \n0.010\n \n1.1%\n \n \n 151 \n \n0.6188\n \n \n0.009\n \n1.0%\n \n \n 164 \n \n-0.1%\nHKD\n \n0.04\n \n0.1281\n \n \n0.004\n \n0.5%\n \n \n 66 \n \n0.1287\n \n \n0.005\n \n0.5%\n \n \n 80 \n \n0.0%\n \n \n \n \n \n \n \n 0.954 \n \n100.0%\n \n$\n 14,067 \n \n \n \n \n 0.940 \n \n100.0%\n \n$\n 16,597 \n \n0.0%\n \n \nInterest Rate Risk\n \nWe had no variable\n-\nrate debt outstanding as of December 31, 2024. \n \nWe pay our customers interest based on benchmark overnight interest rates in various currencies, when interest rates are above a benchmark rate plus a small spread, on cash balances above $10 thousand (or equivalent) in securities accounts holding more than $100 thousand and at lower, tiered rates for accounts holding less than $100 thousand (or equivalent) net asset value. In currencies, if any, with negative rates, we pass through the cost of holding certain cash balances to our customers; therefore, we charge our customers interest on these cash balances\n. \nIn a normal rate environment, we typically invest a portion of these funds in U.S. government securities with maturities of up to two years, although given the current interest rate environment, at this time substantially all such investments mature within three months. If interest rates were to increase rapidly and substantially, our net interest income would not increase proportionally with the interest rates for the portion of the funds invested at fixed yields. In addition, the mark-to-market changes in the value of these fixed rate securities will be reflected in other income, instead of net interest income. \nOur margin balances are priced to a benchmark rate plus a spread, with a minimum charge of 0.75% in U.S. dollars and most foreign currencies. \n \nBased on customer balances and investments outstanding as of December 31, 2024, and assuming reinvestment of maturing instruments in instruments of short-term duration, an increase of 0.25% over current U.S. dollar interest rate levels would increase our net interest income by approximately $64 million on an annualized basis, assuming the full effect of reinvestment at higher rates. \nA 0.25% increase in all the relevant non-U.S. dollar benchmark rates would increase our net interest income by approximately $24 million on an annualized basis. \nOur interest rate sensitivity estimate contains separate assumptions for U.S. dollar rates from other currencies’ rates and it isolates the effects of a rate increase on reinvestments. We do not approximate mark-to-market impact from interest rate changes; if U.S. government securities whose prices were to fall under these scenarios were held to maturity, as intended, then the reduction in other income would be temporary, as the securities would mature at par value. \nIf such securities were sold prior to maturity, the loss would be realized and the proceeds reinvested at prevailing higher interest rates.\n‎\n \n\n\n62\nTable of Contents\n \n\n\n \nWe also face the potential for reduced net interest income from customer deposits and margin loans if benchmark rates were to fall. \nBased on customer balances and investments outstanding as of December 31, 2024, and assuming reinvestment of maturing instruments in instruments of short-term duration, a\n decrease in U.S. dollar interest rates of 0.25% would decrease our net interest income by approximately $64 million on an annualized basis, assuming the full effect of reinvestment at lower rates. A 0.25% decrease in all the relevant non-U.S. dollar benchmark rates would decrease our net interest income by approximately $22 million on an annualized basis.\n \nWe also face interest rate risk due to positions carried for our remaining market making activities to the extent that long or short stock positions may have been established for future or forward dates on options or futures contracts and the value of such positions is impacted by interest rates. The amount of such risk cannot be quantified, however, the current low level of market making positions does not indicate a material potential exposure.\n \nDividend Risk\n \nWe face dividend risk in our remaining market making activities as we derive revenues and incur expenses in the form of dividend income and expense, respectively, from our inventory of equity securities, and must make payments in lieu of dividends on short positions in equity securities within our portfolio. Projected future dividends are an important component of pricing equity options and other derivatives, and incorrect projections may lead to trading losses. The amount of such risk cannot be quantified, however, the current low level of market making positions does not indicate a material potential exposure.\n \nMargin Loans\n \nWe extend margin loans to our customers, which are subject to various regulatory requirements. Margin loans are collateralized by cash and securities in the customers’ accounts. The risks associated with margin credit increase during periods of fast market movements or in cases where collateral is concentrated and market movements occur. During such times, customers who utilize margin loans and who have collateralized their obligations with securities may find that the securities have a rapidly depreciating value and may not be sufficient to cover their obligations in the event of a liquidation. We are also exposed to credit risk when our customers execute transactions, such as short sales of options and equities that can expose them to risk beyond their invested capital.\n \nWe expect this kind of exposure to increase with the growth of our overall business. Because we indemnify and hold harmless our clearing houses and counterparties from certain liabilities or claims, the use of margin loans and short sales may expose us to significant off\n-\nbalance\n-\nsheet risk if collateral requirements are not sufficient to fully cover losses that customers may incur and those customers fail to satisfy their obligations. As of December 31, 2024, we had $64.4 billion in margin loans extended to our customers. The amount of risk to which we are exposed from the margin loans we extend to our customers and from short sale transactions by our customers is unlimited and not quantifiable as the risk is dependent upon analysis of a potentially significant and undeterminable rise or fall in stock prices. Our account level margin requirements meet or exceed those required by Regulation T of the Board of Governors of the Federal Reserve and FINRA portfolio margin rules, as applicable. As a matter of practice, we enforce real\n-\ntime margin compliance monitoring and liquidate customers’ positions if their equity falls below required margin requirements.\n \nWe have a comprehensive policy implemented in accordance with regulatory standards to assess and monitor the suitability of investors to engage in various trading activities. To mitigate our risk, we also continuously monitor customer accounts to detect excessive concentration, large orders or positions, patterns of day trading and other activities that indicate increased risk to us.\n \nOur credit exposure is to a great extent mitigated by our real-time margining system, which automatically evaluates each account throughout the trading day and closes out positions automatically for accounts that are found to be under\n-\nmargined. While this methodology is effective in most situations, it may not be effective in situations where no liquid market exists for the relevant securities or commodities or where, for any reason, automatic liquidation for certain accounts has been disabled. Our Market Risk Committee continually monitors and evaluates our risk management policies, including the implementation of policies and procedures to enhance the detection and prevention of potential events to mitigate margin loan losses.\n‎\n\n\n63\nTable of Contents\n \n\n\n \nValue\n-\nat\n-\nRisk \n \nWe estimate VaR using a historical approach, which uses the historical daily price returns of underlying assets as well as estimates of the end of day implied volatility for options. Our one\n-\nday VaR is defined as the unrealized loss in portfolio value that, based on historically observed market risk factors, would have been exceeded with a frequency of one percent, based on a calculation with a confidence interval of 99%.\n \nOur VaR model generally takes into account exposures to equity and commodity price risk and foreign exchange rates.\n \nWe use VaR as one of a range of risk management tools. Among their benefits, VaR models permit the estimation of a portfolio’s aggregate market risk exposure, incorporating a range of varied market risks and portfolio assets. One key element of the VaR model is that it reflects risk reduction due to portfolio diversification or hedging activities. However, VaR has various strengths and limitations, which include, but are not limited to: use of historical changes in market risk factors, which may not be accurate predictors of future market conditions, and may not fully incorporate the risk of extreme market events that are outsized relative to observed historical market behavior or reflect the historical distribution of results beyond the confidence interval; and reporting of losses in a single day, which does not reflect the risk of positions that cannot be liquidated or hedged in one day. A small proportion of market risk generated by trading positions is not included in VaR. The modeling of the risk characteristics of some positions relies on approximations that, under certain circumstances, could produce significantly different results from those produced using more precise measures. VaR is most appropriate as a risk measure for trading positions in liquid financial markets and will understate the risk associated with severe events, such as periods of extreme illiquidity.\n \nThe VaR calculation simulates the performance of the portfolio based on several years of daily price changes of the underlying assets and determines the VaR as the calculated loss that occurs at the 99\nth\n percentile.\n \nSince the reported VaR statistics are estimates based on historical data, VaR should not be viewed as predictive of our future revenues or financial performance or of our ability to monitor and manage risk. There can be no assurance that our actual losses on a particular day will not exceed the indicated VaR or that such losses will not occur more than one time in 100 trading days. VaR does not predict the magnitude of losses which, should they occur, may be significantly greater than the VaR amount.\n \nStress Test \n \nWe estimate the market risk of our fixed income portfolio using a risk analysis model provided by a leading external vendor. For corporate bonds, this stress test is configured to calculate the change in value of each fixed income security in the portfolio over one day in five scenarios each of which represents a parallel shift of the U.S. Treasury yield curve. The scenarios are shifts of +/−100 and +/−200 basis points. For U.S. government securities, the stress test is configured to calculate the change in value of each fixed income security in the portfolio over one day in three scenarios each of which represents a parallel shift of the U.S. Treasury yield curve. The scenarios are shifts of +/−50 basis points.\n‎\n \n\n\n64\nTable of Contents\n \n\n\n \nVaR and Stress Test Measures\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAt December 31,\n \n \nAt December 31,\n \n \nAverage \n \n \nHigh\nMarket Risk Category\n \n \n2024\n \n \n2023\n \n \n2024\n \n \n2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nTrading \n(1)\n \n \n \n \n \n \n \n \n \n \n \n \nEquities and Currencies \n(2)\n \n$\n8\n \n$\n10\n \n$\n9\n \n$\n9\nTrading Total\n \n$\n8\n \n$\n10\n \n$\n9\n \n$\n9\n \n \n \n \n \n \n \n \n \n \n \n \n \nNon-Trading \n(1)\n \n \n \n \n \n \n \n \n \n \n \n \nEquities and Currencies\n \n$\n28\n \n$\n28\n \n$\n30\n \n$\n34\nFixed Income, Other \n(3)\n \n \n2\n \n \n3\n \n \n2\n \n \n3\nNon-Trading Total\n \n$\n30\n \n$\n31\n \n$\n32\n \n$\n37\n \n___________________________\n \n(1)\nThe product categories displayed in the table as “Trading” reflect activities undertaken in the Company's market making activities.\n‎\nThe “Non-trading” category reflects investment activities and foreign currency exposures of the Company's non-market making subsidiaries (i.e., its brokerage subsidiaries and information technology subsidiaries). This category also includes corporate activities in foreign exchange designed to achieve the Company's currency diversification strategy.\n \nThe average and high VaR amounts are based on the four quarter ending calculations performed in 2024.\n \n(2)\nEquities and currencies held for market making purposes are combined because these products are part of an integrated, hedged market making portfolio, on which the risk is measured using VaR.\n \n(3)\nThe Non-Trading – Fixed Income, Other category contains primarily U.S. government securities held in segregated safekeeping accounts for the exclusive benefit of our brokerage customers, on which the risk is measured using a stress test analysis.\n \n \n\n\n65\nTable of Contents\n \n\n\nITEM 8.  FINA\nNCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\n \n \n \n \nReport of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\n67\n \n \nConsolidated Statements of Financial Condition\n69\n \n \nConsolidated Statements of Comprehensive Income\n70\n \n \nConsolidated Statements of Cash Flows\n71\n \n \nConsolidated Statements of Change in Equity\n72\n \n \nNotes to Consolidated Financial Statements\n73\n \n \n \nNote 1. Organization of Business\n73\n \n Note 2. Significant Accounting Policies\n73\n \nNote 3. Trading Activities and Related Risks\n83\n \nNote 4. Equity and Earnings per Share\n84\n \nNote 5. Comprehensive Income\n87\n \nNote 6. Financial Assets and Financial Liabilities\n88\n \nNote 7. Collateralized Transactions\n94\n \nNote 8. Revenue from Contracts with Customers\n95\n \nNote 9. Other Income (Loss)\n98\n \nNote 10. Employee Incentive Plans\n98\n \nNote 11. Income Taxes\n100\n \nNote 12. Leases\n102\n \nNote 13. Property, Equipment and Intangible Assets\n103\n \nNote 14. Commitments, Contingencies and Guarantees\n103\n \nNote 15. Segment Reporting and Geographic Information\n106\n \nNote 16. Regulatory Requirements\n107\n \nNote 17. Related Party Transactions\n108\n \nNote 18. Parent Company Condensed Financial Statements\n109\n \nNote 19. Subsequent Events\n110\n \n \n\n\n66\nTable of Contents\n \n\n\nREPORT OF INDEPENDENT REGISTERED\n PUBLIC ACCOUNTING FIRM \nTo the Stockholders and the Board of Directors of \nInteractive Brokers Group, Inc. \nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of financial condition of Interactive Brokers Group, Inc. and subsidiaries (the \"Company\") as of December 31, 2024 and 2023, the related consolidated statements of comprehensive income, cash flows and changes in equity, for each of the three years in the period ended December 31, 2024, and the related (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 27, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\n \n \nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n \nIncome taxes — Refer to Notes 2 and 11 to the financial statements\nCritical Audit Matter Description\nThe Company’s income tax expense, deferred tax assets and liabilities are based on enacted tax laws and reflects management's best assessment of estimated future taxes to be paid. The Company is subject to income taxes in both the U.S. and numerous foreign jurisdictions. The Company has deferred tax assets and liabilities that arose from temporary differences between tax and financial statement recognition of underlying assets and liabilities. Determining income tax expense and deferred tax assets and liabilities requires significant management judgments and estimates. \n \nWe identified management’s calculation of income tax expense and deferred tax assets and liabilities as a critical audit matter because of the significant judgments and estimates management makes to determine these amounts. Performing audit procedures to evaluate the reasonableness of management’s interpretation of tax law in a multitude of jurisdictions across the Company’s global operations, and its estimate of the associated income tax expense and deferred tax assets and liabilities, required a high degree of auditor judgment and increased effort, including the need to involve our income tax specialists.\n‎\n \n\n\n67\nTable of Contents\n \n\n\n \nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to income tax expense and deferred tax assets and liabilities included, among others, the following which were performed with the assistance of our income tax specialists: \n-\nTesting the operating effectiveness of controls over income tax balances and deferred tax assets and liabilities.\n-\nEvaluating the Company’s income tax expense calculation, including testing the appropriateness of income tax rates applied and of income allocations among the taxing jurisdictions, and the mathematical accuracy of the calculation.  \n-\nEvaluating the Company’s analyses supporting its conclusions as to the recognition and measurement of deferred tax assets and liabilities. \n-\nEvaluating management’s assessment of the Company’s ability to utilize the net deferred tax assets in future years.\n \n/s/ \nDeloitte & Touche LLP\nNew York, New York\nFebruary 27, 2025 \n \nWe have served as the Company's auditor since 1990.\n \n \n‎\n \n\n\n68\nTable of Contents\n \n\n\n \n \nInteractive \nBrokers Group, Inc. and Subsidiaries\nConsolidated Statements of Financial Condition\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n(in millions, except share amounts)\n \n2024\n \n2023\nAssets\n \n \n \n \n \n \nCash and cash equivalents \n \n$\n \n3,633\n \n \n$\n \n3,753\n \nCash - segregated for regulatory purposes \n \n \n \n36,600\n \n \n \n \n28,840\n \nSecurities - segregated for regulatory purposes \n \n \n \n27,846\n \n \n \n \n35,386\n \nSecurities borrowed \n \n \n \n5,369\n \n \n \n \n5,835\n \nSecurities purchased under agreements to resell \n \n \n \n6,575\n \n \n \n \n5,504\n \nFinancial instruments owned, at fair value\n \n \n \n \n \n \nFinancial instruments owned \n \n \n \n1,847\n \n \n \n \n1,422\n \nFinancial instruments owned and pledged as collateral \n \n \n \n77\n \n \n \n \n66\n \nTotal financial instruments owned, at fair value\n \n \n \n1,924\n \n \n \n \n1,488\n \nReceivables\n \n \n \n \n \n \nCustomers, less allowance for credit losses of $\n25\n and $\n10\n as of December 31, 2024 and 2023\n \n \n \n64,432\n \n \n \n \n44,472\n \nBrokers, dealers, and clearing organizations \n \n \n \n2,196\n \n \n \n \n1,643\n \nInterest \n \n \n \n446\n \n \n \n \n375\n \nTotal receivables\n \n \n \n67,074\n \n \n \n \n46,490\n \nOther assets \n \n \n \n1,121\n \n \n \n \n955\n \nTotal assets \n \n$\n \n150,142\n \n \n$\n \n128,251\n \nLiabilities and equity\n \n \n \n \n \n \nShort-term borrowings \n \n$\n \n14\n \n \n$\n \n17\n \nSecurities loaned \n \n \n \n16,248\n \n \n \n \n11,347\n \nFinancial instruments sold, but not yet purchased, at fair value \n \n \n \n293\n \n \n \n \n193\n \nPayables\n \n \n \n \n \n \nCustomers \n \n \n \n115,343\n \n \n \n \n101,012\n \nBrokers, dealers, and clearing organizations \n \n \n \n476\n \n \n \n \n590\n \nAffiliate \n \n \n \n195\n \n \n \n \n210\n \nAccounts payable, accrued expenses and other liabilities\n \n \n \n665\n \n \n \n \n504\n \nInterest \n \n \n \n311\n \n \n \n \n311\n \nTotal payables\n \n \n \n116,990\n \n \n \n \n102,627\n \nTotal liabilities\n \n \n \n133,545\n \n \n \n \n114,184\n \nCommitments, contingencies and guarantees (see Note 14)\n \n \n \n \n \n \nEquity\n \n \n \n \n \n \nStockholders’ equity\n \n \n \n \n \n \nCommon stock, $\n0.01\n par value per share\n \n \n \n \n \n \nClass A – Authorized - \n1,000,000,000\n, Issued - \n109,061,059\n and \n107,178,928\n shares, Outstanding – \n108,904,613\n and \n107,045,894\n shares as of December 31, 2024 and 2023\n \n \n \n1\n \n \n \n \n1\n \nClass B – Authorized, Issued and Outstanding – \n100\n shares as of December 31, 2024 and 2023\n \n \n \n—\n \n \n \n—\nAdditional paid-in capital \n \n \n \n1,816\n \n \n \n \n1,726\n \nRetained earnings\n \n \n \n2,515\n \n \n \n \n1,852\n \nAccumulated other comprehensive income, net of income taxes of $\n0\n and $\n0\n as of December 31, 2024 and 2023\n \n \n (\n45\n)\n \n \n \n8\n \nTreasury stock, at cost, \n156,446\n and \n133,034\n shares as of December 31, 2024 and 2023\n \n \n (\n7\n)\n \n \n (\n3\n)\nTotal stockholders’ equity\n \n \n \n4,280\n \n \n \n \n3,584\n \nNoncontrolling interests\n \n \n \n12,317\n \n \n \n \n10,483\n \nTotal equity\n \n \n \n16,597\n \n \n \n \n14,067\n \nTotal liabilities and equity\n \n$\n \n150,142\n \n \n$\n \n128,251\n \n \n \nSee accompanying notes to the consolidated financial statements.\n \n \n\n\n69\nTable of Contents\n \n\n\n \n \nInteractive Brokers Group, Inc. and Subsidiaries\nConsolidated Statements of Comprehensive Income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n(in millions, except share or per share amounts)\n \n2024\n \n2023\n \n2022\nRevenues\n \n \n \n \n \n \n \n \n \nCommissions \n \n$\n \n1,697\n \n$\n \n1,360\n \n$\n \n1,322\nOther fees and services\n \n \n \n280\n \n \n \n197\n \n \n \n184\nOther income (loss)\n \n \n \n60\n \n \n (\n11\n)\n \n \n (\n107\n)\nTotal non-interest income\n \n \n \n2,037\n \n \n \n1,546\n \n \n \n1,399\n \n \n \n \n \n \n \n \n \n \nInterest income\n \n \n \n7,339\n \n \n \n6,230\n \n \n \n2,686\nInterest expense\n \n \n (\n4,191\n)\n \n \n (\n3,436\n)\n \n \n (\n1,018\n)\nTotal net interest income\n \n \n \n3,148\n \n \n \n2,794\n \n \n \n1,668\nTotal net revenues\n \n \n \n5,185\n \n \n \n4,340\n \n \n \n3,067\n \n \n \n \n \n \n \n \n \n \nNon-interest expenses\n \n \n \n \n \n \n \n \n \nExecution, clearing and distribution fees\n \n \n \n447\n \n \n \n386\n \n \n \n324\nEmployee compensation and benefits\n \n \n \n574\n \n \n \n527\n \n \n \n454\nOccupancy, depreciation and amortization\n \n \n \n101\n \n \n \n99\n \n \n \n90\nCommunications\n \n \n \n39\n \n \n \n41\n \n \n \n33\nGeneral and administrative\n \n \n \n314\n \n \n \n211\n \n \n \n165\nCustomer bad debt\n \n \n \n15\n \n \n \n7\n \n \n \n3\nTotal non-interest expenses\n \n \n \n1,490\n \n \n \n1,271\n \n \n \n1,069\nIncome before income taxes\n \n \n \n3,695\n \n \n \n3,069\n \n \n \n1,998\nIncome tax expense\n \n \n \n288\n \n \n \n257\n \n \n \n156\nNet income\n \n \n \n3,407\n \n \n \n2,812\n \n \n \n1,842\nLess net income attributable to noncontrolling interests\n \n \n \n2,652\n \n \n \n2,212\n \n \n \n1,462\nNet income available for common stockholders\n \n$\n \n755\n \n$\n \n600\n \n$\n \n380\n \n \n \n \n \n \n \n \n \n \nEarnings per share\n \n \n \n \n \n \n \n \n \nBasic\n \n$\n \n6.99\n \n$\n \n5.72\n \n$\n \n3.78\nDiluted\n \n$\n \n6.93\n \n$\n \n5.67\n \n$\n \n3.75\nWeighted average common shares outstanding\n \n \n \n \n \n \n \n \n \nBasic\n \n \n \n108,112,199\n \n \n \n104,965,050\n \n \n \n100,460,016\nDiluted\n \n \n \n109,002,938\n \n \n \n105,846,877\n \n \n \n101,299,609\n \n \n \n \n \n \n \n \n \n \nComprehensive income\n \n \n \n \n \n \n \n \n \nNet income available for common stockholders\n \n$\n \n755\n \n$\n \n600\n \n$\n \n380\nOther comprehensive income\n \n \n \n \n \n \n \n \n \nCumulative translation adjustment, before income taxes\n \n \n (\n53\n)\n \n \n \n30\n \n \n (\n26\n)\nIncome taxes related to items of other comprehensive income\n \n \n —\n \n \n —\n \n \n —\nOther comprehensive income (loss), net of tax\n \n \n (\n53\n)\n \n \n \n30\n \n \n (\n26\n)\nComprehensive income available for common stockholders\n \n$\n \n702\n \n$\n \n630\n \n$\n \n354\n \n \n \n \n \n \n \n \n \n \nComprehensive income attributable to noncontrolling interests\n \n \n \n \n \n \n \n \n \nNet income attributable to noncontrolling interests\n \n$\n \n2,652\n \n$\n \n2,212\n \n$\n \n1,462\nOther comprehensive income - cumulative translation adjustment\n \n \n (\n154\n)\n \n \n \n92\n \n \n (\n85\n)\nComprehensive income attributable to noncontrolling interests\n \n$\n \n2,498\n \n$\n \n2,304\n \n$\n \n1,377\n \n \nSee accompanying notes to the consolidated financial statements.\n\n\n70\nTable of Contents\n \n\n\n \nInteractive Brokers\n Group, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n(in millions)\n \n2024\n \n2023\n \n2022\nCash flows from operating activities\n \n \n \n \n \n \n \n \n \nNet income\n \n$\n \n3,407\n \n \n$\n \n2,812\n \n \n$\n \n1,842\n \nAdjustments to reconcile net income to net cash from operating activities\n \n \n \n \n \n \n \n \n \nDeferred income taxes\n \n \n (\n2\n)\n \n \n \n30\n \n \n \n \n20\n \nDepreciation and amortization\n \n \n \n67\n \n \n \n \n65\n \n \n \n \n58\n \nAmortization of right-of-use assets\n \n \n \n29\n \n \n \n \n29\n \n \n \n \n26\n \nEmployee stock plan compensation\n \n \n \n112\n \n \n \n \n100\n \n \n \n \n92\n \nUnrealized (gains) losses on other investments, net\n \n \n (\n12\n)\n \n \n (\n14\n)\n \n \n \n8\n \n(Gain) loss on remeasurement of Tax Receivable Agreement liability\n \n \n \n10\n \n \n \n (\n7\n)\n \n \n (\n6\n)\nBad debt expense\n \n \n \n15\n \n \n \n \n7\n \n \n \n \n3\n \nImpairment loss\n \n \n —\n \n \n —\n \n \n \n1\n \nShares distributed to customers under IBKR Promotions\n \n \n \n23\n \n \n \n \n12\n \n \n \n \n9\n \nChange in operating assets and liabilities\n \n \n \n \n \n \n \n \n \nSecurities - segregated for regulatory purposes\n \n \n \n7,540\n \n \n \n (\n3,605\n)\n \n \n (\n16,660\n)\nSecurities borrowed\n \n \n \n466\n \n \n \n (\n1,086\n)\n \n \n (\n837\n)\nSecurities purchased under agreements to resell\n \n \n (\n1,071\n)\n \n \n \n525\n \n \n \n (\n1,649\n)\nFinancial instruments owned, at fair value\n \n \n (\n434\n)\n \n \n (\n1,033\n)\n \n \n \n189\n \nReceivables from customers\n \n \n (\n19,975\n)\n \n \n (\n5,719\n)\n \n \n \n16,172\n \nOther receivables\n \n \n (\n624\n)\n \n \n \n1,792\n \n \n \n \n88\n \nOther assets\n \n \n (\n203\n)\n \n \n (\n103\n)\n \n \n \n35\n \nSecurities loaned\n \n \n \n4,901\n \n \n \n \n2,407\n \n \n \n (\n2,829\n)\nFinancial instruments sold, but not yet purchased, at fair value\n \n \n \n100\n \n \n \n \n47\n \n \n \n (\n36\n)\nPayable to customers\n \n \n \n14,331\n \n \n \n \n7,817\n \n \n \n \n7,561\n \nOther payables\n \n \n \n44\n \n \n \n \n468\n \n \n \n (\n119\n)\nNet cash provided by operating activities\n \n \n \n8,724\n \n \n \n \n4,544\n \n \n \n \n3,968\n \nCash flows from investing activities\n \n \n \n \n \n \n \n \n \nPurchases of other investments\n \n \n (\n40\n)\n \n \n (\n26\n)\n \n \n (\n5\n)\nDistributions received and proceeds from sales of other investments\n \n \n \n45\n \n \n \n \n23\n \n \n \n \n7\n \nPurchase of property, equipment and intangible assets\n \n \n (\n49\n)\n \n \n (\n49\n)\n \n \n (\n69\n)\nNet cash used in investing activities\n \n \n (\n44\n)\n \n \n (\n52\n)\n \n \n (\n67\n)\nCash flows from financing activities\n \n \n \n \n \n \n \n \n \nShort-term borrowings, net\n \n \n (\n3\n)\n \n \n (\n1\n)\n \n \n (\n9\n)\nDividends paid to stockholders\n \n \n (\n92\n)\n \n \n (\n42\n)\n \n \n (\n40\n)\nDistributions to noncontrolling interests\n \n \n (\n715\n)\n \n \n (\n556\n)\n \n \n (\n404\n)\nRepurchases of common stock for employee tax withholdings\n \n \n (\n54\n)\n \n \n (\n34\n)\n \n \n (\n20\n)\nProceeds from the sale of treasury stock\n \n \n \n56\n \n \n \n \n34\n \n \n \n \n23\n \nPayments made under the Tax Receivable Agreement\n \n \n (\n25\n)\n \n \n (\n25\n)\n \n \n (\n20\n)\nNet cash used in financing activities\n \n \n (\n833\n)\n \n \n (\n624\n)\n \n \n (\n470\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n \n \n (\n207\n)\n \n \n \n122\n \n \n \n (\n111\n)\nNet increase in cash, cash equivalents and restricted cash\n \n \n \n7,640\n \n \n \n \n3,990\n \n \n \n \n3,320\n \nCash, cash equivalents and restricted cash at beginning of period\n \n \n \n32,593\n \n \n \n \n28,603\n \n \n \n \n25,283\n \nCash, cash equivalents and restricted cash at end of period\n \n$\n \n40,233\n \n \n$\n \n32,593\n \n \n$\n \n28,603\n \nCash, cash equivalents and restricted cash\n \n \n \n \n \n \n \n \n \nCash and cash equivalents\n \n \n \n3,633\n \n \n \n \n3,753\n \n \n \n \n3,436\n \nCash segregated for regulatory purposes\n \n \n \n36,600\n \n \n \n \n28,840\n \n \n \n \n25,167\n \nCash, cash equivalents and restricted cash at end of period\n \n$\n \n40,233\n \n \n$\n \n32,593\n \n \n$\n \n28,603\n \nSupplemental disclosures of cash flow information\n \n \n \n \n \n \n \n \n \nCash paid for interest\n \n$\n \n4,190\n \n \n$\n \n3,317\n \n \n$\n \n833\n \nCash paid for taxes, net\n \n$\n \n279\n \n \n$\n \n228\n \n \n$\n \n148\n \nCash paid for amounts included in lease liabilities\n \n$\n \n39\n \n \n$\n \n35\n \n \n$\n \n32\n \nNon-cash financing activities\n \n \n \n \n \n \n \n \n \nIssuance of common stock in exchange of member interests in IBG LLC\n \n$\n \n39\n \n \n$\n \n229\n \n \n$\n \n192\n \nRedemption of member interests from IBG Holdings LLC\n \n$\n (\n39\n)\n \n$\n (\n229\n)\n \n$\n (\n192\n)\nAdjustments to additional paid-in capital for changes in proportionate ownership in IBG LLC\n \n$\n \n41\n \n \n$\n \n33\n \n \n$\n \n27\n \nAdjustments to noncontrolling interests for changes in proportionate ownership in IBG LLC\n \n$\n (\n41\n)\n \n$\n (\n33\n)\n \n$\n (\n27\n)\nNon-cash distributions to noncontrolling interests\n \n$\n —\n \n$\n —\n \n$\n (\n1\n)\n \nSee accompanying notes to the consolidated financial statements\n.\n \n\n\n71\nTable of Contents\n \n\n\n \nInteractive Brokers Group, Inc. and Subsidiaries\nConsolidated Statements of Ch\nanges in Equity\nThree Years Ended December 31, 2024, 2023, and 2022\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nClass A Common Stock\n \n \n \n \n \n \n \n \n \n \nAccumulated \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAdditional\n \n \n \n \n \n \n \nOther \n \nTotal\n \nNon-\n \n \n \n \n \nIssued\n \nPar \n \nPaid-In\n \nTreasury\n \nRetained \n \nComprehensive\n \nStockholders' \n \ncontrolling \n \nTotal\n(in millions, except share amounts)\n \nShares\n \nValue\n \n Capital\n \n Stock\n \n Earnings\n \n Income\n \n Equity\n \nInterests\n \nEquity\nBalance, December 31, 2021\n \n \n98,359,572\n \n \n$\n \n1\n \n \n$\n \n1,442\n \n \n$\n (\n5\n)\n \n$\n \n953\n \n \n$\n \n4\n \n \n$\n \n2,395\n \n \n$\n \n7,827\n \n \n$\n \n10,222\n \nIssuance of common stock in follow-on offering\n \n \n3,271,390\n \n \n \n \n \n \n \n84\n \n \n \n \n \n \n \n \n \n \n \n \n \n84\n \n \n \n (\n84\n)\n \n \n —\nCommon stock distributed pursuant to stock incentive plans\n \n \n1,276,186\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n \n \n \n —\nIssuance of common stock - IBKR Promotion\n \n \n150,000\n \n \n \n \n \n \n \n2\n \n \n \n (\n10\n)\n \n \n \n \n \n \n \n \n (\n8\n)\n \n \n \n8\n \n \n \n —\nNet distribution of common stock - IBKR Promotion\n \n \n \n \n \n \n \n \n \n \n \n9\n \n \n \n \n \n \n \n \n \n \n9\n \n \n \n \n \n \n \n9\n \nCompensation for stock grants vesting in the future\n \n \n \n \n \n \n \n \n23\n \n \n \n \n \n \n \n \n \n \n \n \n \n23\n \n \n \n \n69\n \n \n \n \n92\n \nDeferred tax benefit retained - follow-on offering\n \n \n \n \n \n \n \n \n3\n \n \n \n \n \n \n \n \n \n \n \n \n \n3\n \n \n \n \n \n \n \n3\n \nRepurchases of common stock for employee tax withholdings under stock incentive plans\n \n \n \n \n \n \n \n \n \n \n (\n20\n)\n \n \n \n \n \n \n \n \n (\n20\n)\n \n \n \n \n \n (\n20\n)\nSales of treasury stock\n \n \n \n \n \n \n \n \n \n \n \n20\n \n \n \n \n1\n \n \n \n \n \n \n \n21\n \n \n \n \n2\n \n \n \n \n23\n \nDividends paid to stockholders - $\n0.10\n per share\n \n \n \n \n \n \n \n \n \n \n \n \n \n (\n40\n)\n \n \n \n \n \n (\n40\n)\n \n \n \n \n \n (\n40\n)\nDistributions from IBG LLC to noncontrolling interests\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n (\n405\n)\n \n \n (\n405\n)\nAdjustments for changes in proportionate ownership in IBG LLC\n \n \n \n \n \n \n \n \n27\n \n \n \n \n \n \n \n \n \n \n \n \n \n27\n \n \n \n (\n27\n)\n \n \n —\nComprehensive income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n380\n \n \n \n (\n26\n)\n \n \n \n354\n \n \n \n \n1,377\n \n \n \n \n1,731\n \nBalance, December 31, 2022\n \n \n103,057,148\n \n \n$\n \n1\n \n \n$\n \n1,581\n \n \n$\n (\n6\n)\n \n$\n \n1,294\n \n \n$\n (\n22\n)\n \n$\n \n2,848\n \n \n$\n \n8,767\n \n \n$\n \n11,615\n \nIssuance of common stock in follow-on offering\n \n \n2,632,748\n \n \n \n \n \n \n \n81\n \n \n \n \n \n \n \n \n \n \n \n \n \n81\n \n \n \n (\n81\n)\n \n \n —\nCommon stock distributed pursuant to stock incentive plans\n \n \n1,389,032\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n \n \n \n —\nIssuance of common stock - IBKR Promotion\n \n \n100,000\n \n \n \n \n \n \n \n2\n \n \n \n (\n8\n)\n \n \n \n \n \n \n \n \n (\n6\n)\n \n \n \n6\n \n \n \n —\nNet distribution of common stock - IBKR Promotion\n \n \n \n \n \n \n \n \n \n \n \n11\n \n \n \n \n \n \n \n \n \n \n11\n \n \n \n \n1\n \n \n \n \n12\n \nCompensation for stock grants vesting in the future\n \n \n \n \n \n \n \n \n25\n \n \n \n \n \n \n \n \n \n \n \n \n \n25\n \n \n \n \n75\n \n \n \n \n100\n \nDeferred tax benefit retained - follow-on offering\n \n \n \n \n \n \n \n \n4\n \n \n \n \n \n \n \n \n \n \n \n \n \n4\n \n \n \n \n \n \n \n4\n \nRepurchases of common stock for employee tax withholdings under stock incentive plans\n \n \n \n \n \n \n \n \n \n \n (\n34\n)\n \n \n \n \n \n \n \n \n (\n34\n)\n \n \n \n \n \n (\n34\n)\nSales of treasury stock\n \n \n \n \n \n \n \n \n \n \n \n34\n \n \n \n \n \n \n \n \n \n \n34\n \n \n \n \n \n \n \n34\n \nDividends paid to stockholders - $\n0.10\n per share\n \n \n \n \n \n \n \n \n \n \n \n \n \n (\n42\n)\n \n \n \n \n \n (\n42\n)\n \n \n \n \n \n (\n42\n)\nDistributions from IBG LLC to noncontrolling interests\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n (\n556\n)\n \n \n (\n556\n)\nAdjustments for changes in proportionate ownership in IBG LLC\n \n \n \n \n \n \n \n \n33\n \n \n \n \n \n \n \n \n \n \n \n \n \n33\n \n \n \n (\n33\n)\n \n \n —\nComprehensive income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n600\n \n \n \n \n30\n \n \n \n \n630\n \n \n \n \n2,304\n \n \n \n \n2,934\n \nBalance, December 31, 2023\n \n \n107,178,928\n \n \n$\n \n1\n \n \n$\n \n1,726\n \n \n$\n (\n3\n)\n \n$\n \n1,852\n \n \n$\n \n8\n \n \n$\n \n3,584\n \n \n$\n \n10,483\n \n \n$\n \n14,067\n \nIssuance of common stock in follow-on offering\n \n \n333,000\n \n \n \n \n \n \n \n12\n \n \n \n \n \n \n \n \n \n \n \n \n \n12\n \n \n \n (\n12\n)\n \n \n —\nCommon stock distributed pursuant to stock incentive plans\n \n \n1,349,131\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n \n \n \n —\nIssuance of common stock - IBKR Promotion\n \n \n200,000\n \n \n \n \n \n \n \n6\n \n \n \n (\n23\n)\n \n \n \n \n \n \n \n \n (\n17\n)\n \n \n \n17\n \n \n \n —\nNet distribution of common stock - IBKR Promotion\n \n \n \n \n \n \n \n \n1\n \n \n \n \n19\n \n \n \n \n \n \n \n \n \n \n20\n \n \n \n \n2\n \n \n \n \n22\n \nCompensation for stock grants vesting in the future\n \n \n \n \n \n \n \n \n28\n \n \n \n \n \n \n \n \n \n \n \n \n \n28\n \n \n \n \n84\n \n \n \n \n112\n \nDeferred tax benefit retained - follow-on offering\n \n \n \n \n \n \n \n \n1\n \n \n \n \n \n \n \n \n \n \n \n \n \n1\n \n \n \n \n \n \n \n1\n \nRepurchases of common stock for employee tax withholdings under stock incentive plans\n \n \n \n \n \n \n \n \n \n \n (\n54\n)\n \n \n \n \n \n \n \n \n (\n54\n)\n \n \n \n \n \n (\n54\n)\nSales of treasury stock\n \n \n \n \n \n \n \n \n1\n \n \n \n \n54\n \n \n \n \n \n \n \n \n \n \n55\n \n \n \n \n1\n \n \n \n \n56\n \nDividends paid to stockholders \n1\n \n \n \n \n \n \n \n \n \n \n \n \n \n (\n92\n)\n \n \n \n \n \n (\n92\n)\n \n \n \n \n \n (\n92\n)\nDistributions from IBG LLC to noncontrolling interests\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n —\n \n \n (\n715\n)\n \n \n (\n715\n)\nAdjustments for changes in proportionate ownership in IBG LLC\n \n \n \n \n \n \n \n \n41\n \n \n \n \n \n \n \n \n \n \n \n \n \n41\n \n \n \n (\n41\n)\n \n \n —\nComprehensive income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n755\n \n \n \n (\n53\n)\n \n \n \n702\n \n \n \n \n2,498\n \n \n \n \n3,200\n \nBalance, December 31, 2024\n \n \n109,061,059\n \n \n$\n \n1\n \n \n$\n \n1,816\n \n \n$\n (\n7\n)\n \n$\n \n2,515\n \n \n$\n (\n45\n)\n \n$\n \n4,280\n \n \n$\n \n12,317\n \n \n$\n \n16,597\n \n___________________________\n(1)\nIn April of 2024, the Company increased the quarterly dividend from $\n0.10\n per share to $\n0.25\n per share\n.\n \nSee accompanying notes to the consolidated\n \nfinancial statements\n.\n \n\n\n72\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n1.  Organization\n of Business \n \nInteractive Brokers Group, Inc. (“IBG, Inc.”) is a Delaware holding company whose primary asset is its ownership of approximately \n25.8\n% of the membership interests of IBG LLC, which, in turn, owns operating subsidiaries (collectively, “IBG LLC”). IBG, Inc. together with IBG LLC and its consolidated subsidiaries (collectively, “the Company”), is an automated global electronic broker specializing in executing and clearing trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange-traded funds (“ETFs”), precious metals, and forecast contracts on more than 160 electronic exchanges and market centers around the world and offering custody, prime brokerage, securities and margin lending services to customers. In addition, the Company’s customers can use its trading platform to trade certain cryptocurrencies through third-party cryptocurrency service providers that execute, clear and custody the cryptocurrencies. In the United States of America (“U.S.”), the Company conducts its business primarily from its headquarters in Greenwich, Connecticut and from Chicago, Illinois. Abroad, the Company conducts its business through offices located in Canada, the United Kingdom, Ireland, Switzerland, Hungary, India, China (Hong Kong and Shanghai), Japan, Singapore, and Australia. As of December 31, 2024, the Company had \n2,998\n employees worldwide.\n \nIBG LLC is a Connecticut limited liability company that conducts its business through its significant operating subsidiaries: Interactive Brokers LLC (“IB LLC”); IBKR Securities Services LLC (“IBKRSS”); Interactive Brokers Canada Inc. (“IBC”); Interactive Brokers (U.K.) Limited (“IBUK”); Interactive Brokers Ireland Limited (“IBIE”); IBKR Financial Services AG (“IBKRFS”); Interactive Brokers (India) Private Limited (“IBI”); Interactive Brokers Hong Kong Limited (“IBHK”); Interactive Brokers Securities Japan, Inc. (“IBSJ”); Interactive Brokers Singapore Private Limited (“IBSG”); and Interactive Brokers Australia Pty Limited (“IBA”). \n \nCertain operating subsidiaries are members of various securities and commodities exchanges in North America, Europe and the Asia/Pacific region and are subject to regulatory capital and other requirements (see Note 16). IB LLC, IBKRSS, IBC, IBUK, IBIE, IBI, IBHK, IBSJ, IBSG and IBA carry securities accounts for customers or perform custodial functions relating to customer securities.\n \n2.  Significant Accounting Policies\n \nBasis of Presentation \n \nThese consolidated financial statements are presented in U.S. dollars and have been prepared in accordance with accounting principles generally accepted in the U.S. (“U.S. GAAP”) and pursuant to the rules and regulations of the U.S. Securities and Exchange Commission (“SEC”) regarding financial reporting with respect to Form 10\n-\nK.\n \nThese consolidated financial statements include the accounts of the Company and its consolidated subsidiaries and reflect all adjustments of a normal and recurring nature that are, in the opinion of management, necessary for the fair presentation of the results for the periods presented.\n \nPrinciples of Consolidation, including Noncontrolling Interests\n \nThese consolidated financial statements include the accounts of IBG, Inc. and its majority and wholly-owned subsidiaries. As sole managing member of IBG LLC, IBG, Inc. exerts control over IBG LLC’s operations. In accordance with Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) Topic 810, “\nConsolidation,\n” the Company consolidates IBG LLC’s financial statements and records the interests in IBG LLC that it does not own as noncontrolling interests.\n \nThe Company’s policy is to consolidate all other entities in which it owns more than 50% unless it does not have control \nand any potential variable interest entities (“VIEs”) where the Company is deemed to be the primary beneficiary when it has the power to make the decisions that most significantly affect the economic performance of the VIE and has the obligation to absorb significant losses or the right to receive benefits that could potentially be significant to the VIE. As of December 31, 2024, the Company was not the primary beneficiary of any VIEs\n. All inter\n-\ncompany balances and transactions have been eliminated.\n \nUse of Estimates\n \nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts and disclosures in these consolidated financial statements and accompanying notes. These estimates and assumptions are based on judgment and the best available information at the time. Therefore, actual results could differ materially from those estimates. Such estimates include the allowance for credit losses, valuation of certain investments, compensation accruals, current and deferred income taxes, and contingency reserves.\n‎\n \n\n\n73\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\nFair Value\n \nSubstantially all of the Company’s assets and liabilities, including financial instruments, are carried at fair value based on observable market prices and are marked to market, or are assets and liabilities which are short\n-\nterm in nature and are carried at amounts that approximate fair value.\n \nThe Company applies the fair value hierarchy in accordance with FASB ASC Topic 820, “\nFair Value Measurement” (“ASC Topic 820”)\n, to prioritize the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets and liabilities and the lowest priority to unobservable inputs. The three levels of the fair value hierarchy are:\n \n \n \nLevel 1\nUnadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n \n \nLevel 2\nQuoted prices for similar assets in an active market, quoted prices in markets that are not considered to be active or financial instruments for which all significant inputs are observable, either directly or indirectly.\n \n \nLevel 3\nPrices or valuations that require inputs that are both significant to fair value measurement and unobservable.\n \nFinancial instruments owned, at fair value, and financial instruments sold, but not yet purchased, at fair value are generally classified as Level 1 of the fair value hierarchy. The Company’s Level 1 financial instruments, which are valued using quoted market prices as published by exchanges and clearing houses or otherwise broadly distributed in active markets, include active listed stocks, options, warrants and U.S. and foreign government securities. The Company does not adjust quoted prices for financial instruments classified as Level 1 of the fair value hierarchy, even if the Company may hold a large position whereby a purchase or sale could reasonably be expected to impact quoted prices.\n \nCurrency forward contracts are valued using broadly distributed bank and broker prices and are classified as Level 2 of the fair value hierarchy since inputs to their valuation can generally be corroborated by market data. \nPrecious metals are valued using an internal model, which incorporates the exchange-traded futures price of the underlying instruments, benchmark interest rates and estimated storage costs, and are classified as Level 2 of the fair value hierarchy since the significant inputs to their valuation are observable\n.\n Other securities that are not traded in active markets are also classified as Level 2 of the fair value hierarchy. Level 3 financial instruments are comprised of securities that have been delisted or otherwise are no longer tradable in active markets and have been valued by the Company based on internal estimates.\n \nEarnings per Share\n \nEarnings per share (“EPS”) is computed in accordance with FASB ASC Topic 260, “\nEarnings per Share\n.” Basic EPS is computed by dividing the net income available for common stockholders by the weighted average number of shares outstanding for that period. Diluted EPS is calculated by dividing the net income available for common stockholders by the diluted weighted average shares outstanding for that period. Diluted EPS includes the determinants of basic EPS and, in addition, reflects the dilutive effect of shares of common stock estimated to be distributed in the future under the Company’s stock-based compensation plans, with no adjustments to net income available for common stockholders for potentially dilutive common shares.\n \nCurrent Expected Credit Losses\n \nThe Company follows FASB ASC Topic 326 – “Financial Instruments – Credit Losses” (“ASC Topic 326”) which applies to financial assets measured at amortized cost, held-to-maturity debt securities and off-balance sheet credit exposures. For on-balance sheet assets, an allowance must be recognized at the origination or purchase of in-scope assets and represents the expected credit losses over the contractual life of those assets. Expected credit losses on off-balance sheet credit exposures must be estimated over the contractual period the Company is exposed to credit risk as a result of a present obligation to extend credit. The impact to the current period is not material since the Company’s in-scope assets are primarily subject to collateral maintenance provisions for which the Company elected to apply the practical expedient of reporting the difference between the fair value of the collateral and the amortized cost for the in-scope assets as the allowance for current expected credit losses. \n \nCash and Cash Equivalents\n \nCash and cash equivalents consist of deposits with banks and all highly liquid investments, with maturities of three months or less, that are not segregated and deposited for regulatory purposes or to meet margin requirements at clearing houses and clearing banks.\n‎\n\n\n74\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\nCash and Securities - Segregated for Regulatory Purposes\n \nAs a result of customer activities, certain operating subsidiaries are obligated by rules mandated by their primary regulators to segregate or set aside cash or qualified securities to satisfy such regulations, which have been promulgated to protect customer assets.\n Restricted cash represents cash and cash equivalents that are subject to withdrawal or usage restrictions. Cash segregated for regulatory purposes meets the definition of restricted cash and is included in “Cash, cash equivalents and restricted cash” in the consolidated statements of cash flows. \n \nThe table below presents the composition of the Company’s securities segregated for regulatory purposes for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nU.S. and foreign government securities\n \n$\n \n6,460\n \n$\n \n5,684\nMunicipal securities\n \n \n \n33\n \n \n \n70\nSecurities purchased under agreements to resell \n1\n \n \n \n21,353\n \n \n \n29,632\n \n \n$\n \n27,846\n \n$\n \n35,386\n___________________________\n \n(1)\nThese balances are collateralized by U.S. government securities.\n \n \nSecurities Borrowed and Securities Loaned\n \nSecurities borrowed and securities loaned are recorded at the amount of the cash collateral advanced or received. Securities borrowed transactions require the Company to provide counterparties with collateral, which may be in the form of cash, letters of credit or other securities. With respect to securities loaned, the Company receives collateral, which may be in the form of cash or other securities in an amount generally in excess of the fair value of the securities loaned. The Company monitors the market value of securities borrowed and loaned daily, with additional collateral obtained or refunded as permitted contractually. The Company’s policy is to net, in the consolidated statements of financial condition, securities borrowed and securities loaned contracts entered into with the same counterparty that meet the offsetting requirements prescribed in FASB ASC Topic 210-20, “Balance Sheet – Offsetting” (“ASC Topic 210-20”).\n \nSecurities lending fees received and paid by the Company are included in “Interest income” and “Interest expense,” respectively, in the consolidated statements of comprehensive income.\n \nSecurities Purchased Under Agreements to Resell and Securities Sold Under Agreements to Repurchase\n \nSecurities purchased under agreements to resell and securities sold under agreements to repurchase, which are reported as collateralized financing transactions, are recorded at contract value, which approximates fair value. To ensure that the fair value of the underlying collateral remains sufficient, the collateral is valued daily with additional collateral obtained or excess collateral returned, as permitted under contractual provisions. The Company’s policy is to net, in the consolidated statements of financial condition, securities purchased under agreements to resell transactions and securities sold under agreements to repurchase transactions entered into with the same counterparty that meet the offsetting requirements prescribed in ASC Topic 210-20.\n \nFinancial Instruments Owned and Financial Instruments Sold, But Not Yet Purchased, at Fair Value\n \nFinancial instrument transactions are accounted for on a trade date basis. Financial instruments owned and financial instruments sold, but not yet purchased are stated at fair value based upon quoted market prices, or if not available, are valued by the Company based on internal estimates (see \nFair Value\n above). The Company’s financial instruments pledged to counterparties where the counterparty has the right, by contract or custom, to sell or repledge the financial instruments are reported as “Financial instruments owned and pledged as collateral” in the consolidated statements of financial condition.\n \n\n\n75\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\nCustomer Receivables and Payables\nReceivables from and payables to customers include amounts due on cash and margin transactions, including futures contracts transacted on behalf of customers. Securities owned by customers, including those that collateralize margin loans or other similar transactions, are not reported in the consolidated statements of financial condition. Amounts receivable from customers that are determined by management to be uncollectible are recorded as “Customer bad debt” expense in the consolidated statements of comprehensive income (see \nCurrent Expected Credit Losses \nabove).\n \nReceivables from and Payables to Brokers, Dealers and Clearing Organizations\n \nReceivables from and payables to brokers, dealers and clearing organizations include net receivables and payables from unsettled trades, including amounts related to futures and options on futures contracts executed on behalf of customers, amounts receivable for securities not delivered by the Company to the purchaser by the settlement date (“fails to deliver”) and cash deposits. Payables to brokers, dealers and clearing organizations also include amounts payable for securities not received by the Company from a seller by the settlement date (“fails to receive”).\n \nInvestments\n \nThe Company makes certain strategic investments related to its business which are included in “Other assets” in the consolidated statements of financial condition. The Company accounts for these investments as follows:\n \n\nUnder the equity method of accounting as required under FASB ASC Topic 323, “\nInvestments - Equity Method and Joint Ventures.\n” These investments, including where the investee is a limited partnership or limited liability company, are recorded at the fair value amount of the Company’s initial investment and are adjusted each period for the Company’s share of the investee’s income or loss. Contributions paid to and distributions received from equity method investees are recorded as additions or reductions, respectively, to the respective investment balance. \n \n\nAt fair value, if the investment in equity securities has a readily determinable fair value. \n \n\nAt adjusted cost, if the investment does not have a readily determinable fair value. Adjusted cost represents the historical cost, less impairment if any. If the Company identifies observable price changes in orderly transactions for the identical or a similar investment of the same issuer, the Company measures the equity security at fair value as of the date that the observable transaction occurred in accordance with FASB ASC Topic 321, “Investments in Equity Securities.”\n \nA judgmental aspect of accounting for investments is evaluating whether a decline in the value of an investment has occurred. The evaluation of impairment is dependent on specific quantitative and qualitative factors and circumstances surrounding an investment, including recurring operating losses, credit defaults and subsequent rounds of financing. Most of the Company’s equity investments do not have readily determinable market values. All investments are reviewed for changes in circumstances or occurrence of events that suggest the Company’s investment may not be recoverable. An impairment loss, if any, is recognized in the period the determination is made\n. \n \nThe table below presents the composition of the Company’s investments for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nEquity method investments \n1\n \n$\n \n172\n \n$\n \n142\nInvestments in equity securities at adjusted cost \n2\n \n \n \n29\n \n \n \n22\nInvestments in equity securities at fair value \n2\n \n \n \n32\n \n \n \n44\nInvestments in exchange memberships and equity securities of certain exchanges \n2\n \n \n \n2\n \n \n \n2\n \n \n$\n \n235\n \n$\n \n210\n______________________\n \n(1)\nThe Company’s share of income or losses is included in “Other income” in the consolidated statements of comprehensive income.\n \n\n\n76\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n(2)\nThese investments do not qualify for the equity method of accounting. Dividends received are included in “Other income” in the consolidated statements of comprehensive income.\n \n \nProperty, Equipment and Intangible Assets\n \nProperty, equipment and intangible assets, which are included in “Other assets” in the consolidated statements of financial condition, consist of \nleasehold improvements, computer equipment, software developed for the Company’s internal use, office furniture and equipment\n. \n \nProperty and equipment are recorded at historical cost, less accumulated depreciation and amortization. Additions and improvements that extend the lives of assets are capitalized, while expenditures for repairs and maintenance are expensed as incurred. Depreciation and amortization are computed using the straight\n-\nline method. Equipment is depreciated over the estimated useful lives of the assets, while leasehold improvements are amortized over the lesser of the estimated economic useful life of the asset or the term of the lease. Computer equipment is depreciated over \nthree\n to \nfive years\n and office furniture and equipment are depreciated over \nfive\n to \nseven years\n. Intangible assets with a finite life are amortized on a straight-line basis over their estimated useful lives of \nthree\n to \nfive years\n, and tested for recoverability whenever events indicate that the carrying amounts may not be recoverable. Qualifying costs for internally developed software are capitalized and amortized over the expected useful life of the developed software, not to exceed \nthree years\n. Upon retirement or disposition of property and equipment, the cost and related accumulated depreciation are removed from the consolidated statements of financial condition and any resulting gain or loss is recorded in “Other income” in the consolidated statements of comprehensive income. Fully depreciated (or amortized) assets are retired periodically throughout the year.\n \nLeases\n \nThe Company reviews all relevant contracts to determine if the contract contains a lease at its inception date. A contract contains a lease if the contract conveys to the company the right to control the use of an underlying asset for a period of time in exchange for consideration. If the Company determines that a contract contains a lease, it recognizes, in the consolidated statements of financial condition, a lease liability and a corresponding right-of-use asset on the commencement date of the lease. \nThe lease liability is initially measured at the present value of the future lease payments over the lease term using the rate implicit in the lease or, if not readily determinable, the Company’s secured incremental borrowing rate. An operating lease right-of-use asset is initially measured at the value of the lease liability minus any lease incentives and initial direct costs incurred plus any prepaid rent.\n \nThe Company’s \nleases are classified as operating leases and consist of real estate leases for office space, data centers and other facilities. Each lease liability is measured using the Company’s secured incremental borrowing rate, which \nis based on an internally developed yield curve using interest rates of third parties’ corporate debt issued with a similar risk profile as the Company and a duration similar to the lease term. The Company’s leases have remaining terms of less than \none year\n to \ntwelve years\n, some of which include options to extend the lease term, and some of which include options to terminate the lease upon notice. The Company considers these options when determining the lease term used to calculate the right-of-use asset and the lease liability when the Company is reasonably certain it will exercise such option. \n \nThe Company’s operating leases contain both lease components and non-lease components\n. Non-lease components are distinct elements of a contract that are not related to securing the use of the underlying assets, such as common area maintenance and other management costs. The Company elected to measure the lease liability by combining the lease and non-lease components as a single lease component. As such, the Company includes the fixed payments and any payments that depend on a rate or index that relate to the lease and non-lease components in the measurement of the lease liability. Some of the non-lease components are variable and not based on an index or rate, and as a result, are not included in the measurement of the right-of-use asset or lease liability.\n \nOperating \nlease expense is recognized on a straight-line basis over the lease term and is included in “Occupancy, depreciation and amortization” expense in the Company’s consolidated statements of comprehensive income.\n \nCrypto-assets safeguarding liability and corresponding safeguarding asset\n \nOn January 30, 2025, the SEC issued Staff Accounting Bulletin No. 122 (“SAB 122”) rescinding the interpretative guidance in the Staff Accounting Bulletin No. 121 (“SAB 121”) which required an entity to recognize a safeguarding liability, with a corresponding asset, when an entity has a safeguarding obligation to its customers. SAB 121 required the safeguarding liability to be recorded at the fair value of the crypto-assets being safeguarded with consideration of potential loss events that could result in the corresponding asset being different from the safeguarding liability. SAB 121 also required entities to provide additional disclosures about the nature and amount of crypto assets being safeguarded, as well as any vulnerabilities related to concentrations in crypto-asset safeguarding.\n \n\n\n77\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \nSAB 122, also states that an entity that has an obligation to safeguard crypto-assets for others should determine whether to recognize a liability related to the risk of loss under such an obligation, and if so, the measurement of such a liability, by applying the recognition and measurement requirements in accordance with FASB ASC Subtopic 450-20, “Loss Contingencies.” As of December 31, 2024, 2023 and 2022, respectively, no loss events have been identified.\n \nThe Company early adopted SAB 122 with retrospective application to all prior periods presented. Previously reported amounts in the \nconsolidated statements of financial condition and notes to the consolidated financial statements have been adjusted, as follows:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2023 \n1\n \n \nAs Reported\n \nAdjustment\n \nAs Adjusted\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nAssets\n \n \n \n \n \n \n \n \n \nOther assets\n \n$\n \n1,127\n \n$\n (\n172\n)\n \n$\n \n955\nTotal assets\n \n$\n \n128,423\n \n$\n (\n172\n)\n \n$\n \n128,251\n \n \n \n \n \n \n \n \n \n \nLiabilities\n \n \n \n \n \n \n \n \n \nAccounts payable, accrued expenses and other liabilities\n \n$\n \n676\n \n$\n (\n172\n)\n \n$\n \n504\nTotal payables\n \n$\n \n102,799\n \n$\n (\n172\n)\n \n$\n \n102,627\nTotal liabilities\n \n$\n \n114,356\n \n$\n (\n172\n)\n \n$\n \n114,184\nTotal liabilities and equity\n \n$\n \n128,423\n \n$\n (\n172\n)\n \n$\n \n128,251\n \n \n______________________\n \n(1)\nFor the consolidated statements of cash flow, the Company considered the change in the crypto-asset safeguarding asset and the crypto-asset safeguarding liability to be non-cash items and were not included in the change in “Other assets” and “Other payables” lines in the consolidated statements of cash flows. As a result, there is no impact to periods prior to the year ended December 31, 2023.\n \n \nComprehensive Income and Foreign Currency Translation\n \nThe Company’s operating results are reported in the consolidated statements of comprehensive income pursuant to FASB ASC Topic 220, “\nComprehensive Income.\n”\n \nComprehensive income consists of two components: net income and other comprehensive income (“OCI”). The Company’s OCI is comprised \nof gains and losses resulting from translating foreign currency financial statements of non-U.S. subsidiaries\n, net of related income taxes, where applicable. In general, the practice and intention of the Company is to reinvest the earnings of its non\n-\nU.S. subsidiaries in those operations; therefore, tax is usually not accrued on OCI.\n \nThe Company’s non\n-\nU.S. domiciled subsidiaries have a functional currency that is other than the U.S. dollar. Such subsidiaries’ assets and liabilities are translated into U.S. dollars at period\n-\nend exchange rates, and revenues and expenses are translated at average exchange rates prevailing during the period. Adjustments that result from translating amounts from a subsidiary’s functional currency to the U.S. dollar (as described above) are reported net of tax, where applicable, in “Accumulated other comprehensive income” in the consolidated statements of financial condition.\n \n \nRevenue Recognition\n \nCommissions \n \nCommissions earned for executing and/or clearing transactions are accrued on a trade date basis and are reported as “Commissions” in the consolidated statements of comprehensive income. Commissions also include payments for order flow income received from IBKR Lite\nSM\n liquidity providers. The Company’s IBKR Lite\nSM\n offering provides \ncommission-free trades on U.S. exchange-listed stocks and ETFs and generates no commission revenues from customers on these trades. \nSee Note 8 for further information on revenue from contracts with customers.\n \n\n\n78\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nOther Fees and Services\n \nThe Company earns fee income on services provided to customers, which includes market data fees, risk exposure fees, payments for order flow from exchange-mandated programs, Insured Bank Deposit Sweep Program fees (“FDIC sweep fees”), and other fees and services charged to customers. Fee income is recognized either daily or monthly. See Note 8 for further information on revenue from contracts with customers. \n \nInterest Income and Expense\n \nThe Company earns interest income and incurs interest expense primarily in connection with its electronic brokerage customer business and its securities lending activities, which are recorded on an accrual basis and are included in “Interest income” and “Interest expense,” respectively, in the consolidated statements of comprehensive income. \n \nPrincipal Transactions\n \nPrincipal transactions include gains and losses as a result of changes in the fair value of financial instruments owned, at fair value, financial instruments sold, but not yet purchased, at fair value, and other investments measured at fair value (i.e., unrealized gains and losses) and realized gains and losses related to the Company’s principal transactions. Included are net gains and losses on stocks, options, U.S. and foreign government securities, municipal securities, futures, foreign exchange, precious metals and other derivative instruments, which are reported on a net basis in “Other income” in the consolidated statements of comprehensive income. Dividends are integral to the valuation of stocks. Accordingly, dividend income and expense attributable to financial instruments owned, at fair value and financial instruments sold, but not yet purchased, at fair value, are reported on a net basis in “Other income” in the consolidated statements of comprehensive income.\n \nForeign Currency Gains and Losses\n \nForeign currency balances are assets and liabilities in currencies other than the Company’s functional currency. At every reporting date, the Company revalues its foreign currency balances to its functional currency at the spot exchange rate and records the associated foreign currency gains and losses. These foreign currency gains and losses are reported in the consolidated statements of comprehensive income, as follows: (a) foreign currency gains and losses related to the Company’s currency diversification strategy are reported in “Other income”; (b) foreign currency gains and losses arising from currency swap transactions are reported in “Interest income” or “Interest expense”; and (c) all other foreign currency gains and losses are reported in “Other income\n.”\n \nRebates\n \nRebates consist of volume discounts, credits, or payments received from exchanges or other market centers related to the placement and/or removal of liquidity from the marketplace and are recorded on an accrual basis. Rebates are recorded net within “Execution, clearing and distribution fees” in the consolidated statements of comprehensive income. Rebates received for trades executed on behalf of customers that elect tiered pricing are passed, in whole or part, to these customers, and such pass-through amounts are recorded net within “Commissions” in the consolidated statements of comprehensive income.\n \nStock\n-\nBased Compensation \n \nThe Company follows FASB ASC Topic 718, “\nCompensation - Stock Compensation” (“ASC Topic 718”)\n, to account for its stock\n-\nbased compensation plans. ASC Topic 718 requires all share\n-\nbased payments to employees to be recognized in the consolidated financial statements using a fair value\n-\nbased method. Grants, which are denominated in U.S. dollars, are communicated to employees in the year of the grant, thereby establishing the fair value of each grant. The fair value of awards granted to employees are generally expensed as follows: \n50\n% in the year of grant in recognition of the plans’ post-employment provisions (as described below) and the remaining \n50\n% over the related vesting period utilizing the “graded vesting” method permitted under ASC Topic 718. In the case of “retirement eligible” employees (those employees older than 59), \n100\n% of awards are expensed when granted.\n \nAwards granted under stock\n-\nbased compensation plans are subject to the plans’ post-employment provisions in the event an employee ceases employment with the Company. The plans provide that employees who discontinue employment with the Company without cause and continue to meet the terms of the plans’ post\n-\nemployment provisions will be eligible to earn \n50\n% of previously granted but not yet earned awards, unless the employee is over the age of 59, in which case the employee would be eligible to receive \n100\n% of previously granted but not yet earned awards.\n‎\n \n\n\n79\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\nIncome Taxes\n \nThe Company accounts for income taxes in accordance with FASB ASC Topic 740, “\nIncome Taxes” (“ASC Topic 740”)\n.\n The Company’s income tax expense, deferred tax assets and liabilities, and reserves for unrecognized tax benefits are based on enacted tax laws (see Note 11) and reflect management’s best assessment of estimated future taxes to be paid. The Company is subject to income taxes in the U.S. and numerous foreign jurisdictions. Determining income tax expense requires significant judgment and estimates. Deferred income tax assets and liabilities arise from temporary differences between the tax and financial statement recognition of underlying assets and liabilities. In evaluating the ability to recover deferred tax assets within the jurisdictions from which they arise, the Company considers all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax\n-\nplanning strategies and results of recent operations. In projecting future taxable income, historical results are adjusted for changes in accounting policies and incorporate assumptions including the amount of future state, federal and foreign pre-tax operating income, the reversal of temporary differences, and the implementation of feasible and prudent tax\n-\nplanning strategies. These assumptions require significant judgment about the forecasts of future taxable income and are consistent with the plans and estimates the Company is using to manage the underlying businesses. In evaluating the objective evidence that historical results provide, three years of cumulative operating income (loss) are considered. Deferred income taxes have not been provided for U.S. tax liabilities or for additional foreign taxes on the unremitted earnings of foreign subsidiaries that have been indefinitely reinvested.\n \nThe calculation of the Company’s tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across the Company’s global operations. Changes in tax laws and rates could also affect recorded deferred tax assets and liabilities in the future. On December 15, 2022, the European Union (“EU”) formally adopted the EU’s Pillar Two Directive, effective January 1, 2024, which provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Cooperation and Development (“OECD”) Pillar Two Framework. A significant number of other countries have either already or are expected to implement similar legislation with varying effective dates. The Company is continuing to evaluate the potential impact of the EU’s Pillar Two Directive and similar legislations adopted by other countries (collectively, “Pillar Two Directives”), but based on \ncurrent guidance, the Company believes that its results of operations, financial condition and cash flows will not be materially impacted by such Pillar Two Directives.\n \nThe Company records tax liabilities in accordance with ASC Topic 740 and adjusts these liabilities when management’s judgment changes as a result of the evaluation of new information not previously available. Because of the complexity of some of these uncertainties, the ultimate resolution may result in payments that are different from the current estimates of these tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which new information becomes available.\n \nThe Company recognizes a tax benefit from an uncertain tax position only when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, on the basis of the technical merits. A tax position that meets this standard is measured at the largest amount of benefit that will more likely than not be realized on settlement.\n \nThe Company recognizes interest related to income tax matters as interest income or interest expense and penalties related to income tax matters as “Income tax expense” in the consolidated statements of comprehensive income.\n‎\n \n\n\n80\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\nStandards Adopted During 2024\n \n \n \n \n \n \n \nStandard\n \nSummary of guidance\n \nEffect on financial statements\nSegment Reporting (Topic 280)\n‎\n‎\nIssued November 2023\n \n\nRequires public entities with a single reportable segment to provide all new and existing segment disclosures required by FASB ASC Topic 280, “Segment Reporting”.\n\nRequires public entities to disclose significant segment expenses that are regularly reported to the chief operating decision maker (“CODM”) and included within each measure of segment profit or loss, as well as the title and position of the CODM and an explanation on how the CODM uses segment profit and loss in assessing segment performance.\n‎\n \n\nEffective date: January 1, 2024 and for interim periods effective January 1, 2025.\n\nThe Company has determined that it has a single reportable segment managed on a consolidated basis and has included the required disclosures in the notes to the consolidated financial statements - see Note 15 – Segment Reporting and Geographic Information. \n \n \n \n \n \nRescinds SAB 121, Accounting for the Obligations to Safeguard\nCrypto-assets, \nSAB 122\n‎\n‎\nIssued January 2025\n \n\nRescinds SAB 121, which required companies that have obligations to safeguard crypto-assets held for their platform users to recognize a liability to reflect such obligation and a corresponding asset in the balance sheet, both measured at the fair value of the crypto-assets.\n \n \n\nEffective date: January 1, 2025, on a fully retrospective basis, with early adoption permitted.\n\nThe Company early adopted SAB 122 as of December 31, 2024, which resulted in the derecognition of the crypto-assets safeguarding liability and the corresponding crypto-asset safeguarding asset from its consolidated statements of financial condition for all periods presented.\n \n \n \n \n \n \nFASB Standards issued but not adopted as of December 31, 2024\n \n \n \n \n \n \n \n \n \n \n \n \nStandard\n \nSummary of guidance\n \nEffect on financial statements\nIncome Taxes (Topic 740)\n‎\n‎\nIssued December 2023\n \n\nRequires companies to disclose specific categories in the rate reconciliation and provide additional information for reconciling items that meet a quantitative threshold.\n\nRequires companies to disclose the amount of income taxes paid disaggregated by federal, state, and foreign taxes and amount of income taxes paid disaggregated by individual jurisdictions in which income taxes paid is equal to or greater than five percent of total income taxes paid.\n\nRequires companies to disclose income (or loss) from continuing operations before income tax expense (or benefit) disaggregated between domestic and foreign and income tax expense (or benefit) from continuing operations disaggregated by federal, state, and foreign.\n \n\nEffective for annual periods beginning after December 15, 2024.\n\nThe Company is currently assessing the impact to its consolidated financial statements. \n \n \n \n \n \n \n \n \n \n \n \n \n‎\n \n\n\n81\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \n \n \nStandard\n \nSummary of guidance\n \nEffect on financial statements\nIntangibles - Goodwill and Other - Crypto Assets (Subtopic 350-60)\n‎\n‎\nIssued December 2023\n \n\nRequires companies to subsequently measure crypto assets that meet certain criteria at fair value with changes recognized in net income.\n\nRequires companies to disclose the name, cost basis, fair value, and number of units for each significant crypto asset holding and the aggregate fair values and cost basis of the crypto asset holdings that are not individually significant.\n\nRequires companies to disclose a roll forward, in the aggregate, of activity for crypto asset holdings, including additions dispositions, gains, and losses. \n \n\nEffective for fiscal years beginning after December 15, 2024, including interim periods within those fiscal years.\n\nThe changes are not expected to have a material impact on the Company’s consolidated financial statements.\n \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures\n(Subtopic 220-40)\n‎\n‎\nIssued November 2024\n \n\nRequires companies to disclose the amounts of employee compensation, depreciation, and intangible asset amortization included in each relevant expense caption.\n\nRequires companies to include certain amounts already required to be disclosed under current U.S. GAAP in the same disclosure as the other disaggregation requirements. \n\nDisclose the total amount of selling expenses and the company's definition of selling expenses.\n\nRequires companies to disclose a qualitative description of amounts remaining in relevant expense captions that are not separately disaggregated.\n \n\nEffective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027.\n\nThe Company is currently assessing the impact to its consolidated financial statements.\n \n \n \n \n \n \n \n \n \n \n‎\n \n\n\n82\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n3.  Trading Activities and Related Risks\n \nTrading activities expose the Company to market and credit risks. These risks are managed in accordance with established risk management policies and procedures. To accomplish this, management has established a risk management process that includes:\n \n•\na regular review of the risk management process by executive management as part of its oversight role;\n \n•\ndefined risk management policies and procedures supported by a rigorous analytic framework; and\n \n•\narticulated risk tolerance levels as defined by executive management that are regularly reviewed to ensure that the Company’s risk\n-\ntaking is consistent with its business strategy, its capital structure, and current and anticipated market conditions.\n \nMarket Risk\n \nThe Company is exposed to various market risks. Exposures to market risks arise from equity price risk, foreign currency exchange rate fluctuations and changes in interest rates. The Company seeks to mitigate market risk associated with trading inventories by employing hedging strategies that correlate rate, price and spread movements of trading inventories and related financing and hedging activities. The Company uses a combination of cash instruments and exchange-traded derivatives to hedge its market exposures. The Company does not apply hedge accounting. The following discussion describes the types of market risk faced:\n \nEquity Price Risk\n \nEquity price risk arises from the possibility that equity security prices will fluctuate, affecting the value of equity securities and other instruments that derive their value from a particular stock, a defined basket of stocks, or a stock index. The Company is subject to equity price risk primarily in financial instruments owned, at fair value and financial instruments sold, but not yet purchased, at fair value. The Company attempts to limit such risks by continuously reevaluating prices and by diversifying its portfolio across many different options, futures and underlying securities and avoiding concentrations of positions based on the same underlying security.\n \nInterest Rate Risk\n \nInterest rate risk arises from the possibility that changes in interest rates will affect the value of financial instruments. The Company is exposed to interest rate risk on cash and margin balances, positions carried in equity and fixed income securities, options, futures and on its borrowings. These risks are managed through investment policies and by entering into interest rate futures contracts.\n \nCurrency Risk\n \nCurrency risk arises from the possibility that fluctuations in foreign exchange rates will impact the value of financial instruments. The Company manages this risk using spot (i.e., cash) currency transactions, currency futures contracts and currency forward contracts. The Company actively manages its currency exposure using a currency diversification strategy that is based on a defined basket of ten currencies internally referred to as the “GLOBAL.” These strategies minimize the fluctuation of the Company’s equity as expressed in GLOBALs, thereby diversifying its risk in alignment with these global currencies, weighted by the Company’s view of their importance. As the Company’s financial results are reported in U.S. dollars, the change in the value of the GLOBAL as expressed in U.S. dollars affects the Company’s earnings. The impact of this currency diversification strategy in the Company’s earnings is included in “Other income” in the consolidated statements of comprehensive income.\n \n‎\n \n\n\n83\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nCredit Risk\n \nThe Company is exposed to the risk of loss if a customer, counterparty or issuer fails to perform its obligations under contractual terms (“default risk”). Both cash instruments and derivatives expose the Company to default risk. The Company has established policies and procedures for mitigating credit risk on principal transactions, including reviewing and establishing limits for credit exposure, maintaining collateral and continually assessing the creditworthiness of counterparties.\n \nThe Company’s credit risk is limited as contracts entered into are settled directly at securities and commodities clearing houses or are settled through member firms and banks with substantial financial and operational resources. \nOver-the-counter transactions, such as securities lending and contracts for differences (“CFDs”), are marked to market daily and are conducted with counterparties that have undergone a thorough credit review.\n The Company seeks to control the risks associated with its customer margin activities by requiring customers to maintain collateral in compliance with regulatory and internal guidelines.\n \nIn the normal course of business, the Company executes, settles and finances various customer securities transactions. Execution of these transactions includes the purchase and sale of securities which exposes the Company to default risk arising from the potential that customers or counterparties may fail to satisfy their obligations. In these situations, the Company may be required to purchase or sell financial instruments at unfavorable market prices to satisfy obligations to customers or counterparties. Liabilities to other brokers and dealers related to unsettled transactions (i.e., securities fails to receive) are recorded at the amount for which the securities were purchased, and are paid upon receipt of the securities from other brokers or dealers. In the case of aged securities fails to receive, the Company may purchase the underlying security in the market and seek reimbursement for any losses from the counterparty.\n \nFor cash management purposes, the Company enters into short\n-\nterm securities purchased under agreements to resell and securities sold under agreements to repurchase transactions (“repos”) in addition to securities borrowing and lending arrangements, all of which may result in credit exposure in the event the counterparty to a transaction is unable to fulfill its contractual obligations. Repos are collateralized by securities with a market value in excess of the obligation under the contract. Similarly, securities lending agreements are collateralized by deposits of cash or securities. The Company attempts to minimize credit risk associated with these activities by monitoring collateral values daily and requiring additional collateral to be deposited with or returned to the Company as permitted under contractual provisions.\n \nConcentrations of Credit Risk\n \nThe Company’s exposure to credit risk associated with its trading and other activities is measured on an individual counterparty basis, as well as by groups of counterparties that share similar attributes. Concentrations of credit risk can be affected by changes in political, industry, or economic factors. To reduce the potential for risk concentration, credit limits are established and exposure is monitored in light of changing counterparty and market conditions. As of December 31, 2024, the Company did not have any material concentrations of credit risk outside the ordinary course of business.\n \nOff\n-\nBalance Sheet Risks\n \nThe Company may be exposed to a risk of loss not reflected in the consolidated financial statements to settle futures and certain over\n-\nthe\n-\ncounter contracts at contracted prices, which may require repurchase or sale of the underlying products in the market at prevailing prices. Accordingly, these transactions result in off\n-\nbalance sheet risk as the Company’s cost to liquidate such contracts may exceed the amounts reported in the Company’s consolidated statements of financial condition.\n \n \n4.  Equity and Earnings per Share\n \nIn connection with IBG, Inc.’s initial public offering of Class A common stock (“IPO”) in May 2007, it purchased \n10.0\n% of the membership interests in IBG LLC from IBG Holdings LLC (“Holdings”), became the sole managing member of IBG LLC and began to consolidate IBG LLC’s financial results into its financial statements. Holdings owns all of IBG, Inc.’s Class B common stock, which has voting rights in proportion to its ownership interests in IBG LLC\n. The table below presents the amount of IBG LLC membership interests held by IBG, Inc. and Holdings as of \nDecember 31\n, 2024.\n \n \n \n \n \n \n \n \n \n \n \nIBG, Inc.\n \nHoldings\n \nTotal\nOwnership %\n25.8\n%\n \n74.2\n%\n \n100.0\n%\nMembership interests\n \n108,931,614\n \n \n313,643,354\n \n \n422,574,968\n \n‎\n \n\n\n84\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThese consolidated financial statements reflect the results of operations and financial position of IBG, Inc., including consolidation of its investment in IBG LLC and its subsidiaries. The noncontrolling interests in IBG LLC attributable to Holdings are reported as a component of “Total equity” in the consolidated statements of financial condition.\n \nRecapitalization and Post\n-\nIPO Capital Structure\n \nImmediately before and immediately following the consummation of the IPO, IBG, Inc., Holdings, IBG LLC and the members of IBG LLC consummated a series of transactions collectively referred to herein as the “Recapitalization.” In connection with the Recapitalization, IBG, Inc., Holdings and the historical members of IBG LLC entered into an exchange agreement, dated as of May 3, 2007 (the “Exchange Agreement”), under which the historical members of IBG LLC received membership interests in Holdings in exchange for their membership interests in IBG LLC. Additionally, IBG, Inc. became the sole managing member of IBG LLC.\n \nIn connection with the consummation of the IPO, Holdings used the net proceeds to redeem \n10.0\n% of members’ interests in Holdings in proportion to their interests. Immediately following the Recapitalization and IPO, Holdings owned approximately \n90\n% of IBG LLC and \n100\n% of IBG, Inc.’s Class B common stock.\n \nSince the consummation of the IPO and Recapitalization, IBG, Inc.’s equity capital structure has been comprised of Class A and Class B common stock. All shares of common stock have a par value of $\n0.01\n per share and have identical rights to earnings and dividends and in liquidation. The below table presents the authorized, issued, and outstanding shares for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \nAuthorized\n \nIssued\n \nOutstanding\n \nAuthorized\n \nIssued\n \nOutstanding\n \n \n \n \n \n \n \n \n \n \n \n \n \nClass A common stock\n \n \n1,000,000,000\n \n \n109,061,059\n \n \n108,904,613\n \n \n1,000,000,000\n \n \n107,178,928\n \n \n107,045,894\nClass B common stock\n \n \n100\n \n \n100\n \n \n100\n \n \n100\n \n \n100\n \n \n100\nPreferred stock\n \n \n10,000\n \n -\n \n -\n \n \n10,000\n \n -\n \n -\n \nAs a result of a federal income tax election made by IBG LLC applicable to the acquisition of IBG LLC member interests by IBG, Inc., the income tax basis of the assets of IBG LLC acquired by IBG, Inc. have been adjusted based on the amount paid for such interests. Deferred tax assets were recorded as of the IPO date and in connection with subsequent redemptions of Holdings member interests in exchange for common stock. These deferred tax assets are included in “Other assets” in the Company’s consolidated statements of financial condition and are being amortized as additional deferred income tax expense over \n15\n years from the IPO date and from the additional redemption dates, respectively, as allowable under current tax law. \nAs of \nDecember 31, 2024 and 2023\n, the unamortized balance of these deferred tax assets was $\n196\n million and $\n197\n million, respectively.\n \nIBG, Inc. also entered into an agreement (the “Tax Receivable Agreement”) with Holdings to pay Holdings (for the benefit of the former members of IBG LLC) \n85\n% of the tax savings that IBG, Inc. actually realizes as the result of tax basis increases. These payables to Holdings are reported as “Payable to affiliate” in the Company’s consolidated statements of financial condition. The remaining \n15\n% is accounted for as a permanent increase to “Additional paid\n-\nin capital” in the Company’s consolidated statements of financial condition. \n \nThe cumulative amounts of deferred tax assets, payables to Holdings and additional paid\n-\nin capital arising from stock offerings from the date of the IPO through\n \nDecember 31, 2024\n were $\n688\n million, $\n585\n million and $\n103\n million, respectively. \nAmounts payable under the Tax Receivable Agreement are payable to Holdings annually following the filing of IBG, Inc.’s federal income tax return. The Company has paid Holdings a cumulative total of\n $\n293\n million through \nDecember 31, 2024\n under the terms of the Tax Receivable Agreement.\n \nThe Exchange Agreement, as amended, provides for future redemptions of member interests and for the purchase of member interests in IBG LLC by IBG, Inc. from Holdings, which could result in IBG, Inc. acquiring the remaining member interests in IBG LLC that it does not own. On an annual basis, members of Holdings can request redemption of their interests. \n \nAt the time of IBG, Inc.’s IPO in 2007, three hundred sixty (\n360\n) million shares of authorized common stock were reserved for future sales and redemptions. From 2008 through 2010, Holdings redeemed \n5,013,259\n IBG LLC interests with a total value of $\n114\n million, which redemptions were funded using cash on hand at IBG LLC. Upon cash redemption, these IBG LLC interests were retired. From 2011 through 2023, IBG, Inc. issued \n40,111,445\n shares of common stock (with a fair value of $\n1.9\n billion) directly to Holdings in exchange for an equivalent number of member interests in IBG LLC. \nOn July 25, 2024, the Company filed a Prospectus Supplement on Form 424B5 (File Number 333-273451) with the SEC to issue \n333,000\n shares of common stock (with a fair value of $\n39\n million) in exchange for an equivalent number of shares of member interests in IBG LLC, in accordance with the Exchange Agreement.\n‎\n\n\n85\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nOn July 26, 2023, the Company filed a Prospectus Supplement on Form 424B (File Number 333-273451) with the SEC to re-register up to \n630,000\n shares of common stock, offering the opportunity for eligible persons to receive awards in the form of an offer to receive such shares by participating in one or more promotions that are designed to attract new customers to the Company’s brokerage platform, increase assets held with the Company’s brokerage business and enhance customer loyalty. The Company has authorized a total of \n1,000,000\n shares of common stock to be issued under these promotions. \nFrom 2019 through 2024, the Company issued \n620,000\n shares to IBG LLC for distribution to eligible customers of certain of its subsidiaries.\n \n \nAs a consequence of redemption transactions in accordance with the Exchange Agreement, distribution of shares to customers under one or more promotions, and distribution of shares to employees (see \nNote 10), IBG, Inc.’s interest in IBG LLC has increased to approximately \n25.8\n%, with Holdings owning the remaining \n74.2\n% as of \nDecember 31\n, 2024. \nThe redemptions also increased the Holdings interest held by Mr. Thomas Peterffy and his affiliates from approximately \n84.6\n% at the IPO to approximately\n \n91.4\n% as of \nDecember 31\n, 2024. \n \nEarnings per Share\n \nBasic earnings per share is calculated utilizing net income available for common stockholders divided by the weighted average number of shares of Class A and Class B common stock outstanding for that period.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions, except share or per share amounts)\n \n \n \n \n \n \n \n \n \n \nBasic earnings per share\n \n \n \n \n \n \n \n \n \nNet income available for common stockholders\n \n$\n \n755\n \n$\n \n600\n \n$\n \n380\nWeighted average shares of common stock outstanding\n \n \n \n \n \n \n \n \n \nClass A\n \n \n \n108,112,099\n \n \n \n104,964,950\n \n \n \n100,459,916\nClass B\n \n \n \n100\n \n \n \n100\n \n \n \n100\n \n \n \n \n108,112,199\n \n \n \n104,965,050\n \n \n \n100,460,016\nBasic earnings per share \n \n$\n \n6.99\n \n$\n \n5.72\n \n$\n \n3.78\n \nDiluted earnings per share are calculated utilizing the Company’s basic net income available for common stockholders divided by diluted weighted average shares outstanding with no adjustments to net income available to common stockholders for potentially dilutive common shares.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions, except share or per share amounts)\n \n \n \n \n \n \n \n \n \n \nDiluted earnings per share\n \n \n \n \n \n \n \n \n \nNet income available for common stockholders \n \n$\n \n755\n \n$\n \n600\n \n$\n \n380\nWeighted average shares of common stock outstanding\n \n \n \n \n \n \n \n \n \nClass A\n \n \n \n \n \n \n \n \n \nIssued and outstanding \n \n \n \n108,112,099\n \n \n \n104,964,950\n \n \n \n100,459,916\nPotentially dilutive common shares\n \n \n \n \n \n \n \n \n \nIssuable pursuant to employee stock incentive plans\n \n \n \n890,739\n \n \n \n881,827\n \n \n \n839,593\nClass B \n \n \n \n100\n \n \n \n100\n \n \n \n100\n \n \n \n \n109,002,938\n \n \n \n105,846,877\n \n \n \n101,299,609\nDiluted earnings per share \n \n$\n \n6.93\n \n$\n \n5.67\n \n$\n \n3.75\n \n‎\n \n\n\n86\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nMember Distributions and Stockholder Dividends\n \nDuring the three years ended December 31, 2024, 2023, and 2022, IBG LLC made distributions totaling $\n961\n million, $\n741\n million and $\n533\n million to its members, of which IBG, Inc.’s proportionate share was $\n246\n million, $\n185\n million and $\n128\n million, respectively. The Company paid quarterly cash dividends of $\n0.10\n per share of common stock, totaling $\n42\n million and $\n40\n million during 2023 and 2022, respectively. In April of 2024 the Company increased the cash dividend paid from $\n0.10\n per share of common stock to $\n0.25\n, paying dividends totaling $\n92\n million during 2024. \n \nOn \nJanuary 21, 2025\n, the Company declared a cash dividend of $\n0.25\n per share of common stock, payable on \nMarch 14, 2025\n, to stockholders of record as of \nFebruary 28, 2025\n.\n \n5.  Comprehensive Income\n \nThe table below presents comprehensive income and earnings per share on comprehensive income for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions, except share or per share amounts)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nComprehensive income available for common stockholders\n \n$\n \n702\n \n$\n \n630\n \n$\n \n354\n \n \n \n \n \n \n \n \n \n \nEarnings per share on comprehensive income\n \n \n \n \n \n \n \n \n \nBasic \n \n$\n \n6.50\n \n$\n \n6.00\n \n$\n \n3.53\nDiluted \n \n$\n \n6.44\n \n$\n \n5.95\n \n$\n \n3.50\nWeighted average common shares outstanding\n \n \n \n \n \n \n \n \n \nBasic \n \n \n \n108,112,199\n \n \n \n104,965,050\n \n \n \n100,460,016\nDiluted \n \n \n \n109,002,938\n \n \n \n105,846,877\n \n \n \n101,299,609\n \n‎\n \n\n\n87\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n6.  Financial Assets and Financial Liabilities\n \nFinancial Assets and Liabilities Measured at Fair Value on a Recurring Basis\n \nThe tables below present, by level within the fair value hierarchy (see Note 2), financial assets and liabilities, measured at fair value on a recurring basis for the periods indicated. As required by ASC Topic 820, financial assets and financial liabilities are classified in their entirety based on the lowest level of input that is significant to the respective fair value measurement. \nThe Company early adopted SAB 122 with retrospective application to all prior periods presented. Previously reported amounts have been adjusted to conform with the current period presentation (see Note 2 Significant Accounting Policies - Crypto-assets safeguarding liability and corresponding safeguarding asset).\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial Assets at Fair Value as of December 31, 2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nLevel 1\n \nLevel 2\n \nLevel 3\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities segregated for regulatory purposes\n \n \n \n \n \n \n \n \n \n \n \n \nU.S. and foreign government securities\n \n$\n \n6,460\n \n$\n —\n \n$\n —\n \n$\n \n6,460\nMunicipal securities\n \n \n —\n \n \n \n33\n \n \n —\n \n \n \n33\nTotal securities segregated for regulatory purposes\n \n \n \n6,460\n \n \n \n33\n \n \n —\n \n \n \n6,493\n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial instruments owned, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \nStocks \n \n \n \n1,763\n \n \n —\n \n \n —\n \n \n \n1,763\nOptions \n \n \n \n84\n \n \n —\n \n \n —\n \n \n \n84\nU.S. and foreign government securities\n \n \n \n54\n \n \n —\n \n \n —\n \n \n \n54\nMutual funds\n \n \n \n2\n \n \n —\n \n \n —\n \n \n \n2\nPrecious metals \n \n \n —\n \n \n \n21\n \n \n —\n \n \n \n21\nCurrency forward contracts \n \n \n —\n \n \n —\n \n \n —\n \n \n —\nTotal financial instruments owned, at fair value\n \n \n \n1,903\n \n \n \n21\n \n \n —\n \n \n \n1,924\n \n \n \n \n \n \n \n \n \n \n \n \n \nOther assets\n \n \n \n \n \n \n \n \n \n \n \n \nCustomer-held fractional shares\n \n \n \n260\n \n \n —\n \n \n —\n \n \n \n260\nOther investments in equity securities\n \n \n \n32\n \n \n —\n \n \n —\n \n \n \n32\nTotal other assets \n \n \n \n292\n \n \n —\n \n \n —\n \n \n \n292\nTotal financial assets at fair value\n \n$\n \n8,655\n \n$\n \n54\n \n$\n —\n \n$\n \n8,709\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial Liabilities at Fair Value as of December 31, 2024\n \n \nLevel 1\n \nLevel 2\n \nLevel 3\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial instruments sold, but not yet purchased, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \nStocks \n \n$\n \n116\n \n$\n —\n \n$\n —\n \n$\n \n116\nOptions \n \n \n \n96\n \n \n —\n \n \n —\n \n \n \n96\nPrecious metals\n \n \n —\n \n \n \n18\n \n \n —\n \n \n \n18\nCurrency forward contracts \n \n \n —\n \n \n \n63\n \n \n —\n \n \n \n63\nTotal financial instruments sold, but not yet purchased, at fair value\n \n \n \n212\n \n \n \n81\n \n \n —\n \n \n \n293\n \n \n \n \n \n \n \n \n \n \n \n \n \nAccounts payable, accrued expenses and other liabilities\n \n \n \n \n \n \n \n \n \n \n \n \nFractional shares repurchase obligation\n \n \n \n260\n \n \n —\n \n \n —\n \n \n \n260\nTotal accounts payable, accrued expenses and other liabilities\n \n \n \n260\n \n \n —\n \n \n —\n \n \n \n260\nTotal financial liabilities at fair value\n \n$\n \n472\n \n$\n \n81\n \n$\n —\n \n$\n \n553\n \n‎\n \n\n\n88\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial Assets at Fair Value as of December 31, 2023\n \n \nLevel 1\n \nLevel 2\n \nLevel 3\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities segregated for regulatory purposes\n \n \n \n \n \n \n \n \n \n \n \n \nU.S. and foreign government securities\n \n$\n \n5,684\n \n$\n —\n \n$\n —\n \n$\n \n5,684\nMunicipal securities\n \n \n —\n \n \n \n70\n \n \n —\n \n \n \n70\nTotal securities segregated for regulatory purposes\n \n \n \n5,684\n \n \n \n70\n \n \n —\n \n \n \n5,754\n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial instruments owned, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \nStocks \n \n \n \n1,023\n \n \n —\n \n \n —\n \n \n \n1,023\nOptions \n \n \n \n354\n \n \n —\n \n \n —\n \n \n \n354\nU.S. and foreign government securities\n \n \n \n39\n \n \n —\n \n \n —\n \n \n \n39\nPrecious metals \n \n \n —\n \n \n \n12\n \n \n —\n \n \n \n12\nCurrency forward contracts \n \n \n —\n \n \n \n60\n \n \n —\n \n \n \n60\nTotal financial instruments owned, at fair value\n \n \n \n1,416\n \n \n \n72\n \n \n —\n \n \n \n1,488\n \n \n \n \n \n \n \n \n \n \n \n \n \nOther assets\n \n \n \n \n \n \n \n \n \n \n \n \nCustomer-held fractional shares\n \n \n \n144\n \n \n —\n \n \n —\n \n \n \n144\nOther investments in equity securities\n \n \n \n44\n \n \n —\n \n \n —\n \n \n \n44\nTotal other assets \n \n \n \n188\n \n \n —\n \n \n —\n \n \n \n188\nTotal financial assets at fair value\n \n$\n \n7,288\n \n$\n \n142\n \n$\n —\n \n$\n \n7,430\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial Liabilities at Fair Value as of December 31, 2023\n \n \nLevel 1\n \nLevel 2\n \nLevel 3\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nFinancial instruments sold, but not yet purchased, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \nStocks \n \n$\n \n77\n \n$\n —\n \n$\n —\n \n$\n \n77\nOptions \n \n \n \n104\n \n \n —\n \n \n —\n \n \n \n104\nPrecious metals \n \n \n —\n \n \n \n7\n \n \n —\n \n \n \n7\nCurrency forward contracts \n \n \n —\n \n \n \n5\n \n \n —\n \n \n \n5\nTotal financial instruments sold, but not yet purchased, at fair value\n \n \n \n181\n \n \n \n12\n \n \n —\n \n \n \n193\n \n \n \n \n \n \n \n \n \n \n \n \n \nAccounts payable, accrued expenses and other liabilities\n \n \n \n \n \n \n \n \n \n \n \n \nFractional shares repurchase obligation\n \n \n \n144\n \n \n —\n \n \n —\n \n \n \n144\nTotal accounts payable, accrued expenses and other liabilities\n \n \n \n144\n \n \n —\n \n \n —\n \n \n \n144\nTotal financial liabilities at fair value\n \n$\n \n325\n \n$\n \n12\n \n$\n —\n \n$\n \n337\n \nLevel 3 Financial Assets and Financial Liabilities\n \nThere were \nno\n transfers in or out of level 3 for the year ended December 31, 2024.\n \n\n\n89\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nFinancial Assets and Liabilities Not Measured at Fair Value\nFinancial assets and liabilities not measured at fair value are recorded at carrying value, which approximates fair value due to their short-term nature. The tables below represent the carrying value, fair value and fair value hierarchy category of certain financial assets and liabilities that are not recorded at fair value in the Company's consolidated statements of financial condition for the periods indicated. The tables below exclude certain financial instruments such as equity method investments and all non-financial assets and liabilities.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2024\n \n \nCarrying \n‎\nValue\n \nFair \n‎\nValue\n \nLevel 1\n \nLevel 2\n \nLevel 3\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nFinancial assets, not measured at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCash and cash equivalents \n \n$\n \n3,633\n \n$\n \n3,633\n \n$\n \n3,633\n \n$\n —\n \n$\n \n—\nCash - segregated for regulatory purposes \n \n \n \n36,600\n \n \n \n36,600\n \n \n \n36,600\n \n \n —\n \n \n \n—\nSecurities - segregated for regulatory purposes \n \n \n \n21,353\n \n \n \n21,353\n \n \n —\n \n \n \n21,353\n \n \n \n—\nSecurities borrowed \n \n \n \n5,369\n \n \n \n5,369\n \n \n —\n \n \n \n5,369\n \n \n \n—\nSecurities purchased under agreements to resell \n \n \n \n6,575\n \n \n \n6,575\n \n \n —\n \n \n \n6,575\n \n \n \n—\nReceivables from customers\n \n \n \n64,432\n \n \n \n64,432\n \n \n —\n \n \n \n64,432\n \n \n \n—\nReceivables from brokers, dealers and clearing organizations\n \n \n \n2,196\n \n \n \n2,196\n \n \n —\n \n \n \n2,196\n \n \n \n—\nInterest receivable\n \n \n \n446\n \n \n \n446\n \n \n —\n \n \n \n446\n \n \n \n—\nOther assets \n \n \n \n30\n \n \n \n32\n \n \n —\n \n \n \n3\n \n \n \n29\nTotal financial assets, not measured at fair value\n \n$\n \n140,634\n \n$\n \n140,636\n \n$\n \n40,233\n \n$\n \n100,374\n \n$\n \n29\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial liabilities, not measured at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nShort-term borrowings \n \n$\n \n14\n \n$\n \n14\n \n$\n \n—\n \n$\n \n14\n \n$\n \n—\nSecurities loaned \n \n \n \n16,248\n \n \n \n16,248\n \n \n \n—\n \n \n \n16,248\n \n \n \n—\nPayables to customers\n \n \n \n115,343\n \n \n \n115,343\n \n \n \n—\n \n \n \n115,343\n \n \n \n—\nPayables to brokers, dealers and clearing organizations\n \n \n \n476\n \n \n \n476\n \n \n \n—\n \n \n \n476\n \n \n \n—\nInterest payable\n \n \n \n311\n \n \n \n311\n \n \n \n—\n \n \n \n311\n \n \n \n—\nTotal financial liabilities, not measured at fair value\n \n$\n \n132,392\n \n$\n \n132,392\n \n$\n \n—\n \n$\n \n132,392\n \n$\n \n—\n \n‎\n \n\n\n90\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2023\n \n \nCarrying \n‎\nValue\n \nFair \n‎\nValue\n \nLevel 1\n \nLevel 2\n \nLevel 3\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial assets, not measured at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCash and cash equivalents \n \n$\n \n3,753\n \n$\n \n3,753\n \n$\n \n3,753\n \n$\n —\n \n$\n \n—\nCash - segregated for regulatory purposes \n \n \n \n28,840\n \n \n \n28,840\n \n \n \n28,840\n \n \n —\n \n \n \n—\nSecurities - segregated for regulatory purposes \n \n \n \n29,632\n \n \n \n29,632\n \n \n —\n \n \n \n29,632\n \n \n \n—\nSecurities borrowed \n \n \n \n5,835\n \n \n \n5,835\n \n \n —\n \n \n \n5,835\n \n \n \n—\nSecurities purchased under agreements to resell \n \n \n \n5,504\n \n \n \n5,504\n \n \n —\n \n \n \n5,504\n \n \n \n—\nReceivables from customers\n \n \n \n44,472\n \n \n \n44,472\n \n \n —\n \n \n \n44,472\n \n \n \n—\nReceivables from brokers, dealers and clearing organizations\n \n \n \n1,643\n \n \n \n1,643\n \n \n —\n \n \n \n1,643\n \n \n \n—\nInterest receivable\n \n \n \n375\n \n \n \n375\n \n \n —\n \n \n \n375\n \n \n \n—\nOther assets \n \n \n \n22\n \n \n \n23\n \n \n —\n \n \n \n2\n \n \n \n21\nTotal financial assets, not measured at fair value\n \n$\n \n120,076\n \n$\n \n120,077\n \n$\n \n32,593\n \n$\n \n87,463\n \n$\n \n21\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFinancial liabilities, not measured at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nShort-term borrowings \n \n$\n \n17\n \n$\n \n17\n \n$\n \n—\n \n$\n \n17\n \n$\n \n—\nSecurities loaned \n \n \n \n11,347\n \n \n \n11,347\n \n \n \n—\n \n \n \n11,347\n \n \n \n—\nPayables to customers\n \n \n \n101,012\n \n \n \n101,012\n \n \n \n—\n \n \n \n101,012\n \n \n \n—\nPayables to brokers, dealers and clearing organizations\n \n \n \n590\n \n \n \n590\n \n \n \n—\n \n \n \n590\n \n \n \n—\nInterest payable\n \n \n \n311\n \n \n \n311\n \n \n \n—\n \n \n \n311\n \n \n \n—\nTotal financial liabilities, not measured at fair value\n \n$\n \n113,277\n \n$\n \n113,277\n \n$\n \n—\n \n$\n \n113,277\n \n$\n \n—\n \n‎\n \n\n\n91\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nNetting of Financial Assets and Financial Liabilities\n \nThe Company’s policy is to net securities borrowed and securities loaned, and securities purchased under agreements to resell and securities sold under agreements to repurchase that meet the offsetting requirements prescribed in ASC Topic 210-20. In the tables below, the amounts of financial instruments that are not offset in the consolidated statements of financial condition, but could be netted against cash or financial instruments with specific counterparties under master netting agreements, according to the terms of the agreements, including clearing houses (exchange-traded options, warrants and discount certificates) or over the counter currency forward contract counterparties, are presented to provide financial statement readers with the Company’s net payable or receivable with counterparties for these financial instruments.\n \nThe tables below present the netting of financial assets and financial liabilities for the periods indicated\n.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2024\n \n \nGross\n \nAmounts \n \n \nNet Amounts\n \nAmounts Not \n \n \n \n \n \nAmounts\n \nOffset in the\n \n \nPresented in the\n \nOffset in the \n \n \n \n \n \nof Financial \n \nConsolidated \n \n \nConsolidated \n \nConsolidated Statement\n \n \n \n \n \nAssets and \n \nStatement of \n \n \nStatement of\n \nof Financial Condition\n \n \n \n \n \nLiabilities\n \nFinancial\n \n \nFinancial\n \nCash or Financial\n \nNet \n \n \nRecognized\n \nCondition \n2\n \n \nCondition\n \nInstruments\n \nAmount\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nOffsetting of financial assets\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities segregated for regulatory purposes - purchased under agreements to resell\n \n$\n \n21,353\n1\n \n$\n \n—\n \n \n$\n \n21,353\n \n$\n (\n21,353\n)\n \n$\n \n—\nSecurities borrowed \n \n \n \n5,369\n \n \n \n \n—\n \n \n \n \n5,369\n \n \n (\n5,159\n)\n \n \n \n210\nSecurities purchased under agreements to resell \n \n \n \n6,575\n \n \n \n \n—\n \n \n \n \n6,575\n \n \n (\n6,575\n)\n \n \n \n—\nFinancial instruments owned, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions \n \n \n \n84\n \n \n \n \n—\n \n \n \n \n84\n \n \n (\n69\n)\n \n \n \n15\nCurrency forward contracts \n \n \n —\n \n \n \n \n—\n \n \n \n —\n \n \n \n—\n \n \n \n—\nTotal\n \n$\n \n33,381\n \n \n$\n \n—\n \n \n$\n \n33,381\n \n$\n (\n33,156\n)\n \n$\n \n225\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nOffsetting of financial liabilities\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities loaned\n \n$\n \n16,248\n \n \n$\n \n—\n \n \n$\n \n16,248\n \n$\n (\n15,105\n)\n \n$\n \n1,143\nFinancial instruments sold, but not yet purchased, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions \n \n \n \n96\n \n \n \n \n—\n \n \n \n \n96\n \n \n (\n69\n)\n \n \n \n27\nCurrency forward contracts \n \n \n \n63\n \n \n \n \n—\n \n \n \n \n63\n \n \n \n—\n \n \n \n63\nTotal\n \n$\n \n16,407\n \n \n$\n \n—\n \n \n$\n \n16,407\n \n$\n (\n15,174\n)\n \n$\n \n1,233\n \n‎\n \n\n\n92\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2023\n \n \n \nGross\nAmounts \n \n \nNet Amounts\n \nAmounts Not \n \n \n \n \n \n \nAmounts\nOffset in the\n \n \nPresented in the\n \nOffset in the \n \n \n \n \n \n \nof Financial \nConsolidated \n \n \nConsolidated \n \nConsolidated Statement\n \n \n \n \n \n \nAssets and \nStatement of \n \n \nStatement of\n \nof Financial Condition\n \n \n \n \n \n \nLiabilities\nFinancial\n \n \nFinancial\n \nCash or Financial\n \nNet \n \n \n \nRecognized\n \nCondition \n2\n \n \nCondition\n \nInstruments\n \nAmount\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nOffsetting of financial assets\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities segregated for regulatory purposes - purchased under agreements to resell\n \n$\n \n29,632\n1\n \n$\n \n—\n \n \n$\n \n29,632\n \n$\n (\n29,632\n)\n \n$\n \n—\nSecurities borrowed \n \n \n \n5,835\n \n \n \n \n—\n \n \n \n \n5,835\n \n \n (\n5,618\n)\n \n \n \n217\nSecurities purchased under agreements to resell \n \n \n \n5,504\n \n \n \n \n—\n \n \n \n \n5,504\n \n \n (\n5,504\n)\n \n \n \n—\nFinancial instruments owned, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions \n \n \n \n354\n \n \n \n \n—\n \n \n \n \n354\n \n \n (\n104\n)\n \n \n \n250\nCurrency forward contracts \n \n \n \n60\n \n \n \n \n—\n \n \n \n \n60\n \n \n \n—\n \n \n \n60\nTotal\n \n$\n \n41,385\n \n \n$\n \n—\n \n \n$\n \n41,385\n \n$\n (\n40,858\n)\n \n$\n \n527\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nOffsetting of financial liabilities\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities loaned\n \n$\n \n11,347\n \n \n$\n \n—\n \n \n$\n \n11,347\n \n$\n (\n10,443\n)\n \n$\n \n904\nFinancial instruments sold, but not yet purchased, at fair value\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOptions \n \n \n \n104\n \n \n \n \n—\n \n \n \n \n104\n \n \n (\n104\n)\n \n \n \n—\nCurrency forward contracts \n \n \n \n5\n \n \n \n \n—\n \n \n \n \n5\n \n \n \n—\n \n \n \n5\nTotal\n \n$\n \n11,456\n \n \n$\n \n—\n \n \n$\n \n11,456\n \n$\n (\n10,547\n)\n \n$\n \n909\n___________________________\n \n(1)\nAs of \nDecember 31\n, 2024 and 2023, the Company had $\n21.4\n billion and $\n29.6\n billion, \nrespectively, of securities purchased under agreements to resell that were segregated to satisfy regulatory requirements. These securities are included in “Securities - segregated for regulatory purposes” in the consolidated statements of financial condition.\n \n(2)\nThe Company did not have any balances eligible for netting in accordance with ASC Topic 210-20 at December 31, 2024 and 2023.\n‎\n \n\n\n93\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nSecured Financing Transactions – Maturities and Collateral Pledged\n \nThe tables below present gross obligations for securities loaned transactions by remaining contractual maturity and class of collateral pledged for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2024\n \n \nRemaining Contractual Maturity\n \n \nOvernight \n \nLess than \n \n30 – 90 \n \nOver 90 \n \n \n \n \n \nand Open\n \n30 days\n \ndays\n \ndays\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities loaned \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  Stocks\n \n$\n16,215\n \n$\n —\n \n$\n —\n \n$\n —\n \n$\n16,215\n  Corporate bonds \n \n \n \n33\n \n \n —\n \n \n —\n \n \n —\n \n \n33\nTotal securities loaned\n \n$\n \n16,248\n \n$\n —\n \n$\n —\n \n$\n —\n \n$\n16,248\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2023\n \n \nRemaining Contractual Maturity\n \n \nOvernight \n \nLess than \n \n30 – 90 \n \nOver 90 \n \n \n \n \n \nand Open\n \n30 days\n \ndays\n \ndays\n \nTotal\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities loaned \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  Stocks\n \n$\n \n11,306\n \n$\n —\n \n$\n —\n \n$\n —\n \n$\n \n11,306\n  Corporate bonds \n \n \n \n41\n \n \n —\n \n \n —\n \n \n —\n \n \n \n41\nTotal securities loaned\n \n$\n \n11,347\n \n$\n —\n \n$\n —\n \n$\n —\n \n$\n \n11,347\n   \n  \n \n \n \n \n \n7. \n \nCollateralized Transactions\n \nThe Company enters into securities borrowing and lending transactions and agreements to repurchase and resell securities to finance trading inventory, to obtain securities for settlement and to earn residual interest rate spreads. In addition, the Company’s customers pledge their securities owned to collateralize margin loans. Under these transactions, the Company either receives or provides collateral, including equity, corporate debt and U.S. government securities. Under typical agreements, the Company is permitted to sell or repledge securities received as collateral and use these securities to secure securities purchased under agreements to resell, enter into securities lending transactions or deliver these securities to counterparties to cover short positions.\n \nThe Company also engages in securities financing transactions with and for customers through margin lending. Customer receivables generated from margin lending activity are collateralized by customer\n-\nowned securities held by the Company. Customers’ required margin levels and established credit limits are monitored continuously by risk management staff using automated systems. Pursuant to the Company’s policy and as enforced by such systems, customers are required to deposit additional collateral or reduce positions, when necessary, to avoid automatic liquidation of their positions.\n \nMargin loans are extended to customers on a demand basis and are not committed facilities. Factors considered in the acceptance or rejection of margin loans are the amount of the loan, the degree of leverage being employed in the customer account and an overall evaluation of the customer’s portfolio to ensure proper diversification or, in the case of concentrated positions, appropriate liquidity of the underlying collateral. Additionally, transactions relating to concentrated or restricted positions are limited or prohibited by raising the level of required margin collateral (to 100% in the extreme case). The underlying collateral for margin loans is evaluated with respect to the liquidity of the collateral positions, valuation of securities, volatility analysis and an evaluation of industry concentrations. Adherence to the Company’s collateral policies significantly limits the Company’s credit exposure to margin loans in the event of a customer’s default. Under margin lending agreements, the Company may request additional margin collateral from customers and may sell securities that have not been paid for or purchase securities sold but not delivered from customers, if necessary. \nAs of \nDecember 31\n, 2024 and 2023, approximately $\n64.4\n billion and $\n44.5\n billion, respectively, of customer margin loans were outstanding.\n‎\n \n\n\n94\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe table below presents a summary of the amounts related to collateralized transactions for the periods indicated\n.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, 2024\n \nDecember 31, 2023\n \n \nPermitted\n \nSold or\n \nPermitted\n \nSold or\n \n \nto Repledge\n \nRepledged\n \nto Repledge\n \nRepledged\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \nSecurities lending transactions\n \n$\n \n134,407\n \n$\n \n8,342\n \n$\n \n97,210\n \n$\n \n8,437\nSecurities purchased under agreements to resell transactions \n1\n \n \n \n27,988\n \n \n \n26,678\n \n \n \n35,198\n \n \n \n34,825\nCustomer margin assets\n \n \n \n87,809\n \n \n \n21,465\n \n \n \n54,847\n \n \n \n17,234\n \n \n$\n \n250,204\n \n$\n \n56,485\n \n$\n \n187,255\n \n$\n \n60,496\n___________________________\n \n(1)\nAs of \nDecember 31\n, 2024, $\n21.4\n billion or \n80\n% (as of December 31, 2023, $\n29.6\n billion or \n85\n%) of securities purchased under agreements to resell were segregated to satisfy regulatory requirements and \nare included in “Securities - segregated for regulatory purposes” in the consolidated statements of financial condition.\n \nIn the normal course of business, the Company pledges qualified securities with clearing organizations to satisfy daily margin and clearing fund requirements. As of December 31, 2024 and 2023, the majority of the Company’s U.S. and foreign government securities owned were pledged to clearing organizations.\nThe table below presents financial instruments owned and pledged as collateral, including amounts pledged to affiliates, where the counterparty has the right to repledge, for the periods indicated\n.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nStocks\n \n$\n \n25\n \n$\n \n28\nU.S. and foreign government securities\n \n \n \n52\n \n \n \n38\n \n \n$\n \n77\n \n$\n \n66\n \n \n \n \n \n8.  Revenues from Contracts with Customers\n \nRevenue from contracts with customers is recognized when, or as, the Company satisfies its performance obligations by transferring the promised services to the customers. A service is transferred to a customer when, or as, the customer obtains control of that service. A performance obligation may be satisfied at a point in time or over time. Revenue from a performance obligation satisfied at a point in time is recognized at the point in time that the Company determines the customer obtains control over the promised service. Revenue from a performance obligation satisfied over time is recognized by measuring the Company’s progress in satisfying the performance obligation in a manner that depicts the transfer of the services to the customer. The amount of revenue recognized reflects the consideration the Company expects to receive in exchange for those promised services (\ni.e.\n, the “transaction price”). In determining the transaction price, the Company considers multiple factors, including the effects of variable consideration, if any. \n \nThe Company’s revenues from contracts with customers are recognized when the performance obligations are satisfied at an amount that reflects the consideration expected to be received in exchange for such services. The majority of the Company’s performance obligations are satisfied at a point in time and are typically collected from customers by debiting their brokerage account with the Company. \n‎\n \n\n\n95\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nNature of Services\n \nThe Company’s main sources of revenues from contracts with customers are as follows:\n \n\nCommissions\n are charged to customers for order execution services and trade clearing and settlement services. These services represent a single performance obligation as the services are not separately identifiable in the context of the contract. The Company recognizes revenue at a point in time at the execution of the order (i.e., trade date). Commissions are generally collected from cleared customers on trade date and from non-cleared customers monthly. Commissions also include payments for order flow received from IBKR Lite\nSM\n liquidity providers.\n \n\nMarket data fees\n are charged to customers for market data services to which they subscribe that the Company delivers. The Company recognizes revenue monthly as the performance obligation is satisfied over time by continually providing market data for the period. Market data fees are collected monthly, generally in advance.\n \n\nRisk exposure fees\n are charged to customers who carry positions with a market risk that exceeds defined thresholds. The Company recognizes revenue daily as the performance obligation is satisfied at a point in time by the Company taking on the additional risk of account liquidation and potential losses due to insufficient margin. Risk exposure fees are collected daily.\n \n\nPayments for order flow\n are earned from various options exchanges based upon options trading volume originated by the Company that meets certain criteria. The Company recognizes revenue daily as the performance obligation is satisfied at a point in time on customer orders that qualify for payments subject to exchange-mandated programs. Payments for order flow are collected monthly, in arrears.\n \n\nFDIC sweep fees \nare earned from the banks that participate in the Company’s Insured Bank Deposit Sweep Program with respect to the Company’s customers’ funds deposited with each participating bank. The Company recognizes revenue daily as the performance obligation is satisfied when customer funds are swept to their FDIC insured accounts with the participating banks.\n \nThe Company also earns revenues from other services, including minimum activity fees, order cancelation or modification fees, position transfer fees, telecommunications fees, and withdrawal fees, among others. \n‎\n \n\n\n96\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nDisaggregation of Revenue\n \nThe tables below present revenue from contracts with customers by geographic location and major types of services for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nGeographic location \n1\n \n \n \n \n \n \n \n \n \n  United States\n \n$\n \n1,230\n \n$\n \n968\n \n$\n \n931\n  International\n \n \n \n747\n \n \n \n589\n \n \n \n575\n \n \n$\n \n1,977\n \n$\n \n1,557\n \n$\n \n1,506\n \n \n \n \n \n \n \n \n \n \nMajor types of services\n \n \n \n \n \n \n \n \n \n  Commissions\n \n$\n \n1,697\n \n$\n \n1,360\n \n$\n \n1,322\n  Market data fees \n2\n \n \n \n71\n \n \n \n70\n \n \n \n76\n  Risk exposure fees \n2\n \n \n \n100\n \n \n \n46\n \n \n \n33\n  Payments for order flow \n2\n \n \n \n45\n \n \n \n31\n \n \n \n37\n  FDIC sweep fees \n2\n \n \n \n28\n \n \n \n19\n \n \n \n10\n  Other \n2\n \n \n \n36\n \n \n \n31\n \n \n \n28\n \n \n$\n \n1,977\n \n$\n \n1,557\n \n$\n \n1,506\n___________________________\n \n \n(1)\nBased on the location of the subsidiaries in which the revenues are recorded.\n \n(2)\nIncluded in “Other fees and services” in the consolidated statements of comprehensive income.\n \nReceivables and Contract Balances\n \nReceivables arise when the Company has an unconditional right to receive payment under a contract with a customer and are derecognized when the cash is received. Receivables of $\n31\n million and $\n26\n million, as of December 31, 2024 and 2023, respectively, are reported in “Other assets” in the consolidated statements of financial condition.\n \nContract assets arise when the revenue associated with the contract is recognized before the Company’s unconditional right to receive payment under a contract with a customer (i.e., unbilled receivable) and are derecognized when either it becomes a receivable or the cash is received. Contract assets are reported in “Other assets” in the consolidated statements of financial condition. As of \nDecember 31, 2024 and 2023\n, there were \nno\n contract asset balances outstanding.\n \nContract liabilities arise when customers remit contractual cash payments in advance of the Company satisfying its performance obligations under the contract and are derecognized when the revenue associated with the contract is recognized either when a milestone is met triggering the contractual right to bill the customer or when the performance obligation is satisfied. Contract liabilities are reported in “Accounts payable, accrued expenses and other liabilities” in the consolidated statements of financial condition. As of \nDecember 31, 2024 and 2023\n, there were \nno\n contract liability balances outstanding.\n‎\n \n\n\n97\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n9.  Other Income (Loss)\n \nThe table below presents the components of other income (loss) for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nPrincipal transactions \n1\n \n$\n \n127\n \n$\n \n48\n \n$\n (\n16\n)\nGains (losses) from currency diversification strategy, net\n \n \n (\n15\n)\n \n \n (\n80\n)\n \n \n (\n100\n)\nOther, net\n \n \n (\n52\n)\n \n \n \n21\n \n \n \n9\n \n \n$\n \n60\n \n$\n (\n11\n)\n \n$\n (\n107\n)\n___________________________\n \n(1)\nPrincipal transactions include (1) trading gains and losses from the Company’s remaining market making activities; (2) realized and unrealized gains and losses on financial instruments that (a) are held for purposes other than the Company’s market making activities, or (b) are subject to restrictions; and (3) dividends on investments accounted at cost less impairment.\n \n \n10.  Employee Incentive Plans\n \nDefined Contribution Plan\n \n \nThe Company offers substantially all employees of U.S.-based operating subsidiaries who have met minimum service requirements the opportunity to participate in defined contribution retirement plans qualifying under the provisions of Section 401(k) of the Internal Revenue Code. The general purpose of this plan is to provide employees with an incentive to make regular savings in order to provide additional financial security during retirement. This plan provides for the Company to match \n50\n% of the employees’ pre-tax contribution, up to a maximum of \n10\n% of eligible earnings. The employee is vested in the matching contribution incrementally over \nsix years\n of service. Included in “Employee compensation and benefits” expense in the consolidated statements of comprehensive income were $\n8\n million, $\n7\n million and $\n6\n million of plan contributions for the years ended December 31, 2024, 2023, and 2022, respectively.\n \n2007 Stock Incentive Plan\n \nUnder the Company’s Stock Incentive Plan, up to \n40\n million shares of the Company’s Class A common stock may be issued to satisfy vested restricted stock units granted to directors, officers, employees, contractors and consultants of the Company. The purpose of the Stock Incentive Plan is to promote the Company’s long\n-\nterm financial success by attracting, retaining and rewarding eligible participants.\n \nAs a result of the Company’s organizational structure, a description of which can be found in “Business – Our Organizational Structure” in Part I, Item 1 of this Annual Report on Form 10-K, there is no material dilutive effect upon ownership of common stockholders of issuing shares under the Stock Incentive Plan. The issuances do not dilute the book value of the ownership of common stockholders since the restricted stock units are granted at market value, and upon their vesting and the related issuance of shares of common stock, the ownership of IBG, Inc. in IBG LLC, increases proportionately to the shares issued. As a result of such proportionate increase in share ownership, the dilution upon issuance of common stock is borne by IBG LLC’s majority member (i.e., noncontrolling interest), Holdings, and not by IBG, Inc. or its common stockholders. Additionally, dilution of earnings that may take place after issuance of common stock is reflected in EPS reported in the Company’s financial statements. The EPS dilution can be neither estimated nor projected, but historically it has not been material.\n \nThe Stock Incentive Plan is administered by the Compensation Committee of the Company’s Board of Directors. The Compensation Committee has discretionary authority to determine the eligibility to participate in the Stock Incentive Plan and establishes the terms and conditions of the awards, including the number of awards granted to each participant and all other terms and conditions applicable to such awards in individual grant agreements. Awards are expected to be made primarily through grants of restricted stock units. Stock Incentive Plan awards are subject to issuance over time. All previously granted but not yet earned awards may be canceled by the Company upon the participant’s termination of employment or violation of certain applicable covenants before issuance, unless determined otherwise by the Compensation Committee.\n‎\n \n\n\n98\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe Stock Incentive Plan provides that, upon a change in control, the Compensation Committee may, at its discretion, fully vest any granted but not yet earned awards under the Stock Incentive Plan, or provide that any such granted but not yet earned awards will be honored or assumed, or new rights substituted by the new employer on a substantially similar basis and terms and conditions substantially comparable to those of the Stock Incentive Plan.\n \nThe Company expects to continue to grant awards on or about December 31 of each year to eligible participants as part of an overall plan of equity compensation. \nIn 2021, the Company’s Compensation Committee approved a change to the vesting schedule for the Stock Incentive Plan. For awards granted on December 31, 2021 onwards, restricted stock units vest and become distributable to participants 20% on each vesting date\n, \nwhich is on or about May 9 of each year, assuming continued employment with the Company and compliance with non-competition and other applicable covenants. The vesting and distribution of grants prior to December 31, 2021 remain in accordance with the following schedule: (a) \n10% on the first vesting date, which is on or about May 9 of each year; and (b) an additional 15% on each of the following six anniversaries of the first vesting.\n \nAwards granted to directors vest and are distributed as follows: (a) one-time award granted to external directors on December 31 of the year of appointment vests over a \nfive\n-\nyear\n period (\n20\n% per year) commencing one year after the date of grant, and (b) \nannual awards granted to all directors on December 31 of each year are fully vested and distributed immediately on grant date\n.\n A total of \n40,586\n restricted stock units have been granted to the directors cumulatively since the plan’s inception.\n \nThe table below presents Stock Incentive Plan awards granted and the related fair values since the plan’s inception.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFair Value at \n \n \n \n \nDate of Grant\n \n \nUnits\n \n($ millions)\nPrior periods (since inception)\n \n \n29,332,059\n \n$\n \n842\nApril 25, 2022\n \n \n180,889\n1\n \n \n12\nDecember 31, 2022\n \n \n1,248,105\n2\n \n \n91\nDecember 31, 2023\n \n \n1,257,822\n \n \n \n102\nDecember 31, 2024\n \n \n617,122\n \n \n \n111\nTotal awards granted since inception\n \n \n32,635,997\n \n$\n \n1,158\n___________________________\n \n(1)\nOn April 25, 2022, the Company awarded a special grant of restricted stock units to employees.\n \n(2)\nStock Incentive Plan number of granted restricted stock units related to 2023 was adjusted by \n952\n additional restricted stock units during the \nyear\n ended December 31, 2024.\n \nEstimated future grants under the Stock Incentive Plan are accrued for ratably during each year (see Note 2). In accordance with the vesting schedule, outstanding awards vest and are distributed to participants yearly on or about May 9 of each year. At the end of each year, no vested awards remain undistributed.\n \nCompensation expense related to the Stock Incentive Plan recognized in the consolidated statements of comprehensive income was\n $\n112\n million, $\n100\n million and $\n92\n million for the years ended \nDecember 31, 2024, 2023, and 2022\n, respectively. \nEstimated future compensation costs for unvested awards, net of credits for canceled awards, as of\n \nDecember 31, 2024\n are $\n39\n million.\n‎\n \n\n\n99\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe table below summarizes the Stock Incentive Plan activity for the periods indicated\n.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nIntrinsic Value\n \n \n \n \nof SIP Shares\n \n \nStock\n \nwhich Vested and \n \n \nIncentive Plan\n \nwere Distributed\n \n \nUnits\n \n($ millions) \n1\nBalance, December 31, 2021\n \n \n4,783,810\n \n \n \nGranted\n \n \n1,428,994\n \n \n \nCanceled \n \n (\n179,856\n)\n \n \n \nDistributed\n \n (\n1,276,186\n)\n \n$\n \n67\nBalance, December 31, 2022\n \n \n4,756,761\n \n \n \nGranted\n \n \n1,257,822\n2\n \n \nCanceled \n \n (\n20,480\n)\n \n \n \nDistributed\n \n (\n1,389,032\n)\n \n$\n \n108\nBalance, December 31, 2023\n \n \n4,605,071\n \n \n \nGranted\n \n \n617,122\n \n \n \nCanceled \n \n (\n43,021\n)\n \n \n \nDistributed\n \n (\n1,349,131\n)\n \n$\n \n161\nBalance, December 31, 2024\n \n \n3,830,041\n \n \n \n \n________________________\n \n(1)\nIntrinsic value of SIP units distributed represents the compensation value reported to the participants.\n \n(2)\nStock Incentive Plan number of granted restricted stock units related to 2023 was adjusted by \n952\n additional restricted stock units during the year ended December 31, 2024.\n \nAwards previously granted but not yet earned under the stock plans are subject to the plans’ post-employment provisions in the event a participant ceases employment with the Company. \nSince inception through \nDecember 31, 2024\n, a total of \n1,392,895\n restricted stock units have been distributed under these post\n-\nemployment provisions. \nThese distributions are included in the table above.\n \n11.  Income Taxes\n \nIncome tax expense for the three years ended \nDecember 31, 2024, 2023, and 2022\n \ndiffers from the U.S. federal statutory rate primarily due to the tax treatment of income attributable to noncontrolling interests in IBG LLC. These noncontrolling interests are held directly through a U.S. partnership. Accordingly, the income attributable to these noncontrolling interests is reported in the consolidated statements of comprehensive income, but the related U.S. income tax expense attributable to these noncontrolling interests is not reported by the Company as it is generally the obligation of the noncontrolling interests. Income tax expense is also affected by the differing effective tax rates in foreign, state and local jurisdictions where certain of the Company’s subsidiaries are subject to corporate taxation.\n \nDeferred income taxes arise primarily due to the amortization of the deferred tax assets recognized in connection with the common stock offerings (see Note 4), differences in the valuation of financial assets and liabilities, and for other temporary differences arising from the deductibility of compensation and depreciation expenses in different periods for accounting and income tax return purposes.\n \nUnder U.S. GAAP, the Company is allowed to make an accounting policy election of either (1) treating taxes due on future U.S. inclusions in taxable income related to global intangible low tax income as a current-period expense when incurred (the “period cost method”) or (2) factoring such amounts into the Company’s measurement of its deferred taxes (the “deferred method”). The Company has elected the period cost method.\n‎\n \n\n\n100\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe table below presents the components of the provision for income taxes for the periods indicated. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \nCurrent\n \n \n \n \n \n \n \n \n \n \nFederal\n \n$\n \n133\n \n$\n \n104\n \n$\n \n59\n \nState and local\n \n \n \n22\n \n \n \n14\n \n \n \n8\n \nForeign\n \n \n \n135\n \n \n \n109\n \n \n \n69\n \nTotal current\n \n \n \n290\n \n \n \n227\n \n \n \n136\n \nDeferred\n \n \n \n \n \n \n \n \n \n \nFederal\n \n \n \n8\n \n \n \n27\n \n \n \n21\n \nState and local\n \n \n (\n9\n)\n \n \n \n4\n \n \n \n4\n \nForeign\n \n \n (\n1\n)\n \n \n (\n1\n)\n \n \n (\n5\n)\n \nTotal deferred\n \n \n (\n2\n)\n \n \n \n30\n \n \n \n20\n \n \n \n$\n \n288\n \n$\n \n257\n \n$\n \n156\n \n \nThe table below presents a reconciliation of the statutory U.S. Federal income tax rate of \n21\n% to the Company’s effective tax rate for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\nU.S. Statutory Tax Rate\n \n \n21.0\n%\n \n \n21.0\n%\n \n \n21.0\n%\nState, local and foreign taxes, net of federal benefit\n \n \n1.8\n%\n \n \n2.5\n%\n \n \n2.1\n%\nSubtotal\n \n \n22.8\n%\n \n \n23.5\n%\n \n \n23.1\n%\nLess: rate attributable to noncontrolling interests\n \n \n(\n15.0\n%)\n \n \n(\n15.1\n%)\n \n \n(\n15.3\n%)\nTotal\n \n \n7.8\n%\n \n \n8.4\n%\n \n \n7.8\n%\n \nThe table below presents significant components of the Company’s deferred tax assets and liabilities, which are reported in other assets and in \naccounts payable, accrued expenses and other liabilities, respectively,\n in the consolidated statements of financial condition for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\nDeferred tax assets\n \n \n \n \n \n \n \n \n \nArising from the acquisition of interests in IBG LLC\n \n$\n \n196\n \n$\n \n197\n \n$\n \n193\nDeferred compensation\n \n \n \n19\n \n \n \n17\n \n \n \n14\nOther\n \n \n \n35\n \n \n \n31\n \n \n \n34\nTotal deferred tax assets\n \n \n \n250\n \n \n \n245\n \n \n \n241\nDeferred tax liabilities\n \n \n \n \n \n \n \n \n \nForeign\n \n \n \n3\n \n \n \n4\n \n \n \n2\nOther\n \n \n \n10\n \n \n \n10\n \n \n \n7\nTotal deferred tax liabilities\n \n \n \n13\n \n \n \n14\n \n \n \n9\nNet deferred tax assets\n \n$\n \n237\n \n$\n \n231\n \n$\n \n232\n \nAs of and for the years ended December 31, 2024 and 2023, the Company had \nno\n material valuation allowances on deferred tax assets.\n \n \nThe Company is subject to taxation in the U.S. and various states and foreign jurisdictions. As of December 31, 2024, the Company is no longer subject to U.S. Federal, State and Non-U.S. income tax examinations for tax years before 2011.\n‎\n \n\n\n101\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nAs of \nDecember 31, 2024\n, accumulated earnings held by non\n-\nU.S. subsidiaries totaled $\n3.2\n billion (as of December 31, 2023 $\n2.7\n billion), of which $\n3.0\n billion of such earnings are indefinitely reinvested abroad due to regulatory and other capital requirements and business needs in foreign jurisdictions. As a result, the Company has not provided for its proportionate share of additional foreign taxes or deferred U.S. tax on Internal Revenue Code (“IRC”) Section 986 gains/losses on previously taxed earnings and any local foreign withholding taxes associated with the repatriation of such earnings. If the Company were to record a deferred tax liability due to a hypothetical repatriation of such earnings, the estimated amount of such taxes would be up to $\n42\n million as of December 31, 2024.\n \nUnder U.S. GAAP, a tax benefit from an uncertain tax position may be recognized when it is more likely than not that the position will be sustained upon examination, including resolution of any related appeals or litigation processes, based on the technical merits of the position. \nBased upon the Company’s review of its federal, state, local and foreign income tax returns and tax filing positions, the Company has recorded a $\n3\n million tax liability (including interest) for an uncertain tax position for an IRS audit primarily related to the IRC Section \n199 Domestic Production Activities Deduction. \n \n12.  Leases\n \nAll of the Company’s leases are classified as operating leases and primarily consist of real estate leases for corporate offices, data centers and other facilities. As of \nDecember 31, 2024\n, the weighted-average remaining lease term on these leases is approximately \n5.7\n years and the weighted-average discount rate used to measure the lease liabilities is approximately \n3.92\n%. For the year ended \nDecember 31, 2024\n, right-of-use assets obtained under new operating leases were $\n15\n million. \nThe Company’s lease agreements do not contain any residual value guarantees, restrictions, or covenants.\n \nThe table below presents balances reported in the consolidated statements of financial condition related to the Company’s leases for the periods indicated.\n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nRight-of-use assets \n1\n \n$\n \n102\n \n$\n \n120\nLease liabilities \n1\n \n$\n \n121\n \n$\n \n143\n___________________________\n \n \n \n(1)\nRight-of-use assets are included in \n“Other \nassets” and lease liabilities are included in \n“Accounts payable, accrued expenses and other liabilities”\n \nin the Company’s consolidated statements of financial condition.\n \nThe table below presents balances reported in the consolidated statements of comprehensive income related to the Company’s leases for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nOperating lease cost\n \n$\n \n34\n \n$\n \n35\n \n$\n \n32\nVariable lease cost\n \n \n \n6\n \n \n \n6\n \n \n \n4\nTotal lease cost\n \n$\n \n40\n \n$\n \n41\n \n$\n \n36\n \n‎\n \n\n\n102\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe table below reconciles the undiscounted cash flows of the Company’s leases to the present value of its operating lease payments for the period indicated. \n \n \n \n \n \n \n \n \n \nDecember 31, 2024\n \n \n(in millions)\n2025\n \n$\n \n30\n2026\n \n \n \n27\n2027\n \n \n \n20\n2028\n \n \n \n18\n2029\n \n \n \n17\nThereafter\n \n \n \n22\nTotal undiscounted operating lease payments\n \n \n \n134\nLess: imputed interest\n \n \n (\n13\n)\nPresent value of operating lease liabilities\n \n$\n \n121\n \n \n \n13.  Property, Equipment and Intangible Assets \n \nProperty, equipment and intangible assets, which are included in “Other assets” in the consolidated statements of financial condition, consist of leasehold improvements, computer equipment, software developed for the Company’s internal use, office furniture and equipment. \nThe table below presents balances related to \nproperty, equipment and intangible assets for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nLeasehold improvements\n \n$\n \n28\n \n$\n \n56\nComputer equipment\n \n \n \n67\n \n \n \n90\nOffice furniture and equipment\n \n \n \n15\n \n \n \n15\n \n \n \n \n110\n \n \n \n161\nLess - accumulated depreciation and amortization\n \n \n (\n51\n)\n \n \n (\n80\n)\nProperty and equipment, net\n \n \n \n59\n \n \n \n81\n \n \n \n \n \n \n \nInternally developed software\n \n \n \n88\n \n \n \n84\nOther intangible assets\n \n \n \n4\n \n \n \n4\nLess - accumulated amortization\n \n \n (\n44\n)\n \n \n (\n45\n)\nIntangible assets, net\n \n \n \n48\n \n \n \n43\nTotal property, equipment, and intangible assets, net\n \n$\n \n107\n \n$\n \n124\n \nDepreciation and amortization of $\n67\n million, $\n65\n million and $\n58\n million, for the three years ended December 31, 2024, 2023, and 2022, respectively, is included in “Occupancy, depreciation and amortization” expense in the consolidated statements of comprehensive income. Amortization expense related to the Company’s intangible assets as of December 31, 2024 is expected to be approximately $\n26\n million, $\n16\n million, and $\n6\n million, for years ended December 31, 2025, 2026, and 2027, respectively.\n \n14.  Commitments, Contingencies and Guarantees \n \nLegal, Regulatory and Governmental Matters\n \nThe Company is subject to certain pending and threatened legal, regulatory and governmental actions and proceedings that arise out of the normal course of business. Given the inherent difficulty of predicting the outcome of such matters, particularly in proceedings where claimants seek substantial or indeterminate damages, or which are in their early stages, the Company is generally not able to quantify the actual loss or range of loss related to such legal proceedings, the manner in which they will be resolved, the timing of their final resolution or the ultimate settlement. Management believes that the resolution of these matters will not have a material effect, if any, on the Company’s business or financial condition, but may have a material impact on the results of operations for a given period. \n‎\n \n\n\n103\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe Company accounts for potential losses related to litigation in accordance with FASB ASC Topic 450, “Contingencies.” As of \nDecember 31, 2024 and 2023\n, accruals for potential losses related to legal, regulatory and governmental actions and proceedings matters were not material. \n \nTrading Technologies Matter \n \nAs previously disclosed, on February 3, 2010, Trading Technologies International, Inc. (“Trading Technologies”) filed a complaint in the U.S. District Court for the Northern District of Illinois, Eastern Division (the “District Court”), against IBG LLC and IB LLC (the “Defendants”). The complaint, as amended, alleged that the Defendants infringed twelve U.S. patents held by Trading Technologies, and sought damages and injunctive relief.\n \nAfter proceedings before the \nUnited States Patent and Trademark Office Patent Trial Appeal Board\n, and review by the United States Court of Appeals for the Federal Circuit, all but four patents were found to be invalid. In June 2021, the District Court found two of the remaining four patents to be invalid, and trial on the two remaining patents began on August 6, 2021. On September 7, 2021, the jury rendered its verdict, \nfinding that the Defendants infringed the two patents and awarding $\n6.6\n million in damages to Trading Technologies, while rejecting Trading Technologies’ claims of willful infringement and request for damages of at least $\n962.4\n million.\n \nOn January 11, 2022, the District Court awarded Trading Technologies pre-judgment interest \nof $\n2.1\n million and post-judgment interest, and on March 31, 2022, granted Trading Technologies’ bill of costs of $\n490,232\n.\n \nOn March 24, 2022, Harris Brumfield, the successor-in-interest to the patents-in-suit, filed a notice of appeal with the Court of Appeals of the Federal Circuit\n. On April 7, 2022, the Defendants filed a notice of cross-appeal, which the Defendants subsequently dismissed. After briefing on the appeal, \noral argument was held on January 8, 2024. On March 27, 2024, the Federal Circuit affirmed the District Court’s judgment. On May 15, 2024, Harris Brumfield petitioned the Federal Circuit for a panel rehearing and rehearing en banc. On August 5, 2024, the Federal Circuit denied the petition and issued the mandate of the court on August 12, 2024. Harris Brumfield filed a petition for a writ of certiorari with the Supreme Court of the United States on January 2, 2025. The Defendants’ brief in opposition to the petition is due March 20, 2025.\n \nClass Action Matter \n \nOn December 18, 2015, a former individual customer filed a purported class action complaint against IB LLC, IBG, Inc., and Thomas Frank, Ph.D., the Company’s Executive Vice President and former Chief Information Officer, in the U.S. District Court for the District of Connecticut. The complaint alleges that a purported class of IB LLC’s customers were harmed by alleged “flaws” in the computerized system used to close out (i.e., liquidate) positions in customer brokerage accounts that have margin deficiencies. The complaint seeks, among other things, undefined compensatory damages and declaratory and injunctive relief.\n \nOn September 28, 2016, the District Court issued an order granting the Company’s motion to dismiss the complaint in its entirety, without leave to amend. On September 28, 2017, the plaintiff appealed to the United States Court of Appeals for the Second Circuit. On September 26, 2018, the Court of Appeals affirmed the dismissal of plaintiff’s claims of breach of contract and commercially unreasonable liquidation but vacated and remanded back to the District Court plaintiff’s claims for negligence. The Company’s motion to dismiss plaintiff’s subsequent second amended complaint was denied on September 30, 2019. On July 14, 2022, after obtaining leave to amend his complaint, the plaintiff filed a third amended complaint. The Company’s answer and counterclaim were filed on July 26, 2022. \n \nOn August 25, 2023, the Court granted plaintiff’s motion for class certification, certifying a class that consists of IB LLC account holders who are U.S. residents (with some exclusions) who had positions liquidated from December 18, 2013 to the date of trial at prices outside of a “pricing corridor” defined in the Court’s decision. On September 8, 2023, the Company filed a petition for permission to appeal the District Court’s class certification decision to the United States Court of Appeals for the Second Circuit, which denied the Company’s petition on December 19, 2023. On December 4, 2024, plaintiff filed a motion for approval of the form and manner of notice of the lawsuit to members of the class. On December 26, 2024, the Company filed its opposition to the motion, which is currently pending before the District Court. The Company continues to believe that a purported class action is inappropriate given the great differences in portfolios, markets and many other circumstances surrounding the liquidation of any particular customer’s margin-deficient account. Pursuant to a District Court scheduling order, trial is tentatively scheduled to commence in 2026. IB LLC and the related defendants continue to \nbelieve that the plaintiff’s claims are deficient and \nintend to continue to defend themselves vigorously and, consistent with past practice, may pursue any potential claims for counsel fees and expenses incurred in defending the case.\n \n‎\n \n\n\n104\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nRegulatory Matters \n \nIB LLC has identified a number of issues dating back to 2016 related to the Company’s compliance with sanctions regulations, predominantly concerning the facilitation of transactions in countries, or by entities, sanctioned by the Office of Foreign Assets Control (“OFAC”) of the United States Department of the Treasury. The Company has made voluntary self-disclosures to OFAC, has received additional inquiries from OFAC related to the Company’s sanctions compliance program, and is cooperating with the investigation. The Company cannot currently predict when OFAC’s investigation will conclude or the exact amount of any potential civil money penalty. The Company believes that, in addition to its voluntary self-disclosures and continued cooperation with OFAC, the significant investment in and improvements to the Company’s Anti-Money Laundering and Sanctions programs over the past five years will be considered as mitigating factors with respect to the matter, and that any monetary fines or restrictions will not be material to the Company’s financial results.  \n \nGuarantees \n \nCertain of the operating subsidiaries provide guarantees to securities and commodities clearing houses and exchanges which meet the accounting definition of a guarantee under FASB ASC Topic 460, “Guarantees.” Under standard membership agreements, clearing house and exchange members are required to guarantee collectively the performance of other members. Under the agreements, if a member becomes unable to satisfy its obligations, other members would be required to meet shortfalls. In the opinion of management, the operating subsidiaries’ liability under these arrangements is not quantifiable and could exceed the cash and securities they have posted as collateral. However, the potential for these operating subsidiaries to be required to make payments under these arrangements is remote. Accordingly, \nno\n contingent liability is carried in the consolidated statements of financial condition for these arrangements. \n \nIn connection with its retail brokerage business, IB LLC or other electronic brokerage operating subsidiaries perform securities and commodities execution, clearance and settlement on behalf of their customers for whom they commit to settle trades submitted by such customers with the respective clearing houses. If a customer fails to fulfill its settlement obligations, the respective operating subsidiary must fulfill those settlement obligations. \nNo\n contingent liability is carried on the consolidated statements of financial condition for such customer obligations. \n \nOther Commitments \n \nCertain clearing houses, clearing banks and firms used by certain operating subsidiaries are given a security interest in certain assets of those operating subsidiaries held by those clearing organizations. These assets may be applied to satisfy the obligations of those operating subsidiaries to the respective clearing organizations.\n‎\n \n\n\n105\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n15.  Segment Reporting and Geographic Information \n \nSegment Reporting\n \nThe Company has a single reportable segment, electronic brokerage, which is managed on a consolidated basis since the Company’s chief operating decision maker (“CODM”) assesses performance and allocates resources on a consolidated basis based on income before income taxes and net income as reported on the consolidated statements of comprehensive income. The Company’s CODM is its Chief Executive Officer and President. \n \nThe electronic brokerage segment provides execution, clearing and settlement of trades globally for \nhedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers and individual investors\n. The electronic brokerage segment derives revenue from customers in the U.S. and international markets by routing orders and executing and processing trades in stocks, options, futures, foreign exchange instruments (“forex”), bonds, mutual funds, ETFs, precious metals, and forecast contracts \non more than 160 electronic exchanges and market centers in 36 countries and 28 currencies around the world, and by offering custody, prime brokerage, and securities and margin lending services to customers\n. \nIn addition, electronic brokerage customers can use its trading platform to trade certain cryptocurrencies through third-party cryptocurrency service providers that execute, clear and custody the cryptocurrencies.\n \nSince the electronic brokerage segment is managed on a consolidated basis, there are no reconciling items between segment and the consolidated amounts reported in these financial statements, including total assets and segment assets. The accounting policies of the electronic brokerage segment are the same as those described in the summary of significant accounting policies in Note 2.\n \nThe table below presents selected financial information, including significant expenses, for the Company’s single operating segment for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nTotal net revenues\n \n$\n \n5,185\n \n \n$\n \n4,340\n \n \n$\n \n3,067\n \n \n \n \n \n \n \n \n \n \n \nSignificant Expenses\n \n \n \n \n \n \n \n \n \n  Transaction based fees \n1\n \n \n \n364\n \n \n \n \n308\n \n \n \n \n254\n \n  Non-transaction based fees \n1\n \n \n \n83\n \n \n \n \n78\n \n \n \n \n70\n \n  Employee compensation \n2\n \n \n \n533\n \n \n \n \n486\n \n \n \n \n427\n \n  Advertising \n3\n \n \n \n67\n \n \n \n \n47\n \n \n \n \n46\n \n  Other expenses \n4\n \n \n \n443\n \n \n \n \n352\n \n \n \n \n272\n \n      Total non-interest expenses\n \n \n \n1,490\n \n \n \n \n1,271\n \n \n \n \n1,069\n \nIncome before income taxes\n \n \n \n3,695\n \n \n \n \n3,069\n \n \n \n \n1,998\n \nIncome tax expense\n \n \n \n288\n \n \n \n \n257\n \n \n \n \n156\n \nNet income\n \n$\n \n3,407\n \n \n$\n \n2,812\n \n \n$\n \n1,842\n \n \n \n \n \n \n \n \n \n \n \nTotal Segment Assets\n \n$\n \n150,142\n \n \n$\n \n128,251\n \n \n$\n \n115,143\n \n___________________________\n \n(1)\nIncluded in “\nExecution, clearing and distribution fees\n” in the consolidated statements of comprehensive income.\n \n(2)\nIncluded in “\nEmployee compensation and benefits\n” in the consolidated statements of comprehensive income.\n \n(3)\nIncluded in “\nGeneral and administrative\n” in the consolidated statements of comprehensive income.\n \n(4)\nIncludes “Occupancy, depreciation and amortization”; “Communications”; “Customer bad debt”; employee benefits and other personnel expenses included in “\nEmployee compensation and benefits\n”; and professional services, legal and regulatory matters, and other administrative expenses included in “\nGeneral and administrative\n” in the consolidated statements of comprehensive income.\n\n\n106\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \nInterest income and expense is disclosed in the consolidated statements of comprehensive income. Depreciation and amortization expense is disclosed in Note 13 – Property, Equipment and Intangible Assets.\n \nGeographic Information\n \nThe Company operates its automated global business in the U.S. and international markets on more than 160 electronic exchanges and market centers. A significant portion of the Company’s net revenues is generated by subsidiaries operating outside the U.S. International operations are conducted in 35 countries in Europe, Asia/Pacific and the Americas (outside the U.S.). The following table presents total net revenues and income before income taxes by geographic area for\n the periods indicated\n.\n \nSignificant transactions and balances between the operating subsidiaries occur, primarily as a result of certain operating subsidiaries holding exchange or clearing organization memberships, which are utilized to provide execution and clearing services to subsidiaries. Intra\n-\nregion income and expenses and related balances have been eliminated in this geographic information to reflect the external business conducted in each geographic region. The geographic analysis presented below is based on the location of the subsidiaries in which the transactions are recorded. This geographic information does not reflect the way the Company’s business is managed.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n \n \n2024\n \n2023\n \n2022\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nNet revenues\n \n \n \n \n \n \n \n \n \nUnited States \n \n$\n \n3,589\n \n$\n \n3,028\n \n$\n \n2,115\nInternational \n \n \n \n1,596\n \n \n \n1,312\n \n \n \n952\nTotal net revenues \n \n$\n \n5,185\n \n$\n \n4,340\n \n$\n \n3,067\nIncome before income taxes\n \n \n \n \n \n \n \n \n \nUnited States \n \n$\n \n2,786\n \n$\n \n2,316\n \n$\n \n1,546\nInternational \n \n \n \n909\n \n \n \n753\n \n \n \n452\nTotal income before income taxes\n \n$\n \n3,695\n \n$\n \n3,069\n \n$\n \n1,998\n \n \n \n \n16.  Regulatory Requirements\n \nAs of \nDecember 31, 2024\n, aggregate excess regulatory capital for all operating subsidiaries was $\n12.4\n billion.\n \nIB LLC, IBKRSS and IB Corp. are subject to the Uniform Net Capital Rule (Rule 15c3\n-\n1) under the Exchange Act. IB LLC is also subject to the CFTC’s minimum financial requirements (Regulation 1.17). IBC is subject to the Canadian Investment Regulatory Organization risk-adjusted capital requirement. IBKRFS is subject to the Swiss Financial Market Supervisory Authority eligible equity requirement, IBUK is subject to the United Kingdom Financial Conduct Authority Capital Requirements Directive, IBIE is subject to the Central Bank of Ireland financial resources requirement, IBI is subject to the National Stock Exchange of India net capital requirements, IBHK is subject to the Hong Kong Securities Futures Commission liquid capital requirement, IBSJ is subject to the Japanese Financial Supervisory Agency capital requirements, IBSG is subject to the Monetary Authority of Singapore capital requirements, and IBA is subject to the Australian Securities Exchange liquid capital requirement. \n‎\n \n\n\n107\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nThe table below summarizes capital, capital requirements and excess regulatory capital as of December 31, 2024.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nNet Capital/\n \n \n \n \n \n \n \n \nEligible Equity\n \nRequirement\n \nExcess\n \n \n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \n \n \n \nIB LLC\n \n$\n \n9,450\n \n$\n \n1,268\n \n$\n \n8,182\nIBHK\n \n \n \n1,427\n \n \n \n359\n \n \n \n1,068\nIBIE\n \n \n \n1,302\n \n \n \n293\n \n \n \n1,009\nOther regulated operating subsidiaries\n \n \n \n2,274\n \n \n \n170\n \n \n \n2,104\n \n \n$\n \n14,453\n \n$\n \n2,090\n \n$\n \n12,363\n \nRegulatory capital requirements could restrict the operating \nsubsidiaries\n from expanding their business and declaring dividends if their net capital does not meet regulatory requirements. Also, certain operating \nsubsidiaries\n are subject to other regulatory restrictions and requirements.\n \nAs of \nDecember 31, 2024\n, \nall regulated operating \nsubsidiaries\n were in compliance with their respective regulatory capital requirements.\n \n17.  Related Party Transactions\n \nReceivable from affiliate, reported in “Other assets” in the consolidated statements of financial condition, represents amounts advanced to Holdings and payable to affiliate represents amounts payable to Holdings under the Tax Receivable Agreement (see Note 4).\n \nThe table below presents the receivables from and payables to directors, officers, and their affiliates which are included in receivables from and payables to customers, respectively, in the consolidated statements of financial condition for the periods indicated.\n \n \n \n \n \n \n \n \n \n \n \n December 31,\n \n \n2024\n \n2023\n \n \n \n \n \n \n \n \n \n \n(in millions)\n \n \n \n \n \n \n \nReceivables from directors, officers and their affiliates\n \n$\n44\n \n$\n6\nPayables to directors, officers, and their affiliates\n \n$\n \n1,320\n \n$\n985\n \nThe Company may extend credit to these related parties in connection with margin and securities loans. Such loans are (i) made in the ordinary course of business, (ii) are made on substantially the same terms, including interest rates and collateral, as those prevailing at the time for comparable loans with persons not related to the company, and (iii) do not involve more than the normal risk of collectability or present other unfavorable features.\n‎\n \n\n\n108\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \n \n \n18.  Parent Company Condensed Financial Statements \n \nThe preparation of the Parent Company Condensed Financial Statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect reported amounts and disclosures in the condensed financial statements.\n \nParent Company Only – Condensed Statements of Financial Condition\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDecember 31, \n(in millions, except share amounts)\n \n2024\n \n2023\nAssets\n \n \n \n \n \n \nCash and cash equivalents\n \n$\n \n1\n \n \n$\n \n6\n \nInvestments in subsidiaries, equity basis\n \n \n \n4,270\n \n \n \n \n3,571\n \nOther assets \n1\n \n \n \n233\n \n \n \n \n230\n \nTotal assets\n \n$\n \n4,504\n \n \n$\n \n3,807\n \nLiabilities and Equity\n \n \n \n \n \n \nLiabilities:\n \n \n \n \n \n \nPayable to affiliates \n2\n \n$\n \n195\n \n \n$\n \n209\n \nAccrued expenses and other liabilities\n \n \n \n29\n \n \n \n \n14\n \n \n \n \n \n224\n \n \n \n \n223\n \nStockholders' equity:\n \n \n \n \n \n \nCommon stock, $\n0.01\n par value per share:\n \n \n \n \n \n \nClass A – Authorized - \n1,000,000,000\n, Issued - \n109,061,059\n and \n107,178,928\n shares, Outstanding – \n108,904,613\n and \n107,045,994\n shares as of December 31, 2024 and 2023\n \n \n \n1\n \n \n \n \n1\n \nClass B – Authorized, Issued and Outstanding – \n100\n shares as of December 31, 2024 and 2023\n \n \n \n—\n \n \n \n—\nAdditional paid-in capital \n \n \n \n1,816\n \n \n \n \n1,726\n \nRetained earnings\n \n \n \n2,515\n \n \n \n \n1,852\n \nAccumulated other comprehensive income, net of income taxes of $\n0\n and $\n0\n as of December 31, 2024 and 2023\n \n \n (\n45\n)\n \n \n \n8\n \nTreasury stock, at cost, \n156,446\n and \n133,034\n shares as of December 31, 2024 and 2023\n \n \n (\n7\n)\n \n \n (\n3\n)\nTotal equity\n \n \n \n4,280\n \n \n \n \n3,584\n \nTotal liabilities and equity\n \n$\n \n4,504\n \n \n$\n \n3,807\n \n___________________________\n \n(1)\nAs of December 31, 2024 and 2023, receivables from affiliates were immaterial\n.\n \n(2)\nAs \nof December 31, 2024 and 2023, respectively, payable to affiliates of $\n195\n million and $\n210\n million consisted primarily of amounts payable to Holdings under the Tax Receivable \nAgreement.\n \nParent Company Only – Condensed Statements of Comprehensive Income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n(in millions)\n \n2024\n \n2023\n \n2022\nIncome (loss) before income from subsidiaries\n \n$\n (\n12\n)\n \n$\n \n5\n \n \n$\n \n4\n \nUndistributed gains of subsidiaries, net\n \n \n \n913\n \n \n \n \n737\n \n \n \n \n463\n \nIncome tax expense\n \n \n \n146\n \n \n \n \n142\n \n \n \n \n87\n \nNet income\n \n$\n \n755\n \n \n$\n \n600\n \n \n$\n \n380\n \n \n \n \n \n \n \n \n \n \n \nNet income available for common stockholders \n \n$\n \n755\n \n \n$\n \n600\n \n \n$\n \n380\n \nCumulative translation adjustment, net of tax \n \n \n (\n53\n)\n \n \n \n30\n \n \n \n (\n26\n)\nComprehensive income available for common stockholders\n \n$\n \n702\n \n \n$\n \n630\n \n \n$\n \n354\n \n \n \n‎\n \n\n\n109\n \nTable of Contents\n \nInteractive Brokers Group, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n \n\n\n \nParent Company Only – Condensed Statements of Cash Flows\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nYear-Ended December 31,\n(in millions)\n \n2024\n \n2023\n \n2022\nCash flows from operating activities\n \n \n \n \n \n \n \n \n \nNet income\n \n$\n \n755\n \n \n$\n \n600\n \n \n$\n \n380\n \nAdjustments to reconcile net income to net cash used in operating activities\n \n \n \n \n \n \n \n \n \nUndistributed gains of subsidiaries, net\n \n \n (\n913\n)\n \n \n (\n737\n)\n \n \n (\n463\n)\nDeferred income taxes\n \n \n \n2\n \n \n \n \n34\n \n \n \n \n28\n \n(Gain) loss on remeasurement of Tax Receivable Agreement liability\n \n \n \n10\n \n \n \n (\n7\n)\n \n \n (\n6\n)\nChanges in operating assets and liabilities\n \n \n \n64\n \n \n \n (\n33\n)\n \n \n \n20\n \nNet cash used in operating activities\n \n \n (\n82\n)\n \n \n (\n143\n)\n \n \n (\n41\n)\nCash flows provided by investing activities \n1\n \n \n \n246\n \n \n \n \n185\n \n \n \n \n127\n \nCash flows used in financing activities\n \n \n (\n116\n)\n \n \n (\n67\n)\n \n \n (\n59\n)\nEffect of exchange rate changes on cash and cash equivalents\n \n \n (\n53\n)\n \n \n \n30\n \n \n \n (\n26\n)\nNet increase in cash and cash equivalents\n \n \n (\n5\n)\n \n \n \n5\n \n \n \n \n1\n \nCash and cash equivalents at beginning of year\n \n \n \n6\n \n \n \n \n1\n \n \n \n —\nCash and cash equivalents at end of year\n \n$\n \n1\n \n \n$\n \n6\n \n \n$\n \n1\n \nSupplemental disclosures of cash flow information\n \n \n \n \n \n \n \n \n \nCash paid for interest\n \n$\n \n3\n \n \n$\n \n2\n \n \n$\n \n1\n \nCash paid for taxes, net\n \n$\n \n117\n \n \n$\n \n111\n \n \n$\n \n67\n \n \n \n \n \n \n \n \n \n \n \nNon-cash investing activities:\n \n \n \n \n \n \n \n \n \nNon-cash distributions from subsidiaries\n \n$\n —\n \n$\n —\n \n$\n \n1\n \n___________________________\n \n(1)\nDividends received from IBG LLC for the three years ended December 31, 2024, 2023 and 2022\n, were $\n246\n million, $\n185\n million and $\n128\n million, respectively.\n \n \n19.  Subsequent Events\n \nThe Company has evaluated subsequent events for adjustment to or disclosure in its consolidated financial statements through the date the consolidated financial statements were issued.\n \nExcept as disclosed in Note 4 and Note 14, no other recordable or disclosable events occurred.\n \n*****\n \n \n\n\n110\n \nTable of Contents\n \n \n\n\n \n \n \n\n\n \nITEM 9.  CH\nANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n \nNone.\n \nITEM 9A.  CON\nTROLS AND PROCEDURES\n \nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\n \nThe Company maintains disclosure controls and procedures that are designed to provide reasonable assurance that information required to be disclosed in the reports it files or submits under the Securities Exchange Act of 1934 (the “Exchange Act”) is recorded, processed, summarized and reported accurately and within the time periods specified in the SEC’s rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to management, including the Chief Executive Officer (“CEO”) and Chief Financial Officer (“CFO”), as appropriate, to allow timely decisions regarding required disclosure.\n \nUnder the supervision and with the participation of our management, including our CEO and our CFO, we conducted an evaluation of our disclosure controls and procedures; as such term is defined under Exchange Act Rule 13a\n-\n15(e). Based on this evaluation, our CEO and our CFO concluded that our disclosure controls and procedures were effective as of the end of the period covered by this annual report.\n \nManagement’s Report on Internal Control over Financial Reporting\n \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. IBG, Inc.’s internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\n \nOur internal control over financial reporting includes those policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of IBG, Inc.; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of IBG, Inc.’s management and directors; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\n \nOur Accounting Policy Committee (the “APC”) provides a robust framework for the design and implementation of all relevant controls. The APC is comprised of six (6) experienced subject matter experts from within the Company’s accounting and regulatory disciplines, and includes the CFO and the Chief Accounting Officer. The APC is responsible for assessing the effects of complex transactions and related accounting guidance on the Company’s financial statements and to report the results of its assessments to management and to the Audit Committee. The APC’s mandate includes review and approval of the adoption and implementation of accounting guidance (new or newly applicable) by the Company.\n \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n \nManagement, including our CEO and our CFO, assessed the effectiveness of IBG, Inc.’s internal control over financial reporting as of December 31, 2024. In making this assessment, management used the criteria set forth in Internal Control\n-\nIntegrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). Based on management’s assessment and those criteria, management concluded that IBG, Inc. maintained effective internal control over financial reporting as of December 31, 2024.\n \nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report, which appears herein.\n \nChanges to Internal Control over Financial Reporting\n \nNo changes to our internal control over financial reporting for the year ended December 31, 2024 have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n\n\n111\n \nTable of Contents\n \n \n\n\n \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM \nTo the Stockholders and the Board of Directors of \nInteractive Brokers Group, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Interactive Brokers Group, Inc. and subsidiaries (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated statements as of and for the year ended December 31, 2024, of the Company and our report dated February 27, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nNew York, New York \nFebruary 27, 2025\n \n \n \n\n\n \n112\n \nTable of Contents\n \n \n\n\n \nITEM 9B.  \nOTHER INFORMATION\nDuring the quarter ended December 31, 2024, none of our directors or officers \nadopted\n, modified or \nterminated\n a contract, instruction or written plan for the purchase or sale of our securities intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) or a “\nnon-Rule\n \n10b5-1\n trading arrangement”, as defined in Item 408(c) of Regulation S-K.\n \nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\n \nNot applicable.\n \nPART III\n \nITEM 10.  DIRECTORS, EXECUTIVE\n OFFICERS AND CORPORATE GOVERNANCE\n \nInformation related to the Company’s directors and nominees under the following captions in the Company’s Proxy Statement is incorporated by reference herein:\n \n•\n“Item 1 - Election of Directors”\n \n•\n“Item 1 - Election of Directors - Board Meetings and Committees”\n \nExecutive Officers and Directors of Interactive Brokers Group, Inc.\n \n \n \n \n \n \nName\nAge\n \nPosition\nThomas Peterffy \n80\n \nChairman of the Board of Directors \nEarl H. Nemser \n78\n \nVice Chairman and Director\nMilan Galik \n58\n \nChief Executive Officer, President and Director\nPaul J. Brody \n64\n \nChief Financial Officer, Treasurer, Secretary and Director\nThomas A. Frank \n69\n \nExecutive Vice President \nLawrence E. Harris\n68\n \nDirector (Independent)\nWilliam Peterffy\n35\n \nDirector\nNicole Yuen\n62\n \nDirector (Independent)\nJill Bright\n62\n \nDirector (Independent)\nRichard Repetto\n66\n \nDirector (Independent)\n \nThomas Peterffy –\n Mr. Peterffy, our founder, has been the Chairman of our Board since November 2006 and Chief Executive Officer from November 2006 to September 2019. Mr. Peterffy has been at the forefront of applying computer technology to automate trading and brokerage functions since he emigrated from Hungary to the United States in 1965. In 1977, after purchasing a seat on the American Stock Exchange and trading as an individual market maker in equity options, Mr. Peterffy was among the first to apply a computerized mathematical model to continuously value equity option prices. By 1986, Mr. Peterffy developed and employed a fully integrated, automated market making system for stocks, options and futures. As this pioneering system extended around the globe, online brokerage functions were added and, in 1993, Interactive Brokers was formed.\n \nEarl H. Nemser –\n Mr. Nemser has been our Vice Chairman since November 2006. Mr. Nemser has been the Vice Chairman of IBG LLC and its predecessors since 1988 and serves as a director and/or officer for various subsidiaries of IBG LLC. \nMr. Nemser serves as an Independent Advisor to the law firm Dechert LLP. Mr. Nemser served as Special Counsel to Dechert LLP from January 2005 to October 2018. \nPrior to such time, Mr. Nemser served as Partner at the law firms of Swidler Berlin Shereff Friedman, LLP from 1995 to December 2004 and Cadwalader, Wickersham & Taft LLP prior to 1995. Mr. Nemser received a Bachelor of Arts degree in economics from New York University in 1967 and a Juris Doctor, magna cum laude, from Boston University School of Law in 1970.\n \nMilan Galik –\n Mr. Galik joined us in 1990 as a software developer and has served as the Chief Executive Officer of the Company since October 2019. Mr. Galik has also served as President of the Company and IBG LLC since October 2014. Mr. Galik served as Senior Vice President, Software Development of IBG LLC from October 2003 to October 2014. In addition, Mr. Galik has served as Vice President of IBKR Securities Services LLC since April 1998 and served as a member of the board of directors of the Boston Options Exchange from October 2013 to May 2023. Mr. Galik received a Master of Science degree in electrical engineering from the Technical University of Budapest in 1990.\n \n‎\n \n\n\n \n113\n \nTable of Contents\n \n \n\n\n \nPaul J. Brody –\n \nMr. Brody has been our Chief Financial Officer, Treasurer and Secretary since November 2006. Mr. Brody joined the Company in 1987 and has served as Chief Financial Officer of IBG LLC since December 2003. Mr. Brody serves as a director and/or officer for various of our subsidiaries. From 2005 to 2012, Mr. Brody served as a director, and for a portion of the time as member Vice Chairman, of The Options Clearing Corporation, of which Interactive Brokers LLC and IBKR Securities Services LLC are members. Mr. Brody also served as a director of Quadriserv Inc., an electronic securities lending platform provider, from 2009 to 2015. Mr. Brody received a Bachelor of Arts degree in economics from Cornell University in 1982.\n \nThomas A. Frank –\n Dr. Frank joined us in 1985 and has served since July 1999 as Executive Vice President of Interactive Brokers LLC. Dr. Frank served as Interactive Brokers LLC’s Chief Information Officer from July 1999 to April 2024. In addition, Dr. Frank has served as Vice President of IBKR Securities Services LLC since December 1990. \nDr. Frank has served as a director of The Options Clearing Corporation, since 2015. \nDr. Frank received a Ph.D. in physics from the Massachusetts Institute of Technology in 1985.\n \nLawrence E. Harris –\n Dr. Harris has been a director since July 2007 and lead independent director since July 2012. Dr. Harris is a professor of Finance and Business Economics at the University of Southern California, where he holds the Fred V. Keenan Chair in Finance at the Marshall School of Business. Dr. Harris also serves as trustee of the Davis Fundamental ETF Trust and as the research coordinator of the Institute for Quantitative Research in Finance. Dr. Harris formerly served as Chief Economist of the U.S. Securities and Exchange Commission. Dr. Harris earned his Ph.D. in Economics from the University of Chicago and is a CFA charterholder. Dr. Harris is an expert in the economics of securities market microstructure. Dr. Harris has written extensively about trading rules, transaction costs, index markets, and market regulation. Dr. Harris is also the author of the widely respected textbook \nTrading and Exchanges: Market Microstructure for Practitioners\n.\n \nWilliam Peterffy –\n Mr. William \nPeterffy \nhas been a director since April 2020, following one year as a Board observer. \nMr. William \nPeterffy is the Chair of the Investment Committee of the Peterffy Foundation where he oversees its investment portfolio. \nMr. William \nPeterffy is also a member of the Board of Trustees of the Collective Heritage Institute (commonly known as Bioneers) and focuses his efforts on sustainability issues. \nMr. William Peterffy is the Chief Executive Officer and founder of One Small Planet. \nMr. William \nPeterffy also worked as an investment analyst within the hedge fund industry. \nMr. William \nPeterffy is the son of our Chairman, Mr. Thomas Peterffy.\n \nNicole Yuen –\n Ms. Yuen \nhas been a director since July 2020. Ms. \nYuen has had a long-standing career in investment banking in Asia for over two decades and is widely credited for her pioneering efforts in internationalizing China’s capital market. Ms. Yuen was formerly Managing Director, Head of Equities, North Asia and Vice Chairman, Greater China for Credit Suisse from 2012 to 2018. Before joining Credit Suisse, Ms. Yuen worked at UBS for 18 years holding various leadership positions, across investment banking and securities divisions in Asia. Ms. Yuen also served as a member of the Listing Committee of the China Securities Regulatory Commission. Prior to investment banking, Ms. Yuen was a partner at Clifford Chance, Hong Kong, after having worked as a lawyer in the U.K., the U.S. and The Netherlands. Ms. Yuen now also sits on the board of Asia Dragon Trust plc as an independent non-executive director.\n \nJill Bright \n–\n \nMs. Bright \nhas been a director since April 2022. \nMs. Bright has over three decades of experience in human resources management and administration. Ms. Bright is an operating executive at Crestview Partners focused on human capital management and also serves as Chief Transformation Officer for one of their portfolio companies. Ms. Bright has served as Chief Administrative Officer for LionTree LLC as well as for \nCondé Nast\n, led Human Resources & Administration for Sotheby’s and spent over five years in Human Resources at American Express. Ms. Bright is currently a Board Director and Chair of the Compensation Committee for WideOpenWest (WOW) and also serves as a Board Director and Chair of the Human Resource Committee for Pursuit (PRSU). Ms. Bright completed her MBA at New York University's Stern School of Business.\n \nRichard Repetto –\n Mr. Repetto \nhas been a director since January 2024. \nMr. Repetto is a renowned research analyst with over 25 years of experience covering electronic trading and financial technology companies. Mr. Repetto retired in June 2023 as Managing Director and Senior Research Analyst at Piper Sandler. Mr. Repetto is currently employed at Cornerstone Financial Technology Management, a hedge fund focused on using advanced technology in the investment decision making process for financial technology stocks. Throughout his successful career, Mr. Repetto received many accolades, including the Financial Times/StarMine “Global Analyst of the Year” from the Financial Times in 2012.\n \nCode of Ethics\n \nIBG, Inc.’s Code of Ethics and Business Conduct applies to all directors, officers and employees, including its Chief Executive Officer, its Chief Financial Officer and its Chief Accounting Officer. Information relating to our Code of Business Conduct and Ethics is included in Part I, Item 1 of this Annual Report on Form 10\n-\nK. We will post any amendments to the Code of Ethics and Business Conduct, and any waivers that are required to be disclosed by the rules of either the SEC or Nasdaq on the investor relations section of our website located at www.interactivebrokers.com/ir.\n\n\n \n114\n \nTable of Contents\n \n \n\n\n \n \nInsider Trading Policy\n \nWe have \nadopted\n an Insider Trading Policy that governs the purchase, sale and/or other dispositions of our securities by our directors, officers and employees, as well as their immediate family members and entities owned or controlled by them, that is designed to promote compliance with insider trading laws, rules and regulations.\n \nITEM 11.  EXECUTIVE \nCOMPENSATION\n \nInformation relating to director and executive officer compensation under the following captions in the Company’s Proxy Statement is incorporated by reference herein:\n \n•\n“Compensation of Directors”\n \n•\n“Executive Compensation”\n \nITEM 12.  SECURITY OWNERSHIP OF CERTAI\nN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n \nOther information relating to security ownership of certain beneficial owners and management is set forth under the caption “Beneficial Ownership of Directors, Executive Officers and Owners of More than Five Percent” in the Company’s Proxy Statement and such information is incorporated by reference herein.\n \nITEM 13.  TRANSACTIONS WITH RELA\nTED PERSONS, PROMOTERS AND CERTAIN CONTROL PERSONS\n \nInformation regarding certain relationships and related transactions under the following caption in the Company’s Proxy Statement and such information is incorporated by reference herein:\n \n•\n“Certain Relationships and Related Transactions”\n \nITEM 14.  PRINCIPAL ACCOUNTANT FE\nES AND SERVICES\n \nInformation regarding principal accounting fees and under the following caption in the Company’s Proxy Statement is incorporated by reference herein:\n \n•\n“"
  }
}