{
  "ticker": "IBM",
  "cik": "0000051143",
  "company_name": "INTERNATIONAL BUSINESS MACHINES CORP",
  "filing_date": "2025-02-25",
  "accession": "0000051143-25-000015",
  "primary_doc": "ibm-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business:\nInternational Business Machines Corporation (IBM or the company) was incorporated in the State of New York on June 16, 1911, as the Computing-Tabulating-Recording Co. (C-T-R), a consolidation of the Computing Scale Co. of America, the Tabulating Machine Co. and The International Time Recording Co. of New York. Since that time, IBM has focused on the intersection of business insight and technological innovation, and its operations and aims have been international in nature. This was signaled over 100 years ago, in 1924, when C-T-R changed its name to International Business Machines Corporation. And it continues today—we create sustained value for clients by helping them leverage the power of hybrid cloud and artificial intelligence (AI). Our hybrid cloud platform and AI technology support clients’ digital transformations and helps them reimagine critical workflows, at scale, and modernize applications to increase agility, drive innovation and create operational efficiencies. Our offerings draw from leading IBM capabilities in software, consulting services capability to deliver business outcomes, and deep incumbency in mission-critical infrastructure, all bolstered by one of the world’s leading research organizations.\nThe following information is included in IBM’s 2024 Annual Report to Stockholders and is incorporated by reference:\nIBM Strategy—pages 11 to 12.\nBusiness Segments and Capabilities—pages 12 to 14.\nHuman Capital—pages 14 to 15. \nStrategic Partnerships\nWe proactively partner with a broad variety of companies including hyperscalers, service providers, global system integrators, and software and hardware vendors. We work alongside our partners to deliver end-to-end solutions that address our clients’ complex business challenges while accelerating growth. Our strategic partners include: Adobe, Amazon Web Services (AWS), Microsoft, Oracle, Palo Alto Networks, Salesforce, Samsung Electronics and SAP, among others. \nCompanies with which we have strategic partnerships in some areas may be competitors in other areas.\nCompetition\nIBM is a globally integrated enterprise that participates in a highly competitive environment. Our competitors vary by industry segment, and range from large multinational enterprises to smaller, more narrowly focused entities. Across our business segments, we recognize hundreds of competitors worldwide and as we execute our hybrid cloud and AI strategy, we are regularly exposed to new competitors.\nOur principal methods of competition are: technology innovation; performance; price; quality; brand; our breadth of capabilities, products and services; talent; client relationships and trust; the ability to deliver business value to clients; and service and support. In order to maintain leadership, we optimize our portfolio with organic and inorganic innovations and effective resource allocation. These investments not only drive current performance but will extend our innovation leadership into the future. \nOur breadth and depth of expertise enables us to take different technologies and bring them together to solve the most pressing business issues of our clients. We differentiate from other providers by bringing together incumbency with enterprises, deep expertise in technology, industries and business processes, a broad go-to-market reach including an ecosystem of partners and alliances, and a strong focus on innovation. All of these attributes position IBM for accelerated growth now and prepare us for the next set of business opportunities, such as quantum computing.\n1\nTable of Contents\nOverall, the company is the leader or among the leaders in each of our business segments. A summary of the competitive environment for each business segment is included below:\nSoftware:\nThe depth, breadth, and innovation of our software offerings, coupled with our global reach, deep industry expertise and research capabilities help differentiate our offerings from our competitors. Our hybrid cloud and AI platforms allow clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The principal competitors in this segment include: Alphabet (Google), Amazon, BMC, Broadcom, Informatica, Microsoft, Oracle, Salesforce, SAP and Splunk. We also compete with smaller, niche competitors in specific geographic regions or product segments.\nConsulting:\nConsulting focuses on integrating skills on strategy, experience, technology and operations by domain and industry. Consulting competes in a dynamic market including consulting, systems integration, application development, application management and business process outsourcing services. Our broad-based competitors include: Accenture, Capgemini, India-based service providers, management consulting firms, the consulting practices of public accounting firms, engineering service providers, and many companies that primarily focus on local markets or niche service areas.\nInfrastructure:\nIBM is well positioned in the growing hybrid cloud infrastructure market, providing on-premises and cloud-based server and storage solutions.\n \nWe gain advantage and differentiation through investments in higher-value capabilities, including security, scalability, and reliability, designed especially for mission-critical and AI workloads. In addition, we offer a portfolio of life-cycle services for hybrid cloud infrastructure\n \ndeployment. Our principal competitors include: Dell Technologies, Hewlett-Packard Enterprise (HPE), Intel, NetApp and Pure Storage as well as original device manufacturers (ODMs) who provide systems that are re-branded. Further, cloud service providers are leveraging innovation in technology and service delivery to compete with traditional providers and to offer additional routes to market for server and storage systems. \nFinancing:\nFinancing provides client and commercial financing, facilitating IBM clients’ acquisition of hardware, software and services. Financing’s ability to manage credit and residual value risk generates a competitive advantage for the company. The key competitive factors include: interest rates charged, IT product experience, client service, contract flexibility, ease of doing business, global capabilities and residual values. In client and commercial financing, Financing primarily competes with non-captive financing entities and financial institutions.\nForward-Looking and Cautionary Statements\nCertain statements contained in this Form 10-K may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 (“Reform Act”). Forward-looking statements are based on the company’s current assumptions regarding future business and financial performance. These statements by their nature address matters that are uncertain to different degrees. The company may also make forward-looking statements in other reports filed with the Securities and Exchange Commission (“SEC”), in materials delivered to stockholders and in press releases. In addition, the company’s representatives may from time to time make oral forward-looking statements. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. Words such as “anticipates,” “believes,” “expects,” “estimates,” “intends,” “plans,” “projects,” and similar expressions, may identify such forward-looking statements. Any forward-looking statement in this Form 10-K speaks only as of the date on which it is made. Except as required by law, the company assumes no obligation to update or revise any forward-looking statements. In accordance with the Reform Act, set forth under",
    "item1a": "Item 1A., \"Risk Factors,\" the company faces numerous and evolving cybersecurity threats, including risks originating from the increased use of AI, intentional acts of individual and groups of criminal hackers, hacktivists, state-sponsored organizations, nation states and competitors; from intentional and unintentional acts or omissions of customers, contractors, business partners, vendors, employees and other third parties; and from errors in processes or technologies, as well as the risks associated with the number of customers, contractors, business partners, vendors, employees and other third parties working remotely. \nWhile the company continues to monitor for, identify, investigate, respond to and remediate cybersecurity risks, including incidents and vulnerabilities, there have not been any that have had a material adverse effect on the company, though there is no assurance that there will not be cybersecurity risks that will have a material adverse effect in the future.\nGovernance\nIBM’s Enterprise & Technology Security (“E&TS”) organization has oversight responsibility for the security of both IBM’s internal systems and external offerings and works across all of the organizations within the company to protect IBM, its brand, and its clients against cybersecurity risks. E&TS also addresses cybersecurity risks associated with third party suppliers. For these purposes, E&TS includes a dedicated Chief Information Security Officer (“CISO”) whose team is responsible for leading enterprise-wide information security strategy, policy, standards, architecture, and processes for IBM’s internal systems. The CISO manages the CSIRT. The CISO also manages the Product Security Incident Response Team (“PSIRT”), which focuses on product vulnerabilities potentially affecting the security of offerings sold to customers. IBM also has Business Information Security Officers (“BISO”) who are coordinated by the Office of the CISO on security issues specific to particular business segments.\n10\nTable of Contents\nThe CSIRT team, together with the Office of the Chief Information Officer (“CIO”), Cyber Legal, Corporate Security, and BISOs, engages in on-going reviews of incidents, threat intelligence, detections, and vulnerabilities, including to assess client and regulatory impact. Events of interest are promptly reported to the Senior Vice President (“SVP”) and Chief Legal Officer (\"CLO\"), and the SVP overseeing cybersecurity (“SVP Sponsor”).\nIncidents are delegated to an appropriate incident response team for assessment, investigation, and remediation. Depending on the nature of the matter, the incident response team may include individuals from E&TS, the Office of the CISO, the Office of the CIO, Cyber Legal, Business Units, the Office of Privacy and Responsible Technology, Human Resources, Procurement, Finance and Operations, and Corporate Security. The incident response teams advise and consult with the CLO and the SVP Sponsor, as appropriate. \nThe \nCybersecurity Advisory Committee (“CAC”)\n meets regularly and is responsible for overseeing management of the Company’s cybersecurity risk. The CAC is composed of, among others, SVPs from the major business units, the SVP Sponsor, and the CLO. The CAC is responsible for, among other things, setting the Company’s governance structure for managing cybersecurity risk and reviewing noteworthy cybersecurity incidents and strategies to prevent recurrence.\n \nIBM management responsible for managing cybersecurity risk reflects a cross-section of functions from across the organization with significant experience in managing such risk as well as the technologies underlying these risks. They also hold leadership positions outside of IBM in the field of cybersecurity, serving on governing and advisory boards of public and private institutions at the forefront of issues related to cybersecurity, including technology development, cybersecurity policy, and national security.\nThe Board of Directors and the Audit Committee oversee the cyber governance process. \nLeadership from E&TS, including the CISO, make regular presentations to the Audit Committee and the full Board on identification, management, and remediation of cybersecurity risks, both internal and external, as well as threat intelligence, emerging global policies and regulations, cybersecurity technologies, and best practices.\n In addition, senior management provides briefings as needed to the Audit Committee Chair, the Audit Committee, and, as appropriate, the full Board, on cybersecurity issues and incidents of potential interest.",
    "item1b": "Item 1B. Unresolved Staff Comments:\nNot applicable.",
    "item1c": "Item 1C. Cybersecurity:\nRisk Management and Strategy\nCybersecurity is a critical part of risk management at IBM and is integrated with the company’s overall enterprise risk management framework.\n The Board of Directors and the Audit Committee of the Board are responsible for overseeing management’s execution of cybersecurity risk management and for assessing IBM’s approach to risk management. Senior management is responsible for assessing and managing IBM’s exposure to cybersecurity risks on an ongoing basis.\nFrom an enterprise perspective, we implement a multi-faceted risk management approach based on the National Institute of Standards and Technology Cybersecurity Framework. We have established policies and procedures that provide the foundation upon which IBM’s infrastructure and data are managed. We regularly assess and adjust our technical controls and methods to identify and mitigate emerging cybersecurity risks. We use a layered approach with overlapping controls to defend against cybersecurity attacks and threats on IBM networks, end-user devices, servers, applications, data, and cloud solutions. \nWe draw heavily on our own commercial security solutions and services to manage and mitigate cybersecurity risks. IBM maintains a Security Operations Center (“SOC”) that monitors for threats to IBM’s networks and systems, utilizing threat intelligence provided by a range of sources, including the IBM Security X-Force Exchange platform, which maintains one of the largest compilations of threat intelligence in the world. \nWe also rely on tools licensed from third party security vendors to monitor and manage cybersecurity risks. \nWe periodically engage third parties to supplement and review our cybersecurity practices and provide relevant certifications.\nWe have a global incident response process, managed by IBM’s Computer Security Incident Response Team (“CSIRT”), that relies primarily on internal expertise to respond to cybersecurity threats and attacks. We utilize a combination of online training, educational tools, videos and other awareness initiatives to foster a culture of security awareness and responsibility among our workforce, including responsibility for reporting suspicious activity.\nIBM has a third party supplier risk management program to oversee and identify risks from cybersecurity threats associated with its use of third party service providers and vendors. Risks are assessed and prioritized based, among other things, on the type of offering/engagement, supplier assessments, threat intelligence, and industry practices.\n \nAs discussed in greater detail in"
  }
}