{
  "ticker": "IDXX",
  "cik": "0000874716",
  "company_name": "IDEXX LABORATORIES INC /DE",
  "filing_date": "2025-02-21",
  "accession": "0000874716-25-000037",
  "primary_doc": "idxx-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS\nCOMPANY OVERVIEW\nIDEXX was incorporated in Delaware in 1983. We develop, manufacture, and distribute products and provide services primarily for the companion animal veterinary, livestock and poultry, dairy and water testing industries. We also provide human medical point-of-care and laboratory diagnostics. Our primary products and services are:\n•\nPoint-of-care veterinary diagnostic products, comprised of instruments, consumables, and rapid assay test kits;\n•\nVeterinary reference laboratory diagnostic and consulting services;\n•\nPractice management and diagnostic imaging systems and services used by veterinarians;\n•\nHealth monitoring, biological materials testing, laboratory diagnostic instruments, and services used by the biomedical research community;\n•\nDiagnostic and health-monitoring products for livestock, poultry, and dairy;\n•\nProducts that test water for certain microbiological contaminants; and\n•\nPoint-of-care electrolytes and blood gas analyzers.\nOur Purpose is to be a great company that creates exceptional long-term value for our customers, employees, and stockholders by enhancing the health and well-being of pets, people, and livestock.\nDESCRIPTION OF BUSINESS BY SEGMENT\nWe operate primarily through three business segments: Companion Animal Group, Water quality products, and Livestock, Poultry and Dairy. Our Other operating segment combines and presents our human medical diagnostic products business with our out-licensing arrangements because they do not meet the quantitative or qualitative thresholds for reportable segments.\nCompanion Animal Group (“CAG”) - \nDiagnostic and information management-based products and services for the companion animal veterinary industry, including in-clinic diagnostic solutions, outside reference laboratory services, and veterinary software and services.\nCAG Diagnostics\n \nWe provide diagnostic capabilities that meet veterinarians’ diverse needs through a variety of modalities, including in-clinic diagnostic solutions and outside reference laboratory services. Regardless of modality utilized, veterinarians are provided with clinically relevant data which is integrated within our information management technologies. The result is a comprehensive view of patient diagnostic information that is easily accessible by both the veterinarian and pet owner.\nIn-Clinic Diagnostic Solutions\n. Our in-clinic diagnostic solutions are comprised of our IDEXX VetLab suite of in-clinic chemistry, hematology, immunoassay, electrolyte, urinalysis, cytology, blood gas, and coagulation analyzers, as well as associated consumable products that provide real-time reference lab quality diagnostic results. Several of these in-clinic analyzers, including the Catalyst One Chemistry analyzer, ProCyte One hematology analyzer, SediVue Dx Analyzer, and IDEXX inVue Dx Cellular Analyzer, utilize proprietary artificial intelligence (“AI”) capabilities in their image capture systems to analyze samples. IDEXX in-clinic analyzers feature load-and-go sample handling and integration with a cloud-enabled software ecosystem, including the IDEXX VetLab Station and VetConnect PLUS. Our in-clinic diagnostic solutions also include a broad range of single-use, IDEXX SNAP\n \nrapid assay test kits that provide quick, accurate, and convenient point-of-care diagnostic test results for a variety of companion animal disease-causing pathogens and health conditions. Additionally, we offer extended maintenance agreements in connection with the sale of our instruments.\n    \nBlood and Urine Chemistry\n. Our blood and urine chemistry analyzers are used by veterinarians to measure levels of certain enzymes and other substances in blood or urine for monitoring health status and assisting in diagnosing physiologic conditions. We actively sell the Catalyst One Chemistry Analyzer and continue to support the Catalyst Dx Analyzer, both of which perform chemistry, immunoassay, and electrolyte tests. We also support the \n6\nVetStat Electrolyte and Blood Gas analyzer. Sales of consumables to customers who use our chemistry analyzers provide the majority of our instrument consumables revenues from our installed base of IDEXX VetLab instruments. \n    \nHematology\n. Our hematology analyzers assess the cellular components of blood, including red blood cells, white blood cells, and platelets (also called a complete blood count). These analyzers include the ProCyte One and ProCyte Dx hematology analyzers. We also sell the Coag Dx Analyzer, which permits the detection and diagnosis of blood clotting disorders. We continue to offer consumables to support analyzers that are not actively marketed including the LaserCyte Dx Hematology Analyzer.\n    \nUrinalysis\n. The SediVue Dx Analyzer provides a complete urine sediment analysis. This platform features proprietary AI capabilities. The IDEXX VetLab UA Analyzer provides rapid, automated capture of semi-quantitative chemical urinalysis from IDEXX UA strips and is validated specifically for veterinary use.\n    \nCytology\n. During the fourth quarter of 2024, we launched in North America our new cellular analyzer, IDEXX inVue Dx, which detects the most common cytologic changes found in blood. The IDEXX inVue Dx Cellular Analyzer uses advanced optics and AI technology in a slide-free, load-and-go platform. \n    \n    \nRapid Assay\n. The SNAP rapid assays are single-use, handheld test kits that can work without the use of instrumentation, although many kits may also be activated with results automatically captured and interpreted by the SNAP Pro Analyzer. This device improves medical care by allowing veterinarians to share the test results with the pet owner on the SNAP Pro Analyzer screen, or via VetConnect PLUS. The principal canine SNAP rapid assay tests include SNAP 4Dx Plus, which tests for the seven vector-borne diseases causing pathogens, including Lyme disease as well as canine heartworm, and SNAP Heartworm RT, which tests for heartworm. Sales of our canine vector-borne disease tests are typically greater in the first half of our fiscal year due to seasonality of disease testing in the veterinary practices in the Northern Hemisphere. The principal feline SNAP rapid assay tests include SNAP Feline Triple, which tests for feline immunodeficiency virus (“FIV”) (which is similar to the virus that leads to AIDS in humans), feline leukemia virus (“FeLV”) and heartworm, and SNAP FIV/FeLV Combo Test, which tests for FIV and FeLV.\n    \nIDEXX VetLab Station\n. The IDEXX VetLab Station (“IVLS”) connects and integrates the diagnostic information from all the IDEXX VetLab analyzers, and thus provides reference laboratory information management system capability. IVLS also sends all results created on connected instruments instantly to VetConnect PLUS. We sell IVLS as an integral component for our in-clinic analyzer suite. In 2024, we upgraded our IVLS to work easier and faster than our previous version, providing two times faster performance on common workflows and access to historical results five times faster. \nIntegrated Diagnostic Information Management\n.\n \nVetConnect PLUS is a cloud-based technology that enables veterinarians to access and analyze patients’ data from all of IDEXX’s diagnostic modalities. These integrated diagnostic results provide the veterinarian with a visualization of patient-specific information, allowing the veterinarian to easily see and trend diagnostic results, enabling greater medical insight and enhanced decision-making through IDEXX DecisionIQ, an analytical tool incorporated in VetConnect PLUS that utilizes proprietary technology, including AI, to aid practitioners in making medical diagnoses. In addition, VetConnect PLUS provides instant mobile or browser-based access to results, which can be printed or emailed to pet owners and other veterinarians. \nReference Laboratory Diagnostic and Consulting Services\n.\n We offer commercial reference laboratory diagnostic and consulting services to veterinarians in many developed geographies worldwide, including customers in the U.S., Europe, Canada, Australia, Japan, New Zealand, South Africa, and South Korea, through a network of approximately 80 laboratories. Customers use our services by submitting samples by courier or overnight delivery to one of our facilities. Most test results have same-day or next-day turnaround times. Our diagnostic laboratory business also provides health monitoring and diagnostic testing services to biomedical research customers in North America, Europe, and Asia.\nOur reference laboratories offer a large selection of tests and diagnostic panels to detect a number of disease states and other conditions in animals, including all tests that can be run in-clinic at the veterinary practice with our instruments or rapid assays. This menu of tests also includes a number of specialized tests that we have developed that allow practitioners to diagnose increasingly relevant diseases and conditions in dogs and cats, including parasites, heart disease, allergies, pancreatitis, diabetes, renal disease, and infectious diseases. We also offer cancer screening to aid in diagnosis, assist in therapy selection, and support therapy management and monitoring.\n7\nIDEXX Telemedicine\n. \nAdditionally, we provide specialized veterinary consultation, telemedicine, and advisory services, including radiology, dental radiography, cardiology, internal medicine, and ultrasound consulting. These services enable veterinarians to obtain diagnostic interpretations, and radiology and cardiology assessments. IDEXX Telemedicine services are accessed through IDEXX VetMedStat, a cloud-based software platform for case submission and interpretation that embeds proprietary AI capabilities aiding analysis of images and electrocardiogram results.\nVeterinary Software and Services & Diagnostic Imaging Systems\nVeterinary Software and Services\n. We develop, market, and sell a portfolio of software and services for independent veterinary clinics and corporate groups. This portfolio includes:\n \n    \nPractice management systems\n. We provide software, hardware, and integrated services that run key functions of veterinary clinics, including managing patient electronic health records, scheduling, client communication, billing, and inventory management. Our practice management systems offerings include cloud-based ezyVet, Animana, and IDEXX Neo, and on-premises Cornerstone. To support the software system needs of practices, IDEXX provides integrated services including Payment Solutions, Data Backup & Recovery, and Practice Supplies.\n    Third-party integrations strengthen our practice management systems value proposition by improving user workflows and can quickly add new functionality to the practice management systems. Our commercial application programming interfaces and partner management processes allow controlled access to the practice management systems platform while providing an enhanced user experience. Our large practice management systems installed base provides access to veterinary channel transaction activity, enabling a syndicated data offering. Industry pharmaceutical and nutrition partners leverage our data to understand channel market performance and to provide behavioral insights.\n    \nSoftware applications that extend workflow capabilities for practices and groups\n. We are able to improve overall patient management and workflow optimization through coordination and tracking of every step of a patient during a hospital stay. Our SmartFlow cloud offering works in conjunction with major veterinary practice management systems, including ezyVet, Cornerstone, Animana, IDEXX Neo, and certain third-party practice management systems, and VetRadar provides workflow capability for ezyVet. \n    \nClient marketing and wellness plan management\n. In addition, we offer cloud-based client communication (Pet Health Network Pro, Pet Health Network 3D, and Vello) and preventive care plan management software (Petly Plans) designed to strengthen the relationship between the veterinarian and the pet owner. To support the communication needs between general practices and specialty referral practices, IDEXX offers rVetLink software. Lastly, IDEXX Enterprise provides centralized management and reporting capabilities for groups of veterinary practices. \nDiagnostic Imaging Systems\n. Our diagnostic imaging systems capture radiographic images in digital form, replacing traditional x-ray film and the film development process, which generally requires the use of hazardous chemicals and darkrooms. We market and sell two diagnostic imaging systems primarily used in small animal veterinary applications: IDEXX ImageVue DR50 and IDEXX ImageVue DR30.\nOur diagnostic imaging systems employ picture archiving and communication system (“PACS”) software called IDEXX-PACS, which facilitates radiographic image capture and review. IDEXX Web PACS is our cloud-based software-as-a-service (“SaaS”) offering for viewing, accessing, storing, and sharing multi-modality diagnostic images. IDEXX Web PACS is integrated with Cornerstone, ezyVet, IDEXX Neo, and IDEXX VetConnect\n \nPLUS to provide centralized access to diagnostic imaging results alongside patient diagnostic results from any internet-connected device. IDEXX Web PACS uses proprietary AI capabilities to enable optimal sharing, analysis, and storage of diagnostic images. \nWe believe that the breadth of our full diagnostic solution, including novel products and services developed and made available only by IDEXX, as well as the seamless software integration of our offering, provide a differentiated competitive advantage by giving veterinarians the tools and services to offer advanced veterinary medical care. We believe that with the use of our products and services, veterinary practices significantly improve the quality of veterinary care provided to their patients, increase staff efficiencies, and better communicate the value of this medical care to the pet owner. We believe that these capabilities, enabled by the use of IDEXX products and services, improve the effectiveness and financial health of the veterinary practice.\n8\nWater quality products (“Water”) \n- Water provides innovative testing solutions for easy, rapid, and accurate detection and quantification of various microbiological parameters in water.\nWater testing\n. Our principal products are the Colilert, Colilert-18, and Colisure tests, which detect the presence of total coliforms and \nE. coli\n in water. These organisms are broadly used as microbial indicators for potential fecal contamination in water. Our products utilize nutrient-indicators that produce a change in color or fluorescence when metabolized by target microbes in the sample. Our water tests are used by government laboratories, water utilities, and private certified laboratories to test drinking water in compliance with regulatory standards, including U.S. Environmental Protection Agency (“EPA”) standards. The tests also are used in evaluating water used in production processes (for example, in beverage and pharmaceutical applications) and in evaluating bottled water, recreational water, wastewater, and water from private wells. We also sell consumables, parts, and accessories to be used with many of our water testing products. IDEXX also offers the following products:\n    \nEnterolert\n. Our Enterolert products detect the presence of \nenterococci\n in drinking, waste, and recreational waters. \nEnterococc\ni, bacteria normally found in human and animal waste, are organisms broadly used as microbial indicators for potential fecal contamination in water. \n    \nPseudalert\n. Our Pseudalert products detect the presence of \nPseudomonas aeruginosa\n in pool, spa, and bottled water. \nPseudomonas aeruginosa\n is a pathogen that can cause “hot-tub rash,” “swimmer’s ear,” and potentially fatal infections in individuals with weakened immune systems. \n    \nFilta-Max and Filta-Max\n \nxpress\n. \nOur Filta-Max and Filta-Max\n \nxpress\n products are used in the detection of \nCryptosporidium\n and \nGiardia\n in water. \nCryptosporidium\n and \nGiardia\n are parasites that can cause potentially fatal gastrointestinal illness if ingested. We also distribute certain water testing kits manufactured by Thermo Fisher Scientific, Inc. that complement our \nCryptosporidium\n and \nGiardia\n testing products.\n    \nLegiolert\n. Our Legiolert product is a simple culture method test for the detection of \nLegionella pneumophila, \nthe most common \nLegionella\n species in water and the primary cause of Legionnaires’ disease. The Legiolert test is designed to be used on potable or non-potable water sources with results in seven days.\n    \nQuanti-Tray products\n. Our Quanti-Tray products, when used in conjunction with our Colilert, Colilert-18, Colisure, Enterolert, Pseudalert, Heterotrophic Plate Count (“HPC”) or Legiolert products, provide users quantitative measurements of microbial contamination rather than a presence/absence indication. Our Quanti-Tray Sealer PLUS, and Quanti-Tray Sealer 2X are used with the Quanti-Tray products for the determination of bacterial density in water samples. Our SimPlate and EasyDisc for HPC products detect the total number of the most common bacteria in a water sample.\n    \nIDEXX Tecta Systems\n. Our IDEXX Tecta system instruments automate several steps in water testing workflows, allowing multiple samples to be tested simultaneously, with remote notification capability. Tecta detects total coliforms and \nE. coli\n, \nE. coli\n only, fecal coliforms, and \nenterococci\n. \nLivestock, Poultry and Dairy (“LPD”)\n - LPD provides diagnostic tests, services, and related instrumentation that are used to manage the health status of livestock and poultry, to improve producer efficiency, and to ensure the quality and safety of milk.\nLivestock, Poultry, Herd Health Screening and Production Management\n. Our livestock and poultry diagnostic products are purchased by government and private laboratories that provide testing services to livestock veterinarians, producers, and processors, and also directly by livestock veterinarians and producers. Our principal livestock and poultry diagnostic products include tests for Bovine Viral Diarrhea Virus (“BVDV”), Porcine Reproductive and Respiratory Syndrome (“PRRS”), Transmittable Spongiform Encephalopathies (“TSE”), and African Swine Fever (“ASFV”). BVDV is a common and contagious viral infection that suppresses the immune system, making the animal susceptible to a host of other infections, and impacting beef and dairy production yields as a result. PRRS is a contagious virus causing reproductive problems and respiratory diseases in swine, leading to increased piglet mortality, reduced growth, and vulnerability to secondary infections. TSE is a transmissible disease in which infected animals exhibit behavioral disturbances and a progressive loss of physical condition that precedes death. Our RealPCR ASFV Test is a real-time polymerase chain reaction (“PCR”) assay that provides early and accurate detection of ASFV supporting prevention, control, and eradication programs by veterinarians and producers. We also sell our Alertys Milk Pregnancy Test, Alertys Ruminant Pregnancy Test, Alertys On-Farm Pregnancy Test, and Rapid Visual Pregnancy Test for cattle and other ruminants, which can detect pregnancy 28 days after breeding using milk, serum, or whole blood samples. We also offer herd health screening services to livestock veterinarians and producers. \n9\nDairy products\n. Our principal dairy products use our SNAP test platform and are used by dairy producers and processors worldwide to detect antibiotic drug residue in milk. Our primary product lines are SNAP Beta-Lactam ST and SNAPduo ST Plus, which detect certain beta-lactam and tetracycline antibiotic residues.\nOther\n - \nOur Other operating segment combines and presents our human medical diagnostic products and services business (“OPTI Medical”) with our out-licensing arrangements because they do not meet the quantitative or qualitative thresholds for reportable segments.\nOPTI Medical\n.\n \nThrough OPTI\n \nMedical, we sell point-of-care analyzers and related consumables for use in human medical hospitals and clinics to measure electrolytes, blood gases, acid-base balance, glucose, lactate, blood urea nitrogen and ionized calcium, and to calculate other parameters such as base excess and anion gap. These OPTI analyzers are used primarily in emergency rooms, operating rooms, cardiac monitoring areas, and other locations where time-critical diagnostic testing is performed within the hospital setting. The OPTI CCA-TS2 Analyzer runs whole blood, plasma, and serum samples on single-use disposable cassettes that contain various configurations of analytes. Previously we also provided human testing solutions for the detection of SARS-CoV-2, the virus that causes COVID-19. During the first quarter of 2023, we discontinued actively marketing our COVID-19 testing products and services.\nOther Activities\n.\n \nWe own certain drug delivery technology intellectual property, that we continue to seek to commercialize through agreements with third parties, such as pharmaceutical companies, which are included in the Other segment.\nAdditional information about our products and services can be found on our website. Information contained on or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this Annual Report on Form 10-K or any other filing we make with the SEC.\nMARKETING AND DISTRIBUTION\nWe market, sell, and service our products worldwide through our marketing, customer service, sales, and technical service groups, as well as through independent distributors and other resellers. We maintain a sales presence in the U.S. and in major regions worldwide including Africa, Asia Pacific, Canada, Europe, and Latin America.\nGenerally, we select the appropriate distribution channel for our products based on the type of product, technical service requirements, number and concentration of customers, regulatory requirements, and other factors. We market our companion animal diagnostic products to veterinarians directly in the U.S. Outside the U.S., we sell our companion animal diagnostic products through our direct sales force and, in certain countries, through distributors and other resellers. We sell our veterinary reference laboratory diagnostic and consulting services worldwide, generally through our direct sales force. We market our diagnostic imaging products primarily through our direct sales force in the U.S. and Canada. We market our software products primarily through our direct sales force in the U.S., Canada, Europe, and Australia. We market our Water and LPD products primarily through our direct sales force in the U.S. and Canada. Outside the U.S. and Canada, we market these products through our direct sales force and, in certain countries, through selected independent distributors. We sell our OPTI products and services both directly and through independent human medical product distributors.\nRESEARCH AND DEVELOPMENT\nOur business includes the development and introduction of new products and services and may involve entry into new business areas. We maintain active research and development programs in each of our three primary business segments. Our research and development expenses, which consist of salaries, employee benefits, certain licensing agreements, materials and external consulting and development costs, were $219.8 million for the year ended December 31, 2024, or 5.6% of our consolidated revenue, $191.0 million for the year ended December 31, 2023, or 5.2% of our consolidated revenue and $254.8 million for the year ended December 31, 2022, or 7.6% of our consolidated revenue.\nINTELLECTUAL PROPERTY, INCLUDING PATENTS AND LICENSES\nWe actively seek to protect our intellectual property rights and the competitive position of our innovative offerings through various approaches, including the use of patents, copyrights, trademarks, and trade secrets. We file applications for and obtain patents, copyrights, and trademarks in the U.S. and other countries as we believe appropriate, and we seek to protect our trade secrets and proprietary know-how. We also license patents and technologies from third parties. \n10\nWhile we consider ownership of these intellectual property rights in the aggregate to be important to us, we do not believe that any single patent, copyright, trademark, trade secret, or license is material to our business as a whole, except for licenses related to our Catalyst instruments and consumables, and we primarily rely on the innovative skills, technical expertise, customer focus and knowledge, and marketing abilities of our employees for our business success. In addition, a range of factors help to mitigate the future potential effects of the expiration of any of our patents, licenses, and other intellectual property rights on our results of operations and financial position. These factors include, but are not limited to:\n•\npublications, including peer-reviewed third-party studies, that demonstrate the performance and benefits of our products and services; \n•\nour brand strength and reputation in the marketplace; \n•\nthe breadth, quality and integration of our product and service offerings; \n•\nour existing customer relationships and our customer service and support; \n•\nour sales force; \n•\nour online ordering platform that enables direct ordering of (including establishing automatic reorder schedules for) our consumables, tests and other products by our customers; \n•\nthe applicable regulatory approval status for certain products; \n•\nour continued investments in innovative product and service improvements that result in new technologies, features, functionalities, enhancements, integrations, and/or additional patents and other intellectual property rights; \n•\nour investment in diagnostic innovations that results in new product and service offerings that are patentable and that expand the test menu for our in-clinic instruments and/or reference laboratory business; and \n•\nour significant know-how, scale and investments related to the product design and manufacturing processes of associated product offerings and certain supply arrangements for consumables that are compatible with our instruments. \nWe own or have license rights to various patents, patent applications, and technologies in the U.S. and other countries. These patents, patent applications, and technologies relate to intellectual property embodied in certain of our CAG products and services (including our Catalyst instruments and consumables and certain reference laboratory tests), LPD diagnostic products, and Water testing products, as well as other subject matters relevant to the manufacture and commercialization of these products and services. Although certain of these patents and licenses are expected to expire in future years, the expiration of these patents and licenses, individually or in the aggregate, is not expected to have a material effect on our financial position or future operations. In addition, we face robust competition as other companies have been successful in bringing competitive products and services to market, despite the protections afforded by these patent and license rights.\nIn addition to seeking patent protection as appropriate, we also protect certain intellectual property (such as software and our manufacturing know-how) through U.S. and international trade secret and copyright laws. We seek to protect our trade secrets and proprietary know-how in many ways, including through confidentiality and invention assignment agreements with our employees and third parties with which we do business (such as vendors, strategic partners, and consultants) and internal confidentiality processes and procedures.\n \nTo the extent some of our products and services may now, or in the future, embody technologies protected by patents, copyrights, or trade secrets of others, we may be required to obtain licenses to such technologies in order to continue to sell our products and services. These licenses may not be available on commercially reasonable terms or at all. Our failure to obtain any such licenses may delay or prevent the sale of certain new or existing products and services. Refer to “Part I,",
    "item1a": "Item 1A. Risk Factors, General Risks, We depend on the continuous and reliable operation and security of our information technology systems and our products and services that incorporate or rely on information technology, and any disruption or significant cybersecurity breach or other incident could adversely affect our business.” \nGovernance of our Cybersecurity Risk Management Program \nRole of Management \nOur cybersecurity risk management program and activities are led by a dedicated CISO who is also our Vice President of Information Technology. Our CISO reports to our Senior Vice President and CIO, and oversees a team of information security professionals within the Information Security Group. \nOur CISO joined IDEXX in 2024 and has more than twenty years of business and technical experience leading information technology teams, including cybersecurity teams, at high tech, marketing and healthcare companies.\n Our CISO, in close collaboration with our CIO is responsible for our cybersecurity-related governance programs, overseeing testing of our compliance with standards and remediation of known risks, and leads our employee training program.\nOur \nCISO\n is responsible for providing information regarding our cybersecurity risk management program, as well as cybersecurity risks and incidents, to a senior management-level cybersecurity steering committee.\n Within our cybersecurity risk governance model, the steering committee, which includes our CIO, CISO, General Counsel, Chief Compliance Officer, Chief Audit Executive, Chief Human Resources Officer and other senior functional and business leaders, meets quarterly, and more frequently as warranted, to review and discuss, among other things, our cybersecurity risk assessments, prioritization of initiatives, training plans and incident response plan, protocols and testing. This committee regularly provides updates on its discussions and decisions to our Chief Executive Officer.\nRole of the Board of Directors \nT\nhe Audit Committee has responsibility for overseeing our cybersecurity risk management.\n In accordance with the Audit Committee’s charter, the Audit Committee at least annually reviews and discusses with management, including the CIO and CISO, our processes, policies, procedures, and protocols related to cybersecurity and information security. In addition, the Audit Committee regularly reviews and discusses with management, including the CIO and CISO, cybersecurity program assessments and audits, planned improvements and the status of any information security initiatives, as well as risks from cybersecurity threats pertinent to us and any previous cybersecurity incidents experienced by us, including any material impact or reasonably likely material impact on the Company, our business strategy, results of operations, or financial condition. The Audit Committee provides reports to the \nBoard\n at each regularly scheduled Board meeting of the matters it has recently addressed, including relating to the oversight of our cybersecurity risk management, and the full Board may participate, as warranted, in the Audit Committee’s sessions on cybersecurity risk management. Outside advisors also may meet from time to time with the Audit Committee or Board, as warranted, to review and discuss cybersecurity matters.\n34",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item1c": "ITEM 1C.    CYBERSECURITY\nOur Cybersecurity Risk Management Program \nLike other companies, we currently inhabit an environment of increasing global cybersecurity vulnerabilities and threats. We aim to effectively assess, identify, and manage material risks from these cybersecurity threats through our cybersecurity risk management program.\nOur cybersecurity risk management program includes processes that incorporate and utilize certain principles from the National Institute of Standards and Technology Cybersecurity Framework and the Center for Internet Security – Top 18 Critical Security Controls – Control Level Framework. The program aims to protect and preserve the security, availability, integrity, confidentiality, and privacy of our information systems and information residing on those systems and includes controls and procedures for the prevention, identification, containment, and remediation of cybersecurity threats through the use of various technologies, tools, policies, standards, and practices. Features of our cybersecurity risk management program include: \n•\nAn expectation, set forth in our Code of Ethics, that all employees are responsible for protecting our data, operations and environment from unauthorized access and use; \n•\nRegular cybersecurity risk assessments and benchmarking; \n•\nPolicies and processes related to the detection and reporting of and response to cybersecurity events;\n•\nCybersecurity training for all newly hired employees upon onboarding; \n•\nIndividualized, biannual employee information security assessments, coupled with tailored follow-on employee trainings; \n•\nPhishing tests conducted at least quarterly on a global basis, with additional periodic phishing tests conducted with high-risk employee groups;\n•\nChannels for employees to report suspicious emails or other activity and the actual or suspected loss, theft, improper use of or access to IDEXX systems or information; \n•\nDeployment and ongoing assessment of the effectiveness of technological tools aimed at preventing, detecting, and mitigating cybersecurity threats; \n•\nPolicies and procedures to assess \nthird-party\n service provider cybersecurity risks and security controls and measures (as part of our procurement process and periodically thereafter); \n•\nPeriodic performance of cybersecurity tabletop exercises;\n•\nRegular review of and, as applicable, updates to our cyber incident response plan and protocols, system backup measures, redundancy planning and disaster recovery plans; and \n•\nMaintenance of a cyber risk insurance policy to help address risk of loss due to certain types of cybersecurity events. \nA review of cybersecurity risks is \nintegrated\n into our annual enterprise risk assessment that occurs as part of our annual strategic planning process and is included in our quarterly disclosure controls and procedures.\n Our annual enterprise risk assessment process involves the identification and assessment by senior line-of-business and functional leaders, as well as our Chief Information Security Officer (“CISO”) and Chief Information Officer (“CIO”), of the risks relevant to their lines of business and functional areas, the materiality of those risks, our risk tolerances and our plans to manage and mitigate the risks to the extent prudent and feasible.\nFrom time to time, we engage third parties, including assessors, consultants, legal counsel, and others to conduct penetration testing, assess our program, provide recommendations for improvement, and advise us on best practices.\n33\nMaterial Effects from Risks of Cybersecurity Threats \nWe do not believe any risks from cybersecurity threats (including from any prior cybersecurity incidents) have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n There can be no assurances, however, that we or our business partners or suppliers will not experience a future system disruption, attack or security breach that materially impacts our business, operations, results of operations, or financial condition. For more information refer to “"
  }
}