{
  "ticker": "IEX",
  "cik": "0000832101",
  "company_name": "IDEX CORP /DE/",
  "filing_date": "2025-02-20",
  "accession": "0000832101-25-000010",
  "primary_doc": "iex-20241231.htm",
  "item_sections": {
    "item1": "Item 1\n, \n“\nBusiness\n” \nof this Annual Report on Form 10-K.  \nManagement’s measurements of segment performance are Net sales, adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Adjusted EBITDA margin. \n28\nFluid & Metering Technologies Segment\nYear Ended December 31, \nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n693.1\n$\n695.7\n— \n%\nInternational sales\n540.1\n551.4\n(2 \n%)\nNet sales\n$\n1,233.2\n$\n1,247.1\n(1 \n%)\n— \n%\n(1 \n%)\n— \n%\n(1 \n%)\nAdjusted EBITDA\n406.3\n416.1\n(2 \n%)\n(1 \n%)\n(1 \n%)\n— \n%\n(2 \n%)\nAdjusted EBITDA margin\n32.9 \n%\n33.4 \n%\n(50) bps\n(40) bps\n— bps\n(10) bps\n(50) bps\n(1)\n \nDivestitures included Alfa Valvole, sold in June 2024. \n•\nOrganic net sales were positively impacted by price capture and targeted growth initiatives, which were offset by lower volumes, driven primarily by softness in agriculture and energy markets. Strength in municipal water markets was muted by softness in the semiconductor capital construction market within our water business.\n•\nAdjusted EBITDA margin decreased primarily due to higher employee-related costs, higher discretionary spending and unfavorable mix, partially offset by strong price/cost and favorable operational productivity, net of lower volume leverage. \nHealth & Science Technologies Segment\nYear Ended December 31,\nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\n(1)\nForeign Currency\nTotal\nDomestic sales\n$\n573.7\n$\n575.5\n— \n%\nInternational sales\n724.4\n740.9\n(2 \n%)\nNet sales\n$\n1,298.1\n$\n1,316.4\n(1 \n%)\n(7 \n%)\n6 \n%\n— \n%\n(1 \n%)\nAdjusted EBITDA\n346.8\n359.5\n(4 \n%)\n(10 \n%)\n6 \n%\n— \n%\n(4 \n%)\nAdjusted EBITDA margin\n26.7 \n%\n27.3 \n%\n(60) bps\n(70) bps\n10 bps\n— bps\n(60) bps\n(1) \nAcquisitions included Iridian Spectral Technologies acquired in May 2023, STC Material Solutions acquired in December 2023 and Mott acquired in September 2024. Divestitures included Micropump sold in August 2023 and Novotema sold in December 2023\n. \n•\nOrganic net sales were negatively impacted by cyclical market softness in the life sciences and semiconductor markets. This decrease was partially offset by price capture across the segment and targeted growth initiatives within the aerospace/defense market.\n•\nExcluding the net accretive impact of acquisitions and divestitures, Adjusted EBITDA margin decreased primarily due to higher employee-related costs and unfavorable mix, partially offset by price/cost, lower discretionary spending and favorable operational productivity, net of lower volume leverage. \nFire & Safety/Diversified Products Segment\nYear Ended December 31,\nComponents of Change\n(In millions)\n2024\n2023\nChange\nOrganic\nAcq/Div\nForeign Currency\nTotal\nDomestic sales\n$\n354.9\n$\n371.9\n(5 \n%)\nInternational sales\n389.4\n346.9\n12 \n%\nNet sales\n$\n744.3\n$\n718.8\n4 \n%\n4 \n%\n— \n%\n— \n%\n4 \n%\nAdjusted EBITDA\n214.2\n208.6\n3 \n%\n3 \n%\n— \n%\n— \n%\n3 \n%\nAdjusted EBITDA margin\n28.8 \n%\n29.0 \n%\n(20) bps\n(20) bps\n— bps\n— bps\n(20) bps\n•\nOrganic net sales were positively impacted by strong targeted growth initiatives, continued recovery in fire original equipment manufacturer markets and price capture. These increases were partially offset by unfavorable mix due to the \n29\ncyclical nature of project sales in our North American dispensing business and softer demand in automotive and industrial markets. \n•\nThe decrease in Adjusted EBITDA margin was primarily due to higher employee-related costs and unfavorable mix, partially offset by price/cost.\nLiquidity and Capital Resources\nLiquidity\nBased on management’s current expectations and currently available information, the Company believes current cash, cash from operations and cash available under the Revolving Facility will be sufficient to meet its operating\n cash requirements, planned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements, share repurchases and quarterly dividend payments to holders of the Company’s common stock for the foreseeable future\n. Additionally, in the event that suitable businesses are available for acquisition upon acceptable terms, the Company may obtain all or a portion of the financing for these acquisitions through the incurrence of additional borrowings. The Company believes that additional borrowings through various financing alternatives remain available, if required.\nMott was acquired during the third quarter of 2024 for cash consideration of $986.2 million, net of cash acquired of $3.1 million. The acquisition was funded using a combination of cash on hand of $211.9 million, borrowings under the Company’s Revolving Facility of $279.3 million, and the net proceeds of $495.0 million from the issuance of the 4.950% Senior Notes. For additional information regarding the borrowings under the Company’s Revolving Facility and the 4.950% Senior Notes, refer to \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements.\nSelect key liquidity metrics at December 31, 2024 are as follows:\n(In millions)\nDecember 31, 2024\nWorking capital\n$\n963.0 \nCurrent ratio\n2.5 to 1\nCash and cash equivalents\n$\n620.8 \nCash held outside of the United States\n462.7 \nRevolving Facility capacity\n$\n800.0 \nBorrowings\n269.8 \nLetters of credit\n2.8 \nRevolving Facility availability\n$\n527.4 \nOperating Working Capital\nOperating working capital, calculated as Receivables – net plus Inventories – net minus Trade accounts payable, is used by management as a measurement of operational results as well as the short-term liquidity of the Company. The following table details Operating working capital as of December 31, 2024 and 2023:\n(In millions)\nDecember 31, 2024\nDecember 31, 2023\nChange\nOrganic Change\nReceivables – net\n$\n465.9 \n$\n427.8 \n$\n38.1 \n$\n17.0 \nInventories – net\n429.7 \n420.8\n8.9 \n(17.7)\nLess: Trade accounts payable\n197.8 \n179.7 \n18.1 \n8.4 \nOperating working capital\n$\n697.8 \n$\n668.9 \n$\n28.9 \n$\n(9.1)\nOperating working capital increased $28.9 million to $697.8 million at December 31, 2024. Acquisitions, divestitures and foreign currency translation increased Operating working capital by $38.0 million during 2024. Apart from these items, receivables increased due to strong price capture, which more than offset the impact of lower volumes; inventories decreased with lower volumes and targeted actions to lower inventory levels; and accounts payable increased as a result of timing of payments for inventory purchases.\n30\nCash Flow Summary\nThe following table is derived from the Consolidated Statements of Cash Flows:\nYear Ended December 31, \n(In millions)\n2024\n2023\nChange\nNet cash flows provided by (used in): \nOperating activities\n$\n668.1 \n$\n716.7 \n$\n(48.6)\nInvesting activities\n(1,006.5)\n(283.8)\n(722.7)\nFinancing activities\n465.9 \n(344.7)\n810.6 \nOperating Activities\nCash flows provided by operating activities decreased $48.6 million to $668.1 million in 2024 primarily due to lower earnings and the timing of customer deposits and project deliveries as well as larger inventory reductions in the prior year period. Lower cash payments in 2024 compared to the prior year, including payments for taxes, variable compensation and interest, partially mitigated these items.\nInvesting Activities\nCash flows used in investing activities increased $722.7 million in 2024. The net impact of acquisitions and divestitures increased cash used in investing activities by $746.2 million during 2024 as compared to 2023, primarily related to the acquisition of Mott in 2024. This increase in cash outflows was partially offset by lower capital expenditures, which decreased cash used in investing activities by $24.8 million, as compared to 2023. For additional information on the Company’s acquisition and divestitures, refer to \nNote 2\n, “Acquisitions and Divestitures,” in the Notes to Consolidated Financial Statements.\nFinancing Activities\nCash flows provided by financing activities increased $810.6 million in 2024 primarily due to $774.3 million of net proceeds in connection with the financing of the acquisition of Mott in 2024, as compared with $100.0 million of net proceeds from borrowings in 2023. Additionally, repayments of long-term borrowings and revolving credit facilities were $130.9 million lower in 2024, and share repurchases were lower by $24.2 million in 2024, which were partly offset by higher dividends paid to shareholders, which increased $14.6 million in 2024.\nFree Cash Flow\nThe Company believes free cash flow, a non-GAAP measure, is an important measure of performance because it provides a measurement of cash generated from operations that is available for payment obligations such as operating cash requirements, \nplanned capital expenditures, interest and principal payments on all borrowings, pension and postretirement funding requirements and quarterly dividend payments to holders of the Company’s common stock as well as\n for funding acquisitions and share repurchases. Free cash flow is calculated as cash flows provided by operating activities less capital expenditures. Free cash flow conversion is calculated as free cash flow divided by adjusted net income attributable to IDEX.\nThe following table reconciles cash flows provided by operating activities to free cash flow:\nYear Ended December 31, \n(In millions)\n2024\n2023\nCash flows provided by operating activities\n$\n668.1\n$\n716.7\nLess: capital expenditures \n65.1\n89.9\nFree cash flow\n$\n603.0\n$\n626.8\nReported net income attributable to IDEX\n$\n505.0\n$\n596.1\nAdjusted net income attributable to IDEX\n598.5\n623.6\nOperating cash flow as a percent of net income\n132 \n%\n120 \n%\nFree cash flow conversion\n101 \n%\n101 \n%\n31\n \nCash Requirements\nContractu\nal Obligations\nThe Company’s cash requirements under contractual obligations include: \n•\nBorrowings and related interest - See \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements for further detail of the Company’s debt and timing of expected future principal payments.\n•\nRental payments for leases - See \nNote 9\n, “Leases,” in the Notes to Consolidated Financial Statements for further detail of our obligations and the timing of expected future payments. \n•\nPurchase obligations - The Company enters into purchase orders with vendors and other parties in the ordinary course of business. As of December 31, 2024, the Company’s purchase obligations, consisting primarily of inventory commitments, totaled approximately $296.8 million, of which $271.1 million\n is expected to be settled during 2025 and the remainder thereafter.\n \n•\nPension and post-retirement medical benefit plans - See \nNote 17\n, “Retirement Benefits,” in the Notes to Consolidated Financial Statements for further detail of our obligations and the timing of expected future payments.  \nSubsequent Borrowings Activity\nDuring January 2025, the Company repaid $30.2 million of the $269.8 million outstanding under the Revolving Facility at December 31, 2024.\nCapital Expenditures\nCapital expenditures generally include machinery and equipment that support growth and improved productivity, tooling, business system technology, replacement of equipment and investments in new facilities. The Company believes it has sufficient operating cash flows to continue to meet current obligations and invest in planned capital expenditures. C\nash flows from operations were more than adequate to fund capital expenditures of $65.1 million and $89.9 million i\nn 2024 and 2023, \nrespectively. \nShare Repurchases\nThere were no share repurchases i\nn 2024. \nThe Company repurchased 124,600 shares at a cost of $24.2 million in 2023. As of December 31, 2024, the amount of share repurchase authorization remaining was $539.7 million. During February 2025, the Company repurchased a total of 256,159 shares at a cost of $50.0 million. For additional information regarding the Company’s share repurchase program, refer to \nNote 11\n, “Share Repurchases,” in the Notes to Consolidated Financial Statements.\nDividends \nThe Company increased its quarterly cash dividend by 8% from $0.64 per common share in 2023 to $0.69 per common share in 2024. Total dividend payments to common shareholders were $205.3 million in 2024 compared with $190.7 million in 2023.\nCovenants\nThe key financial covenants that the Company is required to maintain in connection with the Revolving Facility, the 3.37% Senior Notes and the 5.13% Senior Notes, are a minimum interest coverage ratio of 3.0 to 1 and a maximum leverage ratio of 3.50 to 1. At December 31, 2024, the Company was in compliance with both of these financial covenants, as the Company’s interest coverage ratio was 16.09 to 1 for covenant calculation purposes and the leverage ratio was 2.20 to 1. There are no financial covenants relating to the 2.625% Senior Notes, the 3.00% Senior Notes and the 4.950% Senior Notes (each defined in \nNote 7\n, “Borrowings”); however, all are subject to cross-acceleration provisions. For a discussion of the Company’s Revolving Facility, Term Facility and Senior Notes as well as the associated covenants, refer to \nNote 7\n, “Borrowings,” in the Notes to Consolidated Financial Statements.\nCredit Ratings\nThe Company’s credit ratings, which were independently developed by the following credit agencies, are detailed below:\n•\nS&P Global Ratings reaffirmed the Company’s corporate credit rating of BBB (stable outlook) in September 2024.\n•\nMoody’s Investors Service affirmed the Company’s corporate credit rating of Baa2 (stable outlook) in August 2024.\n32\n•\nFitch Ratings reaffirmed the Company’s corporate credit rating of BBB+ (stable outlook) in June 2024.\nOff-Balance Sheet Arrangements\nThe Company had $38.1 million of letters of credit as of December 31, 2024, primarily issued as security for insurance and other performance obligations. Of the $38.1 million of letters of credit, only $2.8 million reduced the Company’s borrowing capacity under the Revolving Facility as of December 31, 2024. The Company has restricted cash of $18.1 million as of December 31, 2024, which represents cash held as collateral for standby letters of credit issued by Mott and is required to keep the balance in a separate account for the duration of the letters of credit.\nExcept as disclosed above, the Company has no off-balance sheet arrangements that currently have or are reasonably likely to have a material effect on the Company’s consolidated financial condition, changes in financial condition, results of operations, liquidity, capital expenditures or capital resources. \nCritical Accounting Estimates\nThe Company believes that the application of the following accounting policy, which is important to its financial position and results of operations, requires significant judgments and estimates on the part of management. For a summary of the Company’s accounting policies, including the accounting policy discussed below, see \nNote 1\n, “Significant Accounting Policies,” in the Notes to Consolidated Financial Statements.\nGoodwill and indefinite-lived intangible assets\n — Goodwill and other intangible assets with indefinite lives, which consists solely of trade names, are not amortized; rather they are tested for impairment at least annually, or more frequently if events or circumstances indicate that the asset may be impaired. The Company follows the guidance prescribed in Accounting Standards Codification (“ASC”) 350, \nGoodwill and Other Intangible Assets\n, to test goodwill and indefinite-lived intangible assets for impairment. In assessing goodwill for impairment, the Company determines the fair value of each reporting unit utilizing an income approach (discounted cash flows) weighted 50% and a market approach (consisting of a comparable public company multiples methodology) weighted 50%. To determine the reasonableness of the calculated fair values, the Company reviews the assumptions to ensure that neither the income approach nor the market approach yielded significantly different valuations. Key assumptions and estimates used in the goodwill impairment assessment are described below. Based on the results of the Company’s annual impairment test at October 31, 2024, all reporting units had fair values substantially in excess of their carrying values. \nThe key assumptions are updated every year for each reporting unit for the income and market approaches used to determine the fair value. Various assumptions are utilized including forecasted operating results, annual operating plans, strategic plans, economic projections, anticipated future cash flows, the weighted average cost of capital, market data and market multiples. The assumptions that have the most significant effect on the fair value calculations are the weighted average cost of capital, market multiples, forecasted cash flows and terminal growth rates. The following assumption ranges were utilized by the Company in 2024 and 2023:\nAssumptions\n2024\nRange\n2023\nRange\nWeighted average cost of capital\n9.25% to 9.75%\n10.00% to 12.25%\nMarket multiples\n12.0x to 19.0x\n10.0x to 20.0x\nTerminal growth rates\n3.0% to 3.5%\n3.0% to 3.5%\nIn assessing trade names for impairment, the Company uses the relief-from-royalty method, a form of the income approach, to determine the fair value of its trade names. The relief-from-royalty method is dependent on a number of significant management assumptions, including estimates of revenues, royalty rates and discount rates. Based on the results of the Company’s annual impairment test at October 31, 2024, the trade names had fair values in excess of their carrying values.\nThe Company’s acquisitions have generally included significant goodwill components and the Company expects to continue to make acquisitions. At December 31, 2024, goodwill and other indefinite-lived intangible assets totaled $3,342.6 million, or 50%, of the Company’s total assets. \nSee \nNote 6\n, “Goodwill and Intangible Assets,” in the Notes to Consolidated Financial Statements for further discussion on goodwill and indefinite-lived intangible assets.\n33\nNon-GAAP Disclosures\nSet forth below are reconciliations of Organic net sales, Adjusted gross profit, Adjusted gross margin, Adjusted net income attributable to IDEX, Adjusted diluted EPS attributable to IDEX, Consolidated Adjusted earnings before interest, income taxes, depreciation and amortization (“Adjusted EBITDA”) and Consolidated Adjusted EBITDA margin to their respective most directly comparable U.S. GAAP measure. Management uses these metrics to measure performance of the Company since they exclude items that are not reflective of ongoing operations, as identified in the reconciliations below. Management also supplements its U.S. GAAP financial statements with adjusted information to provide investors with greater insight, transparency and a more comprehensive understanding of the information used by management in its financial and operational decision making. \nManagement uses Adjusted EBITDA as its measure of segment performance, and believes it is a useful indicator of the strength and performance of the Company and its segments’ ongoing business operations, as well as a way for investors to evaluate and compare operating performance and value companies within the Company’s industry. Management believes that Adjusted EBITDA margin is useful for the same reason as Adjusted EBITDA. The definition of Adjusted EBITDA used here may differ from that used by other companies.\nThis report also references free cash flow and free cash flow conversion. These non-GAAP measures are discussed and reconciled to their most directly comparable U.S. GAAP measure in the section above titled “Free Cash Flow.”\nThe non-GAAP financial measures disclosed by the Company should not be considered a substitute for, or superior to, financial measures prepared in accordance with U.S. GAAP. Due to rounding, numbers presented throughout this and other documents may not add up or recalculate precisely. The financial results prepared in accordance with U.S. GAAP and the reconciliations from these results should be carefully evaluated.\nAll table footnotes can be found at the end of this Non-GAAP Disclosures section.\n1. Reconciliations of the Change in Net Sales to Organic Net Sales\nFor the Years Ended December 31,\n2024\n2023\nFMT\nHST\nFSDP\nIDEX\nFMT\nHST\nFSDP\nIDEX\nChange in net sales\n(1 \n%)\n(1 \n%)\n4 \n%\n— \n%\n7 \n%\n(2 \n%)\n6 \n%\n3 \n%\nLess:\nNet impact from acquisitions/divestitures\n(1)\n(1 \n%)\n6 \n%\n— \n%\n2 \n%\n2 \n%\n9 \n%\n— \n%\n5 \n%\nImpact from foreign currency\n(2)\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\nImpact from the exit of a COVID-19 testing application\n(3)\n— \n%\n— \n%\n— \n%\n— \n%\n— \n%\n(1 \n%)\n— \n%\n(1 \n%)\nChange in organic net sales\n— \n%\n(7 \n%)\n4 \n%\n(2 \n%)\n5 \n%\n(10 \n%)\n6 \n%\n(1 \n%)\n2. Reconciliations of Reported-to-Adjusted Gross Profit and Gross Margin \n(in millions)\nFor the Years Ended December 31,\n2024\n2023\nGross profit\n$\n1,445.2\n$\n1,446.9\nFair value inventory step-up charges\n9.6\n1.6\nAdjusted gross profit\n$\n1,454.8\n$\n1,448.5\nNet sales\n$\n3,268.8\n$\n3,273.9\nGross margin\n44.2 \n%\n44.2 \n%\nAdjusted gross margin\n44.5 \n%\n44.2 \n%\n3. Reconciliations of Reported-to-Adjusted Net Income Attributable to IDEX and Diluted EPS Attributable to IDEX \n(in millions, except per share amounts)\nFor the Years Ended December 31,\n2024\n2023\nReported net income attributable to IDEX\n$\n505.0 \n$\n596.1 \nFair value inventory step-up charges\n9.6 \n1.6 \nTax impact on fair value inventory step-up charges\n(2.0)\n(0.4)\nRestructuring expenses and asset impairments\n9.3 \n10.9 \nTax impact on restructuring expenses and asset impairments\n(2.2)\n(2.5)\nGain on sale of businesses - net\n(4.0)\n(84.7)\nTax impact on gain on sale of businesses - net\n— \n22.7 \nCredit loss on note receivable from collaborative partner\n(4)\n— \n7.7 \nTax impact on credit loss on note receivable from collaborative partner\n— \n(1.6)\nAcquisition-related intangible asset amortization\n107.1 \n94.9 \nTax impact on acquisition-related intangible asset amortization\n(24.3)\n(21.1)\nAdjusted net income attributable to IDEX\n$\n598.5 \n$\n623.6 \nReported diluted EPS attributable to IDEX\n$\n6.64 \n$\n7.85 \nFair value inventory step-up charges\n0.13 \n0.02 \nTax impact on fair value inventory step-up charges\n(0.02)\n— \nRestructuring expenses and asset impairments\n0.12 \n0.15 \nTax impact on restructuring expenses and asset impairments\n(0.03)\n(0.03)\nGain on sale of businesses - net\n(0.05)\n(1.12)\nTax impact on gain on sale of businesses - net\n— \n0.30 \nCredit loss on note receivable from collaborative partner\n(4)\n— \n0.10 \nTax impact on credit loss on note receivable from collaborative partner\n— \n(0.02)\nAcquisition-related intangible asset amortization\n1.41 \n1.25 \nTax impact on acquisition-related intangible asset amortization\n(0.31)\n(0.28)\nAdjusted diluted EPS attributable to IDEX\n$\n7.89 \n$\n8.22 \nDiluted weighted average shares outstanding\n75.9 \n75.9 \n4. Reconciliations of Net Income to Adjusted EBITDA \n(in millions)\nFor the Years Ended December 31,\n2024\n2023\nReported net income\n$\n504.6\n$\n595.6\nProvision for income taxes\n134.7\n164.7\nInterest expense – net\n44.5\n51.7\nGain on sale of businesses - net\n(4.0)\n(84.7)\nDepreciation\n68.5\n57.2\nAmortization\n107.1\n94.9\nFair value inventory step-up charges\n9.6\n1.6\nRestructuring expenses and asset impairments\n9.3\n10.9\nCredit loss on note receivable from collaborative partner\n(4)\n—\n7.7\nAdjusted EBITDA\n$\n874.3\n$\n899.6\nAdjusted EBITDA Components\nFMT\n$\n406.3\n$\n416.1\nHST\n346.8\n359.5\nFSDP\n214.2\n208.6\nCorporate and other\n(93.0)\n(84.6)\nTotal Adjusted EBITDA\n$\n874.3\n$\n899.6\nNet sales\n$\n3,268.8\n$\n3,273.9\nNet income margin\n15.4 \n%\n18.2 \n%\nAdjusted EBITDA margin\n26.7 \n%\n27.5 \n%\n(1)\n Represents the sales from acquired or divested businesses during the first 12 months of ownership or prior to divestiture.\n(2)\n The portion of sales attributable to foreign currency translation is calculated as the difference between (a) the period-to-period change in organic net sales, and (b) the period-to-period change in organic net sales after applying prior period foreign exchange rates to the current year period.\n(3)\n \nThe impact to Net sales represents the absence of the acceleration of previously deferred revenue of $17.9 million as a result of a customer’s decision to discontinue further investment in commercializing its COVID-19 testing application in 2022 that did not reoccur in 2023. See \nNote 14\n, “Restructuring Expenses and Asset Impairments,” in the Notes to Consolidated Financial Statements for further detail.\n(4)\n \nRepresents a reserve recorded on an investment with a collaborative partner. See \nNote 3\n, “Collaborative Investments,” in the Notes to Consolidated Financial Statements for further detail.\nItem 7A. \n    \nQuantitative and Qualitative Disclosures About Market Risk.\nThe Company is subject to market risk associated with changes in foreign currency exchange rates and interest rates as well as inflationary factors. \nForeign Currency Exchange Rates\nThe Company’s foreign currency exchange rate risk is limited principally to the Euro, Swiss Franc, Canadian Dollar, British Pound, Indian Rupee, Chinese Renminbi, Swedish Krona, Japanese Yen and Brazilian Real. The Company manages its foreign exchange risk principally through invoicing customers in the same currency as the source of products. The foreign currency transaction (gains) losses for the years ended December 31, 2024, 2023 and 2022 were $(1.0) million, \n$7.3 million\n and \n34\n$(0.8) million\n, respectively, and are reported within Other (income) expense – net on the Consolidated Statements of Income. See \nNote 1\n, “Significant Accounting Policies,” in the Notes to Consolidated Financial Statements for further discussion.\nInterest Rate Fluctuations\nThe Company has interest rate exposure due to $269.8 million of the $1,971.3 million debt outstanding at December 31, 2024 bearing floating rate debt. The Company’s Revolving Facility bears interest at either an alternate base rate or adjusted Term SOFR (or appropriate alternative currency reference rates) plus, in each case, an applicable margin based on the lower of the Company’s senior, unsecured, long-term debt rating or the Company’s applicable leverage ratio. At December 31, 2024, there was $269.8 million outstanding under the Revolving Facility with an interest rate of 3.84%. \nInflation Risk\nWe source a wide variety of materials and components from a network of global suppliers. While materials are typically available from numerous suppliers, they are subject to price fluctuations, including the impact of new or increased tariffs on imports, which could have a negative impact on our results. We seek to minimize the effects of inflation and changing prices through price increases to maintain reasonable gross margins.\n35\nItem 8.\n         \nFinancial Statements and Supplementary Data.\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America, and as defined in Exchange Act Rule 13a-15(f).\nInternal control over financial reporting cannot provide absolute assurance of achieving financial reporting objectives because of its inherent limitations. Because of such limitations, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting.\nManagement has used the framework set forth in the report entitled “Internal Control — Integrated Framework” (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission to assess the effectiveness of the Company’s internal control over financial reporting. Management excluded Mott Corporation from its assessment of internal controls over financial reporting as the acquisition occurred in 2024 (see \nNote 2\n, “Acquisitions and Divestitures,” in the Notes to Consolidated Financial Statements for further detail). This exclusion is in accordance with the general guidance from the Staff of the Securities and Exchange Commission that an assessment of a recently acquired business may be omitted from the scope of management’s assessment of internal control over financial reporting for one year following the acquisition. The total assets (excluding goodwill and intangible assets) and net sales of the current year acquisition represented approximately eight percent\n and\n two percent, respectively, of the Consolidated Financial Statement amounts as of and for the year ended December 31, 2024. Based on that assessment, management has concluded that the Company’s internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report which appears herein.\n36\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n \nTo the shareholders and the Board of Directors of IDEX Corporation\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of IDEX Corporation and subsidiaries (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control \n— \nIntegrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 20, 2025, expressed an unqualified opinion on those financial statements.\nAs described in Management’s Report on Internal Control over Financial Reporting, management excluded Mott Corporation from its assessment of internal control over financial reporting as this acquisition occurred in the twelve months ended December 31, 2024. The combined total assets (excluding goodwill and intangible assets) and net sales of this acquisition represented approximately eight percent and two percent, respectively, of the consolidated financial statement amounts as of and for the year ended December 31, 2024. Accordingly, our audit did not include the internal control over financial reporting at this acquired company.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/    \nDELOITTE & TOUCHE LLP\nChicago, Illinois\nFebruary 20, 2025\n37\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM \nTo the shareholders and the Board of Directors of IDEX Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of IDEX Corporation and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in\n Internal Control \n— \nIntegrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 20, 2025, expressed an unqualified opinion on the Company’s internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates. \nRevenue \n—\n Disaggregation of Revenue \n—\n Refer to \nNote 5\n to the financial statements\nCritical Audit Matter Description\nThe Company is a highly diversified business with a wide range of products and services that are offered in various markets throughout the world. The Company’s business activities are carried out by numerous individual business units, which offer a unique set of products and include niche markets within specific geographic areas. \nWe identified revenue as a critical audit matter given the disaggregated nature of the Company’s operations and business units generating revenue. This required extensive audit effort due to the volume of the underlying transactions and distinctiveness of each individual business unit. High levels of auditor judgment were necessary to determine the nature, timing, and extent of audit procedures and the level of disaggregation within the Company at which to perform such procedures, especially given limited market data for certain products or geographic areas.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s revenue transactions included the following, among others: \n38\n•\nWe tested internal controls within the relevant revenue business processes, including controls over revenue recognition and controls over the review of significant revenue transactions and operating results.\n•\nFor revenue transactions not subject to detail transaction testing, we aggregated the revenue transactions at the reporting unit level and performed substantive analytical procedures. We developed independent expectations of revenue based on data derived from published industry indices and market and customer trends and compared our independent expectations to the revenue recorded by management.\n•\nFor a sample of revenue transactions, we performed detail transaction testing by agreeing the amounts recorded to source documents and determined that revenue was recognized appropriately. \n/s/    DELOITTE & TOUCHE LLP\nChicago, Illinois\nFebruary 20, 2025\nWe have served as the Company’s auditor since 1987.\n39\nIDEX CORPORATION\nCONSOLIDATED STATEMENTS OF INCOME\n(In millions, except per share amounts)                                                                                                      \n \n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\nNet sales\n$\n3,268.8\n \n$\n3,273.9\n \n$\n3,181.9\n \nCost of sales\n1,823.6\n \n1,827.0\n \n1,755.0\n \nGross profit\n1,445.2\n \n1,446.9\n \n1,426.9\n \nSelling, general and administrative expenses\n758.7\n \n703.5\n \n652.7\n \nRestructuring expenses and asset impairments\n9.3\n \n10.9\n \n22.8\n \nOperating income\n677.2\n \n732.5\n \n751.4\n \nGain on sale of businesses – net\n(\n4.0\n)\n(\n84.7\n)\n(\n34.8\n)\nOther (income) expense – net\n(\n2.6\n)\n5.2\n \n(\n3.9\n)\nInterest expense – net\n44.5\n \n51.7\n \n40.7\n \nIncome before income taxes\n639.3\n \n760.3\n \n749.4\n \nProvision for income taxes\n134.7\n \n164.7\n \n162.7\n \nNet income\n504.6\n \n595.6\n \n586.7\n \nNet loss attributable to noncontrolling interest\n0.4\n \n0.5\n \n0.2\n \nNet income attributable to IDEX\n$\n505.0\n \n$\n596.1\n \n$\n586.9\n \nEarnings per common share:\nBasic earnings per common share attributable to IDEX\n$\n6.66\n \n$\n7.87\n \n$\n7.74\n \nDiluted earnings per common share attributable to IDEX\n$\n6.64\n \n$\n7.85\n \n$\n7.71\n \nShare data:\nBasic weighted average common shares outstanding\n75.7\n \n75.6\n \n75.7\n \nDiluted weighted average common shares outstanding\n75.9\n \n75.9\n \n76.0\n \n \nSee Notes to Consolidated Financial Statements.\n40\nIDEX CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\n \n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n504.6\n \n$\n595.6\n \n$\n586.7\n \nOther comprehensive (loss) income:\nPension and other postretirement adjustments, net of tax\n3.1\n \n(\n7.4\n)\n18.3\n \nCumulative translation adjustment\n(\n88.2\n)\n87.8\n \n(\n74.9\n)\nOther comprehensive (loss) income, net of tax\n(\n85.1\n)\n80.4\n \n(\n56.6\n)\nComprehensive income\n419.5\n \n676.0\n \n530.1\n \nComprehensive loss attributable to noncontrolling interest\n0.4\n \n0.5\n \n0.2\n \nComprehensive income attributable to IDEX\n$\n419.9\n \n$\n676.5\n \n$\n530.3\n \nSee Notes to Consolidated Financial Statements.\n41\nIDEX CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share amounts)\n \n \n \nAs of December 31,\n \n2024\n2023\nASSETS\nCurrent assets\nCash and cash equivalents\n$\n620.8\n \n$\n534.3\n \nReceivables – net\n465.9\n \n427.8\n \nInventories – net\n429.7\n \n420.8\n \nOther current assets\n76.3\n \n63.4\n \nTotal current assets\n1,592.7\n \n1,446.3\n \nProperty, plant and equipment – net\n460.4\n \n430.3\n \nGoodwill\n3,251.7\n \n2,838.3\n \nIntangible assets – net\n1,284.8\n \n1,011.8\n \nOther noncurrent assets\n155.7\n \n138.5\n \nTotal assets\n$\n6,745.3\n \n$\n5,865.2\n \nLIABILITIES AND EQUITY\nCurrent liabilities\nTrade accounts payable\n$\n197.8\n \n$\n179.7\n \nAccrued expenses\n278.7\n \n271.5\n \nCurrent portion of long-term borrowings\n100.7\n \n0.6\n \nDividends payable\n52.5\n \n48.5\n \nTotal current liabilities\n629.7\n \n500.3\n \nLong-term borrowings – net\n1,859.5\n \n1,325.1\n \nDeferred income taxes\n267.2\n \n291.9\n \nOther noncurrent liabilities\n194.8\n \n206.7\n \nTotal liabilities\n2,951.2\n \n2,324.0\n \nCommitments and contingencies (\nNote 10\n)\nShareholders’ equity\nPreferred stock:\nAuthorized: \n5.0\n million shares, $\n.01\n per share par value; Issued: \nNone\n—\n \n—\n \nCommon stock:\nAuthorized: \n150.0\n million shares, $\n.01\n per share par value\nIssued: \n90.1\n million shares at both December 31, 2024 and 2023\n0.9\n \n0.9\n \nTreasury stock at cost: \n14.2\n million shares at December 31, 2024 and \n14.3\n million shares at December 31, 2023\n(\n1,170.3\n)\n(\n1,187.0\n)\nAdditional paid-in capital\n864.8\n \n839.0\n \nRetained earnings\n4,230.2\n \n3,934.3\n \nAccumulated other comprehensive loss\n(\n130.9\n)\n(\n45.8\n)\nTotal shareholders’ equity\n3,794.7\n \n3,541.4\n \nNoncontrolling interest\n(\n0.6\n)\n(\n0.2\n)\nTotal equity\n3,794.1\n \n3,541.2\n \nTotal liabilities and equity\n$\n6,745.3\n \n$\n5,865.2\n \nSee Notes to Consolidated Financial Statements.\n42\nIDEX CORPORATION\nCONSOLIDATED STATEMENTS OF EQUITY\n(In millions, except per share amounts)\n \nCommon Stock Shares\nCommon Stock and Additional Paid-In Capital\nTreasury Stock Shares\nTreasury Stock\nAccumulated Other Comprehensive Loss\nRetained Earnings\nTotal Shareholders’ Equity\nNoncontrolling \nInterest\nTotal Equity\nBalance, December 31, 2021\n90.1\n \n$\n796.5\n \n13.9\n \n$\n(\n1,050.3\n)\n$\n(\n69.6\n)\n$\n3,126.5\n \n$\n2,803.1\n \n$\n—\n \n$\n2,803.1\n \nNet income (loss)\n— \n— \n— \n— \n— \n586.9\n \n586.9\n \n(\n0.2\n)\n586.7\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n(\n56.6\n)\n— \n(\n56.6\n)\n— \n(\n56.6\n)\nNet issuance of shares of treasury stock (net of tax of $\n3.1\n)\n— \n— \n(\n0.2\n)\n14.1\n \n— \n— \n14.1\n \n— \n14.1\n \nRepurchases of common stock\n— \n0.8\n \n(\n148.1\n)\n— \n— \n(\n148.1\n)\n— \n(\n148.1\n)\nShare-based compensation\n— \n21.6\n \n— \n— \n— \n— \n21.6\n \n— \n21.6\n \nCash dividends declared - $\n2.40\n per common share\n— \n— \n— \n— \n— \n(\n181.7\n)\n(\n181.7\n)\n— \n(\n181.7\n)\nContributions received from joint venture partner\n— \n— \n— \n— \n— \n— \n— \n0.5\n \n0.5\n \nBalance, December 31, 2022\n90.1\n \n$\n818.1\n \n14.5\n \n$\n(\n1,184.3\n)\n$\n(\n126.2\n)\n$\n3,531.7\n \n$\n3,039.3\n \n$\n0.3\n \n$\n3,039.6\n \nNet income (loss)\n— \n— \n— \n— \n— \n596.1\n \n596.1\n \n(\n0.5\n)\n595.6\n \nOther comprehensive income, net of tax\n— \n— \n— \n— \n80.4\n \n— \n80.4\n \n— \n80.4\n \nNet issuance of shares of treasury stock (net of tax of $\n2.8\n)\n— \n— \n(\n0.3\n)\n21.5\n \n— \n— \n21.5\n \n— \n21.5\n \nRepurchases of common stock\n— \n— \n0.1\n \n(\n24.2\n)\n— \n— \n(\n24.2\n)\n— \n(\n24.2\n)\nShare-based compensation\n— \n21.8\n \n— \n— \n— \n— \n21.8\n \n— \n21.8\n \nCash dividends declared - $\n2.56\n per common share\n— \n— \n— \n— \n— \n(\n193.5\n)\n(\n193.5\n)\n— \n(\n193.5\n)\nBalance, December 31, 2023\n90.1\n \n$\n839.9\n \n14.3\n \n$\n(\n1,187.0\n)\n$\n(\n45.8\n)\n$\n3,934.3\n \n$\n3,541.4\n \n$\n(\n0.2\n)\n$\n3,541.2\n \nNet income (loss)\n— \n— \n— \n— \n— \n505.0\n \n505.0\n \n(\n0.4\n)\n504.6\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n(\n85.1\n)\n— \n(\n85.1\n)\n— \n(\n85.1\n)\nNet issuance of shares of treasury stock (net of tax of $\n2.7\n)\n— \n— \n(\n0.1\n)\n16.7\n \n— \n— \n16.7\n \n— \n16.7\n \nShare-based compensation\n— \n25.8\n \n— \n— \n— \n— \n25.8\n \n— \n25.8\n \nCash dividends declared - $\n2.76\n per common share\n— \n— \n— \n— \n— \n(\n209.1\n)\n(\n209.1\n)\n— \n(\n209.1\n)\nBalance, December 31, 2024\n90.1\n \n$\n865.7\n \n14.2\n \n$\n(\n1,170.3\n)\n$\n(\n130.9\n)\n$\n4,230.2\n \n$\n3,794.7\n \n$\n(\n0.6\n)\n$\n3,794.1\n \nSee Notes to Consolidated Financial Statements.\n43\nIDEX CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\nCash flows from operating activities\nNet income\n$\n504.6\n \n$\n595.6\n \n$\n586.7\n \nAdjustments to reconcile net income to net cash flows provided by operating activities:\nGain on sale of businesses – net\n(\n4.0\n)\n(\n84.7\n)\n(\n34.8\n)\nAsset impairments\n0.1\n \n0.8\n \n17.4\n \nCredit loss on note receivable from collaborative partner\n—\n \n7.7\n \n—\n \nDepreciation\n68.5\n \n57.2\n \n50.7\n \nAmortization of intangible assets\n107.1\n \n94.9\n \n69.0\n \nShare-based compensation expense\n25.8\n \n21.8\n \n21.6\n \nDeferred income taxes\n(\n19.4\n)\n(\n14.7\n)\n(\n18.5\n)\nChanges in (net of the effect from acquisitions/divestitures and foreign currency translation):\nReceivables – net\n(\n16.9\n)\n20.5\n \n(\n71.7\n)\nInventories – net\n17.6\n \n66.2\n \n(\n72.4\n)\nOther current assets\n(\n0.1\n)\n(\n6.5\n)\n(\n0.5\n)\nTrade accounts payable\n8.9\n \n(\n25.3\n)\n17.6\n \nDeferred revenue\n(\n17.9\n)\n12.7\n \n(\n25.0\n)\nAccrued expenses\n(\n8.6\n)\n(\n34.8\n)\n16.6\n \nOther – net\n2.4\n \n5.3\n \n0.7\n \nNet cash flows provided by operating activities\n668.1\n \n716.7\n \n557.4\n \nCash flows from investing activities\nCapital expenditures\n(\n65.1\n)\n(\n89.9\n)\n(\n68.0\n)\nAcquisition of businesses, net of cash acquired\n(\n984.5\n)\n(\n311.8\n)\n(\n945.6\n)\nProceeds from sale of businesses, net of cash remitted\n45.1\n \n118.6\n \n49.4\n \nPurchase of marketable securities\n—\n \n(\n29.0\n)\n—\n \nProceeds from sale of marketable securities\n4.5\n \n24.8\n \n39.7\n \nOther – net\n(\n6.5\n)\n3.5\n \n7.3\n \nNet cash flows used in investing activities\n(\n1,006.5\n)\n(\n283.8\n)\n(\n917.2\n)\nCash flows from financing activities\nBorrowings under revolving credit facilities\n279.3\n \n—\n \n210.4\n \nPayments under revolving credit facilities\n(\n69.1\n)\n—\n \n(\n135.0\n)\nProceeds from issuance of long-term borrowings\n496.7\n \n100.0\n \n200.0\n \nPayment of long-term borrowings\n(\n50.0\n)\n(\n250.0\n)\n—\n \nDebt issuance costs\n(\n1.7\n)\n—\n \n—\n \nCash dividends paid to shareholders\n(\n205.3\n)\n(\n190.7\n)\n(\n177.4\n)\nProceeds from share issuances, net of shares withheld for taxes\n16.7\n \n21.5\n \n14.1\n \nRepurchases of common stock\n—\n \n(\n24.2\n)\n(\n148.1\n)\nOther – net\n(\n0.7\n)\n(\n1.3\n)\n(\n1.8\n)\nNet cash flows provided by (used in) financing activities\n465.9\n \n(\n344.7\n)\n(\n37.8\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n22.9\n)\n15.9\n \n(\n27.6\n)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n104.6\n \n104.1\n \n(\n425.2\n)\nCash and cash equivalents at beginning of year\n(1)\n534.3\n \n430.2\n \n855.4\n \nCash and cash equivalents and restricted cash at end of year\n(1)\n$\n638.9\n \n$\n534.3\n \n$\n430.2\n \nSupplemental cash flow information\nCash paid for:\nInterest\n$\n47.4\n \n$\n50.8\n \n$\n37.1\n \nIncome taxes - net\n171.4\n \n199.5\n \n175.6\n \n(1) \nIncludes $\n18.1\n million of restricted cash at December 31, 2024. The restricted cash has been included in Other current assets in the Consolidated Balance Sheets. There was \nno\n restricted cash as of December 31, 2023, December 31, 2022 or December 31, 2021.\nSee Notes to Consolidated Financial Statements.\n44\nIDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(In millions, except per share amounts)\n1.\nSignificant Accounting Policies\nBusiness\nIDEX is an applied solutions provider specializing in the manufacturing of fluid and metering technologies, health and science technologies and fire, safety and other diversified products built to customers’ specifications. IDEX’s products are sold in niche markets across a wide range of industries throughout the world. The Company operates through \nthree\n reportable segments: Fluid & Metering Technologies (“FMT”), Health & Science Technologies (“HST”) and Fire & Safety/Diversified Products (“FSDP”).\nConsolidation and Basis of Presentation\nThe accompanying Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). The Consolidated Financial Statements include the Company and its subsidiaries. All intercompany transactions and accounts have been eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and judgments that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities and reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates. The principal areas of estimation reflected in the financial statements are revenue recognition, sales returns and allowances, allowance for credit losses, inventory valuation, recoverability of long-lived assets, valuation of goodwill and intangible assets, income taxes, product warranties, contingencies and litigation, insurance-related items, defined benefit retirement plans and purchase accounting related to acquisitions.\nRevenue Recognition\nThe Company accounts for a contract with a customer when it has approval from both parties, the rights and payment terms are identified, the contract has commercial substance and collectability of the consideration is probable. The Company determines the appropriate revenue recognition by analyzing the terms and conditions of the contract. Revenue, or Net sales, is recognized when control of the products or services is transferred to a customer at an amount that reflects the consideration the Company expects to be entitled to in exchange for transferring the products or providing the services. Control is transferred to customers when performance obligations within a contract are satisfied. A performance obligation is a promise to transfer a distinct product or service to a customer. \nThe majority of the Company’s contracts have a single performance obligation which represents, in most cases, the product being sold to the customer. Some contracts include multiple performance obligations such as a product and related installation, extended warranty, engineering, software and/or maintenance services.  \nFor contracts that require complex design, manufacturing and installation activities, certain performance obligations may not be separately identifiable and, therefore, not distinct. As a result, the entire contract is accounted for as a single performance obligation. For contracts that include distinct products or services that are substantially the same and have the same pattern of transfer to the customer over time, they are recognized as a series of distinct products or services. For product sales, each product sold to a customer generally represents a distinct performance obligation. For contracts with multiple performance obligations, the Company allocates the total transaction price to each performance obligation in an amount based on the relative standalone selling prices of the promised products or services underlying each performance obligation. When available, the observable standalone sales are used in the allocation of the total transaction price, but in certain cases, the Company may be required to estimate the standalone selling price using the expected cost plus margin approach, under which it forecasts the expected costs of satisfying a performance obligation and then adds an appropriate margin for the distinct product or service.\nThe Company’s performance obligations are satisfied at either a point in time or over time as work progresses. For performance obligations satisfied at a point in time, revenue is recognized when control transfers to the customer, typically upon shipment. For performance obligations in which the Company transfers control of a product or service over time, revenue \n45\nis recognized over time as work is performed. Typically, this results when the Company performs services over time or the Company creates a product with no alternative use and has an enforceable right to payment for its performance to date. \nWhen accounting for over-time contracts, the Company generally uses a cost input measure to determine the extent of progress towards completion of the performance obligation. The Company believes this measure of progress best depicts the transfer of control to the customer which occurs as the Company incurs costs on its contracts. Incurred cost represents work performed, which corresponds with the transfer of control to the customer. Contract costs include labor, material and overhead. Revenue is recognized based on the relationship between actual costs incurred to date for each contract and the total estimated costs for such contract at completion of the performance obligation. \nAs a significant change in one or more of these estimates could affect the profitability of the Company’s contracts, the Company reviews and updates its estimates regularly. Due to uncertainties inherent in the estimation process, it is reasonably possible that completion costs, including those arising from contract penalty provisions and final contract settlements, will be revised. Such revisions to costs and income are recognized in the period in which the revisions are determined as a cumulative catch-up adjustment. The impact of the adjustment on profit recorded to date on a contract is recognized in the period the adjustment is identified. Revenue and profit in future periods of contract performance are recognized using the adjusted estimate. If at any time the estimate of contract profitability indicates an anticipated loss on the contract, the Company recognizes provisions for estimated losses on incomplete contracts in the period in which such losses are determined.\nThe Company records allowances for discounts and product returns at the time of sale as a reduction of revenue as such allowances can be reliably estimated based on historical experience and known trends. The Company also offers product warranties (primarily assurance-type) and accrues its estimated exposure for warranty claims at the time of sale based upon the length of the warranty period, warranty costs incurred and any other related information known to the Company.\nContract Assets and Liabilities\nThe timing of billings and cash collections can result in customer receivables, billings in excess of revenue recognized, advance payments or deposits. Customer receivables include both amounts billed and currently due from customers as well as unbilled amounts (contract assets) and are included in Receivables - net on the Consolidated Balance Sheets. Amounts are billed in accordance with contractual terms or as work progresses. Unbilled amounts arise when the timing of billing differs from the timing of revenue recognized, such as when contract provisions require specific milestones to be met before a customer can be billed. Unbilled amounts primarily relate to performance obligations satisfied over time when the cost-to-cost method is utilized and the revenue recognized exceeds the amount billed to the customer as there is not yet a right to invoice in accordance with contractual terms. Unbilled amounts are recorded as a contract asset when the revenue associated with the contract is recognized prior to billing and derecognized when billed in accordance with the terms of the contract.\nContract liabilities include advance payments, deposits and billings in excess of revenue recognized and are included in deferred revenue which is classified as current or noncurrent based on the timing of when the Company expects to recognize the revenue. The current portion is included in Accrued expenses and the noncurrent portion is included in Other noncurrent liabilities on the Consolidated Balance Sheets. Advance payments, deposits and billings in excess of revenue represent contract liabilities and are recorded when customers remit contractual cash payments in advance of satisfaction of performance obligations under contractual arrangements, including those with performance obligations satisfied over time. The Company generally receives advance payments from customers related to maintenance services which are recognized ratably over the service term. The Company also receives deposits from customers on certain orders which the Company recognizes as revenue at a point in time. Contract liabilities are derecognized when revenue is recognized.\nShipping and Handling Costs\nShipping and handling costs are included in Cost of sales and are recognized as a period expense during the period in which they are incurred.\nAdvertising Costs\nAdvertising costs of $\n16.9\n million, $\n15.9\n million and $\n14.9\n million for 2024, 2023 and 2022, respectively, are expensed as incurred within Selling, general and administrative expenses.\n46\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments purchased with an original maturity of 3 months or less to be cash and cash equivalents.\nMarketable Securities\nFrom time to time, the Company may hold investments in marketable securities, which are recorded in Other current assets in the Consolidated Balance Sheets. These investments are recorded at fair value, with gains and losses, dividends and interest income included in Other (income) expense – net in the Consolidated Statements of Income. See \nNote 8\n, “Fair Value Measurements,” for further discussion on the marketable securities held by the Company.\n \nAccounts Receivable and Allowance for Credit Losses\nAccounts receivable are recorded at face amount less an allowance for credit losses. The allowance is an estimate based on historical collection experience, current and future economic and market conditions and a review of the current status of each customer’s trade accounts receivable. Management evaluates the aging of the accounts receivable balances and the financial condition of its customers and all other forward-looking information that is reasonably available to estimate the amount of accounts receivable that may not be collected in the future and records the appropriate provision.\n \nInventories\nThe Company states inventories at the lower of cost or net realizable value. Cost, which includes material, labor and overhead, is determined on a first in, first out basis. The Company makes adjustments to reduce the cost of inventory to its net realizable value, if required, for estimated excess, obsolete, zero usage or impaired balances. Factors influencing these adjustments include changes in market demand, product life cycle and engineering changes.\nImpairment of Long-Lived Assets\nA long-lived asset is reviewed for impairment if an event occurs or circumstances change that would more likely than not reduce the fair value of the asset below its carrying value, as measured by comparing its net book value to the projected undiscounted future cash flows generated by its use. The Company groups and evaluates these long-lived assets for impairment at the lowest level at which individual cash flows can be identified. A long-lived asset impairment exists when the carrying value of the asset group exceeds its fair value. The amount and\n \ntiming of the impairment charge for an asset group requires the estimation of future cash flows, which are then discounted to determine the fair value of the asset group. An impaired asset group is recorded at its estimated fair value. Refer to \nNote 14\n, “Restructuring Expenses and Asset Impairments,” for further discussion on impairment of long-lived assets.\nGoodwill and Indefinite-Lived Intangible Assets\nAccounting Standards Codification (“ASC”) 350, \nGoodwill and Other Intangible Assets\n (“ASC 350”), requires that the Company review the carrying value of goodwill and indefinite-lived intangible assets annually, or if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit or asset below its carrying value. The Company evaluates the recoverability of these assets as of October 31 based on the estimated fair value of each reporting unit and the indefinite-lived intangible assets. See \nNote 6\n, “Goodwill and Intangible Assets,” for further discussion on goodwill and indefinite-lived intangible assets.\nBorrowing Expenses\nExpenses incurred in securing and issuing debt are capitalized and amortized over the life of the related borrowing and the related amortization is included in Interest expense - net in the Consolidated Statements of Income. Debt issuance costs related to senior notes and term loans are included as a reduction of the carrying amount of the related borrowing. Debt issuance costs related to securing the Company’s Revolving Facility are included in Other noncurrent assets in the Consolidated Balance Sheets.\n47\nEarnings per Common Share\nDiluted earnings per common share (“EPS”) attributable to IDEX is computed by dividing Net income attributable to IDEX by the weighted average number of common shares outstanding (basic) plus common stock equivalents outstanding (diluted) during the year. Common stock equivalents consist of restricted stock, performance share units and stock options, which have been included in the calculation of weighted average common shares outstanding using the treasury stock method.\nASC 260, \nEarnings Per Share \n(“ASC 260”)\n,\n concludes that all outstanding unvested share-based payment awards that contain rights to non-forfeitable dividends participate in undistributed earnings with common shareholders. If awards are considered participating securities, the Company is required to apply the two-class method of computing basic and diluted earnings per share. The Company has determined that its outstanding shares of restricted stock granted prior to the adoption of the IDEX Corporation 2024 Incentive Award Plan (the “2024 Incentive Award Plan”) are participating securities. Accordingly, Diluted EPS attributable to IDEX was computed using the two-class method prescribed by ASC 260. Under the 2024 Incentive Award Plan, dividend rights for restricted stock are subject to the same vesting requirements as the underlying restricted stock awards. Consequently, any restricted stock awarded under the 2024 Incentive Award Plan will not be considered participating securities.\nBasic weighted average common shares outstanding reconciles to diluted weighted average common shares outstanding as follows:\n2024\n2023\n2022\nBasic weighted average common shares outstanding\n75.7\n \n75.6\n \n75.7\n \nDilutive effect of restricted stock, performance share units and stock options\n0.2\n \n0.3\n \n0.3\n \nDiluted weighted average common shares outstanding\n75.9\n \n75.9\n \n76.0\n \nShare-based payment awards that were not included in the computation of Diluted EPS attributable to IDEX because the effect of their inclusion would have been antidilutive were as follows:\n2024\n2023\n2022\nAntidilutive shares not included in Diluted EPS attributable to IDEX\n0.4\n \n0.2\n \n0.5\n \nShare-Based Compensation\nThe Company accounts for share-based payments in accordance with ASC 718, \nCompensation-Stock Compensation\n. Accordingly, the Company expenses the fair value of the awards granted under its share-based compensation plans. That cost is recognized in the Consolidated Financial Statements over the requisite service period of the grants. See \nNote 15\n, “Share-Based Compensation,” for further discussion on share-based compensation.\nDepreciation and Amortization\nProperty and equipment are stated at historical cost, net of accumulated depreciation. Depreciation is recorded using the straight-line method over each asset’s estimated useful life. Property and equipment are generally depreciated over the following estimated useful lives:\nLand improvements\n8\n to \n12\n years\nBuildings and improvements\n8\n to \n30\n years\nMachinery, equipment and other\n3\n to \n12\n years\nOffice and transportation equipment\n2\n to \n10\n years\n48\nCertain identifiable intangible assets are amortized over their estimated useful lives using the straight-line method. The estimated useful lives used in the computation of amortization of identifiable intangible assets are as follows:\nPatents\n5\n to \n20\n years\nTrade names\n15\n to \n20\n years\nCustomer relationships\n5\n to \n20\n years\nUnpatented technology\n8\n to \n20\n years\nSoftware\n5\n years\nResearch and Development Expenditures\nCosts associated with engineering activities, including research and development, are expensed in the period incurred and are included in Cost of sales.\nTotal engineering expenses, which include research and development as well as application and support engineering, were \n$\n111.2\n million\n, $\n107.5\n million and $\n95.4\n million in 2024, 2023 and 2022, respectively. Research and development expenses, which include costs associated with developing new products and major improvements to existing products, were \n$\n67.4\n million\n, $\n68.4\n million and $\n61.4\n million in 2024, 2023 and 2022, respectively\n.\nForeign Currency Translation and Transaction\nThe functional currency of substantially all operations outside the United States is the respective local currency. Accordingly, those foreign currency balance sheet accounts have been translated using the exchange rates in effect as of the balance sheet date and the income statement amounts have been translated using the average monthly exchange rates for the year. Translation adjustments from year to year have been reported in Accumulated other comprehensive loss in the Consolidated Balance Sheets. Foreign currency transaction gains and losses from transactions denominated in a currency other than the functional currency of the subsidiary involved are reported within Other (income) expense – net in the Consolidated Statements of Income.\n Net transaction (gain) loss for the years ended December 31, 2024, 2023 and 2022 was $(\n1.0\n) million, $\n7.3\n million and $(\n0.8\n) million, respectively.\nIncome Taxes\nIncome tax expense includes U.S., state, local and international income taxes. Deferred tax assets and liabilities are recognized for the tax consequences of temporary differences between the financial reporting and tax bases of existing assets and liabilities and for loss carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates and laws that are expected to be in effect when the differences are expected to reverse. Valuation allowances are recorded to reduce deferred tax assets to the amount that will more likely than not be realized.\n See \nNote 12\n, “Income Taxes,” for further discussion on income taxes.\nConcentration of Credit Risk\nThe Company is not dependent on a single customer as its largest customer accounted for less than \n3\n%\n of net sales for all years presented.\nRecently Adopted Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which improves the disclosures required for reportable segments in the Company’s annual and interim financial statements, primarily through enhanced disclosures about significant segment expenses. The Company adopted this standard on a retrospective basis during the year ended December 31, 2024. The adoption of this standard did not have a material impact on the Company’s Consolidated Financial Statements, but resulted in additional segment expense disclosures. See \nNote 13\n, “Business Segments and Geographic Information,” for further detail.\n49\nRecently Issued Accounting Standards\nIn December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures\n, which requires public entities, on an annual basis, to disclose standard categories in the tax rate reconciliation, additional information for reconciling items that meet a quantitative threshold and income taxes paid disaggregated by jurisdiction. ASU 2023-09 is effective for annual periods beginning after December 15, 2024. Adoption of this ASU should be applied prospectively, but may be applied retrospectively to all prior periods presented in the financial statements. Early adoption is permitted. The Company is currently evaluating the impact of the adoption of this standard on the Company’s financial statement disclosures.\nIn November 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n, which requires public entities to disclose, within the footnotes to the financial statements, disaggregated information about certain income statement expense captions, including disclosure of amounts for purchases of inventory, employee compensation, depreciation and intangible asset amortization, included in each relevant expense caption. ASU 2024-03 is effective for annual periods beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027. Adoption of this ASU should be applied prospectively, but may be applied retrospectively to all prior periods presented in the financial statements. Early adoption is permitted. The Company is currently evaluating the impact of the adoption of this standard on the Company’s financial statement disclosures.\n \n2.    \nAcquisitions and Divestitures\nAll of the Company’s acquisitions of businesses have been accounted for under ASC 805, \nBusiness Combinations\n. Accordingly, the assets and liabilities of the acquired companies, after adjustments to reflect the fair values assigned to the assets and liabilities, have been included in the Company’s Consolidated Balance Sheets from their respective dates of acquisition. The results of operations of businesses acquired have been included in the Company’s Consolidated Statements of Income since their respective dates of acquisition. Supplemental pro forma information has not been provided as the acquisitions did not have a material impact on the Company’s Consolidated Financial Statements individually or in the aggregate. \nThe Company makes a preliminary allocation of the purchase price for each acquisition as of the acquisition date based on its understanding of the fair value of the acquired assets and assumed liabilities. These nonrecurring fair value measurements are classified as Level 3 in the fair value hierarchy. As the Company continues to obtain additional information, primarily related to the valuations of these assets and liabilities, and continues to integrate the newly acquired business, the Company will refine the estimates of fair value and more accurately allocate the purchase price through the completion of the measurement period, which is not to exceed one year from the date of acquisition. Only items that existed as of the acquisition date are considered for subsequent adjustment to the purchase price allocation. Goodwill recognized reflects the strategic fit, revenue and earnings growth potential of the acquired business and its synergies with existing IDEX businesses. \n2024 Acquisitions\nMott Corporation \nOn September 5, 2024, the Company acquired Mott Corporation and its subsidiaries (“Mott”) in a stock acquisition. Mott is a leading microfiltration business specializing in the design, customization and manufacturing of sintered porous metal components and engineered solutions used in fluidic applications. Headquartered in Farmington, Connecticut, Mott operates in the Scientific Fluidics & Optics reporting unit within the Company’s HST segment. Mott was acquired for cash consideration of $\n986.2\n million, net of cash acquired of $\n3.1\n million. The purchase price was funded using a combination of cash on hand of $\n211.9\n million, borrowings under the Company’s Revolving Facility of $\n279.3\n million and net proceeds of $\n495.0\n million from the issuance of the Company’s \n4.950\n% Senior Notes (defined in \nNote 7\n, “Borrowings”). Goodwill and intangible assets recognized as part of this transaction were $\n483.6\n million and $\n412.8\n million, respectively. The goodwill is expected to be primarily deductible for tax purposes.\n50\nAs of December 31, 2024, the preliminary allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n87.2\n \nProperty, plant and equipment\n53.7\n \nGoodwill\n483.6\nIntangible assets\n412.8\nOther noncurrent assets\n14.7\nTotal assets acquired\n1,052.0\n \nCurrent liabilities\n(\n45.4\n)\nDeferred income taxes\n(\n9.2\n)\nOther noncurrent liabilities\n(\n11.2\n)\nNet assets acquired\n$\n986.2\n \nAcquired intangible assets consist of trade names, customer relationships and unpatented technology. The acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n42.0\n \n15\nCustomer relationships\n269.0\n \n14\nUnpatented technology\n101.8\n \n13\nAcquired intangible assets\n$\n412.8\n \nIn January 2025, the Company finalized the purchase price of Mott, resulting in a reduction to the purchase price of $\n4.2\n million. Funds were received by the Company in January 2025. \n2023 Acquisitions\nIridian \nOn May 19, 2023, the Company acquired Iridian Spectral Technologies (“Iridian”) in a stock acquisition. Iridian is a global leader in designing and manufacturing thin-film, multi-layer optical filters serving the laser communications, telecommunications and life sciences markets and expands the Company’s array of optical technology offerings. Headquartered in Ottawa, Canada, Iridian operates in the Company’s Scientific Fluidics & Optics reporting unit within the HST segment. Iridian was acquired for cash consideration of $\n109.8\n million. The entire purchase price was funded with cash on hand. Goodwill and intangible assets recognized as part of this transaction were $\n54.2\n million and $\n44.1\n million, respectively. The goodwill is not deductible for tax purposes.\n51\nThe final allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n10.6\n \nProperty, plant and equipment\n19.4\n \nGoodwill\n54.2\nIntangible assets\n44.1\nOther noncurrent assets\n5.4\nTotal assets acquired\n133.7\nCurrent liabilities\n(\n1.2\n)\nDeferred income taxes\n(\n17.8\n)\nOther noncurrent liabilities\n(\n4.9\n)\nNet assets acquired\n$\n109.8\n \nAcquired intangible assets consist of trade names, customer relationships and unpatented technology. \nThe acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n5.2\n \n15\nCustomer relationships\n27.8\n \n12\nUnpatented technology\n11.1\n \n11\nAcquired intangible assets\n$\n44.1\n \nSTC\nOn December 14, 2023, the Company acquired STC Material Solutions (“STC”) in a stock acquisition. STC specializes in the design and manufacturing of technical ceramics and hermetic sealing products for critical applications in the semiconductor, aerospace and defense, industrial technology, medical technology and energy markets. Headquartered in St. Albans, Vermont, with additional operations in Santa Ana, California, STC operates in the Company’s Scientific Fluidics & Optics reporting unit within the HST segment. STC was acquired for cash consideration of $\n200.4\n million. The entire purchase price was funded with cash on hand. Goodwill and intangible assets recognized as part of this transaction were $\n104.3\n million and $\n92.3\n million, respectively. The goodwill is \nno\nt deductible for tax purposes.\n52\nThe final allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n16.7\n \nProperty, plant and equipment\n12.1\n \nGoodwill\n104.3\n \nIntangible assets\n92.3\n \nOther noncurrent assets\n3.0\n \nTotal assets acquired\n228.4\n \nCurrent liabilities\n(\n5.5\n)\nDeferred income taxes\n(\n19.8\n)\nOther noncurrent liabilities\n(\n2.7\n)\nNet assets acquired\n(1)\n$\n200.4\n \n(1) \nDuring the first quarter of 2024, the Company finalized the purchase price of STC, resulting in a $\n1.6\n million downward adjustment to the purchase price of the STC business.\n \nAcquired intangible assets consist of trade names, customer relationships and unpatented technology. \nThe acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n9.3\n \n15\nCustomer relationships\n63.0\n \n15\nUnpatented technology\n20.0\n \n11\nAcquired intangible assets\n$\n92.3\n \n2022 Acquisitions\nNexsight\nOn February 28, 2022, the Company acquired Nexsight, LLC and its businesses Envirosight, WinCan, MyTana and Pipeline Renewal Technologies (“Nexsight”) in a partial stock and partial asset acquisition. Nexsight complements and creates synergies with the Company’s existing iPEK and ADS business units that design and create sewer crawlers, inspection and monitoring systems and software applications that allow teams to identify, anticipate and correct wastewater system issues remotely. Headquartered in Randolph, New Jersey, Nexsight operates in the Company’s Water reporting unit within the FMT segment. Nexsight was acquired for cash consideration of $\n112.5\n million. The entire purchase price was funded with cash on hand. Goodwill and intangible assets recognized as part of this transaction were $\n54.7\n million and $\n49.8\n million, respectively. Of the total goodwill balance recognized, $\n41.9\n million was deductible for tax purposes. \n53\nThe final allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n16.6\n \nProperty, plant and equipment\n2.0\n \nGoodwill\n54.7\nIntangible assets\n49.8\nOther noncurrent assets\n4.3\nTotal assets acquired\n127.4\nCurrent liabilities\n(\n9.2\n)\nDeferred income taxes\n(\n1.9\n)\nOther noncurrent liabilities\n(\n3.8\n)\nNet assets acquired\n$\n112.5\n \nAcquired intangible assets consist of trade names, customer relationships and software. \nThe acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n13.5\n \n15\nCustomer relationships\n31.5\n \n10\nSoftware\n4.8\n \n5\nAcquired intangible assets\n$\n49.8\n \nKZValve\nOn May 2, 2022, the Company acquired KZ CO. (“KZValve”) in an asset acquisition. KZValve is a leading manufacturer of electric valves and controllers used primarily in agricultural applications. KZValve augments and expands IDEX’s agricultural portfolio, complementing Banjo’s current fluid management solutions for these applications. Headquartered in Greenwood, Nebraska, KZValve operates in the Company’s Agriculture reporting unit within the FMT segment. KZValve was acquired for cash consideration of $\n120.1\n million. The entire purchase was funded with cash on hand. Goodwill and intangible assets recognized as part of this transaction were $\n56.4\n million and $\n52.0\n million, respectively. The goodwill is deductible for tax purposes.\n54\nThe final allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n9.7\n \nProperty, plant and equipment\n1.8\n \nGoodwill\n56.4\n \nIntangible assets\n52.0\n \nDeferred income taxes\n0.2\n \nOther noncurrent assets\n1.0\n \nTotal assets acquired\n121.1\n \nCurrent liabilities\n(\n1.0\n)\nNet assets acquired\n$\n120.1\n \nAcquired intangible assets consist of trade names, customer relationships and unpatented technology. \nThe acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n7.5\n \n15\nCustomer relationships\n36.0\n \n13\nUnpatented technology \n8.5\n \n10\nAcquired intangible assets\n$\n52.0\n \nMuon Group\nOn November 18, 2022, the Company acquired the stock of Muon B.V. and its subsidiaries (“Muon Group”). Muon Group manufactures highly precise flow paths in a variety of materials that enable the movement of various liquids and gases in critical applications for medical, semiconductor, food processing, digital printing and filtration technologies. Muon Group maintains operations in Hapert, the Netherlands; Eerbeek, the Netherlands; Wijchen, the Netherlands; Dorset, England and Pune, India and operates in the Company’s Scientific Fluidics & Optics reporting unit within the HST segment. Muon Group was acquired for cash consideration of $\n713.0\n million. The purchase price was funded with $\n342.6\n million of cash on hand, $\n170.4\n million of proceeds from the Company’s Revolving Facility and $\n200.0\n million of proceeds from the Company’s Term Facility (defined in \nNote 7\n, “Borrowings”). Goodwill and intangible assets recognized as part of this transaction were $\n396.6\n million and $\n319.1\n million, respectively. The goodwill is not deductible for tax purposes.\n55\nThe final allocation of the purchase price to the assets acquired and liabilities assumed, based on their estimated fair values at the acquisition date, is as follows:\nTotal\nCurrent assets, net of cash acquired\n$\n51.4\n \nProperty, plant and equipment\n57.6\n \nGoodwill\n396.6\n \nIntangible assets\n319.1\n \nOther noncurrent assets\n9.6\n \nTotal assets acquired\n834.3\n \nCurrent liabilities\n(\n26.8\n)\nDeferred income taxes\n(\n83.5\n)\nOther noncurrent liabilities\n(\n11.0\n)\nNet assets acquired\n$\n713.0\n \nAcquired intangible assets consist of trade names, customer relationships and unpatented technology. \nThe acquired intangible assets and weighted average amortization periods are as follows:\nTotal\nWeighted Average Life (in years)\nTrade names\n$\n38.3\n \n15\nCustomer relationships\n212.4\n \n13\nUnpatented technology\n68.4\n \n11\nAcquired intangible assets\n$\n319.1\n \nAcquisition-Related Costs\nThe Company incurred acquisition costs related to completed, pending and potential transactions, including those that ultimately were not completed. These costs were recorded in Selling, general and administrative expenses in the Company’s Consolidated Statements of Income. The Company also incurred fair value inventory step-up charges associated with completed acquisitions. These costs were recorded in Cost of sales in the Company’s Consolidated Statements of Income. \nA summary of the acquisition costs and the fair value inventory step-up charges recorded in the years ended December 31, 2024, 2023 and 2022 are presented in the following table:\n2024\n2023\n2022\nAcquisition costs\n$\n10.4\n \n$\n7.3\n \n$\n6.8\n \nFair value inventory step-up charges\n9.6\n \n1.6\n \n8.5\n \n56\nDivestitures\nThe Company periodically reviews its businesses relative to its core business. As such, from time to time, the Company may sell various businesses or assets for a variety of reasons. Any resulting gain or loss recognized due to divestitures is recorded within Gain on sale of businesses - net in the Consolidated Statements of Income. The divestitures did not represent a strategic shift that had a major effect on operations and financial results and, therefore, did not qualify for presentation as discontinued operations.\nOn June 3, 2024, the Company completed the sale of Alfa Valvole, Srl (“Alfa Valvole”) for proceeds of $\n45.1\n million, net of cash remitted, resulting in a gain on the sale of $\n4.0\n million, net of a release of cumulative foreign currency translation losses of $\n5.5\n million. There was no income tax impact associated with this transaction in the Consolidated Statements of Income due to the participation exemption of its consolidated group. The results of Alfa Valvole were reported in the Valves reporting unit within the FMT segment through the date of disposition.\nOn December 29, 2023, the Company completed the sale of Novotema, SpA (“Novotema”) for proceeds of $\n8.3\n million, net of cash remitted, resulting in a loss on the sale of $\n9.1\n million. There was no income tax impact associated with this transaction in the Consolidated Statements of Income due to the participation exemption of its consolidated group. The results of Novotema were reported in the Sealing Solutions reporting unit within the HST segment through the date of disposition.\nOn August 3, 2023, the Company completed the sale of Micropump, Inc. (“Micropump”) for proceeds of $\n110.3\n million, net of cash remitted, resulting in a pre-tax gain on the sale of $\n93.8\n million. The divestiture resulted in $\n22.7\n million of income tax expense in the Consolidated Statements of Income during the year ended December 31, 2023. Micropump was its own reporting unit and its results were reported within the HST segment through the date of disposition. \nOn September 9, 2022, the Company completed the sale of Knight LLC (“Knight”) for proceeds of $\n49.4\n million, net of cash remitted, resulting in a pre-tax gain on the sale of $\n34.8\n million. The divestiture resulted in $\n5.5\n million of income tax expense in the Consolidated Statements of Income during the year ended December 31, 2022. The results of Knight were reported in the Water reporting unit within the FMT segment through the date of disposition.\n57\n3.    \nCollaborative Investments\nOn May 12, 2020, a subsidiary of IDEX entered into a joint venture agreement with a third party to form a limited liability company (the “Joint Venture”) that manufactures and sells high performance elastomer seals for the oil and gas industry to customers within the Kingdom of Saudi Arabia as well as exports these high performance elastomer seals outside of the Kingdom\n of Saudi Arabia. The Joint Venture maintains operations in Dammam, Saudi Arabia and operates in the Company’s Sealing Solutions reporting unit within the HST segment\n. The Company has contributed \n$\n0.7\n million\n f\nor \n55\n% of the share capital\n while the third-party partner has contributed \n$\n0.6\n million for \n45\n% of the shar\ne capital. The Joint Venture has been selling since July 2022. Since IDEX controls the entity, IDEX has consolidated the Joint Venture and recorded a Noncontrolling interest in its Consolidated Financial Statements. \nDuring 2021 and 2022, a subsidiary of IDEX funded a total of \n$\n7.2\n million\n in promissory notes as an investment in a start-up company that provides communication technology to improve individual performance and team coordination for firefighters’ responses, which aligns with IDEX’s FSDP segment’s strategic plan. On a quarterly basis, the Company evaluated whether an allowance for credit losses was required for these promissory notes and measured the allowance using the current expected credit loss model. During the second quarter of 2023, IDEX determined that its investment may no longer be recoverable. As a result, IDEX recorded a credit loss of \n$\n7.7\n million\n in Other (income) expense – net in the Consolidated Statements of Income and a reserve in Other noncurrent assets on the Consolidated Balance Sheets for the full amount of the principal and accrued interest outstanding. During the fourth quarter of 2023, IDEX converted the promissory notes to equity, resulting in a cost method investment with zero value.\n58\n4.    \nBalance Sheet Components\n \nDecember 31,\n \n2024\n2023\nRECEIVABLES - NET\nCustomers\n$\n461.0\n \n$\n419.0\n \nOther\n14.7\n \n16.3\n \nTotal\n475.7\n \n435.3\n \nLess: allowance for credit losses\n9.8\n \n7.5\n \nReceivables - net\n$\n465.9\n \n$\n427.8\n \nINVENTORIES - NET\nRaw materials and components parts\n$\n285.5\n \n$\n268.1\n \nWork in process\n34.4\n \n44.5\n \nFinished goods\n109.8\n \n108.2\n \nInventories - net\n$\n429.7\n \n$\n420.8\n \nPROPERTY, PLANT AND EQUIPMENT - NET \nLand and improvements\n$\n30.0\n \n$\n30.8\n \nBuildings and improvements\n268.9\n \n234.7\n \nMachinery, equipment and other\n607.9\n \n551.0\n \nOffice and transportation equipment\n108.6\n \n106.0\n \nConstruction in progress\n34.9\n \n53.5\n \nTotal\n1,050.3\n \n976.0\n \nLess: accumulated depreciation and amortization\n589.9\n \n545.7\n \nProperty, plant and equipment - net\n$\n460.4\n \n$\n430.3\n \nACCRUED EXPENSES\nPayroll and related items\n$\n105.0\n \n$\n97.1\n \nManagement incentive compensation\n14.6\n \n16.4\n \nIncome taxes payable\n10.1\n \n18.5\n \nDeferred revenue\n50.7\n \n55.9\n \nLease liability\n26.1\n \n22.0\n \nOther\n72.2\n \n61.6\n \nAccrued expenses\n$\n278.7\n \n$\n271.5\n \nThe valuation and qualifying account activity for the years ended December 31, 2024, 2023 and 2022 is as follows:\n2024\n2023\n2022\nALLOWANCE FOR CREDIT LOSSES\n \nBeginning balance January 1\n$\n7.5\n \n$\n8.0\n \n$\n7.2\n \nCharged to costs and expenses, net of recoveries\n1.7\n \n0.6\n \n2.2\n \nUtilization\n(\n1.0\n)\n(\n1.2\n)\n(\n1.2\n)\nAcquisitions and divestitures\n1.8\n \n0.4\n \n0.5\n \nOther adjustments, including foreign currency translation\n(\n0.2\n)\n(\n0.3\n)\n(\n0.7\n)\nEnding balance December 31\n$\n9.8\n \n$\n7.5\n \n$\n8.0\n \n \n59\n5.    \nRevenue\nDisaggregation of Revenue\nThe Company has a comprehensive offering of products, including technologies, built to customers’ specifications that are sold in niche markets throughout the world. The Company disaggregates revenue from contracts with customers by reporting unit and geographical region for each segment as the Company believes it best depicts how the amount, nature, timing and uncertainty of its revenue and cash flows are affected by economic factors. Revenue, presented as Net sales on the Consolidated Statements of Income, was attributed to geographical region based on the location of the customer. The following tables present revenue disaggregated by reporting unit and geographical region.\nRevenue by reporting unit for the years ended December 31, 2024, 2023 and 2022 was as follows:\nFor the Year Ended December 31,\n2024\n2023\n2022\nPumps\n$\n408.3\n \n$\n402.9\n \n$\n396.5\n \nWater\n347.8\n \n345.8\n \n307.8\n \nEnergy\n207.6\n \n209.3\n \n191.3\n \nAgriculture\n146.4\n \n159.6\n \n152.8\n \nValves\n123.1\n \n129.5\n \n118.9\n \nIntersegment elimination\n(\n1.4\n)\n(\n2.9\n)\n(\n1.1\n)\nFluid & Metering Technologies\n1,231.8\n \n1,244.2\n \n1,166.2\n \nScientific Fluidics & Optics\n(1)\n706.1\n \n681.5\n \n639.0\n \nPerformance Pneumatic Technologies\n237.4\n \n250.0\n \n257.6\n \nSealing Solutions\n232.4\n \n242.3\n \n266.0\n \nMaterial Processing Technologies\n122.2\n \n120.7\n \n138.1\n \nMicropump\n(2)\n—\n \n21.9\n \n38.5\n \nIntersegment elimination\n(\n4.1\n)\n(\n2.9\n)\n(\n2.4\n)\nHealth & Science Technologies\n1,294.0\n \n1,313.5\n \n1,336.8\n \nFire & Safety\n467.2\n \n431.9\n \n400.1\n \nDispensing\n161.3\n \n167.5\n \n167.5\n \nBAND-IT\n115.8\n \n119.4\n \n111.6\n \nIntersegment elimination\n(\n1.3\n)\n(\n2.6\n)\n(\n0.3\n)\nFire & Safety/Diversified Products\n743.0\n \n716.2\n \n678.9\n \nNet sales\n$\n3,268.8\n \n$\n3,273.9\n \n$\n3,181.9\n \n(1)\n The year ended December 31, 2022 includes the acceleration of previously deferred revenue of $\n17.9\n million as a result of a customer’s decision to discontinue further investment in commercializing its COVID-19 testing application. See \nNote 14\n, “Restructuring Expenses and Asset Impairments,” for further detail. \n(2) \nRevenue from Micropump (sold on August 3, 2023) has been included in the Company’s Consolidated Statements of Income through the date of disposition. See \nNote 2\n, “Acquisitions and Divestitures,” for further detail.\n60\nRevenue by geographical region for the years ended December 31, 2024, 2023 and 2022 was as follows:\nFor the Year Ended December 31, 2024\nFMT\nHST\nFSDP\nIDEX\nU.S.\n$\n693.1\n \n$\n573.7\n \n$\n354.9\n \n$\n1,621.7\n \nNorth America, excluding U.S.\n68.3\n \n29.9\n \n34.2\n \n132.4\n \nEurope\n210.1\n \n408.0\n \n178.4\n \n796.5\n \nAsia\n169.7\n \n261.4\n \n139.9\n \n571.0\n \nOther\n(1)\n92.0\n \n25.1\n \n36.9\n \n154.0\n \nIntersegment elimination\n(\n1.4\n)\n(\n4.1\n)\n(\n1.3\n)\n(\n6.8\n)\nNet sales\n$\n1,231.8\n \n$\n1,294.0\n \n$\n743.0\n \n$\n3,268.8\n \nFor the Year Ended December 31, 2023\nFMT\nHST\nFSDP\nIDEX\nU.S.\n$\n695.7\n \n$\n575.5\n \n$\n371.9\n \n$\n1,643.1\n \nNorth America, excluding U.S.\n70.3\n \n22.6\n \n33.4\n \n126.3\n \nEurope\n213.8\n \n439.9\n \n166.7\n \n820.4\n \nAsia\n177.6\n \n249.4\n \n108.5\n \n535.5\n \nOther\n(1)\n89.7\n \n29.0\n \n38.3\n \n157.0\n \nIntersegment elimination\n(\n2.9\n)\n(\n2.9\n)\n(\n2.6\n)\n(\n8.4\n)\nNet sales\n$\n1,244.2\n \n$\n1,313.5\n \n$\n716.2\n \n$\n3,273.9\n \nFor the Year Ended December 31, 2022\nFMT\nHST\nFSDP\nIDEX\nU.S.\n(2)\n$\n660.8\n \n$\n646.9\n \n$\n343.3\n \n$\n1,651.0\n \nNorth America, excluding U.S.\n71.5\n \n25.8\n \n35.3\n \n132.6\n \nEurope\n(2)\n194.6\n \n379.7\n \n160.9\n \n735.2\n \nAsia\n157.8\n \n261.3\n \n104.2\n \n523.3\n \nOther\n(1)\n82.6\n \n25.5\n \n35.5\n \n143.6\n \nIntersegment elimination\n(\n1.1\n)\n(\n2.4\n)\n(\n0.3\n)\n(\n3.8\n)\nNet sales\n$\n1,166.2\n \n$\n1,336.8\n \n$\n678.9\n \n$\n3,181.9\n \n(1) \nOther includes: South America, Middle East, Australia and Africa.\n(2)\n The HST segment includes the acceleration of $\n17.9\n million of previously deferred revenue as a result of a customer’s decision to discontinue further investment in commercializing its COVID-19 testing application, of which $\n9.5\n million was recognized in the U.S. and $\n8.4\n million was recognized in Europe in the year ended December 31, 2022. See \nNote 14\n, “Restructuring Expenses and Asset Impairments,” for further detail.\nPerformance Obligations\nThe Company’s performance obligations are satisfied either at a point in time or over time as work progresses. Revenue from products and services transferred to customers at a point in time comprised approximately \n95\n% of the Company’s revenue and over time comprised approximately \n5\n% of the Company’s revenue in all years presented. \nContract Assets and Liabilities\nThe timing of billings and cash collections can result in customer receivables, billings in excess of revenue recognized, advance payments or deposits. Customer receivables include both amounts billed and currently due from customers as well as unbilled amounts (contract assets) and are included in Receivables – net on the Consolidated Balance Sheets. \n61\nThe composition of customer receivables was as follows:\nDecember 31, 2024\nDecember 31, 2023\nBilled receivables\n$\n443.2\n \n$\n408.1\n \nUnbilled receivables\n17.8\n \n10.9\n \nTotal customer receivables\n$\n461.0\n \n$\n419.0\n \nBillings in excess of revenue recognized, advance payments and deposits represent contract liabilities and are included in deferred revenue which is classified as current or noncurrent based on when the Company expects to recognize the revenue. The current portion is included in Accrued expenses and the noncurrent portion is included in Other noncurrent liabilities on the Consolidated Balance Sheets. \nThe composition of deferred revenue was as follows:\nDecember 31, 2024\nDecember 31, 2023\nDeferred revenue - current\n$\n50.7\n \n$\n55.9\n \nDeferred revenue - noncurrent\n13.2\n \n17.3\n \nTotal deferred revenue\n$\n63.9\n \n$\n73.2\n \n6.    \nGoodwill and Intangible Assets\nThe changes in the carrying amount of goodwill for 2024 and 2023, by reportable business segment, were as follows:\nFMT\nHST\nFSDP\nTotal\nGoodwill\n$\n800.9\n \n$\n1,644.8\n \n$\n393.0\n \n$\n2,838.7\n \nAccumulated goodwill impairment losses\n(\n20.7\n)\n(\n149.8\n)\n(\n30.1\n)\n(\n200.6\n)\nBalance at January 1, 2023\n780.2\n \n1,495.0\n \n362.9\n \n2,638.1\n \nForeign currency translation\n6.6\n \n38.6\n \n5.7\n \n50.9\n \nAcquisitions\n—\n \n156.7\n \n—\n \n156.7\n \nMeasurement period adjustments\n(\n1.8\n)\n5.4\n \n—\n \n3.6\n \nDivestitures\n—\n \n(\n11.0\n)\n—\n \n(\n11.0\n)\nBalance at December 31, 2023\n785.0\n \n1,684.7\n \n368.6\n \n2,838.3\n \nForeign currency translation\n(\n8.9\n)\n(\n43.4\n)\n(\n8.1\n)\n(\n60.4\n)\nAcquisitions\n—\n \n483.6\n \n—\n \n483.6\n \nMeasurement period adjustments\n—\n \n1.8\n \n—\n \n1.8\n \nDivestitures\n(\n11.6\n)\n—\n \n—\n \n(\n11.6\n)\nBalance at December 31, 2024\n$\n764.5\n \n$\n2,126.7\n \n$\n360.5\n \n$\n3,251.7\n \n \nGoodwill represents the purchase price in excess of the net amount assigned to the assets acquired and liabilities assumed and was tested for impairment at each of the Company’s reporting units as determined in accordance with ASC 350 as of October 31, 2024, the Company’s annual impairment test date, with no impairment noted. In assessing the fair value of the reporting units, the Company considers both the market approach and the income approach. Under the market approach, the fair value of the reporting unit is determined by the respective trailing 12 month earnings before interest, income taxes, depreciation and amortization (“EBITDA”) and the forward looking 2025 EBITDA (50% each), based on multiples of comparable public companies. The market approach is dependent on a number of significant management assumptions including forecasted EBITDA and selected market multiples. Under the income approach, the fair value of the reporting unit is determined based on the present value of estimated future cash flows. The income approach is dependent on a number of significant management assumptions including estimates of operating results, capital expenditures, net working capital requirements, long-term growth rates and discount rates. Weighting was equally attributed to both the market and the income approaches (50% each) in arriving at the fair value of the reporting units. In 2024 and 2023, there were no events or circumstances that would have required an interim impairment test.  \n62\nThe following table provides the gross carrying value and accumulated amortization for each major class of intangible asset at December 31, 2024 and 2023:\n \nAt December 31, 2024\nAt December 31, 2023\n \nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nAmortized intangible assets:\nPatents\n$\n2.5\n \n$\n(\n2.0\n)\n$\n0.5\n \n$\n2.7\n \n$\n(\n2.0\n)\n$\n0.7\n \nTrade names\n201.4\n \n(\n60.0\n)\n141.4\n \n171.9\n \n(\n54.3\n)\n117.6\n \nCustomer relationships\n1,078.8\n \n(\n278.7\n)\n800.1\n \n860.7\n \n(\n228.7\n)\n632.0\n \nUnpatented technology\n325.4\n \n(\n85.1\n)\n240.3\n \n233.5\n \n(\n66.3\n)\n167.2\n \nSoftware \n15.2\n \n(\n3.6\n)\n11.6\n \n5.3\n \n(\n1.9\n)\n3.4\n \nTotal amortized intangible assets\n1,623.3\n \n(\n429.4\n)\n1,193.9\n \n1,274.1\n \n(\n353.2\n)\n920.9\n \nIndefinite-lived intangible assets:\nBanjo trade name\n62.1\n \n— \n62.1\n \n62.1\n \n— \n62.1\n \nAkron Brass trade name\n28.8\n \n— \n28.8\n \n28.8\n \n— \n28.8\n \nTotal intangible assets\n$\n1,714.2\n \n$\n(\n429.4\n)\n$\n1,284.8\n \n$\n1,365.0\n \n$\n(\n353.2\n)\n$\n1,011.8\n \nThe Banjo and Akron Brass trade names are indefinite-lived intangible assets that were also tested for impairment as of October 31, 2024, with no impairments noted. These indefinite-lived intangible assets are tested for impairment on an annual basis in accordance with ASC 350 or more frequently if events or changes in circumstances indicate that the assets might be impaired. The Company uses the relief-from-royalty method, a form of the income approach, to determine the fair value of these trade names. The relief-from-royalty method is dependent on a number of significant management assumptions, including estimates of revenues, royalty rates and discount rates. In 2024 and 2023, there were no events or circumstances that would have required an interim impairment test.\nAmortization of intangible assets was $\n107.1\n million, $\n94.9\n million and $\n69.0\n million in 2024, 2023 and 2022, respectively. \nBased \non the intangible asset balances as of December 31, 2024, expected amortization expense for the years 2025 through 2029 is as follows:\nEstimated Amortization\n2025\n$\n124.5\n \n2026\n122.9\n \n2027\n119.3\n \n2028\n116.7\n \n2029\n107.4\n \n \n63\n7.    \nBorrowings\nBorrowings at December 31, 2024 and 2023 consisted of the following:\nDecember 31, 2024\nDecember 31, 2023\n3.37\n% Senior Notes, due June 2025 (the “\n3.37\n% Senior Notes”)\n$\n100.0\n \n$\n100.0\n \n5.13\n% Senior Notes, due June 2028 (the “\n5.13\n% Senior Notes”)\n100.0\n \n100.0\n \n4.950\n% Senior Notes, due September 2029 (the “\n4.950\n% Senior Notes”)\n500.0\n \n—\n \n3.00\n% Senior Notes, due May 2030 (the “\n3.00\n% Senior Notes”)\n500.0\n \n500.0\n \n2.625\n% Senior Notes, due June 2031 (the “\n2.625\n% Senior Notes”)\n500.0\n \n500.0\n \n$\n800.0\n million Revolving Facility, due November 2027 (the “Revolving Facility”)\n269.8\n \n81.0\n \n$\n200.0\n million Term Facility, due November 2027 (the “Term Facility”)\n—\n \n50.0\n \nOther borrowings\n1.5\n \n2.3\n \nTotal borrowings\n1,971.3\n \n1,333.3\n \nLess: current portion\n100.7\n \n0.6\n \nLess: unamortized debt issuance costs and discount on debt\n11.1\n \n7.6\n \nLong-term borrowings\n$\n1,859.5\n \n$\n1,325.1\n \nRevolving Facility and Term Facility\nOn November 1, 2022, the Company entered into an amended and restated credit agreement (as amended and restated, the “Credit Agreement”) along with certain of its subsidiaries, as borrowers (the “Borrowers”), Bank of America, N.A., as administrative agent, swing line lender and an issuer of letters of credit, and other agents party thereto. The Credit Agreement consists of a revolving credit facility in an aggregate principal amount of $\n800\n million and a term credit facility available to the Company in an aggregate principal amount of $\n200\n million, both of which have a final maturity date of November 1, 2027. The maturity date of the Revolving Facility may be extended under certain conditions for an additional \none-year\n term. Up to $\n100\n million of the Revolving Facility is available for the issuance of letters of credit. Additionally, up to $\n50\n million of the Revolving Facility is available to the Company for swing line loans, available on a same-day basis. \nProceeds of the Revolving Facility are available for use by the Borrowers for working capital and other general corporate purposes, including refinancing existing debt of the Company and its subsidiaries and financing of acquisitions. The Company may request increases in the lending commitments under the Credit Agreement, but the aggregate lending commitments pursuant to such increases may not exceed $\n400\n million. The Company has the right, subject to certain conditions set forth in the Credit Agreement, to designate certain foreign subsidiaries of the Company as borrowers under the Credit Agreement. In connection with any such designation, the Company is required to guarantee the obligations of any such subsidiaries under the Credit Agreement. During 2024, the Company drew down an aggregate amount of $\n279.3\n million under the Revolving Facility to finance a portion of Company’s acquisition of Mott. The Company repaid the previously outstanding balance of $\n50.0\n million under the Term Facility and $\n69.1\n million under the Revolving Facility in 2024. Additionally, the Company repaid $\n30.2\n million under the Revolving Facility in January 2025.\nBorrowings under the Credit Agreement bear interest, at either an alternate base rate or Term SOFR (or appropriate alternative currency reference rates) plus, in each case, an applicable margin. Such applicable margin is based on the better of the Company’s senior, unsecured, long-term debt rating or the Company’s applicable leverage ratio and can range from \n0.00\n% to \n1.275\n%. Interest is payable (a) in the case of base rate loans, quarterly, and (b) in the case of Term SOFR loans, on the last day of the applicable interest period selected, or every three months from the effective date of such interest period for interest periods exceeding three months. The weighted-average interest rate for borrowings outstanding under the Revolving Facility was \n4.46\n% and \n4.22\n% for the years ended December 31, 2024 and 2023, respectively. The weighted-average interest rate for borrowings outstanding under the Term Facility was \n6.54\n% and \n6.22\n% for the years ended December 31, 2024 and 2023, respectively. \nThe Credit Agreement requires payment to the lenders of a facility fee based upon the amount of the lenders’ commitments under the credit facility from time to time, equal to the applicable interest rate times the actual daily amount of the Revolving Facility. Voluntary prepayments of any loans and voluntary reductions of the unutilized portion of the commitments under the credit facility are permissible without penalty, subject to break funding payments and minimum notice and minimum reduction amount requirements.\n64\nThe Credit Agreement gives the Company the option to enter into a future environmental, social and governance amendment by which pricing may be adjusted pursuant to the Company’s performance measured against certain key performance indicators agreed by the Company and BofA Securities, Inc., as sustainability coordinator.\nAt December 31, 2024, there was $\n269.8\n million outstanding under the Revolving Facility and $\n2.8\n million of outstanding letters of credit, resulting in a net available borrowing capacity under the Revolving Facility of approximately $\n527.4\n million.\nSenior Notes\nOn August 21, 2024, the Company completed an underwritten public offering of $\n500.0\n million in aggregate principal amount of its \n4.950\n% Senior Notes. The \n4.950\n% Senior Notes bear interest at a rate of \n4.950\n% per annum, which is payable semi-annually in arrears during the first and third quarters of the year, beginning in the first quarter of 2025. The \n4.950\n% Senior Notes will mature on September 1, 2029. The \n4.950\n% Senior Notes are senior, unsecured obligations of the Company and (i) rank equal in right of payment to all of the Company’s existing and future senior unsecured indebtedness, (ii) rank senior in right of payment to all of the Company’s existing and future subordinated indebtedness, and (iii) rank effectively subordinated in right of payment to the Company’s future secured indebtedness. The net proceeds from the \n4.950\n% Senior Notes offering were $\n495.0\n million, after deducting the underwriting discount and offering expenses paid by the Company. The Company used the net proceeds from the offering, together with the Revolving Facility borrowings discussed above and cash on hand, to fund the Mott acquisition and pay related fees and expenses.\nInclusive of the \n4.950\n% Senior Notes, at December 31, 2024, the Company has $\n1.7\n billion in senior notes outstanding at various interest rates detailed in the table above (the “Senior Notes”). Interest is payable semi-annually in arrears during the second and fourth quarters of the year for all the Senior Notes except for the \n4.950\n% Senior Notes, which are discussed above. The Senior Notes are unsecured obligations of the Company and rank pari passu in right of payment with all of the Company’s other unsecured, unsubordinated debt. Subject to the terms of the respective indenture, the Company may redeem all or a portion of the Senior Notes at any time prior to maturity at the redemption prices set forth in each indenture governing the respective Senior Notes. The terms of the \n4.950\n% Senior Notes, the \n2.625\n% Senior Notes and the \n3.00\n% Senior Notes also require the Company to make an offer to repurchase the \n4.950\n% Senior Notes, the \n2.625\n% Senior Notes and the \n3.00\n% Senior Notes upon a “Change of Control Triggering Event” (as defined in each indenture governing the respective Senior Notes) at a price equal to \n101\n% of the principal amount plus accrued and unpaid interest, if any. The terms of the \n3.37\n% Senior Notes and the \n5.13\n% Senior Notes also require the Company to make an offer to repurchase the \n3.37\n% Senior Notes and the \n5.13\n% Senior Notes upon a change of control (as defined in the note purchase agreement) of the Company at a price equal to \n100\n% of the principal amount plus accrued and unpaid interest, if any.\nCovenants\nThere are two key financial covenants that the Company is required to maintain in connection with the Credit Agreement and the Senior Notes, excluding the \n4.950\n% Senior Notes, the \n3.00\n% Senior Notes and the \n2.625\n% Senior Notes which have no financial covenants. Those two covenants include a minimum interest coverage ratio of \n3.0\n to 1 and a maximum leverage ratio of \n3.50\n to 1, which is the ratio of the Company’s consolidated total debt to its consolidated EBITDA, as defined within the Credit Agreement, both of which are tested quarterly and in the case of the leverage ratio, there is an option to increase the ratio to \n4.00\n for 12 months in connection with certain acquisitions. While there are no financial covenants relating to the \n4.950\n% Senior Notes, the \n3.00\n% Senior Notes and the \n2.625\n% Senior Notes, they are subject to cross-acceleration provisions. At December 31, 2024, the Company was in compliance with all covenants under its borrowing arrangements.\nTotal borrowings at December 31, 2024 have scheduled maturities as follows:\nMaturity of Borrowings\n2025\n$\n100.7\n \n2026\n0.5\n \n2027\n270.1\n \n2028\n100.0\n \n2029\n500.0\n \nThereafter\n1,000.0\n \nTotal borrowings\n$\n1,971.3\n \n65\n8.    \nFair Value Measurements\nASC 820, \nFair Value Measurements and Disclosures,\n defines fair value, provides guidance for measuring fair value and requires certain disclosures. This standard discusses valuation techniques, such as the market approach (comparable market prices), the income approach (present value of future income or cash flow) and the cost approach (cost to replace the service capacity of an asset or replacement cost). The standard utilizes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The following is a brief description of those three levels:\n•\nLevel 1:  Observable inputs such as quoted prices (unadjusted) in active markets for identical assets or liabilities.\n•\nLevel 2: Inputs, other than quoted prices that are observable for the asset or liability, either directly or indirectly. These include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active.\n•\nLevel 3:  Unobservable inputs that reflect the reporting entity’s own assumptions.\nThe following table summarizes the basis used to measure the Company’s financial assets (liabilities) at fair value on a recurring basis in the balance sheets at December 31, 2024 and 2023:\nBasis of Fair Value Measurements\n \nDecember 31, 2024\nDecember 31, 2023\n \nLevel 1\nLevel 1\nTrading securities - mutual funds held in nonqualified SERP\n(1)\n$\n10.6\n \n$\n10.5\n \nAvailable-for-sale securities - equities\n(2)\n—\n \n4.4\n \n(1) \nThe Supplemental Executive Retirement Plan (“SERP”) investment assets are offset by a SERP liability which represents the Company’s obligation to distribute SERP funds to participants. The SERP investment assets and liability are included in Other noncurrent assets and Other noncurrent liabilities, respectively, on the Company’s Consolidated Balance Sheets.\n(2) \nThe securities are included in Other current assets on the Company’s Consolidated Balance Sheets\n \nand are available for overnight cash settlement, if necessary, to fund current operations.\n \nThere were no transfers of assets or liabilities between Level 1 and Level 2 in 2024 or 2023.\nThe carrying values of the Company’s other financial instruments (i.e., cash and cash equivalents, accounts receivable, accounts payable and accrued expenses) approximate fair value because of the short-term nature of these instruments. \nThe following table provides the fair value of the outstanding indebtedness described in \nNote 7\n, “Borrowings,” which is based on quoted market prices and current market rates for debt with similar credit risk and maturity, as well as the carrying value. These fair value measurements are classified as Level 2 within the fair value hierarchy since they are determined based upon significant inputs observable in the market, including interest rates on recent financing transactions to entities with a credit rating similar to the Company’s rating.\nDecember 31, 2024\nDecember 31, 2023\nFair Value\nCarrying Amount\nFair Value\nCarrying Amount\nTotal Borrowings, less unaccreted debt discount \n$\n1,855.0\n \n$\n1,970.1\n \n$\n1,203.5\n \n$\n1,332.2\n \n \n9.  \nLeases\nThe Company has commitments under operating leases for certain office facilities, warehouses, manufacturing plants, equipment (which includes both office and plant equipment) and vehicles used in its operations. Leases with an initial term of 12 months or less are not recorded on the balance sheet and the Company recognizes lease expense for these leases on a straight-line basis over the lease term. The Company’s finance leases are immaterial.\nCertain leases include \none\n or more options to renew. The exercise of lease renewal options is at the Company’s sole discretion. The Company does not include renewal periods in any of the leases’ terms until the renewal is executed as they are generally not reasonably certain of being exercised. The Company does not have any material purchase options.\n66\nCertain of the Company’s lease agreements contain provisions for future rent increases or have rental payments that are adjusted periodically for inflation or based on usage. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nThe Company does not have any significant leases that have not yet commenced.\nSupplemental balance sheet information related to leases as of December 31, 2024 and 2023 was as follows:\nBalance Sheet Caption\nDecember 31, 2024\nDecember 31, 2023\nRight-of-Use (“ROU”) Assets:\nBuilding ROU assets - net \nOther noncurrent assets\n$\n114.4\n \n$\n110.7\n \nEquipment ROU assets - net\nOther noncurrent assets\n10.8\n \n7.6\n \nTotal ROU assets - net\n$\n125.2\n \n$\n118.3\n \nLease Liabilities:\nCurrent lease liabilities\nAccrued expenses\n$\n26.1\n \n$\n22.0\n \nNoncurrent lease liabilities\nOther noncurrent liabilities\n101.6\n \n98.1\n \nTotal lease liabilities\n$\n127.7\n \n$\n120.1\n \nThe components of lease cost for the years ended December 31, 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\nFixed lease cost\n(1)\n$\n34.7\n \n$\n33.0\n \n$\n30.8\n \nVariable lease cost\n3.1\n \n2.7\n \n2.3\n \nTotal lease expense\n$\n37.8\n \n$\n35.7\n \n$\n33.1\n \n(1)\n Includes short-term leases, which are immaterial.\nSupplemental cash flow information related to leases for the years ended December 31, 2024, 2023 and 2022 was as follows:\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities\n$\n34.6\n \n$\n33.6\n \n$\n31.7\n \nRight-of-use assets obtained in exchange for new lease liabilities\n19.1\n \n29.0\n \n19.0\n \nOther supplemental information related to leases as of December 31, 2024 and 2023 was as follows:\nLease Term and Discount Rate\nDecember 31, 2024\nDecember 31, 2023\nWeighted-average remaining lease term (years):\nBuilding and equipment\n6.40\n7.00\nVehicles\n2.69\n2.63\nWeighted-average discount rate:\nBuilding and equipment\n4.07\n \n%\n3.71\n \n%\nVehicles\n4.35\n \n%\n3.43\n \n%\nThe Company uses its incremental borrowing rate to determine the present value of the lease payments. \n67\nTotal lease liabilities at December 31, 2024 have scheduled maturities as follows:\nMaturity of Lease Liabilities\n2025\n$\n27.6\n \n2026\n27.9\n \n2027\n22.6\n \n2028\n18.5\n \n2029\n14.9\n \nThereafter\n35.8\n \nTotal lease payments\n147.3\n \nLess: Imputed interest\n(\n19.6\n)\nPresent value of lease liabilities\n$\n127.7\n \n68\n10.  \nCommitments and Contingencies\nWarranty costs are provided for at the time of sale. The warranty provision is based on historical costs and adjusted for specific known claims. \nA rollforward of the warranty reserve is as follows:\n2024\n2023\n2022\nBeginning balance, January 1\n$\n9.1\n \n$\n8.1\n \n$\n7.6\n \nProvision for warranties\n5.1\n \n5.8\n \n3.0\n \nClaim settlements\n(\n4.1\n)\n(\n4.7\n)\n(\n4.1\n)\nAcquisitions and divestitures\n3.6\n \n(\n0.1\n)\n0.3\n \nOther adjustments, including foreign currency translation\n(\n0.1\n)\n—\n \n1.3\n \nEnding balance, December 31\n$\n13.6\n \n$\n9.1\n \n$\n8.1\n \nThe Company and certain of its subsidiaries are involved in pending and threatened legal, regulatory and other proceedings incidental to the operation of their businesses. These proceedings may pertain to matters such as product liability or contract disputes, and may also involve governmental inquiries, inspections, audits or investigations relating to issues such as tax matters, intellectual property, environmental, health and safety issues, governmental regulations, employment and other matters. Although the results of such legal proceedings cannot be predicted with certainty, the Company believes that the ultimate disposition of these matters will not have a material adverse effect, individually or in the aggregate, on the Company’s business, financial condition, results of operations or cash flows.\n \n11.  \nShare Repurchases\nOn March 17, 2020, the Company’s Board of Directors approved an increase of $\n500.0\n million in the authorized level of repurchases of common stock. This approval is in addition to the prior repurchase authorizations of the Board of Directors of $\n300.0\n million on December 1, 2015. These authorizations have no expiration date. There were \nno\n share repurchases during 2024. During 2023, the Company repurchased a total of \n124,600\n shares at a cost of $\n24.2\n million. During 2022, the Company repurchased a total of \n795,423\n shares at a cost of $\n148.1\n million. As of December 31, 2024, the amount of share repurchase authorization remaining was $\n539.7\n million. During February 2025, the Company repurchased a total of \n256,159\n shares at a cost of $\n50.0\n million.\n12.  \nIncome Taxes\nPretax income for 2024, 2023 and 2022 was taxed in the following jurisdictions:\n2024\n2023\n2022\nU.S.\n$\n377.9\n \n$\n534.1\n \n$\n516.5\n \nForeign\n261.4\n \n226.2\n \n232.9\n \nTotal\n$\n639.3\n \n$\n760.3\n \n$\n749.4\n \n69\nThe provision (benefit) for income taxes for 2024, 2023 and 2022 was as follows:\n2024\n2023\n2022\nCurrent\nU.S.\n$\n69.0\n \n$\n103.8\n \n$\n102.8\n \nState and local\n11.6\n \n13.7\n \n14.5\n \nForeign\n73.5\n \n61.9\n \n63.9\n \nTotal current\n154.1\n \n179.4\n \n181.2\n \nDeferred\nU.S.\n(\n2.6\n)\n(\n11.1\n)\n(\n12.2\n)\nState and local\n(\n2.1\n)\n1.7\n \n(\n1.0\n)\nForeign\n(\n14.7\n)\n(\n5.3\n)\n(\n5.3\n)\nTotal deferred\n(\n19.4\n)\n(\n14.7\n)\n(\n18.5\n)\nTotal provision for income taxes\n$\n134.7\n \n$\n164.7\n \n$\n162.7\n \nDeferred tax assets (liabilities) at December 31, 2024 and 2023 were:\nDecember 31, 2024\nDecember 31, 2023\nAllowances and accruals\n$\n21.7\n \n$\n18.8\n \nEmployee and retiree benefit plans\n19.4\n \n20.9\n \nInventories\n13.9\n \n10.8\n \nForeign tax credit and other carryforwards\n20.8\n \n14.8\n \nLease liabilities\n26.4\n \n25.8\n \nRight of use assets\n(\n25.1\n)\n(\n24.7\n)\nDepreciation and amortization\n(\n311.6\n)\n(\n322.1\n)\nTaxes on undistributed foreign earnings\n(\n14.9\n)\n(\n21.0\n)\nOther\n1.0\n \n0.7\n \nTotal gross deferred tax liabilities\n(\n248.4\n)\n(\n276.0\n)\nValuation allowance\n(\n17.3\n)\n(\n14.4\n)\nTotal deferred tax liabilities, net of valuation allowances\n$\n(\n265.7\n)\n$\n(\n290.4\n)\n \nThe deferred tax assets and liabilities recognized in the Company’s Consolidated Balance Sheets as of December 31, 2024 and 2023 were:\nDecember 31, 2024\nDecember 31, 2023\nNoncurrent deferred tax asset - Other noncurrent assets\n$\n1.5\n \n$\n1.5\n \nNoncurrent deferred tax liabilities - Deferred income taxes\n(\n267.2\n)\n(\n291.9\n)\nNet deferred tax liabilities\n$\n(\n265.7\n)\n$\n(\n290.4\n)\nThe Company had prepaid income taxes, recorded within Other current assets on the Consolidated Balance Sheets, of $\n18.3\n million and $\n14.3\n million as of December 31, 2024 and 2023, respectively.\n70\nThe provision for income taxes differs from the amount calculated by applying the statutory federal income tax rate to pretax income. The calculated amount and the differences for 2024, 2023 and 2022 are shown in the following table:\n2024\n2023\n2022\nPretax income\n$\n639.3\n \n$\n760.3\n \n$\n749.4\n \nProvision for income taxes:\nComputed amount at statutory rate of 21%\n$\n134.2\n \n21.0\n \n%\n$\n159.7\n \n21.0\n \n%\n$\n157.4\n \n21.0\n \n%\nState and local income tax, net of federal tax benefit\n7.3\n \n1.1\n \n%\n12.6\n \n1.7\n \n%\n11.4\n \n1.5\n \n%\nTaxes on non-U.S. earnings, net of foreign tax credits\n6.3\n \n1.0\n \n%\n10.8\n \n1.4\n \n%\n12.4\n \n1.7\n \n%\nGlobal Intangible Low-Taxed Income\n—\n \n—\n \n%\n—\n \n—\n \n%\n2.0\n \n0.3\n \n%\nForeign-Derived Intangible Income Deduction\n(\n9.7\n)\n(\n1.5\n \n%)\n(\n11.3\n)\n(\n1.5\n \n%)\n(\n11.9\n)\n(\n1.6\n \n%)\nShare-based payments\n(\n0.7\n)\n(\n0.1\n \n%)\n(\n2.0\n)\n(\n0.3\n \n%)\n(\n2.6\n)\n(\n0.4\n \n%)\nOther\n(\n2.7\n)\n(\n0.4\n \n%)\n(\n5.1\n)\n(\n0.6\n \n%)\n(\n6.0\n)\n(\n0.8\n \n%)\nTotal provision for income taxes\n$\n134.7\n \n21.1\n \n%\n$\n164.7\n \n21.7\n \n%\n$\n162.7\n \n21.7\n \n%\nThe Company has $\n73.4\n million and $\n54.9\n million of permanently reinvested earnings of non-U.S. subsidiaries as of December 31, 2024 and 2023, respectively. No deferred U.S. income taxes have been provided on the $\n73.4\n million of earnings that are considered to be permanently reinvested. The Company does not expect these earnings to incur U.S. taxes when ultimately repatriated other than potentially U.S. federal, state and local taxes on foreign exchange gains or losses recognized on the distribution of such earnings. Such distributions could also be subject to additional foreign withholding and foreign income taxes. The amount of unrecognized deferred income tax liabilities on currently permanently reinvested earnings is estimated to be $\n11.0\n million and $\n8.2\n million as of December 31, 2024 and 2023, respectively. \nDuring the years ended December 31, 2024, 2023 and 2022, the Company repatriated $\n483.8\n million, $\n134.1\n million and $\n199.9\n million of foreign earnings, respectively. These actual distributions resulted in \nno\n incremental income tax expense other than tax impacts on foreign exchange gains or losses.\nThe Company did \nno\nt have significant unrecognized tax benefits in 2024, 2023 and 2022.\nAs of December 31, 2024, the Company has no remaining unrecognized tax benefits that would affect the Company’s effective tax rate. The tax years 2019-2023 remain open to examination by major taxing jurisdictions. Due to the potential federal, state and foreign examinations, it is reasonably possible that the Company’s gross unrecognized tax benefits balance may change. \nAs of December 31, 2024, the Company has minimal deferred tax assets on U.S., non-U.S. and U.S. state net operating loss carryforwards of $\n0.4\n million, $\n0.4\n million and $\n0.6\n million, respectively. The entire balance of net operating losses across jurisdictions, the majority of which relates to acquisitions, is available to be carried forward indefinitely. There is no valuation allowance as it is more likely than not that the net operating losses will be realized.\nAs of December 31, 2024, the Company has deferred tax assets on non-U.S. capital loss carryforwards of $\n3.1\n million with a full valuation allowance. The non-U.S. capital loss can be carried forward indefinitely. \nAs of December 31, 2024, the Company has deferred tax assets on non-U.S. disallowed interest expense carryforwards of $\n2.5\n million. The non-U.S. disallowed interest expense carryforwards are available to be carried forward indefinitely. A valuation allowance of $\n0.6\n million has been recorded to recognize only the portion of the deferred tax asset that is more likely than not to be realized.\nAs of December 31, 2024, the Company has deferred tax assets on foreign tax credit carryforwards for U.S. federal tax purposes of approximately $\n13.6\n million with a full valuation allowance. The U.S. federal foreign tax credit carryforward will expire between 2029 and 2034.\n \n71\n13.  \nBusiness Segments and Geographic Information\nIDEX has \nthree\n operating business segments, which are the same as our reportable business segments: FMT, HST and FSDP. The Company has determined its segments based on how financial information is reviewed by the chief operating decision maker (“CODM”) to analyze financial performance, make decisions and allocate resources.\nThe Company’s CODM is the Chief Executive Officer. The Company’s CODM evaluates the performance of the segments and allocates resources to them based on Adjusted EBITDA. Segment Adjusted EBITDA includes intersegment revenues as well as charges allocating certain corporate overhead costs. Intersegment sales are contracted with terms equivalent to those of an arm’s-length transaction. Adjusted EBITDA is the Company’s measure of segment performance.\nFor all segments, the CODM uses Adjusted EBITDA in the annual budgeting and forecasting process. The CODM considers Adjusted EBITDA budget and forecast-to-actual variances when making decisions about the allocation of operating and capital resources to each segment. Adjusted EBITDA is also used in determining the compensation of certain employees.\nThe FMT segment designs, produces and distributes positive displacement pumps, valves, small volume provers, flow meters, injectors and other fluid-handling pump modules and systems and provides flow monitoring and other services. FMT serves the general industrial, water and wastewater, energy, chemical, agriculture, semiconductor and food and pharmaceutical markets.\nThe HST segment designs, produces and distributes a wide range of precision fluidics, positive displacement pumps, powder and liquid processing technologies, drying systems, micro-precision components, pneumatic components and sealing solutions, high performance molded and extruded sealing components, custom mechanical and shaft seals, engineered hygienic mixers and valves, biocompatible medical devices and implantables, air compressors and blowers, optical components and coatings, laboratory and commercial equipment and precision photonic solutions, technical ceramics and hermetic sealing products and porous material structures and flow control solutions. HST serves a variety of end markets, including life sciences, general industrial, analytical instruments, semiconductor, food and pharmaceutical, energy, automotive, aerospace/defense and medical/dental markets.\nThe FSDP segment designs, produces and distributes firefighting pumps, valves and controls, rescue tools, lifting bags and other components and systems, engineered stainless steel banding and clamping devices and precision equipment for dispensing, metering and mixing colorants and paints. FSDP serves the fire suppression, paint dispensing, rescue tools, automotive, general industrial, aerospace/defense and the energy markets.\nFinancial information for the Company’s reportable business segments is presented below.  \n \nFor the Year Ended December 31, 2024\nFMT\nHST\nFSDP\nTotal Segments\nEliminations\nIDEX\nNET SALES\nExternal customers\n$\n1,231.8\n \n$\n1,294.0\n \n$\n743.0\n \n$\n3,268.8\n \n$\n— \n$\n3,268.8\n \nIntersegment sales\n1.4\n \n4.1\n \n1.3\n \n6.8\n \n(\n6.8\n)\n— \n Net sales\n1,233.2\n \n1,298.1\n \n744.3\n \n3,275.6\n \n(\n6.8\n)\n3,268.8\n \nAdjusted segment cost of sales\n(1)\n(\n639.4\n)\n(\n769.5\n)\n(\n411.9\n)\n(\n1,820.8\n)\n6.8\n \n(\n1,814.0\n)\nOther segment expenses\n(2)\n(\n187.5\n)\n(\n181.8\n)\n(\n118.2\n)\n(\n487.5\n)\nSegment Adjusted EBITDA\n406.3\n \n346.8\n \n214.2\n \n967.3\n \n72\nFor the Year Ended December 31, 2023\nFMT\nHST\nFSDP\nTotal Segments\nEliminations\nIDEX\nNET SALES\nExternal customers\n$\n1,244.2\n \n$\n1,313.5\n \n$\n716.2\n \n$\n3,273.9\n \n$\n— \n$\n3,273.9\n \nIntersegment sales\n2.9\n \n2.9\n \n2.6\n \n8.4\n \n(\n8.4\n)\n— \n Net sales\n1,247.1\n \n1,316.4\n \n718.8\n \n3,282.3\n \n(\n8.4\n)\n3,273.9\n \nAdjusted segment cost of sales\n(1)\n(\n650.1\n)\n(\n783.1\n)\n(\n400.6\n)\n(\n1,833.8\n)\n8.4\n \n(\n1,825.4\n)\nOther segment expenses\n(2)\n(\n180.9\n)\n(\n173.8\n)\n(\n109.6\n)\n(\n464.3\n)\nSegment Adjusted EBITDA\n416.1\n \n359.5\n \n208.6\n \n984.2\n \nFor the Year Ended December 31, 2022\nFMT\nHST\nFSDP\nTotal Segments\nEliminations\nIDEX\nNET SALES\nExternal customers\n$\n1,166.2\n \n$\n1,336.8\n \n$\n678.9\n \n$\n3,181.9\n \n$\n— \n$\n3,181.9\n \nIntersegment sales\n1.1\n \n2.4\n \n0.3\n \n3.8\n \n(\n3.8\n)\n— \n Net sales\n1,167.3\n \n1,339.2\n \n679.2\n \n3,185.7\n \n(\n3.8\n)\n3,181.9\n \nAdjusted segment cost of sales\n(1)\n(\n623.3\n)\n(\n738.9\n)\n(\n388.1\n)\n(\n1,750.3\n)\n3.8\n \n(\n1,746.5\n)\nOther segment expenses\n(2)\n(\n169.8\n)\n(\n188.5\n)\n(\n107.2\n)\n(\n465.5\n)\nSegment Adjusted EBITDA\n374.2\n \n411.8\n \n183.9\n \n969.9\n \n(1)\n \nAdjusted segment cost of sales represents Cost of sales excluding fair value inventory step-up charges. \n(2)\n \nOther segment expenses consists primarily of selling, general and administrative expenses.\n2024\n2023\n2022\nADJUSTED EBITDA\nFluid & Metering Technologies \n$\n406.3\n \n$\n416.1\n \n$\n374.2\n \nHealth & Science Technologies \n346.8\n \n359.5\n \n411.8\n \nFire & Safety/Diversified Products\n214.2\n \n208.6\n \n183.9\n \nSegment Adjusted EBITDA\n967.3\n \n984.2\n \n969.9\n \nCorporate and other\n(1)\n(\n93.0\n)\n(\n84.6\n)\n(\n85.7\n)\nInterest expense - net\n(\n44.5\n)\n(\n51.7\n)\n(\n40.7\n)\nDepreciation\n(\n68.5\n)\n(\n57.2\n)\n(\n50.7\n)\nAmortization of intangible assets\n(\n107.1\n)\n(\n94.9\n)\n(\n69.0\n)\nFair value inventory step-up charges\n(\n9.6\n)\n(\n1.6\n)\n(\n8.5\n)\nRestructuring expenses and asset impairments\n(\n9.3\n)\n(\n10.9\n)\n(\n4.5\n)\nNet impact from the exit of a COVID-19 testing application\n(2)\n—\n \n—\n \n1.1\n \nGain on sale of businesses - net\n4.0\n \n84.7\n \n34.8\n \nGains on sales of assets\n—\n \n—\n \n2.7\n \nCredit loss on note receivable from collaborative partner\n(3)\n—\n \n(\n7.7\n)\n—\n \nIncome before income taxes\n$\n639.3\n \n$\n760.3\n \n$\n749.4\n \n(1)\n \nCorporate expenses that can be identified with a segment have been included in determining segment results. The remainder is included in Corporate and other.\n(2)\n Represents the acceleration of previously deferred revenue of $\n17.9\n million, net of an impairment charge of $\n16.8\n million as a result of a customer’s decision to discontinue further investment in commercializing its COVID-19 testing application in the HST segment in 2022 that did not reoccur in 2023 or 2024. See \nNote 14\n, “Restructuring Expenses and Asset Impairments,” for further detail.\n73\n(3)\n Represents a reserve recorded on an investment with a collaborative partner in Other (income) expense – net during 2023. During the fourth quarter of 2023, the Company converted the promissory note receivable from the collaborative partner to equity, resulting in a cost method investment with zero value. See \nNote 3\n, “Collaborative Investments,” for further detail.\n2024\n2023\n2022\nDEPRECIATION\nFluid & Metering Technologies\n$\n17.3\n \n$\n14.1\n \n$\n16.1\n \nHealth & Science Technologies\n41.2\n \n33.2\n \n25.7\n \nFire & Safety/Diversified Products\n9.0\n \n8.9\n \n8.4\n \nTotal Segments\n67.5\n \n56.2\n \n50.2\n \nCorporate and other\n1.0\n \n1.0\n \n0.5\n \nTotal depreciation\n$\n68.5\n \n$\n57.2\n \n$\n50.7\n \nAMORTIZATION OF INTANGIBLE ASSETS\nFluid & Metering Technologies\n$\n21.1\n \n$\n22.7\n \n$\n20.8\n \nHealth & Science Technologies\n79.7\n \n65.8\n \n41.6\n \nFire & Safety/Diversified Products\n6.3\n \n6.4\n \n6.6\n \nTotal amortization\n$\n107.1\n \n$\n94.9\n \n$\n69.0\n \nCAPITAL EXPENDITURES\nFluid & Metering Technologies\n$\n14.8\n \n$\n24.2\n \n$\n25.3\n \nHealth & Science Technologies\n40.1\n \n55.1\n \n32.0\n \nFire & Safety/Diversified Products\n10.2\n \n9.7\n \n10.5\n \nTotal Segments\n65.1\n \n89.0\n \n67.8\n \nCorporate and other\n—\n \n0.9\n \n0.2\n \nTotal capital expenditures\n$\n65.1\n \n$\n89.9\n \n$\n68.0\n \nDecember 31, 2024\nDecember 31, 2023\nASSETS\nFluid & Metering Technologies\n$\n1,609.4\n \n$\n1,674.7\n \nHealth & Science Technologies\n4,142.6\n \n3,262.4\n \nFire & Safety/Diversified Products\n794.1\n \n792.6\n \nTotal Segments\n6,546.1\n \n5,729.7\n \nCorporate and other\n199.2\n \n135.5\n \nTotal assets\n$\n6,745.3\n \n$\n5,865.2\n \nInformation about the Company’s long-lived assets in different geographical regions as of December 31, 2024 and 2023 is shown below.\nDecember 31, 2024\nDecember 31, 2023\nLONG-LIVED ASSETS — PROPERTY, PLANT AND EQUIPMENT\nU.S.\n$\n271.7\n \n$\n219.2\n \nNorth America, excluding U.S.\n20.6\n \n24.0\n \nNetherlands\n51.4\n \n61.5\n \nEurope, excluding Netherlands\n71.6\n \n76.9\n \nAsia\n44.7\n \n48.3\n \nOther\n(1)\n0.4\n \n0.4\n \nTotal long-lived assets - net\n$\n460.4\n \n$\n430.3\n \n(1)\n Other includes: South America, Middle East, Australia and Africa.\n74\n14.  \nRestructuring Expenses and Asset Impairments\nFrom time to time, the Company incurs expenses to facilitate long-term sustainable growth through cost reduction actions, consisting of employee reductions, facility rationalization and contract termination costs. These costs include severance costs, exit costs and asset impairments and are included in Restructuring expenses and asset impairments in the Consolidated Statements of Income. Severance costs primarily consist of severance benefits through payroll continuation, COBRA subsidies, outplacement services, conditional separation costs and employer tax liabilities, while exit costs primarily consist of lease exit and contract termination costs.\n2024 Initiative\nDuring the year ended December 31, 2024, the Company incurred severance costs related to employee reductions in conjunction with cost mitigation efforts as a result of current market conditions and asset impairments.\nPre-tax Restructuring expenses and asset impairments by segment for the 2024 initiative were as follows:\nSeverance Costs\nExit Costs\nAsset Impairments\nTotal\nFluid & Metering Technologies\n$\n2.4\n \n$\n—\n \n$\n—\n \n$\n2.4\n \nHealth & Science Technologies\n5.8\n \n—\n \n0.1\n \n5.9\n \nFire & Safety/Diversified Products\n0.5\n \n—\n \n—\n \n0.5\n \nCorporate/Other\n0.5\n \n—\n \n—\n \n0.5\n \nTotal restructuring costs and asset impairments\n$\n9.2\n \n$\n—\n \n$\n0.1\n \n$\n9.3\n \n2023 Initiative\nDuring the year ended December 31, 2023, the Company incurred severance costs related to employee reductions in conjunction with cost mitigation efforts as a result of current market conditions, contract termination costs and asset impairments.\nPre-tax Restructuring expenses and asset impairments by segment for the 2023 initiative were as follows:\nSeverance Costs\nExit Costs\nAsset Impairments\nTotal \nFluid & Metering Technologies\n$\n1.5\n \n$\n0.6\n \n$\n0.8\n \n$\n2.9\n \nHealth & Science Technologies\n6.4\n \n0.2\n \n—\n \n6.6\n \nFire & Safety/Diversified Products\n0.7\n \n0.2\n \n—\n \n0.9\n \nCorporate/Other\n0.5\n \n—\n \n—\n \n0.5\n \nTotal restructuring costs and asset impairments\n$\n9.1\n \n$\n1.0\n \n$\n0.8\n \n$\n10.9\n \n2022 Initiative\nDuring the year ended December 31, 2022, the restructuring costs incurred by the Company primarily related to asset impairments. In addition, the Company also incurred severance costs related to employee reductions.  \nIn the second quarter of 2020, the Company engaged in the development of a COVID-19 testing application with a customer at one of the Company’s businesses in the HST segment. As part of this contract, the customer fully funded the $\n28.7\n million investment needed to complete the development and production of microfluidic cartridges during 2020 and 2021. The costs incurred by the Company were primarily recorded as Property, plant and equipment – net in the Consolidated Balance Sheets and were being depreciated over the expected life of the assets, while the reimbursement was recorded as Deferred revenue in the Consolidated Balance Sheets and was being recognized as units were shipped.\nIn the third quarter of \n2022\n, the Company was informed by the customer of its decision to discontinue further investment in commercializing its COVID-19 testing application. This event was deemed a triggering event, which required an interim impairment test be performed on the property, plant and equipment related to this contract, resulting in an impairment charge of $\n16.8\n million that was recorded as \nRestructuring expenses\n and asset impairments in the Consolidated Statements of Income during the year ended December 31,\n 2022\n. In addition, the Company accelerated previously deferred revenue of $\n17.9\n million \n75\nrelated to units that are no longer expected to be shipped and recorded it as Net sales in the Consolidated Statements of Income during the year ended December 31, \n2022\n.\nPre-tax \nRestructuring expenses and asset impairments\n by segment for the 2022 initiative were as follows:\nSeverance Costs\nExit Costs\nAsset Impairments\nTotal\nFluid & Metering Technologies\n$\n1.9\n \n$\n0.3\n \n$\n0.5\n \n$\n2.7\n \nHealth & Science Technologies\n1.2\n \n—\n \n16.8\n \n18.0\n \nFire & Safety/Diversified Products\n1.7\n \n—\n \n0.1\n \n1.8\n \nCorporate/Other\n0.3\n \n—\n \n—\n \n0.3\n \nTotal restructuring costs and asset impairments\n$\n5.1\n \n$\n0.3\n \n$\n17.4\n \n$\n22.8\n \nRestructuring accruals reflected in Accrued expenses in the Company’s Consolidated Balance Sheets are as follows:\nRestructuring\nInitiatives\nBalance at January 1, 2023\n$\n1.4\n \nRestructuring expenses\n(1)\n10.1\n \nPayments, utilization and other\n(\n9.4\n)\nBalance at December 31, 2023\n2.1\n \nRestructuring expenses\n(2)\n9.2\n \nPayments, utilization and other\n(\n10.4\n)\nBalance at December 31, 2024\n$\n0.9\n \n(1)\n \nExcludes $\n0.8\n million of asset impairments related to property, plant and equipment.\n(2)\n \nExcludes $\n0.1\n million of asset impairments related to property, plant and equipment.\n15.  \nShare-Based Compensation\nThe Company maintains \ntwo\n share-based compensation plans for executives, non-employee directors and certain key employees that authorize the granting of restricted stock, performance share units and stock options and other types of awards consistent with the purpose of the plans. The number of shares authorized for issuance under the Company’s plans as of December 31, 2024 totaled \n9.9\n million, of which \n9.7\n million shares were available for future issuance. \nThe Company typically grants equity awards annually at its regularly scheduled first quarter meeting of the Board of Directors based on the recommendation from the Compensation Committee.\nThe Company’s policy is to recognize compensation cost on a straight-line basis, assuming forfeitures, over the requisite service period for the entire award. Classification of share-based compensation cost within the Consolidated Statements of Income is consistent with the classification of cash compensation for the same employees.\nStock Options\nStock options granted under the Company’s plans are generally non-qualified and are granted\n \nwith an exercise price equal to the market price of the Company’s stock on the date of grant. The fair value of each option grant was estimated on the date of the grant using the Black Scholes valuation model. Stock options generally vest ratably over \nfour years\n, with vesting beginning one year from the date of grant, and generally expire \n10\n years from the date of grant. The service period for certain retiree \n76\neligible participants is accelerated. \nWeighted average stock option fair values and assumptions for the years ended December 31, 2024, 2023 and 2022 are disclosed below:\n \nYears Ended December 31,\n \n2024\n2023\n2022\nWeighted average fair value of grants\n$\n63.61\n$\n59.77\n$\n42.66\nDividend yield\n1.09\n%\n1.09\n%\n1.14\n%\nVolatility\n26.66\n%\n27.14\n%\n25.23\n%\nRisk-free interest rate\n4.31\n%\n4.15\n%\n2.01\n%\nExpected life (in years)\n4.60\n4.50\n4.90\nThe assumptions were determined as follows:\n•\nThe Company estimated volatility using its historical share price performance over the expected life of the option.\n•\nThe Company uses historical data to estimate the expected life of the option based on IDEX’s own exercise and cancellation history adjusted for current vesting schedules. \n•\nThe risk-free interest rate is based on the U.S. Treasury yield curve commensurate with the expected life of the option. The Company presents the spot rate used in the Black Scholes valuation model.\n•\nThe expected dividend yield is based on the Company’s current dividend yield as the best estimate of projected dividend yield for periods within the contractual life of the option.\nA summary of the Company’s stock option activity as of December 31, 2024, and changes during the year ended December 31, 2024, are presented in the following table:\nShares\nWeighted\nAverage Exercise Price\nWeighted-Average\nRemaining\nContractual Term\n(years)\nAggregate\nIntrinsic\nValue\nStock Options\nOutstanding at January 1, 2024\n983,267\n \n$\n178.86\n \n6.88\n$\n39.3\n \nGranted\n196,870\n \n234.55\n \nExercised\n(\n128,164\n)\n151.50\n \nForfeited\n(\n53,117\n)\n204.95\n \nOutstanding at December 31, 2024\n998,856\n \n$\n191.96\n \n6.63\n$\n24.9\n \nVested and expected to vest at December 31, 2024\n969,789\n \n$\n191.03\n \n6.57\n$\n24.8\n \nExercisable at December 31, 2024\n556,562\n \n$\n170.62\n \n5.35\n$\n22.5\n \nThe intrinsic value for stock options outstanding and exercisable is defined as the difference between the market value of the Company’s common stock as of the end of the period and the grant price. The total intrinsic value of options exercised in 2024, 2023 and 2022 was $\n9.6\n million, $\n14.9\n million and $\n17.4\n million, respectively. In 2024, 2023 and 2022, cash received from options exercised was $\n19.4\n million, $\n26.3\n million and $\n19.3\n million, respectively, while the actual tax benefit realized for the tax deductions from stock options exercised totaled $\n2.0\n million, $\n3.1\n million and $\n3.7\n million, respectively.\nAs of December 31, 2024, there was $\n9.6\n million of total unrecognized compensation cost related to stock options that is expected to be recognized over a weighted-average period of \n1.4\n years.\nRestricted Stock\nRestricted stock awards generally cliff vest after \nthree years\n for employees and non-employee directors. The service period for certain retiree eligible participants is accelerated. Unvested restricted stock granted prior to the adoption of the 2024 Incentive Award Plan earn and are paid dividends. Unvested restricted stock granted after the adoption of the 2024 Incentive Award Plan earn dividend equivalents for the award period, which will be paid to the participants upon vesting of the underlying awards. The sale of the shares is restricted prior to the date of vesting. The fair value of restricted stock is equal to the market price of the Company’s stock at the date of the grant. \nA summary of the Company’s restricted stock activity as of December 31, 2024, and changes during the year ended December 31, 2024, are presented in the following table:\n77\nRestricted Stock\nShares\nWeighted-Average\nGrant Date Fair\nValue\nUnvested at January 1, 2024\n112,891\n \n$\n193.03\n \nGranted\n103,070\n \n211.90\n \nVested\n(\n24,275\n)\n201.61\n \nForfeited\n(\n15,695\n)\n211.29\n \nUnvested at December 31, 2024\n175,991\n \n$\n201.27\n \nAs of December 31, 2024, there was $\n15.4\n million of total unrecognized compensation cost related to restricted stock that is expected to be recognized over a weighted-average period of \n1.1\n years.\nCash-Settled Restricted Stock\nThe Company also maintains a cash-settled share-based compensation plan for certain employees. Cash-settled restricted stock awards generally cliff vest after \nthree years\n. The service period for certain retiree eligible participants is accelerated. Cash-settled restricted stock awards are recorded at fair value on a quarterly basis using the market price of the Company’s stock on the last day of the quarter. At December 31, 2024 and 2023, the Company has accrued $\n4.0\n million and $\n4.2\n million, respectively, for cash-settled restricted stock in Accrued expenses in the Consolidated Balance Sheets and has accrued $\n2.4\n million and $\n2.9\n million, respectively, for cash-settled restricted stock in Other noncurrent liabilities in the Consolidated Balance Sheets. These recurring fair value measurements are classified as Level 1 in the fair value hierarchy. Dividend equivalents are paid on certain cash-settled restricted stock awards granted prior to the adoption of the 2024 Incentive Award Plan. Dividend equivalents are earned throughout the award period and paid upon vesting of the underlying award for certain cash-settled restricted stock awards granted after the adoption of the 2024 Incentive Award Plan. \nA summary of the Company’s unvested cash-settled restricted stock activity as of December 31, 2024, and changes during the year ended December 31, 2024, are presented in the following table:\nCash-Settled Restricted Stock\nShares\nWeighted-Average\nFair Value\nUnvested at January 1, 2024\n56,655\n \n$\n217.11\n \nGranted\n23,655\n \n229.79\n \nVested\n(\n17,230\n)\n234.02\n \nForfeited\n(\n7,685\n)\n209.29\n \nUnvested at December 31, 2024\n55,395\n \n$\n209.29\n \nAs of December 31, 2024, there was $\n4.0\n million of total unrecognized compensation cost related to cash-settled restricted stock that is expected to be recognized over a weighted-average period of \n1.0\n year.\nPerformance Share Units\nBeginning in 2013, the Company granted performance share units to selected key employees that may be earned based on IDEX total shareholder return over the \nthree-year\n period following the date of grant. Performance share units are expected to be made annually and are paid out at the end of a \nthree-year\n period based on the Company’s performance. Performance is measured by determining the percentile rank of the total shareholder return of IDEX common stock in relation to the total shareholder return of companies in the S&P 500 Index for the \nthree-year\n period following the date of grant. The payment of awards following the \nthree-year\n award period will be based on performance achieved in accordance with the scale set forth in the plan agreement and may range from \n0\n percent to \n250\n percent of the initial grant. A target payout of \n100\n percent is earned if total shareholder return is equal to the 50\nth\n percentile of the peer group. Performance share units earn dividend equivalents for the award period, which will be paid to participants with the award payout at the end of the period based on the actual number of performance share units that are earned. Payments made at the end of the award period will be in the form of stock for performance share units and will be in cash for dividend equivalents. The performance share units are market condition awards, which are assessed at fair value on the date of grant using a Monte Carlo simulation model and are expensed ratably over the \nthree-year\n term of the awards. \n78\nWeighted average performance share unit fair values and assumptions for the years ended December 31, 2024, 2023 and 2022 are disclosed below:\nYears Ended December 31,\n \n2024\n2023\n2022\nWeighted average fair value of grants\n$\n349.59\n$\n308.18\n$\n235.54\nDividend yield\n—\n%\n—\n%\n—\n%\nVolatility\n22.23\n%\n27.00\n%\n28.09\n%\nRisk-free interest rate\n4.45\n%\n4.37\n%\n1.73\n%\nExpected life (in years)\n2.94\n2.94\n2.93\nThe assumptions were determined as follows:\n•\nThe Company estimated volatility using its historical share price performance over the remaining performance period as of the grant date.\n•\nThe Company uses a Monte Carlo simulation model that uses an expected life commensurate with the performance period. As a result, the expected life of the performance share units was assumed to be the period from the grant date to the end of the performance period.\n•\nThe risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of grant with a term commensurate with the remaining performance period.\n•\nTotal Shareholder Return is determined assuming that dividends are reinvested in the issuing entity over the performance period, which is mathematically equivalent to utilizing a \n0\n% dividend yield.\nA summary of the Company’s performance share unit activity as of December 31, 2024, and changes during the year ended December 31, 2024, are presented in the following table:\nPerformance Share Units\nShares\nWeighted-Average\nGrant Date Fair\nValue\nUnvested at January 1, 2024\n67,455\n \n$\n265.15\n \nGranted\n27,135\n \n349.59\n \nVested\n(\n9,606\n)\n245.40\n \nForfeited\n(\n12,159\n)\n258.61\n \nUnvested at December 31, 2024\n72,825\n \n$\n299.87\n \n The performance period for the 2021 grants ended as of January 31, 2024. The 2021 grants achieved a \n50\n% payout factor and the Company issued \n9,606\n common shares in February 2024 for awards that vested in 2024. The performance period for the 2022 grants ended as of January 31, 2025. The 2022 grants achieved a \n65\n% payout factor and the Company issued \n15,530\n common shares in February 2025 for awards that vested in 2025.\nAs of December 31, 2024, there was $\n3.2\n million of total unrecognized compensation cost related to performance share units that is expected to be recognized over a weighted-average period of \n1.0\n year.\n79\nSummary of Share-Based Compensation Expense\nTotal compensation cost related to all share-based awards was as follows: \nYears Ended December 31, \n2024\n2023\n2022\nStock options expense\n$\n9.8\n \n$\n9.9\n \n$\n9.2\n \nRestricted stock expense\n8.3\n \n5.7\n \n6.7\n \nCash-settled restricted stock expense\n3.4\n \n3.4\n \n2.7\n \nPerformance share units expense\n7.7\n \n6.0\n \n6.0\n \nTotal pre-tax share-based compensation expense\n(1)\n29.2\n \n25.0\n \n24.6\n \nIncome tax benefit\n(\n3.2\n)\n(\n2.7\n)\n(\n2.4\n)\nTotal share-based compensation expense, net of income taxes\n$\n26.0\n \n$\n22.3\n \n$\n22.2\n \n(1)\n Pre-tax compensation cost is recognized in both Cost of sales and Selling, general and administrative expenses in the Consolidated Statements of Income depending on the functional area of the underlying employees. Pre-tax compensation expense of $\n1.6\n million, $\n1.4\n million and $\n0.9\n million was recognized in Cost of sales in the Consolidated Statements of Income during the years ended December 31, 2024, 2023 and 2022, respectively. Pre-tax compensation expense of $\n27.6\n million, $\n23.6\n million, and $\n23.7\n million was recognized in Selling, general and administrative expenses in the Consolidated Statements of Income during the years ended December 31, 2024, 2023 and 2022, respectively.\n80\n16.  \nAccumulated Other Comprehensive Loss\nThe components of Accumulated other comprehensive loss for the years ended December 31, 2024, 2023 and 2022 are as follows:\nCumulative Translation Adjustment\nPension and Other Postretirement Adjustments\nAccumulated Other Comprehensive Loss\nBalance, January 1, 2022\n(1)\n$\n(\n62.2\n)\n$\n(\n7.4\n)\n$\n(\n69.6\n)\nOther comprehensive (loss) income before reclassification adjustments\n(\n74.9\n)\n24.6\n \n(\n50.3\n)\nLoss reclassified from Accumulated other comprehensive loss\n(2)(3)\n—\n \n0.5\n \n0.5\n \nTax impact\n—\n \n(\n6.8\n)\n(\n6.8\n)\nNet other comprehensive (loss) income\n(1)\n(\n74.9\n)\n18.3\n \n(\n56.6\n)\nBalance, December 31, 2022\n(1)\n$\n(\n137.1\n)\n$\n10.9\n \n$\n(\n126.2\n)\nOther comprehensive income (loss) before reclassification adjustments\n87.8\n \n(\n8.2\n)\n79.6\n \nGain reclassified from Accumulated other comprehensive loss\n(2)(3)\n—\n \n(\n1.5\n)\n(\n1.5\n)\nTax impact\n—\n \n2.3\n \n2.3\n \nNet other comprehensive income (loss)\n(1)\n87.8\n \n(\n7.4\n)\n80.4\n \nBalance, December 31, 2023\n(1)\n$\n(\n49.3\n)\n$\n3.5\n \n$\n(\n45.8\n)\nOther comprehensive (loss) income before reclassification adjustments\n(\n93.7\n)\n4.8\n \n(\n88.9\n)\nGain reclassified from Accumulated other comprehensive loss\n(2)(3)\n—\n \n(\n1.0\n)\n(\n1.0\n)\nAmounts reclassified related to divestitures\n(4)\n5.5\n \n—\n \n5.5\n \nTax impact\n—\n \n(\n0.7\n)\n(\n0.7\n)\nNet other comprehensive (loss) income\n(1)\n(\n88.2\n)\n3.1\n \n(\n85.1\n)\nBalance, December 31, 2024\n(1)\n$\n(\n137.5\n)\n$\n6.6\n \n$\n(\n130.9\n)\n(1)\n Amounts are presented net of tax. \n(2)\n Included in the computation of net periodic cost (benefit). See \nNote 1\n7\n, “Retirement Benefits.”\n(3)\n Included in Other (income) expense – net in the Consolidated Statements of Income.\n(4)\n In conjunction with the divestiture of Alfa Valvole during the second quarter of 2024, the Company released\nassociated cumulative foreign currency translation losses and included the release as part of the gain on sale of business.\n17.  \nRetirement Benefits\nThe Company sponsors several qualified and nonqualified defined benefit and defined contribution pension plans as well as other post-retirement plans for its employees. The Company uses a measurement date of December 31 for its defined benefit pension plans and post-retirement medical plans. The Company employs the measurement date provisions of ASC 715, \nCompensation-Retirement Benefits\n, which require the measurement date of plan assets and liabilities to coincide with the sponsor’s year end.\n81\nThe following table provides a reconciliation of the changes in the benefit obligation and fair value of plan assets over the periods described below:\n \nPension Benefits\nOther Benefits\n \n2024\n2023\n2024\n2023\n \nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\n \n \nCHANGE IN BENEFIT OBLIGATION\nObligation at January 1\n$\n8.9\n \n$\n88.5\n \n$\n8.3\n \n$\n75.7\n \n$\n17.2\n \n$\n16.4\n \nService cost\n0.1\n \n1.5\n \n0.1\n \n1.2\n \n0.5\n \n0.4\n \nInterest cost\n0.4\n \n2.6\n \n0.4\n \n2.8\n \n0.8\n \n0.8\n \nBenefits paid\n(\n0.8\n)\n(\n2.2\n)\n(\n0.7\n)\n(\n1.4\n)\n(\n0.8\n)\n(\n0.9\n)\nActuarial (gain) loss\n(\n0.3\n)\n0.3\n \n0.4\n \n6.2\n \n(\n0.7\n)\n0.5\n \nCurrency translation\n—\n \n(\n5.3\n)\n—\n \n5.2\n \n(\n0.2\n)\n—\n \nSettlements\n—\n \n(\n2.5\n)\n—\n \n(\n3.0\n)\n—\n \n—\n \nAcquisition/Divestiture\n—\n \n0.9\n \n—\n \n1.0\n \n—\n \n—\n \nParticipant contributions\n—\n \n0.9\n \n—\n \n0.9\n \n—\n \n—\n \nOther\n—\n \n(\n0.1\n)\n0.4\n \n(\n0.1\n)\n—\n \n—\n \nObligation at December 31\n$\n8.3\n \n$\n84.6\n \n$\n8.9\n \n$\n88.5\n \n$\n16.8\n \n$\n17.2\n \nCHANGE IN PLAN ASSETS\nFair value of plan assets at January 1\n$\n4.3\n \n$\n41.7\n \n$\n4.7\n \n$\n37.8\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n0.2\n \n6.2\n \n(\n0.3\n)\n0.9\n \n—\n \n—\n \nEmployer contributions\n0.4\n \n3.4\n \n0.4\n \n3.3\n \n0.8\n \n0.9\n \nBenefits paid\n(\n0.8\n)\n(\n2.2\n)\n(\n0.7\n)\n(\n1.4\n)\n(\n0.8\n)\n(\n0.9\n)\nCurrency translation\n—\n \n(\n2.3\n)\n—\n \n3.2\n \n—\n \n—\n \nSettlements\n—\n \n(\n2.5\n)\n—\n \n(\n3.0\n)\n—\n \n—\n \nParticipant contributions\n—\n \n0.9\n \n—\n \n0.9\n \n—\n \n—\n \nOther\n—\n \n(\n0.1\n)\n0.2\n \n—\n \n—\n \n—\n \nFair value of plan assets at December 31\n$\n4.1\n \n$\n45.1\n \n$\n4.3\n \n$\n41.7\n \n$\n—\n \n$\n—\n \nFunded status at December 31\n$\n(\n4.2\n)\n$\n(\n39.5\n)\n$\n(\n4.6\n)\n$\n(\n46.8\n)\n$\n(\n16.8\n)\n$\n(\n17.2\n)\nCOMPONENTS ON THE CONSOLIDATED BALANCE SHEETS\nOther noncurrent assets\n$\n—\n \n$\n2.1\n \n$\n—\n \n$\n1.5\n \n$\n—\n \n$\n—\n \nAccrued expenses\n(\n0.7\n)\n(\n1.8\n)\n(\n0.7\n)\n(\n1.7\n)\n(\n1.1\n)\n(\n1.1\n)\nOther noncurrent liabilities\n(\n3.5\n)\n(\n39.8\n)\n(\n3.9\n)\n(\n46.6\n)\n(\n15.7\n)\n(\n16.1\n)\nNet asset (liability) at December 31\n$\n(\n4.2\n)\n$\n(\n39.5\n)\n$\n(\n4.6\n)\n$\n(\n46.8\n)\n$\n(\n16.8\n)\n$\n(\n17.2\n)\nThe pension benefits actuarial gains and losses in 2024 net to \nzero\n. The impact of the decrease in discount rates from 2023 to 2024 for the non-U.S. pension schemes was offset by lower inflation in the Eurozone. The U.S. pension actuarial gains generated due to the increase in the discount rates from 2023 to 2024. The larger than expected asset returns have resulted in a net gain on the balance sheet.\nThe other benefits actuarial gain in 2024 was primarily driven by the increase in the discount rates from 2023 to 2024 with additional gains from updated participant data for the U.S. plans, partially offset by losses from the updated health care trend and claim cost assumptions.\nThe accumulated benefit obligation for all defined benefit pension plans was $\n89.4\n million and $\n94.6\n million at December 31, 2024 and 2023, respectively.\nThe weighted average assumptions used in the measurement of the Company’s benefit obligation at December 31, 2024 and 2023 were as follows:\n82\n \nU.S. Plans\nNon-U.S. Plans\nOther Benefits\n \n2024\n2023\n2024\n2023\n2024\n2023\nDiscount rate\n5.41\n \n%\n4.93\n \n%\n2.91\n \n%\n3.01\n \n%\n5.40\n \n%\n4.90\n \n%\nRate of compensation increase\nN/A\nN/A\n2.38\n \n%\n2.55\n \n%\nN/A\nN/A\nCash balance interest credit rate\nN/A\nN/A\n1.25\n \n%\n1.43\n \n%\nN/A\nN/A\nThe pretax amounts recognized in Accumulated other comprehensive loss on the Consolidated Balance Sheets as of December 31, 2024 and 2023 were as follows:\n \nPension Benefits\nOther Benefits\n \n2024\n2023\n2024\n2023\n \nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\n \n \nPrior service cost (credit)\n$\n0.1\n \n$\n(\n0.3\n)\n$\n0.2\n \n$\n(\n0.4\n)\n$\n(\n0.2\n)\n$\n(\n0.3\n)\nNet loss (gain)\n2.3\n \n(\n1.8\n)\n2.7\n \n1.8\n \n(\n8.4\n)\n(\n8.6\n)\nTotal\n$\n2.4\n \n$\n(\n2.1\n)\n$\n2.9\n \n$\n1.4\n \n$\n(\n8.6\n)\n$\n(\n8.9\n)\nThe components of the net periodic cost (benefit) for the plans in 2024, 2023 and 2022 are as follows:\n \nPension Benefits\n \n2024\n2023\n2022\n \nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\nService cost\n$\n0.1\n \n$\n1.5\n \n$\n0.1\n \n$\n1.2\n \n$\n0.1\n \n$\n1.8\n \nInterest cost\n0.4\n \n2.6\n \n0.4\n \n2.8\n \n0.2\n \n1.0\n \nExpected return on plan assets\n(\n0.3\n)\n(\n1.8\n)\n(\n0.2\n)\n(\n1.6\n)\n(\n0.2\n)\n(\n1.3\n)\nSettlement gain recognized\n—\n \n(\n0.3\n)\n—\n \n(\n0.1\n)\n—\n \n—\n \nNet amortization\n0.3\n \n(\n0.1\n)\n0.1\n \n(\n0.6\n)\n0.3\n \n0.6\n \nNet periodic cost \n$\n0.5\n \n$\n1.9\n \n$\n0.4\n \n$\n1.7\n \n$\n0.4\n \n$\n2.1\n \n \n \nOther Benefits\n \n2024\n2023\n2022\nService cost\n$\n0.5\n \n$\n0.4\n \n$\n0.7\n \nInterest cost\n0.8\n \n0.8\n \n0.5\n \nNet amortization\n(\n0.9\n)\n(\n0.9\n)\n(\n0.5\n)\nNet periodic cost\n$\n0.4\n \n$\n0.3\n \n$\n0.7\n \nThe Company recognizes the service cost component in both Cost of sales and Selling, general and administrative expenses in the Consolidated Statements of Income depending on the functional area of the underlying employees. All other components of net periodic cost (benefit) are recorded in Other (income) expense – net in the Consolidated Statements of Income. \nThe assumptions used in determining the net periodic cost (benefit) were as follows:\n \nU.S. Plans\nNon-U.S. Plans\n \n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n4.93\n \n%\n5.17\n \n%\n2.52\n \n%\n3.01\n \n%\n3.75\n \n%\n1.25\n \n%\nExpected return on plan assets\n5.40\n \n%\n4.65\n \n%\n2.63\n \n%\n4.37\n \n%\n4.17\n \n%\n2.87\n \n%\nRate of compensation increase\nN/A\nN/A\nN/A\n2.55\n \n%\n2.44\n \n%\n2.31\n \n%\n83\n \nOther Benefits\n \n2024\n2023\n2022\nDiscount rate\n4.90\n \n%\n5.21\n \n%\n2.70\n \n%\nExpected return on plan assets\nN/A\nN/A\nN/A\nRate of compensation increase\nN/A\nN/A\nN/A\nThe pretax change recognized in Accumulated other comprehensive loss on the Consolidated Balance Sheet in 2024 is as follows:\n \nPension Benefits\nOther\nBenefits\n \nU.S.\nNon-U.S.\nNet gain in current year\n$\n0.2\n \n$\n4.1\n \n$\n0.7\n \nPrior service credit\n—\n \n0.1\n \n—\n \nAmortization of prior service credit\n—\n \n(\n0.1\n)\n(\n0.1\n)\nAmortization of net loss (gain) \n0.3\n \n—\n \n(\n0.8\n)\nSettlement gain recognized\n—\n \n(\n0.3\n)\n—\n \nExchange rate effect on amounts in other comprehensive income\n—\n \n(\n0.2\n)\n(\n0.1\n)\nTotal\n$\n0.5\n \n$\n3.6\n \n$\n(\n0.3\n)\nThe discount rates for the Company’s plans are derived by matching the plan’s cash flows to a yield curve that provides the equivalent yields on zero-coupon bonds for each maturity. The discount rate selected is the rate that produces the same present value of cash flows. \nIn selecting the expected rate of return on plan assets, the Company considers the historical returns and expected returns on plan assets. The expected returns are evaluated using asset return class, variance and correlation assumptions based on the plan’s target asset allocation and current market conditions. \nPrior service costs are amortized on a straight-line basis over the average remaining service period of active participants. Gains and losses in excess of \n10\n% of the greater of the benefit obligation or the market value of assets are amortized over the average remaining service period of active participants.\nFor measurement purposes, a \n6.86\n% weighted average annual rate of increase in the per capita cost of covered health care benefits was assumed for 2024. The rate was assumed to decrease gradually each year to a rate of \n4.00\n% for \n2047\n and remain at that level thereafter. \nCosts of defined contribution plans were $\n17.4\n million, $\n16.8\n million and $\n16.1\n million for 2024, 2023 and 2022, respectively.\nThe Company, through its subsidiaries, participates in a multi-employer pension plan covering approximately \n213\n participants under U.S. collective bargaining agreements. None of these plans are considered individually significant to the Company as contributions to these plans totaled $\n1.0\n million, $\n0.9\n million, and $\n0.8\n million for 2024, 2023 and 2022, respectively.\n \n84\nPlan Assets \nThe Company’s pension plan weighted average asset allocations at December 31, 2024 and 2023, by asset category, were as follows:\nU.S. Plans\nNon-U.S. Plans\n2024\n2023\n2024\n2023\nEquity securities\n9\n \n%\n9\n \n%\n1\n \n%\n10\n \n%\nFixed income securities\n79\n \n%\n79\n \n%\n25\n \n%\n22\n \n%\nCash/Commingled Funds/Other\n(1)\n12\n \n%\n12\n \n%\n74\n \n%\n68\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n100\n \n%\nThe basis used to measure the defined benefit plans’ assets at fair value at December 31, 2024 and 2023 is summarized as follows:\n \nBasis of Fair Value Measurement\n \nOutstanding\nBalances\nLevel 1\nLevel 2\nLevel 3\nAs of December 31, 2024\nEquity\nU.S. Large Cap\n$\n0.2\n \n$\n0.2\n \n$\n—\n \n$\n—\n \nU.S. Small / Mid Cap\n—\n \n—\n \n—\n \n—\n \nInternational\n0.8\n \n0.8\n \n—\n \n—\n \nFixed Income\nU.S. Intermediate\n2.5\n \n—\n \n2.5\n \n—\n \nU.S. Long Term\n3.1\n \n—\n \n3.1\n \n—\n \nU.S. High Yield\n0.7\n \n—\n \n0.7\n \n—\n \nInternational\n8.2\n \n0.2\n \n8.0\n \n—\n \nOther Commingled Funds\n(1)\n30.0\n \n—\n \n—\n \n30.0\n \nCash and Equivalents\n2.1\n \n2.1\n \n—\n \n—\n \nOther\n1.7\n \n—\n \n1.7\n \n—\n \n$\n49.3\n \n$\n3.3\n \n$\n16.0\n \n$\n30.0\n \n \n(1)\nOther commingled funds represent pooled institutional investments in non-U.S. plans.\n85\n \nBasis of Fair Value Measurement\n \nOutstanding\nBalances\nLevel 1\nLevel 2\nLevel 3\nAs of December 31, 2023\nEquity\nU.S. Large Cap\n$\n0.2\n \n$\n0.2\n \n$\n—\n \n$\n—\n \nU.S. Small / Mid Cap\n2.1\n \n—\n \n2.1\n \n—\n \nInternational\n2.4\n \n0.8\n \n1.6\n \n—\n \nFixed Income\nU.S. Intermediate\n2.5\n \n—\n \n2.5\n \n—\n \nU.S. Long Term\n3.3\n \n—\n \n3.3\n \n—\n \nU.S. High Yield\n0.5\n \n—\n \n0.5\n \n—\n \nInternational\n6.4\n \n0.2\n \n6.2\n \n—\n \nOther Commingled Funds\n(1)\n25.8\n \n—\n \n—\n \n25.8\n \nCash and Equivalents\n1.1\n \n0.6\n \n0.5\n \n—\n \nOther\n1.7\n \n—\n \n1.7\n \n—\n \n$\n46.0\n \n$\n1.8\n \n$\n18.4\n \n$\n25.8\n \n(1)\nOther commingled funds represent pooled institutional investments in non-U.S. plans.\nEquities that are valued using quoted prices are valued at the published market prices. Equities in a common collective trust or a registered investment company that are valued using significant other observable inputs are valued at the net asset value (“NAV”) provided by the fund administrator. The NAV is based on the value of the underlying assets owned by the fund minus its liabilities. Fixed income securities that are valued using significant other observable inputs are valued at prices obtained from independent financial service industry-recognized vendors.\nInvestment Policies and Strategies \nThe investment objective of the U.S. plan, consistent with prudent standards for preservation of capital and maintenance of liquidity, is to earn the highest possible total rate of return consistent with the plan’s tolerance for risk. The general asset allocation guidelines for plan assets are that “equities” will constitute \n10\n% and “fixed income” obligations, including cash, will constitute \n90\n% of the market value of total fund assets. \nThe investment objective of the UK plan, consistent with prudent standards for preservation of capital and maintenance of liquidity, is to earn a target return of UK Gilts plus approximately \n1.3\n% per year. The general asset allocation guidelines for plan assets are that “fixed income” obligations, including cash, will constitute \n100\n% of the market value of total fund assets.\nThe term “equities” includes common stock, while the term “fixed income” includes obligations with contractual payments and a specific maturity date. Diversification of assets is employed to ensure that adverse performance of one security or security class does not have an undue detrimental impact on the portfolio as a whole. Diversification is interpreted to include diversification by type, characteristic and number of investments as well as by investment style of designated investment fund managers. No restrictions are placed on the selection of individual investments by the investment fund managers. The total fund performance and the performance of the investment fund managers is reviewed on a regular basis using an appointed professional independent advisor. As of December 31, 2024, there were \nno\n shares of the Company’s stock held in plan assets.\nCash Flows\nThe Company expects to contribute approximately $\n3.7\n million to its defined benefit plans and $\n1.1\n million to its other postretirement benefit plans in 2025. The Company also expects to contribute approximately $\n17.1\n million to its defined contribution plan in 2025 using cash on hand.\n86\nEstimated Future Benefit Payments\nThe future estimated benefit payments for the next five years and the five years thereafter are as follows: \nEstimated Future Benefits\n2025\n$\n7.4\n \n2026\n6.5\n \n2027\n6.8\n \n2028\n6.5\n \n2029\n7.0\n \n2030 to 2034\n32.2\n \n \n18.    \nSubsequent Events\nDuring the first quarter of 2025, the Company initiated organizational changes, primarily designed to connect scalable groups of businesses and strategically shift away from strictly vertical organizations towards more efficient horizontal frameworks. Additionally, we eliminated layers in select areas. These changes are expected to enable the Company to self-fund more growth resources, increase sourcing productivity, improve agility and speed of decision making and position the Company closer to the customer for maximum impact. These actions are expected to result in approximately $\n21\n million to $\n25\n million of restructuring charges for severance related to employee reductions in 2025.\n \n87\nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.\n \nItem 9A.    Controls and Procedures.\nThe Company maintains disclosure controls and procedures that are designed to ensure that information required to be disclosed in the Company’s Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to the Company’s management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nAs required by SEC Rule 13a-15(b), the Company carried out an evaluation, under the supervision and with the participation of the Company’s management, including the Company’s Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Company’s disclosure controls and procedures as of the end of the period covered by this report. Based on the foregoing, the Company’s Chief Executive Officer and Chief Financial Officer concluded that the Company’s disclosure controls and procedures were effective as of December 31, 2024.\nManagement’s Report on Internal Control Over Financial Reporting appearing on page \n36\n of this report is incorporated into this Item 9A by reference.\nThere has been no change in the Company’s internal control over financial reporting during the Company’s most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, the Company’s internal control over financial reporting.\n \nItem 9B.    Other Information.\nDuring the year ended December 31, 2024, none of the Company’s directors or executive officers \nadopted\n or \nterminated\n any contract, instruction or written plan for the purchase or sale of Company securities that was intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) or any “non-Rule 10b5-1 trading arrangement” as defined in Item 408 of Regulation S-K under the Securities Exchange Act of 1934, as amended.\nItem 9C. \n \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\n88\nPART III\nItem 10.        Directors, Executive Officers and Corporate Governance.\nInformation under the headings “Election of Directors”; “Board Committees”; and “Corporate Governance” in the 2025 Proxy Statement is incorporated into this Item 10 by reference. Information regarding executive officers of the Company is located in Part I, \nItem 1\n, of this report under the caption “Information about Our Executive Officers.”\nThe Company has adopted a Code of Business Conduct and Ethics applicable to the Company’s directors, officers (including the Company’s principal executive officer, principal financial officer and principal accounting officer) and employees. The Code of Business Conduct and Ethics, along with the Audit Committee Charter, Nominating and Corporate Governance Committee Charter, Compensation Committee Charter and Corporate Governance Guidelines are available on the Company’s website at www.idexcorp.com under “Investors.” In the event the Company amends or waives any of the provisions of the Code of Business Conduct and Ethics applicable to the Company’s principal executive officer, principal financial officer or principal accounting officer, the Company intends to disclose the same on its website.\nThe Company has \ninsider trading policies and procedures\n that govern the purchase, sale and other dispositions of its securities by directors, officers, employees and contractors, as well as by the Company itself. We believe these policies and procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations and applicable listing standards. A copy of our Insider Trading Policy is filed with this Annual Report on Form 10-K as Exhibit 19.\n \nItem 11.    \n    \nExecutive Compensation.\nInformation under the heading “Executive Compensation” in the 2025 Proxy Statement is incorporated into this Item 11 by reference.\nItem 12.     Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nInformation under the heading “Security Ownership” in the 2025 Proxy Statement is incorporated into this Item 12 by reference.\nEquity Compensation Plan Information\nInformation with respect to the Company’s equity compensation plans as of December 31, 2024 is as follows: \nPlan Category\nNumber of Securities\nTo be Issued Upon\nExercise of\nOutstanding Options,\nWarrants and Rights\nWeighted-Average\nExercise Price of\nOutstanding\nOptions, Warrants\nand Rights\nNumber of Securities\nRemaining Available for\nFuture Issuance Under\nEquity Compensation\nPlans\n(1)\nEquity compensation plans approved by the Company’s stockholders\n1,247,052 \n$\n191.96 \n9,719,183 \nEquity compensations plans not approved by the Company’s stockholders\n— \n— \n— \n(1)\nIncludes an indeterminate number of shares underlying deferred compensation units (“DCUs”) granted under the Directors Deferred Compensation Plan and Deferred Compensation Plan for Non-officer Presidents which are issuable under the Company’s Incentive Award Plan. Also includes an indeterminate number of shares underlying DCUs granted under the Deferred Compensation Plan for Officers, which shares are issuable under the Incentive Award Plan. The number of DCUs granted under these plans is determined by dividing the amount deferred by the closing price of the common stock the day before the date of deferral. The DCUs are entitled to receive dividend equivalents which are reinvested in DCUs based on the same formula for investment of a participant’s deferral.\nItem 13.     Certain Relationships and Related Transactions, and Director Independence.\nInformation under the headings, “Corporate Governance” and “Board Committees” in the 2025 Proxy Statement is incorporated into this Item 13 by reference.\n \nItem 14.        Principal Accountant Fees and Services.\n89\nInformation under the heading “Principal Accountant Fees and Services” in the 2025 Proxy Statement is incorporated into this Item 14 by reference.\n \n90\nPART IV\nItem 15.    \n    \nExhibits and Financial Statement Schedules.\n(A)\n1. Financial Statements\nConsolidated Financial Statements filed as part of this report are listed under Part II, \nItem 8. “Financial Statements and Supplementary Data.”\n    2. Financial Statement Schedules\nFinancial statement schedules are omitted because they are not applicable, not required, not material or because the required information is included in the Consolidated Financial Statements of the Company or the Notes thereto.\n    3. Exhibits\nThe exhibits filed with this report are listed on the “Exhibit Index,” which precedes the signature page of this report.\nItem 16.        Form 10-K Summary.\n    None.\n91\nExhibit Index\nExhibit\nNumber\n  \nDescription\n3.1 \n  \nRestated Certificate of Incorporation of IDEX Corporation as amended to date (incorporated by reference to Exhibit 3.1 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n3.2 \nSecond Amended and Restated Bylaws of IDEX Corporation, effective as of October 24, 2022 (incorporated by reference to Exhibit No. 3.1 to the Quarterly Report on Form 10-Q of IDEX Corporation for the quarter ended September 30, 2022)\n4.1 \n  \nIndenture between IDEX Corporation and Wells Fargo Bank, National Association, as Trustee, dated as of December 6, 2010 (Debt Securities) (incorporated by reference to Exhibit No. 4.1 to the Current Report of IDEX Corporation on Form 8-K filed December 7, 2010)\n4.2 \n  \nThird Supplemental Indenture between IDEX Corporation and Wells Fargo Bank, National Association, as Trustee, dated as of April 29, 2020, (as to 3.00% Senior Notes due 2030) (incorporated by reference to Exhibit No. 4.2 to the Current Report of IDEX Corporation on Form 8-K filed April 29, 2020)\n4.3 \nFourth Supplemental Indenture between IDEX Corporation and Wells Fargo Bank, National Association, as Trustee, dated as of May 28, 2021, (as to 2.625% Senior Notes due 2031) (incorporated by reference to Exhibit No. 4.2 to the Current Report of IDEX Corporation on Form 8-K filed May 28, 2021)\n4.4 \nFifth Supplemental Indenture between IDEX Corporation and Computershare Trust Company, N.A., as successor to Wells Fargo Bank, National Association, as Trustee, dated as of August 21, 2024, (as to 4.950% Senior Notes due 2029) (incorporated by reference to Exhibit No. 4.2 to the Current Report of IDEX Corporation on Form 8-K filed August 21, 2024).\n4.5 \nNote Purchase Agreement, dated June 13, 2016, between IDEX Corporation and the Purchasers listed in Schedule A thereto (incorporated by reference in Exhibit No. 4.1 to the Current Report of IDEX Corporation on Form 8-K filed June 15, 2016)\n4.6 \nNote Purchase and Master Note Agreement, dated June 13, 2023, among IDEX Corporation, NYL Investors LLC, New York Life Insurance Company, New York Life Group Insurance Company of NY, New York Life Insurance and Annuity Corporation Institutionally owned Life Insurance Separate Account (BOLI 3), New York Life Insurance and Annuity Corporation Institutionally owned Life Insurance Separate Account (BOLI 3-2) and New York Life Insurance and Annuity Corporation Institutionally owned Life Insurance Separate Account (BOLI 30C) (incorporated by reference to Exhibit No. 4.1 to the Current Report of IDEX Corporation on Form 8-K filed June 14, 2023)\n4.7\nDescription of Securities (incorporated by reference to Exhibit No. 4.5 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2019)\n10.1**\nIDEX Corporation 2024 Incentive Award Plan (incorporated by reference to Exhibit 4.3 to the Registrant’s Registration Statement on Form S-8, filed with the Commission on May 7, 2024)\n10.2**\n  \nRevised and Restated IDEX Corporation Management Incentive Compensation Plan for Key Employees Effective January 1, 2022 (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of IDEX Corporation for the quarter ended June 30, 2023)\n10.3**\nIDEX Corporation Form of Director Indemnification Agreement (incorporated by reference to Exhibit 10.2 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.4**\n  \nIDEX Corporation Amended and Restated Stock Option Plan for Outside Directors, adopted by resolution of the Board of Directors dated as of November 20, 2003 (incorporated by reference to Exhibit 10.6 (a) to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2003)\n10.5**\nIDEX Corporation Incentive Award Plan (as amended and restated) (incorporated by reference to Appendix A of the Proxy Statement of IDEX Corporation on Schedule 14A, filed March 5, 2015)\n10.6**\n  \nThird Amended and Restated IDEX Corporation Directors Deferred Compensation Plan (incorporated by reference to Exhibit No. 10.30 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2010)\n10.7**\n  \nIDEX Corporation Supplemental Executive Retirement and Deferred Compensation Plan (incorporated by reference to Exhibit No. 10.31 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2010)\n10.8**\nLetter Agreements between IDEX Corporation and Eric Ashleman, dated January 14, 2008 and February 12, 2014 (incorporated by reference to Exhibit No. 10.14 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n92\n10.9**\nForm of IDEX Corporation Stock Option Agreement effective February 2015 (incorporated by reference to Exhibit No. 10.17 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.10**\nForm of IDEX Corporation Restricted Stock Unit Award Agreement effective February 2015 (incorporated by reference to Exhibit No. 10.18 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.11**\nForm of IDEX Corporation Restricted Stock Unit Award Agreement - Cash Settled effective February 2015 (incorporated by reference to Exhibit No. 10.19 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.12**\nForm of IDEX Corporation Performance Share Unit Award Agreement effective February 2015 (incorporated by reference to Exhibit No. 10.20 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.13**\nForm of IDEX Corporation Restricted Stock Unit Agreement for Directors effective February 2015 (incorporated by reference to Exhibit No. 10.21 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.14**\nForm of IDEX Corporation Stock Option Agreement effective February 2015 (incorporated by reference to Exhibit No. 10.22 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.15**\nForm of IDEX Corporation Restricted Stock Award Agreement effective February 2015 (incorporated by reference to Exhibit No. 10.23 to the Annual Report of IDEX Corporation on Form 10-K for the year ended December 31, 2014)\n10.16**\nLetter Agreement between IDEX Corporation and Eric D. Ashleman, dated January 21, 2021 (incorporated by reference to Exhibit 10.18 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2020) \n10.17**\nAmendment to Letter Agreement dated February 12, 2014, between IDEX Corporation and Eric D. Ashleman, effective as of April 24, 2017 (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of IDEX Corporation for the quarter ended March 31, 2017)\n10.18**\nForm of IDEX Corporation Performance Share Unit Award Agreement - Stock Settled, effective February 2018 (incorporated by reference to Exhibit 10.26 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.19**\nForm of IDEX Corporation Restricted Stock Award Agreement, effective February 2018 (incorporated by reference to Exhibit 10.27 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.20**\nForm of IDEX Corporation Restricted Stock Unit Agreement for Directors, effective February 2018 (incorporated by reference to Exhibit 10.28 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017\n)\n10.21**\nForm of IDEX Corporation Performance Share Unit Award Agreement - Cash Settled, effective February 2018 (incorporated by reference to Exhibit 10.29 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.22**\nForm of IDEX Corporation Stock Option Agreement, effective February 2018 (incorporated by reference to Exhibit 10.30 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.23**\nForm of IDEX Corporation Stock Option Agreement - Cash Settled, effective February 2018 (incorporated by reference to Exhibit 10.31 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.24**\nForm of IDEX Corporation Restricted Stock Unit Award Agreement - Cash Settled, effective February 2018 (incorporated by reference to Exhibit 10.32 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.25**\nForm of IDEX Corporation Restricted Stock Unit Award Agreement, effective December 2015 (incorporated by reference to Exhibit 10.33 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n10.26**\nForm of IDEX Corporation Confidential Information, Work Product and Restrictive Covenant Agreement (incorporated by reference to Exhibit 10.34 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2017)\n93\n10.27 \nAmended and Restated Credit Agreement, dated as of November 1, 2022, which amends and restates the Credit Agreement, dated as of May 31, 2019, by and among IDEX Corporation and certain of its subsidiaries, as borrowers, Bank of America, N.A., as administrative agent, swing line lender and an issuer of letters of credit; JPMorgan Chase Bank, N.A. and Wells Fargo Bank, National Association, as co-syndication agents and issuers of letters of credit; HSBC Bank USA, National Association, Mizuho Bank, Ltd., and Bank of China, Chicago Branch, as co-documentation agents and the other lenders and financial institutions party thereto (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of IDEX Corporation filed on November 2, 2022)\n10.28**\nIDEX Amended and Restated Non-Employee Director Compensation Policy, effective January 1, 2020 (incorporated by reference to Exhibit 10.35 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2019)\n10.29**\nLetter Agreement between IDEX Corporation and Melissa S. Flores, dated as of January 7, 2021 (incorporated by reference to Exhibit No. 10.1 to the Quarterly Report on Form 10-Q of IDEX Corporation for the quarter ended March 31, 2022)\n10.30**\nLetter Agreement between IDEX Corporation and Lisa M. Anderson, dated as of February 16, 2022 (incorporated by reference to Exhibit 10.31 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2022)\n10.31**\nLetter Agreement between IDEX Corporation and Abhishek Khandelwal, dated as of October 19, 2023 (incorporated by reference to Exhibit 10.30 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2023)\n19*\nIDEX Insider Trading Policy\n21*\nSubsidiaries of IDEX\n23*\nConsent of Deloitte & Touche LLP\n31.1*\nCertification of Chief Executive Officer Pursuant to Rule 13a-14 (a) or Rule 15d-14 (a)\n31.2*\nCertification of Chief Financial Officer Pursuant to Rule 13a-14 (a) or Rule 15d-14 (a)\n32.1***\nCertification pursuant to Section 1350 of Chapter 63 of Title 18 of the United States Code\n32.2***\nCertification pursuant to Section 1350 of Chapter 63 of Title 18 of the United States Code \n97 \nIDEX Corporation Policy on Recoupment of Incentive Compensation (incorporated by reference to Exhibit 97 to the Annual Report of IDEX Corporation on Form 10-K for the fiscal year ended December 31, 2023)\n*,****101\n  \nThe following materials from IDEX Corporation’s Annual Report on Form 10-K for the year ended December 31, 2024 formatted in Inline XBRL (Extensible Business Reporting Language): (i) the Consolidated Balance Sheets at December 31, 2024 and 2023, (ii) the Consolidated Statements of Income for the three years ended December 31, 2024, (iii) the Consolidated Statements of Comprehensive Income for the three years ended December 31, 2024, (iv) the Consolidated Statements of Equity for the three years ended December 31, 2024, (v) the Consolidated Statements of Cash Flows for the three years ended December 31, 2024, and (vi) Notes to Consolidated Financial Statements.\n*,****104\nCover Page Interactive Data File (Formatted Inline XBRL and contained in Exhibit 101)\n*    \nFiled herewith.\n**    \nManagement contract or compensatory plan or agreement.\n***    Furnished herewith.\n****    In accordance with Rule 406T of Regulation S-T, the XBRL related information in Exhibits 101 and 104 to this Annual Report on Form 10-K shall not be deemed to be “filed” for purposes of Section 18 of the Exchange Act, or otherwise subject to the liability of that section, and shall not be part of any registration statement or other document filed under the Securities Act or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.\n94\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nIDEX CORPORATION\nBy:\n/s/    ABHISHEK KHANDELWAL\nAbhishek Khandelwal\nSenior Vice President and Chief Financial Officer\nDate: February 20, 2025 \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ ERIC D. ASHLEMAN\nChief Executive Officer, \nPresident and Director\n(Principal Executive Officer)\nEric D. Ashleman\nFebruary 20, 2025\n/s/ ABHISHEK KHANDELWAL\nSenior Vice President and \nChief Financial\nOfficer (Principal Financial Officer)\nAbhishek Khandelwal\nFebruary 20, 2025\n/s/ ALLISON S. LAUSAS\nVice President and\nChief Accounting Officer\n(Principal Accounting Officer)\nAllison S. Lausas\nFebruary 20, 2025\n/s/ MARK A. BECK\nDirector\nMark A. Beck\nFebruary 20, 2025\n/s/ MARK A. BUTHMAN\nDirector\nMark A. Buthman\nFebruary 20, 2025\n/s/ ALEJANDRO QUIROZ CENTENO\nDirector\nAlejandro Quiroz Centeno\nFebruary 20, 2025\n/s/ CARL R. CHRISTENSON\nDirector\nCarl R. Christenson\nFebruary 20, 2025\n/s/ LAKECIA N. GUNTER\nDirector\nLakecia N. Gunter\nFebruary 20, 2025\n/s/ KATRINA L. HELMKAMP\nNon-Executive Chair of the Board and Director\nKatrina L. Helmkamp\nFebruary 20, 2025\n/s/ DAVID C. PARRY\nDirector\nDavid C. Parry\nFebruary 20, 2025\n/s/ LIVINGSTON L. SATTERTHWAITE\nDirector\nLivingston L. Satterthwaite\nFebruary 20, 2025\n/s/ L. PARIS WATTS-STANFIELD\nDirector\nL. Paris Watts-Stanfield\nFebruary 20, 2025\n95"
  }
}