{
  "ticker": "IFF",
  "cik": "0000051253",
  "company_name": "INTERNATIONAL FLAVORS & FRAGRANCES INC",
  "filing_date": "2025-02-28",
  "accession": "0000051253-25-000013",
  "primary_doc": "iff-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS.\nWe are a leading creator and manufacturer of food, beverage, health & biosciences, scent and pharma solutions and complementary adjacent products, including natural health ingredients, which are used in a wide variety of consumer products. Our products are sold principally to manufacturers of dairy, meat, beverages, snacks, savory, sweet, baked goods, grain processors and other foods, personal care products, soaps and detergents, cleaning products, perfumes, dietary supplements, food protection, infant, elderly and animal nutrition, functional food, pharmaceutical and oral care products. As a result, we hold global leadership positions in the Food & Beverage, Home & Personal Care and Health & Wellness markets, and across key Tastes, Textures, Scents, Nutrition, Enzymes, Cultures, Soy Proteins, Pharmaceutical Excipients and Probiotics categories.\nSales in 2024 were $11.484 billion. Our business is geographically diverse, with sales in the U.S. representing approximately \n28%\n of sales in 2024. No other country represented more than 10% of sales. In 2024, no customer accounted for 10% or more of sales.\nOur Product Offerings\nAs of December 31, 2024, our business consisted of four segments: Nourish, Health & Biosciences, Scent and Pharma Solutions.\nNourish\nAs a leading creator of ingredients and solutions, we help our customers deliver on the promise of healthy and delicious foods and drinks that appeal to consumers. We create products in our regional creative centers which allows us to satisfy local customer preferences, while also helping to ensure regulatory compliance and production standards. We develop thousands of different Nourish offerings, most of which are tailor-made, and we continually develop new ingredients and solutions to meet changing consumer preferences and customer needs.\nOur Nourish segment consists of an innovative and broad portfolio of natural-based ingredients to enhance nutritional value, texture and functionality in a wide range of beverage, dairy, bakery, confectionery and culinary applications and consists of Ingredients and Flavors.\nIngredients\n include a diversified portfolio across natural and plant-based specialty food ingredients derived from herbs and plants that provide texturizing solutions used in the food industry, food protection solutions used in food and beverage products, as well as specialty soy and pea protein with value-added formulations, emulsifiers and sweeteners. Natural food protection ingredients consist of natural antioxidants and anti-microbials used for natural food preservation and shelf-life extension for beverages, cosmetic and healthcare products, pet food and feed additives. Ingredients also includes savory solutions (such as spices, marinades, mixtures) and inclusion products (such as products combining flavorings with fruit, vegetables and other natural ingredients), formerly part of \nFood Designs.\n During the fourth quarter of 2022, we announced our entry into an agreement to sell a portion of the Savory Solutions business and completed the divestiture on May 31, 2023.\nFlavors\n include a range of flavor compounds and natural taste solutions that are ultimately used by our customers in savory products (soups, sauces, meat, fish, poultry, snacks, etc.), beverages (juice drinks, carbonated or flavored beverages, spirits, etc.), sweets (bakery products, candy, cereal, chewing gum, etc.), and dairy products (yogurt, ice cream, cheese, etc.). Flavors also include value-added spices and seasoning ingredients for meat, food service, convenience, alternative protein and culinary products.\nHealth & Biosciences\nOur Health & Biosciences segment consists of the development and production of an advanced biotechnology-derived portfolio of enzymes, food cultures, probiotics and specialty ingredients for food and non-food applications. Among many other applications, this biotechnology-driven portfolio includes cultures for use in fermented foods such as yogurt, cheese and fermented beverages, probiotic strains, many with documented clinical health claims for use as dietary supplements and through industrial fermentation the production of enzymes and microorganisms that provide product and process performance benefits to household detergents, animal feed, ethanol production and brewing. Health & Biosciences is comprised of Health, Cultures & Food Enzymes, Home & Personal Care, Animal Nutrition and Grain Processing.\nHealth\n provides ingredients for dietary supplements, functional food and beverage, specialized nutrition and pharma.\nCultures & Food Enzymes\n provides products that aim to serve the global demand for healthy, natural, clean label and fermented food for fresh dairy, cheese, bakery and brewing products. Such products contribute to extended shelf life, stability, taste and texture, helping our customers to improve their product offerings. The business’s enzyme solutions also allow our customers to provide low sugar, high fiber and lactose-free dairy products.\n 3\nTable of\n Contents\n \nHome & Personal Care\n produces enzymes for laundry and dishwashing detergents, cleaning and textiles to help enhance the product and process performance of products in the fabric and home care, textiles and industrials and personal care markets. The business also produces patented enzymatic polymers that are renewable, biodegradable alternatives to functional ingredients used in home cleaning and beauty care products.\nAnimal Nutrition\n produces feed enzymes and animal health solutions that help to improve nutrition, welfare, performance and sustainability of livestock animal farming.\nGrain Processing\n produces yeasts and enzymes for biofuel production and carbohydrate processing.\nScent\nOur Scent segment creates fragrance compounds and fragrance ingredients that are integral elements in the world’s finest perfumes and best-known household and personal care products. Consumer insights, science and creativity are at the heart of our Scent business, and, along with our unique portfolio of natural and synthetic ingredients, global footprint, innovative technologies and know-how, and customer intimacy, we believe make us a market leader in scent products. The Scent segment is comprised of Fragrance Compounds and Fragrance Ingredients. We completed the divestiture of our Cosmetic Ingredients business, previously within the Scent segment, on April 2, 2024.\nFragrance Compounds\n are unique and proprietary combinations of multiple fragrance ingredients that are ultimately used by our customers in their consumer goods. Our creative and commercial teams within fragrance compounds are organized into two broad categories: fine fragrances and consumer fragrances.\nOur perfumers harness creativity and leverage our innovative captive molecules, sustainable natural ingredients obtained with innovative processes, biotech ingredients, data science, and consumer insights to create unique and inspiring fragrances driving consumer preferences.\nOur fine fragrances focus on perfumes and colognes, creating global and local namesake brands, from high luxury to mass market, from market leading to ultra-niche products.\nOur consumer fragrances include three end-use categories of products:\n•\nFabric Care, including laundry detergents, fabric softeners and specialty laundry products;\n•\nHome Care, including household cleaners, dishwashing detergents and air fresheners; and\n•\nBody Care, including personal wash, hair care and toiletries products.\nFragrance Ingredients\n are natural and synthetic, and active and functional ingredients that are used internally and sold to third parties, including competitors, for use in the preparation of compounds. While the principal role of our fragrance ingredients facilities is to support our fragrance compounds business, we utilize excess manufacturing capacity to manufacture and sell certain fragrance ingredients to third parties, enabling us to leverage our fixed costs while maintaining the security of our supply for our perfumers and ultimately our customers. We completed the divestiture of our Flavor Specialty Ingredients business on August 1, 2023. The Flavor Specialty Ingredients business previously comprised of natural flavor extracts, specialty botanical extracts, distillates, essential oils, citrus products, aroma chemicals and natural gums and resins, which are used for food, beverage and flavors, and are often sold directly to food and beverage manufacturers who use them in producing consumer products.\nPharma Solutions\nOur Pharma Solutions segment produces, among other things, a vast portfolio of cellulosics and seaweed-based pharmaceutical excipients, used to improve the functionality and delivery of active pharmaceutical ingredients, including controlled or modified drug release formulations, and enabling the development of more effective pharmaceutical finished dosage formulations. Our excipients are used in prescription and over-the-counter pharmaceuticals and dietary supplements. Our Pharma Solutions products also serve a variety of other specialty and industrial end-uses including coatings, inks, electronics, agriculture and consumer products. During March 2024, we entered into an agreement to sell the Pharma Solutions business disposal group, that is primarily made up of most businesses within the Company’s existing Pharma Solutions reportable segment as well as certain adjacent businesses. During October 2024, the Company entered into an agreement to sell its nitrocellulose business, which is within the Company’s existing Pharma Solutions reportable operating segment. Both transactions are expected to close in the second quarter of 2025.\nOrganization in 2025\nAs previously announced in 2024, starting January 1, 2025, our Nourish segment has been separated into two newly named business units, Taste and Food Ingredients. With small additional adjustments, our Flavors business, formerly part of Nourish, has been renamed Taste, and our Ingredients business, formerly part of Nourish, has been renamed Food Ingredients. Thus, \n 4\nTable of\n Contents\n \nstarting in the first quarter of 2025, our business segments will consist of Taste, Food Ingredients, Health & Biosciences, Scent, and, until the completion of the sale of the Pharma Solutions business disposal group, Pharma Solutions.\nConsumer Insights, Research and Product Development Process\nThe markets in which we compete require constant innovation to remain competitive. Consumer preferences tend to drive change in our markets, and as science evolves and sustainability continues to be a key factor to customers and consumers, we must continue to strengthen our research and development platforms and adapt our capabilities to provide differentiated products.\nConsumer Insights\nWe believe that the first step to creating an innovative and unique product experience begins with gaining insight into the consumer and emerging industry trends. By developing a deep understanding of what consumers value and prefer through our consumer insight programs, we are better able to focus our research and development and creative efforts.\nOur consumer science, insight and marketing teams interpret trends, monitor product launches, analyze quantitative market data and conduct numerous consumer interviews annually.\nBased on this information, we develop innovative and proprietary programs to evaluate potential products that enable us to understand the emotional connections between a prospective product and the consumer. We believe this ability to pinpoint the likelihood of a product’s success translates into stronger brand equity, resulting in increased returns and greater market share gains for our customers as well as for IFF.\nResearch and Development\nWe consider our research and development infrastructure to be one of our key competencies and critical to our ability to provide differentiated products to our customers. We have strong product and application development pipelines built upon a global network that includes research and development, as well as regulatory and product stewardship capabilities.\nWe focus and invest substantial resources in the research and development of new and innovative molecules, compounds, formulations and technologies and the application of these to our customers’ products. Using the knowledge gained from our consumer insights programs and business unit needs, we strategically focus our resources around key research and development platforms that address or anticipate consumer needs or preferences. Our innovation-based platforms are aligned with key consumer insight-led growth themes: improving home and personal care, empowering wellbeing and healthy lives, transforming food systems and accelerating climate solutions. By aligning our capabilities and resources to these platforms, we ensure the proper support and focus for each program so that our products can be further developed and eventually accepted for commercial application.\nAs of December 31, 2024, we have 894 granted U.S. patents, and 458 pending U.S. patent applications, as well as thousands of other granted patents and pending patent applications around the world. We have developed many unique molecules and delivery systems for our customers that are used as the foundations of successful products around the world.\nOur principal basic research and development activities are located in Union Beach, New Jersey; Wilmington, Delaware; Palo Alto, California; Brabrand, Denmark; and Leiden, The Netherlands. At those locations, our scientists and application engineers, while collaborating with our other research and development centers around the world, support the:\n•\ndiscovery of new materials;\n•\ndevelopment of new technologies, such as delivery systems;\n•\ncreation of new compounds; and\n•\nenhancement of existing ingredients and compounds.\nAs of December 31, 2024, we employed approximately 3,400 people globally in research and development activities (including innovation, creation and design activities).\nCreative Application\nThrough our global network of creative centers and application laboratories, we create or adapt the basic Nourish, Health & Biosciences, Scent and Pharma Solutions products that we have developed in the research and development process to commercialize for use in our customers’ consumer products. Our global creative teams consist of marketing, consumer science, consumer insights and technical application experts, from a wide range of cultures and nationalities. In close partnership with our customers’ product development groups, our creative teams create the experiences that our customers are seeking in order to satisfy consumer demands in each of their respective markets.\nNew product development is driven by a variety of sources including requests from our customers, who are in need of specific products for use in a new or modified consumer product, or as a result of internal initiatives stemming from our \n 5\nTable of\n Contents\n \nconsumer insights program. Our product development team works in partnership with our scientists and researchers to optimize the consumer appeal and relevance of our offerings. We use a collaborative process between our researchers, our product development team and our customers to perfect our offerings so they are ready to be included in the final consumer product.\nIn addition to creating new products, our researchers and product development teams advise customers on ways to improve their existing products by moderating or substituting current ingredients with more readily accessible or less expensive materials enhancing their yield, or helping to increase or improve functionality of their formulations. This often results in creating a better value proposition for our customers.\nMost of our formulas are treated as trade secrets and remain our proprietary assets. Our business is not materially dependent upon any individual patent, trademark or license.\nSupply Chain\nWe strive to provide our customers with consistent and quality products on a timely and cost-effective basis by managing all aspects of the supply chain, from raw material sourcing through manufacturing, quality assurance, regulatory compliance and distribution.\nProcurement\nIn connection with the manufacture of our products, we use natural and synthetic ingredients. As of December 31, 2024, we purchased approximately 20,000 different raw materials sourced from an extensive network of domestic and international suppliers and distributors.\nNatural ingredients are derived from flowers, fruits and other botanical products, as well as from plant, animal and marine products, and commodity crops like wheat, corn and soy. They contain varying numbers of organic chemicals that are responsible for the fragrance, flavor, antioxidant properties and nutrition of the natural products. Natural products are purchased directly from farms or in processed and semi-processed forms. Some natural products are used in compounds in the state in which they are obtained and others are used after further processing. Natural products, together with various chemicals, are also used as raw materials for the manufacture of synthetic ingredients by chemical processes.\nIn order to ensure our supply of raw materials, achieve favorable pricing and provide timely transparency regarding inflationary trends to our customers, we continue to focus on:\n•\npurchasing under contract with fixed or formula-based pricing for set time periods;\n•\nentering into hedging for raw materials we purchase that can be hedged against liquid commodity assets;\n•\nentering into supplier relationships to gain access to supplies we would not otherwise have;\n•\nimplementing indexed pricing;\n•\nreducing the complexity of our formulations;\n•\nevaluating the profitability of whether to buy or make an ingredient;\n•\nsourcing from local countries with our own procurement professionals; and\n•\nperiodically assessing our supply base with a view towards greater cost efficiencies and improvements.\nManufacturing and Distribution\nAs of December 31, 2024, we had approximately 150 manufacturing facilities, creative centers and application laboratories located in approximately 40 different countries. Our major manufacturing facilities are located in the United States, The Netherlands, Spain, Germany, Indonesia, Turkey, Brazil, Mexico, Slovenia, China, India, Ireland, Norway, Finland, Denmark, Belgium and Singapore.\nOur supply chain initiatives are focused on increasing capacity and investing in key technologies. Within our more mature markets, we tend to focus on consolidation and cost optimization as well as the implementation of new technologies. In addition to our own manufacturing facilities, we develop relationships with third parties, including contract manufacturing organizations, that expand our access to the technologies, capabilities and capacity that we need to better serve our customers.\nFor more detailed information about risks related to our supply chain, please refer to",
    "item1a": "Item 1A, “Risk Factors” \n—“A significant data breach or other disruption to our information technology systems could disrupt our operations, result in the loss of confidential information or personal data, and adversely impact our reputation, productivity, business or results of operations.”\n 29\nTable of\n Contents\n \nGovernance\nThe Board of Directors is responsible for overseeing and reviewing with management the Company’s InfoSec risks and the policies and practices established to manage such risks.\n \nIn that effort, the Board of Directors delegates certain responsibilities to our Audit Committee. This committee-level focus on InfoSec allows the Board to further enhance its understanding of these issues as it continues to have overall oversight responsibility for risk.\nThe Audit Committee assists the Board of Directors in its oversight by staying apprised of our InfoSec programs, strategy, policies, standards, architecture, processes and material risks, and by overseeing response to InfoSec incidents.\n \nOur Audit Committee receives from management updates, at least quarterly, on material security risks, including any material incidents, relevant industry developments, threat vectors and material risks identified in periodic penetration tests or vulnerability scans.\n These updates also include material legal and legislative developments concerning InfoSec, our approach to complying with applicable law and material engagement with regulators concerning IT and InfoSec.\nThe \nBoard of Directors\n receives regular reports from the Audit Committee which detail (a) InfoSec initiatives, (b) reviews of the policies and practices established to manage these processes, and (c) reviews of the Company’s procedures for monitoring compliance with applicable laws. Additionally, the Board of Directors also receives updates on the Company’s risks through ERM program reports, which include management’s approach to mitigating and managing InfoSec risks.\nMembers of the Board of Directors stay apprised of the rapidly evolving cyber threat landscape and provide guidance to management, as appropriate, to address the effectiveness of our overall data privacy and cybersecurity program. Recently, members of the Board of Directors and Executive Leadership Team participated in a Cybersecurity Exercise led by our CIO and CISO as training, and, to prepare for incident response. The Board of Directors and Audit Committee also receive regular cybersecurity posture reports from an external third-party, and outside counsel advises the Board of Directors on best practices for the Board’s oversight of InfoSec and the evolution of that oversight over time. Additionally, two members of our Board of Directors and Audit Committee have experience in InfoSec matters.\nOur Board of Directors and Audit Committee’s principal role is one of oversight, recognizing that management, led by our CIO and CISO, is responsible for the design, implementation and maintenance of an effective program for identifying, detecting, protecting against, responding to, recovering from and mitigating data privacy and InfoSec risks.\n \nOur CIO has more than 30 years of technology experience, including leadership across a variety of enterprise technologies, including InfoSec, and across multiple industries. Our CISO has more than 20 years of experience in InfoSec, across multiple industries, and is a Certified Information Systems Security Professional (CISSP).\n The CIO and CISO provide, at least, annual updates on IT and InfoSec initiatives to the Board of Directors and quarterly updates to the Audit Committee.",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS.\nNone.",
    "item1c": "ITEM 1C.    CYBERSECURITY.\nRisk Management and Strategy\n 28\nTable of\n Contents\n \nOur comprehensive Incident Response Plan outlines processes to identify, detect, assess, respond to and recover from threats, including cybersecurity threats. We follow those processes to manage material risks from cybersecurity threats, including risks relating to disruption of business operations or financial reporting systems, intellectual property theft; fraud; extortion; harm to employees or customers; violation of privacy laws and other litigation/legal risk; and reputational risk, as part of our overall risk management system and processes.\nIn addition, our Enterprise Risk Management (“ERM”) program considers cybersecurity risks alongside other company risks. \nOur enterprise risk professionals consult with cross-organizational leaders to gather information necessary to identify cybersecurity risks, evaluate their likelihood and severity, identify necessary mitigations and assess the potential impact of those mitigations on residual risk. \nOur ERM Committee, chaired by the Chief Financial Officer (“CFO”) and General Counsel (“GC”), and comprised of senior leaders representing each risk domain, integrates global risks, including cybersecurity and compliance, to ensure appropriate prioritization of resources and alignment across the Company.\n The ERM Committee meets with our Executive Leadership Team and presents at least annually to our Board of Directors on the ERM process and on our risk mitigation actions, including providing reporting focused on compliance and cybersecurity risks.\nOur Chief Information Officer (“CIO”) is responsible for delivering on the Company’s global Information Technology (“IT”) strategy, including infrastructure, data and analytics, application delivery, end user services, cybersecurity risk management and the digital technology transformation program. The IT leadership team leads the implementation of the IT strategy and the day-to-day operations. Under the guidance of the CIO, our \nChief Information Security Officer\n (“CISO”) leads Information Security (“InfoSec”), which includes the Cyber Fusion Center, Infrastructure Security, including network segmentation, firewalls and intrusion detection and prevention systems, Identity and Access Management, Application Security, Data Security and InfoSec Governance, Risk and Compliance.\n InfoSec is overseen by the InfoSec Steering Committee, comprised of senior leaders representing all corporate functions and business units, and the InfoSec Governance Review Board, comprised of the IT leadership team and the InfoSec leadership team. InfoSec is governed in coordination with IFF’s ERM Committee and is aligned to the U.S. National Institute of Standards and Technology (“NIST”) Cybersecurity Framework.\nIn addition to our dedicated leadership team overseeing InfoSec, we view InfoSec as a shared responsibility, and to best protect our network, computers and data from threats, we empower our employees to be our first line of defense. To that end, all employees globally complete annual mandatory InfoSec training on email security, password security and our Acceptable Use Policy. We use email security, endpoint security, logging and monitoring, remote access, application security and other tools to deter threat actors, block malicious/phishing emails and avoid IT system interruptions.\nOur comprehensive InfoSec Incident Response Plan is updated at least annually, and provides guidance for detecting, containing, eradicating and recovering from potential incidents. It outlines escalation procedures, reporting requirements, incident severity levels, a materiality assessment and roles and responsibilities for key partners, including IT, Legal/Employee Relations, Corporate Communications, Human Resources and other senior leaders. Our escalation procedures include escalation to our Executive Leadership Team, Audit Committee, Disclosure Committee, and Board of Directors, and reporting to regulators, customers, investors, and others. We also maintain cybersecurity insurance, regularly evaluate the effectiveness of our systems, and test our contingency plans by conducting vulnerability analysis and tabletop exercises with both technical incident responders and senior leaders.\nBased on industry baselines and discussions throughout our membership in various global InfoSec communities, we believe that these preventative actions provide adequate measures of protection against information security breaches/incidents and reduce our cybersecurity risks. Given the evolving nature of InfoSec incidents, we regularly engage with our peers on threat intelligence and collaborate with organizations both in our industry and across industries to share best practices.\nIn connection with our InfoSec risk management processes, we engage third-party assessors and outside counsel. Our program includes review and assessment by external, independent third parties, who assess and report on our overall InfoSec program and identify areas for continued focus and improvement.\n \nOur CIO, CISO and GC oversee our technology risk management and privacy teams, which work in partnership with our Internal Audit team to review IT-related controls as part of the overall internal controls process and regulatory requirements. We consult with outside counsel to advise our team and our Board of Directors on best practices for InfoSec oversight, and the evolution of that oversight over time\n. InfoSec employees regularly speak at and attend industry events to ensure awareness of evolving threats and innovative prevention and remediation techniques. Further, our InfoSec risk management processes extend to the oversight and identification of threats associated with our use of third-party service providers through relationship due diligence, InfoSec assessments and contractual provisions.\nOur business strategy, results of operations and financial condition have not been materially affected by risks from cybersecurity threats, including as a result of previous cybersecurity incidents, but we cannot provide assurance that they will not be materially affected in the future by such risks and any future material incidents.\n For more detailed information about risks related to our cybersecurity, refer to"
  }
}