{
  "ticker": "INCY",
  "cik": "0000879169",
  "company_name": "INCYTE CORP",
  "filing_date": "2025-02-10",
  "accession": "0001628280-25-004633",
  "primary_doc": "incy-20241231.htm",
  "item_sections": {
    "item1": "Item 1. \nBusiness\nOverview\nIncyte is a global biopharmaceutical company engaged in the discovery, development and commercialization of proprietary therapeutics. Our global headquarters is located in Wilmington, Delaware, where we conduct discovery, clinical development and commercial operations. We also conduct clinical development and commercial operations from our European headquarters in Morges, Switzerland and our other offices across Europe, as well as our Japanese office in Tokyo and our Canadian headquarters in Montreal.\nWe are focused in two therapeutic areas that are defined by the indications of our approved medicines and the diseases for which our clinical candidates are being developed. One therapeutic area is Hematology/Oncology, which comprises Myeloproliferative Neoplasms (MPNs), Graft-Versus-Host Disease (GVHD), solid tumors and hematologic malignancies. The other therapeutic area is Inflammation and Autoimmunity (IAI), which includes our Dermatology commercial franchise. We are also eligible to receive milestones and royalties on molecules discovered by us and licensed to third parties. \nHematology and Oncology\nOur hematology and oncology franchise comprises six approved products, which are JAKAFI (ruxolitinib), MONJUVI (tafasitamab-cxix)/MINJUVI (tafasitamab), PEMAZYRE (pemigatinib), ICLUSIG (ponatinib), ZYNYZ (retifanlimab-dlwr), and NIKTIMVO (axatilimab-csfr), as well as numerous clinical development programs. \nJAKAFI (ruxolitinib)\nJAKAFI (ruxolitinib) is our first product to be approved for sale in the United States. It was approved by the U.S. Food and Drug Administration (FDA) in November 2011 for the treatment of adults with intermediate or high-risk myelofibrosis (MF); in December 2014 for the treatment of adults with polycythemia vera (PV) who have had an inadequate response to or are intolerant of hydroxyurea; in May 2019 \nfor the treatment of steroid-refractory acute graft-versus-host disease (GVHD) in adult and pediatric patients 12 years and older; and in September 2021 for the treatment of chronic GVHD after failure of one or two lines of systemic therapy in adult and pediatric patients 12 years and older\n. MF and PV are both myeloproliferative neoplasms (MPNs), a type of rare blood cancer, and GVHD is an adverse immune response to an allogeneic hematopoietic stem cell transplant (HSCT). Under our collaboration agreement with our collaboration partner Novartis Pharmaceutical International Ltd., Novartis received exclusive development and commercialization rights to ruxolitinib outside of the United States for all hematologic and oncologic indications and sells ruxolitinib outside of the United States under the name JAKAVI.\nIn 2003, we initiated a research and development program to explore the inhibition of enzymes called janus associated kinases (JAK). The JAK family is composed of four tyrosine kinases—JAK1, JAK2, JAK3 and Tyk2—that are involved in the signaling of a number of cytokines and growth factors. JAKs are central to a number of biologic processes, including the formation and development of blood cells and the regulation of immune functions. Dysregulation of the JAK-STAT signaling pathway has been associated with a number of diseases, including myeloproliferative neoplasms, other hematological malignancies, rheumatoid arthritis and other chronic inflammatory diseases. \nWe have discovered multiple potent, selective and orally bioavailable JAK inhibitors that are selective for JAK1 or JAK1 and JAK2. JAKAFI is the most advanced compound in our JAK program. It is an oral JAK1 and JAK2 inhibitor.\nJAKAFI is marketed in the United States through our own specialty sales force and commercial team. JAKAFI was the first FDA-approved JAK inhibitor for any indication, was the first FDA-approved product in MF, PV and steroid-refractory acute GVHD, and was recently approved in steroid-refractory chronic GVHD. JAKAFI remains the first-line standard of care in MF and remains the only FDA-approved product for steroid-refractory acute GVHD. The FDA has granted JAKAFI orphan drug status for MF, PV and GVHD.\nJAKAFI is distributed primarily through a network of specialty pharmacy providers and wholesalers that allow for efficient delivery of the medication by mail directly to patients or direct delivery to the patient’s pharmacy. Our distribution process uses a model that is well-established and familiar to physicians who practice within the oncology field.\n7\nTable of Contents\n \nTo further support appropriate use and future development of JAKAFI, our U.S. Medical Affairs department is responsible for providing appropriate scientific and medical education and information to physicians, preparing scientific presentations and publications, and overseeing the process for supporting investigator sponsored trials.\nIn September 2023, we were notified by the Centers for Medicare and Medicaid Services (CMS) that ruxolitinib phosphate qualified for the Small Biotech Exception.\nMyelofibrosis.\n MF is a rare, life-threatening condition. MF, considered the most serious of the myeloproliferative neoplasms, can occur either as primary MF, or as secondary MF that develops in some patients who previously had polycythemia vera or essential thrombocythemia. Based on the modern prognostic scoring systems referred to as International Prognostic Scoring System and Dynamic International Prognostic Scoring System, we believe intermediate and high-risk patients represent 80% to 90% of all patients with MF in the United States and encompass patients over the age of 65, or patients who have or have ever had any of the following: anemia, constitutional symptoms, elevated white blood cell or blast counts, or platelet counts less than 100,000 per microliter of blood.\nMost MF patients have enlarged spleens and many suffer from debilitating symptoms, including abdominal discomfort, pruritus (itching), night sweats and cachexia (involuntary weight loss). There were no FDA approved therapies for MF until the approval of JAKAFI. \nThe FDA approval was based on results from two randomized Phase 3 trials (COMFORT-I and COMFORT-II), which demonstrated that patients treated with JAKAFI experienced significant reductions in splenomegaly (enlarged spleen). COMFORT-I also demonstrated improvements in symptoms. The most common hematologic adverse reactions in both trials were thrombocytopenia and anemia. These events rarely led to discontinuation of JAKAFI treatment. The most common non-hematologic adverse reactions were bruising, dizziness and headache.\nIn August 2014, the FDA approved supplemental labeling for JAKAFI to include Kaplan-Meier overall survival curves as well as additional safety and dosing information. The overall survival information is based on three-year data from COMFORT-I and II and shows that at three years the probability of survival for patients treated with JAKAFI in COMFORT-I was 70% and for those patients originally randomized to placebo it was 61%. In COMFORT-II, at three years the probability of survival for patients treated with JAKAFI was 79% and for patients originally randomized to best available therapy it was 59%. In December 2016, we announced an exploratory pooled analysis of data from the five-year follow-up of the COMFORT-I and COMFORT-II trials of patients treated with JAKAFI, which further supported previously published overall survival findings.\nIn September 2016, we announced that JAKAFI had been included as a recommended treatment in the latest National Comprehensive Cancer Network (NCCN) Clinical Practice Guidelines in Oncology for myelofibrosis, underscoring the important and long term clinical benefits seen in patients treated with JAKAFI.\nIn October 2017, the FDA approved updated labeling for JAKAFI to include the addition of new patient-reported outcome (PRO) data from the COMFORT-I study, as well as updating the warning related to progressive multifocal leukoencephalopathy. An exploratory analysis of PRO data of patients with myelofibrosis receiving JAKAFI showed improvement in fatigue-related symptoms at Week 24. Fatigue response (defined as a reduction of 4.5 points or more from baseline in the PROMIS\n®\n Fatigue total score) was reported in 35% of patients treated with JAKAFI versus 14% of the patients treated with placebo.\nPolycythemia Vera.\n PV is a myeloproliferative neoplasm typically characterized by elevated hematocrit, the volume percentage of red blood cells in whole blood, which can lead to a thickening of the blood and an increased risk of blood clots, as well as an elevated white blood cell and platelet count. \nIn December 2014, the FDA approved JAKAFI for the treatment of patients with PV who have had an inadequate response to or are intolerant of hydroxyurea. The approval of JAKAFI for PV was based on data from the pivotal Phase 3 RESPONSE trial. In this trial, patients treated with JAKAFI demonstrated superior hematocrit control and reductions in spleen volume compared to best available therapy. In addition, a greater proportion of patients treated with JAKAFI achieved complete hematologic remission—which was defined as achieving hematocrit control and lowering platelet and white blood cell counts. In the RESPONSE trial, the most common hematologic adverse reactions (incidence > 20%) were thrombocytopenia and anemia. The most common non-hematologic adverse events (incidence >10%) were headache, abdominal pain, diarrhea, dizziness, fatigue, pruritus, dyspnea and muscle spasms.\n8\nTable of Contents\n \nIn March 2016, the FDA approved supplemental labeling for JAKAFI to include additional safety data as well as efficacy analyses from the RESPONSE trial to assess the durability of response in JAKAFI treated patients after 80 weeks. At this time, 83% patients were still on treatment, and 76% of the responders at 32 weeks maintained their response through 80 weeks.\nIn June 2016, we announced data from the Phase 3 RESPONSE-2 study of JAKAFI in patients with inadequately controlled PV that was resistant to or intolerant of hydroxyurea who did not have an enlarged spleen. These data showed that JAKAFI was superior to best available therapy in maintaining hematocrit control (62.2% vs. 18.7%, respectively; P<0.0001) without the need for phlebotomy.\nIn August 2017, we announced that JAKAFI had been included as a recommended treatment in the latest NCCN Guidelines for patients with polycythemia vera who have had an inadequate response to first-line therapies, such as hydroxyurea.\nGraft-versus-host disease.\n GVHD is a condition that can occur after an allogeneic HSCT (the transfer of genetically dissimilar stem cells or tissue). In GVHD, the donated bone marrow or peripheral blood stem cells view the recipient’s body as foreign and attack various tissues.\nIn June 2016, we announced that the FDA granted Breakthrough Therapy designation for ruxolitinib in patients with acute GVHD. In May 2019, the FDA approved JAKAFI for the treatment of steroid-refractory acute GVHD in adult and pediatric patients 12 years and older. The approval was based on data from REACH1, an open-label, single-arm, multicenter study of JAKAFI in combination with corticosteroids in patients with steroid-refractory grade II-IV acute GVHD. The overall response rate (ORR) in patients refractory to steroids alone was 57% with a complete response (CR) rate of 31%. The most frequently reported adverse reactions among all study participants were infections (55%) and edema (51%), and the most common laboratory abnormalities were anemia (75%), thrombocytopenia (75%) and neutropenia (58%).\nIn September 2021, the FDA approved JAKAFI for the treatment of \nchronic GVHD after failure of one or two lines of systemic therapy in adult and pediatric patients 12 years and older. This approval was based on data from REACH3, a Phase 3, randomized, open-label, multicenter study of JAKAFI in comparison to best available therapy for treatment of steroid-refractory chronic GVHD after allogeneic stem cell transplantation. The overall response rate through Cycle 7 Day 1 was 70% for JAKAFI compared to 57% for best available therapy. The most common hematologic adverse reactions (incidence > 35%) were anemia and thrombocytopenia. The most common non-hematologic adverse reactions (incidence ≥ 20%) were infections (pathogen not specified) and viral infection. \nIn addition, the FDA updated labeling for JAKAFI to include warnings of increased risk of major adverse cardiovascular events, thrombosis, and secondary malignancies related to another JAK-inhibitor treating rheumatoid arthritis, a condition for which JAKAFI is not indicated. In patients with MF and PV treated with JAKAFI in clinical trials, the rates of thromboembolic events were similar in JAKAFI and control treated patients. \nWe have retained all development and commercialization rights to JAKAFI in the United States and are eligible to receive development and sales milestones as well as royalties from product sales outside the United States. We hold patents that cover the composition of matter and use of ruxolitinib and its salt. These patents, including applicable extensions, currently expire in mid and late 2028. In December 2022, we were granted pediatric exclusivity, which adds six months to the expiration for all ruxolitinib patents listed in FDA’s Approved Drug Products with Therapeutic Equivalence Evaluations (Orange Book) as of the date of the grant of pediatric exclusivity.\nMONJUVI (tafasitamab-cxix) / MINJUVI (tafasitamab)\nIn January 2020, we and MorphoSys AG entered into a collaboration and license agreement to further develop and commercialize MorphoSys’ proprietary anti-CD19 antibody tafasitamab (MOR208) globally. Tafasitamab is an Fc-engineered antibody against CD19 currently in clinical development for the treatment of B cell malignancies. Under the terms of the collaboration and license agreement, we received rights to co-commercialize tafasitamab in the United States with MorphoSys, and exclusive development and commercialization rights outside of the United States. As more fully described in Note 5 of Notes to the Consolidated Financial Statements, in February 2024, we entered into a purchase agreement with MorphoSys, and as a result, we now hold exclusive global rights for tafasitamab, and the collaboration and license agreement was terminated.\n9\nTable of Contents\n \nIn July 2020, we and MorphoSys announced that the FDA had approved MONJUVI (tafasitamab-cxix), which is indicated in combination with lenalidomide for the treatment of adult patients with relapsed or refractory diffuse large B-cell lymphoma (DLBCL) not otherwise specified, including DLBCL arising from low grade lymphoma, and who are not eligible for autologous stem cell transplant (ASCT). MONJUVI was approved under accelerated approval based on overall response rate from the MorphoSys-sponsored Phase 2 L-MIND study, an open label, multicenter, single arm trial of MONJUVI in combination with lenalidomide as a treatment for adult patients with r/r DLBCL. Results from the study showed an objective response rate (ORR) of 55% (39 out of 71 patients; primary endpoint) and a complete response (CR) rate of 37% (26 out of 71 patients). The median duration of response (mDOR) was 21.7 months. The most frequent serious adverse reactions were infections (26%), including pneumonia (7%) and febrile neutropenia (6%). Updated three-year data from L-MIND were presented at the American Society of Clinical Oncology (ASCO) 2021 and final five-year data were presented at the American Association for Cancer Research (AACR) 2023, which showed that the MONJUVI plus lenalidomide regimen followed by MONJUVI monotherapy provided prolonged, durable responses in adult patients with r/r DLBCL. \nIn August 2020, we and MorphoSys announced that MONJUVI in combination with lenalidomide had been included in the latest NCCN Clinical Practice Guidelines in Oncology for B-cell Lymphomas. \nIn August 2021, we and MorphoSys announced that the European Commission had granted conditional marketing authorization for MINJUVI (tafasitamab) in combination with lenalidomide, followed by MINJUVI monotherapy, for the treatment of adult patients with relapsed or refractory DLBCL who are not eligible for autologous stem cell transplant (ASCT). The conditional approval was based on the three-year results from the L-MIND study evaluating the safety and efficacy of MINJUVI in combination with lenalidomide as a treatment for patients with r/r DLBCL who are not eligible for ASCT. The results showed best objective response rate (ORR) of 56.8% (primary endpoint), including a complete response (CR) rate of 39.5% and a partial response rate (PR) of 17.3%, as assessed by an independent review committee. The median duration of response (mDOR) was 43.9 months after a minimum follow up of 35 months (secondary endpoint). MINJUVI together with lenalidomide was shown to provide a clinically meaningful response and the side effects were manageable. Warnings and precautions for MINJUVI include infusion-related reactions, myelosuppression, including neutropenia and thrombocytopenia, infections and tumour lysis syndrome.\nIn December 2024, we submitted a sBLA for tafasitamab in relapsed or refractory follicular lymphoma (FL) to the FDA.\nPEMAZYRE (pemigatinib)\nPEMAZYRE is the first internally discovered product to be internationally commercialized by us.\nIn April 2020, we announced that the FDA had approved PEMAZYRE (pemigatinib), a selective fibroblast growth factor receptor (FGFR) kinase inhibitor, for the treatment of adults with previously treated, unresectable locally advanced or metastatic cholangiocarcinoma with an FGFR2 fusion or other rearrangement as detected by an FDA-approved test. PEMAZYRE is the first FDA-approved treatment for this indication, which was approved under accelerated approval based on overall response rate and duration of response (DOR). \nIn March 2021, PEMAZYRE was approved by the Japanese Ministry of Health, Labour and Welfare (MHLW) for the treatment of patients with unresectable biliary tract cancer (BTC) with an FGFR2 fusion gene, worsening after cancer chemotherapy. Also in March 2021, PEMAZYRE was approved by the European Commission for the treatment of adults with locally advanced or metastatic cholangiocarcinoma with an FGFR2 fusion or rearrangement that has progressed after at least one prior line of systemic therapy. \nIn July 2021, the UK’s National Institute for Health and Care Excellence (NICE) recommended PEMAZYRE for patients with cholangiocarcinoma with a fibroblast growth factor receptor 2 (FGFR2) fusion or rearrangement that have progressed after at least one prior line of systemic therapy. NICE’s guidance enables all eligible patients in England and Wales to have access to PEMAZYRE through the National Health Service (NHS).\nIn March 2022, PEMAZYRE was approved by the National Medical Products Administration (NMPA) of the People\n’\ns Republic of China for the treatment of adults with locally advanced or metastatic cholangiocarcinoma with a fibroblast growth receptor 2 (FGFR2) fusion or rearrangement as confirmed by a validated diagnostic test that has progressed after at least one prior line of systemic therapy. \n10\nTable of Contents\n \nCholangiocarcinoma is a rare cancer that arises from the cells within the bile ducts. It is often diagnosed late (stages III and IV) and the prognosis is poor. The incidence of cholangiocarcinoma with FGFR2 fusions or rearrangements is increasing, and it is currently estimated that there are 2,000-3,000 patients in the United States, Europe and Japan.\nThe approval of PEMAZYRE was based on data from FIGHT-202, a multi-center, open-label, single-arm study evaluating PEMAZYRE as a treatment for adults with cholangiocarcinoma. In FIGHT-202, and in patients harboring FGFR2 fusions or rearrangements (Cohort A), PEMAZYRE monotherapy resulted in an overall response rate of 36% (primary endpoint), and median DOR of 9.1 months (secondary endpoint). FIGHT-302, a Phase 3 trial of pemigatinib for the first-line treatment of patients with cholangiocarcinoma and FGFR2 fusions or rearrangements, is ongoing.\nIn August 2022, PEMAZYRE was approved by the FDA as the first and only targeted treatment for myeloid/lymphoid neoplasms (MLNs) with FGFR1 rearrangement. MLNs with FGFR1 rearrangement are extremely rare and aggressive blood cancers. \nIn March 2023, PEMAZYRE was approved by the MHLW for the treatment of MLNs with FGFR1 fusion.\nICLUSIG (ponatinib)\nIn June 2016, we acquired the European operations of ARIAD Pharmaceuticals, Inc., and obtained an exclusive license to develop and commercialize ICLUSIG (ponatinib) in Europe and other select countries. ICLUSIG is a kinase inhibitor. The primary target for ICLUSIG is BCR-ABL, an abnormal tyrosine kinase that is expressed in chronic myeloid leukemia (CML) and Philadelphia-chromosome positive acute lymphoblastic leukemia (Ph+ ALL).\nIn the European Union, ICLUSIG is approved for the treatment of adult patients with chronic phase, accelerated phase or blast phase CML who are resistant to dasatinib or nilotinib; who are intolerant to dasatinib or nilotinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation, or the treatment of adult patients with Ph+ ALL who are resistant to dasatinib; who are intolerant to dasatinib and for whom subsequent treatment with imatinib is not clinically appropriate; or who have the T315I mutation. \nZYNYZ (retifanlimab-dlwr)\nIn October 2017, we and MacroGenics, Inc., announced an exclusive global collaboration and license agreement for MacroGenics’ retifanlimab (formerly INCMGA0012), a humanized monoclonal antibody targeting programmed death receptor-1 (PD-1). Under this collaboration, we obtained exclusive worldwide rights for the development and commercialization of retifanlimab in all indications. The molecule currently is being evaluated both as monotherapy and in combination therapy across various tumor types. Two Phase 3 trials evaluating retifanlimab in squamous cell anal cancer (SCAC) and non-small cell lung cancer (NSCLC) are ongoing. \nIn March 2023, we announced that the FDA had approved ZYNYZ (retifanlimab-dlwr) under accelerated approval, for the treatment of adults with metastatic or recurrent locally advanced Merkel cell carcinoma (MCC). This represents the first regulatory approval for our PD-1 inhibitor.\nIn April 2024, the European Commission approved ZYNYZ (retifanlimab) as monotherapy for the first-line treatment of adult patients with metastatic or recurrent locally advanced MCC not amenable to curative surgery or radiation therapy following a positive opinion from the Committee for Medicinal Products for Human Use (CHMP).\nIn September 2024, we announced positive results from the Phase 3 POD1UM-303/InterAACT2 trial of ZYNYZ (retifanlimab) in combination with platinum-based chemotherapy (carboplatin–paclitaxel) for the treatment of adults with inoperable locally recurrent or metastatic SCAC. \nIn December 2024, the supplemental Biologics License Application (sBLA) submission for retifanlimab in advanced/metastatic SCAC was filed with the FDA with approval anticipated in the second half of 2025. \n11\nTable of Contents\n \nNIKTIMVO (axatilimab-csfr)\nIn September 2021, we and Syndax Pharmaceuticals, Inc. announced an exclusive worldwide collaboration and license agreement to develop and commercialize axatilimab, Syndax’s anti-CSF-1R monoclonal antibody. Together, we are developing axatilimab as a therapy for patients with chronic GVHD where CSF-1R-dependent monocytes and macrophages are believed to contribute to organ fibrosis. In December 2021, updated positive data were presented at ASH from the Phase 1/2 trial evaluating axatilimab as a monotherapy in patients with recurrent or refractory chronic GVHD after two or more prior lines of therapy. A 68% overall response rate and broad clinical benefit across multiple organs were observed at doses being assessed in AGAVE-201, a global pivotal trial evaluating axatilimab monotherapy in patients with chronic GVHD in the third line setting. In May 2022, Syndax announced that axatilimab had been granted fast-track designation by the FDA for the treatment of patients with chronic GVHD after failure of two or more lines of systemic therapy.\nIn July 2023, we and Syndax announced that AGAVE-201 had met its primary endpoint across all cohorts with an overall response rate (ORR) of 74% at the dose of 0.3 mg/kg administered every two weeks. The data highlight the durable response seen at the 0.3 mg/kg dose with 60% of patients who responded to axatilimab still responding at one year. In December 2023, a Biologics License Application (BLA) was submitted to the FDA for axatilimab for the treatment of patients with chronic GVHD after failure of two or more lines of systemic therapy and accepted for Priority Review in February 2024. We have initiated two combination trials with axatilimab in cGVHD in 2024, including a randomized Phase 2 combination trial with ruxolitinib and a randomized Phase 3 combination trial with steroids, both directed at treating patients with cGVHD in earlier lines of therapy. \nIn August 2024, we and Syndax announced the FDA approval of NIKTIMVO (axatilimab-csfr) for the treatment of chronic GVHD after failure of at least two prior lines of systemic therapy in adult and pediatric patients. NIKTIMVO is the first approved anti-CSF-1R antibody targeting the drivers of inflammation and fibrosis seen in chronic GVHD. In September, we and Syndax announced the New England Journal of Medicine publication of data from the pivotal AGAVE-201 trial of NIKTIMVO in chronic GVHD and the addition of NIKTIMVO to the NCCN Clinical Practice Guidelines in Oncology for the treatment of chronic GVHD. In January 2025, the FDA approved two smaller vial sizes (9mg and 22mg) of NIKTIMVO to facilitate patient dosing and limit product waste. The U.S. commercial launch of NIKTIMVO commenced at th\ne end of January 2025. \nClinical Programs in Hematology and Oncology\nRuxolitinib\nWe are evaluating combinations of ruxolitinib with other therapeutic modalities, as well as developing a once-a-day formulation of ruxolitinib for potential use as monotherapy and in combinations. Bioavailability and bioequivalence data were published for ruxolitinib’s once-daily (QD) extended release (XR) formulation at the European Hematology Association (EHA) Virtual Congress in June 2021. In March 2023, the FDA issued a complete response letter for ruxolitinib extended-release (XR) tablets for once-daily (QD) use in the treatment of certain types of MF, PV and GVHD. In December 2023, we\n received FDA feedback and agreed on the requirements to address the complete response letter.\nPhase 2 trials combining ruxolitinib with investigational agents from our portfolio such as INCB57643 (BET) in patients with MF are ongoing with data presented demonstrating early signals of clinical activity in monotherapy and in combination with ruxolitinib. \nIn December 2022, new research detailing the development and mechanism of action of INCA033989, an Incyte-discovered, investigational novel anti-mutant calreticulin (CALR)-targeted monoclonal antibody, was featured in the Plenary Scientific Session at the 64th American Society of Hematology (ASH) Annual Meeting. INCA033989 binds with high affinity to mutant CALR and inhibits oncogenesis, the process of cells becoming cancerous, in cells expressing this oncoprotein. CALR mutations are responsible for disease development in approximately 25-35% of patients with MF and ET. In July 2023, a Phase 1 study evaluating INCA033989 was initiated. \n12\nTable of Contents\n \nINCB160058 (JAK2V617Fi)\nIn December 2023, new research detailing the development and mechanism of action of INCB160058, an Incyte-discovered, investigational novel potent and selective JAK2 pseudokinase domain binder with potential to be a disease modifying therapeutic was disclosed at the 65th American Society of Hematology (ASH) Annual Meeting.  Pseudokinase binding offers a new mechanism of action for selective inhibition of JAK2V617F, with potential to eradicate mutant clones. In preclinical studies, INCB160058 inhibited cytokine independent activity of JAK2V617F while sparing WT JAK2. The JAK2V617F mutation is found in 55% of primary myelofibrosis, 95% of polycythemia vera and 60% of essential thrombocythemia patients. A Phase 1 study of INCB160058 was initiated in the first quarter of 2024.\nTafasitamab\nTafasitamab is an anti-CD19 antibody and is being investigated as a therapeutic option in B cell malignancies in a number of ongoing and planned combination trials. An open-label Phase 2 combination trial (L-MIND) is investigating the safety and efficacy of tafasitamab in combination with lenalidomide in patients with relapsed or refractory diffuse large B-cell lymphoma (r/r DLBCL), and the ongoing Phase 3 B-MIND trial is assessing the combination of tafasitamab and bendamustine versus rituximab and bendamustine in r/r DLBCL. firstMIND is a Phase 1b safety trial of tafasitamab as a first-line therapy for patients with DLBCL, and frontMIND, a placebo-controlled Phase 3 trial evaluating tafasitamab in combination with lenalidomide added to rituximab plus chemotherapy (R-CHOP) as a first-line therapy for patients with DLBCL, is ongoing.\nIn January 2021, the FDA granted orphan drug designation to tafasitamab as a treatment for patients with follicular lymphoma.\nIn December 2024, we announced the full results from the pivotal Phase 3 inMIND trial evaluating treatment with tafasitamab in combination with lenalidomide and rituximab compared with placebo plus lenalidomide and rituximab in patients with relapsed or refractory follicular lymphoma (FL).  The data showed that the study met its primary endpoint by demonstrating a statistically significant and clinically meaningful improvement in progression-free survival (PFS) by investigator assessment in 548 patients with FL. Tafasitamab was generally well-tolerated, and safety was consistent with other CD19 and immunotherapy combination regimens. \nRetifanlimab \nIn July 2024, we announced positive topline results from both the two Phase 3 clinical studies evaluating retifanlimab, \na humanized monoclonal antibody targeting programmed cell death receptor-1 (PD-1),\n in SCAC and NSCLC. The phase 3 study in SCAC met its primary endpoint of progression free survival while the Phase 3 study in NSCLC meet its primary endpoint of overall survival. The safety analysis from both studies showed retifanlimab was generally well-tolerated with no new safety signals observed. POD1UM-303 is a Phase 3, global, multicenter, randomized, double-blind study evaluating carboplatin-paclitaxel with retifanlimab or placebo in patients with inoperable locally recurrent or metastatic SCAC who have not previously been treated with chemotherapy. POD1UM-304 is a Phase 3, global, multicenter, randomized, double-blind study evaluating platinum-based chemotherapy with retifanlimab or placebo in patients with first-line, metastatic squamous or nonsquamous NSCLC. \nIn September 2024, we presented late-breaking Phase 3 results for retifanlimab that were featured during the 2024 European Society for Medical Oncology (ESMO) Presidential Symposium. The Phase 3 POD1UM-303/InterAACT2 trial for retifanlimab met the primary endpoint of PFS and demonstrated improvement across key secondary endpoints in patients with SCAC receiving retifanlimab in combination with platinum-based chemotherapy (carboplatin-paclitaxel). \n13\nTable of Contents\n \nMPN, GVHD and Oncology Programs\nIndication and Phase\nRuxolitinib XR (QD)\n(JAK1/JAK2)\nMyelofibrosis, polycythemia vera and GVHD\nRuxolitinib + INCB57643\n(JAK1/JAK2 + BETi)\nMyelofibrosis: Phase 2\nRuxolitinib + axatilimab\n1\n(JAK1/JAK2 + anti-CSF-1R)\nChronic GVHD: Phase 2\nSteroids + axatilimab\n1\n(Steroids + anti-CSF-1R)\nChronic GVHD: Phase 3 \nINCA33989 \n(mutCALR)\nMyelofibrosis, essential thrombocythemia: Phase 1\nINCB160058\n(JAK2V617Fi)\nMyelofibrosis: Phase 1\nTafasitamab (MONJUVI/MINJUVI)\n(CD19)\nRelapsed or refractory diffuse large B-cell lymphoma (DLBCL): Phase 3 (B-MIND)\nFirst-line DLBCL: Phase 3 (\nfront\nMIND)\nRelapsed or refractory follicular lymphoma (FL): Phase 3 (\nin\nMIND)\nRetifanlimab (ZYNYZ)\n2\n(PD-1)\nSquamous cell anal cancer (SCAC): Phase 3 (POD1UM-303) \nNon-small cell lung cancer (NSCLC): Phase 3 (POD1UM-304)\nMSI-high endometrial cancer: Phase 2 (POD1UM-101, POD1UM-204)\nINCB123667\n(CDK2i)\nSolid tumors with CCNE1 amplification/Cyclin E overexpression: Phase 1\nINCB161734\n(KRASG12D)\nAdvanced metastatic solid tumors with a KRASG12D mutation: Phase 1\nINCA33890\n(TGFßR2×PD-1)\n3\nAdvanced or metastatic solid tumors: Phase 1\n1.\nClinical development of axatilimab in GVHD conducted in collaboration with Syndax Pharmaceuticals.\n2.\nRetifanlimab licensed from MacroGenics.\n3.\nDevelopment collaboration with Merus.\n \nEarlier-Stage Development Programs in Hematology and Oncology\nIn July 2024, we announced a strategic review of our pipeline with an increased focus on high potential impact programs. As a result, we discontinued further development of both oral, small molecule PD-L1 inhibitors. Additionally, we plan to forgo further development of our LAG-3 monoclonal antibody, TIM-3 monoclonal antibody and LAG-3xPD-1 bispecific program.  \nINCB123667 (CDK2)\nIn the cell cycle, the serine threonine kinase, CDK2, regulates the transition from the G1 phase (cell growth) to the S-phase (DNA replication). INCB123667 is a novel, potent and selective oral small molecule inhibitor of CDK2 which has been shown to suppress tumor growth as monotherapy and in combination with standard of care, in Cyclin E amplified tumor models, in vivo. \nIn April 2023, we presented data at the American Association for Cancer Research (AACR) Annual Meeting, demonstrating that INCB123667 exhibited significant single-agent activity in vivo, in CCNE1 high breast cancer xenograft and patient-derived xenograft models. INCB123667 currently is being evaluated in a Phase 1 clinical trial in patients with advanced malignancies including CCNE1 high TNBC and HR+HER2- tumors post-CDK4/6 inhibitors.\nIn January 2024, we disclosed that early clinical activity was observed in patients with amplification/over expression of CCNE1 in a Phase 1 clinical trial, with significant tumor shrinkage observed. Several patients achieved partial responses (PR) across multiple tumor types including ovarian cancer patients with CCNE1 amplification and/or over expression. The safety data seen during this disclosure aligns with CDK2 mechanism of action. Additional data from this trial is anticipated in 2025.\n14\nTable of Contents\n \nIn September 2024, we presented initial data from the Phase 1 CDK2 inhibitor program at the 2024 ESMO Congress. Phase 1 data of INCB123667 were presented demonstrating single-agent antitumor activity across a range of doses and regimens, notably in patients with ovarian cancer and endometrial cancer whose tumors overexpress Cyclin E1. The Phase 1 trial is ongoing with INCB123667 in combination with other agents. We currently anticipate initiating a pivotal trial in ovarian cancer in 2025.\nINCB161734 (KRASG12D)\nA Phase 1 study evaluating INCB161734 (KRASG12D) was initiated in the first quarter of 2024. INCB161734 is a potent, selective and orally bioavailable KRAS G12D inhibitor and, as highlighted at AACR in April 2024, has shown excellent efficacy in several preclinical models. With no currently approved G12D-targeting agents, INCB161734 could address an important patient need as the KRASG12D mutation is found in 40% of pancreatic ductal adenocarcinoma, 15% of colorectal cancers, and 5% of non-small cell lung cancers.  Data from the ongoing Phase 1 study is expected in 2025. \nINCA33890 (TGFβR2xPD-1)\n1\nINCA33890 is a TGFβR2xPD-1 bispecific antibody that has been engineered to avoid the known toxicity of broad TGFβ pathway blockade. INCA33890 has a 10-fold higher binding affinity for PD-1 relative to TGFβR2, and specifically blocks TGFβ signaling in cells co-expressing PD-1. In April 2023, we presented preclinical data at AACR that showed that INCA33890 inhibits tumor growth in PD-1-resistant mouse models. In July 2023, we initiated a Phase 1 study evaluating INCA33890 in patients with select advanced solid tumors. Data from the ongoing Phase 1 study is expected in 2025. \nInflammation and AutoImmunity (IAI)\nIncyte Dermatology launched its first approved product, OPZELURA (ruxolitinib) cream, in October 2021, following FDA approval for atopic dermatitis in September 2021. OPZELURA subsequently was approved by the FDA and European Commission for vitiligo in July 2022 and April 2023, respectively.  \nOur IAI efforts also include numerous clinical development programs. \nOPZELURA (ruxolitinib) cream\nAtopic Dermatitis\n. In September 2021, we announced that the FDA approved OPZELURA (ruxolitinib) cream, a novel cream formulation of Incyte’s selective JAK1/JAK2 inhibitor ruxolitinib, for the topical short-term and non-continuous chronic treatment of mild to moderate atopic dermatitis (AD) in non-immunocompromised patients 12 years of age and older whose disease is not adequately controlled with topical prescription therapies, or when those therapies are not advisable.\nAD is a skin disorder that causes long term inflammation of the skin resulting in itchy, red, swollen and cracked skin. Onset can occur at any age but is more common in infants and children. In the United States, we estimate that there are approximately 10 million diagnosed adolescent and adult patients with AD.\nThe approval of OPZELURA was based on data from two randomized, double-blind, vehicle-controlled Phase 3 studies (TRuE-AD1 and TRuE-AD 2) evaluating the safety and efficacy of OPZELURA in adolescents and adults with mild to moderate AD. Significantly more patients treated with OPZELURA achieved Investigator’s Global Assessment (IGA) Treatment Success at Week 8 (defined as an IGA score of 0 or 1 with at least a 2-point improvement from baseline, the primary endpoint: 53.8% in TRuE-AD1 and 51.3% in TRuE-AD2, compared to vehicle (15.1% in TRuE-AD1, 7.6% in TRuE-AD2; P<0.0001)). Significantly more patients treated with OPZELURA experienced a clinically meaningful reduction in itch from baseline at Week 8, as measured by a ≥4-point reduction in the itch Numerical Rating Scale (itch NRS4): 52.2% in TRuE-AD1 and 50.7% in TRuE-AD2, compared to vehicle (15.4% in TRuE-AD1, 16.3% in TRuE-AD2; P<0.0001), among patients with an NRS score of at least 4 at baseline. The most common (≥1%) treatment-emergent adverse reactions in patients treated with OPZELURA were nasopharyngitis, diarrhea, bronchitis, ear infection, eosinophil count increased, urticaria, folliculitis, tonsillitis and rhinorrhea.\n1\n In collaboration with Merus.\n15\nTable of Contents\n \nVitiligo. \nIn July 2022, we announced that the FDA approved OPZELURA for the topical treatment of nonsegmental vitiligo in adult and pediatric patients 12 years of age and older. OPZELURA was approved for continuous use and no limits to duration as a treatment for nonsegmental vitiligo.\nVitiligo is a chronic autoimmune depigmenting skin disease characterized by patches of the skin losing their pigment. OPZELURA is the first and only FDA approved treatment for repigmentation of vitiligo lesions.\nThe approval of OPZELURA in vitiligo was based on two randomized, double-blind, vehicle-controlled Phase 3 studies (TRuE-V1 and TRuE-V2) evaluating the safety and efficacy of OPZELURA in adolescents and adults with nonsegmental vitiligo. Treatment with 1.5% ruxolitinib cream twice daily (BID) resulted in greater improvement versus vehicle for the primary and all key secondary endpoints in both the TRuE-V1 and TRuE-V2 studies. Results, which were consistent across both studies, showed that 29.9% of patients applying ruxolitinib cream achieved >75% improvement from baseline in the facial Vitiligo Area Scoring Index (F-VASI75) at Week 24, the primary endpoint. At Week 52, approximately 50% of patients achieved F-VASI75. The most common (>1%) treatment-emergent adverse reactions in patients treated with OPZELURA were application site acne, application site pruritus, nasopharyngitis, headache, urinary tract infection, application site erythema and pyrexia. In March 2023, long-term 104-week safety and efficacy data for ruxolitinib cream in vitiligo were presented at the American Academy of Dermatology (AAD) conference, demonstrating that patients who achieved a high level of facial repigmentation (≥F-VASI90) at Week 52 maintained durable response one year following withdrawal of treatment and that those patients who continued treatment with OPZELURA for up to two years demonstrated sustained facial repigmentation and further improvements in facial and total body repigmentation.\nIn April 2023, we announced that the European Commission had approved OPZELURA for the topical treatment of nonsegmental vitiligo with facial involvement in adults and adolescents 12 years and older following a positive opinion from the CHMP.\nIn October 2023, new results of a pooled analysis of long-term extension (LTE) data from the pivotal Phase 3 TRuE-V program assessing OPZELURA cream 1.5% in patients 12 years of age and older with nonsegmental vitiligo who previously experienced limited or no response to treatment at Week 24 were presented at the European Academy of Dermatology and Venereology (EADV) Congress 2023 as a late-breaking oral presentation. These results showed that patients who initially experienced limited or no facial or total body repigmentation at six months achieved improved repigmentation after continued treatment with OPZELURA for up to two years.\nIn October 2024, OPZELURA cream 1.5% was granted a Notice of Compliance by Health Canada for the topical treatment of both mild to moderate atopic dermatitis and nonsegmental vitiligo in patients 12 years of age and older. \nClinical Programs in Dermatology\nRuxolitinib cream\nRuxolitinib cream is a potent, selective inhibitor of JAK1 and JAK2 that provides the opportunity to directly target diverse pathogenic pathways that underlie certain dermatologic conditions, including AD, vitiligo, lichen planus, lichen sclerosus, hidradenitis suppurativa (HS) and prurigo nodularis (PN).\nIn November 2022, we initiated two Phase 2 trials evaluating ruxolitinib cream in lichen planus and lichen sclerosus. Lichen planus is a recurrent inflammatory condition affecting the skin and mucosal surfaces and can result in itchy, purple bumps on the skin. Two Phase 3 trials evaluating ruxolitinib cream in prurigo nodularis were initiated in 2023. We continue to expand the development of ruxolitinib cream into new indications as part of our efforts to maximize the potential opportunity with ruxolitinib cream.\nIn July 2023, we announced that the Phase 3 trial (TRuE-AD3) evaluating ruxolitinib cream in pediatric AD patients (age \n>\n2 and <12) had met its primary endpoint. The study showed that significantly more patients treated with ruxolitinib cream 0.75% and 1.5% achieved Investigator's Global Assessment Treatment Success (IGA-TS) than patients treated with vehicle control.  In October 2023, the expanded results from the pivotal Phase 3 TRuE-AD3 were presented at EADV. Again, significantly more patients treated with ruxolitinib cream (0.75% and 1.5%) achieved Investigator’s Global Assessment Treatment Success (IGA-TS) than patients treated with vehicle control (non-medicated cream). \n16\nTable of Contents\n \nIn January 2024, we announced positive topline results from a randomized controlled Phase 2 study evaluating ruxolitinib cream in HS.  Ruxolitinib 1.5% cream BID met the primary efficacy endpoint as measured by a change from baseline in abscess and nodule count at Week 16 versus placebo in patients with mild to moderate HS. Ruxolitinib cream was well tolerated and consistent with its known safety profile. A Phase 3 study is expected to initiate in 2025.\nIn October 2024, we disclosed results from the Phase 2 study of ruxolitinib cream in patients with cutaneous lichen planus. At this time, we do not plan to advance ruxolitinib cream into a registrational study for lichen planus and plan to publish the results of this study in the future. Additionally, the Phase 2 study evaluating ruxolitinib cream for lichen sclerosus did not meet our internal bar for success and at this time, we are not planning to advance this indication into a registrational study.\nIn October 2024, we announced the Phase 3 trial for ruxolitinib cream in mild to moderate HS is on track to initiate in the first half of 2025 following achieving alignment on the study design with the FDA. \nPovorcitinib\nWe also are developing povorcitinib, which is an oral small molecule selective JAK1 inhibitor. Povorcitinib is undergoing evaluation in patients with hidradenitis suppurativa, nonsegmental vitiligo, prurigo nodularis, asthma and chronic spontaneous urticaria (CSU). \nHidradenitis Suppurativa. \n HS is a chronic skin condition where lesions develop as a result of inflammation and infection of the sweat glands. In October 2020, initial results from the clinical program were presented and a randomized Phase 2b trial of povorcitinib was initiated in patients with HS. In August 2022, we presented positive results from the Phase 2 trial of povorcitinib in HS. \nIn December 2022, we initiated two Phase 3 trials (STOP-HS1 and STOP-HS2) in moderate to severe HS. \nIn February 2023, 52-week results from the Phase 2 study evaluating povorcitinib in HS were presented as an oral presentation at the European Hidradenitis Suppurativa Foundation (EHSF) Annual Meeting. The data demonstrated that longer-term treatment with povorcitinib 75 mg resulted in sustained and durable efficacy across all treatment arms and that importantly, 22-29% of patients achieved HiSCR100, which is defined as a 100% reduction from baseline in total AN count with no increase from baseline in abscess or draining tunnel count.\nNonsegmental Vitiligo. \nIn March 2023, 36-week results from the Phase 2b study evaluating povorcitinib in patients with extensive nonsegmental vitiligo were presented as an oral late-breaking presentation at the American Academy of Dermatology (AAD) Annual Meeting. The data demonstrated that treatment with oral povorcitinib was associated with substantial total body repigmentation in patients with extensive nonsegmental vitiligo, as measured by total Vitiligo Area Scoring Index (T-VASI) scores. Specifically, the study met its primary endpoint, and patients receiving povorcitinib experienced statistically superior improvements in T-VASI at Week 24 compared to placebo.\nIn October 2023, positive 52-week data from a Phase 2b clinical trial evaluating the safety and efficacy of povorcitinib\n \nin adult patients with extensive nonsegmental vitiligo were presented at EADV as a late-breaking oral presentation. Results showed that treatment with oral povorcitinib was associated with substantial total body and facial repigmentation across all treatment groups at Week 52 and further reinforces the efficacy profile and potential of povorcitinib as an oral treatment for patients with extensive nonsegmental vitiligo.\nPrurigo Nodularis. \nIn October 2023, we announced that the Phase 2, randomized, double-blind, placebo-controlled, dose ranging study evaluating the efficacy and safety of povorcitinib\n \nin participants with PN had met its primary endpoint.  In October 2024, following the positive Phase 2 results, two \nPhase 3 studies in patients with PN were initiated. \nAsthma and Chronic Spontaneous Urticaria. \nIn July 2023, we initiated two Phase 2 trials evaluating povorcitinib in patients with moderate to severe uncontrolled asthma and in chronic spontaneous urticaria. \nData for CSU are anticipated in the first half of 2025 and data in asthma are anticipated in the second half of 2025. \n17\nTable of Contents\n \nINCB000262 (MRGPRX2) & INCB000547 (MRGPRX4)\nAs more fully described in Note 5 of Notes to the Consolidated Financial Statements, in May 2024, we acquired Escient Pharmaceuticals, Inc. \nEscient is a clinical-stage drug discovery and development company advancing novel small molecule therapeutics for systemic immune and neuro-immune disorders. Escient’s clinical development portfolio includes \nINCB000262\n, a potent, highly selective, once-daily small molecule antagonist of Mas-related G protein-coupled receptor (MRGPRX2) and \nINCB000547\n, an oral MRGPRX4 antagonist. \nIn November 2024, we announced that enrollment was paused in the ongoing Phase 2 study of MRGPRX2 (INCB000262) in CSU. The decision was made following the observation of certain in vivo preclinical toxicology findings. These data have been shared with the FDA and at this time, we have no intention to enroll additional patients.  Enrollment in the other INCB000262 proof-of-concept studies in chronic inducible urticaria and AD is complete.\nIn November 2024, Incyte announced data from the Phase 2 study evaluating MRGPRX4 (INCB000547) in cholestatic pruritus did not support further development.\nIAI and Dermatology Programs\nIndication and Phase\nRuxolitinib cream (OPZELURA)\n1\n(JAK1/JAK2)\nAtopic dermatitis: Phase 3 pediatric study (TRuE-AD3)\nHidradenitis suppurativa: Phase 2; Phase 3 expected to initiate in 2025\nPrurigo nodularis: Phase 3 (TRuE-PN1, TRuE-PN2)\nPovorcitinib \n(JAK1)\nHidradenitis suppurativa: Phase 3 (STOP-HS1, STOP-HS2)\nVitiligo: Phase 3 (STOP-V1, STOP-V2)\nPrurigo nodularis: Phase 3 (STOP-PN1, STOP-PN2)\nChronic spontaneous urticaria: Phase 2\nAsthma: Phase 2\nINCA034460\n(anti-CD122)\nVitiligo: Phase 1\n1.\n \nNovartis’ rights for ruxolitinib outside of the United States under our Collaboration and License Agreement with Novartis do not include topical administration.\nEarlier-Stage Development Programs in Dermatology\nINCA034460 (anti-CD122)\n In November 2022, we acquired Villaris Therapeutics, Inc., an asset-centric biopharmaceutical company focused on the development of novel antibody therapeutics for vitiligo. INCA034460 is a novel, humanized anti-IL-15Rβ monoclonal antibody designed to target and deplete autoreactive tissue resident memory T cells (TRM) that has demonstrated efficacy as a treatment for vitiligo in preclinical models. \nIn July 2023, INCA034460 received Investigational New Drug application (IND) clearance and in October 2023, we announced the first patient had been dosed.\nClinical Programs in Other IAI\nIn May 2022, we initiated a Phase 2 trial evaluating zilurgisertib (INCB00928) in patients with fibrodysplasia ossificans progressiva (FOP), a disorder in which muscle tissue and connective tissue are gradually replaced by bone. The FDA has granted Fast Track designation and orphan drug designation to zilurgisertib as a treatment for patients with FOP.\nOther IAI Program\nIndication and Phase\nZilurgisertib \n(ALK2)\nFibrodysplasia ossificans progressiva: Pivotal Phase 2\n18\nTable of Contents\n \nCollaborative Partnered Programs\nAs described below under “License Agreements and Business Relationships,” we are eligible for milestone payments and royalties on certain products that we licensed to third parties. These include OLUMIANT (baricitinib), which is licensed to our collaborative partner Eli Lilly and Company, and JAKAVI (ruxolitinib) and TABRECTA (capmatinib), which are licensed to Novartis. \nBaricitinib\nWe have a second JAK1 and JAK2 inhibitor, baricitinib, which is subject to our collaboration agreement with Lilly, in which Lilly received exclusive worldwide development and commercialization rights to the compound for inflammatory and autoimmune diseases. \nRheumatoid Arthritis.\n Rheumatoid arthritis is an autoimmune disease characterized by aberrant or abnormal immune mechanisms that lead to joint inflammation and swelling and, in some patients, the progressive destruction of joints. Rheumatoid arthritis also can affect connective tissue in the skin and organs of the body.\nCurrent rheumatoid arthritis treatments include the use of non-steroidal anti-inflammatory drugs, disease-modifying anti-rheumatic drugs such as methotrexate, and the newer biological response modifiers that target pro-inflammatory cytokines, such as tumor necrosis factor, implicated in the pathogenesis of rheumatoid arthritis. None of these approaches to treatment is curative; therefore, there remains an unmet need for safe and effective treatment options for these patients. Rheumatoid arthritis is estimated to affect about 1% of the world’s population.\nThe Phase 3 program of baricitinib in patients with rheumatoid arthritis incorporated all three rheumatoid arthritis populations (methotrexate naïve, biologic naïve, and tumor necrosis factor (TNF) inhibitor inadequate responders); used event rates to fully power the baricitinib program for structural comparison and non-inferiority vs. adalimumab; and evaluated patient-reported outcomes. All four Phase 3 trials met their respective primary endpoints.\nIn January 2016, Lilly submitted a New Drug Application (NDA) to the FDA and an MAA to the European Medicines Agency (EMA) for baricitinib as treatment for rheumatoid arthritis. In February 2017, we and Lilly announced that the European Commission approved baricitinib as OLUMIANT for the treatment of moderate-to-severe rheumatoid arthritis in adult patients who have responded inadequately to, or who are intolerant to, one or more disease-modifying antirheumatic drugs (DMARDs). In July 2017, the MHLW granted marketing approval for OLUMIANT\n \nfor the treatment of rheumatoid arthritis (including the prevention of structural injury of joints) in patients with inadequate response to standard-of-care therapies. In June 2018, the FDA approved the 2mg dose of OLUMIANT for the treatment of adults with moderately-to-severely active rheumatoid arthritis (RA) who have had an inadequate response to one or more tumor necrosis factor (TNF) inhibitor therapies.\nAtopic Dermatitis. \nLilly has conducted a Phase 2a trial and a Phase 3 program to evaluate the safety and efficacy of baricitinib in patients with moderate-to-severe atopic dermatitis. The JAK-STAT pathway has been shown to play an essential role in the dysregulation of immune responses in atopic dermatitis. Therefore, we believe that inhibiting cytokine pathways dependent on JAK1 and JAK2 may lead to positive clinical outcomes in AD. \nIn February 2019, we and Lilly announced that baricitinib met the primary endpoint in BREEZE-AD1 and BREEZE-AD2, two Phase 3 studies evaluating the efficacy and safety of baricitinib monotherapy for the treatment of adult patients with moderate-to-severe AD and, in August 2019, we and Lilly announced that baricitinib met the primary endpoint in BREEZE-AD7, a Phase 3 study evaluating the efficacy and safety of baricitinib in combination with standard-of-care topical corticosteroids in patients with moderate-to-severe AD. In January 2020, we and Lilly announced that baricitinib met the primary endpoint in both BREEZE-AD4 and BREEZE-AD5, the results of which completed the placebo-controlled data program intended to support global registrations. A supplemental New Drug Application (sNDA) for baricitinib was submitted by Lilly for the treatment of patients with moderate to severe AD. In April 2021, we and Lilly announced the FDA extended the review period for the sNDA for baricitinib for the treatment of moderate to severe AD by three months to allow time for additional data analyses. In July 2021, we and Lilly announced that the FDA will not meet the PDUFA action date for the sNDA for baricitinib for the treatment of adults with moderate to severe AD due to the FDA's ongoing assessment of JAK inhibitors. In January 2022, Lilly provided a regulatory update on the sNDA based on ongoing discussions with the FDA. Lilly announced that alignment with the FDA on the indicated population had not yet been reached and given the FDA’s position, there would be the possibility of a Complete Response Letter (CRL).\n19\nTable of Contents\n \nIn January 2020, Lilly announced that baricitinib had been submitted for regulatory review in Europe as a treatment for patients with moderate-to-severe AD. In October 2020, Lilly announced that the European Commission approved baricitinib as OLUMIANT for the treatment of moderate-to-severe AD in adult patients who are candidates for systemic therapy. In December 2020, baricitinib was approved by the MHLW for the treatment of patients with moderate-to-severe AD.\nAlopecia Areata\n. Alopecia areata is an autoimmune disorder in which the immune system attacks the hair follicles, causing hair loss in patches. In March 2020, Lilly announced that baricitinib received Breakthrough Therapy designation for the treatment of alopecia areata, based on the positive Phase 2 results of Lilly’s adaptive Phase 2/3 study BRAVE-AA1. In March 2021, we and Lilly announced positive results from BRAVE-AA2, the Phase 3 trial evaluating the efficacy and safety of once-daily baricitinib in adults with severe alopecia areata. In April 2021, we and Lilly announced positive results from the Phase 3 portion of BRAVE-AA1. In September 2021, we and Lilly announced detailed results from BRAVE-AA1 and BRAVE-AA2 at the European Academy of Dermatology and Venereology Congress (EADV). The two studies showed statistically significant improvement in scalp hair regrowth across both baricitinib dosing groups when compared to placebo. In March 2022, we and Lilly announced positive 52 week results from BRAVE-AA1 and BRAVE-AA2 at the American Academy of Dermatology (AAD) annual meeting showing 40% of adults saw at least 80% scalp coverage. In June 2022, the FDA approved 2mg, and 4mg doses of OLUMIANT for the treatment of adults with severe alopecia areata, becoming the first and only systemic treatment in the indication. In June 2022, OLUMIANT was approved as a treatment for alopecia areata in Europe and Japan.\nSystemic Lupus Erythematosus.\n Systemic lupus erythematosus (SLE) is a chronic disease that causes inflammation. In addition to affecting the skin and joints, it can affect other organs in the body such as the kidneys, the tissue lining the lungs and heart, and the brain. Lilly has conducted a Phase 2 trial to evaluate the safety and efficacy of baricitinib in patients with SLE. Baricitinib’s activity profile suggests that it inhibits cytokines implicated in SLE such as type I interferon (IFN), type II IFN-γ, IL-6, and IL-23 as well as other cytokines that may have a role in SLE, including granulocyte macrophage colony stimulating factor (GM-CSF) and IL-12. \nIn January 2022, Lilly announced the discontinuation of the Phase 3 development program for baricitinib in SLE based on top-line efficacy results from two pivotal Phase 3 trials (SLE-BRAVE-I and –II). The primary endpoint of SRI-4 response was reached in SLE-BRAVE-I but was not reached in SLE-BRAVE-II and key secondary endpoints were not met in either study.\nCOVID-19.\n In May 2020, we amended our agreement with Lilly to enable Lilly to commercialize baricitinib for the treatment of COVID-19. In November 2020, we and Lilly announced that the FDA issued an Emergency Use Authorization (EUA) for the distribution and emergency use of baricitinib to be used in combination with remdesivir in hospitalized adult and pediatric patients two years of age or older with suspected or laboratory confirmed COVID-19 who require supplemental oxygen, invasive mechanical ventilation, or extracorporeal membrane oxygenation. In December 2020, we and Lilly announced that data from ACTT-2 supportive of the EUA were published in the New England Journal of Medicine. In July 2021, we and Lilly announced that the FDA broadened the EUA for baricitinib to allow for treatment with or without remdesivir. The EUA now provides for the use of baricitinib for treatment of COVID-19 in hospitalized adults and pediatric patients two years of age or older requiring supplemental oxygen, non-invasive or invasive mechanical ventilation or extracorporeal membrane oxygenation (ECMO).  In June 2022, we and Lilly announced the FDA approved baricitinib as OLUMIANT for the treatment of COVID-19 in hospitalized adults requiring supplemental oxygen, non-invasive or invasive mechanical ventilation or ECMO.\nCapmatinib\nCapmatinib is a potent and highly selective MET inhibitor. The investigational compound has demonstrated inhibitory activity in cell-based biochemical and functional assays that measure MET signaling and MET dependent cell proliferation, survival and migration. Under our agreement, Novartis received worldwide exclusive development and commercialization rights to capmatinib and certain back-up compounds in all indications. Capmatinib is being evaluated in patients with hepatocellular carcinoma, non-small cell lung cancer and other solid tumors, and may have potential utility as a combination agent.\nMET is a clinically validated receptor kinase cancer target. Abnormal MET activation in cancer correlates with poor prognosis. Dysregulation of the MET pathway triggers tumor growth, formation of new blood vessels that supply the tumor with nutrients and causes cancer to spread to other organs. Dysregulation of the MET pathway is seen in many types of cancers, including lung, kidney, liver, stomach, breast and brain.\n20\nTable of Contents\n \nIn May 2020, we and Novartis announced the FDA approval of capmatinib as TABRECTA for the treatment of adult patients with metastatic NSCLC whose tumors have a mutation that leads to MET exon 14 skipping (METex14) as detected by an FDA-approved test. TABRECTA is the first and only treatment approved to specifically target NSCLC with this driver mutation and is approved for first-line and previously treated patients regardless of prior treatment type. \nThe FDA approval of TABRECTA was based on results from the pivotal GEOMETRY mono-1 study. In the METex14 population (n=97), the confirmed overall response rate was 68% and 41% among treatment-naive (n=28) and previously treated patients (n=69), respectively, based on the Blinded Independent Review Committee (BIRC) assessment per RECIST v1.1. In patients taking TABRECTA, the study also demonstrated a median duration of response of 12.6 months in treatment-naive patients (19 responders) and 9.7 months in previously treated patients (28 responders). The most common treatment-related adverse events (AEs) (incidence ≥20%) are peripheral edema, nausea, fatigue, vomiting, dyspnea, and decreased appetite. In September 2020, we and Novartis announced that GEOMETRY mono-1 results were published in The New England Journal of Medicine.\nIn June 2020, we and Novartis announced that the MHLW approved TABRECTA for METex14 mutation-positive advanced and/or recurrent unresectable NSCLC. In April 2022, we and Novartis announced a positive opinion from the CHMP based on data from the Phase 2 GEOMETRY mono-1 study showing an overall response rate (ORR) of 51.6% in a cohort evaluating second-line patients only and 44% in all previously-treated patients with advanced non-small cell lung cancer (NSCLC) harboring alterations leading to MET exon 14 skipping.\nIn June 2022, we and Novartis announced the European Commission approval of capmatinib as TABRECTA as monotherapy treatment of adults with advanced non-small cell lung cancer (NSCLC) harboring alterations leading to mesenchymal-epithelial-transition factor gene (MET) exon 14 (METex14) skipping who require systemic therapy following prior treatment with immunotherapy and/or platinum-based chemotherapy.\nNSCLC is the most common type of lung cancer, impacting more than 2 million people per year globally. Approximately 3-4 percent of all patients with NSCLC have tumors with a mutation that leads to MET exon 14 skipping. Though rare, this mutation is an indicator of especially poor prognosis and poor responses to standard therapies, including immunotherapy. \nRuxolitinib\nGraft-versus-host disease.\n In March 2022, we and Novartis announced a positive opinion from the CHMP for ruxolitinib in acute and chronic GVHD, based on data from the Phase 3 REACH2 and REACH3 trials. GVHD is a life-threatening complication of stem cell transplants, with no established standard of care in Europe for patients who do not adequately respond to first-line steroid treatment. In May 2022, we and Novartis announced the European Commission approval of ruxolitinib as JAKAVI for the treatment of acute or chronic GVHD in patients aged 12 years and older who have inadequate response to corticosteroids or other systemic therapies. \nIn August 2023, Novartis announced that JAKAVI had been approved in Japan for use in graft-versus-host disease after hematopoietic stem cell transplant.\nPartnered Programs\nIndication and Phase\nRuxolitinib (JAKAVI)\n1\n(JAK1/JAK2)\nAcute and chronic GVHD: Approved in Europe and Japan\nBaricitinib (OLUMIANT)\n2\n(JAK1/JAK2)\nAD: Approved in Europe and Japan \nSevere alopecia areata (AA): Approved in the U.S., Europe and Japan\nRA: Approved in the U.S., Europe and Japan\nCapmatinib (TABRECTA)\n3\n(MET)\nNSCLC (with MET exon 14 skipping mutations): Approved in the U.S., Europe and Japan\n1.\nRuxolitinib (JAKAVI) licensed to Novartis outside of the United States for use in hematology and oncology excluding topical administration.\n2.\n Baricitinib (OLUMIANT) licensed to Lilly.\n3.\n Capmatinib (TABRECTA) licensed to Novartis.\n21\nTable of Contents\n \nLicense Agreements and Business Relationships\nWe establish business relationships, including collaborative arrangements with other companies and medical research institutions to assist in the clinical development and/or commercialization of certain of our drugs and drug candidates and to provide support for our research programs. We also evaluate opportunities for acquiring products or rights to products and technologies that are complementary to our business from other companies and medical research institutions.\nBelow is a brief description of our significant business relationships and collaborations and related license agreements that expand our pipeline and provide us with certain rights to existing and potential new products and technologies. Additional information regarding our collaboration agreements, including their financial and accounting impact on our business and results of operations, can be found in Note 5 and Note 7 of Notes to the Consolidated Financial Statements.\nOut-License Agreements\nNovartis\nIn November 2009, we entered into a Collaboration and License Agreement with Novartis. Under the terms of the agreement, Novartis received exclusive development and commercialization rights outside of the United States to ruxolitinib and certain back up compounds for hematologic and oncology indications, including all hematological malignancies, solid tumors and myeloproliferative diseases. We retained exclusive development and commercialization rights to JAKAFI (ruxolitinib) in the United States and in certain other indications. Novartis also received worldwide exclusive development and commercialization rights to our MET inhibitor compound capmatinib and certain back up compounds in all indications. We retained options to co-develop and to co-promote capmatinib in the United States. In April 2016, we amended this agreement to provide that Novartis has exclusive research, development and commercialization rights outside of the United States to ruxolitinib (excluding topical formulations) in the GVHD field.\nLilly\nIn December 2009, we entered into a License, Development and Commercialization Agreement with Lilly. Under the terms of the agreement, Lilly received exclusive worldwide development and commercialization rights to baricitinib and certain back up compounds for inflammatory and autoimmune diseases. In March 2016, we entered into an amendment to the agreement with Lilly that allows us to engage in the development and commercialization of ruxolitinib in the GVHD field. In May 2020, we amended our agreement with Lilly to enable Lilly to commercialize baricitinib for the treatment of COVID-19. \nIn-License Agreements\nMacroGenics\nIn October 2017, we entered into a Global Collaboration and License Agreement with MacroGenics. Under this agreement, we received exclusive development and commercialization rights worldwide to MacroGenics’ INCMGA0012, an investigational monoclonal antibody that inhibits PD-1. MacroGenics has retained the right to develop and commercialize, at its cost and expense, its pipeline assets in combination with INCMGA0012. \nMerus\nIn December 2016, we entered into a Collaboration and License Agreement with Merus. Under this agreement, which became effective in January 2017, the parties have agreed to collaborate with respect to the research, discovery and development of bispecific antibodies utilizing Merus’ technology platform. The collaboration encompasses up to ten independent programs. \n22\nTable of Contents\n \nSyndax\nIn September 2021, we entered into a Collaboration and License Agreement with Syndax covering the worldwide development and commercialization of NIKTIMVO (axatilimab-csfr), Syndax’s anti-CSF-1R monoclonal antibody. Under the terms of this agreement, we received exclusive commercialization rights to axatilimab outside of the United States, and co-commercialization rights in the United States.\nIncyte’s Approach to Drug Discovery and Development\nOur productivity in drug discovery is primarily a result of our core competency in medicinal chemistry which is tightly integrated with, and supported by, an experienced team of biologists and pharmaceutical scientists with expertise in multiple therapeutic areas. In addition to our small molecules expertise, we have added a biologics discovery capability in-house and have expanded our discovery scope to include bispecific antibodies through a collaboration with Merus.\nThis discovery team operates in concert with an equally experienced drug development organization with expertise in clinical sciences, statistics, and regulatory affairs. Our drug development organization manages our clinical programs and utilizes clinical research organizations (CROs), expert scientific advisory boards, and leading consultants and suppliers as appropriate to ensure our clinical trials are conducted efficiently, effectively, and in accordance with regulatory and compliance guidelines. \nTo succeed in our objective to discover and advance novel therapeutics that address serious unmet medical needs, we have established a broad range of discovery capabilities in-house, including target validation, high-throughput screening, medicinal chemistry, computational chemistry, structural biology, pharmacological and translational sciences, ADME (absorption, distribution, metabolism and excretion) and toxicology assessment. We augment these capabilities through collaborations with academic and contract laboratory resources with relevant expertise. \nDriven by a target- and pathway-centric discovery process, our pipeline has grown and is currently focused primarily in targeted oncology and dermatology. We conduct a limited number of discovery programs in parallel at any one time. This focus allows us to allocate resources to our selected programs at a level that we believe is competitive with larger pharmaceutical companies. We resource our discovery efforts with the goals of maximizing information content when and where we need it and ensuring that each program, regardless of stage, is executed in the most efficient and data-rich manner possible. We believe this approach has played a critical role in the development of our product portfolio.\nOnce our compounds reach clinical development, our objective is to rapidly progress the lead candidate into a proof-of-concept clinical trial to assess quickly the therapeutic potential of the clinical candidate itself as well as its underlying mechanism of action. This information is then used to evaluate the compound’s development opportunities, identify the most appropriate indication(s) to pursue, and develop a clinical and regulatory plan to advance the molecule.\nOur development teams are responsible for ensuring that our clinical candidates are expeditiously progressed through clinical safety, proof-of-concept, and formal efficacy/pivotal trials. Our development teams include employees with expertise in drug development, including clinical trial design, statistics, regulatory affairs, medical affairs, pharmacovigilance and project management. We have also built internal chemistry, manufacturing and controls, and formulation teams that work closely with external GMP contract manufacturers to support our drug development efforts.\nIncyte’s Commercial Strategy\nOur strategy is to develop and commercialize compounds that we have internally discovered or have acquired rights to in the markets where we believe that a company of our size can successfully compete. We currently commercialize six compounds in the United States, three in Europe and one in Japan. These commercialized products are sold to specialty and retail pharmacies, specialty distributors and wholesalers in the United States in addition to retail pharmacies, hospital pharmacies, distributors and an exclusive wholesaler outside of the United States. We continue to expand our marketing, medical and operational infrastructure within the United States and outside of the United States to support the commercial launch of recently approved products and to prepare for potential approval of other products.\nFor certain compounds, we have established and may in the future establish collaborations or strategic relationships to support development and commercialization in certain territories or therapeutic areas where we do not have or do not want to build expertise. We believe the key benefits to entering into such strategic relationships include the potential to expedite the development and commercialization of certain of our compounds, as well as the opportunity to \n23\nTable of Contents\n \nreceive upfront payments and future milestones and royalties in exchange for certain rights to those compounds. Refer to the “License Agreements and Business Relationships” section above for information regarding our collaborations and strategic relationships. \nPatents, Other Intellectual Property, and Product Exclusivity\nWe regard the protection of patents and other enforceable intellectual property rights that we own or license as critical to our business and competitive position. Accordingly, we rely on patent, trademark, trade secret and copyright law, as well as nondisclosure and other contractual arrangements, to protect our intellectual property. We have established a patent portfolio of patents and patent applications owned or licensed by us that cover aspects of our drug products and drug candidates. Our policy is to pursue patent applications on inventions and discoveries that we believe are commercially important to the development and growth of our business. As a general matter, we endeavor to obtain patent term extensions (PTEs) in the United States and Japan, and other countries where available, and supplementary protection certificates (SPCs) in each European country, upon approval by the respective regulatory agency, if patent rights are granted in such country. \nThe following table sets forth the year in which the basic exclusivity loss is currently estimated to occur in the United States, the European Union, and Japan for each of our approved medicines and for those compounds in our portfolio that have been submitted to regulatory authorities seeking approval or are in registration-directed clinical trials. We refer to the basic exclusivity loss as the “Estimated Minimum Market Exclusivity Date,” which is, unless otherwise indicated, the latter of (i) the expiration date of the earliest anticipated expiring composition of matter patent rights, or (ii) the date of regulatory data protection (RDP) loss for such product or clinical candidate. There may be additional patents for our approved medicines that claim the medicine or a method of using it that are listed in the FDA's Approved Drug Products with Therapeutic Equivalence Evaluations (Orange Book)—or for our unapproved clinical candidates that will be eligible to be listed in the Orange Book upon FDA approval. Therefore, the table below also identifies the expiration dates of certain additional patents that are Orange-Book listed for our approved medicines—or that, for our unapproved clinical candidates, are eligible for Orange-Book listing upon product approval—in the United States, as well as the expiration dates of certain related patents in the European Union, and Japan, which we refer to as the “Additional Patents Expiry Dates.” \n24\nTable of Contents\n \nProduct/Drug Candidate\n1,2\nUS\nEU\nJapan\nJAKAFI\n \n(ruxolitinib)\nEstimated Minimum Market Exclusivity Dates\n2028\n2027\n2028\nAdditional Patents Expiry Dates\n3\n2028\n2028\n2028\nOPZELURA\n \n(ruxolitinib) cream\nEstimated Minimum Market Exclusivity Dates\n2028\n2027\n2026\nAdditional Patents Expiry Dates\n3,4\n2028, 2031 & 2040\n2028 & 2031\n2028 & 2031\nOLUMIANT (baricitinib)\nEstimated Minimum Market Exclusivity Dates\n2032\n5\n2032\n2033\nAdditional Patents Expiry Dates\n2032\n2032\n-\nTABRECTA (capmatinib)\nEstimated Minimum Market Exclusivity Dates\n2032\n5\n2032\n6\n2032\nAdditional Patents Expiry Dates\n2035\n2035\n2035\nPEMAZYRE\n \n(pemigatinib)\nEstimated Minimum Market Exclusivity Dates\n2035\n2036\n6\n2036\nAdditional Patents Expiry Dates\n2039 & 2040\n-\n-\nICLUSIG (ponatinib)\nEstimated Minimum Market Exclusivity Dates\n-\n2028\n-\nAdditional Patents Expiry Dates\n-\n-\n-\nZYNYZ\n \n(retifanlimab)\n8\nEstimated Minimum Market Exclusivity Dates\n2036\n2036\n2036\nMONJUVI (tafasitamab)\n9\nEstimated Minimum Market Exclusivity Dates\n2033\n5\n2032\n6\n2027\nNIKTIMVO (axatilimab)\n10\nEstimated Minimum Market Exclusivity Dates\n2036\n7\n2034\n2034\nruxolitinib XR\nEstimated Minimum Market Exclusivity Dates\n2028\n-\n-\nAdditional Patents Expiry Dates\n3,11\n2028 & 2033\n-\n-\npovorcitinib\nEstimated Minimum Market Exclusivity Dates\n2034\n2034\n2034\nAdditional Patents Expiry Dates\n2039 & 2041\n2039\n-\n1.\nEstimated Minimum Market Exclusivity Dates are subject to the payment of maintenance fees, and include the period of PTE that has been granted by the respective regulatory agency, where applicable, or include the period of anticipated SPC term for approved products in the EU, where applicable, even though SPCs may remain pending in some countries.\n2.\nFor approved medicines in the US, the brand name for the US product is used, whereas for candidates that have not been approved in the US, the name of the active ingredient is used. The use of a brand name in the table does not indicate that the product has also been approved in any country outside of the US Also, some products may be approved in one or more countries outside of the US under different brand names.\n3.\nRuxolitinib phosphate salt patents are issued in the US, EU and Japan with anticipated expiration dates of late-2028 in the US and mid-2028 in the EU and Japan.\n4.\nRuxolitinib cream formulation patents are issued in the US, EU and Japan with anticipated expiration dates of 2031 in each jurisdiction. Patents are also issued in the US for the treatments of atopic dermatitis and vitiligo with expiration dates of 2040.\n5.\nDate reflects the grant of PTE in the US.\n6.\nDate reflects the grant of SPC in the EU, although SPCs may remain pending in some countries.\n7.\nDate reflects the RDP in the US due to product approval.\n8.\nRetifanlimab licensed from MacroGenics.\n9.\nTafasitamab licensed from Xencor, Inc.\n10.\nAxatilimab licensed from Syndax.\n11.\nOnce-a-day (QD) ruxolitinib formulation patents are issued in the US with anticipated expiration dates of 2033.\nPatents extend for varying periods according to the date of patent filing and the legal term of patents in the various countries where patent protection is obtained. The actual protection afforded by a patent, which can vary from country to country, depends on the type of patent, the scope of its coverage and the availability of legal remedies in the country. \nWe may seek to license rights relating to technologies, drug candidates or drug products in connection with our drug discovery and development programs and commercialization activities. Under these licenses, such as our licenses from Agenus, ARIAD/Takeda, MacroGenics, Merus, Xencor and Syndax, we may be required to pay up-front fees, license fees, milestone payments and royalties on sales of future products. \n25\nTable of Contents\n \nPatents extend for varying periods according to the date of patent filing or grant and the legal term of patents in the various countries where patent protection is obtained. The actual protection afforded by a patent, which can vary from country to country, depends on the type of patent, the scope of its coverage and the availability of legal remedies in the country. \nWe may seek to license rights relating to technologies, drug candidates or drug products in connection with our drug discovery and development programs and commercialization activities. Under these licenses, such as our licenses from Agenus, ARIAD/Takeda, MacroGenics, Merus Xencor and Syndax, we may be required to pay up-front fees, license fees, milestone payments and royalties on sales of future products. \nAlthough we believe our rights under patents and patent applications provide a competitive advantage, the patent positions of pharmaceutical and biotechnology companies are highly uncertain and involve complex legal and factual questions. We may not be able to develop patentable products or processes and may not be able to obtain patents in the United States or elsewhere from pending applications. Even if patent claims are allowed, the claims may not issue, or in the event of issuance, may not be valid or enforceable or may not be sufficient to protect the technology owned by or licensed to us or provide us with a competitive advantage. Any patent or other intellectual property rights that we own or obtain may be circumvented, challenged or invalidated by our competitors. Others may have patents that relate to our business or technology and that may prevent us from marketing our drug candidates unless we are able to obtain a license to those patents. In addition, litigation or other proceedings may be necessary to defend against claims of infringement, to enforce patents, to protect our other intellectual property rights, to determine the scope and validity of the proprietary rights of third parties or to defend ourselves in patent or other intellectual property right suits brought by third parties. We could incur substantial costs in such litigation or other proceedings. An adverse outcome in any such litigation or proceeding could subject us to significant liability or increased competition. A discussion of certain risks and uncertainties that may affect our patents, regulatory exclusivities or other proprietary rights is set forth in",
    "item1a": "Item 1A. Risk Factors\" for more information on our cybersecurity risks.\nWe aim to incorporate and align with industry best practices throughout our cybersecurity program. Our cybersecurity strategy focuses on implementing effective and efficient controls, technologies and other processes to assess, identify, manage and mitigate material cybersecurity risks. These include, among other things, having mechanisms in place to detect and monitor unusual network activity, utilizing vulnerability assessment scans and tools, and conducting external and internal penetration tests and security assessments using the National Institute of Standards and Technology (NIST) Cybersecurity Framework. \nWe engage third party experts to assist with numerous aspects of our cybersecurity program, including vulnerability assessment scans, penetration tests and security assessments.\n These outside experts are utilized on a rotating basis to enable us to receive multiple viewpoints on the security of our technological resources. Additionally, from time to time, our internal audit function, reviews and assesses various aspects of our cybersecurity program. We also engage in threat intelligence monitoring, including monitoring the dark web and zero-day vulnerability and attack information, and have processes in place to assess the potential cybersecurity impact or risk of any identified threats on our company, including potential impacts on our business partners and other parties with whom we share information. We actively engage with industry groups for peer benchmarking purposes and to stay current on best practices. We rely heavily on our vendors and other third party service providers in our clinical development activities as well as to manufacture and deliver our products, and a cybersecurity incident at a vendor or other third party service provider could have a material and adverse impact on our business, results of operations and financial condition. We have further processes in place to assess the cybersecurity risks associated with our vendors and other third-party service providers, and we require such providers to take appropriate precautions to protect our data and to notify us promptly in the event of any known or suspected data breach or cyber incident.\nOur cybersecurity program is integrated into our broader approach to risk management, and ultimate oversight for the program sits with our Board of Directors.\n The Board of Directors is aided by its Audit and Finance Committee, which regularly reviews our cybersecurity program with management and reports to the Board of Directors.\n Cybersecurity reviews by the Audit and Finance Committee or the Board of Directors generally occur at least twice annually, or more frequently as determined to be necessary or advisable.\n \nIncyte’s \nChief Information Security Officer (CISO)\n runs our cybersecurity program. Our CISO, who holds numerous cybersecurity and related certifications, including Certified Information Systems Security Professional, reports in to our Chief Information Officer (CIO).\n \nOur CISO and CIO have extensive experience assessing and managing cybersecurity programs and cybersecurity risk.\n They regularly report directly to the Audit and Finance Committee or the Board of Directors on our cybersecurity program and our efforts to prevent, detect, mitigate and remediate cybersecurity incidents. In addition, we have an escalation process in place to inform senior management and the Board of Directors of any material issues as they arise\n.\n64\nTable of Contents",
    "item1b": "Item 1B. \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C. \nCybersecurity\nIncyte is committed to maintaining robust oversight and governance of potential cybersecurity risks and to implementing processes and controls that help us identify, assess and manage such risks. \nTo date, we have not experienced a cybersecurity threat or incident that has resulted in a material adverse impact to our business or operations. However, we cannot guarantee that we will not experience such a threat or incident in the future, given the increasing sophistication of those responsible for cybersecurity incidents. While we seek to detect and investigate unauthorized attempts and attacks against our network and to prevent their occurrence where practicable through our internal processes and tools, we remain potentially vulnerable to known or unknown threats. In some instances, we can be unaware of a threat or incident or its magnitude and effects.\n Further, there is increasing regulation regarding responses to cybersecurity incidents, including reporting to regulators, which could subject us to additional liability and reputational harm. See \""
  }
}