{
  "ticker": "INTC",
  "cik": "0000050863",
  "company_name": "Intel",
  "filing_date": "2025-01-31",
  "accession": "0000050863-25-000009",
  "primary_doc": "intc-20241228.htm",
  "item_sections": {
    "item1": "Fundamentals of Our Business\t\n \nWe are a global designer and manufacturer of semiconductor products. The CPUs and other semiconductor solutions that we design, manufacture, market, and sell are incorporated in computing and related end products and services, and utilized globally by consumers, enterprises, governments, and educational organizations. Customers of our semiconductor products primarily include OEMs, ODMs, cloud service providers, and other manufacturers and service providers, such as industrial and communication equipment manufacturers and other cloud service providers who buy our products through distributor, reseller, retail, and OEM channels throughout the world. We market and sell our semiconductor products directly through our global sales and marketing organizations and indirectly through channel partners. We also develop semiconductor fabrication process and packaging technologies and manufacture many of our semiconductor product offerings at our geographically diverse network of fabrication and assembly and test facilities. We are also seeking to expand as a third-party foundry for external customers.\nOur Strategy\n \nTechnology permeates every aspect of our lives and is increasingly central to every aspect of human existence. As we look ahead to the next decade, we expect to see continued demand for processing power. Semiconductors are the underlying technology powering this digital expansion, and we are strategically positioning ourselves to create a resilient global semiconductor supply chain by investing in geographically balanced manufacturing capacity. The demand for compute is being accelerated by five superpowers: ubiquitous compute, pervasive connectivity, cloud-to-edge infrastructure, AI, and sensing. Together, these superpowers combine to amplify and reinforce each other, and increase the world's need for computing by packing even more processing capability onto ever-smaller microchips. We harness these superpowers for our customers' growth and our own.\nWe are uniquely positioned with the depth and breadth of our silicon, platforms, software, and packaging and process technology with at-scale manufacturing. With these strengths and the tailwinds of the superpowers driving digital disruption, our strategy to win is focused on four key themes: product competitiveness, open platforms, manufacturing at scale, and our people.\nOur Priorities\nProduct Competitiveness\n \nLead and democratize compute with Intel x86 and xPU. Our product offerings provide end-to-end solutions, scaling from data center to network, PCs, edge computing, and the emerging fields of AI and autonomous driving, to serve an increasingly smart and connected world.\nAt our core is the x86 ecosystem, which has served as a foundation of modern computing for over four decades. We continue to advance this ecosystem with x86 microarchitectures focused on performance and efficiency. In 2024, we announced the creation of an advisory group to expand the x86 ecosystem by enabling compatibility across platforms, simplifying software development, and providing developers with a platform to identify architectural needs and features to create innovative and scalable solutions for the future.\nBeyond the CPU, we deliver a family of xPU products encompassing client and data center GPUs, IPUs, FPGAs, and other accelerators. The xPU approach recognizes that different workloads benefit from different computing architectures, and our broad portfolio helps meet our customers' increasingly diverse computing needs. As part of our strategy, we seek to develop and offer leading products across each of these architectural categories.\nWe also seek to address every phase of the AI continuum, from the largest, most challenging GenAI and large language models to emerging usages like AI PCs and AI at the edge. We believe AI represents a generational shift in computing by expanding human abilities and solving the most challenging problems. We are in the early stages of realizing AI's full potential. Our strategy is to bring AI to where the data is being generated and used. We believe we have a full spectrum of hardware and software platforms that offer the open and modular solutions for competitive total cost of ownership and time to value that customers need to win in this era of exponential growth and AI everywhere. We are infusing AI into Intel technologies, supporting today's GenAI workloads, fueling emerging usages like AI PC and AI at the edge, and pioneering innovations that we believe will help advance the future of AI in the next decade.\nOur product offerings are predominantly manufactured in our own manufacturing facilities using our proprietary process technologies. In recent years, however, we have strategically utilized third-party foundry manufacturing capacity where advantageous for cost, performance, schedule, or other reasons. This provides increased flexibility and scale, including in recent years the ability to continue to offer various products at the most performant end of the product spectrum where we did not yet have comparable process technologies in-house.\nOpen Platforms\n \nWe aim to deliver open software and hardware platforms with industry-defining standards. Around the globe, companies are building their networks, systems, and solutions on open standards-based platforms. We have helped set the stage for this movement, with our historic contributions in developing standards such as CXL, Thunderbolt™, and PCI Express. We also contributed to the design, build, and validation of open-source products in the industry such as Linux, Android, and others.\nintel-logo-footer.jpg\nOur Strategy\n3\n \n\nWe deliver open-source code and optimizations that are designed for projects across numerous platforms and usage models. We are committed to co-engineering and jointly designing, building, and validating new products with software industry leaders to accelerate mutual technology advancements and help software and hardware work better together.\nManufacturing at Scale\n \nWe manufacture a majority of our products in our own manufacturing facilities using our proprietary process technologies. This enables us to optimize performance, shorten time-to-market for new product introductions, and more quickly scale products in high volume.\nProcess technology. We continue to develop new generations of manufacturing process technology as we seek to realize the benefits from Moore’s Law, a law of economics predicted by Intel’s cofounder Gordon Moore more than 50 years ago. Realizing Moore’s Law results in economic benefits as we are able to either reduce a chip's cost as we shrink its size or increase functionality and performance of a chip while maintaining the same cost with higher density. This makes possible the innovation of new products with higher performance while balancing power efficiency, cost, and size to meet customers' needs. As of the end of 2024, our core products were manufactured on 300mm wafers, with a significant majority manufactured using our Intel 7 process node while we ramped our Intel 4 and Intel 3 process nodes into high volume.\nFactory network. Our global factory network has been foundational to our success, enabling product optimization, improved economics, and supply resilience. We operate wafer manufacturing facilities in the United States (Oregon and Arizona), Ireland, and Israel, assembly and testing facilities in Costa Rica, China, Malaysia, and Vietnam, and packaging facilities in the United States (New Mexico), Costa Rica, Vietnam, and Malaysia. We intend to remain a leading developer of process technology and a major manufacturer of semiconductors and we plan to continue to build the majority of our products in our factories.\nFoundry services. The very high capital requirements of modern leading-edge semiconductor process technology development and manufacturing, especially those nodes requiring EUV lithography such as Intel 4, Intel 3, Intel 18A and future nodes, require us to expand the use of our process technologies as they mature and grow the number of wafers produced beyond the expected growth for our own products. To this end, we are seeking to build a world-class foundry business also serving external customers and have made significant investments in ecosystem support to enable the usage of our manufacturing network by external customers. Our foundry offerings include four components: wafer fabrication, packaging, chiplets, and software and services. We intend to build our customers' silicon designs and deliver full end-to-end customizable products built with our advanced packaging technology. We plan to differentiate our foundry offerings from those of others through a combination of leading-edge packaging and process technology, committed capacity in the US and Europe available for customers globally, and a world-class IP portfolio that will include x86 cores, as well as other ecosystem IP.\nOur People\n \nOur world-class talent is at the heart of everything we do. Together we strive to have a positive effect on business, society, and the planet. Delivering on our strategy and growth ambitions requires attracting, developing, and retaining top talent from across the world. Our people build our technology, unlock new business opportunities, and work with our partners and customers to create global impact.\nFostering a culture of empowerment, inclusion, and accountability is also core to our strategy. We are committed to creating an inclusive workplace where the world’s best engineers and technologists can fulfill their dreams and create technology that improves the life of every person on the planet.\nFocus on Innovation and Execution\nWe are focused on executing our product and process roadmaps and our cadence of innovation. We have set a detailed process and packaging technology roadmap and announced key architectural innovations to further our goal of delivering competitive products in every area in which we compete.\nWe leverage our Smart Capital approach to help us adjust quickly to opportunities in the market while managing our margin structure and capital spending. The key elements of Smart Capital include:\n▪Smart capacity investments. We are building out future manufacturing shell space, which gives us flexibility in how and when we bring additional capacity online based on milestone triggers such as product readiness, market conditions, and customer commitments.\n▪Government incentives. We work with governments to advance and benefit from incentives for domestic manufacturing capacity for leading-edge semiconductors.\n▪SCIP. We access strategically aligned private capital to increase our flexibility and help efficiently accelerate and scale manufacturing build-outs. Our SCIP program has supported the period of accelerated manufacturing investment that commenced in early 2021. We signed our latest SCIP agreement in the second quarter of 2024 and are not contemplating further transactions in the near term.\n▪Customer commitments. Our foundry business works closely with potential customers to obtain advance payments to secure capacity and participate in manufacturing capacity build-outs. This provides us with the advantage of committed volume, derisking investments while providing capacity corridors for our foundry customers.\n▪External foundries. We intend to continue our use of external foundries where their capabilities or capacities support our Intel Products businesses offerings.\n\nintel-logo-footer.jpg\nOur Strategy\n4\n \n\nOur Capital\n \nWe deploy various forms of capital to execute our strategy in a way that seeks to reflect our corporate values, help our customers succeed, and create value for our stakeholders.\nFinancial \t\nLeverage financial capital to invest in ourselves and optimize our portfolio, both to drive our strategy and long-term value creation.\nWe strategically invest financial capital to continue to build our business and create long-term value for our stockholders.\t\nInvest significantly in R&D and IP to enable us to deliver\non our accelerated process technology roadmap and introduce leading x86 and xPU products.\nWe develop IP to enable next-generation products, create synergies across our businesses, expand into new markets, and establish and support our brands.Build manufacturing capacity efficiently to\nmeet the growing long-term global demand for semiconductors.\nOur geographically balanced manufacturing scope and scale enable us to provide our customers with a broad range of leading-edge products and foundry capabilities.\tBuild a diverse, inclusive, and safe work environment to attract, develop, and retain top talent needed to build transformative products.\t\nOur talented employees enable the development of solutions and enhance the intellectual and manufacturing capital critical to helping our customers.Build trusted relationships for both Intel and our stakeholders, including employees, suppliers, customers, local communities, and governments.\t\nWe collaborate to empower communities through education and technology and advance accountability and capabilities across our global supply chain.Strive to reduce our environmental footprint through efficient and responsible use of natural resources and materials used to create our products.\t\nWe seek to mitigate climate and water impacts, achieve efficiencies, lower costs, and position ourselves to respond to the expectations of our stakeholders.Financial Capital\n \nWe take a disciplined approach to our financial capital allocation strategy, which continues to focus on building stakeholder value and is driven by our priority to invest in the business. We also seek to optimize our portfolio, look for innovative ways to unlock value across our assets, and, from time-to-time, engage in mergers and acquisitions.\nOur Financial Capital Allocation Strategy\nInvest in the Business\nOur first allocation priority is to invest in R&D and capital spending to capitalize on the opportunity presented by the world's demand for semiconductors. In 2024, we continued our focus on capital investment and the deployment of our Smart Capital strategy.\nReturn Excess Cash to Stockholders\nOur capital allocation strategy historically included returning excess cash to stockholders through dividends and stock repurchases. Our most recent stock repurchase was in the first quarter of 2021 and we suspended the declaration of quarterly dividends starting with the fourth quarter of 2024. We agreed under our commercial CHIPS Act agreement to forgo paying dividends for the next two years, and agreed to limitations on the payment of dividends for the three years thereafter. Further, we do not expect to pay dividends or make stock repurchases until our cash flows improve as we focus on the critical investments needed to execute our business strategy and create long-term value.Optimize our Portfolio and Unlock Value\nWe seek to drive value creation through transactions such as the 2022 IPO and 2023 secondary offering of Mobileye stock, the 2023 minority stake sales in IMS, and the 2023 announcement of our intent to operate Altera as a standalone business, which we expect to enable potential private and public equity investments. Transactions like these provide additional capital to support the critical investments needed to advance our business strategy.\nOur capital allocation strategy also includes opportunistic investment in and acquisition of companies that complement our strategic objectives. We look for acquisitions that supplement and strengthen our capital and R&D investments.\nLastly, we take action when investments do not strategically align to our key priorities or provide adequate returns to our stakeholders. In the last few years, we exited numerous businesses, including our NAND Memory business (first closing in 2021 and second closing expected in March 2025) and our Intel® Optane™ memory business (2022).Intellectual Capital\n \nResearch and Development\nR&D investment is critical to enable us to deliver on our technology roadmap, introduce leading products, and develop new businesses and capabilities in the future. We seek to protect our R&D efforts through our IP rights and may augment R&D initiatives by, from time-to-time, acquiring or investing in companies, entering into R&D agreements, and directly purchasing or licensing technology.\nAreas Key to Product Competitiveness\nWe have intensified our focus and investment on areas key to product competitiveness. Our objective with each new generation of products is to improve user experiences and value through advances in performance, power, cost, connectivity, security, form factor, and other features. We also focus on reducing our design complexity, re-using IP, and increasing ecosystem collaboration to improve our efficiency.\nxPU. We believe the future is with xPU across a diverse mix of scalar, vector, matrix, and spatial architectures deployed in CPU, GPU, NPU, IPU, accelerators, and FPGA sockets, enabled by a scalable software stack and integrated into systems by advanced packaging technology. We are building processors that span several major computing architectures, moving toward an era of heterogeneous computing:\n▪Client CPUs. In 2024, we ramped sales of the Intel® Core™ Ultra Series 1, our first product with an integrated neural processing unit for efficient processing of AI workload. The Intel Core Ultra Series 1, manufactured on the Intel 4 process, introduced the first AI PCs to the market. We also launched the Intel Core Ultra 200V Series, showcasing power efficiency and long-lasting battery life. The 200V Series, manufactured by an external foundry, leverages our Xe2 GPU architecture, bringing improved efficiency, second-generation ray tracing units and XMX AI acceleration to thin and light notebooks. During 2024, a significant majority of our client sales consisted of our 13th and 14th Gen Intel Core processors, manufactured on Intel 7, which allow us to serve the breadth of customer and computing needs in the client market.\n▪Data center CPUs. We launched our Intel® Xeon® 6 processors for the data center, utilizing the Intel 3 process, including our first Intel Xeon processor using Efficient cores (E-cores). The Intel Xeon 6 family is designed to address the growing diversity in workloads and deployments in the data center environments. Our 5th Gen Intel Xeon Scalable processors, based on Intel 7, were launched in 2023, and continued to ramp throughout 2024.\n▪Discrete client GPUs. The Intel® Arc™ graphics family offers modern GPU features to power immersive games, creator applications, and AI workloads. In 2024, we launched the Intel Arc B-Series based on the latest Xe2 GPU architecture. The compute engine of the Intel Arc B-Series is our second-generation Xe-core, which delivers 70% more performance per core and is 50% more power efficient than the Intel Arc A750.\n▪Edge computing. We recently launched a suite of processors for edge computing. This includes the Intel Core Ultra 200S Series, bringing the NPU IP to desktops and reducing package power. These hybrid designs utilize our most advanced performance cores and power-efficient cores, as well as the latest packaging technology.\n▪Datacenter AI accelerators and GPUs. In 2024, we launched the Intel® Gaudi® 3 AI accelerators offering significant price-performance advantages for AI inference applications.\nSoftware. Software unleashes the potential of our hardware platforms across all workloads, domains, and architectures.\nWe aim to optimize AI frameworks and middleware, such as PyTorch, TensorFlow, vLLM, Hugging Face and WebNN to run efficiently on our hardware. Our OpenVINO™ toolkit is an open source toolkit that accelerates deep learning inference on our processors across various use cases, such as generative AI, computer vision, audio, and language with industry standard models. It is used in domains from edge to AI PC to cloud and is the leading inferencing library on our silicon.\nIn 2024 we launched the Open Platform for Enterprise AI under the Linux Foundation to accelerate deployment of generative AI use cases through industry standard modular microservice architecture. Since launch, the ecosystem has been actively engaged, with an expanding network of partners enhancing features and developing new capabilities.\nMost of these frameworks and middleware are built from our oneAPI, which enables developers to create performant cross-architecture applications using a single code base across CPUs, GPUs, and other accelerators. We contributed our oneAPI specifications and implementations to the UXL Foundation under the Linux Foundation. By doing so, oneAPI delivers an open and multi-vendor programming model enabling choice and code re-use across the accelerator hardware ecosystem.\nThis software stack is designed to preserve the usability of existing tools and software while accommodating future developments, enabling continuity for users and developers.\nAreas Key to Process and Packaging Competitiveness\nOur leading-edge process and packaging technology continues to be key to the success of our strategy.\n▪Intel 7 process node continues in production for our 13th and 14th Gen Intel Core processors. Intel 7 was utilized for a significant majority of our processor production and products in 2024, and is expected to continue to be utilized for a significant portion of our processor production and products in 2025.\n intel-logo-footer.jpg\nOur Capital\n\n7\n \n\n▪Intel 4, our first EUV lithography node, delivers significant density scaling and approximately 20% performance-per-watt improvement over Intel 7. The Intel Core Ultra processor is our first high-volume client product on Intel 4 and began shipping to customers in 2023. Intel 4 moved to high-volume manufacturing in Ireland in 2024, and is expected to represent an increasing portion of our processor production and products in 2025.\n▪Intel 3, our second EUV lithography node, delivers further logic scaling and up to 18% performance-per-watt improvement over Intel 4. Intel 3 is offered to external foundry customers and is optimized for the needs of data center products. This node, which is produced in the same facilities as Intel 4, was in high-volume manufacturing in Oregon during 2024, with high-volume manufacturing shifted to Ireland for 2025. Intel’s Xeon 6 Scalable server processor offerings are built on this technology.\n▪Intel 18A is our next generation leading-edge process technology and has been designed to incorporate the first high volume commercial implementation of two breakthrough technologies: gate-all-around transistors and backside power. RibbonFET, our implementation of a gate-all-around transistor, is designed to deliver faster transistor switching speeds while achieving the same drive current as multiple fins, but in a smaller footprint. PowerVia is our unique industry-first implementation of backside power delivery that is designed to optimize signal transmission by eliminating the need for power routing on the front side of the wafer. Intel 18A is offered to external foundry customers and is designed to deliver improvements in performance per watt and density scaling over Intel 3. We expect to commence high-volume manufacturing of Panther Lake, our new client family of products and our first processors on Intel 18A, in 2025.\n▪Intel 14A, our third advanced process technology offering to external customers, is in active development with performance-per-watt and density scaling improvements over Intel 18A.\nIP Rights\nWe own and develop significant IP and related IP rights around the world that support our products, services, R&D, and other activities and assets. Our IP portfolio includes patents, copyrights, trade secrets, trademarks, mask works, and other rights. We actively seek to protect our global IP rights and deter unauthorized use of our IP and other assets.\nWe have obtained patents in the US and other countries. Because of the fast pace of innovation and product development, our products are often obsolete before the patents related to them expire, and in some cases our products may be obsolete before the patents are granted. As we expand our product offerings, particularly around our foundry business, we also seek to extend our patent development efforts. In addition to developing patents based on our own R&D efforts, we may purchase or license patents from third parties.\nThe software that we distribute, including software embedded in our products, is entitled to copyright and other IP protection. To distinguish our products from our competitors' products, we have obtained trademarks and trade names for our products, and we maintain cooperative advertising programs with customers to promote our brands and to identify products containing genuine Intel components. We also protect details about our processes, products, and strategies as trade secrets, keeping confidential the information that we believe provides us with a competitive advantage.\nEfforts to protect our IP can be difficult, particularly in countries that provide less protection to IP rights and in the absence of harmonized international IP standards. Competitors and others may already have IP rights covering similar products. There is no assurance that we will be able to obtain IP rights covering our own products or that we will be able to obtain IP licenses from other companies on favorable terms or at all. For a discussion of IP-related risks, see \"Risk Factors\" within Risk Factors and Other Key Information. While our IP rights are important to our success, our business as a whole is not significantly dependent on any single patent, copyright, or other IP right.Manufacturing Capital\n \nWe are one of only a few companies in the world with the process technology and manufacturing facilities to produce leading-edge semiconductor logic chips.\nProcess Technology\nOur technology development group, with its R&D and semiconductor fabrication facilities in Oregon, designs and develops each new process technology node before high-volume production is shifted to one of our high-volume manufacturing sites. With each new node, we seek improvements in performance, power efficiency, cost, and size to meet the needs of our products and of external foundry customers. The continued development of leading-edge nodes that are competitive with the offerings of other foundries requires significant ongoing capital investment as we pursue incremental improvements and refinements of existing transistor and layout designs and manufacturing technologies, such as EUV lithography, while also pursuing new transistor and layout designs, such as gate-all-around and backside power in our upcoming Intel 18A process node, and new manufacturing technologies, such as high-NA EUV lithography for use in our upcoming Intel 14A process node.\nAs of the end of 2024, a significant majority of our products were manufactured using our Intel 7 process node in Arizona and Israel, we successfully ramped our Intel 4 and Intel 3 process nodes as our first EUV lithography nodes and shifted high-volume production of those nodes to Ireland, and we canceled the productization of our Intel 20A process node to focus efforts on the improved version of the node, Intel 18A, that we expect to put into high-volume production in 2025 with our new client family of products code-named Panther Lake.\n intel-logo-footer.jpg\nOur Capital\n\n8\n \n\nManufacturing Facilities\nOur geographically distributed network of semiconductor manufacturing facilities and assembly and test facilities allows us to produce advanced semiconductor logic chips in high volume. After a process technology node is developed by our technology development group, we seek to shift production to one or more high-volume manufacturing facilities. Maintaining reliable production capacity is of critical importance. Wafer and packaging manufacturing facilities take a number of years to build, making it prudent to build space ahead of demand. We refer to this strategy as \"shell ahead.” As a result of the supply shocks driven by the Covid-19 pandemic and the projected growth of our products businesses, we set out to expand our capacity network beyond our existing wafer production facilities in Oregon (mostly utilized for technology development and early production on new nodes), Arizona, Ireland, and Israel to meet this demand and get to “shell ahead” status. We are in the later stages of an expansion of our wafer fabrication facilities in Ireland for our Intel 4 and Intel 3 process nodes and undertaking a significant expansion of our Arizona facility for our upcoming Intel 18A process node. We are building a new wafer production facility in Ohio and have plans for an additional new wafer production facility in Germany, but have slowed the completion of the Ohio facility and put the plans for the facility in Germany on hold as we have reassessed demand and our \"shell ahead\" status and sought to limit our capital expenditures given recent financial results. We have assembly and test facilities in Costa Rica, China, Malaysia, New Mexico, and Vietnam. We are expanding our facilities in New Mexico and Malaysia, though we recently reduced the extent of the expansion plans for Malaysia. We have plans for an additional assembly and test facility in Poland, but have put those plans on hold in conjunction with the delay of the facility in Germany.\nSemiconductor manufacturing requires extremely sophisticated equipment, and we work closely with the tool vendors to align their roadmaps to our needs. In 2024, we made the transition from non-EUV lithography to EUV lithography with the Intel 4 and Intel 3 process nodes. EUV lithography equipment drives a higher capital investment than the preceding lithography technology.\nSemiconductor manufacturing is a capital-intensive industry. Over the past four years, we have made outsized investments across three categories—technology development, manufacturing facility shells, and advanced production tools—as we aim to catch up with our leading third-party manufacturing competitor on process technology, get to \"shell ahead\" for our and potential future foundry customer needs, and adopt EUV lithography for our leading process nodes. In 2024, our manufacturing capital expenditures, inclusive of technology development, were distributed 55% in manufacturing facility space and 45% in equipment.\nTo moderate the impact to our balance sheet and cash flows, we’ve implemented what we call Smart Capital. Smart Capital includes maintaining a \"shell ahead\" on the longer lead time space and delaying tool purchases as long as possible ahead of high confidence demand signals while leveraging capital offsets from governments, financial partners, and customers.\nWe work closely with governments in the regions where we operate to obtain government incentives to support leading-edge semiconductor R&D and manufacturing in those regions. Such incentives are often needed to offset the higher costs of operations in such regions, and support a more geographically balanced and risk-tolerant semiconductor supply chain. We worked closely with the US federal government on the implementation of the CHIPS Act in support of the semiconductor industry and American technological leadership and innovation. In 2024, we signed an agreement with the US Federal Department of Commerce for the award of up to $7.9 billion in direct funding under the commercial CHIPS Act program, which is designed to support leading-edge semiconductor manufacturing in the US, as well as an agreement under which we may receive up to $3 billion in direct funding under the CHIPS Act's Secure Enclave program, which is designed to expand the trusted manufacturing of leading-edge semiconductors for the US government. We also expect and have begun to benefit significantly from the Advanced Manufacturing Investment Credit, given that the significant portion of our R&D and manufacturing investments are made in the United States.\nIn 2024, as part of our SCIP program, we entered into an arrangement with Apollo in which we received a one-time capital infusion in exchange for an interest in the rights to operate Fab 34 in Leixlip, Ireland. This follows our first SCIP agreement, with Brookfield, completed in 2022 and relating to our Arizona facility expansion. In total, we expect greater than $25 billion of capital offsets through these partnerships.\nFinally, as we build out our external foundry services, we expect to receive customer pre-payments to secure capacity and other benefits. Customer pre-payments are a standard practice for semiconductor manufacturers.\nSupply Chain\nOur supply chain is a cornerstone of our success and a critical enabler of our mission to deliver cutting-edge technology solutions to our customers. Our global supply chain supports internal partners across architecture, product design, technology development, manufacturing and operations, and sales and marketing. It encompasses thousands of suppliers worldwide, forming a robust supply ecosystem designed to enable product and process competitiveness, deliver industry-leading total cost of ownership, and enable on-time, uninterrupted supply in a responsible and sustainable manner.\nOur global supply chain strategy is focused on driving a resilient, diverse, and responsible supply chain that meets the needs of our customers while upholding the highest standards of safety, quality, technology, availability, and sustainability. We work tirelessly across our supply chain to minimize disruptions, improve productivity, and optimize capacity utilization and output to meet customer expectations.\nHuman Capital\n \nOur human capital strategy is grounded in our belief that our people are fundamental to our success. Delivering on our strategy and growth ambitions requires attracting, developing, and retaining top talent across the world. We are committed to creating an inclusive workplace where the world's best engineers and technologists can fulfill their dreams and create technology that improves the life of every person on the planet. We invest in our highly skilled workforce, which was comprised of 108,900 people as of December 28, 2024, by creating practices, programs, and benefits that support the evolving world of work and our employees' needs.\nOur values—customer first, fearless innovation, results driven, one Intel, inclusion, quality, and integrity—inspire us and are key to delivering on our purpose. All employees are responsible for upholding these values, the Intel Code of Conduct, and Intel's Global Human Rights Principles, which form the foundation of our policies and practices and ethical business culture.\nTalent Management\nWe continue to see significant competition for talent throughout the semiconductor industry. Our hiring was limited in 2024, in line with macroeconomic forecasts, financial performance, and cost-reduction measures, and we took headcount actions in connection with our 2024 Restructuring Plan that are expected to result in an approximate 15% decrease in our core Intel workforce by early 2025. However, the investments we are making to accelerate our process technology require continued and focused efforts to attract and retain talent—especially technical talent. Our undesired turnover rate1 was 5.9% in 2024 and 5.6% in 2023.\nWe invest resources to develop the talent needed to remain at the forefront of innovation and make Intel an employer of choice. We offer training programs and provide rotational assignment opportunities and have updated our job architecture to help employees create custom learning curricula for building skills and owning their careers. To further support the growth and development of our people, we offer mentoring in our technical community, drive engagement through employee resource groups, and promote health and wellness resources to all our people. Through our annual employee experience survey, employee inclusion survey, and manager development feedback survey, employees can voice their perceptions of the company, their managers, their work experiences, and their learning and development opportunities. Our employees' voices are important to enable our culture of continuous improvement, and as a result, we link a portion of our executive and employee performance bonus to year-over-year improvements of our employee experience survey results. Our performance management system is designed to support our cultural evolution and to increase our focus on disciplined execution.\nInclusion\nInclusion is a core element of Intel's values and instrumental to driving innovation and positioning us for growth. Over the past decade, we have taken actions to integrate diversity and inclusion expectations into our culture, performance and management systems, leadership expectations, and annual bonus metrics. Through our annual employee inclusion survey, employees can voice their experiences at Intel and provide feedback on how we can continue to improve. To drive accountability, we linked a portion of our executive and employee compensation to diversity and inclusion metrics in 2024.\nIn 2024, women represented 27.9% of our global employees, 18.3% of our senior leadership positions2, and 25.3% of our technical positions. Underrepresented minorities3, including Black/African American employees, Hispanic, and Native American employees, represented 17.8% of our US employees and 8.7% of our US senior leadership positions.\n\n\n\n\n\n\n\n\n\n\n1 Undesired turnover includes all regular Intel employees who voluntarily left Intel, but does not include Intel contract employees, interns, or employees who separated from Intel due to divestiture, retirement, voluntary separation packages, death, job elimination, or redeployment, or Mobileye and other non-integrated subsidiaries employees.\n2 Senior leadership is defined as salary grades 10+ or equivalent grades. Population includes all regular Intel employees but does not include Mobileye and other non-integrated subsidiaries employees.\n3 Underrepresented minority population includes all regular Intel employees but does not include Mobileye and other non-integrated subsidiaries employees.\n intel-logo-footer.jpg\nOur Capital\n\n10\n \n\nCompensation and Benefits\nWe structure pay, benefits, and services to meet the varying needs of our employees, helping support employee financial well-being with competitive compensation, investment opportunities, and financial resources. Our total rewards package includes market-competitive pay, broad-based stock grants and bonuses, an employee stock purchase plan, healthcare and retirement benefits, paid time off and family leave, parent reintegration, family expansion assistance, flexible work schedules, sabbaticals, and on-site services. Since 2019, we have achieved gender pay equity globally and we continue to maintain race/ethnicity pay equity in the US. We achieve pay equity by closing the gap in average pay between employees of different genders or race/ethnicity in the same or similar roles after accounting for legitimate business factors that can explain differences, such as location, time at grade level, and tenure. We have also advanced transparency in our pay and representation data by publicly releasing our EEO-1 survey pay data since 2019. We believe that our holistic approach toward pay equity, representation, and creating an inclusive culture enables us to cultivate a workplace that helps employees develop and progress in their careers at all levels. Our \"hybrid-first\" approach to working was informed by employees surveyed around the globe and involves the majority of our employees splitting their time between working remotely and in the office. Hybrid-first and remote work options cast a wider recruitment net and support our ambition to hire the best global talent. Currently, there is no company-wide mandate on the number of days per week employees should be on site or how they should collaborate. Our goal is to enable remote and on-site work where it drives the best output, while providing our employees with equitable access to systems, resources, and opportunities that allow them to succeed.\nHealth, Safety, and Wellness\nWe are committed to providing a safe and injury-free workplace. We regularly invest in programs designed to improve physical, mental, and social well-being. We provide access to a variety of innovative, flexible, and convenient health and wellness programs, including on-site health centers, and we aim to increase awareness of and support for mental and behavioral health. We intend to continue our efforts to build our strong safety culture and drive the global expansion of our corporate wellness program through employee education and engagement activities.Social and Relationship Capital\n \nWe are committed to engaging in initiatives that support our communities and help us develop trusted relationships with our stakeholders. Proactive engagement with our stakeholders and investments in social impact initiatives, including those aligned with the United Nations Sustainable Development Goals, advance our position as a leading corporate citizen and create shared value for Intel, our global supply chain, and our communities.\nEconomic and social. The health of our business and local economies depends in part on continued investments in innovation. We provide high-skill, high-paying jobs around the world, many of which are manufacturing and R&D jobs located in our factories. As we expand operations in both existing and new locations, we are building a pipeline of qualified workers through our talent strategy and the many investments we are making in education. We also benefit economies through our R&D ecosystem spending, sourcing activities, employee spending, and tax payments.\nHuman rights commitment. We are committed to maintaining and improving systems and processes to avoid causing or contributing to adverse impacts on human rights in our operations, products, and supply chain. We have established an integrated approach to managing human rights across our business, including senior-level management involvement and board-level oversight. We also meet throughout the year with external stakeholders and experts on human rights to continue to inform and evolve our human rights policies and oversight processes. While we do not always know nor can we control what products our customers create or the applications end users may develop, we do not support or tolerate our products being used to adversely impact human rights. Where we become aware of a concern that Intel products are being used by a business partner in connection with abuses of human rights, we intend to evaluate and restrict or cease business with the third party unless and until we have high confidence that Intel's products are not being used to adversely impact human rights.\n\nSupply Chain Responsibility\nWe actively manage our supply chain to help reduce risk, improve product quality, achieve environmental and social goals, and improve overall performance and value creation for Intel, our customers, and our suppliers. To drive responsible and sustainable practices throughout our supply chain, we have robust programs to educate and engage suppliers that support our global manufacturing operations. We actively collaborate with other companies and lead industry initiatives on key issues such as improving transparency around climate and water impacts in the global electronics supply chain, and we are advancing collaboration across our industry on responsible minerals sourcing. Through these efforts, we help set electronics industry-wide standards, develop audit processes, and conduct training.\nOver the past decade, we have directly engaged with suppliers to verify compliance and build operational capacity to address risks of forced and bonded labor and other human rights issues. We perform periodic audits and identify critical direct suppliers to engage through capability-building programs, which help suppliers build sustainability acumen and verify compliance with the Responsible Business Alliance and the Intel Code of Conduct. We also engage with indirect suppliers through our programs on forced and bonded labor, responsible minerals, and supplier diversity.Natural Capital\n \nReducing our environmental footprint as we grow helps us create efficiencies, support our communities, and respond to the needs of our stakeholders. We invest in environmental projects and set company-wide environmental goals to drive reductions in greenhouse gas emissions, energy and water use, and waste to landfills. We build energy efficiency into our products to help our customers lower their own emissions, energy usage, and costs, and we collaborate with policymakers and other stakeholders to use technology to address environmental challenges.\nWe continue to take action on emissions reduction strategies focused on emissions abatement, and to make additional investments in renewable electricity, process and equipment optimization, and energy conservation. In 2024, we linked a portion of the executive and employee performance bonus to our goal to reduce our 2024 Scope 1 and 2 greenhouse gas emissions by 25,000 metric tons of carbon dioxide equivalent, compared to 2023. We also focus on addressing climate change impacts upstream and downstream in the value chain. This includes improving product energy efficiency and increasing the positive impact of our products by leveraging opportunities for Intel technologies to enable other sectors of the economy to reduce their climate and energy footprints.\nEnergy\nWe focus on reducing our own climate change impact, and over the past two decades have reduced our direct and indirect greenhouse gas emissions associated with energy consumption and invested in renewable electricity and on-site alternative energy projects. In 2024, continuing our practice of linking a portion of our executive and employee performance bonus to our corporate sustainability metrics, we linked a portion of the performance bonus to our 2024 target to reach 95% renewable electricity use globally.\nWater Stewardship\nWater is essential to the semiconductor manufacturing process. We use ultrapure water to remove impurities from our silicon wafers, and we use fresh and reclaimed water to run our manufacturing facility systems. Our water strategy illustrates our commitment to manage water resources efficiently. In 2024, we linked a portion of our executive and employee performance bonus to our target to conserve and restore 13.5 billion gallons of water during the year.\nCircular Economy and Waste Management\nWe have long been committed to waste management, recycling, and circular economy strategies that enable the recovery and productive re-use of waste streams. We continue to focus on opportunities to upcycle waste by improving waste segregation practices and collaborating with our suppliers to evaluate new technologies for waste recovery. In 2024, we linked a portion of our executive and employee performance bonus to our interim target to achieve a greater than 90% recycling rate of construction waste.\nGovernance and Disclosure\nWe are committed to transparency around our carbon footprint and climate risk, and use the framework developed by the TCFD to inform our disclosure on climate governance, strategy, risk management, and metrics and targets. For governance and strategy, we follow an integrated approach to address climate change, with multiple teams responsible for managing climate-related activities, initiatives, and policies, with senior-level management involvement and board-level oversight, including the Corporate Governance and Nominating Committee. We describe our overall risk management processes in our proxy statement, and describe climate-related risks and opportunities in our annual Corporate Responsibility Report, the Intel Climate Change Policy, the Intel Climate Transition Action Plan, and \"Risk Factors\" within this Form 10-K. In addition, our Corporate Responsibility Report includes a mapping of our disclosure to the TCFD, GRI, and SASB frameworks. The Corporate Responsibility Report and our CDP Climate Change and Water Surveys are available on our website and are published annually.1\nManagement's Discussion and Analysis\n \nOverview\nWe are a global designer and manufacturer of semiconductor products, including CPUs and other solutions, primarily marketed and sold through our Intel Products business and manufactured via our Intel Foundry operations and other suppliers. Our customers primarily include OEMs, ODMs, cloud service providers, and other manufacturers and service providers, such as industrial and communication equipment manufacturers and other cloud service providers who buy our products through distributor, reseller, retail, and OEM channels throughout the world. We market and sell these products directly through our global sales and marketing organizations and indirectly through channel partners. We manufacture our products at our fabrication and assembly and test facilities located throughout the world. We seek to expand our Intel Foundry business as a third-party foundry for external customers.\nA Year in Review\n2024 revenue was $53.1 billion, down $1.1 billion, or 2%, from 2023 due to lower all other revenue and lower Intel Foundry revenue, partially offset by higher Intel Products revenue. All other revenue decreased 32% from 2023, driven by lower Altera revenue due to customers tempering purchases to reduce existing inventories across all product lines and lower Mobileye revenue as customers tempered purchases to reduce existing inventories of EyeQ products. Intel Foundry external revenue decreased 60% from 2023 due to lower traditional packaging services and lower equipment sales. Intel Products revenue increased 3% from 2023 due primarily to higher CCG and DCAI revenue. CCG revenue increased 4% from 2023 primarily due to higher notebook volume compared to 2023 and was partially offset by lower other CCG revenue, which decreased from 2023 due to the exit of legacy businesses, and lower desktop revenue, which decreased on lower demand compared to 2023. DCAI revenue increased 1% from 2023 driven by higher server revenue primarily from high core count products, which increased ASPs and lowered volume compared to 2023.\nOur consolidated results of operations in 2024 were meaningfully impacted by non-cash impairments and the acceleration of depreciation for certain manufacturing assets, restructuring charges resulting from our 2024 Restructuring Plan, non-cash impairments of goodwill and certain other assets, as well as non-cash charges related to a valuation allowance recognized against our US deferred tax assets. In 2024, we invested $16.5 billion in R&D, made gross capital investments of $25.1 billion, and had $8.3 billion in cash from operations and negative $2.2 billion of adjusted free cash flow1.\nOur 2024 results reflect the continued advancement of our transformational journey. In 2024, our previously announced internal foundry operating model took effect, creating a foundry relationship between our Intel Products business (collectively CCG, DCAI, and NEX) and the Intel Foundry business (including Foundry Technology Development, Foundry Manufacturing and Supply Chain, and Foundry Services, formerly IFS). The foundry operating model is designed to reshape operational dynamics and drive greater transparency, accountability, and focus on costs and efficiency. In furtherance of our internal foundry operating model, we began separately reporting the financials for our Intel Products and Intel Foundry businesses in Q1 2024 and, in Q3 2024, we announced our intent to establish Intel Foundry as an independent subsidiary. We also made meaningful progress on our previously announced plan to operate Altera® as a standalone business beginning in Q1 2024, readying the business and paving the way for value capture opportunities in early 2025.\nRestructuring\nIn 2024, we announced our intention to implement a series of cost and capital reduction initiatives designed to adjust our spending to current business trends while enabling our new operating model and continuing to fund investments in our core strategy—returning to product and process competitiveness. These initiatives, which we refer to as our 2024 Restructuring Plan, include reducing headcount, consolidating and reducing our global real estate footprint, conducting portfolio reviews of our businesses under a \"clean sheet\" view, rationalizing capital investments and deployments based upon demand signals and capacity requirements, and reducing our overall operating expenses. The headcount actions in connection with the 2024 Restructuring Plan are expected to result in an approximate 15% decrease in our core Intel workforce by early 2025. As a result of initiating and deploying our 2024 Restructuring Plan, we recognized restructuring charges of $2.8 billion in 2024.\nOur 2024 consolidated results of operations were also materially impacted by the following:\n■$3.3 billion of charges, substantially all of which were recorded to cost of sales, related to non-cash impairments and the acceleration of depreciation for certain manufacturing assets, a substantial majority of which related to our Intel 7 process node;\n■$3.1 billion of non-cash charges associated with the impairment of goodwill for certain of our reporting units as well as certain acquired intangible assets (see \"Note 7: Restructuring and Other Charges\" within Notes to Consolidated Financial Statements); and\n■$9.9 billion of non-cash charges recorded to provision for income taxes that substantially related to valuation allowances recorded to our net deferred tax assets (see \"Note 8: Income Taxes\" within Notes to Consolidated Financial Statements).\nSegments and Prior Year Results\nDuring 2024, we managed our business through the operating segments that are presented below and have included the 2024, 2023, and 2022 segment financial results and related discussions of our segments' results of operations. Our segments' results of operations presented below exclude the $7.0 billion of restructuring and other charges and $9.9 billion of charges resulting from valuation allowances recorded against our net deferred tax assets, in addition to certain other items, as our CODMs receive, view, and use information for decision-making purposes based upon segment results that exclude such items.\nintel-logo-footer.jpg\nMD&A\n13\n \n\nWe have also included the 2024, 2023, and 2022 consolidated financial results and related discussions of our consolidated results of operations for 2024 relative to 2023 subsequent to the operating segment discussion below. A discussion regarding our consolidated results of operations for 2023 relative to 2022 is included in our 2023 Form 10-K. \"Note 3: Operating Segments\" within Notes to Consolidated Financial Statements of this Form 10-K reconciles our segment and consolidated results for each of the periods presented.\n1 See \"Non-GAAP Financial Measures\" within MD&A.\n\nOperating Segment Trends and Results\n \nIntel Products\nIntel Products consists substantially of the design, development, marketing, sale, support, and servicing of CPUs and related solutions for external customers. Intel Products is composed of three operating segments: CCG, DCAI, and NEX.\nClient Computing Group\nMarket and Business Overview\nOverview\nWe are committed to advancing PC experiences by delivering competitive products and deepening our relationships with industry partners to co-engineer and deliver leading platform innovation. We bring together the operating system, system architecture, hardware, and software application integration to enable industry-leading PC experiences. We embrace these opportunities by focusing on our roadmap, delivering innovative PC capabilities, and designing advanced PC experiences. By doing this, we believe we help fuel innovation across the industry, providing a solid source of IP, scale, and cash flow for Intel.\n\nMarket Trends and Strategy\nIn 2024, the PC market started to stabilize from a soft macroeconomic environment and inflationary pressures, with PC supply and demand levels beginning to normalize. We remain positive on the long-term outlook for PCs, as household density is stable to increasing, educational device penetration rates remain low outside of the US, and PC usage remains elevated compared to pre-pandemic rates1. Commercial growth opportunities also remain as corporations expand the size of their PC fleets, while also replacing older devices. Currently, more than 200 million commercial devices are more than four years old2.\nWe recently introduced our Intel Core Ultra processor family that serves as the CPU for the AI PC, which enables AI capabilities at the client level. We believe the AI PC is a significant potential driver of PC demand over the coming years, and believe we are well-positioned to capitalize on this trend that we expect will support a long-term PC TAM of 300 million units3.\nWe deliver value to our customers by leveraging our engineering capabilities and working with our partners across an open, innovative ecosystem to deliver technology that drives every major aspect of the computing experience, including performance, power efficiency, battery life, connectivity, graphics, and form factors, to create the most advanced PC platforms. We design our products with a philosophy of openness and choice, and seek to continually provide more competitive products with more capabilities for customers.\nProducts and Competition\nIn 2023, we introduced a significant update to our client compute brands to make it easier for customers to identify the right client solutions for their compute needs. Those brands include Intel, Intel Core and Intel Core Ultra. The Intel and Intel Core brands have been staples of the PC industry for nearly two decades and represented our highest volume products by unit sales in 2024. These products are designed to serve a broad cross-section of the customer and computing needs in the client market.\nThe Intel Core Ultra processor family, which we launched at the end of 2023, delivers significant advancements in graphics, AI, and multi-threaded CPU performance and introduced the AI PC to the market. In the second half of 2024, the next-generation Intel Core Ultra 200V Series became our highest performance client processors, with increased battery life for mobile PCs. We also introduced the Intel Core Ultra 200S Series processors, catering to the desktop enthusiast market. We remain committed to delivering the most advanced processing power to support the growing demands of AI, graphics, and multi-threaded workloads.\nWe operate in a particularly competitive market. In processors, we compete with Advanced Micro Devices, Inc. (AMD) and vendors who design applications processors based on ARM architecture, such as Apple Inc. (Apple) with its M series products and Qualcomm Inc. (Qualcomm) with its Snapdragon product. We expect this competitive environment to continue to intensify in 2025.\nWe remain committed to creating an open ecosystem to foster growth and technology innovations. We embrace and collaborate with a global ecosystem of industry partners to deliver competitive technologies together.",
    "item1a": "Risk Factors and Other Key Information\n \n\nRisk Factors\nThe following summarizes the material factors that make an investment in our securities speculative or risky. When any one or more of the following risks materialize from time to time, our business, reputation, financial condition, cash flows, and results of operations can be materially and adversely affected, and the trading price of our common stock could decline. These risk factors do not identify all risks that we face; our operations can also be affected by factors that are not presently known to us or that we currently consider to be immaterial to our operations, or by various risks that are generally applicable to most companies. Due to risks and uncertainties, known and unknown, our past financial results may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results or trends in future periods. Some of the factors, events, and contingencies discussed below may have occurred in the past, and the disclosures below are not representations as to whether or not the factors, events, or contingencies have occurred in the past, but are provided because future occurrences of such factors, events, or contingencies could have a material adverse effect on our business. Refer also to the other information set forth in this Form 10-K, including in the MD&A and Financial Statements and Supplemental Details sections.\nWe are in a highly competitive and rapidly changing industry.\nThe industry in which we operate is highly competitive and subject to rapid technological, geopolitical, and market developments; changes in industry standards; changes in customer and end-user needs, expectations, and preferences; and frequent product introductions and improvements. When we do not anticipate or respond to these developments, our competitive position can weaken, and our products or technologies can become uncompetitive or obsolete. Our competitive environment has intensified in recent years, and we expect it to continue to do so in the future, including as a result of the proliferation of AI and high demand for AI-related products and services. If we are not able to compete effectively, or if our foundry strategy is unsuccessful, our financial results will be adversely affected, including through reduced revenue and gross margin, and we may be required to accelerate the write-down of the value of certain assets.\nWe face intense competition across our product portfolio. Our competitors include companies offering platform products, such as AMD and Qualcomm; accelerator products such as GPUs, including those offered by NVIDIA; other accelerator products such as ASICs, application-specific standard products, and FPGAs; memory and storage products; connectivity and networking products; and other semiconductor products. Some of these competitors have developed or utilize competing computing architectures and platforms, such as the ARM architecture, and these architectures and platforms can produce beneficial network effects for competitors when an ecosystem of customers and application developers for such architectures and platforms grows at scale. For example, ARM-based products and the ARM ecosystem have seen increased development and adoption in recent years. We also compete with internally developed semiconductors from OEMs, cloud service providers, and others, some of whom are customers. Some of these customers vertically integrate their own semiconductor designs with their software assets and/or customize their designs for specific computing workloads. For example, in 2020, Apple introduced PC products utilizing its own internally developed ARM-based semiconductor designs in place of our client CPUs, and we face increasing competition from Apple's products and ecosystem.\nMost of our competitors rely on third-party foundries, such as TSMC or Samsung, for the manufacture and assembly and test of their semiconductor components and products. Manufacturing process and assembly and test improvements introduced by such foundries have contributed, and may continue to contribute, to increasingly competitive offerings by our competitors. Our process technology roadmap to regain transistor performance and power performance competitiveness is subject to a number of risks, and we could fail to realize our goals, including due to changes in competitor technology roadmaps, changes affecting our projections regarding our technology or competing technology, and the risks described in the risk factor \"The development and implementation of new semiconductor products and manufacturing technologies are subject to many risks and uncertainties.\" As an integrated device manufacturer, we have higher capital expenditures and R&D spending than many of our fabless competitors due to the high ongoing investments required to maintain leading-edge process technology and manufacturing capacity. We also face new sources of competition as a result of changes in industry participants through, for example, acquisitions or business collaborations, as well as new entrants, including in China, which could have a significant impact on our competitive position. For example, we could face increased competition as a result of China's programs to promote a domestic semiconductor industry and supply chains.\nOur products compete based on a number of factors, including performance, energy efficiency, ease-of-integration, ease-of-use, innovative design, features, workload optimization, price, quality, reliability, security, software ecosystem and developer support, time-to-market, reliable product roadmap execution, brand recognition, customer support and customization, and availability. The importance of these factors varies by product and market segment. To the extent our products do not meet our customers' requirements across these factors in an increasingly competitive landscape, our business and results of operations can be harmed. For example, we have lost market share in recent years as competitors have introduced highly competitive data center and client platform products. Our data center business has been further negatively impacted by the shift of customer spend toward GPUs in the past few years. Additionally, to the extent we rely upon third party foundries for our products, our margins may be negatively impacted, as has been the case with the Intel Core Ultra 200V series processors launched in September 2024.\nWe have limited experience in the highly competitive and capital-intensive third-party foundry business. As we pursue our strategy to establish Intel Foundry as a major provider of foundry capacity to manufacture semiconductors for others, we will face intense competition from well-established competitors such as TSMC, Samsung, Global Foundries (GF), United Microelectronics Corporation (UMC), and Semiconductor Manufacturing International Corporation (SMIC). To succeed, we will need to compete effectively across factors such as availability and time-to-market of manufacturing technology; advances in manufacturing processes in areas such as performance, performance per watt, and density; multi-chip packaging; system integration; manufacturing capacity; price; margin; ease of use; quality; yields; customer satisfaction; and ecosystem support. Building and maintaining a competitive foundry business requires significant\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n31\n \nTable of Contents\n\nongoing investments to maintain leading-edge process technology and manufacturing capacity, which investments in many instances must be made ahead of customer commitments and may not be recouped. As we have reassessed demand and our \"shell ahead\" status and our financial results in the last few years have constrained our ability to make capital investments, we have delayed manufacturing facility construction or expansion projects in Ohio, Germany, Poland, Malaysia, and Israel, and we may have additional project delays or project cancellations in the future. Moreover, many of the largest potential foundry customers are fabless semiconductor companies whose products compete with our own. As a result, our strategy requires us to overcome customer concerns regarding protection of confidentiality information, intellectual property, and foundry capacity, among other competitive concerns, to attract and retain such customers. Our limited third-party foundry experience also means we must continue to hire and retain talented employees with relevant foundry experience with respect to both leading-edge and legacy nodes. Our efforts may be hindered by the higher costs of, regulatory and environmental restrictions imposed upon, and time it takes to build fabrication and assembly and test facilities in the jurisdictions in which we operate and plan to build new or upgrade existing foundry facilities as compared to the jurisdictions in which our competitors predominantly operate their foundry facilities. Our construction projects to expand capacity require available sources of labor, materials, and equipment. Increasing demand for such sources, including from other foundries; supply constraints, labor shortages, and other adverse market conditions; issues with permits or approvals; on-site incidents; and other construction issues arise from time to time and can result in significant delays and increased costs for our projects, as well as legal and reputational harm. These significant hurdles to our foundry strategy make it highly risky and our success highly uncertain.\nWe are making significant, long-term and inherently risky investments in R&D and manufacturing facilities that may not realize a favorable return.\nTo compete successfully, we must maintain an effective R&D program, develop new products and manufacturing processes, improve our products and processes, and make significant capital investments in new and existing manufacturing facilities, all ahead of competitors and market demand. The R&D efforts and capital investments we require are intensive as we compete across both product and process technologies and we may not have the ability to fund such investments at the level needed to be competitive. We incurred R&D expenses of $16.5 billion in 2024, $16.0 billion in 2023 and $17.5 billion in 2022. We are focusing our R&D efforts across several key areas, including process and packaging technology, our xPU products and features, AI, and software. These include ambitious initiatives, such as our efforts to introduce five new manufacturing process technologies, or nodes, in four years and our unified oneAPI portfolio of developer tools. Our investments are typically long-term and, even where successful, often do not contribute to our operating results for a number of years. We cannot guarantee that our efforts will deliver the benefits we anticipate, including as a result of our new products or technologies falling short of expectations or the offerings of competitors. For example, we previously experienced significant delays in the implementation of our 10nm process technology, and during 2020, we announced that our 7nm process technology would be delayed relative to our prior expectations. In such instances where we do not timely introduce new manufacturing process technologies that improve performance, performance per watt, transistor density, die utilization, core counts, and/or new features such as optimizations for AI and other workloads, with sufficient manufacturing yields and operational efficiency, relative to competing foundry processes, we have faced and will face cost, product performance, and time-to-market disadvantages relative to our competitors. This has in the past and may in the future result in higher operating costs, including as a result of additional costs from unused manufacturing capacity, higher leverage and borrowing costs, and pressure on our credit ratings, and adversely affect our business, financial condition and prospects. Further, we are not always able to timely or successfully develop new products, including as a result of bugs, late changes to features due to customer requests, or other design challenges. For example, in 2022, we announced that the release of Intel's 4th Gen Intel Xeon Scalable processor would be delayed from the first half of 2022 to the second half of 2022. To the extent our R&D efforts do not develop new products on schedule with improvements in areas like performance, performance per watt, die utilization, and core counts, and/or with new features such as optimizations for AI and other workloads, our competitive position can be harmed. We have adopted a disaggregated design approach for some of our future products, in which different processors and components can be manufactured on different processes and connected by advanced packaging technology into a single package. This approach introduces new areas of complexity in design and manufacturability, particularly in the deployment of advanced packaging technologies, several of which are novel, have a limited manufacturing history, and/or have increased costs. Delays or failures in implementing disaggregated designs could adversely affect our ability to timely introduce competitive products. For example, adapting a processor or component design for a new or different manufacturing process involves additional R&D expense and can result in delays in the development of the associated product and higher costs due to the utilization of more advanced and expensive capital equipment.\nThe investments required for our process technology roadmap and our worldwide manufacturing and assembly and test require capital expenditures above our historical levels. In recent years, the semiconductor manufacturing industry has seen very significant increases in the capital investments required for manufacturing facilities utilizing leading process technologies, including as a result of the use of EUV and high-NA EUV lithography tools. Our ownership and operation of such high-tech fabrication facilities, and our need to build new and expand existing facilities in anticipation of future demand, has resulted and will continue to result in us incurring large capital outlays and high costs that are fixed or difficult to reduce in the short term. Such capital outlays and costs include those related to utilization of existing facilities, facility construction and equipment, R&D, and the employment and training of a highly skilled workforce. To the extent customers are unwilling to pay prices to access the features that our process and product investments are expected to deliver, or if demand for our products, foundry capacity and assembly and test capacity decreases or we fail to forecast demand accurately, our gross margin and operating income can be disproportionately affected due to our high fixed cost structure, which is difficult to reduce quickly in response to lower demand and other unfavorable market factors. As we have reassessed demand and our \"shell ahead\" status and our financial results in the last few years have constrained our ability to make capital investments, we have delayed manufacturing facility construction or expansion projects in Ohio, Germany, Poland, Malaysia, and Israel. We could also be required to write off inventory or record excess manufacturing capacity charges, which would also lower our gross margin and operating income. To the extent the demand decrease is prolonged, our manufacturing or assembly and test capacity could be underutilized, and we may be required to write down our long-lived assets, which would increase our expenses. We may also be required to shorten the useful lives of under-used facilities and equipment and accelerate depreciation. For example, in the third quarter of 2024 we recorded $3.1 billion of charges related to non-cash impairments and the accelerated depreciation for certain manufacturing assets, a substantial majority of which related to the Intel 7 process node.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n32\n \nTable of Contents\n\nThe development and implementation of new semiconductor products and manufacturing technologies are subject to many risks and uncertainties.\nWe are continually engaged in the development of next-generation technologies. Forecasting our progress and schedule for developing advanced nodes and other technologies is challenging, and at times we encounter unexpected delays due to the complexity of interactions among steps in the manufacturing process, challenges in using new materials or new production equipment, and other issues. Diagnosing defects in our manufacturing processes often takes a long time, as manufacturing throughput times can delay our receipt of data about defects and the effectiveness of fixes, and defects can be more serious and difficult to resolve than initially anticipated.\nWe are not always successful or efficient in developing or implementing new process nodes and manufacturing processes. We experienced significant delays in implementing our 10nm process technology, and in 2020, we encountered a defect mode in the development of our 7nm process technology that resulted in delays relative to our prior expectations. In 2022, Intel's 4th Gen Intel Xeon Scalable processor was delayed to allow for more platform and product validation time. These delays have allowed competitors using third-party foundries, such as TSMC, to benefit from advancements in manufacturing processes introduced ahead of us, including improvements in performance, energy efficiency, and other features, which have helped increase the competitiveness of their products. On the product side, we have had limited market success with our accelerator offerings, and in 2024 we recognized $922 million in Gaudi AI accelerator inventory-related charges. We may experience greater adverse competitive impacts in the event of further delays in the development of future manufacturing process technologies and products or lack of market success with our offerings.\nOur efforts to innovate involve significant expense and carry inherent risks, including difficulties in designing and developing next-generation process and packaging technologies, and investments in manufacturing assets and facilities that are made years in advance. We cannot guarantee that we will realize the expected benefits of next-generation process technologies, including the expected cost, performance, power, and density advantages, or that we will achieve an adequate return on our capital and R&D investments, particularly as the development of new nodes has grown increasingly expensive. In such circumstances, we may be required to write down the value of some of our manufacturing assets and facilities, increasing our expenses, as we were required to do in the third quarter of 2024 with respect to the Intel 7 process node.\nRisks inherent in the development of next-generation process technologies include production timing delays, lower-than-anticipated manufacturing yields, longer manufacturing throughput times, failure to achieve expected performance, power, and area improvements, and product defects and errata (deviations from published specifications). Production timing delays have at times caused us to miss customer product design windows, which can result in lost revenue opportunities and damage to our customer relationships. Furthermore, when the introduction of next-generation process nodes is delayed, adding cores or other competitive features to our products can result in larger die size products, manufacturing supply constraints, and increased product costs. Lower manufacturing yields and longer manufacturing throughput times, compared to previous process nodes, can increase our product costs, adversely affect our gross margins, and contribute to manufacturing supply constraints. A new process node typically has higher costs compared to a mature node due to factors that include higher depreciation costs and lower yields, and costs and yields at times do not improve at the same rate as on prior nodes. In addition, the cost of new leading-edge process nodes continues to increase at a higher rate relative to legacy process nodes due to a number of factors, including the cost of procuring and operating advanced manufacturing equipment. As the die size of our products has increased and our manufacturing process nodes have increased the number of transistors per die, our products and manufacturing processes have grown increasingly complex and more susceptible to product defects and errata, which at times also contribute to production timing delays and lower yields that may also increase our costs to manufacture and warranty our products.\nOur disaggregated design strategy poses increased logistical risks and challenges, particularly where we decide to manufacture different product components on different process technologies, including third-party foundries' process technologies. To combine components in a single package, they need to be manufactured on a timely basis and in sufficient quantities, while the manufacturing processes we utilize may have differing yields, throughput times, and capacity constraints. We may be required to safely store some components pending the manufacture of others. Delays or quality issues with one component could limit our ability to manufacture the entire completed product. In addition, the packaging technologies used to combine these components can increase our costs and may introduce additional complexity and quality issues. To the extent we are unable to manage these risks, our ability to timely supply competitive products can be harmed and our costs could increase.\nFrom time to time, disruptions in the production process result from errors; defects in materials; delays in obtaining or revising permits and licenses; interruptions in our supply of materials, resources, or production equipment; adverse changes in equipment productivity; and disruptions at our fabrication and assembly and test facilities due to accidents, maintenance issues, power interruptions, equipment malfunctions, or unsafe working conditions—all of which could affect the timing of production ramps and yields and could result in production timing delays. Production issues periodically lead to increased costs and affect our ability to meet product demand, which can adversely impact our business and the results of operations.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n33\n \nTable of Contents\n\nOur implementation of new business strategies and investments in new businesses, products, and technologies are inherently risky and do not always succeed.\nOur implementation of new business strategies, including our foundry strategy and our cost reduction measures, as well as our many internal structural, systems, and process changes, may subject us to a number of risks. We have entered new businesses and introduced new products and services as we seek to capitalize on the opportunities presented by growth in semiconductor demand, ubiquitous compute, pervasive connectivity, cloud-to-edge infrastructure, AI, and sensing. As part of our strategy, we announced plans to establish Intel Foundry as a major provider of foundry capacity to manufacture semiconductors for others and to implement an internal foundry operating model through updates to our processes, systems, and guardrails between our manufacturing and our individual product-based business units. The implementation of our internal foundry operating model requires many internal structural, system, and process changes to support the separation of the product and manufacturing sides of our business and our external foundry business, including a new enterprise resource planning system. In parallel, we are undertaking significant efforts to separate out portions of our business, such as operating Intel Foundry, Altera and IMS, as autonomous subsidiaries that we majority own and consolidate in order to potentially raise capital and unlock value as we focus on our core product and manufacturing capabilities. Significant business changes are inherently risky and are not always successful. For example, in 2022, we wound down Intel Optane; in 2020, we agreed to sell our NAND memory business to SK hynix; and in 2019, we exited the 5G smartphone modem business based on our determination that there was no clear path to profitability for those businesses.\nThese new and developing areas and products represent a significant portion of our revenue growth opportunity, and they also introduce new sources of competition in not just new and evolving markets but also in our existing markets. These new sources of competition can include established competitors with well-developed and highly competitive technologies, ecosystems, and customer bases, lower prices, margins, or costs, and greater brand recognition. These developing products and market segments require significant investment, do not always grow as projected or at all, or sometimes adopt competing technologies, and we may not realize an adequate return on our investments. For example, AI and machine learning are increasingly driving innovations in technology, but if we fail to develop leading products for these workloads, or if our customers use competing technologies, we may not realize a return on our investments in these areas. We may also not be successful in developing a competitive foundry business for external customers with respect to either leading-edge or mature process nodes, which would make it difficult for us to realize a favorable return on our investments in process technology and manufacturing capacity investments. To be successful, we need to cultivate relationships with customers and partners in these market segments and continue to improve our offerings. Despite our ongoing efforts, there is no guarantee that we will achieve or maintain market demand or acceptance for our products and services in these various market segments or realize an adequate return on our investments, which could lead to impairment of assets and restructuring charges, as well as opportunity costs.\nOur Smart Capital approach to capital spending, alternative financing arrangements, and pursuit of government grants involves risks and may not be successful.\nAs we pursue our strategy, we have utilized our Smart Capital approach to capital spending in an effort to appropriately time and scale our capital investments. To support our capital investments, we have pursued alternative financing arrangements, such as our 2022 joint investment with Brookfield in the manufacturing expansion of our Arizona campus, and our 2024 joint investment with Apollo related to Fab 34 in Ireland, and may enter into similar arrangements in the future. These transactions may fail to advance our business strategy, may include unfavorable pricing or other terms such as penalties should key metrics not be attained as prescribed by our agreements, and may fail to achieve their anticipated benefits. Both arrangements include commitments we may not be able to satisfy, including commitments relating to construction and/or wafer demand or purchase, in which case we may be required to make additional payments to our partners. For example, in the fourth quarter of 2024, we recognized a $755 million charge related to penalties we expect to pay in connection with Ireland SCIP for construction delays we decided to make as we reduced our near-term capacity requirements. Further, both arrangements are expected to significantly and increasingly impact our net income (loss) attributable to Intel and earnings (loss) per share attributable to Intel in future periods as wafer production volumes increase at our expanded Arizona campus and at Fab 34 in Ireland. Our partners may also fail to satisfy financial or other obligations on which we rely and we may fail to resolve any potential disputes. Any of these risks, including our ability to effectuate any additional transactions at all, could have a material adverse effect on our business, results of operations, financial condition, or cash flows, which may limit our ability to raise sufficient capital for our required investments.\nIn addition, as part of our Smart Capital approach, we have applied for, received, and expect to receive additional grants and incentives from domestic and foreign local, regional, and national governments. Legislation in the US and EU has been adopted to provide government funding for semiconductor manufacturing expansions in those regions. However, any amounts, if any, we may receive under any agreements enabled by such legislation may not be sufficient in amount or timeliness to support our capital investment plans and offset the higher costs of operations in many of the locations of our facilities as compared to those of many of our competitors, we may be unable to comply with the requirements and limitations of any such grants and incentives, or such agreements may contain restrictions that limit our flexibility to pursue changes in business strategy or transactions that may enhance stockholder value. For example, in November 2024 we entered into a direct funding agreement with the US Department of Commerce under the CHIPS Act that contains detailed milestones we must achieve for us to receive the funds, including with respect to achievement of various milestones with respect to capital expenditures, facility completion, process technology development, wafer production, Intel products insourcing, and external foundry customer acquisitions. It also contains restrictions on certain “change of control” transactions we are permitted to engage in, a requirement that we share with the US government project returns above specified thresholds, and various termination rights and remedies if we were to breach the agreement, including potential repayment of some or all of the awards. To the extent funding is below our expectations, we elect not to accept any grants or incentives due to burdensome compliance requirements, we are required to return any amounts received from any grants or incentives due to an inability to comply with any requirements or limitations contained therein, we are subject to restrictions as a result of any awards we have accepted, or the US government delays or does not provide any awards\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n34\n \nTable of Contents\n\nthat have been agreed upon, our anticipated cash requirements may increase, our strategy, business and financial results may be adversely affected, and we may be constrained in our ability to engage in transactions that are in the best interests of our stockholders.\nChanges in product demand and margins can adversely affect our financial results.\nOur products are used in different market segments, and demand for our products varies within or among them. It is difficult to forecast these changes and their impact. For example, we expect the PC TAM to grow over time, driven by factors such as a larger installed base, demand for AI capabilities, new platforms, shorter replacement cycles, and adoption in new markets; however, the PC industry has been highly cyclical in the past, and these growth expectations may not materialize, or we may fail to capitalize on them. Changes in the demand for our products have in the past and may in the future reduce our revenue, lower our gross margin, or require us to write down the value of our assets.\nImportant factors that lead to variation in the demand for our products include:\n▪business conditions, including downturns in the market segments in which we operate, or in global or regional economies;\n▪consumer confidence, income levels, and customer capital spending, which can be impacted by changes in market conditions, including changes in government borrowing or spending, taxation, interest rates, the credit market, current or expected inflation, employment, and energy or other commodity prices;\n▪customer product needs and emerging technology trends, including changes in the levels and nature of customer and end-user computing workloads, such as the shift in data center spend to GPUs to support AI workloads;\n▪geopolitical conditions, including trade policies, potential tariffs or other trade restrictions, and geopolitical tensions and conflicts;\n▪our ability to timely introduce competitive products;\n▪competitive and pricing pressures, including new product introductions and other actions taken by competitors;\n▪the level of our customers' inventories and computing capacity;\n▪customer order patterns and order cancellations, including as a result of maturing product cycles for our products, customers' products, and related products such as operating system upgrade cycles; and\n▪disruptions affecting customers, such as the delays in obtaining tools, components, and other supplies as a result of COVID-19-related port shutdowns in China that negatively impacted demand for our business in 2022, as well as the industry substrate and component shortages that negatively impacted demand across several of our businesses in 2021.\nOur pricing and margins vary across our products and market segments due in part to marketability of our products and differences in their features or manufacturing costs. For example, our core product offerings range from lower-priced and entry-level platforms to higher-end platforms. Our ancillary product offerings that extend beyond our core product lines typically have significantly lower margins than our higher-priced products, and at times are not profitable. Some of our higher-priced products, however, such as the Intel Core Ultra 200V processors launched in September 2024, have lower margins as they are produced at external foundries rather than in our manufacturing facilities. To the extent demand shifts from our higher-margin to lower-margin products in any of our market segments, as has been the case with the Intel Core Ultra 200V processors, our gross margin percentage has decreased and may decrease again.\nMacroeconomic conditions and geopolitical tensions and conflicts, including changes to trade policies and regulations, present significant risks to us in many jurisdictions.\nWe have manufacturing, assembly and test, R&D, sales, and other operations in many countries, and some of our business activities are concentrated in one or more geographic areas. Our operations rely upon a supply chain that is also highly distributed, and with reliance in some instances on supplies or materials available in only one or more geographic areas. Moreover, sales outside the US accounted for 76% of our revenue for the fiscal year ended December 28, 2024, with revenue from billings to China contributing 29% of our total revenue. As a result, our operations and our financial results, including our ability to execute our business strategy, manufacture, assemble and test, design, develop, or sell products, and the demand for our products, are at times adversely affected by a number of global and regional factors outside of our control.\nAdverse changes in global or regional economic conditions periodically occur, including recession or slowing growth; changes or uncertainty in fiscal, monetary, or trade policy; high interest rates; tighter credit; inflation; lower capital expenditures by businesses, including on IT infrastructure; increases in unemployment; and lower consumer confidence and spending. Adverse changes in macroeconomic conditions can significantly harm demand for our products and make it more challenging to forecast our operating results and make business decisions, including regarding prioritization of investments in our business. An economic downturn or increased uncertainty may also lead to: increased credit and collectability risks; higher borrowing costs or reduced availability of capital and credit markets; reduced liquidity; adverse impacts on our suppliers; failures of counterparties, including financial institutions and insurers; asset impairments; and declines in the value of our financial instruments.\nTrade policies and disputes at times result in increased tariffs, trade barriers, and other trade restrictions and protectionist measures, which can increase our manufacturing costs, make our products less competitive, reduce demand for our products, limit our ability to sell to certain customers, limit our ability to procure components or raw materials, or impede or slow the movement of our goods across borders. Increasing protectionism and economic nationalism may lead to further changes in trade policies and regulations, domestic sourcing initiatives, or other formal and informal measures that could make it more difficult to sell our products in, or restrict our access to, some markets. They can also result in declining consumer confidence and slowing economic growth or recession, and could cause our customers to reduce, cancel, or alter the timing of their purchases with us. Sustained geopolitical tensions could lead to long-term\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n35\n \nTable of Contents\n\nchanges in global trade and technology supply chains, domestic sourcing initiatives, and decoupling of global trade networks, which could make it more difficult to sell our products in, or restrict our access to, some markets and have a material adverse effect on our business and growth prospects.\nIn particular, geopolitical and trade tensions between the US and China, one of our largest markets, have led to increased tariffs and trade restrictions, including tariffs applicable to some of our products, and have affected customer ordering patterns. Further, the US has imposed restrictions on the export of US-regulated products and technology to certain Chinese technology companies, including certain of our customers. Specifically, in 2022 the US significantly increased US export controls on semiconductor manufacturing equipment and on AI and advanced computing products. In 2023, the US added to the restrictions in all three areas and also worked with Japan and the Netherlands to align on additional restrictions on semiconductor manufacturing equipment. In 2024, the US Commerce Department further expanded export controls to limit the global distribution of high-performance integrated circuits by restricting sales through customer allocations and imposing per-country caps. During this time, the US has increasingly added Chinese companies to prohibited lists. In response, China has restricted US access to certain minerals and has blocked certain companies that provide products to Taiwan's military from selling products in China. These restrictions have in some instances reduced our sales and in a number of instances required specific governmental authorizations or exceptions. These and potential future restrictions, including also through application of antitrust laws and restrictions based on cybersecurity and other national security concerns, could adversely affect our financial performance and result in reputational harm to us. In addition, a number of semiconductor companies in China, including SMIC, are making significant investments, in many instances with the support of the Chinese government, in advanced semiconductor technologies to enable such companies to develop products and technologies that compete with ours. It is difficult to predict what further trade-related actions governments may take, whether the 2025 change in US administration may heighten tensions, the extent to which we may be able to mitigate the effects of any trade-related actions, and the longer-term implications of trade-related actions on the market opportunities for us and the competition we may face.\nGeopolitical and security issues, such as armed conflict and civil or military unrest, political instability, human rights concerns, and terrorist activity, present significant risks to our global operations. For example:\n▪There has been a significant escalation in tensions and hostilities affecting or in close proximity to Israel, where we have a leading-edge fabrication facility and multiple product development centers. As a significant portion of our revenues are generated from products on Intel 7 manufactured at our fabrication facility in Israel and we are not insured for business interruptions, a disruption of that facility could have a significant adverse impact on our business. Additionally, our property, plant, and equipment assets in Israel are self-insured and could be impacted by the conflict. Further, our Mobileye business is headquartered and has most of its operations in Israel and could be similarly impacted.\n▪Tensions between mainland China and Taiwan have increased significantly in recent years, presenting an elevated risk of hostilities. Many of our products and all of our more advanced products depend on suppliers in Taiwan for critical components, including various compute die, that cannot be easily or quickly replaced. Other of our products, including some of our most recently introduced products, are made entirely in Taiwan. As such, any disruption impacting Taiwan could significantly and adversely impact our ability to obtain critical components and supply our customers with products.\n▪Russia’s ongoing conflict with Ukraine has resulted in the imposition of financial and other sanctions and export controls against Russia and Belarus that has caused us and other companies to limit or suspend Russian operations (we had no exports to Russia in 2023 and 2024). The conflict has also resulted in Russia-imposed currency restrictions and regulations and other retaliatory trade and other actions, increased supply, commodity, and other costs, and an increased risk of cyberattacks.\nWe can also be adversely affected by other global and regional factors that periodically occur, including:\n▪severe weather events and natural disasters, public health issues (including pandemics), and other catastrophic events;\n▪inefficient infrastructure and other disruptions, such as supply chain interruptions, materials shortages or delays, and large-scale outages or unreliable provision of services from utilities, transportation, data hosting, or telecommunications providers;\n▪formal or informal imposition of new or revised export, import, or doing-business regulations, including trade sanctions, tariffs, and changes in the ability to obtain export licenses, which could be changed without notice;\n▪government restrictions on, or nationalization of, our operations in any country, or restrictions on our ability to repatriate earnings from or distribute compensation or other funds in a particular country;\n▪adverse changes relating to government grants, tax credits, or other government incentives, including more favorable incentives provided to competitors;\n▪differing employment practices and labor issues, including restricted access to talent;\n▪ineffective legal protection of our IP rights in certain countries;\n▪local business and cultural factors that differ from our current standards and practices;\n▪continuing uncertainty regarding social, political, immigration, and tax and trade policies in the US and abroad; and\n▪fluctuations in the market values of our domestic and international investments, and in the capital and credit markets, which can be negatively affected by liquidity, credit deterioration or losses, interest rate changes, financial results, political risk, sovereign risk, or other factors.\nWe are subject to numerous risks associated with the evolving market for products with AI capabilities.\nThe markets and use cases for products with AI capabilities have been rapidly evolving, are difficult to predict, and may impact demand for our products. For example, in the last few years, the demand for high-end GPUs for model training increased dramatically and has resulted and may continue to result in a significant shift in data center customer spend. The significant investments we have made and\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n36\n \nTable of Contents\n\nexpect to continue to make to develop products and software to address what we believe will be increasing demand for AI capabilities, most notably in AI PCs but also in the data center and in GPUs, may be insufficient, and we face significant hurdles, including whether demand will materialize, whether third-party developers will develop the software to utilize the AI capabilities of our products, and whether we will be successful in developing products that can compete with offerings by established competitors.\nOur use of AI technology may subject us to reputational, financial, legal, or regulatory risks. As we incorporate AI technology into our products and services, any failure to address concerns relating to the responsible use of the evolving AI technology in our products and services may cause harm to our reputation or financial liability and, as such, may increase our costs to address or mitigate such risks and issues. AI technology may create ethical issues, generate defective algorithms, and present other risks that create challenges with respect to its adoption. In addition, evolving laws, rules, regulations, and industry standards governing AI may require us to expend significant resources to modify, maintain, or align our business practices or products.\nWe rely upon a complex global supply chain.\nWe have a highly complex global supply chain composed of thousands of suppliers. These suppliers provide direct materials for our production processes; supply tools, equipment, and IP (via licenses) for our factories; deliver logistics and packaging services; and supply software, lab, and office equipment, and other goods and services used in our business. We also rely on suppliers to provide certain components for our products and to manufacture and assemble and test some of our components and products. From time to time, we are negatively impacted by supply chain issues, including:\n▪suppliers extending lead times, experiencing capacity constraints, limiting or canceling supply, allocating supply to other customers including competitors, delaying or canceling deliveries, or increasing prices;\n▪supplier quality issues;\n▪cybersecurity events, IP or other litigation, man-made or natural disasters, public health issues (including pandemics), operational failures, or other events that disrupt suppliers;\n▪long lead times to qualify alternate or additional suppliers, or the unavailability of qualified alternate suppliers; and\n▪increased legislation, regulation, or stakeholder expectations regarding sourcing, including with respect to national security, human rights and environmental impact concerns.\nThese and other supply chain issues can increase our costs, disrupt or reduce our production, delay our product shipments, prevent us from meeting customer demand, damage our customer relationships, or negatively affect our reputation. They may keep us from successfully implementing our business strategy and can materially harm our business, competitive position, results of operations, and financial condition. From time to time, our customers experience disruptions or shortages in their own supply chains that constrain their demand for our products. During the past several years, macroeconomic and geopolitical conditions, as well as outbreaks of COVID-19, caused supply chain disruptions and delays in obtaining tools and other components, and the semiconductor industry experienced widespread shortages of substrates and other components and available foundry manufacturing capacity. These shortages have previously limited our ability to supply customer demand in certain of our businesses, and have adversely affected customer demand for our products, as some customers have been unable to procure sufficient quantities of third-party components used together with our products to produce finished systems. It is difficult to predict the future impact of these shortages when they occur.\nTo obtain future supply of certain materials and components, particularly substrates, and third-party foundry manufacturing capacity, we have entered into arrangements with some of our suppliers that involve long-term purchase commitments and/or large prepayments. These arrangements may not be adequate to meet our requirements, or our suppliers may fail to deliver committed volumes on time or at all, or their financial condition may deteriorate. If future customer demand over the horizon of such arrangements falls below our expectations, we could have excess or obsolete inventory, unneeded capacity, and increased costs, and our prepayments may not be fully utilized, and in some cases may not be fully recoverable.\nWe utilize third-party foundries and component suppliers to manufacture or supply a number of our products and components necessary for our products that we manufacture. As part of our strategy, we expect to continue to rely upon third-party foundries. Delays in the development of foundries' future manufacturing processes could delay the introduction of products or components we design for such processes, and insufficient foundry capacity could prevent us from meeting customer demand. We typically have less control over delivery schedules, design and manufacturing co-optimization, yields, quality, product quantities, and costs for components and products that are manufactured by third parties.\nWhere possible, we seek to have several sources of supply. However, for certain products, components, services, materials, and equipment, we rely on a single or a limited number of suppliers, or upon suppliers in a single location, which can impact the nature, quality, availability, and pricing of the products and services available to us. For example, ASML Holding N.V. (ASML) is currently the sole supplier of EUV lithography tools that we are deploying in our Intel 4 and subsequent leading-edge manufacturing process nodes. These tools are highly complex to develop and produce, and increasingly costly, and from time to time there are increases in lead times or delays in their development and availability, which could delay the development or ramp of our future process nodes. As a further example, a limited number of third-party foundries offer leading-edge manufacturing processes, and these providers are geographically concentrated in Asia. Some of our most advanced current and future products are or will be either exclusively manufactured by TSMC or reliant upon critical components, including various compute die, manufactured by TSMC.\nWe are subject to the risks of product defects, errata, or other product issues.\nFrom time to time, we identify product defects, errata, and other product issues, which can result from problems in our product design or our manufacturing and assembly and test processes. Components and products we purchase or license from third-party suppliers, or gain\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n37\n \nTable of Contents\n\nthrough acquisitions, can also contain defects. Product issues also sometimes result from the interaction between our products and third-party products and software. We face risks if products that we design, manufacture, or sell, or that include our technology, cause personal injury or property damage, even where the cause is unrelated to product defects or errata. These risks may increase as our products are introduced into new devices, market segments, technologies, or applications, including transportation, autonomous driving, healthcare, communications, financial services, and other industrial, critical infrastructure, and consumer uses.\nCosts from defects, errata, or other product issues could include:\n▪writing off some or all of the value of inventory;\n▪recalling products that have been shipped;\n▪providing product replacements or modifications;\n▪providing consideration to customers, including reimbursement for certain costs they incur;\n▪defending against litigation and/or paying resulting damages;\n▪paying fines imposed by regulatory agencies; and\n▪reputational harm.\nThese costs could be large and may increase expenses and lower gross margin, and/or result in delay or loss of revenue. Mitigation techniques designed to address product issues, including software and firmware updates, are not always available on a timely basis—or at all—and do not always operate as intended or effectively resolve such issues for all applications. We and third parties, such as hardware and software vendors, make prioritization decisions about which product issues to address, which can delay, limit, or prevent development or deployment of a mitigation and harm our reputation and result in costs. Product defects, errata, or other product issues and/or mitigation techniques can result in product failures, adverse performance and power effects, reboots, system instability or unavailability, loss of functionality, data loss or corruption, unpredictable system behavior, decisions by customers and end users to limit or change the applications in which they use our products or product features, and other issues. For example, during 2024, some of our customers experienced instability issues when using Intel Core 13th and 14th Gen desktop processors, which required us to undertake an investigation and deploy corrective actions. This adversely impacted sales volume during 2024 and may result in higher warranty costs in the future.\nProduct issues can damage our reputation, negatively affect product demand, delay product releases or deployment, result in legal liability, or make our products less competitive, which could harm our business and financial results. Subsequent events or new information can develop that change our assessment of the impact of a product issue. In addition, our liability insurance coverage has certain exclusions or may not adequately cover liabilities incurred. Our insurance providers may be unable or unwilling to pay a claim, and losses not covered by insurance could be large, which could harm our financial condition.\nWe face risks related to security vulnerabilities in our products.\nWe or third parties regularly identify security vulnerabilities with respect to our processors and other products, as well as the operating systems and workloads that run on them and the components that interact with them. Components and IP we purchase or license from third parties for use in our products, as well as industry-standard specifications we implement in our products, are also regularly subject to security vulnerabilities. Our processors and other products are being used in application areas that create new or increased cybersecurity and privacy risks, including applications that gather and process large amounts of data, such as the cloud or Internet of Things, and critical infrastructure and automotive applications. The security vulnerabilities identified in our processors include a category known as side-channel vulnerabilities, such as the variants referred to as \"Spectre\" and \"Meltdown.\" Additional categories and variants have been identified and are expected to continue to be identified. Security and manageability features in our products cannot make our products absolutely secure, and these features themselves are subject to vulnerabilities and attempts by third parties to identify additional vulnerabilities. We, our customers, and the users of our products do not always promptly learn of or have the ability to fully assess the magnitude or effects of a vulnerability, including the extent, if any, to which a vulnerability has been exploited. Subsequent events or new information can develop that changes our assessment of the impact of a security vulnerability, including additional information learned as we develop and deploy mitigations or updates, become aware of additional variants, evaluate the competitiveness of existing and new products, and address future warranty or other claims or customer satisfaction considerations, as well as developments in the course of any litigation or regulatory inquiries or actions over these matters.\nMitigation techniques designed to address security vulnerabilities in our products, including software and firmware updates or other preventative measures, are not always available on a timely basis—or at all—and at times do not operate as intended or effectively resolve vulnerabilities for all applications. In addition, we are often required to rely on third parties, including hardware, software, and services vendors, as well as our customers and end users, to develop and/or deploy mitigation techniques, and the availability, effectiveness, and performance impact of mitigation techniques can depend solely or in part on the actions of these third parties in determining whether, when, and how to develop and deploy mitigations. Export restrictions may impede our ability to provide updates or patches to customers in certain geographies or that appear on sanctions lists, potentially leaving systems unpatched and open to exploitation. Further, sanctions lists may include third parties with whom we need to interact for coordinated vulnerability disclosure, which may impair our ability to receive information about vulnerabilities and to deliver mitigations for them. We and such third parties make prioritization decisions about which vulnerabilities to address, which can delay, limit, or prevent development or deployment of a mitigation and harm our reputation. Security vulnerabilities and/or mitigation techniques can result in adverse performance or power effects, reboots, system instability or unavailability, loss of functionality, data loss or corruption, unpredictable system behavior, decisions by customers and end users to limit or change the applications in which they use our products or product features, and/or the misappropriation of data by third parties.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n38\n \nTable of Contents\n\nSecurity vulnerabilities and any limitations or adverse effects of mitigation techniques can adversely affect our results of operations, financial condition, customer relationships, prospects, and reputation in a number of ways, any of which may be material. For example, whether or not vulnerabilities involve attempted or successful exploits, they may result in our incurring significant costs related to developing and deploying updates and mitigations, writing down inventory value, defending against product claims and litigation, responding to regulatory inquiries or actions, paying damages, addressing customer satisfaction considerations, providing product replacements or modifications, or taking other remedial steps with respect to third parties. Adverse publicity about security vulnerabilities or mitigations could damage our reputation with customers or users and reduce demand for our products and services. These effects may be greater to the extent that competing products are not susceptible to the same vulnerabilities or if vulnerabilities can be more effectively mitigated in competing products. Moreover, third parties can release information regarding potential vulnerabilities of our products before mitigations are available, which, in turn, could lead to attempted or successful exploits, adversely affect our ability to introduce mitigations, or otherwise harm our business and reputation.\nWe are subject to increasing and evolving cybersecurity threats and privacy risks.\nWe face significant and persistent cybersecurity risks due to: the breadth of geographies, networks, and systems we must defend against cybersecurity attacks; the complexity, technical sophistication, value, and widespread use of our systems, products, and processes; the attractiveness of our systems, products, and processes to threat actors (including state-sponsored organizations) seeking to inflict harm on us or our customers; the substantial level of harm that could occur to us and our customers were we to suffer impacts of a material cybersecurity incident; and our use of third-party products, services, and components. Such an incident, whether or not successful, could result in our incurring significant costs related to, for example, rebuilding our internal systems, writing down inventory value, implementing additional threat protection measures, providing modifications to our products and services, defending against litigation or enforcement proceedings, paying damages, providing customers with incentives to maintain a business relationship with us, or taking other remedial steps with respect to third parties, as well as incurring significant reputational harm. We regularly face attempts by malicious attackers who attempt to gain access to our network or data centers or those of our suppliers, customers, partners, end users, or other third parties; steal proprietary, personal, or confidential information related to our business, products, employees, suppliers, or customers; sabotage our systems or those of our suppliers, customers, partners, end users, or other third parties; interrupt our systems and services or those of our suppliers, customers, or others; or demand ransom to return control of such systems and services. As we operate and expect to grow certain emerging business lines, such as our third-party foundry business and our cloud computing and SaaS offerings, we expect to collect or host significant amounts of highly sensitive customer data, which may increasingly make us a target of attempts to steal or corrupt that data. Individuals and organizations, including malicious hackers, state-sponsored organizations, insider threats including employees and third-party service providers, and intruders into our physical facilities, at times attempt to gain unauthorized access to and/or corrupt the processes used to design and manufacture our hardware products and our associated software and services. We are also a frequent target of attackers that intend to sabotage, compromise, take control of, or otherwise corrupt our manufacturing or other processes, products, and services. In some instances, we, our suppliers, our customers, and the users of our products and services may be unaware of a threat or incident or its magnitude and effects, or we may be unable to timely mitigate the impacts of an incident.\nCyber attack attempts are increasing in number, magnitude, and technical sophistication, and if successful, may expose us and the affected parties to loss or misuse of proprietary or confidential information or disruptions to our business operations, including our manufacturing operations, and could impact our financial results. We expect emerging technologies to contribute to the increasing sophistication of attacks and to lead to new threats. For example, threat actors are leveraging emerging AI technologies to develop new hacking tools and attack vectors, exploit vulnerabilities, obscure their activities, and increase the difficulty of threat attribution. The proliferation of generative AI increases the risk of these technologies being used by threat actors to impersonate authorized individuals, which may make attacks even more difficult to detect and prevent. Moreover, the increased adoption of generative AI models within our internal systems, processes, and tools may create new attack methods for threat actors.\nAs a developer of leading-edge manufacturing process nodes and widely utilized semiconductor processors and other products, we have been, and expect to continue to be, the subject of intense efforts by sophisticated cyber adversaries, including state-sponsored organizations, who seek to compromise our systems, disrupt our operations or those of users of our products, or steal trade secrets. As geopolitical or armed global conflicts escalate, attacks against us, our customers, or our strategic allies may similarly intensify. For example, from 2019 to 2021, we, along with other companies with meaningful operations in Israel, were targets of concerted cyberattacks. In the fourth quarter of 2020, our Habana Labs subsidiary's network was breached in connection with a suspected unsuccessful ransomware attack, resulting in unauthorized third-party access of certain confidential information.\nWe are also subject to risks associated with attacks on products, services, and components in our supply chain, such as the 2020 compromise of IT infrastructure management software provided by SolarWinds Corporation, and risks from vulnerabilities in using industry-wide software solutions and third-party components, such as the 2021 Log4Shell vulnerability and similar vulnerabilities that followed. The CrowdStrike outage that occurred in 2024 is another example of the risks we face from utilizing products and components that are widely adopted in supply chains. These providers can experience breaches of their systems and products, or provide inadequate updates or support, which can impact the security of our systems and our proprietary or confidential information. Since 2021, we have observed an increase in ransomware attacks in our supply chain.\nWe are required to comply with stringent, complex, and evolving laws, rules, regulations, and standards in many jurisdictions, as well as contractual obligations, relating to cybersecurity and data privacy. Any failure or perceived failure by us to so comply, or any compromise of security that results in unauthorized access to, or unauthorized loss, destruction, use, modification, acquisition, disclosure, release, or transfer of personal information, may result in our having to modify or cease certain operations or practices; the expenditure of substantial costs, time, and other resources; legal proceedings or actions against us (including class action lawsuits); or governmental investigations.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n39\n \nTable of Contents\n\nThe theft, loss, or misuse of personal data collected, used, stored, or transferred by us to run our business, including data stored with vendors or other third parties, could result in significantly increased business and security costs or costs related to defending legal claims. Costs to comply with and implement privacy-related and data-protection measures are significant, and noncompliance could expose us to significant monetary penalties, damage to our reputation, suspension of online services or sites in certain countries, and even criminal sanctions.\nWe are subject to IP risks, including related litigation and regulatory proceedings.\nWe cannot always protect our IP or enforce our IP rights. We regard our patents, copyrights, trade secrets, and other IP rights as important to the success of our business. We rely on IP law—as well as confidentiality and licensing agreements with our customers, employees, technology development partners, and others—to protect our IP and IP rights. Our ability to enforce these rights is subject to general litigation risks, as well as uncertainty as to the enforceability of our IP rights in various countries and other geopolitical factors. We are not always able to obtain protection for our IP or enforce or protect our IP rights. When we seek to enforce our rights, we may be subject to claims that our IP rights are invalid, not enforceable, or licensed to an opposing party. Our assertion of IP rights may result in another party seeking to assert claims against us, which could harm our business. From time to time, governments adopt regulations and governments or courts render decisions requiring compulsory licensing of IP rights, or governments require products to meet standards that favor local companies. Our inability to enforce our IP rights under any of these circumstances can harm our competitive position and business. In some cases, our IP rights can offer inadequate protection for our innovations. In addition, the theft or unauthorized use or publication of our trade secrets and other confidential business information could harm our competitive position and reduce acceptance of our products; as a result, the value of our investment in R&D, product development, and marketing could be reduced.\nOur licenses with other companies and participation in industry initiatives at times allow competitors to use some of our patent rights. Technology companies often bilaterally license patents between each other to settle disputes or as part of business agreements. Some of our competitors have in the past had, and may in the future have, licenses to some of our patents, and under current case law, some of the licenses can exhaust our patent rights as to licensed product sales under some circumstances. Our participation in industry standards organizations or with other industry initiatives at times requires us to offer to license our patents to companies that adopt industry-standard specifications. Depending on the rules of the organization, government regulations, or court decisions, we sometimes have to grant licenses to some of our patents for little or no cost, and as a result, we may be unable to enforce certain patents against others, and the value of our IP rights may be impaired.\nThird parties assert claims based on IP rights against us and our products, which could harm our business. We face claims based on IP rights from individuals, companies, investment litigation entities, other non-practicing entities, academic and research institutions, and other parties. We have seen an increase in patent assertions and lawsuits initiated by well-funded non-practicing entities, including entities funded by third-party investment firms. These lawsuits can increase our cost of doing business, impact our reputation or relationship with customers, and disrupt our operations if they succeed in blocking the trade of our products. The patent litigation environment has also become more challenging due to the emergence of venues adopting procedural and substantive rules that make them more favorable for patent asserters and courts in which injunctions are available for non-competitors. For example, in February 2024, R2 Semiconductor, Inc., a non-practicing entity, was able to obtain an injunction and recall order against us and our customers in the Dusseldorf Regional Court in Germany that, if enforced, could have caused significant potential disruption to our and our customers’ businesses in Europe. In the past few years, we have faced costly and lengthy lawsuits across multiple jurisdictions selected by non-practicing entities with well-funded third-party investment support, including most notably the VLSI and R2 litigation, which have resulted in significant adverse judgments and settlements.\nWe are typically engaged in a number of disputes involving IP rights. Claims that our products, technologies, or processes infringe the IP rights of others, regardless of their merits, cause us to incur large costs to respond to, defend, and resolve the claims, and they divert the efforts and attention of our management and technical personnel from our business and operations. In addition, we may face claims based on the alleged theft or unauthorized use or disclosure of third-party trade secrets, confidential information, or end-user data that we obtain in conducting our business. Any such incidents and claims could severely disrupt our business, and we could suffer losses, including the cost of product recalls and returns, and reputational harm. Furthermore, in many instances, we agree to indemnify customers for certain IP rights claims against them. IP rights claims against our customers could also limit demand for our products or disrupt our customers' businesses, which could in turn adversely affect our results of operations.\nAs a result of IP rights claims, we could:\n▪pay monetary damages, payments to satisfy indemnification obligations, royalties, fines, penalties, or provide accommodations to customers such as through cash payments or discounts;\n▪stop manufacturing, using, selling, offering to sell, or importing products or technology subject to claims;\n▪need to develop other products or technology not subject to claims, which could be time-consuming or costly; and/or\n▪enter into settlement or license agreements, which may not be available on commercially reasonable terms and may be costly.\nThese IP rights claims could harm our competitive position, result in expenses, or require us to impair our assets. If we alter or stop production of affected items, our revenue could be harmed.\nWe rely on access to third-party IP, which may not be available to us on commercially reasonable terms, if at all. Many of our products are designed to include third-party technology or implement industry standards, which may require licenses from third parties. In addition, from time to time, third parties notify us that they believe we are using their IP. There is no assurance that any necessary licenses or our existing licenses to such third-party IP can be obtained or are available on commercially reasonable terms or at all. Failure to obtain the right to use third-party technology, or to license IP on commercially reasonable terms, could preclude us from selling certain products or\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n40\n \nTable of Contents\n\notherwise have a material adverse impact on our financial condition and operating results. To the extent our products include software that contains or is derived from open-source software, we may be required to make the software's source code publicly available and/or license the software under open-source licensing terms.\nWe are subject to risks associated with litigation and regulatory matters. From time to time, we face legal claims or regulatory matters involving stockholder, consumer, competition, commercial, IP, labor and employment, compliance, and other issues. As described in \"Note 19: Commitments and Contingencies\" within Notes to Consolidated Financial Statements, we are engaged in a number of litigation and regulatory matters. Litigation and regulatory proceedings are inherently uncertain, and adverse rulings, excessive verdicts, or other events have occurred and could occur again, including monetary damages, fines, penalties, or injunctions stopping us from manufacturing or selling certain products, engaging in certain business practices, or requiring other remedies, such as compulsory licensing of patents. An unfavorable outcome can result in a material adverse impact on our business, financial condition, and results of operations. Regardless of the outcome, litigation and regulatory proceedings can be costly, time-consuming, disruptive to our operations, harmful to our reputation, and distracting to management.\nWe must attract, retain, and motivate key talent.\nWe believe that hiring and retaining qualified executives, scientists, engineers, technical talent, sales representatives, and other professionals are critical to our business. The competition for highly skilled employees in our industry is intense, with the demand often exceeding supply. Competitors for technical talent often seek to hire our employees, and the availability of flexible, hybrid, or work-from-home arrangements has both intensified and expanded competition. In addition, changes in immigration policies may further limit the pool of available talent and impair our ability to recruit and hire technical and professional talent. From time to time, we have intensified our efforts to recruit and retain talent, such as during 2021 and the first half of 2022, and these efforts have increased our expenses. Further, we may not be successful in attracting, retaining, and motivating the workforce necessary to deliver on our strategy, and we have been required to curtail our planned hiring and reduce our workforce to respond to business conditions that have differed from our expectations, which can be disruptive, adversely impact employee morale, compromise our ability to deliver on our strategy and workforce goals, and impact our ability to recruit in the future. For example, we undertook significant headcount reductions in 2022 and 2024. To help attract, retain, and motivate qualified employees, we use share-based awards, such as RSUs, and performance-based cash incentive awards. Sustained declines in our stock price or lower stock price performance relative to our competitors have reduced the retention value of our share-based awards, which can impact the competitiveness of our compensation. To the extent our compensation programs and workplace culture are not viewed as competitive, or changes in our workforce and related restructuring, reduction-in-force, or other initiatives are not viewed favorably, our ability to attract, retain, and motivate employees can be weakened, which could harm our results of operations. In addition, significant or prolonged turnover may negatively impact our operations and culture, as well as our ability to successfully maintain our processes and procedures, including due to the loss of historical, technical, and other expertise.\nChanges in our management team can also disrupt our business and adversely affect our results of operations, given the long development cycle for semiconductor process technologies and products and the large capital investments over a long time period required for semiconductor manufacturing operations. We have had a number of changes in our senior leadership team in recent years, including our CEO and other senior management positions. For example, in December 2024, our most recent CEO retired after less than four years with the company and a search is currently underway for a new CEO. To the extent we do not effectively hire, onboard, retain, and motivate key employees and leadership, our business may be harmed.\nWe are subject to risks associated with our strategic transactions and investments.\nWe routinely evaluate opportunities and enter into agreements for possible acquisitions, divestitures, and other strategic transactions. These transactions involve numerous risks, including:\n▪our inability to identify opportunities in a timely manner or on terms acceptable to us;\n▪failure of the transaction to advance our business strategy and failure of its anticipated benefits to materialize;\n▪disruption of our ongoing operations and diversion of our management's attention;\n▪failure of partners to satisfy financial or other obligations on which we rely;\n▪our inability to exercise sole decision-making authority regarding a project, property, or entity;\n▪failure to complete a transaction in a timely manner, or at all, due to our inability to obtain required government or other approvals on a timely basis or without materially burdensome conditions or mandated acquisitions, divestitures, or disposals, IP disputes or other litigation, difficulty in obtaining financing on terms acceptable to us, or other unforeseen factors;\n▪our failure to realize a satisfactory return on our investment, potentially resulting in an impairment of goodwill and other assets, such as the $2.9 billion charge we recorded in the third quarter of 2024 primarily related to Mobileye goodwill, and restructuring charges;\n▪our inability to effectively enter new market segments through our strategic transactions or retain customers and partners of acquired businesses;\n▪our inability to retain key personnel of acquired or majority-owned businesses or our difficulty in integrating or separating employees, business systems, and technology or otherwise operating the acquired or majority-owned business;\n▪controls, processes, and procedures of acquired or majority-owned businesses that do not adequately ensure compliance with laws and regulations and create complexity and inconsistency in application of controls, processes and procedures, and our failure to identify and/or address compliance issues, including accounting or tax errors, or liabilities;\n▪our inability to resolve impasses or disputes with partners, including as a result of differences in our interests or goals;\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n41\n \nTable of Contents\n\n▪our failure to identify, or our underestimation of, commitments, liabilities, accounting, tax, and other risks associated with acquired businesses or assets, majority-owned businesses, or novel transactions; and\n▪the potential for our transactions to result in dilutive issuances of our equity securities or significant additional debt.\nAny of these risks could have a material adverse effect on our business, results of operations, financial condition, or cash flows, particularly in the case of a large acquisition, divestiture or partial divestiture, or several concurrent strategic transactions. Moreover, our resources are limited and our decision to pursue a transaction has opportunity costs; accordingly, if we pursue a particular transaction, we at times need to forgo the prospect of entering into other transactions or otherwise investing our resources in a manner that could help us achieve our financial or strategic objectives.\nWe are subject to sales-related risks.\nWe face risks related to sales through distributors and other third parties. We sell a significant portion of our products through third parties, such as distributors, value-added resellers, and channel partners (collectively referred to as distributors), as well as OEMs and ODMs. We depend on many distributors to help us create end-customer demand, provide technical support and other value-added services to customers, fill customer orders, and stock our products. At times, we rely on one or more key distributors for a product, and a material change in our relationship with one or more of these distributors or their failure to perform as expected could reduce our revenue. Our ability to add or replace distributors for some of our products is limited. In addition, our distributors' expertise in the determination and stocking of acceptable inventory levels for some of our products is not always easily transferable to a new distributor; as a result, end customers may be hesitant to accept the addition or replacement of a distributor. Using third parties for distribution exposes us to many risks, including competitive pressure and concentration, credit, and compliance risks. Distributors and other third parties often sell products that compete with our products, and we sometimes need to provide financial and other incentives to focus them on the sale of our products. From time to time, they may face financial difficulties, including bankruptcy, which could harm our collection of accounts receivable and financial results. Further, any violations of the Foreign Corrupt Practices Act or similar laws by distributors or other third-party intermediaries could have a material impact on our business, including subjecting us to litigation or regulatory risk. Failure to manage risks related to our use of distributors and other third parties may reduce sales, increase expenses, and weaken our competitive position.\nFrom time to time, our products are resold by third parties in an unauthorized \"gray market.\" Our policies and procedures designed to keep our products away from the gray market may not be successful in achieving this objective. Gray market products can distort demand and pricing dynamics in our distribution channel and certain geographies, which at times adversely affects our revenue opportunities. Gray market activity is difficult to monitor and can make forecasting demand more challenging. Gray market products also sometimes include parts that have been altered or damaged, and our reputation may be harmed when these products fail or are found to be substandard.\nWe receive a significant portion of our revenue from a limited number of customers. Collectively, our three largest customers accounted for 45% of our net revenue in 2024, 40% of our net revenue in 2023 and 42% of our net revenue in 2022. We expect a small number of customers will continue to account for a significant portion of our revenue in the foreseeable future. The loss of key customers, a substantial reduction in sales to them, or changes in the timing of their orders can lead to a reduction in our revenue, increase the volatility of our results, and harm our results of operations and financial condition.\nIndustry trends, such as the increasing shift of data center workloads to the public cloud, have increased the significance and purchasing power of certain customers, particularly hyperscalers, in some of our data center-focused businesses. The cloud and cloud applications represent an increasingly demanding computing environment. The further consolidation of computing workloads in the cloud, and consolidation among cloud service providers, can heighten the competitive importance of factors such as collaboration and customization with cloud service provider customers to optimize products for their environments; optimization for cloud services and applications; product performance; energy efficiency; feature differentiation; product quality, reliability, and factors affecting server uptime; and product security and security features. Our competitive position can be eroded to the extent we do not execute effectively across these factors. We are operating in an increasingly competitive environment, including serving cloud service provider customers, and the competitive environment adversely affected our results in the last few years.\nSome cloud service provider customers have also internally developed, and may continue to develop, their own semiconductors, including designs customized for their specific computing workloads. In addition, cloud services can be marketed to end users based on service levels or features rather than hardware specifications, or they can abstract hardware under layers of software, which can make it more difficult to differentiate our products to customers and end users. The shift of data center workloads to the cloud has also adversely affected, and may continue to affect, sales to enterprise customers when end users have elected to migrate workloads from their own internal data center infrastructures to cloud service providers. To the extent we differentiate our products through customization to meet cloud customer specifications, order changes, delays, or cancellations may result in non-recoverable costs.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n42\n \nTable of Contents\n\nWe face risks related to transactions with government entities. We receive proceeds from both US and non-US governments associated with grants, incentives, and sales of our products and services, and we are seeking to increase our sales of products and services to governmental entities in the future. Government demand and payment are often affected by public sector budgetary cycles and funding authorizations, including, with respect to US government contracts, congressional approval of appropriations, and can be adversely impacted by shutdowns of the US federal government and changes in US administration, including administrative priorities. Government contracts are subject to procurement laws and regulations relating to the award, administration, and performance of those contracts, as well as oversight and penalties for violations. For example, certain agreements with the US government are subject to special rules on accounting, IP rights, expenses, reviews, information handling, security, customers, and/or employees, and failure or inability to comply with these rules could result in civil and criminal penalties and sanctions, including termination of contracts, fines, and suspension or debarment from future business with the US government.\nWe face risks related to our debt obligations.\nWe have incurred significant debt obligations that could adversely affect our business and financial condition, including our ability to fully implement our strategy. As of December 28, 2024, we had $51.0 billion in aggregate principal amount of senior unsecured notes and other borrowings outstanding. In addition, we have a commercial paper program of up to $10.0 billion and credit facilities to backstop these programs and otherwise provide access to committed capital of up to $15.0 billion. As we continue to pursue our strategy, we expect to incur additional indebtedness, refinance our existing debt, and issue additional notes or other debt securities in the future at a variety of interest rates, maturities, and terms. The semiconductor industry is a cyclical business and our revenue, cash flows, and outlook often fluctuate in accordance with this cycle, as well as prevailing macroeconomic conditions, our business strategy, and other risks described in these risk factors. These fluctuations, together with our debt level and related debt service obligations, could have the effect of, among other things, reducing our flexibility to respond to changing business and economic conditions and increasing the risk of a future downgrade in our credit ratings that can impact the value of our outstanding debt and increase our borrowing costs. During 2024 and in prior years, we suffered multiple credit rating downgrades that adversely impacted our borrowing costs and access to capital, and we may continue to suffer additional such downgrades if our business and financial results do not measurably improve. We may also be required to raise additional financing for working capital, capital expenditures, debt service obligations, debt refinancing, future acquisitions, or other general corporate purposes, which will depend on, among other factors, our financial position and performance, as well as prevailing market conditions and other factors beyond our control. Consequently, we may not be able to obtain additional financing or refinancing on terms acceptable to us, or at all, which could adversely impact our ability to finance our business strategy and service and repay outstanding indebtedness as it becomes due, all of which could adversely impact our business, financial condition, and the cost of borrowing.\nWe have ceased to return capital to stockholders.\nIn recent years, we have not made repurchases of our stock and reduced, and then suspended in the fourth quarter of 2024, our quarterly dividend. Further, we agreed under our commercial CHIPS Act agreement to forgo paying dividends for the next two years, and agreed to limitations on the payment of dividends for the three years thereafter. There can be no assurance that we will be able to pay dividends in the future. In addition, we are not obligated to make repurchases under our stock repurchase program and there can be no assurances as to the amount, timing, and execution of any future share repurchases, or that any repurchases will enhance long-term stockholder value.\nLaws and regulations can have a negative impact on our business.\nWe are subject to complex and evolving laws and regulations worldwide that differ among jurisdictions and affect our operations in areas including, but not limited to: IP ownership and infringement; tax; import and export requirements; anti-corruption; foreign exchange controls and cash repatriation restrictions; data privacy and localization requirements; competition; advertising; employment and labor; product regulations; environment, health, and safety requirements; and consumer laws. Compliance with such requirements can be onerous and expensive and may otherwise impact our business operations negatively. For example, unfavorable developments with evolving laws and regulations worldwide related to 5G or autonomous driving technology and MaaS may limit global adoption, impede our strategy, or negatively impact our long-term expectations for our investments in these areas. Expanding privacy legislation and compliance costs of privacy-related and data-protection measures could adversely affect our customers and their products and services, particularly in cloud, Internet of Things, and AI applications, which could in turn reduce demand for our products used for those workloads.\nOur policies, controls, and procedures designed to help provide for compliance with applicable laws cannot provide assurance that our employees, contractors, suppliers, or agents will not violate such laws or our policies. Violations of these laws and regulations can result in fines; criminal sanctions against us, our officers, or our employees; prohibitions on the conduct of our business; and damage to our reputation. The technology industry is subject to intense media, political, and regulatory scrutiny, which can increase our exposure to government investigations, legal actions, and penalties.\nWe are affected by fluctuations in currency exchange rates.\nWe are exposed to adverse as well as beneficial movements in currency exchange rates. Although most of our sales occur in US dollars, operating expenses and capital expenditures may be paid in local currencies. An increase in the value of the dollar can increase the real cost to our customers of our products in those markets outside the US where we sell in dollars, and a weakened dollar can increase the cost of expenses such as payroll, utilities, tax, and marketing expenses, as well as non-US dollar capital expenditures. We also conduct certain investing and financing activities in local currencies. Our hedging programs may not be effective to offset any, or more than a portion, of the adverse impact of currency exchange rate movements; therefore, changes in exchange rates can harm our results of operations and financial condition.\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n43\n \nTable of Contents\n\nChanges in our effective tax rate may impact our net income.\nA number of factors can impact our future effective tax rate or cash payments, which could cause significant variability in our financial results, including:\n▪changes in the volume and mix of profits earned and location of assets across jurisdictions with varying tax rates;\n▪changes in our business or legal entity operating model;\n▪the resolution of issues arising from tax audits, including payment of interest and penalties;\n▪changes in the valuation of our deferred tax assets and liabilities, and in deferred tax valuation allowances;\n▪adjustments to estimated taxes upon finalization of tax returns;\n▪increases in expenses not deductible for tax purposes, including impairments of goodwill;\n▪changes in available tax credits, including non-US tax credits, R&D credits, and refundable tax credits;\n▪expirations or changes in our ability to secure new tax holidays and incentives;\n▪changes in US federal, state, or foreign tax laws or their interpretation, including the global implementation of a minimum tax under Pillar Two of the OECD BEPS initiative;\n▪changes in US GAAP and non-US IFRS; and\n▪our decision to repatriate non-US earnings for which we have not previously provided for incremental taxes, including any local country withholding taxes incurred upon repatriation.\nCatastrophic events can have a material adverse effect on our operations and financial results.\nOur operations and business, and those of our customers and suppliers, can be disrupted by: severe weather events and natural disasters; industrial accidents; public health issues and global pandemics such as COVID-19; cybersecurity incidents; interruptions of service from utilities, transportation restrictions or disruptions, telecommunications, or IT systems providers; manufacturing equipment failures; geopolitical conflict; terrorism; or other catastrophic events. For example, we have at times experienced disruptions in our manufacturing processes as a result of power outages, improperly functioning equipment, and disruptions in supply of raw materials or components, including cybersecurity incidents affecting our suppliers. Our headquarters and many of our operations and facilities are in locations that are prone to earthquakes and other natural disasters. Global climate change can result in certain natural disasters occurring more frequently or with greater intensity, such as drought, wildfires, storms, sea-level rise, and flooding, and could disrupt the availability of water necessary for the operation of our fabrication facilities, including our facilities located in water-sensitive regions such as Arizona and Israel. In addition, to the extent we are unable to successfully manage and conserve water resources, our reputation could be harmed. In recent years, the west coast of the US has experienced significant wildfires, including in Oregon, where we have major manufacturing facilities, and in California, where we are headquartered. The long-term effects of climate change on the global economy and the technology industry in particular are unclear but could be severe.\nWe are subject to risks associated with environmental, health, safety, and product regulations.\nThe design, manufacturing, assembly, and test of our products require the use and purchase of materials and chemicals that are subject to a broad array of environmental, health, and safety laws and regulations. Our operations and those of our suppliers are further governed by regulations prohibiting the use of forced labor (e.g., mining conflict minerals), and restrictions on other materials, as well as laws or regulations governing the operation of our facilities, sale and distribution of our products, and use of our real property. The scope and interpretation of such laws and regulations, including the materials they govern, are complex and continue to evolve. The procedures and processes in place under our compliance program may become onerous or increasingly expensive to maintain and cannot guarantee compliance by employees or third parties to whom such laws apply. The amendment or expansion of these laws or regulations, as well as our failure or inability to comply with them (including as a result of acquired entities), can result in regulatory penalties, fines, and legal liabilities; increased costs; additional remediation obligations; suspension of production; alteration, suspension, or termination of our manufacturing and assembly and test processes, including due to an inability to find, afford, or attain adequate substitute materials, equipment, or processes; damage to our reputation; and restrictions on our operations or sales. In addition, the failure or inability to comply by our suppliers of these materials can require us to suspend or alter our production processes and sources, and result in increased risks and costs.\nThe failure or inability by us, our customers, or our suppliers to manage the use, transportation, emissions, discharge, storage, recycling, or disposal of hazardous materials can lead to increased costs or future liabilities. Environmental regulations, including with respect to the materials and processes we are permitted to use and as to air quality and wastewater requirements, may impede our ability to manufacture products or expand or modify our manufacturing capability in the future. Environmental laws and regulations sometimes require us to acquire additional pollution abatement or remediation equipment, modify product designs, cease the use of a particular material or process, remove or remediate hazardous substances, or incur other expenses or liabilities. Regulations in response to climate change could result in increased manufacturing costs associated with air pollution requirements. For example, semiconductor manufacturing uses perfluorocarbons, which have historically made up a large portion of our direct greenhouse gas emissions. New or increased regulations limiting the use of such compounds, or other greenhouse gas emissions, could require us to install additional abatement equipment, purchase carbon offsets, and/or alter, where feasible, our production processes and sources. In addition, new or increased climate change regulation could increase our energy costs, for example as a result of carbon pricing impacts on electrical utilities. Regulations in response to human health concerns may also limit or prohibit the use of a class of chemicals known as per- and polyfluoroalkyl substances (PFAS), which are found in parts, components, process chemicals, and other materials used in semiconductor manufacturing. Such chemicals are critical to the manufacturing and functioning of many semiconductor products and there are limited\nintel-logo-footer.jpg\nRisk Factors and Other Key Information\n44\n \nTable of Contents\n\ntechnically and commercially feasible alternatives. As we expand our manufacturing capacity, the impacts of future regulation could be magnified. Many new materials that we are evaluating for use in our operations are also subject to regulation under environmental laws. These restrictions could harm our business and results of operations by increasing our expenses or requiring us to alter manufacturing and assembly and test processes.\nOur initiatives and new legal requirements with respect to corporate responsibility matters present various risks.\nOur corporate responsibility initiatives could expose us to heightened scrutiny and numerous financial, legal, reputational, operational, compliance, and other risks, including lost customer opportunities, which could negatively impact us. Our achievement of initiatives, aspirations, and goals related to corporate responsibility matters, including those related to sustainability, is not guaranteed and is subject to numerous conditions, risks, and expectations, as well as standards, processes, and methodologies that continue to evolve. Further, any failure to set or achieve corporate responsibility initiatives that meet our stakeholders' evolving expectations could also negatively impact us.\nIn addition, we are or expect to become subject to various new or proposed climate-related and other sustainability laws and regulations, including, for example, the state of California's new climate change disclosure requirements, the EU's new Corporate Sustainability Reporting Directive, and the SEC's recently adopted climate-change disclosure requirements. Compliance with such laws and regulations, as well as the overall increased focus and scrutiny from regulators, investors, customers, vendors, employees, and other stakeholders concerning ESG and climate matters, could impose additional costs on us and expose us to new risks, including resulting in changes to our current ESG goals.\n    "
  }
}