{
  "ticker": "INVH",
  "cik": "0001687229",
  "company_name": "Invitation Homes Inc.",
  "filing_date": "2025-02-27",
  "accession": "0001687229-25-000008",
  "primary_doc": "invh-20241231.htm",
  "item_sections": {
    "item1": "Item 1. “Business” and the consolidated financial statements, including the notes thereto, that are included elsewhere in this Annual Report on Form 10-K. This discussion and analysis contains forward-looking statements based upon our current expectations that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including those set forth under Part I.",
    "item1a": "Item 1A. “Risk Factors — Risks Related to Our Indebtedness,” including “Risk Factors — Risks Related to Our Indebtedness — \nWe may be unable to obtain financing through the debt and equity markets, which would have a material adverse effect on our growth strategy and our financial condition and results of operations.\n”\nShort-Term and Long-Term Liquidity Needs\nLiquidity is a measure of our ability to meet potential cash requirements, maintain our assets, fund our operations, make dividend payments to our stockholders, and meet other general requirements of our business. Our liquidity, to a certain extent, is subject to general economic, financial, competitive, and other factors beyond our control. Our near-term liquidity requirements consist primarily of:\n•\nacquisition of homes currently under contract, including commitments to homebuilders;\n•\nrenovation of newly-acquired homes;\n•\nHOA fees (as applicable), property taxes, insurance premiums, and the ongoing maintenance of our homes;\n•\nproperty management, general and administrative, and other entity-level commitments and expenses;\n•\ninterest expense;\n•\ndividend payments to our stockholders; and\n•\nrequired contributions to our joint ventures.\nWe believe our rental income, net of total expenses, will generally provide cash flow sufficient to fund operations and dividend payments on a near-term basis. Additionally, we have guaranteed the funding of certain tax, insurance, and non-conforming property reserves related to the financing of one of our joint ventures. We do not expect these guarantees to have a material current or future effect on our liquidity. See Part IV. Item 15. “Exhibits and Financial Statements of — Note 5 of Notes to Consolidated Financial Statements” for additional information about our investments in unconsolidated joint ventures.\nGeneral economic conditions in the United States have fluctuated in recent quarters, and concerns persist regarding adverse macroeconomic conditions, such as inflation, elevated interest rates, political dissension, and labor shortfalls. Fluctuating economic conditions and uncertainty in financial markets may negatively impact our operating cash flow such that we are unable to make required debt service payments, which would result in an event of default for any debt instrument under whose loan agreement such payments were not made. Specifically, the collateral within individual borrower entities may underperform, resulting in cash flow shortfalls for debt service while consolidated cash flows are sufficient to fund our operations. If an event of default occurs for our mortgage loan or for our secured term loan, our loan agreements provide \n68\ncertain remedies, including our ability to fund shortfalls from consolidated cash flow; and such an event of default would not result in an immediate acceleration of the loan.\nOur real estate assets are illiquid in nature. A timely liquidation of assets may not be a viable source of short-term liquidity should a cash flow shortfall arise, and we may need to source liquidity from other financing sources, such as the Revolving Facility which had an undrawn balance of $1,180.0 million as of December 31, 2024.\nOur long-term liquidity requirements consist primarily of funds necessary to pay for the acquisition of, and non-recurring capital expenditures for, our homes, and principal and interest payments of our indebtedness. We intend to satisfy our long-term liquidity needs through cash provided by operations, long-term secured and unsecured borrowings, the issuance of debt and equity securities, and property dispositions. As a REIT, we are required to distribute to our stockholders at least 90% of our taxable income, excluding net capital gain, on an annual basis. Therefore, as a general matter, it is unlikely that we will be able to retain substantial cash balances from our annual taxable income that could be used to meet our liquidity needs. Instead, we will need to meet these needs from external sources of capital and amounts, if any, by which our cash flow generated from operations exceeds taxable income.\nCash Flows\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nThe following table summarizes our cash flows for the years ended December 31, 2024 and 2023: \nFor the Years\nEnded December 31,\n($ in thousands)\n2024\n2023\n$ Change\n% Change\nNet cash provided by operating activities\n$\n1,081,805 \n$\n1,107,088 \n$\n(25,283)\n(2.3)\n%\nNet cash used in investing activities\n(465,870)\n(773,552)\n307,682 \n39.8 \n%\nNet cash provided by (used in) financing activities\n(1,093,726)\n110,021 \n(1,203,747)\nN/M\nChange in cash, cash equivalents, and restricted cash\n$\n(477,791)\n$\n443,557 \n$\n(921,348)\n(207.7)\n%\nOperating Activities\nOur cash flows provided by operating activities depend on numerous factors, including the occupancy level of our homes, the rental rates achieved on our leases, the collection of rent from our residents, and the amount of our operating and other expenses. Net cash provided by operating activities was $1,081.8 million and $1,107.1 million for the years ended December 31, 2024 and 2023, respectively\n, a decrease of 2.3%. The decrease in cash provided by operating activities is primarily due to \nsettlement costs of $77.0 million included in net income that resolved an inquiry from the FTC and the legal dispute entitled \nCity of San Diego et al v. Invitation Homes, Inc., \ninclusive of associated costs. This decrease is partially offset by $36.4 million of unpaid estimated costs for hurricane related damages that are reflected in accounts payable and accrued expenses on our consolidated balance sheet as of December 31, 2024.\nInvesting Activities\nNet cash used in investing activities consists primarily of the acquisition costs of homes, capital improvements, proceeds from property sales, and investments in unconsolidated joint ventures. Net cash used in investing activities was $465.9 million and $773.6 million for the years ended December 31, 2024 and 2023, respectively, a\n decrease of $307.7 million. The decrease in net cash used in investing activities resulted primarily from the combined effect of the following significant changes in cash flows during the year ended December 31, 2024 compared to the year ended December 31, 2023: \n(1) a \ndecrease in cash used for the acquisition of homes; \n(2) an increase in cash proceeds received from the sale of single-family homes;\n (3) \nan increase in cash used for investments in joint ventures\n; and (4) an increase in cash provided\n from\n repayment proceeds from retained debt securities\n. Acquisition spend decreased by $234.0 million from period to period due to a decrease in the number of homes acquired from 2,877 during the year ended December 31, 2023 to 2,072 homes acquired during the year ended December 31, 2024. Proceeds from the sale of single-family homes increased $97.1 million due to an increase in the number of homes sold from 1,423 during the year ended December 31, 2023 to 1,501 homes sold during the year ended December 31, 2024 and an increase in average net proceeds per home. Cash invested in joint ventures increased $43.7 million from period to period as a result of the formation of new joint ventures during 2024. \n69\nProceeds from repayment of retained debt securities increased $31.3 million from the year ended December 31, 2023 to the year ended December 31, 2024 due to the full repayment of IH 2018-4 during the year ended December 31, 2024.\nFinancing Activities\nNet cash used in financing activities was $1,093.7 million for the year ended December 31, 2024 compared to net cash provided by financing activities of $110.0 million for the year ended December 31, 2023. The change between periods is primarily due to the following financing transactions. During the year ended December 31, 2024, we issued $494.3 million of unsecured notes, net of discount, and refinanced the 2020 Credit Facility. The proceeds were used to repay the existing credit facility and $645.7 million of mortgage loans, including the voluntary prepayment of the IH 2018-4 mortgage loan, and to fund $54.2 million of financing costs. During the year ended December 31, 2023, we issued $790.1 million of unsecured notes, net of discount, and used the proceeds to fund $7.8 million of financing costs and increase cash reserves for general corporate purposes\n. W\ne also made dividend and distribution payments totaling \n$692.6 million\n during the year ended December 31, 2024 compared to $640.5 million during the year ended December 31, 2023, which were funded by cash flows from operations.\nYear Ended December 31, 2023 Compared to Year Ended December 31, 2022\nFor similar operating and financial data and discussion of our results for the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to Part II. Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operation — Cash Flows” of our \n2023 10-K\n.\nContractual Obligations\nOur contractual obligations as of December 31, 2024, consist of the following: \n($ in thousands)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nMortgage loans\n(1)(2)(3)\n$\n1,091,138 \n$\n41,826 \n$\n1,049,312 \n$\n— \n$\n— \nSecured Term Loan\n(1)(2)(3)\n496,188 \n14,460 \n28,921 \n28,961 \n423,846 \nUnsecured Notes\n(1)(2)(3)\n4,884,356 \n139,110 \n278,220 \n1,007,148 \n3,459,878 \nTerm Loan Facilities\n(1)(2)(3)(4)\n3,098,580 \n134,763 \n269,525 \n2,694,292 \n— \nRevolving Facility\n(1)(2)(3)(4)(5)\n723,731 \n32,756 \n65,513 \n625,462 \n— \nDerivative instruments\n(1)(6)\n(89,684)\n(25,660)\n(47,570)\n(16,454)\n— \nPurchase commitments\n(7)\n634,742 \n443,879 \n190,863 \n— \n— \nOperating leases\n28,142 \n4,402 \n7,761 \n5,281 \n10,698 \nFinance leases\n9,488 \n3,147 \n5,634 \n707 \n— \nTotal\n$\n10,876,681 \n$\n788,683 \n$\n1,848,179 \n$\n4,345,397 \n$\n3,894,422 \n(1)\nFor detailed information about each of our financing arrangements and derivative instruments see Part IV. Item 15. “Exhibits and Financial Statements — Note 7 of Notes to Consolidated Financial Statements” and “— Note 8 of Notes to Consolidated Financial Statements.”\n(2)\nIncludes estimated interest payments through the extended maturity date, as applicable, based on the principal amount outstanding as of December 31, 2024.\n(3)\nInterest is calculated at rates in effect as of December 31, 2024, including the indexed rate, any credit spread adjustment, and any applicable margin, and that rate is held constant until the maturity date. As of December 31, 2024, Term SOFR was 4.33%.\n(4)\nCalculated based on the maturity date if we exercise each of the remaining extension options available, which are subject to certain conditions being met. See Part IV. Item 15. “Exhibits and Financial Statements — Note 7 of Notes to Consolidated Financial Statements” for a description of maturity dates without consideration of extension options.\n(5)\nIncludes the related unused commitment fee, as applicable.\n(6)\nIncludes payments (receipts) related to interest rate swap obligations calculated using Term SOFR. As of December 31, 2024, Term SOFR was 4.33%.\n70\n(7)\nRepresents commitments, net of previously funded deposits, to acquire 2,172 homes, including commitments totaling $590.0 million to acquire 2,031 homes pursuant to binding purchase agreements with certain homebuilders as of December 31, 2024.\nAdditionally, we have commitments, which are not reflected in the table above, to make additional capital contributions to our joint ventures. As of December 31, 2024, our remaining equity commitments to our joint ventures total $177.0 million.\nSupplemental Guarantor Information\nIn March 2020, the SEC adopted amendments to Rule 3-10 of Regulation S-X and created Rule 13-01 to simplify disclosure requirements related to certain registered securities. The amendments became effective on January 4, 2021. INVH, INVH LP, the General Partner, and IH Merger Sub, LLC (“IH Merger Sub”) have filed a registration statement on Form S-3 with the SEC registering, among other securities, debt securities of INVH LP, fully and unconditionally guaranteed, on a joint and several basis, by INVH, the General Partner, and/or IH Merger Sub. As a result of the amendments to Rule 3-10 of Regulation S-X, subsidiary issuers of obligations guaranteed by the parent are not required to provide separate financial statements, provided that the subsidiary obligor is consolidated into the parent company’s consolidated financial statements, the parent guarantee is “full and unconditional” and, subject to certain exceptions as set forth below, the alternative disclosure required by Rule 13-01 is provided, which includes narrative disclosure and summarized financial information. Accordingly, separate consolidated financial statements of INVH LP, the General Partner, and IH Merger Sub have not been presented.\nFurthermore, as permitted under Rule 13-01(a)(4)(vi) of Regulation S-X, we have excluded the summarized financial information for the INVH LP, the General Partner, and IH Merger Sub, because the combined assets, liabilities, and results of operations of INVH, INVH LP, the General Partner, and IH Merger Sub are not materially different than the corresponding amounts in our consolidated financial statements, and management believes such summarized financial information would be repetitive and would not provide incremental value to investors.\nPurchase of Outstanding Debt Securities or Loans\nAs market conditions warrant, we may from time to time seek to purchase our outstanding debt or debt securities that we may issue in the future, in privately negotiated or open market transactions, by tender offer or otherwise. Subject to any applicable limitations contained in the agreements governing our indebtedness, any purchases made by us may be funded by the use of cash on our consolidated balance sheet or the incurrence of new secured or unsecured debt, including borrowings under our Credit Facility. The amounts involved in any such purchase transactions, individually or in the aggregate, may be material. Any such purchases may be with respect to a substantial amount of a particular class or series of debt, with the attendant reduction in the trading liquidity of such class or series. In addition, any such purchases made at prices below the “adjusted issue price” (as defined for United States federal income tax purposes) may result in taxable cancellation of indebtedness income to us, which amounts may be material, and in related adverse tax consequences to us.\nCritical Accounting Policies and Estimates \nOur discussion and analysis of our historical financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with GAAP and in conjunction with the rules and regulations of the SEC. The preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions about the effect of matters that are inherently uncertain and that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results could ultimately differ from those estimates. For a discussion of recently-issued and adopted accounting standards, see Part IV. Item 15. “Exhibits and Financial Statement Schedules — Note 2 of Notes to Consolidated Financial Statements.”\nCritical accounting policies are those accounting estimates that management believes are important to the portrayal of our financial condition and results of operations and require management’s most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\n71\nInvestments in Single-Family Residential Properties\nThe following significant accounting policies affect the acquisition, disposition, recognition, classification, and fair value measurements (on a nonrecurring basis) related to our owned portfolio of approximately 85,000 single-family residentia\nl properties located primarily in 16 core markets across the United States as of December 31, 2024\n \n. For a complete discussion of our accounting policy and other factors related to each category below, see Part IV. Item 15. “Exhibits and Financial Statement Schedules — Note 2 of Notes to Consolidated Financial Statements.”\n•\nAcquisition of Real Estate Assets: \nOur purchases of homes are generally treated as asset acquisitions unless acquired in connection with a business combination. For asset acquisitions, homes are recorded at their purchase price, which is allocated between land, building and improvements, and in-place lease intangibles (when a resident is in place at the acquisition date) based upon their relative fair values at the date of acquisition. The purchase price for purposes of this allocation is inclusive of acquisition costs which typically include legal fees, bidding service and title fees, payments made to cure tax, utility, HOA, and other mechanic’s and miscellaneous liens, as well as other closing costs. The attributes and location of each home acquired are considered at the individual home level when determining the percentage of purchase price allocated to building and improvements versus land. As such, these allocation percentages vary based on the homes acquired during each reporting period. If the percentage allocated to buildings and improvements versus land for the homes acquired during the year ended December 31, 2024 was increased or decreased by 500 bps, our annualized depreciation expense would have changed by approximately $1.1 million. \n•\nCost Capitalization: \nWe incur costs to acquire, stabilize, and prepare our single-family residential properties to be leased. We capitalize these costs as a component of our investment in each single-family residential property, using specific identification and relative allocation methodologies. The capitalization period associated with our stabilization activities begins at the time that such activities commence and concludes at the time that a single-family residential property is available to be leased.\nOnce a property is ready for its intended use, expenditures for ordinary maintenance and repairs thereafter are expensed to operations as incurred, and we capitalize expenditures that improve or extend the life of a home\n \nand for certain furniture and fixtures additions.\nThe capitalized costs are depreciated on a straight-line basis over their estimated useful lives, which are reviewed on an annual basis. The weighted average useful lives range from 7 to 32 years. If the useful lives for costs capitalized during the year ended December 31, 2024 were increased or decreased by 10%, our annualized depreciation expense would have changed by approximately $5.0 million.\n•\nProvisions for Impairment: \nWe continuously evaluate, by property, whether there are any events or changes in circumstances indicating that the carrying amount of our single-family residential properties may not be recoverable. \nTo the extent an event or change in circumstance is identified, a residential property is considered to be impaired only if its carrying value cannot be recovered through estimated future undiscounted cash flows from the use and eventual disposition of the property. To the extent an impairment has occurred, the carrying amount of our investment in a property is adjusted to its estimated fair value. The process whereby we assess our single-family residential properties for impairment requires significant judgment and assessment of factors that are, at times, subject to significant uncertainty. We evaluate multiple information sources and perform a number of internal analyses, each of which are important components of our process with no one information source or analysis being necessarily determinative. \nThere have not been any significant process changes in our review for impairment during the current reporting period. For those homes for which a change in an event or circumstance was identified in the most recent impairment analysis, a 10% decrease in the estimated fair value of those homes may have resulted in an increase in impairment expense of $0.4 million.\n•\nSingle-Family Residential Properties Held for Sale:\n From time to time, we may identify single-family residential properties to be sold. Once we identify a property to be sold pursuant to GAAP requirements, we cease depreciating the property, measure the property at the lower of its carrying amount or its fair value less estimated costs to sell, and present the property separately within other assets, net on our consolidated balance sheets. As of December 31, 2024, 237 homes, approximately 0.3% of our portfolio, were held for sale, compared to 189 homes as of December 31, 2023. If market values less disposal costs for our properties that were classified as held for sale as of December 31, 2024 were 10% lower or higher, our impairment expense related to those properties would have changed by approximately $0.4 million.\n72\nSegment Reporting \nOur principal business is acquiring, renovating, leasing, operating, and managing single-family residential properties. Under the provisions of ASC 280, \nSegment Reporting\n, we have determined that we currently operate in \none\n reportable segment.\nOur Chief Executive Officer is our chief operating decision maker (“CODM”). We concluded that we have \none\n reportable segment based on the way our CODM regularly reviews internally reported financial information to evaluate performance, make operating decisions, and allocate resources at a consolidated level. Net income as reported on our consolidated statements of operations is a primary metric utilized by the CODM to analyze the performance of the segment, including budget versus actual performance, and to allocate resources.\nNon-GAAP Measures \nEBITDA, EBITDAre, and Adjusted EBITDAre \nEBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n are supplemental, non-GAAP measures often utilized to evaluate the performance of real estate companies. We define EBITDA as net income or loss computed in accordance with GAAP before the following items: interest expense; income tax expense; depreciation and amortization; and adjustments for unconsolidated joint ventures. The National Association of Real Estate Investment Trusts (“Nareit”) recommends as a best practice that REITs that report an EBITDA performance measure also report EBITDA\nre\n. Consistent with the Nareit definition, we define EBITDA\nre\n as EBITDA, further adjusted for the following: gain on sale of property, net of tax; and impairment on depreciated real estate investments. Adjusted EBITDA\nre\n is defined as EBITDA\nre\n before the following items: share-based compensation expense; severance; casualty (gains) losses, net; (gains) losses on investments in equity securities, net; and other income and expenses. Where appropriate, EBITDA, EBITDA\nre\n, and Adjusted EBITDA are adjusted for our share of investments in unconsolidated subsidiaries.\nEBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n are used as supplemental financial performance measures by management and by external users of our financial statements, such as investors and commercial banks. Set forth below is additional detail on how management uses EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n as measures of performance.\nOur management uses EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n in a number of ways to assess our consolidated financial and operating performance, and we believe these measures are helpful to management and external users in identifying trends in our performance. EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n help management identify controllable expenses and make decisions designed to help us meet our current financial goals and optimize our financial performance, while neutralizing the impact of capital structure on results. Accordingly, we believe these metrics measure our financial performance based on operational factors that management can impact in the short-term, namely our cost structure and expenses.\nWe believe that the presentation of EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n provides information useful to investors in assessing our financial condition and results of operations. The GAAP measure most directly comparable to EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n is net income or loss. EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n are not used as measures of our liquidity and should not be considered alternatives to net income or loss or any other measure of financial performance presented in accordance with GAAP. Our EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n may not be comparable to the EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n of other companies due to the fact that not all companies use the same definitions of EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n. Accordingly, there can be no assurance that our basis for computing these non-GAAP measures is comparable with that of other companies.\n73\nThe following table presents a reconciliation of net income (as determined in accordance with GAAP) to EBITDA, EBITDA\nre\n, and Adjusted EBITDA\nre\n for each of the periods indicated:\nFor the Years Ended December 31,\n($ in thousands)\n2024\n2023\n2022\nNet income available to common stockholders\n$\n453,164 \n$\n518,774 \n$\n382,668 \nNet income available to participating securities\n753 \n696 \n661 \nNon-controlling interests\n1,448 \n1,558 \n1,470 \nInterest expense\n366,070 \n333,457 \n304,092 \nInterest expense in unconsolidated joint ventures\n26,333 \n18,255 \n3,581 \nDepreciation and amortization\n714,326 \n674,287 \n638,114 \nDepreciation and amortization of investments in unconsolidated joint ventures\n13,377 \n10,469 \n5,838 \nEBITDA\n1,575,471 \n1,557,496 \n1,336,424 \nGain on sale of property, net of tax\n(244,550)\n(183,540)\n(90,699)\nImpairment on depreciated real estate investments\n506 \n427 \n310 \nNet (gain) loss on sale of investments in unconsolidated joint ventures\n1,215 \n(1,668)\n(865)\nEBITDA\nre\n1,332,642 \n1,372,715 \n1,245,170 \nShare-based compensation expense\n(1)\n27,918 \n29,503 \n28,962 \nSeverance expense\n637 \n977 \n314 \nCasualty losses, net\n(2)\n82,700 \n8,200 \n28,485 \n(Gains) losses on investments in equity and other securities, net\n(1,046)\n(350)\n3,939 \nOther, net\n(3)\n54,032 \n2,435 \n11,261 \nAdjusted EBITDA\nre\n$\n1,496,883 \n$\n1,413,480 \n$\n1,318,131 \n(1)\nFor the years ended December 31, 2024, 2023, and 2022, $5,830, $6,963, and $6,493, was recorded in property management expense, respectively, and $22,088, $22,540, and $22,469, was recorded in general and administrative expense, respectively.\n(2)\nIncludes our share from unconsolidated joint ventures. The year ended December 31, 2024 includes $55,100 of estimated losses and damages related to Hurricanes Milton, Beryl, Debby, and Helene. The year ended December 31, 2022 includes $24,000\n of net estimated losses and damages related to Hurricanes Ian and Nicole\n.\n(3)\nIncludes settlement and other costs related to certain litigation and regulatory matters, interest income, and other miscellaneous income and expenses.\nNet Operating Income \nNOI is a non-GAAP measure often used to evaluate the performance of real estate companies. We define NOI for an identified population of homes as rental revenues and other property income less property operating and maintenance expense (which consists primarily of property taxes, insurance, HOA fees (when applicable), market-level personnel expenses, utility expenses, repairs and maintenance, and property administration). NOI excludes: interest expense; depreciation and amortization; property management expense; general and administrative expense; casualty losses, impairment, and other; gain on sale of property, net of tax; (gains) losses on investments in equity securities, net; other income and expenses; management fee revenues; and income (losses) from investments in unconsolidated joint ventures.\nWe consider NOI to be a meaningful supplemental financial measure of our performance when considered with the financial statements determined in accordance with GAAP. We believe NOI is helpful to investors in understanding the core performance of our real estate operations. The GAAP measure most directly comparable to NOI is net income or loss. NOI is not used as a measure of liquidity and should not be considered as an alternative to net income or loss or any other measure of financial performance presented in accordance with GAAP. Our NOI may not be comparable to the NOI of other companies due to the fact that not all companies use the same definition of NOI. Accordingly, there can be no assurance that our basis for computing this non-GAAP measure is comparable with that of other companies.\nWe believe that Same Store NOI is also a meaningful supplemental measure of our operating performance for the same reasons as NOI and is further helpful to investors as it provides a more consistent measurement of our performance across reporting periods by reflecting NOI for homes in our Same Store portfolio.\n74\nThe following table presents a reconciliation of net income (as determined in accordance with GAAP) to NOI for our total portfolio and NOI for our Same Store portfolio for each of the periods indicated:\nFor the Years Ended December 31,\n($ in thousands)\n2024\n2023\n2022\nNet income available to common stockholders\n$\n453,164 \n$\n518,774 \n$\n382,668 \nNet income available to participating securities\n753 \n696 \n661 \nNon-controlling interests\n1,448 \n1,558 \n1,470 \nInterest expense\n366,070 \n333,457 \n304,092 \nDepreciation and amortization\n714,326 \n674,287 \n638,114 \nProperty management expense\n(1)\n137,490 \n95,809 \n87,936 \nGeneral and administrative\n(2)\n90,612 \n82,344 \n74,025 \nCasualty losses, impairment, and other\n(3)\n82,925 \n8,596 \n28,697 \nGain on sale of property, net of tax\n(244,550)\n(183,540)\n(90,699)\n(Gains) losses on investments in equity and other securities, net\n(1,046)\n(350)\n3,939 \nOther, net\n(4)\n54,032 \n2,435 \n11,261 \nManagement fee revenues\n(69,978)\n(13,647)\n(11,480)\nLosses from investments in unconsolidated joint ventures\n28,445 \n17,877 \n9,606 \nNOI (total portfolio)\n1,613,691 \n1,538,296 \n$\n1,440,290 \nNon-Same Store NOI\n(113,290)\n(104,116)\nNOI (Same Store portfolio)\n(5)\n$\n1,500,401 \n$\n1,434,180 \n(1)\nIncludes $5,830, $6,963, and $6,493 of share-based compensation expense for the years ended December 31, 2024, 2023, and 2022, respectively.\n(2)\nIncludes $22,088, $22,540, and $22,469 of share-based compensation expense for the years ended December 31, 2024, 2023, and 2022, respectively.\n(3)\nIncludes our share from unconsolidated joint ventures. The year ended December 31, 2024 includes $55,100 of estimated losses and damages related to Hurricanes Milton, Beryl, Debby, and Helene. The year ended December 31, 2022 includes $24,000\n of net estimated losses and damages related to Hurricanes Ian and Nicole\n.\n(4)\nIncludes settlement and other costs related to certain litigation and regulatory matters, interest income, and other miscellaneous income and expenses.\n(5)\nThe Same Store portfolio totaled 76,601 homes for the years ended December 31, 2024 and 2023.\n75\nFunds from Operations, Core Funds from Operations, and Adjusted Funds from Operations \nFunds From Operations (“FFO”), Core FFO, and Adjusted FFO are supplemental, non-GAAP measures often utilized to evaluate the performance of real estate companies. FFO is defined by Nareit as net income or loss (computed in accordance with GAAP) excluding gains or losses from sales of previously depreciated real estate assets, plus depreciation, amortization and impairment of real estate assets, and adjustments for unconsolidated joint ventures.\nWe believe that FFO is a meaningful supplemental measure of the operating performance of our business because historical cost accounting for real estate assets in accordance with GAAP assumes that the value of real estate assets diminishes predictably over time, as reflected through depreciation and amortization. Because real estate values have historically risen or fallen with market conditions, management considers FFO an appropriate supplemental performance measure as it excludes historical cost depreciation and amortization, impairment on depreciated real estate investments, gains or losses related to sales of previously depreciated homes, as well non-controlling interests, from net income or loss (computed in accordance with GAAP). By excluding depreciation and amortization and gains or losses on sales of real estate, management uses FFO to measure returns on its investments in homes. However, because FFO excludes depreciation and amortization and captures neither the changes in the value of the homes that result from use or market conditions nor the level of capital expenditures to maintain the operating performance of the homes, all of which have real economic effect and could materially affect our results from operations, the utility of FFO as a measure of our performance is limited.\nManagement also believes that FFO, combined with the required GAAP presentations, is useful to investors in providing more meaningful comparisons of the operating performance of a company’s real estate between periods or as compared to other companies. The GAAP measure most directly comparable to FFO is net income or loss. FFO is not used as a measure of our liquidity and should not be considered an alternative to net income or loss or any other measure of financial performance presented in accordance with GAAP. Our FFO may not be comparable to the FFO of other companies due to the fact that not all companies use the same definition of FFO. Accordingly, there can be no assurance that our basis for computing this non-GAAP measures is comparable with that of other companies.\nWe believe that Core FFO and Adjusted FFO are also meaningful supplemental measures of our operating performance for the same reasons as FFO and are further helpful to investors as they provide a more consistent measurement of our performance across reporting periods by removing the impact of certain items that are not comparable from period to period. We define Core FFO as FFO adjusted for the following (including adjustments for unconsolidated joint ventures, as applicable): non-cash interest expense related to amortization of deferred financing costs, loan discounts, and non-cash interest expense from derivatives; share-based compensation expense; legal settlements; severance expense; casualty (gains) losses, net; and (gains) losses on investments in equity and other securities, net, as applicable. We define Adjusted FFO as Core FFO less recurring capital expenditures, including adjustments for unconsolidated joint ventures, that are necessary to help preserve the value, and maintain the functionality, of our homes. The GAAP measure most directly comparable to Core FFO and Adjusted FFO is net income or loss. Core FFO and Adjusted FFO are not used as measures of our liquidity and should not be considered alternatives to net income or loss or any other measure of financial performance presented in accordance with GAAP. Our Core FFO and Adjusted FFO may not be comparable to the Core FFO and Adjusted FFO of other companies due to the fact that not all companies use the same definition of Core FFO and Adjusted FFO. Accordingly, there can be no assurance that our basis for computing this non-GAAP measures is comparable with that of other companies.\n76\nThe following table presents a reconciliation of net income (as determined in accordance with GAAP) to FFO, Core FFO, and Adjusted FFO for each of the periods indicated:\nFor the Years Ended December 31,\n(in thousands, except shares and per share data)\n2024\n2023\n2022\nNet income available to common stockholders\n$\n453,164 \n$\n518,774 \n$\n382,668 \nAdd (deduct) adjustments from net income to derive FFO:\nNet income available to participating securities\n753 \n696 \n661 \nNon-controlling interests\n1,448 \n1,558 \n1,470 \nDepreciation and amortization on real estate assets\n699,474 \n663,398 \n629,301 \nImpairment on depreciated real estate investments\n506 \n427 \n310 \nNet gain on sale of previously depreciated investments in real estate\n(244,550)\n(183,540)\n(90,699)\nDepreciation and net gain on sale of investments in unconsolidated joint ventures\n14,479 \n8,704 \n4,907 \nFFO\n925,274 \n1,010,017 \n928,618 \nNon-cash interest expense related to amortization of deferred financing costs, loan discounts, and non-cash interest expense from derivatives\n(1)\n44,681 \n36,069 \n24,326 \nShare-based compensation expense\n(2)\n27,918 \n29,503 \n28,962 \nLegal settlements\n(3)\n77,000 \n2,000 \n7,400 \nSeverance expense\n637 \n977 \n314 \nCasualty losses, net\n(1)(4)\n82,700 \n8,200 \n28,485 \n(Gains) losses on investments in equity and other securities, net\n(1,046)\n(350)\n3,939 \nCore FFO\n1,157,164 \n1,086,416 \n1,022,044 \nRecurring capital expenditures\n(1)\n(170,927)\n(163,051)\n(156,147)\nAdjusted FFO\n$\n986,237 \n$\n923,365 \n$\n865,897 \nNet income available to common stockholders\nWeighted average common shares outstanding — diluted\n(5)(6)(7)\n613,631,617 \n613,288,708 \n611,112,396 \nNet income per common share — diluted\n(5)(6)(7)\n$\n0.74 \n$\n0.85 \n$\n0.63 \nFFO, Core FFO, and Adjusted FFO\nWeighted average common shares and OP Units outstanding — diluted\n(5)(6)(7)\n615,881,670 \n615,367,734 \n613,669,133 \nFFO per common share — diluted\n(5)(6)(7)\n$\n1.50 \n$\n1.64 \n$\n1.51 \nCore FFO per common share — diluted\n(5)(6)(7)\n$\n1.88 \n$\n1.77 \n$\n1.67 \nAFFO per common share — diluted\n(5)(6)(7)\n$\n1.60 \n$\n1.50 \n$\n1.41 \n(1)\nIncludes our share from unconsolidated joint ventures.\n(2)\nFor the years ended December 31, 2024, 2023, and 2022, $5,830, $6,963, and $6,493, was recorded in property management expense, respectively, and $22,088, $22,540, and $22,469, was recorded in general and administrative expense, respectively. \n(3)\nThe year ended December 31, 2024, includes $77,000 of settlement costs that resolved an inquiry from the FTC and the legal dispute entitled \nCity of San Diego et al v. Invitation Homes, Inc., \ninclusive of associated costs. The year ended December 31, 2022, includes the estimated cost of a global settlement of a multistate putative class action regarding resident late fees.\n(4)\nThe year ended December 31, 2024 includes $55,100 of estimated losses and damages related to Hurricanes Milton, Beryl, Debby, and Helene. The year ended December 31, 2022 includes $24,000\n of net estimated losses and damages related to Hurricanes Ian and Nicole\n.\n77\n(5)\nIn connection with the Starwood Waypoint Homes (“SWH”) merger, we assumed certain convertible senior notes including $345,000 in aggregate principal amount of 3.50% convertible senior notes due 2022 issued by SWH in January 2017 (the “2022 Convertible Notes”). On January 18, 2022, we settled the $141,490 outstanding principal balance of the 2022 Convertible Notes with the issuance of 6,216,261 shares of our common stock. For the year ended December 31, 2022, the shares of common stock issued with respect to this settlement are included within all net income, FFO, Core FFO, and AFFO per common share calculations subsequent to the conversion date.\n(6)\nIncremental shares attributed to non-vested share-based awards totaling 1,080,300, 1,394,924, and 1,341,786 for the years ended December 31, 2024, 2023, and 2022, respectively, are included in weighted average common shares outstanding in the calculation of net income per common share — diluted. For the computations of FFO, Core FFO, and AFFO per common share — diluted, common share equivalents of 1,376,141, 1,638,264, and 1,559,524 for the years ended December 31, 2024, 2023, and 2022, respectively, related to incremental shares attributed to non-vested share-based awards are included in the denominator.\n(7)\nVested units of partnership interests in INVH LP (“OP Units”) have been excluded from the computation of net income per common share — diluted for the periods above because all net income attributable to the vested OP Units has been recorded as non-controlling interest and thus excluded from net income available to common stockholders. Weighted average vested OP Units of 1,954,212, 1,835,686, and 2,338,999 for the years ended December 31, 2024, 2023, and 2022, respectively, are included in the denominator for the computations of FFO, Core FFO, and AFFO per common share — diluted.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nOur future income, cash flows, and fair values relevant to financial instruments are dependent upon prevalent market interest rates. Market risk refers to the risk of loss from adverse changes in interest rates, seasonality, market prices, commodity prices, and inflation. The primary market risks to which we are exposed are interest rate risk and seasonality. We may in the future use derivative financial instruments to manage, or hedge, interest rate risks related to any borrowings we may have. We may enter into such contracts only with major financial institutions based on their credit ratings and other factors.\nInterest Rate Risk\nA primary market risk to which we believe we are exposed is interest rate risk, which may result from many factors, including government monetary and tax policies, fluctuating global and United States economic conditions (including inflation, elevated interest rates, and bank failures), geopolitical tensions, and other factors that are beyond our control. We may incur additional variable rate debt in the future, including additional amounts that we may borrow under the Credit Facility. In addition, decreases in interest rates may lead to additional competition for the acquisition of single-family homes, which may lead to future acquisitions being more costly and resulting in lower yields on single-family homes targeted for acquisition. Significant increases in interest rates may also have an adverse impact on our earnings if we are unable to increase rents on expired leases or acquire single-family homes with rental rates high enough to offset the increase in interest rates on our borrowings.\nAs of December 31, 2024, our $3,045.0 million of outstanding variable-rate debt was comprised of Revolving Facility of $570.0 million, and Term Loan Facilities of $2,475.0 million. As of December 31, 2024, we had effectively converted 76.4% of these borrowings to a fixed rate through interest rate swap agreements. Our variable-rate borrowings bear interest at SOFR, as adjusted if appropriate, plus the applicable spread. Assuming no change in the outstanding balance of our existing debt, the projected effect of a 100 bps increase or decrease in SOFR, collectively, on our annual interest expense would be an estimated increase or decrease of $7.2 million. This estimate considers the impact of our interest rate swap agreements, interest rate cap agreement, and any Term SOFR floors or minimum interest rates stated in the agreements of the respective borrowings.\nThis analysis does not consider the effects of the reduced level of overall economic activity that could exist in such an environment. Further, in the event of a change of such magnitude, we may consider taking actions to further mitigate our exposure to the change. However, because of the uncertainty of the specific actions that would be taken and their possible effects, the sensitivity analysis assumes no changes in our capital structure.\n78\nInflation\nInflation primarily impacts our results of operations as a result of increased repair and maintenance and other costs and wage pressures. Inflation could also impact our cost of capital as a result of changing interest rates on variable rate debt that is not hedged or if our debt instruments are refinanced in a high-inflation environment. Our resident leases typically have a term of one to two years, which generally enables us to compensate for inflationary effects by increasing rents on our homes to current market rates. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe this had a material impact on our results of operations for the year ended December 31, 2024.\nSeasonality\nOur business and related operating results have been, and we believe will continue to be, impacted by seasonal factors throughout the year. In particular, we have experienced higher levels of resident move-outs during the summer months, which impacts both our rental revenues and related turnover costs. Further, our property operating costs are seasonally impacted in certain markets by increases in expenses such as HVAC repairs and costs to re-resident during the summer season. \nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe information required by this Item is included as a separate section in this Annual Report on Form 10-K. See Part IV. Item 15. “Exhibits and Financial Statement Schedules,” which is incorporated herein by reference.\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nWe maintain a set of disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) designed to ensure that information required to be disclosed in reports we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures. The design of any disclosure controls and procedures is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its goals under all potential future conditions. Any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives. Our management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2024. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of December 31, 2024, the design and operation of our disclosure controls and procedures were effective to accomplish their objectives at the reasonable assurance level.\n79\nChanges in Internal Control\nThere has been no change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during our most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagement's Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of our consolidated financial statements for external purposes in accordance with United States generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that (1) pertain to maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with United States generally accepted accounting principles and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Company’s management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of assets of the Company that could have a material effect on the consolidated financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nOur management with the participation of our Chief Executive Officer and Chief Financial Officer conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2024. This evaluation was based on the framework established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our assessment under the framework in Internal Control — Integrated Framework (2013), our management concluded that our internal control over financial reporting was effective as of December 31, 2024 to accomplish their objectives at the reasonable assurance level.\nDeloitte & Touche LLP, the independent registered public accounting firm that has audited the consolidated financial statements included in this Annual Report on Form 10-K, has issued an attestation report on the Company’s internal control over financial reporting as of December 31, 2024. The report is included herein.\n80\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Invitation Homes Inc. \nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Invitation Homes Inc. and subsidiaries (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control—Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control—Integrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 27, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nDallas, TX\nFebruary 27, 2025 \n81\nITEM 9B. OTHER INFORMATION\nNone\n.\nITEM 9C. DISCLOSURES REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n82\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nAs described above, our Code of Conduct is applicable to all of our directors, officers, and associates, including our principal executive officer, principal financial officer, principal accounting officer and controller, or persons performing similar functions. Our Code of Conduct is posted on our investor website at: www.invh.com under “Corporate Overview” — “Governance Documents.” Our Code of Conduct is a “code of ethics,” as defined by Item 406 of Regulation S-K of the Exchange Act promulgated by the SEC. We intend to make any legally required disclosures regarding amendments to, or waivers of, provisions of our Code of Conduct on our website rather than by filing a Current Report on Form 8-K and within the time period required under applicable rules and regulations. \nThe remaining information required by this Item is incorporated by reference from the Company’s 2025 Proxy Statement to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference from the Company’s 2025 Proxy Statement to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated from reference to the Company’s 2025 Proxy Statement to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference from the Company’s 2025 Proxy Statement to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated by reference from the Company’s 2025 Proxy Statement to be filed with the SEC within 120 days of the fiscal year ended December 31, 2024.\n83\nPART IV\nItem 15. Exhibits and Financial Statement Schedules.\nThe following documents are filed as part of this report:\n(a) Financial Statements\nInvitation Homes Inc. Consolidated Financial Statements as of December 31, 2024 and 2023 and for the three years in the period ended December 31, 2024\nReport of Deloitte & Touche LLP, Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\nF-\n1\nConsolidated Balance Sheets \nF-\n3\nConsolidated Statements of Operations \nF-\n4\nConsolidated Statements of Comprehensive Income (Loss)\nF-\n5\nConsolidated Statements of Equity \nF-\n6\nConsolidated Statements of Cash Flows \nF-\n7\nNotes to Consolidated Financial Statements \nF-\n9\n(b) Financial Statement Schedule\nInvitation Homes Inc. as of December 31, 2024 and for the three years in the period ended December 31, 2024\nSchedule III Real Estate and Accumulated Depreciation \nF-\n43\n(c) \nExhibits\n84\nEXHIBIT INDEX\nExhibit\n \nnumber\nDescription\n2.1\nAgreement and Plan of Merger, dated August 9, 2017, by and among Invitation Homes Inc., Invitation Homes Operating Partnership LP, IH Merger Sub, LLC, Starwood Waypoint Homes and Starwood Waypoint Homes Partnership, L.P. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on August 14, 2017).\n3.1\nCharter of Invitation Homes Inc., dated as of February 6, 2017 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 6, 2017).\n3.2\nAmended and Restated Bylaws of Invitation Homes Inc., dated as of May 17, 2023 (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K filed on May 18, 2023).\n4.1\nDescription of Securities (incorporated by reference to Exhibit 4.4 to the Company’s \nAnnual\n Report on Form 10-K (File No. 1-38004) filed on February 19, 2020).\n4.2\nIndenture, dated as of January 10, 2017, between Starwood Waypoint Homes and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 4.1 of SWH’s Current Report on Form 8-K (File No. 1-36163) filed January 10, 2017).\n4.3\nForm of 3.50% Convertible Senior Notes due 2022 (incorporated by reference to Exhibit 4.1 of SWH’s Current Report on Form 8-K (File No. 1-36163) filed January 10, 2017).\n4.4\nFirst Supplemental Indenture between Invitation Homes Inc., IH Merger Sub LLC and Wilmington Trust, National Association, as trustee dated as of November 16, 2017 (incorporated by reference to Exhibit 4.2 to the Company’s Current Report on Form 8-K (File No.1-38004) filed on November 20, 2017).\n4.5\nIndenture, dated as of August 6, 2021, among Invitation Homes Operating Partnership LP, the Guarantors (as defined therein) party hereto and U.S. Bank National Association, a national banking association, as trustee (incorporated by reference to Exhibit 4.1 of the Company’s Current Report on Form 8-K (File No.1-38004) filed on August 6, 2021).\n \n4.6\nFirst Supplemental Indenture, dated as of August 6, 2021 among Invitation Homes Operating Partnership LP, Invitation Homes Inc., Invitation Homes OP GP LLC, IH Merger Sub, LLC, and U.S. Bank National Association, as trustee including the form of 2.000% Senior Notes due 2031 (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K (File No.1-38004) filed on August 6, 2021).\n4.7\nSecond Supplemental Indenture, dated as of November 5, 2021, among\n \nInvitation Homes Operating Partnership LP\n, the Guarantors and the Trustee, including the form of 2.300% Senior Notes due 2028 (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K (File No.1-38004) filed on November 5, 2021).\n4.8\nThird Supplemental Indenture, dated as of November 5, 2021, among\n \nInvitation Homes Operating Partnership LP\n, the Guarantors and the Trustee, including the form of 2.700% Senior Notes due 2034 (incorporated by reference to Exhibit 4.3 of the Company’s Current Report on Form 8-K (File No.1-38004) filed on November 5, 2021).\n4.9\nFourth Supplemental Indenture, dated as of April 5, 2022, among Invitation Homes Operating Partnership LP, Invitation Homes Inc., Invitation Homes OP GP LLC, IH Merger Sub, LLC, and U.S. Bank Trust Company, National Association (as successor to U.S. Bank National Association), as trustee, including the form of 4.150% Senior Notes due 2032 (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K (File No.1-38004) filed on April 5, 2022).\n85\nExhibit\n \nnumber\nDescription\n4.10\nFifth Supplemental Indenture, dated as of August 2, 2023, among Invitation Homes Operating Partnership LP, Invitation Homes Inc., Invitation Homes OP GP LLC, IH Merger Sub, LLC, and U.S. Bank Trust Company, National Association, as trustee, including the form of the 5.450% Senior Notes due 2030 (incorporated by reference to Exhibit 4.2 to the Company’s Current Report on Form 8-K filed on August 2, 2023).\n4.11\nSixth Supplemental Indenture, dated as of August 2, 2023, among Invitation Homes Operating Partnership LP, Invitation Homes Inc., Invitation Homes OP GP LLC, IH Merger Sub, LLC, and U.S. Bank Trust Company, National Association, as trustee, including the form of the 5.500% Senior Notes due 2033 (incorporated by reference to Exhibit 4.3 to the Company’s Current Report on Form 8-K filed on August 2, 2023).\n4.12\nSeventh Supplemental Indenture, dated as of September\n \n26, 2024, among Invitation Homes Operating Partnership LP, Invitation Homes Inc., Invitation Homes OP GP LLC, IH Merger Sub, LLC, and U.S. Bank Trust Company, National Association, as trustee, including the form of the 4.875% Senior Notes due 2035 (incorporated by reference to\n Exhibit\n \n4.2\n to the Current Report on Form\n \n8-K of the Company filed on \nSeptember\n \n26\n, 2024).\n10.1\nNote Purchase Agreement, dated May 25, 2021, among Invitation Homes Operating Partnership LP and the purchasers named therein (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on May 26, 2021).\n10.2\nForm of Invitation Homes Operating Partnership LP 2.46% Senior Note, Series A, due May 25, 2028 (included as a part of Exhibit 10.1 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on May 26, 2021)).\n10.3\nForm of Invitation Homes Operating Partnership LP 3.18% Senior Note, Series B, due May 25, 2036 (included as a part of Exhibit 10.1 (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on May 26, 2021)).\n10.4\nParent Guaranty Agreement dated as of September 17, 2021 re: 2.46% Senior Notes, Series A, due May 25, 2028 and 3.18% Senior Notes, Series B, due May 25, 2036 of Invitation Homes Inc., Invitation Homes GP LLC and IH Merger Sub, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on October 28, 2021).\n10.5\nParent Guaranty dated as of September 17, 2021 by Invitation Homes Inc., Invitation Homes GP LLC and IH Merger Sub, LLC for the benefit of Bank of America, N.A., in its capacity as the administrative agent for the Lenders under that certain Amended and Restated Revolving Credit and Term Loan Agreement, dated as of December 8, 2020, for the benefit of itself and such Lenders (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on October 28, 2021).\n10.6\nAmended and Restated Agreement of Limited Partnership of Invitation Homes Operating Partnership LP, dated as of August 9, 2017, by and among Invitation Homes OP GP LLC and Invitation Homes Inc. (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on August 14, 2017).\n10.7\nAmended and Restated Registration Rights Agreement, dated as of October 4, 2016, among SWH and the other parties named therein (incorporated by reference to Exhibit 10.1 of SWH’s Current Report on Form 8-K (File No. 1- 36163) filed with the SEC on October 11, 2016).\n10.8\nAssignment and Assumption Agreement, dated as of November 16, 2017, between Invitation Homes Inc. and IH Merger Sub, LLC (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K (File No.1-38004) filed on November 20, 2017).\n86\nExhibit\n \nnumber\nDescription\n10.9\nAmended and Restated Revolving Credit and Term Loan Agreement, dated as of December 8, 2020, by and among Invitation Homes Operating Partnership LP, as borrower, the lenders party thereto, Bank of America, N.A., as administrative agent and the other parties party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on December 9, 2020).\n10.10\nFirst Amendment to Amended and Restated Revolving Credit and Term Loan Agreement, dated as of April 18, 2023, by and among Invitation Homes Operating Partnership LP, as borrower, the lenders party thereto, Bank of America, N.A., as administrative agent and solely for purposes of Sections 3, 4, 5 and 7 thereof, each of the guarantors party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on April 24, 2023).\n10.11\nTerm Loan Agreement, dated as of June 22, 2022, by and among Invitation Homes Operating Partnership LP, as borrower, the lenders party thereto, Capital One, National Association, as administrative agent and the other parties party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on June 22, 2022).\n10.12\nSecond Amended and Restated Revolving Credit and Term Loan Agreement, dated as of September\n \n9, 2024, by and among Invitation Homes Operating Partnership LP, as borrower, the lenders party thereto, Bank of America, N.A., as administrative agent and the other parties party thereto (incorporated by reference to Exhibit\n \n10.1 to the Current Report on Form 8-K of the Company filed on September\n \n10, 2024).\n10.13\nFirst Amendment to Term Loan Agreement, dated as of September\n \n9, 2024, by and among Invitation Homes Operating Partnership LP, as borrower, the lenders party thereto, Capital One, National Association, as administrative agent and the other parties party thereto (incorporated by reference to Exhibit\n \n10.2 to the Current Report on Form 8-K of the Company filed on September\n \n10, 2024).\n10.14\nLoan Agreement, dated as of April 28, 2017, between IH 2017-1 Borrower, LP, as Borrower, and Wells Fargo Bank, National Association, as Lender (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed May 1, 2017).\n10.15\nLoan Agreement, dated as of February 8, 2018, between IH 2018-1 Borrower, LP, as Borrower, and JPMorgan Chase Bank, National Association, as Lender (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 12, 2018).\n10.16\nLoan Agreement, dated as of May 8, 2018, between IH 2018-2 Borrower, LP, as Borrower, and JPMorgan Chase Bank, National Association, as Lender (incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K (File No. 1-38004) filed on May 9, 2018).\n10.17\nLoan Agreement, dated as of June 28, 2018, between IH 2018-3 Borrower, LP, as Borrower, and German American Capital Corporation, as Lender (incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K (File No. 1-38004) filed on July 2, 2018).\n10.18\nLoan Agreement, dated as of November 7, 2018, between IH 2018-4 Borrower LP, as Borrower, and German American Capital Corporation, as Lender (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on November 8, 2018).\n10.19\nLoan Agreement, dated as of June 7, 2019, between 2019-1 IH Borrower LP, as Borrower, and Rothesay Life PLC, as Lender (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on June 10, 2019).\n10.20\nAmendment to Loan Agreement, dated as of June 23, 2023, among Wilmington Trust National Association, as Trustee for the Registered Holders of Invitation Homes 2018-SFR4 Single Family Rental Pass-Through Certificates, 2018-4 IH Borrower LP, and 2018-4 Equity Owner LLC, and 2018-4 IH Borrower GP. LLC (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on July 27, 2023).\n87\nExhibit\n \nnumber\nDescription\n10.21\nSecurities Purchase Agreement, dated as of June 5, 2017, between Waypoint/GI Venture, LLC and CSH Property Three, LLC (incorporated by reference to Exhibit 10.1 of the SWH’s Current Report on Form 8-K (File No. 1-36163) filed June 5, 2017).\n10.22\nForm of Director and Officer Indemnification Agreement\n \n(\nincorporated by reference to Exhibit\n \n10.20 to the Company’s Annual Report on Form\n \n10-K (File No. 1-38004) filed on February\n \n21, 202\n4\n)\n.\n \n†\n10.23\nInvitation Homes Inc. 2017 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 6, 2017). †\n10.24\nEmployment Agreement with Dallas B. Tanner, dated November 9, 2015 (incorporated by reference to Exhibit 10.12 to the Company’s Registration Statement on Form S-11 (No. 333-215452) filed on January 6, 2017). †\n10.25\nForm of Award Notice and Restricted Stock Unit Agreement for Non-Employee Directors (General Form) (incorporated by reference to Exhibit 10.21 to the Company’s Registration Statement on Form S-11 (No. 333-215452) filed on January 23, 2017). †\n10.26\n2019 Outperformance Award Agreement (LTIP Units) (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on July 31, 2019). †\n10.27\nInvitation Homes Inc. Executive Severance Plan (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on May 7, 2020.) †\n10.28\nForm of Outperformance Award Agreement (LTIP Units) (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q (File No. 1-38004) filed on April 28, 2022). †\n10.29\nForm of Award Notice and Restricted Stock Unit Agreement (LTIP Equity Award) (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed on March 1, 2023). †\n10.30\nExecutive Transition Services Agreement dated February 1, 2023, between Ernest M. Freedman and Invitation Homes Inc. (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 1, 2023)\n. \n†\n10.31\nForm of Award Notice and Restricted Stock Unit Agreement (LTIP RSU Award Agreement) under the Invitation Homes Inc. 2017 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 25, 2025). †\n10.32\nForm of Award Notice and \nLTIP \nUnit Agreement (LTIP Unit Award Agreement) under the Invitation Homes Inc. 2017 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K (File No. 1-38004) filed on February 25, 2025). †\n19.1\nPolicies and Procedures for Trading in Securities of Invitation Homes Inc.\n21.1\nSubsidiaries of the Registrant.\n22.1\nSubsidiary\n Issuer and\n Guarantors \nof Guaranteed Securities\n.\n \n23.1\nConsent of Deloitte & Touche LLP.\n31.1\nCertification of Dallas B. Tanner, Chief Executive Officer, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n88\nExhibit\n \nnumber\nDescription\n31.2\nCertification of Jonathan S. Olsen, Executive Vice President and Chief Financial Officer, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of Dallas B. Tanner, Chief Executive Officer, pursuant to Section 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n32.2\nCertification of Jonathan S. Olsen, Executive Vice President and Chief Financial Officer, pursuant to Section 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (furnished herewith).\n97.1\nIncentive Compensation Clawback Policy\n \n(incorporated by reference to Exhibit 4.4 to the Company’s Annual Report on Form 10-K (File No. 1-38004) filed on February\n \n21, 202\n4\n)\n.\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104\nCover page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n† Management contract or compensatory plan.\nCertain agreements and other documents filed as exhibits to this Annual Report on Form 10-K contain representations and warranties that the parties thereto made to each other. These representations and warranties have been made solely for the benefit of the other parties to such agreements and may have been qualified by certain information that has been disclosed to the other parties to such agreements and other documents and that may not be reflected in such agreements and other documents. In addition, these representations and warranties may be intended as a way of allocating risks among parties if the statements contained therein prove to be incorrect, rather than as actual statements of fact. Accordingly, there can be no reliance on any such representations and warranties as characterizations of the actual state of facts. Moreover, information concerning the subject matter of any such representations and warranties may have changed since the date of such agreements or other documents.\nITEM 16. FORM 10-K SUMMARY\nNone.\n89\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in Dallas, Texas, on the 27th day of February 2025. \nInvitation Homes Inc.\nBy:\n/s/ Dallas B. Tanner\nName: \nDallas B. Tanner\nTitle: Chief Executive Officer\nPursuant to the requirements of the Securities Act of 1934, this report has been signed by the following persons in the capacities indicated on the 27th day of February 2025. \nSignature\nTitle\n/s/ Dallas B. Tanner\nChief Executive Officer, and Director\nDallas B. Tanner\n(Principal Executive Officer)\n/s/ Jonathan S. Olsen\nExecutive Vice President and Chief Financial Officer\nJonathan S. Olsen\n(Principal Financial Officer)\n/s/ Kimberly K. Norrell\nExecutive Vice President and Chief Accounting Officer\nKimberly K. Norrell\n(Principal Accounting Officer)\n/s/ Michael D. Fascitelli\nChairman and Director\nMichael D. Fascitelli\n/s/ Jana C. Barbe\nDirector\nJana C. Barbe\n/s/ Richard D. Bronson\nDirector\nRichard D. Bronson\n/s/ Adm. H. Wyman Howard III\nDirector\nAdm. H. Wyman Howard III\n/s/ Jeffrey E. Kelter\nDirector\nJeffrey E. Kelter\n90\nSignature\nTitle\n/s/ Joseph D. Margolis\nDirector\nJoseph D. Margolis\n/s/ John B. Rhea\nDirector\nJohn B. Rhea\n/s/ Janice L. Sears\nDirector\nJanice L. Sears\n/s/ Frances Aldrich Sevilla-Sacasa\nDirector\nFrances Aldrich Sevilla-Sacasa\n/s/ Keith D. Taylor\nDirector\nKeith D. Taylor\n91\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Invitation Homes Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Invitation Homes Inc. and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income (loss), equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control—Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 27, 2025, expressed an unqualified opinion on the Company’s internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nInvestments in Single-Family Residential Properties—Refer to Notes 2 and 3 to the financial statements\nCritical Audit Matter Description\nThe Company owned approximately 85,000 single-family residential properties with a carrying value of $17.2 billion of investments in single-family residential properties, net on the balance sheet as of December 31, 2024. The Company capitalizes costs to acquire, stabilize, and prepare single-family residential properties to be leased. They also capitalize costs that improve or extend the life of the home, a portion of the salaries and benefits of the employees who are directly responsible for such improvements, and for certain furniture and fixtures additions. The determination of which costs to capitalize requires significant management judgment. \nF-1\nGiven the number of homes and the volume and nature of the costs capitalized, performing audit procedures to evaluate the accounting for costs capitalized was challenging and required an increased extent of audit effort. \nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to whether the investments in single-family residential properties were accounted for appropriately included the following, among others:\n•\nWe tested the effectiveness of relevant controls over investments in single-family residential properties, including management’s controls over the acquisition and cost capitalization of its properties.\n•\nWe selected a sample of properties acquired and evaluated the accuracy of the amounts recorded and appropriate transfer of title.\n•\nWe selected a sample of costs capitalized during the year and evaluated the accuracy and classification of recorded amounts. \n•\nWe developed an expectation of capitalized recurring expenditures that improve or extend the life of the home based on the historical amounts recorded, taking into account changes in the portfolio of single-family residential properties and market conditions, and compared our expectation to the recorded balance.\n/s/ \nDeloitte & Touche LLP\nDallas, TX\nFebruary 27, 2025\nWe have served as the Company’s auditor since 2013. \nF-2\nINVITATION HOMES INC.\nCONSOLIDATED BALANCE SHEETS\nAs of December 31, 2024 and 2023\n(in thousands, except shares and per share data)\n2024\n2023\nAssets:\nInvestments in single-family residential properties:\nLand\n$\n4,901,192\n \n$\n4,881,890\n \nBuilding and improvements\n17,180,308\n \n16,670,006\n \n22,081,500\n \n21,551,896\n \nLess: accumulated depreciation\n(\n4,869,374\n)\n(\n4,262,682\n)\nInvestments in single-family residential properties, net\n17,212,126\n \n17,289,214\n \nCash and cash equivalents\n174,491\n \n700,618\n \nRestricted cash\n245,202\n \n196,866\n \nGoodwill\n258,207\n \n258,207\n \nInvestments in unconsolidated joint ventures\n241,605\n \n247,166\n \nOther assets, net\n569,320\n \n528,896\n \nTotal assets\n$\n18,700,951\n \n$\n19,220,967\n \nLiabilities:\nMortgage loans, net\n$\n983,924\n \n$\n1,627,256\n \nSecured term loan, net\n401,649\n \n401,515\n \nUnsecured notes, net\n3,800,688\n \n3,305,467\n \nTerm loan facilities, net\n2,446,041\n \n3,211,814\n \nRevolving facility\n570,000\n \n—\n \nAccounts payable and accrued expenses\n247,709\n \n200,590\n \nResident security deposits\n180,866\n \n180,455\n \nOther liabilities\n277,565\n \n103,435\n \nTotal liabilities\n8,908,442\n \n9,030,532\n \nCommitments and contingencies (Note 14)\nEquity:\nStockholders’ equity\nPreferred stock, $\n0.01\n par value per share, \n900,000,000\n shares authorized, \nnone\n outstanding as of December 31, 2024 and 2023\n—\n \n—\n \nCommon stock, $\n0.01\n par value per share, \n9,000,000,000\n shares authorized, \n612,605,478\n and \n611,958,239\n outstanding as of December 31, 2024 and 2023, respectively\n6,126\n \n6,120\n \nAdditional paid-in capital\n11,170,597\n \n11,156,736\n \nAccumulated deficit\n(\n1,480,928\n)\n(\n1,070,586\n)\nAccumulated other comprehensive income\n60,969\n \n63,701\n \nTotal stockholders’ equity\n9,756,764\n \n10,155,971\n \nNon-controlling interests\n35,745\n \n34,464\n \nTotal equity\n9,792,509\n \n10,190,435\n \nTotal liabilities and equity\n$\n18,700,951\n \n$\n19,220,967\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-3\nINVITATION HOMES INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS \n(in thousands, except shares and per share data) \nFor the Years Ended December 31,\n2024\n2023\n2022\nRevenues:\nRental revenues and other property income\n$\n2,548,964\n \n$\n2,418,631\n \n$\n2,226,641\n \nManagement fee revenues\n69,978\n \n13,647\n \n11,480\n \nTotal revenues\n2,618,942\n \n2,432,278\n \n2,238,121\n \nExpenses:\nProperty operating and maintenance\n935,273\n \n880,335\n \n786,351\n \nProperty management expense\n137,490\n \n95,809\n \n87,936\n \nGeneral and administrative\n90,612\n \n82,344\n \n74,025\n \nInterest expense\n366,070\n \n333,457\n \n304,092\n \nDepreciation and amortization\n714,326\n \n674,287\n \n638,114\n \nCasualty losses, impairment, and other\n82,925\n \n8,596\n \n28,697\n \nTotal expenses \n2,326,696\n \n2,074,828\n \n1,919,215\n \nGains (losses) on investments in equity and other  securities, net\n1,046\n \n350\n \n(\n3,939\n)\nOther, net\n(\n54,032\n)\n(\n2,435\n)\n(\n11,261\n)\nGain on sale of property, net of tax\n244,550\n \n183,540\n \n90,699\n \nLosses from investments in unconsolidated joint ventures\n(\n28,445\n)\n(\n17,877\n)\n(\n9,606\n)\nNet income\n455,365\n \n521,028\n \n384,799\n \nNet income attributable to non-controlling interests\n(\n1,448\n)\n(\n1,558\n)\n(\n1,470\n)\nNet income attributable to common stockholders\n453,917\n \n519,470\n \n383,329\n \nNet income available to participating securities\n(\n753\n)\n(\n696\n)\n(\n661\n)\nNet income available to common stockholders — basic and diluted (Note 12)\n$\n453,164\n \n$\n518,774\n \n$\n382,668\n \nWeighted average common shares outstanding — basic\n612,551,317\n \n611,893,784\n \n609,770,610\n \nWeighted average common shares outstanding — diluted\n613,631,617\n \n613,288,708\n \n611,112,396\n \nNet income per common share — basic\n$\n0.74\n \n$\n0.85\n \n$\n0.63\n \nNet income per common share — diluted\n$\n0.74\n \n$\n0.85\n \n$\n0.63\n \nThe accompanying notes are an integral part of these consolidated financial statements. \nF-4\nINVITATION HOMES INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\n \nFor the Years Ended December 31,\n2024\n2023\n2022\nNet income\n$\n455,365\n \n$\n521,028\n \n$\n384,799\n \nOther comprehensive income (loss)\nUnrealized gains on interest rate swaps\n73,042\n \n39,488\n \n327,323\n \n(Gains) losses from interest rate swaps reclassified into earnings from accumulated other comprehensive income (loss)\n(\n75,772\n)\n(\n73,856\n)\n59,103\n \nOther comprehensive income (loss)\n(\n2,730\n)\n(\n34,368\n)\n386,426\n \nComprehensive income\n452,635\n \n486,660\n \n771,225\n \nComprehensive income attributable to non-controlling interests\n(\n1,451\n)\n(\n1,474\n)\n(\n3,046\n)\nComprehensive income attributable to common stockholders\n$\n451,184\n \n$\n485,186\n \n$\n768,179\n \nThe accompanying notes are an integral part of these consolidated financial statements. \nF-5\nINVITATION HOMES INC.\nCONSOLIDATED STATEMENTS OF EQUITY\nFor the Years Ended December 31, 2024, 2023, and 2022\n(in thousands, except share and per share data)\nCommon Stock\nNumber of Shares\nAmount\nAdditional\nPaid-in Capital\nAccumulated Deficit\nAccumulated Other Comprehensive Income (Loss)\nTotal Stockholders' Equity\nNon-Controlling Interests\nTotal Equity\nBalance as of December 31, 2021\n601,045,438\n \n$\n6,010\n \n$\n10,873,539\n \n$\n(\n794,869\n)\n$\n(\n286,938\n)\n$\n9,797,742\n \n$\n41,062\n \n$\n9,838,804\n \nCapital distributions\n— \n— \n— \n— \n— \n— \n(\n2,397\n)\n(\n2,397\n)\nNet income\n— \n— \n— \n383,329\n \n— \n383,329\n \n1,470\n \n384,799\n \nDividends and dividend equivalents paid ($\n0.88\n per share)\n— \n— \n— \n(\n539,680\n)\n— \n(\n539,680\n)\n— \n(\n539,680\n)\nIssuance of common stock — settlement of RSUs, net of tax\n660,756\n \n7\n \n(\n12,876\n)\n— \n— \n(\n12,869\n)\n— \n(\n12,869\n)\nIssuance of common stock — settlement of 2022 Convertible Notes\n6,216,261\n \n62\n \n141,157\n \n— \n— \n141,219\n \n— \n141,219\n \nIssuance of common stock, net\n2,438,927\n \n25\n \n98,342\n \n— \n— \n98,367\n \n— \n98,367\n \nShare-based compensation expense\n— \n— \n24,950\n \n— \n— \n24,950\n \n4,012\n \n28,962\n \nTotal other comprehensive income\n— \n— \n— \n— \n384,850\n \n384,850\n \n1,576\n \n386,426\n \nRedemption of OP Units for common stock\n1,050,000\n \n10\n \n13,351\n \n— \n73\n \n13,434\n \n(\n13,434\n)\n—\n \nBalance as of December 31, 2022\n611,411,382\n \n6,114\n \n11,138,463\n \n(\n951,220\n)\n97,985\n \n10,291,342\n \n32,289\n \n10,323,631\n \nCapital distributions\n— \n— \n— \n— \n— \n— \n(\n2,374\n)\n(\n2,374\n)\nNet income\n— \n— \n— \n519,470\n \n— \n519,470\n \n1,558\n \n521,028\n \nDividends and dividend equivalents paid ($\n1.04\n per share)\n— \n— \n— \n(\n638,836\n)\n— \n(\n638,836\n)\n— \n(\n638,836\n)\nIssuance of common stock — settlement of RSUs, net of tax\n546,857\n \n6\n \n(\n8,155\n)\n— \n— \n(\n8,149\n)\n— \n(\n8,149\n)\nShare-based compensation expense\n— \n— \n26,428\n \n— \n— \n26,428\n \n3,075\n \n29,503\n \nTotal other comprehensive loss\n— \n— \n— \n— \n(\n34,284\n)\n(\n34,284\n)\n(\n84\n)\n(\n34,368\n)\nBalance as of December 31, 2023\n611,958,239\n \n6,120\n \n11,156,736\n \n(\n1,070,586\n)\n63,701\n \n10,155,971\n \n34,464\n \n10,190,435\n \nCapital distributions\n— \n— \n— \n— \n— \n— \n(\n3,326\n)\n(\n3,326\n)\nNet income\n— \n— \n— \n453,917\n \n— \n453,917\n \n1,448\n \n455,365\n \nDividends and dividend equivalents declared ($\n1.41\n per share)\n— \n— \n— \n(\n864,259\n)\n— \n(\n864,259\n)\n— \n(\n864,259\n)\nIssuance of common stock — settlement of RSUs, net of tax\n639,739\n \n6\n \n(\n10,900\n)\n— \n— \n(\n10,894\n)\n— \n(\n10,894\n)\nShare-based compensation expense\n— \n— \n24,681\n \n— \n— \n24,681\n \n3,237\n \n27,918\n \nTotal other comprehensive loss\n— \n— \n— \n— \n(\n2,733\n)\n(\n2,733\n)\n3\n \n(\n2,730\n)\nRedemption of OP Units for common stock\n7,500\n \n— \n80\n \n— \n1\n \n81\n \n(\n81\n)\n—\n \nBalance as of December 31, 2024\n612,605,478\n \n$\n6,126\n \n$\n11,170,597\n \n$\n(\n1,480,928\n)\n$\n60,969\n \n$\n9,756,764\n \n$\n35,745\n \n$\n9,792,509\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-6\nINVITATION HOMES INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nFor the Years Ended December 31,\n2024\n2023\n2022\nOperating Activities:\nNet income\n$\n455,365\n \n$\n521,028\n \n$\n384,799\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n714,326\n \n674,287\n \n638,114\n \nShare-based compensation expense\n27,918\n \n29,503\n \n28,962\n \nAmortization of deferred financing costs\n18,598\n \n16,203\n \n15,014\n \nAmortization of debt discounts\n2,765\n \n1,998\n \n1,653\n \nProvisions for impairment\n506\n \n427\n \n310\n \n(Gains) losses on investments in equity and other securities, net\n(\n1,046\n)\n(\n350\n)\n3,939\n \nGains on sale of property, net of tax\n(\n244,550\n)\n(\n183,540\n)\n(\n90,699\n)\nChange in fair value of derivative instruments\n12,419\n \n9,375\n \n9,486\n \nLosses from investments in unconsolidated joint ventures, net of operating distributions\n31,063\n \n20,620\n \n11,433\n \nOther non-cash amounts included in net income\n43,549\n \n5,572\n \n30,963\n \nChanges in operating assets and liabilities:\nOther assets, net\n(\n29,234\n)\n(\n24,524\n)\n(\n10,887\n)\nAccounts payable and accrued expenses\n46,502\n \n24,375\n \n(\n5,989\n)\nResident security deposits\n411\n \n4,903\n \n10,385\n \nOther liabilities\n3,213\n \n7,211\n \n(\n3,896\n)\nNet cash provided by operating activities\n1,081,805\n \n1,107,088\n \n1,023,587\n \nInvesting Activities:\nDeposits for acquisition of single-family residential properties\n(\n2,292\n)\n6,365\n \n(\n35,460\n)\nAcquisition of single-family residential properties\n(\n735,647\n)\n(\n969,670\n)\n(\n564,706\n)\nInitial renovations to single-family residential properties\n(\n30,605\n)\n(\n30,207\n)\n(\n122,371\n)\nOther capital expenditures for single-family residential properties\n(\n219,394\n)\n(\n221,102\n)\n(\n208,070\n)\nProceeds from sale of single-family residential properties\n585,176\n \n488,055\n \n240,034\n \nRepayment proceeds from retained debt securities\n32,204\n \n861\n \n70,546\n \nInvestments in equity securities\n(\n4,718\n)\n(\n33,577\n)\n(\n15,832\n)\nProceeds from sale of investments in equity securities\n—\n \n—\n \n5,762\n \nInvestments in unconsolidated joint ventures\n(\n44,186\n)\n(\n442\n)\n(\n167,728\n)\nNon-operating distributions from unconsolidated joint ventures\n18,684\n \n13,227\n \n6,119\n \nOther investing activities\n(\n65,092\n)\n(\n27,062\n)\n(\n22,707\n)\nNet cash used in investing activities\n(\n465,870\n)\n(\n773,552\n)\n(\n814,413\n)\nFinancing Activities:\nPayment of dividends and dividend equivalents\n(\n689,244\n)\n(\n638,129\n)\n(\n539,033\n)\nDistributions to non-controlling interests\n(\n3,326\n)\n(\n2,374\n)\n(\n2,397\n)\nPayment of taxes related to net share settlement of RSUs\n(\n10,894\n)\n(\n8,149\n)\n(\n12,869\n)\nPayments on mortgage loans\n(\n645,666\n)\n(\n20,491\n)\n(\n1,412,249\n)\nPayments on secured term loan\n(\n83\n)\n(\n234\n)\n—\n \nProceeds from unsecured notes\n494,275\n \n790,144\n \n598,434\n \nF-7\nINVITATION HOMES INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS (continued)\n(in thousands)\nFor the Years Ended December 31,\n2024\n2023\n2022\nProceeds from term loan facility\n1,750,000\n \n—\n \n725,000\n \nPayments on term loan facility\n(\n2,500,000\n)\n—\n \n—\n \nProceeds from revolving facility\n750,000\n \n150,000\n \n130,000\n \nPayments on revolving facility\n(\n180,000\n)\n(\n150,000\n)\n(\n130,000\n)\nProceeds from issuance of common stock, net\n—\n \n—\n \n98,367\n \nDeferred financing costs paid\n(\n54,246\n)\n(\n7,767\n)\n(\n13,043\n)\nOther financing activities\n(\n4,542\n)\n(\n2,979\n)\n(\n16,315\n)\nNet cash provided by (used in) financing activities\n(\n1,093,726\n)\n110,021\n \n(\n574,105\n)\nChange in cash, cash equivalents, and restricted cash\n(\n477,791\n)\n443,557\n \n(\n364,931\n)\nCash, cash equivalents, and restricted cash, beginning of period (Note 4)\n897,484\n \n453,927\n \n818,858\n \nCash, cash equivalents, and restricted cash, end of period (Note 4)\n$\n419,693\n \n$\n897,484\n \n$\n453,927\n \nSupplemental cash flow disclosures:\nInterest paid, net of amounts capitalized\n$\n321,328\n \n$\n290,649\n \n$\n275,730\n \nInterest capitalized as investments in single-family residential properties, net\n2,128\n \n2,804\n \n6,899\n \nCash paid for income taxes\n158\n \n245\n \n1,534\n \nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n6,367\n \n6,026\n \n6,025\n \nFinancing cash flows from finance leases\n3,402\n \n2,942\n \n2,642\n \nNon-cash investing and financing activities:\nAccrued renovation improvements at period end\n$\n1,294\n \n$\n1,858\n \n$\n2,272\n \nAccrued residential property capital improvements at period end\n8,463\n \n5,346\n \n9,656\n \nDeferred payment for acquisition of single-family residential properties\n—\n \n25,587\n \n—\n \nTransfer of residential property, net to other assets, net for held for sale assets\n174,460\n \n167,013\n \n90,695\n \nChange in other comprehensive income (loss) from cash flow hedges\n(\n15,148\n)\n(\n43,670\n)\n377,022\n \nROU assets obtained in exchange for operating lease liabilities\n14,438\n \n301\n \n5,798\n \nROU assets obtained in exchange for finance lease liabilities\n8,739\n \n3,255\n \n340\n \nDividends declared but not paid\n176,952\n \n—\n \n—\n \nNet settlement of 2022 Convertible Notes in shares of common stock\n—\n \n—\n \n141,219\n \n \nThe accompanying notes are an integral part of these consolidated financial statements. \nF-8\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\n \nNote 1—\nOrganization and Formation\nInvitation Homes Inc. (“INVH”) is a real estate investment trust (“REIT”) that conducts its operations through Invitation Homes Operating Partnership LP (“INVH LP”). INVH LP was formed for the purpose of owning, renovating, leasing, and operating single-family residential properties. Through THR Property Management L.P., a wholly owned subsidiary of INVH LP, and its wholly owned subsidiaries (collectively, the “Manager”), we provide all management and other administrative services with respect to the properties we own. The Manager also provides professional property and asset management services to portfolio owners of single-family homes for lease, including our investments in unconsolidated joint ventures.\nOn February 6, 2017, INVH completed an initial public offering (“IPO”), changed its jurisdiction of incorporation to Maryland, and amended its charter to provide for the issuance of up to \n9,000,000,000\n shares of common stock and \n900,000,000\n shares of preferred stock, in each case $\n0.01\n par value per share. In connection with certain pre-IPO reorganization transactions, INVH LP became (1) owned by INVH directly and through Invitation Homes OP GP LLC, a wholly owned subsidiary of INVH (the “General Partner”), and (2) the owner of all of the assets, liabilities, and operations of certain pre-IPO ownership entities. These transactions were accounted for as a reorganization of entities under common control utilizing historical cost basis.\nOn November 16, 2017, INVH and certain of its affiliates entered into a series of transactions with Starwood Waypoint Homes (“SWH”) and certain SWH affiliates which resulted in SWH and its operating partnership being merged into INVH and INVH LP, respectively, with INVH and INVH LP being the surviving entities. These transactions were accounted for as a business combination in accordance with ASC 805,\n Business Combinations\n, and INVH was designated as the accounting acquirer.\nThe limited partnership interests of INVH LP consist of common units and other classes of limited partnership interests that may be issued (the “OP Units”). As of December 31, 2024, INVH owns \n99.7\n% of the common OP Units and has the full, exclusive, and complete responsibility for and discretion over the day-to-day management and control of INVH LP.\nOur organizational structure includes several wholly owned subsidiaries of INVH LP that were formed to facilitate certain of our financing arrangements (the “Borrower Entities”). These Borrower Entities are used to align the ownership of our single-family residential properties with certain of our debt instruments. Collateral for certain of our individual debt instruments may be in the form of equity interests in the Borrower Entities or in pools of single-family residential properties owned either directly by the Borrower Entities or indirectly by their wholly owned subsidiaries (see Note 7).\nReferences to “Invitation Homes,” the “Company,” “we,” “our,” and “us” refer, collectively, to INVH, INVH LP, and the consolidated subsidiaries of INVH LP.\nNote 2—\nSignificant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States (“GAAP”) and with the rules and regulations of the Securities and Exchange Commission (“SEC”). These consolidated financial statements include the accounts of INVH and its consolidated subsidiaries. All intercompany accounts and transactions have been eliminated in the consolidated financial statements.\nWe consolidate wholly owned subsidiaries and entities we are otherwise able to control in accordance with GAAP. We evaluate each investment entity that is not wholly owned to determine whether to follow the variable interest entity (“VIE”) or the voting interest entity (“VOE”) model. Once the appropriate consolidation model is identified, we then evaluate whether the entity should be consolidated. Under the VIE model, we consolidate an investment if we have control to direct the activities of the entity and the obligation to absorb losses or the right to receive benefits that could potentially be significant to the VIE. Under the VOE model, we consolidate an investment if (1) we control the investment through ownership of a majority voting interest if the investment is not a limited partnership or (2) we control the investment through our ability to remove the other partners in the investment, at our discretion, when the investment is a limited partnership.\nF-9\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nBased on these evaluations, we account for each of the investments in joint ventures described in Note 5 using the equity method. Our initial investments in the joint ventures are recorded at cost, except for any such interest initially recorded at fair value in connection with a business combination. The investments in these joint ventures are subsequently adjusted for our proportionate share of net earnings or losses and other comprehensive income or loss, cash contributions made and distributions received, and other adjustments, as appropriate. Distributions of operating profit from the joint ventures are reported as part of operating activities while distributions related to a capital transaction, such as a refinancing transaction or sale, are reported as investing activities on our consolidated statements of cash flows. \nWhen events or circumstances indicate that our investments in unconsolidated joint ventures may not be recoverable, we assess the investments for and recognize other-than-temporary impairment.\nNon-controlling interests represent the OP Units not owned by INVH, including any OP Units resulting from vesting and conversion of units granted in connection with certain share-based compensation awards. Non-controlling interests are presented as a separate component of equity on the consolidated balance sheets as of December 31, 2024 and 2023, and the consolidated statements of operations for the years ended December 31, 2024, 2023, and 2022 include an allocation of the net income attributable to the non-controlling interest holders. OP Units are redeemable for shares of our common stock on a \none\n-for-one basis or, in our sole discretion, cash, and redemptions of OP Units are accounted for as a reduction in non-controlling interests with an offset to stockholders’ equity based on the pro rata number of OP Units redeemed.\nSignificant Risks and Uncertainties\nOur financial condition and results of operations are subject to risks related to overall fluctuating global and United States economic conditions (including inflation, elevated interest rates, political dissension, and labor shortfalls), uncertainty in financial markets (including as a result of events affecting financial institutions, such as bank failures), ongoing geopolitical tensions, and a general decline in business activity and/or consumer confidence. These factors could adversely affect (i) our occupancy levels, our rental rates, and collections, (ii) our ability to acquire or dispose of properties on economically favorable terms, (iii) our access to financial markets on attractive terms, or at all, and (iv)\n \nthe value of our homes and our business that could cause us to recognize impairments in value of our tangible assets or goodwill. Inflationary pressures, bank failures, and other unfavorable global and regional economic conditions, as well as geopolitical events, may also negatively impact consumer income, credit availability, interest rates, and spending, among other factors, which may adversely impact our business, financial condition, cash flows, and results of operations, including the ability of our residents to pay rent. These factors, which include labor shortages and inflationary increases in labor and material costs, have impacted and may continue to impact certain aspects of our business. In addition, consumer confidence and spending can be materially adversely affected in response to changes in fiscal and monetary policy, declines in income or asset values, and other macroeconomic factors.\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements, as well as the reported amounts of revenues and expenses during the reporting periods. These estimates are inherently subjective in nature and actual results could differ materially from those estimates.\nF-10\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nInvestments in Single-Family Residential Properties\nThe following significant accounting policies affect the acquisition, disposition, recognition, classification, and fair value measurements (on a nonrecurring basis) related to our owned portfolio of approximately \n85,000\n single-family residentia\nl properties located primarily in \n16\n core markets across the United States as of December 31, 2024:\n•\nAcquisition of Real Estate Assets:\n Upon acquisition, we evaluate our acquired single-family residential properties for purposes of determining whether a transaction should be accounted for as an asset acquisition or business combination. Our purchases of homes are treated as asset acquisitions and are recorded at their purchase price, which is allocated between land, building and improvements, and in-place lease intangibles (when a resident is in place at the acquisition date) based upon their relative fair values at the date of acquisition. The purchase price for purposes of this allocation is inclusive of acquisition costs which typically include legal fees, bidding service and title fees, payments made to cure tax, utility, homeowners’ association (“HOA”), and other mechanic’s and miscellaneous liens, as well as other closing costs. Properties acquired in a business combination are recorded at fair value. The fair values of acquired in-place lease intangibles, if any, are based on the costs to execute similar leases, including commissions and other related costs. The origination value of in-place lease intangibles also includes an estimate of lost rent revenue at in-place rental rates during the estimated time required to lease the property. In-place lease intangibles are amortized over the life of the leases and are recorded in other assets, net in our consolidated balance sheets.\n•\nCost Capitalization: \nWe incur costs to acquire, stabilize, and prepare our single-family residential properties to be leased. We capitalize these costs as a component of our investment in each single-family residential property, using specific identification and relative allocation methodologies, including renovation costs and other costs associated with activities that are directly related to preparing our properties for use as rental real estate. Other costs include interest costs, property taxes, property insurance, utilities, HOA fees, and a portion of the salaries and benefits of the Manager’s employees who are directly responsible for the execution of our stabilization activities. The capitalization period associated with our stabilization activities begins at the time that such activities commence and concludes at the time that a single-family residential property is available to be leased.\nOnce a property is ready for its intended use, expenditures for ordinary maintenance and repairs thereafter are expensed to operations as incurred, and we capitalize expenditures that improve or extend the life of a home, a portion of the salaries and benefits of the Manager’s employees who are directly responsible for such improvements, and for certain furniture and fixtures additions. The determination of which costs to capitalize requires significant judgment. Accordingly, many factors are considered as part of our evaluation processes with no one factor necessarily determinative.\n•\nDepreciation:\n Costs capitalized in connection with single-family residential property acquisitions, stabilization activities, and on an ongoing basis are depreciated over their estimated useful lives on a straight-line basis. The depreciation period commences upon the completion of stabilization-related activities or upon the completion of improvements made on an ongoing basis. For those costs capitalized in connection with residential property acquisitions and stabilization activities and those capitalized on an ongoing basis, the weighted average useful lives range from \n7\n to \n32\n years.\n•\nProvisions for Impairment: \nWe continuously evaluate, by property, whether there are any events or changes in circumstances indicating that the carrying amount of our single-family residential properties may not be recoverable. Examples of such events and changes in circumstances that we consider include significant and persistent declines in an individual property’s net operating income, regional changes in home price appreciation as measured by certain independently developed indices, change in expected use of the property, significant adverse legal factors, substantive damage to the individual property as a result of natural disasters and other risks inherent in our business not covered by insurance proceeds, or a current expectation that a property will be disposed of prior to the end of its estimated useful life.\nTo the extent an event or change in circumstance is identified, a residential property is considered to be impaired only if its carrying value cannot be recovered through estimated future undiscounted cash flows from the use and eventual disposition of the property. Cash flow projections are prepared using internal analyses based on current rental, renewal, and occupancy rates, operating expenses, and inputs from our annual planning process that give consideration to each property’s historical results, current operating trends, and current market conditions. To the \nF-11\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nextent an impairment has occurred, the carrying amount of our investment in a property is adjusted to its estimated fair value. To determine the estimated fair value, we utilize home price appreciation (“HPA”) indices, local broker price opinions (“BPOs”), and automated valuation model (“AVM”) data, each of which are important components of our process with no one information source being necessarily determinative. To validate the HPA indices, BPOs, and AVM data received and used in our assessment of fair value of real estate, we perform an internal review to determine if an acceptable valuation approach was used to estimate fair value in compliance with guidance provided by ASC 820, \nFair Value Measurements\n. Additionally, we undertake an internal review to assess the relevance and appropriateness of comparable transactions that have been used, and any adjustments to comparable transactions made, in reaching the value opinions.\nThe process whereby we assess our single-family residential properties for impairment requires significant judgment and assessment of factors that are, at times, subject to significant uncertainty. We evaluate multiple information sources and perform a number of internal analyses, each of which are important components of our process with no one information source or analysis being necessarily determinative.\n•\nSingle-Family Residential Properties Held for Sale:\n From time to time, we may identify single-family residential properties to be sold. At the time that any such properties are identified, we perform an evaluation to determine whether or not such properties should be classified as held for sale in accordance with GAAP. Factors considered as part of our held for sale evaluation process include whether the following conditions have been met: (i) we have committed to a plan to sell a property; (ii) the property is immediately available for sale in its present condition; (iii) an active program to locate a buyer and other actions required to complete the plan to sell a property have been initiated; (iv) the sale of a property is probable within one year (generally determined based upon listing for sale); (v) the property is being actively marketed for sale at a price that is reasonable in relation to its current fair value; and (vi) actions required to complete the plan indicate that it is unlikely that significant changes to the plan will be made or that the plan will be withdrawn. To the extent that these factors are all present, we cease depreciating the property, measure the property at the lower of its carrying amount or its fair value less estimated costs to sell, and present the property separately within other assets, net on our consolidated balance sheets.\n As of December 31, 2024 and 2023, we classified $\n49,434\n and $\n46,203\n, respectively, as held for sale assets in our consolidated balance sheets (see Note 6).\nCash and Cash Equivalents\nFor purposes of presentation on both the consolidated balance sheets and statements of cash flows, we consider financial instruments with an original maturity of three months or less to be cash and cash equivalents. We maintain our cash and cash equivalents in multiple financial institutions and, at times, these balances exceed federally insurable limits. As a result, there is a concentration of credit risk related to amounts on deposit. We believe any risks are mitigated through the size and the number of financial institutions at which our cash balances are held.\nRestricted Cash\nRestricted cash represents cash deposited in accounts related to certain rent deposits and collections, tax deferred property exchange deposits, security deposits, property taxes, insurance premiums and deductibles, and capital expenditures (see Note 4). Amounts deposited in the reserve accounts associated with the mortgage loans and the secured term loan can only be used as provided for in the respective loan agreements (see Note 7), and security deposits held pursuant to lease agreements are required to be segregated.\n Accordingly, these items are separately presented within our consolidated balance sheets.\nInvestments in Debt Securities, net\nInvestments in debt securities that we have a positive intent and ability to hold to maturity are classified as held to maturity and are presented within other assets, net on our consolidated balance sheets (see Note 6). These investments are recorded at amortized cost net of the amount expected not to be collected. Interest income, including amortization of any premium or discount, is classified as other, net in the consolidated statements of operations. For purposes of classification within the consolidated statements of cash flows, purchases of and repayments from these securities are classified as investing activities.\nF-12\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nInvestments in Equity Securities\nInvestments in equity securities consist of investments both with and without a readily determinable fair value. These are presented within other assets, net on our consolidated balance sheets (see Note 6). Investments with a readily determinable fair value are measured at fair value. Investments without a readily determinable fair value are measured at cost, less any impairment, plus or minus changes resulting from observable price changes for identical or similar investment in the same issuer. Any such unrealized gains and losses and impairments are included in gains (losses) on investments in equity securities, net in the consolidated statements of operations.\nAmounts Deposited and Held by Others\nAmounts deposited and held by others consist of earnest money deposits for the acquisition of single-family residential properties, including deposits made to homebuilders, and amounts owed to us from title companies in connection with the disposition of homes.\n These are presented within other assets, ne\nt on our consolidated balance sheets\n (see Note 6).\nDeferred Financing Costs\nCosts incurred that are directly attributable to procuring external financing are deferred and amortized over the term of the related financing agreement as interest expense in the consolidated statements of operations, and we accelerate amortization if the debt is retired before the maturity date, as appropriate.\n Costs that are deferred for the procurement of such financing are presented either as an asset in other assets, net when associated with a revolving debt instrument and prior to funding of a loan or as a component of the liability for the related financing agreement.\nConvertible Senior Notes\nAccounting Standards Codification (“ASC”) 470-20, \nDebt with Conversion and Other Options\n, requires that the liability and equity components of convertible debt instruments that may be settled in cash upon conversion, including partial cash settlement, be separately accounted for in a manner that reflects the issuer’s nonconvertible debt borrowing rate. The initial proceeds from the issuance of convertible notes are allocated between a liability component and an equity component in a manner that reflects interest expense at the rate of similar nonconvertible debt that could have been issued at such time. The equity component represents the excess initial proceeds received over the fair value of the liability component of the notes as of the date of issuance. We measure the fair value of the debt component of our convertible senior notes as of the issuance date based on our nonconvertible debt borrowing rate. In connection with the SWH merger, we assumed convertible senior notes that were recorded at their estimated fair value based on our nonconvertible debt borrowing rate, and all remaining amounts outstanding pursuant to these debt instruments were fully converted into shares of our common stock in January 2022. The resulting discount from the outstanding principal balance of the convertible senior notes was amortized using the effective interest rate method over the periods to maturity. Amortization of this discount was recorded as interest expense in the consolidated statement of operations for the \nyear ended December 31, 2022\n.\nRevenue Recognition and Resident Receivables\nRental revenues and other property income, net of any concessions and uncollectible amounts, consists primarily of rents collected under lease agreements related to our single-family residential properties. We enter into leases directly with our residents, and our leases typically have a term of \none\n to \ntwo years\n. As a lessor, our leases with residents are classified as operating leases under ASC 842, \nLeases\n, (“ASC 842”). We elected the practical expedient in ASC 842 not to separate the lease and nonlease components of these operating leases with our residents. Our lease components consist primarily of rental income, pet rent, and value-add services such as smart home system fees. Nonlease components include resident reimbursements for utilities and various other fees, including late fees and lease termination fees, among others. The lease component is the predominant component in these arrangements, and as such, we recognize rental revenues and other property income in accordance with ASC 842.\nVariable lease payments consist of resident reimbursements for utilities and various other fees, including late fees and lease termination fees, among others. Variable lease payments are charged based on the terms and conditions included in the resident leases. Sales taxes and other similar taxes assessed by governmental authorities that we collect from residents are excluded from our rental revenues and other property income.\nF-13\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nManagement fee revenues consist of fees from property and asset management services provided to portfolio owners of single-family homes for lease, including investments in our unconsolidated joint ventures. O\nur services include resident support, maintenance, marketing, administrative, and asset management functions. \nManagement fee revenues are recognized as performance obligations are satisfied in accordance with the underlying agreements, and the performance obligation is the management of the homes, entities, or other defined tasks. While the performance obligations associated with base management fees can vary from day to day, the nature of the overall performance obligation to provide management services is the same and considered by us to be a series of services that have the same pattern of transfer to the customer and the same method to measure progress toward satisfaction of the performance obligation.\nLeases Entered Into as a Lessee\nWe lease our corporate and regional offices, related office equipment, and a fleet of vehicles for use by our field associates and account for each as either an operating or finance lease pursuant to ASC 842 (see Note 6 and Note 14). Specifically, we account for leases for our corporate and regional offices as operating leases. In addition to monthly rent payments, we reimburse the lessors of our office spaces for our share of operating expenses as defined in the leases. Such amounts are not included in the measurement of the lease liability but are recognized as a variable lease expense when incurred. At this time, it is not reasonably certain that we will exercise any of the future renewal or termination options on these leases, and the measurement of the right-of-use\n (“ROU”)\n asset and lease liability is calculated assuming we will not exercise any of the remaining renewal or termination options.\nWe have elected the practical expedient under which the lease components of our office and vehicle fleet leases are not separated from the nonlease components. \nROU \nassets and lease liabilities are recognized based on the present value of lease payments over the lease term at commencement date. We use our incremental borrowing rate to calculate the present value of our lease payments.\nWe have elected the short-term lease recognition exemption for our office equipment leases and therefore do not record these leases on our consolidated balance sheets. These office equipment leases are not material to our consolidated financial statements.\nGoodwill\nGoodwill incurred in connection with a business combination is not amortized as it has an indefinite life. We test goodwill for impairment annually, on October 31st, or more frequently if circumstances indicate that the goodwill carrying value may exceed its fair value. As of \nDecember 31, 2024\n, \nno\n impairment of goodwill has been recorded.\nFair Value Measurements\nThe fair value of a financial instrument is the amount at which the instrument could be exchanged in an orderly transaction between two willing parties. This amount is determined based on an exit price approach, which contemplates the price that would be received to sell an asset (or paid to transfer a liability) in an orderly transaction between market participants at the measurement date. GAAP has established a valuation hierarchy based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date. A financial instrument’s categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement. The three levels are defined as follows:\nLevel 1—Inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets;\nLevel 2—Inputs to the valuation methodology include quoted prices for similar assets or liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument; and\nLevel 3—Inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nSee Note 11 for further information related to our fair value measurements.\nF-14\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nEarnings Per Share\nWe present both basic and diluted earnings (loss) per common share (“EPS”) in our consolidated financial statements. Basic EPS excludes dilution and is computed by dividing net income (loss) available to common stockholders for the period by the weighted average number of shares of common stock outstanding for the period, excluding non-vested share-based awards. Our share-based awards consist of restricted stock units (“RSUs”), including certain RSUs that contain performance and market based vesting conditions (“PRSUs”), and Outperformance Awards (as defined in Note 10) (see \nShare-Based Compensation Expense\n below). Diluted EPS reflects the maximum potential dilution that could occur from non-vested share-based awards. For diluted EPS, the numerator is adjusted for any changes in net income (loss) that would result from the assumed conversion of these potential shares of common stock. Potential dilutive shares are excluded from the calculation if they have an anti-dilutive effect in the period.\nAll outstanding non-vested share-based awards with nonforfeitable rights to dividends or dividend equivalents that participate in undistributed earnings with common stock are considered participating securities, as identified in Note 10. As such, the two-class method of computing EPS is required, unless another method is determined to be more dilutive. The two-class method is an earnings allocation formula that determines EPS for each class of common stock and participating securities according to dividends or dividend equivalents and participation rights in undistributed earnings in periods when we have net income.\nDerivatives\nWe enter into interest rate swap and interest rate cap agreements (collectively, “Hedging Derivatives”) for interest rate risk management purposes. We do not enter into Hedging Derivatives for trading or other speculative purposes, and all of our Hedging Derivatives are carried at fair value in our consolidated balance sheets. Designated hedges are derivatives that meet the criteria for hedge accounting and that we have elected to designate as hedges. Non-designated hedges are derivatives that do not meet the criteria for hedge accounting or that we have not elected to designate as hedges.\nPursuant to the terms of certain of our mortgage loans, we were required to maintain interest rate caps. Additionally, in certain instances, in order to minimize the cash impact of purchasing required interest rate caps, we simultaneously sell interest rate caps (which have identical terms and notional amounts) such that the purchase price and sale proceeds of the related interest rate caps are intended to offset each other. We elected not to designate these interest cap agreements for hedge accounting (collectively, the “Non-Designated Hedges”). We enter into interest rate swap agreements to hedge the risk arising from changes in our interest payments on variable-rate debt due to changes in the one month Secured Overnight Financing Rate (“SOFR”), which replaced the London Interbank Offer Rate (“LIBOR”) beginning in July 2023. All of our debt instruments and swap agreements are currently indexed to one month SOFR. We have elected to account for our interest rate swap agreements as effective cash flow hedges (collectively, the “Designated Hedges”). We assess the effectiveness of these interest rate swap cash flow hedging relationships on an ongoing basis. The effect of these interest rate cap agreements and interest rate swap agreements is to reduce the variability of interest payments due to changes in SOFR.\nThe fair value of Hedging Derivatives that are in an asset position are included in other assets, net and those in a liability position are included in other liabilities in our consolidated balance sheets. For Non-Designated Hedges, changes in fair value are reflected within interest expense in the consolidated statements of operations. For Designated Hedges, changes in fair value are reported as a component of other comprehensive income (loss) in our consolidated balance sheets and reclassified into earnings as interest expense in our consolidated statements of operations when the hedged transactions affect earnings. See Note 8 for further discussion of derivative financial instruments.\nShare-Based Compensation Expense\nWe recognize share-based compensation expense for share-based awards based on their grant-date fair value, net of expected forfeitures, over the service period from the grant date to vest date for each tranche. The grant-date fair value of RSUs and PRSUs with performance condition vesting criteria are generally based on the closing price of our common stock on the grant date. However, the grant-date fair values for PRSUs and Outperformance Awards with market condition vesting criteria are based on Monte-Carlo option pricing models. Compensation expense for share-based awards with performance conditions is adjusted based on the probable outcome of the performance conditions as of each reporting period.\nAdditional compensation expense is recognized if modifications to existing share-based award agreements result in an increase in the post-modification fair value of the units that exceeds their pre-modification fair value. Share-based compensation expense is presented as components of general and administrative expense and property management expense in our consolidated statements of operations. See Note 10 for further discussion of share-based compensation expense.\nF-15\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nIncome Taxes\nWe have elected to be treated as a REIT pursuant to Section 856(c) of the Internal Revenue Code of 1986, as amended (the “Code”). Our qualification as a REIT depends on our ability to meet the various requirements imposed by the Code, which are related to organizational structure, distribution levels, diversity of stock ownership, and certain restrictions with regard to owned assets and categories of income. As a REIT, we are generally not subject to United States federal corporate income tax on our taxable income that is currently distributed to stockholders. However, if we fail to qualify as a REIT in any taxable year, our taxable income could be subject to United States federal and state and local income taxes at regular corporate rates. \nEven if we qualify as a REIT, we may be subject to certain state and local income taxes as well as United States federal income and excise taxes in various situations, such as on our undistributed income. In addition, taxable income from non-REIT activities managed through taxable REIT subsidiaries (“TRSs”) is subject to federal, state, and local income taxes. A TRS is a subsidiary C corporation that has not elected REIT status and as such is subject to United States federal and state corporate income tax. We use TRS entities to facilitate our ability to perform non-real estate related activities and/or perform non-customary services for residents that cannot be offered directly by a REIT.\nFor our TRS entities, deferred income taxes result from temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for United States federal income tax purposes and are measured using the enacted tax rates and laws that are expected to be in effect when the differences reverse. We reduce deferred tax assets by recording a valuation allowance when we determine, based on available evidence, that it is more likely than not that the assets will not be realized. We recognize the tax consequences associated with intercompany transfers between the REIT and TRS entities when the related assets affect our net income or loss, generally through depreciation, impairment losses, or sales to third-party entities.\nTax benefits associated with uncertain tax positions are recognized only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position.\nOur federal and various state and local jurisdiction tax filings are subject to normal reviews by regulatory agencies until the related statute of limitations expires. The years open to examination generally range from 2021 to present.\nSegment Reporting\nOur principal business is acquiring, renovating, leasing, operating, and managing single-family residential properties. Under the provisions of ASC 280, \nSegment Reporting\n, we have determined that we currently operate in \none\n reportable segment. For more information about our single reportable segment, see Note 15.\n \nRecently Adopted Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, \nwhich expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. The updated standard is effective for annual reporting periods beginning after December 15, 2023 and interim periods beginning after December 15, 2024. We have applied this updated standard within our consolidated financial statements and have updated our segment disclosures accordingly (see Note 15).\nRecent Accounting Pronouncements\nIn August 2023, the FASB issued Accounting Standards Update ASU 2023-05, \nBusiness Combinations (Subtopic 805-60): Joint Venture Formations, \nwhich clarifies the business combination accounting for joint venture formations. The ASU is intended to reduce diversity in practice that has resulted from a lack of authoritative guidance regarding the accounting for the formation of joint ventures in separate financial statements. The ASU also seeks to clarify the initial measurement of joint venture net assets, including businesses contributed to a joint venture. The updated standard is effective for all joint venture formations with a formation date on or after January 1, 2025. Retrospective application of the amendments is permitted. We will apply the guidance in this ASU to any joint ventures formed after January 1, 2025.\nF-16\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures,\n which enhances the transparency and effectiveness of income tax disclosures. The updated standard is effective for annual reporting periods beginning after December 15, 2024, and interim periods beginning after December 15, 2025, with early adoption permitted. We are currently evaluating the impact of this ASU on our consolidated financial statements and disclosures. \nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement — Reporting Comprehensive Income (Subtopic 220-40): Expense Disaggregation Disclosures,\n which requires public business entities to provide detailed disclosures in the notes to the consolidated financial statements disaggregating specific expense categories, including employee compensation, depreciation, and intangible asset amortization, as well as certain other disclosures to provide enhanced transparency into the nature and function of expenses. This new guidance is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027, with early adoption permitted. We are currently evaluating the impact of this ASU on our consolidated financial statements and disclosures.\nRecent SEC Rules\nIn March 2024, the SEC adopted the final rule under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate-Related Disclosures for Investors\n. \nThis rule will require registrants to disclose certain climate-related information in registration statements and annual reports. In April\n \n2024, the SEC issued an order voluntarily staying the effectiveness of the new rules pending the completion of judicial review of certain legal challenges to their validity. On February 11, 2025, SEC Acting Chairman Mark T. Uyeda released a public statement and notified the United States Court of Appeals for the Eighth Circuit (where the challenges are consolidated) to hold off scheduling the case for argument to provide time for the SEC to further deliberate and determine next steps. Therefore, the timing of the effectiveness of these disclosure requirements is uncertain. We are currently assessing the effect of new rules on our consolidated financial statements and related disclosures.\nNote 3—\nInvestments in Single-Family Residential Properties\nThe following table sets forth the net carrying amount associated with our properties by component:\nDecember 31,\n2024\nDecember 31, 2023\nLand\n$\n4,901,192\n \n$\n4,881,890\n \nSingle-family residential property\n16,470,468\n \n15,977,256\n \nCapital improvements\n575,982\n \n565,214\n \nEquipment\n133,858\n \n127,536\n \nTotal gross investments in the properties\n22,081,500\n \n21,551,896\n \nLess: accumulated depreciation\n(\n4,869,374\n)\n(\n4,262,682\n)\nInvestments in single-family residential properties, net\n$\n17,212,126\n \n$\n17,289,214\n \n \nAs of December 31, 2024 and 2023, the carrying amount of the residential properties above includes $\n140,202\n and $\n135,004\n, respectively, of capitalized acquisition costs (excluding purchase price), along with $\n78,776\n and $\n78,073\n, respectively, of capitalized interest, $\n31,718\n and $\n30,531\n, respectively, of capitalized property taxes, $\n5,202\n and $\n5,037\n, respectively, of capitalized insurance, and $\n3,745\n and $\n3,691\n, respectively, of capitalized HOA fees.\nDuring the years ended December 31, 2024, 2023, and 2022, we recognized $\n699,474\n, $\n663,398\n, and $\n629,301\n, respectively, of depreciation expense related to the components of the properties, and $\n14,852\n, $\n10,889\n, and $\n8,813\n, respectively, of depreciation and amortization related to corporate furniture and equipment. These amounts are included in depreciation and amortization in the consolidated statements of operations. Further, during the years ended December 31, 2024, 2023, and 2022, impairments totaling $\n506\n, $\n427\n, and $\n310\n, respectively, have been recognized and are included in casualty losses, impairment, and other in the consolidated statements of operations. See Note 11 for additional information regarding these impairments.\nF-17\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nNote 4—\nCash, Cash Equivalents, and Restricted Cash\nThe following table provides a reconciliation of cash, cash equivalents, and restricted cash reported on the consolidated balance sheets that sum to the total of such amounts shown in the consolidated statements of cash flows:\nDecember 31,\n2024\nDecember 31, 2023\nCash and cash equivalents\n$\n174,491\n \n$\n700,618\n \nRestricted cash\n245,202\n \n196,866\n \nTotal cash, cash equivalents, and restricted cash shown in the consolidated statements of cash flows\n$\n419,693\n \n$\n897,484\n \n \nPursuant to the terms of the mortgage loans and the Secured Term Loan (as defined in Note 7), we are required to establish, maintain, and fund from time to time (generally, either monthly or at the time borrowings are funded) certain specified reserve accounts. These reserve accounts include, but are not limited to, the following types of accounts: (i) property tax reserves; (ii) insurance reserves; (iii) capital expenditure reserves; and (iv) HOA reserves. The reserve accounts associated with our mortgage loans and Secured Term Loan are under the sole control of the loan servicer. Additionally, we hold security deposits pursuant to resident lease agreements that we are required to segregate. We also hold deposits for certain tax deferred property exchange transactions and letters of credit required by certain of our insurance policies, for which the use of each are restricted. Accordingly, amounts funded to these reserve accounts, security deposit accounts, and other restricted accounts have been classified on our consolidated balance sheets as restricted cash.\nThe amounts funded, and to be funded, to the reserve accounts are subject to formulae included in the mortgage loan and Secured Term Loan agreements and are to be released to us subject to certain conditions specified in the loan agreements being met. To the extent that an event of default were to occur, the loan servicer has discretion to use such funds to either settle the applicable operating expenses to which such reserves relate or reduce the allocated loan amount associated with a residential property of ours.\nThe balances of our restricted cash accounts are set forth in the table below. As of December 31, 2024 and 2023, no amounts were funded to the insurance accounts as the conditions specified in the mortgage loan and Secured Term Loan agreements that require such funding did not exist.\nDecember 31,\n2024\nDecember 31, 2023\nResident security deposits\n$\n181,549\n \n$\n181,097\n \nTax deferred property exchange deposits\n47,551\n \n—\n \nProperty taxes\n4,343\n \n2,014\n \nCollections\n7,365\n \n8,278\n \nLetters of credit\n2,495\n \n2,489\n \nCapital expenditures\n1,623\n \n2,297\n \nSpecial and other reserves\n276\n \n691\n \nTotal\n$\n245,202\n \n$\n196,866\n \n \nF-18\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nNote 5—\nInvestments In Unconsolidated Joint Ventures\nThe following table summarizes our investments in unconsolidated joint ventures, which are accounted for using the equity method model of accounting, as of December 31, 2024 and 2023:\nNumber of Properties Owned\nCarrying Value\nOwnership Percentage\nDecember 31,\n2024\nDecember 31, 2023\nDecember 31,\n2024\nDecember 31, 2023\nPathway Property Company\n(1)\n100.0\n%\n590\n504\n$\n102,520\n \n$\n120,639\n \n2020 Rockpoint JV\n(1)\n20.0\n%\n2,606\n2,609\n44,846\n \n62,578\n \nUpward America JV\n(2)\n7.2\n%\n3,720\nN/A\n37,809\n \n—\n \nFNMA\n(3)\n10.0\n%\n387\n426\n22,072\n \n32,303\nPathway Operating Company\n(4)\n15.0\n%\nN/A\nN/A\n20,706\n21,008\n \n2022 Rockpoint JV\n(1)\n16.7\n%\n319\n309\n10,426\n \n10,638\n \n2024 Peregrine JV\n(5)\n30.0\n%\nN/A\nN/A\n3,226\n \n—\n \nTotal\n$\n241,605\n \n$\n247,166\n \n(1)\nOwns homes in markets within the Western United States, Southeast United States, Florida, and Texas.\n(2)\nOwns homes in markets within the Southeast United States, Florida, Minnesota, Tennessee, and Texas.\n(3)\nOwns homes within the Western United States.\n(4)\nRepresents an investment in an operating company that provides a technology platform and asset management services.\n(5)\nRepresents an investment in a joint venture that will invest in newly-constructed homes and communities.\nEach joint venture was initially capitalized with equity investments. Certain of the joint ventures subsequently entered into financing arrangements, and we have guaranteed the funding of certain, tax, insurance, and non-conforming property reserves related to the financing of one of the joint ventures. Total remaining equity commitments for our investments in unconsolidated joint ventures are $\n176,950\n as of December 31, 2024.\nIn some cases, responsibility for management and operations of the individual joint venture is vested with our joint venture partner or their affiliates. For other joint ventures, a wholly owned subsidiary of INVH LP functions as an administrative member responsible for management and operations of the individual joint venture, subject to the joint venture partner’s approval of major decisions. Accordingly, we do not have a controlling interest in any of our joint ventures, and they are accounted for using the equity method of accounting.\nWe recorded net losses from these investments for the years ended December 31, 2024, 2023, and 2022, totaling $\n28,445\n, $\n17,877\n, and $\n9,606\n, respectively, which are included in losses from investments in unconsolidated joint ventures in the consolidated statements of operations.\nWe earn property and/or asset management fees from each of the joint ventures (except the Pathway Operating Company investment), and these fees are related party transactions. For the years ended December 31, 2024, 2023, and 2022, we earned $\n18,222\n, $\n13,647\n, and $\n11,480\n, respectively, of management fees from these related parties which are included in management fee revenues in the consolidated statements of operations. As of December 31, 2024 and 2023, management fee receivables from our related parties totaled $\n1,952\n and $\n1,159\n, respectively. (See Note 6 for additional information regarding total management fee revenues.)\nF-19\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nNote 6—\nOther Assets\nAs of December 31, 2024 and 2023, the balances in other assets, net are as follows:\nDecember 31,\n2024\nDecember 31, 2023\nAmounts deposited and held by others\n$\n93,965\n \n$\n92,151\n \nDerivative instruments (Note 8)\n61,479\n \n75,488\n \nRent and other receivables, net\n61,235\n \n60,810\n \nInvestments in equity and other securities\n60,120\n \n55,991\n \nInvestments in debt securities, net\n54,619\n \n86,471\n \nPrepaid expenses\n49,877\n \n47,770\n \nHeld for sale assets\n(1)\n49,434\n \n46,203\n \nCorporate fixed assets, net\n42,704\n \n31,474\n \nROU lease assets — operating and finance, net\n28,830\n \n13,532\n \nDeferred financing costs, net\n23,579\n \n2,972\n \nOther\n43,478\n \n16,034\n \nTotal\n$\n569,320\n \n$\n528,896\n \n(1)\nAs of December 31, 2024 and 2023, \n237\n and \n189\n properties, respectively, are classified as held for sale.\nRent and Other Receivables, net\nWe lease our properties to residents pursuant to leases that generally have an initial contractual term of at least \n12\n months, provide for monthly payments, and are cancelable by the resident and us under certain conditions specified in the related lease agreements. Rental revenues and other property income and the corresponding rent and other receivables are recorded net of any concessions and bad debt (including actual write-offs, credit reserves, and uncollectible amounts) for all periods presented.\nVariable lease payments consist of resident reimbursements for utilities, and various other fees, including late fees and lease termination fees, among others. Variable lease payments are charged based on the terms and conditions included in the resident\n leases. For th\ne years ended December 31, 2024, 2023, and 2022\n, rental revenues and other property income includes $\n163,700\n, \n$\n153,016\n, and $\n139,829\n of variable lease payments, respectively.\nFuture minimum rental revenues and other property income under leases on our single-family residential properties in place as of December 31, 2024 are as follows:\nYear\nLease Payments \nto be Received\n2025\n$\n1,487,130\n \n2026\n249,553\n \n2027\n—\n \n2028\n—\n \n2029\n—\n \nThereafter\n—\n \nTotal\n$\n1,736,683\n \nF-20\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nManagement fee revenues and the corresponding receivables are related to property and asset management services provided to portfolio owners of single-family homes for lease, including investments in our unconsolidated joint ventures (see Note 5). As of December 31, 2024, 2023, and 2022, we provided property and asset management services for \n25,300\n, \n3,848\n, and \n3,570\n homes, respectively, of which \n7,622\n, \n3,848\n, and \n3,570\n homes, respectively, were owned by our unconsolidated joint ventures. For the years ended December 31, 2024, 2023, and 2022, we earned management fees totaling $\n69,978\n, $\n13,647\n, and $\n11,480\n, respectively. These revenues are included in management fee revenues in the consolidated statements of operations.\nInvestments in Equity and Other Securities \nWe hold investments in equity and other securities both with and without a readily determinable fair value. Investments with a readily determinable fair value are measured at fair value, and those without a readily determinable fair value are measured at cost, less any impairment, plus or minus changes resulting from observable price changes for identical or similar investments in the same issuer. \nAs of December 31, 2024 and 2023, the values of our investments in equity and other securities are as follows:\n \nDecember 31,\n2024\nDecember 31, 2023\nInvestments without a readily determinable fair value\n$\n59,405\n \n$\n54,686\n \nInvestments with a readily determinable fair value\n715\n \n1,305\n \nTotal\n$\n60,120\n \n$\n55,991\n \nThe components of gains (losses) on investments in equity and other securities, net for the years ended December 31, 2024, 2023, and 2022 are as follows:\n \nFor the Years Ended December 31,\n2024\n2023\n2022\nNet gains (losses) recognized on investments sold during the reporting period\n$\n1,635\n \n$\n—\n \n$\n(\n1,452\n)\nNet unrealized gains (losses) on investments still held at the reporting date — with a readily determinable fair value\n(\n589\n)\n350\n \n(\n2,487\n)\nTotal \n$\n1,046\n \n$\n350\n \n$\n(\n3,939\n)\nInvestments in Debt Securities, net\nIn connection with certain of our Securitizations (as defined in Note 7), we have retained and purchased certificates totaling $\n54,619\n, net of unamortized discounts of $\n880\n as of December 31, 2024. These investments in debt securities are classified as held to maturity investments. As of December 31, 2024, we have not recognized any credit losses with respect to these investments in debt securities, and our retained certificates are scheduled to mature in \ntwo years\n.\nROU \nLease Assets — Operating and Finance, net\nThe following table presents supplemental information related to leases into which we have entered as a lessee as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\nOperating\nLeases\nFinance\nLeases\nOperating\nLeases\nFinance\nLeases\nOther assets\n$\n19,772\n \n$\n9,058\n \n$\n9,236\n \n$\n4,296\n \nOther liabilities (Note 14)\n21,904\n \n8,636\n \n11,097\n \n3,796\n \nWeighted average remaining lease term\n7.6\n years\n3.1\n years\n3.3\n years\n2.9\n years\nWeighted average discount rate\n5.6\n%\n6.0\n%\n3.6\n%\n5.2\n%\nF-21\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nDeferred Financing Costs, net\nIn connection with the new Revolving Facility (as defined in Note 7), we incurred $\n25,567\n of financing costs, which have been deferred as other assets, net on our consolidated balance sheets. We amortize deferred financing costs as interest expense on a straight-line basis over the term of the Revolving Facility and accelerate amortization if debt is retired before the maturity date, as appropriate. The deferred financing costs as of December 31, 2023 were incurred in connection with a previous revolving facility that was replaced by the new Revolving Facility during the third quarter of 2024 (see Note 7). As of December 31, 2024 and 2023, the unamortized balances of these deferred financing costs are $\n23,579\n and $\n2,972\n, respectively.\nOther\nOther is primarily comprised of deferred costs related to property and asset management contracts that are being amortized over the estimated lives of the underlying contracts and other deferred costs, including those that will be capitalized as corporate fixed assets upon deployment of the software.\nNote 7—\nDebt\nMortgage Loans\nOur securitization transactions (the “Securitizations” or the “mortgage loans”) are collateralized by certain homes owned by the respective Borrower Entities. We utilize the proceeds from our Securitizations to fund: (i) repayments of then-outstanding indebtedness; (ii) initial deposits into Securitization reserve accounts; (iii) closing costs in connection with the mortgage loans; and (iv) general costs associated with our operations.\nThe following table sets forth a summary of our mortgage loan indebtedness as of December 31, 2024 and 2023:\nOutstanding Principal\nBalance\n(1)\nOrigination\nDate\nMaturity\nDate\nInterest\nRate\n(2)\nDecember 31,\n2024\nDecember 31, 2023\nIH 2017-1\n(3)\nApril 28,\n2017\nJune 9,\n2027\n4.23\n%\n$\n988,271\n \n$\n990,555\n \nIH 2018-4\n(4)\nNovember 7,\n2018\nNovember 8,\n2024\nN/A\n—\n \n643,030\n \nTotal Securitizations\n988,271\n \n1,633,585\n \nLess: deferred financing costs, net \n(\n4,347\n)\n(\n6,329\n)\nTotal \n$\n983,924\n \n$\n1,627,256\n \n(1)\nOutstanding principal balance is net of discounts and does not include deferred financing costs, net.\n(2)\nIH 2017-1 bears interest at a fixed rate of \n4.23\n% per annum, equal to the market determined pass-through rate payable on the certificates including applicable servicing fees. The interest rate for IH 2018-4 was based on a weighted average spread over a published forward-looking SOFR for the interest period relevant to such borrowing (“Term SOFR”) adjusted for an \n0.11\n% credit spread adjustment. \n(3)\nNet of unamortized discount of $\n880\n and $\n1,232\n as of December 31, 2024 and 2023, respectively.\n(4)\nMaturity date represents repayment date.\nSecuritization Transactions\nIH 2017-1 is a \n10\n year, fixed rate mortgage loan comprised of \ntwo\n components, and Component A of IH 2017-1 benefits from the Federal National Mortgage Association’s guaranty of timely payment of principal and interest.\nEach mortgage loan is secured by a pledge of the equity in the assets of the respective Borrower Entities, as well as first-priority mortgages on the underlying properties and a grant of security interests in all of the related personal property. As of December 31, 2024 and 2023, a total of \n5,592\n and \n10,581\n homes, respectively, with a gross book value of $\n1,054,239\n and $\n2,348,044\n, respectively, and a net book value of $\n687,487\n and $\n1,779,169\n, respectively, are pledged pursuant to the \nF-22\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nmortgage loans. Each Borrower Entity has the right, subject to certain requirements and limitations outlined in the respective loan agreements, to substitute properties. We are obligated to make monthly payments of interest for each mortgage loan.\nTransactions with Trusts\nConcurrent with the execution of each mortgage loan agreement, the respective third-party lender sold each loan it originated to individual depositor entities, which are wholly owned subsidiaries, who subsequently transferred each loan to Securitization-specific trust entities (the “Trusts”). We accounted for the transfers of the individual Securitizations as sales under ASC 860, \nTransfers and Servicing\n, with no resulting gain or loss as the Securitizations were both originated by the lender and immediately transferred at the same fair market value.\nThese transactions had no effect on our consolidated financial statements other than with respect to certificates issued by the Trusts (collectively, the “Certificates”) that we retained in connection with Securitizations or purchased at a later date.\nThe Trusts are structured as pass-through entities that receive interest payments from the Securitizations and distribute those payments to the holders of the Certificates. The assets held by the Trusts are restricted and can only be used to fulfill the obligations of those entities. The obligations of the Trusts do not have any recourse to the general credit of any entities in these consolidated financial statements. We have evaluated our interests in certain certificates of the Trusts held by us and determined that they do not create a more than insignificant variable interest in the Trusts.\nAs the Trusts made Certificates available for sale to both domestic and foreign investors, sponsors of the mortgage loans are required to retain a portion of the risk that represents a material net economic interest in each loan pursuant to Regulation RR (the “Risk Retention Rules”) under the Securities Exchange Act of 1934, as amended. As loan sponsors, we are thus required to retain a portion of the credit risk that represents not less than \n5\n% of the aggregate fair value of the loan as of the closing date. Accordingly, we have retained the restricted Class B Certificates issued by IH 2017-1, which bear a stated annual interest rate of \n4.23\n% (including applicable servicing fees), that were made available exclusively to INVH LP to comply with the Risk Retention Rules.\nFor IH 2018-4, we retained \n5\n% of each class of certificates to meet the Risk Retention Rules. These retained certificates accrued interest at a floating rate of Term SOFR plus a spread ranging from \n1.15\n% to \n1.45\n%.\nThe retained certificates, net of discount, total $\n54,619\n and $\n86,471\n as of December 31, 2024 and 2023, respectively, and are classified as held to maturity investments and recorded in other assets, net on the consolidated balance sheets (see Note 6).\nLoan Covenants\nThe general terms that apply to all of the mortgage loans require each Borrower Entity to maintain compliance with certain affirmative and negative covenants. Affirmative covenants include each Borrower Entity’s, and certain of their respective affiliates’, compliance with (i) licensing, permitting, and legal requirements specified in the mortgage loan agreements, (ii) organizational requirements of the jurisdictions in which they are organized, (iii) federal and state tax laws, and (iv) books and records requirements specified in the respective mortgage loan agreements. Negative covenants include each Borrower Entity’s, and certain of their affiliates’, compliance with limitations surrounding (i) the amount of each Borrower Entity’s indebtedness and the nature of their investments, (ii) the execution of transactions with affiliates, (iii) the Manager, (iv) the nature of each Borrower Entity’s business activities, and (v) the required maintenance of specified cash reserves.\nF-23\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nPrepayments\nFor the mortgage loans, prepayments of amounts owed by us are generally not permitted under the terms of the respective mortgage loan agreements unless such prepayments are made pursuant to the voluntary election or mandatory provisions specified in such agreements. The specified mandatory provisions become effective to the extent that a property becomes characterized as a disqualified property, a property is sold, and/or upon the occurrence of a condemnation or casualty event associated with a property. To the extent either a voluntary election is made, or a mandatory prepayment condition exists, in addition to paying all interest and principal, we must also pay certain breakage costs as determined by the loan servicer and a spread maintenance premium if prepayment occurs before the month following the one or two year anniversary of the closing dates of each of the mortgage loans except for IH 2017-1. For IH 2017-1, prepayments on or before December 2026 will require a yield maintenance premium. For the years ended December 31, 2024, 2023, and 2022, we made voluntary and mandatory prepayments of $\n645,666\n, $\n20,491\n, and $\n1,412,249\n, respectively, under the terms of the mortgage loan agreements. For the year ended December 31, 2024, prepayments included the full repayment of the IH 2018-4 mortgage loan. For the year ended December 31, 2022, prepayments included the full repayment of the IH 2018-1, IH 2018-2, and IH 2018-3 mortgage loans.\nSecured Term Loan\nOn June 7, 2019, 2019-1 IH Borrower LP, a consolidated subsidiary (“2019-1 IH Borrower” and one of our Borrower Entities), entered into a \n12\n year loan agreement with a life insurance company (the “Secured Term Loan”). The Secured Term Loan bears interest at a fixed rate of \n3.59\n%, including applicable servicing fees, for the first \n11\n years and bears interest at a floating rate based on a spread of \n147\n bps, including applicable servicing fees, over a comparable or successor rate to one month LIBOR for the twelfth year as provided for in our loan agreement (subject to certain adjustments as outlined in the loan agreement). The Secured Term Loan is secured by first priority mortgages on a portfolio of single-family rental properties as well as a first priority pledge of the equity interests of 2019-1 IH Borrower. We utilized the proceeds from the Secured Term Loan to fund: (i) repayments of then-outstanding indebtedness; (ii) initial deposits into the Secured Term Loan’s reserve accounts; (iii) transaction costs related to the closing of the Secured Term Loan; and (iv) general corporate purposes.\nThe following table sets forth a summary of our Secured Term Loan indebtedness as of December 31, 2024 and 2023:\nMaturity\nDate\nInterest\nRate\n(1)\nDecember 31,\n2024\nDecember 31, 2023\nSecured Term Loan\nJune 9, 2031\n3.59\n%\n$\n403,046\n \n$\n403,129\n \nDeferred financing costs, net\n(\n1,397\n)\n(\n1,614\n)\nSecured Term Loan, net\n$\n401,649\n \n$\n401,515\n \n \n(1)\nThe Secured Term Loan bears interest at a fixed rate of \n3.59\n% per annum including applicable servicing fees for the first \n11\n years and for the twelfth year bears interest at a floating rate based on a spread of \n147\n bps over a comparable or successor rate to one month LIBOR as provided for in our loan agreement, including applicable servicing fees, subject to certain adjustments as outlined in the loan agreement. Interest payments are made monthly.\nCollateral \nAs of December 31, 2024 and 2023, the Secured Term Loan’s collateral pool contains \n3,331\n and \n3,332\n homes, respectively, with a gross book value of $\n846,579\n and $\n828,570\n, respectively, and a net book value of $\n663,154\n and $\n675,075\n, respectively. 2019-1 IH Borrower has the right, subject to certain requirements and limitations outlined in the loan agreement, to substitute properties representing up to \n20\n% of the collateral pool annually, and to substitute properties representing up to \n100\n% of the collateral pool over the life of the Secured Term Loan. In addition, \nfour\n times after the first anniversary of the closing date, 2019-1 IH Borrower has the right, subject to certain requirements and limitations outlined in the loan agreement, to execute a special release of collateral representing up to \n15\n% of the then-outstanding principal balance of the Secured Term Loan in order to bring the loan-to-value ratio back in line with the Secured Term Loan’s loan-to-value ratio as of the closing date. Any such special release of collateral would not change the then-outstanding principal balance of the Secured Term Loan, but rather would reduce the number of single-family rental homes included in the collateral pool. \nF-24\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nLoan Covenants\nThe Secured Term Loan requires 2019-1 IH Borrower to maintain compliance with certain affirmative and negative covenants. Affirmative covenants include 2019-1 IH Borrower’s, and certain of its affiliates’, compliance with (i) licensing, permitting and legal requirements specified in the loan agreement, (ii) organizational requirements of the jurisdictions in which they are organized, (iii) federal and state tax laws, and (iv) books and records requirements specified in the loan agreement. Negative covenants include 2019-1 IH Borrower’s, and certain of its affiliates’, compliance with limitations surrounding (i) the amount of 2019-1 IH Borrower’s indebtedness and the nature of its investments, (ii) the execution of transactions with affiliates, (iii) the Manager, (iv) the nature of 2019-1 IH Borrower’s business activities, and (v) the required maintenance of specified cash reserves.\nPrepayments \nPrepayments of the Secured Term Loan are generally not permitted unless such prepayments are made pursuant to the voluntary election or mandatory provisions specified in the loan agreement. The specified mandatory provisions become effective to the extent that a property becomes characterized as a disqualified property, a property is sold, and/or upon the occurrence of a condemnation or casualty event associated with a property. To the extent either a voluntary election is made, or a mandatory prepayment condition exists, in addition to paying all interest and principal, we must also pay certain breakage costs as determined by the loan servicer and a yield maintenance premium if prepayment occurs before June 9, 2030. For the years ended December 31, 2024 and 2023, we made mandatory prepayments of $\n83\n and $\n234\n, respectively, under the terms of the Secured Term Loan agreement. \nNo\n such prepayments were made during the year ended December 31, 2022.\nUnsecured Notes\nOur unsecured notes are issued in connection with either an underwritten public offering pursuant to our shelf registration statement or in connection with a private placement transaction with certain institutional investors (collectively, the “Unsecured Notes”). Our current shelf registration statement automatically became effective upon filing with the SEC in June 2024 and expires in June 2027. We utilize proceeds from the Unsecured Notes to fund: (i) repayments of then-outstanding indebtedness, including the Securitizations; (ii) closing costs in connection with the Unsecured Notes; and (iii) general costs associated with our operations and other corporate purposes, including acquisitions. Interest on the Unsecured Notes is payable semi-annually in arrears.\nThe following table sets forth a summary of our Unsecured Notes as of December 31, 2024 and 2023:\nInterest\nRate\n(1)\nDecember 31,\n2024\nDecember 31, 2023\nTotal Unsecured Notes, net\n(2)\n2.00\n% — \n5.50\n%\n$\n3,826,544\n \n$\n3,329,856\n \nDeferred financing costs, net\n(\n25,856\n)\n(\n24,389\n)\nTotal\n$\n3,800,688\n \n$\n3,305,467\n \n(1)\nRepresents the range of contractual rates in place as of December 31, 2024.\n(2)\nNet of unamortized discount of $\n23,456\n and $\n20,144\n as of December 31, 2024 and 2023, respectively. Maturity dates for the Unsecured Notes range from May 2028 through May 2036 (see “Debt Maturities Schedule” for additional information).\nDebt Issuances\nThe following activity occurred during the years ended December 31, 2024, 2023, and 2022 with respect to the Unsecured Notes:\n•\nOn September 26, 2024, in a public offering under our shelf registration statement, we issued $\n500,000\n aggregate principal amount of \n4.88\n% Senior Notes which mature on February 1, 2035. \nF-25\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\n•\nOn August 2, 2023, in a public offering under our existing shelf registration statement, we issued (1) $\n450,000\n aggregate principal amount of \n5.45\n% Senior Notes which mature on August 15, 2030 and (2) $\n350,000\n aggregate principal amount of \n5.50\n% Senior Notes which mature on August 15, 2033.\n•\nOn April 5, 2022, in a public offering under our existing shelf registration statement, we issued $\n600,000\n aggregate principal amount of \n4.15\n% Senior Notes which mature on April 15, 2032.\nPrepayments\nThe Unsecured Notes are redeemable in whole at any time or in part from time to time, at our option, at a redemption price equal to (i) \n100\n% of the principal amount to be redeemed plus accrued and unpaid interest and (ii) a make-whole premium calculated in accordance with the respective loan agreements if the redemption occurs in certain amounts or in certain periods that range from one to three months prior to the maturity date. The privately placed Unsecured Notes require any prepayment to be an amount not less than \n5\n% of the aggregate principal amount then outstanding.\nGuarantees\nThe Unsecured Notes are fully and unconditionally guaranteed, jointly and severally, by INVH and two of its wholly owned subsidiaries, the General Partner, and IH Merger Sub, LLC (“IH Merger Sub”).\nLoan Covenants\nThe Unsecured Notes issued publicly under our registration statement contain customary covenants, including, among others, limitations on the incurrence of debt; and they include the following financial covenants related to the incurrence of debt: (i) an aggregate debt test; (ii) a debt service test; (iii) a maintenance of total unencumbered assets; and (iv) a secured debt test. \nThe privately placed Unsecured Notes contain customary covenants, including, among others, limitations on distributions, fundamental changes, and transactions with affiliates; and they include the following financial covenants, subject to certain qualifications: (i) a maximum total leverage ratio; (ii) a maximum secured leverage ratio; (iii) a maximum unencumbered leverage ratio; (iv) a minimum fixed charge coverage ratio; and (v) a minimum unsecured interest coverage ratio. \nThe Unsecured Notes contain customary events of default (subject in certain cases to specified cure periods), the occurrence of which would allow the holders of notes to take various actions, including the acceleration of amounts due under the Unsecured Notes.\nTerm Loan Facilities and Revolving Facility\nOn September 9, 2024, we entered into the Second Amended and Restated Revolving Credit and Term Loan Agreement with a syndicate of banks, financial institutions, and institutional lenders for a new credit facility (the “Credit Facility”). The Credit Facility provides $\n3,500,000\n of borrowing capacity and consists of a $\n1,750,000\n revolving facility (the “Revolving Facility”) and a $\n1,750,000\n term loan facility (the “2024 Term Loan Facility”), both of which mature on September 9, 2028, with \ntwo\n \nsix month\n extension options available. The Revolving Facility also includes borrowing capacity for letters of credit. The Credit Facility provides us with the option to enter into additional incremental credit facilities (including an uncommitted incremental facility that provides us with the option to increase the size of the Revolving Facility and/or the 2024 Term Loan Facility such that the aggregate amount does not exceed $\n4,000,000\n at any time), subject to certain limitations.\nThe Credit Facility replaced a credit facility that consisted of a $\n1,000,000\n revolving credit facility (the “2020 Revolving Facility”) and a $\n2,500,000\n term loan facility (the “2020 Term Loan Facility,” and together with the 2020 Revolving Facility, the “2020 Credit Facility”). The terms and conditions of the Credit Facility are consistent with those of the 2020 Credit Facility except as otherwise noted below. \nProceeds from the 2024 Term Loan Facility, a $\n750,000\n borrowing on the Revolving Facility on the date of effectiveness of the Credit Facility, and excess cash on hand were used to fully repay the 2020 Term Loan Facility and to pay costs associated with the transaction. Future proceeds from the Revolving Facility are expected to be used for general corporate purposes. \nF-26\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nOn June 22, 2022, we entered into a Term Loan Agreement with a syndicate of banks for new senior unsecured term loans (as amended on September 9, 2024, the “2022 Term Loan Facility,” and together with the 2024 Term Loan Facility and the 2020 Term Loan Facility, the “Term Loan Facilities”). The 2022 Term Loan Facility provided $\n725,000\n of borrowing capacity, consisting of a $\n150,000\n initial term loan (the “Initial Term Loan”) and delayed draw term loans totaling $\n575,000\n (the “Delayed Draw Term Loans”) which were fully drawn on December 8, 2022. The Initial Term Loan and the Delayed Draw Term Loans (together, the “2022 Term Loans”) mature on June 22, 2029. The 2022 Term Loan Facility also includes an accordion feature providing the option to increase the size of the 2022 Term Loans or enter into additional incremental 2022 Term Loans, such that the aggregate amount of all 2022 Term Loans does not exceed $\n950,000\n at any time, subject to certain limitations.\nThe following table sets forth a summary of the outstanding principal amounts under the Term Loan Facilities and the Revolving Facility, as of December 31, 2024 and 2023:\nMaturity\nDate\nInterest\nRate\nDecember 31,\n2024\nDecember 31, 2023\n2020 Term Loan Facility\n(1)\nSeptember 9, 2024\nN/A\n$\n—\n \n$\n2,500,000\n \n2024 Term Loan Facility\n(2)(3)\nSeptember 9, 2028\n5.28\n%\n1,750,000\n \n—\n \n2022 Term Loan Facility\n(4)\nJune 22, 2029\n5.58\n%\n725,000\n \n725,000\n \nTotal Term Loan Facilities\n2,475,000\n \n3,225,000\n \nLess: deferred financing costs, net\n(\n28,959\n)\n(\n13,186\n)\nTerm Loan Facilities, net\n$\n2,446,041\n \n$\n3,211,814\n \nRevolving Facility\n(2)(3)\nSeptember 9, 2028\n5.21\n%\n$\n570,000\n \n$\n—\n \n(1)\nMaturity date represents repayment date.\n(2)\nInterest rates for the 2024 Term Loan Facility and the Revolving Facility are based on Term SOFR adjusted for a \n0.10\n% credit spread adjustment, plus an applicable margin. As of December 31, 2024, the applicable margins were \n0.85\n% and \n0.78\n% for the 2024 Term Loan Facility and the Revolving Facility, respectively, and Term SOFR was \n4.33\n%.\n(3)\nIf we exercise the \ntwo\n \nsix month\n extension options, the maturity date will be September 9, 2029.\n(4)\nInterest rate for the 2022 Term Loan Facility is based on Term SOFR adjusted for a \n0.10\n% credit spread adjustment, plus the applicable margin. As of December 31, 2024, the applicable margin was \n1.15\n%, and Term SOFR was \n4.33\n%.\nInterest Rate and Fees\nBorrowings under the Credit Facility bear interest, at our option, at a rate equal to a margin over either (a) Term SOFR for the interest period relevant to such borrowing, (b) a daily SOFR rate calculated without considering accrued interest, or (c) a base rate determined by reference to the highest of (1) the administrative agent’s prime lending rate, (2) the federal funds effective rate plus \n0.50\n%, (3) the Term SOFR rate that would be payable on such day for a Term SOFR loan with a one-month interest period plus \n1.00\n%, and (4) \n1.00\n%.\nAs a result of an April 18, 2023 amendment to the 2020 Credit Facility, borrowings thereunder bore interest, at our option, at a rate equal to (a) a Term SOFR rate determined by reference to the forward-looking SOFR rate published by Reuters (or a comparable or successor rate as provided for in our loan agreement) for the interest period relevant to such borrowing plus \n0.10\n% credit spread adjustment or (b) a base rate determined by reference to the highest of (1) the administrative agent’s prime lending rate, (2) the federal funds effective rate plus \n0.50\n%, (3) the Term SOFR rate that would be payable on such day for a Term SOFR rate loan with a one month interest period plus \n1.00\n%, and (4) \n1.00\n%.\nPrior to the April 18, 2023 amendment to the 2020 Credit Facility, borrowings thereunder bore interest, at our option, at a rate equal to a margin over either (a) a LIBOR rate determined by reference to the Bloomberg LIBOR rate (or a comparable or successor rate as provided for in our loan agreement) for the interest period relevant to such borrowing or (b) a base rate determined by reference to the highest of (1) the administrative agent’s prime lending rate, (2) the federal funds effective rate plus \n0.50\n%, and (3) the LIBOR rate that would be payable on such day for a LIBOR rate loan with a one month interest period plus \n1.00\n%.\nF-27\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nBorrowings under the 2022 Term Loan Facility bear interest, at our option, at a rate equal to a margin over either (a) Term SOFR adjusted for an applicable credit spread adjustment (“Adjusted SOFR”) for the interest period relevant to such borrowing or (b) a base rate determined by reference to the highest of (1) the administrative agent’s prime lending rate, (2) the federal funds effective rate plus \n0.50\n%, and (3) Adjusted SOFR for a one month interest period plus \n1.00\n%.\nThe margins for the Term Loan Facilities, the Revolving Facility, and the 2020 Revolving Facility are as follows:\nBase Rate Loans\nAdjusted SOFR Rate Loans\n2024 Term Loan Facility\n0.00\n%\n—\n0.60\n%\n0.75\n%\n—\n1.60\n%\n2020 Term Loan Facility\n0.00\n%\n—\n0.65\n%\n0.80\n%\n—\n1.65\n%\n2022 Term Loan Facility\n0.15\n%\n—\n1.20\n%\n1.15\n%\n—\n2.20\n%\nRevolving Facility\n0.00\n%\n—\n0.40\n%\n0.70\n%\n—\n1.40\n%\n2020 Revolving Facility\n0.00\n%\n—\n0.45\n%\n0.75\n%\n—\n1.45\n%\nThe 2022 Term Loan Facility includes a sustainability component whereby pricing can improve upon our achievement of certain sustainability ratings, determined via an independent third-party evaluation.\nIn addition to paying interest on outstanding principal, we are required to pay certain facility and unused commitment fees. Under the Credit Facility, we are required to pay a facility fee ranging from \n0.10\n% to \n0.30\n%. We are also required to pay customary letter of credit fees.\nPrepayments and Amortization\nNo principal reductions are required under the Credit Facility or the 2022 Term Loan Facility. We are permitted to voluntarily repay amounts outstanding under the 2024 Term Loan Facility at any time without premium or penalty, subject to certain minimum amounts and the payment of customary “breakage” costs with respect to Term SOFR loans. After June 22, 2024, we are also permitted to voluntarily repay amounts outstanding under the 2022 Term Loan Facility without premium or penalty. Once repaid, no further borrowings will be permitted under the Term Loan Facilities.\nLoan Covenants\nThe Credit Facility and the 2022 Term Loan Facility contain certain customary affirmative and negative covenants and events of default. Such covenants will, among other things, restrict, subject to certain exceptions, our ability and that of our subsidiaries to (i) engage in certain mergers, consolidations, or liquidations, (ii) sell, lease, or transfer all or substantially all of our respective assets, (iii) engage in certain transactions with affiliates, (iv) make changes to our fiscal year, (v) make changes in the nature of our business and our subsidiaries, and (vi) enter into certain burdensome agreements.\nThe Credit Facility and the 2022 Term Loan Facility also require us, on a consolidated basis with our subsidiaries, to maintain a (i) maximum total leverage ratio, (ii) maximum secured leverage ratio, (iii) maximum unencumbered leverage ratio, (iv) minimum fixed charge coverage ratio, and (v) minimum unsecured interest coverage ratio. If an event of default occurs, the lenders under the Credit Facility and the 2022 Term Loan Facility are entitled to take various actions, including the acceleration of amounts due thereunder. On September 9, 2024, we amended the 2022 Term Loan Facility to change the definition of “Total Asset Value” to conform with the new Credit Facility and to remove the “Maximum Secured Leverage Ratio” financial covenant.\nGuarantees \nThe obligations under the Credit Facility and the 2022 Term Loan Facility are guaranteed on a joint and several basis by INVH and two of its wholly owned subsidiaries, the General Partner, and IH Merger Sub. On September 17, 2021, the obligations under the 2020 Credit Facility became guaranteed pursuant to a similar parent guaranty agreement with INVH, the General Partner, and IH Merger Sub.\nF-28\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nDebt Maturities Schedule\nThe following table summarizes the contractual maturities of our debt as of December 31, 2024:\nYear\nMortgage\nLoans\nSecured Term Loan\nUnsecured Notes\nTerm Loan Facilities\n(1)\nRevolving Facility\n(1)(2)\nTotal\n2025\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n2026\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n2027\n989,151\n \n—\n \n—\n \n—\n \n—\n \n989,151\n \n2028\n—\n \n—\n \n750,000\n \n1,750,000\n \n570,000\n \n3,070,000\n \n2029\n—\n \n—\n \n—\n \n725,000\n \n—\n \n725,000\n \nThereafter\n—\n \n403,046\n \n3,100,000\n \n—\n \n—\n \n3,503,046\n \nTotal\n989,151\n \n403,046\n \n3,850,000\n \n2,475,000\n \n570,000\n \n8,287,197\n \nLess: deferred financing costs, net\n(\n4,347\n)\n(\n1,397\n)\n(\n25,856\n)\n(\n28,959\n)\n—\n \n(\n60,559\n)\nLess: unamortized debt discount\n(\n880\n)\n—\n \n(\n23,456\n)\n—\n \n—\n \n(\n24,336\n)\nTotal \n$\n983,924\n \n$\n401,649\n \n$\n3,800,688\n \n$\n2,446,041\n \n$\n570,000\n \n$\n8,202,302\n \n(1)\nIf we exercise the \ntwo\n \nsix month\n extension options, the maturity date for the 2024 Term Loan Facility and the Revolving Facility will be September 9, 2029.\n(2)\nDeferred financing costs related to the Revolving Facility are classified in other assets, net (see Note 6).\nNote 8—\nDerivative Instruments\nFrom time to time, we enter into derivative instruments to manage the economic risk of changes in interest rates. We do not enter into derivative transactions for speculative or trading purposes. Designated Hedges are derivatives that meet the criteria for hedge accounting and that we have elected to designate as hedges. Non-Designated Hedges are derivatives that do not meet the criteria for hedge accounting or that we did not elect to designate as hedges. \nDesignated Hedges\nWe have entered into various interest rate swap agreements, which are used to hedge the variable cash flows associated with variable-rate interest payments. Each of our swap agreements is designated for hedge accounting purposes and is currently indexed to one month Term SOFR. Changes in the fair value of these swaps are recorded in other comprehensive income and are subsequently reclassified into earnings in the period in which the hedged forecasted transactions affect earnings.\nF-29\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nThe table below summarizes our interest rate swap instruments as of December 31, 2024:\nAgreement Date\nForward\nEffective Date\nMaturity\nDate\nStrike\nRate\nIndex\nNotional\nAmount\nApril 18, 2023\nMarch 31, 2023\nJanuary 31, 2025\n2.80\n%\nOne month Term SOFR\n$\n400,000\n \nApril 18, 2023\nApril 15, 2023\nJune 9, 2025\n2.94\n%\nOne month Term SOFR\n325,000\n \nApril 18, 2023\nApril 15, 2023\nJuly 31, 2025\n3.08\n%\nOne month Term SOFR\n200,000\n \nSeptember 20, 2024\nDecember 31, 2024\nMay 31, 2028\n3.13\n%\nOne month Term SOFR\n200,000\n \nSeptember 20, 2024\nDecember 31, 2024\nMay 31, 2028\n3.14\n%\nOne month Term SOFR\n200,000\n \nSeptember 23, 2024\nDecember 31, 2024\nMay 31, 2028\n3.13\n%\nOne month Term SOFR\n200,000\n \nSeptember 24, 2024\nDecember 31, 2024\nMay 31, 2028\n3.08\n%\nOne month Term SOFR\n200,000\n \nSeptember 24, 2024\nDecember 31, 2024\nMay 31, 2028\n3.08\n%\nOne month Term SOFR\n200,000\n \nSeptember 25, 2024\nDecember 31, 2024\nMay 31, 2028\n1.93\n%\nOne month Term SOFR\n200,000\n \nSeptember 25, 2024\nDecember 31, 2024\nMay 31, 2029\n3.12\n%\nOne month Term SOFR\n200,000\n \nMarch 22, 2023\nJuly 9, 2025\nMay 31, 2029\n2.99\n%\nOne month Term SOFR\n300,000\n \nDuring the year ended December 31, 2024, we entered into certain new interest rate swap agreements and terminated others resulting in a net payment to the counterparties of $\n1,140\n. There were \nno\n such terminations during the year ended December 31, 2023, and during the year ended December 31, 2022, we terminated interest rate swaps or portions thereof and paid counterparties $\n13,292\n in connection with those terminations.\nDuring the years ended December 31, 2024, 2023, and 2022, interest rate swap instruments were used to hedge the variable cash flows associated with existing variable-rate interest payments. Amounts reported in accumulated other comprehensive income related to derivatives will be reclassified to interest expense as interest payments are made on our variable-rate debt. During the next 12 months, we estimate that $\n25,976\n will be reclassified to earnings as a decrease in interest expense.\nNon-Designated Hedges\nConcurrent with entering into certain of the mortgage loan agreements, we entered into or acquired and maintained interest rate cap agreements with terms and notional amounts equivalent to the terms and amounts of the mortgage loans made by the third-party lenders. Any such interest rate cap agreement, including all of our rights to payments owed by the counterparties and all other rights, was pledged as additional collateral for the mortgage loan. Additionally, in certain instances, in order to minimize the cash impact of purchasing required interest rate caps, we simultaneously sold interest rate caps (which have identical terms and notional amounts) such that the purchase price and sales proceeds of the related interest rate caps were intended to offset each other. As of December 31, 2024, we did not have any interest rate caps.\nF-30\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nFair Values of Derivative Instruments on the Consolidated\n \nBalance Sheets\nThe table below presents the fair value of our derivative financial instruments as well as their classification on the consolidated balance sheets as of December 31, 2024 and 2023:\nAsset Derivatives\nLiability Derivatives\nFair Value as of\nFair Value as of\nBalance\nSheet Location\nDecember 31,\n2024\nDecember 31, 2023\nBalance\nSheet Location\nDecember 31,\n2024\nDecember 31, 2023\nDerivatives designated as hedging instruments:\nInterest rate swaps\nOther assets\n$\n61,479\n \n$\n75,487\n \nOther liabilities\n$\n—\n \n$\n—\n \nDerivatives not designated as hedging instruments:\nInterest rate caps\nOther assets\n—\n \n1\n \nOther liabilities\n—\n \n—\n \nTotal\n$\n61,479\n \n$\n75,488\n \n$\n—\n \n$\n—\n \nOffsetting Derivatives\nWe enter into master netting arrangements, which reduce risk by permitting net settlement of transactions with the same counterparty. \nThe tables below present a gross presentation, the effects of offsetting, and a net presentation of our derivatives as of December 31, 2024 and 2023:\nDecember 31, 2024\nGross Amounts Not Offset in the Statement of Financial Position\nGross Amounts of Recognized Assets/ Liabilities\nGross Amounts Offset in the Statement of Financial Position\nNet Amounts of Assets/ Liabilities Presented in the Statement of Financial Position\nFinancial Instruments\nCash Collateral Received\nNet\nAmount\nOffsetting assets:\nDerivatives\n$\n61,479\n \n$\n—\n \n$\n61,479\n \n$\n—\n \n$\n—\n \n$\n61,479\n \nOffsetting liabilities:\nDerivatives\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nDecember 31, 2023\nGross Amounts Not Offset in the Statement of Financial Position\nGross Amounts of Recognized Assets/ Liabilities\nGross Amounts Offset in the Statement of Financial Position\nNet Amounts of Assets/ Liabilities Presented in the Statement of Financial Position\nFinancial Instruments\nCash Collateral Received\nNet\nAmount\nOffsetting assets:\nDerivatives\n$\n75,488\n \n$\n—\n \n$\n75,488\n \n$\n—\n \n$\n—\n \n$\n75,488\n \nOffsetting liabilities:\nDerivatives\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n \nF-31\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nEffect of Derivative Instruments on the Consolidated Statements of Comprehensive Income (Loss) and the Consolidated Statements of Operations\nThe tables below present the effect of our derivative financial instruments in the consolidated statements of comprehensive income (loss) and the consolidated statements of operations for the years ended December 31, 2024, 2023, and 2022:\nAmount of Gain Recognized in OCI on Derivative\nLocation of Gain (Loss) Reclassified from Accumulated OCI into Net Income\nAmount of Gain (Loss) Reclassified from Accumulated OCI into Net Income\nTotal Amount of Interest Expense Presented in the Consolidated Statements of Operations\nFor the Years Ended December 31,\nFor the Years Ended December 31,\nFor the Years Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\n    Derivatives in cash flow hedging relationships:\nInterest rate swaps\n$\n73,042\n \n$\n39,488\n \n$\n327,323\n \nInterest expense\n$\n75,772\n \n$\n73,856\n \n$\n(\n59,103\n)\n$\n366,070\n \n$\n333,457\n \n$\n304,092\n \n \nLocation of\nLoss\nRecognized in\nNet Income on Derivative\nAmount of Loss Recognized in Net Income on Derivative\nFor the Years Ended December 31,\n2024\n2023\n2022\nDerivatives not designated as hedging instruments:\nInterest rate caps\nInterest expense\n$\n1\n \n$\n73\n \n$\n81\n \nCredit-Risk-Related Contingent Features\nThe agreements with our derivative counterparties which govern our interest rate swap agreements contain a provision where we could be declared in default on our derivative obligations if repayment of the underlying indebtedness is accelerated by the lender due to our default on the indebtedness.\nAs of December 31, 2024,\n we were not in a net liability position with any of our derivative counterparties.\nNote 9—\nStockholders’ Equity\nAs of December 31, 2024 we have issued \n612,605,478\n shares of common stock. In addition, we issue OP Units from time to time which, upon vesting, are redeemable for shares of our common stock on a \none\n-for-one basis or, in our sole discretion, cash and are reflected as non-controlling interests on our consolidated balance sheets and statements of equity. As of December 31, 2024, \n1,979,009\n outstanding OP Units are redeemable.\nDuring the years ended December 31, 2024, 2023, and 2022, we issued \n647,239\n, \n546,857\n, and \n10,365,944\n, shares of common stock, respectively.\nAt the Market Equity Program\nOn December 20, 2021, we entered into distribution agreements with a syndicate of banks (the “Agents” and the “Forward Sellers”), and on June 14, 2024, we entered into distribution agreements with additional Agents and Forward Sellers. Pursuant to these agreements, we may sell, from time to time, up to an aggregate sales price of $\n1,250,000\n of our common stock through the Agents and the Forward Sellers (the “ATM Equity Program”). In addition to the issuance of shares of our common stock, the distribution agreements permit us to enter into separate forward sale transactions with \nF-32\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\ncertain forward purchasers who may borrow shares from third parties and, through affiliated Forward Sellers, offer a number of shares of our common stock equal to the number of shares of our common stock underlying the particular forward transaction. During the years ended December 31, 2024 and 2023, we did \nnot\n sell any shares of common stock under the ATM Equity Program. During the year ended December 31, 2022, we sold \n2,438,927\n shares of our common stock under our ATM Equity Program, generating net proceeds of $\n98,367\n, after giving effect to Agent commissions and other costs totaling $\n1,633\n. As of December 31, 2024, $\n1,150,000\n remains available for future offerings under the ATM Equity Program.\nDividends\nTo qualify as a REIT, we are required to distribute annually to our stockholders at least 90% of our REIT taxable income, without regard to the deduction for dividends paid and excluding net capital gains, and to pay tax at regular corporate rates to the extent that we annually distribute less than 100% of our net taxable income. We intend to pay quarterly dividends to our stockholders that in the aggregate are approximately equal to or exceed our net taxable income in the relevant year. The timing, form, and amount of distributions, if any, to our stockholders, will be at the sole discretion of our board of directors.\nThe following table summarizes our dividends paid from January 1, 2023 through December 31, 2024:\nRecord Date\nAmount\nper Share\nPay Date\nTotal Amount Paid \nQ4-2024\nSeptember 26, 2024\n$\n0.28\n \nOctober 18, 2024\n$\n171,485\n \nQ3-2024\nJune 27, 2024\n0.28\n \nJuly 19, 2024\n172,389\n \nQ2-2024\nMarch 28, 2024\n0.28\n \nApril 19, 2024\n171,712\n \nQ1-2024\nDecember 27, 2023\n0.28\n \nJanuary 19, 2024\n171,721\n \nQ4-2023\nNovember 7, 2023\n0.26\n \nNovember 22, 2023\n160,350\n \nQ3-2023\nAugust 8, 2023\n0.26\n \nAugust 25, 2023\n160,540\n \nQ2-2023\nMay 10, 2023\n0.26\n \nMay 26, 2023\n159,493\n \nQ1-2023\nFebruary 14, 2023\n0.26\n \nFebruary 28, 2023\n158,453\n \nOn December 11, 2024, our board of directors declared a dividend of $\n0.29\n (actual $) per share to stockholders of record on December 26, 2024, resulting in a $\n176,952\n dividend payment on January 17, 2025 (see Note 16). This dividend payment is accrued in other liabilities on our December 31, 2024 consolidated balance sheet.\nNote 10—\nShare-Based Compensation\nOur board of directors adopted, and our stockholders approved, the Invitation Homes Inc. 2017 Omnibus Incentive Plan (the “Omnibus Incentive Plan”) to provide a means through which to attract and retain key associates and to provide a means whereby our directors, officers, associates, consultants, and advisors can acquire and maintain an equity interest in us, or be paid incentive compensation, including incentive compensation measured by reference to the value of our common stock, and to align their interests with those of our stockholders. Under the Omnibus Incentive Plan, we may issue up to \n16,000,000\n shares of common stock.\nOur share-based awards consist of RSUs, which may be time vesting, performance based vesting, or market based vesting, and Outperformance Awards (defined below). Time-vesting RSUs are participating securities for EPS purposes, and PRSUs and Outperformance Awards are not.\nShare-Based Awards\nThe following summarizes our share-based award activity during the years ended December 31, 2024, 2023, and 2022.\nAnnual Long Term Incentive Plan (“LTIP”):\n•\nAnnual LTIP Awards Granted: \nDuring the years ended December 31, 2024, 2023, and 2022, we granted \n810,615\n, \n776,492\n, and \n640,107\n, RSUs, respectively, pursuant to LTIP awards. Each award includes components which vest based on time-vesting conditions, market based vesting conditions, and performance based vesting conditions, each of which is subject to continued employment through the applicable vesting date.\nF-33\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nLTIP time-vesting RSUs vest in \nthree\n equal annual installments based on an anniversary date of March 1st. LTIP PRSUs may be earned based on the achievement of certain measures over a \nthree year\n performance period. The number of PRSUs earned will be determined based on performance achieved during the performance period for each measure at certain threshold, target, or maximum levels and corresponding payout ranges. In general, the LTIP PRSUs are earned after the end of the performance period on the date on which the performance results are certified by our compensation and management development committee (the “Compensation Committee”).\nAll of the LTIP Awards are subject to certain change in control and retirement eligibility provisions that may impact these vesting schedules.\n•\nPRSU Results: \nDuring the years ended December 31, 2024, 2023, and 2022, certain LTIP PRSUs vested and achieved performance in excess of the target level, resulting in the issuance of an additional \n193,615\n, \n188,001\n, and \n285,601\n shares of common stock, respectively. Such awards are reflected as an increase in the number of awards granted and vested in the table below.\nOther Award Activity\n•\nOther Awards: \nDuring the year ended December 31, 2024, we granted \n51,372\n time-vesting RSUs to members of our board of directors, which will fully vest on the date of INVH’s 2025 annual stockholders meeting, subject to continued service on the board of directors through such date. During the years ended December 31, 2023 and 2022, INVH issued \n50,895\n and \n36,912\n time-vesting RSUs, which fully vested on the dates of INVH’s 2024 and 2023 annual stockholders meetings, respectively.\nDuring the \nyear ended December 31, 2023\n, we granted \n56,562\n employment awards, respectively, in the form of time-vesting RSUs that \nvest in \nthree\n equal annual installments based on an anniversary date of the grant date. \n•\nModifications: \nOn February 1, 2023, the vesting conditions of certain outstanding equity awards with a pre-modification aggregate fair value of $\n3,741\n were modified, resulting in an incremental $\n309\n of share-based compensation expense over the remaining service period. During the year ended December 31, 2023, $\n1,941\n of previously recognized share-based compensation expense with respect to these awards was reversed, and we began amortizing the modified fair value over the remaining service period.\nOutperformance Awards\nOn May 1, 2019, the Compensation Committee approved equity based awards in the form of PRSUs and OP Units (the “2019 Outperformance Awards”). The 2019 Outperformance Awards included market based vesting conditions related to absolute and relative total shareholder returns (“TSRs”) over a \nthree year\n performance period that ended on March 31, 2022. In April 2022, the absolute TSR and the relative TSR were separately calculated, and the Compensation Committee certified achievement of each at maximum achievement. The number of earned 2019 Outperformance Awards was then determined based on the earned dollar value of the awards (at maximum) and the stock price at the performance certification date, resulting in \n311,425\n earned PRSUs and \n498,224\n earned OP Units. Earned awards vested \n50\n% on the certification date in April 2022, \n25\n% vested on March 31, 2023, and the remaining \n25\n% vested on March 31, 2024. The estimated fair values of 2019 Outperformance Awards that fully vested during the years ended December 31, 2024, 2023, and 2022\n were an aggregate $\n2,808\n, $\n3,164\n, and $\n6,134\n, respectively. \nThe aggregate $\n12,160\n grant-date fair value of the 2019 Outperformance Awards that were earned was determined based on Monte-Carlo option pricing models which estimated the probability of achievement of the TSR thresholds. The grant-date fair value was amortized ratably over each vesting period.\nOn April 1, 2022, the Compensation Committee granted equity based awards with market based vesting conditions in the form of PRSUs and OP Units (the “2022 Outperformance Awards” and together with the 2019 Outperformance Awards, the “Outperformance Awards”). The 2022 Outperformance Awards may be earned based on the achievement of rigorous absolute TSR and relative TSR return thresholds over a \nthree year\n performance period ending March 31, 2025. The 2022 Outperformance Awards provide that upon completion of \n75\n% of the performance period, or June 30, 2024 (the “Interim Measurement Date”), performance achieved as of the Interim Measurement Date was calculated consistent with the award terms. To the extent performance through the Interim Measurement Date resulted in a payout if the performance period had ended on that date, a minimum of \n50\n% of such hypothetical payout amount is guaranteed as a minimum level payout for the full performance period, so long as certain minimum levels of relative TSR are achieved for the full performance period. As of the Interim Measurement Date, the relative TSR component of the 2022 Outperformance Awards was calculated at maximum achievement, while the absolute TSR component was below threshold. As such, overall performance as of the \nF-34\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nInterim Measurement Date results in a \n50\n% payout of the 2022 Outperformance Awards, or a guaranteed minimum payout of \n25\n%, provided that certain minimum levels of relative TSR are achieved for the full performance period.\nThe final award achievement will be equal to the greater of the payouts determined based on the Interim Measurement Date and performance through March 31, 2025. Upon completion of the performance period, the dollar value of the awards earned under the absolute and relative TSR components will be separately calculated, and the number of earned 2022 Outperformance Awards will be determined based on the earned dollar value of the awards and the stock price at the performance certification date. Earned awards will vest \n50\n% on the certification date and \n50\n% on March 31, 2026, subject to continued employment. As of December 31, 2024, 2022 Outperformance Awards with an approximate aggregate $\n17,100\n grant-date fair value have been issued and remain outstanding. The grant-date fair value was determined based on Monte-Carlo option pricing models which estimate the probability of achievement of the TSR thresholds, and it is amortized ratably over each vesting period.\nSummary of Total Share-Based Awards\nThe following table summarizes activity related to non-vested time-vesting RSUs and PRSUs, other than Outperformance Awards, during the years ended December 31, 2024, 2023, and 2022:\nTime-Vesting Awards\nPRSUs\nTotal Share-Based Awards\n(1)\nNumber\nWeighted\nAverage Grant\nDate Fair Value\n(Actual $)\nNumber\nWeighted\nAverage Grant\nDate Fair Value\n(Actual $)\nNumber\nWeighted\nAverage Grant\nDate Fair Value\n(Actual $)\nBalance, December 31, 2021\n397,085\n \n$\n29.05\n \n1,097,537\n \n$\n28.38\n \n1,494,622\n \n$\n28.56\n \nGranted\n339,517\n \n37.39\n \n730,078\n \n31.46\n \n1,069,595\n \n33.34\n \nVested\n(2)\n(\n213,884\n)\n(\n28.84\n)\n(\n602,994\n)\n(\n24.67\n)\n(\n816,878\n)\n(\n25.76\n)\nForfeited / canceled\n(\n12,846\n)\n(\n35.22\n)\n(\n13,050\n)\n(\n29.16\n)\n(\n25,896\n)\n(\n32.16\n)\nBalance, December 31, 2022\n509,872\n \n34.54\n \n1,211,571\n \n32.08\n \n1,721,443\n \n32.81\n \nGranted\n350,949\n \n31.67\n \n721,001\n \n30.51\n \n1,071,950\n \n30.89\n \nVested\n(2)\n(\n220,208\n)\n(\n33.06\n)\n(\n505,933\n)\n(\n31.54\n)\n(\n726,141\n)\n(\n32.00\n)\nForfeited / canceled\n(\n29,894\n)\n(\n34.14\n)\n(\n61,697\n)\n(\n31.22\n)\n(\n91,591\n)\n(\n32.17\n)\nBalance, December 31, 2023\n610,719\n \n33.44\n \n1,364,942\n \n31.48\n \n1,975,661\n \n32.09\n \nGranted \n316,540\n \n34.71\n \n739,062\n \n34.24\n \n1,055,602\n \n34.38\n \nVested\n(2)\n(\n268,193\n)\n(\n32.69\n)\n(\n625,315\n)\n(\n28.84\n)\n(\n893,508\n)\n(\n30.00\n)\nForfeited / canceled\n(\n27,678\n)\n(\n35.29\n)\n(\n31,988\n)\n(\n32.68\n)\n(\n59,666\n)\n(\n33.89\n)\nBalance, December 31, 2024\n631,388\n \n$\n34.32\n \n1,446,701\n \n$\n34.01\n \n2,078,089\n \n$\n34.10\n \n(1)\nTotal share-based awards excludes Outperformance Awards.\n(2)\nAll vested share-based awards are included in basic EPS for the periods after each award’s vesting date. The estimated aggregate fair value of share-based awards that fully vested during the years ended December 31, 2024, 2023, and 2022 was $\n28,207\n, $\n23,265\n, and $\n21,154\n, respectively. During the years ended December 31, 2024, 2023, and 2022, \n112\n, \n5,306\n, and \n3,084\n RSUs, respectively, were accelerated pursuant to the terms and conditions of the Omnibus Incentive Plan and related award agreements.\nF-35\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nGrant-Date Fair Values\nThe grant-date fair values of the time-vesting RSUs and PRSUs with performance condition vesting criteria are generally based on the closing price of our common stock on the grant date. However, the grant-date fair values for share-based awards with market condition vesting criteria are based on Monte-Carlo option pricing models. \nThe following table summarizes the significant inputs utilized in these models for such awards granted or modified during the years ended December 31, 2024, 2023, and 2022:\nFor the Years Ended December 31,\n2024\n2023\n2022\nExpected volatility\n(1)\n20.7\n% — \n24.6\n%\n20.5\n% — \n30.0\n%\n28.9\n% — \n33.6\n%\nRisk-free rate\n4.25\n%\n4.31\n% — \n4.62\n%\n1.72\n% — \n2.59\n%\nExpected holding period (years)\n2.83\n1.00\n — \n2.84\n2.84\n — \n3.00\n(1)\nExpected volatility was estimated based on the historical volatility of INVH’s realized returns and of the applicable index.\nSummary of Total Share-Based Compensation Expense\nDuring the years ended December 31, 2024, 2023, and 2022, we recognized share-based compensation expense as follows:\nFor the Years Ended December 31,\n2024\n2023\n2022\nGeneral and administrative\n$\n22,088\n \n$\n22,540\n \n$\n22,469\n \nProperty management expense\n5,830\n \n6,963\n \n6,493\n \nTotal\n$\n27,918\n \n$\n29,503\n \n$\n28,962\n \n \nAs of December 31, 2024, there is $\n26,702\n of unrecognized share-based compensation expense related to non-vested share-based awards which is expected to be recognized over a weighted average period of \n1.59\n years.\nNote 11—\nFair Value Measurements\nThe carrying amounts of restricted cash, certain components of other assets, accounts payable and accrued expenses, resident security deposits, and certain components of other liabilities approximate fair value due to the short maturity of these amounts. Our interest rate swap agreements, interest rate cap agreements, if any, and investments in equity securities with a readily determinable fair value are recorded at fair value on a recurring basis within our consolidated financial statements. The fair values of interest rate swaps and caps, which are classified as Level 2 in the fair value hierarchy, are estimated using market values of instruments with similar attributes and maturities. See Note 8 for the details of the consolidated balance sheet classification and the fair values for the interest rate swaps and caps. The fair values of our investments in equity securities with a readily determinable fair value are classified as Level 1 in the fair value hierarchy. For additional information related to our investments in equity and other securities as of December 31, 2024 and 2023, refer to Note 6.\nF-36\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nFinancial Instrument Fair Value Disclosures\nThe following table displays the carrying values and fair values of financial instruments as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\nCarrying\nValue\nFair\nValue\nCarrying\nValue\nFair\nValue\nAssets carried at historical cost on the consolidated balance sheets:\nInvestments in debt securities\n(1)\nLevel 2\n$\n54,619\n \n$\n52,768\n \n$\n86,471\n \n$\n84,591\n \nLiabilities carried at historical cost on the consolidated balance sheets:\nUnsecured Notes — public offering\n(2)\nLevel 1\n$\n3,526,544\n \n$\n3,218,156\n \n$\n3,029,856\n \n$\n2,725,884\n \nMortgage loans\n(3)\nLevel 2\n988,271\n \n945,386\n \n1,633,585\n \n1,576,813\n \nUnsecured Notes — private placement\n(4)\nLevel 2\n300,000\n \n251,855\n \n300,000\n \n245,766\n \nSecured Term Loan\n(5)\nLevel 3\n403,046\n \n358,222\n \n403,129\n \n369,402\n \nTerm Loan Facilities\n(6)\nLevel 3\n2,475,000\n \n2,478,006\n \n3,225,000\n \n3,230,747\n \nRevolving Facility\n(7)\nLevel 3\n570,000\n \n570,702\n \n—\n \n—\n \n(1)\nThe carrying values of investments in debt securities are shown net of discount.\n(2)\nThe carrying value of the Unsecured Notes — public offering includes $\n23,456\n and $\n20,144\n of unamortized discount and excludes $\n24,847\n and $\n23,211\n of deferred financing costs as of December 31, 2024 and 2023, respectively.\n(3)\nThe carrying values of the mortgage loans include $\n880\n and $\n1,232\n of unamortized discount and exclude $\n4,347\n and $\n6,329\n of deferred financing costs as of December 31, 2024 and 2023, respectively.\n(4)\nThe carrying value of the Unsecured Notes — private placement excludes $\n1,009\n and $\n1,178\n of deferred financing costs as of December 31, 2024 and 2023, respectively.\n(5)\nThe carrying value of the Secured Term Loan excludes $\n1,397\n and $\n1,614\n of deferred financing costs as of December 31, 2024 and 2023, respectively.\n(6)\nThe carrying values of the Term Loan Facilities exclude $\n28,959\n and $\n13,186\n of deferred financing costs as of December 31, 2024 and 2023, respectively.\n(7)\nThe carrying value of the Revolving Facility excludes deferred financing costs which are classified in other assets, net (see Note 6).\nWe value our Unsecured Notes — public offering using quoted market prices for each underlying issuance, a Level 1 price within the fair value hierarchy. The fair values of our investments in debt securities, Unsecured Notes — private placement, and mortgage loans, which are classified as Level 2 in the fair value hierarchy, are estimated based on market bid prices of comparable instruments at period end.\nWe review the fair value hierarchy classifications each reporting period. Changes in the observability of the valuation attributes may result in a reclassification of certain financial assets or liabilities. Such reclassifications are reported as transfers in and out of Level 3 at the beginning fair value for the reporting period in which the changes occur. Availability of secondary market activity and consistency of pricing from third-party sources impacts our ability to classify securities as Level 2 or Level 3.\nF-37\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nThe following table displays the significant unobservable inputs used to develop our Level 3 fair value measurements as of December 31, 2024:\nQuantitative Information about Level 3 Fair Value Measurement\n(1)\nFair Value\nValuation Technique\nUnobservable Input\nRate\nSecured Term Loan\n$\n358,222\n \nDiscounted Cash Flow\nEffective Rate\n5.65\n%\nTerm Loan Facilities\n2,478,006\n \nDiscounted Cash Flow\nEffective Rate\n4.90\n%\n—\n5.56\n%\nRevolving Facility\n570,702\n \nDiscounted Cash Flow\nEffective Rate\n4.82\n%\n—\n5.18\n%\n(1)\nOur Level 3 fair value instruments require interest only payments.\nNonrecurring Fair Value Measurements\nOur assets measured at fair value on a nonrecurring basis are those assets for which we have recorded impairments.\nSingle-Family Residential Properties\nThe single-family residential properties for which we have recorded impairments, measured at fair value on a nonrecurring basis, are summarized below:\nFor the Years Ended December 31,\n2024\n2023\n2022\nInvestments in single-family residential properties, net held for sale (Level 3):\nPre-impairment amount\n$\n2,936\n \n$\n2,208\n \n$\n1,208\n \nTotal impairments\n(\n506\n)\n(\n427\n)\n(\n310\n)\nFair value\n$\n2,430\n \n$\n1,781\n \n$\n898\n \nWe did not record any impairments for our investments in single-family residential properties, net held for use during the years ended December 31, 2024, 2023, and 2022. For additional information related to our single-family residential properties as of December 31, 2024 and 2023, refer to Note 3.\nF-38\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\n Note 12—\nEarnings per Share\nBasic and diluted EPS are calculated as follows:\nFor the Years Ended December 31,\n2024\n2023\n2022\n(in thousands, except share and per share data)\nNumerator:\nNet income available to common stockholders — basic and diluted\n$\n453,164\n \n$\n518,774\n \n$\n382,668\n \nDenominator:\nWeighted average common shares outstanding — basic\n612,551,317\n \n611,893,784\n \n609,770,610\n \nEffect of dilutive securities:\nIncremental shares attributed to non-vested share-based awards\n1,080,300\n \n1,394,924\n \n1,341,786\n \nWeighted average common shares outstanding — diluted\n613,631,617\n \n613,288,708\n \n611,112,396\n \nNet income per common share — basic\n$\n0.74\n \n$\n0.85\n \n$\n0.63\n \nNet income per common share — diluted\n$\n0.74\n \n$\n0.85\n \n$\n0.63\n \n \nIncremental shares attributed to non-vested share-based awards are excluded from the computation of diluted EPS when they are anti-dilutive. Because their inclusion would have been anti-dilutive, incremental shares attributed to non-vested share-based awards are excluded from the denominator. Anti-dilutive shares total \n133,464\n, \n3,125\n, and \n57,278\n for the years ended December 31, 2024, 2023, and 2022, respectively.\nFor the years ended December 31, 2024, 2023, and 2022, vested OP Units have been excluded from the computation of EPS because all income attributable to such vested OP Units has been recorded as non-controlling interest and thus excluded from net income available to common stockholders.\nIn connection with the SWH merger, we assumed certain convertible senior notes including $\n345,000\n in aggregate principal amount of \n3.50\n% convertible senior notes due 2022 issued by SWH in January 2017 (the “2022 Convertible Notes”). The outstanding balance of the 2022 Convertible Notes was settled in January 2022. As such, they had no effect on potential dilution for the years ended December 31, 2024 and 2023. For the year ended December 31, 2022, using the “if-converted” method, \n290,079\n potential shares of common stock issuable upon the conversion of the 2022 Convertible Notes are excluded from the computation of diluted EPS as they are anti-dilutive. Additionally, no adjustment to the numerator was required for interest expense related to the 2022 Convertible Notes for the year ended December 31, 2022 or any period subsequent thereto.\n \nNote 13—\nIncome Tax\nWe account for income taxes under the asset and liability method. For our taxable REIT subsidiaries, deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis and operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using the enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled. We provide a valuation allowance, from time to time, for deferred tax assets for which we do not consider realization of such assets to be more likely than not. As of December 31, 2024 and 2023, we have not recorded any deferred tax assets and liabilities or unrecognized tax benefits. We do not anticipate a significant change in unrecognized tax benefits within the next 12 months.\nF-39\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nNote 14—\nCommitments and Contingencies\nLease Commitments\nThe following table sets forth our fixed lease payment commitments as a lessee as of December 31, 2024, for the periods below:\nYear\nOperating\nLeases\nFinance\nLeases\n2025\n$\n4,402\n \n$\n3,147\n \n2026\n4,106\n \n3,058\n \n2027\n3,655\n \n2,576\n \n2028\n2,909\n \n707\n \n2029\n2,372\n \n—\n \nThereafter\n10,698\n \n—\n \nTotal lease payments\n28,142\n \n9,488\n \nLess: imputed interest\n(\n6,238\n)\n(\n852\n)\nTotal lease liability\n$\n21,904\n \n$\n8,636\n \n \nThe components of lease expense for the years ended December 31, 2024, 2023, and 2022 are as follows:\nFor the Years Ended December 31,\n2024\n2023\n2022\nOperating lease cost:\nFixed lease cost\n$\n4,225\n \n$\n3,317\n \n$\n3,284\n \nVariable lease cost\n1,574\n \n1,515\n \n1,498\n \nTotal operating lease cost\n$\n5,799\n \n$\n4,832\n \n$\n4,782\n \nFinance lease cost:\nAmortization of ROU assets\n$\n4,006\n \n$\n2,790\n \n$\n2,676\n \nInterest on lease liabilities\n581\n \n375\n \n234\n \nTotal finance lease cost\n$\n4,587\n \n$\n3,165\n \n$\n2,910\n \nNew-Build Commitments\nWe have entered into binding purchase agreements with certain homebuilders for the purchase of \n2,031\n homes over the next \nthree years\n. Remaining commitments under these agreements total approximately $\n590,000\n as of December 31, 2024.\nInsurance Policies\nPursuant to the terms of certain of our loan agreements (see Note 7), laws and regulations of the jurisdictions in which our properties are located, and general business practices, we are required to procure insurance on our properties. As of December 31, 2024, there are no material contingent liabilities related to uninsured losses with respect to our properties, except as noted below.\nF-40\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nHurricane-Related Losses\nDuring the year ended December 31, 2024, Hurricanes Milton, Beryl, Debby, and Helene damaged certain of our properties in Texas, Florida, Atlanta, and the Carolinas. We estimate that our homes incurred approximately $\n55,100\n of hurricane damage, net of estimated insurance recoveries, which has been expensed as casualty losses, impairment, and other on our consolidated statement of operations for the year ended December 31, 2024. Remaining unpaid estimated costs totaling $\n36,400\n are reflected in accounts payable and accrued expenses on our consolidated balance sheet as of December 31, 2024. As of December 31, 2024, we have recorded $\n6,400\n of receivables for the portion of the related damages we believe will be recoverable through our property and casualty insurance policies which provide coverage for wind and flood damage, as well as business interruption costs during the period of remediation and repairs, subject to specified deductibles and limits.\nLegal and Other Matters\nWe are subject to various legal proceedings and claims that arise in the ordinary course of our business as well as congressional and regulatory inquiries and engagements. We accrue a liability when we believe that it is both probable that a liability has been incurred and that we can reasonably estimate the amount of the loss. We do not believe that the final outcome of these proceedings or matters will have a material adverse effect on our consolidated financial statements, except as noted below.\nIn August 2021, the Federal Trade Commission (“FTC”) began investigating certain of our business practices. The inquiry related primarily to how we conduct our business generally and how business was conducted during the COVID-19 pandemic specifically. After fully cooperating with the inquiry and extensive negotiations with the FTC, we entered into a stipulated proposed order with the FTC, resolving all aspects of the inquiry without any admission of liability, which became final on September 27, 2024. Pursuant to the stipulated order, we paid $\n48,000\n of monetary relief, with no civil penalties, to the FTC during the year ended December 31, 2024. The full amount of the monetary relief and other costs associated therewith are included in other, net on our consolidated statements of operations.\nIn July 2024, we entered into an agreement which completely resolved the legal dispute entitled \nCity of San Diego et al v. Invitation Homes, Inc\n., fully releasing INVH without any admission of liability. Pursuant to the settlement agreement, we paid $\n19,993\n during the year ended December 31, 2024. The full settlement amount and other costs associated therewith are included in other, net on our consolidated statements of operations.\n Note 15—\nSegment Reporting\nOur principal business is investment in and management of single-family residential properties for lease. As of December 31, 2024, we wholly own \n85,138\n homes for lease, jointly own \n7,622\n homes for lease, and provide professional third-party property and asset management services for an additional \n17,678\n homes, all of which are primarily located in \n16\n core markets across the country. We have determined that these properties are managed on a consolidated basis and represent \none\n reportable segment.\nOur Chief Executive Officer is our chief operating decision maker (“CODM”). We concluded that we have \none\n reportable segment based on the way our CODM regularly reviews internally reported financial information to evaluate performance, make operating decisions, and allocate resources at a consolidated level. Net income as reported on our consolidated statements of operations is a primary metric utilized by the CODM to analyze the performance of the segment, including budget versus actual performance, and to allocate resources. The assets of our single reportable segment are reported as total assets on our consolidated balance sheets as our CODM does not use this measure to assess segment performance or to make resource allocation decisions. The accounting policies for the reportable segment are the same as those described in Note 2.\nF-41\nINVITATION HOMES INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(dollar amounts in thousands)\nSignificant Segment Expenses\nOur operating expenses are regularly reviewed by our CODM. All expenses are reviewed, but our CODM is regularly provided additional detail regarding the direct costs of operating our properties included in property operating and maintenance expense on our consolidated statements of operations. Other expense categories such as property management expense, general and administrative, depreciation and amortization, and interest expense are included on our consolidated statements of operations. \nThe following table sets forth the significant expenses that comprise property operating and maintenance expense on our consolidated statements of operations for the years ended December 31, 2024, 2023, and 2022:\nFor the Years Ended December 31,\n2024\n2023\n2022\nFixed expenses\n(1)\n$\n504,025\n \n$\n474,182\n \n$\n421,256\n \nControllable expenses\n(2)\n431,248\n \n406,153\n \n365,095\n \nTotal property operating and maintenance\n$\n935,273\n \n$\n880,335\n \n$\n786,351\n \n(1)\nFixed expenses include the following: property taxes; insurance expense; and HOA expenses.\n(2)\nControllable expenses include the following: repairs and maintenance; personnel, leasing, and marketing; turnover; and utilities and property administrative.\nNote 16—\nSubsequent Events\nIn connection with the preparation of the accompanying consolidated financial statements, we have evaluated events and transactions occurring after December 31, 2024, for potential recognition or disclosure.\nDividend Payment\nOn December 11, 2024, our board of directors declared a dividend of $\n0.29\n (actual $) per share to stockholders of record on December 26, 2024, resulting in a $\n176,952\n dividend payment on January 17, 2025 (see Note 9).\nF-42\nINVITATION HOMES INC.\n Schedule III Real Estate and Accumulated Depreciation \nAs of December 31, 2024 \n(dollar amounts in thousands) \n \n \n \n \nInitial Cost to Company \nCost Capitalized Subsequent to Acquisition \nGross Amount at Close of Period\n \nMarket \nNumber of\nProperties\n(1)\nNumber of\nEncumbered\nProperties\n(2)\nEncumbrances\n(2)\nLand \nDepreciable\nProperties  \nLand\nDepreciable\nProperties \nLand\nDepreciable\nProperties  \nTotal\n(3)\nAccumulated\nDepreciation  \nDate of\nConstruction\nDate\nAcquired \nDepreciable\nPeriod \nAtlanta\n12,594\n \n1,349\n \n$\n171,944\n \n$\n332,477\n \n$\n1,721,098\n \n$\n—\n \n$\n389,307\n \n$\n332,477\n \n$\n2,110,405\n \n$\n2,442,882\n \n$\n(\n642,563\n)\n1920-2024\n2012-2024\n7\n-\n32\n years\nCarolinas\n5,995\n \n529\n \n80,714\n \n225,700\n \n1,061,005\n \n—\n \n160,943\n \n225,700\n \n1,221,948\n \n1,447,648\n \n(\n284,141\n)\n1900-2024\n2012-2024\n7\n-\n32\n years\nChicago\n2,464\n \n—\n \n—\n \n124,418\n \n306,790\n \n—\n \n132,614\n \n124,418\n \n439,404\n \n563,822\n \n(\n162,480\n)\n1877-2015\n2012-2017\n7\n-\n32\n years\nDallas\n3,148\n \n518\n \n58,749\n \n152,771\n \n582,850\n \n—\n \n76,067\n \n152,771\n \n658,917\n \n811,688\n \n(\n132,158\n)\n1952-2024\n2017-2024\n7\n-\n32\n years\nDenver\n2,722\n \n449\n \n65,582\n \n266,597\n \n676,860\n \n—\n \n102,432\n \n266,597\n \n779,292\n \n1,045,889\n \n(\n165,266\n)\n1885-2023\n2017-2024\n7\n-\n32\n years\nHouston\n2,334\n \n285\n \n24,097\n \n79,981\n \n364,316\n \n—\n \n48,246\n \n79,981\n \n412,562\n \n492,543\n \n(\n91,994\n)\n1954-2024\n2017-2024\n7\n-\n32\n years\nIndianapolis\n1\n \n—\n \n—\n \n74\n \n164\n \n—\n \n—\n \n74\n \n164\n \n238\n \n(\n10\n)\n1996\n2023\n7\n-\n32\n years\nJacksonville\n2,003\n \n274\n \n41,295\n \n95,267\n \n264,840\n \n—\n \n74,697\n \n95,267\n \n339,537\n \n434,804\n \n(\n121,133\n)\n1955-2024\n2012-2024\n7\n-\n32\n years\nLas Vegas\n3,404\n \n209\n \n38,110\n \n161,019\n \n700,095\n \n—\n \n96,599\n \n161,019\n \n796,694\n \n957,713\n \n(\n193,915\n)\n1961-2019\n2012-2023\n7\n-\n32\n years\nMemphis\n1\n \n—\n \n—\n \n34\n \n211\n \n—\n \n—\n \n34\n \n211\n \n245\n \n(\n10\n)\n1998\n2023\n7\n-\n32\n years\nMinneapolis\n1,055\n \n5\n \n599\n \n62,324\n \n129,219\n \n—\n \n66,783\n \n62,324\n \n196,002\n \n258,326\n \n(\n77,201\n)\n1886-2015\n2013-2015\n7\n-\n32\n years\nNashville\n161\n \n—\n \n—\n \n11,183\n \n42,233\n \n—\n \n1,240\n \n11,183\n \n43,473\n \n54,656\n \n(\n799\n)\n1990-2024\n2023-2024\n7\n-\n32\n years\nNorthern California\n4,110\n \n615\n \n118,295\n \n336,151\n \n762,326\n \n—\n \n171,692\n \n336,151\n \n934,018\n \n1,270,169\n \n(\n291,547\n)\n1900-2019\n2012-2022\n7\n-\n32\n years\nOrlando\n6,790\n \n901\n \n125,528\n \n255,317\n \n1,062,867\n \n—\n \n216,635\n \n255,317\n \n1,279,502\n \n1,534,819\n \n(\n356,096\n)\n1947-2024\n2012-2024\n7\n-\n32\n years\nPhoenix\n9,229\n \n1,214\n \n187,080\n \n433,700\n \n1,380,859\n \n—\n \n276,461\n \n433,700\n \n1,657,320\n \n2,091,020\n \n(\n437,211\n)\n1929-2024\n2012-2024\n7\n-\n32\n years\nSeattle\n3,950\n \n148\n \n33,347\n \n323,763\n \n733,865\n \n—\n \n205,239\n \n323,763\n \n939,104\n \n1,262,867\n \n(\n266,562\n)\n1890-2022\n2012-2022\n7\n-\n32\n years\nSouth Florida\n8,135\n \n544\n \n118,886\n \n702,701\n \n1,495,378\n \n—\n \n283,119\n \n702,701\n \n1,778,497\n \n2,481,198\n \n(\n585,839\n)\n1937-2024\n2012-2024\n7\n-\n32\n years\nSouthern California\n7,269\n \n739\n \n171,759\n \n923,363\n \n1,405,033\n \n—\n \n278,588\n \n923,363\n \n1,683,621\n \n2,606,984\n \n(\n558,439\n)\n1900-2024\n2012-2024\n7\n-\n32\n years\nTampa\n9,536\n \n1,144\n \n156,212\n \n414,352\n \n1,623,533\n \n—\n \n286,104\n \n414,352\n \n1,909,637\n \n2,323,989\n \n(\n502,010\n)\n1923-2024\n2012-2024\n7\n-\n32\n years\nTotal\n84,901\n \n8,923\n \n$\n1,392,197\n \n$\n4,901,192\n \n$\n14,313,542\n \n$\n—\n \n$\n2,866,766\n \n$\n4,901,192\n \n$\n17,180,308\n \n$\n22,081,500\n \n$\n(\n4,869,374\n)\n(1)\nNumber of properties represents \n85,138\n total properties owned less \n237\n properties classified as held for sale and recorded in other assets, net on the consolidated balance sheet as of December 31, 2024.\n(2)\nNumber of encumbered properties and encumbrances include the number of properties secured by first priority mortgages under the mortgage loan and the Secured Term Loan, as well as the aggregate value of outstanding debt attributable to such properties. Excluded from this is original issue discount and deferred financing costs.\n(3)\nThe gross aggregate cost of total real estate in the table above for federal income tax purposes was approximately $\n20.3\n billion (unaudited) as of December 31, 2024. \nF-43\nINVITATION HOMES INC.\nSchedule III Real Estate and Accumulated Depreciation \n(dollar amounts in thousands) \n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nResidential Real Estate\n \nBalance at beginning of period\n$\n21,551,896\n \n$\n20,700,935\n \n$\n20,008,381\n \nAdditions during the period\nAcquisitions\n709,978\n \n995,255\n \n564,706\n \nInitial renovations\n30,041\n \n29,793\n \n111,243\n \nOther capital expenditures\n222,511\n \n216,792\n \n206,517\n \nDeductions during the period\nDispositions and other\n(\n423,842\n)\n(\n371,045\n)\n(\n176,768\n)\nReclassifications\nProperties held for sale, net of dispositions\n(\n9,084\n)\n(\n19,834\n)\n(\n13,144\n)\nBalance at close of period\n$\n22,081,500\n \n$\n21,551,896\n \n$\n20,700,935\n \nAccumulated Depreciation\nBalance at beginning of period\n$\n(\n4,262,682\n)\n$\n(\n3,670,561\n)\n$\n(\n3,073,059\n)\nDepreciation expense\n(\n699,474\n)\n(\n663,398\n)\n(\n629,301\n)\nDispositions and other\n86,929\n \n67,804\n \n28,475\n \nReclassifications\nProperties held for sale, net of dispositions\n5,853\n \n3,473\n \n3,324\n \nBalance at close of period\n$\n(\n4,869,374\n)\n$\n(\n4,262,682\n)\n$\n(\n3,670,561\n)\nF-44"
  }
}