{
  "ticker": "IP",
  "cik": "0000051434",
  "company_name": "INTERNATIONAL PAPER CO /NEW/",
  "filing_date": "2025-02-21",
  "accession": "0000051434-25-000013",
  "primary_doc": "ip-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGENERAL\nInternational Paper Company (the \"Company,\" \"International Paper\" or \"IP\", which may also be referred to as \"we\" or \"us\") is a global leader in sustainable packaging solutions. We produce renewable fiber-based packaging and pulp products with manufacturing operations in North America, Latin America, Europe and North Africa. We are a New York corporation, incorporated in 1941 as the successor to the New York corporation of the same name organized in 1898. You can learn more about us by visiting our website at www.internationalpaper.com.\nIn the United States, at December 31, 2024, the Company operated 22 pulp and packaging mills, 157 converting and packaging plants, 16 recycling plants and three bag facilities. Production facilities at December 31, 2024 in Canada, Europe, North Africa and Latin America included four pulp and packaging mills, 36 converting and packaging plants, and two recycling plants. We operate a packaging products distribution business principally through six branches in Asia. Substantially all of our businesses have experienced, and are likely to continue to experience, cycles relating to industry capacity and general economic conditions.\nWe are guided by our core values. We do the right things, in the right ways, for the right reasons, all of the time – this is The IP Way. Our overarching values are safety, ethics, and excellence.  \n•\nSafety – Above all else, we care about people. We look out for each other to ensure everyone returns home safely each day.\n•\nEthics – We act honestly and operate with integrity and respect. We promote a culture of openness and accountability. \n•\nExcellence – We set high expectations and aim to deliver outstanding results for each other, our customers and our shareholders.\nFor management and financial reporting purposes, our businesses are separated into two segments: Industrial Packaging and Global Cellulose Fibers. A description of these business segments can be found on page 42 of \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n. \nIn 2024, International Paper made significant strides to further enhance our performance-driven culture that we believe will enable us to create significant \nvalue for our employees, customers and share owners. In April 2024, International Paper announced a proposed business combination with DS Smith Plc (\"DS Smith\"), a global packaging, paper and recycling company and leading provider of sustainable fiber-based packaging headquartered in England in an all-stock transaction. This highly complementary business combination is designed to create a truly sustainable packaging solutions leader that can serve a broad set of customers across a wide range of attractive and growing end-markets to generate significant shareholder value. Shareholders of DS Smith and International Paper overwhelmingly approved the business combination at separate meetings in October 2024. On January 24, 2025, the Company announced plans to divest plants located in Mortagne, Saint-Amand, and Cabourg (France), Ovar (Portugal) and Bilbao (Spain) in connection with the European Commission’s clearance of the business combination. The business combination closed on January 31, 2025. Thereafter, the Company obtained a secondary listing of International Paper common stock on the London Stock Exchange (LSE: IPC) and established a Europe, Middle East and Africa (\"EMEA\") headquarters in DS Smith's existing main office in London. DS Smith re-registered as DS Smith Limited, a private limited company effective on February 5, 2025.  \nIn the third quarter of 2024, the Company also began implementing an 80/20 strategic approach to drive transformational performance. The 80/20 approach suggests that 80% of our results come from 20% of efforts. As applied to our business, the approach is used to determine the most impactful areas to focus on. Through the 80/20 strategic approach, we intend to deliver profitable market share growth by striving to be the lowest-cost producer and the most reliable and innovative sustainable packaging solutions provider to our customers across North America and EMEA. As part of the Company’s 80/20 strategic approach, the Company intends to guide investments and align resources to win with our most strategic customers, while reducing complexity and cost across the Company. \nTo that end, the Company initiated a corporate overhead restructuring plan in the third quarter of 2024 aimed at better aligning our workforce with the needs of the business and our customers, optimizing our organizational structure and reducing operating costs. Additionally, we committed to investing to strengthen our most competitive and strategic assets and closed facilities to structurally reduce operating costs. Further, in October 2024, we announced that we are exploring strategic options for our Global Cellulose Fibers business. \n1\nTable of Contents\nThese significant undertakings follow the September 2023 completion of the sale of our 50% equity interest in Ilim S.A. (\"Ilim\"), the sale of all of our Ilim Group shares (constituting a 2.39% stake) and divestment of other non-material residual interests associated with Ilim. Ilim was a joint venture that operated a pulp and paper business in Russia and has subsidiaries including Ilim Group. Following the completed sales, we no longer have an interest in Ilim or any of its subsidiaries, and no longer have any investments in Russia. As a result, all current and historical results of the Ilim investment reportable segment are presented as Discontinued Operations, net of taxes. See discussion in \nNote 10 - Equity Method Investments\n on page 75 of \nItem 8. Financial Statements and Supplementary Data\n.\nWe remain confident that the initiatives undertaken as part of our transformational journey in 2024 will unlock substantial value at IP and strengthen the Company for our employees, customers and shareholders.\nFrom 2020 through 2024, International Paper’s capital spending approximated $4.3 billion, excluding mergers and acquisitions. These expenditures reflect our continuing efforts to use our capital strategically to improve product quality and environmental performance, as well as lower costs, maintain reliability of operations and deploy strategic capital for capacity expansion. Capital spending in 2024 was approximately $921 million and is expected to be approximately $1.2 billion in 2025. You can find more information about capital spending on page 46 of \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n.\nDiscussions of acquisitions can be found in \nNote 7 Acquisitions\n on page 72 of \nItem 8. Financial Statements and Supplementary Data\n.\nYou can find discussions of restructuring charges and other special items on page 37 of \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n.\nThroughout this Annual Report on Form 10-K, we “incorporate by reference” certain information in parts of other documents filed with the Securities and Exchange Commission (\"SEC\"). The SEC permits us to disclose important information by referring you to those documents. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statements, along with all other reports and any amendments thereto filed with or furnished to the SEC, are publicly available free of charge on the Investors section of our website at www.internationalpaper.com as soon as reasonably practicable after we electronically file such material \nwith, or furnish it to, the SEC. We encourage you to refer to such information. \nOur website contains a significant amount of information about the Company, including our SEC filings and financial and other information for investors. The information that we post on our website could be deemed to be material information. We encourage investors, the media, and others interested in the Company to visit this website from time to time, as information is updated and new information is posted. The information contained on or connected to our website, however, is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this or any other report that we file with or furnish to the SEC. Our internet address is included as an inactive textual reference only.\nHUMAN CAPITAL\n \nEMPLOYEES \nAs of December 31, 2024, we have approximately 37,000 employees, nearly 31,000 of whom are located in the United States. Of our U.S. employees, 21,000 are hourly, with unions representing approximately 13,000 employees. Of this number, 9,600 are represented by the United Steelworkers union (\"USW\").\nInternational Paper, the USW, and several other unions have entered into five master agreements covering various U.S. mills and converting facilities. Four of the master agreements are with the USW and include members from the International Association of Machinists and Aerospace Workers, International Brotherhood of Electrical Workers, United Food and Commercial Workers International Union and Workers Unite at certain U.S. mills and converting facilities. The Company also has a master agreement with District Counsel 2, which is affiliated with the Printing Packaging & Production Workers Union of North America that covers additional converting facilities. Individual facilities continue to have local agreements for subjects not covered by the master agreements. If local facility agreements are not successfully negotiated at the time of expiration, under the terms of the master agreements, the local agreements will automatically renew with the same terms in effect.\nSAFETY AND WELLBEING\nAt International Paper, we prioritize the safety and well-being of every employee and contractor. Safety is core to who we are and how we operate – at IP we strive to put safety above all else. To achieve this, we are cultivating a resilient safety culture where every team member is empowered to stop work they \n2\nTable of Contents\nbelieve is unsafe. We work tirelessly to anticipate and address unexpected events by incorporating layers of protection, continuously enhancing our systems and engaging all team members in learning events to prevent injuries before they take place. In 2024, we engaged an independent safety consultant firm to help the Company improve workplace safety performance through risk assessments, safety culture development and programs designed to reduce accidents and injuries. We launched a Company-wide safety culture survey in 2024 to all U.S.-based employees. Results of the survey will be analyzed in 2025 with the goal of learning, growing and aspiring to achieve our Vision 2030 goal to create a 100% injury-free workplace for our team members and contractors. \nWe believe workplace safety includes psychological and emotional safety. At International Paper we also care deeply about the mental, emotional, physical and professional wellbeing of our employees by providing an Employee Assistance Program (“EAP”) at no cost to employees and family members. Our EAP offers coaching and counseling sessions aimed at problem solving, achieving goals, and dealing with stress and anxiety management through resilience. We embrace a holistic wellness approach providing employees with resources on incorporating wellness habits into their daily lives.\nHUMAN CAPITAL MANAGEMENT\nThe attraction, retention and development of our employees is critical to our success. We create a positive employee experience that begins at onboarding. Our Human Resources Talent Management Team hosts online Global New Employee Orientation for employees and each business conducts onsite new hire integration training unique to its business and/or facility. This experience continues through our continuous learning, development and performance management programs. We provide continuing education courses that are relevant to our industry and job functions within the Company, including both instructor-led and online training through our Learning Management System (“LMS”) MyLearning platform. Across the enterprise in 2024, employees completed 2.7 million learning activities through our platform.\nIn addition, we have created learning paths for specific positions that are designed to encourage an employee’s advancement and growth within our organization, such as our REACH (Recruit, Engage, Align College Hires) program and Global Manufacturing Training Initiative programs. Through REACH we recruit and develop early-career engineers and safety professionals for our U.S. mills, preparing them to become future leaders. We invest \nin the growth and development of our employees by providing a multi-dimensional approach to learning that empowers, intellectually grows and professionally develops our employees. Our Global Manufacturing Training Initiative provides training services to hourly operations and maintenance employees in our mills in a standardized and structured manner. On the converting side of our business, more than 200 front line and future leaders participated in our multi-day in-person Leadership Application and Professional Development and Manufacturing Management Associate Programs during 2024. \nWe develop leaders through our IP Leadership Institute offering a broad range of LMS virtual and in person resources, courses and workshops for individual contributors, people leaders and teams. We also offer peer mentoring and leadership and career development training to support and develop our employees. \nWe help our employees better themselves by offering tuition reimbursement to employees to pursue additional education to prepare for other positions at the Company. We also provide student loan assistance to help employees repay qualified student loans. These resources provide employees with the skills and support they need to achieve their career goals, build management skills and become leaders within our Company.\nThe labor market for both hourly and salaried workers continues to be competitive. For additional information regarding risks related to the current labor market, see",
    "item1a": "Item 1A. Risk Factors\n -  \nWe are subject to cybersecurity and information technology risks related to breaches of security pertaining to sensitive company, customer, employee and vendor information as well as breaches in technology used to manage operations and other business processes.\nThe Company carries cyber insurance which provides coverage in connection with cybersecurity                 breaches. \nEngagement of Third Parties\nThe Company engages third parties in connection with assessing, identifying and managing its         cybersecurity risks, including the following: \n•\nEngagement of an independent third party with incident response expertise to provide intelligence-based cybersecurity solutions and services to assist the Company with preparing for, preventing, investigating, responding to and remediating cybersecurity incidents, including attacks that target on-premise, cloud, and critical infrastructure environments. \n•\nEngagement of an independent third party to conduct an annual security program assessment of the controls, maturity and performance of the Company’s information security program and the information security risk associated with the Company’s business systems. The assessment uses the National Institute of Standards and Technology Cybersecurity Framework as its benchmark.\n•\nEngagement of a leading third-party service provider to annually perform an external and an internal penetration assessment using industry standard tools and techniques.\n \nAdditionally, our Internal Audit team conducts annual assessments of our cyber programs and controls.\n30\nTable of Contents\nOversight of Third Parties\nThe Company has processes to oversee and identify material risks from cybersecurity threats associated with the Company’s use of third-party service providers. In this regard, the Company’s cybersecurity risk management program takes into account third-party systems whereby the Company could be impacted by the compromise of the security of vendors or other business relations of the Company, and the Company has a comprehensive third-party access management system. In addition, the Company conducts risk-based due diligence on the profiles of third-party service providers with respect to cybersecurity risks prior to engagement, and providers of critical services are continuously monitored with respect to security risks. The Company also requires service providers to provide prompt notification of any actual or suspected breach impacting Company data or operations.\nGOVERNANCE \nRole of the Board of Directors and its Committees\nInternational Paper has an integrated board and executive-level governance structure that oversees risks from cybersecurity threats. The Company’s Board of Directors has primary oversight of our enterprise risk management program, which includes cybersecurity risk. Moreover, the Board of Directors is supported in its oversight by the Audit and Finance Committee and PPE Committee, which share oversight responsibilities related to the Company’s information security programs. The Audit and Finance Committee reviews management’s cybersecurity and information security risk management programs and controls, including processes for management’s identification and reporting of material cybersecurity incidents. The PPE Committee reviews technology issues pertinent to the Company including those associated with information and operational technology, cybersecurity and data security and assesses related Company strategies.\nOur Board of Directors, Audit and Finance Committee and PPE Committee each receives periodic updates on cybersecurity issues from \nmanagement (including our Chief Information Security Officer (“CISO”\n)). For example, the CISO provides reports to the Audit and Finance Committee and PPE Committee at least annually regarding cybersecurity risks, as well as plans and strategies to mitigate those risks. \nFurthermore, our ERM Council annually reports its activities either directly to the Board of Directors or through the Audit and Finance Committee.\n \nRole of Management\nAt a management level, our cybersecurity risk management program is led by our \nCISO\n. \nOur current CISO has been with the Company for over 30 years, worked in Information Technology for over 25 years, and has led the Company’s security efforts since 2011. He was appointed as the Company’s first CISO in 2019. Our CISO stays current on cybersecurity issues and trends through continuing education activities such as participation at conferences and in webinars. Our CISO reports to our Chief Financial Officer.  Additionally, our CISO and members of the cybersecurity team hold a number of industry recognized certifications, such as Certified Information Systems Security Professional, Certified Information Security Manager, and Certified Ethical Hacker, among others.\nThe Company has also adopted a cyber-incident response plan which provides for controls and procedures in connection with cybersecurity events, including escalation procedures summarized below. The cyber-incident response plan is designed to address non-operational and operational cybersecurity events. Evaluation and response to cybersecurity events is led by our Cybersecurity Incident Response Team (“CIRT”), under the direction of our CISO. The CIRT is comprised of subject matter experts representing information security, information technology, operational technology and legal. The CIRT performs an impact assessment with respect to cybersecurity incidents, gathers facts and provides a chronology of events in connection therewith, and leads remediation and recovery activities. Our General Counsel, Senior Vice President, Chief People and Strategy Officer, Chief Ethics and Compliance Officer (or their respective designees), and CISO review and assess significant non-operational data breaches. Cybersecurity events that meet specified criteria for operational impact are escalated for further review to our Business Continuity Incident Command Team (“Incident Command Team”). The Incident Command Team performs an initial assessment that includes evaluation of the cybersecurity event’s severity, response required, and estimated business cost, and leads the execution of business continuity plans to maintain Company operations. \nCybersecurity events meeting certain criteria are escalated to our Disclosure Committee, General Counsel and Chief Financial Officer for further review, and, if appropriate, may be further elevated for the review of the Board of Directors.\n The Disclosure Committee, General Counsel and Chief Financial Officer assess and determine materiality using the facts gathered and chronology of events provided by the Incident Command Team\n.\n31\nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. \nCYBERSECURITY\nRISK MANAGEMENT AND STRATEGY\nThe Company’s cybersecurity risk management processes are integrated into our overall risk management system.\n The Company has a formalized enterprise risk management program overseen by the \n29\nTable of Contents\nBoard of Directors and committees of the Board of Directors that addresses strategic, operational, financial, compliance, legal and information technologies and cybersecurity risks.  In addition, the Enterprise Risk Management Council (“ERM Council”) is a management-level team comprised of senior vice presidents and other business leaders responsible for managing enterprise risks and planning and organizing the activities of our organization to minimize the effects of risk on the Company's business and financial results. The ERM Council regularly reports to the Board of Directors on areas of risk and risk management. The Chief Financial Officer serves as the ERM Council Lead. The Chief Audit Executive serves as the ERM Council Process Owner.  \nAs part of our 80/20 strategic approach and our integration of DS Smith, the Company is evaluating how the ERM Council might operate in 2025 to ensure that our structure supports our strategic goals.  \nThe Company has an Information Technology (“IT”) Risk Governance Program that aligns with our enterprise risk management framework and assists with fulfilling oversight responsibilities for major IT risks, including cybersecurity risks. An enterprise Cyber Governance, Risk, and Compliance function manages overall Company cyber risk, coordinating risk management functions with each business.  Business and IT leaders conduct cyber risk reviews monthly within each business. These monthly reviews include the evaluation of new and evolving risks, management of risk mitigation plans, and a review of all cybersecurity incidents meeting certain criteria.\nOur Risk Assessment Program \nThe Company has a risk assessment program in place to assess, identify and manage material risks from cybersecurity threats. Cybersecurity risks the Company faces include targeted attacks, ransomware, malware, phishing attacks, data theft, other data or security breaches, virus and intrusion software, as well as attacks to our website, financial applications, operational technology, telecommunications and human resources data. Key aspects of the Company’s cybersecurity program include the following:\n•\nlayered technical protective capabilities and detective surveillance controls; \n•\nutilizing independent third parties to assess the Company’s practices related to, and provide expertise and assistance with, various aspects of information security, as further described below;\n•\ncourses and awareness training on information security for employees with Company email or access to Company \ndevices, including phishing, social engineering and other cybersecurity training as well as targeted training for specific roles based on responsibilities and risk level; \n•\nglobal security and privacy policies; and\n•\nbusiness continuity, incident response and disaster recovery procedures, including table top exercises involving senior leaders. \nThe Company does not believe that risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected the Company, including its business strategy, results of operations or financial condition.\n For a full discussion of cybersecurity risks facing the Company, please see \nPart I,"
  }
}