{
  "ticker": "IQV",
  "cik": "0001478242",
  "company_name": "IQVIA HOLDINGS INC.",
  "filing_date": "2025-02-13",
  "accession": "0001478242-25-000045",
  "primary_doc": "iqv-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business.”\nWe delivered another year of strong operating results in 2024 with our income from operations increasing over 11 percent and our cash flow from operating activities increasing over 26 percent from 2023. Our Technology & Analytics Solutions segment revenues and profit growth improved in the second half of the year as we captured opportunities relating to our clients increasing their spending. Our Research & Development Solutions segment also produced revenues and segment profit growth in 2024. Although we faced some challenges in our Research & Development Solutions segment in the latter half of 2024, and while we anticipate some of these challenges will persist into 2025, we consider these to be more short-term in nature. This segment overall is a long-cycle business. \nWe ended the year with our highest ever total company remaining performance obligations of approximately $33.5 billion as of December 31, 2024.\nWhile we experienced a decline in COVID-19 related work in 2024 versus 2023, overall COVID-19 related work was not material to operations. As of December 31, 2024, COVID-19 related work did not represent a material amount of our remaining performance obligations. \nWe continue to maintain strong liquidity. As of December 31, 2024, cash and cash equivalents were $1,702 million and we had $825 million drawn under our $2,000 million revolving credit facility. As of December 31, 2024, we were in compliance with the financial covenants under our debt agreements in all material respects and do not have material uncertainty about ongoing ability to meet the covenants of our credit arrangements.\nIndustry Outlook\nFor information about the industry outlook and markets that we operate in, refer to Part I, Item I, “Our Market Opportunity.”\nBusiness Combinations\nWe have completed and will continue to consider strategic business combinations to enhance our capabilities and offerings in certain areas, including various individually immaterial acquisitions during the years ended December 31, 2024 and 2023. These transactions were accounted for as business combinations and the acquired results of operations are included in our consolidated financial information since their respective closing dates. See Note 14 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K for additional information with respect to these business combinations.\nSources of Revenues\nTotal revenues are comprised of revenues from the provision of our services. We do not have any material product revenues.\n50\nCosts and Expenses\nOur costs and expenses are comprised primarily of our cost of revenues including reimbursed expenses and selling, general and administrative expenses. Cost of revenues includes compensation and benefits for billable employees and personnel involved in production, trial monitoring, data management and delivery, and the costs of acquiring and processing data for our information offerings; costs of staff directly involved with delivering technology-related services offerings and engagements, related accommodations and the costs of data purchased specifically for technology services engagements; and other expenses directly related to service contracts such as courier fees, laboratory supplies, professional services and travel expenses. Reimbursed expenses, which are included in cost of revenues, are comprised principally of payments to investigators who oversee clinical trials and travel expenses for our clinical monitors and sales representatives. Selling, general and administrative expenses include costs related to sales, marketing and administrative functions (including human resources, legal, finance, quality assurance, compliance and general management) for compensation and benefits, travel, professional services, training and expenses for information technology and facilities. We also incur costs and expenses associated with depreciation and amortization.\nForeign Currency Translation\nIn 2024, approximately 30% of our revenues were denominated in currencies other than the United States dollar, which represents approximately 60 currencies. Because a large portion of our revenues and expenses are denominated in foreign currencies and our financial statements are reported in United States dollars, changes in foreign currency exchange rates can significantly affect our results of operations. The revenues and expenses of our foreign operations are generally denominated in local currencies and translated into United States dollars for financial reporting purposes. Accordingly, exchange rate fluctuations will affect the translation of foreign results into United States dollars for purposes of reporting our consolidated results. As a result, we believe that reporting results of operations that exclude the effects of foreign currency rate fluctuations on certain financial results can facilitate analysis of period to period comparisons. This constant currency information assumes the same foreign currency exchange rates that were in effect for the comparable prior-year period were used in translation of the current period results. As such, the differences noted below between reported results of operations and constant currency information is wholly attributable to the effects of foreign currency rate fluctuations.\nConsolidated Results of Operations\nFor information regarding our results of operations for our Technology & Analytics Solutions, Research & Development Solutions and Contract Sales & Medical Solutions segments, refer to “Segment Results of Operations” later in this section.\nFor a discussion of our results of operations comparison for 2023 and 2022, refer to our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed on February 15, 2024. \nRevenues\nYear Ended December 31,\nChange\n2024 vs. 2023\n2023 vs. 2022\n(dollars in millions)\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues\n$\n15,405 \n$\n14,984 \n$\n14,410 \n$\n421 \n2.8 \n%\n$\n574 \n4.0 \n%\n2024 compared to 2023\nIn 2024, our revenues increased $421 million, or 2.8%, as compared to 2023. This increase was comprised of constant currency revenue growth of approximately $510 million, or 3.4%, reflecting a $333 million increase in Technology & Analytics Solutions, a $167 million increase in Research & Development Solutions, and a $10 million increase in Contract Sales & Medical Solutions.\n51\nCost of Revenues, exclusive of Depreciation and Amortization\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\n2022\nCost of revenues, exclusive of depreciation and amortization\n$\n10,030 \n$\n9,745 \n$\n9,382 \n% of revenues\n65.1 \n%\n65.0 \n%\n65.1 \n%\n2024 compared to 2023\nWhen compared to 2023, cost of revenues, exclusive of depreciation and amortization increased $285 million in 2024, or 2.9%. This increase included a constant currency increase of approximately $643 million, or 6.6%, comprised of a $261 million increase in Technology & Analytics Solutions, a $374 million increase in Research & Development Solutions, and an $8 million increase in Contract Sales & Medical Solutions.\nAs a percentage of revenues, cost of revenues, exclusive of depreciation and amortization in 2024 remained relatively consistent with 2023.\nSelling, General and Administrative Expenses\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\n2022\nSelling, general and administrative expenses\n$\n1,992 \n$\n2,053 \n$\n2,071 \n% of revenues\n12.9 \n%\n13.7 \n%\n14.4 \n%\n2024 compared to 2023\nThe $61 million decrease in selling, general and administrative expenses in 2024 as compared to 2023 included a constant currency decrease of approximately $33 million, or 1.6%, comprised of a $52 million increase in Technology & Analytics Solutions, a $42 million increase in Research & Development Solutions, and a $2 million increase in Contract Sales & Medical Solutions, offset by a $129 million decrease in general corporate and unallocated expenses. \nDepreciation and Amortization\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\n2022\nDepreciation and amortization\n$\n1,114 \n$\n1,125 \n$\n1,130 \n% of revenues\n7.2 \n%\n7.5 \n%\n7.8 \n%\nThe $11 million decrease in depreciation and amortization in 2024 as compared to 2023 was primarily the result of less amortization of certain intangible assets from the merger between Quintiles and IMS Health, offset by an increase in amortization of capitalized software and of intangible assets from acquisitions occurring in 2023 and 2024.\nRestructuring Costs\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nRestructuring costs\n$\n67 \n$\n84 \n$\n28 \nThe restructuring costs incurred were due to ongoing efforts to streamline our global operations and reduce overcapacity to adapt to changing market conditions and integrate acquisitions. These restructuring actions are expected to occur throughout \n2025\n and are expected to consist of consolidating functional activities, eliminating redundant positions, and aligning resources with customer requirements.\n52\nInterest Income and Interest Expense\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nInterest income\n$\n(47)\n$\n(36)\n$\n(13)\nInterest expense\n$\n670 \n$\n672 \n$\n416 \nInterest income included interest received primarily from bank balances and investments. The increase in 2024 as compared to 2023 is primarily a result of higher deposit rates.\nInterest expense during 2024 was lower than 2023 due primarily to lower base rate interest costs across the floating rate debt portfolio. \nLoss on Extinguishment of Debt\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nLoss on extinguishment of debt\n$\n— \n$\n6 \n$\n— \nIn 2023 we recognized a loss on extinguishment of debt of \n$6 million\n for fees and expenses incurred related to the refinancing of our Credit Agreement. No such activity occurred in 2024.\nOther (income) expense, net\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nOther (income) expense, net\n$\n(90)\n$\n(124)\n$\n33 \nOther (income) expense, net for 2024 decreased compared to 2023 primarily due to less foreign currency gain on transactions.\nIncome Tax Expense\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\n2022\nIncome tax expense \n$\n301 \n$\n101 \n$\n260 \nEffective income tax rate\n18.0 \n%\n6.9 \n%\n19.1 \n%\nOur effective income tax rate was favorably impacted in 2023, due to the completion of an internal legal entity restructuring that resulted in a benefit of $125 million. Historically, we recorded deferred tax assets related to certain foreign tax credits, and a full valuation allowance in relation to these foreign tax credits was established as it was not expected the credits would be utilized prior to expiration. We now believe it is reasonably possible that these foreign tax credits will be utilized and therefore we recorded a tax benefit of $64 million related to the valuation allowance release and establishing related uncertain tax positions. Additionally, due to the restructuring we also reversed a deferred tax liability of $61 million due to a basis difference that was recovered in a tax-free manner. The effective tax rate was also favorably impacted by a reversal of uncertain tax positions relating to tax credit carryforwards in the amount of $21 million due to an audit settlement.\nEquity in Earnings (Losses) of Unconsolidated Affiliates\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nEquity in earnings (losses) of unconsolidated affiliates\n$\n5 \n$\n— \n$\n(12)\nEquity in earnings (losses) of unconsolidated affiliates increased in 2024 compared to 2023 due to the results in the operations of our unconsolidated affiliates.\n53\nSegment Results of Operations\nRevenues and profit by segment are as follows:\nSegment Revenues\nSegment Profit\n(in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nTechnology & Analytics Solutions\n$\n6,160 \n$\n5,862 \n$\n5,746 \n$\n1,522 \n$\n1,490 \n$\n1,550 \nResearch & Development Solutions\n8,527 \n8,395 \n7,921 \n1,948 \n1,915 \n1,695 \nContract Sales & Medical Solutions\n718 \n727 \n743 \n47 \n49 \n42 \nTotal\n15,405 \n14,984 \n14,410 \n3,517 \n3,454 \n3,287 \nGeneral corporate and unallocated expenses\n(134)\n(268)\n(330)\nDepreciation and amortization\n(1,114)\n(1,125)\n(1,130)\nRestructuring costs\n(67)\n(84)\n(28)\nConsolidated\n$\n15,405 \n$\n14,984 \n$\n14,410 \n$\n2,202 \n$\n1,977 \n$\n1,799 \nCertain costs are not allocated to our segments and are reported as general corporate and unallocated expenses. These costs primarily consist of stock-based compensation and expenses related to integration activities and acquisitions, as well as certain general corporate and unallocated expenses. We also do not allocate restructuring costs, depreciation and amortization, or impairment charges, if any, to our segments. \nTechnology & Analytics Solutions    \nYear Ended December 31,\nChange\n(dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\n$\n6,160 \n$\n5,862 \n$\n5,746 \n$\n298 \n5.1%\n$\n116 \n2.0%\nCost of revenues, exclusive of depreciation and amortization\n3,721 \n3,496 \n3,348 \n225 \n6.4\n148 \n4.4\nSelling, general and administrative expenses\n917 \n876 \n848 \n41 \n4.7\n28 \n3.3\nSegment profit\n$\n1,522 \n$\n1,490 \n$\n1,550 \n$\n32 \n2.1%\n$\n(60)\n(3.9)%\nRevenues\n2024 compared to 2023\nTechnology & Analytics Solutions’ revenues were $6,160 million in 2024, an increase of $298 million, or 5.1%, over 2023. This increase was comprised of constant currency revenue growth of approximately $333 million, or 5.7%, reflecting revenue growth primarily in the Europe and Africa region and to a lesser extent in the Americas region. The constant currency revenue growth was primarily driven by an increase in real world services and to a lesser extent by information and technology services. The constant currency revenue growth for the year was impacted by a decrease in COVID-19 related work.\nCost of Revenues, exclusive of Depreciation and Amortization\n2024 compared to 2023\nTechnology & Analytics Solutions’ cost of revenues, exclusive of depreciation and amortization, increased $225 million, or 6.4%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $261 million, or 7.5%, reflecting primarily an increase in compensation and related expenses, and to a lesser extent increases in reimbursed expenses and costs of acquiring and processing data, all to support revenue growth.\n54\nSelling, General and Administrative Expenses\n2024 compared to 2023\nTechnology & Analytics Solutions’ selling, general and administrative expenses increased $41 million, or 4.7%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $52 million, or 5.9%, reflecting an increase in compensation and related expenses.\nResearch & Development Solutions\nYear Ended December 31,\nChange\n(dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\n$\n8,527 \n$\n8,395 \n$\n7,921 \n$\n132 \n1.6%\n$\n474 \n6.0%\nCost of revenues, exclusive of depreciation and amortization\n5,698 \n5,629 \n5,395 \n69 \n1.2\n234 \n4.3\nSelling, general and administrative expenses\n881 \n851 \n831 \n30 \n3.5\n20 \n2.4\nSegment profit\n$\n1,948 \n$\n1,915 \n$\n1,695 \n$\n33 \n1.7%\n$\n220 \n13.0%\nBacklog\nResearch & Development Solutions' contracted backlog increased from $29.7 billion as of December 31, 2023 to $31.1 billion as of December 31, 2024 and we expect approximately $7.9 billion of this backlog to convert to revenues in the next 12 months. Contracted backlog was $27.2 billion as of December 31, 2022. \nBacklog represents, at a particular point in time, future revenues from work not yet completed or performed under signed contracts. Once work begins on a project, revenues are recognized over the duration of the project. \nWe believe that backlog is an indicator of future revenues but the timing of revenues will be affected by a number of factors, including the variable size and duration of projects, many of which are performed over several years, cancellations, and changes to the scope of work during the course of projects. Projects that have been delayed remain in backlog, but the timing of the revenues generated may differ from the timing originally expected. Additionally, projects may be terminated or delayed by the customer or delayed by regulatory authorities. In the event that a client cancels a contract, we typically would be entitled to receive payment for all services performed up to the cancellation date and subsequent client-authorized services related to winding down the canceled project. For more details regarding risks related to our backlog, see Part I, Item IA, “Risk Factors—Risks Related to our Business—The relationship of backlog to revenues varies over time.”\nRevenues\n2024 compared to 2023\nResearch & Development Solutions’ revenues were $8,527 million in 2024, an increase of $132 million, or 1.6%, over 2023. This increase was comprised of constant currency revenue growth of approximately $167 million, or 2.0%, reflecting revenue growth in the Asia-Pacific and Europe and Africa regions. The constant currency revenue growth was primarily the result of volume-related increases in clinical services and to a lesser extent from volume-related increases in lab testing. The constant currency revenue growth was impacted by a decrease in COVID-19 related work. \nCost of Revenues, exclusive of Depreciation and Amortization\n2024 compared to 2023\nResearch & Development Solutions’ cost of revenues, exclusive of depreciation and amortization, increased $69 million, or 1.2%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $374 million, or 6.6%, reflecting primarily an increase in compensation and related expenses and to a lesser extent an increase in other direct costs because of volume-related increases in clinical services and lab testing.\n55\nSelling, General and Administrative Expenses\n2024 compared to 2023\nResearch & Development Solutions’ selling, general and administrative expenses increased $30 million, or 3.5%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $42 million, or 4.9%, reflecting an increase in compensation and related expenses.\nContract Sales & Medical Solutions\nYear Ended December 31,\nChange\n(dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\n$\n718 \n$\n727 \n$\n743 \n$\n(9)\n(1.2)%\n$\n(16)\n(2.2)%\nCost of revenues, exclusive of depreciation and amortization\n611 \n620 \n639 \n(9)\n(1.5)\n(19)\n(3.0)\nSelling, general and administrative expenses\n60 \n58 \n62 \n2 \n3.4\n(4)\n(6.5)\nSegment profit\n$\n47 \n$\n49 \n$\n42 \n$\n(2)\n(4.1)%\n$\n7 \n16.7%\nRevenues\n2024 compared to 2023\nContract Sales & Medical Solutions’ revenues were $718 million in 2024, a decrease of $9 million, or 1.2%, over 2023. This decrease included constant currency revenue growth of approximately $10 million, or 1.4%, reflecting revenue growth primarily in the Europe and Africa region and to a lesser extent in the Asia-Pacific region.\nCost of Revenues, exclusive of Depreciation and Amortization\n2024 compared to 2023\nContract Sales & Medical Solutions’ cost of revenues, exclusive of depreciation and amortization, decreased $9 million, or 1.5%, in 2024 as compared to 2023. This decrease included a constant currency increase of approximately $8 million, or 1.3%, reflecting primarily an increase in costs associated with supporting revenue growth.\nSelling, General and Administrative Expenses\n2024 compared to 2023\nContract Sales & Medical Solutions’ selling, general and administrative expenses increased $2 million, or 3.4%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $2 million, or 3.4%.\n56\nLiquidity and Capital Resources\nOverview\nWe assess our liquidity in terms of our ability to generate cash to fund our operating, investing and financing activities. Our principal source of liquidity is operating cash flows. In addition to operating cash flows, other significant factors that affect our overall management of liquidity include: capital expenditures, acquisitions, investments, debt service requirements, equity repurchases, adequacy of our revolving credit and receivables financing facilities, and access to the capital markets. \nWe manage our worldwide cash requirements by monitoring the funds available among our subsidiaries and determining the extent to which those funds can be accessed on a cost-effective basis. The repatriation of cash balances from certain of our subsidiaries could have adverse tax consequences; however, those balances are generally available without legal restrictions to fund ordinary business operations. We have and expect to transfer cash from those subsidiaries to the United States and to other international subsidiaries when it is cost effective to do so.\nWe had a cash balance of $1,702 million as of December 31, 2024 ($713 million of which was in the United States), an increase from $1,376 million as of December 31, 2023.\nBased on our current operating plan, we believe that our available cash and cash equivalents, future cash flows from operations and our ability to access funds under our revolving credit and receivables financing facilities will enable us to fund our operating requirements, capital expenditures, contractual obligations, and meet debt obligations for at least the next 12 months. We regularly evaluate our debt arrangements, as well as market conditions, and from time to time we may explore opportunities to modify our existing debt arrangements or pursue additional financing arrangements that could result in the issuance of new debt securities by us or our affiliates. We may use our existing cash, cash generated from operations or dispositions of assets or businesses and/or proceeds from any new financing arrangements or issuances of debt or equity securities to repay or reduce some of our outstanding obligations, to repurchase shares from our stockholders or for other purposes. As part of our ongoing business strategy, we also continually evaluate new acquisition, expansion and investment possibilities or other strategic growth opportunities, as well as potential dispositions of assets or businesses, as appropriate, including dispositions that may cause us to recognize a loss on certain assets. Should we elect to pursue any such transaction, we may seek to obtain debt or equity financing to facilitate those activities. Our ability to enter into any such potential transactions and our use of cash or proceeds is limited to varying degrees by the terms and restrictions contained in our existing debt arrangements. We cannot provide assurances that we will be able to complete any such financing arrangements or other transactions on favorable terms or at all.\nEquity Repurchase Program\nOn February 5, 2025, the Board increased the stock repurchase authorization under the Repurchase Program with respect to the repurchase of the Company's common stock by an additional $2,000 million, which increased the total amount that has been authorized under the Repurchase Program to $13,725 million. The Repurchase Program does not obligate us to repurchase any particular amount of common stock, and it may be modified, extended, suspended or discontinued at any time.\nAs of December 31, 2024, we had remaining authorization to repurchase up to $1,013 million of our common stock under the Repurchase Program. In addition, from time to time, we have repurchased and may continue to repurchase common stock through private or other transactions outside of the Repurchase Program.\nAdditional information regarding the Repurchase Program is presented in Part II, Item 5 “Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities” and Note 13 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nDebt\nAs of December 31, 2024, we had $14,045 million of total indebtedness, excluding $1,170 million of additional available borrowings under our revolving credit facility. See Note 10 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K for additional details regarding our credit arrangements.\nOur long-term debt arrangements contain customary restrictive covenants and, as of December 31, 2024, we believe we were in compliance with our restrictive covenants in all material respects.\n57\nSenior Secured Credit Facilities\nAs of December 31, 2024, the\n Fifth Amended and Restated Credit Agreement (the \"\nCredit Agreement\") provided financing through several senior secured credit facilities (collectively, the “senior secured credit facilities”) of up to approximately $6,585 million, which consisted of $5,415 million principal amounts of debt outstanding and $1,170 million of available borrowing capacity on the revolving credit facility and standby letters of credit, with a total capacity of $2,000 million. The revolving credit facility is comprised of a $1,175 million senior secured revolving facility available in U.S. dollars, a $600 million senior secured revolving facility available in U.S. dollars, Euros, Swiss Francs and other foreign currencies, and a $225 million senior secured revolving facility available in U.S. dollars and Yen. The revolving credit facility under the Credit Agreement matures in August 2026, the term A loans mature in August 2026 and June 2027, while the term B loans under the Credit Agreement mature in 2025 and 2031. We are required to make scheduled quarterly payments on the term A loans equal to 1.25% of the original principal amount, with the remaining balance paid at maturity. The US dollars term B loan requires us to make scheduled quarterly payments equal to 0.25% of the original principal balance amount, with the remaining principal balance due at maturity. In addition, beginning with fiscal year ending December 31, 2017, we were required to apply 50% of excess cash flow (as defined in the Credit Agreement), subject to a reduction to 25% or 0% depending upon our senior secured first lien net leverage ratio, for prepayment of the term loans, with any such prepayment to be applied toward principal payments due in subsequent quarters. We are also required to pay an annual commitment fee that ranges from 0.20% to 0.35% in respect of any unused commitments under the revolving credit facility. The senior secured credit facilities are collateralized by substantially all of our assets and the assets of our material domestic subsidiaries including 100% of the equity interests of substantially all of our material domestic subsidiaries and 66% of the equity interests of substantially all of our first-tier material foreign subsidiaries and their domestic subsidiaries.\nFor information regarding the senior secured credit facilities, see Note 10 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nSenior Secured Notes and Senior Notes\nFor information regarding the senior secured notes and senior notes, see Note 10 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nReceivables Financing Facility\nFor information regarding the receivables financing facility, see Note 10 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K. As of December 31, 2024, no additional amounts of revolving loan commitments were available under the receivables financing facility.\nYears ended December 31, 2024, 2023 and 2022\nCash Flow from Operating Activities\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n2,716\n \n$\n2,149 \n$\n2,260 \n2024 compared to 2023\nCash provided by operating activities increased $567 million in 2024 as compared to 2023. The increase is primarily due to an increase in cash from accounts receivable and unbilled services ($570 million), an increase in cash-related net income ($129 million), more cash from unearned income ($38 million), and less cash used for income tax and other payables ($9 million), offset by more cash used for accounts payable and accrued expenses ($152 million) and more cash used for prepaid expenses and other assets ($27 million).\n58\nCash Flow from Investing Activities\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet cash used in investing activities\n$\n(1,444)\n$\n(1,603)\n$\n(2,006)\n2024 compared to 2023\nCash used in investing activities decreased $159 million in 2024 as compared to 2023, primarily due to less cash used for the acquisition of businesses, net of cash acquired ($141 million), less cash used for the acquisition of property, equipment, and software ($47 million), less cash used for investments in debt and equity securities ($36 million), less cash used for purchases of marketable securities ($6 million), and cash received from sale of property, equipment and software ($25 million), offset by more cash used for investments in unconsolidated affiliates, net ($93 million), and less cash from other sources ($3 million). \nCash Flow from Financing Activities\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet cash used in financing activities\n$\n(878)\n$\n(382)\n$\n(329)\n2024 compared to 2023\nCash used in financing activities increased $496 million in 2024 as compared to 2023, primarily due to less cash provided by proceeds from debt issuances, net of payment of debt issuance costs ($3,951 million), more cash used to repurchase common stock ($358 million), and more cash payments related to employee stock option plans ($3 million), offset by less debt payments ($2,701 million), less\n \ncash used in repayments of revolving credit facilities, net of proceeds ($1,050 million), and less\n \ncash payments on contingent consideration and deferred purchase price accruals ($65 million). \nContingencies\nWe are exposed to certain known contingencies that are material to our investors. The facts and circumstances surrounding these contingencies and a discussion of their effect on us are included in Note 12 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K. These contingencies may have a material effect on our liquidity, capital resources or results of operations. In addition, even where our accruals are adequate, the incurrence of any of these liabilities may have a material effect on our liquidity and the amount of cash available to us for other purposes.\nWe believe that we have made appropriate arrangements in respect of the future effect on us of these known contingencies. We also believe that the amount of cash available to us from our operations, together with cash from financing, will be sufficient for us to pay any known contingencies as they become due without materially affecting our ability to conduct our operations and invest in the growth of our business.\n59\nInformation about our Guarantors and the Issuer of our Guaranteed Securities\nIQVIA Inc. (the “Issuer”), a wholly owned subsidiary of IQVIA Holdings Inc., completed the issuance and sale of $1,250 million in gross proceeds of the Issuer’s 6.250% senior secured notes due 2029 (the “2029 Senior Secured Notes”) on November 28, 2023, and completed the issuance and sale of $750 million in gross proceeds of the Issuer’s 5.700% senior secured notes due 2028 (the “2028 Senior Secured Notes”) on May 23, 2023. \nIn February 2024, the Issuer completed an exchange offer in which it issued $1,250 million aggregate principal amount of 6.250% Senior Secured Notes due 2029 registered under the Securities Act (the “2029 Registered Notes”) and $750 million aggregate principal amount of 5.700% Senior Secured Notes due 2028 registered under the Securities Act (the “2028 Registered Notes” and, together with the 2029 Registered Notes, the 2029 Senior Secured Notes, and the 2028 Senior Secured Notes, the “Notes”) in exchange for the same principal amount and substantially identical terms of the 2029 Senior Secured Notes and 2028 Senior Secured Notes, respectively.\nThe accompanying summarized financial information has been prepared and presented pursuant to Rule 3-10 of Regulation S-X, “Financial Statements of Guarantors and Issuers of Guaranteed Securities Registered or Being Registered,” and Rule 13-01 of Regulation S-X, “Financial Disclosures about Guarantors and Issuers of Guaranteed Securities and Affiliates Whose Securities Collateralized a Registrant’s Securities.” Each of our current direct and indirect material U.S. wholly owned restricted subsidiaries (excluding IQVIA Solutions Japan LLC and IQVIA Services Japan LLC) (the \"Guarantor subsidiaries\" and, together with IQVIA Holdings Inc., the “Guarantors”), have jointly and severally, irrevocably and unconditionally, on a senior secured basis, guaranteed the obligations under the Notes. \nThe following presents the summarized financial information on a combined basis for IQVIA Holdings Inc. (parent company), IQVIA Inc. (issuer of the guaranteed obligations) and the Guarantor subsidiaries, which are collectively referred to as the “obligated group.” \nEach Guarantor subsidiary is consolidated by IQVIA Holdings Inc. as of December 31, 2024 and \nDecember 31, 2023\n. Refer to Exhibit 22.1 to this Annual Report on Form 10-K for the detailed list of entities included within the obligated group as of December 31, 2024.\nThe guarantee of a Guarantor subsidiary with respect to the Notes will be automatically and unconditionally released and discharged and shall terminate and be of no further force and effect, and no further action by such Guarantor subsidiary, the Issuer, or U.S. Bank Trust Company, National Association, as trustee, be required upon the occurrence of any of the following:\na.\nany sale, exchange, issuance, disposition or transfer (by merger, amalgamation, consolidation or otherwise) of (i) the capital stock of such Guarantor, after which the applicable Guarantor is no longer a Restricted Subsidiary, or (ii) all or substantially all of the assets of such Guarantor, in each case if such sale, exchange, issuance, disposition or transfer is made in compliance with the applicable provisions of this Indenture;\nb.\nthe release or discharge of the guarantee by such Guarantor of indebtedness under the senior secured term loan facilities and the senior secured revolving credit facilities under that certain Fifth Amended and Restated Credit Agreement, or the release or discharge of such other guarantee that resulted in the creation of such Guarantee, except, in each case, a discharge or release by or as a result of payment of such Indebtedness or under such guarantee (it being understood that a release subject to a contingent reinstatement is still a release, and that if any such guarantee is so reinstated, such Guarantee shall also be reinstated to the extent that such Guarantor would then be required to provide a Guarantee pursuant to Section 4.11 of the Indenture);\nc.\nthe designation of any Restricted Subsidiary that is a Guarantor as an Unrestricted Subsidiary in compliance with the applicable provisions of the Indenture; \nd.\nthe exercise by the Issuer of its Legal Defeasance option or Covenant Defeasance option in accordance with Article VIII of the Indenture or the discharge of the Issuer’s obligations under the Indenture in accordance with the terms of this Indenture;\ne.\nthe merger, amalgamation or consolidation of any Guarantor with and into the Issuer or a Guarantor that is the surviving Person in such merger, amalgamation or consolidation, or upon the liquidation of a Guarantor following the transfer of all or substantially all of its assets, in each case in a transaction that complies with the applicable provisions of this Indenture; or\n60\nf.\nas described in Article IX of the Indenture.\nSummarized Combined Financial Information of the Issuer and Guarantors:\nEach entity in the summarized combined financial information follows the same accounting policies as described in the consolidated financial statements, see Note 1 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K. Information for the non-Guarantor subsidiaries has been excluded from the combined summarized financial information of the obligated group. The accompanying summarized combined financial information does not reflect investments of the obligated group in non-Guarantor subsidiaries. The financial information of the obligated group is presented on a combined basis; intercompany balances and transactions within the obligated group have been eliminated. The obligated group’s amounts due from and amounts due to non-Guarantor subsidiaries and related parties, if any, have been presented in separate line items.\nThe following table contains summarized combined financial information from the Statements of Unaudited Condensed Consolidated Financial Position of the obligated group as of:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nTotal current assets (excluding amounts due from subsidiaries that are non-Guarantors)\n$\n935\n \n$\n805 \nTotal noncurrent assets\n$\n10,937\n \n$\n9,622 \nAmounts due from subsidiaries that are non-Guarantors\n$\n4,952\n \n$\n4,762 \nTotal current liabilities\n$\n3,792\n \n$\n3,471 \nTotal noncurrent liabilities\n$\n12,333\n \n$\n12,334 \nAmounts due to subsidiaries that are non-Guarantors\n$\n6,341\n \n$\n5,556 \nThe following table contains summarized combined financial information from the Statements of Unaudited Condensed Consolidated Operations of the obligated group:\nTwelve months ended\nTwelve months ended\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nNet revenues\n$\n6,661\n \n$\n6,299 \nCosts and expenses applicable to net revenues\n$\n4,145\n \n$\n4,190 \nIncome from operations\n$\n1,259\n \n$\n912 \nNet income \n$\n554\n \n$\n86 \nOff-Balance Sheet Arrangements\nWe do not have any material off-balance sheet arrangements.\n61\nContractual Obligations and Commitments\nBelow is a summary of our future payment commitments by year under contractual obligations as of December 31, 2024:\n(in millions)\n2025\n2026-2027\n2028-2029\nThereafter\nTotal\nLong-term debt, including interest \n(1)\n$\n1,801 \n$\n7,445 \n$\n4,852 \n$\n2,024 \n$\n16,122 \nOperating leases\n109 \n120 \n47 \n22 \n298 \nFinance leases\n13 \n27 \n28 \n269 \n337 \nData acquisition\n563 \n760 \n232 \n24 \n1,579 \nPurchase obligations \n(2)\n113 \n59 \n11 \n1 \n184 \nCommitments to unconsolidated affiliates \n(3)\n— \n— \n— \n— \n— \nBenefit obligations \n(4)\n30 \n33 \n34 \n100 \n197 \nUncertain income tax positions \n(5)\n13 \n32 \n17 \n— \n62 \nTotal\n$\n2,642 \n$\n8,476 \n$\n5,221 \n$\n2,440 \n$\n18,779 \n(1)    Interest payments on our debt are based on the interest rates in effect as of December 31, 2024.\n(2)    Purchase obligations are defined as agreements to purchase goods or services that are enforceable and legally binding and that specify all significant terms, including fixed or minimum quantities to be purchased, fixed, minimum or variable pricing provisions and the approximate timing of the transactions.\n(3)    We are currently committed to invest $678 million in private equity funds. As of December 31, 2024, we have funded approximately $310 million of these commitments and we have approximately $368 million remaining to be funded which has not been included in the above table as we are unable to predict when these commitments will be paid.\n(4)    Amounts represent expected future benefit payments for our pension and postretirement benefit plans, as well as expected contributions for 2025 for our funded pension benefit plans. We made cash contributions totaling approximately $30 million to our defined benefit plans in 2024, and we estimate that we will make contributions totaling approximately $30 million to our defined benefit plans in 2025. Due to the potential impact of future plan investment performance, changes in interest rates, changes in other economic and demographic assumptions and changes in legislation in foreign jurisdictions, we are not able to reasonably estimate the timing and amount of contributions that may be required to fund our defined benefit plans for periods beyond 2025.\n(5)    As of December 31, 2024, our liability related to uncertain income tax positions was approximately $161 million, $99 million of which has not been included in the above table as we are unable to predict when these liabilities will be paid due to the uncertainties in the timing of the settlement of the income tax positions.\nApplication of Critical Accounting Policies and Estimates\nNote 1 to the audited consolidated financial statements provided elsewhere in this Annual Report on Form 10-K describes the significant accounting policies used in the preparation of the consolidated financial statements. The preparation of our consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and the disclosure of contingent assets and liabilities at the date of the financial statements, as well as the reported amounts of revenues and expenses during the period. Our estimates are based on historical experience and various other assumptions we believe are reasonable under the circumstances. We evaluate our estimates on an ongoing basis and make changes to the estimates and related disclosures as experience develops or new information becomes known. Actual results may differ from those estimates.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\n62\nRevenue Recognition\nThe majority of our contracts within the Research & Development Solutions segment are service contracts for clinical research that represent a single performance obligation. We provide a significant integration service resulting in a combined output, which is clinical trial data that meets the relevant regulatory standards and can be used by the customer to progress to the next phase of a clinical trial or solicit approval of a treatment by the applicable regulatory body. The performance obligation is satisfied over time as the output is captured in data and documentation that is available for the customer to consume over the course of the arrangement and furthers progress of the clinical trial. We recognize revenues over time using a cost-based input method since there is no single output measure that would fairly depict the transfer of control over the life of the performance obligation. Progress on the performance obligation is measured by the proportion of actual costs incurred to the total costs expected to complete the contract. Costs included in the measure of progress include direct labor and third-party costs (such as payments to investigators and other reimbursed expenses for our clinical monitors). This cost-based method of revenue recognition requires us to make estimates of costs to complete our projects on an ongoing basis. Significant judgment is required to evaluate assumptions related to these estimates. The effect of revisions to estimates related to the transaction price or costs to complete a project are recorded in the period in which the estimate is revised. Most contracts may be terminated upon 30 to 90 days' notice by the customer; however, in the event of termination, most contracts require payment for services rendered through the date of termination, as well as for subsequent services rendered to close out the contract. A hypothetical increase of one percent in the estimated costs to complete these service contracts as of December 31, 2024 could have resulted in approximately a one percent reduction in total revenues for the year ended December 31, 2024, whereas, a hypothetical decrease of one percent could have resulted in a one percent increase in total revenues.\nIncome Taxes\nThe provision for income taxes includes federal, state, local and foreign taxes. Income taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences of temporary differences between the financial statement carrying amounts and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which the temporary differences are expected to be recovered or settled. We record U.S. deferred taxes based on the Federal corporate income tax rate of 21%, We account for tax related to Global Intangible Low-Taxed Income (“GILTI”) and Qualified Domestic Minimum Top-up Taxes (\"QDMTT\") in relation to the Organization for Economic Co-operation and Development's (\"OECD\") Pillar Two global corporate minimum tax rate of 15%, as period costs when and if incurred. Recognition of deferred income tax assets is based on management’s belief that it is more likely than not that the income tax benefit associated with certain temporary differences, income tax operating loss, capital loss carryforwards, and income tax credits, will be realized. We recorded a valuation allowance to reduce our deferred income tax assets for those deferred income tax items for which it was more likely than not that realization would not occur. We determined the amount of the valuation allowance based, in part, on our assessment of future taxable income and in light of our ongoing income tax strategies. If our estimate of future taxable income or tax strategies changes at any time in the future, we would record an adjustment to our valuation allowance. Recording such an adjustment could have a material effect on our financial condition or results of operations.\nIncome tax expense is based on the distribution of profit before income tax among the various taxing jurisdictions in which we operate, adjusted as required by the income tax laws of each taxing jurisdiction. Changes in the distribution of profits and losses among taxing jurisdictions may have a significant impact on our effective income tax rate. We do not consider the undistributed earnings of our foreign subsidiaries to be indefinitely reinvested outside of the United States.\nBusiness Combinations and Goodwill\nWe use the acquisition method to account for business combinations, and accordingly, the identifiable assets acquired, the liabilities assumed and any non-controlling interests in the acquiree are recorded at their estimated fair values on the date of the acquisition. We use significant judgments, estimates and assumptions in determining the estimated fair value of assets acquired, liabilities assumed and non-controlling interests including expected future cash flows and discount rates that reflect the risk associated with the expected future cash flows and estimated useful lives.\nWe have recorded and allocated to our reporting units the excess of the purchase price over the fair value of the net assets acquired, known as goodwill. The recoverability of goodwill is evaluated annually for impairment, or if and when events or circumstances indicate a possible impairment. We perform our annual goodwill impairment evaluation as of July 31. \n63\nFor the year ended December 31, 2024, we performed a qualitative impairment evaluation. The qualitative evaluation requires significant judgments, estimates and assumptions, including those related to macroeconomic conditions, industry and market considerations, cost factors, financial performance, fair value history and other company specific events. \nFor the year ended December 31, 2023, we elected to perform a quantitative impairment evaluation for each of our reporting units. We estimated the fair value of each reporting by weighting results of the income and market approaches, with greater weight given to the income approach. Significant estimates used in the income approach include estimates of future revenues, EBITDA, cash flows, long-term growth rates, tax rates, and discount rates. The selected discount rates consider the risk and nature of the respective reporting unit’s cash flows, and the rates of return a market participant would expect to earn by investing in our reporting units. The market approach uses information about the Company as well as other publicly traded guideline companies, including revenue and EBITDA-related multiples and estimates of control premiums. As part of the quantitative impairment evaluation, we compared the fair value of each reporting unit to its carrying value. If results of the evaluation indicate the carrying amount of a reporting unit exceeds its fair value, an impairment charge would be recorded by calculating the implied fair value of the reporting unit goodwill as compared to its carrying amount. \nFor the years ended December 31, 2024, 2023 and 2022, we determined that there was no impairment of goodwill.\nWe review the carrying values of other identifiable intangible assets if the facts and circumstances indicate a possible impairment. Any future impairment could have a material adverse effect on our financial condition or results of operations.\nStock-based Compensation\nWe measure compensation cost for stock-based payment awards (stock options and stock appreciation rights) granted to employees and non-employee directors at fair value using the Black-Scholes-Merton option-pricing model. Stock-based compensation expense includes stock-based awards granted to employees and non-employee directors and has been reported in selling, general and administrative expenses in our consolidated statements of income.\nThe Black-Scholes-Merton option-pricing model requires the use of subjective assumptions, including share price volatility, the expected life of the award, risk-free interest rate and the fair value of the underlying common shares on the date of grant. In developing our assumptions, we take into account the following:\n•\nWe calculate expected volatility based on an analysis of the historical volatility of our stock since the Merger in October 2016 and reported data for selected reasonably similar publicly traded companies for which the historical information is available;\n•\nWe determine the risk-free interest rate by reference to implied yields available from United States Treasury securities with a remaining term equal to the expected life assumed at the date of grant;\n•\nWe estimate the dividend yield to be zero as we do not currently anticipate paying any future dividends;\n•\nWe estimate the average expected life of the award based on our historical experience; and\n•\nWe estimate forfeitures based on our historical analysis of actual forfeitures.\nWe account for our stock-based compensation for performance awards related to compound annual earnings per share (“EPS”) growth over a three year period based on the closing market price of our common stock on the date of grant, and for performance awards related to relative total shareholder return (“TSR”) based on a Monte Carlo simulation model. We record the expense amount of the EPS awards based on our estimates of the likelihood that the various performance targets will be achieved. The estimates are assessed on a quarterly basis. For the TSR awards we record the expense amount evenly over the service period.\n64\nPensions and Other Postretirement Benefits\nWe provide retirement benefits to certain employees, including defined benefit pension plans. The determination of benefit obligations and expense is based on actuarial models. In order to measure benefit costs and obligations using these models, critical assumptions are made with regard to the discount rate, expected return on plan assets, cash balance crediting rate, lump sum conversion rate and the assumed rate of compensation increases.\nRecently Issued Accounting Standards\nInformation relating to recently issued accounting standards is included in Note 1 to our audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nMarket risk is the potential loss arising from adverse changes in market rates and prices. In the ordinary course of business, we are exposed to various market risks and we regularly evaluate our exposure to such changes. Our overall risk management strategy seeks to balance the magnitude of the exposure and the cost and availability of appropriate financial instruments. The following analyses present the sensitivity of our financial instruments to hypothetical changes that are reasonably possible over a one-year period.\nForeign Currency Exchange Rates\nWe transact business in more than 100 countries and approximately 60 currencies and are subject to risks associated with fluctuating foreign currency exchange rates. Our objective is to reduce earnings and cash flow volatility associated with foreign currency exchange rate movements. Accordingly, we enter into foreign currency forward contracts to hedge certain forecasted foreign currency cash flows related to service contracts. It is our policy to enter into foreign currency transactions only to the extent necessary to meet our objectives as stated above. We do not enter into foreign currency transactions for investment or speculative purposes. The principal currency hedged in 2024 with foreign currency forward contracts was the British Pound.\nThe contractual value of our foreign exchange forward contracts was approximately $108 million as of December 31, 2024. The fair value of these contracts is subject to change as a result of potential changes in foreign exchange rates. We assess our market risk based on changes in foreign exchange rates utilizing a sensitivity analysis. The sensitivity analysis measures the potential gain or loss in fair values based on a hypothetical 10% change in foreign currency exchange rates. The potential gain in fair value for foreign exchange forward contracts based on a hypothetical 10% decrease in the value of the United States dollar was $11 million as of December 31, 2024. However, the change in the fair value of the foreign exchange forward contracts would likely be offset by a change in the value of the future service contract revenues being hedged caused by the currency exchange rate fluctuation. The estimated fair values of the foreign exchange forward contracts were determined based on quoted market prices.\nExchange rate fluctuations affect the United States dollar value of foreign currency revenues and expenses and may have a significant effect on our results. Excluding the impacts from any outstanding or future hedging transactions, a hypothetical 10% change in average exchange rates used to translate all foreign currencies to the United States dollar would have impacted income before income taxes for 2024 by approximately $154 million. The actual impact of exchange rate movements in the future could differ materially from this hypothetical analysis, based on the mix of foreign currencies and the timing and magnitude of individual exchange rate movements.\nDuring the year ended December 31, 2023, we designated the cross-currency swaps that we entered into in connection with the issuance of our 2029 Senior Secured Notes and Term B-4 Dollar Loans as a hedge of our net investment in certain foreign subsidiaries to reduce the volatility in stockholders’ equity caused by changes in the Euro exchange rate with respect to the United States dollar. We do not enter into cross-currency swaps for investment or speculative purposes. The contractual value of our cross-currency swaps was approximately $2,735 million as of December 31, 2024. The fair value of these cross-currency swaps is subject to change as a result of potential changes in foreign exchange rates. We assess our market risk based on changes in foreign exchange rates utilizing a sensitivity analysis. The sensitivity analysis measures the potential gain or loss in fair values based on a hypothetical 10% change in foreign currency exchange rates. The potential loss in fair value for cross-currency swaps based on a hypothetical 10% decrease in the value of the United States dollar was $300 million as of December 31, 2024. However, this change in fair value would be offset by the change in value of the hedged portion of our net investment in foreign subsidiaries caused by the currency exchange rate fluctuation.\n65\nCommencing in 2016 we designated our foreign currency denominated debt as a hedge of our net investment in certain foreign subsidiaries to reduce the volatility in stockholders’ equity caused by changes in the Euro exchange rate with respect to the United States dollar. We have continued to designate a portion of new issuances of foreign currency denominated debt as a hedge of our net investment in certain foreign subsidiaries. As of December 31, 2024, our total foreign currency denominated debt was €4,085 million ($4,244 million), with approximately 67% being designated as a hedge. A hypothetical 10% decrease in the value of the United States dollar would lead to a potential loss in fair value of $424 million. However, approximately 67% of this change in fair value would be offset by the change in value of the hedged portion of our net investment in foreign subsidiaries caused by the currency exchange rate fluctuation.\nInterest Rates\nBecause we have variable rate debt, fluctuations in interest rates affect our business. We attempt to minimize interest rate risk and lower our overall borrowing costs through the utilization of derivative financial instruments, primarily interest rate swaps. We do not enter into interest rate swaps for investment or speculative purposes. We have entered into interest rate swaps with financial institutions that have reset dates and critical terms that match the underlying debt. Accordingly, any change in market value associated with the interest rate swaps is offset by the opposite market impact on the related debt. As of December 31, 2024, we had approximately $5,965 million of variable rate indebtedness and interest rate swaps with a notional value of $2,485 million. Because we do not attempt to hedge all of our variable rate debt, we may incur higher interest costs for the portion of our variable rate debt that is not hedged. Excluding debt covered by hedges, each quarter-point increase or decrease in the interest rate on our variable rate debt would result in our interest expense changing by approximately $9 million per year.\nMarketable Securities\nAs of December 31, 2024, we held investments in marketable equity securities. These investments are classified as either trading securities or available-for-sale securities and are recorded at fair value. These securities are subject to price risk. As of December 31, 2024, the fair value of these investments was $170 million based on the quoted market value of the securities. The potential loss in fair value resulting from a hypothetical decrease of 10% in quoted market values was approximately $17 million as of December 31, 2024.\n66\nItem 8. Financial Statements and Supplementary Data\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of IQVIA Holdings Inc. (the “Company”) is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In making this assessment, management used the framework established in Internal Control—Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). As a result of this assessment and based on the criteria in the COSO framework, management has concluded that, as of December 31, 2024, the Company’s internal control over financial reporting was effective.\nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears herein.\n/s/ Ari Bousbib\n/s/ Ronald E. Bruehlman \nAri Bousbib\nRonald E. Bruehlman \nChairman and Chief Executive Officer\nExecutive Vice President and Chief Financial Officer\n(Principal Executive Officer\n)\n(Principal Financial Officer)\nFebruary 13, 2025\n67\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of IQVIA Holdings Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of IQVIA Holdings Inc. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and financial statement schedules listed in the index appearing under Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework \n(2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n68\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition – Estimating Costs to Complete for Clinical Research Services\nAs described in Notes 1 and 20 to the consolidated financial statements, revenue of the Research & Development Solutions segment for the year ended December 31, 2024, is $\n8,527\n million, the majority of which relates to service contracts for clinical research that represent a single performance obligation. The Company recognized revenue for these contracts over time using a cost-based input method. Revenue was recognized based on progress on the performance obligation, which was measured by the proportion of actual costs incurred to the total costs expected to complete the contract. Costs included in the measure of progress include direct labor and third-party costs (such as payments to investigators and other reimbursed expenses for the Company’s clinical monitors). This cost-based method of revenue recognition required management to make estimates of costs to complete its projects on an ongoing basis.\nThe principal considerations for our determination that performing procedures relating to revenue recognition - estimating costs to complete for clinical research services is a critical audit matter are a high degree of auditor effort in performing audit procedures and evaluating audit evidence related to the cost estimates made by management when determining the total expected costs to complete its contracts, specifically the estimation of direct labor and third-party costs. \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the estimation of the total costs to complete for clinical research service contracts. These procedures also included, among others, testing management’s process for determining the estimate of total costs to complete for a sample of clinical research contracts by evaluating the reasonableness of significant assumptions made by management related to direct labor and third-party costs, evaluating the appropriateness of changes to management’s estimate of total costs to complete the contracts, testing actual direct costs incurred, evaluating management’s ability to reasonably estimate the total expected costs to complete contracts by performing a comparison of management’s prior period cost estimates to actual costs, and testing the completeness and accuracy of underlying data used by management.\n/s/ \nPricewaterhouseCoopers LLP\nRaleigh, North Carolina\nFebruary 13, 2025\nWe have served as the Company’s auditor since 2002.\n69\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nRevenues\n$\n15,405\n \n$\n14,984\n \n$\n14,410\n \nCost of revenues, exclusive of depreciation and amortization\n10,030\n \n9,745\n \n9,382\n \nSelling, general and administrative expenses\n1,992\n \n2,053\n \n2,071\n \nDepreciation and amortization\n1,114\n \n1,125\n \n1,130\n \nRestructuring costs\n67\n \n84\n \n28\n \nIncome from operations\n2,202\n \n1,977\n \n1,799\n \nInterest income\n(\n47\n)\n(\n36\n)\n(\n13\n)\nInterest expense\n670\n \n672\n \n416\n \nLoss on extinguishment of debt\n—\n \n6\n \n—\n \nOther (income) expense, net\n(\n90\n)\n(\n124\n)\n33\n \nIncome before income taxes and equity in earnings (losses) of unconsolidated affiliates\n1,669\n \n1,459\n \n1,363\n \nIncome tax expense \n301\n \n101\n \n260\n \nIncome before equity in earnings (losses) of unconsolidated affiliates\n1,368\n \n1,358\n \n1,103\n \nEquity in earnings (losses) of unconsolidated affiliates\n5\n \n—\n \n(\n12\n)\nNet income\n$\n1,373\n \n$\n1,358\n \n$\n1,091\n \nEarnings per share attributable to common stockholders:\nBasic\n$\n7.57\n \n$\n7.39\n \n$\n5.82\n \nDiluted\n$\n7.49\n \n$\n7.29\n \n$\n5.72\n \nWeighted average common shares outstanding:\nBasic\n181.3\n \n183.8\n \n187.6\n \nDiluted\n183.4\n \n186.3\n \n190.6\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n70\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet income\n$\n1,373\n \n$\n1,358\n \n$\n1,091\n \nComprehensive income adjustments:\nUnrealized gains (losses) on derivative instruments, net of income tax expense (benefit) of $\n17\n, $(\n3\n) and $\n13\n53\n \n(\n7\n)\n40\n \nDefined benefit plan adjustments, net of income tax expense (benefit) of $\n5\n, $\n4\n and $(\n3\n)\n7\n \n7\n \n(\n10\n)\nForeign currency translation, net of income tax expense (benefit) of $\n77\n, $(\n55\n) and $\n106\n(\n200\n)\n(\n89\n)\n(\n361\n)\nReclassification adjustments:\nReclassifications on derivative instruments included in net income, net of income tax (expense) benefit of $(\n10\n), $(\n17\n) and $\n2\n(\n31\n)\n(\n51\n)\n10\n \nComprehensive income\n$\n1,202\n \n$\n1,218\n \n$\n770\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n71\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n(in millions, except per share data)\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,702\n \n$\n1,376\n \nTrade accounts receivable and unbilled services, net\n3,204\n \n3,381\n \nPrepaid expenses\n154\n \n141\n \nIncome taxes receivable\n36\n \n32\n \nInvestments in debt, equity and other securities\n141\n \n120\n \nOther current assets and receivables\n592\n \n546\n \nTotal current assets\n5,829\n \n5,596\n \nProperty and equipment, net\n535\n \n523\n \nOperating lease right-of-use assets\n238\n \n296\n \nInvestments in debt, equity and other securities\n108\n \n105\n \nInvestments in unconsolidated affiliates\n266\n \n134\n \nGoodwill\n14,710\n \n14,567\n \nOther identifiable intangibles, net\n4,499\n \n4,839\n \nDeferred income taxes\n194\n \n166\n \nDeposits and other assets, net\n520\n \n455\n \nTotal assets\n$\n26,899\n \n$\n26,681\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable and accrued expenses\n$\n3,684\n \n$\n3,564\n \nUnearned income\n1,779\n \n1,799\n \nIncome taxes payable\n156\n \n116\n \nCurrent portion of long-term debt\n1,145\n \n718\n \nOther current liabilities\n193\n \n294\n \nTotal current liabilities\n6,957\n \n6,491\n \nLong-term debt, less current portion\n12,838\n \n12,955\n \nDeferred income taxes\n196\n \n202\n \nOperating lease liabilities\n173\n \n223\n \nOther liabilities\n668\n \n698\n \nTotal liabilities\n20,832\n \n20,569\n \nCommitments and contingencies (Note 1 and 12)\nStockholders’ equity:\nCommon stock and additional paid-in capital, \n400.0\n shares authorized as of December 31, 2024 and 2023, $\n0.01\n par value, \n258.2\n shares issued and \n176.1\n shares outstanding as of December 31, 2024; \n257.2\n shares issued and \n181.5\n shares outstanding as of December 31, 2023\n11,143\n \n11,028\n \nRetained earnings\n6,065\n \n4,692\n \nTreasury stock, at cost, \n82.1\n and \n75.7\n shares as of December 31, 2024 and 2023, respectively\n(\n10,103\n)\n(\n8,741\n)\nAccumulated other comprehensive loss\n(\n1,038\n)\n(\n867\n)\nTotal stockholders’ equity\n6,067\n \n6,112\n \nTotal liabilities and stockholders’ equity\n$\n26,899\n \n$\n26,681\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n72\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nOperating activities:\nNet income\n$\n1,373\n \n$\n1,358\n \n$\n1,091\n \nAdjustments to reconcile net income to cash provided by operating activities:\nDepreciation and amortization\n1,114\n \n1,125\n \n1,130\n \nAmortization of debt issuance costs and discount\n21\n \n18\n \n15\n \nStock-based compensation\n206\n \n217\n \n194\n \nGain on disposals of property and equipment, net\n—\n \n—\n \n(\n10\n)\n(Earnings) losses from unconsolidated affiliates\n(\n5\n)\n—\n \n12\n \n(Gain) loss on investments, net\n(\n22\n)\n(\n20\n)\n27\n \nBenefit from deferred income taxes\n(\n129\n)\n(\n269\n)\n(\n115\n)\nChanges in operating assets and liabilities:\nAccounts receivable and unbilled services\n182\n \n(\n388\n)\n(\n421\n)\nPrepaid expenses and other assets\n7\n \n34\n \n7\n \nAccounts payable and accrued expenses\n115\n \n267\n \n427\n \nUnearned income\n9\n \n(\n29\n)\n31\n \nIncome taxes payable and other liabilities\n(\n155\n)\n(\n164\n)\n(\n128\n)\nNet cash provided by operating activities\n2,716\n \n2,149\n \n2,260\n \nInvesting activities:\nAcquisition of property, equipment and software\n(\n602\n)\n(\n649\n)\n(\n674\n)\nAcquisition of businesses, net of cash acquired\n(\n735\n)\n(\n876\n)\n(\n1,315\n)\nPurchases of marketable securities, net\n—\n \n(\n6\n)\n(\n5\n)\nInvestments in unconsolidated affiliates, net of payments received\n(\n132\n)\n(\n39\n)\n(\n20\n)\nInvestments in debt and equity securities\n(\n2\n)\n(\n38\n)\n—\n \nProceeds from sale of property, equipment and software\n25\n \n—\n \n—\n \nOther\n2\n \n5\n \n8\n \nNet cash used in investing activities\n(\n1,444\n)\n(\n1,603\n)\n(\n2,006\n)\nFinancing activities:\nProceeds from issuance of debt\n—\n \n4,000\n \n1,250\n \nPayment of debt issuance costs\n(\n1\n)\n(\n50\n)\n(\n5\n)\nRepayment of debt and principal payments on finance leases\n(\n172\n)\n(\n2,873\n)\n(\n634\n)\nProceeds from revolving credit facility\n1,685\n \n2,384\n \n2,350\n \nRepayment of revolving credit facility\n(\n960\n)\n(\n2,709\n)\n(\n2,025\n)\nPayments related to employee stock incentive plans, net\n(\n64\n)\n(\n61\n)\n(\n71\n)\nRepurchase of common stock\n(\n1,350\n)\n(\n992\n)\n(\n1,168\n)\nContingent consideration and deferred purchase price payments\n(\n16\n)\n(\n81\n)\n(\n26\n)\nNet cash used in financing activities\n(\n878\n)\n(\n382\n)\n(\n329\n)\nEffect of foreign currency exchange rate changes on cash\n(\n68\n)\n(\n4\n)\n(\n75\n)\nIncrease (decrease) in cash and cash equivalents\n326\n \n160\n \n(\n150\n)\nCash and cash equivalents at beginning of period\n1,376\n \n1,216\n \n1,366\n \nCash and cash equivalents at end of period\n$\n1,702\n \n$\n1,376\n \n$\n1,216\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n73\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(in millions)\nCommon Stock Shares\nTreasury Stock Shares\nCommon Stock\nAdditional Paid-In Capital\nRetained Earnings\nTreasury Stock\nAccumulated Other Comprehensive (Loss) Income\nTotal\nBalance, December 31, 2021\n255.8\n \n(\n65.2\n)\n$\n3\n \n$\n10,774\n \n$\n2,243\n \n$\n(\n6,572\n)\n$\n(\n406\n)\n$\n6,042\n \nIssuance of common stock\n0.6\n \n— \n—\n \n(\n71\n)\n— \n— \n— \n(\n71\n)\nRepurchase of common stock\n— \n(\n5.5\n)\n— \n— \n— \n(\n1,168\n)\n— \n(\n1,168\n)\nStock-based compensation\n— \n— \n— \n192\n \n— \n— \n— \n192\n \nNet income\n— \n— \n— \n— \n1,091\n \n— \n—\n \n1,091\n \nUnrealized gains on derivative instruments, net of tax\n— \n— \n— \n— \n— \n— \n40\n \n40\n \nDefined benefit plan adjustments, net of tax\n— \n— \n— \n— \n— \n— \n(\n10\n)\n(\n10\n)\nForeign currency translation, net of tax\n— \n— \n— \n— \n— \n— \n(\n361\n)\n(\n361\n)\nReclassification adjustments, net of tax\n— \n— \n— \n— \n— \n— \n10\n \n10\n \nBalance, December 31, 2022\n256.4\n \n(\n70.7\n)\n3\n \n10,895\n \n3,334\n \n(\n7,740\n)\n(\n727\n)\n5,765\n \nIssuance of common stock\n0.8\n \n— \n— \n(\n61\n)\n— \n— \n— \n(\n61\n)\nRepurchase of common stock, net of tax\n— \n(\n5.0\n)\n— \n— \n— \n(\n1,001\n)\n— \n(\n1,001\n)\nStock-based compensation\n— \n— \n— \n191\n \n— \n— \n— \n191\n \nNet income\n— \n— \n— \n— \n1,358\n \n— \n— \n1,358\n \nUnrealized losses on derivative instruments, net of tax\n— \n— \n— \n— \n— \n— \n(\n7\n)\n(\n7\n)\nDefined benefit plan adjustments, net of tax\n— \n— \n— \n— \n— \n— \n7\n \n7\n \nForeign currency translation, net of tax\n— \n— \n— \n— \n— \n— \n(\n89\n)\n(\n89\n)\nReclassification adjustments, net of tax\n— \n— \n— \n— \n— \n— \n(\n51\n)\n(\n51\n)\nBalance, December 31, 2023\n257.2\n \n(\n75.7\n)\n3\n \n11,025\n \n4,692\n \n(\n8,741\n)\n(\n867\n)\n6,112\n \nIssuance of common stock\n1.0\n \n—\n \n—\n \n(\n66\n)\n—\n \n—\n \n—\n \n(\n66\n)\nRepurchase of common stock, net of tax\n—\n \n(\n6.4\n)\n—\n \n—\n \n—\n \n(\n1,362\n)\n—\n \n(\n1,362\n)\nStock-based compensation\n—\n \n—\n \n—\n \n181\n \n—\n \n—\n \n—\n \n181\n \nNet income\n—\n \n—\n \n—\n \n—\n \n1,373\n \n—\n \n—\n \n1,373\n \nUnrealized gains on derivative instruments, net of tax\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n53\n \n53\n \nDefined benefit plan adjustments, net of tax\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n7\n \n7\n \nForeign currency translation, net of tax\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n200\n)\n(\n200\n)\nReclassification adjustments, net of tax\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n31\n)\n(\n31\n)\nBalance, December 31, 2024\n258.2\n \n(\n82.1\n)\n$\n3\n \n$\n11,140\n \n$\n6,065\n \n$\n(\n10,103\n)\n$\n(\n1,038\n)\n$\n6,067\n \nThe accompanying notes are an integral part of these consolidated financial statements\n.\n74\nIQVIA HOLDINGS INC. AND SUBSIDIARIES\nNotes to Consolidated Financial Statements\n1. \nSummary of Significant Accounting Policies\nThe Company\nIQVIA Holdings Inc. (together with its subsidiaries, the “Company” or “IQVIA”) is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. IQVIA’s portfolio of solutions are powered by IQVIA Connected Intelligence™ to deliver actionable insights and services built on high-quality health data, Healthcare-grade AI™, advanced analytics, the latest technologies and extensive domain expertise. IQVIA is committed to using AI responsibly, ensuring that its AI-powered capabilities are grounded in privacy, regulatory compliance, and patient safety. With approximately \n88,000\n employees in over \n100\n countries, including experts in healthcare, life sciences, data science, technology and operational excellence, IQVIA is dedicated to accelerating the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide. \nIQVIA is a global leader in protecting individual patient privacy. The Company uses a wide variety of privacy-enhancing technologies and safeguards to protect individual privacy while generating and analyzing information on a scale that helps healthcare stakeholders identify disease patterns and correlate with the precise treatment path and therapy needed for better outcomes. IQVIA’s insights and execution capabilities help biotech, medical device and pharmaceutical companies, medical researchers, government agencies, payers and other healthcare stakeholders tap into a deeper understanding of diseases, human behaviors and scientific advances, in an effort to advance their path toward cures.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts and operations of the Company, its subsidiaries and investments in which the Company has control. Amounts pertaining to the non-controlling ownership interests held by third parties, if any, in the operating results and financial position of the Company’s majority-owned subsidiaries are reported as non-controlling interests. Intercompany accounts and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States of America (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and the disclosure of contingent assets and liabilities, at the date of the financial statements, as well as the reported amounts of revenues and expenses during the period. These estimates are based on historical experience and various other assumptions believed reasonable under the circumstances. The Company evaluates its estimates on an ongoing basis and makes changes to the estimates and related disclosures as experience develops or new information becomes known. Actual results may differ from those estimates.\n \nForeign Currencies\nThe Company’s consolidated financial statements are reported in United States dollars and, accordingly, the Company’s results of operations are impacted by fluctuations in exchange rates that affect the translation of its revenues and expenses denominated in foreign currencies into United States dollars for purposes of reporting its consolidated financial results. Assets and liabilities recorded in foreign currencies on the books of foreign subsidiaries are translated at the exchange rate on the balance sheet date. Revenues, costs and expenses are translated at average rates of exchange during the year. Translation adjustments resulting from this process are charged or credited to the accumulated other comprehensive (loss) income (“AOCI”) component of stockholders’ equity. The Company is subject to foreign currency transaction risk for fluctuations in exchange rates during the period of time between the consummation and cash settlement of a transaction. The Company earns revenues from its service contracts over a period of several months and, in some cases, over a period of several years. Accordingly, exchange rate fluctuations during this period may affect the Company’s profitability with respect to such contracts.\nFor operations outside the United States that are considered to be highly inflationary or where the United States dollar is designated as the functional currency, monetary assets and liabilities are remeasured using end-of-period exchange rates, whereas nonmonetary accounts are remeasured using historical exchange rates, and all remeasurement and transaction adjustments are recognized in other (income) expense, net.\n75\nCash Equivalents\nThe Company considers all highly liquid investments with an initial maturity of three months or less when purchased to be cash equivalents.\nDerivatives\nThe Company uses derivative instruments to manage exposures to interest rates and foreign currencies. Derivatives are recorded on the balance sheet at fair value at each balance sheet date utilizing pricing models for non-exchange-traded contracts.\nAt inception, the Company designates whether or not the derivative instrument is an effective hedge of an asset, liability or firm commitment which is then classified as either a cash flow hedge or a fair value hedge. If determined to be an effective cash flow hedge, changes in the fair value of the derivative instrument are recorded as a component of AOCI until realized. The Company includes the impact from these hedges in the same line item as the hedged item on the consolidated statements of cash flows. Changes in fair value of effective fair value hedges are recorded in earnings as an offset to the changes in the fair value of the related hedged item. Hedge ineffectiveness, if any, is immediately recognized in earnings. Changes in the fair values of derivative instruments that are not an effective hedge are recognized in earnings. When it is probable that a hedged forecasted transaction will not occur, the Company discontinues hedge accounting for the affected portion of the forecasted transaction and reclassifies gains or losses that were accumulated in AOCI to earnings for foreign exchange derivatives and interest expense for interest rate derivatives on the consolidated statements of income. Cash flows are classified consistent with the underlying hedged item. The Company has entered, and may in the future enter, into derivative contracts (caps, swaps, forwards, calls or puts, warrants, for example) related to its debt and forecasted foreign currency transactions. The Company does not enter into derivative instruments for investment or speculative purposes.\nThe Company designates its cross-currency swaps and a portion of its foreign currency denominated debt as a hedge of its net investment in certain foreign subsidiaries to reduce the volatility in stockholders’ equity caused by changes in the Euro exchange rate with respect to the United States dollar. Foreign exchange gains or losses on the remeasurement of the debt designated as part of a hedge of net investments is recognized in the cumulative translation adjustment component of AOCI with the related offset in long-term debt. Those amounts would be reclassified from AOCI to earnings upon the sale or substantial liquidation of the net investments. \nT\nhe change in fair value of the cross-currency swaps are also recognized in the cumulative translation adjustment component of AOCI and would be reclassified from AOCI to earnings upon the sale or substantial liquidation of the net investments. The interest rate component of the cross-currency swaps is excluded from the assessment of hedge effectiveness and, thus, is recognized as a reduction to interest expense over the life of the cross-currency swaps.\n    \nBusiness Combinations and Goodwill\nThe Company uses the acquisition method to account for business combinations, and accordingly, the identifiable assets acquired, the liabilities assumed and any non-controlling interest in the acquiree are recorded at their estimated fair values on the date of the acquisition. The Company uses significant judgments, estimates and assumptions in determining the estimated fair value of assets acquired, liabilities assumed and non-controlling interests including expected future cash flows, and discount rates that reflect the risk associated with the expected future cash flows and estimated useful lives.\nThe Company records and allocates to its reporting units the excess of the cost over the fair value of the net assets acquired, known as goodwill. On an annual basis, and if a triggering event occurs, the Company performs a qualitative analysis to determine whether it is more likely than not that the estimated fair value of a reporting unit is less than its carrying amount. This includes a qualitative analysis of macroeconomic conditions, industry and market considerations, cost factors, financial performance, fair value history and other company specific events. If this qualitative analysis indicates that it is more likely than not that the estimated fair value is less than the carrying value for the respective reporting unit, the Company would then need to calculate the fair value of the reporting unit. The Company may also choose to bypass the qualitative assessment for any or all reporting units and proceed directly to a quantitative assessment, which involves estimating the fair value of the Company's reporting units and comparing to the carrying value of the reporting units. If the reporting unit calculated fair value is less than the carrying amount, the Company would record an impairment charge for the difference, with the impairment charge not to exceed the carrying amount of goodwill.\n \nThe Company reviews the carrying values of other identifiable definite-lived intangible assets if the facts and circumstances indicate a possible impairment.\n76\nLong-Lived Assets \nProperty and equipment are stated at cost and are depreciated using the straight-line method over the shorter of the asset’s estimated useful life or the lease term, if related to leased property, as follows:\nBuildings and leasehold improvements\n3\n-\n40\n years\nEquipment\n3\n-\n10\n years\nFurniture and fixtures\n5\n-\n10\n years\nTransportation equipment\n3\n-\n20\n years\nDefinite-lived other identifiable intangible assets are amortized primarily using an accelerated method that reflects the pattern in which the Company expects to benefit from the use of the asset over its estimated remaining useful life as follows:\nClient relationships and backlog\n1\n-\n25\n years\nSoftware and related assets\n1\n-\n10\n years\nTrademarks, trade names and other\n1\n-\n17\n years\nDatabases\n1\n-\n9\n years\nNon-compete agreements\n2\n-\n5\n years\nIncluded in software and related assets is the capitalized cost of internal-use software used in supporting the Company’s business. Qualifying costs incurred during the application development stage are capitalized and amortized over their estimated useful lives. Costs are capitalized from completion of the preliminary project stage and when it is considered probable that the software will be used to perform its intended function, up until the time the software is placed into service. The Company recognized $\n472\n million, $\n475\n million and $\n419\n million of amortization expense for the years ended December 31, 2024, 2023 and 2022, respectively, related to software and related assets.\nThe carrying values of property, equipment and intangible and other long-lived assets are reviewed for recoverability at the asset grouping level to determine if the facts and circumstances suggest that a potential impairment may have occurred. If this review indicates that carrying values will not be recoverable, as determined based on undiscounted cash flow projections, the Company will record an impairment charge to reduce carrying values to estimated fair value. There were \nno\n significant impairments recognized in the years ended December 31, 2024, 2023 and 2022.\nRevenue Recognition\nThe Company’s arrangements are primarily service contracts that range in duration from a few months to several years. The Company recognizes revenues when control of these services is transferred to the customer for an amount, referred to as the transaction price, that reflects the consideration to which the Company is expected to be entitled in exchange for those goods or services. The Company determines revenue recognition utilizing the following five steps: (1) identification of the contract with a customer, (2) identification of the performance obligations in the contract (promised goods or services that are distinct), (3) determination of the transaction price, (4) allocation of the transaction price to the performance obligations, and (5) recognition of revenues when, or as, the Company transfers control of the product or service for each performance obligation. Cash payments made to customers as incentives to induce customers to enter into service agreements with the Company are amortized as a reduction of revenues over the period the services are performed. The Company records revenues net of any tax assessments by governmental authorities, such as value added and sales taxes, that are imposed on and concurrent with specific revenues generating transactions.\n77\nThe Company derives the majority of its revenues in the Technology & Analytics Solutions segment from various information and technology service offerings. Information offerings (primarily under fixed-price contracts) typically include multiple performance obligations including an ongoing subscription-based deliverable for which revenues are recognized ratably as earned over the contract period, and/or a one-time deliverable of data offerings for which revenues are recognized upon delivery. The customer is able to benefit from the provision of data as it is received. The Company’s subscription arrangements typically have terms ranging from \none\n to \nthree years\n and are generally non-cancelable and do not contain refund-type provisions. Technology services offerings may contain multiple performance obligations consisting of a mix of small and large-scale services and consulting projects, multi-year outsourcing contracts and Software-as-a-Service (“SaaS”) arrangements. These arrangements typically have terms ranging from several weeks to three years, with a majority having terms of one year or less. For arrangements that include multiple performance obligations, the transaction price is allocated to the identified performance obligations based on their relative standalone selling prices. For these contracts, the standalone selling prices are based on the Company’s normal pricing practices when sold separately with consideration of market conditions and other factors, including customer demographics and geographic location. Revenues for services engagements where the transfer of control occurs ratably over time are recognized on a straight-line basis over the term of the arrangement. Revenues from time and material contracts are recognized based on hours as the services are provided. Revenues from fixed price ad hoc services and consulting contracts are recognized over the contract term based on the ratio of the number of hours incurred for services provided during the period compared to the total estimated hours to be incurred over the entire arrangement (hours-based). Technology services offerings meet the over time criterion, as another party would not need to substantially re-perform the work already completed to satisfy the remaining obligations if the services were migrated.\nThe majority of the Company’s contracts within the Research & Development Solutions segment are service contracts for clinical research that represent a single performance obligation. The Company provides a significant integration service resulting in a combined output, which is clinical trial data that meets the relevant regulatory standards and can be used by the customer to progress to the next phase of a clinical trial or solicit approval of a treatment by the applicable regulatory body. The performance obligation is satisfied over time as the output is captured in data and documentation that is available for the customer to consume over the course of the arrangement and furthers progress of the clinical trial. The Company recognizes revenues over time using a cost-based input method since there is no single output measure that would fairly depict the transfer of control over the life of the performance obligation. Progress on the performance obligation is measured by the proportion of actual costs incurred to the total costs expected to complete the contract. Costs included in the measure of progress include direct labor and third-party costs (such as payments to investigators and other reimbursed expenses for the Company’s clinical monitors). This cost-based method of revenue recognition requires the Company to make estimates of costs to complete its projects on an ongoing basis. Significant judgment is required to evaluate assumptions related to these estimates. The effect of revisions to estimates related to the transaction price or costs to complete a project are recorded in the period in which the estimate is revised. Most contracts may be terminated upon 30 to 90 days' notice by the customer; however, in the event of termination, most contracts require payment for services rendered through the date of termination, as well as for subsequent services rendered to close out the contract. \nThe majority of revenues in the Company's Contract Sales & Medical Solutions segment is from contract sales force to the biopharmaceutical industry and broader healthcare market and recognized over time using a single measure of progress dependent on the performance obligation. Some of the Company's Contract Sales & Medical Solutions contracts contain multiple performance obligations with distinct promises including recruiting, sales force automation and deployment of sales representatives. The Company utilizes a single measure of progress for each performance obligation to recognize revenues, which includes deployment of sales representatives based on employee days worked; recruiting based on candidates recruited; sales force automation set-up based on hours worked; and sales force automation hosting and maintenance based on usage. These services meet the over time criterion as the customer consumes the benefit as activities are performed and another party would not need to substantially re-perform the work already completed to satisfy the remaining obligations if the services were migrated to another party.\nVariable Consideration\nIn some cases, contracts provide for variable consideration that is contingent upon the occurrence of uncertain future events, such as performance incentives (including royalty payments, bonuses, or penalty clauses that can either increase or decrease the transaction price). Variable consideration is estimated at the expected value or at the most likely amount depending on the type of consideration. Estimated amounts are included in the transaction price to the extent it is probable that a significant reversal of cumulative revenues recognized will not occur when the uncertainty associated with the variable consideration is resolved. The estimate of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of the Company's anticipated performance and all information (historical, current and forecasted) that is reasonably available to the Company and reevaluated each reporting period.\n78\nReimbursed Expenses\nThe Company includes reimbursed expenses in revenues and cost of revenues as the Company is primarily responsible for fulfilling the promise to provide the specified service, including the integration of the related services into a combined output to the customer, which are inseparable from the integrated service. These costs include such items as payments to investigators and travel expenses for the Company’s clinical monitors and sales representatives, over which the Company has discretion in establishing prices. The Company controls the good or service and has inventory risk on contractually reimbursable expenses, as sometimes the Company is unable to obtain reimbursement from the customer for costs incurred.\nChange Orders\nChanges in the scope of work are common, especially under long-term contracts, and generally result in a change in transaction price. Change orders are evaluated on a contract-by-contract basis to determine if they should be accounted for as a new contract or as part of the existing contract. Generally, services from change orders are not distinct from the original performance obligation. As a result, the effect that the contract modification has on the contract revenues, and measure of progress, is recognized as an adjustment to revenues when it occurs.\nCost of Revenues\nCost of revenues include (i) compensation and benefits for billable employees and personnel involved in production, data management and delivery, and the costs of acquiring and processing data for the Company’s information offerings; (ii) costs of staff directly involved with delivering technology-related services offerings and engagements, and the costs of data purchased specifically for technology services engagements; (iii) reimbursed expenses that are comprised principally of payments to investigators who oversee clinical trials and travel expenses for the Company’s clinical monitors and sales representatives; and (iv) other expenses directly related to service contracts such as courier fees, laboratory supplies, professional services and travel expenses.\nTrade Receivables, Unbilled Services and Unearned Income\nIn general, billings and payments are established by contractual provisions including predetermined payment schedules, which may or may not correspond to the timing of the transfer of control of the Company’s services under the contract. In general, the Company’s intention in its invoicing (payment terms) is to maintain cash neutrality over the life of the contract. Generally, the payment terms are 30 to 90 days based on contracts. Upfront payments, when they occur, are intended to cover certain expenses the Company incurs at the beginning of the contract. Neither the Company nor its customers view such upfront payments and contracted payment schedules as a means of financing. Unbilled services primarily arise from long-term contracts when a cost-based or hours-based input method of revenue recognition is utilized and revenues recognized exceeds the amount billed to the customer.\nUnearned income consists of advance payments and billings in excess of revenues recognized. As the contracted services are subsequently performed and the associated revenues are recognized, the unearned income balance is reduced by the amount of the revenue recognized during the period. Unearned income is classified as a current liability on our consolidated balance sheets as the Company expects to recognize the associated revenues in less than one year.\nRestructuring Costs\nRestructuring costs, which primarily include termination benefits, are recorded at estimated value. Key assumptions in determining the restructuring costs include the terms and payments that may be negotiated to terminate certain contractual obligations and the timing of employees leaving the Company.\nDebt Fees\nFees incurred to issue debt are generally deferred and amortized as a component of interest expense over the estimated term of the related debt using the effective interest rate method.\n79\nContingencies\nThe Company records accruals for claims, suits, investigations and proceedings when it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated. The Company reviews claims, suits, investigations and proceedings at least quarterly and records or adjusts accruals related to such matters to reflect the impact and status of any settlements, rulings, advice of counsel or other information pertinent to a particular matter. Legal costs associated with contingencies are charged to expense as incurred.\nThe Company is party to legal proceedings incidental to its business. While the outcome of these matters could differ from management’s expectations, the Company does not believe the resolution of these matters will have a material adverse effect to the Company’s financial statements. See Note 12 for additional information.\n \nIncome Taxes\nThe provision for income taxes includes federal, state, local and foreign taxes. Income taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences of temporary differences between the financial statement carrying amounts and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which the temporary differences are expected to be recovered or settled. The Company records U.S. deferred taxes based on the Federal corporate income tax rate of 21%. The Company accounts for tax related to Global Intangible Low-Taxed Income (“GILTI”) and Qualified Domestic Minimum Top-up Taxes (\"QDMTT\") in relation to the Organization for Economic Co-operation and Development's (\"OECD\") Pillar Two global corporate minimum tax rate of 15%, as period costs when and if incurred. Recognition of deferred income tax assets is based on management’s belief that it is more likely than not that the income tax benefit associated with certain temporary differences, income tax operating loss, capital loss carryforwards, and income tax credits, will be realized. The Company records a valuation allowance to reduce its deferred income tax assets for those deferred income tax items for which it was more likely than not that realization would not occur. The Company determines the amount of the valuation allowance based, in part, on the Company’s assessment of future taxable income and in light of the Company’s ongoing income tax strategies. If the estimate of future taxable income or tax strategies changes at any time in the future, the Company would record an adjustment to its valuation allowance. Recording such an adjustment could have a material effect on the Company’s financial condition or results of operations.\nIncome tax expense is based on the distribution of profit before income tax among the various taxing jurisdictions in which the Company operates, adjusted as required by the income tax laws of each taxing jurisdiction. Changes in the distribution of profits and losses among taxing jurisdictions may have a significant impact on the Company's effective income tax rate. The Company does not consider the undistributed earnings of our foreign subsidiaries to be indefinitely reinvested outside of the United States.\nPensions and Other Postretirement Benefits\nThe Company provides retirement benefits to certain employees, including defined benefit pension plans. The determination of benefit obligations and expense is based on actuarial models. In order to measure benefit costs and obligations using these models, assumptions are made with regard to the discount rate, expected return on plan assets, cash balance crediting rate, lump sum conversion rate and the assumed rate of compensation increases.\nStock-based Compensation\nThe Company accounts for stock-based compensation for stock options and stock appreciation rights under the fair value method and uses the Black-Scholes-Merton model to estimate the value of such stock-based awards granted to its employees and non-executive directors. Expected volatility is based on an analysis that incorporates the historical volatility of the Company's stock since the Merger in October 2016 and reported data for selected reasonably similar publicly traded companies for which the historical information is available. The Company does not currently anticipate paying dividends. The expected term represents the period of time the grants are expected to be outstanding. The risk-free interest rate is based on the United States Treasury yield curve in effect at the time of the grant.\n80\nThe Company values its stock-based compensation for restricted stock awards and restricted stock units based on the closing market price of the Company’s common stock on the date of grant. The Company accounts for its stock-based compensation for performance awards related to compound annual earnings per share (“EPS”) growth based on the closing market price of the Company’s common stock on the date of grant, and for performance awards related to relative total shareholder return (“TSR”) based on a Monte Carlo simulation model.\nLeases\nThe Company determines if an arrangement is a lease at inception and reassesses if there are changes in terms and conditions of the contract. Operating leases are included in operating lease right-of-use (“ROU”) assets, other current liabilities, and operating lease liabilities on the Company's consolidated balance sheets. Finance leases are included in deposits and other assets, net, other current liabilities, and other liabilities on the Company's consolidated balance sheets. Lease assets and liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. As most of the Company’s leases do not provide an implicit rate, the Company uses its incremental borrowing rate based on the information available at commencement date in determining the present value of future payments. Lease assets also include any lease payments made before lease commencement and initial direct costs and excludes lease incentives. In determining the lease term at lease commencement, the Company includes the noncancellable term and the periods, which the Company deems it is reasonably certain to exercise or not to exercise a renewal or cancellation option. Operating lease expense for minimum lease payments is recognized on a straight-line basis over the lease term. Finance lease expense is recognized as a combination of depreciation expense for the leased asset and interest expense for the outstanding lease liabilities using the discount rate discussed above.\nThe Company has lease agreements with lease and non-lease components that the Company has elected to account for as single lease components.\nEarnings Per Share\nThe calculation of earnings per share is based on the weighted average number of common shares or common stock equivalents outstanding during the applicable period. The dilutive effect of common stock equivalents is excluded from basic earnings per share and is included in the calculation of diluted earnings per share. Potentially dilutive securities include outstanding stock options and unvested restricted stock units, restricted stock, performance awards and other stock-based awards. Diluted shares outstanding are calculated based on the average share price for each fiscal period using the treasury stock method. Under the treasury stock method, the amount the employee must pay for exercising stock options, and the amount of compensation cost for future service that the Company has not yet recognized are assumed to be used to repurchase shares.\nInvestments in Unconsolidated Affiliates\nThe Company’s investments in unconsolidated affiliates are accounted for under the equity method if the Company exercises significant influence or has an investment in a limited partnership that is considered to be greater than minor. These investments are classified as investments in unconsolidated affiliates on the accompanying consolidated balance sheets. The Company records its pro rata share of the earnings, adjusted for accretion of basis difference, of these investments in equity in earnings (losses) of unconsolidated affiliates on the accompanying consolidated statements of income. The Company reviews its investments in unconsolidated affiliates for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable.\nTreasury Stock\nThe Company records treasury stock purchases under the cost method. Upon reissuance of treasury stock, amounts in excess of the acquisition cost are credited to additional paid-in capital. If the Company reissues treasury stock at an amount below its acquisition cost and additional paid-in capital associated with prior treasury stock transactions is insufficient to cover the difference between the acquisition cost and the reissue price, this shortfall is recorded in retained earnings.\n81\nRecently Issued Accounting Standards\nAccounting pronouncements recently adopted\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, to improve reportable segment disclosure requirements. The new guidance requires disclosure of significant segment expenses that are regularly provided to the chief operating decision maker and included in the reported measure of segment profit or loss. It does not change the definition of a segment or the guidance for determining reportable segments. The Company adopted this new accounting guidance effective for the annual period beginning January 1, 2024, and will adopt it in 2025 for interim periods. The adoption of this new accounting guidance for the annual period beginning January 1, 2024 did not have a material effect on the Company's disclosures within the consolidated financial statements.\nAccounting pronouncements issued but not adopted as of December 31, 2024 \n In December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, to enhance the transparency and decision usefulness of income tax disclosures. The amendments in this ASU require additional disclosures about income taxes, primarily focused on the disclosure of income taxes paid and the rate reconciliation table. The new guidance will be effective for the Company in the annual period beginning January 1, 2025. The Company is assessing the impacts of this ASU on its disclosures within the consolidated financial statements.\nIn November 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses (DISE)\n, to improve the disclosures about an entity's expenses and address requests from investors for more detailed information about the types of expenses in commonly presented expense captions. The new guidance requires additional information about specific expense categories in the notes to financial statements at interim and annual reporting periods, and will be effective for the Company in the annual period beginning January 1, 2027, and interim periods beginning January 1, 2028. The Company is assessing the impacts of this ASU on its disclosures within the consolidated financial statements.\n2. \nRevenues by Geography, Concentration of Credit Risk and Remaining Performance Obligations\nThe Company attributes revenues to geographical region based upon where the services are performed. The following tables represent revenues by geographical region and reportable segment for the years ended December 31, 2024, 2023 and 2022:\nDecember 31, 2024\n(in millions)\nTechnology & Analytics Solutions\nResearch & Development Solutions\nContract Sales & Medical Solutions\nTotal\nRevenues:\nAmericas\n$\n3,182\n \n$\n3,894\n \n$\n280\n \n$\n7,356\n \nEurope and Africa\n2,397\n \n2,304\n \n219\n \n4,920\n \nAsia-Pacific\n581\n \n2,329\n \n219\n \n3,129\n \nTotal revenues\n$\n6,160\n \n$\n8,527\n \n$\n718\n \n$\n15,405\n \nDecember 31, 2023\n(in millions)\nTechnology & Analytics Solutions\nResearch & Development Solutions\nContract Sales & Medical Solutions\nTotal\nRevenues:\nAmericas\n$\n3,091\n \n$\n4,157\n \n$\n304\n \n$\n7,552\n \nEurope and Africa\n2,156\n \n2,103\n \n200\n \n4,459\n \nAsia-Pacific\n615\n \n2,135\n \n223\n \n2,973\n \nTotal revenues\n$\n5,862\n \n$\n8,395\n \n$\n727\n \n$\n14,984\n \n82\nDecember 31, 2022\n(in millions)\nTechnology & Analytics Solutions\nResearch & Development Solutions\nContract Sales & Medical Solutions\nTotal\nRevenues:\nAmericas\n$\n2,947\n \n$\n3,747\n \n$\n354\n \n$\n7,048\n \nEurope and Africa\n2,175\n \n2,016\n \n175\n \n4,366\n \nAsia-Pacific\n624\n \n2,158\n \n214\n \n2,996\n \nTotal revenues\n$\n5,746\n \n$\n7,921\n \n$\n743\n \n$\n14,410\n \nWhen attributing revenues to individual countries based upon where the services are performed, no individual country, except for the United States, accounted for 10% or more of total revenues for the years ended December 31, 2024, 2023 and 2022. For the years ended December 31, 2024, 2023 and 2022, revenues in the United States accounted for approximately \n42\n%, \n45\n%, and \n42\n% of total revenues, respectively, using this revenue attribution approach.\nNo individual customer represented 10% or more of total revenues for the years ended December 31, 2024, 2023 and 2022.\nTransaction Price Allocated to the Remaining Performance Obligations\nAs of December 31, 2024, approximately $\n33.5\n billion of revenues are expected to be recognized in the future from remaining performance obligations. The Company expects to recognize revenues on approximately \n30\n% of these remaining performance obligations over the next \ntwelve months\n, on approximately 85% over the next five years, with the balance recognized thereafter. Most of the Company's remaining performance obligations where revenues are expected to be recognized beyond the next \ntwelve months\n are for service contracts for clinical research in the Company's Research & Development Solutions segment. The customer contract transaction price allocated to the remaining performance obligations differs from backlog in that it does not include wholly unperformed contracts under which the customer has a unilateral right to cancel the arrangement.\n3. \nTrade Accounts Receivable, Unbilled Services and Unearned Income\nTrade accounts receivables and unbilled services consist of the following:\nDecember 31,\n(in millions)\n2024\n2023\nTrade accounts receivable\n$\n1,390\n \n$\n1,473\n \nUnbilled services\n1,856\n \n1,942\n \nTrade accounts receivable and unbilled services\n3,246\n \n3,415\n \nAllowance for doubtful accounts\n(\n42\n)\n(\n34\n)\nTrade accounts receivable and unbilled services, net\n$\n3,204\n \n$\n3,381\n \nUnbilled services and unearned income were as follows:\nDecember 31,\n(in millions)\n2024\n2023\nChange\nUnbilled services\n$\n1,856\n \n$\n1,942\n \n$\n(\n86\n)\nUnearned income\n(\n1,779\n)\n(\n1,799\n)\n20\n \nNet balance\n$\n77\n \n$\n143\n \n$\n(\n66\n)\n83\nUnbilled services, which is comprised of approximately \n69\n% and \n68\n% of unbilled receivables and \n31\n% and \n32\n% of contract assets as of December 31, 2024 and December 31, 2023, respectively, decreased by $\n86\n million as compared to December 31, 2023. Contract assets are unbilled services for which invoicing is based on the timing of certain milestones related to service contracts for clinical research whereas unbilled receivables are billable upon the passage of time. Unearned income decreased by $\n20\n million over the same period resulting in a decrease of $\n66\n million in the net balance of unbilled services and unearned income between December 31, 2024 and 2023. The change in the net balance is driven by the difference in timing of revenue recognition in accordance with ASC 606, Revenue from Contracts with Customers, primarily related to the Company’s Research & Development Solutions contracts (which is based on the percentage of costs incurred) versus the timing of invoicing, which is primarily based on certain milestones.\nThe majority of the unearned income balance as of the beginning of the year was recognized in revenues during the year ended December 31, 2024.\nBad debt expense recognized on the Company’s receivables and unbilled services was immaterial for the years ended December 31, 2024, 2023 and 2022.\nAccounts Receivable Factoring Arrangements\nThe Company has accounts receivable factoring agreements to sell certain eligible unsecured trade accounts receivable, either based on automatic arrangements or at its option, without recourse, to unrelated third-party financial institutions for cash. For the year ended December 31, 2024, through its accounts receivable factoring arrangements that the Company utilizes most frequently, the Company factored approximately $\n678\n million of customer invoices on a non-recourse basis and received approximately $\n666\n million in cash proceeds from the sales. For the year ended December 31, 2023, through these same accounts receivable factoring arrangements, the Company factored approximately $\n699\n million of customer invoices on a non-recourse basis and received approximately $\n686\n million in cash proceeds from the sales. The fees associated with these transactions were immaterial. The Company has other accounts receivable arrangements for which the activity associated with them is immaterial.\n \n4. \nInvestments\nDebt, Equity and Other Securities\nCurrent\nThe Company’s short-term investments in debt, equity and other securities consist primarily of trading investments in mutual funds and are measured at fair value with realized and unrealized gains and losses recorded in other (income) expense, net on the accompanying consolidated statements of income.\nLong-term\nThe Company’s long-term debt and equity investments (except those accounted for under the equity method, those that result in consolidation of the investee and certain other investments) are measured at fair value and any changes in fair value are recognized in net income at the end of each reporting period. For debt and equity investments that do not have readily determinable fair values and do not qualify for the existing practical expedient in ASC 820, \nFair Value Measurement,\n to estimate fair value using the net asset value per share of the investment, the Company applies the measurement alternative and measures those investments at cost, less any impairment, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer at each reporting period.\n84\nUnconsolidated Affiliates\nThe Company accounts for its investments in unconsolidated affiliates under the equity method of accounting and records its pro rata share of its losses or earnings from these investments in equity in earnings (losses) of unconsolidated affiliates. \nThe following is a summary of the Company’s investments in unconsolidated affiliates:\nDecember 31,\n(in millions)\n2024\n2023\nNovaQuest Pharma Opportunities Fund V, L.P. (“NQ Fund V”)\n$\n36\n \n$\n35\n \nNostraData Pty Ltd. (“NostraData”) \n17\n18\nNovaQuest Private Equity Fund I, L.P. (“NQ PE Fund I”)\n11\n10\nNovaQuest Pharma Opportunities Fund IV, L.P. (“NQ Fund IV”)\n4\n6\nLongwood Fund V, L.P. (\"Longwood\")\n6\n \n7\n \nRxWare (formerly \"Helparound\")\n2\n2\nNovaQuest Pharma Opportunities Fund III, L.P. (“NQ Fund III”)\n—\n1\nOther\n190\n \n55\n \n$\n266\n \n$\n134\n \nVariable Interest Entities\nAs of December 31, 2024, the Company’s investments in unconsolidated variable interest entities (“VIEs”) and its estimated maximum exposure to loss were as follows:\n(in millions)\nInvestments in Unconsolidated VIEs\nMaximum Exposure to Loss\nNQ Fund V\n$\n36\n \n$\n43\n \nNQ PE Fund I\n11\n \n12\n \nLongwood\n6\n \n8\n \nNQ Fund IV\n4\n \n5\n \nNQ Fund III\n—\n \n5\n \nOther\n179\n506\n$\n236\n \n$\n579\n \nThe difference between the carrying amount of the investments in unconsolidated VIEs and the maximum exposure to loss is primarily attributable to capital commitments that the Company anticipates will be called in the future. \nThe Company is not the primary beneficiary of its VIEs and therefore does not consolidate the VIEs. The Company does not have the power to direct the activities that most significantly affect the VIEs’ economic performance. Additionally, the Company considers whether there are any rights to receive benefits or obligations to absorb losses of the VIE that could potentially be significant to the VIE. \n5. \nDerivatives\nInterest Rate Risk Management\nThe Company has entered into interest rate swaps for purposes of managing its exposure to interest rate fluctuations. The Company does not enter into interest rate swaps for investment or speculative purposes.\nOn July 19, 2018, the Company entered into forward starting interest rate swaps with a total notional value of $\n500\n million in an effort to limit its exposure to changes in the variable interest rate on its Senior Secured Credit Facilities (see Note 10 for additional information). Interest on the swaps began accruing on June 28, 2019 and the swaps expired on June 28, 2024. The Company paid an average fixed rate of \n2.75\n% and received a variable rate of interest equal to the three-month Term SOFR on these swaps.\n85\nOn June 4, 2020, the Company entered into an interest rate swap with a notional value of $\n300\n million in an effort to limit its exposure to changes in the variable interest rate on its Senior Secured Credit Facilities (see Note 10 for additional information). Interest on the swap began accruing on June 30, 2020 and the swa\np expired o\nn June 28, 2024. The Company paid a fixed rate of \n0.32\n% and received a variable rate of interest equal to the three-month Term SOFR on the swap.\nOn January 3, 2023, the Company entered into interest rate swaps with a combined notional value of $\n1,000\n million in an effort to limit its exposure to changes in the variable interest rate on its Senior Secured Credit Facilities (see Note 10 for additional information). Interest on the swaps began accruing on December 30, 2022 and the swaps expire on December 31, 2025. The Company pays a fixed rate of \n4.10\n% and receives a variable rate of interest equal to one-month Term SOFR on the swaps.\nOn November 17, 2023, the Company entered into interest rate swaps with a combined notional value of $\n1,500\n million in an effort to limit its exposure to changes in the variable interest rate on its Senior Secured Credit Facilities (see Note 10 for additional information). Interest on the swaps began accruing on November 28, 2023 and the swaps expire on January 2, 2031. The Company pays a fixed rate of \n6.11\n% and receives a variable rate of interest equal to three-month Term SOFR plus \n2.00\n% on the swaps.\nThe critical terms of the interest rate swaps noted above are substantially the same as the underlying borrowings. These interest rate swaps are accounted for as cash flow hedges as these transactions were executed to hedge the Company's interest payments and for accounting purposes are considered highly effective. As such, changes in the fair value of the interest rate swaps are recorded as unrealized gains (losses) on derivatives included in AOCI.\nThe fair value of these interest rate swaps represents the present value of the anticipated net payments the Company will make to the counterparty, which, when they occur, are reflected as interest expense on the consolidated statements of income. These interest rate swaps result in a total debt mix of approximately \n75\n% fixed rate debt and \n25\n% variable rate debt.\nForeign Exchange Risk Management\nThe Company transacts business in more than \n100\n countries and is subject to risks associated with fluctuating foreign exchange rates. Accordingly, the Company enters into foreign currency forward contracts to hedge certain forecasted foreign exchange cash flows arising from service contracts (“Service Contract Hedging”). It is the Company’s policy to enter into foreign currency forward contracts only to the extent necessary to reduce earnings and cash flow volatility associated with foreign exchange rate movements. The Company does not enter into foreign currency forward contracts for investment or speculative purposes. The principal currency hedged in 2024 was the British Pound.\nService Contract Hedging contracts are designated as cash flow hedges and are carried at fair value, with changes in the fair value recorded to AOCI. The change in fair value is reclassified from AOCI to earnings in the period in which the hedged transaction occurs. These contracts have various expiration dates through September 2025.\nAs of December 31, 2024 and 2023, the Company had open Service Contract Hedging contracts to hedge certain forecasted foreign currency cash flow transactions occurring in 2025 and 2024 with notional amounts totaling $\n108\n million and $\n121\n million, respectively. For accounting purposes these hedges are considered highly effective. As of December 31, 2024 and 2023, the Company had recorded gross unrealized gains (losses) of $\n— million\n and $(\n2\n) million, and $\n2\n million and $\n—\n million, respectively, related to these contracts. Upon expiration of the hedge instruments in 2024, the Company reclassified the unrealized holding gains and losses on the derivative instruments included in AOCI into earnings. The unrealized gains (losses) are included in other current assets and other current liabilities on the accompanying consolidated balance sheets as of December 31, 2024 and 2023.\n86\nNet Investment Risk Management, Euro Denominated Notes\nAs of December 31, 2024, the portion of the Company's foreign currency denominated debt balance that was designated as a hedge of its net investment in certain foreign subsidiaries totaled approximately €\n2,732\n million ($\n2,837\n million). The amount of foreign exchange gains (losses) related to this net investment hedge included in the cumulative translation adjustment component of AOCI was $\n186\n million, $(\n102\n) million, and $\n332\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nNet Investment Risk Management, Cross-Currency Swaps\nOn November 15, 2023, in connection with the issuance of the 2029 Senior Secured Notes (\nsee Note 10 for additional information)\n, the Company entered into cross-currency swaps with a combined notional value of $\n1,250\n million to effectively convert $\n1,250\n million of the 2029 Senior Secured Notes into euro-denominated borrowings at prevailing euro interest rates through February 2029. The Company designated these agreements as a hedge of its net investment in certain foreign subsidiaries. These cross-currency swaps expire in February 2029. The Company will receive semiannual interest payments on February 1 and August 1 from the counterparties based on a fixed interest rate until maturity of these agreements. The effective net borrowing rate to the Company is approximately \n4.8555\n%, inclusive of the yield on the notes and the impact of the cross-currency swaps.\nOn November 17, 2023, in connection with the allocation of the Term B-4 Dollar Loans (\nsee Note 10 for additional information)\n, the Company entered into cross-currency swaps with a combined notional value of $\n1,500\n million to effectively convert $\n1,500\n million of the Term B-4 Dollar Loans into euro-denominated borrowings at prevailing euro interest rates through January 2031. These cross-currency swaps expire in January 2031. The Company will receive quarterly interest payments from the counterparties based on a fixed interest rate until maturity of these agreements. The effective net borrowing rate to the Company is approximately \n4.9015\n%, inclusive of the yield on the loans, the impact of the cross-currency swaps and of the interest rate swaps entered o\nn November 17, 2023 as \nnoted above.\nThe Company does not enter into cross-currency swaps for investment or speculative purposes. For the years ended December 31, 2024 and 2023, the Company recorded gains (losses) of $\n147\n million and $(\n108\n) million, respectively, within AOCI as a result of these cross-currency swaps. The Company recognized $\n36\n million and $\n3\n million related to the excluded component as a reduction of interest expense for the years ended December 31, 2024 and \n2023\n, respectively.\nThe fair values of the Company’s derivative instruments, on a gross basis, and the line items on the accompanying consolidated balance sheets to which they were recorded are summarized in the following table:\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nBalance Sheet Classification\nAssets\nLiabilities\nNotional\nAssets\nLiabilities\nNotional\nDerivatives designated as hedging instruments:\nInterest rate swaps\nOther current assets, other assets and other current liabilities\n$\n—\n \n$\n5\n \n$\n2,485\n \n$\n13\n \n$\n51\n \n$\n3,300\n \nCross-currency swaps\nOther assets and other current liabilities\n39\n \n—\n \n2,735\n \n—\n \n108\n \n2,750\n \nForeign exchange forward contracts\nOther current assets and other current liabilities\n—\n \n2\n \n108\n \n2\n \n—\n \n121\n \nTotal derivatives\n$\n39\n \n$\n7\n \n$\n15\n \n$\n159\n \nThe pre-tax effect of the Company’s cash flow hedging instruments on other comprehensive income is summarized in the following table:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nInterest rate swaps\n$\n33\n \n$\n(\n80\n)\n$\n62\n \nForeign exchange forward contracts\n(\n4\n)\n2\n \n3\n \nTotal\n$\n29\n \n$\n(\n78\n)\n$\n65\n \n87\nThe Company expects $\n3\n million of pre-tax unrealized gains related to its foreign exchange contracts and interest rate derivatives included in AOCI as of December 31, 2024 to be reclassified into earnings within the next twelve months. The total amount, net of income taxes, of the cash flow hedge effect on the accompanying consolidated statements of income was $\n31\n million, $\n51\n million, and $(\n10\n) million for the years ended December 31, 2024, 2023 and 2022, respectively.\n6. \nFair Value Measurements\nThe Company records certain assets and liabilities at fair value. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. A three-level fair value hierarchy that prioritizes the inputs used to measure fair value is described below. This hierarchy requires entities to maximize the use of observable inputs and minimize the use of unobservable inputs. The three levels of inputs used to measure fair value are as follows:\n•    Level 1—Quoted prices in active markets for identical assets or liabilities.\n•    Level 2—Observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data.\n•    Level 3—Unobservable inputs that are supported by little or no market activity. This includes certain pricing models, discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nThe carrying values of cash, cash equivalents, accounts receivable and accounts payable approximated their fair values as of December 31, 2024 and 2023 due to their short-term nature. As of December 31, 2024 and 2023, the fair value of total debt was $\n13,966\n million and $\n13,597\n million, respectively, as determined under Level 2 measurements for these financial instruments.\nRecurring Fair Value Measurements\nThe following table summarizes the fair value of the Company’s financial assets and liabilities that are measured and reported at fair value on a recurring basis as of December 31, 2024:\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nMarketable securities\n$\n170\n \n$\n—\n \n$\n—\n \n$\n170\n \nDerivatives\n—\n \n39\n \n—\n \n39\n \nTotal\n$\n170\n \n$\n39\n \n$\n—\n \n$\n209\n \nLiabilities:\nDerivatives\n$\n—\n \n$\n7\n \n$\n—\n \n$\n7\n \nContingent consideration\n—\n \n—\n \n102\n \n102\n \nTotal\n$\n—\n \n$\n7\n \n$\n102\n \n$\n109\n \n88\nThe following table summarizes the fair value of the Company’s financial assets and liabilities that are measured and reported at fair value on a recurring basis as of December 31, 2023:\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nMarketable securities\n$\n146\n \n$\n—\n \n$\n—\n \n$\n146\n \nDerivatives\n—\n \n15\n \n—\n \n15\n \nTotal\n$\n146\n \n$\n15\n \n$\n—\n \n$\n161\n \nLiabilities:\nDerivatives\n$\n—\n \n$\n159\n \n$\n—\n \n$\n159\n \nContingent consideration\n—\n \n—\n \n106\n \n106\n \nTotal\n$\n—\n \n$\n159\n \n$\n106\n \n$\n265\n \nBelow is a summary of the valuation techniques used in determining fair value:\nMarketable securities\n—The Company values trading and available-for-sale securities using the quoted market value of the securities held.\nDerivatives\n—Derivatives consist of foreign exchange contracts, interest rate swaps, and cross-currency swaps. The fair value of foreign exchange contracts is based on observable market inputs of spot and forward rates or using other observable inputs. The fair value of the interest rate swaps is the estimated amount that the Company would receive or pay to terminate such agreements, taking into account market interest rates and the remaining time to maturities or using market inputs with mid-market pricing as a practical expedient for bid-ask spread. The fair value of the cross-currency swaps is the estimated amount that the Company would receive or pay to terminate such agreements, taking into account the effective interest rates, foreign exchange rates and the remaining time to maturities.\nContingent consideration\n—The Company values contingent consideration related to business combinations using a weighted probability calculation of potential payment scenarios discounted at rates reflective of the risks associated with the expected future cash flows. Assumptions used to estimate the fair value of contingent consideration include various financial metrics (revenues performance targets and operating forecasts) and the probability of achieving the specific targets. Based on the assessments of the probability of achieving specific targets, as of December 31, 2024 the Company has accrued approximately \n61\n% of the maximum contingent consideration payments that could potentially become payable.\nThe following table summarizes the changes in Level 3 financial assets and liabilities measured on a recurring basis for the year ended December 31:\nContingent Consideration\n(in millions)\n2024\n2023\n2022\nBalance as of January 1\n$\n106\n \n$\n173\n \n$\n76\n \nBusiness combinations\n77\n64\n \n134\n \nContingent consideration paid\n(\n10\n)\n(\n73\n)\n(\n22\n)\nRevaluations included in earnings and foreign currency translation adjustments\n(\n71\n)\n(\n58\n)\n(\n15\n)\nBalance as of December 31\n$\n102\n$\n106\n$\n173\n \nThe current portion of contingent consideration is included within accrued expenses and the long-term portion is included within other liabilities on the accompanying consolidated balance sheets. Revaluations of contingent consideration are recognized in other (income) expense, net on the accompanying consolidated statements of income. A change in significant unobservable inputs could result in a higher or lower fair value measurement of contingent consideration.\n89\nNon-recurring Fair Value Measurements\nCertain assets are carried on the accompanying consolidated balance sheets at cost and are not remeasured to fair value on a recurring basis. As of December 31, 2024, assets carried on the balance sheet and not remeasured to fair value on a recurring basis totaled $\n19,554\n million and were identified as Level 3. These assets are comprised of debt investments and cost and equity method investments of $\n345\n million, goodwill of $\n14,710\n million and other identifiable intangibles, net of $\n4,499\n million.\nCost and Equity Method Investments and Debt Investments\n—The inputs available for valuing investments in non-public portfolio companies are generally not easily observable. The valuation of non-public investments requires judgment by the Company due to the absence of quoted market values, inherent lack of liquidity and the long-term nature of such assets. When a triggering event occurs, the Company considers a wide range of available market data when assessing the estimated fair value. Such market data includes observations of the trading multiples of public companies considered comparable to the private companies being valued as well as publicly disclosed merger transactions involving comparable private companies. In addition, valuations are adjusted to account for company-specific issues, the lack of liquidity inherent in a non-public investment, and the fact that comparable public companies are not identical to the companies being valued. Such valuation adjustments are necessary because in the absence of a committed buyer and completion of due diligence similar to that performed in an actual negotiated sale process, there may be company-specific issues that are not fully known that may affect value. Further, a variety of additional factors are reviewed by the Company, including, but not limited to, financing and sales transactions with third parties, current operating performance and future expectations of the particular investment, changes in market outlook, and the third-party financing environment. Because of the inherent uncertainty of valuations, estimated valuations may differ significantly from the values that would have been used had a ready market for the securities existed, and the differences could be material.\nGoodwill\n—Goodwill represents the difference between the purchase price and the fair value of the identifiable tangible and intangible net assets resulting from business combinations. The recoverability of goodwill is evaluated annually for impairment, or if and when events or circumstances indicate a possible impairment. For the year ended December 31, 2024, the Company elected to perform a qualitative impairment assessment. This includes a qualitative analysis of macroeconomic conditions, industry and market considerations, cost factors, financial performance, fair value history and other company specific events. If this qualitative analysis indicates that it is more likely than not that the estimated fair value is less than the carrying value for the respective reporting unit, the Company would then need to calculate the fair value of the reporting unit. If the reporting unit calculated fair value is less than the carrying amount, the Company would record an impairment charge for the difference, with the impairment charge not to exceed the carrying amount of Goodwill. See Note 8 for additional information.\nOther Identifiable Intangibles, Net\n—If a triggering event occurs, the Company determines the estimated fair value of definite-lived intangible assets by determining the present value of the expected cash flows. See Note 8 for additional information.\n7. \nProperty and Equipment\nThe major classes of property and equipment were as follows:\nDecember 31,\n(in millions)\n2024\n2023\nLand, buildings and leasehold improvements\n$\n367\n \n$\n376\n \nEquipment\n840\n \n803\n \nTransportation equipment\n85\n \n81\n \nFurniture and fixtures\n62\n \n66\n \nProperty and equipment, gross\n1,354\n \n1,326\n \nLess accumulated depreciation\n(\n819\n)\n(\n803\n)\nProperty and equipment, net\n$\n535\n \n$\n523\n \nProperty and equipment depreciation expense was as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nDepreciation expense\n$\n149\n \n$\n151\n \n$\n160\n \n90\n8. \nGoodwill and Other Identifiable Intangible Assets \nAs of December 31, 2024, the Company has $\n4,499\n million of other identifiable intangible assets. \nAmortization expense associated with other identifiable definite-lived intangible assets was as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nAmortization expense\n$\n965\n \n$\n974\n \n$\n970\n \nEstimated amortization expense for existing other identifiable intangible assets is expected to be approximately $\n881\n million, $\n738\n million, $\n606\n million, $\n485\n million and $\n371\n million for the years ending December 31, 2025, 2026, 2027, 2028 and 2029, respectively. Estimated amortization expense can be affected by various factors such as future acquisitions, divestitures, abandonments or impairments.\nThe following is a summary of other identifiable intangible assets:\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nGross Amount\nAccumulated Amortization\nNet Amount\nGross Amount\nAccumulated Amortization\nNet Amount\nDefinite-lived identifiable intangible assets:\nClient relationships and backlog\n$\n5,690\n \n$\n(\n2,966\n)\n$\n2,724\n \n$\n5,688\n \n$\n(\n2,724\n)\n$\n2,964\n \nSoftware and related assets\n3,914\n \n(\n2,358\n)\n1,556\n \n3,629\n \n(\n2,005\n)\n1,624\n \nTrademarks, trade names and other\n539\n \n(\n350\n)\n189\n \n548\n \n(\n320\n)\n228\n \nDatabases\n1,773\n \n(\n1,751\n)\n22\n \n1,837\n \n(\n1,819\n)\n18\n \nNon-compete agreements\n14\n \n(\n6\n)\n8\n \n16\n \n(\n11\n)\n5\n \n$\n11,930\n \n$\n(\n7,431\n)\n$\n4,499\n \n$\n11,718\n \n$\n(\n6,879\n)\n$\n4,839\n \nThe following is a summary of goodwill by reportable segment for the years ended December 31, 2024 and 2023:\n(in millions)\nTechnology & Analytics Solutions\nResearch & Development Solutions\nContract Sales & Medical Solutions\nConsolidated\nBalance as of December 31, 2022\n$\n11,520\n \n$\n2,247\n \n$\n154\n \n$\n13,921\n \nBusiness combinations\n352\n \n181\n \n—\n \n533\n \nImpact of foreign currency fluctuations and other\n104\n \n11\n \n(\n2\n)\n113\n \nBalance as of December 31, 2023\n11,976\n \n2,439\n \n152\n \n14,567\n \nBusiness combinations\n346\n \n186\n \n—\n \n532\n \nImpact of foreign currency fluctuations and other\n(\n365\n)\n(\n17\n)\n(\n7\n)\n(\n389\n)\nBalance as of December 31, 2024\n$\n11,957\n \n$\n2,608\n \n$\n145\n \n$\n14,710\n \nThere were \nno\n goodwill impairment losses for the years ended December 31, 2024, 2023 and 2022.\n91\n9. \nAccrued Expenses\nAccrued expenses consist of the following:\nDecember 31,\n(in millions)\n2024\n2023\nClient contract related\n$\n1,458\n \n$\n1,315\n \nCompensation, including bonuses, fringe benefits and payroll taxes\n905\n \n968\n \nProfessional fees\n75\n \n112\n \nContingent consideration and deferred purchase price\n49\n \n27\n \nInterest\n81\n \n66\n \nRestructuring\n21\n \n36\n \nOther\n359\n \n331\n \n$\n2,948\n \n$\n2,855\n \n10. \nCredit Arrangements\nThe following is a summary of the Company’s revolving credit facilities as of December 31, 2024:\nFacility\nInterest Rates\n$\n2,000\n million (revolving credit facility)\nU.S. Dollar Term SOFR plus a margin of \n1.25\n% plus a \n10\n basis credit spread adjustment as of December 31, 2024\n$\n110\n million (receivables financing facility)\nU.S. Dollar Term SOFR plus a margin of \n1.00\n% plus a \n10\n basis credit spread adjustment as of December 31, 2024\n92\nThe following table summarizes the Company’s debt at the dates indicated:\nDecember 31,\n(dollars in millions)\n2024\n2023\nRevolving Credit Facility due 2026:\nU.S. Dollar denominated borrowings—U.S. Dollar Term SOFR at average floating rates of\n \n5.71\n%\n$\n825\n \n$\n100\n \nSenior Secured Credit Facilities:\nTerm A Loan due 2026—U.S. Dollar Term SOFR at floating rates of \n5.71\n%\n1,197\n \n1,270\n \nTerm A Loan due 2026—Euribor at floating rates of \n3.93\n%\n272\n \n306\n \nTerm A Loan due 2027—U.S. Dollar Term SOFR at floating rates of \n5.86\n%\n1,094\n \n1,156\n \nTerm B Loan due 2025—Euribor at floating rates of \n4.68\n%\n542\n \n576\n \nTerm B Loan due 2031—U.S Dollar Term SOFR at floating rates of \n6.33\n%\n1,485\n \n1,500\n \n5.700\n% Senior Secured Notes due 2028—U.S. Dollar denominated\n750\n \n750\n \n6.250\n% Senior Secured Notes due 2029—U.S. Dollar denominated\n1,250\n \n1,250\n \n5.0\n% Senior Notes due 2027—U.S. Dollar denominated\n1,100\n \n1,100\n \n5.0\n% Senior Notes due 2026—U.S. Dollar denominated\n1,050\n \n1,050\n \n6.500\n% Senior Notes due 2030—U.S. Dollar denominated\n500\n \n500\n \n2.875\n% Senior Notes due 2025—Euro denominated\n436\n \n464\n \n2.25\n% Senior Notes due 2028—Euro denominated\n748\n \n795\n \n2.875\n% Senior Notes due 2028—Euro denominated\n739\n \n785\n \n1.750\n% Senior Notes due 2026—Euro denominated\n572\n \n607\n \n2.250\n% Senior Notes due 2029—Euro denominated\n935\n \n993\n \nReceivables financing facility due 2027—U.S. Dollar Term SOFR at floating rates of \n5.69\n%\nRevolving Loan Commitment\n110\n \n110\n \nTerm Loan\n440\n \n440\n \nPrincipal amount of debt\n14,045\n \n13,752\n \nLess: unamortized discount and debt issuance costs\n(\n62\n)\n(\n79\n)\nLess: current portion\n(\n1,145\n)\n(\n718\n)\nLong-term debt\n$\n12,838\n \n$\n12,955\n \nContractual maturities of long-term debt as of December 31, 2024 are as follows:\n(in millions)\n2025\n$\n1,145\n \n2026\n3,904\n \n2027\n2,634\n \n2028\n2,252\n \n2029\n2,200\n \nThereafter\n1,910\n \n$\n14,045\n \nSenior Secured Credit Facilities\nAs of December 31, 2024, the Fifth Amended and Restated Credit Agreement (the “Credit Agreement”) provided financing through several senior secured credit facilities of up to $\n6,585\n million, which consisted of $\n5,415\n million principal amounts of debt outstanding (as detailed in the table above), and $\n1,170\n million of available borrowing capacity on the $\n2,000\n million revolving credit facility and standby letters of credit. The revolving credit facility is comprised of a $\n1,175\n million senior secured revolving facility available in U.S. dollars, a $\n600\n million senior secured revolving facility available in U.S. dollars, Euros, Swiss Francs and other foreign currencies, and a $\n225\n million senior secured revolving facility available in U.S. dollars and Yen.\n93\n2023 Financing Transactions\nOn November 28, 2023, the Company entered into an amendment (the “Amendment”) to its Credit Agreement, among IQVIA Inc., a wholly owned subsidiary of the Company, the Company, IQVIA RDS Inc., a wholly owned subsidiary of the Company, the other guarantors party thereto, Bank of America, N.A. as administrative agent and as collateral agent, and the Lenders (as defined therein) party thereto. Pursuant to the Amendment, the Company borrowed $\n1,500\n million in incremental Term B-4 Dollar Loans (as defined in the Credit Agreement) due January 2, 2031. The net proceeds from the Term B-4 Dollar Loans were used to repay certain of the outstanding term loans due in 2024 and in 2025 under the Company’s senior secured credit facilities, and to pay fees and expenses related to the Amendment and the offering of 2029 Senior Secured Notes (as defined below). In connection with this Amendment, the Company recognized a $\n6\n million loss on extinguishment of debt, which includes fees and expenses.\nOn April 17, 2023, the Company increased the capacity of the senior secured revolving credit facility by $\n500\n million U.S. dollars, bringing the total capacity of the revolving credit facility to $\n2,000\n million. At the same time, the Company also amended the benchmark rate of the U.S dollar revolving credit facility and the U.S dollar Term A Loans from U.S dollar LIBOR to U.S. dollar Secured Overnight Financing Rate term rates (\"Term SOFR\"), plus a \n10\n basis point Credit Spread Adjustment.\nSenior Secured Notes\n2023 Financing Transactions\nOn November 28, 2023, IQVIA Inc. (the “Issuer”), completed the issuance and sale of $\n1,250\n million in gross proceeds of \n6.250\n% senior secured notes due 2029 (the “2029 Senior Secured Notes”). The 2029 Senior Secured Notes were issued pursuant to an Indenture, dated November 28, 2023, among the Issuer, U.S. Bank Trust Company, National Association, as trustee of the 2029 Senior Secured Notes and as collateral agent, and the Company and certain subsidiaries of the Issuer as guarantors. The net proceeds from the 2029 Senior Secured Notes offering were used to repay certain of the outstanding term loans under the Company’s senior secured credit facilities due in 2024 and in 2025, and to pay fees and expenses related to the 2029 Senior Secured Notes offering and the Amendment. \nThe 2029 Senior Secured Notes are secured obligations of the Company, will mature on February 1, 2029, unless earlier repurchased or redeemed in accordance with their terms, and bear interest at the rate of \n6.250\n% per year, with interest payable semi-annually on February 1 and August 1 of each year, beginning on February 1, 2024. The Company may redeem the 2029 Senior Secured Notes prior to January 1, 2029 subject to a customary make-whole premium, and thereafter subject to a redemption price equal to 100% of the principal amount thereof plus accrued and unpaid interest. \nOn May 23, 2023, IQVIA Inc. (the “Issuer”) completed the issuance and sale of $\n750\n million in gross proceeds of \n5.700\n% senior secured notes due 2028 (the “2028 Senior Secured Notes”). The 2028 Senior Secured Notes were issued pursuant to an Indenture, dated May 23, 2023, among the Issuer, U.S. Bank Trust Company, National Association, as trustee of the 2028 Senior Secured Notes and as collateral agent, and the Company and certain subsidiaries of the Issuer as guarantors. The net proceeds from the 2028 Senior Secured Notes offering were used to repay existing borrowings under the Company’s revolving credit facility and to pay fees and expenses related to the 2028 Senior Secured Notes offering and offering of 2030 Senior Notes (as defined below).\nThe 2028 Senior Secured Notes are secured obligations of the Company, will mature on May 15, 2028, unless earlier repurchased or redeemed in accordance with their terms, and bear interest at the rate of \n5.700\n% per year, with interest payable semi-annually on May 15 and November 15 of each year, beginning on November 15, 2023. The Company may redeem the 2028 Senior Secured Notes prior to April 15, 2028 subject to a customary make-whole premium, and thereafter subject to a redemption price equal to 100% of the principal amount thereof plus accrued and unpaid interest.\nEach of the Company's current direct and indirect material U.S. wholly owned restricted subsidiaries (excluding IQVIA Solutions Japan LLC and IQVIA Services Japan LLC) and IQVIA Holdings Inc., have jointly and severally, irrevocably and unconditionally, on a senior secured basis, guaranteed the obligations under the 2028 Senior Secured Notes and the 2029 Senior Secured Notes.\n94\nIn February 2024, the Issuer completed an exchange offer in which it issued $\n1,250\n million aggregate principal amount of \n6.250\n% Senior Secured Notes due 2029 registered under the Securities Act (the “2029 Registered Notes”) and $\n750\n million aggregate principal amount of \n5.700\n% Senior Secured Notes due 2028 registered under the Securities Act (the “2028 Registered Notes” and, together with the 2029 Registered Notes, the 2029 Senior Secured Notes, and the 2028 Senior Secured Notes, the “Notes”) in exchange for the same principal amount and substantially identical terms of the 2029 Senior Secured Notes and 2028 Senior Secured Notes, respectively.\nSenior Notes\n2023 Financing Transactions\nOn May 23, 2023, IQVIA Inc. (the “Issuer”) completed the issuance and sale of $\n500\n million in gross proceeds of \n6.500\n% senior notes due 2030 (the “2030 Senior Notes”). The 2030 Senior Notes were issued pursuant to an Indenture, dated May 23, 2023, among the Issuer, U.S. Bank Trust Company, National Association, as trustee of the 2030 Senior Notes, and certain subsidiaries of the Issuer as guarantors. The net proceeds from the 2030 Senior Notes offering were used to repay existing borrowings under the Company’s revolving credit facility, and to pay fees and expenses related to the 2030 Senior Notes offering and 2028 Senior Secured Notes offering.\nThe 2030 Senior Notes are unsecured obligations of the Company, will mature on May 15, 2030, unless earlier repurchased or redeemed in accordance with their terms, and bear interest at the rate of \n6.500\n% per year, with interest payable semi-annually on May 15 and November 15 of each year, beginning on November 15, 2023. The Company may redeem the 2030 Senior Notes prior to their final stated maturity, subject to a customary make-whole premium, at any time prior to May 15, 2026 (subject to a customary “equity claw” redemption right) and thereafter subject to a redemption premium declining from \n3.250\n% to \n0.000\n%.\nReceivables Financing Facility \nOn October 1, 2024, the Company amended its receivables financing facility to extend the term of the $\n550\n million facility to October 1, 2027. Under the receivables financing facility, certain of the Company's accounts receivable are sold on a non-recourse basis by certain of the Company's consolidated subsidiaries (each, an “Originator”) to another of the Company's consolidated subsidiaries, a bankruptcy-remote special purpose entity (the “SPE”). The SPE obtained a term loan and revolving loan commitment from a third-party lender, secured by liens on the assets of the SPE, to finance the purchase of the accounts receivable, which includes a $\n440\n million term loan and a $\n110\n million revolving loan commitment. As of December 31, 2024, no additional amounts of revolving loans were available under the receivables financing facility. The Company has guaranteed the performance of the obligations of existing and future subsidiaries that sell and service the accounts receivable under the receivables financing facility. The assets of the SPE are not available to satisfy any of the Company’s obligations or any obligations of its subsidiaries. As of December 31, 2024, approximately $\n1,609\n million of the Company's trade accounts receivable and unbilled services were pledged as collateral to secure the facility.\nRestrictive Covenants\nThe Company’s debt agreements provide for certain covenants and events of default customary for similar instruments, including a covenant not to exceed a specified ratio of consolidated senior secured net indebtedness to Consolidated EBITDA, as defined in the senior secured credit facility agreement and a covenant to maintain a specified minimum interest coverage ratio. If an event of default occurs under any of the Company’s or the Company’s subsidiaries’ financing arrangements, the creditors under such financing arrangements will be entitled to take various actions, including the acceleration of amounts due under such arrangements, and in the case of the lenders under the revolving credit facility and term loans, other actions permitted to be taken by a secured creditor. The Company’s long-term debt arrangements contain usual and customary restrictive covenants that, among other things, place limitations on the Company’s ability to declare dividends. As of December 31, 2024, the Company was in compliance in all material respects with the financial covenants under the Company’s financing arrangements.\n95\n11. \nLeases\nThe Company has operating leases for corporate offices, data centers, motor vehicles and certain equipment, many of which contain renewal and escalation clauses. These operating leases expire at various dates through 2037 with options to cancel certain leases at various intervals. The Company also has finance leases for offices and lab spaces that expire at various dates through 2048.\nThe components of lease expense were as follows:\nYear Ended December 31,\n(in millions)\nClassification\n2024\n2023\n2022\nOperating lease cost \n(1) \nSelling, general and administrative expenses\n$\n158\n \n$\n160\n \n$\n171\n \nFinance lease cost \n(1)\nDepreciation and amortization, and Interest expense\n18\n \n18\n \n12\n \nTotal lease cost\n$\n176\n \n$\n178\n \n$\n183\n \n(1) \nIncludes variable lease costs, which are immaterial.\nOther information related to leases was as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nSupplemental Cash Flow:\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows for operating leases\n$\n160\n \n$\n175\n \n$\n173\n \nOperating cash flows for finance leases\n$\n8\n \n$\n8\n \n$\n5\n \nFinancing cash flows for finance leases\n$\n5\n \n$\n3\n \n$\n4\n \nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n$\n58\n \n$\n59\n \n$\n79\n \nFinance leases\n$\n—\n \n$\n—\n \n$\n54\n \nWeighted Average Remaining Lease Term:\nOperating leases\n4.58\n years\n4.61\n years\n4.72\n years\nFinance leases\n19.73\n years\n20.67\n years\n21.64\n years\nWeighted Average Discount Rate:\nOperating leases\n4.57\n \n%\n3.81\n \n%\n3.12\n \n%\nFinance leases\n3.90\n \n%\n3.88\n \n%\n3.87\n \n%\n96\nFuture minimum lease payments under non-cancellable leases as of December 31, 2024 were as follows:\n(in millions)\nOperating Leases\nFinance Leases\n2025\n$\n109\n \n$\n13\n \n2026\n71\n \n13\n \n2027\n49\n \n14\n \n2028\n33\n \n14\n \n2029\n14\n \n14\n \nThereafter\n22\n \n269\n \nTotal future minimum lease payments\n298\n \n337\n \nLess imputed interest\n(\n26\n)\n(\n113\n)\nTotal\n$\n272\n \n$\n224\n \nReported as of December 31, 2024:\nOther current liabilities\n$\n99\n \n$\n6\n \nOperating lease liabilities\n173\n \n— \nOther liabilities\n— \n218\n \nTotal\n$\n272\n \n$\n224\n \n12. \nContingencies\nThe Company and its subsidiaries are involved in legal and tax proceedings, claims and litigation arising in the ordinary course of business. Management periodically assesses the Company’s liabilities and contingencies in connection with these matters based upon the latest information available. For those matters where management currently believes it is probable that the Company will incur a loss and that the probable loss or range of loss can be reasonably estimated, the Company has recorded an accrual in the consolidated financial statements based on its best estimates of such loss. In other instances, because of the uncertainties related to either the probable outcome or the amount or range of loss, management is unable to make a reasonable estimate of a liability, if any.\nHowever, even in many instances where the Company has recorded an estimated liability, the Company is unable to predict with certainty the final outcome of the matter or whether resolution of the matter will materially affect the Company’s results of operations, financial position or cash flows. As additional information becomes available, the Company adjusts its assessments and estimates of such liabilities accordingly.\nThe Company routinely enters into agreements with third parties, including its clients and suppliers, all in the normal course of business. In these agreements, the Company sometimes agrees to indemnify and hold harmless the other party for any damages such other party may suffer as a result of potential intellectual property infringement and other claims. The Company has not accrued a liability with respect to these matters generally, as the exposure is considered remote.\nBased on its review of the latest information available, management does not expect the impact of pending legal and tax proceedings, claims and litigation, either individually or in the aggregate, to have a material adverse effect on the Company’s results of operations, cash flows or financial position. However, one or more unfavorable outcomes in any claim or litigation against the Company could have a material adverse effect for the period in which it is resolved. The following is a summary of certain legal matters involving the Company.\n97\nOn January 10, 2017, Quintiles IMS Health Incorporated and IMS Software Services Ltd. (collectively “IQVIA Parties”), filed a lawsuit in the U.S. District Court for the District of New Jersey against Veeva Systems, Inc. (“Veeva”) alleging Veeva unlawfully used IQVIA Parties intellectual property to improve Veeva data offerings, to promote and market Veeva data offerings and to improve Veeva technology offerings. IQVIA Parties seek injunctive relief, appointment of a monitor, the award of compensatory and punitive damages and reimbursement of all litigation expenses, including reasonable attorneys’ fees and costs. On March 13, 2017, Veeva filed counterclaims alleging anticompetitive business practices in violation of the Sherman Act and state laws. Veeva claims damages in excess of $\n200\n million, and is seeking punitive damages and litigation costs, including attorneys’ fees. The Company believes the counterclaims are without merit, rejects all counterclaims raised by Veeva and intends to vigorously defend IQVIA Parties’ position and pursue its claims against Veeva. Since the initial filings, the parties have filed additional litigations against each other, primarily concerning the use of IQVIA data with various other Veeva products. Trial has been continued from an early 2025 setting to a date to be determined by the Court.\nOn May 7, 2021, the Court issued an order and opinion (the “Order”) in which it found significant evidence that Veeva had (1) misappropriated IQVIA data and unlawfully used it to improve Veeva data offerings, (2) engaged in a cover-up by deleting significant evidence of its theft of IQVIA’s trade secrets, and (3) improperly withheld certain evidence under privilege in furtherance of a crime and/or fraud against IQVIA. The Court imposed five sanctions against Veeva, including ordering three separate adverse inference instructions be issued to the jury and that IQVIA be permitted to present evidence to the jury of Veeva’s destruction efforts. Veeva appealed the Order. On March 30, 2024, the Court denied Veeva’s appeal with regard to its rejected privilege claims, while reserving ruling on the appropriate sanctions to be imposed for a later time.\n13. \nStockholders’ Equity\nPreferred Stock\nThe Company is authorized to issue \n1.0\n million shares of preferred stock, $\n0.01\n per share par value. \nNo\n shares of preferred stock were issued and outstanding as of December 31, 2024 or 2023.\nEquity Repurchase Program\nOn October 30, 2013, the Company’s Board of Directors (the “Board”) first approved the Company's equity repurchase program (the “Repurchase Program”), authorizing the repurchase of up to $\n125\n million of the Company’s common stock. The Board increased the stock repurchase authorization under the Repurchase Program with respect to the repurchase of the Company's common stock by $\n600\n million, $\n1.5\n billion, $\n2.0\n billion, $\n1.5\n billion, $\n2.0\n billion, $\n2.0\n billion, and $\n2.0\n billion in 2015, 2016, 2017, 2018, 2019, 2022, and 2023, respectively. On February 5, 2025, the Board increased the stock repurchase authorization under the Repurchase Program with respect to the repurchase of the Company's common stock by an additional $\n2,000\n million, which increased the total amount that has been authorized under the Repurchase Program to $\n13,725\n million. The Repurchase Program does not obligate the Company to repurchase any particular amount of common stock, and it may be modified, extended, suspended or discontinued at any time.\nAs of December 31, 2024, the Company had remaining authorization to repurchase up to $\n1,013\n million of its common stock under the Repurchase Program. In addition, from time to time, the Company has repurchased and may continue to repurchase common stock through private or other transactions outside of the Repurchase Program.\nThere were no equity offerings during the years ended December 31, 2024, 2023 and 2022.\nSummary\nBelow is a summary of the share repurchases made under the Repurchase Program:\nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nNumber of shares of common stock repurchased\n6.4\n \n5.0\n \n5.5\n \nAggregate purchase price\n$\n1,350\n \n$\n992\n \n$\n1,168\n \nAverage price per share\n$\n209.68\n \n$\n196.89\n \n$\n213.06\n \n98\n14. \nBusiness Combinations\nThe Company completed several individually immaterial acquisitions during the years ended December 31, 2024 and 2023. The Company’s assessment of fair value, including the valuation of certain acquired intangibles and the purchase price allocation related to the acquisitions that occurred during the year ended December 31, 2024 is preliminary and subject to change upon completion. Further adjustments, largely related to acquired intangible assets and related deferred taxes, may be necessary as additional information related to the fair values of assets acquired and liabilities assumed is assessed during the measurement period (up to one year from the acquisition date). The Company recorded goodwill from these acquisitions, primarily attributable to assembled workforce, expected synergies and new client relationships. The consolidated financial statements include the results of the acquisitions subsequent to their respective closing dates. Pro forma information is not presented as pro forma results of operations would not be materially different to the actual results of operations of the Company. \nThe following table provides certain preliminary financial information for these acquisitions:\nYear Ended December 31,\n(in millions)\n2024\n2023\nAssets acquired:\nCash and cash equivalents\n$\n28\n \n$\n28\n \nAccounts receivable\n68\n \n44\n \nOther assets\n60\n \n9\n \nGoodwill\n532\n \n533\n \nOther identifiable intangibles\n313\n \n425\n \nLiabilities assumed:\nOther liabilities\n(\n114\n)\n(\n44\n)\nDeferred income taxes, long-term\n(\n40\n)\n(\n18\n)\nNet assets acquired \n(1)\n$\n847\n \n$\n977\n \n(1) Net assets acquired include contingent consideration and deferred purchase price of $\n84\n million and $\n73\n million, respectively.\nThe portion of goodwill deductible for income tax purposes was preliminarily assessed as $\n343\n million and $\n379\n million for the years ended December 31, 2024 and 2023, respectively.\nThe following table provides a summary of the preliminary estimated fair value of certain intangible assets acquired:\nYear Ended December 31,\n(in millions)\nAmortization Period\n2024\n2023\nOther identifiable intangibles:\nClient relationships\n9\n-\n16\nyears\n$\n257\n \n$\n324\n \nBacklog\n1\n-\n4\nyears\n28\n \n51\n \nSoftware and related assets\n3\n-\n5\nyears\n10\n \n44\n \nNon-compete agreements\n3\n-\n5\nyears\n7\n \n—\n \nTrade names\n5\nyears\n6\n \n2\n \nDatabases\n4\n-\n5\nyears\n5\n \n4\n \nTotal Other identifiable intangibles\n$\n313\n \n$\n425\n \n15. \nRestructuring\nThe Company has continued to take restructuring actions in the year ended December 31, 2024 to align its resources and reduce overcapacity to adapt to changing market conditions and integrate acquisitions. These actions include consolidating functional activities, eliminating redundant positions, and aligning resources with customer requirements. These restructuring actions are expected to continue into 2025.\n99\nThe management approved plans resulted in $\n67\n million, $\n84\n million and $\n28\n million of restructuring expense, net of reversals, which consisted primarily of severance and other exit-related costs in the years ended December 31, 2024, 2023 and 2022, respectively.\nThe following amounts were recorded for the restructuring plans:\n(in millions)\nSeverance and Related Costs\nBalance as of December 31, 2022\n$\n26\n \nExpense, net of reversals\n84\n \nPayments\n(\n74\n)\nBalance as of December 31, 2023\n$\n36\n \nExpense, net of reversals\n67\n \nPayments\n(\n81\n)\nForeign currency translation and other\n(\n1\n)\nBalance as of December 31, 2024\n$\n21\n \nThe reversals were due to changes in estimates primarily resulting from the redeployment of staff and higher than expected voluntary terminations. Restructuring costs are not allocated to the Company’s reportable segments as they are not part of the segment performance measures regularly reviewed by management. The Company expects the majority of the restructuring accruals as of December 31, 2024 will be paid in 2025.\n16. \nIncome Taxes\nThe components of income before income taxes and equity in earnings (losses) of unconsolidated affiliates are as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nDomestic\n$\n214\n \n$\n108\n \n$\n(\n45\n)\nForeign\n1,455\n1,351\n1,408\n$\n1,669\n$\n1,459\n$\n1,363\nThe components of income tax expense attributable to continuing operations are as follows:\nYear Ended December 31,\n(in millions) \n2024\n2023\n2022\nCurrent expense:\nFederal and state\n$\n44\n$\n21\n$\n24\n \nForeign\n386\n \n349\n \n358\n \n430\n \n370\n \n382\n \nDeferred (benefit) expense:\nFederal and state\n(\n116\n)\n(\n236\n)\n(\n94\n)\nForeign\n(\n13\n)\n(\n33\n)\n(\n28\n)\n(\n129\n)\n(\n269\n)\n(\n122\n)\n$\n301\n \n$\n101\n \n$\n260\n \n100\nThe differences between the Company’s consolidated income tax expense attributable to continuing operations and the expense computed at the United States statutory income tax rate of 21% were as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nFederal income tax expense at statutory rate\n$\n351\n \n$\n306\n \n$\n286\n \nState and local income taxes, net of federal effect\n9\n \n16\n \n(\n15\n)\nResearch and development\n(\n28\n)\n(\n25\n)\n(\n19\n)\nUnited States taxes recorded on foreign earnings(*)\n(\n79\n)\n(\n41\n)\n(\n4\n)\nTax contingencies\n14\n \n17\n \n14\n \nForeign Derived Intangible Income (“FDII”)\n(\n56\n)\n(\n53\n)\n(\n41\n)\nForeign rate differential\n87\n \n45\n \n38\n \nEquity compensation\n3\n \n—\n \n2\n \nValuation Allowance Release\n—\n \n(\n102\n)\n—\n \nBasis Difference Reversal\n—\n \n(\n61\n)\n—\n \nOther\n—\n \n(\n1\n)\n(\n1\n)\n$\n301\n \n$\n101\n \n$\n260\n \n(*) Includes impact of GILTI, and other U.S. taxes on foreign earnings.\nThe Company's effective income tax rate was \n18.0\n%, \n6.9\n%, and \n19.1\n% for the years ending December 31, 2024, 2023, and 2022, respectively. The Company's effective income tax rate for December 31, 2023, was favorably impacted due to the completion of an internal legal entity restructuring that resulted in a benefit of $\n125\n million. Historically, the Company recorded deferred tax assets related to certain foreign tax credits, and a full valuation allowance in relation to these foreign tax credits was established as it was not expected the credits would be utilized prior to expiration. The Company now believes it is reasonably possible that these foreign tax credits will be utilized and therefore recorded a tax benefit of $\n64\n million related to the valuation allowance release and establishing related uncertain tax positions. Additionally, due to the restructuring the Company also reversed a deferred tax liability of $\n61\n million due to a basis difference that was recovered in a tax-free manner. The effective tax rate was also favorably impacted by a reversal of uncertain tax positions relating to tax credit carryforwards in the amount of $\n21\n million due to an audit settlement.\nOn December 12, 2022, the European Union member states agreed to implement the Organization for Economic Co-operation and Development’s (“OECD”) Pillar Two global corporate minimum tax rate of 15% on companies with revenues of at least $790 million, which went into effect in 2024. The Company has continued to evaluate the effect of this through the end of 2024 and determined that it did not have any material impacts for the current year. The Company will continue to assess the impact of this proposal as countries are actively considering changes to their tax laws to adopt certain parts of the OCED's proposal. \nUndistributed earnings of the Company’s foreign subsidiaries amounted to approximately $\n5,117\n million as of December 31, 2024. The Company does not consider any of its foreign earnings as indefinitely reinvested.\n101\nThe income tax effects of temporary differences from continuing operations that give rise to significant portions of deferred income tax assets (liabilities) are presented below:\nDecember 31,\n(in millions)\n2024\n2023\nDeferred income tax assets:\nNet operating loss and other loss carryforwards\n$\n176\n \n$\n132\n \nTax credit carryforwards\n292\n \n254\n \nAccrued expenses and unearned income\n106\n \n103\n \nEmployee benefits\n180\n \n202\n \nLease liability\n34\n \n65\n \nU.S. interest expense limitation\n93\n \n59\n \nOther\n52\n \n81\n \nTotal deferred income tax assets\n933\n \n896\n \nValuation allowance for deferred income tax assets\n(\n196\n)\n(\n166\n)\nTotal deferred income tax assets (net of valuation allowance)\n737\n \n730\n \nDeferred income tax liabilities:\nAmortization and depreciation\n(\n545\n)\n(\n590\n)\nLease right-of-use assets\n(\n19\n)\n(\n56\n)\nForeign exchange on debt instruments\n(\n104\n)\n(\n48\n)\nOther\n(\n71\n)\n(\n72\n)\nTotal deferred income tax liabilities\n(\n739\n)\n(\n766\n)\nNet deferred income tax assets (liabilities)\n$\n(\n2\n)\n$\n(\n36\n)\nDuring the year ended December 31, 2024, the net deferred income tax liabilities decreased due to amortization of intangibles related to the merger between Quintiles and IMS Health.\nThe Company had federal, state and local, and foreign tax loss carryforwards and tax credits, the tax effect of which was $\n541\n million as of December 31, 2024. Of this amount, $\n57\n million has an indefinite carryforward period, and the remaining $\n484\n million expires at various times beginning in 2025. Some of the federal losses are subject to limitations under the Internal Revenue Code, however, management expects these losses to be utilized during the carryforward periods.\nIn the year ended December 31, 2024, the Company increased its valuation allowance by $\n30\n million to $\n196\n million as of December 31, 2024 from $\n166\n million as of December 31, 2023. On December 10, 2024, the US Department of Treasury published final regulations related to foreign currency gains and losses that are effective as of January 1, 2025. These regulations require computation of pre-transition foreign currency gain or loss to be included in the determination of future taxable income or loss. The valuation allowance increased primarily as a result of these regulations. We recorded a one-time, non-cash deferred tax benefit related to the pre-transition foreign currency losses in the current year that will be fully offset by a valuation allowance. \nA reconciliation of the beginning and ending amount of gross unrecognized income tax benefits is presented below:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nBalance as of January 1\n$\n140\n \n$\n122\n \n$\n116\n \nAdditions based on tax positions related to the current year\n15\n \n53\n \n13\n \nAdditions for income tax positions of prior years\n17\n \n8\n \n20\n \nImpact of changes in exchange rates\n(\n2\n)\n1\n \n(\n2\n)\nSettlements with tax authorities\n(\n1\n)\n(\n6\n)\n(\n4\n)\nReductions for income tax positions of prior years\n(\n18\n)\n(\n25\n)\n(\n11\n)\nReductions due to the lapse of the applicable statute of limitations\n(\n5\n)\n(\n13\n)\n(\n10\n)\nBalance as of December 31\n$\n146\n \n$\n140\n \n$\n122\n \n102\nAs of December 31, 2024, the Company had total gross unrecognized income tax benefits of $\n132\n million associated with over 100 jurisdictions in which the Company conducts business that, if recognized, would reduce the Company’s effective income tax rate.\nThe Company’s policy for recording interest and penalties relating to uncertain income tax positions is to record them as a component of income tax expense in the accompanying consolidated statements of income. In the years ended December 31, 2024, 2023 and 2022, the amount of interest and penalties recorded as an addition to income tax expense in the accompanying consolidated statements of income was $\n6\n million, $\n—\n million and $\n2\n million, respectively. As of December 31, 2024, and 2023, the Company had accrued approximately $\n26\n million and $\n20\n million, respectively, of interest and penalties.\nThe Company believes that it is reasonably possible that a decrease of up to $\n8\n million in gross unrecognized income tax benefits for federal, state and foreign exposure items may be necessary within the next 12 months due to lapse of statutes of limitations or uncertain tax positions being effectively settled. The Company believes that it is reasonably possible that a decrease of up to $\n13\n million in gross unrecognized income tax benefits for foreign items may be necessary within the next 12 months due to payments. For the remaining uncertain income tax positions, it is difficult at this time to estimate the timing of the resolution.\nThe Company conducts business globally and, as a result, files income tax returns in the United States federal jurisdiction and various state and foreign jurisdictions. In the normal course of business, the Company is subject to examination by taxing authorities throughout the world. The following table summarizes the tax years that remain open for examination by tax authorities in the most significant jurisdictions in which the Company operates:\nUnited States\n2020\n-\n2023\nIndia\n2006\n-\n2024\nJapan\n2018\n-\n2023\nUnited Kingdom\n2022\n-\n2023\nSwitzerland\n2020\n-\n2023\nIn certain of the jurisdictions noted above, the Company operates through more than one legal entity, each of which has different open years subject to examination. The table above presents the open years subject to examination for the most material of the legal entities in each jurisdiction. Additionally, it is important to note that tax years are technically not closed until the statute of limitations in each jurisdiction expires. In the jurisdictions noted above, the statute of limitations can extend beyond the open years subject to examination.\nDue to the geographic breadth of the Company’s operations, numerous tax audits may be ongoing throughout the world at any point in time. Income tax liabilities are recorded based on estimates of additional income taxes that may be due upon the conclusion of these audits. Estimates of these income tax liabilities are made based upon prior experience and are updated in light of changes in facts and circumstances. However, due to the uncertain and complex application of income tax regulations, it is possible that the ultimate resolution of audits may result in liabilities that could be materially different from these estimates. In such an event, the Company will record additional income tax expense or income tax benefit in the period in which such resolution occurs.\n17. \nEmployee Benefit Plans\nPension and Postretirement Benefit Plans\nThe Company sponsors both funded and unfunded defined benefit pension plans. These plans provide benefits based on various criteria, including, but not limited to, years of service and salary. The Company also sponsors an unfunded postretirement benefit plan in the United States that provides health and prescription drug benefits to retirees who meet the eligibility requirements. The Company uses a December 31 measurement date for all pension and postretirement benefit plans.\n103\nThe following table summarizes changes in the benefit obligation, the plan assets and the funded status of the pension benefit plans:\nPension Benefits\nUnited States Plans\nNon-United States Plans\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nObligation and funded status:\nChange in benefit obligation:\nProjected benefit obligation at beginning of year\n$\n434\n \n$\n400\n \n$\n525\n \n$\n461\n \nService costs\n10\n \n10\n \n35\n \n35\n \nInterest cost\n22\n \n22\n \n17\n \n17\n \nActuarial (gains) losses\n(\n9\n)\n15\n \n(\n2\n)\n5\n \nBenefits paid\n(\n14\n)\n(\n13\n)\n(\n26\n)\n(\n20\n)\nContributions\n—\n \n—\n \n3\n \n3\n \nSettlements\n—\n \n—\n \n(\n3\n)\n(\n3\n)\nForeign currency fluctuations and other\n—\n \n—\n \n4\n \n27\n \nProjected benefit obligation at end of year\n443\n \n434\n \n553\n \n525\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n486\n \n419\n \n379\n \n355\n \nActual return on plan assets\n62\n \n75\n \n(\n9\n)\n2\n \nContributions\n4\n \n5\n \n29\n \n27\n \nBenefits paid\n(\n14\n)\n(\n13\n)\n(\n26\n)\n(\n20\n)\nSettlements\n—\n \n—\n \n(\n3\n)\n(\n3\n)\nForeign currency fluctuations and other\n—\n \n—\n \n14\n \n18\n \nFair value of plan assets at end of year\n538\n \n486\n \n384\n \n379\n \nFunded status\n$\n95\n \n$\n52\n \n$\n(\n169\n)\n$\n(\n146\n)\nThe following table summarizes the amounts recognized in the consolidated balance sheets related to the pension benefit plans:\nPension Benefits\nUnited States Plans\nNon-United States Plans\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nDeposits and other assets, net\n$\n121\n$\n87\n$\n43\n \n$\n49\n \nAccounts payable and accrued expenses\n$\n3\n$\n4\n$\n14\n \n$\n12\n \nOther liabilities\n$\n23\n$\n31\n$\n198\n$\n183\n \nAccumulated other comprehensive loss\n$\n64\n$\n28\n$\n(\n49\n)\n$\n(\n25\n)\nAs of December 31, 2024, the benefit obligation and amount recognized in AOCI for other postretirement benefits were immaterial. \nThe following table summarizes the accumulated benefit obligation for all pension benefit plans:\nPension Benefits\nUnited States Plans\nNon-United States Plans\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nAccumulated benefit obligation\n$\n441\n \n$\n430\n \n$\n500\n$\n480\n \n104\nThe following table provides the information for pension plans with an accumulated benefit obligation in excess of plan assets and projected benefit obligations in excess of plan assets:\nPension Benefits\nUnited States Plans\nNon-United States Plans\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nPlans with accumulated benefit obligation in excess of plan assets:\nAccumulated benefit obligation\n$\n34\n$\n41\n$\n287\n$\n251\n \nFair value of plan assets\n$\n8\n$\n7\n$\n129\n$\n101\n \nPlans with projected benefit obligation in excess of plan assets:\nProjected benefit obligation\n$\n34\n \n$\n41\n \n$\n340\n \n$\n295\nFair value of plan assets\n$\n8\n \n$\n7\n \n$\n129\n \n$\n101\nThe components of net periodic benefit cost changes in plan assets and benefit obligations recognized in comprehensive income were as follows:\nPension Benefits\nUnited States Plans\nNon-United States Plans\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n10\n \n$\n10\n \n$\n13\n \n$\n35\n \n$\n35\n \n$\n29\nInterest cost\n22\n \n22\n \n13\n \n17\n17\n8\n \nExpected return on plan assets\n(\n34\n)\n(\n30\n)\n(\n38\n)\n(\n15\n)\n(\n17\n)\n(\n18\n)\nAmortization of actuarial losses\n—\n \n—\n \n1\n \n—\n \n(\n2\n)\n1\n \nSettlement gain\n—\n \n—\n \n1\n \n—\n \n—\n \n(\n1\n)\nNet periodic benefit cost\n(\n2\n)\n2\n \n(\n10\n)\n37\n \n33\n \n19\n \nOther changes in plan assets and benefit obligations recognized in other comprehensive loss:\nActuarial (gain) loss – current year\n(\n36\n)\n(\n30\n)\n31\n \n24\n \n19\n \n(\n18\n)\nTotal recognized in other comprehensive income\n(\n36\n)\n(\n30\n)\n31\n \n24\n \n19\n \n(\n18\n)\nTotal recognized in net periodic benefit cost and other comprehensive income\n$\n(\n38\n)\n$\n(\n28\n)\n$\n21\n \n$\n61\n \n$\n52\n \n$\n1\n \nAll components of net periodic benefit cost other than service cost are recorded in other (income) expense, net on the accompanying consolidated statements of income. Gains (losses) affecting the benefit obligation for the year ending December 31, 2024 were primarily related to the changes in discount rates, as well as changes in other actuarial assumptions which are driven by changing market conditions\n.\nAssumptions\nThe weighted average assumptions used to determine net periodic benefit cost were as follows for the years ended December 31:\nPension Benefits\nUnited States Plans\nNon-United States Plans\n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n5.35\n \n%\n5.65\n \n%\n3.08\n \n%\n3.52\n \n%\n3.59\n \n%\n1.46\n \n%\nRate of compensation increases\n3.00\n \n%\n3.00\n \n%\n3.00\n \n%\n2.78\n \n%\n2.93\n \n%\n2.57\n \n%\nExpected return on plan assets\n7.20\n \n%\n7.20\n \n%\n7.23\n \n%\n3.70\n \n%\n4.53\n \n%\n4.22\n \n%\n105\nThe weighted average assumptions used to determine benefit obligations were as follows as of December 31:\nPension Benefits\nUnited States Plans\nNon-United States Plans\n2024\n2023\n2024\n2023\nDiscount rate\n5.83\n \n%\n5.35\n \n%\n3.67\n \n%\n3.52\n \n%\nRate of compensation increases\n3.00\n \n%\n3.00\n \n%\n3.50\n \n%\n2.78\n \n%\nThe discount rate represents the interest rate used to determine the present value of the future cash flows currently expected to be required to settle the Company’s defined benefit plan obligations. The discount rates are derived using weighted average yield curves on AA-rated corporate bonds. The cash flows from the Company’s expected benefit obligation payments are then matched to the yield curve to derive the discount rates.\nThe Company’s assumption for the expected return on plan assets was determined by the weighted average of the long-term expected rate of return on each of the asset classes invested as of the balance sheet date. For plan assets invested in government bonds, the expected return was based on the yields on the relevant indices as of the balance sheet date. There is considerable uncertainty for the expected return on plan assets invested in equity and diversified growth funds. \nUnder the Company’s United States qualified retirement plan, participants have a notional retirement account that increases with pay and investment credits. The rate used to determine the investment credit (cash balance crediting rate) varies monthly and is equal to 1/12th of the yield on \n30-year\n U.S. Government Treasury Bonds, with a minimum of \n0.25\n%. At retirement, the account is converted to a monthly retirement benefit.\nPlan Assets\nThe Company’s pension plan target asset allocations and weighted average asset allocations, by asset category, were as follows:\nPlan Assets as of December 31,\nTarget\nUnited States Plans\nNon-United States Plans\nTotal\nAsset Category\nAllocation\n2024\n2023\n2024\n2023\n2024\n2023\nEquity securities\n40\n-\n65\n%\n76\n \n%\n73\n \n%\n—\n \n%\n—\n \n%\n45\n \n%\n42\n \n%\nDebt securities\n10\n-\n40\n%\n20\n \n21\n \n49\n \n56\n \n32\n \n36\n \nReal estate\n0\n-\n5\n%\n4\n \n4\n \n—\n \n—\n \n2\n \n2\n \nOther\n10\n-\n30\n%\n—\n \n2\n \n51\n \n44\n \n21\n \n20\n \nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n100\n \n%\n100\n \n%\n100\n \n%\nThe following table summarizes United States plan assets measured at fair value:\nDecember 31, 2024\nDecember 31, 2023\nAsset Category\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nTotal\n(in millions)\nDomestic equities\n$\n37\n \n$\n—\n \n$\n37\n \n$\n33\n \n$\n—\n \n$\n33\n \nInternational equities\n11\n \n—\n \n11\n \n11\n \n—\n \n11\n \nCorporate bonds\n64\n \n—\n \n64\n \n65\n \n—\n \n65\n \nReal estate\n21\n \n—\n \n21\n \n21\n \n—\n \n21\n \nTotal assets in the fair value hierarchy\n133\n \n—\n \n133\n \n130\n \n—\n \n130\n \nAssets measured at net asset value (“NAV”)\n(1)\n—\n \n—\n \n405\n \n—\n \n—\n \n356\n \nTotal\n$\n133\n \n$\n—\n \n$\n538\n \n$\n130\n \n$\n—\n \n$\n486\n \n(1) Certain investments that are measured at fair value using the net asset value (\"NAV\") per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in the above plan asset tables are intended to permit reconciliation of the fair value of plan assets in the fair value hierarchy to the plan asset amounts presented in the above funded status table as of December 31, 2024 and 2023.\n106\nThe following table summarizes non-United States plan assets measured at fair value:\nDecember 31, 2024\nDecember 31, 2023\nAsset Category\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nTotal\n(in millions)\nInternational equities\n$\n—\n \n$\n1\n \n$\n1\n \n$\n1\n \n$\n1\n \n$\n2\n \nDebt issued by national, state or local government\n2\n \n170\n \n172\n \n2\n \n210\n \n212\n \nCorporate bonds\n—\n \n18\n \n18\n \n—\n \n—\n \n—\n \nInvestments funds\n—\n \n10\n \n10\n \n—\n \n10\n \n10\n \nInsurance contracts\n—\n \n168\n \n168\n \n—\n \n145\n \n145\n \nOther\n8\n \n7\n \n15\n \n3\n \n7\n \n10\n \nTotal\n$\n10\n \n$\n374\n \n$\n384\n \n$\n6\n \n$\n373\n \n$\n379\n \nInvestments in mutual funds are valued at quoted market prices. Investments in common/collective trusts and pooled funds are valued at the NAV as reported by the trust. The NAV is based on the fair value of the underlying investments held by the fund less its liabilities. Insurance contracts are valued at the amount of the benefit liability. The Company has no Level 3 assets that rely on unobservable inputs to measure fair value.\nInvestment Policies and Strategies\nThe Company invests primarily in a diversified portfolio of debt and equity securities that provide for long-term growth within reasonable and prudent levels of risk. The asset allocation targets established by the Company are strategic and applicable to the plan’s long-term investing horizon. The portfolio is constructed and maintained to provide adequate liquidity to meet associated liabilities and minimize long-term expense and provide prudent diversification among asset classes in accordance with the principles of modern portfolio theory. The plan employs a diversified mix of actively managed investments around a core of passively managed index exposures in each asset class. Within each asset class, rapid market shifts, changes in economic conditions or an individual fund manager’s outlook may cause the asset allocation to fall outside the prescribed targets. The majority of the Company’s plan assets are measured quarterly against benchmarks established by the Company’s investment manager and the Company’s Investment Committee, who review actual plan performance and have the authority to recommend changes as deemed appropriate. Assets are rebalanced periodically to their strategic targets to maintain the plan’s strategic risk/reward characteristics. The Company periodically conducts asset liability modeling studies to ensure that the investment strategy is aligned with the obligations of the plans and that the assets will generate income and capital growth to meet the cost of current and future benefits that the plans provide. The pension plans did not have investments in Company stock as of December 31, 2024 and 2023.\nThe portfolio for the Company’s United Kingdom pension plans seek to invest in a range of suitable assets of appropriate liquidity that will generate in the most effective manner possible, income and capital growth to ensure that there are sufficient assets to meet benefit payments when they fall due, while controlling the long-term costs of the plans, avoiding short-term volatility of investment returns, and managing risks in accordance with plan investment strategies. The plans seek to achieve these objectives by investing in a mixture of real (equities) and monetary (fixed interest) assets, which is expected to provide the level of returns required by the plans. The trustee periodically conducts asset liability modeling exercises to ensure the investments are aligned with the appropriate benchmark to better reflect the plans’ liabilities. The trustee also undertakes to review this benchmark on a regular basis.\nCash Flows\nContributions\nThe Company expects to contribute approximately $\n30\n million in required contributions to its pension and postretirement benefit plans during 2025. The Company may make additional contributions into its pension plans in 2025 depending on, among other factors, how the funded status of those plans change or in order to meet minimum funding requirements as set forth in employee benefit and tax laws, plus additional amounts the Company may deem to be appropriate.\n107\nEstimated future benefit payments \nThe following benefit payments (net of expected participant contributions) for pension benefits are expected to be paid as follows:\n(in millions)\n2025\n$\n55\n \n2026\n56\n \n2027\n60\n \n2028\n62\n \n2029\n65\n \nYears 2030 through 2034\n361\n \n$\n659\n \nBenefit payments (net of expected participant contributions) for other postretirement benefits are expected to be immaterial over the years presented.\nDefined Contribution Plans\nDefined contribution or profit sharing plans are offered in various countries in which the Company operates. In some cases, these plans are required by local laws or regulations.\nIn the United States, the Company has a 401(k) plan under which the Company matches employee deferrals at varying percentages and specified limits of the employee’s salary. For the years ended December 31, 2024, 2023 and 2022, the Company expensed $\n80\n million, $\n81\n million and $\n74\n million, respectively, related to matching contributions.\nCertain key executives of the Company participate in an unfunded defined contribution executive retirement plan, assumed in the merger between Quintiles and IMS Health, which was frozen to additional accruals for future service contributions in 2012. Participants continue to receive an annual investment credit based on the average of the annual yields at the end of each month on the AA-AAA rated 10 plus year maturity component of the Merrill Lynch United States Corporate Bond Master Index.\nPlans Accounted for as Postretirement Benefits\nThe Company provides certain executives with postretirement medical, dental and life insurance benefits. These benefits are individually negotiated arrangements in accordance with their individual employment arrangements. The above tables do not include the Company’s expense or obligation associated with providing these benefits. The obligation related to these benefits as of December 31, 2024 and 2023, and the Company’s expense for the years then ended, were not material.\nStock Incentive Plans\nStock incentive plans provide incentives to eligible employees, officers and directors in the form of non-qualified stock options, incentive stock options, stock appreciation rights (“SARs”), restricted stock awards, restricted stock units (“RSUs”), performance awards, covered annual incentive awards, cash-based awards and other stock-based awards, in each case subject to the terms of the stock incentive plans.\nIn April 2017, the Company’s 2017 Incentive and Stock Award Plan (the “2017 Plan”) was approved by the Company’s stockholders. The 2017 Plan provides for the grant of stock options, SARs, restricted and deferred stock (including RSUs), performance awards, dividend equivalents, other stock-based awards and cash-based awards.\nThe Company recognized stock-based compensation expense of $\n206\n million, $\n217\n million and $\n194\n million in the years ended December 31, 2024, 2023 and 2022, respectively. Stock-based compensation expense is included in selling, general and administrative expenses on the accompanying consolidated statements of income. The associated future income tax benefit recognized was $\n36\n million, $\n34\n million and $\n28\n million in the years ended December 31, 2024, 2023 and 2022, respectively. As of December 31, 2024, there was approximately $\n215\n million of total unrecognized stock-based compensation expense related to outstanding non-vested stock-based compensation arrangements, which the Company expects to recognize over a weighted average period of \n1.2\n years.\n108\nAs of December 31, 2024, there were \n7.6\n million shares available for future grants under all of the Company’s stock incentive plans.\nThe Company used the following assumptions when estimating the value of the stock-based compensation for Stock Settled SARs granted as follows:\nYear Ended December 31,\n2024\n2023\n2022\nExpected volatility\n28\n – \n35\n%\n29\n – \n35\n%\n28\n – \n34\n%\nWeighted average expected volatility\n32\n%\n32\n%\n30\n%\nExpected dividends\n0.0\n%\n0.0\n%\n0.0\n%\nExpected term (in years)\n2.6\n – \n5.6\n2.4\n – \n5.4\n3.3\n – \n6.3\nRisk-free interest rate\n4.07\n – \n4.56\n%\n3.38\n –\n4.75\n%\n1.84\n – \n4.22\n%\nStock Appreciation Rights – Stock Settled\nThe exercise price of the stock-settled SARs (“SSRs”) is equal to the closing market price of the Company’s common stock as of the grant date and expire on the tenth anniversary of the date of grant. The SSRs are eligible to vest in three equal annual installments on each of the first three anniversaries of the date of grant.\nThe Company’s SSR activity in the year ended December 31, 2024 is as follows:\n(in millions, except number of SSRs and exercise price)\nNumber of SSRs\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nOutstanding as of December 31, 2023\n3,862,710\n$\n144.79\n \n$\n342\n \nGranted\n426,430\n \n214.37\n \nExercised\n(\n754,235\n)\n120.01\n \nCanceled\n(\n41,593\n)\n233.29\n \nOutstanding as of December 31, 2024\n3,493,312\n$\n157.58\n \n$\n175\n \nThe weighted average fair value per share of SSRs granted in the year ended December 31, 2024 was $\n70.63\n. The total intrinsic value of SSRs exercised was approximately $\n88\n million, $\n51\n million and $\n25\n million in the years ended December 31, 2024, 2023 and 2022, respectively.\nThe weighted average remaining contractual life of the SSRs outstanding and exercisable as of December 31, 2024 is \n5.2\n years and \n4.2\n years, respectively. The total aggregate intrinsic value of the exercisable SSRs and the SSRs expected to vest as of December 31, 2024 was approximately $\n175\n million.\nStock Options\nThe option price is determined by the Board at the date of grant and the options expire \n10\n years from the date of grant. All outstanding stock options are fully vested.\nThe Company’s stock option activity in the year ended December 31, 2024 is as follows:\n(in millions, except number of options and exercise price)\nNumber of Options\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nOutstanding as of December 31, 2023\n174,971\n \n$\n62.35\n \n$\n30\n \nExercised\n(\n88,006\n)\n60.10\nOutstanding as of December 31, 2024\n86,965\n \n$\n64.63\n \n$\n11\n \n109\nThe total intrinsic value of options exercised was approximately $\n15\n million, $\n23\n million and $\n9\n million in the years ended December 31, 2024, 2023 and 2022, respectively. The Company received cash of approximately $\n5\n million, $\n7\n million and $\n2\n million in 2024, 2023, and 2022, respectively, from options exercised.\nThe weighted average remaining contractual life of the options outstanding and exercisable as of December 31, 2024 is \n1.0\n years. The total aggregate intrinsic value of the exercisable stock options as of December 31, 2024 was approximately $\n11\n million.\nPerformance Awards\nThe Company awarded performance awards that contain service, performance-based and/or market-based vesting criteria. Vesting occurs if the recipient remains employed and depends on the degree to which performance goals are achieved during the three-year performance period (as defined in the award agreements).\nThe Company’s performance award activity in the year ended December 31, 2024 is as follows:\nNumber of Performance Awards\nWeighted Average Grant-Date Fair Value\nOutstanding as of December 31, 2023\n746,070\n$\n232.13\n \nGranted\n493,729\n217.83\n \nAdditional goal achievement shares\n172,658\n189.94\n \nVested\n(\n387,288\n)\n197.10\n \nCanceled\n(\n32,691\n)\n241.33\n \nOutstanding as of December 31, 2024\n992,478\n$\n231.04\n \nAs of December 31, 2024, there are \n992,478\n performance awards outstanding with an intrinsic value of approximately $\n195\n million.\nRestricted Stock Units – Stock Settled\nThe Company’s RSUs will settle in shares of the Company’s common stock within \n30\n days of the applicable vesting date. In general, RSUs granted to employees vest either (i) one-third per year beginning on the first anniversary of the grant date or (ii) \n100\n% at the end of the three-year period following the grant date. Members of the Company’s Board receive RSUs that are fully vested when granted.\nThe Company’s RSU activity in the year ended December 31, 2024 is as follows:\nNumber of RSUs\nWeighted Average Grant-Date\nFair Value\nOutstanding as of December 31, 2023\n888,856\n \n$\n228.55\n \nGranted \n(1)\n594,957\n \n216.78\n \nVested\n(\n415,766\n)\n223.45\n \nCanceled\n(\n67,719\n)\n225.00\n \nOutstanding as of December 31, 2024\n1,000,328\n \n$\n223.91\n \n(1) Pursuant to the IQVIA Holdings Inc. Non-Employee Director Deferral Plan (the “Director Deferral Plan”), non-employee directors may elect to defer receipt of their cash and/or equity retainers. If a director elects to defer his or her retainer, he or she will instead be credited with that value in deferred shares under the Director Deferral Plan. Deferred shares become payable in Company common stock following a termination of the director’s Board service or the director’s death, or upon a change in control of the Company. The Company granted \n6,482\n deferred RSUs in 2024.\nAs of December 31, 2024, there are \n1,000,328\n RSUs outstanding with an intrinsic value of approximately $\n197\n million.\n110\nStock Appreciation Rights – Cash Settled\nThe Company’s cash settled SARs (“CSRs”) require the Company to settle in cash an amount equal to the difference between the fair value of the Company’s common stock on the date of exercise and the grant price, multiplied by the number of CSRs being exercised. All outstanding CSRs are fully vested.\nAs of December 31, 2024, 2023 and 2022, the weighted average fair value per share of the CSRs outstanding was $\n109.83\n, $\n152.17\n and $\n147.41\n, respectively. The Company paid approximately $\n3\n million, $\n11\n million and $\n1\n million to settle exercised CSRs in the years ended December 31, 2024, 2023 and 2022, respectively.\nThe weighted average remaining contractual life of the CSRs outstanding and exercisable as of December 31, 2024 is \n3.1\n years. The total aggregate intrinsic value of the exercisable CSRs as of December 31, 2024 was approximately $\n4\n million.\nRestricted Stock Units – Cash Settled\nThe Company’s cash settled RSUs (“Cash RSUs”) require the Company to settle in cash an amount equal to the fair value of the Company’s common stock on the vest date multiplied by the number of vested Cash RSUs. These awards vest either (i) \n100\n% at the end of the \nthree\n-year\n period following the date of grant, or (ii) one-third per year beginning on the first grant date anniversary. As of December 31, 2024, there are \n5,808\n Cash RSUs outstanding with an intrinsic value of approximately $\n1\n million. \nLong Term Incentive Awards - Stock Settled\nDuring the year ended December 31, 2022, the Company entered into long term incentive award agreements with certain employees totaling a fixed monetary amount of $\n80\n million to issue a variable number of common shares based on the fair market value when the awards vest on the third anniversary of the grant date. The Company accounts for the awards as liability-classified awards with the liability recorded in other current liabilities in the consolidated balance sheets as of December 31, 2024. The Company recorded approximately $\n26\n million, $\n22\n million and \n$\n9\n million\n of stock-based compensation expense for these awards during the years ended December 31, 2024, 2023 and 2022, respectively.\nOther\nThe Company sponsors a supplemental non-qualified deferred compensation plan, covering certain management employees, and maintains other statutory indemnity plans as required by local laws or regulations.\n18. \nRelated Party Transactions\nThe Company has entered into transactions with related parties that are not deemed to be material, including investments in unconsolidated affiliates that are discussed in Note 4.\n111\n19. \nProperty, Equipment and Software by Geography\nThe following table represents the Company’s property, equipment and software, net, by geographic region, which is further broken down to show each country that accounts for 10% or more of the totals:\nDecember 31,\n(in millions)\n2024\n2023\nProperty, equipment and software, net:\nAmericas:\nUnited States\n$\n1,803\n \n$\n1,820\n \nOther\n54\n \n97\n \nAmericas\n1,857\n \n1,917\n \nEurope and Africa\n184\n \n193\n \nAsia-Pacific\n50\n \n36\n \nTotal property, equipment and software, net\n$\n2,091\n \n$\n2,146\n \n20. \nSegments\nThe following table presents the Company’s operations by reportable segment. The Company is managed through \nthree\n reportable segments, Technology & Analytics Solutions, Research & Development Solutions and Contract Sales & Medical Solutions. Technology & Analytics Solutions provides mission critical information, technology solutions and real world insights and services to the Company’s life science clients. Research & Development Solutions, which primarily serves biopharmaceutical customers, provides outsourced clinical research and clinical trial related services. Contract Sales & Medical Solutions provides health care provider (including contract sales) and patient engagement services to both biopharmaceutical customers and the broader healthcare market. \nCertain costs are not allocated to the Company's segments and are reported as general corporate and unallocated expenses. These costs primarily consist of stock-based compensation and expenses related to integration activities and acquisitions, as well as certain general corporate and unallocated expenses. The Company also does not allocate restructuring costs, depreciation and amortization or impairment charges, if any, to its segments. \nAsset information by segment is not presented, as this measure is not used by the chief executive officer, who is the chief operating decision maker (\"CODM\"), to assess the Company’s performance. \nFor all segments, the CODM uses segment revenue and segment profit in the annual budgeting and forecasting process. The CODM considers budget-to-actual variances on a monthly and quarterly basis for both segment revenue and profit when making decisions about allocating operating and capital resources to the segments. The CODM also uses segment revenue and profit to assess the performance for each segment by comparing the results of each segment with one another and in determining the compensation of certain employees.\n112\nThe Company’s reportable segment information is presented below:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nRevenues\nTechnology & Analytics Solutions\n$\n6,160\n \n$\n5,862\n \n$\n5,746\n \nResearch & Development Solutions\n8,527\n \n8,395\n \n7,921\n \nContract Sales & Medical Solutions\n718\n \n727\n \n743\n \nTotal revenues\n15,405\n \n14,984\n \n14,410\n \nCost of revenues, exclusive of depreciation and amortization\nTechnology & Analytics Solutions\n3,721\n \n3,496\n \n3,348\n \nResearch & Development Solutions\n5,698\n \n5,629\n \n5,395\n \nContract Sales & Medical Solutions\n611\n \n620\n \n639\n \nTotal cost of revenues, exclusive of depreciation and amortization\n10,030\n \n9,745\n \n9,382\n \nSelling, general and administrative expenses\nTechnology & Analytics Solutions\n917\n \n876\n \n848\n \nResearch & Development Solutions\n881\n \n851\n \n831\n \nContract Sales & Medical Solutions\n60\n \n58\n \n62\n \nTotal selling, general and administrative expenses reportable segments\n1,858\n \n1,785\n \n1,741\n \nSegment profit\nTechnology & Analytics Solutions\n1,522\n \n1,490\n \n1,550\n \nResearch & Development Solutions\n1,948\n \n1,915\n \n1,695\n \nContract Sales & Medical Solutions\n47\n \n49\n \n42\n \nTotal segment profit\n3,517\n \n3,454\n \n3,287\n \nGeneral corporate and unallocated expenses\n(\n134\n)\n(\n268\n)\n(\n330\n)\nDepreciation and amortization\n(\n1,114\n)\n(\n1,125\n)\n(\n1,130\n)\nRestructuring costs\n(\n67\n)\n(\n84\n)\n(\n28\n)\nTotal income from operations\n2,202\n \n1,977\n \n1,799\n \nInterest income\n(\n47\n)\n(\n36\n)\n(\n13\n)\nInterest expense\n670\n \n672\n \n416\n \nLoss on extinguishment of debt\n—\n \n6\n \n—\n \nOther (income) expense, net\n(\n90\n)\n(\n124\n)\n33\n \nIncome before income taxes and equity in earnings (losses) of unconsolidated affiliates\n$\n1,669\n \n$\n1,459\n \n$\n1,363\n \n113\n21. \nEarnings Per Share\nThe following table presents the computation of basic and diluted earnings per share:\nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nNumerator:\nNet income\n$\n1,373\n \n$\n1,358\n \n$\n1,091\n \nDenominator:\nBasic weighted average common shares outstanding\n181.3\n \n183.8\n \n187.6\n \nEffect of dilutive stock options and share awards\n2.1\n \n2.5\n \n3\n \nDiluted weighted average common shares outstanding\n183.4\n \n186.3\n \n190.6\n \nEarnings per share attributable to common stockholders:\nBasic \n$\n7.57\n \n$\n7.39\n \n$\n5.82\n \nDiluted\n$\n7.49\n \n$\n7.29\n \n$\n5.72\n \nStock-based awards will have a dilutive effect under the treasury method when the respective period’s average market value of the Company’s common stock exceeds the exercise proceeds. Performance awards are included in diluted earnings per share based on if the performance targets have been met at the end of the reporting period. \nFor the years ended December 31, 2024, 2023 and 2022 the weighted average number of outstanding stock-based awards not included in the computation of diluted earnings per share because they are subject to performance conditions that have not been met at the end of the reporting period or the effect of including such stock-based awards in the computation would be anti-dilutive was \n1.0\n million, \n1.0\n million, and \n0.5\n million, million, respectively.\n22. \nAccumulated Other Comprehensive (Loss) Income\nBelow is a summary of the components of AOCI:\n(in millions)\nForeign Currency Translation\nDerivative Instruments\nDefined Benefit Plans\nIncome Taxes\nTotal\nBalance as of December 31, 2021\n$\n(\n570\n)\n$\n(\n21\n)\n$\n5\n \n$\n180\n \n$\n(\n406\n)\nOther comprehensive (loss) income before reclassifications\n(\n255\n)\n53\n \n(\n13\n)\n(\n116\n)\n(\n331\n)\nReclassification adjustments\n—\n \n12\n \n—\n \n(\n2\n)\n10\n \nBalance as of December 31, 2022\n(\n825\n)\n44\n \n(\n8\n)\n62\n \n(\n727\n)\nOther comprehensive (loss) income before reclassifications\n(\n144\n)\n(\n10\n)\n11\n \n54\n \n(\n89\n)\nReclassification adjustments\n—\n \n(\n68\n)\n—\n \n17\n \n(\n51\n)\nBalance as of December 31, 2023\n(\n969\n)\n(\n34\n)\n3\n \n133\n \n(\n867\n)\nOther comprehensive (loss) income before reclassifications\n(\n123\n)\n70\n \n12\n \n(\n99\n)\n(\n140\n)\nReclassification adjustments\n—\n \n(\n41\n)\n—\n \n10\n \n(\n31\n)\nBalance as of December 31, 2024\n$\n(\n1,092\n)\n$\n(\n5\n)\n$\n15\n \n$\n44\n \n$\n(\n1,038\n)\n114\nBelow is a summary of the adjustments for amounts reclassified from AOCI into the consolidated statements of income and the affected financial statement line item:\nYear Ended December 31,\n(in millions)\nAffected Financial Statement Line"
  }
}