{
  "ticker": "IR",
  "cik": "0001699150",
  "company_name": "Ingersoll Rand Inc.",
  "filing_date": "2025-02-19",
  "accession": "0001628280-25-006391",
  "primary_doc": "iri-20241231.htm",
  "item_sections": {
    "item1": "Item 1A. Risk Factors” for more information.\nITEM 1. BUSINESS\nIngersoll Rand Inc. is a diversified, global provider of mission-critical flow creation products, and industrial and life science solutions. The accompanying consolidated financial statements include the accounts of Ingersoll Rand Inc. and its majority-owned subsidiaries (collectively referred to herein as “Ingersoll Rand,” “Company,” “we,” “us,” “our,” or “ourselves”).\nOur Company\nWe are a global market leader with a broad flow creation and industrial product portfolio across air, gas, powder, and liquid handling applications, providing services and solutions to increase industrial and life science productivity, efficiency, and sustainability. We manufacture one of the broadest and most complete ranges of compressor, pump, vacuum and blower products in our markets, which, when combined with our global geographic footprint and application expertise, allows us to provide differentiated product and service offerings to our customers. Our products are sold under more than 80 market-leading brands, including Ingersoll Rand and Gardner Denver, which we believe are globally recognized in their respective end-markets and known for product quality, reliability, efficiency and superior customer service. We are driven by an entrepreneurial spirit and ownership mindset, dedicated to helping make life better for our employees, customers, the planet, and our shareholders.\nThese attributes, along with over 160 years of engineering heritage, generate strong brand loyalty for our products and foster long-standing customer relationships, resulting in leading market positions within each of our operating segments. We have sales in all major geographic markets and our diverse customer base utilizes our products across a wide array of end-markets, including life sciences, food and beverage production, clean energy, industrial manufacturing, infrastructure, water and wastewater treatment, and many others.\nOur products and services are critical to the processes and systems in which they are utilized, which are often complex and the cost of failure or downtime is high. However, our products typically represent only a small portion of the costs of the overall systems or functions that they support. As a result, our customers place a high value on our application expertise, product reliability and the responsiveness of our service. To support our customers and market presence, we maintain significant global scale with over 60 key manufacturing facilities, and over 40 complementary service and repair centers across six continents and over 21,000 employees worldwide as of December 31, 2024.\nThe process-critical nature of our product applications, coupled with the standard wear and tear replacement cycles associated with the usage of our products, generates opportunities to support customers with our broad portfolio of services, spare parts, and consumables. Customers place a high value on maximizing the time their operations are online, reducing their operating expenses, and improving the sustainability of their processes. As a result, the availability of replacement parts, consumables and our repair and support services are key components of our value proposition. Our large installed base of products provides a \n3\nTable of Contents\nrecurring revenue stream through our aftermarket parts, consumables and services offerings. As a result, our aftermarket revenue is significant, representing 36.4% of total Company revenue in 2024.\nOur Segments\nIndustrial Technologies and Services\nWe design, manufacture, market and service a broad range of air and gas compression, vacuum and blower products, fluid transfer equipment, loading systems, power tools and lifting equipment, including associated aftermarket parts, consumables and services. We primarily sell under the Ingersoll Rand, Gardner Denver, Nash, CompAir, Elmo Rietschle, and over 30 other brands. Our customers deploy our products across a wide array of applications in diverse end-markets. Compressors are used to increase the pressure of air or gas, vacuum products are used to remove air or gas in order to reduce the pressure below atmospheric levels, and blower products are used to produce a high volume of air or gas at low pressure. Almost every manufacturing and industrial facility, and many service and process industry applications, use air compression, vacuum and blower products in a variety of process-critical applications such as the operation of pneumatic tools, pumps and motion control components, air and gas separation, vacuum packaging of food products and aeration of waste water, among others. Our vacuum pumps and compressors are used in many power generation, mining, oil and gas refining and processing, chemical processing and general industrial applications including flare gas and vapor recovery, geothermal gas removal, vacuum deaeration, water extraction in mining and paper and chlorine compression in petrochemical operations. Our engineered loading systems and fluid transfer equipment ensure the safe handling and transfer of crude oil, liquefied natural gas, compressed natural gas, chemicals, and bulk materials. Our power tools and lifting equipment portfolio includes electric and cordless fastening systems, pneumatic bolting tools, drilling and material removal tools, hoists, winches and ergonomic handling devices. Typical applications for these products include the precision fastening of bolted joints in the production, assembly and servicing of industrial machinery, on-highway and off-highway vehicles, aircraft, electronics and other equipment.\nOur compression products cover the full range of technologies, including rotary screw, reciprocating piston, scroll, rotary vane and centrifugal compressors. Our vacuum products and blowers also cover the full technology spectrum; vacuum technologies include side channel, liquid ring, claw vacuum, screw, turbo and rotary vane vacuum pumps among others, while blower technologies include rotary lobe, screw, claw and vane, side channel and radial blowers.\nWe complement these products with a broad portfolio of service options tailored to customer needs and a complete range of aftermarket parts, air treatment equipment, controls and other accessories delivered through our global network of manufacturing and service locations and distributor partners. The breadth and depth of our product offering creates incremental business opportunities by allowing us to cross-sell our full product portfolio and uniquely address customers’ needs in one complete solution.\nWe sell our products through an integrated network of direct sales representatives and independent distributors, which is strategically tailored to meet the dynamics of each target geography or end-market. Our large installed base also provides for a significant stream of recurring aftermarket revenue. For example, the useful life of a compressor is, on average, between 10 and 12 years. However, a customer typically services the compressor at regular intervals, starting within the first two years of purchase and continuing throughout the life of the product. The cumulative aftermarket revenue generated by a compressor over the product’s life cycle will typically exceed its original sale price.\nPrecision and Science Technologies\nWe design, manufacture and market a broad range of highly-specialized equipment for both industrial and life sciences markets. Our products are used for precision dosing, liquid and solid transfer, dispensing, gas compression, gas sampling, pressure management, flow control, and powder handling, amongst other applications. Major categories of our portfolio are (a) pumps and liquid handling systems and (b) life science tools and systems. Within pumps and liquid handling systems, our offering covers a broad range of pump and flow control technology types. This includes diaphragm pumps, piston pumps, water-powered pumps, peristaltic pumps, gear pumps, vane pumps, progressive cavity pumps, syringe pumps, gas boosters, hydrogen compression systems, automated liquid handling systems, odorant injection systems, controls, software and other related components and accessories. These offerings are sold under brands that are highly recognized in their end markets including Air Dimensions, Albin, ARO, Dosatron, Haskel, Ingersoll Rand, LMI, Maximus, Milton Roy, MP, Oberdorfer, Seepex, Thomas, Welch, Williams, YZ and Zinsser Analytic. Within life science tools and systems, our primary offerings include single-use powder handling systems and isolators for disposable process and powder containment, and contract design and productions for services for silicone, thermoplastic, and specialty components and assemblies for medical devices. These offerings are sold primarily under the ILC Dover and Flexan brands. We also manufacture space suits, inflatable habitats, and lighter-than-air vehicles for human mobility and habitation and defense applications. Our customer base is composed of a wide range of end users in markets including life sciences, industrial manufacturing, water and waste water, chemical processing, \n4\nTable of Contents\nenergy, food and beverage, agriculture and others. Our sales are realized primarily through a combination of independent specialty and national distributors and relationships directly with original equipment manufacturers (“OEM”), Engineering, Procurement and Construction (“EPC”) companies and end users.\nRecent Developments\nRecent Acquisitions\nThe Company continued its focus on generating inorganic growth through acquisitions that strengthen our position in core product categories and broaden our exposure to high-growth, sustainable end markets. We completed or announced the acquisition of several businesses during 2024, including the following:\n•\nIn February 2024, the Company completed the acquisition of Friulair S.r.l. (“Friulair”) for initial cash consideration of $143.3 million and contingent consideration of up to approximately $11.0 million. The business is a manufacturer of dryers, filters, aftercoolers, and accessories for the treatment of compressed air and its chiller product line.\n•\nIn June 2024, the Company completed the acquisition of Astronaut Topco, LP and Astronaut Topco GP, LLC (collectively “ILC Dover”) for initial cash consideration of $2,349.7 million and contingent consideration of up to $75.0 million. ILC Dover’s offerings include solutions for biopharmaceutical, pharmaceutical, and medical device markets as well as products for the space industry.\n•\nIn October 2024, the Company completed the acquisition of Air Power Systems Co LLC (“APSCO”) for cash consideration of $113.2 million. The business is a provider of hydraulic and pneumatic products and engineered solutions serving diverse specialty work truck vehicles. APSCO’s offerings include hydraulic coolers, systems, and components in addition to pneumatic consoles, cylinders, valves, and switches.\nRefer to Note 4 “Acquisitions” to our audited consolidated financial statements included elsewhere in this Form 10-K for further discussion of our acquisitions.\nCapital Allocation\nShare Repurchases\nWe repurchased $260.7 million of our common stock during the year ended December 31, 2024, including $250.0 million of repurchases under our share repurchase program.\nDebt Borrowings\nDuring the year ended December 31, 2024, we had net borrowings on long-term debt of $2,054.2 million. The net borrowings included proceeds from the issuance of Senior Notes, partially offset by repayment of our Dollar Term Loan B and Dollar Term Loan.\nDividends on Common Stock\nThe Company paid cash dividends on our common stock of $32.3 million during the year ended December 31, 2024.\nOur Industries and Products\nIndustrial Technologies and Services\nOur Industrial Technologies and Services segment designs, manufactures, markets and services a broad range of air compression, vacuum and blower products across a wide array of technologies, as well as other specialized industrial products. Compression, vacuum and blower products are used in a wide spectrum of applications in nearly all manufacturing and industrial facilities and many service and process industries in a variety of end-markets, including clean energy, life sciences, food and beverage production, general manufacturing, infrastructure, and others.\nCompression Products\nSales to industrial end-markets include industrial air compression products, as well as associated aftermarket parts, consumables and services. Industrial air compressors compress air to create pressure to power machinery, industrial tools, material handling systems and automated equipment. Compressed air is also used in applications as diversified as snow making and fish farming, on high-speed trains and in hospitals. Compressors can be either stationary or portable, depending on the requirements of the application or customer.\n5\nTable of Contents\nWe focus on five basic types of air compression technologies: rotary screw, reciprocating piston, scroll, rotary vane and centrifugal compressors. Rotary screw compressors are a newer technology than reciprocating compressors and exhibit better suitability for continuous processes due to a more compact size, less maintenance and better noise profile. We believe our reciprocating piston compressors provide one of the broadest ranges of pressures in the market and are supported by increasing demand across wide-ranging attractive end-markets. Scroll compressors are most commonly seen where less oil-free air is needed, and is most commonly used in medical and food applications where the need for pure, clean and precise air is of great importance. Rotary vane compressors feature high efficiency, compact compression technology and can be found throughout all sectors of industry, including automotive, food and beverage, energy and manufacturing with specialized solutions within transit, gas and snow making. Centrifugal compressors are most effective when in applications that demand larger quantities of oil-free air and are utilized across a wide range of industries.\nVacuum Products\nIndustrial vacuum products are integral to manufacturing processes in applications for packaging, pneumatic conveying, drying, holding / lifting, distillation, evacuation, forming / pressing, removal and coating. Within each of these processes are a multitude of sub-applications. As an example of one such end-process, within packaging, a vacuum will be used on blister packaging, foil handling, labeling, carton erection, stacking and palletizing (placing, stacking or transporting goods on pallets), as well as central vacuum supply for entire packaging departments.\nWe focus on five basic types of vacuum technologies: side channel, liquid ring, claw vacuum, screw and rotary vane vacuum pumps. Side channel vacuum pumps are used for conveying gases and gas-air mixtures in a variety of applications, including laser printers, packaging, soil treatment, textiles and food and beverage products. Liquid ring vacuum pumps are used for extreme conditions, which prevail in humid and wet processes across ceramics, environmental, medical and plastics applications. Claw vacuum pumps efficiently and economically generate contact-free vacuum for chemical, environmental and packaging applications. Screw vacuum pumps are a dry running technology used to reduce the carbon footprint and life cycle costs in drying and packaging applications. Rotary vane vacuum pumps are used for vacuum and combined pressure and vacuum applications in the environmental, woodworking, packaging and food and beverage end-markets.\nBlower Products\nBlower products are used for conveying high volumes of air and gas at various flow rates and at low pressures, and are utilized in a broad range of industrial and environmental applications, including waste water aeration, biogas upgrading and conveying, pneumatic transport and dehydrating applications for food and beverage, cement, pharmaceutical, petrochemical and mobile industrial applications. In many cases, blowers are a core component for the operation of the entire end-users’ systems. Management believes that we hold a leading position in our addressable portion of the global blower products market.\nWe focus on several key technologies within blower products: rotary lobe, screw, claw and vane, turbo, side channel and radial blowers. Rotary lobe blowers, screw blowers and claw and vane blowers are positive displacement technologies that have the ability to consistently move the same volume of gas or air and vary the volume flow according to the speed of the machine itself enabling it to adapt the flow condition in a flexible manner despite pressure in the system. Turbo blowers and side channel and radial blowers are dynamic technologies that have the ability to accelerate gas or air through an impeller and transform their kinetic energy at the discharge with some limitation on flexibility.\nPrecision and Science Technologies\nThe Precision and Science Technologies segment designs, manufactures and markets a broad range of niche fluidics and powder handling solutions for the life sciences, food and beverage, water and wastewater, general manufacturing, chemical processing, clean energy, aerospace, and other end markets. Key technologies include positive displacement pumps, automated liquid handling systems, and single-use powder and liquid handling and containment systems.\nPositive Displacement (PD) Pumps\nPositive displacement pumps are essential to highly specialized flow applications across many industries. We are a market leader in positive displacement pumps, covering the main technology types including diaphragm, vane, piston, progressive cavity, peristaltic and gear. In the life sciences end-market, our gas and liquid pumps are used for a wide range of applications, such as aspirators, blood analyzers, compression therapy, dialysis machines, gas monitors, ventilators, and scientific instrumentation within in vitro diagnostics and R&D laboratories. In the water and environmental end-market, our pumps and related equipment are used for water treatment in municipal and industrial facilities such as in dosing and sludge transfer. In agriculture, our pumps are used for nutrient and medicine dosing to livestock, plants and medicinals. Finally in the general industrial end-market, our pumps and accessories serve a broad range of niche applications such as in the handling of abrasive or chemically active fluids. \n6\nTable of Contents\nControls and Software\nEquipment controls and software are of increasing importance in our flow control applications for both the optimization of current systems as well as to enable the Industrial Internet of Things (“IIoT”) evolution. In the agriculture market, we sell controllers and software that monitor and control the main functions within livestock and greenhouse facility operations with the benefit of reducing cost and improving yield. In natural gas pipelines and distribution, we sell monitoring devices connected to cloud-based software for real time monitoring of odor injection pumping systems, which enhances safety and reduces costs. Similarly, on our positive displacement progressive cavity sludge pumps, we sell monitoring devices and cloud-based software for real-time pump health and performance monitoring, which prevents costly downtime in water treatment plants as well as in industrial installations. \nRobotics\nOur automated liquid handling products, which includes syringe pumps and accessories, are integrated into large-scale, automated liquid handling systems used within clinical, pharmaceutical and environmental applications. These automated systems provide accurate and efficient dosing, sampling and handling of critical fluids at increasingly ultra-low flow levels, which are required in lab and life science applications.\nPowder and Liquid Handling and Containment Systems\nThe safe and efficient handling of high-value and high-potency powders and liquids is essential for the global production of biopharmaceutical and pharmaceutical products. We manufacture a leading range of single-use powder handling solutions, single-use liquid bags, isolators, and other related products for large and small molecule workflow applications from weigh and dispense to fill and finish.\nCompetition\nIndustrial Technologies and Services\nThe industrial end-markets we serve are competitive, with an increasing focus on product quality, performance, energy efficiency, customer service and local presence. Although there are several large manufacturers of compression, vacuum and blower products, the marketplace for these products remains highly fragmented due to the wide variety of product technologies, applications and selling channels. Our principal competitors in sales of compression, vacuum and blower products include Atlas Copco, Flowserve, IDEX Corporation and Kaeser Compressors.\nPrecision and Science Technologies\nCompetition in the markets served by our Precision and Science Technologies segment is primarily based on product quality and performance, as most products must be qualified by the customer for a particular use. Further, there is an increasing demand for more efficient healthcare solutions, which is driving the adoption of premium and high performance systems. Our primary competitors include Dover, Graco, IDEX Corporation, KNF Neuberger, Netzsch, NOV, Sartorius, SPX Flow, Thermo Fisher Scientific, and Watson-Marlow, as well as other regional and local manufacturers.\nCustomers and Customer Service\nWe consider superior customer service to be one of our primary pillars of future success and view it as being built upon a foundation of critical application expertise, an industry leading range of compressor, pump, vacuum and blower products, a global manufacturing and sales presence and a long-standing reputation for quality and reliability. Intense customer focus is at the center of our vision of becoming the industry’s first choice for innovative and application-critical flow creation equipment, services and solutions. We strive to collaborate with our customers and become an essential part of their engineering process by drawing on our deep industry and application engineering experience to develop best-in-class products that are critical to the processes and systems in which they operate.\nWe have established strong and long-standing customer relationships with numerous industry leaders. We sell our products directly to end-use customers and to certain OEMs, and indirectly through independent distributors and sales representatives.\nWe use a direct sales force to serve end-use customers and OEMs because these customers typically require higher levels of technical assistance, more coordinated shipment scheduling and more complex product service than customers that purchase through distributors. We have distribution centers and warehouses that stock parts, accessories and certain products to provide adequate and timely availability.\n7\nTable of Contents\nIn addition to our direct sales force, we are committed to developing and supporting our global network of distributors and representatives who provide a competitive advantage in the markets and industries we serve. These distributors maintain an inventory of complete units and parts and provide aftermarket services to end-users. While most distributors provide a broad range of products from different suppliers, we view our distributors as exclusive at the product category level (e.g. compressor, vacuum and blower). For example, a distributor may exclusively carry our compressor technologies, and also source additional components of the broader industrial system in which those products operate from other suppliers. Our service personnel and product engineers provide the distributors’ service representatives with technical assistance and field training, particularly with respect to installation and repair of equipment. We also provide our distributors with sales and product literature, advertising and sales promotions, order-entry and tracking systems and an annual restocking program. Furthermore, we participate in major trade shows and directly market our offerings to generate sales leads and support the distributors’ sales personnel.\nOur customer base is diverse, and we did not have any customer that individually provided more than 10% of 2024 consolidated revenues.\nPatents, Tradenames, and Other Intellectual Property\nWe rely on a combination of intellectual property rights, including patents, tradenames, copyrights, trade secrets and contractual provisions to protect our intellectual property. While in the aggregate our more than 2,000 patents and our tradenames are of considerable importance to the manufacture and marketing of many of our products, we believe that the success of our business depends more on the technical competence, creativity and marketing abilities of our employees than on any individual patent or tradename, and therefore we do not consider any single patent or tradename, group of patents or tradenames, copyright or trade secret to be material to our business as a whole, except for the \nIngersoll Rand\n and \nGardner Denver\n tradenames. We have registered our tradenames in the countries we deem necessary or in our best interest. We also rely upon trade secret protection for our confidential and proprietary information and techniques, and we routinely enter into confidentiality agreements with our employees as well as our suppliers and other third parties receiving such information.\nPursuant to tradename license agreements, Cooper Industries has exclusive rights to use the \nGardner Denver\n tradename for certain power tools and their components, meaning that we are prevented from using this mark in connection with those products.\nRaw Materials and Suppliers\nWe purchase a wide variety of raw materials to manufacture our products. Our most significant commodity exposures are to cast iron, aluminum and steel. Additionally, we purchase a large number of motors and, therefore, are also exposed to changes in the price of copper, which is a primary component of motors. Most of our raw materials are generally available from a number of suppliers. We have a limited number of long-term contracts with some suppliers of key components, but we believe that our sources of raw materials and components are reliable and adequate for our needs. In response to recent tightness in the supply chain and in order to improve continuity of supply, for select materials and components, we have expanded our supplier network in areas we have historically sole sourced. We continue to use single sources of supply for certain castings, motors and other select engineered components. A disruption in deliveries from a given supplier could therefore have an adverse effect on our ability to meet commitments to our customers. Nevertheless, we believe that we have appropriately balanced this risk against the cost of maintaining a greater number of suppliers. Moreover, we have sought, and will continue to seek, cost reductions in purchases of materials and supplies by consolidating purchases and pursuing alternate sources of supply.\nHuman Capital Management\nAt Ingersoll Rand, we recognize that what sets us apart is our talented employees combined with our ownership mindset that empowers and engages all employees. The passion, innovation and commitment of our team drives our incredible results, and we believe that our commitment to a safe, respectful, inclusive environment where all employees have the ability to be heard, impact change and develop and grow is what drives our employees. As of December 31, 2024, we had over 21,000 employees, with approximately 6,300 of them working in the United States. Works councils and collective bargaining units represent a significant number of employees outside the United States, while approximately 380 employees in the United States are represented by labor unions. We believe that we maintain satisfactory relations with our employees.\nTo ensure the effectiveness of our human capital management practices, we evaluate various metrics, including voluntary turnover and engagement. In 2024, the voluntary turnover rate was 8.5% and 7.4% for hourly and salaried employees, respectively. In 2023, the voluntary turnover rate was 12.2% and 8.7% for hourly and salaried employees, respectively.\nWe are committed to employee empowerment, engagement and development as a standard part of our employee experience. Annually, our functions and businesses complete a multi-year strategy and financial plan. We then conduct strategic talent reviews and succession planning in support of the strategic plan. From that strategy, company objectives are finalized and \n8\nTable of Contents\ncommunicated from the Chief Executive Officer to initiate yearly objectives and development plans for all salaried employees. Team-specific objectives are also cascaded during this time. Throughout the year, we assess our talent against their performance to stated objectives and the competencies and behaviors they exhibited while executing their goals. Our performance management and development planning processes ensure we execute high quality and thoughtful objectives, development plans, and mid-year and year-end reviews that reinforce the importance of continuous improvement over time. Throughout the year, we provide training resources and materials to support both employees and managers. We track the completion of each phase through our human resources system.\nCompetitive Pay, Benefits and Equity\nOur compensation and benefits philosophy is centered on two key fundamentals: (1) building long-term value for our stockholders, and (2) driving employee engagement and retention. We are committed to providing competitive pay, benefits, and equity that are valuable and meaningful to our employees. We provide a competitive total compensation package with a significant portion designed to foster a culture of ownership. We continue to offer our Ownership Works program to grant equity to all new and acquired employees regardless of level in the organization. It is our goal to foster an environment where employees can think and act like owners.\nBelonging and Engagement\nIngersoll Rand is committed to upholding an inclusive and engaging environment where all employees can succeed. Our values of “We foster inspired teams” and “We think and act like owners” drives us to maintain a culture that gives voice and opportunity to all employees and enhances a sense of belonging. We expect everyone to uphold these values with humility, integrity, and respect. We focus on attracting the best talent from all backgrounds, ensuring employees are engaged, have a strong sense of belonging, and have opportunities to develop and grow. \nWe understand that achieving our objectives requires a continuous focus on talent attraction, retention, engagement and development. By prioritizing these areas, we are confident in our ability to cultivate a workforce that is not only highly skilled but also reflects our global community.\nWe collaborate with universities, key industry, and professional organizations, such as Disability IN, the Society of Hispanic Professional Engineers, National Black MBA Association and Women in Manufacturing, to recruit early and mid-level talent. These partnerships help us build a top talent pipeline.\nTalent Development and Employee Engagement\nWe are dedicated to supporting our employees’ growth and development. We provide many development opportunities for early career employees, including global internships, engineering, marketing, and manufacturing career programs. In 2024, we won two Brandon Hall Group Excellence Awards. The Brandon Hall Group recognizes organizations that have successfully deployed programs, strategies, and tools that have achieved measurable results. We received a gold award in the Talent Management Category for “Think and Act Like an Owner at Ingersoll Rand.”\nWe continuously strive to enhance our workforce’s technical, professional, and leadership capabilities at every level. Our leadership development programs are designed to promote inclusion as a core development principle and a professional skill. We offer skill-based programs to upskill our manufacturing employees to meet the industry’s ever-changing demands. In addition, we successfully deliver an executive-level program called “Lead Like an Owner” to establish the standard of leadership and build succession at the top of the organization. To support the development of our employees, we have various resources and programs in place to facilitate their growth and progress. Our offerings align with our values and strategies, reflected in our competencies. We offer both instructor-led and online learning content globally.\nBy offering each and every employee opportunities to learn and grow and an ownership stake in the Company, we have built one of the most engaged workforces in our industry. In May 2024, our Connections Engagement survey achieved an 88% participation rate, resulting in an engagement score of 81. This places Ingersoll Rand again in the top 10% of manufacturing organizations surveyed. In addition, our survey questions scored above the manufacturing benchmark collected by our engagement survey partner, with our essential employee satisfaction measure ranking two points above the top 10% manufacturing average. \nOur continually strong employee engagement is also driven by our ownership mindset and our employees’ perspective that Ingersoll Rand is “my company.” We provide equity grants to all employees, whether they join as new hires or through acquisition, after one year of service. This, along with our solid strategy, strong values, and clear expectations, has given us strong engagement and a competitive edge. \n9\nTable of Contents\nBecause of the investments we have made in our employees, we continue to receive external recognition for being a great place to work. Accolades include winning Great Place to Work in the United States and in several Latin American countries.\nThrough our Human Capital Management activities, we reflect our value of “We foster inspired teams.” We nurture and celebrate a culture that embraces diverse points of view, backgrounds, and experiences and truly empower our employees as owners.\nEnvironmental Matters\nWe are subject to numerous federal, state, local and foreign laws and regulations relating to the storage, handling, emission and disposal of materials and discharge of materials into the environment. We believe our existing environmental control procedures are adequate and we have no current plans for substantial capital expenditures in this area. We have an environmental policy that confirms our commitment to a clean environment and compliance with environmental laws. We have an active environmental management program aimed at complying with existing environmental regulations and reducing the generation of pollutants in the manufacturing processes. We are also subject to laws concerning the cleanup of hazardous substances and wastes, such as the U.S. federal “Superfund” and similar state laws that impose liability for cleanup of certain waste sites and for related natural resource damages. We have been identified as a potentially responsible party with respect to several sites designated for cleanup under the “Superfund” or similar state laws. See “Item 3. Legal Proceedings.”\nWhere You Can Find More Information\nWe file annual, quarterly and current reports, proxy statements and other information with the Securities and Exchange Commission (“SEC”). Our SEC filings are available to the public over the internet at the SEC’s website at \nhttp://www.sec.gov\n. Our SEC filings are also available free of charge on our website at \nhttp://www.irco.com\n as soon as reasonably practicable after they are filed with or furnished to the SEC.\nWe maintain an internet site at \nhttp://www.irco.com\n. From time to time, we may use our website as a distribution channel of material company information. Financial and other important information regarding us is routinely accessible through and posted on our website at \nwww.investors.irco.com\n. In addition, you may automatically receive email alerts and other information about us when you enroll your email address by visiting the Email Alerts section at \nwww.investors.irco.com\n. Our website and the information contained on or connected to that site are not incorporated into this Annual Report on Form 10-K.",
    "item1a": "ITEM 1A. RISK FACTORS\nThe following risk factors as well as the other information included in this Form 10-K, including “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and our consolidated financial statements and related notes thereto should be carefully considered. Any of the following risks could materially and adversely affect our business, financial condition or results of operations. The selected risks described below, however, are not the only risks facing us. Additional risks and uncertainties not currently known to us or those we currently view to be immaterial may also materially and adversely affect our business, financial condition or results of operations.\nRisks Related to Our Business\nWe have exposure to the risks associated with instability in the global economy and financial markets, which may negatively impact our revenues, liquidity, suppliers and customers.\nOur financial performance depends, in large part, on conditions in the markets we serve and on the general condition of the global economy, which impacts these markets. Any sustained weakness in demand for our products and services resulting from a contraction or uncertainty in the global economy could adversely impact our revenues and profitability.\nIn addition, we believe that many of our suppliers and customers access global credit markets to provide liquidity, and in some cases, utilize external financing to purchase products or finance operations. If our customers are unable to access credit markets or lack liquidity, customer demand for our products and services may be impacted.\nFurthermore, our products are sold in many industries, some of which are cyclical and may experience periodic contractions. Cyclical weakness in the industries that we serve could adversely affect demand for our products and affect our profitability and financial performance.\n10\nTable of Contents\nMore than half of our sales and operations are in non-U.S. jurisdictions and we are subject to the economic, political, regulatory and other risks of international operations.\nFor the year ended December 31, 2024, 57% of our revenues were from customers in countries outside of the United States. We have manufacturing facilities in Germany, the United Kingdom, China, Italy, India and other countries. We intend to continue to expand our international operations to the extent that suitable opportunities become available. Non-U.S. operations and United States export sales could be adversely affected as a result of: political or economic instability in certain countries; differences in foreign laws, including increased difficulties in protecting intellectual property and uncertainty in enforcement of contract rights; credit risks; currency fluctuations, in particular, changes in currency exchange rates between the U.S. dollar, Euro, British Pound and the Chinese Renminbi; exchange controls; changes in and uncertainties with respect to tariffs and import/export trade restrictions (including changes in United States trade policy toward other countries, such as the imposition of tariffs and the resulting consequences), as well as other changes in political policy in the United States, China, the U.K. and certain European countries (including the impacts of the U.K.’s withdrawal from the European Union); royalty and tax increases; nationalization of private enterprises, especially in China where we have material operations, supply chain dependencies and hold material cash balances; civil unrest and protests, strikes, acts of terrorism, war or other armed conflict (including the Russia-Ukraine war and the Israel-Hamas conflict); shipping products during times of crisis or war; and other factors inherent in foreign operations.\nIn addition, our expansion into new countries may require significant resources and the efforts and attention of our management and other personnel, which will divert resources from our existing business operations. As we expand our business globally, our success will depend, in large part, on our ability to anticipate and effectively manage these risks associated with our international operations.\nInformation systems failure or disruption, due to cyber terrorism or other actions, may adversely impact our business and result in financial loss to the Company or liability to our customers.\nOur business is highly dependent on financial, accounting and other data-processing systems and other communications and information systems, including our enterprise resource planning tools. We process a large number of transactions on a daily basis and rely upon the proper functioning of computer systems. If any of these systems fail, whether caused by fire, other natural disaster, power or telecommunications failure, acts of cyber terrorism, war, ransomware or otherwise, or they do not function correctly, we could suffer financial loss, business disruption, liability to our customers, regulatory intervention or damage to our reputation. If our systems are unable to accommodate an increasing volume of transactions, our ability to grow could be limited. Although we have backup systems, procedures and capabilities in place, they may also fail or be inadequate. Further, to the extent that we may have customer information in our databases or access to customer systems through connected devices, any unauthorized disclosure of, or access to, such information, databases or systems could result in an adverse impact to us or our customer including claims under data protection laws and regulations. If any of these risks materialize, our reputation and our ability to conduct our business may be materially adversely affected.\nAcquisitions, including integrating such acquisitions, and dispositions create certain risks and may affect our operating results.\nWe have acquired multiple businesses in recent years and will continue to pursue acquisition of businesses or assets in the future. The acquisition and integration of businesses or assets involves a number of risks. The core risks are valuation (negotiating a fair price for the business), integration (managing the process of integrating the acquired company’s people, products, technology and other assets to extract the value and synergies projected to be realized in connection with the acquisition), regulation (obtaining necessary regulatory or other government approvals that may be necessary to complete acquisitions) and diligence (identifying undisclosed or unknown liabilities or restrictions that will be assumed in the acquisition).\nIn addition, acquisitions outside of the United States often involve additional or increased risks including, for example:\n•\nmanaging geographically separated organizations, systems and facilities;\n•\nintegrating personnel with diverse business backgrounds and organizational cultures;\n•\ncomplying with non-U.S. regulatory requirements;\n•\nfluctuations in currency exchange rates;\n•\nenforcement of intellectual property rights in some non-U.S. countries;\n•\ndifficulty entering new non-U.S. markets due to, among other things, consumer acceptance and business knowledge of these new markets; and\n•\ngeneral economic and political conditions.\n11\nTable of Contents\nThe process of integrating operations could cause an interruption of, or loss of momentum in, the activities of one or more of our combined businesses and the possible loss of key personnel. The diversion of management’s attention and any delays or difficulties encountered in connection with acquisitions and the integration of an acquired company’s operations could have an adverse effect on our business, results of operations, financial condition or prospects.\nDispositions involve a number of risks and present financial, managerial and operational challenges, including diversion of management attention from running our core businesses, increased expense associated with the dispositions, potential disputes with the customers or suppliers of the disposed businesses, potential disputes with the acquirers of the disposed businesses and a potential dilutive effect on our earnings per share. If dispositions are not completed in a timely manner, there may be a negative effect on our cash flows and/or our ability to execute our strategy. In addition, we may not realize some or all of the anticipated benefits of our dispositions.\nThe nature of our products creates the possibility of significant product liability, warranty claims, and product recalls, which could harm our business.\nCustomers use some of our products in potentially hazardous applications that can cause injury or loss of life and damage to property, equipment or the environment. In addition, our products are integral to the production process for some end-users and any failure of our products could result in a suspension of operations. Furthermore, manufacturing or design defects in, unanticipated use of, safety or quality issues (or the perception of such issues) with respect to, or inadequate disclosure of risks relating to the use of products and services that we make or sell (including items that we source from third parties) can lead to personal injury, death, property damage and/or regulatory violations. In addition, we may fail to maintain an adequate quality management system (“QMS”) or fail to comply with the controls and processes established in our QMS. All of these events or failures can lead to recalls or safety alerts, result in removal of a product or service from the market and result in product liability, errors and omissions or similar claims being brought against us and lead to personal injury, death, property damage and/or regulatory violations. Recalls, removals and product liability or similar claims (regardless of validity or ultimate outcome) could create negative publicity and damage to our reputation that could reduce demand for our products and services, creating a material adverse effect on our revenues, earnings and cash flows. Although we maintain quality controls and procedures, we cannot be certain that our products will be completely free from defects. We maintain amounts and types of insurance coverage that we believe are currently adequate and consistent with normal industry practice for a company of our relative size, and we limit our liability by contract wherever possible. However, we cannot guarantee that insurance will be available or adequate to cover all liabilities incurred. We also may not be able to maintain insurance in the future at levels we believe are necessary and at rates we consider reasonable. We may be named as a defendant in product liability or other lawsuits asserting potentially large claims if an accident occurs at a location where our equipment and services have been or are being used.\nA natural disaster, catastrophe, pandemic, or other event could adversely affect our operations.\nSome of our operations involve risks of, among other things, property damage, which could curtail our operations. For example, if one or more of our manufacturing facilities are damaged by severe weather or any other disaster, accident, catastrophe or event (including but not limited to those as a result of climate change), our operations could be significantly interrupted impacting our ability to produce products and sell products to customers. These interruptions might involve significant damage to, among other things, property, and repairs might take from a week or less for a minor incident to many months for a major interruption. In addition, disruptions in our supply chain due to natural disasters (including but not limited to those as a result of climate change), catastrophes, pandemics (such as COVID-19) or other events could reduce our ability to produce products and satisfy customer demand. Similar interruptions could result from damage to production or other facilities that provide supplies or other raw materials to our plants. Interruptions to our operations and supply chain could also result from pandemic which could adversely impact our workforce or that of our suppliers, causing disruption to the manufacturing process or our supply chain, and last a week or months depending on the severity of the disruption.\nLarge or rapid increases in the cost of raw materials and component parts, substantial decreases in their availability or our dependence on particular suppliers of raw materials and component parts could materially and adversely affect our operating results.\nOur primary raw materials, directly and indirectly, are cast iron, aluminum and steel. We also purchase a large number of motors and, therefore, also have exposure to changes in the price of copper, which is a primary component of motors. We have long-term contracts with only a few suppliers of key components. Consequently, we are vulnerable to fluctuations in prices and availability of such raw materials. Factors such as supply and demand, freight costs and transportation availability, inventory levels of brokers and dealers, the level of imports and general economic conditions may affect the price and availability of raw materials. In addition, we use single sources of supply for certain iron castings, motors and other select engineered components that are critical in the manufacturing of our products. In the past, we have experienced disruptions to our supply deliveries for \n12\nTable of Contents\nraw materials and component parts due to reasons related to the pandemic and other recent economic conditions and may experience further supply disruptions. Any such disruption could have a material adverse effect on our ability to timely meet our commitments to customers and, therefore, our operating results.\nWe face competition in the markets we serve, which could materially and adversely affect our operating results.\nWe actively compete with many companies producing similar products. Depending on the particular product and application, we experience competition based on a number of factors, including price, quality, performance and availability. We compete against many companies, including divisions of larger companies with greater financial resources than we possess. As a result, these competitors may be both domestically and internationally better able to withstand a change in conditions within the markets in which we compete and throughout the global economy as a whole.\nIn addition, our ability to compete effectively depends on how successfully we anticipate and respond to various competitive factors, including new competitors entering our markets, new products and services that may be introduced by competitors, changes in customer preferences, pricing pressures and new government regulations. If we are unable to anticipate our competitors’ development of new products and services, identify customer needs and preferences on a timely basis, or successfully introduce new products and services or modify existing products and service offerings in response to such competitive factors, we could lose customers to competitors. If we cannot compete successfully, our sales and operating results could be materially and adversely affected.\nOur results of operations are subject to exchange rate and other currency risks. A significant movement in exchange rates could adversely impact our results of operations and cash flows.\nWe conduct our business in many different currencies. A significant portion of our revenue, 55% for the year ended December 31, 2024, is denominated in currencies other than the U.S. dollar. Accordingly, currency exchange rates, and in particular unfavorable movement in the exchange rates between U.S. dollars and Euros, British Pounds and Chinese Renminbi, affect our operating results. The effects of exchange rate fluctuations on our future operating results are unpredictable because of the number of currencies in which we do business and the potential volatility of exchange rates. We are also subject to the risks of currency controls and devaluations. Although historically not significant, if currency controls were enacted in countries where the Company generates significant cash balances, these controls may limit our ability to convert currencies into U.S. dollars or other currencies, as needed, or to pay dividends or make other payments from funds held by subsidiaries in the countries imposing such controls, which could adversely affect our liquidity. Currency devaluations could also negatively affect our operating margins and cash flows.\nIf we are unable to develop new products and technologies, our competitive position may be impaired, which could materially and adversely affect our sales and market share.\nThe markets in which we operate are characterized by changing technologies and introductions of new products and services. Our ability to develop new products based on technological innovation, including those that incorporate artificial intelligence (“AI”) or drive sustainability, energy reduction and the reduction and/or recycling of water in our customers’ processes, can affect our competitive position and often requires the investment of significant resources. Difficulties or delays in research, development or production of new products and technologies, or failure to gain market acceptance of new products and technologies, may significantly reduce future revenues and materially and adversely affect our competitive position. We may not have sufficient resources to continue to make the investment required to maintain or increase our market share or that our investments will be successful. If we do not compete successfully, our business, financial condition, results of operations and cash flows could be materially adversely affected.\nShareholder, customer and regulatory agency emphasis on environmental, social, and governance responsibility may impose additional costs on us or expose us to new risks.\nCertain of our shareholders, customers and employees and regulators in certain countries continue to expect a more comprehensive response to environmental, social, and governance (“ESG”) matters. We may incur increased costs and may be exposed to new risks responding to these higher expectations and requirements, including the European Union’s Corporate Sustainability Reporting Directive. The Company has emphasized its commitment to making a positive impact on our environment with the announcement of environmental goals with respect to greenhouse gas emissions, renewable energy, water usage and landfill waste. We may face reputational challenges in the event that we are unable to achieve these goals or our ESG standards do not meet those set by certain constituencies. These reputational challenges could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nConversely, anti-ESG sentiment has gained momentum across the United States, especially at the Federal executive branch and the executive branches of certain states as well as with certain non-government organizations (“NGOs”). Various presidential \n13\nTable of Contents\nexecutive orders issued in early 2025 implement new obligations for Federal contractors/subcontractors to certify compliance with existing Federal anti-discrimination laws, encourages private employers to end programs supporting illegal Diversity, Equity, and Inclusion (“DEI”) discrimination and preferences, and directs Federal agencies to formulate enforcement plans to deter DEI programs in the private sector that advance unlawful discrimination or preferences. Moreover, several states have enacted or proposed “anti-ESG” policies or legislation. In addition, NGOs may criticize our sustainability initiatives or take actions against us like boycotts or adverse media campaigns. Failure to successfully manage divergent ESG-related expectations across stakeholders, including regulators, could erode stakeholder trust, impact our reputation, result in regulatory fines or other adverse action, and otherwise adversely affect our business. \nUncertainties with respect to the development, and use of artificial intelligence in our business and products may result in harm to our business and reputation.\nWe have begun incorporating AI into our business activities and our product and service offerings. As with many innovations, AI presents risks and challenges that could adversely impact our business. The development, adoption, and use of AI technologies are still in their early stages and ineffective or inadequate AI development or deployment practices could result in unintended consequences. For example, AI algorithms may be flawed or may be based on datasets that are biased or insufficient. In addition, any disruption or failure in the AI functionality we incorporate into our business activities, products or services could adversely impact our business or result in delays or errors in our offerings. Conversely, any failure to successfully develop and deploy AI in our business activities, products and services could adversely affect our competitiveness (particularly if our competitors successfully deploy AI in their businesses, products and services), and the development and deployment of AI will require additional investment and increase our costs. There also may be real or perceived social harm, unfairness, or other outcomes that undermine public confidence in the use and deployment of AI. Any of the foregoing may result in decreased demand for our products or harm to our business, financial statements or reputation.\nThe legal and regulatory landscape surrounding AI technologies is rapidly evolving and uncertain, including in the areas of intellectual property, cybersecurity and privacy and data protection. Compliance with new or changing laws, regulations or industry standards relating to AI may impose significant costs and may limit our ability to develop, deploy or use AI technologies. Failure to appropriately respond to this evolving landscape may result in legal liability, regulatory action, or brand and reputational harm.\nOur business could suffer if we experience employee work stoppages, union and work council campaigns or other labor difficulties.\nAs of December 31, 2024, we had over 21,000 employees of which approximately 6,300 were located in the United States. Of those employees located outside of the United States, a significant portion are represented by works councils and labor unions, and of those employees located in the United States, approximately 380 are represented by labor unions. Although we believe that our relations with employees are satisfactory and have not experienced any material work stoppages, work stoppages have occurred, and may in the future occur, and we may not be successful in negotiating new collective bargaining agreements. In addition, negotiations with our union employees may (1) result in significant increases in our cost of labor, (2) divert management’s attention away from operating our business or (3) break down and result in the disruption of our operations. The occurrence of any of the preceding conditions could impair our ability to manufacture our products and result in increased costs and/or decreased operating results.\nChanges in tax laws and regulations, or adverse determinations by taxing or other governmental authorities could increase our effective tax rate and cash taxes paid or otherwise affect our financial condition or operating results.\nIn 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cuts and Jobs Act (“Tax Act”). The Tax Act makes broad and complex changes to the U.S. tax code that affected 2017 and 2018, including, but not limited to (1) requiring a one-time transition tax on certain unrepatriated earnings of foreign subsidiaries that is payable over eight years and (2) bonus depreciation that will allow for full expensing of qualified property. The Tax Act also established new tax laws that significantly affected recent and future tax years.\nThe Organization for Economic Co-operation and Development (“OECD”) has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as Pillar 2), with certain aspects of Pillar 2 effective January 1, 2024 and other aspects effective January 1, 2025. While it is uncertain whether the U.S. will enact legislation to adopt Pillar 2, certain countries in which we operate have adopted legislation, and other countries are in the process of introducing legislation to implement Pillar 2. We do not expect Pillar 2 to have a material impact but we continue to monitor the tax law changes surrounding Pillar 2.\n14\nTable of Contents\nWhile we monitor proposals and other developments that would materially impact our tax burden and/or effective tax rate and investigate our options, we could still be subject to increased taxation on a going forward basis no matter what action we undertake if certain legislative proposals or regulatory changes are enacted, certain tax treaties are amended and/or our interpretation of applicable tax or other laws is challenged and determined to be incorrect. The inability to realize any anticipated tax benefits related to our operations and corporate structure could have a material adverse impact on our results of operations, financial condition and cash flows. See Note 1 “Summary of Significant Accounting Policies” and Note 17 “Income Taxes” to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information related to our accounting for income tax matters.\nFurther, the specific future impacts of the Tax Act and Pillar 2 on holders of our common shares are uncertain and could in certain instances be adverse. We urge our stockholders to consult with their legal and tax advisors with respect to any such legislation and the potential tax consequences of investing in our common stock.\nOur success depends on our ability to attract, retain and develop key personnel and other talent throughout the Company.\nOur future success depends on the skills, experience and efforts of our executive management and other key personnel and their ability to provide us with uninterrupted leadership and direction. The failure to retain our executive officers and other key personnel or a failure to provide adequate succession plans could have an adverse impact. Our future success also depends on our ability to attract, retain and develop qualified personnel at all levels of the organization, including skilled labor. The availability of skilled labor needed for the design and production of our products and delivery of services is limited in a number of locations in which we operate, and the competition for talent is robust. A failure to attract, retain and develop new qualified personnel throughout the organization could have an adverse effect on our operations and implementation of our strategic plan.\nThe risk of non-compliance with U.S. and foreign laws and regulations applicable to our international operations could have a significant impact on our results of operations, financial condition or strategic objectives.\nOur global operations subject us to regulation by U.S. federal and state laws and multiple foreign laws, regulations and policies, which could result in conflicting legal requirements. These laws and regulations are complex, change frequently, have become more stringent over time and increase our cost of doing business. These laws and regulations include import and export control, environmental, health and safety regulations, data privacy requirements, international labor laws and work councils and anti-corruption and bribery laws such as the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, the U.N. Convention Against Bribery and local laws prohibiting corrupt payments to government officials.\nWe are subject to the risk that we, our employees, our affiliated entities, contractors, agents or their respective officers, directors, employees and agents may take actions determined to be in violation of any of these laws, for which we might be held responsible, particularly as we expand our operations geographically through organic growth and acquisitions. An actual or alleged violation could result in substantial fines, sanctions, civil or criminal penalties, debarment from government contracts, curtailment of operations in certain jurisdictions, competitive or reputational harm, litigation or regulatory action and other consequences that might adversely affect our results of operations, financial condition or strategic objectives.\nThird parties may infringe upon our intellectual property or may claim we have infringed their intellectual property, and we may expend significant resources enforcing or defending our rights or suffer competitive injury.\nOur success depends in part on the creation, maintenance and protection of our proprietary technology and intellectual property rights. We rely on a combination of patents, tradenames, trade secrets, copyrights, confidentiality provisions, contractual restrictions and licensing arrangements to establish and protect our proprietary rights. Our nondisclosure agreements and confidentiality agreements may not effectively prevent disclosure of our proprietary information, technologies and processes, and may not provide an adequate remedy in the event of breach of such agreements or unauthorized disclosure of such information, and if a competitor lawfully obtains or independently develops our trade secrets, we would have no right to prevent such competitor from using such technology or information to compete with us, either of which could harm our competitive position. Our applications for patent and tradename protection may not be granted, or the claims or scope of such issued patents or registered tradenames may not be sufficiently broad to protect our products. In addition, effective patent, copyright, tradename and trade secret protection may be unavailable or limited for some of our tradenames and patents in some foreign countries. We may be required to spend significant resources to monitor and police our intellectual property rights, and we cannot guarantee that such efforts will be successful in preventing infringement or misappropriation. If we fail to successfully enforce these intellectual property rights, our competitive position could suffer, which could harm our operating results.\nAlthough we make a significant effort to avoid infringing known proprietary rights of third parties, the steps we take to prevent misappropriation, infringement or other violation of the intellectual property of others may not be successful and from time to \n15\nTable of Contents\ntime we may receive notice that a third party believes that our products may be infringing certain patents, tradenames or other proprietary rights of such third party. Responding to and defending such claims, regardless of their merit, can be costly and time-consuming, can divert management’s attention and other resources, and we may not prevail. Depending on the resolution of such claims, we may be barred from using a specific technology or other rights, may be required to redesign or re-engineer a product which may require significant resources, may be required to enter into licensing arrangements from the third party claiming infringement (which may not be available on commercially reasonable terms, or at all), or may become liable for significant damages.\nIf any of the foregoing occurs, our ability to compete could be affected or our business, financial condition and results of operations may be materially adversely affected.\nThe loss of, or disruption in, our distribution network could have a negative impact on our abilities to ship products, meet customer demand and otherwise operate our business.\nWe sell a significant portion of our products through independent distributors and sales representatives. We rely in large part on the orderly operation of this distribution network, which depends on adherence to shipping schedules and effective management. We conduct all of our shipping through independent third parties. Although we believe that our receiving, shipping and distribution process is efficient and well-positioned to support our operations and strategic plans, we cannot provide assurance that we have anticipated all issues or that events beyond our control, such as natural disasters or other catastrophic events, labor disagreements, acquisition of distributors by a competitor, consolidation within our distributor network or shipping problems, will not disrupt our distribution network. If complications arise within a segment of our distribution network, the remaining network may not be able to support the resulting additional distribution demands. Any of these disruptions or complications could negatively impact our revenues and costs.\nOur ongoing and expected restructuring plans and other cost savings initiatives may not be as effective as we anticipate, and we may fail to realize the cost savings and increased efficiencies that we expect to result from these actions. Our operating results could be negatively affected by our inability to effectively implement such restructuring plans and other cost savings initiatives.\nWe continually seek ways to simplify or improve processes, eliminate excess capacity and reduce costs in all areas of our operations, which from time to time includes restructuring activities. We have implemented significant restructuring activities across our global manufacturing, sales and distribution footprint, which include workforce reductions and facility consolidations. We incurred restructuring charges of $31.2 million and $19.9 million in the years ended December 31, 2024 and 2023, respectively. Costs of future initiatives may be material and the savings associated with them are subject to a variety of risks, including our inability to effectively eliminate duplicative back office overhead and overlapping sales personnel, rationalize manufacturing capacity, synchronize information technology systems, consolidate warehousing and distribution facilities and shift production to more economical facilities. As a result, the contemplated costs to effect these initiatives may materially exceed estimates. The initiatives we are contemplating may require consultation with various employees, labor representatives or regulators, and such consultations may influence the timing, costs and extent of expected savings and may result in the loss of skilled employees in connection with the initiatives.\nAlthough we have considered the impact of local regulations, negotiations with employee representatives and the related costs associated with our restructuring activities, factors beyond the control of management may affect the timing of these projects and therefore affect when savings will be achieved under the plans. There can be no assurance that we will be able to successfully implement these cost savings initiatives in the time frames contemplated (or at all) or that we will realize the projected benefits of these and other restructuring and cost savings initiatives. If we are unable to implement our cost savings initiatives, our business may be adversely affected. Moreover, our continued implementation of cost savings initiatives may have a material adverse effect on our business, results of operations and financial condition.\nIn addition, as we consolidate facilities and relocate manufacturing processes to lower-cost regions, our success will depend on our ability to continue to meet customer demand and maintain a high level of quality throughout the transition. Failure to adequately meet customer demand or maintain a high level or quality could have a material adverse effect on our business, results of operations and financial condition.\nCost overruns, delays, penalties or liquidated damages could negatively impact our results, particularly with respect to fixed-price contracts for custom engineered products.\nA portion of our revenues and earnings is generated through fixed-price contracts for custom engineered products. Certain of these contracts provide for penalties or liquidated damages for failure to timely perform our obligations under the contract, or require that we, at our expense, correct and remedy to the satisfaction of the other party certain defects. Because substantially \n16\nTable of Contents\nall of our custom engineered product contracts are at a fixed price, we face the risk that cost overruns, delays, penalties or liquidated damages may exceed, erode or eliminate our expected profit margin, or cause us to record a loss on our projects.\nOur operating results could be adversely affected by a loss or reduction of business with key customers or consolidation or the vertical integration of our customer base.\nThe loss or reduction of significant contracts with any of our key customers could result in a material decrease of our future profitability and cash flows. In addition, the consolidation or vertical integration of key customers may result in the loss of certain customer contracts or impact demand or competition for our products, especially in our life sciences and aerospace end markets. Any changes in such customers’ purchasing practices, or decline in such customers’ financial condition, may have a material adverse impact on our business, results of operations and financial condition. Some of our customers are significantly larger than we are, have greater financial and other resources and also have the ability to purchase products from our competitors. As a result of their size and position in the marketplace, some of our customers have significant purchasing leverage and could cause us to materially reduce the price of our products, which could have a material adverse effect on our revenue and profitability. We are unable to predict what effect consolidation in our customers’ industries could have on prices, capital spending by customers, selling strategies, competitive position, our ability to retain customers or our ability to negotiate favorable agreements with customers.\nCredit and counterparty risks could harm our business.\nThe financial condition of our customers could affect our ability to market our products or collect receivables. In addition, financial difficulties faced by our customers as a result of an adverse economic event or other market factors may lead to cancellation or delay of orders. Our customers may suffer financial difficulties that make them unable to pay for a product or solution when payments become due, or they may decide not to pay us, either as a matter of corporate decision-making or in response to changes in local laws and regulations. Although historically not material, we cannot be certain that, in the future, expenses or losses for uncollectible amounts will not have a material adverse effect on our revenues, earnings and cash flows.\nA significant portion of our assets consists of goodwill and other intangible assets, the value of which may be reduced if we determine that those assets are impaired.\nWe have substantial goodwill as a result of past acquisitions. As of December 31, 2024, the net carrying value of goodwill and other intangible assets, net represented $12.5 billion, or 70%, of our total assets. Goodwill and indefinite-lived intangible assets are evaluated for impairment annually, or more frequently if circumstances indicate impairment may have occurred. Significant negative industry or economic trends, disruptions to our business, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in use of our assets, changes in the structure of our business, divestitures, market capitalization declines, or increases in associated discount rates can impair our goodwill and other intangible assets. Impairments, if any, could have a material adverse effect to our consolidated financial position or results of operations. See Note 9 “Goodwill and Other Intangible Assets” to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information related to impairment testing for goodwill and other intangible assets and the associated charges taken.\nEnvironmental compliance costs and liabilities could adversely affect our financial condition.\nOur operations and properties are subject to increasingly stringent domestic and foreign laws and regulations relating to environmental protection, including laws and regulations governing air emissions, water discharges, waste management and workplace safety. Under such laws and regulations, we can be subject to substantial fines and sanctions for violations and be required to install costly pollution control equipment or put into effect operational changes to limit pollution emissions or decrease the likelihood of accidental hazardous substance releases.\nWe use and generate hazardous substances and waste in our manufacturing operations. In addition, many of our current and former properties are, or have been, used for industrial purposes. We have been identified as a potentially responsible party with respect to several sites designated for cleanup under U.S. federal “Superfund” or similar state laws that may impose joint and several liability for cleanup of certain waste sites and for related natural resource damages. A liability on our balance sheet reflects costs that are probable and estimable for our projected financial obligations relating to these matters. If we have underestimated our remaining financial obligations, we may face greater exposure that could have an adverse effect on our financial condition, results of operations or liquidity.\nWe have experienced, and expect to continue to experience, operating costs to comply with environmental laws and regulations. In addition, new laws and regulations, stricter enforcement of existing laws and regulations, the discovery of previously unknown contamination or the imposition of new cleanup requirements could require us to incur costs or become the basis for \n17\nTable of Contents\nnew or increased liabilities that could have a material adverse effect on our business, financial condition, results of operations or liquidity.\nWe face risks associated with our pension and other postretirement benefit obligations.\nWe have both funded and unfunded pension and other postretirement benefit plans worldwide. As of December 31, 2024, our projected benefit obligations under our pension and other postretirement benefit plans exceeded the fair value of plan assets by $139.0 million (“unfunded status”). Estimates for the amount and timing of the future funding obligations of these benefit plans are based on various assumptions. These assumptions include discount rates, rates of compensation increases, expected long-term rates of return on plan assets and expected healthcare cost trend rates. If our assumptions prove incorrect, our funding obligations may increase, which may have a material adverse effect on our financial results.\nWe have invested the plan assets of our funded benefit plans in various equity and debt securities. A deterioration in the value of plan assets could cause the unfunded status of these benefit plans to increase, thereby increasing our obligation to make additional contributions to these plans. An obligation to make contributions to our benefit plans could reduce the cash available for working capital and other corporate uses, and may have an adverse impact on our operations, financial condition and liquidity.\nRisks Related to Our Indebtedness\nOur indebtedness could have important adverse consequences and adversely affect our financial condition.\nWe have a significant amount of indebtedness. As of December 31, 2024, we had total indebtedness of $4,757.5 million, and we had availability of $2,600 million under each of the New Revolving Credit Facility and Commercial Paper Program. Our level of debt could have adverse consequences, including: making it more difficult for us to satisfy our obligations with respect to our debt; limiting our ability to obtain additional financing to fund future working capital, capital expenditures, investments or acquisitions, or other general corporate requirements; requiring a substantial portion of our cash flows to be dedicated to debt service payments instead of other purposes, thereby reducing the amount of cash flows available for working capital, capital expenditures, investments or acquisitions and other general corporate purposes; increasing our vulnerability to adverse changes in general economic, industry and competitive conditions; exposing us to the risk of increased interest rates as certain of our borrowings, including borrowings under the New Revolving Credit Facility and portions of our Senior Notes which have been swapped to variable rates of interest; limiting our flexibility in planning for and reacting to changes in the industries in which we compete; placing us at a disadvantage compared to other, less leveraged competitors; increasing our cost of borrowing; and hampering our ability to execute on our growth strategy. For a complete description of the Company’s debt and definitions of capitalized terms used in this section, see Note 12 “Debt” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nWe may not be able to generate sufficient cash to service all of our indebtedness and may be forced to take other actions to satisfy our obligations under our indebtedness, which may not be successful.\nOur ability to make scheduled payments on, or refinance, our debt obligations depends on our financial condition and operating performance, which are subject to prevailing economic, industry and competitive conditions and to certain financial, business, legislative, regulatory and other factors beyond our control (as well as and including those factors discussed under “Risks Related to Our Business” above). We may be unable to maintain a level of cash flow from operating activities sufficient to permit us to pay the principal, premium, if any, and interest on our indebtedness.\nIf our cash flow and capital resources are insufficient to fund our debt service obligations, we could face substantial liquidity problems and could be forced to reduce or delay investments and capital expenditures or to dispose of material assets or operations, seek additional debt or equity capital, or restructure or refinance our indebtedness. We may not be able to implement any such alternative measures on commercially reasonable terms or at all and, even if successful, those alternative actions may not allow us to meet our scheduled debt service obligations.\nIf we cannot make scheduled payments on our debt, we will be in default and the lenders under the New Revolving Credit Facility could terminate their commitments to loan money.\nDespite our level of indebtedness, we and our subsidiaries may still be able to incur substantially more debt, including off-balance sheet financing, contractual obligations and general and commercial liabilities. This could further exacerbate the risks to our financial condition\n.\nWe and our subsidiaries may be able to incur significant additional indebtedness in the future, including off-balance sheet financings, contractual obligations and general and commercial liabilities. Although the credit agreement governing the New Revolving Credit Facility contains restrictions on the incurrence of certain additional indebtedness, these restrictions are subject \n18\nTable of Contents\nto a number of qualifications and exceptions, and the additional indebtedness incurred in compliance with these restrictions could be substantial. For example, we can increase the borrowing availability under the New Revolving Credit Facility by up to $1,000.0 million in the form of additional commitments in compliance with the New Revolving Credit Facility. If new debt is added to our current debt levels, the related risks that we now face could intensify. For a complete description of the Company’s credit facilities and definitions of capitalized terms used in this section, see Note 12 “Debt” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nOur fixed rate to floating rate swap contracts subject us to risks related to interest rate risk, counterparty credit worthiness and non-performance on these instruments.\nOur fixed rate to floating rate swap contracts expose us to interest rate risk. If interest rates increase, our debt service obligations on the variable rate will increase and our net income and cash flows, including cash available for servicing our indebtedness, will correspondingly decrease.\nAdditionally, we will be exposed to credit-related losses which could impact the results of operations in the event of fluctuations in the fair value of the interest rate swaps due to a change in the credit worthiness or non-performance by the counterparties to the interest rate swaps. See Note 20 “Hedging Activities, Derivative Instruments and Credit Risk” to our audited consolidated financial statements included elsewhere in this Form 10-K.\nIf the syndicate of financial institutions which are parties to our New Revolving Credit Facility (as defined herein) fail to extend credit under our New Revolving Credit Facility, our liquidity and results of operations may be adversely affected.\nWe have access to capital through our New Revolving Credit Facility. Each financial institution which is part of the syndicate for our New Revolving Credit Facility is responsible on a several, but not joint, basis for providing a portion of the loans to be made under our facility. If any participant or group of participants with a significant portion of the commitments in our New Revolving Credit Facility fails to satisfy its or their respective obligations to extend credit under the facility and we are unable to find a replacement for such participant or participants on a timely basis (if at all), our liquidity may be adversely affected.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nThe Company has implemented controls based on the National Institute of Standards and Technology Cybersecurity Framework (the “NIST CSF”) and the Sarbanes-Oxley Act of 2002.\n Our Information Technology organization is led by the Chief Information Officer (“CIO”) who is responsible for cybersecurity risk management. \nThe \nAudit Committee of the Board of Directors\n is tasked with oversight of our overall enterprise risk management program, including cybersecurity, and receives recurring cybersecurity updates throughout the year with at least two cybersecurity reports to the full Board of Directors annually.\n Directors with experience in cybersecurity and technology play crucial oversight roles for our digital and cybersecurity strategies.\nOur cybersecurity program is overseen by the Company’s \nChief Information Security Officer (“CISO”)\n and is designed to protect and preserve the confidentiality, integrity and availability of our information technology assets.\n Risks and controls are monitored by the CISO and CIO and their evaluation of our overall program drives the nature and scope of our cybersecurity investments.\n \nOur CISO reports directly to the CIO and has 20 years of IT experience including leadership roles at various companies with enterprise responsibility for IT audit, IT infrastructure, and cybersecurity.\n The CISO reports to the Audit Committee on the effectiveness of the Company’s cybersecurity program controls aligned to the NIST CSF framework. \nWe periodically engage external subject matter experts who provide independent qualitative and quantitative assessments of the cybersecurity program maturity and response readiness.\n \nWe also use processes to oversee and identify material risks from cybersecurity threats associated with our use of third-party technology and systems.\n In addition, the Company leverages a monthly cybersecurity awareness training program for all employees that is further reinforced through frequent phishing simulations.\nQuarterly updates are provided by the CISO to the Cybersecurity Governance Committee comprised of cross functional senior management regarding the effectiveness of cybersecurity program and its ability to monitor the prevention, detection, mitigation, and remediation of cybersecurity incidents. Our Cybersecurity Governance Committee is responsible for monitoring and coordinating enterprise cybersecurity policy and strategy, and for providing guidance to key management and oversight bodies. Our cybersecurity program includes a risk-based incident response plan that provides a documented framework for handling incidents including coordination across multiple parts of the Company.\n \n19\nTable of Contents\nAs of the date of this report, we do not believe any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect the Company, including its business strategy, results of operations or financial condition.\n For a discussion of the risks and uncertainties that cybersecurity incidents may have on us, see “Risk Factors: Information systems failure or disruption, due to cyber terrorism or other actions, may adversely impact our business and result in financial loss to the Company or liability to our customers” in this Form 10-K."
  }
}