{
  "ticker": "IRM",
  "cik": "0001020569",
  "company_name": "IRON MOUNTAIN INC",
  "filing_date": "2025-02-14",
  "accession": "0001020569-25-000040",
  "primary_doc": "irm-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS. \nBUSINESS OVERVIEW\nIron Mountain Incorporated, a Delaware corporation (\"IMI\"), was founded in an underground facility near Hudson, New York in 1951 where it stored business records. Today, we are a global leader in information management services, and we are trusted by more than 240,000 customers in 61 countries, including approximately 95% of the Fortune 1000, to help unlock value and intelligence from their assets through services that transcend the physical and digital worlds. Our broad range of solutions address their information management, digital transformation, information security, data center and asset lifecycle management (“ALM”) needs. Our longstanding commitment to safety, security, sustainability and innovation in support of our customers underpins everything we do. We currently serve customers across an array of market verticals — commercial, legal, financial, healthcare, technology, insurance, life sciences, energy, business services, entertainment and government organizations. \nWe are listed on the New York Stock Exchange (the \"NYSE\") and are a constituent of the Standard & Poor’s 500 Index, the Morgan Stanley Capital International (\"MSCI\") REIT index and the FTSE EPRA Nareit Global Real Estate Index. As of December 31, 2024, we were number 604 on the Fortune 1000. We have been organized and have operated as a REIT beginning with our taxable year ended December 31, 2014.\nBUSINESS STRATEGY\nOVERVIEW\nOur company has been a market leader in the physical ecosystem supporting information storage and retrieval, as most businesses have relied on paper documents or computer tapes to store their valuable information. Over time, customers are increasing their digital information, with the new information storage ecosystem being a hybrid of physical and digital media. We have evolved our business to meet our customers' needs while remaining focused on driving growth supported by our four pillars outlined below.\nContinued revenue growth in physical storage through revenue management actions as well as volume growth achieved in faster growing markets and our consumer business, as well as complementary business growth\n•\nWe are establishing and enhancing leadership positions in higher-growth markets such as central and eastern Europe, Latin America, Asia, the Middle East and Africa.\n•\nWe continue to identify, acquire, incubate and scale complementary businesses and products to support our long-term growth objectives and drive solid returns on invested capital. These opportunities include our Global Digital Solutions, ALM, Fine Arts and Consumer Storage (each as defined below) businesses.\nUtilizing our global scale as well as over 70 years of customer trust to deliver differentiated data center offerings\n•\nWe have made significant progress in scaling our Global Data Center Business through acquisitions and organic growth, with 29 operating data centers across 21 global markets, either directly or through unconsolidated joint ventures. \n•\nAs of December 31, 2024, we had leased approximately 96% of the existing 416 megawatt (\"MW\") capacity of our data centers. With a total potential capacity of 1,280 MW in land and buildings currently owned or operated by us, we are among the largest global data center operators.\nEstablishing and maintaining a leadership position in critical digital infrastructure as well as developing and offering new products and services that allow our customers to achieve reliable and secure information management solutions in an increasingly hybrid physical and digital world\n•\nWe are positioned to take advantage of the secular growth trends of the changing nature of digital infrastructure. We continue to scale our Global Digital Solutions business to complement our existing offerings in records and information management, ALM, and our Global Data Center business in order to respond to our customers’ growing interest and need to react to environmental, social and corporate governance considerations. This full suite of complementary businesses puts Iron Mountain in a unique position to cross sell our products and services to our customers.\n•\nOur customers are faced with navigating a more complex regulatory environment, and one in which hybrid physical and digital solutions have become the norm. Our strategy is underpinned by our persistent focus on best-in-class customer experience, as we continue to seek innovative solutions to help our customers progress on their journey from physical storage to a digital ecosystem.\nIRON MOUNTAIN 2024 FORM 10-K\n1\nTable of Contents\nPart I\nContinued investment in our growth agenda, our business and customer-centric solutions\n•\nWe have established an investment strategy to fuel our growth. The investments we outlined in our plan for Project Matterhorn (as defined below) have been informed by our established leadership position in the physical storage business, our expanding services such as Global Digital Solutions and ALM and our significant progress in the Global Data Center Business.\nPROJECT MATTERHORN\nIn September 2022, we announced a global program designed to accelerate the growth of our business (\"Project Matterhorn\"). Project Matterhorn investments focus on transforming our operating model to a global operating model. Project Matterhorn focuses on the formation of a solution-based sales approach that is designed to allow us to optimize our shared services and best practices to better serve our customers' needs. We are investing to accelerate growth and to capture a greater share of the large, global addressable markets in which we operate. We have incurred approximately $378.5 million in Restructuring and other transformation costs from the inception of Project Matterhorn through December 31, 2024. We expect to incur approximately $150.0 million in costs related to Project Matterhorn during the year ending December 31, 2025, at which point the program is expected to be completed. Costs are comprised of (1) restructuring costs, which include (i) site consolidation and other related exit costs, (ii) employee severance costs and (iii) certain professional fees associated with these activities, and (2) other transformation costs, which include professional fees such as project management costs and costs for third party consultants who are assisting in the enablement of our growth initiatives. Total costs related to Project Matterhorn during the years ended December 31, 2024 and 2023 were approximately $161.4 million and $175.2 million, respectively.\nBUSINESS SEGMENTS\nThe amount of revenues derived from our business segments and other relevant data, including financial information about geographic areas and product and service lines, for the years ended December 31, 2024, 2023 and 2022, are set forth in Note 11 to Notes to Consolidated Financial Statements included in this Annual Report.\nGLOBAL RIM BUSINESS\nThe Global Records and Information Management (\"Global RIM\") Business segment includes several distinct offerings. \nRecords Management,\n stores physical records and provides information services, vital records services, courier operations, and the collection, handling and disposal of sensitive documents (\"Records Management\") for customers in 61 countries around the globe.\nData Management, \nprovides storage and rotation of backup computer media as part of corporate disaster recovery plans, including service and courier operations, server and computer backup services and related services offerings (\"Data Management\").\nGlobal Digital Solutions, \ndevelops, implements and supports comprehensive storage and information management solutions for the complete lifecycle of our customers’ information, including the management of physical records, conversion of documents to digital formats and digital storage of information (\"Global Digital Solutions\"). In August 2024, we launched the InSight Digital Experience Platform (also referred to as DXP), a secure, software-as-a-service platform designed to automate customer workflows, enhance data accessibility, ensure audit compliance and optimize customer data for AI applications.\nSecure Shredding,\n includes the scheduled pick-up of office records that customers accumulate in specially designed secure containers we provide and is a natural extension of our hardcopy records management operations, completing the lifecycle of a record. Through a combination of shredding facilities and mobile shredding units consisting of custom built trucks, we are able to offer secure shredding services to our customers.\nMedia and Archive Services,\n includes entertainment and media services, which help industry clients store, safeguard and deliver physical media of all types, and provides digital content repository systems that house, distribute and archive key media assets.\nConsumer Storage, \nprovides on-demand, valet storage for consumers (\"Consumer Storage\") utilizing data analytics and machine learning to provide effective customer acquisition and a convenient and seamless consumer storage experience.\n2\nIRON MOUNTAIN 2024 FORM 10-K\nTable of Contents\n                                                                                                                                                                                                                                  Part I\nGLOBAL DATA CENTER BUSINESS\nThe Global Data Center Business segment provides enterprise-class data center facilities and hyperscale-ready capacity to protect mission-critical assets and ensure the continued operation of our customers’ IT infrastructure with secure, reliable and flexible data center options. The world’s most heavily regulated organizations have trusted us as a data center operator for over 20 years, with five of the largest global hyperscalers among our customers.\nCORPORATE AND OTHER\nCorporate and Other consists primarily of our ALM and Fine Arts businesses and other corporate items (\"Corporate and Other\").\nALM,\n provides hyperscale and corporate IT infrastructure managers with services and solutions that enable the decommissioning, data erasure, processing and disposition, and recycling or sale of IT hardware and component assets. ALM services are enabled by: secure logistics, chain of custody and complete asset traceability practices, environmentally-responsible asset processing and recycling, and data sanitization and asset refurbishment services that enable value recovery through asset remarketing. In addition, ALM also offers workplace IT asset management services including storage, configuration, deployment, device support, end-of-life disposition and recycling or sale of employee IT devices. Our ALM services focus on protecting and eradicating customer data while maintaining strong, auditable and transparent chain of custody practices. \nFine Arts, \nprovides technical expertise in the handling, installation and storing of art (\"Fine Arts\").\nCorporate and Other also includes costs related to executive and staff functions, including finance, human resources and IT, which benefit the enterprise as a whole.\nIRON MOUNTAIN 2024 FORM 10-K\n3\nTable of Contents\nPart I\nBUSINESS ATTRIBUTES\nOur business has the following attributes: \nLarge, Diversified,\nGlobal Business\nThe world’s most heavily regulated organizations trust us with the storage of their records. Our mission-critical storage offerings and related services generated approximately $6.1 billion in annual revenue in 2024. Our business has a highly diverse customer base of more than 240,000 customers - with no single customer accounting for more than approximately 1% of revenue during the year ended December 31, 2024 - and operates in 61 countries globally. This presents a significant cross-sell opportunity for our expanding solutions, including digital, data center and ALM.\nRecurring, Durable \nRevenue Stream\nA majority of our revenue is recurring in nature. In our Records Management business, our contracted storage rental fee agreements generally range from one to five years in length. As of December 31, 2024, we stored more than 730 million cubic feet of physical volume and we have consistently experienced strong customer retention levels. In our Global Data Center Business, our lease durations vary by customer, with a weighted average lease expiration of 10.6 years as of December 31, 2024.\nComprehensive Information\nManagement Solution\nAs an S&P 500 REIT with approximately 1,350 locations globally and with offerings spanning physical storage, digitization solutions and digital storage, we are positioned to provide a holistic offering to our customers. We are able to cater to our customers’ physical and digital needs and to help guide their digital transformation journey.\nSignificant Owner and Operator\nof Real Estate\nWe operate approximately 98 million square feet of real estate worldwide. Our owned real estate footprint spans to over 24 million square feet.\nLimited Revenue Cyclicality\nHistorically, economic downturns have not significantly affected our storage rental business. Due to the durability of our total global physical volumes, the success of our revenue management initiatives and the growth of our Global Data Center Business, we believe we can continue to grow organic storage rental revenue over time.\nShifting Revenue Mix\nWe have identified a number of areas where we see opportunity for growth as we position ourselves to unlock greater value for our customers. These business lines, including Global Data Center, ALM and Global Digital Solutions, represent markets with strong, secular growth.\n4\nIRON MOUNTAIN 2024 FORM 10-K\nTable of Contents\n                                                                                                                                                                                                                                  Part I\nIn addition, our Global Data Center Business has the following attributes:\nLarge Data Center\nPlatform with Significant\nExpansion Opportunity\nAs of December 31, 2024, we had 416 MW of leasable capacity with an additional 864 MW under construction or held for development.\nDifferentiated Compliance\nand Security\nWe offer comprehensive compliance support as well as physical and cybersecurity. Our Security-in-Depth strategy integrates both technical and human security measures, with oversight provided by senior security leaders with military and public sector backgrounds. As of December 31, 2024, our data center portfolio has achieved numerous certifications and received third party assurance reports, making it one of the most comprehensive compliance programs in the industry. These certifications and reports on compliance include the global ISO 27001, ISO 22301, ISO 9001, SOC 2 and PCI-DSS standards, as well as HIPAA, NIST 800-53 and FISMA HIGH in the United States. The program also includes enterprise-wide certified ISO 14001 and 50001 environmental and energy management systems and complies with ISO 14064 for greenhouse gas emissions, supporting our commitment to sustainability.\nEfficient Access\nand Flexibility\nWe have the ability to provide customers with a range of deployment options from one cabinet to an entire building, leveraging our global portfolio of hyperscale-ready and underground data centers. We also provide access to numerous carriers, cloud providers and peering exchanges with migration support.\n100% Clean Energy\nData Centers\nWe have matched 100% of the energy consumption in our data centers with clean energy annually since 2017. This approach enables our Green Power Pass offering, which allows customers to report the power they consume at any Iron Mountain Data Center as clean power in their public reporting, making Iron Mountain a key part of their decarbonization roadmaps and goals. Our data center business is a founding signatory to the UN Compact on 24/7 Carbon-Free Energy (“CFE”), which seeks hour-by-hour matching of site consumption with local CFE by 2040.\nCOMPETITION\nWe face competition from numerous storage and information management services providers globally, as well as storage and information management services that are managed and operated internally by organizations. Competition for records and information customers is driven by factors such as pricing, reputation and reliability, the quality and security of storage solutions and the scope and scale of technology. While the majority of our competitors operate in only one market or region, we believe we provide a differentiated global offering that competes effectively in these areas.\nWe also compete with numerous data center developers, owners and operators, many of whom own properties comparable to ours in several of the same metropolitan areas where our facilities are located. We believe that competition for data center customers is based on availability of power, security measures, location, connectivity and rental rates, and we are confident in our ability to compete effectively in each of these areas. Additionally, we believe our strong brand, global footprint and excellent commercial relationships empower us to compete successfully and provide significant cross-selling opportunities with our existing customer base.\nIn our ALM business, we compete with both hyperscalers and individual corporate clients who manage their own asset recycling, disposition and management, in addition to external competitors.\nHUMAN CAPITAL MANAGEMENT\nEMPLOYEES\nAs of December 31, 2024, we employed approximately 11,150 employees in the United States and approximately 17,700 employees outside of the United States. As of December 31, 2024, approximately 375 employees were represented by unions in North America and approximately 1,375 employees were represented by unions in Latin America. All union employees are currently under renewed labor agreements or operating under an extension agreement.\nIRON MOUNTAIN 2024 FORM 10-K\n5\nTable of Contents\nPart I\nBENEFIT PROGRAMS\nWe provide our employees with benefits that are designed to support their overall physical, financial, emotional and social well-being. These benefits vary by location but generally include health and welfare benefits, paid time off and programs to support financial security. Additionally, employees are able to access emotional well-being resources through global employee assistance programs. Certain unionized employees receive benefits through unions and are not eligible to participate in our benefit programs. In addition to base compensation and other usual benefits, a significant portion of full-time employees participate in some form of incentive-based compensation program that provides payments based on revenues, profits or attainment of specific objectives for the unit in which they work. \nCOMPANY CULTURE\nWe are committed to making a meaningful impact on our customers, our people and our business by cultivating a culture that is firmly grounded in our values: \nActing with Integrity, Owning Safety and Security, Building Customer Value, Taking Ownership and Promoting Inclusion and Teamwork\n. \nWhile we foster an environment of learning, collaboration, diversity and wellbeing, we know culture truly thrives in the everyday experience of working at Iron Mountain. \nOur culture encourages open communication and innovation while fostering trust, engagement and exceptional performance. We evaluate this through regular employee surveys and by leveraging data to gain a deeper understanding of our global workforce, and how they work. These insights collectively enable us to drive enhanced employee engagement, measure effectiveness and refine our approach for sustained success.\nLed by our President and CEO, William Meaney, our Inclusive Leadership Alliance (the \"Alliance\") includes members of the Executive Leadership Team and plays a pivotal role in advancing our culture and driving growth. The Alliance reviews and supports key initiatives, monitors progress toward enterprise goals, ensures accountability through measurable targets and communicates achievements to stakeholders.\nOur volunteer-based global employee resource groups play an essential role in supporting talent attraction, retention and development, and serving as valuable allies across our company. Each group is sponsored by one or more members of Iron Mountain’s Executive Leadership Team.\nCOMMUNITY INVOLVEMENT\nWe are committed to integrating responsible and sustainable practices throughout our organization to help our operations have a positive impact on the environment and the communities in which we operate. We aim to give back to the communities where we live and work and believe that this commitment helps in our efforts to attract and retain employees. We offer philanthropic support to our global community through our Living Legacy Initiative, which is our commitment to help preserve and make accessible cultural and historical information and artifacts. We encourage volunteerism in the communities in which we live and work through our Moving Mountains volunteer program, offering paid time off for employees to help community-based and civic-minded organizations.\nINSURANCE\nFor strategic risk transfer purposes, we maintain a comprehensive insurance program with insurers that we believe to be reputable and which have adequate capitalization in amounts that we believe to be appropriate. Property insurance is purchased on a comprehensive basis, including flood and earthquake (including excess coverage), subject to certain policy conditions, sublimits and deductibles. Property is insured based upon the replacement cost of real and personal property, including leasehold improvements, business income loss and extra expense. Other types of insurance that we carry, which are also subject to certain policy conditions, sublimits and deductibles, include medical, workers’ compensation, general liability, umbrella, automobile, professional, cyber, warehouse legal liability and directors’ and officers’ liability policies.\nGOVERNMENT REGULATION\nWe are required to comply with numerous laws and regulations covering a wide variety of subject matters which may have a material effect on our capital expenditures, earnings and competitive position.\n6\nIRON MOUNTAIN 2024 FORM 10-K\nTable of Contents\n                                                                                                                                                                                                                                  Part I\nFor example, some of our currently and formerly owned or leased properties were previously used by entities other than us for industrial or other purposes, or were affected by waste generated from nearby properties, that involved the use, storage, generation and/or disposal of hazardous substances and wastes, including petroleum products. In some instances, this prior use involved the operation of underground storage tanks or the presence of asbestos-containing materials. Where we are aware of environmental conditions that require remediation, we undertake appropriate activity, in accordance with all legal requirements. Although we have from time to time conducted limited environmental investigations and remedial activities at some of our former and current facilities, we have not undertaken environmental reviews of all of our properties. We therefore may be potentially liable for environmental costs and may be unable to sell, rent, mortgage or use contaminated real estate owned or leased by us. Under various federal, state and local environmental laws, we may be liable for environmental compliance and remediation costs to address contamination, if any, located at owned and leased properties as well as damages arising from such contamination, whether or not we know of, or were responsible for, the contamination, or the contamination occurred while we owned or leased the property. Environmental conditions for which we might be liable may also exist at properties that we may acquire in the future. In addition, future regulatory action and environmental laws may impose costs for environmental compliance that do not exist today.\nWe transfer a portion of our risk of financial loss due to currently undetected environmental matters by purchasing an environmental impairment liability insurance policy, which covers all owned and leased locations. Coverage is provided for both liability and remediation costs.\nIn addition, we are subject to numerous laws and regulations relating to data privacy and cybersecurity, which are complex, change frequently and have tended to become more stringent over time. We have an established global privacy compliance framework and devote substantial resources, and may in the future have to devote significant additional resources, to facilitate compliance with these laws and regulations, and to investigate, defend or remedy actual or alleged violations or breaches. Any failure by us to comply with, or remedy any violations or breaches of, these laws and regulations could negatively impact our operations, result in the imposition of fines and penalties, liability and litigation, significant costs and expenses and reputational harm.\nFor more information about laws and regulations that could affect our business, see \"",
    "item1a": "Item 1A of Part I, “Risk Factors,” under the heading “Attacks on our internal IT systems could damage our reputation, cause us to lose revenues, and adversely affect our business, financial condition and results of operations”, which should be read in conjunction with the information above.\nGOVERNANCE \nOur Board reviews and discusses significant risks with executive management, including cybersecurity risk, that affect us. Although our executive management team and our Board work together on risk matters, our Board has the ultimate oversight authority over all enterprise risks, including cybersecurity risk. Our Board reserves the right to, and periodically does, consult with third-party advisors and experts to assist our Board in understanding and anticipating future cybersecurity threats and trends. \nThe risk and safety committee of our Board (the \"RSC\") is specifically tasked with reviewing and monitoring cybersecurity and information security risk, as well as the risk management strategies, systems and policies, and processes implemented, established and reported on by our executive management team. The RSC is also primarily responsible for assisting our Board with oversight of our enterprise risk management program.\n \nOur executive management team, with oversight from our Board, is responsible for our enterprise risk management process and the day-to-day supervision and mitigation of enterprise risks, including cybersecurity risk. Our enterprise risk management program includes our executive management team receiving regular reports from our operations personnel.\n As part of our enterprise risk program, \nour executive management team has established an enterprise risk committee (the \"ERC\"), which is chaired by our Chief Risk Officer and is otherwise composed of each of our other executive vice presidents\n. The ERC oversees our risk and compliance activities to ensure that management has appropriate policies and management plans in place for managing risks of the business, including cybersecurity risk, as well as reviewing and prioritizing significant risks and allocating resources for risk mitigation.\nOur \nChief Risk Officer\n provides reports at each meeting of the RSC on areas of potential risks to us, including cybersecurity risk, and our Chief Information Security Officer provides quarterly reports to the RSC on the key performance indicators of our information security program to facilitate the RSC’s oversight of the program through objective measurements, including metrics regarding software patching, IT asset management, cyber incident management and cybersecurity training. Reports by our Chief Information Security Officer also include detailed information on the activities of our cyber incident response team to allow for analysis of trends and the identification of any control gaps that require remediation.\nWe also maintain a business information security committee (the \"ISC\") with employee representation across geographies, business lines and business functions. The ISC includes a cross functional group of our employees with expertise and responsibilities in areas such as operations, digital product solutions, information technology, compliance, security, finance, privacy, internal audit and legal risk mitigation. The ISC is managed by our Chief Information Security Officer and meets regularly to receive updates on our cybersecurity posture, emerging risks and new cybersecurity capabilities. Members of the ISC act as points of contact during incident response activities to provide oversight and logistical support to the information security team.\nThe information security team is made primarily of full-time employees; however, we routinely engage consultants to provide supplemental labor and additional expertise in specific areas on an as-needed basis. Our information security team is organized based on industry best practices in alignment with NIST recommendations.\n \nAll of the leaders in our information security team have over 10 years of cybersecurity experience and most of our information security staff maintain cybersecurity program certifications such as CMU Cybersecurity Executive Certification, ISACA Certifications (CISSP & CISM) and other relevant vendor certifications. Our information security team also regularly undergoes continuing education to ensure our implementation of best-in-class techniques.\n \nIRON MOUNTAIN 2024 FORM 10-K\n21\nTable of Contents\nPart I",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY.\nRISK MANAGEMENT AND STRATEGY \nWe maintain a robust information security program that is designed to protect our information and the information of our customers. Our information security program is based on a recognized cybersecurity framework established by the National Institute of Standards and Technology (\"NIST\") and establishes controls to mitigate critical areas of cybersecurity risk. Our information security program has adopted all elements of the NIST cybersecurity framework, including the six functions of identify, protect, detect, respond, recover and govern, as well as each of the categories and control groups thereunder. This does not imply that we meet any particular technical standards, specifications, or requirements, but only that we use the NIST framework as a guide to ensure our information security program is designed to manage cybersecurity risks relevant to our business. \nAmong other things, the cybersecurity controls in our information security program address information access rights, incident monitoring and response processes, information technology system configuration, network security, security architecture planning, mobile device security and compliance with information security policy requirements and protocols.\n These cybersecurity controls are designed to oversee, identify and mitigate risks from all cybersecurity threats, including those arising from our use of third-party service providers. \nOur cybersecurity controls are evaluated regularly by our internal information security team, and we engage a third party examiner to assess the maturity of our information security program against the NIST cybersecurity framework no less frequently than bi-annually.\n Additionally, our information security program is assessed periodically by a federal regulator in the United States as part of its routine audit of the Company.\n \nIn addition to our internal assessments, we also assess our third-party service providers on a regular basis using a risk-based approach that assigns a risk calculation to each such service provider. The results of our assessments are tracked and evaluated to ensure these third parties comply with our cybersecurity standards.\n We require all employees to undertake data protection and cybersecurity training and compliance programs annually.\n20\nIRON MOUNTAIN 2024 FORM 10-K\nTable of Contents\n                                                                                                                                                                                                                                  Part I\nOur reputation for providing secure information storage to customers is critical to the success of our business, and protecting against material cybersecurity risks is an integral part of maintaining that reputation. A successful cybersecurity breach could lead to theft or misuse of our or our customers’ proprietary or confidential information or our employees’ personal information and result in third-party claims against us, regulatory penalties and reputational harm. As part of our information security program, we also actively monitor emerging cyberattack patterns to develop custom detection capabilities and mitigation techniques to protect against material risk of cybersecurity threats. Upon encountering a cybersecurity incident, our information security team responds using our detailed cybersecurity incident response plan (\"CSIRP\"), which is based on industry best practices, relevant legal requirements and our contractual commitments. Among other things, the CSIRP sets forth the specific criteria used to assess a cybersecurity incident, mitigate risks of adverse consequences associated with any such incident, protocols to escalate the management of the incident and the process to inform our executive management team and any impacted functions of our business. All cybersecurity incidents are assessed to determine whether disclosure is required pursuant to any contractual or regulatory requirements and any material cybersecurity incident is also reported to our board of directors (our \"Board\"). \nTo date, our information security program has been successful in protecting against risks from cybersecurity threats, and we have not had any cybersecurity incidents that have materially affected or are reasonably likely to materially affect our business strategy, results of operations or financial condition.\n Additional information about cybersecurity risks we face is discussed in"
  }
}