{
  "ticker": "IT",
  "cik": "0000749251",
  "company_name": "GARTNER INC",
  "filing_date": "2025-02-13",
  "accession": "0000749251-25-000008",
  "primary_doc": "it-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business — Available Information.\nITEM 11. EXECUTIVE COMPENSATION.\nThe information required to be furnished pursuant to this item is incorporated by reference from the information set forth under the captions “Compensation Discussion & Analysis,” “Compensation Tables and Narrative Disclosures,” “Compensation Committee Report,” “The Board of Directors - Compensation of Directors,” “The Board of Directors - Director Compensation Table,” “Corporate Governance - Risk Oversight - Risk Assessment of Compensation Policies and Practices,” and “Corporate Governance - Compensation Committee” in the Company’s 2025 Proxy Statement. \nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required to be furnished pursuant to this item is incorporated by reference from the information set forth under the captions “Compensation Tables and Narrative Disclosures — Equity Compensation Plan Information” and “Security Ownership of Certain Beneficial Owners and Management” in the Company’s 2025 Proxy Statement. \nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE.\nThe information required to be furnished pursuant to this item is incorporated by reference from the information set forth under the captions “Transactions With Related Persons” and “Corporate Governance — Director Independence” in the Company’s 2025 Proxy Statement. \nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe information required to be furnished pursuant to this item is incorporated by reference from the information set forth under the caption “Proposal Three: Ratification of Appointment of Independent Registered Public Accounting Firm” in the Company’s 2025 Proxy Statement. \n32\nPART IV\n \nITEM\n 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n \n(a) 1. and 2. Financial Statements and Schedules\n \nThe reports of our independent registered public accounting firm and financial statements listed in the Index to Consolidated Financial Statements herein are filed as part of this report.\n \nAll financial statement schedules not listed in the Index have been omitted because the information required is not applicable or is shown in the consolidated financial statements or notes thereto.\n \n3. Exhibits\nEXHIBIT NUMBER\nDESCRIPTION OF DOCUMENT\n3.1(1)\nRestated Certificate of Incorporation of the Company.\n3.2(16)\nBy-laws of Gartner, Inc. (as amended and restated through October 31, 2024).\n4.1(3)\nIndenture (including form of Notes), dated as of June 22, 2020, among Gartner, Inc., the guarantors named therein and U.S. Bank National Association, as a trustee, relating to the $800,000,000 aggregate principal amount of 4.500% Senior Notes due 2028.\n4.2(4)\nIndenture (including form of Notes), dated as of September 28, 2020, among Gartner, Inc., the guarantors named therein and U.S. Bank National Association, as a trustee, relating to the $800,000,000 aggregate principal amount of 3.750% Senior Notes due 2030.\n4.3(5)\nIndenture (including form of Notes), dated as of June 18, 2021, among Gartner, Inc., the guarantors named therein and U.S. Bank National Association, as a trustee, relating to the $600,000,000 aggregate principal amount of 3.625% Senior Notes due 2029.\n4.4(6)+\nDescription of Gartner, Inc.’s Common Stock. \n10.1(13)\nCredit Amendment, dated as of March 26, 2024, among Gartner, Inc., the lender party thereto and JPMorgan Chase Bank, N.A., as administrative agent.\n10.2(12)\nExecutive Performance Bonus Plan, effective January 1, 2024.\n10.3(14)+\n2011 Employee Stock Purchase Plan, as amended and restated, as of May 1, 2024.\n10.4(10)+\nLong-Term Incentive Plan, June 1, 2023 Amendment and Restatement.\n10.5(7)+\nSecond Amended and Restated Employment Agreement between Eugene A. Hall and the Company dated as of February 14, 2019. \n10.6(2)+\nAmendment to Employment Agreement between Eugene A. Hall and the Company dated as of April 29, 2021.\n10.7\n(\n17\n)\n+\nSecond Amendment to Employment Agreement between Eugene A. Hall and the Corporation effective as of July 1, 2024.\n10.8(8)+\nCompany Deferred Compensation Plan, effective January 1, 2009.\n10.9(6)+\nForm of 2022 Stock Appreciation Right Agreement for executive officers.\n10.10(6)+\nForm of 2022 Performance Stock Unit Agreement for executive officers.\n10.11(11)+\nForm of 2023 Stock Appreciation Right Agreement for executive officers.\n10.12(11)+\nForm of 2023 Performance Stock Unit Agreement for executive officers.\n10.13(15)+\nForm of 2024 Stock Appreciation Right Agreement for executive officers.\n10.14(15)+\nForm of 2024 Performance Stock Unit Agreement for executive officers.\n10.15(15)+\nForm of Restricted Stock Unit Agreement for executive officers.\n10.16+*\nForm of 2025 Stock Appreciation Right Agreement for executive officers.\n10.17+*\nForm of 2025 Performance Stock Unit Agreement for executive officers.\n33\n10.18(9)+\nForm of Restricted Stock Unit Agreement for non-employee directors. \n10.19(15)+\nEnhanced Executive Rewards Policy.\n19.1*\nInsider Trading Policy.\n21.1*\nSubsidiaries of Registrant.\n23.1*\nConsent of Independent Registered Public Accounting Firm. \n24.1*\nPower of Attorney (see Signature Page).\n31.1*\nCertification of chief executive officer under Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of chief financial officer under Section 302 of the Sarbanes-Oxley Act of 2002.\n32*\nCertification under Section 906 of the Sarbanes-Oxley Act of 2002.\n97(15)+\nGartner, Inc. Compensation Recoupment (Clawback) Policy.\n101.INS*\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH*\nXBRL Taxonomy Extension Schema Document.\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document.\n101.LAB*\nXBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document.\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document.\n104*\nCover Page Interactive Data File, formatted in Inline XBRL (included as Exhibit 101).\n \n*\nFiled with this document.\n+\nManagement compensation plan or arrangement.\n(1)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on July 6, 2005.\n(2)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on May 5, 2021.\n(3)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on June 23, 2020.\n(4)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on September 28, 2020.\n(5)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on June 21, 2021.\n(6)\nIncorporated by reference from the Company’s Annual Report on Form 10-K filed on February 23, 2022.\n(7)\nIncorporated by reference from the Company’s Annual Report on Form 10-K filed on February 22, 2019.\n(8)\nIncorporated by reference from the Company’s Annual Report on Form 10-K filed on February 20, 2009.\n(9)\nIncorporated by reference from the Company’s Quarterly Report on Form 10-Q filed on August 1, 2018. \n(10)\nIncorporated by reference from the Company’s Proxy Statement (Schedule 14A) filed on April 17, 2023.\n(11)\nIncorporated by reference from the Company’s Annual Report on Form 10-K filed on February 16, 2023.\n(12)\nIncorporated by reference from the Company’s Quarterly Report on Form 10-Q filed on August 1, 2023.\n(13)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on April 1, 2024.\n(14)\nIncorporated by reference from the Company’s Quarterly Report on Form 10-Q filed on April 30, 2024. \n(15)\nIncorporated by reference from the Company’s Annual Report on Form 10-K filed on February 15, 2024.\n(16)\nIncorporated by reference from the Company’s Quarterly Report on Form 10-Q filed on November 5, 2024. \n(17)\nIncorporated by reference from the Company’s Current Report on Form 8-K filed on July 1, 2024.\n34\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS\n \nReport of Independent Registered Public Accounting Firm\n (\nKPMG LLP\n, \nNew York, NY\n, Auditor Firm ID: \n185\n)\n36\nReport of Independent Registered Public Accounting Firm\n38\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n39\nConsolidated Statements of Operations for the Three-Year Period Ended December 31, 2024\n40\nConsolidated Statements of Comprehensive Income for the Three-Year Period Ended December 31, 2024\n41\nConsolidated Statements of Stockholders’ Equity for the Three-Year Period Ended December 31, 2024\n42\nConsolidated Statements of Cash Flows for the Three-Year Period Ended December 31, 2024\n43\nNotes to Consolidated Financial Statements\n44\n \nAll financial statement schedules have been omitted because the information required is not applicable or is shown in the Consolidated Financial Statements or notes thereto.\n35\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nGartner, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Gartner, Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 13, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAssessment of tax benefits on intercompany transfer of intellectual property\nAs discussed in Note 1 to the consolidated financial statements, the Company recognizes the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained based on the technical merits of the position. Recognized tax positions are measured at the largest amount of benefit with greater than a 50 percent likelihood of being realized. As discussed in Note 12, in December 2024, the Company completed an intercompany transfer of certain intellectual property. As a result, the Company recorded a deferred tax asset of approximately $163.2 million. The deferred tax asset represents the value of future tax deductions for amortization of the assets in the acquiring jurisdiction. These amounts have been reduced for associated unrecognized tax benefits.\nWe identified the assessment of  tax benefits related to the December 2024 intercompany transfer of intellectual property as a critical audit matter. Subjective and complex auditor judgment was required in evaluating the tax position in accordance with tax laws and the valuation and measurement of the uncertain tax position based on the tax benefits more likely than \n36\nnot to be realized. The future revenue forecasts and the discount rate used by the Company to estimate the fair value of the intellectual property and to measure the uncertain tax position involved significant judgments that could have a material effect on the value of the deferred tax asset recognized. Specialized skills and knowledge were required to evaluate the tax position in accordance with tax laws, as well as the reasonableness of the discount rate and measurement of the uncertain tax position. \nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s process for recognizing tax benefits. This included controls related to the evaluation of the tax position in accordance with tax laws, and the selection of the future revenue forecasts and the discount rate used in the valuation and measurement of the uncertain tax position. We evaluated the Company’s future revenue forecast assumptions by comparing the assumptions to the entity’s historical revenue growth rates, to third-party analyst projections for the Company, and to third-party projected industry-wide revenue growth rates. We compared the Company’s historical revenue forecasts to actual results to assess the Company’s ability to accurately forecast. We involved tax and transfer pricing professionals with specialized skills and knowledge, who assisted in evaluating the tax position in accordance with tax laws and the measurement of the uncertain tax position by evaluating the Company’s assessment of the technical tax merits applicable to the transaction, the more-likely-than-not recognition and measurement thresholds, and the Company’s application of the relevant tax laws. We involved transfer pricing and valuation professionals with specialized skills and knowledge, who assisted in evaluating the reasonableness of the discount rate, and the valuation and measurement of the uncertain tax position by:\n•\ncomparing the discount rate to a range of discount rates that was independently developed using publicly available market data.\n•\ndeveloping an independent estimate of value of the uncertain tax position using the Company’s forecasts and the independently developed range of discount rates and comparing it to the uncertain tax position recognized by the Company.\n/s/ KPMG LLP\n \nWe have served as the Company’s auditor since 1996.\nNew York, New York\nFebruary 13, 2025\n37\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nGartner, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Gartner, Inc. and subsidiaries' (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements), and our report dated February 13, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\n \nNew York, New York\nFebruary 13, 2025\n38\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(IN THOUSANDS, EXCEPT SHARE DATA)\n \n \nDecember 31,\n \n2024\n2023\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n1,933,147\n \n$\n1,318,999\n \nFees receivable, net of allowances of $\n8,500\n and $\n9,000\n, respectively\n1,696,225\n \n1,601,228\n \nDeferred commissions\n413,914\n \n380,479\n \nPrepaid expenses and other current assets\n153,245\n \n127,180\n \nTotal current assets\n4,196,531\n \n3,427,886\n \nProperty, equipment and leasehold improvements, net\n242,968\n \n262,718\n \nOperating lease right-of-use assets\n257,419\n \n366,809\n \nGoodwill\n2,930,205\n \n2,937,260\n \nIntangible assets, net\n409,689\n \n501,958\n \nOther assets\n497,859\n \n339,288\n \nTotal Assets\n$\n8,534,671\n \n$\n7,835,919\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\n \n \nCurrent liabilities:\n \n \nAccounts payable and accrued liabilities\n$\n1,206,089\n \n$\n1,127,604\n \nDeferred revenues\n2,762,927\n \n2,640,515\n \nCurrent portion of long-term debt\n—\n \n9,600\n \nTotal current liabilities\n3,969,016\n \n3,777,719\n \nLong-term debt, net of deferred financing fees\n2,459,915\n \n2,448,696\n \nOperating lease liabilities\n339,779\n \n513,406\n \nOther liabilities\n406,792\n \n415,464\n \nTotal Liabilities\n7,175,502\n \n7,155,285\n \nStockholders’ Equity:\n \n \nPreferred stock:\n \n \n$\n0.01\n par value, authorized \n5,000,000\n shares; \nnone\n issued or outstanding\n—\n \n—\n \nCommon stock:\n \n \n$\n0.0005\n par value, \n250,000,000\n shares authorized; \n163,602,067\n shares issued for both periods\n82\n \n82\n \nAdditional paid-in capital\n2,497,130\n \n2,320,289\n \nAccumulated other comprehensive loss, net\n(\n88,333\n)\n(\n76,331\n)\nAccumulated earnings\n5,993,007\n \n4,739,292\n \nTreasury stock, at cost, \n86,222,214\n and \n85,264,526\n common shares, respectively\n(\n7,042,717\n)\n(\n6,302,698\n)\nTotal Stockholders’ Equity \n1,359,169\n \n680,634\n \nTotal Liabilities and Stockholders’ Equity \n$\n8,534,671\n \n$\n7,835,919\n \n \nSee Notes to Consolidated Financial Statements.\n39\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(IN THOUSANDS, EXCEPT PER SHARE DATA)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nRevenues:\n \n \n \nResearch\n$\n5,125,650\n \n$\n4,887,046\n \n$\n4,604,791\n \nConferences\n583,224\n \n505,164\n \n389,273\n \nConsulting\n558,537\n \n514,746\n \n481,782\n \nTotal revenues\n6,267,411\n \n5,906,956\n \n5,475,846\n \nCosts and expenses:\n \n \n \nCost of services and product development\n2,023,022\n \n1,903,240\n \n1,693,771\n \nSelling, general and administrative\n2,884,814\n \n2,701,542\n \n2,480,944\n \nDepreciation\n112,083\n \n98,645\n \n93,410\n \nAmortization of intangibles\n90,232\n \n92,458\n \n98,536\n \nAcquisition and integration charges\n973\n \n9,587\n \n9,079\n \n    Gain from sale of divested operation\n—\n \n(\n135,410\n)\n—\n \nTotal costs and expenses\n5,111,124\n \n4,670,062\n \n4,375,740\n \nOperating income\n1,156,287\n \n1,236,894\n \n1,100,106\n \nInterest income\n61,558\n \n38,526\n \n4,880\n \nInterest expense\n(\n131,046\n)\n(\n132,772\n)\n(\n126,203\n)\nGain on event cancellation insurance claims \n300,000\n \n3,077\n \n—\n \nOther income, net\n575\n \n1,404\n \n48,412\n \nIncome before income taxes\n1,387,374\n \n1,147,129\n \n1,027,195\n \nProvision for income taxes\n133,659\n \n264,663\n \n219,396\n \nNet income\n$\n1,253,715\n \n$\n882,466\n \n$\n807,799\n \nNet income per share:\n \n \n \nBasic\n$\n16.12\n \n$\n11.17\n \n$\n10.08\n \nDiluted\n$\n16.00\n \n$\n11.08\n \n$\n9.96\n \nWeighted average shares outstanding:\n \n \n \nBasic\n77,785\n \n79,004\n \n80,178\n \nDiluted\n78,338\n \n79,680\n \n81,067\n \n \nSee Notes to Consolidated Financial Statements.\n40\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(IN THOUSANDS)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n1,253,715\n \n$\n882,466\n \n$\n807,799\n \nOther comprehensive income (loss), net of tax:\n \n \n \nForeign currency translation adjustments\n(\n26,881\n)\n11,677\n \n(\n39,679\n)\nInterest rate swaps - net change in deferred gain or loss\n14,362\n \n15,086\n \n17,075\n \nPension plans - net change in deferred actuarial gain or loss\n517\n \n(\n1,484\n)\n2,425\n \nOther comprehensive income (loss), net of tax\n(\n12,002\n)\n25,279\n \n(\n20,179\n)\nComprehensive income\n$\n1,241,713\n \n$\n907,745\n \n$\n787,620\n \n \nSee Notes to Consolidated Financial Statements.\n41\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(IN THOUSANDS)\n \n \nCommon\nStock\nAdditional\nPaid-In\nCapital\nAccumulated\nOther\nComprehensive\nLoss, Net\nAccumulated\nEarnings\nTreasury\nStock\nTotal\nStockholders’\nEquity\nBalance at December 31, 2021\n$\n82\n \n$\n2,074,896\n \n$\n(\n81,431\n)\n$\n3,049,027\n \n$\n(\n4,671,516\n)\n$\n371,058\n \nNet income\n— \n— \n— \n807,799\n \n— \n807,799\n \nOther comprehensive loss\n— \n— \n(\n20,179\n)\n— \n— \n(\n20,179\n)\nIssuances under stock plans\n— \n14,142\n \n— \n— \n8,154\n \n22,296\n \nCommon share repurchases\n— \n— \n— \n— \n(\n1,043,742\n)\n(\n1,043,742\n)\nStock-based compensation expense\n— \n90,566\n \n— \n— \n— \n90,566\n \nBalance at December 31, 2022\n82\n \n2,179,604\n \n(\n101,610\n)\n3,856,826\n \n(\n5,707,104\n)\n227,798\n \nNet income\n— \n— \n— \n882,466\n \n— \n882,466\n \nOther comprehensive income\n— \n— \n25,279\n \n— \n— \n25,279\n \nIssuances under stock plans\n— \n10,844\n \n— \n— \n14,368\n \n25,212\n \nCommon share repurchases (including excise tax)\n— \n— \n— \n— \n(\n609,962\n)\n(\n609,962\n)\nStock-based compensation expense\n— \n129,841\n \n— \n— \n— \n129,841\n \nBalance at December 31, 2023\n82\n \n2,320,289\n \n(\n76,331\n)\n4,739,292\n \n(\n6,302,698\n)\n680,634\n \nNet income\n— \n— \n— \n1,253,715\n \n— \n1,253,715\n \nOther comprehensive loss\n— \n— \n(\n12,002\n)\n— \n— \n(\n12,002\n)\nIssuances under stock plans\n— \n22,057\n \n— \n— \n6,227\n \n28,284\n \nCommon share repurchases (including excise tax)\n— \n— \n— \n— \n(\n746,246\n)\n(\n746,246\n)\nStock-based compensation expense\n— \n154,784\n \n— \n— \n— \n154,784\n \nBalance at December 31, 2024\n$\n82\n \n$\n2,497,130\n \n$\n(\n88,333\n)\n$\n5,993,007\n \n$\n(\n7,042,717\n)\n$\n1,359,169\n \n \nSee Notes to Consolidated Financial Statements.\n42\nGARTNER, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(IN THOUSANDS)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating activities:\n \n \n \nNet income\n$\n1,253,715\n \n$\n882,466\n \n$\n807,799\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n202,315\n \n191,103\n \n191,946\n \nStock-based compensation expense\n154,784\n \n129,841\n \n90,566\n \nDeferred taxes\n(\n162,081\n)\n(\n64,173\n)\n(\n30,702\n)\nGain from sale of divested operation\n—\n \n(\n135,410\n)\n—\n \nLoss on impairment of lease related assets, net\n10,909\n \n20,368\n \n53,970\n \nReduction in the carrying amount of operating lease right-of-use assets\n65,742\n \n70,207\n \n70,086\n \nAmortization and write-off of deferred financing fees\n4,591\n \n4,689\n \n4,574\n \nGain on de-designated swaps\n(\n3,870\n)\n(\n3,925\n)\n(\n52,308\n)\nChanges in assets and liabilities, net of acquisitions and divestitures:\nFees receivable, net\n(\n137,768\n)\n(\n24,662\n)\n(\n240,696\n)\nDeferred commissions\n(\n41,555\n)\n(\n13,716\n)\n5,574\n \nPrepaid expenses and other current assets\n(\n28,933\n)\n(\n7,893\n)\n(\n3,039\n)\nOther assets\n(\n43,503\n)\n(\n34,528\n)\n8,440\n \nDeferred revenues\n181,180\n \n169,917\n \n297,124\n \nAccounts payable and accrued and other liabilities\n29,396\n \n(\n28,547\n)\n(\n101,912\n)\nCash provided by operating activities\n1,484,922\n \n1,155,737\n \n1,101,422\n \nInvesting activities:\n \n \n \nAdditions to property, equipment and leasehold improvements\n(\n101,737\n)\n(\n103,124\n)\n(\n108,050\n)\nAcquisitions - cash paid (net of cash acquired)\n(\n2,000\n)\n(\n3,800\n)\n(\n9,508\n)\nProceeds from sale of divested operation\n—\n \n161,081\n \n—\n \nCash (used in) provided by investing activities\n(\n103,737\n)\n54,157\n \n(\n117,558\n)\nFinancing activities:\n \n \n \nProceeds from employee stock purchase plan\n28,187\n \n25,107\n \n22,231\n \nPayments for deferred financing fees\n(\n2,972\n)\n—\n \n—\n \nProceeds from revolving credit facility\n274,400\n \n—\n \n—\n \nPayments on borrowings\n(\n274,400\n)\n(\n7,800\n)\n(\n5,931\n)\nPurchases of treasury stock\n(\n735,358\n)\n(\n606,188\n)\n(\n1,043,742\n)\nCash used in financing activities\n(\n710,143\n)\n(\n588,881\n)\n(\n1,027,442\n)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n671,042\n \n621,013\n \n(\n43,578\n)\nEffects of exchange rates on cash and cash equivalents and restricted cash\n(\n57,494\n)\n(\n13\n)\n(\n18,425\n)\nCash and cash equivalents and restricted cash, beginning of year\n1,319,599\n \n698,599\n \n760,602\n \nCash and cash equivalents and restricted cash, end of year \n$\n1,933,147\n \n$\n1,319,599\n \n$\n698,599\n \nSupplemental disclosures of cash flow information:\n \n \n \nCash paid during the year for:\n \n \n \nInterest\n$\n100,085\n \n$\n119,038\n \n$\n112,825\n \nIncome taxes, net of refunds received\n$\n312,894\n \n$\n306,682\n \n$\n174,802\n \nSee Notes to Consolidated Financial Statements.\n43\nGARTNER, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 — \nBusiness and Significant Accounting Policies\n \nBusiness.\n Gartner, Inc. (NYSE: IT) delivers actionable, objective insight that drives smarter decisions and stronger performance on an organization’s mission-critical priorities. \nWe are a trusted advisor and an objective resource for nearly \n14,000\n enterprises in approximately \n90\n countries and territories — across all major functions, in every industry and enterprise size.\nSegments.\n Gartner delivers its products and services globally through \nthree\n business segments – Research, Conferences and Consulting.\n Note 9 — Revenue and Related Matters and Note 16 — Segment Information describe the products and services offered by each of our segments and provide additional financial information for those segments.\nBasis of presentation.\n The accompanying Consolidated Financial Statements have been prepared in accordance with generally accepted accounting principles in the United States of America (“U.S. GAAP”), as defined in the Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”), for financial information and with the applicable instructions of U.S. Securities and Exchange Commission (“SEC”) Regulation S-X.\nThe fiscal year of Gartner is the twelve-month period from January 1 through December 31. All references to 2024, 2023 and 2022 herein refer to the fiscal year unless otherwise indicated. When used in these notes, the terms “Gartner,” the “Company,” “we,” “us” or “our” refer to Gartner, Inc. and its consolidated subsidiaries.\nPrinciples of consolidation.\n The accompanying Consolidated Financial Statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany transactions and balances have been eliminated.\n \nUse of estimates.\n The preparation of the accompanying Consolidated Financial Statements requires management to make estimates and assumptions about future events. These estimates and the underlying assumptions affect the amounts of assets and liabilities reported, disclosures about contingent assets and liabilities, and reported amounts of revenues and expenses. Such estimates include the valuation of fees receivable, goodwill, intangible assets, deferred tax assets and other long-lived assets, as well as tax accruals and other liabilities. In addition, estimates are used in revenue recognition, income tax expense or benefit, performance-based compensation charges, depreciation and amortization. Management believes its use of estimates in the accompanying Consolidated Financial Statements to be reasonable.\nManagement continually evaluates and revises its estimates using historical experience and other factors, including the general economic environment and actions it may take in the future. Management adjusts these estimates when facts and circumstances dictate. However, these estimates may involve significant uncertainties and judgments and cannot be determined with precision. In addition, these estimates are based on management’s best judgment at a point in time. As a result, differences between our estimates and actual results could be material and would be reflected in the Company’s Consolidated Financial Statements in future periods.\nBusiness acquisitions. \nThe Company accounts for business acquisitions in accordance with the acquisition method of accounting as prescribed by FASB ASC Topic 805, \nBusiness Combinations\n. The acquisition method of accounting requires the Company to record the assets acquired and liabilities assumed based on their estimated fair values as of the acquisition date, with certain exceptions. Any excess of the consideration transferred over the estimated fair value of the net assets acquired, including identifiable intangible assets, is recorded as goodwill. Under the acquisition method, the operating results of acquired companies are included in the Company’s Consolidated Financial Statements beginning on the date of acquisition. The Company completed business acquisitions in 2023 and 2022. Note 2 — Acquisitions and Divestiture provides additional information regarding those business acquisitions.\n \nThe determination of the fair values of intangible and other assets acquired in an acquisition requires management judgment and the consideration of a number of factors, including the historical financial performance of acquired businesses and their projected future performance, and estimates surrounding customer turnover, as well as assumptions regarding the level of competition and the costs necessary to reproduce certain assets. Establishing the useful lives of intangible assets also requires management judgment and the evaluation of a number of factors, including the expected use of an asset, historical client retention rates, consumer awareness and trade name history, as well as any contractual provisions that could limit or extend an asset’s useful life.\n44\nCharges that are directly related to the Company’s acquisitions are expensed as incurred and classified as Acquisition and integration charges in the Consolidated Statements of Operations.\n Note 2 — Acquisitions and Divestiture provides additional information regarding the Company’s Acquisition and integration charges.\nRevenue recognition.\n The Company’s revenue by significant source is accounted for as follows:\n•\nResearch revenues are mainly derived from subscription contracts for research products. The related revenues are deferred and recognized ratably over the applicable contract term. Fees derived from assisting organizations in selecting the right business software for their needs are recognized when the leads are provided to vendors.\n•\nConferences revenues are deferred and recognized upon the completion of the related conference or meeting.\n•\nConsulting revenues are principally generated from fixed fee or time and materials engagements. Revenues from fixed fee contracts are recognized as the Company works to satisfy its performance obligations. Revenues from time and materials engagements are recognized as work is delivered and/or services are provided. Revenues related to contract optimization engagements are contingent in nature and are only recognized upon satisfaction of all conditions related to their payment.\nThe majority of the Company’s Research contracts are billable upon signing, absent special terms granted on a limited basis from time to time. Research contracts are generally non-cancellable and non-refundable, except for government contracts that may have cancellation or fiscal funding clauses. The Company generally records the amount of a subscription contract that is billable as a fee receivable at the time the contract is signed with a corresponding amount as deferred revenue because the contract represents a legally enforceable claim.\n Note 9 — Revenue and Related Matters provides additional information regarding the Company’s business and revenues.\nAllowance for losses. \nThe Company estimates uncollectible amounts on its fees receivable using a historical loss rate method.\n \nCost of services and product development (\n“COS”\n).\n COS expense includes the direct costs incurred in the creation and delivery of the Company’s products and services. These costs primarily relate to personnel.\nSelling, general and administrative (\n“SG&A”\n).\n SG&A expense includes direct and indirect selling costs, general and administrative costs, facility costs and bad debt expense.\nCommission expense.\n The Company records deferred commissions upon the recognition of commission liabilities, which is generally aligned with the obtaining of a customer contract or the commencement of subsequent terms in the case of multi-year contracts. The deferred amount is amortized over a period that aligns with the transfer to the customer of the services to which the commissions relate.\n Note 9 — Revenue and Related Matters provides additional information regarding deferred commissions and the amortization of such costs.\nStock-based compensation expense.\n The Company accounts for stock-based compensation awards in accordance with FASB ASC Topics 505 and 718 and SEC Staff Accounting Bulletins No. 107 and No. 110. Stock-based compensation expense for equity awards is based on the fair value of the award on the date of grant. The Company recognizes stock-based compensation expense over the period that the related service is performed, which is generally the same as the vesting period of the underlying award. Forfeitures are recognized as they occur. A change in any of the terms or conditions of stock-based compensation awards is accounted for as a modification of the award. Incremental compensation cost is measured as the excess, if any, of the fair value of the modified award over the fair value of the original award immediately before its terms are modified, as measured on the modification date. For vested awards, the Company recognizes incremental compensation cost in the period the modification\n \noccurs. For unvested awards, the Company recognizes any incremental compensation expense at the modification\n \ndate or ratably over the requisite remaining service period, as appropriate. If the fair value of the modified award is lower than the fair value of the original award immediately before modification, the minimum compensation cost the Company recognizes is the cost of the original award.\n Note 10 — Stock-Based Compensation provides additional information regarding the Company’s stock-based compensation activity.\nIncome taxes. \nThe Company uses the asset and liability method of accounting for income taxes. The Company estimates its income taxes in each of the jurisdictions where it operates. This process involves estimating the Company’s current tax expense or benefit together with assessing temporary differences resulting from differing treatment of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are included in the Consolidated Balance Sheets. When assessing the realizability of deferred tax assets, the Company considers if it is more likely than not that some or all of the deferred tax assets will not be realized. In making this assessment, the Company considers the availability of loss carryforwards, projected reversals of deferred tax liabilities, projected future taxable income, and ongoing prudent and feasible \n45\ntax planning strategies. The Company recognizes the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained based on the technical merits of the position. Recognized tax positions are measured at the largest amount of benefit with greater than a 50% likelihood of being realized. The Company uses estimates in determining the amount of unrecognized tax benefits associated with uncertain tax positions. Significant judgment is required in evaluating tax law and measuring the benefits likely to be realized. Uncertain tax positions are periodically re-evaluated and adjusted as more information about their ultimate realization becomes available.\n Note 12 — Income Taxes provides additional information regarding the Company’s income taxes.\nCash and cash equivalents and restricted cash.\n Cash and cash equivalents includes cash and all highly liquid investments with original maturities of three months or less, which are considered to be cash equivalents. The carrying value of cash equivalents approximates fair value due to the short-term maturity of such instruments. Investments with maturities of more than three months are classified as marketable securities. Interest earned is recorded in Interest income in the Consolidated Statements of Operations.\nU.S. GAAP requires that amounts generally described as restricted cash and restricted cash equivalents be presented with cash and cash equivalents when reconciling the beginning-of-period and end-of-period total amounts presented on an entity’s statement of cash flows. \nBelow is a table presenting the beginning-of-period and end-of-period cash amounts from the Company’s Consolidated Balance Sheets and the total cash amounts presented in the Consolidated Statements of Cash Flows (in thousands).\nDecember 31, \n2024\n2023\n2022\n2021\nCash and cash equivalents\n$\n1,933,147\n \n$\n1,318,999\n \n$\n697,999\n \n$\n756,493\n \nRestricted cash classified in (1):\nPrepaid expenses and other current assets\n—\n \n600\n \n—\n \n4,109\n \nOther assets\n—\n \n—\n \n600\n \n—\n \nCash and cash equivalents and restricted cash per the Consolidated Statements of Cash Flows\n$\n1,933,147\n \n$\n1,319,599\n \n$\n698,599\n \n$\n760,602\n \n(1)\nRestricted cash consisted of an escrow account established in connection with one of the Company’s business acquisitions. Generally, such cash is restricted to use due to provisions contained in the underlying acquisition agreement. During the year ended December 31, 2024, the Company paid $\n0.6\n million of restricted cash for deferred consideration related to a 2022 acquisition.\nLeases.\n ASC 842 requires accounting for leases under a right-of-use model whereby a lessee must record a right-of-use asset and a related lease liability on its balance sheet for most of its leases. Under ASC 842, leases are classified as either operating or finance arrangements, with such classification affecting the pattern of expense recognition in an entity’s income statement. For operating leases, ASC 842 requires recognition in an entity’s income statement of a single lease cost, calculated so that the cost of the lease is allocated over the lease term, generally on a straight-line basis.\n \nDuring the years ended December 31, 2024, 2023 and 2022, as a result and in consideration of the changing nature of the Company’s use of office space for its workforce and the transitioning to a hybrid work environment, the Company evaluated its existing real estate lease portfolio. As a result of the evaluation, the Company recognized impairment losses of $\n10.9\n million, $\n20.4\n million, and $\n54.0\n million during the years ended December 31, 2024, 2023 and 2022, respectively. Note 7 — Leases provides additional information regarding the Company’s leases.\n \nProperty, equipment and leasehold improvements.\n Equipment, leasehold improvements and other fixed assets owned by the Company are recorded at cost less accumulated depreciation and amortization. Fixed assets, other than leasehold improvements, are depreciated using the straight-line method over the estimated useful life of the underlying asset. Leasehold improvements are amortized using the straight-line method over the shorter of the estimated useful life of the improvement or the remaining term of the related lease.\n Depreciation and amortization expense for fixed assets was $\n112.1\n million, $\n98.6\n million and $\n93.4\n million in 2024, 2023 and 2022, respectively. \nProperty, equipment and leasehold improvements, net are presented in the table below (in thousands).\n46\n \nUseful Life\nDecember 31,\nCategory\n(Years)\n2024\n2023\nComputer equipment and software\n2\n - \n7\n$\n387,362\n \n$\n320,136\n \nFurniture and equipment\n3\n - \n8\n71,026\n \n83,551\n \nLeasehold improvements\n2\n - \n15\n190,451\n \n213,205\n \nTotal cost\n \n648,839\n \n616,892\n \nLess — accumulated depreciation and amortization\n \n(\n405,871\n)\n(\n354,174\n)\nProperty, equipment and leasehold improvements, net\n \n$\n242,968\n \n$\n262,718\n \nThe Company incurs costs to develop internal-use software used in its operations. Certain of those costs that meet the criteria in FASB ASC Topic 350, \nIntangibles - Goodwill and Other\n are capitalized and amortized over future periods. Net capitalized internal-use software development costs were $\n122.0\n million and $\n105.2\n million at December 31, 2024 and 2023, respectively, and are included in Computer equipment and software in the table above. Amortization expense for capitalized internal-use software development costs, which is included with Depreciation in the Consolidated Statements of Operations, totaled $\n60.1\n million, $\n47.8\n million and $\n39.6\n million in 2024, 2023 and 2022, respectively.\nGoodwill.\n Goodwill represents the excess of the purchase price of acquired businesses over the estimated fair values of the tangible and identifiable intangible net assets acquired. Evaluations of the recoverability of goodwill are performed in accordance with FASB ASC Topic 350, which requires an annual assessment of potential goodwill impairment at the reporting unit level and whenever events or changes in circumstances indicate that the carrying value of goodwill may not be recoverable.\nWhen performing the annual assessment of the recoverability of goodwill, the Company initially performs a qualitative analysis evaluating whether any events or circumstances occurred or exist that provide evidence that it is more likely than not that the fair value of any of the Company’s reporting units is less than the related carrying amount. If the Company does not believe that it is more likely than not that the fair value of any of the Company’s reporting units is less than the related carrying amount, then no quantitative impairment test is performed. However, if the results of the qualitative assessment indicate that it is more likely than not that the fair value of a reporting unit is less than its respective carrying amount, then the Company performs a quantitative impairment test. Evaluating the recoverability of goodwill requires judgments and assumptions regarding future trends and events. As a result, both the precision and reliability of management estimates are subject to uncertainty.\nThe Company’s most recent annual impairment test of goodwill was a qualitative analysis conducted during the quarter ended September 30, 2024 that indicated \nno\n impairment. Subsequent to completing the 2024 annual impairment test, no events or changes in circumstances were noted that required an interim goodwill impairment test. Note 3 — Goodwill and Intangible Assets provides additional information regarding the Company’s goodwill.\nFinite-lived intangible assets. \nThe Company has finite-lived intangible assets that are amortized using the straight-line method over the expected useful life of the underlying asset.\n Note 3 — Goodwill and Intangible Assets provides additional information regarding the Company’s finite-lived intangible assets.\nImpairment of long-lived assets.\n The Company’s long-lived assets primarily consist of intangible assets other than goodwill, right-of-use assets and property, equipment and leasehold improvements. The Company reviews its long-lived asset groups for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset or an asset group may not be recoverable. Such evaluation may be based on a number of factors, including current and projected operating results and cash flows, and changes in management’s strategic direction as well as external economic and market factors. The Company evaluates the recoverability of assets and asset groups by determining whether their carrying values can be recovered through undiscounted future operating cash flows. If events or circumstances indicate that the carrying values might not be recoverable based on undiscounted future operating cash flows, an impairment loss may be recognized. The amount of impairment is measured based on the difference between the projected discounted future operating cash flows, using a discount rate reflecting the Company’s average cost of funds, and the carrying value of the asset or asset group.\n \n \nDebt.\n The Company presents amounts borrowed in the Consolidated Balance Sheets, net of deferred financing fees. Interest accrued on amounts borrowed is recorded as Interest expense in the Consolidated Statements of Operations.\n Note 6 — Debt\n \nprovides additional information regarding the Company’s debt arrangements.\n47\nForeign currency exposure.\n The functional currency of the Company’s foreign subsidiaries is typically the local currency. All assets and liabilities of foreign subsidiaries are translated into U.S. dollars at exchange rates in effect at the balance sheet date. Income and expense items are translated at average exchange rates throughout the year. The resulting translation adjustments are recorded as foreign currency translation adjustments, a component of Accumulated other comprehensive loss, net within Stockholders’ Equity on the Consolidated Balance Sheets.\n \nCurrency transaction gains or losses arising from transactions denominated in currencies other than the functional currency of a subsidiary are recognized in results of operations as part of Other income, net in the Consolidated Statements of Operations.\n The Company had net currency transaction (losses) / gains of $(\n6.9\n) million, $(\n6.0\n) million and $\n25.6\n million in 2024, 2023 and 2022, respectively. The Company enters into foreign currency forward exchange contracts to mitigate the effects of adverse fluctuations in foreign currency exchange rates on certain transactions. Those contracts generally have short durations and are recorded at fair value with both realized and unrealized gains and losses recorded in Other income, net. The net gain / (loss) from foreign currency forward exchange contracts was $\n2.5\n million, $\n1.9\n million and $(\n31.9\n) million in 2024, 2023 and 2022, respectively. Note 13 — Derivatives and Hedging provides additional information regarding the Company’s foreign currency forward exchange contracts.\nFair value disclosures.\n The Company has a limited number of assets and liabilities that are adjusted to fair value at each balance sheet date.\n The Company’s required fair value disclosures are provided at Note 14 — Fair Value Disclosures.\nConcentrations of credit risk.\n Assets that may subject the Company to concentration of credit risk consist primarily of short-term, highly liquid investments classified as cash equivalents, fees receivable, contract assets, interest rate swaps and a pension reinsurance asset. The majority of the Company’s cash equivalent investments and its interest rate swap contracts are with investment grade commercial banks. Fees receivable and contract asset balances deemed to be collectible from customers have limited concentration of credit risk due to the Company’s diverse customer base and geographic dispersion. The Company’s pension reinsurance asset (see Note 15 — Employee Benefits) is maintained with a large international insurance company that was rated investment grade as of December 31, 2024 and 2023.\nStock repurchase programs.\n The Company records the cost to repurchase shares of its own common stock as treasury stock. Shares repurchased by the Company are added to treasury shares and are not retired. Note 8 — Stockholders’ Equity provides additional information regarding the Company’s common stock repurchase activity.\nGain on event cancellation insurance claims. \nDuring the year ended December 31, 2024, the Company received $\n300.0\n million in proceeds from a settlement agreement to resolve litigation concerning the Company's event cancellation insurance for 2020 and 2021. The settlement resolved all remaining 2020 and 2021 event cancellation insurance claims. The Company received $\n3.1\n million in proceeds during the year ended December 31, 2023 related to 2020 conference cancellation insurance claims. The Company does not record any gain on insurance claims in excess of expenses incurred until the receipt of the insurance proceeds is deemed to be realizable.\nAdoption of new accounting standard\n. The Company adopted the accounting standard described below during 2024.\nSegment Reporting\n— In November 2023, the FASB issued ASU 2023-07, \nSegment Reporting: Improvements in Reportable Segment Disclosures \n(“ASU No. 2023-07”). The amendments in the ASU are expected to improve disclosures about a public entity’s reportable segments and addresses requests from investors and other allocators of capital for additional, more detailed information about a reportable segment’s expenses. ASU 2023-07 requires public companies to disclose, on an annual and interim basis, significant expenses that are regularly provided to the chief operating decision maker (CODM) and included within each reported measure of segment profit and loss. The amendments in the ASU require that a public company provide all annual disclosures about a reportable segment’s profit or loss and assets currently required under ASC 280 in interim periods. The amendments in the ASU also require that a public entity disclose, on an annual and interim basis, an amount for other segment items by reportable segment and a description of its composition. The other segment items category is the difference between segment revenue less the significant expenses disclosed and each reported measure of segment profit or loss. The amendments in the ASU, among other items, also requires that a public company disclose the title and position of the CODM and an explanation of how the CODM uses the reported measure(s) of segment profit or loss in assessing segment performance and deciding how to allocate resources. The ASU applies to all public entities that are required to report segment information in accordance with Topic 280. All public entities will be required to report segment information in accordance with the new guidance starting in annual periods beginning after December 15, 2023. The Company adopted ASU 2023-07 effective with the 2024 10-K and the adoption only impacted its disclosures with no impacts to the Company's results of operations, cash flows, or financial condition.\n48\nAccounting standards issued but not yet adopted. \nThe FASB has issued accounting standards that have not yet become effective as of December 31, 2024 and may impact the Company’s Consolidated Financial Statements or related disclosures in future periods. The standards and their potential impacts are discussed below.\nIncome Taxes\n— In December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures \n(“ASU No. 2023-09”). The amendments in this ASU are expected to enhance the transparency and decision usefulness of income tax disclosures. ASU 2023-09 requires entities to enhance income tax disclosures primarily related to the rate reconciliation and income taxes paid information. Companies will need to disaggregate the disclosure of income taxes paid (net of refunds received) by federal, state, and foreign taxes on an annual basis. Additionally, on an annual basis, companies would disclose income taxes paid disaggregated by individual jurisdiction using a quantitative threshold of 5% of total income taxes paid. Public business entities would also be required to provide, on an annual basis, rate reconciliation information by specific categories, including state and local income tax, the effect of cross-border tax laws, foreign tax effects, changes in prior year unrecognized tax benefits, and tax credits, among others. Additionally, some categories would then require disaggregation based on a quantitative threshold of 5%. The foreign tax effect category requires disaggregation by both jurisdiction and nature. The ASU also requires additional qualitative disclosures. All public entities will be required to report income tax information in accordance with the new guidance starting in annual periods beginning after December 15, 2024. The Company expects this ASU to only impact its disclosures with no impacts to the Company's results of operations, cash flows, or financial condition.\nIncome Statement\n— In November 2024, the FASB issued ASU 2024-03, \nIncome Statement-Reporting Comprehensive Income- Expense Disaggregation Disclosures \n(“ASU No. 2024-03”). The amendments in this ASU are expected to improve the disclosures about a public business entity’s expenses and address requests from investors for more detailed information about the types of expenses (including employee compensation, depreciation and amortization) in commonly presented expense captions (such as cost of sales, SG&A and research and development). ASU 2024-03 will require a quantitative disclosure of the components of each income statement line item (e.g., cost of services and product development and selling, general and administrative expenses). It will also require entities to disclose the total amount of selling expenses, and, on an annual basis, an entity’s definition of selling expenses. The amendments are effective for annual periods with fiscal years beginning after December 15, 2026, and interim periods in fiscal years beginning after December 15, 2027. The Company expects this ASU to only impact its disclosures with no impacts to the Company's results of operations, cash flows, or financial condition.\nNote 2 — \nAcquisitions and Divestiture\nAcquisitions\nYear Ended December 31, 2023\nIn September 2023, the Company acquired \n100\n% of a formerly independent sales agent of Gartner research products in the Czech Republic for an aggregate purchase price of $\n7.9\n million, including cash acquired and deferred consideration. During the year ended December 31, 2024, the Company paid $\n2.0\n million of deferred consideration. \nYear Ended December 31, 2022\nIn October 2022, the Company acquired \n100\n% of the outstanding capital stock of UpCity, Inc. (“UpCity”), a privately-held company based in Chicago, Illinois, for an aggregate purchase price of $\n6.4\n million. UpCity’s online marketplace helps small businesses by connecting them to ratings and reviews of more than 50,000 B2B service providers. \nDivestiture\nIn February 2023, the Company completed the sale of a non-core business, TalentNeuron, for approximately $\n161.1\n million after consideration of post-close adjustments. The Company recorded a pre-tax gain of $\n135.4\n million on the sale of TalentNeuron, which is included in Gain from sale of divested operation in the Consolidated Statement of Operations for the year ended December 31, 2023. TalentNeuron was included in the Company’s Research segment. \nAcquisition and Integration Charges\nThe Company recognized $\n1.0\n million, $\n9.6\n million and $\n9.1\n million of Acquisition and integration charges during 2024, 2023 and 2022, respectively. Acquisition and integration charges reflect additional costs and expenses resulting from the Company’s acquisitions and divestitures and include, among other items, professional fees and personnel related expenses.\n49\nNote 3 — \nGoodwill and Intangible Assets\nGoodwill.\n \nThe table below presents changes to the carrying amount of goodwill by segment during the two-year period ended December 31, 2024 (in thousands).\n \nResearch\nConferences\nConsulting\nTotal\nBalance at December 31, 2022 (1)\n$\n2,651,193\n \n$\n183,951\n \n$\n95,067\n \n$\n2,930,211\n \nAdditions due to an acquisition (2)\n4,176\n \n—\n \n—\n \n4,176\n \nForeign currency translation impact\n2,180\n \n46\n \n647\n \n2,873\n \nBalance at December 31, 2023 (1)\n2,657,549\n \n183,997\n \n95,714\n \n2,937,260\n \nForeign currency translation impact\n(\n6,568\n)\n(\n77\n)\n(\n410\n)\n(\n7,055\n)\nBalance at December 31, 2024 (1)\n$\n2,650,981\n \n$\n183,920\n \n$\n95,304\n \n$\n2,930,205\n \n \n(1)\nThe Company does \nnot\n have any accumulated goodwill impairment losses.\n(2)\nThe additions were due to the acquisition of an independent sales agent in September 2023. See Note 2 — Acquisitions and Divestiture for additional information.\n \nFinite-lived intangible assets. \nChanges in finite-lived intangible assets during the two-year period ended December 31, 2024 are presented in the tables below (in thousands).\nDecember 31, 2024\nCustomer\nRelationships\nTechnology-related\nOther \nTotal\nGross cost at December 31, 2023\n1,077,183\n \n11,200\n \n10,200\n \n$\n1,098,583\n \nIntangible assets fully amortized\n—\n \n(\n11,200\n)\n—\n \n(\n11,200\n)\nForeign currency translation impact\n(\n5,266\n)\n—\n \n—\n \n(\n5,266\n)\nGross cost\n1,071,917\n \n—\n \n10,200\n \n1,082,117\n \nAccumulated amortization (2)\n(\n665,131\n)\n—\n \n(\n7,297\n)\n(\n672,428\n)\nBalance at December 31, 2024\n$\n406,786\n \n$\n—\n \n$\n2,903\n \n$\n409,689\n \nDecember 31, 2023\nCustomer\nRelationships\nTechnology-related\nOther \nTotal\nGross cost at December 31, 2022\n$\n1,060,541\n \n$\n11,200\n \n$\n10,436\n \n$\n1,082,177\n \nAdditions due to an acquisition (1)\n990\n \n—\n \n—\n \n990\n \nIntangible assets fully amortized\n(\n987\n)\n(\n39\n)\n(\n236\n)\n(\n1,262\n)\nForeign currency translation impact \n16,639\n \n39\n \n—\n \n16,678\n \nGross cost\n1,077,183\n \n11,200\n \n10,200\n \n1,098,583\n \nAccumulated amortization (2)\n(\n580,937\n)\n(\n9,333\n)\n(\n6,355\n)\n(\n596,625\n)\nBalance at December 31, 2023\n$\n496,246\n \n$\n1,867\n \n$\n3,845\n \n$\n501,958\n \n(1)\nThe additions were due to the acquisition of an independent sales agent in September 2023. See Note 2 — Acquisitions and Divestiture for additional information. \n(2)\nFinite-lived intangible assets are amortized using the straight-line method over the following periods: Customer relationships—\n6\n to \n13\n years; Technology-related—\n3\n to \n7\n years; and Other —\n4\n to \n11\n years.\nAmortization expense related to finite-lived intangible assets was $\n90.2\n million, $\n92.5\n million and $\n98.5\n million in 2024, 2023 and 2022, respectively. \nThe estimated future amortization expense by year for finite-lived intangible assets is presented in the table below (in thousands).\n50\n2025\n$\n81,066\n \n2026\n78,391\n \n2027\n77,783\n \n2028\n76,311\n \n2029\n76,233\n \n2030\n19,905\n \n \n$\n409,689\n \nNote 4 — \nOther Assets \n \nThe Company’s other assets are summarized in the table below (in thousands).\n \nDecember 31,\n \n2024\n2023\nBenefit plan-related assets\n$\n155,998\n \n$\n124,298\n \nNon-current deferred tax assets\n262,757\n \n144,714\n \nOther\n79,104\n \n70,276\n \nTotal other assets\n$\n497,859\n \n$\n339,288\n \nNote 5 — \nAccounts Payable and Accrued and Other Liabilities\nThe Company’s Accounts payable and accrued liabilities are summarized in the table below (in thousands).\n \nDecember 31,\n \n2024\n2023\nAccounts payable\n$\n55,793\n \n$\n63,139\n \nPayroll and employee benefits payable \n247,043\n \n243,338\n \nBonus payable\n291,484\n \n279,482\n \nCommissions payable\n184,861\n \n165,898\n \nIncome tax payable\n38,690\n \n72,181\n \nVAT payable\n64,501\n \n60,709\n \nCurrent portion of operating lease liabilities\n100,312\n \n98,493\n \nOther accrued liabilities\n223,405\n \n144,364\n \nTotal accounts payable and accrued liabilities\n$\n1,206,089\n \n$\n1,127,604\n \n \nThe Company’s Other liabilities are summarized in the table below (in thousands).\n \nDecember 31,\n \n2024\n2023\nNon-current deferred revenues\n$\n27,389\n \n$\n33,490\n \nLong-term taxes payable\n122,126\n \n114,467\n \nBenefit plan-related liabilities\n183,720\n \n157,033\n \nNon-current deferred tax liabilities\n48,742\n \n86,550\n \nOther\n24,815\n \n23,924\n \nTotal other liabilities\n$\n406,792\n \n$\n415,464\n \nNote 6 — \nDebt\nThe Company’s total outstanding borrowings are summarized in the table below (in thousands).\n51\nDecember 31, \nDescription\n2024\n2023\n2024 Credit Agreement - Revolving credit facility (1), (2)\n$\n274,400\n \n$\n—\n \n2020 Credit Agreement -Term loan facility\n274,400\n \n2020 Credit Agreement - Revolving credit facility\n—\n \n—\n \n4.50\n% Senior Notes due 2028 (“2028 Notes”)\n800,000\n \n800,000\n \n3.625\n% Senior Notes due 2029 (“2029 Notes”)\n600,000\n \n600,000\n \n3.75\n% Senior Notes due 2030 (“2030 Notes”)\n800,000\n \n800,000\n \nOther (3)\n5,000\n \n5,000\n \nPrincipal amount outstanding (4)\n2,479,400\n \n2,479,400\n \nLess: deferred financing fees (5) \n(\n19,485\n)\n(\n21,104\n)\nNet balance sheet carrying amount \n$\n2,459,915\n \n$\n2,458,296\n \n(1)\nThe contractual annualized interest rate as of December 31, 2024 on the 2024 Credit Agreement was \n5.73\n%, which consisted of Term Secured Overnight Financing Rate (“SOFR”) of \n4.375\n% plus a margin of \n1.350\n%. However, the Company has an interest rate swap contracts that effectively converts the floating SOFR on outstanding amounts to a fixed base rate.\n(2)\nThe Company had approximately $\n0.7\n billion of available borrowing capacity on the 2024 Credit Agreement revolver (not including the expansion feature) as of December 31, 2024.\n(3)\nConsists of a State of Connecticut economic development loan originated in 2019 with a \n10\n-year maturity and bears interest at a fixed rate of \n1.75\n%. This loan may be repaid at any time by the Company without penalty.\n(4)\nThe weighted average annual effective rate on the Company’s outstanding debt for 2024, including the effects of its interest rate swaps discussed below, was \n4.97\n%.\n(5)\nDeferred financing fees are being amortized to Interest expense over the term of the related debt obligation.\n2024 Credit Agreement\nOn March 26, 2024, the Company entered into a Credit Agreement (the “2024 Credit Agreement”) among the Company, as borrower, the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent (the “Administrative Agent”).\nThe 2024 Credit Agreement provides for a $\n1.0\n billion senior unsecured \nfive-year\n revolving facility. The facility may be increased, at the Company’s option and under certain conditions, by up to an additional $\n750\n million in the aggregate. The facility may be used for revolving loans, and up to $\n75.0\n million may be used for letters of credit. The revolving loans may be borrowed, repaid and re-borrowed until March 26, 2029, at which time all amounts borrowed must be repaid, subject to customary extension mechanics. \nOn March 26, 2024, the Company borrowed $\n274.4\n million under the 2024 Credit Agreement. The initial borrowing was used to repay the outstanding amounts under the 2020 Credit Agreement. Additional amounts borrowed under the 2024 Credit Agreement will be used for working capital needs and general corporate purposes of the Company and its subsidiaries, including the funding of acquisitions and investments, payment of capital expenditures and the repurchase of shares. \nInterest under the revolving facility accrues, at a variable rate, based on, at our option, (i) the Secured Overnight Funding Rate (“SOFR”) plus a credit spread adjustment of \n0.10\n% or (ii) an alternate base rate (“Base Rate”) plus, in each case, an applicable margin, and is payable monthly. The applicable margin ranges between \n1.125\n% and \n1.75\n%, depending on the lower rate determined by either the Company’s leverage ratio or the credit rating of the Company’s senior unsecured debt. At December 31, 2024, the applicable all-in margin on the revolving facility was \n1.350\n% (including the credit spread adjustment). The commitment fee payable on the unused portion of the facility is equal to between \n0.125\n% and \n0.25\n% based on utilization of the facility. The Company has also agreed to pay customary letter of credit fees.\nThe 2024 Credit Agreement contains certain customary restrictive loan covenants, including, among others, a financial covenant requiring a maximum leverage ratio and covenants limiting the Company’s ability to grant liens, make acquisitions, be acquired and the ability of the Company’s subsidiaries to incur indebtedness. Subsidiaries of the Company are not required to guarantee obligations under the facility, unless such subsidiaries guarantee indebtedness in excess of a threshold set out in the 2024 Credit Agreement, subject to certain limitations and exceptions.\n52\nThe 2024 Credit Agreement contains customary events of default that include, among others, non-payment of principal, interest or fees, material inaccuracy of representations and warranties, violation of covenants, cross defaults to certain other indebtedness, bankruptcy and insolvency events, ERISA defaults, material judgments, and events constituting a change of control. The occurrence of an event of default allows the lenders to terminate their obligations to lend under the 2024 Credit Agreement and could result in the acceleration of the Company’s obligations under the facility. \n2029 Notes\nOn June 18, 2021, the Company issued $\n600.0\n million aggregate principal amount of \n3.625\n% Senior Notes due 2029. The 2029 Notes were issued pursuant to an indenture, dated as of June 18, 2021 (the “2029 Note Indenture”), among the Company, the guarantors party thereto and U.S. Bank National Association, as trustee.\nThe 2029 Notes were issued at an issue price of \n100.0\n% and bear interest at a rate of \n3.625\n% per annum. Interest on the 2029 Notes is payable on June 15 and December 15 of each year, beginning on December 15, 2021. The 2029 Notes will mature on June 15, 2029. The Company may redeem some or all of the 2029 Notes at any time on or after June 15, 2024 for cash at the redemption prices set forth in the 2029 Note Indenture, plus accrued and unpaid interest to, but excluding, the redemption date. \n2030 Notes\nOn September 28, 2020, the Company issued $\n800.0\n million aggregate principal amount of \n3.75\n% Senior Notes due 2030. The 2030 Notes were issued pursuant to an indenture, dated as of September 28, 2020 (the “2030 Note Indenture”), among the Company, the guarantors party thereto and U.S. Bank National Association, as trustee. \nThe 2030 Notes were issued at an issue price of \n100.0\n% and bear interest at a rate of \n3.75\n% per annum. Interest on the 2030 Notes is payable on April 1 and October 1 of each year, beginning on April 1, 2021. The 2030 Notes will mature on October 1, 2030. \nThe Company may redeem some or all of the 2030 Notes at any time on or after October 1, 2025 for cash at the redemption prices set forth in the 2030 Note Indenture, plus accrued and unpaid interest to, but excluding, the redemption date. Prior to October 1, 2025, the Company may redeem up to \n40\n% of the aggregate principal amount of the 2030 Notes in connection with certain equity offerings, or some or all of the 2030 Notes with a “make-whole” premium, in each case subject to the terms set forth in the 2030 Note Indenture.\n2028 Notes\nOn June 22, 2020, the Company issued $\n800.0\n million aggregate principal amount of \n4.50\n% Senior Notes due 2028. The 2028 Notes were issued pursuant to an indenture, dated as of June 22, 2020 (the “2028 Note Indenture”), among the Company, the guarantors party thereto and U.S. Bank National Association, as trustee. \nThe 2028 Notes were issued at an issue price of \n100.0\n% and bear interest at a rate of \n4.50\n% per annum. Interest on the 2028 Notes is payable on January 1 and July 1 of each year, beginning on January 1, 2021. The 2028 Notes will mature on July 1, 2028. \nThe Company may redeem some or all of the 2028 Notes at any time on or after July 1, 2023 for cash at the redemption prices set forth in the 2028 Note Indenture, plus accrued and unpaid interest to, but excluding, the redemption date.\n2020 Credit Agreement\nPrior to entering into the 2024 Credit Agreement, the Company had a credit facility that provided for a $\n400.0\n million Term loan facility and a $\n1.0\n billion Revolving credit facility (the “2020 Credit Agreement”). The 2020 Credit Agreement contained certain customary restrictive loan covenants, including, among others, financial covenants that applied a maximum consolidated leverage ratio and a minimum consolidated interest expense coverage ratio. On March 26, 2024, concurrently with the Company’s entry into the 2024 Credit Agreement, the Company terminated the 2020 Credit Agreement and repaid all amounts outstanding.\nInterest Rate Swaps\n53\nAs of December 31, 2024, the Company had \none\n fixed-for-floating interest rate swap contract with a total notional value of $\n350.0\n million that matures in 2025. Under the amended agreement, the Company pays a base fixed rate of \n2.98\n% and in return receives a floating Term SOFR base rate on \n30-day\n notional borrowings. \nEffective June 30, 2020, the Company de-designated all of its interest rate swaps and discontinued hedge accounting. Accordingly, subsequent changes to the fair value of the interest rate swaps are recorded in Other income, net. The amounts previously recorded in Accumulated other comprehensive loss are amortized into Interest expense over the terms of the hedged forecasted interest payments. As of December 31, 2024, $\n13.2\n million is remaining in Accumulated other comprehensive loss, net. See Note 13 — Derivatives and Hedging for the amounts remaining in Accumulated other comprehensive loss, net of tax effect, at December 31, 2024 and December 31, 2023.See Note 14 — Fair Value Disclosures for the determination of the fair values of Company’s interest rate swaps.\nNote 7 — \nLeases\nThe Company’s leasing activities are primarily for facilities under cancelable and non-cancelable lease agreements expiring during 2025 and through 2038. These facilities support the Company’s executive and administrative activities, research and consulting, sales, systems support, operations, and other functions. The Company also has leases for office equipment and other assets, which are not significant. Certain of the Company’s lease agreements include (i) renewal options to extend the lease term for up to \nten years\n and/or (ii) options to terminate the agreement within \none year\n. Additionally, certain of the Company’s lease agreements provide standard recurring escalations of lease payments for, among other things, increases in a lessor’s maintenance costs and taxes. Under some lease agreements, the Company may be entitled to allowances, free rent, lessor-financed tenant improvements and other incentives. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nThe Company subleases certain office space that it does not intend to occupy. Such sublease arrangements expire during 2025 and through 2032 and primarily relate to facilities in Arlington, Virginia. Certain of the Company’s sublease agreements: (i) include renewal and termination options; (ii) provide for customary escalations of lease payments in the normal course of business; and (iii) grant the subtenant certain allowances, free rent, Gartner-financed tenant improvements and other incentives.\nLease Accounting under ASC 842\nUnder ASC 842, a lease is a contract or an agreement, or a part of another arrangement, between two or more parties that, at its inception, creates enforceable rights and obligations that conveys the right to control the use of identified property, plant or equipment for a period of time in exchange for consideration.\nRight-of-use assets represent a right to use an underlying asset for the lease term and the related lease liability represents an obligation to make lease payments pursuant to the contractual terms of the lease agreement. Right-of-use assets and lease liabilities are initially recognized on the lease commencement date based on the present value of the lease payments over the lease term. For all of the Company’s facilities leases, the Company accounts for both lease components and nonlease components (e.g., common area maintenance charges, etc.) as a single lease component when determining the present value of the Company’s lease payments. Variable lease payments that are not dependent on an index or a rate are excluded from the determination of right-of-use assets and lease liabilities and such payments are recognized as expense in the period when the related obligation is incurred.\nThe Company’s lease agreements do not provide implicit interest rates. Instead, the Company uses an incremental borrowing rate determined on the lease commencement date to calculate the present value of future lease payments. The incremental borrowing rate is calculated for each individual lease and represents the rate of interest that the Company would have to pay to borrow on a collateralized basis (in the currency that the lease is denominated) over a similar term an amount equal to the lease payments in a similar economic environment. Right-of-use assets also include initial direct costs incurred by the Company and lease payments made to a lessor on or before the related lease commencement date, less any lease incentives received directly from the lessor. \nCertain of the Company’s facility lease agreements include options to extend or terminate the lease. When it is reasonably certain that the Company will exercise a renewal or termination option, the present value of the lease payments for the affected lease is adjusted accordingly. Leases with a term of twelve months or less are accounted for in the same manner as long-term lease arrangements, including any related disclosures. Lease expense for operating leases is generally recognized on a straight-line basis over the lease term, unless the related right-of-use asset was previously impaired.\n54\nAll of the Company’s existing sublease arrangements have been classified as operating leases with sublease income recognized on a straight-line basis over the term of the sublease arrangement. To measure the Company’s periodic sublease income, the Company elected to use a practical expedient under ASC 842 to aggregate nonlease components with the related lease components when (i) the timing and pattern of transfer for the nonlease components and the related lease components are the same and (ii) the lease components, if accounted for separately, would be classified as an operating lease. This practical expedient applies to all of the Company’s existing sublease arrangements.\nWhen the projected lease cost for the term of a sublease exceeds the anticipated sublease income for that same period, the Company treats that circumstance as an indicator that the carrying amount of the related right-of-use asset may not be fully recoverable. In those situations, the Company performs an impairment analysis and, if indicated, the Company records a charge against earnings to reduce the right-of-use asset to the amount deemed to be recoverable in the future.\nOn the Consolidated Balance Sheet, right-of-use assets are classified and reported in Operating lease right-of-use assets, and the related lease liabilities are included in Accounts payable and accrued liabilities (current) and Operating lease liabilities (long-term). On the Consolidated Statement of Cash Flows, the reduction in the carrying amount of right-of-use assets is presented separately and the change in operating lease liabilities is included under Accounts payable and accrued and other liabilities in the reconciliation of net income to cash provided by operating activities.\nAll of the Company’s leasing and subleasing activities are recognized in Selling, general and administrative expense in the Consolidated Statements of Operations. \nThe table below presents the Company’s net lease cost and certain other information related to the Company’s leasing activities as of and for the years ended December 31, 2024, 2023 and 2022 (dollars in thousands).\nYear Ended December 31,\nDescription\n2024\n2023\n2022\n  Operating lease cost (1)\n$\n101,897\n \n$\n112,948\n \n$\n117,750\n \n  Variable lease cost (2)\n23,996\n \n22,254\n \n15,209\n \n  Sublease income\n(\n48,698\n)\n(\n53,377\n)\n(\n46,698\n)\n  Total lease cost, net (3) (4)\n$\n77,195\n \n$\n81,825\n \n$\n86,261\n \n  Cash paid for amounts included in the measurement of operating lease \n  liabilities\n$\n147,672\n \n$\n145,226\n \n$\n137,399\n \n  Cash receipts from sublease arrangements\n$\n46,245\n \n$\n51,968\n \n$\n46,159\n \n  Right-of-use assets obtained in exchange for new operating lease liabilities\n$\n28,291\n \n$\n12,715\n \n$\n20,597\n \nAs of December 31,\n2024\n2023\n2022\n  Weighted average remaining lease term for operating leases (in years)\n6.6\n7.3\n7.9\n  Weighted average discount rate for operating leases\n6.4\n \n%\n6.6\n \n%\n6.6\n \n%\n(1)\nIncluded in operating lease cost was $\n36.4\n million, $\n43.1\n million and $\n41.9\n million of costs for subleasing activities during 2024, 2023, and 2022 respectively.\n(2)\nThese amounts are primarily variable lease and nonlease costs that were not fixed at the lease commencement date or are dependent on something other than an index or a rate.\n(3)\nThe Company did not capitalize any initial direct costs for operating leases during 2024, 2023, or 2022.\n(4)\nAmount excludes impairment charges of $\n10.9\n million, $\n20.4\n million, and $\n54.0\n million for the years ended December 31, 2024, 2023, and 2022 respectively, as discussed below.\nAs of December 31, 2024, the (i) maturities of operating lease liabilities under non-cancelable arrangements and (ii) estimated future sublease cash receipts from non-cancelable arrangements were as follows (in thousands):\n55\nOperating\nSublease\nLease\nCash\nPeriod ending December 31,\nPayments\nReceipts\n2025\n$\n117,130\n \n$\n44,405\n \n2026\n100,775\n \n44,237\n \n2027\n94,468\n \n45,110\n \n2028\n46,836\n \n5,314\n \n2029\n37,904\n \n2,048\n \nThereafter\n130,261\n \n4,344\n \nTotal future minimum operating lease payments and estimated sublease cash receipts (1)\n527,374\n \n$\n145,458\n \nImputed interest\n(\n87,283\n)\nTotal operating lease liabilities per the Consolidated Balance Sheet\n$\n440,091\n \n(1)\nApproximately \n77\n% of the operating lease payments pertain to properties in the United States.\nThe table below indicates where the discounted operating lease payments from the above table are classified in the Consolidated Balance Sheet (in thousands).\nDecember 31,\nDescription\n2024\n2023\nAccounts payable and accrued liabilities\n$\n100,312\n \n$\n98,493\n \nOperating lease liabilities\n339,779\n \n513,406\n \nTotal operating lease liabilities per the Consolidated Balance Sheet\n$\n440,091\n \n$\n611,899\n \nAs of December 31, 2024, the Company had additional operating leases for facilities that have not yet commenced. These operating leases, which aggregated $\n1.3\n million of undiscounted lease payments, are scheduled to commence during 2025 with lease terms of up to \n5\n years.\nAs a result and in consideration of the changing nature of the Company’s use of office space, the Company continues to evaluate its existing real estate lease portfolio. In connection with this evaluation, the Company reviewed certain of its right-of-use assets and related other long-lived assets for impairment under ASC 360.\nAs a result of the evaluation, the Company recognized impairment losses of $\n10.9\n million, $\n20.4\n million and $\n54.0\n million during the years ended December 31, 2024, 2023, and 2022, respectively, which are included as a component of Selling, general and administrative expenses in the accompanying Consolidated Statements of Operations. The impairment loss for the year ended December 31, 2024 includes $\n10.3\n million related to other long-lived assets, primarily leasehold improvements, as well as $\n56.7\n million related to right-of-use assets partially offset by a $\n56.1\n million reduction in lease liabilities. During the fourth quarter of 2024, the Company entered into an amended lease agreement to significantly reduce the square footage and reduce future lease payments at one of its leased locations. The Company made an installment payment of $\n24.0\n million during the fourth quarter of 2024, and will make an equal installment payment during the second quarter of 2025 in consideration for the lease amendment. \nThe impairment loss for the year ended December 31, 2023 includes $\n14.7\n million related to right-of-use assets and $\n5.7\n million related to other long-lived assets, primarily leasehold improvements. The impairment loss for the year ended December 31, 2022 includes $\n40.7\n million related to right-of-use assets and $\n13.3\n million related to other long-lived assets, primarily leasehold improvements.\nThe fair values for the asset groups relating to the impaired long-lived assets were estimated primarily using discounted cash flow models (income approach) with Level 3 inputs. The significant assumptions used in estimating fair value include the expected downtime prior to the commencement of future subleases, projected sublease income over the remaining lease periods and discount rates that reflect the level of risk associated with receiving future cash flows.\nNote 8 — \nStockholders’ Equity\n \nCommon stock.\n Holders of Gartner’s common stock, par value $\n0.0005\n per share, are entitled to \none\n vote per share on all matters to be voted by stockholders. The Company does not currently pay cash dividends on its common stock. Also, the 2024 \n56\nCredit Agreement contains a negative covenant that may limit the Company’s ability to pay dividends. \nThe table below summarizes transactions relating to the Company’s common stock for the three years ended December 31, 2024.\n \nIssued\nShares\nTreasury\nStock\nShares\nBalance at December 31, 2021\n163,602,067\n \n81,205,504\n \nIssuances under stock plans\n—\n \n(\n599,081\n)\nPurchases for treasury (1)\n—\n \n3,822,090\n \nBalance at December 31, 2022\n163,602,067\n \n84,428,513\n \nIssuances under stock plans\n—\n \n(\n975,745\n)\nPurchases for treasury (1)\n—\n \n1,811,758\n \nBalance at December 31, 2023\n163,602,067\n \n85,264,526\n \nIssuances under stock plans\n—\n \n(\n666,193\n)\nPurchases for treasury (1)\n—\n \n1,623,881\n \nBalance at December 31, 2024\n163,602,067\n \n86,222,214\n \n(1)\nThe Company used a total of $\n735.4\n million, $\n606.2\n million and $\n1.0\n billion in cash for share repurchases during 2024, 2023 and 2022, respectively.\nShare repurchase authorization. \nIn 2015, the Company’s Board of Directors (the “Board”) authorized a share repurchase program to repurchase up to $\n1.2\n billion of the Company’s common stock. From February 2021 to July 2024, the Board authorized incremental share repurchases of up to an aggregate additional $\n4.1\n billion of the Company’s common stock. $\n953.8\n million remained available as of December 31, 2024. The Company may repurchase its common stock from time-to-time in amounts, at prices and in the manner that the Company deems appropriate, subject to the availability of stock, prevailing market conditions, the trading price of the stock, the Company’s financial performance and other conditions. Repurchases may be made through open market purchases (which may include repurchase plans designed to comply with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended), accelerated share repurchases, private transactions or other transactions and will be funded by cash on hand and borrowings. Repurchases may also be made from time-to-time in connection with the settlement of the Company’s stock-based compensation awards. \nAccumulated Other Comprehensive Income (Loss), net (“AOCI/L”)\nThe tables below provide information about the changes in AOCI/L by component and the related amounts reclassified out of AOCI/L to income during the years indicated (net of tax, in thousands) (1).\nYear Ended December 31, 2024\n \nInterest Rate Swaps\nDefined Benefit Pension Plans\nForeign Currency Translation Adjustments\nTotal\nBalance - December 31, 2023\n$\n(\n24,162\n)\n$\n(\n5,731\n)\n$\n(\n46,438\n)\n$\n(\n76,331\n)\nOther comprehensive income (loss) activity during the year:\n   Change in AOCI/L before reclassifications to income\n—\n \n315\n \n(\n26,881\n)\n(\n26,566\n)\n   Reclassifications from AOCI/L to income (2), (3)\n14,362\n \n202\n \n—\n \n14,564\n \nOther comprehensive income (loss), net for the year\n14,362\n \n517\n \n(\n26,881\n)\n(\n12,002\n)\nBalance - December 31, 2024\n$\n(\n9,800\n)\n$\n(\n5,214\n)\n$\n(\n73,319\n)\n$\n(\n88,333\n)\nYear Ended December 31, 2023\n57\n \nInterest Rate Swaps\nDefined Benefit Pension Plans\nForeign Currency Translation Adjustments\nTotal\nBalance - December 31, 2022\n$\n(\n39,248\n)\n$\n(\n4,247\n)\n$\n(\n58,115\n)\n$\n(\n101,610\n)\nOther comprehensive income (loss) activity during the year:\n   Change in AOCI/L before reclassifications to income\n—\n \n(\n1,616\n)\n11,677\n \n10,061\n \n   Reclassifications from AOCI/L to income (2), (3)\n15,086\n \n132\n \n—\n \n15,218\n \nOther comprehensive income (loss), net for the year\n15,086\n \n(\n1,484\n)\n11,677\n \n25,279\n \nBalance - December 31, 2023\n$\n(\n24,162\n)\n$\n(\n5,731\n)\n$\n(\n46,438\n)\n$\n(\n76,331\n)\n(1)\nAmounts in parentheses represent debits (deferred losses).\n(2)\n$\n19.1\n million and $\n20.1\n million of the reclassifications related to interest rate swaps (cash flow hedges) were recorded in Interest expense for the year ended December 31, 2024 and 2023, respectively. See Note 6 — Debt and Note 13 — Derivatives and Hedging for information regarding the cash flow hedges.\n(3)\nThe reclassifications related to defined benefit pension plans were primarily recorded in Selling, general and administrative expense, net of tax effect. See Note 15 — Employee Benefits for information regarding the Company’s defined benefit pension plans.\nThe estimated net amount of the existing losses on the Company’s interest rate swaps that are reported in Accumulated other comprehensive loss, net at December 31, 2024 that is expected to be reclassified into earnings within the next 12 months is $\n9.8\n million.\n \nNote 9 — \nRevenue and Related Matters\nOur Business and Revenues\nGartner delivers its products and services globally through \nthree\n business segments – Research, Conferences and Consulting, as described below.\nResearch\nResearch equips executives and their teams from every function and across all industries with actionable, objective insight, guidance and tools. Our experienced experts deliver all this value informed by a combination of practitioner-sourced and data-driven research to help our clients address their mission critical priorities.\nResearch revenues are mainly derived from subscription contracts for research products, representing approximately \n94\n% of the segment’s revenue. The related revenues are deferred and recognized ratably over the applicable contract term (i.e., as services are provided over the contract period). Fees derived from assisting organizations in selecting the right business software for their needs are recognized at a point in time (i.e., when the lead is provided to the vendor).\nThe Company enters into subscription contracts for research products that generally are for twelve-month periods or longer. Approximately \n80\n% to \n85\n% of the Company’s annual and multi-year Research subscription contracts provide for billing of the first full service period upon signing. In subsequent years, multi-year subscription contracts are normally billed prior to the contract’s anniversary date. Other Research subscription contracts are usually invoiced in advance, commencing with the contract signing, on (i) a quarterly, monthly or other recurring basis or (ii) in accordance with a customized invoicing schedule. Research contracts are generally non-cancelable and non-refundable, except for government contracts that may have cancellation or fiscal funding clauses, which have not historically resulted in material cancellations. It is the Company’s policy to record the amount of a subscription contract that is billable as a fee receivable at the time the contract is signed with a corresponding amount as deferred revenue because the contract represents a legally enforceable claim.\nConferences\nConferences provides executives and teams across an organization the opportunity to learn, share and network. From our Gartner Symposium/Xpo series, to industry-leading conferences focused on specific business roles and topics, to peer-driven sessions, our offerings enable attendees to experience the best of Gartner insight and guidance.\n58\nThe Company earns revenues from both the attendees and exhibitors at Gartner conferences and meetings. Attendees are generally invoiced for the full attendance fee upon their completion of an online registration form or their signing of a contract, while exhibitors typically make several individual payments commencing with the signing of a contract. Almost all of the invoiced amounts are collected in advance of the related activity, resulting in the recording of deferred revenue. Both the attendee and exhibitor revenues are recognized as the related performance obligations are satisfied (i.e., when the related conference is held).\nThe Company defers certain costs directly related to specific conferences and meetings and expenses those costs in the period during which the related activity occurs. The Company’s policy is to defer only those costs that are incremental and directly attributable to a specific activity, primarily prepaid site and production services costs. Other costs of organizing and producing conference activities, primarily Company personnel and non-conference specific expenses, are expensed in the period incurred.\nConsulting \nConsulting serves senior executives leading technology-driven strategic initiatives leveraging the power of Gartner’s actionable, objective insight. Through custom analysis and on-the-ground support we enable optimized technology investments and stronger performance on our clients’ mission critical priorities.\nConsulting revenues, primarily derived from custom consulting and measurement services, are principally generated from fixed fee or time and materials engagements. Revenues from fixed fee engagements are recognized as the Company works to satisfy its performance obligations, while revenues from time and materials engagements are recognized as work is delivered and/or services are provided. In both of these circumstances, performance obligations are satisfied and control of the services is passed to customers over time (i.e., during the duration of the contract or consulting engagement). On a contract-by-contract basis, the Company typically uses actual labor hours incurred compared to total expected labor hours to measure the Company’s performance in respect of fixed fee engagements. If labor and other costs on an individual contract are expected to exceed the total contract value or the contract’s funded ceiling amount, the Company reflects an adjustment to the contract’s overall profitability in the period determined. Revenues related to contract optimization engagements are contingent in nature and are only recognized at the point in time when all of the conditions related to their payment have been satisfied.\nConsulting customers are invoiced based on the specific terms and conditions in their underlying contracts. They are typically invoiced after the Company has satisfied some or all of the related performance obligations and the related revenue has been recognized. The Company records fees receivable for amounts that are billed or billable. Contract assets are also recorded representing amounts for which the Company has recognized revenue but lacks the unconditional right to payment as of the balance sheet date due to the required continued performance under the relevant contract, progress billing milestones or other billing-related restrictions.\nDisaggregated Revenue\nDisaggregated revenue by reportable segment is presented in the tables below for the years indicated (in thousands).\nBy Primary Geographic Market\n \n(1)\nYear Ended December 31, 2024\nPrimary Geographic Market\nResearch\nConferences\nConsulting\nTotal\nUnited States and Canada\n$\n3,319,879\n \n$\n354,011\n \n$\n343,840\n \n$\n4,017,730\n \nEurope, Middle East and Africa\n1,209,660\n \n165,306\n \n142,849\n \n1,517,815\n \nOther International\n596,111\n \n63,907\n \n71,848\n \n731,866\n \nTotal revenues \n$\n5,125,650\n \n$\n583,224\n \n$\n558,537\n \n$\n6,267,411\n \nYear Ended December 31, 2023\n59\nPrimary Geographic Market\nResearch\nConferences\nConsulting\nTotal\nUnited States and Canada\n$\n3,275,866\n \n$\n317,531\n \n$\n317,645\n \n$\n3,911,042\n \nEurope, Middle East and Africa\n1,060,959\n \n140,640\n \n130,471\n \n1,332,070\n \nOther International\n550,221\n \n46,993\n \n66,630\n \n663,844\n \nTotal revenues \n$\n4,887,046\n \n$\n505,164\n \n$\n514,746\n \n$\n5,906,956\n \nYear Ended December 31, 2022\nPrimary Geographic Market\nResearch\nConferences\nConsulting\nTotal\nUnited States and Canada\n$\n3,056,096\n \n$\n263,165\n \n$\n300,121\n \n$\n3,619,382\n \nEurope, Middle East and Africa\n1,017,860\n \n88,979\n \n127,820\n \n1,234,659\n \nOther International\n530,835\n \n37,129\n \n53,841\n \n621,805\n \nTotal revenues\n$\n4,604,791\n \n$\n389,273\n \n$\n481,782\n \n$\n5,475,846\n \n(1)\nRevenue is reported based on where the sale is fulfilled.\nThe Company’s revenue is generated primarily through direct sales to clients by domestic and international sales forces and a network of independent international sales agents. Most of the Company’s products and services are provided on an integrated worldwide basis and, because of this integrated delivery approach, it is not practical to precisely separate Company’s revenue by geographic location. Accordingly, revenue information presented in the above tables is based on internal allocations, which involve certain management estimates and judgments.\nBy Timing of Revenue Recognition \nYear Ended December 31, 2024\nTiming of Revenue Recognition\nResearch\nConferences\nConsulting\nTotal\nTransferred over time (1)\n$\n4,820,943\n \n$\n—\n \n$\n420,160\n \n$\n5,241,103\n \nTransferred at a point in time (2)\n304,707\n \n583,224\n \n138,377\n \n1,026,308\n \nTotal revenues \n$\n5,125,650\n \n$\n583,224\n \n$\n558,537\n \n$\n6,267,411\n \nYear Ended December 31, 2023\nTiming of Revenue Recognition\nResearch\nConferences\nConsulting\nTotal\nTransferred over time (1)\n$\n4,506,621\n \n$\n—\n \n$\n400,171\n \n$\n4,906,792\n \nTransferred at a point in time (2)\n380,425\n \n505,164\n \n114,575\n \n1,000,164\n \nTotal revenues \n$\n4,887,046\n \n$\n505,164\n \n$\n514,746\n \n$\n5,906,956\n \nYear Ended December 31, 2022\nTiming of Revenue Recognition\nResearch\nConferences\nConsulting\nTotal\nTransferred over time (1)\n$\n4,182,747\n \n$\n—\n \n$\n378,062\n \n$\n4,560,809\n \nTransferred at a point in time (2)\n422,044\n \n389,273\n \n103,720\n \n915,037\n \nTotal revenues\n$\n4,604,791\n \n$\n389,273\n \n$\n481,782\n \n$\n5,475,846\n \n(1)\nResearch revenues were recognized in connection with performance obligations that were satisfied over time using a time-elapsed output method to measure progress. Consulting revenues were recognized over time using labor hours as an input measurement basis. \n(2)\nThe revenues in this category were recognized in connection with performance obligations that were satisfied at the point in time that the contractual deliverables were provided to the customer.\n60\nDetermining a measure of progress for performance obligations that are satisfied over time and when control transfers for performance obligations that are satisfied at a point in time requires management to make judgments that affect the timing of revenue recognition. A key factor in this determination is when the customer can direct the use of, and can obtain substantially all of the benefits from, the deliverable.\nFor performance obligations recognized in accordance with a time-elapsed output method, the Company’s efforts are expended consistently throughout the contractual period and the Company transfers control evenly by providing stand-ready services. For performance obligations satisfied under Consulting fixed fee or time and materials engagements, the Company believes that labor hours are the best measure of depicting the Company’s progress because labor output corresponds directly to the value of the Company’s performance to date as control is transferred.\nFor customer contracts that are greater than one year in duration, the aggregate amount of the transaction price allocated to performance obligations that are unsatisfied (or partially unsatisfied) as of December 31, 2024 was approximately $\n6.4\n billion. The Company expects to recognize $\n3.7\n billion, $\n2.1\n billion and $\n600.0\n million of this revenue (most of which pertains to Research) during the year ending December 31, 2025, the year ending December 31, 2026 and thereafter, respectively. The Company applies a practical expedient allowed in ASC 606 and, accordingly, it does not disclose such performance obligation information for customer contracts that have original durations of one year or less. The Company’s performance obligations for contracts meeting this ASC 606 disclosure exclusion primarily include: (i) stand-ready services under Research subscription contracts; (ii) holding conferences and meetings where attendees and exhibitors can participate; and (iii) providing customized Consulting solutions for clients under fixed fee or time and materials engagements. The remaining duration of these performance obligations is generally less than one year, which aligns with the period that the parties have enforceable rights and obligations under the affected contracts.\nCustomer Contract Assets and Liabilities\nThe payment terms and conditions in the Company’s customer contracts vary. In some cases, customers prepay and, in other cases, after the Company conducts a credit evaluation, payment may be due in arrears. Because the timing of the Company’s service delivery typically differs from the timing of customer payments, the Company recognizes either a contract asset (the Company performs either fully or partially under the contract but a contingency remains) or a contract liability (upfront customer payments precede the Company’s performance, resulting in deferred revenue). Amounts recorded as contract assets are reclassified to fees receivable when all of the outstanding conditions have been resolved and the Company’s right to payment becomes unconditional. Contracts with payments due in arrears are also recognized as fees receivable. As contractual performance obligations are satisfied, the Company correspondingly relieves its contract liabilities and records the associated revenue.\nThe table below provides information regarding certain of the Company’s balance sheet accounts that pertain to its contracts with customers (in thousands).\nDecember 31,\n2024\n2023\nAssets:\nFees receivable, gross (1)\n$\n1,704,725\n \n$\n1,610,228\n \nContract assets recorded in Prepaid expenses and other current assets (2)\n$\n31,056\n \n$\n28,791\n \nContract liabilities:\nDeferred revenues (current liability) (3)\n$\n2,762,927\n \n$\n2,640,515\n \nNon-current deferred revenues recorded in Other liabilities (3)\n27,389\n \n33,490\n \nTotal contract liabilities\n$\n2,790,316\n \n$\n2,674,005\n \n(1)\nFees receivable represent an unconditional right of payment from the Company’s customers and include both billed and unbilled amounts.\n(2)\nContract assets represent recognized revenue for which the Company does not have an unconditional right to payment as of the balance sheet date because the project may be subject to a progress billing milestone or some other billing restriction.\n(3)\nDeferred revenues represent amounts (i) for which the Company has received an upfront customer payment or (ii) that pertain to recognized fees receivable. Both situations occur before the completion of the Company’s performance obligation(s).\n61\nThe Company recognized revenue of $\n2.3\n billion, $\n2.0\n billion and $\n1.9\n billion during 2024, 2023 and 2022 respectively, which was attributable to deferred revenues that were recorded at the beginning of each such year. Those amounts primarily consisted of (i) Research revenues and (ii) Conferences revenues pertaining to conferences and meetings that occurred during the reporting periods. During 2024, 2023 and 2022, the Company did not record any material impairments related to its contract assets.\nCosts of Obtaining and Fulfilling a Customer Contract\nWhen the Company concludes that a liability should be recognized for the costs of obtaining a customer contract and determines how such liability should be measured, certain commissions are capitalized as a recoverable direct incremental cost of obtaining the underlying contract. No other amounts are capitalized as a cost of obtaining or fulfilling a customer contract because no expenditures have been identified that meet the requisite capitalization criteria. For Research and Consulting, the Company amortizes deferred commissions on a systematic basis that aligns with the transfer to customers of the services to which the commissions relate. For Conferences, deferred commissions are expensed during the period when the related conference or meeting occurs.\nDuring 2024, 2023 and 2022, deferred commission amortization expense was $\n574.3\n million, $\n550.5\n million and $\n562.1\n million, respectively, and was included in Selling, general and administrative expense in the Consolidated Statements of Operations. The Company classifies Deferred commissions as a current asset on the Consolidated Balance Sheets at both December 31, 2024 and 2023 because those costs were, or will be, amortized over the twelve months following the respective balance sheet dates.\n \nNote 10 — \nStock-Based Compensation\nThe Company grants stock-based compensation awards as an incentive for employees and directors to contribute to the Company’s long-term success. The Company currently awards stock-settled stock appreciation rights, service-based and performance-based restricted stock units, and common stock equivalents. As of December 31, 2024, the Company had \n5.6\n million shares of its common stock, par value $\n0.0005\n per share, (the “Common Stock”) available for stock-based compensation awards under its Long-Term Incentive Plan as amended and restated in June 2023 (the “Plan”). Currently, the Company issues treasury shares upon the exercise, release or settlement of stock-based compensation awards.\nDetermining the appropriate fair value model and calculating the fair value of stock-based compensation awards requires the use of certain subjective assumptions, including the expected life of a stock-based compensation award and Common Stock price volatility. In addition, determining the appropriate periodic stock-based compensation expense requires management to estimate the likelihood of the achievement of certain performance targets. The assumptions used in calculating the fair values of stock-based compensation awards and the related periodic expense represent management’s best estimates, which involve inherent uncertainties and the application of judgment. As a result, if circumstances change and the Company deems it necessary in the future to modify the assumptions it made or to use different assumptions, or if the quantity and nature of the Company’s stock-based compensation awards changes, then the amount of expense may need to be adjusted and future stock-based compensation expense could be materially different from what has been recorded in the current year.\nStock-Based Compensation Expense\nThe tables below summarize the Company’s stock-based compensation expense by award type and expense category line item during the years ended December 31 (in millions).\nAward type\n2024\n2023\n2022\nStock appreciation rights\n$\n13.5\n \n$\n10.5\n \n$\n8.8\n \nRestricted stock units (1)\n140.2\n \n118.2\n \n81.0\n \nCommon stock equivalents\n1.1\n \n1.1\n \n0.8\n \nTotal (1)\n$\n154.8\n \n$\n129.8\n \n$\n90.6\n \nExpense category line"
  }
}