{
  "ticker": "ITW",
  "cik": "0000049826",
  "company_name": "ILLINOIS TOOL WORKS INC",
  "filing_date": "2025-02-14",
  "accession": "0000049826-25-000007",
  "primary_doc": "itw-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n85\nSignatures\n86\nPART I\nITEM 1.\n \nBusiness\nGeneral\nIllinois Tool Works Inc. (the \"Company\" or \"ITW\") was founded in 1912 and incorporated in 1915. The Company's ticker symbol is ITW. The Company is a global manufacturer of a diversified range of industrial products and equipment with 86 divisions in 51 countries. As of December 31, 2024, the Company employed approximately 44,000 people.\nThe Company's operations are organized and managed based on similar product offerings and end markets, and are reported to senior management as the following seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products. The following is a description of the Company's seven segments:\nAutomotive OEM\n— This segment is a global, niche supplier to top tier OEMs, providing unique innovation to address pain points for sophisticated customers with complex problems. Businesses in this segment produce components and fasteners for automotive-related applications. This segment primarily serves the automotive original equipment manufacturers and tiers market. Products in this segment include:\n•\nplastic and metal components, fasteners and assemblies for automobiles, light trucks and other industrial uses.\nFood Equipment\n— This segment is a highly focused and branded industry leader in commercial food equipment differentiated by innovation and integrated service offerings. This segment primarily serves the food service, food retail and food institutional/restaurant markets. Products in this segment include:\n•\nwarewashing equipment;\n•\ncooking equipment, including ovens, ranges and broilers;\n•\nrefrigeration equipment, including refrigerators, freezers and prep tables;\n•\nfood processing equipment, including slicers, mixers and scales;\n•\nkitchen exhaust, ventilation and pollution control systems; and\n•\nfood equipment service, maintenance and repair.\nTest & Measurement and Electronics\n— This segment is a branded and innovative producer of test and measurement and electronic manufacturing and maintenance, repair, and operations, or \"MRO\" solutions that improve efficiency and quality for customers in diverse end markets. Businesses in this segment produce equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. This segment primarily serves the electronics, general industrial, automotive original equipment manufacturers and tiers, energy, industrial capital goods and consumer durables markets. Products in this segment include:\n•\nequipment, consumables, and related software for testing and measuring of materials, structures, gases and fluids;\n•\nelectronic assembly equipment;\n•\nelectronic components and component packaging;\n•\nstatic control equipment and consumables used for contamination control in clean room environments; and\n•\npressure sensitive adhesives and components for electronics, medical, transportation and telecommunications applications.\nWelding\n— This segment is a branded value-added equipment and specialty consumable manufacturer with innovative and leading technology. Businesses in this segment produce arc welding equipment, consumables and accessories for a wide array of industrial and commercial applications. This segment primarily serves the general industrial market, which includes fabrication, shipbuilding and other general industrial markets, and construction, energy, MRO, industrial capital goods and automotive original equipment manufacturers and tiers markets. Products in this segment include:\n•\narc welding equipment; and\n•\nmetal arc welding consumables and related accessories.\n3\nPolymers & Fluids\n— This segment is a branded supplier to niche markets that require value-added, differentiated products. Businesses in this segment produce engineered adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. This segment primarily serves the automotive aftermarket, general industrial and MRO markets. Products in this segment include:\n•\nadhesives for industrial, construction and consumer purposes;\n•\nchemical fluids which clean or add lubrication to machines;\n•\nepoxy and resin-based coating products for industrial applications;\n•\nhand wipes and cleaners for industrial applications;\n•\nfluids, polymers and other supplies for auto aftermarket maintenance and appearance;\n•\nfillers and putties for auto body repair; and\n•\npolyester coatings and patch and repair products for the marine industry.\nConstruction Products\n— This segment is a branded supplier of innovative engineered fastening systems and solutions. This segment primarily serves the residential construction, renovation/remodel and commercial construction markets. Products in this segment include:\n•\nfasteners and related fastening tools for wood and metal applications;\n•\nanchors, fasteners and related tools for concrete applications;\n•\nmetal plate truss components and related equipment and software; and\n•\npackaged hardware, fasteners, anchors and other products for retail.\nSpecialty Products\n— This segment is focused on diversified niche market opportunities with substantial patent protection producing beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. This segment primarily serves the food and beverage, consumer durables, general industrial, airlines, industrial capital goods and printing and publishing markets. Products in this segment include:\n•\nconveyor systems and line automation for the food and beverage industries;\n•\nplastic consumables that multi-pack cans and bottles and related equipment;\n•\nfoil, film and related equipment used to decorate consumer products;\n•\nproduct coding and marking equipment and related consumables;\n•\nplastic and metal closures and components for appliances;\n•\nairport ground support equipment; and\n•\ncomponents for medical devices.\nThe information set forth below is applicable to all segments of the Company unless otherwise noted.\nThe ITW Business Model\nThe powerful and highly differentiated ITW Business Model is the Company's core source of value creation. It is the Company's competitive advantage and defines how ITW creates value for its shareholders. The ITW Business Model is comprised of three unique elements:\n•\nITW's \n80/20 Front-to-Back\n process is the operating system that is applied in every ITW business. Initially introduced as a manufacturing efficiency tool in the 1980s, ITW has continually refined, improved and expanded 80/20 into a proprietary, holistic business management process that generates significant value for the Company and its customers. Through the application of data driven insights generated by 80/20 practice, ITW focuses on its largest and best opportunities (the \"80\") and eliminates cost, complexity and distractions associated with the less profitable opportunities (the \"20\"). 80/20 enables ITW businesses to consistently achieve world-class operational excellence in product availability, quality, and innovation, while generating superior financial performance;\n•\nCustomer-back Innovation\n has fueled decades of profitable growth at ITW. The Company's unique innovation approach is built on insight gathered from the 80/20 Front-to-Back process. Working from the customer back, ITW businesses position themselves as the go-to problem solver for their \"80\" customers. ITW's innovation efforts are focused on understanding customer needs, particularly those in \"80\" markets with solid long-term growth fundamentals, and creating unique solutions to address those needs. These customer insights and learnings drive innovation at ITW and have contributed to a portfolio of approximately 20,900 granted and pending patents;\n4\n•\nITW's \nDecentralized, Entrepreneurial Culture\n enables ITW businesses to be fast, focused, and responsive. ITW businesses have significant flexibility within the framework of the ITW Business Model to customize their approach in order to best serve their specific customers' needs. ITW colleagues recognize their unique responsibilities to execute the Company's strategy and values. As a result, the Company maintains a focused and simple organizational structure that, combined with outstanding execution, delivers best-in-class services and solutions adapted to each business' customers and end markets.\nENTERPRISE STRATEGY: 2012 - 2023\nIn late 2012, ITW began its strategic framework transitioning the Company to fully leverage the unique and powerful set of capabilities and operating practices of the ITW Business Model. The Company undertook a complete review of its performance, focusing on its businesses delivering consistent above-market growth with best-in-class margins and returns, and developing a strategy to replicate that performance across its operations. ITW determined that solid and consistent above-market organic growth is the core growth engine to deliver world-class financial performance and compelling long-term returns for its shareholders.\nKey initiatives in the Company's enterprise strategy included portfolio management, business structure simplification, strategic sourcing and the diligent re-application of ITW's proprietary 80/20 Front-to-Back process.\n•\nAs part of the Portfolio Management initiative, ITW exited businesses that were operating in commoditized market spaces and prioritized sustainable differentiation as a must-have requirement for all ITW businesses. This process included both divesting entire businesses and exiting commoditized product lines and customers inside otherwise highly differentiated ITW divisions.\n•\nBusiness Structure Simplification was implemented to simplify and scale up ITW's operating structure to support increased engineering, marketing, and sales resources, and improve global reach and competitiveness, all of which were critical to driving accelerated organic growth. ITW now has 86 scaled-up divisions with significantly enhanced focus on growth investments, core customers and products, and customer-back innovation.\n•\nThe Strategic Sourcing initiative established sourcing as a core strategic and operational capability at ITW, delivering an average of one percent reduction in spend each year since 2013 and continues to be a key contributor to the Company's ongoing enterprise strategy.\n•\nWith the initial portfolio realignment and scale-up work largely completed, the Company shifted its focus to preparing for and accelerating organic growth, reapplying the 80/20 Front-to-Back process to optimize its scaled-up divisions for growth, first, to build a foundation of operational excellence, and second, to identify the best opportunities to drive organic growth.\nSince implementing the Company's enterprise strategy in 2012, the Company has demonstrated the compelling performance potential of the ITW Business Model and superior 80/20 management, resulting in meaningful incremental improvement in margins and returns as evidenced by the Company's operating margin and after-tax return on invested capital. At the same time, these 80/20 initiatives may also result in restructuring initiatives that reduce costs and improve profitability and returns.\nOUR NEXT PHASE: 2024 - 2030\nIn the Next Phase of the Company’s evolution, the ITW Business Model and the Enterprise Strategy framework will be as formidable of a competitive advantage and performance differentiator as it has been over the last decade, if not more so. Volatility, risk and the pace of change in the global operating environment will continue to increase, and a decentralized entrepreneurial culture allows the Company to be a fast adaptor – to read, react, respond and evolve. The Company’s ability to consistently execute and invest through the ups and downs of the business cycle is now a defining competitive advantage.\nThroughout the Next Phase, the Company's focus is to build organic growth into a core ITW strength on par with the Company’s world-class financial performance and operational capabilities. Throughout this phase, the Company will sustain its foundational strengths built over the past decade, including the high-quality ITW Business Model practice. Customer-back Innovation (\"CBI\") is the most impactful driver to achieve high-quality organic growth through the cycle by establishing trusted problem solver relationships with key customers to effectively invent solutions that address customers' most critical pain points or tackle the biggest growth opportunities. CBI successes, coupled with underlying market growth and share gains, are how the Company intends to achieve its high-quality organic growth\n.\n5\nPortfolio Discipline\nThe Company only operates in industries where it can generate significant, long-term competitive advantage from the ITW Business Model. ITW businesses have the right \"raw material\" in terms of market and business attributes that best fit the ITW Business Model and have significant potential to drive above-market organic growth over the long-term.\nThe Company focuses on high-quality businesses, ensuring it operates in markets with positive long-term macro fundamentals and with customers that have critical needs and value ITW's differentiated products, services and solutions. ITW's portfolio operates in highly diverse end markets and geographies which makes the Company more resilient in the face of uncertain or volatile market environments.\nThe Company routinely evaluates its portfolio to ensure it delivers sustainable differentiation and drives consistent long-term performance. This includes both implementing portfolio refinements and assessing selective high-quality acquisitions to supplement ITW's long-term growth potential.\nIn the second quarter of 2022, plans were approved to divest two businesses, including one business in the Polymers & Fluids segment and one business in the Food Equipment segment. In the fourth quarter of 2022, both of these businesses were divested. The business in the Polymers & Fluids segment was sold for $220 million, subject to certain closing adjustments, resulting in a pre-tax gain of $156 million. The business in the Food Equipment segment was sold for $59 million, subject to certain closing adjustments, resulting in a pre-tax gain of $41 million. Operating revenue related to these divested businesses that was included in the Company's results of operations for the twelve months ended December 31, 2022 was $106 million.\nIn the fourth quarter of 2022, plans were approved to divest one business in the Specialty Products segment. This business was presented as held for sale beginning in the fourth quarter of 2022. This business was sold on April 3, 2023, with no significant gain or loss upon sale. Operating revenue related to this business that was included in the Company's results of operations was $9 million and $37 million for the twelve months ended December 31, 2023 and 2022, respectively. Refer to Note 3. Divestitures in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's divestitures.\nOn January 2, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $57 million, net of cash acquired. On April 1, 2024, the Company completed the acquisition of one business in the Test & Measurement and Electronics segment for $59 million, net of cash acquired. The purchase price for both acquisitions was subject to certain closing adjustments. These acquisitions were not material, individually or in the aggregate, to the Company’s results of operations, financial position or cash flows. Refer to Note 2. Acquisitions in Item 8. Financial Statements and Supplementary Data for further information regarding the Company's acquisitions.\nOn August 5, 2024, the Company entered into a purchase agreement with affiliates of Clayton, Dubilier & Rice, LLC (\"CD&R\") for the sale of the Company’s noncontrolling equity interest in Wilsonart International Holdings LLC (\"Wilsonart\") for $398 million. The transaction closed immediately after the execution of the purchase agreement. Proceeds from the transaction, net of transaction costs, were $395 million, resulting in a pre-tax gain of $363 million which was included in Other income (expense) in the Statement of Income. Income taxes on the gain were more than offset by a discrete tax benefit of $107 million in the third quarter of 2024 related to the utilization of capital loss carryforwards upon the sale of Wilsonart. The sale of the Company’s equity interest in Wilsonart is not expected to have a material impact on the Company’s financial results in subsequent periods. Refer to Note 5. Other Income (Expense) and Note 6. Income Taxes in Item 8. Financial Statements and Supplementary Data for additional information regarding this transaction.\n80/20 Front-to-Back Practice Excellence\nITW will continue to drive 80/20 Front-to-Back practice excellence in every division in the Company, every day. Driving strong operational excellence in the quality of 80/20 Front-to-Back practice across the Company, division by division, will produce further customer-facing performance improvement in a number of divisions and additional structural margin expansion at the enterprise level.\nCurrent Year Developments\nRefer to Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\n6\nDistribution Methods\nThe Company's businesses primarily distribute their products directly to industrial manufacturers and through independent distributors.\nBacklog\nBacklog generally is not considered a significant factor in the Company's businesses as relatively short delivery periods and rapid inventory turnover are characteristic of most of their products.\nCompetition\nWith operations in 51 countries, the Company offers a wide range of products in a myriad of markets, many of which are fragmented, and the Company encounters a variety of competitors that vary by product line, end market and geographic area. The Company's competitors include many regional or specialized companies, as well as large U.S. and non-U.S. companies or divisions of large companies. Each of the Company's segments generally has several main competitors and numerous smaller ones in most of their end markets and geographic areas. In addition to numerous smaller regional competitors, the Welding segment competes globally with Lincoln Electric Holdings, Inc. and ESAB Corporation.\nIn virtually all segments, the Company differentiates its businesses from its competitors based on product innovation, product quality, brand preference and service delivery. Technical capability is also a competitive factor in most segments. The Company believes that each segment's primary competitive advantages derive from the ITW Business Model and decentralized operating structure, which creates a strong focus on end markets and customers at the local level, enabling its businesses to respond rapidly to market dynamics. This structure enables the Company's businesses to drive operational excellence utilizing the Company's 80/20 Front-to-Back process and leveraging its product innovation capabilities. The Company also believes that its global footprint is a competitive advantage in many of its markets, especially in its Automotive OEM segment.\nRaw Materials\nThe Company uses raw materials of various types, primarily steel, resins and chemicals, that are available from numerous commercial sources. The availability of materials and energy has not resulted in any significant business interruptions or other major problems, and no such problems are currently anticipated.\nIntellectual Property\nThe Company owns approximately 4,100 unexpired U.S. patents and 10,500 unexpired foreign patents covering articles, methods and machines. In addition, the Company has approximately 1,500 applications for patents pending in the U.S. Patent Office and 4,800 applications pending in foreign patent offices. There is no assurance that any of these patents will be issued. The Company maintains a patent group for the administration of patents and processing of patent applications.\nThe Company believes that many of its patents are valuable and important; however, the expiration of any one of the Company's patents would not have a material effect on the Company's results of operations or financial position. The Company also credits its success in the markets it serves to engineering capability; manufacturing techniques; skills and efficiency; marketing and sales promotion; and service and delivery of quality products to its customers.\nIn addition to patents, many of the Company's products and services are sold under various owned or licensed trademarks, which are important to the Company in the aggregate. Some of the Company's more significant trademarks include ITW, which is also used in conjunction with the trademarks of many of the Company's businesses; Deltar and Shakeproof in the Automotive OEM segment; Hobart in the Food Equipment segment; Instron and MTS in the Test & Measurement and Electronics segment; Miller in the Welding segment; Rain-X and Permatex in the Polymers & Fluids segment; Paslode in the Construction Products segment; and Hi-Cone in the Specialty Products segment.\n7\nGovernment Regulations\nThe Company believes that its businesses and operations, including its manufacturing plants and equipment, are in substantial compliance with all applicable government laws and regulations, including those related to environmental, consumer protection, international trade, labor and employment, human rights, tax, anti-bribery and competition matters. Any additional measures to maintain compliance are not expected to materially affect the Company's capital expenditures (including expenditures for environmental control facilities), competitive position, financial position or results of operations.\nVarious legislative and administrative regulations applicable to the Company in the matters noted above have become effective or are under consideration in many parts of the world. To date, such developments have not had a substantial adverse impact on the Company's revenues, earnings or cash flows. However, if new or amended laws or regulations impose significant operational restrictions and compliance requirements upon the Company or its products, the Company's business, capital expenditures, results of operations, financial condition and competitive position could be negatively impacted. Refer to",
    "item1a": "Item 1A. Risk Factors.\nCybersecurity risk management is part of the Company's global enterprise risk management program\n. In order to manage the risks associated with cybersecurity threats, the Company has implemented a risk-based cybersecurity program consisting of processes, technologies, and controls to assess, identify and manage material risks from cybersecurity threats.\n \nA key part of the Company’s cybersecurity program is the ITW Cybersecurity Framework, which is based on the National Institute of Standards and Technology’s Cybersecurity Framework (\"CSF\") and is designed to protect the Company’s data through rapid identification of and effective response to cybersecurity incidents. The Company’s framework includes detailed processes and controls related to backup and recovery, response planning, awareness, vulnerability management and endpoint protection as well as cybersecurity requirements for third-party service providers. \nThe framework is regularly reviewed, assessed, and updated based on input from third party specialists, threat intelligence firms and CSF standard updates.\nThe ITW Cybersecurity Framework includes a number of activities designed to enhance the Company's resiliency related to cyber-related risks and ensure that the Company's information systems are secure from material cybersecurity threats. These activities include the following, among others:\n•\nAnnual cybersecurity training;\n•\nQuarterly phish simulation testing;\n•\nOngoing response planning and tabletop exercises;\n•\nNetwork/endpoint protection, monitoring and response;\n•\nVulnerability management and\n•\nBackup and recovery testing.\nWhile the Company's information systems are exposed to cybersecurity threats and risks, the Company has not experienced any material cybersecurity incidents during 2024, 2023 or 2022, and any costs or operational impacts related to cybersecurity incidents were immaterial during this period.\nGovernance\nITW's Board of Directors is responsible for providing oversight and strategic guidance to management to support the long-term interests of the Company's stakeholders. As part of this responsibility, the Board of Directors annually reviews and evaluates the Company's cybersecurity policies and practices with respect to risk management as well as steps taken by management to monitor and control such exposures.\nIn addition to oversight by the Board of Directors, several cross-functional management teams focus on cybersecurity risk and report any identified cybersecurity incidents. Each of the Company's divisions has a Division Cyber Incident Response Team and protocols in place to communicate cybersecurity incidents to a central Cyber Incident Response Team. The Cyber Incident Response Team is led by the \nChief Information Security Officer\n (\"CISO\") and is responsible for the initial assessment of cybersecurity incidents and oversight of any incident response.\n15\nThe Company’s cybersecurity program is overseen by a dedicated global team of cybersecurity professionals, led by the CISO who brings over 20 years of information technology and cybersecurity leadership experience and holds the Certified Information Security Manager (\"CISM\") designation.\n The CISO reports directly to the Chief Information Officer (\"CIO\") and is responsible for leading the execution of the Company's cybersecurity strategy.\nOn a quarterly basis, or sooner if appropriate, cybersecurity incidents are summarized and reported to the Cybersecurity Governance Committee comprised of senior executives. Additionally, the \nAudit Committee of the Board of Directors\n receives quarterly cybersecurity reports from senior management which cover any identified cybersecurity incidents, results of third party vulnerability testing, and key developments in policies and practices during the quarter.",
    "item1b": "ITEM 1B.\n \nUnresolved Staff Comments\nNone.",
    "item1c": "ITEM 1C.\n \nCybersecurity\nRisk Management and Strategy\nThe Company utilizes information systems to support a variety of business processes and activities in its decentralized operations. These systems may be subject to cyber-based attacks or breaches. For additional information related to the risks associated with cybersecurity threats, refer to the Business and Operational Risks section of"
  }
}