{
  "ticker": "IVZ",
  "cik": "0000914208",
  "company_name": "Invesco Ltd.",
  "filing_date": "2025-02-25",
  "accession": "0000914208-25-000114",
  "primary_doc": "ivz-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business - Risk Management section contains a broader discussion of the company's overall approach to risk management. \nCredit and Liquidity Risk \nThe company manages its capital by reviewing annual and projected cash flow forecasts and by monitoring credit, liquidity and market risks, such as interest rate and foreign currency risks (as discussed in Item 7A, “Quantitative and Qualitative Disclosures About Market Risk”), through measurement and analysis. \nCredit Risk\nCredit risk is the risk that one party to a financial instrument will cause a financial loss for the other party by failing to meet an obligation. The company is primarily exposed to credit risk through its cash and cash equivalent deposits, which are held by external firms. The company invests its cash balances in its own institutional money market products, as well as with external high credit-quality financial institutions. These arrangements create exposure to concentrations of credit risk. As of December 31, 2024, our maximum exposure to credit risk related to our Cash and cash equivalent balances is $986.5 million, of which $479.3 million is invested in affiliated money market funds. See Part II, Item 8, Financial Statements and Supplementary Data - Note 2, \"Fair Value of Assets and Liabilities\" for information regarding Cash and cash equivalents invested in affiliated money market funds.\n56\nTable of Contents\n    \n                                 \nLiquidity Risk\nLiquidity risk is the risk that the company will encounter difficulty in meeting obligations associated with its financial liabilities as the same become due. The company is exposed to liquidity risk through its $890.6 million in total debt. The company actively manages liquidity risk by preparing cash flow forecasts for future periods, reviewing them regularly with senior management, maintaining a committed revolving credit agreement, scheduling significant gaps between major debt maturities and engaging external financing sources in regular dialogue.\nEffects of Inflation\nInflation can impact our organization primarily in two ways. First, inflationary pressures can result in increases in our cost structure, especially to the extent that large expense components such as compensation are impacted. To the degree that these expense increases are not recoverable or cannot be counterbalanced through pricing increases due to the competitive environment, our net income could be negatively impacted. Secondly, the value of the assets that we manage may be negatively impacted when inflationary expectations result in a rising interest rate environment. A decline in the value of AUM could lead to reduced revenues as management fees are generally calculated based upon the value of AUM.\nOff Balance Sheet Commitments\nSee Part II, Item 8, Financial Statements and Supplementary Data - Note 17, “Commitments and Contingencies,” for more information regarding undrawn capital commitments.\nCritical Accounting Policies and Estimates\nOur significant accounting policies are disclosed in Part II, Item 8, Financial Statements and Supplementary Data - Note 1, “Accounting Policies.\" Critical accounting policies and estimates are those that require complex management judgment regarding matters that are highly uncertain at the time policies were applied and estimates were made. Different estimates reasonably could have been used in the current period that would have had a material effect on these Consolidated Financial Statements, and changes in these estimates are likely to occur from period-to-period in the future. The discussion below provides information on the significant judgments and assumptions applied in each area and should be read in conjunction with the significant accounting policies footnote previously referenced.\nIntangible Assets\nManagement has the option to first assess indefinite-lived intangible assets for qualitative factors to determine whether it is necessary to perform a quantitative impairment test. Definite-lived intangible assets are reviewed for impairment whenever events or changes in circumstances indicate that their carrying amount may not be recoverable (i.e., the carrying amount exceeds the fair value of the intangible asset). In addition, management's judgment is required to estimate the period over which definite-lived intangible assets will contribute to the company's cash flows and the pattern in which these assets will be consumed. A change in the remaining useful life of any of these assets, or the reclassification of an indefinite-lived intangible asset to a definite-lived intangible asset, could have a significant impact on the company's amortization expense. \nIntangible assets not subject to amortization are tested for impairment annually as of October 1 or more frequently if events or changes in circumstances indicate that the asset might be impaired. If a quantitative assessment is required, the impairment test consists of a comparison of the fair value of an intangible asset to its carrying amount. If the carrying amount of the intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. Management used an income approach to value indefinite-lived intangible assets related to acquired management contracts of U.S. retail mutual funds. An income approach includes assumptions for current market conditions, including the asset’s updated forecasts of AUM to take into consideration market gains or losses, net long-term flows and the corresponding changes in revenue and expenses. The most sensitive assumptions used in the income approach are the long-term growth rate and the discount rate applied to the cash flow forecast to determine present value. Taking into consideration the AUM mix of the U.S. retail mutual funds, the long-term growth rate was determined using the historical returns of the S&P 500 index, treasury bonds and treasury bills. The long-term growth rate used by management in the annual impairment test was 2.5% and is consistent with the prior year annual impairment test. The discount rate is an estimate of the weighted average cost of capital for the investment management sector reflecting the overall industry risks associated with future cash flows and considers an applicable size premium for the intangible asset. The discount rate used by management was 12.88%, which declined 17 bps from the prior year primarily due to a decrease in the risk-free rate. We continued to factor an asset-specific risk premium into the discount rate for the U.S. retail mutual fund indefinite-lived intangible assets to account for the uncertainty around future AUM flows given the continued shift \n57\nTable of Contents\n    \n                                 \nin investor preferences away from actively managed funds. We assessed the reasonableness of the estimated fair value of the intangible assets by considering applicable market data.\nBased on our annual impairment analysis as of October 1, 2024, we determined that the estimated fair value of the indefinite-lived intangible assets related to acquired management contracts of U.S. retail mutual funds exceeded its carrying value of $4,572.1 million by $267.4 million or 6%. Headroom increased from the prior year due to favorable market conditions\n \nand a decrease in the discount rate. While the company believes all assumptions utilized in our assessment are reasonable and appropriate, changes in these estimates could produce different fair value amounts which could drive impairment in future periods. For example, assuming all other assumptions remain static, a decrease to the long-term growth rate of 25 bps would decrease headroom to $178.1 million or 3.9%. Also, an increase to the discount rate of 15 bps would decrease headroom to $206.2 million or 4.5%. \nOur annual impairment reviews of our other indefinite-lived intangible assets determined that there was not an impairment of these intangibles. The classifications of indefinite-lived and definite-lived intangible assets remain appropriate, and no changes to the expected lives of definite-lived intangible assets were required.\nGoodwill\nManagement has the option to first assess goodwill for qualitative factors to determine whether it is necessary to perform a quantitative impairment test. We performed a quantitative annual impairment test as of October 1, 2023 and determined that the estimated fair value of the reporting unit exceeded its carrying value by 5%. For our annual impairment test in 2024, management performed the optional qualitative approach. Based on our annual impairment analysis of goodwill as of October 1, 2024, we determined that a quantitative assessment of the goodwill impairment test was not necessary. The qualitative impairment analysis indicated that headroom improved from the prior year impairment test due to improved profitability, favorable market conditions and a decrease in the discount rate. \nThe company cannot predict the occurrence of future events that might adversely affect the reported value of goodwill of $8,318.1 million at December 31, 2024. Such events include, but are not limited to, strategic decisions made in response to economic and competitive conditions or a significant decline in our revenue and operating income due to a change in AUM mix or unfavorable market conditions, including a significant decline in our stock price for an extended period of time. However, an impairment in the future would not impact the company’s liquidity or capital resources.\nIncome Taxes\nThe company files U.S. federal, state and numerous foreign income tax returns. The income tax laws are complex and subject to different interpretations by the taxpayer and the relevant taxing authorities. Significant judgment is required in the determination of our annual income tax provision, which includes the assessment of deferred tax assets and uncertain tax positions, as well as the interpretation and application of existing and newly enacted tax laws, regulation changes and new judicial rulings. Therefore, it is possible that actual results will vary from those recognized in our Consolidated Financial Statements due to changes in the interpretation of applicable guidance or as a result of examinations by taxing authorities.\nDeferred tax assets, net of any associated valuation allowance, have been recognized based on management's belief that taxable income of the appropriate character, more likely than not, will be sufficient to realize the benefits of these assets over time. In the event that actual results differ from our expectations, or if our historical trends of positive operating income changes, we may be required to record a valuation allowance on some or all of these deferred tax assets, which may have a significant effect on our financial condition and results of operations. In assessing whether a valuation allowance should be established against a deferred income tax asset, the company considers all available evidence, which includes the nature, frequency and severity of recent losses, forecasts of future profitability and the duration of statutory carry back and carry forward periods, among other factors.\nIn the assessment of uncertain tax positions, significant judgment is required to estimate the range of possible outcomes and determine the probability, on a more likely than not basis, of favorable or unfavorable outcomes upon ultimate settlement of an issue. Changes in the estimate of uncertain tax positions occur periodically due to changes in interpretations of tax laws, the status of examinations by tax authorities and new regulatory or judicial guidance that could impact the relative merits and risk of tax positions. These changes, when they occur, impact tax expense and can materially impact results of operations. The company recognizes any interest and penalties related to unrecognized tax benefits (UTBs) on the Consolidated Statements of Income as components of income tax expense.\n58\nTable of Contents\n    \n                                 \nCIP\nAssessing if an entity is a variable interest entity (VIE) or voting interest entity (VOE) involves judgment and analysis on a structure-by-structure basis. Factors assessed as part of the analysis include the legal organization of the entity, the company's contractual involvement with the entity and any related party or de facto agent implications of the company's involvement with the entity. If the company is deemed to have the power to direct the activities of the fund that most significantly impact the fund's economic performance and the obligation to absorb losses/right to receive benefits from the fund that could potentially be significant to the fund, then the company is deemed to be the fund's primary beneficiary and is required to consolidate the fund. Assessing if the company has the power to direct the activities that most significantly impact the fund’s economic results may involve significant judgment.\nRecent Accounting Standards\nSee Part II, Item 8, Financial Statements and Supplementary Data - Note 1, “Accounting Policies - Accounting Pronouncements Recently Adopted and Pending Accounting Pronouncements.”\nItem 7A.\n  Quantitative and Qualitative Disclosures About Market Risk\nIn the normal course of its business, the company is primarily exposed to market risk in the form of AUM market price risk, securities market risk, interest rate risk and foreign exchange rate risk. \nAUM Market Price Risk\nThe company's investment management revenues are comprised of fees based on the value of AUM. Declines in the market prices of equity and fixed income securities, commodities and derivatives, or other similar financial instruments held in client portfolios could cause revenues to decline because of lower investment management fees by:\n•\nCausing the value of AUM to decrease. \n•\nCausing the returns realized on AUM to decrease (impacting performance fees). \n•\nCausing clients to withdraw funds in favor of investments in markets that they perceive to offer greater opportunity and that the company does not serve.\n•\nCausing clients to rebalance assets away from investments that the company manages into investments that the company does not manage.\n•\nCausing clients to reallocate assets away from products that earn higher revenues into products that earn lower revenues.\nUnderperformance of client accounts relative to competing products could exacerbate these factors.\nAssuming the revenue yield on AUM for the year remains unchanged, a decline in the average AUM for the year would result in a corresponding decline in revenue. Certain expenses, including distribution and compensation expenses, may not vary in proportion with the changes in the market value of AUM. As such, the impact on operating margin or net income of a decline in the market values of AUM may be greater than the percentage decline in the market value of AUM.\n59\nTable of Contents\n    \n                                 \nSecurities Market Risk\nThe company's exposure to market risk from financial instruments measured at fair value arises primarily from its investments. The following table summarizes the impact of a 10% increase or decrease in the fair values of these financial instruments:\nDecember 31, 2024\n(in millions)\nFair Value\nFair Value assuming 10% increase\nFair Value assuming 10% decrease\nEquity investments \n(1)\n$\n371.2 \n$\n408.3 \n$\n334.1 \nTotal assets measured at fair value exposed to market risk\n$\n371.2 \n$\n408.3 \n$\n334.1 \nNet investments in CIP \n(2)\n$\n401.4 \n$\n441.5 \n$\n361.3 \n____________\n(1)\nIf such a 10% increase or decrease in fair values were to occur, the change attributable to $371.2 million of these equity investments would result in a corresponding increase or decrease in our pre-tax earnings. At December 31, 2024, $219.6 million of these equity investments are held to hedge economically certain deferred compensation plans in which the company's employees participate. In addition to holding equity investments, the company has a total return swap (TRS) to economically hedge certain deferred compensation plan liabilities. The notional value of the TRS at December 31, 2024 was $421.2 million. The company recognizes as compensation expense the appreciation or depreciation of the compensation liability over the award's vesting period in proportion to the vested amount of the award. The company immediately recognizes the appreciation or depreciation of these investments, which is included in other gains and losses. This creates a timing difference between the recognition of the compensation expense and the investment gain or loss impacting net income, which will reverse and will offset to zero over the life of the award at the end of the multi-year vesting period.\n(2)\nUpon consolidation, the company's net investments in CIP are eliminated, and the assets and liabilities of the CIP are consolidated in the Consolidated Balance Sheets, which are offset by a noncontrolling interest balance representing the portion of the CIP owned by third parties. The assets of CIP include investments which are measured at fair value. If a 10% increase or decrease in the fair values of Invesco’s net investments in CIP were to occur, it would result in a corresponding increase or decrease in our Net income attributable to Invesco Ltd.\nCash balances invested in money market funds of $479.3 million have been excluded from the table above. These are valued under the market approach at the NAV of the underlying funds, which is maintained at $1. \nInterest Rate Risk\nInterest rate risk relates to the risk that the fair value of future cash flows of a financial instrument will fluctuate because of changes in market interest rates. The company is exposed to interest rate risk primarily through its external debt and cash and cash equivalent investments. On December 31, 2024, the interest rates on \n100.0%\n of the company's borrowings were fixed for a weighted average period of \n8.9\n years, and the company had a balance of \nzero\n on its \nrevolving\n credit agreement.\nThe interest rate profile of the financial liabilities of the company on December 31 was:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nDebt\nFixed rate\n$\n890.6 \n$\n1,489.5 \nFloating rate\n— \n— \nTotal\n$\n890.6 \n$\n1,489.5 \nWeighted average interest rate percentage\n4.6 \n%\n4.3 \n%\nWeighted average period for which rate is fixed in years\n8.9 \n6.0 \nSee Item 8, Financial Statements and Supplementary Data, Note 8, “Debt,” for additional disclosures relating to the U.S. Dollar floating and fixed rate obligations. \nThe sensitivity of our financial assets to interest rate risk is immaterial. \n60\nTable of Contents\n    \n                                 \nForeign Exchange Rate Risk\nThe company has transactional currency exposures that occur when any of the company’s subsidiaries receive or pay cash in a currency different from its functional currency. Such exposure arises from sales or purchases by operating subsidiaries in currencies other than the subsidiaries’ functional currencies. These exposures are not actively managed.\nIn addition, the net assets and financial results of the company's foreign operations are exposed to foreign currency translation risk when translated into U.S. Dollars upon consolidation into Invesco. A strengthening U.S. Dollar has a negative impact on the company's foreign currency denominated earnings when presented in U.S. Dollars. The company's most significant foreign exchange rate risk exposure relates to the translation of Pound Sterling-denominated and Euro-denominated transactions into the U.S. Dollar reporting curr\nency. Item 8, Financial Statements and Supplementary Data, Note 16, \"Segment and Geographic Information,\" c\nontains disclosure of revenue by geography. \nThe company is also exposed to foreign currency translation risk on monetary assets and liabilities that are held by subsidiaries in different functional currencies than the subsidiaries' functional currencies. The impact of the revaluation is recorded in the Consolidated Statements of Income. Net foreign exchange revaluation gains and losses were zero in 2024 (2023: $0.9 million of losses) and are included in General and administrative expenses and Other gains and losses, net on the Consolidated Statements of Income.\n61\nTable of Contents\n    \n                                 \nItem 8.\n  Financial Statements and Supplementary Data\nIndex to Financial Statements and Supplementary Data\nAnnual Report of Management on Internal Control over Financial Reporting\n63\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n64\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n66\nConsolidated Statements of Income for the years ended December 31, 202\n4\n, 202\n3\n and \n2022\n67\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022\n68\nConsolidated Statements of Cash Flows for the years ended December 31, \n202\n4\n, 202\n3\n and \n202\n2\n69\nConsolidated Statements of Changes in Equity as of and for the years ended December 31, 202\n4\n, 202\n3\n and \n202\n2\n70\nNotes to the Consolidated Financial Statements\n73\n62\nTable of Contents\n    \n                                 \nAnnual Report of Management on Internal Control over Financial Reporting\nManagement of the company is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in the Securities Exchange Act of 1934 Rules 13a-15(f) and 15d-15(f). The company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision, and with the participation of the chief executive officer and chief financial officer, management assessed the effectiveness of the company’s internal control over financial reporting as of December 31, 2024. In making this assessment, management used the criteria set forth by the Internal Control - Integrated Framework (2013) issued by Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, management concluded that the company’s internal control over financial reporting was effective as of December 31, 2024.\nThe company's independent registered public accounting firm, PricewaterhouseCoopers LLP, has issued a report on the effectiveness of our internal control over financial reporting, which is included herein.\n    \n63\nTable of Contents\n    \n                                 \nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Invesco Ltd.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Invesco Ltd. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of changes in equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Annual Report of Management on Internal Control over Financial Reporting appearing under Item 8. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n64\nTable of Contents\n    \n                                 \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nIndefinite-Lived Intangible Assets Impairment Assessment for Acquired Management Contracts of U.S. Retail Mutual Funds\nAs described in Notes 1 and 5 to the consolidated financial statements, the Company’s management contracts indefinite-lived intangible assets, net balance was $5,651.7 million as of December 31, 2024, of which a significant portion relates to indefinite-lived intangible assets related to acquired management contracts of U.S. retail mutual funds. Management tests for impairment annually as of October 1 or more frequently if events or changes in circumstances indicate that the asset might be impaired. If the qualitative assessment indicates that an impairment may be likely or management elects to not perform the qualitative assessment, management performs a quantitative test to determine the fair value of the intangible assets and compares the fair value with its carrying amount. If the carrying amount of the intangible asset exceeds its fair value, an impairment loss is recognized. Fair value is generally determined using an income approach where estimated future cash flows are discounted to arrive at a single present value amount. As disclosed by management, the most sensitive assumptions used in the income approach are the long-term growth rate and the discount rate. \nThe principal considerations for our determination that performing procedures relating to the indefinite-lived intangible assets impairment assessment for acquired management contracts of U.S. retail mutual funds is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of the intangible assets; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to the long-term growth rate and the discount rate; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge. \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s indefinite-lived intangible assets impairment assessment for acquired management contracts of U.S. retail mutual funds, including controls over the valuation of the acquired management contracts of U.S. retail mutual fund indefinite-lived intangible assets. These procedures also included, among others (i) testing management’s process for developing the fair value estimate of the indefinite lived intangible assets; (ii) evaluating the appropriateness of the income approach used by management; (iii) testing the completeness and accuracy of underlying data used in the income approach; and (iv) evaluating the reasonableness of the significant assumptions used by management related to the long-term growth rate and the discount rate. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the income approach and (ii) the reasonableness of the long-term growth rate and discount rate assumptions.\n/s/ \nPricewaterhouseCoopers LLP\nAtlanta, Georgia\nFebruary 25, 2025\nWe have served as the Company’s auditor since 2013.\n65\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Balance Sheets\n(in millions, except per share data)\nDecember 31, 2024\nDecember 31, 2023\nASSETS\nCash and cash equivalents\n$\n986.5\n \n$\n1,469.2\n \nAccounts receivable\n740.8\n \n701.5\n \nInvestments\n1,240.0\n \n919.1\n \nOther assets\n1,120.7\n \n1,226.5\n \nProperty, equipment and software, net\n479.0\n \n599.5\n \nIntangible assets, net\n5,749.3\n \n5,848.1\n \nGoodwill\n8,318.1\n \n8,691.5\n \nInvestments and other assets of CIP\n (1)\n:\n8,374.5\n \n9,478.4\n \nTotal assets\n$\n27,008.9\n \n$\n28,933.8\n \nLIABILITIES\nAccrued compensation and benefits\n$\n1,029.2\n \n$\n900.4\n \nAccounts payable and accrued expenses\n1,285.3\n \n1,688.3\n \nDebt\n890.6\n \n1,489.5\n \nDeferred tax liabilities, net\n1,281.9\n \n1,325.7\n \nDebt and other liabilities of CIP \n(1)\n:\n6,853.1\n \n7,613.9\n \nTotal liabilities\n11,340.1\n \n13,017.8\n \nCommitments and contingencies (See Note 17)\nTEMPORARY EQUITY\nRedeemable noncontrolling interests in consolidated entities\n544.7\n \n745.7\n \nPERMANENT EQUITY\nEquity attributable to Invesco Ltd.:\nPreferred shares ($\n0.20\n par value; $\n1,000\n liquidation preference; \n4.0\n million authorized, issued and outstanding as of December 31, 2024 and 2023)\n4,010.5\n \n4,010.5\n \nCommon shares ($\n0.20\n par value; \n1,050.0\n million authorized; \n566.1\n million shares issued as of December 31, 2024 and 2023)\n113.2\n \n113.2\n \nAdditional paid-in-capital\n7,334.6\n \n7,451.6\n \nTreasury shares\n(\n2,852.7\n)\n(\n3,002.6\n)\nRetained earnings\n6,990.4\n \n6,826.7\n \nAccumulated other comprehensive income/(loss), net of tax\n(\n1,036.1\n)\n(\n801.8\n)\nTotal equity attributable to Invesco Ltd.\n14,559.9\n \n14,597.6\n \nEquity attributable to nonredeemable noncontrolling interests in consolidated entities\n564.2\n \n572.7\n \nTotal permanent equity\n15,124.1\n \n15,170.3\n \nTotal liabilities, temporary and permanent equity\n$\n27,008.9\n \n$\n28,933.8\n \n(1)\n See Note 18, “Consolidated Investment Products,” for balances related to consolidated VIEs.\nSee accompanying notes.\n66\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Statements of Income\nYears ended December 31,\n(in millions, except per common share data)\n2024\n2023\n2022\nOperating revenues:\nInvestment management fees\n$\n4,342.3\n \n$\n4,106.0\n \n$\n4,358.4\n \nService and distribution fees\n1,479.7\n \n1,374.6\n \n1,405.5\n \nPerformance fees\n46.4\n \n46.7\n \n68.2\n \nOther\n198.6\n \n189.1\n \n216.8\n \nTotal operating revenues\n6,067.0\n \n5,716.4\n \n6,048.9\n \nOperating expenses:\nThird-party distribution, service and advisory\n2,025.6\n \n1,825.2\n \n1,886.2\n \nEmployee compensation\n2,014.2\n \n1,885.8\n \n1,725.1\n \nMarketing\n81.3\n \n82.1\n \n94.6\n \nProperty, office and technology\n474.3\n \n450.1\n \n446.7\n \nGeneral and administrative\n594.7\n \n567.6\n \n493.6\n \nTransaction, integration and restructuring\n—\n \n41.6\n \n21.2\n \nAmortization and impairment of intangible assets\n44.8\n \n1,298.8\n \n63.8\n \nTotal operating expenses\n5,234.9\n \n6,151.2\n \n4,731.2\n \nOperating income/(loss)\n832.1\n \n(\n434.8\n)\n1,317.7\n \nOther income/(expense):\nEquity in earnings of unconsolidated affiliates\n43.0\n \n71.3\n \n106.1\n \nInterest and dividend income\n58.9\n \n47.8\n \n24.4\n \nInterest expense\n(\n58.0\n)\n(\n70.5\n)\n(\n85.2\n)\nOther gains/(losses), net\n47.7\n \n98.0\n \n(\n139.5\n)\nOther income/(expense) of CIP, net\n81.6\n \n50.3\n \n24.2\n \nIncome/(loss) before income taxes\n1,005.3\n \n(\n237.9\n)\n1,247.7\n \nIncome tax provision\n(\n252.9\n)\n69.7\n \n(\n322.2\n)\nNet income/(loss)\n752.4\n \n(\n168.2\n)\n925.5\n \nNet (income)/loss attributable to noncontrolling interests in consolidated entities\n22.4\n \n71.3\n \n(\n4.8\n)\nDividends declared on preferred shares\n(\n236.8\n)\n(\n236.8\n)\n(\n236.8\n)\nNet income/(loss) attributable to Invesco Ltd.\n$\n538.0\n \n$\n(\n333.7\n)\n$\n683.9\n \nEarnings per common share:\n-basic\n$\n1.18\n \n$\n(\n0.73\n)\n$\n1.50\n \n-diluted\n$\n1.18\n \n$\n(\n0.73\n)\n$\n1.49\n \nSee accompanying notes.\n67\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Statements of Comprehensive Income \nYears ended December 31,\n(in millions)\n2024\n2023\n2022\nNet income/(loss)\n$\n752.4\n \n$\n(\n168.2\n)\n$\n925.5\n \nOther comprehensive income/(loss), net of tax:\nCurrency translation differences on investments in foreign subsidiaries\n(\n234.3\n)\n144.9\n \n(\n463.1\n)\nOther comprehensive income/(loss), net of tax\n—\n \n(\n4.3\n)\n(\n37.8\n)\nOther comprehensive income/(loss)\n(\n234.3\n)\n140.6\n \n(\n500.9\n)\nTotal comprehensive income/(loss)\n518.1\n \n(\n27.6\n)\n424.6\n \nComprehensive loss/(income) attributable to noncontrolling interests in consolidated entities\n22.4\n \n71.3\n \n(\n4.8\n)\nDividends declared on preferred shares\n(\n236.8\n)\n(\n236.8\n)\n(\n236.8\n)\nComprehensive income/(loss) attributable to Invesco Ltd.\n$\n303.7\n \n$\n(\n193.1\n)\n$\n183.0\n \nSee accompanying notes.\n68\nTable of Contents\n    \n                                 \n Invesco Ltd.\nConsolidated Statements of Cash Flows\nYears ended December 31,\n(in millions)\n2024\n2023\n2022\nOperating activities:\nNet income/(loss)\n$\n752.4\n \n$\n(\n168.2\n)\n$\n925.5\n \nAdjustments to reconcile net income to net cash provided by/(used in) operating activities:\nAmortization and depreciation\n179.6\n \n182.8\n \n195.3\n \nImpairment of intangible assets\n—\n \n1,248.9\n \n—\n \nCommon share-based compensation expense\n104.6\n \n114.6\n \n106.2\n \nOther (gains)/losses, net\n(\n45.1\n)\n(\n97.3\n)\n139.5\n \nOther (gains)/losses of CIP, net\n57.9\n \n176.3\n \n126.9\n \nEquity in earnings of unconsolidated affiliates\n(\n43.0\n)\n(\n71.3\n)\n(\n106.1\n)\nDistributions from equity method investees\n82.1\n \n69.4\n \n74.2\n \nChanges in operating assets and liabilities:\n(Purchase)/sale of investments by CIP, net\n17.1\n \n(\n50.8\n)\n(\n359.2\n)\n(Purchase)/sale of investments, net\n(\n61.8\n)\n69.4\n \n(\n27.6\n)\n(Increase)/decrease in receivables and other assets\n319.7\n \n448.7\n \n912.8\n \nIncrease/(decrease) in payables and other liabilities\n(\n173.5\n)\n(\n621.7\n)\n(\n1,284.3\n)\nNet cash provided by/(used in) operating activities\n1,190.0\n \n1,300.8\n \n703.2\n \nInvesting activities:\nPurchase of property, equipment and software\n(\n69.1\n)\n(\n164.3\n)\n(\n192.9\n)\nPurchase of investments by CIP\n(\n4,134.7\n)\n(\n3,214.4\n)\n(\n2,717.2\n)\nSale of investments by CIP\n4,479.5\n \n3,111.6\n \n2,638.4\n \nPurchase of investments\n(\n293.2\n)\n(\n65.2\n)\n(\n217.8\n)\nSale of investments\n0.2\n \n26.8\n \n97.9\n \nCapital distribution from equity method investees\n126.8\n \n23.3\n \n32.6\n \nOther investing activities\n—\n \n46.2\n \n—\n \nNet cash inflows/(outflows) upon consolidation/deconsolidation of CIP\n(\n41.1\n)\n(\n8.3\n)\n(\n16.6\n)\nNet cash provided by/(used in) investing activities\n68.4\n \n(\n244.3\n)\n(\n375.6\n)\nFinancing activities:\nPurchases of treasury shares\n(\n79.3\n)\n(\n187.5\n)\n(\n244.7\n)\nDividends paid - preferred\n(\n236.8\n)\n(\n236.8\n)\n(\n236.8\n)\nDividends paid - common\n(\n371.5\n)\n(\n357.9\n)\n(\n334.8\n)\nThird-party capital invested into CIP\n150.0\n \n201.2\n \n709.2\n \nThird-party capital distributed by CIP\n(\n201.1\n)\n(\n255.6\n)\n(\n284.8\n)\nBorrowings of debt of CIP\n1,488.8\n \n703.0\n \n30.1\n \nRepayments of debt of CIP\n(\n1,811.7\n)\n(\n451.8\n)\n(\n5.1\n)\nBorrowings of revolving credit agreement\n2,269.5\n \n—\n \n—\n \nRepayments of revolving credit agreement\n(\n2,269.5\n)\n—\n \n—\n \nRepayment of senior notes\n(\n600.0\n)\n—\n \n(\n600.0\n)\nNet cash provided by/(used in) financing activities\n(\n1,661.6\n)\n(\n585.4\n)\n(\n966.9\n)\nIncrease/(decrease) in cash and cash equivalents\n(\n403.2\n)\n471.1\n \n(\n639.3\n)\nForeign exchange movement on cash and cash equivalents\n(\n30.3\n)\n24.0\n \n(\n68.6\n)\nForeign exchange movement on cash and cash equivalents of CIP\n(\n2.1\n)\n2.4\n \n(\n5.1\n)\nCash and cash equivalents, beginning of period\n1,931.6\n \n1,434.1\n \n2,147.1\n \nCash and cash equivalents, end of period\n$\n1,496.0\n \n$\n1,931.6\n \n$\n1,434.1\n \nCash and cash equivalents\n$\n986.5\n \n$\n1,469.2\n \n$\n1,234.7\n \nCash and cash equivalents of CIP\n509.5\n \n462.4\n \n199.4\n \nTotal cash and cash equivalents per consolidated statement of cash flows\n1,496.0\n \n1,931.6\n \n1,434.1\n \nSupplemental Cash Flow Information:\nInterest paid\n(\n53.6\n)\n(\n68.2\n)\n(\n67.4\n)\nInterest received\n35.5\n \n31.0\n \n8.7\n \nTaxes paid\n(\n236.3\n)\n(\n195.1\n)\n(\n301.4\n)\nSee accompanying notes.\n69\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Statements of Changes in Equity\nEquity Attributable to Invesco Ltd.\n(in millions, except per share data)\nPreferred Shares\nCommon Shares\nAdditional Paid-in-Capital\nTreasury Shares\nRetained Earnings\nAccumulated Other Comprehensive Income/(Loss)\nTotal Equity Attributable to Invesco Ltd.\nNonredeemable Noncontrolling Interests in Consolidated Entities\nTotal Permanent Equity\nRedeemable Noncontrolling Interests in Consolidated Entities/Temporary Equity\nJanuary 1, 2024\n$\n4,010.5\n \n$\n113.2\n \n$\n7,451.6\n \n$\n(\n3,002.6\n)\n$\n6,826.7\n \n$\n(\n801.8\n)\n$\n14,597.6\n \n$\n572.7\n \n$\n15,170.3\n \n$\n745.7\n \nNet income\n— \n— \n— \n— \n774.8\n \n— \n774.8\n \n31.4\n \n806.2\n \n(\n53.8\n)\nOther comprehensive income/(loss)\n— \n— \n— \n— \n— \n(\n234.3\n)\n(\n234.3\n)\n— \n(\n234.3\n)\n— \nChange in noncontrolling interests in consolidated entities, net\n— \n— \n— \n— \n— \n— \n— \n(\n39.9\n)\n(\n39.9\n)\n(\n147.2\n)\nDividends declared - preferred ($\n59.00\n per share)\n— \n— \n— \n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \nDividends declared - common ($\n0.815\n per share)\n— \n— \n— \n— \n(\n374.3\n)\n— \n(\n374.3\n)\n— \n(\n374.3\n)\n— \nEmployee common share plans:\nCommon share-based compensation\n— \n— \n104.6\n \n— \n— \n— \n104.6\n \n— \n104.6\n \n— \nVested common shares\n— \n— \n(\n211.0\n)\n211.0\n \n— \n— \n—\n \n— \n— \n— \nOther common share awards\n— \n— \n(\n10.6\n)\n18.2\n \n— \n— \n7.6\n \n— \n7.6\n \n— \nPurchase of common shares\n— \n— \n— \n(\n79.3\n)\n— \n— \n(\n79.3\n)\n— \n(\n79.3\n)\n— \nDecember 31, 2024\n$\n4,010.5\n \n$\n113.2\n \n$\n7,334.6\n \n$\n(\n2,852.7\n)\n$\n6,990.4\n \n$\n(\n1,036.1\n)\n$\n14,559.9\n \n$\n564.2\n \n$\n15,124.1\n \n$\n544.7\n \nSee accompanying notes.\n70\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Statements of Changes in Equity (continued)\nEquity Attributable to Invesco Ltd.\n(in millions, except per share data)\nPreferred Shares\nCommon Shares\nAdditional Paid-in-Capital\nTreasury Shares\nRetained Earnings\nAccumulated Other Comprehensive Income/(Loss)\nTotal Equity Attributable to Invesco Ltd.\nNonredeemable Noncontrolling Interests in Consolidated Entities\nTotal Permanent Equity\nRedeemable Noncontrolling Interests in Consolidated Entities/Temporary Equity\nJanuary 1, 2023\n$\n4,010.5\n \n$\n113.2\n \n$\n7,554.9\n \n$\n(\n3,040.9\n)\n$\n7,518.3\n \n$\n(\n942.4\n)\n$\n15,213.6\n \n$\n629.9\n \n$\n15,843.5\n \n$\n998.7\n \nNet income/(loss)\n— \n— \n— \n— \n(\n96.9\n)\n— \n(\n96.9\n)\n(\n35.2\n)\n(\n132.1\n)\n(\n36.1\n)\nOther comprehensive income/(loss)\n— \n— \n— \n— \n— \n140.6\n \n140.6\n \n— \n140.6\n \n— \nChange in noncontrolling interests in consolidated entities, net\n— \n— \n— \n— \n— \n— \n— \n(\n22.0\n)\n(\n22.0\n)\n(\n216.9\n)\nDividends declared - preferred ($\n59.00\n per\nshare)\n— \n— \n— \n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \nDividends declared - common ($\n0.7875\n per share)\n— \n— \n— \n— \n(\n357.9\n)\n— \n(\n357.9\n)\n— \n(\n357.9\n)\n— \nEmployee common share plans:\nCommon share-based compensation\n— \n— \n114.6\n \n— \n— \n— \n114.6\n \n— \n114.6\n \n— \nVested common shares\n— \n— \n(\n209.2\n)\n209.2\n \n— \n— \n— \n— \n— \n— \nOther common share awards\n— \n— \n(\n8.7\n)\n16.6\n \n— \n— \n7.9\n \n— \n7.9\n \n— \nPurchase of common shares\n— \n— \n— \n(\n187.5\n)\n— \n— \n(\n187.5\n)\n— \n(\n187.5\n)\n— \nDecember 31, 2023\n$\n4,010.5\n \n$\n113.2\n \n$\n7,451.6\n \n$\n(\n3,002.6\n)\n$\n6,826.7\n \n$\n(\n801.8\n)\n$\n14,597.6\n \n$\n572.7\n \n$\n15,170.3\n \n$\n745.7\n \nSee accompanying notes.\n71\nTable of Contents\n    \n                                 \nInvesco Ltd.\nConsolidated Statements of Changes in Equity (continued)\nEquity Attributable to Invesco Ltd.\n(in millions, except per share data)\nPreferred Shares\nCommon Shares\nAdditional Paid-in-Capital\nTreasury Shares\nRetained Earnings\nAccumulated Other Comprehensive Income/(Loss)\nTotal Equity Attributable to Invesco Ltd.\nNonredeemable Noncontrolling Interests in Consolidated Entities\nTotal Permanent Equity\nRedeemable Noncontrolling Interests in Consolidated Entities/Temporary Equity\nJanuary 1, 2022\n$\n4,010.5\n \n$\n113.2\n \n$\n7,688.0\n \n$\n(\n3,043.6\n)\n$\n7,169.2\n \n$\n(\n441.5\n)\n$\n15,495.8\n \n$\n672.2\n \n$\n16,168.0\n \n$\n510.8\n \nNet income \n— \n— \n— \n— \n920.7\n \n— \n920.7\n \n8.8\n \n929.5\n \n(\n4.0\n)\nOther comprehensive income/(loss)\n— \n— \n— \n— \n— \n(\n500.9\n)\n(\n500.9\n)\n— \n(\n500.9\n)\n— \nChange in noncontrolling interests in consolidated entities, net\n— \n— \n— \n— \n— \n— \n— \n(\n51.1\n)\n(\n51.1\n)\n491.9\n \nDividends declared - preferred ($\n59.00\n per share)\n— \n— \n— \n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \n(\n236.8\n)\n— \nDividends declared - common ($\n0.73\n per share)\n— \n— \n— \n— \n(\n334.8\n)\n— \n(\n334.8\n)\n— \n(\n334.8\n)\n— \nEmployee common share plans:\nCommon share-based compensation\n— \n— \n106.2\n \n— \n— \n— \n106.2\n \n— \n106.2\n \n— \nVested common shares\n— \n— \n(\n228.6\n)\n228.6\n \n— \n— \n—\n \n— \n—\n \n— \nOther common share awards\n— \n— \n(\n10.7\n)\n18.8\n \n— \n— \n8.1\n \n— \n8.1\n \n— \nPurchase of common shares\n— \n— \n— \n(\n244.7\n)\n— \n— \n(\n244.7\n)\n— \n(\n244.7\n)\n— \nDecember 31, 2022\n$\n4,010.5\n \n$\n113.2\n \n$\n7,554.9\n \n$\n(\n3,040.9\n)\n$\n7,518.3\n \n$\n(\n942.4\n)\n$\n15,213.6\n \n$\n629.9\n \n$\n15,843.5\n \n$\n998.7\n \nSee accompanying notes.\n72\nTable of Contents\n    \n                                 \nInvesco Ltd.\nNotes to the Consolidated Financial Statements\n1.  \nACCOUNTING POLICIES \n \nCorporate Information\nThe company provides retail and institutional clients with an array of investment management capabilities. The company operates globally and its sole business is investment management.\nAccounting Pronouncements Recently Adopted\nSegment Disclosures.\n On January 1, 2024, the company adopted Accounting Standards Update 2023-07, \"Segment Reporting: Improvements to Reportable Segment Disclosures\" (ASU 2023-07). The standard requires disclosure of the Chief Operating Decision Maker (CODM) and information about segment expenses on a quarterly and annual basis. The adoption of this amendment resulted in additional disclosures, see Note 16, \"Segment and Geographic Information.\"\nPending Accounting Pronouncements\nIncome Tax Disclosures.\n In December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update 2023-09, \"Income Taxes: Improvements to Income Tax Disclosures\" (ASU 2023-09). The standard requires disaggregated income tax disclosures of the effective tax rate reconciliation and income taxes paid. ASU 2023-09 is effective for fiscal years beginning after December 15, 2024 and interim periods within fiscal years beginning after December 15, 2025 and early adoption is permitted. The adoption of this amendment will result in incremental disclosures within the Consolidated Financial Statements.\nDisaggregation of Income Statement Expenses.\n In November 2024, the FASB issued Accounting Standards Update 2024-03, \"Disaggregation of Income Statement Expenses\" (ASU 2024-03). The standard requires the disaggregated disclosure of certain income statement items. ASU 2024-03 is effective for fiscal years beginning after December 15, 2026 and interim periods beginning after December 15, 2027 and early adoption is permitted. The company is currently evaluating the impact of this amendment on its Consolidated Financial Statements.\nBasis of Presentation\nThe Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the U.S. and with rules and regulations of the SEC and consolidate the financial statements of the Parent and all of its controlled subsidiaries. In the opinion of management, the Consolidated Financial Statements reflect all adjustments, consisting of normal recurring accruals, which are necessary for the fair presentation of the financial condition and results of operations for the periods presented. All significant intercompany transactions, balances, revenues and expenses are eliminated upon consolidation. \nThe Consolidated Financial Statements have been prepared primarily on the historical cost basis; however, certain items are presented using other bases such as fair value, where such treatment is required or voluntarily elected. The financial statements of subsidiaries, with the exception of certain CIP, are prepared for the same reporting period as the Parent and use consistent accounting policies, which, where applicable, have been adjusted to U.S. GAAP from local generally accepted accounting principles or reporting regulations. The financial information of certain CIP is included in the company's Consolidated Financial Statements on a lag (generally three months) based upon the availability of fund financial information. Noncontrolling interests in consolidated entities represents the interests in certain entities consolidated by the company either because the company has control over the entity or has determined that it is the primary beneficiary, but the company does not own all of the entity's equity. To the extent that noncontrolling interests represent equity which is redeemable or convertible for cash or other assets at the option of the equity holder, these are deemed to represent temporary equity, and are classified as equity attributable to redeemable noncontrolling interests in the Consolidated Balance Sheets. Nonredeemable noncontrolling interests are classified as a component of permanent equity. \n73\nTable of Contents\n    \n                                 \nBasis of Accounting and Consolidation\nIn addition to consolidating the financial statements of the Parent and all of its controlled subsidiaries, the Consolidated Financial Statements include the consolidation of certain investment products that meet the definition of either a VOE, if the company is deemed to have a controlling financial interest in the fund, or a VIE, if the company has been deemed to be the primary beneficiary of the fund. \nCertain of these investment products including, but not limited to, CLOs, funds that are structured as partnership entities (such as private equity funds, real estate funds and fund-of-funds) and certain non-U.S. mutual funds are considered, for accounting and consolidation analysis purposes, to be VIEs. A VIE, in the context of the company and its managed funds, is a fund that does not have sufficient equity to finance its operations without additional subordinated financial support, or a fund for which the risks and rewards of ownership are not directly linked to voting interests. If the company is deemed to have the power to direct the activities of the fund that most significantly impact the fund's economic performance and the obligation to absorb losses/right to receive benefits from the fund that could potentially be significant to the fund, then the company is deemed to be the fund's primary beneficiary and is required to consolidate the fund.\nThe company's economic risk with respect to each investment in a CIP is limited to its equity ownership and any uncollected management and performance fees. See Note 18, \"Consolidated Investment Products,\" for additional information regarding the impact of CIP.\nThe company assesses modifications to existing funds on an ongoing basis to determine if a significant reconsideration event has occurred. The consolidation analysis includes a detailed review of the terms of the fund's governing documents and a comparison of the significant terms against the consolidation criteria in ASC Topic 810, including a determination of whether the fund is a VIE or a VOE. Seed capital and co-investments in managed funds in which the company has determined that it is the primary beneficiary or in which the company has a controlling financial interest are consolidated if the impact of doing so is deemed material. If the company subsequently determines that it no longer controls the managed funds in which it has invested, or no longer has an obligation to absorb losses or rights to receive benefits, the company will deconsolidate the funds. If there are any remaining holdings in the managed funds or if the managed funds are not required to be consolidated, the investment is no longer accounted for as CIP and is moved to the investments line item in the balance sheet and is accounted for as described in the \"Investments\" accounting policy below.\n All of the investments held by VIEs are presented at fair value in the company's Consolidated Balance Sheets at December 31, 2024 and 2023. The company has elected the fair value option under ASC Topic 825-10-25 for measuring the collateral assets held and notes issued by its consolidated CLOs to eliminate inconsistencies that would otherwise arise from using different accounting bases. The notes issued by consolidated CLOs are measured under the measurement alternative that requires the reporting entity to measure both the financial assets and liabilities of the CLOs using the more observable fair value. By electing the fair value option, the notes issued by the CLOs are measured based on the fair value of the net assets of the CLOs. Gains or losses related to assets and liabilities of consolidated CLOs are offset in Other income/(expense) of CIP, net in the Consolidated Statements of Income. Net income (loss) attributable to Invesco Ltd. includes only the changes in fair value of the company’s economic interests in the consolidated CLOs due to the elimination of net income (loss) related to noncontrolling interests.\n \nReclassifications\nDuring the year ended December 31, 2024, expenses for client-related travel and entertainment and outsourced services were reclassified to General and administrative expenses. The impact of this reclassification on the Consolidated Statements of Income is as follows:\n•    For the twelve months ended December 31, 2024: decreased Marketing and Property, office and technology expenses by $\n28.9\n million and $\n92.7\n million, respectively, and increased General and administrative by $\n121.6\n million.\n•    For the twelve months ended December 31, 2023: decreased Marketing and Property, office and technology expenses by $\n21.3\n million and $\n95.9\n million, respectively, and increased General and administrative by $\n117.2\n million.\nThe reclassification had no impact on our reported Operating revenues, Operating income, Net income, or any internal performance measure on which management is compensated.\n74\nTable of Contents\n    \n                                 \nAssets and Liabilities Held for Sale\nDuring the year ended December 31, 2024, the company and IndusInd International Holdings Limited, a company organized under the laws of the Republic of Mauritius, entered into a definitive agreement to form a joint venture through the sale of \n60\n% of the company's stake in Invesco Asset Management (India) Private Limited, a wholly owned subsidiary. The transaction is expected to close in 2025. As a result, Invesco Asset Management (India) Private Limited's business has been classified as held for sale and the associated assets and liabilities are presented on the Consolidated Balance Sheets within Other assets and Accounts payable and accrued expenses, respectively.\nUse of Estimates\nIn preparing the Consolidated Financial Statements, management is required to make estimates and assumptions that affect reported revenues, expenses, assets, liabilities and disclosure of contingent liabilities. The primary estimates and assumptions relate to goodwill and intangible impairment, certain investments which are carried at fair value, post-employment benefit plan obligations, income taxes and contingent losses. Additionally, estimation is involved when determining investment and debt valuation for certain CIP; however, changes in the fair values of these amounts are largely offset by noncontrolling interests. Use of available information and application of judgment are inherent in the formation of estimates. Actual results in the future could differ from such estimates, and the differences may be material to the Consolidated Financial Statements.\nChange in Accounting Estimate\nIn September 2024, the company made changes to the retirement criteria for vesting of currently outstanding long-term awards which resulted in a change in estimate for long-term awards granted to employees who meet the criteria. The change to the criteria became effective during the year ended December 31, 2024 and resulted in the accelerated recognition of $\n147.6\n million in Employee compensation expense.\nCash and Cash Equivalents\nCash and cash equivalents consist of cash held at banks and short-term investments with a maturity of three months or less (primarily held in affiliated money market funds). Cash and cash equivalents of CIP are not available for general use by the company and are included in Investments and other assets of CIP on the Consolidated Balance Sheets.\nCash balances may not be readily accessible to the Parent due to capital adequacy requirements of certain of our subsidiaries. We meet these requirements in part by holding Cash and cash equivalents. This retained cash can be used for general business purposes in the countries where it is located and is therefore not considered restricted cash.\nInvestments\nThe majority of the company’s investment balances relate to balances held in affiliated funds and equity method investees. In the normal course of business, the company invests in various types of affiliated investment products, either as “seed capital” or as longer-term investments alongside third-party investors, typically referred to as “co-investments.” Seed capital investments are investments held in Invesco managed funds with the purpose of providing capital to the funds during their development periods to allow the funds to achieve critical mass, establish their track records and obtain third-party investments. Seed capital may also be held for regulatory purposes in certain jurisdictions. Co-investments are often required of the investment manager by third-party investors in closed-ended funds to demonstrate an alignment of the investment manager’s interests with those of the third-party investors. The company also invests in affiliated funds in connection with its deferred compensation plans.\nInvestments are categorized as equity investments, equity method investments and other investments. See Note 3, “Investments,” for additional details.\nEquity investments include seed capital, investments held to settle the company's deferred compensation plan liabilities and other equity securities. Equity investments are securities bought and held principally for the purpose of selling them in the near term. Equity investments are measured at fair value. Gains or losses arising from changes in the fair value of equity investments are included in income.\n75\nTable of Contents\n    \n                                 \nEquity method investments include investments over which the company is deemed to have significant influence. Significant influence typically exists when the company owns between 20% to 50% of an investee, although other factors are considered including representation on the Board, the concentration of other shareholders and the impacts of contractual arrangements. The equity method of accounting requires that the investment is initially recorded at cost, including any excess value paid over the book value of the investment acquired. The carrying amount of the investment is increased or decreased to recognize the company's share of the after-tax profit or loss of the investee after the date of acquisition and is decreased as distributions are received. Distributions received from equity method investees are classified in the Consolidated Statements of Cash Flows as either operating or investing activities based on the nature of the distribution. The proportionate share of income or loss is included in Equity in earnings of unconsolidated affiliates in the Consolidated Statements of Income.\nFair Value\nFair value is determined using a valuation hierarchy (discussed in Note 2, “Fair Value of Assets and Liabilities”), generally by reference to an active trading market, using quoted closing or bid prices as of each reporting period end. When a readily ascertainable market value does not exist for an investment, the fair value is calculated based on the expected cash flows of its underlying net asset base, taking into account applicable discount rates and other factors. Judgment is used to ascertain if a formerly active market has become inactive and in determining fair values when markets have become inactive. As a practical expedient, the company may elect to use NAV as the fair value for certain CIP.\n \nProperty, Equipment, Software and Depreciation\nProperty, equipment and software includes owned property, leasehold improvements, computer hardware/software and other equipment and is stated at cost less accumulated depreciation or amortization and any previously recorded impairment in value. Expenditures for major additions and improvements are capitalized; minor replacements, maintenance and repairs are charged to expense as incurred. Amounts incurred are presented as work-in-progress until the construction or purchase of the property and equipment is substantially complete and ready for its intended use, at which point, the asset will begin to be depreciated or amortized. Depreciation or amortization is provided on property, equipment and software at rates calculated to write off the cost, less estimated residual value, on a straight-line basis over the asset's expected useful life: owned buildings over \n50\n years, leasehold improvements over the shorter of the lease term or useful life of the improvement; and computers and other equipment between \nthree\n and \nseven years\n.\nPurchased and internally developed software is capitalized if the costs can be measured reliably, and it is probable that the asset will generate future economic benefits. For internally developed software, the company capitalizes certain internal and external costs incurred related to software development activities that will generate future economic benefits. These capitalized costs are amortized into operating expenses on a straight-line basis over the software's useful life, generally \nfive\n to \nseven years\n. Depreciation or amortization expense is included in Property, office and technology expense on the Consolidated Income Statement.\nThe company reevaluates the useful life determination for property, equipment and software each reporting period to determine whether events and circumstances warrant a revision to the remaining useful life. Upon a sale or retirement, the asset cost and related accumulated depreciation or amortization are removed from the Consolidated Financial Statements and any related gain or loss is reflected in income.\nThe carrying amounts of property, equipment and software are reviewed for impairment when events or changes in circumstances indicate that the carrying values may not be recoverable. At each reporting date, an assessment is made to identify any indicators of impairment. An impairment test is performed if an impairment indicator is identified.\nIntangible Assets\nIntangible assets identified on the acquisition of a business are capitalized separately from goodwill if the fair value can be measured reliably on initial recognition (transaction date). Intangible assets consist primarily of mutual fund and other client management contracts, customer relationships and distribution agreements. Certain management contracts are managed and operated on a single global platform and are therefore reviewed in aggregate as one unit of valuation. These contracts are considered interchangeable because investors may freely transfer between funds. \n76\nTable of Contents\n    \n                                 \nIntangible assets that are determined to be finite-lived are amortized on a straight-line basis over their useful lives, from \ntwo\n to \nten years\n, which reflects the pattern in which the economic benefits are realized. The company reviews intangible assets each reporting period to determine whether events or circumstances have occurred that indicate the expected period of economic benefit may no longer be appropriate or there is an indication of impairment. If there is an indication of impairment, management will perform an impairment analysis. \nWhere evidence exists that the underlying agreements have a high likelihood of continued renewal at little or no cost to the company, the intangible asset is assigned an indefinite life and reviewed for impairment on an annual basis. Intangible assets not subject to amortization are tested for impairment annually as of October 1st or more frequently if events or changes in circumstances indicate that the asset might be impaired. When testing intangible assets for impairment, management has the option to first perform a qualitative assessment. If the qualitative assessment indicates that an impairment may be likely or management elected to not perform the qualitative assessment, management performs a quantitative test to determine the fair value of the intangible assets and compares the fair value with its carrying amount. If the carrying amount of the intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. Fair value is generally determined using an income approach where estimated future cash flows are discounted to arrive at a single present value amount.\n \nGoodwill\nGoodwill represents the excess of cost over the identifiable net assets of businesses acquired and is recorded in the functional currency of the acquired entity. Goodwill is recognized as an asset and is reviewed for impairment annually as of October 1st and between annual tests when events and circumstances indicate that impairment may have occurred.\nThe company has determined that it has \none\n reporting unit for goodwill impairment testing purposes which is consistent with internal management reporting and management's oversight of operations. The company evaluated the components of its business, which are business units one level below the operating segment level in making this determination. The company's operating segment represents \none\n reporting unit because all of the components are similar due to the common nature of products and services offered, type of clients, methods of distribution, manner in which each component is operated, extent to which they share assets and resources and the extent to which they support and benefit from common product development efforts.\nThe company has the option to first qualitatively assess whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If the qualitative assessment indicates that an impairment may be likely or management elected to not perform the qualitative assessment, a quantitative impairment test is performed at the reporting unit level. If the carrying amount of the reporting unit exceeds its fair value, an impairment loss is recognized for the reporting unit in an amount equal to that excess. However, the impairment cannot exceed the total amount of goodwill allocated to the reporting unit.\nThe principal method of determining fair value of the reporting unit is an income approach where estimated future cash flows are discounted to arrive at a single present value amount. The discount rate used is derived based on the weighted average cost of capital and the risk profile of the stream of future cash flows. The calculated present value amount is the fair value of the reporting unit.\n \nDebt Issuance Costs\nDebt issuance costs related to the issuance of senior notes are presented as a deduction from the carrying amount of the related debt liability. Debt issuance costs related to the company's revolving credit agreement are presented as a deferred asset within Other assets on the company's Consolidated Balance Sheets. Debt issuance costs are amortized over the term of the debt using the effective interest method and are reflected in Interest expense in the Consolidated Statements of Income. After initial recognition, debt issuance costs are measured at amortized cost.\n \nRevenue Recognition\nRevenue is measured and recognized based on the five step process outlined in ASC Topic 606, \"Revenue from Contracts with Customers.\" Revenue is determined based on the transaction price negotiated with the customer, net of discounts, value added tax and other sales-related taxes.\n77\nTable of Contents\n    \n                                 \nInvestment management fees are derived from providing professional services to manage client accounts and sponsored investment vehicles. Investment management services are satisfied over time as the services are provided and are typically based upon a percentage of the value of the client’s AUM. Investment management fees for certain arrangements include fees for distribution and administrative-related services. Any fees collected in advance are deferred and recognized as income over the period in which services are rendered.\nService fees are earned for services rendered relating to fund accounting, transfer agent, administrative and/or other maintenance activities performed for sponsored investment vehicles. Service fees are generally based upon a percentage of the value of the AUM. Service fees are also earned from the delivery of digital solutions to our customers. All of these services are satisfied over time.\nThe company provides distribution services to certain sponsored investment vehicles. Fees are generally earned based upon a percentage of the value of the AUM, as the fee amounts do not crystallize completely upon the sale of a share or unit. Accordingly, the distribution fee revenues are recognized over time as the amount of the fees becomes known. For example, U.S. distribution fees can include 12b-1 fees earned from certain mutual funds to cover allowable sales and marketing expenses for those funds and also include asset-based sales charges paid by certain mutual funds for a period of time after the sale of those funds. Generally, retail products offered outside of the U.S. do not generate a separate distribution fee; the quoted management fee rate is inclusive of these services. The company also has certain arrangements whereby the distribution fees are paid upon the subscription or redemption of a share or unit.\nPerformance fee revenues, including carried interests and performance fees related to partnership investments and separate accounts, are generated on certain management contracts when performance hurdles are achieved. Such fee revenues are recorded in Operating revenues when the contractual performance criteria have been met and when it is probable that a significant reversal of revenue recognized will not occur in future reporting periods. Cash receipt of performance fees generally occurs after the performance fee revenue is earned; however, the company may receive, from time-to-time, cash distributions of carried interest before any revenue is earned. Such distributions are reflected as deferred carried interest liabilities within Accounts payable and accrued expenses on the Consolidated Balance Sheets. Given the uniqueness of each fee arrangement, performance fee contracts are evaluated on an individual basis to determine the timing of revenue recognition. \nOther revenues include fees derived primarily from transaction commissions earned upon the sale of new investments into certain of our funds and fees earned upon the completion of transactions in our real estate and private equity asset groups. These transaction fees are recorded in the Consolidated Statements of Income on the date when Invesco’s services are complete, which typically coincides with when the transactions are legally complete.\nPrincipal versus Agent\nThe company utilizes third-party service providers to fulfill certain performance obligations in its revenue agreements. Generally, the company is deemed to be the principal in these arrangements because the company controls the investment management and other related services before they are transferred to customers. Such control is evidenced by the company’s primary responsibility to customers and the ability to negotiate the third-party contract price as well as select and direct third-party service providers, or a combination of these factors. Therefore, investment management and service and distribution fee revenues and the related third-party distribution, service and advisory expenses are reported on a gross basis.\nAs discussed above, the revenues from the company’s U.S. retail operations include 12b-1 distribution fees, which are largely passed through to brokers who sell the funds. The fees passed through to the broker dealers are included in third-party distribution expenses along with additional marketing support distribution costs. Both the revenues and the costs are dependent on the underlying AUM of the brokers' clients. Third-party distribution expenses also include the amortization of upfront commissions paid to broker-dealers for sales of fund shares with a CDSC (a charge levied to the investor for client redemption of AUM within a certain contracted period of time). The upfront distribution commissions are amortized over the redemption period. Also included in third-party distribution, service and advisory expenses are sub-transfer agency fees that are paid to third parties for processing client common share purchases and redemptions, call center support and client reporting. These costs are reimbursed by the related funds and are included in service and distribution fees.\n78\nTable of Contents\n    \n                                 \nCommon Share-Based Compensation\nThe company issues equity-settled common share-based awards to certain employees, which are measured at fair value at the date of grant. Fair value for the common share awards representing equity interests identical to those associated with common shares traded in the open market is determined using the market price at the date of grant. The fair value determined at the grant date is expensed, based on the company's estimate of common shares that will eventually vest, on a straight-line or accelerated basis over the vesting period.\nDeferred Compensation \nThe company grants deferred cash awards to certain employees which are linked in value to investment products. During the vesting period, employees earn a return linked to the appreciation or depreciation of specified investments. The company recognizes as compensation expense the value of the liability to employees, including the appreciation or depreciation of the liability, over the award's vesting period in proportion to the vested amount of the award.\nThe company currently economically hedges the exposure to market movements on certain of these awards by either holding the underlying investment products on its balance sheet or through a TRS financial instrument. The company immediately recognizes the full value of the investment in Investments on the Consolidated Balance Sheets and any subsequent appreciation or depreciation of the investments, in Other gains/(losses), net in the Consolidated Statements of Income.\n \nPensions\nFor defined contribution plans, contributions payable related to the accounting period are expensed and included in Employee compensation expense. For defined benefit plans, the cost of providing benefits is separately determined for each plan using the projected unit credit method, based on actuarial valuations performed at each balance sheet date. The company's annual measurement date is December 31st. A portion of actuarial gains and losses is expensed and included in Other gains/(losses), net if the net cumulative unrecognized actuarial gain or loss at the end of the prior period exceeds the greater of \n10.0\n% of the present value of the defined benefit obligation (before deducting plan assets) at that date and \n10.0\n% of the fair value of any plan assets.\n \nLeases\nThe company determines whether an arrangement is a lease at contract inception. Lease liabilities and right-of-use assets are recognized on the lease commencement date based on the net present value of fixed lease payments over the lease term. The company includes options to extend or terminate a lease within the lease term when it is reasonably certain the option will be exercised. Leases with an initial term of 12 months or less are not recorded on the balance sheet. Lease liabilities represent an obligation to make lease payments arising from a lease, and right-of-use assets represent a right to use an underlying asset during the lease term. Right-of-use assets exclude capital improvement funding and other lease concessions provided by the landlord. \nAs the company's leases generally do not have a readily determinable implicit rate, the company uses its incremental borrowing rate to determine the present value of fixed lease payments based on information available at the lease commencement date. Fixed lease expenses for operating leases are generally recognized on a straight-line basis over the lease term. The company combines lease components and non-lease components such as fixed maintenance and other costs into a single lease component, which results in the capitalization of all fixed payments within lease liabilities and right-of-use assets. Variable lease payments, such as variable maintenance costs or payments based on an index rate or usage, are expensed as incurred and are excluded from lease liabilities and right-of-use assets.\n \nTaxation\nDeferred tax assets and liabilities are recorded for temporary differences between the reported amounts of assets and liabilities in the financial statements and their respective tax bases, using the enacted statutory tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in the income tax provision in the period in which the change is enacted. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets to the amount that is more likely than not to be realized. The company recognizes all excess tax benefits and deficiencies related to common share-based awards as a discrete item in the income tax provision in the period in which the awards vest. The company records a liability for UTBs resulting from uncertain tax positions taken or expected to be taken in a tax return. The company recognizes interest and penalties related to income tax matters in the income tax provision.\n79\nTable of Contents\n    \n                                 \nEarnings Per Common Share\nBasic and diluted EPS are computed using the two-class method, which treats unvested restricted common shares as if they were a separate class of common shares. Under the two-class method, Net income attributable to Invesco is adjusted for the allocation of earnings to the unvested restricted common shares. In addition, the weighted-average common shares outstanding is adjusted for unvested restricted common shares.\n \nComprehensive Income\nThe company's Other comprehensive income/(loss) consists of foreign currency translation adjustments and employee benefit plan liability adjustments. Such amounts are recorded net of applicable taxes.\nTranslation of Foreign Currencies\nTransactions in foreign currencies (currencies other than the functional currencies of the company's subsidiaries) are recorded at the rates of exchange prevailing on the dates of the transactions. At each balance sheet date, monetary assets and liabilities that are denominated in foreign currencies are remeasured into the functional currencies of the company's subsidiaries at the rates prevailing at the balance sheet date. The revaluation of these transactions is included in the Consolidated Statements of Income.\nThe company's reporting currency and the functional currency of the Parent is U.S. Dollars. On consolidation, the assets and liabilities of the company's subsidiaries, whose functional currencies are currencies other than the U.S. Dollar, are translated at the rates of exchange prevailing at the balance sheet date. Exchange differences arising on the translation of the assets and liabilities of foreign operations are recorded directly to accumulated other comprehensive income in equity until the disposal of the net investment of the foreign entity, at which time, the exchange differences are recognized in the Consolidated Statements of Income. Income and expense items included in the Consolidated Statements of Income are translated at the weighted average rates for the year, which approximate actual exchange rates with the foreign exchange impact recorded to the Consolidated Statements of Income. Goodwill and other fair value adjustments arising on acquisition of a foreign entity are treated as assets and liabilities of the foreign entity and are translated at rates of exchange prevailing at the balance sheet date.\n2.  \nFAIR VALUE OF ASSETS AND LIABILITIES \nThe fair value of fin\nancial instruments are presented in the below summary table. The fair value of financial instruments held by CIP are presented in Note 18, \"Consolidated Investment Products.\"\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nFair Value\nFair Value\nCash and cash equivalents\n$\n986.5\n \n$\n1,469.2\n \nEquity investments\n371.2\n \n272.4\n \nAssets held for policyholders\n—\n \n393.9\n \nPolicyholder payables \n(1)\n—\n \n(\n393.9\n)\nTotal return swap related to deferred compensation plans\n(\n9.4\n)\n4.9\n \n \n____________\n(1)\nThese financial instruments are not measured at fair value on a recurring basis. Policyholder payables are indexed to the value of the assets held for policyholders and changes in fair value \nare recorded and offset to zero in other operating revenues\n. \nIn January 2024, all funds were distributed to customers.\n80\nTable of Contents\n    \n                                 \nA three-level valuation hierarchy exists for disclosure of fair value measurements based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date. The three levels are defined as follows:\n•\nLevel 1 - inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets. \n•\nLevel 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument. \n•\nLevel 3 - inputs to the valuation methodology are unobservable and significant to the fair value measurement. \nAn asset or liability's categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\nThe following table presents, for each of the hierarchy levels described above, the carrying value of the company's assets and liabilities, including by major security type for equity investments, which are measured at fair value on the company's Consolidated Balance Sheets as of December 31, 2024 and 2023, respectively:\nDecember 31, 2024\n(in millions)\nFair Value Measurements\nQuoted Prices in Active Markets for Identical Assets \n(Level 1)\nSignificant Other Observable Inputs \n(Level 2)\nSignificant Unobservable Inputs \n(Level 3)\nAssets:\nCash equivalents:\nMoney market funds \n(1)\n$\n479.3\n \n$\n479.3\n \n$\n—\n \n$\n—\n \nInvestments: \n(2)\n \nEquity investments:\n \nSeed capital\n151.6\n \n151.6\n \n—\n \n—\n \nInvestments related to deferred compensation plans\n219.6\n \n219.6\n \n—\n \n—\n \nTotal\n$\n850.5\n \n$\n850.5\n \n$\n—\n \n$\n—\n \nLiabilities:\n \n \n \n \nTotal return swap related to deferred compensation plans\n$\n(\n9.4\n)\n$\n—\n \n$\n(\n9.4\n)\n$\n—\n \nContingent consideration liability\n(\n1.3\n)\n—\n \n—\n \n(\n1.3\n)\nTotal\n$\n(\n10.7\n)\n$\n—\n \n$\n(\n9.4\n)\n$\n(\n1.3\n)\n81\nTable of Contents\n    \n                                 \nDecember 31, 2023\n(in millions)\nFair Value Measurements\nQuoted Prices in Active Markets for Identical Assets \n(Level 1)\nSignificant Other Observable Inputs \n(Level 2)\nSignificant Unobservable Inputs \n(Level 3)\nAssets:\nCash equivalents:\nMoney market funds \n(1)\n$\n927.8\n \n$\n927.8\n \n$\n—\n \n$\n—\n \nInvestments: \n(2)\nEquity investments:\nSeed capital\n75.7\n \n75.7\n \n—\n \n—\n \nInvestments related to deferred compensation plans\n196.7\n \n196.7\n \n—\n \n—\n \nAssets held for policyholders \n(3)\n393.9\n \n393.9\n \n—\n \n—\n \nTotal return swap related to deferred compensation plans\n4.9\n \n—\n \n4.9\n \n—\n \nTotal\n$\n1,599.0\n \n$\n1,594.1\n \n$\n4.9\n \n$\n—\n \nLiabilities:\n \n \n \n \nContingent consideration liability\n(\n1.3\n)\n—\n \n—\n \n(\n1.3\n)\nTotal\n$\n(\n1.3\n)\n$\n—\n \n$\n—\n \n$\n(\n1.3\n)\n____________\n(1)\nThe balance primarily represents cash held in affiliated money market funds.\n(2)\nEquity method and other investments\n of $\n854.5\n million and $\n14.3\n million, re\nspectively, as of December 31, 2024 (December 31, 2023: \n$\n631.8\n million\n and \n$\n14.9\n million\n, respectively) are also \nexcluded from this table. These investments are not measured at fair value, in accordance with applicable accounting standards.\n(3)\nThe majority of Assets held for policyholders were held in affiliated funds.\nTotal Return Swap\nIn addition to holding equity investments, the company has a TRS to \nhedge economically cer\ntain deferred compensation liabilities. The notional value of the TRS at \nDecember 31, 2024\n was \n$\n421.2\n million,\n and the fair value of the TRS was\n a liability of $\n9.4\n million (\nDecember 31, 2023 notional value was $\n393.0\n million and the fair value was an asset of $\n4.9\n million).\n  During the year ended December 31, 2024, market valuation gains related to the TRS were $\n23.8\n million (December 31, 2023: $\n30.1\n million net gains).\nThe fair value of the TRS was determined under the market approach using quoted prices of the underlying investments and, as such, is classified as level 2 of the valuation hierarchy. The TRS is not designated as a hedging instrument for accounting purposes.\n3.  \nINVESTMENTS \nThe disclosures below include details of the company's investments. Investments held by CIP are detailed i\nn Note 18, \"Consolidated Investment Products.\"\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nEquity investments:\nSeed capital\n$\n151.6\n \n$\n75.7\n \nInvestments related to deferred compensation plans\n219.6\n \n196.7\n \nEquity method investments\n854.5\n \n631.8\n \nOther\n14.3\n \n14.9\n \nTotal investments \n(1)\n$\n1,240.0\n \n$\n919.1\n \n____________\n(1)    The majority of the company’s investment balances relate to balances held in affiliated funds and equity method investees.\n82\nTable of Contents\n    \n                                 \n \nEquity investments\nNet gains recorded in Other gains/(losses) in the Consolidated Statements of Income resulting from equity investments and the TRS for the year ended December 31, 2024, were $\n44.2\n million (December 31, 2023: $\n61.3\n million net gains). The unrealized gains and losses for the year ended December 31, 2024, that relate to equity investments still held at December 31, 2024, was a $\n20.5\n million net gain (December 31, 2023: $\n17.2\n million net gain).\nEquity method investments\nInvestments on the Consolidated Balance Sheets which are accounted for using the equity method include the company's investments in Invesco Great Wall as well as certain of its managed private equity, real estate and other investment entities. These investment entities include variable interest entities for which the company has determined that it is not the primary beneficiary and other investment products structured as partnerships for which the company is the general partner and the other limited partners possess either substantive kick-out, liquidation or participation rights. See Note 1, “Accounting Policies,” for additional information.\n4.  \nPROPERTY, EQUIPMENT AND SOFTWARE \nThe following is a summary of property, equipment and software: \n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nTechnology and Other Equipment\n$\n240.3\n \n$\n267.6\n \nSoftware\n778.5\n \n800.0\n \nLand and Buildings\n85.2\n \n87.3\n \nLeasehold Improvements\n267.3\n \n277.7\n \nWork in Process\n62.4\n \n111.6\n \nProperty, Equipment and Software, Gross\n1,433.7\n \n1,544.2\n \nLess: Accumulated Depreciation \n(\n945.9\n)\n(\n935.9\n)\nLess: Accumulated Impairment\n(\n8.8\n)\n(\n8.8\n)\nProperty, Equipment and Software, Net\n$\n479.0\n \n$\n599.5\n \nDepreciation expense related to Property, equipment and software wa\ns $\n134.8\n million,\n $\n132.9\n million and $\n131.5\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n5.  \nINTANGIBLE ASSETS \nThe following table presents the major classes of the company's intangible assets at December 31, 2024 and 2023:\n(in millions)\nGross Book Value\nAccumulated Amortization and Impairment\nNet Book Value\nDecember 31, 2024\nManagement contracts - indefinite-lived\n$\n6,900.6\n \n$\n(\n1,248.9\n)\n$\n5,651.7\n \nManagement contracts - finite-lived\n317.7\n \n(\n253.2\n)\n64.5\n \nOther \n(1)\n195.7\n \n(\n162.6\n)\n33.1\n \nTotal\n$\n7,414.0\n \n$\n(\n1,664.7\n)\n$\n5,749.3\n \nDecember 31, 2023\nManagement contracts - indefinite-lived\n$\n6,954.3\n \n$\n(\n1,248.9\n)\n$\n5,705.4\n \nManagement contracts - finite-lived\n318.3\n \n(\n221.5\n)\n96.8\n \nOther \n(1)\n201.4\n \n(\n155.5\n)\n45.9\n \nTotal\n$\n7,474.0\n \n$\n(\n1,625.9\n)\n$\n5,848.1\n \n__________\n(1)    Includes indefinite-lived non-management contracts intangible assets of $\n19.1\n million for the years ended \nDecember 31, 2024\n and \n2023, \nand developed technology intangible assets that were fully amortized during the year ended December 31, 2024.\n83\nTable of Contents\n    \n                                 \nAmortization expense was\n $\n44.8\n million (December 31, 2023: $\n49.9\n million; December 31, 2022: $\n63.8\n million). An impairment related to indefinite-lived management contracts of U.S. retail mutual funds of $\n1,248.9\n million was recorded during the year ended December 31, 2023. \nEstimat\ned amortization expense for each of the five succeeding fiscal years based upon the company's intangible assets at December 31, 2024 is as follows:\n(in millions)\nYears Ended December 31,\nEstimated Amortization Expense\n2025\n$\n(\n37.6\n)\n2026\n$\n(\n35.8\n)\n2027\n$\n(\n3.6\n)\n2028\n$\n(\n1.5\n)\n2029\n$\n—\n \n6.  \nGOODWILL \nThe table below details changes in the goodwill balance:\n(in millions)\nNet Book Value\nJanuary 1, 2024\n$\n8,691.5\n \nForeign exchange\n(\n189.2\n)\nTransfer to held for sale \n(1)\n(\n184.2\n)\nDecember 31, 2024\n$\n8,318.1\n \nJanuary 1, 2023\n$\n8,557.7\n \nForeign exchange\n133.8\n \nDecember 31, 2023\n$\n8,691.5\n \n_________\n(1) Included in Other assets on the Consolidated Balance Sheet. See Note 1, “Accounting Policies,” for additional information.\n7.  \nOTHER LIABILITIES \nThe table below details the components of other liabilities:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nCompensation and benefits\n$\n74.2\n \n$\n98.3\n \nAccrued bonus and deferred compensation\n955.0\n \n802.1\n \nAccrued compensation and benefits\n$\n1,029.2\n \n$\n900.4\n \nAccruals and other liabilities\n$\n584.4\n \n$\n961.4\n \nLease liability (See Note 13)\n454.9\n \n433.7\n \nAccounts payable\n30.6\n \n31.5\n \nUnsettled funds payable\n69.4\n \n151.2\n \nIncome taxes payable\n146.0\n \n110.5\n \nAccounts payable and accrued expenses\n$\n1,285.3\n \n$\n1,688.3\n \n84\nTable of Contents\n    \n                                 \n8.  \nDEBT\nThe issuer of the senior notes, Invesco Finance PLC, is an indirect \n100\n% owned finance subsidiary of the Parent, and the Parent fully and unconditionally guarantees the securities. \nThe disclosures below include details of the company's debt. Debt of CIP is detailed in Note 18, “Consolidated Investment Products.”\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nCarrying Value \n(4)\nFair Value\nCarrying Value \n(4)\nFair Value\n$\n2.0\n billion revolving credit agreement expiring April 26, 2028 \n(1)\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nUnsecured Senior Notes \n(2)\n:\n$\n600\n million \n4.000\n% - due January 30, 2024 \n(3)\n—\n \n—\n \n599.9\n \n599.1\n \n$\n500\n million \n3.750\n% - due January 15, 2026\n499.3\n \n494.5\n \n498.6\n \n489.1\n \n$\n400\n million \n5.375\n% - due November 30, 2043\n391.3\n \n391.7\n \n391.0\n \n409.6\n \n Debt\n$\n890.6\n \n$\n886.2\n \n$\n1,489.5\n \n$\n1,497.8\n \n____________\n(1)\nThe base interest rate is the secured overnight financing rate (SOFR) plus a \n0.10\n% adjustment (Adjusted SOFR).\n(2)\nThe company's senior note indentures contain certain restrictions on mergers or consolidations. Beyond these items, there are no other restrictive covenants in the indentures.\n(3)\nOn January 30, 2024, the outstanding balance of the $\n600.0\n million senior notes was paid in full.    \n    \n(4)\nThe difference between the principal amounts and the carrying values of the senior notes in the table above reflect the unamortized debt issuance costs and discounts.\nThe fair market value of the company's senior notes was determined by market quotes provided by a third-party pricing service, which utilizes Level 2 valuation inputs. In the absence of an active market, the company relies upon the average price quoted by brokers for determining the fair market value of the debt. \n    \nAt December 31, 2024, the outstanding balance on the revolving credit agreement was \nzero\n. Borrowings under the revolving credit agreement will bear interest at (i) Adjusted SOFR for specified interest periods or (ii) a floating base rate (based upon the highest of (a) the Bank of America prime rate, (b) the Federal Funds rate plus \n0.50\n% and (c) Adjusted SOFR for an interest period of one month plus \n1.00\n%), plus, in either case, an applicable margin determined with reference to the higher of the available credit ratings of the Parent or its indirect subsidiary, Invesco Finance PLC. Based on credit ratings of the Parent as of December 31, 2024 and December 31, 2023, the applicable margin for SOFR-based loans was \n1.13\n% and for base rate loans was \n0.13\n%. In addition, the company is required to pay the lenders a facility fee on the aggregate commitments of the lenders (whether or not used) at a rate per annum which is based on the higher of the available credit ratings of the Parent or its indirect subsidiary, Invesco Finance PLC. Based on credit ratings as of December 31, 2024 and December 31, 2023, the annual facility fee was equal to \n0.13\n% for both periods. \nThe revolving credit agreement contains customary restrictive covenants on the company and its subsidiaries. Restrictive covenants in the revolving credit agreement include, but are not limited to: prohibitions on creating, incurring or assuming any liens; entering into merger arrangements; selling, leasing, transferring or otherwise disposing of assets; making a material change in the nature of the business; making a significant accounting policy change in certain situations; entering into transactions with affiliates; and incurring indebtedness through the subsidiaries (other than the borrower, Invesco Finance PLC). Many of these restrictions are subject to certain minimum thresholds and exceptions. Financial covenants under the revolving credit agreement include: (i) the quarterly maintenance of a debt/Covenant Adjusted EBITDA leverage ratio, as defined in the revolving credit agreement, of not greater than \n3.25\n:1.00, (ii) an interest coverage ratio (Covenant Adjusted EBITDA, as defined in the revolving credit agreement/interest expense for the four consecutive fiscal quarters ended before the date of determination) of not less than \n4.00\n:1.00. The company is in compliance with all restrictive debt covenants as of December 31, 2024.\nThe revolving credit agreement also contains customary provisions regarding events of default which could result in an acceleration or increase in amounts due, including (subject to certain materiality thresholds and grace periods) payment default, failure to comply with covenants, material inaccuracy of representation or warranty, bankruptcy or insolvency proceedings, change of control, certain judgments, ERISA matters, cross-default to other debt agreements, governmental action prohibiting or restricting the company or its subsidiaries in a manner that has a material adverse effect, and failure of certain guaranty obligations.\n85\nTable of Contents\n    \n                                 \n9.  \nSHARE CAPITAL \nThe preferred shares have a $\n0.20\n par value, liquidation preference of $\n1,000\n per share and fixed cash dividend rate of \n5.90\n% per annum, payable quarterly on a non-cumulative basis. Shares of preferred stock are not redeemable prior to the 21\nst\n anniversary of their original issue date of May 24, 2019. \nThe number of preferred shares issued and outstanding is represented in the table below:\nin millions\nDecember 31, 2024\nDecember 31, 2023\nPreferred shares issued \n(1)\n4.0\n4.0\nPreferred shares outstanding \n(1)\n4.0\n4.0\n__________\n(1)    \nThe \nfive-year\n lock-up period which prohibited the sale of preferred shares by MassMutual expired on May 24, 2024.\nThe number of common shares and common share equivalents issued are represented in the table below:\nin millions\nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nCommon shares issued\n566.1\n \n566.1\n \n566.1\n \nLess: Treasury shares for which dividend and voting rights do not apply\n(\n118.1\n)\n(\n116.6\n)\n(\n111.3\n)\nCommon shares outstanding\n448.0\n \n449.5\n \n454.8\n \nDuring the year ended December 31, 2024, the company repurchased \n2.9\n million common shares in the open market at a cost of $\n49.6\n million (December 31, 2023: \n9.6\n million common shares at a cost of $\n150.0\n million). Separately, an aggregate of \n2.0\n million shares were withheld on vesting events during the year ended December 31, 2024 to meet employees' withholding tax obligations (December 31, 2023: \n1.9\n million). The fair value of the common shares withheld at the respective withholding dates was $\n29.7\n million (December 31, 2023: $\n37.5\n million). At December 31, 2024, approximately $\n332.6\n million remained authorized under the company's common share repurchase authorization approved by the Board on July 22, 2016 (December 31, 2023: $\n382.2\n million). \nTotal treasury shares at December 31, 2024 were \n123.0\n million (December 31, 2023: \n124.7\n million), including \n4.9\n million unvested restricted common stock awards (December 31, 2023: \n8.1\n million) for which dividend and voting rights apply. The market price of common shares on December 31, 2024 was $\n17.48\n. The total market value of the company's \n123.0\n million treasury shares was $\n2.2\n billion at December 31, 2024.\nMovements in Treasury Shares comprise: \nin millions\n2024\n2023\n2022\nBeginning balance on January 1\n124.7\n \n119.5\n \n115.7\n \nAcquisition of common shares\n4.9\n \n11.5\n \n11.3\n \nDistribution of common shares\n(\n6.2\n)\n(\n6.0\n)\n(\n7.1\n)\nCommon shares distributed to meet ESPP obligation\n(\n0.4\n)\n(\n0.3\n)\n(\n0.4\n)\nEnding balance on December 31\n123.0\n \n124.7\n \n119.5\n \n86\nTable of Contents\n    \n                                 \n10.  \nOTHER COMPREHENSIVE INCOME/(LOSS) \nThe components of accumulated other comprehensive income/(loss) were as follows:\n2024\n(in millions)\nForeign currency translation\nEmployee benefit plans\nTotal\nOther comprehensive income/(loss), net of tax:\nCurrency translation differences on investments in foreign subsidiaries\n$\n(\n234.3\n)\n$\n—\n \n$\n(\n234.3\n)\nOther comprehensive income/(loss), net\n—\n \n—\n \n—\n \nOther comprehensive income/(loss), net of tax\n(\n234.3\n)\n—\n \n(\n234.3\n)\nBeginning balance on January 1\n(\n670.1\n)\n(\n131.7\n)\n(\n801.8\n)\nOther comprehensive income/(loss), net of tax\n(\n234.3\n)\n—\n \n(\n234.3\n)\nEnding balance on December 31\n$\n(\n904.4\n)\n$\n(\n131.7\n)\n$\n(\n1,036.1\n)\n2023\n(in millions)\nForeign currency translation\nEmployee benefit plans\nTotal\nOther comprehensive income/(loss), net of tax:\nCurrency translation differences on investments in foreign subsidiaries\n$\n144.9\n \n$\n—\n \n$\n144.9\n \nOther comprehensive income/(loss), net\n—\n \n(\n4.3\n)\n(\n4.3\n)\nOther comprehensive income/(loss), net of tax\n144.9\n \n(\n4.3\n)\n140.6\n \nBeginning balance on January 1\n(\n815.0\n)\n(\n127.4\n)\n(\n942.4\n)\nOther comprehensive income/(loss), net of tax\n144.9\n \n(\n4.3\n)\n140.6\n \nEnding balance on December 31\n$\n(\n670.1\n)\n$\n(\n131.7\n)\n$\n(\n801.8\n)\n2022\n(in millions)\nForeign currency translation\nEmployee benefit plans\nTotal\nOther comprehensive income/(loss) net of tax:\nCurrency translation differences on investments in foreign subsidiaries\n$\n(\n463.1\n)\n$\n—\n \n$\n(\n463.1\n)\nOther comprehensive income/(loss), net\n—\n \n(\n37.8\n)\n(\n37.8\n)\nOther comprehensive income/(loss), net of tax\n(\n463.1\n)\n(\n37.8\n)\n(\n500.9\n)\nBeginning balance on January 1\n(\n351.9\n)\n(\n89.6\n)\n(\n441.5\n)\nOther comprehensive income/(loss), net of tax\n(\n463.1\n)\n(\n37.8\n)\n(\n500.9\n)\nEnding balance on December 31\n$\n(\n815.0\n)\n$\n(\n127.4\n)\n$\n(\n942.4\n)\n11.  \nCOMMON SHARE-BASED COMPENSATION\nThe company recognized total compensation expense of\n \n$\n104.6\n million\n,\n $\n114.6\n million and $\n106.2\n million related to equity-settled common share-based compensation for the years ended December 31, 2024, 2023 and 2022, respectively. The income tax benefit recognized in the Consolidated Statements of Income for common share-based compensation arrangements wa\ns\n $\n22.1\n million for 2024 (2023: $\n17.4\n million; 2022: $\n21.7\n million).\nEmployee common share awards are broadly classified into \ntwo\n categories: time-vested and performance-vested. Time-vested awards vest ratably over a defined period of continued employee service. Performance-vested awards vest upon (i) the company's attainment of certain pre-established performance criteria, and (ii) a defined period of continued employee service. \n87\nTable of Contents\n    \n                                 \nTime-vested and performance-vested equity awards are granted in the form of restricted stock awards (RSAs) or restricted stock units (RSUs). With respect to the performance-vested awards granted in February 2022, 2023 and 2024, vesting is tied to the achievement of specific levels of adjusted operating margin and relative total shareholder return with vesting ranging from \n0\n% to \n150\n%. \nEmployee common share awards are measured at fair value based on Invesco's common stock price at the date of grant and are expensed on a straight-line or accelerated basis over the vesting period. \nWith respect to time-vested awards, dividends accrue directly to the employee holder of RSAs, and cash payments in lieu of dividends are made to employee holders of RSUs. With respect to performance-vested awards, cash payments in lieu of dividends are deferred and are paid at the same rate as on the underlying shares if and to the extent the award vests.\nThe 2016 Global Equity Incentive Plan, which was originally approved by the company's common shareholders in May 2016 and most recently amended and restated in July 2024, authorizes the issuance of up to \n21.2\n million shares. In May 2010, the board approved the 2010 Global Equity Incentive Plan ST (GEIP ST). The GEIP ST authorizes the issuance of up to \n8.5\n million shares. With respect to the GEIP ST, awards are only granted as employment inducement awards in connection with a strategic transaction and, as a result, do not require shareholder approval under the rules of the NYSE or otherwise.\nMovements on employee common share awards during the years ended December 31, 2024, 2023 and 2022 were detailed below:\n2024\n2023\n2022\n(in millions of common shares, except fair values)\nTime-Vested\nPerformance-Vested\nWeighted Average Grant Date Fair Value \nTime-Vested\nPerformance-Vested\nTime-Vested\nPerformance-Vested\nUnvested at the beginning of year\n10.4\n \n1.6\n \n$\n18.84\n \n10.3\n \n2.1\n \n13.5\n \n1.9\n \nGranted\n5.0\n \n0.9\n \n15.20\n \n5.7\n \n0.3\n \n3.6\n \n1.0\n \nForfeited/Canceled due to performance measures\n(\n0.5\n)\n(\n0.1\n)\n17.72\n \n(\n0.3\n)\n(\n0.2\n)\n(\n0.3\n)\n(\n0.1\n)\nVested and distributed\n(\n5.1\n)\n(\n1.0\n)\n18.52\n \n(\n5.3\n)\n(\n0.6\n)\n(\n6.5\n)\n(\n0.7\n)\nUnvested at the end of the year\n9.8\n \n1.4\n \n$\n17.17\n \n10.4\n \n1.6\n \n10.3\n \n2.1\n \n___________\nThe total fair value of common shares that vested during 2024 wa\ns \n$\n95.7\n million (2023: $\n101.4\n million; 2022: $\n141.8\n million). The weighted average grant date fair value of the U.S. dollar share awards that were granted during 2024 was $\n15.20\n (2023: $\n17.53\n; 2022: $\n21.23\n).\nAt December 31, 2024, there was $\n94.7\n million of total unrecognized compensation cost related to non-vested common share awards; that cost is expected to be recognized over a weighted average period of \n2.30\n years.\n12.  \nRETIREMENT BENEFIT PLANS \nDefined Contribution Plans\nThe company operates defined contribution retirement benefit plans for all qualifying employees. The assets of the plans are held separately from those of the company in funds under the control of trustees. When employees leave the plans prior to vesting fully in the contributions, the contributions payable by the company may be reduced by the amount of forfeited contributions.\nThe total amounts charged to the Consolidated Statements of Income for the year ended December 31, 2024 of $\n75.4\n million (December 31, 2023: $\n73.9\n million, December 31, 2022: $\n76.4\n million) represent contributions paid or payable to these plans by the company at rates specified in the rules of the plans. As of December 31, 2024, accrued contributions of $\n13.0\n million (December 31, 2023: $\n12.9\n million) for the current year will be paid to the plans.\n88\nTable of Contents\n    \n                                 \nDefined Benefit Plans\nThe company maintains legacy defined benefit pension plans for qualifying employees of its subsidiaries in the U.K., Ireland, Germany and Taiwan. All defined benefit plans are closed to new participants.\nThe most recent actuarial valuations of plan assets and the present value of the defined benefit obligation were valued as of December 31, 2024. The benefit obligation, related current service cost and prior service cost were measured using the projected unit credit method.\nBenefit Obligations and Funded Status\nThe amounts included in the Consolidated Balance Sheets arising from the company's obligations and plan assets in respect of its defined benefit retirement plans were as follows:\n(in millions)\n2024\n2023\nBenefit obligation\n$\n(\n285.7\n)\n$\n(\n325.8\n)\nFair value of plan assets\n304.7\n \n350.1\n \nFunded status\n$\n19.0\n \n$\n24.3\n \nAmounts recognized in the Consolidated Balance Sheets:\nOther assets\n$\n21.9\n \n$\n27.0\n \nAccrued compensation and benefits\n(\n2.9\n)\n(\n2.7\n)\nFunded status\n$\n19.0\n \n$\n24.3\n \nChanges in the benefit obligations were as follows:\n(in millions)\n2024\n2023\nJanuary 1\n$\n325.8\n \n$\n303.0\n \nService cost\n0.1\n \n0.2\n \nInterest cost\n14.0\n \n14.0\n \nActuarial (gains)/losses\n(\n35.6\n)\n5.0\n \nExchange difference\n(\n6.9\n)\n17.2\n \nBenefits paid\n(\n11.7\n)\n(\n13.6\n)\nDecember 31\n$\n285.7\n \n$\n325.8\n \nKey assumptions used in plan valuations are detailed below. Appropriate local mortality tables were also used. \nThe weighted average assumptions used to determine defined benefit obligations at December 31, 2024 and 2023 were as follows:\n2024\n2023\nDiscount rate\n5.23\n \n%\n4.37\n \n%\nExpected rate of salary increases\n2.90\n \n%\n2.87\n \n%\nFuture pension trend rate increases\n3.29\n \n%\n3.28\n \n%\nChanges in the fair value of plan assets in the current period were as follows:\nRetirement Plans\n(in millions)\n2024\n2023\nJanuary 1\n$\n350.1\n \n$\n335.8\n \nActual return on plan assets\n(\n26.8\n)\n8.4\n \nForeign currency changes\n(\n7.1\n)\n19.3\n \nContributions from the company\n0.2\n \n0.2\n \nBenefits paid\n(\n11.7\n)\n(\n13.6\n)\nDecember 31\n$\n304.7\n \n$\n350.1\n \n89\nTable of Contents\n    \n                                 \nThe components of the amount recognized in accumulated other comprehensive income at December 31, 2024 and 2023 were as follows:\nRetirement Plans\n(in millions)\n2024\n2023\nPrior service cost/(credit)\n$\n5.3\n \n$\n5.6\n \nNet actuarial loss/(gain)\n157.1\n \n156.5\n \nTotal\n$\n162.4\n \n$\n162.1\n \nThe amounts in accumulated other comprehensive income expected to be amortized into the Consolidated Income Statement during the year ending December 31, 2025 are as follows:\n(in millions)\nRetirement Plans\nPrior service cost/(credit)\n$\n0.3\n \nNet actuarial loss/(gain)\n5.0\n \nTotal\n$\n5.3\n \nThe total accumulated and projected benefit obligation and fair value of plan assets for plans with accumulated and projected benefit obligations in excess of plan assets were as follows:\nRetirement Plans\n(in millions)\n2024\n2023\nPlans with accumulated and projected benefit obligation in excess of plan assets:\n  Accumulated and projected benefit obligation\n$\n4.3\n \n$\n4.2\n \n  Fair value of plan assets\n$\n1.4\n \n$\n1.5\n \nNet Periodic Benefit Cost\nThe components of net periodic benefit cost in respect of these defined benefit plans were as follows:\nRetirement Plans\n(in millions)\n2024\n2023\n2022\nService cost\n$\n0.1\n \n$\n0.2\n \n$\n—\n \nInterest cost\n14.0\n \n14.0\n \n8.8\n \nExpected return on plan assets\n(\n14.2\n)\n(\n14.7\n)\n(\n13.5\n)\nAmortization of prior service cost/(credit)\n0.2\n \n0.5\n \n0.2\n \nAmortization of net actuarial (gain)/loss\n4.8\n \n3.8\n \n0.8\n \nNet periodic benefit cost/(credit)\n$\n4.9\n \n$\n3.8\n \n$\n(\n3.7\n)\nThe weighted average assumptions used to determine net periodic benefit cost for the years ended December 31, 2024, 2023 and 2022 were:\nRetirement Plans\n2024\n2023\n2022\nDiscount rate\n4.37\n \n%\n4.55\n \n%\n1.91\n \n%\nExpected return on plan assets\n5.02\n \n%\n4.13\n \n%\n3.28\n \n%\nExpected rate of salary increases\n2.87\n \n%\n2.97\n \n%\n3.10\n \n%\nFuture pension rate increases\n3.28\n \n%\n3.35\n \n%\n3.29\n \n%\nIn developing the expected rate of return, the company considers long-term compound annualized returns based on historical and current market data. Using this reference information, the company develops forward-looking return expectations for each asset category and an expected long-term rate of return for a targeted portfolio. Discount rate assumptions were based upon AA-rated corporate bonds of suitable terms and currencies.\n90\nTable of Contents\n    \n                                 \nPlan Assets\nThe analysis of the plan assets as of December 31, 2024 was as follows:\n(in millions)\n2024\n% of Plan Assets\nCash and cash equivalents\n$\n13.8\n \n4.5\n \n%\nFund investments\n92.7\n \n30.4\n \n%\nEquity securities\n17.9\n \n5.9\n \n%\nGovernment debt securities\n13.3\n \n4.4\n \n%\nGuaranteed investments contracts\n85.5\n \n28.1\n \n%\nOther investments\n81.5\n \n26.7\n \n%\nTotal\n$\n304.7\n \n100.0\n \n%\nThe analysis of the plan assets as of December 31, 2023 was as follows:\n(in millions)\n2023\n% of Plan Assets\nCash and cash equivalents\n$\n36.9\n \n10.5\n \n%\nFund investments\n75.6\n \n21.6\n \n%\nEquity securities\n15.7\n \n4.5\n \n%\nGovernment debt securities\n16.3\n \n4.7\n \n%\nGuaranteed investments contracts\n97.0\n \n27.7\n \n%\nOther investments\n108.6\n \n31.0\n \n%\nTotal\n$\n350.1\n \n100.0\n \n%\nPlan assets are not held in company stock. The investment policies and strategies for plan assets held by defined benefit plans include:\n•\nFunding - to have sufficient assets available to pay members benefits;\n•\nSecurity - to maintain the minimum Funding Requirement;\n•\nStability - to have due regard to the employer's ability in meeting contribution payments given their size and incidence.\nThe following is a description of the valuation methodologies used for each major category of plan assets measured at fair value. Information about the valuation hierarchy levels used to measure fair value is detailed in Note 2, “Fair Value of Assets and Liabilities.”\nCash and cash equivalents\nCash equivalents include cash in the bank and cash investments in money market funds. Cash investments in money market funds are valued under the market approach through the use of quoted market prices in an active market, which is the NAV of the underlying funds, and are classified within level 1 of the valuation hierarchy. \nFund investments\nThese plan assets are primarily invested in affiliated funds and are classified within level 1 of the valuation hierarchy. They are valued at the NAV of common shares held by the plan at year end. \nEquity securities, government debt securities and other investments\nThese plan assets are classified within level 1 of the valuation hierarchy and are valued at the closing price reported on the active market on which the individual securities are traded. \n91\nTable of Contents\n    \n                                 \nGuaranteed investment contracts\nThese plan assets are classified within level 3 of the valuation hierarchy and are valued through use of unobservable inputs by discounting the related cash flows based on current yields of similar instruments with comparable durations considering the credit-worthiness of the issuer. \nCash Flows\nThe estimated amounts of contributions expected to be paid to the plans \nduring \n2025\n \nare $\n0.2\n million. There are no future annual benefits of plan participants covered by insurance contracts issued by the employer or related parties.\nThe benefits expected to be paid in each of the next five fiscal years and in the five fiscal years thereafter are as follows:\n(in millions)\nExpected benefit payments:\n2025\n$\n10.0\n \n2026\n$\n10.4\n \n2027\n$\n10.6\n \n2028\n$\n11.0\n \n2029\n$\n11.5\n \nThereafter in the succeeding five years\n$\n65.7\n \n13.  \nOPERATING LEASES \nThe company leases office space in almost all its business locations and data centers and has certain equipment under non-cancelable operating leases. The operating leases have a weighted-average remaining lease term of \n9.93\n years for the year ended December 31, 2024 (2023: \n9.95\n years) and generally include \none\n or more options to renew, with renewal terms that can extend the lease term from \n1\n to \n10\n years. Certain lease arrangements include an option to terminate the lease if a notification is provided to the landlord within \n1\n to \n4.2\n years prior to the end of the lease term. The company has sole discretion in exercising lease renewal and termination options. The lease terms used in the company’s lease measurements do not include renewal options as they are not reasonably certain to be exercised as of the date of this report.\nThe company elected to combine lease and non-lease components in calculating the lease liability and right-of-use asset for operating leases.\nVariable lease payments are determined based on the terms and conditions outlined in the lease contracts and are primarily determined in relation to the extent of the company’s usage of the right-of-use asset or the nature and extent of services received from the lessor. Variable lease costs consists primarily of common area maintenance and other operating expenses as negotiated with the lessor.\nAs of December 31, 2024, the right-of-use asset o\nf\n $\n335.3\n million was included in \nOther assets\n, and the lease liability of $\n454.9\n million was included in Accounts payable and accrued expenses, on the Consolidated Balance Sheets.\nThe components of lease expense for the years ended December 31, 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nOperating lease cost\n$\n73.7\n \n$\n75.4\n \n$\n82.9\n \nVariable lease cost\n27.9\n25.9\n19.0\nLess: sublease income\n(\n1.9\n)\n(\n2.3\n)\n(\n1.6\n)\nTotal lease expense\n$\n99.7\n \n$\n99.0\n \n$\n100.3\n \n92\nTable of Contents\n    \n                                 \nSupplemental cash flow information related to leases for the years ended December 31, 2024 and 2023 was as follows:\n(in millions)\n2024\n2023\nCash outflows from operating leases included in the measurement of lease liabilities\n$\n75.0\n \n$\n80.8\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n57.2\n \n$\n22.7\n \nIn determining the discount rate, the company considered the interest rate yield for specific interest rate environments and the company’s credit spread at the inception of the lease.\nThe weighted-average discount rate for the operating lease liability for the year ended December 31, 2024 was \n4.42\n% \n(2023: \n4.14\n%).\nAs of December 31, 2024, the maturities of the company’s lease liabilities (primarily related to real estate leases) were as follows:\n(in millions)\n2025\n$\n66.2\n \n2026\n69.3\n \n2027\n64.8\n \n2028\n55.6\n \n2029\n40.4\n \nThereafter\n267.8\n \nTotal lease payments\n564.1\n \nLess: interest\n(\n109.2\n)\nPresent value of lease liabilities\n$\n454.9\n \n14.  \nTAXATION\nThe components of the company's income tax expense (benefit) for the years ended December 31, 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nCurrent:\nFederal\n$\n201.2\n \n$\n164.0\n \n$\n214.1\n \nState\n51.3\n \n42.7\n \n50.2\n \nForeign\n38.5\n \n32.8\n \n9.6\n \n$\n291.0\n \n$\n239.5\n \n$\n273.9\n \nDeferred:\nFederal\n$\n(\n19.3\n)\n$\n(\n235.3\n)\n$\n35.2\n \nState\n(\n2.0\n)\n(\n44.1\n)\n(\n1.1\n)\nForeign\n(\n16.8\n)\n(\n29.8\n)\n14.2\n \n(\n38.1\n)\n(\n309.2\n)\n48.3\n \nTotal income tax expense (benefit)\n$\n252.9\n \n$\n(\n69.7\n)\n$\n322.2\n \n93\nTable of Contents\nA reconciliation between the statutory U.S. federal income tax rate and the effective tax rate per the Consolidated Statements of Income for the years ended December 31, 2024, 2023 and 2022 is as follows:\n2024\n2023 \n(1)\n2022\nStatutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal tax effect\n3.9\n \n%\n3.2\n \n%\n3.1\n \n%\nForeign tax rate differential\n(\n2.8\n)\n%\n11.1\n \n%\n1.3\n \n%\nIncome/(loss) attributable to noncontrolling interests in consolidated entities\n0.5\n \n%\n(\n6.3\n)\n%\n(\n0.1\n)\n%\nIncome/(loss) attributable to equity method investments in corporate joint ventures\n(\n1.3\n)\n%\n7.4\n \n%\n(\n1.7\n)\n%\nValuation allowance\n1.2\n \n%\n(\n2.9\n)\n%\n—\n \n%\nNondeductible regulatory settlements\n1.1\n \n%\n—\n \n%\n—\n \n%\nNondeductible executive compensation\n—\n \n%\n(\n4.6\n)\n%\n—\n \n%\nNontaxable gain\n—\n \n%\n3.9\n \n%\n—\n \n%\nOther\n1.6\n \n%\n(\n3.5\n)\n%\n2.2\n \n%\nEffective tax rate per Consolidated Statements of Income\n25.2\n \n%\n29.3\n \n%\n25.8\n \n%\n__________\n(1)    Certain signs within the table in the year ended  December 31, 2023 are the opposite compared to the years ended December 31, 2024 and 2022 as a result of applying each line’s total income tax benefit or expense to the loss before income taxes.\nThe company’s effective tax rate is affected by the tax rates in foreign jurisdictions, which are different than the U.S. federal statutory tax rate of 21%, and the relative amount of income earned in those jurisdictions. As a result, the effective tax rate will vary from year to year depending on the mix of the profits and losses from each jurisdiction.\nThe components of income/(loss) before taxes for the years ended December 31, 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nDomestic\n$\n850.6\n \n$\n(\n469.2\n)\n$\n1,212.0\n \nForeign\n154.7\n \n231.3\n \n35.7\n \nIncome/(loss) before income taxes\n$\n1,005.3\n \n$\n(\n237.9\n)\n$\n1,247.7\n \nThe components of the deferred tax assets and liabilities reflected in the Consolidated Balance Sheets at December 31, 2024 and 2023 included the following:\n(in millions)\n2024\n2023\nDeferred tax assets:\nCompensation and benefits\n$\n118.3\n \n$\n95.6\n \nLease obligations\n85.5\n \n66.7\n \nNet operating loss carryforwards\n165.0\n \n154.3\n \nFixed assets\n24.9\n \n15.7\n \nAccrued liabilities\n38.0\n \n34.4\n \nOther\n4.7\n \n4.9\n \nTotal deferred tax assets\n436.4\n \n371.6\n \nValuation allowance\n(\n99.2\n)\n(\n98.9\n)\nDeferred tax assets, net of valuation allowance\n337.2\n \n272.7\n \nDeferred tax liabilities:\nGoodwill and intangibles\n(\n1,522.1\n)\n(\n1,519.1\n)\nLeased assets\n(\n60.0\n)\n(\n55.9\n)\nOther\n(\n27.3\n)\n(\n21.8\n)\nTotal deferred tax liabilities\n(\n1,609.4\n)\n(\n1,596.8\n)\nNet deferred tax liability\n$\n(\n1,272.2\n)\n$\n(\n1,324.1\n)\n94\nTable of Contents\nDeferred income tax assets and liabilities are recorded net when related to the same tax jurisdiction. At December 31, 2024, the company recorded on the Consolidated Balance Sheets net deferred tax assets of $\n9.7\n million in Other assets and net Deferred tax liabilities of $\n1,281.9\n million. At December 31, 2023, the company recorded on the Consolidated Balance Sheets net deferred tax assets of $\n1.6\n million in Other assets and net Deferred tax liabilities of $\n1,325.7\n million.\nAt December 31, 2024, the company had state net operating loss carryforwards of $\n33.5\n million, which will expire, if not utilized, between 2025 and 2038 except for approximately $\n4.1\n million which have an indefinite life. At December 31, 2024, the company also had federal and foreign net operating loss carryforwards of $\n131.5\n million, of which approximately $\n8.6\n million will expire over several years starting in 2025, with the remaining $\n122.9\n million having an indefinite life. A valuation allowance has been recorded against certain carryforwards and certain deferred tax assets related to tax jurisdictions in which it is unlikely that the deferred tax asset will be realized.\nDeferred tax liabilities are recognized for taxes that would be payable on the unremitted earnings of the company's foreign subsidiaries and corporate joint ventures, except where it is our intention to indefinitely reinvest the undistributed earnings. A deferred tax liability has not been recognized for our Canadian unremitted earnings, which are indefinitely reinvested, of approximately $\n989.1\n million and $\n1,068.8\n million at December 31, 2024 and 2023, respectively. If these earnings were distributed as a dividend, Canadian withholding tax of \n5.0\n% would be due on the dividend. There are no other significant jurisdictions for which a deferred tax liability has not been recognized on unremitted earnings.\nA reconciliation of the gross UTBs for the years ended December 31, 2024, 2023 and 2022 is as follows: \n(in millions)\n2024\n2023\n2022\nBalance at January 1\n$\n91.3\n \n$\n100.2\n \n$\n86.6\n \nAdditions for tax positions related to the current year\n11.7\n \n9.6\n \n16.2\n \nAdditions for tax positions related to prior years\n1.3\n \n1.3\n \n3.1\n \nReductions for tax positions related to prior years\n(\n0.6\n)\n(\n7.7\n)\n(\n1.2\n)\nReductions related to lapse of statute of limitations\n(\n4.4\n)\n(\n1.8\n)\n(\n2.1\n)\nReductions related to settlements\n—\n \n(\n10.3\n)\n(\n2.4\n)\nBalance at December 31\n$\n99.3\n \n$\n91.3\n \n$\n100.2\n \nThe amount of UTBs that, if recognized, would favorably affect the company's effective tax rate was $\n78.9\n million at December 31, 2024. The company recognizes accrued interest and penalties related to UTBs as a component of the income tax provision. The Consolidated Balance Sheets include accrued interest and penalties related to UTBs of $\n21.6\n million, $\n17.0\n million and $\n15.1\n million at December 31, 2024, 2023 and 2022, respectively. The company recognized expense for interest and penalties related to UTBs of $\n4.5\n million, $\n1.9\n million and $\n1.4\n million in 2024, 2023 and 2022, respectively.\nThe company files U.S. federal, U.S. state and local, and numerous foreign income tax returns. The company is periodically examined by various taxing authorities. With few exceptions, the company is no longer subject to income tax examinations for years prior to 2014. As a result of the completion of taxing authorities' examinations and the expiration of statutes of limitations, it is reasonably possible that the company's gross UTBs may decrease by as much as $\n11.0\n million within the next twelve months.\n95\nTable of Contents\n15.  \nEARNINGS PER COMMON SHARE \nThe calculation of EPS for the years ended December 31, 2024, 2023 and 2022 is as follows:\n(In millions, except per share data)\n2024\n2023\n2022\nNet income/(loss) attributable to Invesco Ltd.\n$\n538.0\n \n$\n(\n333.7\n)\n$\n683.9\n \nInvesco Ltd:\nWeighted average common shares outstanding - basic\n457.0\n \n454.8\n \n457.5\n \nDilutive effect of non-participating common share-based awards\n0.7\n \n1.4\n \n2.0\n \nWeighted average common shares outstanding - diluted\n457.7\n \n456.2\n \n459.5\n \nEarnings per common share:\n-basic\n$\n1.18\n \n$\n(\n0.73\n)\n$\n1.50\n \n-diluted\n$\n1.18\n \n$\n(\n0.73\n)\n$\n1.49\n \nCertain performance-vested awards are excluded from diluted EPS share calculations as the designated contingency was not met.\n16.  \nSEGMENT AND GEOGRAPHIC INFORMATION \nThe company has \none\n operating segment, investment management. \nThe company’s CODM is the President and CEO as he assesses the company’s performance and makes decisions about resource allocation. Net income/(loss) is one of the performance measures used by the CODM to evaluate the segment's performance and allocate capital\n.\n When assessing performance, the CODM uses regularly provided GAAP and non-GAAP financial information and metrics to monitor actual results against forecasts, prior period results and peers’ results. The information regularly provided to the CODM on the segment's revenues and significant expenses aligns with the categories presented in the Consolidated Statements of Income. The segment's assets are reported on the Consolidated Balance Sheets as Total assets.\nGeographical information is presented below. There are no revenues or long-lived assets attributed to the company's country of domicile, Bermuda.\n(in millions)\nAmericas\nAPAC\nEMEA\nTotal\nFor the year ended December 31, 2024\nTotal operating revenues \n(1)\n$\n4,653.1\n \n$\n270.9\n \n$\n1,143.0\n \n$\n6,067.0\n \nLong-lived assets\n$\n312.8\n \n$\n33.7\n \n$\n132.5\n \n$\n479.0\n \nFor the year ended December 31, 2023\nTotal operating revenues \n(1)\n$\n4,380.3\n \n$\n263.8\n \n$\n1,072.3\n \n$\n5,716.4\n \nLong-lived assets\n$\n416.0\n \n$\n40.0\n \n$\n143.5\n \n$\n599.5\n \nFor the year ended December 31, 2022\nTotal operating revenues \n(1)\n$\n4,665.1\n \n$\n284.9\n \n$\n1,098.9\n \n$\n6,048.9\n \nLong-lived assets\n$\n395.4\n \n$\n28.0\n \n$\n137.7\n \n$\n561.1\n \n__________\n(1)    Operating revenues reflect the geographical regions from which services are provided.\n96\nTable of Contents\n17.  \nCOMMITMENTS AND CONTINGENCIES\nCommitments and contingencies may arise in the ordinary course of business.    \nThe company has committed to co-invest in certain investment products which may be called in future periods. At December 31, 2024, the company’s undrawn co-invest capital commitments were $\n693.7\n million (December 31, 2023: $\n623.3\n million). \nCertain of our managed investment products have entered into revolving credit facilities with financial institutions. The company provided equity commitments and guarantees to the financial institutions for certain of these revolving credit facilities that are temporary in nature. The revolving credit facilities look first to the respective investment products for repayment and servicing. The company’s equity commitment or guarantee would only be called in the event a particular investment product is unable to meet its obligation. The company believes the likelihood of being required to fund its equity commitments or guarantees under these arrangements to be remote. To date, the company has not been required to fund any equity commitments or guarantees under these arrangements. The maximum amount of future payments under the commitments is $\n219.5\n million and under the guarantees is $\n65.0\n million. The fair value of the guarantee liability is not significant to the consolidated financial statements.\nThe company and some of its subsidiaries have entered into agreements with financial institutions to guarantee certain obligations of other company subsidiaries. The company would be required to perform under these guarantees in the event of certain defaults. The company has not had prior claims or losses pursuant to these contracts and expects the risk of loss to be remote.\nLegal Contingencies \nThe company is from time to time involved in pending or threatened litigation relating to claims arising in the ordinary course of its business. The nature and progression of litigation can make it difficult to predict the impact a particular lawsuit or claim will have on the company. There are many reasons that the company cannot make these assessments, including, among others, one or more of the following: the proceeding is in its early stages (or merely threatened); the damages sought are unspecified, unsupportable, unexplained or uncertain; the claimant is seeking relief other than compensatory damages; the matter presents novel legal claims or other meaningful legal uncertainties; discovery has not started or is not complete; there are significant facts in dispute; and there are other parties who may share in any ultimate liability.\nThe company and certain related entities have in recent years been subject to various regulatory inquiries, reviews and investigations and legal proceedings, including civil litigation, regulatory investigations and enforcement actions. These actions can arise from normal business operations and/or matters that have been the subject of previous regulatory reviews. As a global company with investment products registered in numerous countries and subject to the jurisdiction of one or more regulators in each country, at any given time, our business operations may be subject to review, investigation, or disciplinary action.\nIn assessing the impact that a legal or regulatory matter will have on the company, management evaluates the need for an accrual on a case-by-case basis. If the likelihood of a loss is deemed probable and is reasonably estimable, the estimated loss is accrued. If the likelihood of a loss is assessed as less than probable, a loss is not accrued. If a loss is deemed probable but an amount or range of loss cannot be reasonably estimated, a loss is not accrued but the matter is disclosed. \nIn management’s opinion, adequate accrual has been made as of December 31, 2024 to provide for any losses that may arise from matters for which the company could reasonably estimate an amount and are deemed probable. Management believes that the ultimate resolution of any litigation or regulatory investigations will not materially affect the company’s business, revenue, net income or liquidity. \nFurther, the investment management industry also is generally subject to extensive levels of ongoing regulatory oversight and examination. In the jurisdictions in which the company operates, governmental authorities regularly make inquiries, hold investigations and administer market conduct examinations with respect to the company’s compliance with applicable laws and regulations. Additional lawsuits or regulatory enforcement actions arising out of these inquiries may in the future be filed against the company, related entities and individuals in the jurisdictions in which the company and its affiliates operate. Any material loss of investor and/or client confidence as a result of such inquiries and/or litigation could result in a significant decline in AUM, which would have an adverse effect on the company’s future financial results and its ability to grow its business.\n \n97\nTable of Contents\n18.  \nCONSOLIDATED INVESTMENT PRODUCTS \nThe company's risk with respect to each investment in CIP is limited to its equity ownership and any uncollected management and performance fees. The company has no right to the benefits from, nor does it bear the risks associated with, these investments, beyond the company's direct investments in, and management and performance fees generated from, the investment products. If the company were to liquidate, these investments would not be available to the general creditors of the company, and as a result, the company does not consider investments held by CIP to be company assets. Additionally, the collateral assets of consolidated CLOs are held solely to satisfy the obligations of the CLOs, and the investors in the consolidated CLOs have no recourse to the general credit of the company for the notes issued by the CLOs. CIP are taxed at the investor level and not at the product level; therefore, there is no tax provision reflected in the net impact of CIP. Substantially all of CIP are VIEs. \nThe following table presents the balances related to CIP that are included on the Consolidated Balance Sheets as well as Invesco's net investment in and net receivables from CIP for each period presented.\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nASSETS\nCash and cash equivalents of CIP\n$\n509.5\n \n$\n462.4\n \nAccounts receivable and other assets of CIP\n372.3\n \n250.1\n \nInvestments of CIP\n7,492.7\n \n8,765.9\n \nInvestments and other assets of CIP\n$\n8,374.5\n \n$\n9,478.4\n \nLIABILITIES\nDebt of CIP\n6,200.9\n \n7,121.8\n \nOther liabilities of CIP\n652.2\n \n492.1\n \nDebt and other liabilities of CIP\n6,853.1\n \n7,613.9\n \nEQUITY\nEquity attributable to redeemable noncontrolling interests\n544.7\n \n745.7\n \nRetained earnings\n—\n \n(\n0.1\n)\nInvesco's net investment in and net receivables from CIP\n412.5\n \n546.2\n \nEquity attributable to nonredeemable noncontrolling interests\n564.2\n \n572.7\n \nTotal liabilities, noncontrolling interests, and equity\n$\n8,374.5\n \n$\n9,478.4\n \nThe following table reflects the impact of consolidation of investment products into the Consolidated Statements of Income for the years ended December 31, 2024, 2023 and 2022.\n(in millions)\n2024\n2023\n2022\nOperating income/(loss)\n$\n(\n60.2\n)\n$\n(\n84.8\n)\n$\n(\n65.7\n)\nOther income/(expense)\n37.8\n \n13.5\n \n70.5\n \nNet (income)/loss attributable to noncontrolling interests in consolidated entities\n22.4\n \n71.3\n \n(\n4.8\n)\nNet income/(loss) attributable to Invesco Ltd.\n$\n—\n \n$\n—\n \n$\n—\n \n98\nTable of Contents\nThe following tables present the fair value hierarchy levels of certain CIP balances which are measured at fair value as of December 31, 2024 and December 31, 2023: \nDecember 31, 2024\n(in millions)\nFair Value Measurements  \nQuoted Prices in Active Markets for Identical Assets (Level 1)\nSignificant Other Observable Inputs (Level 2)\nSignificant Unobservable Inputs \n(Level 3)\nInvestments Measured at NAV as a practical expedient\n(2)\nAssets:\nBank loans\n(1)\n$\n5,793.0\n \n$\n—\n \n$\n5,494.5\n \n$\n298.5\n \n$\n—\n \nBonds\n605.5\n \n17.2\n \n588.3\n \n—\n \n—\n \nEquity securities\n144.5\n \n37.2\n \n22.7\n \n84.6\n \n—\n \nEquity and fixed income mutual funds\n96.5\n \n3.2\n \n93.3\n \n—\n \n—\n \nInvestments in other private equity funds\n414.6\n \n—\n \n—\n \n—\n \n414.6\n \nReal estate investments\n438.6\n \n—\n \n—\n \n—\n \n438.6\n \nTotal assets at fair value\n$\n7,492.7\n \n$\n57.6\n \n$\n6,198.8\n \n$\n383.1\n \n$\n853.2\n \nDecember 31, 2023\n(in millions)\nFair Value Measurements\nQuoted Prices in Active Markets for Identical Assets (Level 1)\nSignificant Other Observable Inputs (Level 2)\nSignificant Unobservable Inputs \n(Level 3)\nInvestments Measured at NAV as a Practical expedient\n(2)\nAssets:\nBank loans\n(1)\n$\n6,837.2\n \n$\n—\n \n$\n6,140.1\n \n$\n697.1\n \n$\n—\n \nBonds\n669.8\n \n13.3\n \n656.2\n \n0.3\n \n—\n \nEquity securities\n231.9\n \n85.2\n \n18.3\n \n128.4\n \n—\n \nEquity and fixed income mutual funds\n137.9\n \n8.0\n \n129.9\n \n—\n \n—\n \nInvestments in other private equity funds\n425.5\n \n—\n \n—\n \n—\n \n425.5\n \nReal estate investments\n463.6\n \n—\n \n—\n \n—\n \n463.6\n \nTotal assets at fair value\n$\n8,765.9\n \n$\n106.5\n \n$\n6,944.5\n \n$\n825.8\n \n$\n889.1\n \n_________\n(1) Bank loan investments, which comprise the majority of the consolidated CLOs' portfolio collateral, are senior secured corporate loans from a variety of industries. Bank loan investments mature at various dates between 2025 and 2032, pay interest at the applicable reference rate plus a spread of up to \n10.95\n%, and typically range in S&P credit rating categories from BBB down to unrated. Notes issued by the consolidated CLOs mature at various dates between 2028 and 2038 and have a weighted average maturity of \neight years\n. The notes are issued in various tranches with different risk profiles. The interest rates are generally variable rates based on the applicable reference rate plus a pre-defined spread, which varies from \n0.40\n% for the more senior tranches to \n8.68\n% for the more subordinated tranches. The investors of the notes are not affiliated with the company and have no recourse to the general credit of the company. The company elected the fair value option for collateral assets held and notes issued by its consolidated CLOs, see Note 1 \"Accounting Policies,\" for details. At December 31, 2024, the unpaid principal balance exceeds the fair value of the senior secured bank loans and bonds by approximately $\n303.9\n million (December 31, 2023: the unpaid principal balance exceeded the fair value of the senior secured bank loans and bonds by approximately $\n340.9\n million). Approximately \n0.37\n% of the collateral assets are in default as of December 31, 2024 \n(\nDecember 31, 2023\n: approximately \n0.07\n% of the collateral assets were in default).\n(2) \nThe table below summarizes as of December 31, 2024 and December 31, 2023, the nature of investments that are valued using the NAV as a practical expedient. Private equity funds are not subject to redemption; however, for certain funds, investors may sell or transfer their interest.  Real estate funds are generally subject to a redemption notice period that requires at least 45 days, and the frequency of redemptions is either quarterly or best efforts.\nDecember 31, 2024\nDecember 31, 2023\n(in millions, except term data)\nFair Value\nTotal Unfunded Commitments\nWeighted Average Remaining Term \nFair Value\nTotal Unfunded Commitments\nWeighted Average Remaining Term \nPrivate equity funds \n$\n414.6\n$\n32.5\n5.2\n years\n$\n425.5\n$\n56.5\n5.9\n years\nReal estate investments \n$\n438.6\n$\n13.7\nN/A\n$\n463.6\n$\n53.8\nN/A\n99\nTable of Contents\nThe following table shows a reconciliation of the beginning and ending fair value measurements for level 3 assets using significant unobservable inputs as of December 31, 2024 and December 31, 2023:\n2024\n2023\n(in millions)\nLevel 3 Assets\nLevel 3 Assets\nBeginning Balance as of January 1\n$\n825.8\n \n$\n368.6\n \nCIP Purchases\n392.5\n \n566.6\n \nCIP Sales\n(\n134.7\n)\n(\n54.9\n)\nDeconsolidation of CIP\n(\n724.9\n)\n(\n0.6\n)\nGains and losses included in the Consolidated Statements of Income\n(\n18.5\n)\n7.9\n \nTransfers from Level 3 into Levels 1 or 2\n(\n169.5\n)\n(\n377.9\n)\nTransfers into Level 3 from Levels 1 or 2\n214.5\n \n310.2\n \nForeign exchange\n(\n2.1\n)\n5.9\n \nEnding Balance as of December 31\n$\n383.1\n \n$\n825.8\n \nNon-consolidated VIEs\nAt December 31, 2024, the company's carrying value and risk of loss with respect to VIEs in which the company is not the primary beneficiary included our investment carrying value of $\n106.1\n million (December 31, 2023: $\n122.9\n million) and unfunded capital commitments of $\n141.2\n million (December 31, 2023: $\n142.5\n million).\n19. \nRELATED PARTIES\nMassMutual owns approximately \n18.2\n% of the common stock of the company and owns substantially all of the outstanding $\n4.0\n billion in perpetual, non-cumulative preferred shares as of December 31, 2024. Based on the level of shares owned by MassMutual and the corresponding customary minority shareholder rights, which includes representation on Invesco’s Board, the company considers MassMutual a related party.\nAdditionally, certain managed funds are deemed to be affiliated entities under the related party definition in ASC 850, “Related Party Disclosures.” The majority of the company's Operating revenues and receivables are from Invesco's managed funds. Related parties also include those defined in the company’s proxy statement. \nRefer to Note 2, \"Fair Value of Assets and Liabilities,\" and Note 3, \"Investments,\" for more information on balances invested in Invesco affiliated funds.\n20. \nSUBSEQUENT EVENTS\nOn January 27, 2025, the company declared a fourth quarter 2024 dividend of $\n0.205\n per common share, payable on March 4, 2025, to common shareholders of record at the close of business on February 14, 2025 with an ex-dividend date of February 14, 2025.\nOn January 27, 2025, the company declared a preferred dividend of $\n14.75\n per preferred share to the holders of preferred shares representing the period from December 1, 2024 through February 28, 2025. The preferred dividend is payable on March 3, 2025.\n100\nTable of Contents\nItem 9.\n  Changes in and Disagreements with Accountants on Accounting and\n \nFinancial Disclosure \nNone\nItem 9A.\n  Controls and Procedures \nEvaluation of Disclosure Controls and Procedures\nManagement, with the participation of the chief executive officer and chief financial officer, has evaluated the effectiveness of our disclosure controls and procedures (as defined in the Securities and Exchange Act of 1934 Rules 13a-15(e) and 15d-15(e)) as of December 31, 2024. Based upon this evaluation, the chief executive officer and chief financial officer concluded that the company’s disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the applicable rules and forms, and that it is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding the required disclosure.\nManagement's report on internal control over financial reporting is located in Item 8, “Financial Statements and Supplementary Data” of this Annual Report on Form 10-K. Our independent registered public accounting firm PricewaterhouseCoopers LL\nP, has issued an attestation report on the effectiveness of our internal control over financial reporting \nfor the year ended December 31, 2024.\nChanges in Internal Control over Financial Reporting\nThere were no changes in internal control over financial reporting that occurred during the three months ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B.\n  Other Information \nRule 10b5-1 Trading Plans\nDuring the fiscal quarter ended December 31, 2024, no director or officer (as defined in Rule 16a-1(f) under the Exchange Act) of Invesco \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement” as each term is defined in Item 408 of Regulation S-K.\nItem 9C.  \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n101\nTable of Contents\nPART III\nItem 10.\n  Directors, Executive Officers and Corporate Governance\nInvesco filed the certification of its Chief Executive Officer with the NYSE in 2024 as required pursuant to Section 303A of the NYSE Listed Company Manual. In addition, Invesco filed the Sarbanes-Oxley Act Section 302 certifications of its Chief Executive Officer and Chief Financial Officer with the SEC, which certifications are attached hereto as Exhibit 31.1 and Exhibit 31.2, respectively.\nInvesco has an \nInsider Trading Policy\n (the “Invesco Ltd. Insider Trading Policy”) that applies to all executive officers, directors, employees, temporary employees, consultants and independent contractors of Invesco and our subsidiaries and certain covered family members and controlled entities. The Insider Trading Policy is designed to promote compliance with insider trading laws, rules and regulations with respect to the purchase, sale and/or other dispositions of Invesco’s securities, as well as the applicable rules and regulations of the NYSE. The Insider Trading Policy addresses the implementation of certain\n \npre-clearance procedures and trading blackout periods in Invesco’ securities (including common stock, debt, options, and other related derivative securities) for covered persons. A copy of the Insider Trading Policy is filed as an exhibit to this Annual Report.\nThe other information required by this Item will be included in the definitive Proxy Statement for the company's annual meeting of shareholders, which will be filed with the SEC no later than 120 days after the close of the fiscal year ended December 31, 2024, under the captions “Our Executive Officers,” “Corporate Governance,” “Board of Directors,” \"Delinquent Section 16(a) Reports\" (to the extent there are any late filings to report) and possibly elsewhere therein. Such information is incorporated into this Item 10 by reference.\nItem 11.\n  Executive Compensation \nThe information required by this Item will be included in the definitive Proxy Statement for the company's annual meeting of shareholders, which will be filed with the SEC no later than 120 days after the close of the fiscal year ended December 31, 2024, under the captions “Board of Directors - Director Compensation,” “Executive Compensation,” “Compensation Committee Interlocks and Insider Participation,” and possibly elsewhere therein. Such information is incorporated into this Item 11 by reference.\nItem 12. \nSecurity Ownership of Certain Beneficial Owners and Management\n \nand Related Stockholder Matters \nThe information required by this Item will be included in the definitive Proxy Statement for the company's annual meeting of shareholders, which will be filed with the SEC no later than 120 days after the close of the fiscal year ended December 31, 2024, under the captions “Executive Compensation,” “Security Ownership of Principal Shareholders,” “Security Ownership of Management,” and possibly elsewhere therein. Such information is incorporated into this Item 12 by reference.\nItem 13. \nCertain Relationships and Related Transactions, and Director\n \nIndependence \nThe information required by this Item will be included in the definitive Proxy Statement for the company's annual meeting of shareholders, which will be filed with the SEC no later than 120 days after the close of the fiscal year ended December 31, 2024, under the captions “Corporate Governance,” “Certain Relationships and Related Transactions,” “Board of Directors,” “Related Person Transaction Policy,” and possibly elsewhere therein. Such information is incorporated into this Item 13 by reference.\nItem 14. \nPrincipal Accountant Fees and Services \nThe information required by this Item will be included in the definitive Proxy Statement for the company's annual meeting of shareholders, which will be filed with the SEC no later than 120 days after the close of the fiscal year ended December 31, 2024, under the captions “Fees Paid to Independent Registered Public Accounting Firm,” “Pre-Approval Process and Policy,” and possibly elsewhere therein. Such information is incorporated into this Item 14 by reference.\n \n102\nTable of Contents\nPART IV\nItem 15. \nExhibits and Financial Statement Schedule \n(a)(1) The Consolidated Financial Statements filed as part of this Report are listed in Item 8, “Financial Statements and Supplementary Data.”\n(a)(2) No financial statement schedules are required to be filed as part of this Report; therefore, all such schedules have been omitted. Such omission has been made on the basis that information is provided in the Consolidated Financial Statements or related footnotes in Item 8, “Financial Statements and Supplementary Data,” or is not required to be filed as the information is not applicable.\n(a)(3) The exhibits listed on the Exhibit Index are included with this Report.\nItem 16. \nForm 10-K Summary\nNot applicable\nExhibit Index\n(Note: Exhibits 10.3 through 10.23  are management contracts or compensatory plans or arrangements required to be filed as an exhibit to this Report pursuant to Item 15(b) of this Report. \n3.1\nMemorandum of Association of Invesco Ltd., incorporating amendments up to and including December 4, 2007, incorporated by reference to exhibit 3.1 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on December 12, 2007\n3.2\nFourth Amended and Restated Bye-Laws of Invesco Ltd., effective May 25, 2023, incorporated by reference to exhibit 3.2 to Invesco's Quarterly Report on Form 10-Q for the period ended June 30, 2023, filed with the Securities and Exchange Commission on August 2, 2023\n3.3\nCertificate of Designation for the 5.900% fixed rate non-cumulative perpetual series A preference shares, par value $0.20 per share, of Invesco Ltd. incorporated by reference to Exhibit 3.1 to the Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 24, 2019\n4.1\nSpecimen Certificate for Common Shares of Invesco Ltd., incorporated by reference to exhibit 4.1 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on December 12, 2007\n4.2\nIndenture, dated as of November 8, 2012, among Invesco Finance PLC, the Guarantors and The Bank of New York Mellon, as trustee, incorporated by reference to exhibit 4.1 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on November 9, 2012\n4.3\nThird Supplemental Indenture, dated November 12, 2013, for Invesco Finance PLC’s 5.375% Senior Notes due 2043, among Invesco Finance PLC, the company and The Bank of New York Mellon, as trustee, incorporated by reference to exhibit 4.3 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on November 12, 2013\n4.4\nFourth Supplemental Indenture, dated October 14, 2015, for Invesco Finance PLC’s 3.750% Senior Notes due 2026, among Invesco Finance PLC, the company and The Bank of New York Mellon, as trustee, incorporated by reference to exhibit 4.2 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on October 14, 2015\n4.5\nForm of 5.375% Senior Notes due 2043 (included in Exhibit 4.3)\n4.6\nForm of 3.750% Senior Notes due 2026 (included in Exhibit 4.4) \n4.7\nDescription of Securities of Invesco Ltd.\n, incorporated by reference to exhibit 4.11 to Invesco’s Annual Report on Form 10-K, filed with the Securities and Exchange Commission on March 2, 2020\n10.1\nSixth Amended and Restated Credit Agreement, dated as of April 26, 2023, among Invesco Finance PLC, the company, the banks, financial institutions and other institutional lenders from time to time a party thereto and Bank of America, N.A., as administrative agent incorporated by reference to exhibit 10.6 to Invesco’s Quarterly Report on Form 10-Q for the period ended March 31, 2023, filed with the Securities and Exchange Commission on May 3, 2023\n10.2\nSixth Amended and Restated Guaranty, dated as of April 26, 2023, with respect to the Sixth Amended and Restated Credit Agreement by the company in favor of Bank of America, N.A., as administrative agent, and the lenders party incorporated by reference to exhibit 10.7 to Invesco’s Quarterly Report on Form 10-Q for the period ended March 31, 2023, filed with the Securities and Exchange Commission on May 3, 2023 to the Sixth Amended and Restated Credit Agreement incorporated by reference to exhibit 10.6- to Invesco’s Quarterly Report on Form 10-Q for the period ended March 31, 2023, filed with the Securities and Exchange Commission on May 3, 2023\n103\nTable of Contents\n10.3\nInvesco Ltd. 2016 Global Equity Plan, as amended and restated, incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2024, filed with the Securities and Exchange Commission on July 31, 2024\n10.4\nInvesco Ltd. 2010 Global Equity Incentive Plan (ST), as amended and restated effective February 28, 2024, incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission on May 1, 2024 \n10.5\nFirst Amendment to the Invesco Ltd. 2010 Global Equity Incentive Plan (ST), as amended and restated on October 10, 2017, dated May 9, 2019, incorporated by reference to exhibit 4.3 to Invesco’s Form S-8, filed with the Securities and Exchange Commission on May 14, 2019\n10.6\nForm of Restricted Stock Award Agreement – 3-Year Cliff Time Vesting - under Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (February 2023), incorporated by reference to exhibit 10.3 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed with the Securities and Exchange Commission on May 3, 2023\n10.7\nForm of Restricted Award Agreement for Executive Officers – Time Vesting under the Invesco Ltd. 2016 Global Equity Incentive Plan, incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2023 filed with the Securities and Exchange Commission on August 2, 2023\n10.8\nForm of Restricted Stock Award Agreement - Time Vesting - under the Invesco Ltd. 2016 Global Equity Incentive Plan, incorporated by reference to exhibit 10.17 to Invesco’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission on February 23, 2017\n10.9\nForm of Restricted Stock Unit Award Agreement - Time Vesting - under the Invesco Ltd. 2016 Global Equity Incentive Plan, incorporated by reference to exhibit 10.19 to Invesco’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission on February 23, 2017\n10.10\nForm of Restricted Stock Unit Award Agreement - Performance Vesting under Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (February 2023), incorporated by reference to exhibit 10.4 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed with the Securities and Exchange Commission on May 3, 2023\n10.11\nForm of Restricted Stock Unit Award Agreement - Performance Vesting under the Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (May 2021), incorporated by reference to exhibit 10.3 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2021, filed with the Securities and Exchange Commission on July 30, 2021\n10.12\nForm of Restricted Stock Unit Award Agreement - Performance Vesting - for UCITS staff - under Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (February 2023), incorporated by reference to exhibit 10.5 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed with the Securities and Exchange on May 3, 2023\n10.13\nForm of Restricted Stock Unit Award Agreement - Time Vesting - for UCITS staff - under the Invesco Ltd. 2016 Global Equity Incentive Plan (Feb 2020), incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed with the Securities and Exchange Commission on April 23, 2020\n10.14\nForm of Restricted Stock Unit Award Agreement - Performance Vesting - for UCITS staff - under the Invesco Ltd. 2016 Global Equity Incentive Plan (Feb 2020), incorporated by reference to exhibit 10.2 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed with the Securities and Exchange Commission on April 23, 2020\n10.15\nForm of Restricted Fund Unit Agreement - Upfront Awards - for UCITS staff - under Invesco Ltd. Deferred Incentive Plan (Feb 2020), incorporated by reference to exhibit 10.3 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed with the Securities and Exchange Commission on April 23, 2020\n10.16\nForm of Restricted Fund Unit Agreement – Deferred Awards (Feb 2021) – for UCITS staff – under Invesco Ltd. Deferred Incentive Plan, incorporated by reference to exhibit 10.4 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2021, filed with the Securities and Exchange Commission on April 30, 2021\n10.17\nForm of Restricted Stock Unit Award Agreement - Performance Vesting under Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (February 2024), incorporated by reference to exhibit 10.3 to Invesco’s Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission on May 1, 2024\n10.18\nForm of Restricted Stock Unit Award Agreement - Performance Vesting - for UCITS staff - under Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (February 2024), incorporated by reference to exhibit 10.4 to Invesco’s Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission on May 1, 2024\n10.19\nForm of Restricted Stock Award Agreement for Non-Executive Directors under the Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (May 2021), incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2021, filed with the Securities and Exchange Commission on July 30, 2021\n104\nTable of Contents\n10.20\nForm of Restricted Stock Unit Award Agreement for Non-Executive Directors under the Invesco Ltd. 2016 Global Equity Incentive Plan, as amended and restated (May 2021), incorporated by reference to exhibit 10.2 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2021, filed with the Securities and Exchange Commission on July 30, 2021\n10.21\nInvesco Ltd. Amended and Restated 2005 Non-Qualified Deferred Compensation Plan, effective as of January 1, 2025\n10.22\nInvesco Ltd. Amended and Restated Deferred Incentive Plan, effective as of February 28,2024, incorporated by reference to exhibit 10.2 to Invesco’s Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission on May 1, 2024\n10.23\nInvesco Ltd. Executive Incentive Bonus Plan, as amended and restated effective January 1, 2013, incorporated by reference to Appendix A to Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on April 1, 2013\n10.24\nForm of Aircraft Time Sharing Agreement incorporated by reference to exhibit 10.19 to Invesco’s Annual Report on Form 10-K for the year ended December 31, 2013, filed with the Securities and Exchange Commission on February 21, 2014\n10.25\nGlobal Partners Employment Contract, dated April 1, 2000, between INVESCO Pacific Holdings Limited and Andrew Lo, incorporated by reference to exhibit 10.17 to Invesco’s Annual Report on Form 10-K for the year ended December 31, 2007, filed with the Securities and Exchange Commission on February 29, 2008\n10.26\nAgreement and Plan of Merger by and among MM Asset Management Holding LLC, Oppenheimer Acquisition Corp., Invesco Ltd., Gem Acquisition Corp. and Gem Acquisition Two Corp. dated as of October 17, 2018, incorporated by reference to exhibit 10.1 to Invesco’s Quarterly Report on Form 10-Q for the period ended September 30, 2018, filed with the Securities and Exchange Commission on October 24, 2018\n10.27\nFirst Amendment, dated as of April 11, 2019, to the Agreement and Plan of Merger, dated as of October 17, 2018, by and among Invesco Ltd., Gem Acquisition Corp., Gem Acquisition Two Corp., MM Asset Management Holding LLC and Oppenheimer Acquisition Corp., incorporated by reference to exhibit 10.4 to Invesco’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, filed with the Securities and Exchange Commission on April 25, 2019\n10.28\nSecond Amendment to the Agreement and Plan of Merger, dated May 24, 2019, by and among Invesco Ltd., Gem Acquisition Corp., Gem Acquisition Two Corp., MM Asset Management Holding LLC, and Oppenheimer Acquisition Corp., incorporated by reference to exhibit 2.3 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 24, 2019\n10.29\nShareholder Agreement, dated May 24, 2019, by and between Invesco Ltd. and Massachusetts Mutual Life Insurance Company, incorporated by reference to exhibit 10.1 to Invesco’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 24, 2019\n19.0\nInvesco Ltd. Insider Trading Policy\n21.0\nList of Subsidiaries\n22.0\nSubsidiary Guarantors and Issuers of Guaranteed Securities\n, incorporated by reference to the exhibit 22.0 to Invesco's Annual Report on Form 10-K for the \nyear ended December 31, 2023, file\nd\n with the Securities and Exchange Commission on February 21, 2024\n23.1\nConsent of PricewaterhouseCoopers LLP, dated February 2\n5\n, 202\n5\n31.1\nCertification of Andrew R. Schlossberg pursuant to Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of L. Allison Dukes pursuant to Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Andrew R. Schlossberg pursuant to Rule 13a-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of L. Allison Dukes pursuant to Rule 13a-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97\nInvesco Policy for Recoupment of Incentive Compensation\n,\n \nincorporated by reference to the exhibit \n97\n to Invesco's Annual Report on Form 10-K for the year ended December 31, 2023, file\nd\n with the Securities and Exchange Commission on February 21,\n2024\n \n101\nThe following financial statements from the company’s Quarterly Report on Form 10-K for the year ended December 31, 2024, formatted in Inline Extensible Business Reporting Language (iXBRL) : (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Income, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Cash Flows, (v) Consolidated Statements of Changes in Equity, and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags\n104\nCover page from the company’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL and contained in Exhibit 101\n105\nTable of Contents\n    \n    \n                                \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nInvesco Ltd.\nBy:\n/s/ ANDREW R. SCHLOSSBERG\nName:\nAndrew R. Schlossberg\nTitle:\nPresident and Chief Executive Officer\nDate:\nFebruary 25, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\n \nTitle\nDate\n/s/ ANDREW R. SCHLOSSBERG\nChief Executive Officer (Principal Executive Officer) and President; Director\nFebruary 25, 2025\nAndrew R. Schlossberg\n/s/ L. ALLISON DUKES\nSenior Managing Director and Chief Financial Officer (Principal Financial Officer)\nFebruary 25, 2025\nL. Allison Dukes\n/s/ TERRY G. VACHERON\nChief Accounting Officer (Principal Accounting Officer)\nFebruary 25, 2025\nTerry G. Vacheron\n/s/ G. RICHARD WAGONER, JR.\nChairperson and Director\nFebruary 25, 2025\nG. Richard Wagoner, Jr.\n/s/ SARAH E. BESHAR\nDirector\nFebruary 25, 2025\nSarah E. Beshar\n/s/ THOMAS M. FINKE\nDirector\nFebruary 25, 2025\nThomas M. Finke\n/s/ THOMAS P. GIBBONS\nDirector\nFebruary 25, 2025\nThomas P. Gibbons\n/s/ WILLIAM F. GLAVIN, JR.\nDirector\nFebruary 25, 2025\nWilliam F. Glavin, Jr.\n/s/ ELIZABETH. S. JOHNSON\nDirector\nFebruary 25, 2025\nElizabeth S. Johnson\n/s/ SIR NIGEL SHEINWALD\nDirector\nFebruary 25, 2025\nSir Nigel Sheinwald\n/s/ PAULA C. TOLLIVER\nDirector\nFebruary 25, 2025\nPaula C. Tolliver\n/s/ CHRISTOPHER C. WOMACK\nDirector\nFebruary 25, 2025\nChristopher C. Womack\n/s/ PHOEBE A. WOOD\nDirector\nFebruary 25, 2025\nPhoebe A. Wood\n106"
  }
}