{
  "ticker": "J",
  "cik": "0000052988",
  "company_name": "JACOBS SOLUTIONS INC.",
  "filing_date": "2025-11-20",
  "accession": "0001628280-25-053316",
  "primary_doc": "jec-20250926.htm",
  "item_sections": {
    "item1": "Item 1.     BUSINESS\nGuided by our values and our brand promise — Challenging today. Reinventing tomorrow – Jacobs delivers innovative solutions to address the world’s most complex challenges and create lasting value for clients, communities and society. \nWith a global team of approximately 43,000, we provide end-to-end capabilities across advanced manufacturing, cities & places, energy, environmental, life sciences, transportation and water. Our services span advisory and consulting, feasibility and planning, through to design, program delivery and lifecycle management — helping to create a more connected and sustainable world. \nFrom addressing water scarcity and aging infrastructure to access to life-saving therapies and cyber resilience, we combine creativity, agility and deep domain expertise to deliver outcomes that matter. Our integrated approach enables clients to meet urgent needs today while preparing for the opportunities of tomorrow.\nOver the past eight years, Jacobs has transformed into a science-based consulting and advisory leader, focused on delivering digitally enabled, resilient solutions to complex sustainability, critical infrastructure and advanced manufacturing challenges. Strategic acquisitions, including a 65% stake in PA Consulting Group Limited (\"PA Consulting\") in fiscal 2021, along with BlackLynx and StreetLight — have strengthened our capabilities in high-value technology-enabled solutions.\nChallenge accepted\nIn February 2025, we launched \nChallenge Accepted\n, our multi-year growth strategy designed to sharpen our focus and accelerate our performance. Aligned with our long-term financial framework, this strategy positions us to drive profitable growth and deliver scalable, full lifecycle solutions across water and environmental, life sciences and advanced manufacturing, and critical infrastructure.\nPage 4\nAs global challenges like urbanization, infrastructure modernization, digital evolution and environmental resilience intensify, our integrated delivery model unites the full breadth of our capabilities — from strategy through execution – across our end markets. This synergy enables us to deliver rapid, large-scale outcomes that anticipate evolving client needs and advance a more resilient, sustainable future where technology elevates human ingenuity and unlocks new possibilities for collaboration and problem-solving. \nWe harness our advanced data and digital capabilities, products and tools to\n \nhelp clients operate more efficiently, safely and intelligently. Through the expertise of our people and ongoing investment in artificial intelligence (AI) and next-generation digital solutions, we empower our clients' decision-making across the entire asset lifecycle – from capital planning and operations to cybersecurity and operational technology. Our capabilities in data analytics, digital architecture, advisory and transformation, software development and cybersecurity enable clients to unlock the full value of their data and digital infrastructure to improve performance, resilience and sustainability.\nThrough our strategic partnership with PA Consulting, we are expanding our high-end advisory services and deploying our collective strengths to help clients adapt, innovate and transform. Together, we deliver integrated support across the full project lifecycle — from early-stage strategy to implementation — enabling clients to tackle complex challenges, accelerate sustainable growth and shape a smarter, more resilient future.\nA streamlined, focused business\nPrior to the Separation Transaction, the Company's four operating segments were comprised of its two global lines of business (\"LOBs\"): Critical Mission Solutions (\"CMS\") and People Places and Solutions (\"P&PS\"), its business unit Divergent Solutions (\"DVS\") and its majority investment in PA Consulting. After the Separation in fiscal year 2024, we reorganized P&PS and our remaining DVS businesses into a more streamlined operating model, Infrastructure & Advanced Facilities (\"I&AF\"), which enables our collective business teams to collaborate more horizontally. Our CMS LOB and portions of DVS which were included in the Separation are now reported as discontinued operations.\nOur Values in Action\nJacobs' Ethics and Code of Conduct, rooted in our values, set clear standards and support to guide decision-making and ensure we conduct our business with integrity.\nAt Jacobs, sustainability means delivering thoughtful solutions that meet today’s needs while enabling economies, \ncommunities and the environment to thrive in the future. Our PlanBeyond® sustainable business approach aligns with our purpose to create a more connected, sustainable world. This approach has strengthened client relationships, aiming to create new opportunities and embed resilience into our global strategy. Building on this foundation, \nPlanBeyond 2025+\n focuses on transparency, measurable outcomes and trusted delivery, guiding our path forward with our stakeholders, including our clients, partners and people.\nDriving positive impact\nOperating in more than 40 countries, we view sustainability and resilience as key differentiators and drivers of impact. Demand for solutions that address complex, interconnected challenges continues to grow across infrastructure, energy, advanced manufacturing and health. By embedding sustainability into our solutions, we help clients’ businesses and assets remain resilient. In fiscal 2025, we launched our \nEvolve\n tool, which generates recommendations to integrate sustainability into our projects to enhance their positive impact and resilience. Complimentary tools like \nClimate Risk Manager\n, \nKaleidoscope and Intelligent O&M\n assess climate risks, carbon impacts and system vulnerabilities to inform critical project decisions.\nWe deliver cross-cutting solutions across seven interconnected capabilities: decarbonization & greenhouse gas management; adaptation & resilience; sustainable built environments; sustainable business; social value; nature positive; and energy transition. Together, these enable systems-level impact for clients and communities worldwide.\nPage 5\nTransparency and accountability\nWe are committed to leading by example in our own operations — advancing a suite of strategic actions to reduce our carbon footprint. Our current commitment, including sourcing 100% renewable electricity and our net-zero target validated by the Science Based Targets initiative, underscore our progress across our operations and supply chain.\nWe have invested in technology to enhance virtual collaboration and help mitigate business travel and employee commuting carbon emissions. We also invested in tools and technology to help our people consider when business travel is essential and make more sustainable choices when it is necessary. \nAs businesses worldwide experience increasing stakeholder expectations and sustainability regulatory requirements, corporate transparency and accountability remains central. We report on our sustainability performance and corporate responsibility initiatives in accordance with globally recognized frameworks when required by applicable regulations, or, in the absence of mandated standards, we follow widely accepted market practices.\nPositively impacting tomorrow’s communities\nWe work globally with our clients, partners and supply chains to deliver solutions that seek to improve how people live, move and thrive, aiming to foster health and well-being for all occupants, promoting a sustainable and thriving future.  \nWe invest in local communities globally, collaborating with charities and not-for-profit organizations to make a positive impact and live our values. Through Collectively℠, our global giving and volunteering program, we empower employees to support causes aligned to our values, through paid volunteer time, donation matching and grant nomination. In fiscal 2025, our employees mobilized support for communities, including those impacted by natural disasters, water insecurity and conflict. For example, in 2025 a team of 10 Jacobs volunteers partnered with non-profit Bridges to Prosperity to build a suspended bridge across Rwanda’s Gatongati River — our 17th bridge build — providing safe, year-round access to education, healthcare, markets and other essential services for more than 8,300 people.\nWe also invest in the next generation through our science, technology, engineering, arts and mathematics (STEAM) education and engagement programs promoting sustainability learning among young people and providing information to inspire future careers in STEAM.\nIn 2025, Jacobs sponsored the International Science and Engineering Fair — a premier global competition engaging students from more than 300 affiliated science fairs worldwide and advancing the future talent pipeline.\nIn fiscal 2025, we donated over $2.9 million to 2,300+ charities across 34 countries. Our employees tracked more than 7,000 volunteer hours including nearly 4,000 STEAM volunteer hours.\nSocial value advisory in our client solutions\nWe also deliver social value strategies and services that help clients realize social value opportunities through their projects and services by embedding and measuring social, economic and environmental benefit generation into project delivery. \nOur fully owned subsidiary, Simetrica-Jacobs, specializes in social value, wellbeing research and impact evaluation — measuring and quantifying social value and impacts to help directly inform investment decisions and delivery models. Simetrica-Jacobs deploys internationally endorsed methods set out by the Organisation for Economic Co-operation and Development and government-produced guidelines, including the U.K. Government’s HM Treasury Green Book. \nBy combining this expertise with our infrastructure delivery, we help clients understand how they can transform local decision-making, shape inclusive investments and create lasting social change.\nWe maintain agile and disciplined capital deployment\nM&A and Divestitures\nConsistent with our profitable growth strategy, Jacobs pursues acquisitions, divestitures, strategic investments and other transactions to maximize long-term value by continuing to reshape our portfolio to higher value solutions and accelerating profitable growth strategy. The Company has recently made the following acquisitions, strategic investments and divestitures:\nPage 6\n•\nOn September 27, 2024, Jacobs completed the Separation Transaction, pursuant to which it spun off its CMS and C&I businesses and then subsequently merged those businesses with Amentum Parent Holdings LLC. Amentum, the surviving entity of the Separation Transaction, is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM”. For further information regarding separation activities that took place in fiscal 2025, see Note 14- \nDiscontinued Operations\n of the Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K.\n•\nOn March 2, 2021, Jacobs completed the strategic investment of a 65% interest in PA Consulting, a U.K.-based leading innovation and transformation consulting firm.\nShare Repurchases\nDuring fiscal 2025, the Company repurcha\ns\ned $754.1 million in shar\nes.\nShareholder Dividends\nDuring fiscal 2025, the Com\npany paid dividends of $0.29 per share in the first quarter and $0.32 per share in the second, third and fourth quarters.\nPage 7\nOperating Segments\nThe services we provided to our end markets in fiscal 2025 fall into the following two operating segments: 1) Infrastructure & Advanced Facilities and 2) our majority investment in PA Consulting. \nFor additional information regarding our segments, including information about our financial results by segment and financial results by geography, see Note 19- \nSegment Information\n of Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K. \nInfrastructure & Advanced Facilities (I&AF) \nIn fiscal 2025, Jacobs' Infrastructure & Advanced Facilities business provided end-to-end solutions for our clients’ most complex challenges related to energy security, environmental resilience, safe and reliable transportation, buildings and infrastructure, integrated water management and biopharmaceutical manufacturing. In doing so, we combine deep experience in the following end markets - Critical Infrastructure, Water & Environmental and Life Sciences & Advanced Manufacturing.\nOur core skills revolve around consulting, planning, architecture, design, engineering, infrastructure delivery services\n \nincluding project, program and construction management and long-term operation of facilities. Solutions are delivered as standalone professional service engagements, comprehensive program management partnerships, and selective progressive design-build and construction management at-risk delivery services. Increasingly, we use data science and technology-enabled expertise to deliver positive and enduring outcomes for our clients and communities.\nWe serve national, state and local government clients across multiple regions — including the U.S., Europe, U.K., Middle East, and Asia\n \nPacific — and multinational and local private sector organizations globally.\nPage 8\nPA Consulting (PA)\nPA Consulting, the global innovation and transformation consultancy, accelerates new growth ideas from concept, through design and development and to commercial success, and revitalizes organizations, building leadership, culture, systems and processes to make innovation a reality. PA Consulting's global team of about 4,000, which includes strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists work across seven sectors: consumer and manufacturing, defense and security, energy and utilities, financial services, government, health and life sciences, and transport to make a positive impact alongside the clients it supports, bringing ingenuity to life. \nPA Consulting has a diverse mix of private and public sector clients. Private sector clients include global household names like Diageo, Microsoft, Pret A Manger and Unilever, and start-ups like NTx, which is accelerating access to life-changing therapies. PA's work includes applying data and analytics to improve punctuality of flights at Heathrow Airport, accelerating the energy transition with Invenergy and energyRe, creating new digital platforms for the American College of Emergency Physicians, pioneering medtech with Hubly Surgical, accelerating clinical trials with AI for a global life sciences consortium, and enhancing resiliency in banking with Bankomat. Public sector clients include the U.K.'s Ministry of Defence, National Highways, The Norwegian Labour and Welfare Administration, The Danish Tax Agency and The Swedish Environmental Protection Agency.\nCollectively, we also deploy the combined strengths of Jacobs' technical expertise in infrastructure, advanced manufacturing and technology with PA Consulting's innovation and transformation expertise to unlock significant opportunities for our clients worldwide. In the U.S., we’re supporting the digital transformation of Dallas Fort Worth International Airport and contributing to the Frederick Douglass Tunnel program — one of the nation’s largest transportation infrastructure investments. In England, we provide engineering, technical advice and innovation services to National Highways. We’re building an AI blueprint for Hertfordshire County Council, one of England’s largest councils. We’ve been appointed to the U.K.’s largest government management consultancy framework providing public sector organizations with streamlined access to advisory services. We’re also delivering technical project management for the U.K. Department for Energy Security & Net Zero’s Carbon Capture, Usage and Storage program, a cornerstone of the U.K.’s net-zero ambitions.\nSeparation of Critical Mission Solutions (CMS) and Cyber & Intelligence (C&I)\nOn September 27, 2024, Jacobs Solutions Inc. (\"Jacobs\") completed the previously announced Reverse Morris Trust transaction pursuant to which (i) Jacobs first transferred its Critical Mission Solutions business (“CMS”) and portions of the Divergent Solutions (“DVS”) business (referred to herein as the Cyber & Intelligence business (“C&I”) and together with CMS referred to as the “SpinCo Business”), to Amazon Holdco Inc., a Delaware corporation, which has been renamed Amentum Holdings, Inc. (“SpinCo”) (the “Separation”), (ii) Jacobs then effectuated a spin-off of SpinCo by distributing 124,084,108 shares of SpinCo common stock, par value $0.01 per share (the “SpinCo Common Stock”), by way of a pro rata distribution to its shareholders such that each holder of shares of Jacobs common stock, par value $1.00 per share, (the “Jacobs Common Stock”) was entitled to receive one share of SpinCo Common Stock for each share of Jacobs common stock held as of the record date, September 23, 2024 (the “Distribution”), and (iii) finally, Amentum Parent Holdings LLC merged with and into SpinCo, with SpinCo surviving the merger (the “Merger” and together with the Separation and the Distribution, the “Separation Transaction”). The surviving entity of the Separation Transaction is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM” (“Amentum”).\nAs a result of the Separation Transaction, substantially all SpinCo Business-related assets and liabilities have been separated and distributed (the \"Disposal Group\"). The Company determined that the Disposal Group should be reported as discontinued operations in accordance with ASC 205-20, Discontinued Operations because their disposal represents a strategic shift that had a major effect on operations and financial results. As such, the financial results of the SpinCo Business are reflected in our Consolidated Statements of Earnings as discontinued operations for all periods presented. Additionally, current and non-current assets and liabilities of the Disposal Group were reflected as held for spin in the Consolidated Balance Sheet as of September 29, 2023. Further, as the Separation Transaction closed on September 27, 2024, no amounts remained held for spin at the end of fiscal 2024.\nFor further information regarding separation activities that took place in fiscal 2025, see Note 14- \nDiscontinued Operations\n of the Notes to Consolidated Financial Statements beginning on page F-1 of this Annual Report on Form 10-K.\nPage 9\nPrior to the Separation Transaction, Jacobs’ Critical Mission Solutions business provided a full spectrum of solutions for clients to address evolving challenges like digital transformation and modernization, national security and defense, space exploration, digital asset management, the clean energy transition, and nuclear decommissioning and cleanup. Clients included government agencies, as well as private sector clients mainly in the aerospace, automotive,\n \nmotorsports, energy and telecom sectors. Prior to the Separation Transaction, the DVS business unit served as the core foundation for developing and delivering innovative, next-generation cloud, cyber, data and digital technologies. DVS clients included government agencies and commercial clients in the U.S. and international markets. Certain portions of the DVS business related to advising on digital strategy and transformation and developing digital solutions that facilitate capital, operational and cybersecurity decisions for our clients across our segments and their end markets were retained and are now part of I&AF.\nSignificant Customers\nThe following table sets forth the percentage of total revenues from continuing operations earned directly or indirectly from agencies of the U.S. federal government for each of the last three fiscal years:\n2025\n2024\n \n2023\n8%\n10%\n \n9%\nGiven the percentage of total revenue derived directly from the U.S. federal government, the loss of U.S. federal government agencies as customers could have a material adverse effect on the Company. In addition, any or all of our government contracts could be terminated, we could be suspended or debarred from all government contract work, or payment of our costs could be disallowed. For more information on risks relating to our government contracts, see",
    "item1a": "Item 1A. Risk Factors may be magnified by the activities of any acquired business prior to the acquisition.\nWhile we may obtain indemnification rights from the sellers of acquired businesses and/or insurance that could mitigate certain of these risks, such rights may be difficult to enforce, the losses may exceed any dedicated escrow funds and the indemnitors may not have the ability to financially support the indemnity, or the insurance coverage may be unavailable or insufficient to cover all losses.\nIf our leadership is unable to successfully integrate acquired companies or implement our growth strategy with respect to acquisitions and/or strategic investments, our operating results could be harmed. Moreover, we cannot assure that we will continue to successfully expand or that growth or expansion will result in profitability.\nIn addition, there is no assurance that we will continue to locate suitable acquisition or investment targets or that we will be able to consummate any such transactions on terms and conditions acceptable to us. Existing cash balances and cash flow from operations, together with borrowing capacity under our credit facilities, may be insufficient to make acquisitions and/or strategic investments. Future acquisitions and/or strategic investments may require us to obtain additional equity or debt financing, which may not be available on attractive terms, or at all. Acquisitions and/or strategic investments may also bring us into businesses we have not previously conducted and expose us to additional business risks that are different than those we have traditionally experienced.\nPage 38\nIn addition, we may periodically divest or plan to divest businesses, including businesses that are no longer a part of our ongoing strategic plan. Divesting businesses involves risks and uncertainties, such as the difficulty separating assets related to such businesses from the businesses we retain, employee distraction, and the need to obtain regulatory approvals and other third-party consents, which could potentially disrupt customer and vendor relationships. These Divestitures may require a significant investment of our time and resources and may disrupt our business, distract our management from other responsibilities and may result in losses on disposal or continued financial involvement in the divested business, including through indemnification, guarantee or other financial arrangements, for a period of time following the divestment, which could adversely affect our business, financial condition or results of operations. When we determine that we would like to divest a business, we may not be able to divest that business on attractive terms or at all. Because of these challenges, as well as market conditions or other factors, anticipated divestitures may take longer or be costlier or generate fewer benefits than expected and may not be completed at all. If we are unable to complete the divestitures or to successfully transition divested businesses, our business and financial results could be negatively impacted.\nAcquisitions, strategic investments and divestitures create various business risks and uncertainties during the pendency of the transaction.\nConsummation of any acquisition, merger, strategic investment or divestiture is subject to the satisfaction of customary conditions, including one or more of the following: (i) due diligence and its associated time and cost commitments, (ii) board and shareholder approval, (iii) regulatory approvals, (iv) the absence of any legal restraint that would prevent the consummation of the transaction, (v) the absence of material adverse conditions which can prevent the consummation of the transaction, and (vi) compliance with covenants and the accuracy of representations and warranties contained in the transaction agreement, among others. One or more of these conditions may not be fulfilled and, accordingly, the transaction may not be consummated or may be significantly delayed. In such case, our ongoing business, financial condition and results of operations may be materially adversely affected, and the market price of our common stock may decline, particularly to the extent that the market price reflects a market assumption that the transaction will be consummated or will be consummated within a particular timeframe. \nFurthermore, most transactions require the Company to incur substantial expense associated with closing and if the transaction is not consummated, we will incur these expenses without realizing the expected benefits. The pursuit of the transaction will also require management attention and use of internal resources that would otherwise be focused on general business operations. In addition, customers’ uncertainty about the effect of the transaction may have an adverse effect on the ability to win customer contracts or could cause existing clients to seek to change existing business relationships. Employee morale due to the uncertainties associated with the transaction could also be negatively affected. Any of the foregoing, or other risks arising in connection with a failure or delay in consummating a transaction, including the diversion of management attention or loss of other opportunities during the pendency of the transaction, could have a material adverse effect on our business, financial condition and results of operations.\nWe may make minority investments that subject us to risks and uncertainties outside of our control.\nFrom time to time, the Company may make minority investments in the equity securities of companies that we do not control. Minority investments inherently involve a lesser degree of control over business operations, thereby potentially increasing the financial, legal, operational and/or compliance risks associated with the minority investment.\nTo the extent we hold only a minority equity interest in a company, we may lack affirmative control rights, which may diminish our ability to influence the company’s affairs in a manner intended to enhance the value of our investment in the company. We could incur losses if the majority stakeholders or the management of the company takes risks or otherwise acts in a manner that does not serve our interests.\n \nIn addition, we could be subject to reputational harm if the company in which the investment is made makes business, financial or management decisions with which we do not agree. These circumstances could also lead to disputes and litigation with management or employees of the company in which the investment is made, or its other stockholders. \nIn most cases, the companies in which we make investments will have indebtedness or equity securities or may be permitted to incur indebtedness or to issue equity securities, which rank senior to our investment. We also may make investments in early-stage companies that depend on venture funding and are not profitable. In the event of insolvency, liquidation, dissolution, reorganization or bankruptcy of a company in which an investment is made, holders of debt instruments and securities ranking senior to our investment would typically be entitled to receive payment in full before distributions could be made in respect of our investment.\nPage 39\nWe may also enter into separate commercial arrangements with these companies, whether before, concurrently with, or after making a minority investment. In certain cases, the commercial arrangement may be a driving factor behind our investment. We cannot assure you that that the commercial arrangement will further our business strategy as we expected. We may not realize all the economic benefits expected from the commercial agreement or realize the expected return on our investments.\n \nRisks Related to Regulatory Compliance\nPast and future non-financial health, safety, security and environment-related laws and regulations could impose significant additional costs and liabilities.\nWe are subject to a variety of HSSE-related laws and regulations governing, among other things, discharges to air and water, the handling, storage and disposal of hazardous or waste materials and the remediation of contamination associated with the releases of hazardous substances, government security standards and human health and safety. These laws and regulations and the risk of attendant litigation can cause significant delays to a project and add significantly to its cost. Violations of these regulations could subject us and our management to civil and criminal penalties and other liabilities.\nVarious U.S. federal, state, local and foreign environmental laws and regulations may impose liability for property damage and costs of investigation and cleanup of hazardous or toxic substances on property currently or previously owned by us or arising out of our waste management or environmental remediation activities. These laws may impose responsibility and liability without regard to knowledge of or causation of the presence of contaminants. The liability under these laws may be joint and several. We have potential liabilities associated with our past waste management and other activities and with our current and prior ownership of various properties. The discovery of additional contaminants or the imposition of unforeseen clean-up obligations at these or other sites could have a material adverse impact on our financial condition and results of operations.\nHSSE laws and regulations and policies are reviewed periodically, and any changes thereto could affect us in substantial and unpredictable ways. Such changes could, for example, relax or repeal laws and regulations relating to the environment, which could result in a decline in the demand for our environmental services and, in turn, could negatively impact our revenue. Changes in the environmental laws and regulations, remediation obligations, enforcement actions, stricter interpretations of existing requirements, future discovery of contamination or claims for damages to persons, property, natural resources or the environment could result in material costs and liabilities that we currently do not anticipate. Failure to comply with any HSSE laws or regulations, whether actual or alleged, exposes us to fines, penalties or potential litigation liabilities, including costs, settlements and judgments, any of which could adversely affect our business, financial condition and results of operations. \nIf we fail to comply with any governmental requirements, our business may be adversely affected.\nWe are subject to U.S. federal, state, local and foreign laws and regulations that affect our business, including data privacy and security, employment and labor relations, immigration, taxation, anti-corruption, anti-bribery, import-export controls, trade restrictions, internal and disclosure control obligations, securities regulation and anti-competition. For example, our global operations require importing and exporting goods and technology across international borders which requires compliance with all export and import laws and regulations. Although we have policies and procedures to comply with U.S. and foreign international trade laws, the violation of such laws could subject the Company and its employees to civil or criminal penalties, including substantial monetary fines, or other adverse actions including denial of import or export privileges or debarment from participation in U.S. government contracts, and could damage our reputation and our ability to do business.\nIn addition, we and many of our clients operate in highly regulated environments, which requires us or our clients to obtain, and to comply with, federal, state and local government permits and approvals. These permits or approvals are subject to denial, revocation or modification under various circumstances. Failure to obtain or comply with, or the loss or modification of, the conditions of permits or approvals subjects us to the risk of penalties or other liabilities, could have a material adverse impact on our business, financial condition and result of operations.\nPage 40\nWe could be adversely affected by violations of the U.S. Foreign Corrupt Practices Act and similar worldwide anti-bribery laws.\nThe U.S. Foreign Corrupt Practices Act (“FCPA”), the U.K. Bribery Act of 2010, and similar anti-bribery laws in other jurisdictions generally prohibit companies and their intermediaries from making improper payments for the purpose of obtaining or retaining business. Our policies mandate compliance with these anti-bribery laws, including the requirements to maintain accurate information and internal controls. We operate in many parts of the world that have experienced governmental corruption to some degree and in certain circumstances; strict compliance with anti-bribery laws may conflict with local customs and practices. Despite our training and compliance programs, there is no assurance that our internal control policies and procedures will protect us from acts committed by our employees or agents. If we are found to be liable for FCPA or other violations (either due to our own acts or our inadvertence, or due to the acts or inadvertence of others), we could suffer from civil and criminal penalties or other sanctions in multiple jurisdictions, including contract cancellations or debarment and loss of reputation, any of which could have a material adverse impact on our business, financial condition and results of operations.\nRisks Related to Sustainability and Corporate Responsibility\nClimate change and related environmental issues could have a material adverse impact on our business, financial condition and results of operations.\nClimate change related events, such as increased frequency and severity of storms, floods, wildfires, droughts, hurricanes, freezing conditions, and other natural disasters, may have both immediate and long-term impacts on our business, financial condition and results of operations. While we seek to mitigate our business risks associated with climate change, we recognize that there are inherent climate related risks regardless of where we conduct our business. For example, a catastrophic natural disaster could negatively impact any of our office locations and the locations of our customers. Access to clean water and reliable energy in the communities where we conduct our business is critical to our operations. Accordingly, a natural disaster has the potential to disrupt our and our customers’ businesses and may cause us to experience work stoppages, project delays, financial losses and additional costs to resume operations, including increased insurance costs or loss of coverage, legal liability and reputational losses.\nFurther, the risks caused by climate change span across the full spectrum of the markets we serve. Our end-to-end services span advanced manufacturing, cities & places, energy, environmental, life sciences, transportation and water. The direct physical risks that climate change poses to infrastructure through chronic environmental changes, such as rising sea levels and temperatures, and acute events, such as hurricanes, droughts and wildfires, is common to each of these markets. Infrastructure owners could face increased costs to maintain their assets, which could result in reduced profitability and fewer resources for strategic investment. These types of physical risks could in turn lead to transitional risks (i.e., the degree to which society responds to the threat of climate change), such as market and technology shifts, including decreased demand for our services and solutions, reputational risks, such as how our values and practices regarding a low carbon transition are viewed by external and internal stakeholders, and policy and legal risks, such as the extent to which low carbon transitions are driven by the governments of the jurisdictions in which we operate around the globe, all of which could have a material adverse impact on our business, financial condition and results of operations.\nOur business operations are subject to various and changing federal, state, local and foreign laws and regulations that could result in costs or sanctions that adversely affect our business and results of operations.\nEvolving regulatory and disclosure standards around sustainability objectives and reporting could impose additional compliance obligations on us that could adversely impact our business and results of operations. We seek to comply with applicable international and domestic regulations and client demands regarding public disclosure of our sustainability practices. As new laws, regulations and similar initiatives and programs continue to be adopted and implemented, we will be required to comply with such laws or regulations or potentially face negative consequences, such as market access limitations, enforcement actions, civil suits or sanctions and fines. If new laws or regulations are more stringent than current legal or regulatory requirements, we may experience increased compliance burdens and costs to meet such obligations. At the same time, an increasing number of regulators, lawmakers and other stakeholders have expressed or pursued contrary views, legislation and investment expectations with respect to sustainability-related ambitions and disclosures, including the enactment or proposal of “anti-ESG” legislation, regulation or policies, which may expose us to additional legal, financial or reputational risks based on our ambitions and disclosures. \nPage 41\nGovernmental policies designed to address the effects of climate change, or inversely, eliminating the focus on the effects of climate change, could increase the costs of projects for our clients or eliminate some or all government funding for a project, which, in some cases, could prevent a project from going forward, thereby potentially reducing the need for our services, which would in turn have a material adverse impact on our business, financial condition and results of operations. Further, climate legislation enacted to address the effects of climate change across all geographies poses a similar risk to us and our clients as we operate globally. However, further policy changes and climate legislation could also increase the overall demand for our services as our clients and partners work to comply with such policies, such as by decarbonizing their industries, transitioning from fossil fuels to renewable energy sources and developing integrated and sustainable solutions, which could have a positive impact on our business. We cannot predict when or whether any of these various proposals may be enacted or what their effect will be on us or on our customers.\nWe may also incur additional expenses as a result of U.S. and international regulators requiring additional disclosures regarding greenhouse gas (\"GHG\") emissions, and broader sustainability-related disclosures than we currently include in our Annual Sustainability Report or in other reports, documents and filings that are required to comply with global regulations. Compliance with the various laws and regulation that we are subject to and the associated potential cost, is further complicated by the fact that the countries and regions in which we operate are following different approaches to the regulation of both climate change and these broader matters. Complying, or failing to comply, with existing or future federal, state, local, and foreign legislation and regulations applicable to our sustainability efforts and reporting, which may conflict with one another, could cause us to incur additional compliance and operational costs or actions and suffer reputational harm, which could materially and adversely affect our business, financial condition and results of operations.\nWe may be unable to achieve our climate commitments and targets.\nAt Jacobs, we have established various climate commitments and targets, including our goal to source 100% renewable electricity and our net-zero target validated by the Science Based Targets initiative to reach net zero for our value chain by 2040. The achievement of our climate commitments and targets is subject to risks and uncertainties, many of which are outside of our control. These risks and uncertainties include, but are not limited to: our ability to execute our operational strategies and achieve our goals within the currently projected costs and the expected timeframes; the availability and cost of alternative fuels, global electrical charging infrastructure, off-site renewable energy and other materials and components; unforeseen design, operational and technological difficulties; the outcome of research efforts and future technology developments, including the ability to scale projects and technologies on a commercially competitive basis such as carbon sequestration and/or other related processes; compliance with, and changes or additions to, global and regional regulations, taxes, charges, mandates or requirements relating to GHG emissions, carbon costs or climate-related goals; labor-related regulations and requirements that restrict or prohibit our ability to impose requirements on third-party contractors; adapting products to customer preferences and customer acceptance of sustainable supply chain solutions; the actions of competitors and competitive pressures and an acquisition of or merger with another company that has not adopted similar carbon goals or whose progress toward reaching its carbon goals is not as advanced as ours. Accordingly, there is no assurance that we will be able to successfully execute our operational strategies and achieve our climate commitments and targets, which could damage our reputation and our relationships with our customers and other stakeholders, negatively affecting our business and results of operations.\nIncreasing scrutiny and changing and conflicting expectations from governmental organizations, clients, investors, suppliers and partners, communities and our employees with respect to our practices and disclosures \nrelated to sustainability and corporate responsibility \nmay impose additional costs on us or expose us to new or additional risks that could adversely affect our business and results of operations. \nThere is increasing scrutiny from governmental organizations, clients, investors, suppliers, partners, communities, employees and other stakeholders on companies’ practices and disclosures related to sustainability and corporate responsibility, including with respect to climate change and carbon emissions, human rights, ethics, supply chain management and human capital management. If our practices and disclosures related to sustainability and corporate responsibility do not meet evolving rules and regulations or stakeholder expectations and standards (or if we are viewed negatively based on positions we do or do not take or work we do or do not perform or cannot publicly disclose for certain clients and industries), then our reputation and our ability to attract and/or retain new clients and leading experts, employees and other professionals could be negatively impacted, as could our attractiveness as an investment, service provider, employer, or business partner, and further, could lead to lawsuits, penalties or market access restrictions. Similarly, any failure or perceived failure in our efforts to achieve our current or future sustainability and corporate responsibility-related goals, targets, and objectives, or to advance our related initiatives, including by failing to satisfy \nPage 42\nvarious reporting standards within the timelines expected by stakeholders or at all, could also result in similar negative impacts.\n Public statements with respect to sustainability and corporate responsibility-related matters also are becoming increasingly subject to heightened scrutiny from public and governmental authorities for being misleading or overstating certain capabilities or commitments (e.g. \"greenwashing\" or \"AI-washing\"). We are aware that non-governmental organizations and other private actors have filed lawsuits against companies under various securities and consumer protection laws alleging that certain statements, goals or standards made by issuers were misleading, false or otherwise deceptive, including those related to sustainability, corporate responsibility and use of emerging technologies. An inability to implement our policies and practices related to sustainability and corporate responsibility and maintain compliance with laws and regulations, or a perception among stakeholders that our sustainability and corporate responsibility disclosures and goals are insufficient, that our goals are unattainable or that there is a misalignment between our stated commitments and our actual practices, could harm our reputation and competitive position and negatively impact our business and results of operations.\nWe also provide information to our investors on our practices, policies and other matters related to sustainability and corporate responsibility and submit such information to organizations that evaluate companies on their approach to such matters. If we receive unfavorable ratings from these organizations, or if we fail to submit information to such organizations regarding our practices and policies, it may result in negative reactions from our investors, clients and/or other stakeholders, the diversion of investment or other projects to other companies, and difficulty in hiring skilled employees, which could materially and adversely affect our business, financial condition and results of operations. \nRisks Related to Our Indebtedness and Credit Markets\nWe rely in part on liquidity from our credit facilities to fund our business. Restrictions in our credit facilities and other indebtedness could adversely affect our business.\n We are currently a borrower under several credit facilities and our subsidiary, Jacobs Engineering Group Inc., has issued notes pursuant to an indenture with respect to which Jacobs has provided a guarantee. These facilities and indenture contain customary covenants restricting, among other things, our ability to incur certain liens and indebtedness. We are also subject to certain financial covenants in our credit facilities, including maintenance of a maximum consolidated leverage ratio. A breach of any covenant or our inability to comply with the required financial ratios could result in a default under one or more of our credit facilities or indentures and limit our ability to do further borrowing. Further\n, \nour borrowing rate is also affected by our consolidated leverage ratio and\n \nany material increase in our leverage ratio could increase our borrowing rate. We cannot assure you that we will be able to maintain compliance with these covenants in the future and, if we fail to do so, we may be prohibited from undertaking actions that are necessary or desirable to maintain or expand our business. Additionally, if it becomes necessary to refinance these borrowings on less favorable terms, or if we are unable to refinance at all, our results of operations and financial condition could be materially adversely affected by increased costs and rates.\nOur business may be adversely affected by disruptions or lack of liquidity in the credit markets, including reduced access to credit and higher costs of obtaining credit.\nWe depend on the availability of credit to grow our business and to help fund business acquisitions. Instability in the credit markets in the U.S. or abroad, and continued inflation and rising interest rates could cause the availability of credit to be relatively difficult or expensive to obtain on commercially reasonable terms or in sufficient amounts. This situation could make it more difficult or more expensive for us to access funds, refinance our existing indebtedness, enter into agreements for new indebtedness, or obtain funding through the issuance of securities or such additional capital may not be available on terms acceptable to us, or at all. \nWe also routinely enter into contracts with counterparties including vendors, suppliers and subcontractors that may be negatively impacted by events in the credit markets. Disruptions of the credit or capital markets could also adversely affect our clients’ ability to finance projects and could result in contract cancellations or suspensions, project delays and payment delays or defaults by our clients. In addition, clients may be unable to fund new projects, may choose to make fewer capital expenditures or otherwise slow their spending on our services or to seek contract terms more favorable to them. These circumstances could also lead to disputes and litigation with our partners or clients, which could have a material adverse impact on our reputation, business, financial condition and results of operations.\nPage 43\nFurthermore, our cash balances and short-term investments are maintained in accounts held by major banks and financial institutions located primarily in North America, Europe, South America, Australia and Asia. Some of our accounts hold deposits in amounts that exceed available insurance. In addition, we are subject to the risk that the counterparties to our credit agreements may go bankrupt if they suffer catastrophic demand on their liquidity that will prevent them from fulfilling their contractual obligations to us. Although none of our lenders or the financial institutions in which we hold our cash and investments have gone into bankruptcy or forced receivership, or have been seized by their governments, there is a risk that such events may occur in the future. If any such events were to occur, we would be at risk of not being able to access cash, which may result in a temporary liquidity crisis that could impede our ability to fund our operations, which could have a material adverse impact on our business, financial condition and results of operations.\nMaintaining adequate bonding, letter of credit and bank guarantee capacity is necessary for us to successfully bid on and win some contracts.\nIn line with industry practice, we are often required to provide performance or payment bonds, letters of credit and/or bank guarantees at the request of our customers. These instruments indemnify or compensate the customer should we fail to perform our obligations under the contract. If a bond, a letter of credit or a bank guarantee is required for a particular project and we are unable to obtain the required financial support, we may not be able to pursue that project. Historically, we have had adequate credit capacity and access to these financial instruments to satisfy our customers’ requirements. The issuance and availability of these financial instruments, however, is dependent upon number of factors, including the surety’s or bank’s willingness to provide the support, our credit standing and the availability of credit in general. In the event of a change in our credit rating or a tightening of the credit market, it may be difficult to find sureties or banks who will provide required levels of financial support, or it may only be available at significant additional cost. There can be no assurance that our bonding or bank capacity will continue to be available to us on reasonable terms. In addition, future projects may require us to obtain bonding or letters of credit that extend beyond the terms of our surety and banking agreements or exceed our financial wherewithal. Our inability to obtain adequate bonding, letters of credit and bank guarantees when required could have a material adverse impact on our business, financial condition and results of operations.\nOur variable rate indebtedness subjects us to interest rate risk, which could cause our debt service obligations to increase and our net income and cash flows to correspondingly decrease.\nBorrowings under our credit facilities are at variable rates of interest and expose us to interest rate risk. In the past year, inflation and other factors have resulted in an increase in interest rates generally, which has impacted our borrowing costs. Even though interest rates have decreased in recent months, if interest rates were to increase, our debt service obligations on the variable rate indebtedness referred to above would increase even if the principal amount borrowed remained the same, and our net income and cash flows will correspondingly decrease. We are also currently party to, and in the future, we may enter into additional, interest rate swaps that involve the exchange of floating for fixed rate interest payments, in order to reduce interest rate volatility. However, we may not maintain interest rate swaps with respect to all of our variable rate indebtedness, and any swaps we enter into may not fully mitigate our interest rate risk.\nIn addition, our credit facilities reference the Secured Overnight Financing Rate (“SOFR”) as the primary benchmark rate for our U.S. Dollar variable rate indebtedness. SOFR is a relatively new reference rate and with a limited history, and changes in SOFR have, on occasion, been more volatile than changes in other benchmark or market rates. Our indebtedness in other currencies is also subject to various benchmarks that can be difficult to predict. As a result, the amount of interest we may pay on our variable rate indebtedness is difficult to predict. We have also included sustainability-linked key performance indicators (\"KPIs\") in our credit facilities and certain of our senior notes, with KPI targets that include improving gender diversity and, in the case of the senior notes, reducing GHG emissions. Failure to achieve such targets could result in an interest rate step up on the debt, which would cause an increase in our debt payment obligations and could negatively impact our reputation.\nPage 44\nRisks Related to Our Common Stock and Corporate Structure\nOur quarterly results may fluctuate significantly, which could have a material negative effect on the price of our common stock.\nOur quarterly operating results may fluctuate significantly or fall below the expectations of securities analysts, which could have a material adverse impact on the price of our common stock. Fluctuations are caused by a number of factors, including:\n•\nLegal proceedings, disputes and/or government investigations;\n•\nFluctuations in the spending patterns of our government and commercial customers;\n•\nThe number and significance of projects executed during a quarter;\n•\nUnanticipated changes in contract performance, particularly with contracts that have funding limits;\n•\nThe timing of resolving change orders, requests for equitable adjustments, and other contract adjustments;\n•\nDelays incurred in connection with a project;\n•\nChanges in prices of commodities or other supplies;\n•\nChanges in foreign currency exchange rates;\n•\nWeather conditions that delay work at project sites;\n•\nThe timing of expenses incurred in connection with acquisitions or other corporate initiatives;\n•\nThe decision by the Board of Directors to begin or cease paying a dividend, and the expectation that if the Company pays dividends, it will declare dividends at the same or higher levels in the future;\n•\nNatural disasters or other crises;\n•\nStaff levels and utilization rates;\n•\nChanges in prices of services offered by our competitors; and\n•\nGeneral economic and political conditions.\nThere can be no assurance that we will pay dividends on our common stock.\nOur Board of Directors initiated a quarterly cash dividend program in fiscal 2017 under which we have paid, and intend to continue paying, regular quarterly dividends. The declaration, amount and timing of such dividends are subject to capital availability and determinations by our Board of Directors that cash dividends are in the best interest of our shareholders and are in compliance with all respective laws and applicable agreements. Our ability to pay dividends will depend upon, among other factors, our cash balances and potential future capital requirements for strategic transactions, including acquisitions, debt service requirements, results of operations, financial condition and other factors that our Board of Directors may deem relevant. A reduction in or elimination of our dividend payments and/or our dividend program could have a material negative effect on our stock price.\nIn the event we issue stock as consideration for certain acquisitions we may make, we could dilute share ownership, and if we receive stock in connection with a divestiture, the value of stock is subject to fluctuation.\n One method of acquiring companies or otherwise funding our corporate activities is through the issuance of additional equity securities. If we issue additional equity securities, such issuances could have the effect of diluting our earnings per share as well as our existing shareholders’ individual ownership percentages in the Company.\nIn addition, if we receive stock or other equity securities in connection with a sale or divestiture of a business, the value of such stock will fluctuate and/or be subject to trading restrictions. Stock price changes may result from, among other things, changes in the business, operations or prospects of the issuer prior to or following the transaction, litigation or regulatory considerations, general business, market, industry or economic conditions, the ability to sell all or a portion of the stock based on current market conditions, and other factors both within and beyond our control. In addition, if the stock received is valued in a currency other than U.S. dollars, the value of such stock will also fluctuate based on foreign currency rates. \nPage 45\nDelaware law and our charter documents may impede or discourage a takeover or change of control.\nWe are a Delaware corporation. Certain anti-takeover provisions of the Delaware general corporation law impose restrictions on the ability of others to acquire control of us. In addition, certain provisions of our charter documents may impede or discourage a takeover. For example:\n•\nOnly our Board of Directors can fill vacancies on the board;\n•\nThere are various restrictions on the ability of a shareholder to nominate a director for election; and\n•\nOur Board of Directors can authorize the issuance of preferred shares.\nThese types of provisions, as well as our ability to adopt a shareholder rights agreement in the future, could make it more difficult for a third party to acquire control of us, even if the acquisition would be beneficial to our shareholders. Accordingly, shareholders may be limited in the ability to obtain a premium for their shares.\nWe are a holding company. Substantially all of our business is conducted through our subsidiaries. We depend on the performance of our subsidiaries and their ability to make distributions to us to fund our operations.\nWe are a holding company. Substantially all of our business is conducted through our subsidiaries, which are separate and distinct legal entities. Therefore, we are reliant on the operations of our subsidiaries to fund (whether by dividend, distribution or loan) holding company operations, including our ability to pay dividends and service any indebtedness of the holding company. In addition, we cannot assure you that the agreements governing the existing and future indebtedness of our subsidiaries will permit our subsidiaries to provide us with sufficient dividends, distributions or loans to fund payments of dividends or other obligations of the holding company. In addition, any payment of dividends, distributions or loans to us by our subsidiaries could be subject to restrictions on dividends or repatriation of earnings under applicable local law and monetary transfer restrictions in the jurisdictions in which our subsidiaries operate. Furthermore, payments to us by our subsidiaries will be contingent upon our subsidiaries’ earnings.",
    "item1b": "Item 1B.    UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "Item 1C.    CYBERSECURITY\nWe maintain a cybersecurity program, designed to proactively identify, assess, manage, mitigate, and respond to cybersecurity threats. Our Cybersecurity Organization develops, implements, and maintains this program, which is governed by our global cybersecurity policy. The underlying controls of the cybersecurity program are based on recognized best practices and standards for cybersecurity and information technology and is aligned with the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework (“CSF”) and the International Organization for Standardization (“ISO”) 27001 Information Security Management System Requirements. \nCybersecurity is an important and integrated part of our enterprise risk management program that identifies, monitors and mitigates business, operational and legal risks. \nOur cybersecurity risk management process is integrated into our overall risk management process, and shares common methodologies, reporting channels and governance processes that apply across the risk management process to other legal, compliance, strategic, operational and financial risk areas.\nWe regularly assess the threat landscape and take a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection and mitigation. Our cybersecurity program maintains assessment protocols for proactively evaluating potential cybersecurity impacts and risks, supported by incident response procedures. We employ systematic processes to manage cybersecurity risks, including through cybersecurity audits, network interconnectivity reviews, system access controls and monitoring, and data backup and recovery. Our cloud environments undergo continuous assessment, with firewall and backup systems designed to support operational resilience. We employ a Zero Trust Security framework that requires identity verification for network access, complemented by regular system assessments and monitoring. Our security controls include identity management programs, data loss prevention protocols, and threat detection capabilities. Our controls undergo regular review and updates based on threat intelligence, ensuring adaptability to emerging threats. Similarly, our incident response program is regularly tested and updated to address emerging threat landscapes. To ensure organization-wide security awareness, cybersecurity training is mandatory and provided to all employees annually. Cybersecurity awareness is also included across other training programs, including our annual \"Living our Values\" training modules and our privacy training programs.\nPage 46\nThird-party risk management is a critical component of our cybersecurity strategy.\n \nWe maintain oversight of service providers through proactive monitoring, leveraging a cybersecurity questionnaire and security and privacy addenda to our contracts where applicable.\n We evaluate third party providers to ensure they maintain effective security management programs, compliance with information handling and asset management protocols, and provide prompt notification of any known or suspected cybersecurity incidents.\nTo validate our security posture, we engage independent external firms to conduct regular penetration testing, security audits, and cybersecurity consulting. We maintain ISO/IEC 27001 certification for our global enterprise. We also maintain a Cybersecurity Maturity Model Certification (CMMC) L2 certification for our U.S. Federal operations, and Cyber Essentials (CE) Plus certification for our U.K. operations. Additionally, our IT General Controls (ITGCs) undergo annual testing through Sarbanes-Oxley (SOX) audits, which examine security controls relating to system changes, access management, system configurations, and data backup processes. \nOur Board of Directors has ultimate oversight of cybersecurity and information security risk, which it manages as part of our enterprise risk management program. \nThe Board is assisted by the Audit Committee,,as it pertains to cybersecurity threats to the integrity of the Company's financial systems and compliance with cybersecurity related disclosures, and the Sustainability and Risk Committee, as it pertains to cybersecurity as a part of the Company's enterprise risk, which oversee our cybersecurity risk exposures, review management’s mitigation efforts, and report their findings to the Board\n. \nThroughout the year, our senior executives, including our \nChief Information Security Officer (\"CISO\")\n, provide regular briefings to the full Board, the Audit Committee and the Sustainability and Risk Committee.\n These updates cover technology trends, regulatory developments, disclosure requirements, legal issues, policies and practices, threat environment assessments, and ongoing security measures to prevent, detect, and respond to critical threats. The Board and its committees regularly engage in discussions with senior executives regarding cybersecurity and information security risks. As part of our cybersecurity governance, we also maintain a Cybersecurity Steering Committee chaired by our CISO and comprised of executive management, operational leaders, and cross-functional teams. Generally, this committee meets quarterly, or more frequently as needed, to review, assess and direct decisions related to cybersecurity and information systems matters.\nOur cybersecurity program is led by our CISO, who reports to our Chief Information Officer (\"CIO\"). Our CISO oversees prevention, detection, mitigation, and remediation efforts through regular communication and reporting from information security professionals, many of whom have decades of experience and hold certifications such as a Certified Information Systems Security Professional (CISSP) or Certified Information Security Manager (CISM). These efforts are supported by advanced technological tools, specialized software and engagement with external consultants.\n \nOur CISO has extensive experience assessing and managing cybersecurity programs and cybersecurity risk and holds the following credentials: Certified Information Systems Security Professional (CISSP), a Certified Ethical Hacker (CEH), FINRA Licensed (with a Series 99), and an Oracle Cloud Certified Professional (OCP).\n \nOur CISO and CIO regularly provide reports to the \nBoard\n, the Audit Committee and the Sustainability and Risk Committee on our cybersecurity posture, key initiatives and ongoing efforts to prevent, detect, mitigate, and remediate cyber incidents. In the event of a cybersecurity incident, we follow established incident response procedures, which includes protocols for timely notification to senior management as well as the Board of Directors, with ongoing updates provided until the issue is remediated, as appropriate.\nOur operations are subject to cybersecurity risks, including unauthorized access, system failures, and breaches that could originate from both internal networks and through third-party suppliers and service providers. \nWhile we have not experienced a material impact on our business strategy, results of operations and/or financial condition from cybersecurity threats or prior incidents, such events have the potential to have a material adverse effect on such aspects of our business. Realization of these risks could damage or disrupt access to our information systems or networks, compromise confidential or protected information, destroy or corrupt data or otherwise interfere with our operations.\n We continuously monitor our networks for unauthorized access attempts and maintain a range of defensive measures. However, the evolving and sophisticated nature of cyber threats means we cannot guarantee prevention of all potential incidents that could materially impact our business operations, financial condition, or strategic objectives. In addition, even if we effectively defend our own systems, we rely on third-party providers of products, services and networks, with whom we share data and services, and who may themselves be unable to prevent or mitigate cyberattacks."
  }
}