{
  "ticker": "JBHT",
  "cik": "0000728535",
  "company_name": "HUNT J B TRANSPORT SERVICES INC",
  "filing_date": "2025-02-21",
  "accession": "0001437749-25-004736",
  "primary_doc": "jbht20241231d_10k.htm",
  "item_sections": {
    "item1": "ITEM 1.   BUSINESS\n\n\nOVERVIEW\n\n\n \n\n\nWe are one of the largest surface transportation, delivery, and logistics companies in North America. J.B. Hunt Transport Services, Inc. is a publicly held holding company that, through our wholly owned subsidiaries, provides a wide range of reliable transportation, brokerage, and delivery services to a diverse group of customers and consumers throughout the continental United States, Canada, and Mexico. Unless otherwise indicated by the context, “we,” “us,” “our,” the “Company”, and “JBHT” refer to J.B. Hunt Transport Services, Inc. and its consolidated subsidiaries. We were incorporated in Arkansas on August 10, 1961, and have been a publicly held company since our initial public offering in 1983. Our service offerings include transportation of full-truckload containerized freight, which we directly transport utilizing our company-controlled revenue equipment and company drivers, independent contractors, or third-party carriers. We have arrangements with most of the major North American rail carriers to transport freight in containers or trailers, while we perform the majority of the pickup and delivery services. We also provide customized freight movement, revenue equipment, labor, systems, and delivery services that are tailored to meet individual customers’ requirements and typically involve long-term contracts. These arrangements are generally referred to as dedicated services and may include multiple pickups and drops, freight handling, specialized equipment, and freight network design. In addition, we provide or arrange for local and home delivery services, generally referred to as last-mile delivery services, to customers through a network of cross-dock and other delivery system locations throughout the continental United States. Utilizing thousands of reliable third-party carriers, we also provide comprehensive freight transportation brokerage and logistics services. In addition to dry-van, full-load operations, we also arrange for these unrelated outside carriers to provide flatbed, refrigerated, less-than-truckload (LTL), and other specialized equipment, drivers, and services. Also, we utilize contracted power units to provide traditional over-the-road full truckload delivery services. Our customers, who include many Fortune 500 companies, have extremely diverse businesses. Many of them are served by J.B. Hunt 360°®, an online platform that offers shippers and carriers greater access, visibility and transparency of the supply chain.\n\n\n \n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nWe believe our ability to offer multiple services, utilizing our existing lines of business and a full complement of logistics services through third parties, represents a competitive advantage. We report our operating results for these services using five reporting segments: Intermodal (JBI), Dedicated Contract Services® (DCS®), Integrated Capacity Solutions (ICS), Final Mile Services® (FMS) and Truckload (JBT). Our business usually involves slightly higher freight volumes in August through early November. Meanwhile, DCS and FMS are subject to less seasonal variation than our other segments.\n\n\n \n\n\nAdditional general information about us is available at jbhunt.com. We make a number of reports and other information available free of charge on our website, including our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. Our website also contains corporate governance guidelines, our code of ethics, our whistleblower policy, Board committee charters, and other corporate policies. The information on our website is not, and shall not be deemed to be, a part of this annual report on Form 10-K or incorporated into any other filings we make with the SEC.\n\n\n \n\n\nOUR VISION, MISSION AND STRATEGY\n\n\n \n\n\nOur Vision: To create the most efficient transportation network in North America.         \n\n\n \n\n\nOur Mission: Driving long-term value for our people, customers and shareholders.\n\n\n \n\n\nWe forge long-term relationships with key customers that include supply chain management as an integral part of their strategies. Working in concert, we strive to drive out excess cost, add value and function as an extension of their enterprises. Our strategy is based on utilizing an integrated, multimodal approach to provide capacity-oriented solutions centered on delivering customer value and industry-leading service. We believe our unique operating strategy can add value to customers and increase our profits and returns to shareholders.\n\n\n \n\n\nWe continually analyze opportunities for additional capital investment and where management’s resources should be focused to provide more benefits to our customers. These actions should, in turn, yield increasing returns to our shareholders.\n\n\n \n\n\nIncreasingly, our customers are seeking energy-efficient transportation solutions to reduce both cost and greenhouse-gas emissions. Our Company’s vision, to create the most efficient transportation network in North America, focuses on delivering both for our customers across all of our business segments. We seek to accomplish this by maintaining a modern fleet to maximize fuel efficiency, converting loads from truck to rail with our intermodal service, and introducing technologies to optimize freight flows in the supply chain by eliminating waste. Additionally, we continue to test and explore the usage of alternative fuel vehicles. Efforts to improve fleet fuel efficiency and reduce greenhouse gas emissions are ongoing. We are an Environmental Protection Agency (EPA) SmartWay® Transport Partner, and a proud thirteen-time recipient of the EPA’s SmartWay® Excellence Award (awarded consecutively through 2021 before the award program was paused in 2022 and 2023. In 2024 we were listed in Smartway's High Performer List which highlights companies who have achieved significant shipping and freight efficiencies that merit special attention.\n\n\n \n\n\nAs always, we continue to ingrain safety into our corporate culture and strive to conduct all of our operations as safely as possible.\n\n\n \n\n\n\n\n3\n\n\n\n\n \n\n\n\n\n \n\n\nOPERATING SEGMENTS\n\n\n \n\n\nSegment information is also included in Note 13 to our Consolidated Financial Statements.\n\n\n \n\n\nJBI Segment\n\n\n \n\n\nThe transportation service offerings of our JBI segment utilize arrangements with most major North American rail carriers to provide intermodal freight solutions for our customers throughout the continental United States, Canada, and Mexico. Our JBI segment began operations in 1989, forming a unique partnership with what is now the BNSF Railway Company (BNSF); this was a watershed event in the industry and the first agreement that linked major rail and truckload carriers in a joint service environment. Throughout the years that followed, JBI established multiple agreements with other Class I railroads. JBI draws on the intermodal services of these rail carriers for the underlying linehaul movement of its equipment between rail ramps. The origin and destination pickup and delivery services (drayage) are handled by our company-owned tractors for the majority of our intermodal loads, while third-party dray carriers are used where economical. By performing our own drayage services, we are able to provide a cost-competitive, seamless coordination of the combined rail and dray movements for our customers.\n\n\n \n\n\nJBI operates 122,272 pieces of company-owned trailing equipment systemwide. The fleet primarily consists of 53-foot, high-cube containers and is designed to take advantage of intermodal double-stack economics and superior ride quality.  We own and maintain our own chassis fleet, consisting of 103,850 units. The containers and chassis are uniquely designed so that they may only be paired together for optimal productivity, which we feel creates an operational competitive advantage.  JBI also manages a fleet of 6,153 company-owned tractors and contracts 349 independent contractor trucks.  At December 31, 2024, the total JBI employee count was 9,253, including 8,117 company drivers and 4 delivery and material assistants.  Revenue for the JBI segment in 2024 was $5.96 billion.\n\n\n \n\n\nDCS Segment\n\n\n \n\n\nDCS focuses on private fleet conversion and creation in replenishment and specialized equipment.  We specialize in the design, development, and execution of supply chain solutions that support a variety of transportation networks. Contracts with our customers are long-term, ranging from three to 10 years, with the average being approximately five years. Pricing of our contracts typically involves cost-plus arrangements, with our fixed costs being recovered regardless of equipment utilization, but is customized based on the amount of invested capital and the duration of the contract.\n\n\n \n\n\nAt December 31, 2024, this segment operated 12,048 company-owned trucks, 598 customer-owned trucks, and one independent contractor truck.  DCS also operates 27,149 owned pieces of trailing equipment and 4,897 customer-owned trailers. The DCS segment employed 15,521 people, including 13,173 drivers and 39 delivery and material assistants, at December 31, 2024.  DCS revenue for 2024 was $3.40 billion.\n\n\n \n\n\nICS Segment\n\n\n \n\n\nICS provides traditional freight brokerage and transportation logistics solutions to customers through relationships with thousands of third-party carriers and integration with our owned equipment within other segments. By leveraging the J.B. Hunt brand, systems, and network, we provide a broader service offering to customers by providing flatbed, refrigerated, and expedited, as well as a variety of dry-van and intermodal solutions. Furthermore, we offer an online multimodal marketplace via J.B. Hunt 360 that helps shippers and carriers match the right load with the right carrier. ICS also provides the majority of our single-source logistics management services for customers desiring to outsource their transportation functions and utilize our proven supply chain technology and design expertise to improve efficiency. ICS operates multiple remote sales offices or branches, as well as on-site logistics personnel working in direct contact with customers.\n\n\n \n\n\nAt December 31, 2024, the ICS segment employed 590 people, with approximately 110,000 available third-party carriers. ICS revenue for 2024 was $1.14 billion.\n\n\n \n\n\n\n\n4\n\n\n\n\n \n\n\n\n\n \n\n\nFMS Segment\n\n\n \n\n\nFMS provides last-mile delivery services to customers through a nationwide network of cross-dock and other delivery system network locations, with 98% of the continental U.S. population living within 150 miles of a network location. FMS provides both asset and non-asset (brokerage) big and bulky delivery and installation services, as well as fulfillment, retail-pooling distributions, and LTL services. FMS contracts with customers range from one to five years, with the average being approximately three years.\n\n\n \n\n\nAt December 31, 2024, this segment operated 1,123 company-owned trucks, 206 customer-owned trucks, and 36 independent contractor trucks. FMS also operates 1,137 owned pieces of trailing equipment and 104 customer-owned trailers. The FMS segment employed 2,587 people, including 1,280 drivers and 338 delivery and material assistants, at December 31, 2024. FMS revenue for 2024 was $910 million.\n\n\n \n\n\nJBT Segment\n\n\n \n\n\nThe service offering in this segment is full-load, dry-van freight, utilizing tractors and trailers operating over roads and highways. JBT offers these services through our J.B. Hunt 360box® program which utilizes our J.B. Hunt 360 platform to access capacity and offer efficient drop trailer solutions to our customers. We typically pick up freight at the dock or specified location of the shipper and transport the load directly to the location of the consignee.  We use independent contractors or third-party carriers who agree to transport freight in our trailers as well as available company-owned tractors and employee drivers.\n\n\n \n\n\nAt December 31, 2024, the JBT segment operated 12,895 company-owned trailers, two company-owned tractors, and employed 266 people, three of whom were drivers. At December 31, 2024, we had 1,917 independent contractors operating in the JBT segment.  JBT revenue for 2024 was $702 million.\n\n\n \n\n\nMarketing and Operations\n\n\n \n\n\nWe transport, or arrange for the transportation of, a wide range of freight, including general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. Our customer base includes a large number of Fortune 500 companies. We provide many transportation services that meet the supply chain logistics needs of shippers.\n\n\n \n\n\nWe generally market all of our service offerings through a nationwide sales and marketing network. We use specific sales forces in DCS and FMS due to the length, complexity, and specialization of the sales cycle. In addition to our sales teams, J.B. Hunt 360 offers instant access to a wide array of technology-driven solutions for customers and carriers. Through the platform, businesses of all sizes can quote and book shipments, view analytics, and gain visibility into freight movement. In accordance with our typical arrangements, we bill the customer for all services, and we, in turn, pay all third parties for their portion of transportation services provided.\n\n\n \n\n\nHuman Capital Resources\n\n\n \n\n\nGeneral\n\n\n \n\n\nDespite operating over 189,000 pieces of transportation equipment, our single greatest asset and one of the factors differentiating us from our competitors is our service-oriented people. We strive to provide a supportive and safe work environment for its employees, where diverse and innovative ideas can be fostered to solve problems and provide value-added services for our customers. We put forth our best effort to support initiatives that benefit our people and reflect our company values of integrity, respect, innovation, safety, and excellence.\n\n\n \n\n\nAs of December 31, 2024, we had 33,646 employees, which consisted of 22,573 company drivers, 9,266 office personnel, 1,426 maintenance technicians, and 381 delivery and material assistants.  We also had arrangements with 2,303 independent contractors to transport freight in our trailing equipment. None of our employees are represented by unions or covered by collective bargaining agreements.\n\n\n \n\n\n\n\n\n\n\n\n5\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nIn managing the Company’s business, our executive leadership focuses on various human capital measures and objectives designed to address the attraction, development, and retention of personnel across the dimensions of culture, career, and wellness. These include but are not limited to competitive compensation and benefits, paid time off, employee retirement plans, bonus and other incentive compensation plans, modern equipment and support, employee listening programs connecting feedback with business action, leadership development, recognition, and tuition assistance.\n\n\n \n\n\nCulture and Belonging\n\n\n \n\n\nWe work to foster a culture where all employees feel welcomed, valued, respected, safe, and heard, and where the actions of our people reflect our company values.\n\n\n \n\n\nWe measure ourselves through listening to our employees in surveys, focus groups, and town hall meetings with leadership. We use data and ideas from those activities to drive action in support of our leaders and teams. We also facilitate ideation from all employees through our process improvement platform, ELEVATION, where anyone can submit an idea to make the company better.\n\n\n \n\n\n \n\n\nIn addition, our Employee Resource Groups (ERGs), Inclusion Office, and Inclusion Council work together to further a culture of inclusivity. The Company’s seven ERGs are open to all of our employees and offer opportunities for professional development and networking.\n\n\n \n\n\nCareer and Opportunity\n\n\n \n\n\nProviding career opportunities for our people is an ongoing commitment. Thousands of employees have had the chance to move jobs or be promoted into new roles, and thousands more have participated in leadership training over their careers, including training opportunities for field and office positions. In addition to offering tuition assistance for degree programs or certifications to our employees, family members of employees are also eligible to apply for the J.B. Hunt Scholarship Program for Families, offering the opportunity to receive $2,500 each school year, and up to $10,000 over four years.\n\n\n \n\n\nWellness and Safety\n\n\n \n\n\nThe health and well-being of our workforce has always been a priority as safety is ingrained into our corporate culture and is a company value. We strive to conduct all of our operations as safely as possible. Many of our employees participate in regular job-specific safety training programs. In addition, our Million Mile Safe Driving and Recognition Awards Program has for more than 25 years recognized and rewarded our drivers who dedicate themselves to accident-free driving. Since its inception in 1996, the program has awarded more than $40 million in safe driving bonuses, and in 2024, surpassed 5,000 drivers who have achieved one million safe miles.\n\n\n \n\n\nWe believe that access to quality healthcare is also an important part of this priority, and we have programs in place that focus on improving the quality of care that our employees and their families receive. From new and expanded benefit programs to case management support to shortened eligibility waiting periods and more, we are continually assessing our offerings in a competitive and ever-changing healthcare landscape. Paid leave is another key component of this focus, and we offer benefit plans that comply with all applicable laws. Financial wellness is also included in our focus, and we provide seed funding for healthcare savings accounts and opportunities to participate in 401(k) retirement plans.\n\n\n \n\n\nWe are a company that prioritizes a supportive and safe work environment. We believe this is essential for our people to grow and thrive, and for innovative ideas to be fostered and problems to be solved. Throughout this approach, we fulfill our mission to provide long-term value for our people, customers, and shareholders.\n\n\n \n\n\nRevenue Equipment\n\n\n \n\n\nOur JBI segment utilizes uniquely designed high-cube containers and chassis, which can only be paired with each other and can be separated to allow the containers to be double-stacked on rail cars. The composition of our DCS trailing fleet varies with specific customer requirements and may include dry-vans, flatbeds, bulk, temperature-controlled, curtain-side vans, and dump trailers. We primarily utilize third-party carriers’ tractor and trailing equipment for our ICS segment. Our FMS segment primarily utilizes straight trucks or similar equipment through third-party carriers, while the JBT segment operates primarily 53-foot dry-van trailers.\n\n\n \n\n\n\n\n\n\n\n\n6\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nAs of December 31, 2024, our company-owned tractor and truck fleet consisted of 19,326 units. In addition, we had 2,303 independent contractors who operate their own tractors but transport freight in our trailing equipment. We operate with standardized tractors in as many fleets as possible, particularly in our JBI and JBT fleets. Due to our customers’ preferences and the actual business application, our DCS fleet is extremely diversified. We believe operating with relatively newer revenue equipment provides better customer service, attracts quality drivers, improves fuel efficiency and lowers maintenance expense. At December 31, 2024, the average age of our combined tractor fleet was 2.4 years, while our containers averaged 9.6 years of age and our trailers averaged 6.5 years. We perform routine servicing and preventive maintenance on our equipment at our regional terminal facilities.\n\n\n \n\n\nCompetition and the Industry\n\n\n \n\n\nThe freight transportation markets in which we operate are frequently referred to as highly fragmented and competitive. Our JBI segment competes with other intermodal marketing companies; other full-load carriers that utilize railroads for a portion of the transportation service; and, to a certain extent, some railroads directly. The diversified nature of the services provided by our DCS and FMS segments attracts competition from customers’ private fleets, other private fleet outsourcing companies, equipment leasing companies, local and regional delivery service providers, and some truckload carriers. Our ICS segment utilizes the fragmented nature of the truck industry and competes with other non-asset-based logistics companies and freight brokers, as well as full-load carriers. The full-load freight competition of our JBT segment includes thousands of carriers, many of which are very small. While we compete with a number of smaller carriers on a regional basis, only a limited number of companies represent competition in all markets across the country.\n\n\n \n\n\nWe compete with other transportation service companies primarily in terms of price, on-time pickup and delivery service, availability and type of equipment capacity, and availability of carriers for logistics services.\n\n\n \n\n\nRegulation\n\n\n \n\n\nOur operations as a for-hire motor carrier are subject to regulation by the U.S. Department of Transportation (DOT) and the Federal Motor Carrier Safety Administration (FMCSA), and certain business is also subject to state rules and regulations. The DOT periodically conducts reviews and audits to ensure our compliance with federal safety requirements, and we report certain accident and other information to the DOT. Our operations into and out of Canada and Mexico are subject to regulation by those countries as well as U.S. Customs and Boarder Protection with respect to cross-border trade and security compliance. We are also subject to a variety of requirements of national, state, and local governments, including the U.S. Environmental Protection Agency and the Occupational Safety and Health Administration.\n\n\n \n\n\nWe are subject to various environmental laws and regulations dealing with the handling of hazardous materials, underground fuel storage tanks, and discharge and retention of storm water. These laws and regulations have the effect of increasing the costs, risks and liabilities associated with our applicable operations. We are also subject to existing and potential future laws and regulations with regards to public policy on climate change. If current regulatory requirements become more stringent or new environmental laws and regulations regarding climate change are introduced, we could be required to make significant expenditures or abandon certain activities.\n\n\n \n\n\nWe continue to monitor the actions of the FMCSA and other regulatory agencies and evaluate all proposed rules to determine their impact on our operations.\n\n\n \n\n\n\n\n\n\n\n\n7",
    "item1a": "ITEM 1A.   RISK FACTORS\n\n\n \n\n\nIn addition to the factors outlined previously in this Form 10-K regarding forward-looking statements and other comments regarding risks and uncertainties, the following risk factors should be carefully considered when evaluating our business. Our business, financial condition or financial results could be materially and adversely affected by any of these risks.\n\n\n \n\n\nRisks Related to Our Industry\n\n\n \n\n\nOur business can be significantly impacted by economic conditions, customer business cycles, government policies, and seasonal factors.\n\n\n \n\n\nOur business is dependent on the freight shipping needs of our customers, which can be heavily impacted by economic conditions and other factors affecting their businesses. Recessionary economic cycles and downturns in customers’ business cycles, particularly in market segments and industries where we have a significant concentration of customers, may substantially reduce freight volumes for which our customers need transportation services and lead to excess capacity in the industry and resulting pressure on the rates we are able to obtain for our services. Adverse economic conditions may also require us to increase our reserve for bad debt losses. Rapid changes in government or political policies, including border or trade policies and tariffs, can also impact our customers operations and reduce their need for freight shipping, or may have an impact on the cost or availability of our equipment. In addition, our results of operations may be affected by seasonal factors. Customers tend to reduce shipments after the winter holiday season, and our operating expenses tend to be higher in the winter months, primarily due to colder weather, which causes higher fuel consumption from increased idle time and higher maintenance costs. Any of these factors could have a significant adverse effect on our financial condition and results of operations.\n\n\n \n\n\nExtreme or unusual weather conditions can disrupt our operations, impact freight volumes, and increase our costs, all of which could have a material adverse effect on our business results.\n\n\n \n\n\nCertain weather conditions such as ice and snow can disrupt our operations. Increases in the cost of our operations, such as towing and other maintenance activities, frequently occur during the winter months. Natural disasters such as hurricanes and flooding can also impact freight volumes and increase our costs.\n\n\n \n\n\nOur operations are subject to various environmental laws and regulations, including legislative and regulatory responses to climate change. Compliance with environmental requirements could result in significant expenditures and the violation of these regulations could result in substantial fines or penalties.\n\n\n \n\n\nWe are subject to various environmental laws and regulations dealing with the handling of hazardous materials, underground fuel storage tanks, and discharge and retention of storm water. We operate in industrial areas, where truck terminals and other industrial activities are located and where groundwater or other forms of environmental contamination have occurred. Our operations involve the risks of fuel spillage or seepage, environmental damage, and hazardous waste disposal, among others. We also maintain bulk fuel storage and fuel islands at several of our facilities. If a spill or other accident involving hazardous substances occurs, or if we are found to be in violation of applicable laws or regulations, it could have a material adverse effect on our business and operating results. If we should fail to comply with applicable environmental regulations, we could be subject to substantial fines or penalties and to civil and criminal liability.\n\n\n \n\n\nWe are also subject to existing and potential future laws and regulations with regards to public policy on climate change. If current regulatory requirements become more stringent or new environmental laws and regulations regarding climate change are introduced, we could be required to make significant expenditures or abandon certain activities, which could have a material adverse effect on our business and operating results.\n\n\n \n\n\n\n\n\n\n\n\n8\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nWe depend on third parties in the operation of our business, particularly rail service providers, transportation equipment manufacturers, third party carriers and independent contractors. \n\n\n \n\n\nOur JBI business segment utilizes railroads in the performance of its transportation services. The majority of these services are provided pursuant to contractual relationships with the railroads. While we have agreements with a number of Class I railroads, the majority of our business travels on the BNSF and the Norfolk Southern railways. The transportation services provided by these railroads have been in recent years and may from time to time in the future be impacted by contractual disagreements, labor disruptions or shortages, and other rail network inefficiencies. A material change in the relationship with, the ability to utilize or the overall service levels provided by one or more of these railroads could have a material adverse effect on our business and operating results. In addition, a portion of the freight we deliver is imported to the United States through ports of call that are subject to labor union contracts. Work stoppages or other disruptions at any of these ports could have a material adverse effect on our business.\n\n\n \n\n\nWe regularly purchase new revenue equipment, including trucks, chassis and trailing equipment, in each of our operating segments to expand our fleets and replace aging equipment. Any significant delays in the availability of new revenue equipment or increases in the cost of such equipment could have a material adverse affect on our business and profitability by reducing productivity, increasing maintenance expenses and capital expenditures, and limiting our ability to expand our business.\n\n\n \n\n\nWe also utilize independent contractors and third-party carriers to complete our services. These third parties are subject to similar regulation requirements, which may have a more significant impact on their operations, causing them to exit the transportation industry. Aside from when these third parties may use our trailing equipment to fulfill loads, we do not own the revenue equipment or control the drivers delivering these loads. The inability to obtain reliable third-party carriers and independent contractors could have a material adverse effect on our operating results and business growth.\n\n\n \n\n\nRapid changes in fuel costs could impact our periodic financial results.\n\n\n \n\n\nFuel costs can be very volatile. We have a fuel surcharge revenue program in place with the majority of our customers, which has historically enabled us to recover the majority of higher fuel costs. Most of these programs automatically adjust weekly depending on the cost of fuel. However, there can be timing differences between a change in our fuel cost and the timing of the fuel surcharges billed to our customers. In addition, we incur additional costs when fuel price increases cannot be fully recovered due to our engines being idled during cold or warm weather and empty or out-of-route miles that cannot be billed to customers. Rapid increases in fuel costs or shortages of fuel could have a material adverse effect on our operations or future profitability. As of December 31, 2024, we had no derivative financial instruments to reduce our exposure to fuel-price fluctuations.\n\n\n \n\n\nInsurance and claims expenses could significantly reduce our earnings.\n\n\n \n\n\nOur future insurance and claims expenses might exceed historical levels, which could reduce our earnings. We have experienced substantial increases in the severity of auto liability claims which have exceeded our insurance coverage layers, which has adversely impacted our operating results in recent periods. If the number of claims for which we are self-insured increases or the severity of such claims continues to increase, our operating results could be further adversely affected. We have policies in place for 2025 with substantially the same terms as our 2024 policies for personal injury, property damage, workers’ compensation, and cargo loss or damage. We purchase insurance coverage for the amounts above which we are self-insured. If these expenses increase and we are unable to offset the increase with higher freight rates, our earnings could be materially and adversely affected.\n\n\n \n\n\nWe operate in a regulated industry, and increased direct and indirect costs of compliance with, or liability for violation of, existing or future regulations could have a material adverse effect on our business.\n\n\n \n\n\nThe DOT, FMCSA, and various state agencies exercise broad powers over our business, generally governing matters including authorization to engage in motor carrier service, equipment operation, safety, and financial reporting. We are audited periodically by the DOT to ensure that we are in compliance with various safety, hours-of-service, and other rules and regulations. If we were found to be out of compliance, the DOT could restrict or otherwise impact our operations. Our failure to comply with any applicable laws, rules or regulations to which we are subject, whether actual or alleged, could expose us to fines, penalties or potential litigation liabilities, including costs, settlements and judgments. Further, these agencies could institute new laws, rules or regulations or issue interpretation changes to existing regulations at any time. Compliance with new laws, rules or regulations could substantially impair labor and equipment productivity, increase our costs or impact our ability to offer certain services.\n\n\n \n\n\n\n\n\n\n\n\n9\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nDifficulty in attracting and retaining drivers and delivery personnel could affect our profitability and ability to grow.\n\n\n \n\n\nIf we are unable to attract and retain the necessary quality and number of employees, we could be required to significantly increase our employee compensation package, let revenue equipment sit idle, dispose of the equipment altogether, or rely more on higher-cost third-party carriers, which could adversely affect our growth and profitability. In addition, our growth could be limited by an inability to attract third-party carriers upon whom we rely to provide transportation services.\n\n\n \n\n\nWe operate in a competitive and highly fragmented industry. Numerous factors could impair our ability to maintain our current profitability and to compete with other carriers and private fleets.\n\n\n \n\n\nWe compete with many other transportation service providers of varying sizes and, to a lesser extent, with LTL carriers and railroads, some of which have more equipment and greater capital resources than we do. Additionally, some of our competitors periodically reduce their freight rates to gain business, especially during times of reduced growth rates in the economy, which may limit our ability to maintain or increase freight rates or to maintain our profit margins.\n\n\n \n\n\nIn an effort to reduce the number of carriers it uses, a customer often selects so-called “core carriers” as approved transportation service providers, and in some instances, we may not be selected. Many customers periodically accept bids from multiple carriers for their shipping needs, and this process may depress freight rates or result in the loss of some business to competitors. Also, certain customers that operate private fleets to transport their own freight could decide to expand their operations, thereby reducing their need for our services.\n\n\n \n\n\nOur business can be significantly impacted by the effects of national or international health pandemics on general economic conditions and the operations of our customers and third-party suppliers and service providers.\n\n\n \n\n\nOur operations can be heavily impacted by the effects of a widespread outbreak of contagious disease. The effects of a pandemic may disrupt or restrict the freight shipping activities of some of our customers, on which our business is dependent. In addition, adverse economic conditions caused by a pandemic may also require us to increase our reserve for bad debt losses. Furthermore, pandemic related social and economic disruptions may lead to other events which could negatively impact our operations including service limitations of our third-party purchased transportation providers, reduced availability of drivers and other key employees, disruptions in the procurement of revenue equipment, restrictions at U.S. ports of call, excess capacity or rate reductions within the intermodal or trucking industries, inability of suppliers to continue activities, or volatile financial credit markets. The extent to which a pandemic will impact general economic and business conditions is highly uncertain and unpredictable; however, any of these factors could have a significant adverse effect on our financial condition and results of operations.\n\n\n \n\n\nRisks Related to Our Business\n\n\n \n\n\nWe derive a significant portion of our revenue from a few major customers, the loss of one or more of which could have a material adverse effect on our business.\n\n\n \n\n\nFor the calendar year ended December 31, 2024, our top 10 customers, based on revenue, accounted for approximately 35% of our revenue. One customer accounted for approximately 11% of our total revenue for the year ended December 31, 2024. Our JBI, ICS, and JBT segments typically do not have long-term contracts with their customers. While our DCS and FMS segments may involve long-term written contracts, those contracts may contain cancellation clauses, and there is no assurance that our current customers will continue to utilize our services or continue at the same levels. A reduction in or termination of our services by one or more of our major customers could have a material adverse effect on our business and operating results.\n\n\n \n\n\n\n\n\n\n\n\n10\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nA determination that independent contractors are employees could expose us to various liabilities and additional costs. \n\n\n \n\n\nFederal and state legislation as well as tax and other regulatory authorities have sought to assert that independent contractors in the transportation service industry are employees rather than independent contractors. Recently issued rulemaking by the U.S. Department of Labor, which took effect on March 11, 2024, and the laws of several states, including California, apply stricter tests for determining whether an independent contractor should be classified as an employee. We believe we are in compliance with all applicable independent contractor classification requirements. However, it is possible that other federal or state legislation or regulations could be enacted or that various authorities could assert a position that re-classifies independent contractors as employees. If our independent contractors are determined to be properly classified as employees, that determination could materially increase our exposure under a variety of federal and state tax, workers’ compensation, unemployment benefits, labor, employment and tort laws, as well as our potential liability for employee benefits. In addition, such changes may be applied retroactively, and if so, we may be required to pay additional amounts to compensate individuals for prior time periods. Any of the above increased costs would adversely affect our business and operating results.\n\n\n \n\n\nWe may be subject to litigation claims that could result in significant expenditures.\n\n\n \n\n\nWe by the nature of our operations are exposed to the potential for a variety of litigation, including personal injury claims, vehicular collisions and accidents, alleged violations of federal and state labor and employment laws, such as class-action lawsuits alleging wage and hour violations and improper pay, commercial and contract disputes, cargo loss and property damage claims. While we purchase insurance coverage at levels we deem adequate, future litigation may exceed our insurance coverage or may not be covered by insurance. We accrue a provision for a litigation matter according to applicable accounting standards based on the ongoing assessment of the strengths and weaknesses of the litigation, its likelihood of success, and an evaluation of the possible range of loss. Our inability to defend ourselves against one or more significant litigation claims could have a material adverse effect on our financial results.\n\n\n \n\n\nWe rely significantly on our information technology systems, a disruption, failure or security breach of which or an inability to keep pace with technological advances could have a material adverse effect on our business.\n\n\n \n\n\nWe rely on information technology throughout all areas of our business to initiate, track, and complete customer orders; process financial and nonfinancial data; compile results of operations for internal and external reporting; and achieve operating efficiencies and growth. We have also invested significantly in the development of our Marketplace for J.B. Hunt 360 online freight matching platform. Each of our information technology systems may be susceptible to various interruptions, including equipment or network failures, failed upgrades or replacement of software, user error, power outages, natural disasters, cyber-attacks, theft or misuse of data, terrorist attacks, computer viruses, hackers, or other security breaches. We have in the past experienced security breaches and other interruptions of our information technology systems and may in the future experience such breaches or interruptions despite our best efforts to prevent them. We have mitigated our exposure to these risks through the establishment and maintenance of technology security programs and disaster recovery plans, but these mitigating activities may not be sufficient. A significant disruption, failure or security breach in our information technology systems could have a material adverse effect on our business, which could include operational disruptions, loss of confidential information, external reporting delays or errors, legal claims, or damage to our business reputation. We also could experience an inability to keep pace with technological advances, resulting in our information technology platforms becoming obsolete or our competitors developing related or similar service offerings more effective than ours.\n\n\n \n\n\n\n\n\n\n\n\n11\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nAcquisitions or business combinations\n \nmay disrupt or have a material adverse effect on our operations or earnings.\n\n\n \n\n\nFuture growth strategies for our operating segments may involve the acquisition of one or more businesses. We could have difficulty integrating acquired companies’ assets, personnel and operations with our own.  Regardless of whether we are successful in making an acquisition or completing a business combination, the negotiations could disrupt our ongoing business, distract our management and employees, and increase our operating costs.  Acquisitions and business combinations are accompanied by a number of inherent risks, including, without limitation, the difficulty of integrating acquired companies and operations; potential disruption of our ongoing businesses and distraction of our management or the management of acquired companies; difficulties in maintaining controls, procedures and policies; potential impairment of relationships with employees and partners as a result of any integration of new management personnel; potential inability to manage an increased number of locations and employees; failure to realize expected efficiencies, synergies and cost savings; or the effect of any government regulations which relate to the businesses acquired.\n\n\n \n\n\nOur business could be materially impacted if and to the extent that we are unable to succeed in addressing any of these risks or other problems encountered in connection with an acquisition or business combination, many of which cannot be presently identified.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\n\n\n \n\n\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\n\n\n \n\n\n\n\nIT Risk Management\n\n\n \n\n\nThe Company maintains an information technology (IT) risk identification process that encompasses risks associated with \nenterprise solutions and products and services provided by third-party service providers\n. Cybersecurity risks are considered a subcategory of IT risks and are therefore part of this process. The Company maintains a risk register to document and track IT risks, including factors such as:\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nCategories (including but not limited to cybersecurity, data privacy, governance, and application development)\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nLikelihood and impact\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nInitial risk score\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nMitigating controls and/or remediations\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nResidual risk score\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nPlan for remediation\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nRisk stage\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nReviewers/owners\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n●\n\n\n\n\n\n\nApprovals/exceptions\n\n\n\n\n\n\n\n\n \n\n\nThe Company’s Governance, Risk, and Compliance (GRC) team maintains the IT risk register and reports updates to the IT Risk Council, which meets regularly. The IT Risk Council is made up of members representing the Company’s cybersecurity, network, server, client, database, and software teams.\n\n\n \n\n\nCybersecurity Operations and Incident Response Capabilities\n\n\n \n\n\nThe Company maintains a Cybersecurity Operations Center (CSOC) comprised of in-house staff, contracted personnel, and other \nthird-party security service providers\n. Our CSOC provides constant monitoring, assessment, and defense of all enterprise information systems (including web sites, applications, databases, servers, clients, and data centers) as well as service provider connections and provides incident reporting as needed.\n\n\n \n\n\nThe Company also maintains a Security Incident Response Team (SIRT) that responds to high-risk security incidents on a 24-hour basis. Members of this team include representatives of our CSOC and Networking Operations Center, as well as cloud/server engineering, network engineering, enterprise data, identity and access management, GRC, end-user computing, application development, and IT leadership teams.\n\n\n \n\n\n\n\n\n\n\n\n12\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nAssessments and Audits\n\n\n \n\n\nThe Company uses various methods to assess our cybersecurity maturity and IT risk management program, including periodic self-assessments and engagements of independent third-party assessors and consultants. We engaged third-party experts for the initial development of the IT risk management program, including preparation of the program charter, IT risk register, and responsibility assignment matrix. We use these \nexternal engagements to provide multiple assessments of our cybersecurity functions, including a compromise assessment, a security posture assessment, and a cyber-defense assessment\n.\n\n\n \n\n\nRisks Associated with Third-Party Service Providers\n\n\n \n\n\nThe Company’s GRC oversees assessments of third-party service providers in collaboration with our IT contracts, data privacy, technical architecture, and legal teams. An initial review for any cybersecurity threat is completed when the provider is onboarded, with subsequent periodic reviews conducted thereafter. These subsequent reviews occur at different intervals, based on the nature of the business relationship, the type of data being exchanged (if any), and the overall potential impact to the Company, and include consideration of factors such as the third party’s cybersecurity capabilities, data protections and privacy measures, and technical capabilities as related to required integrations with the Company’s systems.\n\n\n \n\n\nMaterial Findings from Cybersecurity Risks\n\n\n \n\n\nThe Company faces many of the same risks and has experienced similar cybersecurity incidents as other transportation providers. None of these risks or incidents to date have materially affected our business strategy, operations, or financial condition.\n\n\n \n\n\n\n\nGovernance\n\n\n \n\n\nThe Board of Directors maintains oversight of risks from cybersecurity-related threats, primarily through the \nAudit Committee\n. The Audit Committee holds a separate annual in-person meeting with the Company’s Chief Information Officer (CIO) and subsequently provides an update to the Board. The Company’s CIO also attends a second annual meeting directly with the full Board of Directors. Beginning in 2025, in addition to these annual meetings, the CIO or the Sr. Vice President of Engineering & Technology is scheduled to meet with the Audit Committee such that the Board and the Committee receive updates on at least a quarterly basis. Other updates are provided throughout the year to the Audit Committee and the Board, as needed. In the event a cybersecurity incident is determined to be significant, a formal meeting of the full Board of Directors may be convened.\n\n\n \n\n\nManagement \n\n\n \n\n\nThe \nCompany’s CIO, Senior Vice President of Engineering and Technology responsible for technical services, and Vice President of Engineering and Technology\n responsible for IT risk management oversee all material risks associated with cybersecurity threats. Our CIO has over 30 years of experience leading data and technology initiatives and has held executive and senior leadership roles across Fortune 500 companies. Our Senior Vice President of Engineering and Technology has more than 34 years of IT experience and has led initiatives in IT application development, IT operations, cloud computing, cybersecurity, business continuity, governance, compliance, and enterprise risk management across various industries. Our Vice President of Engineering and Technology, has more than 30 years of expertise with the Company in cybersecurity, engineering, governance, risk, and compliance, having successfully led numerous projects for the Company. Their backgrounds provide them with a comprehensive understanding of cybersecurity challenges and solutions.\n\n\n \n\n\nIn the event of a cybersecurity incident, these leaders engage the Incident Response Team (IRT), a team comprised of senior- and executive-level leaders from various business units, legal and finance departments, and the corporate communications team, to help manage and maintain business operations throughout the incident and any recovery period. The IRT is responsible for reporting details of the incident and its impact on the business to the Executive Leadership Team (ELT) and making key recommendations for managing operations.  The ELT is responsible for advising the Board of any material cybersecurity incidents. Both the ELT and the IRT have participated in formal cybersecurity response training.\n\n\n \n\n\n\n\n13"
  }
}