{
  "ticker": "JBL",
  "cik": "0000898293",
  "company_name": "JABIL INC",
  "filing_date": "2025-10-17",
  "accession": "0001628280-25-045293",
  "primary_doc": "jbl-20250831.htm",
  "item_sections": {
    "item1": "Item 1. Business\nThe Company\nJabil is one of the leading providers of engineering, manufacturing, and supply chain solutions. We deliver comprehensive design, production, and product management services to companies across a diverse range of industries and end markets. Our capabilities span the entire product lifecycle—from innovation, design, and planning to fabrication, assembly, and delivery—enabling seamless management of resources and materials across global supply chains. Through these integrated services, we help our customers reduce manufacturing costs, enhance supply chain efficiency, minimize inventory risk, lower transportation expenses, and accelerate product fulfillment.\nWe serve our customers primarily through dedicated business units that combine highly automated, continuous flow manufacturing with advanced electronic design and design for manufacturability. Each business unit team serves as a single point of contact between a customer and Jabil. Business unit teams are supported by cross-functional teams, which leverage the power of our global expertise and capabilities to carry out work at the site level.\nWe conduct our operations in facilities that are located worldwide, including but not limited to China, Malaysia, Mexico, and the United States. Our global manufacturing production sites allow customers to manufacture products simultaneously in the optimal locations for their products. Our global presence is key to assessing and executing on our business opportunities. For the fiscal year ended August 31, 2025, we had net revenues of $29.8 billion and net income attributable to Jabil Inc. of $657 million.\nAs of September 1, 2024, we are reporting our business in the following three segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce, which are also the Company’s reportable segments. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewables and energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nAdditional financial information regarding our reportable operating segments is included in Item 7 of this report and Note 14 – “Concentration of Risk and Segment Data” to the Consolidated Financial Statements.\nIndustry Background\nOur industry was historically composed of companies that provide a range of design and manufacturing services to companies that utilize electronics components in their products. The industry subsequently expanded to include customers that require products and services beyond electronic components, including plastics and metal components, packaging, and injection molding.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets; we closely manage our costs and capital resources so that we can respond appropriately as circumstances change. Over the long term we believe the factors driving our customers and potential customers to use our industry’s services include:\n•\nEfficient Manufacturing.\n Manufacturing solutions providers are often able to manufacture products at a reduced total cost to companies. These cost advantages result from higher utilization of capacity and efficiencies of scale because of diversified product demand and, generally, a greater focus on the components of manufacturing cost. Companies are increasingly seeking to reduce their investment in inventory, facilities, and equipment used in manufacturing and prioritizing capital investments in other activities, such as sales and marketing and research and development (“R&D”). This strategic shift in capital deployment has contributed to increased demand for and interest in outsourcing to external manufacturing service providers.\n2\nTable of Contents\n•\nAccelerated Product Time-to-Market and Time-to-Volume.\n Manufacturing solutions providers are often able to deliver accelerated production start-ups and achieve high efficiencies in bringing new products to production. Providers are also able to more rapidly scale production for changing markets and to position themselves in global locations that serve the leading world markets. With increasingly shorter product life cycles, these key services allow new products to be sold in the marketplace in an accelerated time frame.\n•\nAccess to Advanced Design and Manufacturing Technologies.\n By utilizing manufacturing solutions providers, customers gain access to additional advanced technologies in manufacturing processes, as well as to product and production design, which can offer customers significant improvements in the performance, quality, cost, time-to-market and manufacturability of their products.\n•\nImproved Inventory Management and Purchasing Power.\n Manufacturing solutions providers are often able to more efficiently manage both procurement and inventory. Providers have demonstrated proficiency in purchasing components at improved pricing due to the scale of their operations and continuous interaction with the materials marketplace.\n•\nGlobal Reach and Regional Manufacturing.\n Manufacturing solutions providers operate globally and are often able to more efficiently transition the location of manufacturing processes for products in response to changing macroeconomic and geopolitical environments relying on installed footprints, local teams, and consistent processes.\nOur Strategy\nOur vision is to be the world’s most technologically advanced and trusted manufacturing solutions provider. As we work to achieve our vision, we pursue the following strategies:\n•\nEstablish and Maintain Long-Term Customer Relationships. \nAn important element of our strategy is to develop and expand long-term relationships with leading companies in expanding industries that benefit from global, highly automated, continuous-flow manufacturing. We grow these partnerships across product lines and services to create deeper, more integrated value. In addition, we pursue relationships with new customers that meet our targeted profile: financially stable, technology-driven, growth-oriented, and committed to long-term collaboration.\n•\nProduct Diversification. \nWe focus on balancing our portfolio of products and product families toward higher-return and strategically important segments. This includes manufacturing, supply chain management services, comprehensive electronics design, production, and product management services for markets such as cloud and data infrastructure, healthcare, packaging, automotive and transportation, warehouse automation, networking and communications, and semi-capital equipment. We have made concentrated efforts to diversify our industry sectors and customer base. Because of these efforts, we have experienced business growth from both existing and new customers as well as from acquisitions. In addition, we continue to evaluate emerging end-markets and technologies to help ensure our portfolio remains balanced, resilient, and aligned with long-term customer demand.\n•\nUtilize Customer-Centric Business Units. \nMost of our business units serve a single customer, using dedicated production equipment, workers, supervisors, buyers, planners, and engineers to provide comprehensive, customized manufacturing solutions. We believe our customer-centric business units promote increased responsiveness, particularly for relationships that extend across multiple production locations.\n•\nLeverage Global Production. \nWe believe that global production reduces obsolescence risk, lowers landed costs, and promotes consistent quality worldwide. Consistent with this strategy, we have established or acquired operations in the Americas, Europe and Asia. Our extensive global footprint allows us to select production locations that best serve customer needs. We believe that our global footprint is strengthened by our centralized procurement process, which, when coupled with our single Enterprise Resource Planning system, provides our customers end-to-end supply chain visibility. Increasingly, our customers also prefer manufacturing to be located closer to their end markets. To meet this need, we invest in local-for-local and local-for-regional capabilities that improve resilience, reduce lead times, enhance sustainability, and enable us to support customers directly where they operate.\n•\nExpand Value-Added Services. \nOur systems assembly, direct-order fulfillment, and configure-to-order services allow customers to reduce product cost and obsolescence risk by lowering total work-in-process and finished goods inventory. These services are available at all of our manufacturing locations.\n•\nDeliver Design Expertise. \nWe offer a wide spectrum of value-add design services focused on improving performance, reducing costs, accelerating time-to-market, and enhancing manufacturability. Our design expertise also helps customers navigate technology transitions and regulatory requirements, creating end-to-end solutions that integrate seamlessly from concept through production.\n3\nTable of Contents\n•\nPursue Strategic Acquisitions. \nOur acquisition strategy complements current capabilities, diversifies us into new industry sectors and customers, and expands the scope of services we offer.\nOur Approach to Manufacturing\nTo achieve high levels of manufacturing performance, we have adopted the following approaches:\n•\nDecentralized Business Unit Model.\n Most of our business units serve a single customer and are empowered to tailor strategies to that customer’s needs. Our business units generally have dedicated production lines consisting of equipment, production workers, supervisors, buyers, planners, and engineers. Under certain circumstances, a production line may serve more than one business unit to maximize resource utilization. Business units have direct responsibility for manufacturing results and time-to-volume production, thereby promoting accountability and ownership. The business unit approach is modular and enables us to grow incrementally without disrupting the operations of other business units. Business unit management reviews customer-specific financial performance to assess whether the business units are meeting their designated responsibilities and to ensure that the daily execution of manufacturing activities remains on track. The business units aggregate into operating segments based on the end markets they serve.\n•\nAutomated Continuous Flow. \nWe use a highly automated, continuous flow approach to manufacturing, whereby different pieces of equipment are joined directly or by conveyor to create an in-line assembly process. This process contrasts with a batch approach, in which equipment operates as standalone work-centers. The elimination of waiting time prior to sequential operations results in faster manufacturing, improved efficiency, tighter quality control, and reduced work-in-process inventory. We believe continuous flow manufacturing provides cost reductions and quality improvement when applied to high volumes of product.\n•\nComputerized Control and Monitoring.\n We support all aspects of our manufacturing activities with advanced computerized control and monitoring systems. Component inspection and vendor quality are monitored electronically in real-time. Materials planning, purchasing, stockroom, and shop floor control systems run on a computerized manufacturing resource planning system.\n•\nElectronic Supply Chain Management. \nWe make available to our customers and suppliers an electronic commerce system/electronic data interchange and cloud-based tools to implement a variety of supply chain management programs. Our customers use these tools to share demand and product forecasts and deliver purchase orders, and we use these tools with our suppliers for just-in-time delivery, supplier-managed inventory, and consigned supplier-managed inventory. These capabilities include procurement intelligence platforms and AI-driven orchestration systems that deliver real-time data insights to support cost management, inventory optimization, and risk mitigation across global supply networks. These digital tools improve visibility, responsiveness, and collaboration across the supply chain.\nOur Design Services\nWe offer a wide spectrum of value-add design services to enhance our relationships with current customers and to build new customer relationships. Our teams are strategically staffed to support development projects of all sizes, from turnkey system design and joint development to industrialization and product optimization activities. Our design services support products across all markets we serve and include applications such as cloud data center server platforms; medical and consumer health devices; automotive assemblies for advanced architectures and enhanced functions; vision and safety systems; connected consumer products and appliances; digital commerce ecosystem products for retail environments; power and storage products supporting the energy infrastructure; and smart controls and security for digital building and utilities. These design services include:\n•\nElectronic Design.\n Our Electronic Design team provides electronic hardware and embedded software design services for analog, digital, radio frequency, power, sensor, and optical component applications. This ranges from initial concept and system architecture through design implementation and new product introduction to mass production.\n•\nExperience Design. \nOur Experience Design team works with product design teams to create product experiences that resonate with consumers through user research, industrial design, user interface design, and human factors. These capabilities help create, develop, and connect concepts and specifications that optimize the function, value, and appearance of products for both consumers and manufacturing partners.\n4\nTable of Contents\n•\nMechanical Design. \nOur Mechanical Design team specializes in the design of plastic and metal components, enclosures, sub-assemblies, and systems, with advanced modeling and analysis of electronic, electro-mechanical, and optical assemblies. This includes all aspects of product concept, detail design, wide-ranging environmental applications, thermal management, and tooling management.\n•\nOptical Design. \nOur Optical Design team applies advanced optics expertise to develop solutions for virtual and/or augmented reality, Light Detection and Ranging (“LiDAR”), 3D sensing, projection, and imaging. Throughout the design process, we develop the required processes, equipment, and testing specific to optics to help ensure seamless transition from design to precision mass production.\n•\nIndustrialization Engineering Services.\n Our engineering services combine multiple functions to work with design teams to optimize products for maximum performance, highest quality, and time to market while balancing cost and manufacturability. These functions include our computer-assisted design (“CAD”) team, delivering PCBA design with advanced CAD tools; our Value Analysis and Value Engineering team, improving value and reducing cost of both electrical and mechanical assemblies; and our Engineering Prototyping teams for all development stages. Efforts focus on optimizing designs, reducing material and component complexity, and identifying cost-effective sourcing options.\n•\nProduct Verification. \nOur Product Verification team provides complete product verification throughout the full design cycle and executes specific test services. This includes product verification to assess performance, reliability, and durability under simulated real-world conditions, failure analysis, regulatory compliance and safety, packaging, simulation, data analysis, and component analysis to identify and mitigate potential risks early in the development process.\n•\nManufacturing Test Solution Development.\n Our Manufacturing Test Solution Development team provides integral support to the design teams to embed testability in designs and enable efficient investment in manufacturing resources. The use of software-driven instrumentation and test process design and management reduces human-dependent test processes and promotes traceability and visibility throughout the manufacturing test process. Capabilities include development of test specifications, tester design, and execution of structural, functional, and environmental tests. Early integration of test planning supports defect reduction and consistent product quality. \nFabrication and Assembly\nWe offer systems assembly, test, direct-order fulfillment, and configure-to-order services to our customers. Our systems assembly services extend our range of assembly activities to include assembly of higher-level sub-systems and systems incorporating multiple PCBAs. In addition, based on quality assurance programs developed with our customers, we provide testing services for our PCBAs, sub-systems, and systems products. Our quality assurance programs include product testing under various environmental conditions to help ensure that our products meet or exceed required customer specifications. \nTechnology and Research and Development\nWe believe that our manufacturing and testing technologies are among the most advanced in our industry. To meet our customers’ increasingly sophisticated needs, we continuously engage in R&D activities designed to create new and improved products and manufacturing solutions for our customers. Through our R&D efforts, we intend to continue offering our customers efficient manufacturing processes with high quality and differentiating product solutions using the latest technologies. These technologies and R&D activities include:\n•\nAutomation for tooling, manufacturing, and end customer solutions\n•\nNext generation electronic interconnections\n•\nAdvanced electrical assembly & test processes\n•\nAdvanced polymer and metal material science\n•\nCeramic, metal and plastic single/multi-shot injection molding\n•\nIn-mold mechanical & electrical assembly solutions\n•\nAdvanced coating solutions for plastics, metals & lenses\n•\nThermal-plastic composite formation\n•\nAdvanced thermal management solutions\n•\nAdvanced sensor integration \n•\nOptical sensors across wavelengths\n•\nCo-packaged optics\n•\nSilicon photonics\n•\nSterilization, device filling & fluid management\n5\nTable of Contents\n•\nOutsourced semiconductor assembly and test (“OSAT”) capabilities\n•\nSustainable materials and design\n•\nArtificial intelligence and machine learning\nOur R&D efforts span the markets we serve to provide our customers leading edge technologies and solutions.\nCustomers and Marketing\nA key tenet of our strategy is to develop and expand long-term relationships with leading companies in high-growth industries that benefit from global, highly automated, continuous-flow manufacturing. A small number of customers and significant industry sectors have historically comprised a major portion of our net revenue. While this concentration reflects the depth of our customer relationships, we continue to diversify our customer base across industries and geographies to strengthen resilience. We also market our services and solutions through our website and social media platforms, as well as through direct engagement with prospective customers, industry events, and targeted outreach initiatives.\nIn fiscal year 2025, our five largest customers accounted for approximately 36% of our net revenue and 87 customers accounted for approximately 90% of our net revenue. The table below sets forth the respective portion of net revenue attributable to customers that accounted for a significant concentration of our net revenue during the periods indicated:\n \nPercentage of Net Revenue\nFiscal Year Ended August 31,\n \n2025\n2024\n2023\nCustomer A \n(1)\n16 \n%\n*\n*\nCustomer B \n(2)\n*\n11 \n%\n17 \n%\n*    Amount was less than 10% of total.\n(1)\nSales to this customer were reported primarily in the Intelligent Infrastructure segment.\n(2)\nSales to this customer were reported in the Connected Living and Digital Commerce segment. \nCompetition\nOur business is highly competitive. We compete against numerous domestic and foreign electronic manufacturing solutions providers, diversified manufacturing service providers, and design providers. We also face competition from the manufacturing operations of our current and potential customers, who are continually evaluating the merits of manufacturing products internally against the advantages of outsourcing.\nWe compete with different companies depending on the type of service we are providing and/or the geographic area in which an activity takes place. We believe that the principal competitive factors in the manufacturing services market are: cost; accelerated production time-to-market; higher efficiencies; global locations; rapid scaling of production; advanced technologies; quality; and improved pricing of components. We believe we are extremely competitive with regard to all of these factors.\nComponents Procurement\nWe procure components from a broad group of suppliers, determined on an assembly-by-assembly basis. Our global sourcing and purchasing locations are strategically placed in various countries throughout the world along with our global commodity management and supplier relationship teams. These locations manage our end-to-end procurement lifecycle. This regionalized expertise along with our supplier relationships provide efficient procurement operations.\nSome of the products we manufacture contain one or more components that are only available from a single source. Some of these components are allocated from time to time in response to supply shortages. In some cases, supply shortages will substantially curtail production of all assemblies using a particular component.\n6\nTable of Contents\nProprietary Rights\nWe regard certain aspects of our technology, design, production and product management, supply chain, and other services as proprietary intellectual property. We rely largely upon a combination of intellectual property laws, non-disclosure agreements with our customers, employees, and suppliers and our internal security systems, policies, and procedures. We currently have a relatively modest number of patents for various innovations. We believe that our intellectual property portfolio will continue to evolve as we expand our business activities. Other factors significant to our proprietary rights include the knowledge and experience of our management and workforce and our ability to develop, enhance, and market our technology and services.\nWe license some technology and intellectual property rights from third parties. Generally, the license agreements that govern such third-party technology and intellectual property rights grant us the right to use the subject technology anywhere in the world and terminate upon a material breach by us.\nHuman Capital Management\nAs of August 31, 2025, our workforce consists of talented and dedicated employees across approximately 100 locations in 30 countries. To maintain our competitiveness, we continually invest in our employees, so that they can take care of our customers and communities. Following is a summary of employees by region (in thousands):\nRegion\nNumber of Employees\nAsia\n71\nAmericas\n49\nEurope\n15\n   Total\n(1)\n135\n(1)\nTotal headcount includes permanent, temporary and contingent workers.\nNone of our U.S. employees are represented by a labor union. In certain international locations, our employees are represented by labor unions and by works councils. We promote positive employee relations globally and have not experienced a significant work stoppage or strike.\nSafety \n“Safety First. Always.” is a fundamental value that is ingrained in our culture. We are committed to safety standards in all of our facilities. We have implemented a continuous improvement-based Health and Safety Management System, including annual training assessments coupled with engaged leaders and employees who prioritize safety.\nHuman Rights\nWe believe that respect for fundamental human rights is an essential element of responsible corporate citizenship. We are a founding member of the Responsible Business Alliance (RBA), which is one of the world’s largest industry coalitions for corporate social responsibility in global supply chains. \nCulture & Belonging: Jabil’s Cultural Initiatives\nOur workforce provides us with the innovation and creativity that allows us to continue our success. Built on respect, our culture fosters an environment where employees feel welcomed, valued, and safe – both psychologically and physically. Welcoming a spectrum of backgrounds, experiences, viewpoints, and abilities, we collaborate to create an environment where employees can be their authentic self and contribute to Jabil’s success.\nIn alignment with our Code of Conduct, we are dedicated to establishing a discrimination-free and harassment-free workplace globally. This commitment is guided by our enterprise-wide priorities of mitigating biases, cultivating inclusive leadership, and developing diverse talent.\nOur global sites developed and implemented programs focused on supporting employment and retention of employees with disabilities, with physical and digital infrastructure and training programs to foster an inclusive environment for all. In collaboration with our operations team, we have also established a baseline for site accessibility.\n7\nTable of Contents\nOur culture empowers Jabil to make a positive impact on our people, customers, and communities. Our commitment to our employees’ safety and wellbeing goes beyond physical health to include mental health. At Jabil, we provide our full-time employees two days of paid time off for health and wellbeing and one day for community service in addition to standard paid time off and holidays.\nTo support our commitment to serve our communities where we live and operate, in 2024, Jabil employees completed over 580,000 volunteer hours. From January to August 2025, Jabil employees completed over 420,000 volunteer hours. This commitment remains for fiscal year 2026, with a continued focus in the areas of education, empowerment, and the environment. We believe that while our efforts are locally driven, the impact is global.\nJabil hosted its annual Deliver Best Practices Global Finals representing 20 locations from 13 countries. This continuous improvement program embodies the best of Jabil’s culture while focusing on our key business drivers (People, Process, Social & Environmental, and Technology & Innovation). \nRecognition plays an important role in appreciating others for going above and beyond their normal job duties and doing what’s right for our customers, people, and communities. Jabil acknowledges these well-deserved efforts through our Enterprise recognition program, Respect. Recognize. Reward., in addition to regional and site-based recognition efforts that celebrate our employees worldwide.\nCompensation and Benefits\nJabil’s compensation programs are designed to align the compensation of our employees with Jabil’s performance and to provide the proper incentives to attract, retain, and motivate employees to achieve superior results. Specifically:\n•\nWe seek to provide employee pay levels that are competitive and consistent with employee positions, skill levels, experience, knowledge, and geographic location.\n•\nSalary increases and incentive compensation are based on merit and performance.\n•\nAll full-time U.S. employees are eligible for health insurance, paid and unpaid leaves, a retirement plan, and life and disability/accident coverage. Benefits outside the U.S. are provided based upon country-specific practices and are intended to support the health and wellbeing of our employees and their families.\n•\nSupporting the mental health and emotional wellbeing of our employees and their families is a high priority at Jabil, and we have implemented several programs and benefits over the past several years to help de-stigmatize mental health issues and assist employees in finding and leveraging appropriate resources. These include a global employee assistance program (EAP), on-site behavioral health resources in some locations, and education for our leaders on ways to recognize and respond to signs of mental health and substance abuse issues. Additionally, our Health and Wellbeing programs help to strengthen mental health resilience.\n•\nThe majority of our employees around the world are eligible to participate in our Employee Stock Purchase Plan, allowing them to become owners of Jabil stock at a discount.\nCareer Growth and Development\nAt Jabil, we invest in the professional and personal growth and development of our employees at all levels of the organization. Our learning solutions are intended to empower employees to enhance their knowledge and skills, enabling them to work more effectively, develop stronger capabilities, and guide their teams to success and further reinforce the organization’s vision. Jabil offers learning programs and offerings for all level of employees (hourly, professional, management). \nAs part of our talent strategy, we continue to utilize the LinkedIn Learning platform to enhance employees' access to the tools, resources, and support needed to take charge of their career development. We provide free access to LinkedIn Learning to all professional, management, and executive leaders. Employees are encouraged to utilize LinkedIn Learning for both leadership and technical development, reinforcing our commitment to continuous learning and growth.  \nOur leaders are the cornerstone of Jabil’s success. They serve as a critical link between the strategic vision and the day-to-day execution of the work. One example of a program used to strengthen leadership skills is the Supervisory Basics Program – an internally developed program that seeks to equip supervisors with foundational knowledge that reinforces Jabil’s culture, establishes consistent standards for supervisor–employee interactions, and enhances understanding of key financial and legal principles.\n8\nTable of Contents\nEmployee Engagement\nIn May 2025, we conducted our global Your Voice Matters Survey, utilizing a third party to administer it. Action plans have been developed and are in the process of being executed at all sites to promote continued excellence in employee engagement at Jabil. This is a continuation of the Your Voice Matters Pulse Surveys conducted in 2024 to measure the impact of action plans developed from the 2023 global survey.\nEnvironmental Laws and Regulations\nWe are subject to a variety of federal, state, local, and foreign environmental, health and safety, product stewardship, and producer responsibility laws and regulations, including those relating to the use, storage, discharge, and disposal of hazardous chemicals used during our manufacturing process; those governing worker health and safety; those requiring design changes, supply chain investigation, or conformity assessments; or those relating to the recycling or reuse of products we manufacture.\nInformation about our Executive Officers\nExecutive officers are appointed by the Board of Directors and serve at the discretion of the Board. There are no family relationships among our executive officers and directors. There are no arrangements or understandings between any of our executive officers and any other persons pursuant to which any of such executive officers were selected. Below is a list of our executive officers:\nAdam E. Berry\n (age 48) was named Senior Vice President, Investor Relations & Corporate Affairs in June 2024.\n \nHe previously served as Vice President, Investor Relations from September 2018. Mr. Berry held other roles of increasing responsibility since joining Jabil in 2010 as Director of Investor Relations.\n \nMr. Berry holds a bachelor’s in Communications from Boston College and an MBA from Georgia Institute of Technology.\nSteven D. Borges\n (age 57) was named Executive Vice President, Global Business Units in May 2024. He previously served as Executive Vice President, Chief Executive Officer, Diversified Manufacturing Services from June 2022; Executive Vice President, Chief Executive Officer, Regulated Industries, from September 2020, with additional responsibility for additive Manufacturing; and as Executive Vice President, Chief Executive Officer, Healthcare from September 2016 through August 2020. Mr. Borges joined Jabil in 1993. He holds a bachelor’s in Business Administration and Management from Fitchburg State University. \nMatthew Crowley \n(age 50) was named Executive Vice President, Global Business Units in May 2024. He most recently served as Senior Vice President, Global Business Units from May 2022, and from March 2019 until April 2022, as Vice President, Global Business Units, and from February 2018 to February 2019 as Senior Director, Cloud. Before joining Jabil in 2018, Mr. Crowley held positions with Dell and Amazon Web Services.\nMichael Dastoor\n (age 59) was named Chief Executive Officer in May 2024. Over his 24-year tenure at Jabil, he has held multiple leadership roles across Jabil’s global markets, including serving as Executive Vice President, Chief Financial Officer from April 2018. Mr. Dastoor previously served as Senior Vice President, Controller from July 2010. Mr. Dastoor joined Jabil in 2000. He holds a degree in Finance and Accounting from the University of Bombay and is a Chartered Accountant from the Institute of Chartered Accountants in England and Wales.\nGregory B. Hebard\n (age 56) was named Chief Financial Officer in May 2024. He most recently served as Senior Vice President, Treasurer since 2021. Since joining Jabil in 2009, Mr. Hebard has held roles of increasing responsibility in finance, including Senior Vice President, CFO Green Point from 2017 to 2021 and Vice President, Financial Planning & Analysis from 2013 to 2017. He holds a master’s in Business from DePaul University and a bachelor’s in Finance from the University of Iowa.\nFrederic E. McCoy\n (age 56) was named Executive Vice President, Operations in May 2024. He most recently served as Executive Vice President, Global Business Units since August 2023; Executive Vice President & Chief Executive Officer, Electronics Manufacturing Services, from December 2021 and Senior Vice President, Global Business Units from October 2017. Mr. McCoy joined Jabil in 2001. He holds a master’s in International Affairs and Economics from the School of Advanced International Studies (SAIS) at Johns Hopkins University and a bachelor’s in Foreign Service from Georgetown University.\n9\nTable of Contents\nFrancis (“Frank”) G. McKay\n (age 55) was named Senior Vice President, Chief Supply Chain and Procurement Officer, in January 2019. Prior to his current role, he served as Vice President, Procurement & Purchasing Services from October 2014 and held a variety of management positions in Europe, Asia and the US since joining Jabil in 1997. Mr. McKay holds a bachelor’s from University of Strathclyde.\nKristine Melachrino\n (age 47) was named Executive Vice President, General Counsel, in March 2025. She most recently served as Senior Vice President, General Counsel since October 2022. She joined Jabil in 2007 holding various roles in the legal department supporting the functional and business teams globally. Prior to this role, Ms. Melachrino served as Vice President, Senior Deputy General Counsel for the global Commercial legal team, advising on complex legal and regulatory matters to facilitate business growth; and Assistant Corporate Secretary. She holds a Juris Doctor from Stetson University College of Law, and an MBA from Stetson University.\nMark T. Mondello\n (age 61) was named Chairman of Jabil’s Board of Directors effective November 2021 and has been a member of the Board since March 2013. Mr. Mondello served as our Chief Executive Officer until May 2023. Mr. Mondello has retained various executive responsibilities. Mr. Mondello joined Jabil in 1992. He holds a bachelor’s in Mechanical Engineering from the University of South Florida.\nAndrew D. Priestley\n (age 54) was named Executive Vice President, Global Business Units in May 2024. He most recently served as Senior Vice President, Global Business Units\n \nfrom April 2014. Since joining Jabil in 1996, he has held positions of increasing responsibility across the Company, including as Vice President, Global Business Units since 2012. Mr. Priestley holds an honors in Engineering with Management from the Edinburgh Napier University.\nGary K. Schick\n (age 55) was named Senior Vice President and Chief Human Resources Officer in October 2023.\n \nHe most recently served as Vice President, HR Operations from October 2022. Mr. Schick has held several other positions of increasing responsibility in human resources since joining Jabil in August 2018 as a Senior Director, Human Resources.\n \nMr. Schick holds a bachelor’s in Economics from Northwestern University and a Juris Doctor from the University of Pittsburgh School of Law.\nMay Y. Yap\n (age 55) was named Senior Vice President, Chief Information Officer in September 2020. She joined Jabil in 2014 as Vice President and CIO of Jabil Green Point. Ms. Yap holds an MBA and a master’s in Computer Science from University of Hull and a doctorate in business administration and management from New York University.\nAdditional Information\nOur principal executive offices are located at 10800 Roosevelt Boulevard North, St. Petersburg, Florida 33716, and our telephone number is (727) 577-9749. We were incorporated in Delaware in 1992. Our website is located at http://www.jabil.com. Through a link on the “Investors” section of our website, we make available our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K and any amendments to those reports, free of charge, as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC. The “Investors” section of our website contains a significant amount of information about our Company, including a Sustainability Report, financial and other information for investors. The information that we post on the “Investors” section of our website could be deemed to be material information. We encourage investors, the media and others interested in Jabil to visit our website. Information on our website, however, is not a part of this report.\n10\nTable of Contents",
    "item1a": "Item 1A. Risk Factors, which should be read in conjunction with the information above.\nGovernance\nThe Board oversees risk management directly and through its committees. Generally, the Board oversees risks that may affect the business of Jabil as a whole, including operational matters. \nThe Cybersecurity Committee (“the Committee”) assists the Board in fulfilling its oversight responsibilities with regard to the Company’s cybersecurity programs and risks, including the cybersecurity practices, procedures, and controls management uses to identify, assess, and manage the Company’s key cybersecurity programs and risks, to protect the confidential intellectual property information and data of the Company and its customers and to comply with applicable data protection laws and regulations.\n \nThe Committee of the Board meets quarterly. At each meeting, it receives reports from the Chief Information Security Officer (“CISO”).\nAs part of its role in overseeing risk management, the Committee periodically reports to the \nBoard\n regarding briefings provided by management and advisors as well as the Committees’ own analysis and conclusions regarding cybersecurity risks faced by the Company. The Committee will review with management and the Board, and advise them regarding the following matters, as necessary: \n•\nManagement’s implementation of cybersecurity programs, policies, and procedures and management’s actions to safeguard their effectiveness; \n•\nThe effectiveness of the Company’s cybersecurity programs and its practices for identifying, assessing, and mitigating cybersecurity risks across all business functions; \n•\nThe Company’s controls to prevent, detect and respond to cyber-attacks or information or data breaches involving the Company; \n•\nCyber crisis preparedness, incident response plans, and disaster recovery capabilities; \n•\nReports and presentations received from management and the Company’s advisors regarding the management of cybersecurity programs and risks, including protection of confidential intellectual property, information, and data.\nThe \nCISO\n leads the Corporate Information Security organization which oversees the security posture of Jabil’s data, networks, and resources. \nThe CISO is responsible for notifying and providing updates on cybersecurity incidents to the Chief Information Officer (“CIO”).\n The CIO is responsible for overseeing global IT operations and digital transformation across the Company and leads the strategic direction on IT polices to safeguard company and client assets against cybersecurity threats.\nThe CISO has over 39 years of experience working in cybersecurity, risk management, and infrastructure technology and network architecture. Our CISO holds industry-recognized cybersecurity certifications, including Certified Information Systems Security Professional (CISSP) certification. The CIO has over 33 years of experience focused on corporate strategy formulation and implementation, IT management including cybersecurity, and business and process transformation.\n26\nTable of Contents\nEffective September 1, 2025, the Company transitioned cybersecurity responsibilities to a new CISO. \nThe new CISO has over 20 years of experience leading large-scale security programs protecting critical infrastructure and sensitive data, modernizing digital identity systems, and driving cultural transformation within security teams in the federal, healthcare, and global manufacturing sectors.",
    "item1b": "Item 1B. Unresolved Staff Comments\nThere are no unresolved written comments from the SEC staff regarding our periodic or current reports.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nWe are committed to reducing the risk of cybersecurity compromise, either intentional or unintentional, to our customers, employees, and company proprietary information resources. \nOur cybersecurity risk management program is integrated into our global enterprise risk management framework, which is designed to help identify, monitor, and mitigate key strategic risks.\n Our enterprise risk assessment, which includes data protection and cybersecurity, is developed annually to provide insight into the risks with the greatest potential to impact Jabil’s strategy and our financial goals.\n Key components of our cybersecurity risk management program include the following:\n•\nCybersecurity policies\n. \nWe leverage cybersecurity industry-standard frameworks and insights from internal assessments to develop policies to guide the use of our information assets (for example, business information and information resources such as mobile phones, computers, and workstations), access to specific intellectual property or technologies, deployment of AI within the Company, and protection of personal information. The Company has also established written policies and procedures to help ensure that cybersecurity incidents are quickly assessed and addressed. \n•\nRisk assessment.\n \nThe Company uses risk assessment processes to identify and prioritize cybersecurity risks, employ operational controls to mitigate risks, report incidents, and analyze trends, and employ a corrective action process to address nonconformities. Key risk indicators are used across all business functions to monitor and measure our cybersecurity risk exposure. Through this cross-functional approach, management identifies potential operational and strategic risks which could impact our strategy and financial goals. \n•\nSystem safeguards.\n \nWe implement industry-standard technical safeguards that are designed to protect our information systems, operations, and sensitive information from cybersecurity threats. By collaborating with internal stakeholders across the company, we integrate foundational cybersecurity principles throughout our organization, including multiple layers of cybersecurity defenses and restricted access based on business need. We frequently conduct vulnerability assessments to identify new risks and periodically test the efficacy of our safeguards through both internal and external penetration tests.\n•\nSecurity Awareness and Training.\n Cybersecurity education contributes to the safety of the Company, customer data, and employee sensitive data and assets. Our employees undergo regular training on information security, cybersecurity awareness, and the protection of confidential information. This training is designed to promote an understanding of the behaviors and technical requirements needed to safeguard Company data. Additionally, we provide ongoing education to help employees recognize and report suspicious activity. In addition, higher risk employees undergo routine anti-phishing testing and training.\n•\nAssessments.\n \nWe periodically assess and test our cybersecurity policies, standards, processes, and practices that are designed to address threats. This includes monthly metrics review, threat modeling, vulnerability testing, and other exercises to evaluate our cybersecurity effectiveness. We regularly engage third parties to assist with our assessments and testing. Where appropriate, we adjust our cybersecurity policies, standards, processes, and practices accordingly based on internal and external assessment and testing results.\n•\nEngagement of third-party service providers\n. \nThe Company utilizes third-party cybersecurity experts to assess the Company’s cybersecurity risks and conduct penetration testing to measure our cybersecurity risk management program relative to industry-standard frameworks.\n \nThe Company has established a standardized process for assessing and managing potential risks associated with the engagement of third-party service providers that request access to the Company’s information systems\n.\n25\nTable of Contents\n•\nIncident response.\n The Cybersecurity Incident Response Team (“CIRT”), deploys, maintains, and monitors various tools and processes designed to safeguard against and detect cybersecurity incidents that may occur. As part of our incident response program, members of management are informed about and monitor the prevention, detection, mitigation, and remediation of cybersecurity incidents. In accordance with established written policies and procedures, escalation protocols are used to provide information to, and engage with, executive management, the Cybersecurity Committee and the Board, throughout the incident response process. The CIRT reviews these controls regularly, and makes enhancements as needed to incorporate lessons learned, updated industry standards, and any new or revised legal requirements. \nAs of the date of this report, we are not aware of any risks from cybersecurity threats, including as a result of any cybersecurity incidents, which have materially affected us during fiscal year 2025 or are reasonably likely to materially affect us in the near term, including our business strategy, results of operations, or financial condition.\n Additional information about our cybersecurity risks is discussed in “Disruptions to our information systems, including security breaches, losses of data or outages, and other security issues, have and could in the future adversely affect our operations” in"
  }
}