{
  "ticker": "JCI",
  "cik": "0000833444",
  "company_name": "Johnson Controls International plc",
  "filing_date": "2025-11-14",
  "accession": "0000833444-25-000097",
  "primary_doc": "jci-20250930.htm",
  "item_sections": {
    "item1": "ITEM 1\n    \nBUSINESS\nGeneral\nJohnson Controls International plc, headquartered in Cork, Ireland, is a global leader in smart, healthy and sustainable buildings, serving a wide range of customers around the globe. The Company’s products, services, systems and solutions advance the safety, comfort and intelligence of spaces to serve people, places and the planet. The Company is committed to helping its customers win and creating greater value for all of its stakeholders through its strategic focus on buildings.\nJohnson Controls was originally incorporated in the state of Wisconsin in 1885 as Johnson Electric Service Company to manufacture, install and service automatic temperature regulation systems for buildings and was renamed Johnson Controls, \n3\nInc. in 1974. In 2005, Johnson Controls acquired York International, a global supplier of heating, ventilating and air-conditioning (\"HVAC\") and refrigeration equipment and services. Following this acquisition, Johnson Controls continued to expand its portfolio of building-related product and service offerings. In 2016, Johnson Controls, Inc. and Tyco International plc (\"Tyco\") completed their combination (the \"Merger\"), combining Johnson Controls' portfolio of building efficiency solutions with Tyco’s portfolio of fire and security solutions. Following the Merger, Tyco changed its name to “Johnson Controls International plc.”\nOn July 31, 2025, the Company completed the divestiture of its Residential and Light Commercial (\"R&LC\") HVAC business to Robert Bosch GmbH (“Bosch”). The R&LC HVAC business included the Company's North America Ducted business and Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd., the Company’s global residential joint venture with Hitachi Global Life Solutions, Inc.\nThe Company is a global leader in engineering, manufacturing, commissioning and retrofitting building products and systems, including\n \ncommercial HVAC equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The Company further serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, security and fire-protection space), and energy-management consulting. The Company's OpenBlue digital software platform enables enterprises to better manage their physical spaces by combining the Company's building products and services with cutting-edge technology and digital capabilities to enable data-driven “smart building” services and solutions. The Company partners with customers by leveraging its broad product portfolio with digital capabilities, together with its direct channel service and solutions capabilities, to deliver solutions and services addressing distinct and diverse operating environments and regulatory requirements that address customers’ needs in their core missions.  \nBusiness Segments\nIn connection with the divestiture of the R&LC HVAC business, the Company realigned its organizational structure into three regional reporting segments (Americas, EMEA and APAC) from four reporting segments (Global Products, Building Solutions North America, Building Solutions EMEA/LA and Building Solutions APAC). The Company implemented this change effective April 1, 2025 as part of ongoing initiatives to drive simplification, accelerate growth, better reflect its organizational and operational structure and align with the manner in which the Company's chief operating decision maker assesses performance and makes decisions regarding the allocation of resources following portfolio simplification actions. As a result, the Company conducts its business through three operating segments, all of which are reportable segments: \n•\nAmericas,\n which designs, manufactures, sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional and governmental customers in the Americas (United States, Canada, and Latin America – Central and South America). Americas also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven \"smart building\" solutions, to the Americas marketplace.\n•\nEMEA,\n which designs, manufactures sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, residential security (Subscriber business), industrial, data center, institutional, governmental, and marine customers and provides technical services, including data-driven “smart building” solutions, to markets in Europe, the Middle East and Africa.\n•\nAPAC, \nwhich designs, manufactures, sells, installs, and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional, and governmental customers and provides technical services, including data-driven “smart building” solutions, to the Asian and Pacific marketplaces.\nFor more information on the Company’s segments, refer to Note 18, \"Segment Information,\" of the notes to consolidated financial statements.\nProducts, Systems, Services and Solutions\nThe Company sells and installs its commercial HVAC equipment and systems, control systems, security systems, fire-detection and fire suppression systems, equipment and services primarily through its extensive direct channel, consisting of a global \n4\nnetwork of sales and service offices. Significant sales are also generated through global third-party channels, such as distributors of air-conditioning, controls, security and fire-detection and suppression products. The Company’s large base of current customers leads to significant repeat business for the maintenance, retrofit and replacement markets. The Company is also able to leverage its installed base to generate sales for its service business. Trusted building brands, such as YORK®,  Metasys®, Ansul®, Frick®, FM:Systems®, PENN®, Sabroe®, Silent-Aire®, Simplex® and Grinnell®, together with the breadth and depth of the products, systems and solutions offered by the Company, give it what it believes to be the most diverse portfolio in the building technology industry.\nThe Company has developed software platforms, including on-premises platforms and cloud-based software services, and integrated its products and services with digital capabilities to provide data-driven solutions to create smarter, safer and more sustainable buildings. The Company's OpenBlue platform combines the Company’s building expertise with cutting-edge technology, including artificial intelligence and machine learning-powered service solutions such as remote diagnostics, predictive maintenance, workplace management, compliance monitoring and advanced risk assessments. The Company leverages its product portfolio and service network, together with digital and data-driven technologies to offer integrated and customizable solutions focused on delivering outcomes to customers. These services are generally designed to generate recurring revenue for the Company as it supports its customers in achieving their desired outcomes. \nIn fiscal 2025, products and systems accounted for approximately 68% of sales from continuing operations and services accounted for 32% of sales from continuing operations.\nCompetition\nThe Company conducts its operations through a significant number of individual contracts that are either negotiated or awarded on a competitive basis. Key factors in the award of contracts include system and service performance, quality, price, design, reputation, technology, application engineering capability, availability of financing and construction or project management expertise. Competitors for HVAC equipment, security, fire detection, fire suppression and controls in the residential and non-residential marketplace include many local, regional, national and international providers. Larger competitors include Honeywell International, Inc.; Siemens Smart Infrastructure, an operating group of Siemens AG; Schneider Electric SA; Carrier Global Corporation; Trane Technologies plc; Vertiv Holdings Co., API Group and Daikin Industries, Ltd. In addition, the Company competes in a highly fragmented building services market. The Company also faces competition from a diverse range of established companies, start-ups and other emerging entrants to the buildings industry in the areas of digital services, software as a service and the Internet of Things. The loss of any individual contract or customer would not have a material adverse effect on the Company.\nBusiness Strategy\nThe Company’s business strategy is to sustain and expand its position as a leader in commercial building technology and solutions by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions. In 2024 and 2025, the Company acted to optimize its core commercial buildings portfolio with the divestitures of its Air Distribution Technologies and R&LC HVAC businesses. Following these portfolio optimization actions, the Company’s core strategy remains advancing smart, healthy and sustainable buildings to power its customers’ missions, enabled by a simpler, more focused company focused on driving growth, profit, and cash flow.\nThe Company has leading positions in attractive and growing end-markets across HVAC, controls, fire, security and services, enhanced by its comprehensive product portfolio, significant installed base and substantial field position. The Company believes that it is well positioned to capitalize on the emerging and prevalent trends in the commercial buildings industry, including data centers, sustainable buildings, smart buildings and mission-critical environments. To capitalize on these trends, the Company is focused on offering differentiated services and solutions designed to address its customers’ vertical specific needs in their core missions. In furtherance of these goals, the Company has four strategic priorities:\nCapitalize on Key Growth Vectors: \nData centers, decarbonization, sustainable buildings, smart buildings, energy efficiency and mission-critical environments represent key growth opportunities for the Company. The Company seeks to leverage its existing portfolio breadth and investments in product development, combined with the expansion of its digital products and capabilities powered by OpenBlue, to offer differentiated solutions and innovative deal structures to help customers achieve their objectives. The Company intends to expand its capabilities by investing in products and technologies, as well as expanding its partnerships, to power innovation that will allow it to provide differentiated services that are tailored to its customers’ desired outcomes. \n5\nBringing Value Across the Building Lifecycle\n: The Company provides system and service solutions that maximize the opportunities around the lifecycle of the building, delivering outcomes to the customer that save energy, reduce emissions, maintain uptime, and optimize building lifecycle costs while delivering mission-critical environments and improving the overall occupant experience. The Company’s ability to drive direct, integrated solutions within multiple domains enables opportunities for attachment, cross-selling, recurring revenue, and developing long-term relationships with customers from installation to service, retrofit, and replacement.\nAccelerate in High Growth Verticals\n: The Company is focused on driving growth and profit by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions, enabled by the Company’s installed base, domain expertise and global coverage. The Company further intends to expand its presence in high growth verticals within the markets it serves, including data centers, hospitals, university campuses, advanced manufacturing, class A offices, and airports. \nSustain a High-Performance, Customer-Centric Culture\n: The Company recognizes that developing talent and creating positive customer experiences is central to accomplishing its business strategies. The Company is investing in its talent to build a workforce that is digitally capable, solutions oriented and focused on continuous learning and growth. The Company aims to leverage its talent capabilities and training to create a customer-focused culture to drive customer loyalty and decisions.\nTo realize these priorities, the Company is leveraging its technology leadership, product portfolio, global presence, substantial installed base, sizable field position and strong channels to monetize the lifecycle opportunities of systems, service, retrofit and replacement. The Company is augmenting its strategic priorities with disciplined execution, productivity enhancements and sustainable cost management to create a path to realize expanded margins and enhanced profitability. \nBacklog and Orders\nBacklog and orders are additional metrics that are meant to provide management with a deeper level of insight into the progress of specific strategic and growth initiatives. Backlog is applicable to sales of both products and systems and services and totaled $16.6 billion at September 30, 2025. Orders provide management with a signal of customer demand for the Company's products and services, as well as an indication of future revenues and performance. However, the timing and conversion of backlog and orders are subject to numerous uncertainties and risks and are not necessarily indicative of the amount of revenue to be earned in the upcoming fiscal year. \nThe following table summarizes backlog and orders by segment for the Systems and Services based businesses: \n \nBacklog\nOrders\n(in billions)\nSeptember 30, 2025\nYear-over-Year Change \n(1)\nYear Ended September 30, 2025\nYear-over-Year Change \n(1)\nAmericas\n$\n10.6 \n13 \n%\n$\n13.7 \n8 \n%\nEMEA\n2.5 \n12 \n%\n4.4 \n6 \n%\nAPAC\n1.8 \n17 \n%\n2.6 \n3 \n%\n Total Building Solutions\n$\n14.9 \n13 \n%\n$\n20.7 \n7 \n%\n(1)\n Change is compared to September 30, 2024 (backlog) and the year ended September 30, 2024 (orders) and excludes the impact of acquisitions, dispositions and foreign currency.\nRemaining performance obligations were $22.7 billion at September 30, 2025. Differences between the Company’s remaining performance obligations and backlog are primarily due to:\n•\nRemaining performance obligations include large, multi-purpose contracts to construct hospitals, schools and other governmental buildings, which are services to be performed over the building's lifetime with average initial contract terms of 25 to 35 years for the entire term of the contract versus backlog which includes only the lifecycle period of these contracts which approximates five years;\n•\nRemaining performance obligations exclude service contracts with an original expected duration of one year or less and contracts that are cancellable without substantial penalty versus backlog which includes short-term and cancellable contracts; and\n•\nRemaining performance obligations include the full remaining term of service contracts with substantial termination penalties versus backlog which includes only one year for all outstanding service contracts. \n6\nThe Company reports backlog, which it believes is a useful measure of evaluating the Company's operational performance and relationship to total orders. \nRaw Materials\nRaw materials used by the Company’s businesses in connection with their operations include steel, aluminum, brass, copper, polypropylene and certain fluorochemicals used in fire suppression agents. The Company also uses semiconductors and other electronic components in the manufacture of its products. At times, the Company has experienced material cost increases due to global inflation, supply chain disruptions, labor shortages, increased demand and other regulatory and macroeconomic factors. Recently, the Company has experienced increased raw material costs due to tariffs and reciprocal tariffs imposed by the United States and other nations. Although the Company has been largely able to mitigate the impact of tariffs that have been enacted to date, if additional tariffs and reciprocal tariffs are implemented (whether as currently proposed or otherwise), such actions could negatively impact the Company's revenue growth and margins in future periods through decreased sales and increased cost of goods sold, as discussed in Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations. The Company could experience further disruptions, shortages, tariffs and price inflation in the future, the effect of which will depend on the Company’s ability to successfully mitigate and offset the impact of these events. In fiscal 2026, commodity prices and availability could fluctuate throughout the year and could significantly affect the Company’s results of operations. For a more detailed description of the risks related to the availability of raw materials, components and commodities, see",
    "item1a": "Item 1A of this Annual Report on Form 10-K for more information on risks from cybersecurity threats.\nCybersecurity Governance\nThe Company’s Board of Directors (the \"Board”) has oversight of the management of the most significant risks facing the Company, including cybersecurity. The \nBoard\n receives information technology and cybersecurity updates from senior management, including the Chief Digital and Information Officer (\"CDIO\") and \nChief Information Security Officer\n (“CISO”) several times per year. These updates cover the cybersecurity risks facing the Company’s enterprise information technology environment, as well as the Company’s digital products and services. Regular oversight of cybersecurity matters is further delegated by the Board to the Governance and Sustainability Committee.\n \nThe Governance and Sustainability Committee provides a deeper level of oversight through quarterly engagements with senior management, including the Chief Digital and Information Officer and CISO, to review the Company’s cybersecurity program, including the highest risk areas and key mitigation strategies.\nThe Company maintains a Cybersecurity Steering Committee (\"CSC\") designed to ensure effective governance of risks associated with the Company’s use of information and technology assets and demonstrate effective governance of cybersecurity risk. The CSC is chaired by the CISO, and includes the Company’s Chief Financial Officer, General Counsel, CDIO, and other senior representatives from the Company’s business segments and functions. \nThe CSC meets quarterly to monitor the current risk landscape and active risk reduction efforts. Through this review and monitoring activity, the CSC oversees effective governance of IT Risk Management in the Enterprise IT Portfolio, drives accountability and transparency of control effectiveness, and facilitates risk remediation and mitigation in a coordinated and comprehensive manner.\nThe CISO has been appointed by the Chief Digital and Information Officer and is responsible for cybersecurity risk management across the Company. The CISO leads a global enterprise security team responsible for enterprise-wide security strategy, architecture, engineering, and operations. The CSC has granted authority to the CISO to pause or stop business processes during the execution of cybersecurity incident response duties if they deem it necessary. The CSC maintains approval authority for the Company’s Enterprise Information Security Policy.\n \nThe CISO has over 20 years of technology experience including cybersecurity, infrastructure, architecture, and data and analytics in highly regulated industries including healthcare and aviation\n and defense. The CISO has an undergraduate degree in \nComputer Information Systems\n.",
    "item1b": "ITEM 1B\n    \nUNRESOLVED STAFF COMMENTS\nThe Company has no unresolved written comments regarding its periodic or current reports from the staff of the SEC.",
    "item1c": "ITEM 1C\n    \nCYBERSECURITY\nCybersecurity Strategy and Risk Management\nThe Company faces a wide variety of cybersecurity threats ranging from uncoordinated individual attempts to gain unauthorized access to information technology (\"IT\") systems to sophisticated and targeted measures known as advanced persistent threats directed at the Company, its products, its customers, supply chain and/or its third-party service providers, including cloud providers. These threats and incidents originate from many sources globally. \nThe Company’s cybersecurity policies, standards, and procedures apply to all users, creating awareness of threats and the importance of information security and cybersecurity across the Company’s workforce. These policies and standards are reviewed annually to reflect emerging threats and evolving industry practices, including elements of recognized standards such as ISO 27001 and the NIST Cybersecurity Framework for the overall enterprise and ISA/IEC 62443 for automation and control system products. The Company has implemented cybersecurity policies throughout its operations, including designing and incorporating cybersecurity into the development process for its products and services. \nThe Company’s enterprise risk management (“ERM”) process considers cybersecurity threat risks alongside other significant risks as part of the Company’s overall risk assessment process.\n \nThe Company\n \nleverages\n multiple channels to promote cybersecurity topics, deliver targeted initial\n and refresher training for all users, and conduct an annual mandatory global information security training campaign with certification, which is translated into 20 languages, and ongoing awareness campaigns.\n These elements are designed to maintain\n a risk aware culture.\nThe Company \nmaintains a 24 x 7 operations center that monitors the Company’s IT environment and coordinates the investigation and remediation of alerts. As cybersecurity events occur, the cybersecurity team focuses on responding to and containing the threat and minimizing impact. In the event of an incident, the cybersecurity team assesses, among other factors, supply chain and manufacturing disruption, data and personal information loss, business operations disruption, projected cost and potential for reputational harm, with participation from technical, legal and law enforcement support, as appropriate.\nThe Company’s\n vulnerability management program conducts assessments with specified frequencies for specific asset types to validate\n system health against known threats. The Company\n \nleverages multiple tools, which are routinely updated with new \nthreat \nsignatures, to continually respond to evolving threats identified as part of its threat detection capability. The Company\n also \nmaintains a cybersecurity insurance policy.\nThe Company \nengages with third parties\n to perform security assessments of its technology environment, including penetration testing and maturity assessments, in addition to providing services to support threat analysis and incident detection and response. \nCybersecurity considerations affect the selection and \noversight of the Company’s third-party product and service providers\n. The Company performs due diligence on third parties that have access to its critical systems and data and whose products and services are integrated into the Company’s products. Contractual undertakings and oversight are put in place,\n based on the results of the risk \nassessment\n to manage\n and reduce the cybersecurity risk associated with such third-party providers. Such undertakings may \ninclude requirements to comply with administrative, technical\n and physical safeguards to provide notification of cyber incidents involving the Company’s systems or data and agreements to be subject to cybersecurity audits, which the Company conducts\n as appropriate\n.\n  The Company requires compliance with appropriate certifications (e.g., SOC 2, ISO 27001, etc.) or appropriate alternative requirements, depending on the offering, region of use, and other factors.\n \nThe Company's results of operations, and financial condition were adversely affected by its previously disclosed September 2023 cybersecurity incident due to lost and deferred revenues, remediation expenses and billing and cash collection. However, the overall impact of the cybersecurity incident did not have a material impact on net income, net of insurance recoveries, or \n26\ncash flows from operations for fiscal year 2024. The Company is regularly subject to cybersecurity threats. See “Risk Factors” in"
  }
}