{
  "ticker": "JKHY",
  "cik": "0000779152",
  "company_name": "JACK HENRY & ASSOCIATES INC",
  "filing_date": "2025-08-25",
  "accession": "0000779152-25-000055",
  "primary_doc": "jkhy-20250630.htm",
  "item_sections": {
    "item1": "ITEM 1.  BUSINESS \nJack Henry & Associates, Inc.\n®\n is a well-rounded financial technology company that strengthens connections between financial institutions and the people and businesses they serve. For nearly 50 years, we have provided technology solutions to help banks and credit unions innovate faster, strategically differentiate, and successfully compete while serving the evolving needs of their accountholders. We empower approximately 7,400 financial institutions and diverse corporate entities with people-inspired innovation, personal service, and insight-driven solutions. \nMission Statement\nWe strengthen the connections between people and their financial institutions through technology and services that reduce the barriers to financial health.\nThis mission has always been part of the foundation on which Jack Henry was built. Our founders, Jack Henry and Jerry Hall, were committed to their community and believed they could help financial institutions better serve the needs of their accountholders by using more innovative technology and services. \nSince our founding in 1976, much has changed, but our commitment to supporting community and regional banks and credit unions remains unwavering. We continue to be guided by our founding philosophy: do the right thing, do whatever it takes, and have fun.\nWho We Serve\nWe provide products and services primarily to community and regional banks and credit unions (see \"Our Industry\" below):\n•\nCore bank integrated data processing systems are provided to over 950 banks. Our banking solutions support both on-premise and private cloud operating environments with functionality for core processing platforms and integrated complementary solutions.\n•\nCore credit union data processing solutions are provided to credit unions of all sizes, with a client base of approximately 715 credit unions. We offer a flagship core processing platform and integrated complementary solutions that support both on-premise and private cloud operating environments.\n•\nNon-core highly specialized core-agnostic products and services are also provided to banks and credit unions. We offer complementary solutions that include highly specialized financial performance, imaging and payment solutions, information security and risk management, retail delivery, and online and mobile functionality. These products and services enhance the performance of traditional banks and credit unions of all asset sizes and charters, and non-traditional diverse corporate entities. In total, we serve approximately 1,670 bank and credit union core clients and over 5,710 non-core clients.\nOur products and services provide our clients with solutions that can be tailored to support their unique growth, service, operational, and performance goals. Our well-rounded solutions also enable banks and credit unions to offer the high-demand products and services required by their accountholders to compete more successfully and to capitalize on evolving trends shaping the financial services industry.\nWe are committed to exceeding our clients’ expectations. We measure and monitor their satisfaction using a variety of surveys, such as an annual survey on the client's anniversary date and randomly-generated online surveys initiated each day by routine support requests to ensure feedback is received throughout the year. The survey results are analyzed and provided to operational areas to ensure our service consistently exceeds our clients’ expectations. We believe this process ensures we understand the Voice of the Customer which contributes to our excellent retention rates.\nWe are focused on establishing long-term client relationships, continually expanding and strengthening those relationships. We do so with cross sales of additional products and services that support our clients' strategy, earning new financial and non-financial clients, and ensuring our product offerings are highly competitive.\nThe majority of our support and services revenue is derived from our private and public cloud services for our hosted clients that are typically on a six-year contract, recurring electronic payment solutions that are generally on a contract term of six years, and our on-premise clients that are typically on a one-year contract. Less predictable software license fees, paid by clients implementing our software solutions on-premise, and hardware sales, including all non-software products that we re-market in order to support our software systems, complement our primary revenue sources. Information regarding the classification of our business into four separate segments is set forth in Note 14 to the consolidated financial statements (see Item 8).\n5\nWe recognize that our associates and their collective contributions are ultimately responsible for Jack Henry's past, present, and future success. Recruiting and retaining high-quality associates is essential to our ongoing growth and financial performance, and we believe we have established an organizational culture that sustains high levels of associate engagement. For further discussion of our human capital considerations, see \"Human Capital\" below.\nOur Industry \nOur core banking solutions generally serve commercial banks and savings institutions with up to $55 billion and above\n \nin assets and are designed to be capable of serving institutions with up to $150 billion in assets. We complete annual, third-party testing to validate this capability each August. According to the Federal Deposit Insurance Corporation (“FDIC”), there were approximately 4,440 commercial banks and savings institutions in the $55 billion and under asset range as of December 31, 2024, and we currently support over 950 of these banks with one of our three core information processing platforms and a significant number of complementary/payment products and services.  \nOur core credit union solutions serve credit unions of all asset sizes. According to America's Credit Unions (\"ACU\") (formerly Credit Union National Association), there were 4,550 domestic credit unions as of December 31, 2024, and we currently support approximately 715 of these credit unions with one flagship core information processing platform and a significant number of complementary/payment products and services.\nOur non-core solutions serve banks and credit unions of all asset sizes and charters and other diverse corporate entities. We support these organizations with specialized solutions for generating additional revenue and growth, increasing security, mitigating operational risks, and controlling operating costs.\nThe FDIC reports the number of commercial banks and savings institutions declined 13% from the end of calendar year 2019 to the end of calendar year 2024, due mainly to mergers and acquisitions. Although the number of banks continued to decline at a 3% compound annual rate during this period, aggregate assets increased at a compound annual rate of 5% and totaled $24.1 trillion as of December 31, 2024. There were six new bank charters issued in calendar year 2024 and six\n \nissued in the 2023 calendar year. Comparing calendar years 2024 to 2023, the number of transactions of FDIC-insured banks acquiring or merging with other banks or credit unions decreased 18%.\nACU reports the number of credit unions declined 15% from the end of calendar year 2019 to the end of calendar year 2024. Although the number of credit unions declined at a 3% compound annual rate during this period, aggregate assets increased at a compound annual rate of 8% and totaled $2.3 trillion as of December 31, 2024.\nDespite continued industry consolidation, Jack Henry net core footprints increased year-over-year from calendar year 2023 to calendar year 2024 in both bank and credit union client bases. Furthermore, the average assets under management for our banking core clients grew from $1.26 billion to $1.29 billion, and the average assets under management for our credit union core clients grew from $1.17 billion to $1.20 billion.\nCommunity and regional banks and credit unions are vitally important to the communities, consumers, and businesses they serve as well as to the local economies where they operate. Bank and credit union accountholders rely on these institutions to provide personalized, relationship-based service and competitive financial products and services available through the accountholders' delivery channel of choice. Institutions are recognizing that attracting and retaining accountholders in today’s highly competitive financial industry and realizing near-term and long-term performance goals are often technology dependent. Banks and credit unions must implement technological solutions that enable them to:\n•\nOffer digital strategies that provide the convenience-driven services required in today’s financial services industry.\n•\nMaximize performance with accessible, accurate, and timely business intelligence information.\n•\nProvide the high-demand products and services needed to successfully compete with traditional and non-traditional competitors created by convergence within the financial services industry.\n•\nFoster growth and efficiency through delivering accountholders exceptional user experiences.\n•\nExpand existing accountholder relationships and strengthen exit barriers by cross selling additional products and services.\n•\nCapitalize on new revenue, and deposit and loan portfolio growth opportunities.\n•\nIncrease operating efficiencies and reduce operating costs. \n•\nProtect mission-critical information assets and operational infrastructure.\n•\nProtect accountholders with various security tools from fraud and related financial losses.\n•\nMaximize the day-to-day use of technology and return on technology investments.\n•\nEnsure full regulatory compliance.\n6\nJack Henry’s extensive product and service offerings help diverse banks and credit unions meet business challenges and capitalize on opportunities. We strive to get to know our clients, understand their strategies and challenges, and provide innovative solutions that help them achieve short- and long-term success. \nBusiness Strategy \nOur fundamental business strategy is to generate organic revenue and earnings growth augmented by strategic acquisitions. Our strategy for the next three to five years is to enable banks and credit unions to win on exceptional user experience and trust through open, innovative technology, data-driven insights, and service, resulting in greater growth and efficiency. We intend to execute this strategy by:\n•\nProviding community and regional banks and credit unions with core processing systems that provide excellent functionality and support on-premise and private cloud delivery environments with identical functionality.\n•\nExpanding each core client relationship by cross-selling complementary/payment products and services that enhance the functionality provided by our core processing systems.\n•\nDelivering non-core highly specialized core-agnostic complementary/payment products and services to banks and credit unions, including institutions not utilizing one of our core processing systems, and diverse corporate entities.\n•\nDeveloping and deploying a long-term technology modernization strategy to provide public cloud-native solutions that provide clients with greater flexibility, optionality, open integration, speed to market, and other benefits.\n•\nUpholding a company-wide commitment to service that consistently exceeds our clients’ expectations and generates high levels of retention.\n•\nCarrying out a large client strategy that focuses on deep engagement with banks and credit unions to align objectives, optimize revenue streams, and foster collaborative growth and innovation through continuous engagement and commitment to excellence.\n•\nGrowing our market share of services to small and medium-sized businesses offering features through banks and credit unions.\n•\nBuilding, maintaining, and enhancing a protected environment and tools that help our clients and Jack Henry protect accountholder data, assets, and comply with regulations.\n•\nMaintaining a disciplined acquisition strategy.\nTechnology Modernization Strategy\nOur public cloud-native technology modernization strategy seeks to enable our bank and credit union clients to innovate faster, differentiate themselves in the markets they serve, and meet the evolving needs of their accountholders.\nThe Jack Henry Platform\nTM \nis the centerpiece of this strategy and operates as a single public cloud-native, API-first platform, which we are developing into a fully functional modern alternative for existing core functions. The platform includes services like wire transfers, a centralized data hub for reporting and analysis, exception item processing, general ledger, deposit servicing, and entitlements. These services can be combined with other Jack Henry public cloud-native solutions, such as digital banking, digital payments, and fraud detection, as well as third-party provider solutions on a single, unified platform.\nThe Jack Henry Platform leverages public cloud advantages, including high system availability, rapid processing, modern security standards, easily deployable upgrades, and scalability. \nAcquisition Strategy\nWe have a disciplined approach to acquisitions and have been successful in supplementing our organic growth with 35 strategic acquisitions since the end of fiscal year 1999. We continue to explore acquisitions that have the potential to: \n•\nExpand our suite of complementary/payment products and services.\n•\nProvide products and services that can be sold to both existing core and non-core clients as well as outside our core base to new clients.\n•\nAccelerate our internal development efforts for technology modernization.\n•\nProvide selective opportunities to sell outside our traditional markets in the financial services industry. \nAfter nearly 50 years in business, we have very few gaps in our product line, so it is increasingly difficult to find proven products or services that would enable our clients and prospects to better optimize their business opportunities or solve specific operational issues. In addition, we see few acquisition opportunities that would \n7\nexpand our market or enable our entry into adjacent markets within the financial services industry that are fairly priced or that we could assimilate into our Company without material distractions. \nWe have a solid track record of executing acquisitions from both a financial and operational standpoint, and we will continue to pursue acquisition opportunities that support our strategic direction, complement and accelerate our organic growth, and generate long-term profitable growth for our stockholders. While we seek to identify appropriate acquisition opportunities, we will continue to explore alternative ways to leverage our cash position and balance sheet to the benefit of our stockholders, such as continued investment in new products and services for our clients, repurchases of our stock, and continued payment of dividends.\nOur most recent acquisition was:\nFiscal Year\nCompany or Product Name\nProducts and Services\n2023\nPayrailz, LLC (\"Payrailz\")\nProvider of cloud-native modern digital payment capabilities leveraging AI and machine learning features for the financial services industry.\nSolutions\n•\nOur core banking solutions support commercial banks with information and transaction processing platforms that provide enterprise-wide automation. We have three functionally distinct core bank processing systems and many fully integrated complementary/payment solutions, including business intelligence and bank management, retail and business banking, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our core banking solutions have state-of-the-art functional capabilities, and we can re-market the hardware required by on-premise use of each software system. Our banking solutions can be delivered on-premise or through our private cloud delivery model and are backed by a company-wide commitment to provide exceptional client support. \n•\nOur core credit union solutions support credit unions of all sizes with an information and transaction processing platform that provides enterprise-wide automation. Our solution includes one flagship core processing system and many fully integrated complementary/payment solutions, including business intelligence and credit union management, accountholder and accountholder business services, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our credit union solution also has state-of-the-art functional capabilities. We also re-market the hardware required by on-premise use of the software system. Our credit union solution can be delivered on-premise, through our private cloud, or through our partner private cloud delivery models. Each is backed by our company-wide commitment to provide exceptional client support. \n•\nOur non-core solutions for banks, credit unions, and diverse corporate entities are specialized products and services assembled primarily through our focused diversification acquisition strategy. These core-agnostic solutions are compatible with a wide variety of information technology platforms and operating environments and offer a large number of complementary/payment solutions, including proven solutions for generating additional revenue and growth, increasing security and mitigating operational risks, and/or controlling operating costs. Our non-core products and services enhance the performance of banks and credit unions of all asset sizes and charters, and diverse corporate entities. These distinct products and services can be implemented individually or as solution suites to address specific business problems or needs and enable effective responses to dynamic industry trends.\nWe are committed to developing and maintaining modern and integrated solutions supported by high service levels. We continuously update and improve these solutions through an interactive client enhancement process, ensuring compliance with relevant regulations, and incorporating proven advances in technology. Our goal is to uphold our Company's reputation as a premium solution and service provider.\nCore Software Systems\nCore software systems primarily consist of the integrated applications required to process deposit, loan, and general ledger transactions, and to maintain centralized accountholder information.\nOur core banking solutions consist of three software systems marketed to banks, and our core credit union solution consists of one software system marketed to credit unions. These core systems are available for on-premise installation at client sites, or banks and credit unions can choose to leverage our private cloud environment for ongoing information processing.\n8\nCore banking platforms are:\n•\nSilverLake System\n®\n, \na robust system primarily designed for commercial-focused banks that currently serves banks with assets ranging from $1 billion to over $55 billion. Some progressive smaller banks and de novo (start-up) banks also select SilverLake. This system is in use by 520 banks, and now serves nearly 12% of the domestic banks in the $55 billion and under asset range.\n•\nCIF 20/20\n®\n, \na parameter-driven, easy-to-use system that now supports 260 banks ranging from de novo institutions to those with assets of $6 billion.\n•\nCore Director\n®\n, \na cost-efficient system with point-and-click operation that now supports over 170 banks ranging from de novo institutions to those with assets of $2 billion.\nCore credit union platform is:  \n•\nSymitar\n®\n (formerly known as Episys\n®\n),\n a robust system designed specifically for credit unions. It has been implemented by approximately 715 credit unions with assets ranging from $20 million to $33 billion, and according to National Credit Union Administration (\"NCUA\") data, is the system implemented by more credit unions with assets exceeding $25 million than any other credit union core system.\nClients electing to install our solutions on-premise license the proprietary software systems. The majority of these clients pay ongoing annual software maintenance fees. We re-market the hardware, hardware maintenance, and peripheral equipment that is required by on-premise use of our software solutions; and we perform software implementation, data conversion, training, ongoing support, and other related services. On-premise clients generally license our core software systems under a standard license agreement that provides a fully paid, nonexclusive, nontransferable right to use the software on a single computer at a single location.\nClients can eliminate the significant up-front capital expenditures required by on-premise installations and the responsibility for operating information and transaction processing infrastructures by leveraging our private cloud environment for those functions. Our core private cloud services are provided through a highly resilient data center configuration across multiple physical locations. We also provide image item processing services from two host/archive sites and several key entry and balancing locations throughout the country. We print and mail accountholder statements for banks and credit unions from three regional printing and rendering centers. Clients electing to outsource their core processing typically sign contracts for six years that include \"per account\" fees and minimum guaranteed payments during the contract period.\nWe are dedicated to meeting the evolving business needs of our core bank and credit union clients by continuously enhancing each core system, introducing new integrated complementary products regularly, integrating practical new technologies, and adhering to regulatory compliance initiatives. Additionally, we serve as a single point of contact for each core client for support and accountability. \nComplementary Products and Services  \nWe have a large number of complementary/payment products and services that are targeted to our core banks and  credit unions. Many of these are selectively sold to banks and credit unions that use other core processing systems.\nThese complementary/payment solutions enable core bank and credit union clients to respond to evolving accountholder demands, expedite speed-to-market with competitive offerings, increase efficiency, address specific operational needs, and generate new revenue streams. The highly specialized solutions enable diverse banks, credit unions, and corporate entities to generate additional revenue and growth opportunities, increase security, mitigate operational risks, and control operating costs.\nWe regularly introduce new products and services based on demand for integrated complementary/payment solutions from our existing core clients and based on the growing demand among banks, credit unions, and corporate entities for specialized solutions capable of increasing revenue and growth opportunities, mitigating and controlling operational risks, and/or containing costs. Our Industry Research department solicits client guidance on the business solutions they need, evaluates available solutions and competitive offerings, and manages the introduction of new product offerings. Our new complementary/payment products and services are developed internally, acquired, or provided through strategic alliances.\nImplementation and Training\nMost of our core bank and credit union clients contract with us for implementation and training services in connection with their systems and additional complementary products.\nA complete core system implementation typically includes detailed planning, project management, data conversion, and testing. Our experienced implementation teams travel to client facilities or work remotely with clients to help \n9\nmanage the implementation process and ensure that all data is transferred from the legacy system to the Jack Henry system. Our implementation fees are fixed or hourly based on the core system being installed.\nWe also provide extensive initial and ongoing education to our clients. We have a comprehensive training program that supports new clients with basic training and longtime clients with continuing education. The training enables banks and credit unions to maximize the use of our core and complementary solutions, learn about ongoing system enhancements, and understand evolving legislative and regulatory requirements. \nSupport and Services \nWe serve our core clients as a single point of contact and support for the solutions we provide. Our comprehensive support infrastructure incorporates:\n•\nHigh service standards.\n•\nTrained support staff available up to 24 hours a day, 365 days a year.\n•\nAssigned account team.\n•\nSophisticated support tools, resources, and technology.\n•\nBroad experience converting diverse banks and credit unions to our core platforms from competitive platforms. \n•\nHighly effective change management and control processes.\n•\nBest practices methodology developed and refined through the company-wide, day-to-day experience. \nMost on-premise clients contract for annual software support services, and this represents a significant source of recurring revenue for Jack Henry. These support services are typically priced at approximately 20% of the respective product’s software license fee. The subsequent years' service fees generally increase as client assets increase and as additional complementary products are purchased. Annual software support fees typically are billed during June and are paid in advance for the entire fiscal year, with proration for new product implementations that occur during the fiscal year. Hardware support fees also are usually paid in advance for entire contract periods which typically range from one to five years. Most support contracts automatically renew unless the client or Jack Henry gives notice of termination at least 30 days prior to contract expiration.\nHigh levels of support are provided to our private cloud clients by the same support infrastructure utilized for on-premise clients. However, these support fees are included as part of monthly private cloud fees.\nHardware Systems\nOur software systems operate on a variety of hardware platforms. We have established remarketing agreements with IBM Corporation, and many other hardware providers that allow Jack Henry to purchase hardware and related maintenance services at a discount and resell them directly to our clients. We currently sell IBM Power Systems™; Lenovo\n®\n, Dell, Hewlett Packard Enterprise, and Cisco servers and workstations; Canon\n®\n, Digital Check, Epson\n®\n, and Panini\n®\n check scanners; and other devices that complement our software solutions.\nDigital Products and Services\nJack Henry Digital provides a unified platform of digital products and services, anchored by the Banno Digital Platform™. This native and browser-based banking solution empowers community and regional banks and credit unions to strategically enhance their digital offerings and compete effectively with larger banks and tech companies. It's a comprehensive business and retail open platform delivering attractive, fast, cloud-native applications for accountholders and cloud-based, core-connected back-office tools for employees. Our treasury platform is a separate digital product that services the needs of banks' and credit unions' larger commercial customers. \nPayment Solutions\nElectronic payment solutions provide our clients with the tools necessary to be at the forefront of payment innovation with secure payment processing designed to simplify complex payment processing, attract profitable retail and commercial accounts, increase operating efficiencies, comply with regulatory mandates, and proactively mitigate and manage payment-related risk.\n•\nJHA Card Processing Solutions™ (\"CPS\")\n supports full-service and in-house debit and credit card programs, as well as an agent credit option, backed by a comprehensive suite of tools for 24/7 fraud mitigation, digital payments, full-service dispute management, plastics manufacturing and personalization, loyalty programs, data analytics, and ATM terminal driving. In addition, advisory services are offered to support a variety of needs including card portfolio growth, start-up program consultation, as well as customized fraud management; all tailored to individual bank and credit union goals and concerns. \n•\nEnterprise Payment Solutions (\"EPS\")\n is a comprehensive payments engine, offering an integrated suite of Automated Clearing House (\"ACH\"), instant payments, credit card, and remote deposit capture processing that \n10\nincludes supporting tools for accounts receivable posting, risk management, reporting, and application interfaces (\"APIs\") for banks, credit unions, businesses, and fintechs of all sizes. EPS helps clients succeed in today’s competitive market to increase revenue, improve efficiencies, better manage compliance, and enhance accountholder relationships. \n•\nPayrailz\nTM \nPayments Platform\n provides consumers and businesses with money movement options through their bank's or credit union's digital platforms. It supports our technology modernization strategy by providing next-generation, cloud-native digital payment capabilities to our payment ecosystem. This money movement payments platform incorporates artificial intelligence (\"AI\") to make predictive and proactive recommendations, a flexible modern user experience, a layered security model, an automated fraud feature powered by machine learning, and a contemporary, adaptable administrative portal. In addition to bill payment capabilities, we provide a 'pay a loan' feature, an 'open looped' real-time person-to-person (\"P2P\") solution, and account-to-account (\"A2A\") transfer features. The array of money movement options maintains consumer and business engagement with the bank or credit union.\n•\nJHA PayCenter\nTM\n provides banks and credit unions with a single entry point to both Zelle\n®\n and Real Time Payments (\"RTP\") networks, and the Federal Reserve's FedNow\n® \nnetwork. PayCenter manages the certification process and mandatory updates from the networks, simplifies integration with toolkits, and provides fraud monitoring. Banks and credit unions can send and receive transactions instantly 24 hours a day, 365 days a year, through our core and complementary solutions.\n•\nPayments as a Service (\"PaaS\")\n supports embedded payment capabilities and ties together and further enhances the complete array of electronic payments functionality with a front-end Payments Developers Experience Portal, APIs, and back-end data analytics.\nResearch and Development\nWe invest significant resources in ongoing research and development to build new software solutions and services and enhance existing solutions with additional functionality and features required to ensure regulatory compliance. We enhance our core and complementary systems a minimum of once each year. Product-specific enhancements are largely client-driven with recommended opportunities formally gathered through focus groups, change control boards, strategic initiatives meetings, annual user group meetings, and ongoing client contact. We also continually evaluate and implement process improvements that expedite the delivery of new products and enhancements to our clients and reduce related costs.\nResearch and development expenses (in thousands) for fiscal 2025, 2024, and 2023 were $162,771, $148,256, and $142,678, respectively. We recorded capitalized software (in thousands) in fiscal 2025, 2024, and 2023 of $172,445, $167,175, and $166,120, respectively. \nSales and Marketing\nWe serve established, well-defined markets that provide ongoing sales and cross-sell opportunities.\nThe marketing and sales initiatives within the core business lines are primarily focused on identifying banks and credit unions evaluating alternative core information and transaction processing solutions. Our non-core specialized core-agnostic niche solutions are sold to complement existing technology platforms to banks and credit unions of all asset sizes and charters.\nSales executives are responsible for the activities required to earn new clients in assigned territories, and regional account executives are responsible for nurturing client relationships and cross selling additional products and services. Our sales professionals receive base salaries and performance-based commission compensation. Sales support staff provide a variety of services, including product and service demonstrations, responses to prospect-issued requests-for-proposals, and proposal and contract generation. Our marketing department supports sales with lead generation and brand-building activities, including participation in state-specific, regional, and national trade shows; print and online advertising; client newsletters; ongoing promotional campaigns; and media relations. We also host an annual national education conference, which provides opportunities to network with existing clients and demonstrate new products and services.\nJack Henry has sold select products and services outside the United States, primarily in Latin America, the Caribbean and Canada. International sales accounted for less than 1% of Jack Henry’s total revenue in each of fiscal 2025, 2024, and 2023.\nCompetition\nThe market for companies providing technology solutions to financial services organizations is competitive, and we expect that competition from both existing competitors and companies entering our existing or future markets will remain strong. Some of our current competitors have longer operating histories, larger client bases, and greater \n11\nfinancial resources. The principal competitive factors affecting the market for technology solutions include culture, service, innovation, strategy, and execution, along with product/service functionality, price, operating flexibility, and ease-of-use. For more than a decade, there has been significant consolidation among providers of products and services designed for banks and credit unions, and this consolidation is expected to continue in the future.\nOur core solutions compete with large vendors that provide information and transaction processing solutions to banks and credit unions, including Fidelity National Information Services, Inc.; Fiserv, Inc.; Corelation, Inc.; and Finastra. Our non-core specialized solutions compete with an array of disparate vendors that provide niche solutions to financial services organizations and corporate entities.\nIntellectual Property, Patents, and Trademarks  \nAlthough we believe our success depends upon our technical expertise more than our proprietary rights, our future success and ability to compete depend in part upon our proprietary technology. We have registered or filed applications for our primary trademarks. Most of our technology is not patented. Instead, we rely on a combination of contractual rights, copyrights, trademarks, and trade secrets to establish and protect our proprietary technology. We generally enter into confidentiality agreements with our associates, consultants, resellers, clients, and  prospects. Access to and distribution of our Company’s source code is restricted, and the disclosure and use of other proprietary information is further limited. Despite our efforts to protect our proprietary rights, unauthorized parties can attempt to copy or otherwise obtain, or use our products or technology. \nRegulatory Compliance\nJack Henry maintains a corporate commitment to address compliance issues and implement requirements imposed by federal regulators prior to the effective date of such requirements when adequate prior notice is given. Our compliance program is coordinated by a team of qualified compliance professionals with extensive regulatory agency and financial institution experience, knowledge and understanding of Federal consumer protection regulations, and a thorough working knowledge of Jack Henry and our solutions. These compliance professionals leverage multiple channels to remain informed about potential and recently enacted regulatory requirements, including discussions on emerging topics with the Federal Banking Agencies (“FBA”), and training sessions sponsored by various professional associations.\nWe have processes in place to inform internal stakeholders of new and revised regulatory requirements. Upcoming regulatory changes also are presented to the Company’s development teams through periodic regulatory compliance meetings and the necessary product changes are included in the ongoing product development cycle. We publish newsletters to keep our clients informed of regulatory changes that could impact their operations. Periodically, client advisory groups are assembled to discuss significant regulatory changes.\nInternal audits of our systems, networks, operations, business recovery plans, and applications are conducted and specialized outside firms are periodically engaged to perform testing and validation of our systems, processes, plans, and security. The FBA conducts ongoing examinations of the Company and issues Reports of Examination. The Board of Directors provides oversight of these activities through the Risk and Compliance Committee and the Audit Committee.\nGovernment Regulation\nThe financial services industry is subject to extensive and complex federal and state regulation. All financial institutions are subject to substantial regulatory oversight and supervision. Our products and services must comply with the extensive and evolving regulatory requirements applicable to our clients, including but not limited to those mandated by federal truth-in-lending and truth-in-savings rules, the Privacy of Consumer Financial Information regulations, usury laws, the Equal Credit Opportunity Act, the Fair Housing Act, the Electronic Funds Transfer Act, the Fair Credit Reporting Act, the Bank Secrecy Act, the USA Patriot Act, the Gramm-Leach-Bliley Act, the Community Reinvestment Act and the Dodd-Frank Wall Street Reform and Consumer Protection Act. The compliance of Jack Henry’s products and services with these requirements depends on a variety of factors, including the parameters set through the interactive design, the classification of clients, and the manner in which the client utilizes the products and services. Our clients are contractually responsible for assessing and determining what is required of them under these regulations and then we provide solutions that assist them in meeting their regulatory needs through our products and services. We cannot predict the impact these regulations, any future amendments to these regulations or any newly implemented regulations will have on our business in the future.\nJack Henry is not chartered by the Office of the Comptroller of Currency (\"OCC\"), the Board of Governors of the Federal Reserve System, the FDIC, the NCUA or other federal or state agencies that regulate or supervise depository institutions. However, operating as a service provider to banks and credit unions, Jack Henry’s operations are governed by the same regulatory requirements as those imposed on financial institutions, and \n12\nsubject to periodic reviews by FBA regulators who have broad supervisory authority to remedy any shortcomings identified in such reviews. Jack Henry is also subject to periodic examinations by the Consumer Financial Protection Bureau (“CFPB”), which provides supervision and enforcement related to federal consumer financial laws applicable to some products and services offered by our clients.\nWe provide private cloud services through Jack Henry Processing Services™ for banks and EASE Processing Services™ for credit unions. We provide data centers and electronic transaction processing through JHA Card Processing Solutions™, internet banking through NetTeller\n®\n and Banno\nTM\n online solutions, bill payment through our Payrailz\nTM\n Payments Platform, network security monitoring and Hosted Network Solutions (\"HNS\") through our Gladiator\n®\n unit, cloud services through Hosted Partner Services and Enterprise Integration Services, and business recovery services through Centurion Disaster Recovery\n®\n.\nOur private cloud services are subject to examination by FBA regulators under the Bank Service Company Act. These examinations cover a wide variety of subjects, including system development, functionality, reliability, and security, as well as disaster preparedness and business recovery planning. Our private cloud services are also subject to examination by state banking authorities on occasion.\nHuman Capital\nOur Associates\nAs of June 30, 2025, Jack Henry had approximately 7,240 full-time and part-time associates. Our associates are not covered by a collective bargaining agreement and there have been no labor-related work stoppages.\nTalent Attraction and Engagement\nOur people and culture strategy is focused on attracting, engaging, and retaining associates that are qualified and innovative with future-ready technical skills. We are an equal opportunity employer and are committed to considering all qualified candidates for employment.\nWe seek non-traditional talent streams to help identify candidates from underrepresented groups. Our internship attracts college and university students, and our apprenticeship program offers paid training and work for candidates with little to no traditional experience, such as computer coding. Both programs can lead to full-time employment.\nWe are committed to fostering a respectful and inclusive workplace where all individuals are treated with respect and dignity, and we focus on ensuring all associates feel they belong at Jack Henry. \nBusiness Innovation Groups (\"BIGs\"), which are open to all associates, help us to foster a culture of inclusion and belonging. These groups provide input and suggestions to address business problems and offer education and training to foster inclusion and belonging. As of June 30, 2025, we had over 1,770 unique associates and nearly\n \n2,810 combined associates participating in six active BIGs. A significant portion of the Company’s associates work remotely on either a full-time or hybrid remote/office basis. The Company remains focused on equipping all associates with the tools necessary to effectively communicate, collaborate, and build connections in a remote environment, including ensuring leaders have the skills needed to effectively lead dispersed teams.\nWe seek to actively listen to our associates throughout the year using a defined and continuous listening strategy designed to gather regular feedback on well-being, engagement, leadership, ethics, culture and values, satisfaction, and sense of belonging, through channels such as our annual engagement survey, pulse surveys, skip-a-level interviews, and town halls. This comprehensive strategy allow us to respond to associate concerns, benefit from associate perspectives, and better design and develop processes to support our Company culture. Associates can learn about changes through our internal online news center, regular email communications, monthly Manager Forum events, quarterly associate update videos, or all-associate town hall meetings delivered by senior management.\nLearning and Development\nOur success depends not only on attracting and retaining talented associates, but also in developing our current associates and providing new opportunities for their growth. We offer our associates numerous live and on-demand courses, resources, and training programs to help them build knowledge, improve skills, and develop their career at Jack Henry. Learning opportunities include mandatory courses, as well as recommended content in areas such as leadership development, technical skills, business acumen, innovation, and change management. Jack Tracks, an annual, company-wide virtual learning event, offers associates a large selection of curated topics such as technical and operational readiness, technology trends, company solutions, and industry trends.\nRecognizing the importance of mentoring in career development, we host an internal mentorship marketplace, which allows prospective mentors and mentees to connect and self-initiate a mentoring relationship. Career mobility \n13\nand personal development resources are available to all associates through dedicated intranet sites including an internal career website where associates can explore new opportunities, register their skills, and view salary ranges. We continue to strengthen our leadership capacity by providing training on effective coaching practices to leaders of the Company.\nWe recognize and value the contribution of our associates who develop, improve, and support our technology solutions. Access to on-demand technical training libraries, customized learning plans, certification programs, and classes facilitated by external experts are available to advance their technical expertise. When there is a critical skill need or where the technology landscape is rapidly changing, we provide unique learning solutions to align associates' development with our strategic initiatives.\nWellness and Safety\nWe emphasize the safety and well-being of our associates as a top priority. We define wellness holistically and include mental, physical, emotional, financial, psychological, and environmental considerations. Our benefit plan offerings include supportive and dedicated campaigns that communicate directly to associates about financial wellness, mental health, healthful nutrition and exercise, and other wellness topics. Associate well-being is further supported through policies such as remote work, paid parental leave, military service leave, educational assistance, and bereavement leave policies, as well as paid time off, adoption assistance, an employee assistance program, wellness incentives, and paid community volunteer hours.\nAvailable Information\nJack Henry’s website is easily accessible to the public at \njackhenry.com\n. The “Investor Relations\" portion of the website provides key corporate governance documents, the code of conduct, an archive of press releases, and other relevant Company information. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and other filings and amendments thereto that are made with the SEC also are available free of charge on our website as soon as reasonably practical after these reports have been filed with or furnished to the SEC. The SEC also maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at \nhttps://www.sec.gov\n.",
    "item1a": "Item 1A.\nCyberSecurity Governance and Oversight\nOur Board of Directors has ultimate oversight of risk management and has delegated responsibility for enterprise and operational risks, including cybersecurity, to the Board’s Risk and Compliance Committee. This Committee oversees Jack Henry’s risk assessment and management programs and reviews risk preparedness. The Audit Committee oversees financial risks and would be informed of any material cybersecurity incident that could potentially have a material impact on our financial statements. \nThe Chief Information Security Officer (“CISO”) reports quarterly to the Risk and Compliance Committee and to the full Board of Directors on information security matters.\n The CISO also meets with the Risk and Compliance Committee at least annually to evaluate our overall security environment and organization.\n \nWhile the Board of Directors, through the Risk and Compliance Committee, maintains oversight of cybersecurity risks, management is primarily responsible for identifying, assessing, and managing these risks within our broader risk management program. \nThe \nEnterprise Risk Management Committee\n, composed of senior executives, monitors governance, risk, and compliance enterprise-wide, including cybersecurity. Management has adopted specific policies and procedures to monitor and mitigate cybersecurity threats including an incident response program, led by the CISO and staffed by professionals with diverse expertise. Incidents meeting pre-established thresholds are escalated to management for threat assessment, mitigation, remediation, and, if necessary, disclosure to clients, third-parties, and regulators.\nOur CISO, who reports to the Chief Operations Officer, has primary responsibility for Jack Henry’s information security strategy, policy, security engineering, operations, and cybersecurity threat detection and response. Our CISO brings more than 20 years experience in technology and cybersecurity, including senior leadership roles at major financial institutions.\n Under the CISO's direction, the information security team continuously monitors cybersecurity trends and implements proactive and defensive measures to protect against cybersecurity threats.",
    "item1b": "ITEM 1B.   UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.   CYBERSECURITY\nCyber Risk Management and Strategy \nIn today's interconnected environment, information is inherently exposed to a wide range of risks, threats, and vulnerabilities. As a provider of products and services to financial institutions, Jack Henry integrates industry-standard frameworks, policies, and procedures to securely process and store sensitive information, prioritizing the protection of our associates, clients, and their private data in an ever-evolving cyber threat landscape. \nJack Henry’s information and cybersecurity program is a core component of our overall enterprise risk management framework. It is maintained by a team of highly skilled cybersecurity professionals and supported by investments in modern technology, including artificial intelligence and machine learning. The program is designed to safeguard Jack Henry and client confidentiality and privacy by systematically identifying, assessing, and managing material risks and cybersecurity threats through comprehensive cyber defense, threat and vulnerability management, and cyber intelligence. It includes continuous enterprise monitoring and well-defined and regularly tested business \n20\nresilience and incident response procedures. We also engage third-party vendors and consultants to assist in identifying, assessing, and mitigating cybersecurity risks.\n \nJack Henry systems and services are subject to regular reviews by the same regulatory agencies that oversee financial institutions, including the Federal Reserve Bank (“FRB”), FDIC, Office of the Comptroller of the Currency (“OCC”), NCUA, and the CFPB, among others. These reviews, including those conducted by the Federal Banking Agencies (comprised of the FDIC, FRB, and the OCC) help identify potential security gaps or control deficiencies. In addition, critical services provided to our clients undergo annual System and Organization Controls (“SOC”) reviews by independent auditors.\nOur associates and contractors play a vital role in the safeguarding of systems and data. All are required to complete annual security awareness training to ensure they stay current on best practices and emerging cyber threats. We also conduct routine phishing exercises to help associates and contractors recognize and appropriately respond to suspicious emails. Supplemental training is provided throughout the year to individuals and teams with elevated-risk profiles.\nJack Henry relies on third-party service providers to deliver certain services and products to our clients. We evaluate and seek to mitigate the cybersecurity risks associated with these providers through pre-engagement and periodic risk assessments to ensure our standards for security are maintained. Our strategic risk management committees review and address any identified risks.\n \nIn fiscal year 2025, we did not identify any cybersecurity threats, including those arising from prior incidents, that materially affected our business strategy, results of operations, or financial condition.\n \nAs a large financial technology provider, we continually face risks from cybersecurity threats that, if realized, are reasonably likely to materially affect our business strategy, results of operations, or financial condition. Despite our efforts to identify and respond to cybersecurity threats, we cannot guarantee that we will not experience a material cybersecurity incident in the future or that an undetected incident has not already occurred. For further discussion of cybersecurity risks, see the section entitled “Risk Factors” in"
  }
}