{
  "ticker": "JNJ",
  "cik": "0000200406",
  "company_name": "JOHNSON & JOHNSON",
  "filing_date": "2025-02-13",
  "accession": "0000200406-25-000038",
  "primary_doc": "jnj-20241229.htm",
  "item_sections": {
    "item1": "Item 1. Business\nGeneral\nJohnson & Johnson and its subsidiaries (the Company) have approximately 138,100 employees worldwide engaged in the research and development, manufacture and sale of a broad range of products in the healthcare field. Johnson & Johnson is a holding company, with operating companies conducting business in virtually all countries of the world. The Company’s primary focus is products related to human health and well-being. Johnson & Johnson was incorporated in the State of New Jersey in 1887.\nThe Chief Operating Decision Maker (CODM) is the Company's Chief Executive Officer (Principal Executive Officer). The Executive Committee is Johnson & Johnson’s senior leadership team responsible for setting the strategy and priorities of the Company and driving accountability at all levels. Within the strategic parameters provided by the Executive Committee, senior management groups at U.S. and international operating companies are each responsible for their own strategic plans and the day-to-day operations of those companies. \nSegments of business\nThe Company is organized into two business segments: Innovative Medicine and MedTech. Additional information required by this item is incorporated herein by reference to the narrative and tabular descriptions of segments and operating results under: Item 7. Management’s discussion and analysis of results of operations and financial condition of this Report; and Note 17 Segments of business and geographic areas of the notes to consolidated financial statements included in Item 8 of this Report.\nInnovative Medicine\nThe Innovative Medicine segment is focused on the following therapeutic areas: Immunology (e.g., rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease and psoriasis), Infectious Diseases (e.g., HIV/AIDS), Neuroscience (e.g., mood disorders, neurodegenerative disorders and schizophrenia), Oncology (e.g., prostate cancer, hematologic malignancies, lung cancer and bladder cancer), Cardiovascular and Metabolism (e.g., thrombosis, diabetes and macular degeneration) and Pulmonary Hypertension (e.g., Pulmonary Arterial Hypertension). Medicines in this segment are distributed directly to retailers, wholesalers, distributors, hospitals and healthcare professionals for prescription use. Key products in the Innovative Medicine segment include: REMICADE (infliximab), a treatment for a number of immune-mediated inflammatory diseases; SIMPONI (golimumab), a subcutaneous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis, active ankylosing spondylitis and moderately active to severely active ulcerative colitis; SIMPONI ARIA (golimumab), an intravenous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis and active ankylosing spondylitis and active polyarticular juvenile idiopathic arthritis (pJIA) in people 2 years of age and older; STELARA (ustekinumab), a treatment for adults and children with moderate to severe plaque psoriasis, for adults with active psoriatic arthritis, for adults with moderately to severely active Crohn's disease and treatment of moderately to severely active ulcerative colitis; TREMFYA (guselkumab), a treatment for adults with moderate to severe plaque psoriasis and active psoriatic arthritis and ulcerative colitis; EDURANT (rilpivirine), PREZISTA (darunavir) and PREZCOBIX/REZOLSTA (darunavir/cobicistat), antiretroviral medicines for the treatment of human immunodeficiency virus (HIV) in combination with other antiretroviral products and SYMTUZA (darunavir/cobicistat/emtricitabine/tenofovir alafenamide), a once-daily single tablet regimen for the treatment of HIV; CONCERTA (methylphenidate HCl) extended-release tablets CII, a treatment for attention deficit hyperactivity disorder; INVEGA SUSTENNA/XEPLION (paliperidone palmitate), for the treatment of schizophrenia and schizoaffective disorder in adults; INVEGA TRINZA/TREVICTA (paliperidone palmitate), for the treatment of schizophrenia in patients after they have been adequately treated with INVEGA SUSTENNA for at least four months; SPRAVATO (Esketamine), a nasal spray, used along with an oral antidepressant, to treat adults with treatment-resistant depression (TRD) and depressive symptoms in adults with major depressive disorder (MDD) with suicidal thoughts or actions; CARVYKTI (ciltacabtagene autoleucel), a chimeric antigen receptor (CAR)-T-cell therapy for the treatment of patients with relapsed/refractory multiple \n2024 Annual Report\n1\nmyeloma; ZYTIGA (abiraterone acetate), a treatment for patients with prostate cancer; ERLEADA (apalutamide), a next-generation androgen receptor inhibitor for the treatment of patients with prostate cancer; IMBRUVICA (ibrutinib), a treatment for certain B-cell malignancies, or blood cancers and chronic graft versus host disease; DARZALEX (daratumumab), a treatment for multiple myeloma; DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), a treatment for multiple myeloma and light chain (AL) Amyloidosis; TECVAYLI (teclistamab-cqyv), a ready-to-use bispecific antibody for adults with relapsed or refractory multiple myeloma who have received at least four prior lines of therapy; XARELTO (rivaroxaban), an oral anticoagulant for the prevention of deep vein thrombosis (DVT), which may lead to pulmonary embolism (PE) in patients undergoing hip or knee replacement surgery, to reduce the risk of stroke and systemic embolism in patients with nonvalvular atrial fibrillation, and for the treatment and reduction of risk of recurrence of DVT and PE to reduce the risk of major cardiovascular events in patients with coronary artery disease (CAD) and peripheral artery disease (PAD), for the treatment and secondary prevention of thromboembolism in pediatric patients, and for thromboprophylaxis in pediatric patients following the Fontan procedure; OPSUMIT (macitentan) as monotherapy or in combination, indicated for the long-term treatment of pulmonary arterial hypertension (PAH); UPTRAVI (selexipag), the only approved oral and intravenous, selective IP receptor agonist targeting a prostacyclin pathway in PAH. Many of these medicines were developed in collaboration with strategic partners or are licensed from other companies and maintain active lifecycle development programs.\nMedTech\nThe MedTech segment includes a broad portfolio of products used in the cardiovascular, orthopaedics, surgery, and vision categories. The Cardiovascular (previously referred to as Interventional solutions) portfolio includes electrophysiology products to treat heart rhythm disorders, the heart recovery portfolio (Abiomed) which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock, circulatory restoration products (Shockwave) for the treatment of calcified coronary artery disease (CAD) and peripheral artery disease (PAD), and neurovascular care that treats hemorrhagic and ischemic stroke. The Orthopaedics portfolio includes products and enabling technologies that support hips, knees, trauma, spine, sports, and others. The Surgery portfolios include advanced and general surgery technologies, as well as solutions that focus on breast aesthetics and reconstruction (Mentor). Vision products include ACUVUE brand contact lenses and TECNIS intraocular lenses for cataract surgery. These products are distributed to wholesalers, hospitals, and retailers and are used predominantly in the professional fields by physicians, nurses, hospitals, eye care professionals, and clinics.\nGeographic areas\nThe Company conducts business in virtually all countries of the world with the primary focus on products related to human health and well-being. The products made and sold in the international business include many of those described above under Segments of Business – Innovative Medicine and MedTech. However, the principal markets, products and methods of distribution in the international business vary with the country and the culture. The products sold in the international business include those developed in the U.S. and by subsidiaries abroad.\nInvestments and activities in some countries outside the U.S. are subject to higher risks than comparable U.S. activities because the investment and commercial climate may be influenced by financial instability in international economies, restrictive economic policies and political and legal system uncertainties.\nRaw materials\nRaw materials essential to the Company's business are generally readily available from multiple sources. Where there are exceptions, the temporary unavailability of those raw materials would not likely have a material adverse effect on the financial results of the Company.\nPatents\nThe Company's subsidiaries have made a practice of obtaining patent protection on their products and processes where possible. They own, or are licensed under, a significant number of patents in the U.S. and other countries relating to their products, product uses, formulations and manufacturing processes, which in the aggregate are believed to be of material importance to the Company in the operation of its businesses. The Company’s subsidiaries face patent challenges from third parties, including challenges seeking to manufacture and market generic and biosimilar versions of the Company's key pharmaceutical products prior to expiration of the applicable patents covering those products. Significant legal proceedings \n2\n \n \nand claims involving the Company's patent and other intellectual property are described in Note 19 Legal proceedings—Intellectual property of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\nSales of the Company’s largest product, collectively DARZALEX (daratumumab) and DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), accounted for approximately 13.1% of the Company's total revenues for fiscal 2024. Accordingly, the patents related to these products are believed to be material to the Company. Genmab A/S owns two patent families related to DARZALEX, and Janssen Biotech, Inc. has an exclusive license to those patent families. The two patent families both expire in the United States in 2029, and in Europe, compound/use patent protection in select countries extends to 2031/2032. Janssen Biotech, Inc. owns a separate patent portfolio related to DARZALEX FASPRO.\nSales of the Company’s second largest product, STELARA (ustekinumab) accounted for approximately 11.7% of the Company's total revenues for fiscal 2024. According to patent settlement and license agreements, the Company expects continued launches of biosimilar versions of STELARA in Europe and the United States in 2025 which will impact the Company’s sales of STELARA.\nTrademarks\nThe Company’s subsidiaries have made a practice of selling their products under trademarks and of obtaining protection for these trademarks by all available means. These trademarks are protected by registration in the U.S. and other countries where such products are marketed. The Company considers these trademarks in the aggregate to be of material importance in the operation of its businesses.\nSeasonality\nWorldwide sales do not reflect any significant degree of seasonality; however, spending has typically been heavier in the fourth quarter of each year than in other quarters. This reflects increased spending decisions, principally for advertising and research and development activity.\nCompetition\nIn all of their product lines, the Company's subsidiaries compete with companies both locally and globally. Competition exists in all product lines without regard to the number and size of the competing companies involved. Competition in research, both internally and externally sourced, involving the development and the improvement of new and existing products and processes, is particularly significant. The development of new and innovative products, as well as protecting the underlying intellectual property of the Company’s product portfolio, is important to the Company's success in all areas of its business. The competitive environment requires substantial investments in continuing research. \nEnvironment\nThe Company is subject to a variety of environmental laws and regulations in the United States and other jurisdictions. The Company believes that its operations comply in all material respects with applicable environmental laws and regulations. The Company’s compliance with these requirements is not expected to have a material effect upon its capital expenditures, cash flows, earnings or competitive position.\nRegulation\nThe Company’s businesses are subject to varying degrees of governmental regulation in the countries in which operations are conducted, and the general trend is toward increasingly stringent regulation and enforcement. The Company is subject to costly and complex U.S. and foreign laws and governmental regulations, and any adverse regulatory action may materially adversely affect the Company's financial condition and business operations. In the U.S., the pharmaceutical product and medical technology industries have long been subject to regulation by various federal and state agencies, primarily as to product safety, efficacy, manufacturing, advertising, labeling and safety reporting. The exercise of broad regulatory powers by the U.S. Food and Drug Administration (the U.S. FDA) continues to result in increases in the amounts of testing and documentation required for U.S. FDA approval of new drugs and devices and a corresponding increase in the expense of product introduction. Similar trends are also evident in major markets outside of the U.S. \n2024 Annual Report\n3\nThe medical device regulatory framework and the evolving privacy, data localization, and emerging cyber security laws and regulations around the world are examples of such increased regulation. Within the U.S., an increasing number of U.S. States have enacted comprehensive privacy laws, and federal regulators (e.g., the U.S. FDA, FTC and HHS) continue to stress the intersection of health and privacy as a compliance and enforcement priority. In the EU, multiple directives and laws (including NIS2, EHDS, the Data Act, the Cyber Resilience Act, and the AI Act) are rapidly changing privacy and cybersecurity compliance requirements while introducing new enforcement risks. In addition, China has introduced broad personal information protection and data security regulations, with more anticipated, thereby increasing China’s scrutiny of company compliance and data transfer practices. With other jurisdictions enacting similar privacy laws, local data protection authorities will force greater accountability on the collection, access and use of personal data in the healthcare industry. These laws can also restrict transfers of data across borders, potentially impacting how data-driven health care solutions are developed and deployed globally in a compliant manner. Moreover, as a result of the broad scale release and availability of Artificial Intelligence (AI) technologies such as generative AI, a global trend towards more comprehensive and nuanced regulation to ensure the ethical use, privacy, and security of AI is underway that includes standards for transparency, accountability, and fairness, which will require compliance developments or enhancements. \nThe regulatory agencies under whose purview the Company operates have administrative powers that may subject it to actions such as product withdrawals, recalls, seizure of products and other civil and criminal sanctions. In some cases, the Company’s subsidiaries may deem it advisable to initiate product recalls regardless of whether it has been required or directed to.\nThe U.S. FDA and regulatory agencies around the globe are also increasing their enforcement activities. If the U.S. FDA were to conclude that we are not in compliance with applicable laws or regulations, or that any of our pharmaceutical products or medical technologies are ineffective or pose an unreasonable safety risk, the U.S. FDA could ban such products, detain or seize adulterated or misbranded products, order a recall, repair, replacement, or refund of such products, withdraw approval for such products, refuse to grant pending applications for marketing authorization or require certificates of foreign governments for exports, and/or require us to notify health professionals and others that the products present unreasonable risks of substantial harm to the public health. The U.S. FDA may also assess civil or criminal penalties against us, our officers or employees and impose operating restrictions on a company-wide basis, or enjoin and/or restrain certain conduct resulting in violations of applicable law. The U.S. FDA may also recommend prosecution to the U.S. Department of Justice. Any adverse regulatory action, depending on its magnitude, may restrict us from effectively marketing and selling our products and limit our ability to obtain future clearances, classifications or approvals, and could result in a substantial modification to our business practices and operations. Equivalent enforcement mechanisms exist in different countries in which we conduct business.\nThe costs of human healthcare have been and continue to be a subject of study, investigation and regulation by governmental agencies and legislative bodies around the world. In the U.S., attention has been focused by states, regulatory agencies and Congress on prices, profits, overutilization and the quality and costs of healthcare generally. Laws and regulations have been enacted to require adherence to strict compliance standards and prevent fraud and abuse in the healthcare industry. There is increased focus on interactions and financial relationships between healthcare companies and healthcare providers. Various state and federal transparency laws and regulations require disclosures of payments and other transfers of value made to certain healthcare practitioners, including physicians, teaching hospitals, and certain non-physician practitioners. Federal and foreign laws governing international business practices require strict compliance with anti-bribery standards and certain prohibitions with respect to payments to any foreign government official. Payors and Pharmacy Benefit Managers (PBMs) are a potent force in the marketplace, and increased attention is being paid to the impact of PBM practices on healthcare cost and access in the U.S.\nOur business has been and continues to be affected by federal and state legislation that alters the pricing, coverage, and reimbursement landscape. At the federal level, in August 2022, President Biden signed into law the Inflation Reduction Act (IRA), which includes provisions that effectively authorize the government to establish prices for certain high-spend single-source drugs and biologics reimbursed by the Medicare program, starting in 2026 for Medicare Part D drugs and 2028 for Medicare Part B drugs. On August 29, 2023, the Centers for Medicare & Medicaid Services (“CMS”) published the first “Selected Drug” list, which includes XARELTO and STELARA as well as IMBRUVICA, which is developed in collaboration and co-commercialized in the U.S. with Pharmacyclics LLC, an AbbVie company. The Selected Drug list also included other medicines targeting disease states that are prevalent in the Medicare population. Although CMS published an explanation for how it determined prices for selected drugs in December 2024, uncertainty remains as to the methodology used to determine these prices. The IRA specifies a ceiling price but not a minimum price for selected drugs and does not require CMS to use a specific framework for determining selected drug prices. In any event, we anticipate that the selected products will be subjected to a government-established price for the Medicare population beginning in 2026.\n4\n \n \nThe IRA also contains provisions that impose rebates if certain prices increase at a rate that outpaces the rate of inflation, beginning October 1, 2022, for Medicare Part D drugs and January 1, 2023, for Medicare Part B drugs. Separate IRA provisions redesign the Medicare Part D benefit in various ways, including by shifting a greater portion of costs to manufacturers within certain coverage phases and replacing the Part D coverage gap discount program with a new manufacturer discounting program. Failure to comply with IRA provisions may subject manufacturers to various penalties, including civil monetary penalties.\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In April 2024, Janssen appealed the district court’s denial of its summary judgment motion to the Third Circuit.\nAdditionally, we expect continued scrutiny on drug pricing and government price reporting from Congress, agencies, and other bodies at the federal and state levels, which may result in additional regulations or other mechanisms to increase pricing transparency and controls. \nThere are a number of additional bills pending in Congress and healthcare reform proposals at the state level that would affect drug pricing, including in the Medicare and Medicaid programs. This changing legal landscape has both positive and negative impacts on the U.S. healthcare industry with much remaining uncertain as to how various provisions of federal and state law, and potential modification or repeal of these laws, will ultimately affect the industry. The IRA and any other federal or state legislative change could affect the pricing and market conditions for our products.\nIn addition, business practices in the healthcare industry have come under increased scrutiny, particularly in the U.S., by government agencies and state attorneys general, and resulting investigations and prosecutions carry the risk of significant civil and criminal penalties. Of note is the increased enforcement activity by data protection authorities in various jurisdictions, particularly in the European Union, where significant fines have been levied on companies for data breaches, violations of privacy requirements, and unlawful cross-border data transfers. In the U.S., the Federal Trade Commission has stepped up enforcement of data privacy with several significant settlements (including settlements concerning the downstream sharing of personal information and use and disclosure of personal health data) and there have been a material increase in class-action lawsuits linked to the collection and use of biometric data and use of tracking technologies.\nFurther, the Company relies on global supply chains, and production and distribution processes, that are complex, and subject to increasing regulatory requirements that may affect sourcing, supply and pricing of materials used in the Company's products. These processes also are subject to complex and lengthy regulatory approvals.\n2024 Annual Report\n5\nEmployees and human capital management\nAs of December 29, 2024 and December 31, 2023 the number of employees was approximately:\n2024\n2023\nEmployees\n(1)\n139,800 \n134,400 \nFull-time equivalent (FTE) positions\n(2)\n138,100 \n131,900 \n(1)\n“Employee” is defined as an individual working full-time or part-time, excluding fixed term employees, interns and co-op employees. Employee data may not include full population from more recently acquired companies and individuals on long-term disability are excluded. Contingent workers, contractors and subcontractors are also excluded. Shockwave has been included in the fiscal 2024 headcount in the above table.\n(2)\nFTE represents the total number of full-time equivalent positions and does not reflect the total number of individual employees as some work part-time.\nEmployees by region (in percentages)\nStrategy\nThe Company believes that its employees are critical to its continued success and are an essential element of its long-term strategy. Management is responsible for ensuring that its policies and processes reflect and reinforce the Company's desired corporate culture, including policies and processes related to strategy, risk management, and ethics and compliance. The Company’s human capital management strategy is built on three fundamental focus areas:\n•\nAttracting and recruiting top talent\n•\nDeveloping and retaining top talent\n•\nEmpowering and inspiring talent\nUnderpinning these focus areas are ongoing efforts to cultivate and foster a culture built on innovation, health, well-being and safety, inclusion and belonging where the Company's employees are encouraged to succeed both professionally and personally while helping the Company achieve its business goals.\nCulture and employee engagement\nAt Johnson & Johnson, employees are guided by Our Credo, which sets forth the Company's responsibilities to patients, consumers, customers, healthcare professionals, employees, communities and shareholders. Employees worldwide must adhere to the Company’s Code of Business Conduct, which sets fundamental requirements and serves as a foundation for the Company policies, procedures and guidelines, all of which provide additional guidance on expected employee behaviors in every market where it operates. The Company conducts global surveys that offer its employees the ability to provide feedback and valuable insight to help address potential human resources risks and identify opportunities to improve. In 2024, 94% of global employees across 73 countries participated in Our Credo Survey which was offered in 36 languages.\n6\n \n \nGrowth and development\nTo lead in the changing healthcare landscape, it is crucial that the Company continue to attract and retain top talent. In 2024, the Company's voluntary turnover rate was 6.3%. The Company believes that its employees must be equipped with the right knowledge and skills and be provided with opportunities to grow and develop in their careers. Accordingly, professional development programs and educational resources are available to all employees. The Company's objective is to foster a learning culture that helps shape each person’s unique career path while creating a robust pipeline of talent to deliver on the Company’s long-term strategies. In furtherance of this objective, the Company deploys a global approach to ensure development is for everyone, regardless of where they are on their career journey. To prioritize learning, the Company recently held Johnson & Johnson's second Global Learning Day. Employees were encouraged to set aside a full day to explore skill-building courses on J&J Learn, the new state-of-the-art learning platform.\nOur workforce\nAs stated in Our Credo, we are responsible to our employees who work with us throughout the world. The Company is committed to cultivating, fostering and advancing an inclusive, credo-based work environment for employees that recognizes and rewards based on merit. The Company is dedicated to the values in Our Credo and strives to meet the needs of its employees and stakeholders through compliance with law and the following evidence based strategies:\n•\nSustain a global workforce of individuals with many different backgrounds, abilities, cultures and perspectives \n•\nMaintain a work environment where each person’s dignity is respected and they have an opportunity to advance based on their merit\n•\nDrive innovation and growth with our business to serve markets around the world \nOur approach with respect to our workforce is guided by applicable laws, internal and external insights, global best practices and employee feedback.\nCompensation and benefits\nAs part of the Company's total rewards philosophy, the Company offers competitive compensation and benefits to attract and retain top talent. The Company is committed to fair treatment in its compensation and benefits for employees at all levels. The Company observes legal minimum wage provisions and exceeds them where possible. The Company's total rewards offerings include an array of programs to support its employees' well-being, including annual performance incentive opportunities, pension and retirement savings programs, health and welfare benefits, paid time off, leave programs, flexible work schedules and employee assistance programs. \nHealth, wellness and safety\nThe Company’s investment in employee health, well-being and safety is built on its conviction that advancing health for humanity starts with advancing the health of its employees. With the right awareness, focus, practices and tools, the Company works to ensure that all its employees around the world, as well as contingent workers, contractors and visitors to the Company's sites, can work safely. The Company has continuously expanded health and well-being programs throughout the Company and across the globe, incorporating new thinking and technologies to keep its offerings best-in-class and to help employees achieve their personal health goals. The programs and practices the Company provides—physical, mental, emotional and financial—help promote holistic employee health. The Company continues to address our employees needs through J&J Flex, a hybrid model that empowers the Company’s office-based employees to find a balance of in-person and remote work, while preserving the Company's culture and need for face-to-face engagement and leadership. \n2024 Annual Report\n7\nAvailable information\nThe Company’s main corporate website address is \nwww.jnj.com\n. The Company makes its SEC filings available on the Company’s website at \nwww.investor.jnj.com/financials/sec-filings\n, as soon as reasonably practicable after having been electronically filed or furnished to the SEC. The Company's SEC filings are also available at the SEC’s website at \nwww.sec.gov\n.\nInvestors and the public should note that the Company also announces information through its press releases and media statements at \nwww.jnj.com/mediacenter\n, \ninvestor.jnj.com\n and\n www.factsabouttalc.com\n. We use these websites to communicate with investors and the public about our products, litigation and other matters. It is possible that the information we post to these websites could be deemed to be material information. Therefore, we encourage investors and others interested in the Company to review the information posted to these websites in conjunction with \nwww.jnj.com\n, the Company's SEC filings, press releases, public conference calls and webcasts.\nIn addition, the Restated Certificate of Incorporation, as amended, Amended and Restated By-Laws, the written charters of the Audit Committee, the Compensation & Benefits Committee, the Nominating & Corporate Governance Committee, the Regulatory Compliance & Sustainability Committee, and the Science & Technology Committee of the Board of Directors, and the Company’s Principles of Corporate Governance, Code of Business Conduct (for employees), Code of Business Conduct & Ethics for Members of the Board of Directors and Executive Officers, and other corporate governance materials are available on the Company's website at \nwww.investor.jnj.com/governance/corporate-governance-overview\n \nand will be provided without charge to any shareholder submitting a written request, as provided above. The information on \nwww.jnj.com\n,\n investor.jnj.com \nand\n www.factsabouttalc.com\n is not, and will not be deemed, a part of this Report or incorporated into any other filings the Company makes with the SEC.\n8",
    "item1a": "Item 1A. Risk factors for additional description of cybersecurity risks and potential related impacts on the Company.\nGovernance - management’s responsibility\nThe Company takes a risk-based approach to cybersecurity and has implemented cybersecurity controls designed to address cybersecurity threats and risks. The \nChief Information Officer (CIO), who is a member of the Company’s Executive Committee, and the Chief Information Security Officer (CISO)\n are responsible for assessing and managing cybersecurity risks, including security incident detection, response, and recovery.\nThe Company’s CISO, in coordination with the CIO, is responsible for leading the Company’s cybersecurity program and management of cybersecurity risk. \nThe current CISO has over twenty-five years of experience in information security, and his background includes technical experience, strategy and architecture focused roles, cyber and threat experience, and various leadership roles.\nGovernance - board oversight\nThe Company’s \nBoard of Directors\n oversees the overall risk management process, including cybersecurity risks, directly and through its committees. The Regulatory Compliance & Sustainability Committee (RCSC) of the board is primarily responsible for oversight of risk from cybersecurity threats and oversees compliance with applicable laws, regulations and Company policies related to, among others, privacy and cybersecurity.\n \nRCSC meetings include discussions of specific risk areas throughout the year including, among others, those relating to cybersecurity. The CISO provides quarterly updates each year to RCSC on cybersecurity matters. These reports include an overview of the cybersecurity threat landscape, key cybersecurity initiatives to improve the Company’s risk posture, changes in the legal and regulatory landscape relative to cybersecurity, and overviews of certain cybersecurity incidents that have occurred within the Company and within the industry.\n2024 Annual Report\n17",
    "item1b": "Item 1B. Unresolved staff comments\nNot applicable.",
    "item1c": "Item 1C. Cybersecurity\nRisk management and strategy\nThe Company has documented cybersecurity policies and standards, assesses risks from cybersecurity threats, and monitors information systems for potential cybersecurity issues. To protect the Company’s information systems from cybersecurity threats, the Company uses various security tools supporting protection, detection, and response capabilities. \nThe Company maintains a cybersecurity incident response plan to help ensure a timely, consistent response to actual or attempted cybersecurity incidents impacting the Company.\n \nThe Company also identifies and assesses third-party risks within the enterprise, and through the Company's use of third-party service providers, across a range of areas including data security and supply chain through a structured third-party risk management program.\n \nThe Company maintains a formal information security training program for all employees that includes training on matters such as phishing and email security best practices. Employees are also required to complete mandatory training on data privacy.\nTo evaluate and enhance its cybersecurity program, the Company periodically utilizes third-party experts to undertake maturity assessments of the Company’s information security program.\nTo date, the Company is not aware of any cybersecurity incident that has had or is reasonably likely to have a material impact on the Company’s business or operations; however, because of the frequently changing attack techniques, along with the increased volume and sophistication of the attacks, there is the potential for the Company to be adversely impacted.\n This impact could result in reputational, competitive, operational or other business harm as well as financial costs and regulatory action. Refer to the risk factor captioned An information security incident, including a cybersecurity breach, could have a negative impact to the Company’s business or reputation in Part I,"
  }
}