{
  "ticker": "JPM",
  "cik": "0000019617",
  "company_name": "JPMORGAN CHASE & CO",
  "filing_date": "2025-02-14",
  "accession": "0000019617-25-000270",
  "primary_doc": "jpm-20241231.htm",
  "item_sections": {
    "item1": "Item 15.\nExhibits, Financial Statement Schedules.\n44-47\nPart I\nItem 1. Business.\nOverview\nJPMorgan Chase & Co. (“JPMorganChase” or the “Firm”, NYSE: JPM), a financial holding company incorporated under Delaware law in 1968, is a leading financial services firm based in the United States of America (“U.S.”), with operations worldwide. JPMorganChase had $4.0 trillion in assets and $344.8 billion in stockholders’ equity as of December 31, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers, predominantly in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally.\nJPMorganChase’s principal bank subsidiary is JPMorgan Chase Bank, National Association (“JPMorgan Chase Bank, N.A.”), a national banking association with U.S. branches in 48 states and Washington, D.C. JPMorganChase’s principal non-bank subsidiary is J.P. Morgan Securities LLC (“J.P. Morgan Securities”), a U.S. broker-dealer. The bank and non-bank subsidiaries of JPMorganChase operate nationally as well as through overseas branches and subsidiaries, representative offices and subsidiary foreign banks. The Firm’s principal operating subsidiaries outside the U.S. are J.P. Morgan Securities plc and J.P. Morgan SE (“JPMSE”), which are subsidiaries of JPMorgan Chase Bank, N.A. and are based in the United Kingdom (“U.K.”) and Germany, respectively.\nThe Firm’s website is www.jpmorganchase.com. JPMorganChase makes available on its website, free of charge, annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K pursuant to Section 13(a) or Section 15(d) of the Securities Exchange Act of 1934, as soon as reasonably practicable after it electronically files or furnishes such material to the U.S. Securities and Exchange Commission (the “SEC”) at www.sec.gov. JPMorganChase makes new and important information about the Firm available on its website at https://www.jpmorganchase.com, including on the Investor Relations section of its website at https://www.jpmorganchase.com/ir. Information on the Firm's website, including documents on the website that are referenced in this Form 10-K, is not incorporated by reference into this Annual Report on Form 10-K for the year ended December 31, 2024 (“2024 Form 10-K” or “Form 10-K”) or the Firm’s other filings with the SEC. \nBusiness segments & Corporate\nEffective in the second quarter of 2024, JPMorganChase reorganized its reportable business segments by combining the former Corporate & Investment Bank and Commercial Banking business segments to form one reportable segment, the Commercial & Investment Bank. As a result of the reorganization, the Firm has three reportable business segments \n– \nConsumer & Community Banking (“CCB”), Commercial & Investment Bank (“CIB”) and Asset & Wealth Management (“AWM”) \n– \nwith the remaining activities in Corporate. The Firm’s consumer business segment is CCB, and the Firm’s wholesale business segments are CIB and AWM.\nA description of the Firm’s reportable business segments and the products and services that they provide to their respective client bases, as well as a description of Corporate activities, is provided in the Management’s discussion and analysis of financial condition and results of operations section of this Form 10-K (“Management’s discussion and analysis” or “MD&A”) under the heading “Business Segment & Corporate Results,” which begins on page 52, and in Note 32. \nCompetition\nJPMorganChase and its subsidiaries and affiliates operate in highly competitive environments. Competitors include other banks, brokerage firms, investment banking companies, merchant banks, hedge funds, commodity trading companies, private equity firms, insurance companies, mutual fund companies, investment managers, credit card companies, mortgage banking companies, trust companies, securities processing companies, automobile financing companies, leasing companies, e-commerce and other internet-based companies, financial technology companies, and other companies engaged in providing similar and new products and services. The Firm’s businesses generally compete on the basis of the quality and variety of the Firm’s products and services, transaction execution, innovation, reputation and price. Competition also varies based on the types of clients, customers, industries and geographies served. With respect to some of its geographies and products, JPMorganChase competes globally; with respect to others, the Firm competes on a national or regional basis. New competitors in the financial services industry continue to emerge, including firms that offer products and services solely through the internet and non-financial companies that offer products and services that disintermediate traditional banking products and services offered by financial services firms such as JPMorganChase.\n1\nPart I\nSupervision and regulation\nThe Firm is subject to extensive and comprehensive regulation under U.S. federal and state laws, as well as the applicable laws of the jurisdictions outside the U.S. in which the Firm does business.  \nFinancial holding company:\nConsolidated supervision\n. JPMorgan Chase & Co. is a bank holding company (“BHC”) and a financial holding company (“FHC”) under U.S. federal law, and is subject to comprehensive consolidated supervision, regulation and examination by the Board of Governors of the Federal Reserve System (the “Federal Reserve”). The Federal Reserve acts as the supervisor of the consolidated operations of BHCs. Certain of JPMorganChase’s subsidiaries are also regulated directly by additional authorities based on the activities or licenses of those subsidiaries.\nJPMorganChase’s national bank subsidiary, JPMorgan Chase Bank, N.A., is supervised and regulated by the Office of the Comptroller of the Currency (“OCC”) and, with respect to certain matters, by the Federal Deposit Insurance Corporation (the “FDIC”).\nJPMorganChase’s U.S. broker-dealers are supervised and regulated by the Securities and Exchange Commission (“SEC”) and the Financial Industry Regulatory Authority (“FINRA”). Subsidiaries of the Firm that engage in certain futures-related and swaps-related activities are supervised and regulated by the Commodity Futures Trading Commission (“CFTC”). J.P. Morgan Securities plc holds a banking license in the U.K. and is regulated by the U.K. Prudential Regulation Authority (the “PRA”) and the U.K. Financial Conduct Authority (“FCA”). \nJPMSE is a Germany-based credit institution jointly regulated by the European Central Bank (“ECB”), the German Financial Supervisory Authority and the German Central Bank, as well as the local regulators in each of the countries in which it operates. The Firm’s other non-U.S. subsidiaries are regulated by the banking, securities, prudential, payments and conduct regulatory authorities, as applicable, in the countries in which they operate. \nPermissible business activities\n. The Bank Holding Company Act restricts BHCs from engaging in business activities other than the business of banking and certain closely-related activities. FHCs are permitted to engage in a broader range of financial activities. The Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible activities if the FHC or any of its depository institution subsidiaries ceases to meet applicable eligibility requirements. The Federal Reserve may also impose corrective capital and/or managerial requirements on the FHC, and if deficiencies are persistent, may require divestiture of the FHC’s depository institutions. If any \ndepository institution controlled by an FHC fails to maintain a satisfactory rating under the Community Reinvestment Act, the Federal Reserve must prohibit the FHC and its subsidiaries from engaging in any new activities other than those permissible for BHCs, or acquiring a company engaged in such activities. \nCapital and liquidity requirements\n. The Federal Reserve establishes capital, liquidity and leverage requirements for JPMorganChase that are generally consistent with the international Basel III capital and liquidity framework and evaluates the Firm’s compliance with those requirements. The OCC establishes similar requirements for JPMorgan Chase Bank, N.A. Certain of the Firm’s non-U.S. subsidiaries and branches are also subject to local capital and liquidity requirements.\nBanking supervisors globally continue to refine and enhance the Basel III capital framework for financial institutions. In July 2023, U.S. banking regulators released a proposal to amend the U.S. risk-based capital framework to incorporate certain elements of the revised international Basel III capital framework. The proposal would significantly revise risk-based capital requirements for banks with assets of $100 billion or more, including the Firm and other U.S. global systemically important banks (\"GSIBs\"). Finalization of the proposal, including the required implementation date, is uncertain. The Firm continues to monitor developments and potential impacts.\nIn the EU and U.K., regulators have finalized the rules implementing their Basel III frameworks. The new rules became effective in the EU beginning January 1, 2025, with market risk aspects delayed until January 1, 2026. In January 2025, the PRA announced that it intends to delay the implementation of the new rules in the U.K. to January 1, 2027. There are certain transitional arrangements applicable in both the EU and U.K. until 2032 and 2030, respectively.\nStress tests\n. As a large BHC, JPMorganChase is subject to supervisory stress testing administered by the Federal Reserve as part of the Federal Reserve’s annual Comprehensive Capital Analysis and Review (“CCAR”) framework. The Firm must conduct annual company-run stress tests and must also submit an annual capital plan to the Federal Reserve, taking into account the results of separate stress tests designed by each of the Firm and the Federal Reserve. The Federal Reserve uses the results under the severely adverse scenario from its supervisory stress test to determine the Firm’s Stress Capital Buffer (“SCB”) requirement for the coming year, which forms part of the Firm’s applicable capital buffers. The Firm is required to file its annual CCAR submission on April 5, 2025. The Federal Reserve will notify the Firm of its indicative SCB requirement by June 30, 2025 and final SCB requirement by August 31, 2025. The Firm’s final \n2\nSCB requirement will become effective on October 1, 2025. The OCC requires JPMorgan Chase Bank, N.A. to perform separate, similar stress tests annually. The Firm publishes each year the results of the annual stress tests for the Firm and JPMorgan Chase Bank, N.A. under the supervisory “severely adverse” scenarios provided by the Federal Reserve and the OCC. In December 2024, the Federal Reserve indicated in a press release that it intends to seek public comment on changes to its stress testing framework. Additionally, there is a pending legal challenge to the manner in which stress testing is administered. Refer to Litigation and regulatory challenges on pages 6-7 for further information.\nRefer to Capital Risk Management on pages 97–107 and Liquidity Risk Management on pages 108–115 for more information.\nEnhanced prudential standards\n. As part of its mandate to identify and monitor risks to the financial stability of the U.S. posed by large banking organizations, the Financial Stability Oversight Council (“FSOC”) recommends prudential standards and reporting requirements to the Federal Reserve for systemically important financial institutions (“SIFIs”), such as JPMorganChase. The Federal Reserve has adopted several rules to implement those heightened prudential standards, including rules relating to risk management and corporate governance of subject BHCs. JPMorganChase is required under these rules to comply with enhanced liquidity and overall risk management standards, including oversight by the board of directors of risk management activities.\nHolding company as a source of strength.\n JPMorgan Chase & Co. is required to serve as a source of financial strength for its depository institution subsidiaries and to commit resources to support those subsidiaries, including when directed to do so by the Federal Reserve. \nRegulation of acquisitions\n. Acquisitions by BHCs and their banks are subject to requirements, limitations and prohibitions established by law and by the Federal Reserve and the OCC. For example, FHCs and BHCs are required to obtain the approval of the Federal Reserve before they acquire more than 5% of the voting shares of an unaffiliated bank. In addition, acquisitions by financial companies are generally prohibited if, as a result of the acquisition, the total liabilities of the financial company would exceed 10% of the total liabilities of all financial companies, as determined under Federal Reserve regulations. Furthermore, for certain acquisitions, the Firm must provide written notice to the Federal Reserve prior to acquiring direct or indirect ownership or control of any voting shares of any company with over $10 billion in assets that is engaged in activities that are “financial in nature.” Moreover, while FHCs may engage in a \nbroader range of activities (including acquisitions) than BHCs, the Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible acquisitions if the FHC or any of its depository institution subsidiaries ceases to meet applicable eligibility requirements.\nOngoing obligations\n. The Firm is subject to a five-year cooperation obligation under an order issued by the CFTC on September 29, 2020, relating to precious metals and U.S. Treasuries markets investigations. The Firm also remains subject to consent orders entered into in March 2024 with the OCC and the Board of Governors of the Federal Reserve System, and a resolution entered into in May 2024 with the CFTC, which relate to the Firm’s processes to inventory trading venues and confirm the completeness of certain data fed to trade surveillance platforms.\nSubsidiary banks: \nThe activities of JPMorgan Chase Bank, N.A., the Firm’s principal subsidiary bank, are limited to those specifically authorized under the National Bank Act and related interpretations of the OCC. The OCC has authority to bring an enforcement action against JPMorgan Chase Bank, N.A. for unsafe or unsound banking practices, which could include limiting JPMorgan Chase Bank, N.A.’s ability to conduct otherwise permissible activities, or imposing corrective capital or managerial requirements on the bank.\nFDIC deposit insurance.\n The FDIC deposit insurance fund provides insurance coverage for certain deposits and is funded through assessments on banks, including JPMorgan Chase Bank, N.A. The FDIC is required to maintain a minimum reserve ratio, which measures the balance of reserves in the deposit insurance fund against an estimate of FDIC-insured deposits, of 1.35%. The reserve ratio is currently below the statutory minimum and, in October 2022, the FDIC adopted a final rule to raise bank assessments and accelerate the time by which the reserve ratio would meet the statutory minimum. As a result, the FDIC has adopted a restoration plan to bring the reserve ratio up to the required 1.35% by September 30, 2028, with a longer-term target of maintaining a reserve ratio of 2%.\nFDIC powers upon a bank insolvency.\n Upon any insolvency of JPMorgan Chase Bank, N.A., the FDIC could be appointed as conservator or receiver under the Federal Deposit Insurance Act. The FDIC has broad powers to transfer assets and liabilities without the approval of the institution’s creditors.  \nPrompt corrective action.\n The Federal Deposit Insurance Corporation Improvement Act of 1991 requires the relevant federal banking regulator to take “prompt corrective action” with respect to a depository institution if that institution does not meet certain \n3\nPart I\ncapital adequacy standards. The Federal Reserve is also authorized to take appropriate action against the parent BHC, such as JPMorgan Chase & Co., based on the undercapitalized status of any bank subsidiary. In certain instances, the BHC would be required to guarantee the performance of the capital restoration plan for its undercapitalized subsidiary. \nHeightened Supervisory Standards.\n In the U.S., the OCC has established guidelines setting forth heightened standards for large banks, including minimum standards for the design and implementation of a risk governance framework for banks. Under these standards, a bank’s risk governance framework must ensure that the bank’s risk profile is easily distinguished and separate from that of its parent BHC for risk management purposes. The bank’s board or risk committee is responsible for approving the bank’s risk governance framework, providing active oversight of the bank’s risk-taking activities, and holding management accountable for adhering to the risk governance framework.\nThe Firm’s banking entities in the EU and the U.K. are subject to supervisory expectations published by the ECB and the PRA, respectively, addressing bank strategy, governance and risk management in the areas of climate change, operational resilience, reliance on IT systems and third-party services, and resilience from macro-financial and geopolitical shocks. \nRestrictions on transactions with affiliates. \nJPMorgan Chase Bank, N.A. and its subsidiaries are subject to restrictions imposed by federal law on extensions of credit to, investments in stock or securities of, and derivatives, securities lending and certain other transactions with, JPMorgan Chase & Co. and certain other affiliates. These restrictions prevent JPMorgan Chase & Co. and other affiliates from borrowing from JPMorgan Chase Bank, N.A. and its subsidiaries unless the loans are secured in specified amounts and comply with certain other requirements. \nDividend restrictions.\n Federal law imposes limitations on the payment of dividends by national banks, such as JPMorgan Chase Bank, N.A. Refer to Note 26 for the amount of dividends that JPMorgan Chase Bank, N.A. could pay, at January 1, 2025, to JPMorganChase without the approval of the banking regulators. The OCC and the Federal Reserve also have authority to prohibit or limit the payment of dividends of a bank subsidiary that they supervise if, in the banking regulator’s opinion, payment of a dividend would constitute an unsafe or unsound practice in light of the financial condition of the bank. \nDepositor preference.\n Under federal law, the claims of a receiver of an insured depositary institution (“IDI”) for administrative expense and the claims of holders of \nU.S. deposit liabilities (including the FDIC and deposits in non-U.S. branches that are dually payable in the U.S. and in a non-U.S. branch) have priority over the claims of other unsecured creditors of the institution, including depositors in non-U.S. branches and public noteholders. \nConsumer supervision and regulation.\n JPMorganChase and JPMorgan Chase Bank, N.A. are subject to supervision and regulation in the U.S. by the Consumer Financial Protection Bureau (“CFPB”) with respect to federal consumer protection laws, including laws relating to fair lending and the prohibition of unfair, deceptive or abusive acts or practices in connection with the offer, sale or provision of consumer financial products and services. The CFPB also has jurisdiction over small business lending activities with respect to fair lending and the Equal Credit Opportunity Act. As part of its regulatory oversight, the CFPB has authority to take enforcement actions against firms that offer certain products and services to consumers using practices that are deemed to be unfair, deceptive or abusive. In March 2024, the CFPB released a final rule which significantly reduces the late payment fees that large credit card issuers, including the Firm, are permitted to charge to customers (the “CFPB Late Fee Rule”). The final rule is currently stayed pending resolution of an industry-led challenge in federal court. Refer to Litigation and regulatory challenges on pages 6-7 for further information.\nIn addition, in October 2024, the CFPB issued a final rule that requires data providers, including banks, to make certain consumer data available to consumers and authorized third parties in electronic form beginning in April 2026 (the “CFPB Data Sharing Rule”). Refer to Litigation and regulatory challenges on pages 6-7 for further information.\nSeparately, in December 2024, the CFPB announced a final rule that would significantly restrict overdraft fees for certain insured depository institutions, including the Firm (the “CFPB Overdraft Rule”). The rule imposes certain requirements on overdraft protections that are similar to those that apply to credit cards, unless the institution prices the overdraft fee at $5 per transaction or the institution’s cost as outlined by the CFPB\n. \nRefer to Litigation and regulatory challenges on pages 6-7 for further information. \nIn October 2023, the Federal Reserve Board proposed to lower the maximum interchange fee that large debit card issuers, including the Firm, would be permitted to receive for a debit card transaction. The proposal would also establish a process for automatically publishing an updated maximum fee amount every other year going forward. \nThe Firm’s consumer activities are also subject to regulation under state \n4\nstatutes which are enforced by the Attorney General or empowered agency of each state.\nIn the U.K., the Firm operates a retail bank through J.P. Morgan Europe Limited (“JPMEL”) and provides retail investment management services through Nutmeg Saving and Investment Limited (“Nutmeg”). JPMEL is regulated by the PRA, and both JPMEL and Nutmeg are regulated by the FCA with respect to their conduct of financial services in the U.K., including obligations relating to the fair treatment of customers. JPMEL is also regulated by the U.K. Payment Systems Regulator with respect to its operation and use of payment systems. In addition, the retail businesses of JPMEL and Nutmeg are subject to U.K. consumer-protection legislation. \nSecurities and broker-dealer regulation: \nThe Firm conducts securities underwriting, dealing and brokerage activities in the U.S. through J.P. Morgan Securities LLC and other non-bank broker-dealer subsidiaries, all of which are subject to regulations of the SEC, FINRA and the New York Stock Exchange, among others. The Firm conducts similar securities activities outside the U.S. subject to local regulatory requirements. In the U.K., those activities are primarily conducted by J.P. Morgan Securities plc and in the EU, those activities are primarily conducted by JPMSE. Broker-dealers are subject to laws and regulations covering all aspects of the securities business, including sales and trading practices, securities offerings, publication of research reports, use of customer funds, the financing of client purchases, capital structure, record-keeping and retention, and the conduct of their directors, officers and employees. Refer to Broker-dealer regulatory capital on page 107 for information concerning the capital of J.P. Morgan Securities LLC, J.P. Morgan Securities plc and JPMSE. In addition, the Firm's sales and trading activities, which are conducted through both bank and non-bank subsidiaries, are subject to laws and regulations relating to market conduct, including prohibitions on manipulative or anti-competitive practices.\nInvestment management regulation: \nThe Firm’s asset and wealth management businesses are subject to significant regulation in jurisdictions around the world relating to, among other things, the safeguarding and management of client assets, offerings of funds and marketing activities. Certain of the Firm’s subsidiaries are registered with, and subject to oversight by, the SEC as investment advisers and broker-dealers. The Firm’s registered investment advisers in the U.S. are subject to the fiduciary and other obligations imposed under the Investment Advisers Act of 1940 and applicable state and federal law. The Firm’s bank fiduciary activities are subject to supervision by the OCC. \nThe Firm’s asset and wealth management businesses continue to be subject to ongoing rule-making and implementation of new regulations and other guidance, including by the SEC and certain U.S. states with respect to enhanced standards of conduct and conflicts of interest. In April 2024, the Department of Labor (“DOL”) finalized a new “fiduciary” rule that would significantly expand the scope for defining who can be deemed investment advice fiduciaries for purposes of retirement plans and individual retirement accounts (“IRAs”) under the Employee Retirement Income Security Act of 1974, as amended (the “Fiduciary Rule”). Among the most significant impacts of the rule and related amendments to prohibited transaction exemptions would be the impact on the fee and compensation practices at financial institutions that offer investment recommendations to retirement clients, including in the context of rollovers from an employer plan to an IRA. The effective date of the Fiduciary Rule has been stayed by two federal courts. Refer to Litigation and regulatory challenges on pages 6-7 for further information. \nDerivatives regulation: \nThe Firm is subject to comprehensive regulation of its derivatives businesses. In the U.S., JPMorgan Chase Bank, N.A., J.P. Morgan Securities LLC and J.P. Morgan Securities plc are registered with the CFTC as “swap dealers”. In addition, JPMorgan Chase Bank, N.A. and J.P. Morgan Securities LLC are registered with the SEC as “security-based swap dealers”. As a result, these entities are subject to a comprehensive regulatory framework applicable to their swap or security-based swap activities, including capital requirements, rules requiring the collateralization of uncleared swaps and security-based swaps, rules regarding segregation of counterparty collateral, business conduct and documentation standards, rules requiring the central clearing of standardized over-the-counter (“OTC”) derivatives, requirements that certain standardized OTC swaps be traded on regulated trading venues, record-keeping and reporting obligations, and anti-fraud and anti-manipulation requirements. Similar requirements have also been established in the European Union (“EU”) under the European Market Infrastructure Regulation (“EMIR”) and the Markets in Financial Instruments Directive (“MiFID II”), as well as in the U.K. and other jurisdictions around the world. \nJ.P. Morgan Securities LLC is also registered with the CFTC as a futures commission merchant and is a member of the National Futures Association. \nData, privacy, cybersecurity and artificial intelligence regulation: \nThe Firm and its subsidiaries are subject to laws, rules and regulations globally concerning data, including data protection, consumer protection, privacy, cybersecurity, artificial intelligence and related \n5\nPart I\nmatters. These laws, rules and regulations are constantly evolving, subject to interpretation, remain a focus of regulators globally, may be enforced by private parties or government bodies, and continue to have a significant impact on all of the Firm’s businesses and operations.\nFor example, the Digital Operational Resilience Act (DORA) mandates that the Firm’s financial services subsidiaries operating in the EU comply with requirements relating to information and communications technology (“ICT”) risk management, reporting, security control testing and ICT third party risks beginning in January 2025. In addition, the EU Artificial Intelligence Act regulates the development and deployment of artificial intelligence systems within the EU, with phased-in requirements that began in February 2025.\nThe Bank Secrecy Act and Economic Sanctions: \nThe Bank Secrecy Act (“BSA”) requires all financial institutions, including banks and securities broker-dealers, to establish a risk-based system of internal controls reasonably designed to prevent money laundering and the financing of terrorism. The BSA includes a variety of record-keeping and reporting requirements, as well as due diligence/know-your-customer documentation requirements. The Firm is also subject to the regulations and economic sanctions programs administered and enforced by the U.S. Treasury’s Office of Foreign Assets Control (“OFAC”) and EU and U.K. authorities which target entities or individuals that are, or are located in countries that are, involved in activities including terrorism, hostilities, embezzlement or human rights violations. The Firm is also subject to economic sanctions laws, rules and regulations in other jurisdictions in which it operates, including those that conflict with or prohibit a firm such as JPMorganChase from complying with certain laws, rules and regulations to which it is otherwise subject.\nAnti-Corruption: \nThe Firm is subject to laws and regulations relating to corrupt and illegal payments to government officials and others in the jurisdictions in which it operates, including the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act.\nCompensation practices: \nThe Firm’s compensation practices are subject to oversight by the Federal Reserve, as well as other agencies. The Federal Reserve has jointly issued guidance with the FDIC and the OCC that is designed to ensure that incentive compensation paid by banking organizations does not encourage imprudent risk-taking that threatens the organizations’ safety and soundness. The Financial Stability Board (“FSB”) has also established standards covering compensation principles for banks. The Firm’s compensation \npractices are also subject to regulation and oversight by regulators in other jurisdictions, notably the Fifth Capital Requirements Directive (“CRD V”), as implemented in the EU and as largely adopted in the U.K, which includes compensation-related provisions. The European Banking Authority has instituted guidelines on compensation policies including under CRD V which in certain countries (such as Germany) are implemented or supplemented by local regulations or guidelines. The U.K. regulators have also instituted regulations and guidelines on compensation policies, which diverge in certain areas from EU rules. The Firm expects that the implementation of regulatory guidelines regarding compensation in the U.S. and other countries will continue to evolve, and may affect the manner in which the Firm structures its compensation programs and practices.\nSustainability:\nPolicymakers in the U.K. and the EU have continued to implement and enhance sustainability-related initiatives and disclosure requirements. The Corporate Sustainability Reporting Directive (“CSRD”) will replace and significantly expand the scope and content of certain EU ESG reporting requirements, with phased-in requirements expected to start with fiscal year 2024. The implementation of CSRD into local law has been delayed in a number of member states, including in Germany, and the Firm continues to monitor developments and potential impacts. In addition, in July 2024, the EU enacted the Corporate Sustainability Due Diligence Directive (“CSDDD”), which provides for phased-in requirements starting in 2027. The CSDDD sets mandatory due diligence obligations for companies to address actual and potential human rights violations and environmental adverse impacts stemming from their own operations and business relationships, including the activities of certain companies with which they have established business relationships and also requires the adoption of company-specific climate-related transition plans. Both the CSRD and CSDDD will impact certain of the Firm’s EU and non-EU entities.\nLitigation and regulatory challenges:\nTrade organizations representing the financial services industry and others have filed lawsuits challenging various laws, rules and regulations that, if enacted, adopted or implemented, could have significant adverse impacts on the results of operations or compliance costs of financial institutions, including the Firm. These matters include:\n•\nStress tests: \nThe Bank Policy Institute (“BPI”), the U.S. Chamber of Commerce and other trade organizations filed an action against the Federal Reserve in the United States District Court for the Southern District of Ohio in December 2024 challenging the manner in which the annual stress testing process is administered.\n6\n•\nCFPB Late Fee Rule\n: This rule has been stayed pending resolution of an action challenging the rule filed against the CFPB in the United States District Court for the Northern District of Texas in March 2024 by trade organizations including the American Bankers Association and the Consumer Bankers Association.\n•\nCFPB Data Sharing Rule\n: The BPI, the Kentucky Bankers Association and other organizations filed an action against the CFPB in the United States District Court for the Eastern District of Kentucky in October 2024 challenging key aspects of this rule.\n•\nCFPB Overdraft Rule\n: An action filed by trade organizations led by the Mississippi Bankers Association against the CFPB in the United States District Court for the Southern District of Mississippi in December 2024 seeks a preliminary injunction to stay the October 1, 2025 effective date of this rule. The CFPB has consented in part to stay the effective date of the rule by 90 days and to temporarily stay the litigation. The preliminary injunction and the stay of litigation are pending court approval.\n•\nFiduciary Rule\n: Trade organizations including the Federation of Americans for Consumer Choice and the American Council of Life Insurers filed actions against the DOL seeking to enjoin this rule, and in July 2024, the effective date of the rule was stayed by two United States District Courts.\n7\nPart I\nHuman capital \nJPMorganChase believes that its long-term growth and success depend on its ability to attract, develop and retain talented employees and foster an inclusive work environment. The information provided below relates to JPMorganChase’s full-time and part-time employees and does not include the Firm’s contractors.\nGlobal workforce\nAs of December 31, 2024, JPMorganChase had 317,233 employees globally, an increase of 7,307 employees from the prior year. The increase was primarily attributable to growth in the number of front office and technology employees. JPMorganChase’s employees are located in 66 countries, with 59% of the Firm’s employees located in the U.S. The following table presents the distribution of the Firm’s global workforce by region and by line of business (“LOB”) and Corporate as of December 31, 2024:\nEmployee Breakdown by Region\nEmployee Breakdown by LOB and Corporate\nRegion\nEmployees\nLOB\nEmployees\nNorth America\n187,179\nCCB\n144,989\nAsia-Pacific\n93,941\nCIB\n93,231\nEurope/Middle East/Africa \n30,729\nAWM\n29,403\nLatin America/Caribbean\n5,384\nCorporate\n49,610\nTotal Firm\n317,233\nTotal Firm\n317,233\nWorkforce composition\nThe following table presents information based on voluntary self-identifications by the Firm’s employees, including members of the Firm’s Operating Committee and other senior level employees, as well as members of the Board of Directors, as of December 31, 2024. Information on race/ethnicity of employees is categorized based on Equal Employment Opportunity (“EEO”) classifications and is presented for U.S. employees who self-identified, and information on gender is presented for global employees who self-identified. Information on race/ethnicity and gender for members of the Operating Committee and the Board of Directors reflects all such members. Information on LGBTQ+ and veteran statuses is based on all U.S. employees, and all members of the Operating Committee and the Board of Directors. Information on disability status is based on all U.S. employees and all members of the Operating Committee. \nDecember 31, 2024\nTotal\nemployees\nSenior level employees\n(e)\nOperating Committee\nBoard of Directors\n(f)\nRace/Ethnicity\n(a)\n:\nWhite\n43 \n%\n74 \n%\n86 \n%\n80 \n%\nHispanic\n21 \n%\n6 \n%\n7 \n%\n— \nAsian\n20 \n%\n14 \n%\n7 \n%\n— \nBlack\n13 \n%\n5 \n%\n— \n20 \n%\nOther\n(b)\n3 \n%\n1 \n%\n— \n— \nGender\n(c)\n:\nMen\n51 \n%\n71 \n%\n53 \n%\n50 \n%\nWomen\n49 \n%\n29 \n%\n47 \n%\n50 \n%\nLGBTQ+\n(d)\n4 \n%\n2 \n%\n7 \n%\n— \nMilitary veterans\n(d)\n3 \n%\n2 \n%\n— \n10 \n%\nPeople with disabilities\n(d)\n5 \n%\n3 \n%\n— \n— \n(g)\n(a)\nBased on EEO metrics. Presented as a percentage of the respective populations who self-identified race/ethnicity, which was 97% and 95% of the Firm’s total U.S.-based employees and U.S.-based senior level employees, respectively, and all members of the Operating Committee and the Board of Directors. Information for the Operating Committee includes one member who is based outside of the U.S.\n(b)\nOther includes American Indian or Alaskan Native, Native Hawaiian or Other Pacific Islander, and two or more races/ethnicities.\n(c)\nPresented as a percentage of the respective populations who self-identified gender, which was 99% of each of the Firm’s total global employees and senior level employees, and all members of the Operating Committee and the Board of Directors.\n(d)\nPresented as a percentage of total U.S.-based employees, total U.S.-based senior level employees, all members of the Operating Committee, and all members of the Board of Directors, respectively. \n(e)\nSenior level employees represents employees with the titles of Managing Director and above.\n(f)\nExcludes Brad D. Smith and Michele G. Buck, who were elected to the Firm’s Board of Directors, effective January 21, 2025 and March 17, 2025, respectively.\n(g)\nThe Firm has not asked members of the Board of Directors to self-identify disability status.\n8\nAttracting and retaining employees\nThe goal of JPMorganChase’s recruitment efforts is to attract and hire highly qualified candidates in all roles and at all career levels. The Firm’s hiring practices focus on the skills and qualifications of a candidate relative to the job requirements.\nThe Firm strives to provide both external candidates and internal employees who are seeking a different role with challenging and stimulating career opportunities. These opportunities range from internship training programs for students to entry-level, management and executive careers. During 2024, approximately 56% of the Firm’s employment opportunities were filled by external candidates, with the remainder filled by existing employees. \nDeveloping employees\nJPMorganChase supports the professional development and career growth of its employees. The Firm requires that its employees, including new hires, complete a training curriculum which covers, among other topics, compliance with the Firm’s Code of Conduct and information concerning Firm policies and standards, including those relating to cybersecurity. In addition, the Firm offers extensive voluntary training programs and educational resources to all employees covering a broad variety of topics such as leadership and management, artificial intelligence, data literacy and operational and professional skills. Leadership Edge, the Firm’s global leadership and management development center of excellence, is focused on creating one Firmwide leadership culture.\nCompensation and benefits\nThe Firm provides market-competitive compensation and benefits programs. JPMorganChase’s compensation philosophy includes guiding principles that drive compensation-related decisions across the Firm, and includes: pay-for-performance practices designed to attract and retain top talent; responsiveness and alignment with shareholder interests; and reinforcement of the Firm’s culture. The Firm follows a disciplined and balanced compensation framework, including the integration of risk, controls and conduct considerations. The Firm’s compensation review processes seek to ensure that the Firm’s employees are paid fairly and competitively for the work they do.\nJPMorganChase offers extensive benefits and wellness packages to support employees and their families, which vary depending on location and include healthcare coverage, retirement benefits, life and disability insurance, access to on-site health and wellness centers, counseling and resources related to mental health, time away policies, child care access and support, tuition assistance, and financial coaching.\n9\nPart I",
    "item1a": "Item 1A. Risk Factors. \nThe following discussion sets forth the material risk factors that could affect JPMorganChase’s financial condition and operations. Readers should not consider any descriptions of these factors to be a complete set of all potential risks that could affect the Firm. Any of the risk factors discussed below could by itself, or combined with other factors, materially and adversely affect JPMorganChase’s business, results of operations, financial condition, capital position, liquidity, competitive position or reputation, including by materially increasing expenses or decreasing revenues, which could result in material losses or a decrease in earnings.\nSummary\nThe principal risk factors that could adversely affect JPMorganChase’s business, results of operations, financial condition, capital position, liquidity, competitive position or reputation include:\n•\nRegulatory\n risks, including the impact that applicable laws, rules and regulations in the highly-regulated and supervised financial services industry, as well as changes to or in the application, interpretation or enforcement of those laws, rules and regulations, can have on JPMorganChase’s business and operations, including JPMorganChase incurring additional costs associated with assessments, levies or other governmental charges; the ways in which differences in financial services regulation and supervision in different jurisdictions or with respect to certain competitors can negatively impact JPMorganChase’s business; the ways in which governmental policies that discourage or penalize business relationships with clients in certain industries, or require specific business practices, can negatively affect JPMorganChase's businesses; the penalties and collateral consequences, and higher compliance and operational costs, that JPMorganChase may incur when resolving a regulatory investigation; the ways in which less predictable legal and regulatory frameworks in certain jurisdictions can negatively impact JPMorganChase’s operations and financial results; and the losses that security holders and other unsecured creditors will absorb if JPMorganChase were to enter into a resolution.\n•\nPolitical\n risks, including the potential negative effects on JPMorganChase’s businesses due to economic uncertainty or instability caused by political developments.\n•\nMarket\n risks, including the effects that economic and market events and conditions, political developments, changes in interest rates and credit spreads, and market fluctuations can have on JPMorganChase’s consumer and wholesale businesses and its investment and market-making \npositions and on JPMorganChase’s earnings and its liquidity and capital levels.\n•\nCredit\n risks, including potential negative effects from adverse changes in the financial condition of clients, customers, counterparties, custodians and central counterparties; the potential for losses due to declines in the value of collateral in stressed market conditions; and potential negative impacts from concentrations of credit risk with respect to clients, customers, counterparties and other market participants.\n•\nLiquidity\n risks, including the risk that JPMorganChase’s liquidity could be impaired by market-wide illiquidity or disruption, unforeseen liquidity or capital requirements, the inability to sell assets, default by a significant market participant, unanticipated outflows of cash or collateral, or lack of market or customer confidence in JPMorganChase; the dependence of JPMorgan Chase & Co. on the cash flows of its subsidiaries; and the potential adverse effects that any downgrade in any of JPMorganChase’s credit ratings may have on its liquidity and cost of funding.\n•\nCapital\n risks, including the risk that any failure by or inability of JPMorganChase to maintain the required level and composition of capital, or unfavorable changes in applicable capital requirements, could limit JPMorganChase’s ability to distribute capital to shareholders or to support its business activities.\n•\nOperational \nrisks, including risks associated with JPMorganChase’s dependence on its operational systems and its employees, as well as the systems and employees of third parties, market participants and service providers; the potential negative effects of failing to identify and address operational risks related to the failure of internal or external operational systems, the introduction of or changes to products, services and delivery platforms or the adoption of new technologies; risks related to safeguarding personal information; the harm that could be caused by a successful cyber attack affecting JPMorganChase or by other extraordinary events; risks associated with JPMorganChase’s risk management framework and control environment, its models and estimations and associated judgments used in its stress testing and financial statements, and controls over disclosure and financial reporting; and potential adverse effects of failing to comply with applicable standards for the oversight of vendors and other service providers.\n•\nStrategic\n risks, including the damage to JPMorganChase’s competitive standing and results that could occur if management fails to develop and execute effective business strategies; risks associated with the significant and increasing competition that JPMorganChase faces; and the potential adverse impacts of climate change on the \n10\neffectiveness of JPMorganChase’s existing business strategies with respect to its operations, clients and customers.\n•\nConduct\n risks, including the negative impact that can result from the actions or misconduct of employees, including any failure of employees to conduct themselves in accordance with JPMorganChase’s expectations, policies and practices.\n•\nReputation\n risks, including the potential adverse effects on JPMorganChase’s relationships with its clients, customers, shareholders, regulators and other stakeholders that could arise from employee misconduct, security breaches, inadequate risk management, compliance or operational failures, litigation and regulatory investigations, failure to satisfy expectations concerning environmental, social and governance concerns, failure to effectively manage conflicts of interest or to satisfy fiduciary obligations, or other factors that could damage JPMorganChase’s reputation.\n•\nCountry\n risks, including potential impacts on JPMorganChase’s businesses from an outbreak or escalation of hostilities between countries or within a country or region; and the potential adverse effects of local economic, political, regulatory and social factors on JPMorganChase’s business and revenues in certain countries in which it operates.\n•\nPeople\n risks, including the criticality of attracting and retaining qualified employees; and the potential adverse effects of unfavorable changes in immigration or travel policies on JPMorganChase’s workforce.\n•\nLegal\n risks, including those relating to litigation and regulatory and government investigations.\nThe above summary is subject in its entirety to the discussion of the risk factors set forth below\n.\nRegulatory\nJPMorganChase’s businesses are highly regulated, and the laws, rules and regulations that apply to JPMorganChase have a significant impact on its business and operations.\nJPMorganChase is a financial services firm with operations worldwide. JPMorganChase must comply with the laws, rules and regulations that apply to its operations in all of the jurisdictions around the world in which it does business, and financial services firms such as JPMorganChase are subject to extensive and constantly-evolving regulation and supervision.\nThe regulation and supervision of JPMorganChase significantly affects the way that it conducts its business and structures its operations, and JPMorganChase could be required to make changes to its business and operations in response to supervisory expectations or decisions or to new or changed laws, \nrules and regulations. These types of developments could result in JPMorganChase incurring additional costs or experiencing a reduction in revenues to comply with applicable laws, rules and regulations, which could reduce its profitability. Furthermore, JPMorganChase’s entry into or acquisition of a new business or an increase in its principal investments may require JPMorganChase to comply with additional laws, rules, and regulations.\nAdditionally, JPMorganChase’s ability to execute certain business initiatives could become more challenging due to increased regulation in the financial services industry, such as limitations on late payment, overdraft and interchange fees. This could adversely affect JPMorganChase’s earnings from its consumer businesses, prompting the reevaluation or adjustment of certain businesses or product offerings, as well as the reallocation of resources and incurrence of restructuring costs, which could impact revenue and profitability in the affected lines of business.\nIn response to new and existing laws, rules and regulations and expanded supervision, JPMorganChase has in the past been and could in the future be, required to:\n•\nlimit the products and services that it offers\n•\nreduce the liquidity that it can provide through its market-making activities\n•\nrefrain from engaging in business opportunities that it might otherwise pursue\n•\npay higher taxes (including as part of any minimum global tax regime), assessments, levies or other governmental charges, including in connection with the resolution of tax examinations\n•\nincur losses, including with respect to fraudulent transactions perpetrated against its customers\n•\ndispose of certain assets, and do so at times or prices that are disadvantageous\n•\nimpose restrictions on certain business activities, or\n•\nincrease the prices that it charges for products and services, which could reduce the demand for them.\nAny failure by JPMorganChase to comply with the laws, rules and regulations to which it is subject could result in:\n•\nincreased regulatory and supervisory scrutiny\n•\nregulatory and governmental enforcement actions\n•\nthe imposition of fines, penalties or other sanctions\n•\nincreased exposure to litigation, or\n•\nharm to its reputation.\n11\nPart I\nDifferences and inconsistencies in financial services regulation and supervision can negatively impact JPMorganChase’s businesses, operations and financial results.\nThe content and application of laws, rules and regulations affecting financial services firms can vary according to factors such as the size of the firm, the jurisdiction in which it is organized or operates, and other criteria. For example:\n•\nlarger firms such as JPMorganChase are often subject to more stringent supervision, regulation and regulatory scrutiny\n•\nfinancial technology companies and other non-traditional competitors may not be subject to banking regulation, or may be supervised by a national or state regulatory agency that does not have the same resources or regulatory priorities as the regulatory agencies that supervise more diversified financial services firms, or \n•\nthe financial services regulatory and supervisory framework in a particular jurisdiction may favor financial institutions that are based in that jurisdiction.\nThese types of differences in the regulatory and supervisory framework can result in JPMorganChase losing market share to competitors that are less regulated or not subject to regulation, especially with respect to unregulated financial products.\nThere can also be significant differences in the ways that similar regulatory initiatives affecting the financial services industry are implemented in the U.S. and in other countries and regions in which JPMorganChase does business. For example, when adopting rules that are intended to implement a global regulatory or supervisory standard, a national regulator may introduce additional or more restrictive requirements, which can create competitive disadvantages for financial services firms, such as JPMorganChase, that may be subject to those enhanced regulations.\nIn addition, certain national and multi-national bodies and governmental agencies outside the U.S. have adopted laws, rules or regulations that may conflict with or prohibit JPMorganChase from complying with laws, rules and regulations to which it is otherwise subject, creating conflict of law issues that also increase its risk of non-compliance in those jurisdictions.\nLegislative and regulatory initiatives outside the U.S. have required and could in the future require JPMorganChase to make significant modifications to its operations and legal entity structure in the relevant countries or regions in order to comply with those requirements. These include laws, rules and regulations that have been adopted or proposed, as well as regulatory expectations, relating to:\n•\nthe establishment of locally-based intermediate holding companies or operating subsidiaries\n•\nrequirements to maintain minimum amounts of capital or liquidity in locally-based subsidiaries\n•\nthe implementation of processes within locally-based subsidiaries to comply with local regulatory requirements or expectations\n•\nthe separation (or “ring fencing”) of core banking products and services from markets activities\n•\nrequirements for the orderly resolution of financial institutions\n•\nrequirements for executing or settling transactions on exchanges or through central counterparties (“CCPs”), or for depositing funds with other financial institutions or clearing and settlement systems\n•\nposition limits and reporting rules for derivatives\n•\ngovernance and accountability regimes\n•\nconduct of business and control requirements, and\n•\nrestrictions on compensation.\nThese types of differences, inconsistencies and conflicts in financial services regulation have required and could in the future require JPMorganChase to:\n•\ndivest assets or restructure its operations\n•\nmaintain higher levels of capital and liquidity, or absorb increased capital and liquidity costs \n•\nincur higher operational and compliance costs \n•\nchange the prices that it charges for its products and services \n•\ncurtail the products and services that it offers to its customers and clients\n•\ncurtail other business opportunities, including acquisitions or principal investments, that it otherwise would have pursued\n•\nbecome subject to regulatory fines, penalties or other sanctions, or\n•\nincur higher costs for complying with different legal and regulatory frameworks. \nAny or all of these factors could harm JPMorganChase’s ability to compete against other firms that are not subject to the same laws, rules and regulations or supervisory oversight, or harm JPMorganChase’s businesses, results of operations and profitability.\nResolving regulatory investigations can subject JPMorganChase to significant penalties and collateral consequences, and could result in higher compliance costs or restrictions on its operations.\nJPMorganChase is subject to heightened oversight and scrutiny from regulatory authorities in many jurisdictions. JPMorganChase has paid significant fines, provided other monetary relief, incurred other \n12\npenalties and experienced other repercussions in connection with resolving investigations and enforcement actions by governmental agencies. JPMorganChase could become subject to similar regulatory or governmental resolutions or other actions in the future, and addressing the requirements of any such resolutions or actions could result in JPMorganChase incurring higher operational and compliance costs, including devoting substantial resources to the required remediation or needing to comply with other restrictions. \nIn connection with resolving specific regulatory investigations or enforcement actions, certain regulators have required JPMorganChase and other financial institutions to admit wrongdoing with respect to the activities that gave rise to the resolution. These types of admissions can lead to:\n•\ngreater exposure in litigation\n•\ndamage to JPMorganChase’s reputation\n•\ndisqualification from doing business with certain clients or customers, or in specific jurisdictions, or\n•\nother direct and indirect adverse effects.\nFurthermore, government officials in the U.S. and other countries have demonstrated a willingness to bring criminal actions against financial institutions and have required that institutions plead guilty to criminal offenses or admit other wrongdoing in connection with resolving regulatory investigations or enforcement actions. Resolutions of this type can have significant collateral consequences for the subject financial institution, including:\n•\nloss of clients, customers and business\n•\nrestrictions on offering certain products or services, and \n•\nlosing permission to operate certain businesses, either temporarily or permanently.\nJPMorganChase expects that: \n•\nit and other financial services firms will continue to be subject to heightened regulatory scrutiny and governmental investigations and enforcement actions\n•\ngovernmental authorities will continue to require that financial institutions be penalized for actual or deemed violations of law with formal and punitive enforcement actions, including the imposition of significant monetary and other sanctions, rather than resolving these matters through informal supervisory actions, and  \n•\ngovernmental authorities will be more likely to pursue formal enforcement actions and resolutions against JPMorganChase to the extent that it has previously been subject to other governmental investigations or enforcement actions.\nIf JPMorganChase fails to meet the requirements of any resolution of a governmental investigation or enforcement action, or to maintain risk and control processes that meet the heightened standards and expectations of its regulators, it could be required to, among other things:\n•\nenter into further resolutions of investigations or enforcement actions\n•\npay additional regulatory penalties or enter into judgments, or\n•\naccept material regulatory restrictions on, or changes in the management of, its businesses.\nIn these circumstances, JPMorganChase could also become subject to other sanctions, or to prosecution or civil litigation with respect to the conduct that gave rise to an investigation or enforcement action. In addition, JPMorganChase can be subject to higher costs or requests for additional capital in connection with the resolution of governmental investigations and enforcement actions involving newly-acquired businesses, companies in which JPMorganChase has made principal investments, parties to joint ventures with JPMorganChase, and vendors with which JPMorganChase does business.\nJPMorganChase’s operations and financial results can be negatively impacted in jurisdictions with less predictable legal and regulatory frameworks\n.\nJPMorganChase conducts existing and new business in certain countries, states, municipalities, territories and other jurisdictions in which the application of the rule of law is inconsistent, extralegal or less predictable, including with respect to:\n•\nthe absence of a statutory or regulatory basis or guidance for engaging in specific types of business or transactions\n•\nconflicting or ambiguous laws, rules, regulations and judicial orders, or the inconsistent application or interpretation of existing laws, rules, regulations and judicial precedents\n•\nactions by or at the direction of government officials or agencies\n•\nuncertainty concerning the enforceability of intellectual property rights or contractual or other obligations\n•\ndifficulty in competing in economies in which the government controls or protects all or a portion of the local economy or specific businesses, or where graft or corruption may be pervasive \n•\nthe threat of regulatory investigations, civil litigations or criminal prosecutions that are arbitrary or otherwise contrary to established legal principles in other parts of the world, and  \n13\nPart I\n•\nthe termination of licenses required to operate in the local market or the suspension of business relationships with governmental bodies.\nIf the application of the laws, rules, regulations and judicial precedents in any jurisdiction is susceptible to producing outcomes that are inconsistent, unexpected or contrary to established legal principles, this can create a more difficult environment in which JPMorganChase conducts its business and could negatively affect JPMorganChase’s operations and reduce its earnings with respect to that jurisdiction.  For example, JPMorganChase has faced actual and threatened litigation in Russia with respect to payments that JPMorganChase cannot make under, and is contractually excused from paying as a result of, relevant economic sanctions laws. That litigation has also resulted in the seizure of assets. In addition, conducting business in jurisdictions with less predictable legal and regulatory frameworks could require JPMorganChase to devote significant additional resources to understanding local laws, rules and regulations, as well as structuring its operations to comply with local laws, rules and regulations and implementing and administering related internal policies and procedures.\nThere can be no assurance that JPMorganChase will always be successful in its efforts to fully understand and to conduct its business in compliance with the laws, rules and regulations of all of the jurisdictions in which it operates, and the risk of non-compliance, or of interference with JPMorganChase's businesses, can be greater in jurisdictions that have less predictable legal and regulatory frameworks.\nJPMorganChase's businesses may be negatively impacted by governmental policies that either discourage or penalize business with certain industries or require specific business practices.\nJPMorganChase's businesses and results of operations may be adversely affected by actions or initiatives by national, state or local governmental authorities that:\n•\nseek to discourage financial institutions from doing business with companies engaged in certain industries, or conversely, to penalize financial institutions that elect not to do business with such companies, or\n•\nmandate specific business practices that companies operating in the relevant jurisdiction must adopt.\nBecause governmental policies in one jurisdiction may differ or conflict with those in other jurisdictions, JPMorganChase may face negative consequences regardless of the course of action it takes or elects not to take, including:\n•\nrestrictions or prohibitions on doing business within a particular jurisdiction, or with governmental entities in a jurisdiction\n•\nthe threat of enforcement actions, including under antitrust or other anti-competition laws, rules and regulations, and\n•\nharm to its reputation arising from public criticism, including from politicians, activists and other stakeholders.\nJPMorganChase has been prohibited from engaging in certain business activities in specific jurisdictions as a result of these types of governmental actions, and there is no assurance that it will not face similar restrictions on its business and operations in the future.\nRequirements for the orderly resolution of JPMorganChase could result in JPMorganChase having to restructure or reorganize its businesses and could increase its funding or operational costs or curtail its businesses.\nJPMorganChase is required under Federal Reserve and FDIC rules to prepare and submit periodically to those agencies a detailed plan for rapid and orderly resolution in bankruptcy, without extraordinary government support, in the event of material financial distress or failure. The evaluation of JPMorganChase’s resolution plan by these agencies may change, and the requirements for resolution plans may be modified from time to time. Any such determinations or modifications could result in JPMorganChase needing to make changes to its legal entity structure or to certain internal or external activities, which could increase its funding or operational costs, or hamper its ability to serve clients and customers.\nIf the Federal Reserve and the FDIC were both to determine that a resolution plan submitted by JPMorganChase has deficiencies, they could jointly impose more stringent capital, leverage or liquidity requirements or restrictions on JPMorganChase’s growth, activities or operations. The agencies could also require that JPMorganChase restructure, reorganize or divest assets or businesses in ways that could materially and adversely affect JPMorganChase’s operations and strategy. \nHolders of JPMorgan Chase & Co.’s debt and equity securities will absorb losses if it were to enter into a resolution.\nFederal Reserve rules require that JPMorgan Chase & Co. (the “Parent Company”) maintain minimum levels of unsecured external long-term debt and other loss-absorbing capacity with specific terms (“eligible LTD”) for purposes of recapitalizing JPMorganChase’s operating subsidiaries if the Parent Company were to enter into a resolution either: \n•\nin a bankruptcy proceeding under Chapter 11 of the U.S. Bankruptcy Code, or  \n•\nin a receivership administered by the FDIC under Title II of the Dodd-Frank Act (“Title II”).  \n14\nIf the Parent Company were to enter into a resolution, holders of eligible LTD, other unsecured creditors and holders of equity securities of the Parent Company will absorb the losses of the Parent Company and its subsidiaries. \nThe preferred “single point of entry” strategy under JPMorganChase’s resolution plan contemplates that the Parent Company would enter bankruptcy proceedings and JPMorganChase’s material subsidiaries would be recapitalized, as needed, so that they could continue normal operations or subsequently be divested or wound down in an orderly manner. As a result, the Parent Company’s losses and any losses incurred by its subsidiaries would be imposed first on holders of the Parent Company’s equity securities and thereafter on its unsecured creditors, including holders of eligible LTD. Claims of the Parent Company's shareholders and unsecured creditors would have a junior position to the claims of creditors of JPMorganChase’s subsidiaries and to the claims of priority (as determined by statute) and secured creditors of the Parent Company.   \nAccordingly, in a resolution of the Parent Company in bankruptcy, unsecured creditors of the Parent Company, including holders of eligible LTD of the Parent Company, would realize value only to the extent available to the Parent Company as a shareholder of JPMorgan Chase Bank, N.A. and its other subsidiaries, and only after any claims of priority and secured creditors of the Parent Company have been fully repaid. \nThe FDIC has similarly indicated that a single point of entry recapitalization model would be its expected strategy to resolve a systemically important financial institution, such as the Parent Company, under Title II. However, the FDIC has not formally adopted or committed to any specific resolution strategy. \nIf the Parent Company were to approach, or enter into, a resolution, none of the Parent Company, the Federal Reserve or the FDIC is obligated to follow JPMorganChase’s preferred resolution strategy, and losses to unsecured creditors of the Parent Company, including holders of eligible LTD, and to holders of equity securities of the Parent Company, under whatever strategy is ultimately followed, could be greater than they might have been under JPMorganChase’s preferred strategy.  \nPolitical\nEconomic uncertainty or instability caused by political and geopolitical developments can negatively impact JPMorganChase’s businesses.\nPolitical developments in the U.S. and other countries can cause uncertainty in the economic environment and market conditions in which JPMorganChase operates its businesses. Certain governmental policy initiatives, as well as heightened geopolitical tensions, \ncould significantly affect U.S. and global economic growth and cause higher volatility in the financial markets, including:\n•\nmonetary policies and actions taken by the Federal Reserve and other central banks or governmental authorities, including changes in interest rate levels and any sustained large-scale asset purchases or any suspension or reversal of those actions\n•\nfiscal policies, including with respect to taxation and spending\n•\nisolationist foreign policies\n•\neconomic or financial sanctions\n•\nthe implementation of tariffs and other protectionist trade policies\n•\nchanges to immigration policies, or\n•\nactions that the government takes or fails to take in response to the effects of health emergencies, the spread of infectious diseases, epidemics or pandemics.\nThese types of political developments, and uncertainty about the possible outcomes of these developments, could:\n•\nerode investor or consumer confidence in the U.S. economy and financial markets, which could potentially undermine the status of the U.S. dollar as a safe haven currency\n•\nprovoke retaliatory countermeasures by other countries and otherwise heighten tensions in regulatory, enforcement or diplomatic relations\n•\nincrease the risk of targeted cyber attacks\n•\nincrease concerns about whether the U.S. government will be funded, and its outstanding debt serviced, at any particular time\n•\nresult in periodic shutdowns of the U.S. government \n•\ninfluence investor perceptions concerning government support of certain sectors of the economy or the economy as a whole\n•\ninfluence monetary policy actions of the Federal Reserve to moderate the economic impact of political developments, including decisions on interest rate levels and asset purchases and sales\n•\nadversely affect the financial condition or credit ratings of clients and counterparties with which JPMorganChase does business, or\n•\ncause JPMorganChase to refrain from engaging in business opportunities that it might otherwise pursue.\nThese factors could lead to:\n•\nslower growth rates, rising inflation or recession\n•\ndisruptions in labor markets\n•\ngreater market volatility\n15\nPart I\n•\na contraction of available credit and the widening of credit spreads\n•\nU.S. dollar currency fluctuations\n•\nlower investments in a particular country or sector of the economy\n•\nlarge-scale sales of government debt and other debt and equity securities\n•\nreduced commercial activity among trading partners or disruptions to supply chains, or\n•\nthe possible departure of a country from, or the dissolution or formation of, a political or economic alliance or treaty.\nUnder certain circumstances, such as geopolitically challenging situations in regions like Russia, the Middle East and China, these various risks could become highly correlated or combine in unprecedented ways.\nAny of these potential outcomes could cause JPMorganChase to suffer losses on its market-making positions or in its investment portfolio, reduce its liquidity and capital levels, increase the allowance for credit losses or lead to higher net charge-offs, hamper its ability to deliver products and services to its clients and customers, and weaken its results of operations and financial condition or credit rating.\nMarket\nEconomic and market events and conditions can materially affect JPMorganChase’s businesses and investment and market-making positions.\nJPMorganChase’s results of operations can be negatively affected by adverse changes in any of the following:\n•\ninvestor, consumer and business sentiment\n•\nevents that reduce confidence in the financial markets\n•\ninflation, deflation or recession\n•\nhigh unemployment or, conversely, a tightening labor market\n•\nthe availability and cost of capital, liquidity and credit\n•\nlevels and volatility of interest rates, credit spreads and market prices for currencies, debt and equity securities and commodities, as well as the duration of any such changes\n•\nthe economic effects of an outbreak or escalation of war, hostilities, terrorism or other geopolitical instabilities, cyber attacks, climate change, natural disasters, severe weather conditions, health emergencies, the spread of infectious diseases, epidemics or pandemics or other extraordinary events beyond JPMorganChase’s control, and\n•\nthe state of the U.S. and global economies.\nAll of these are affected by global economic, market and political events and conditions, including monetary policies and actions taken by central banks or other governmental authorities, as well as by the regulatory environment.\nIn addition, JPMorganChase’s investment portfolio and market-making businesses can suffer losses due to unanticipated market events, including:\n•\nsevere declines in asset values\n•\nunexpected credit events\n•\nunforeseen events or conditions that may cause previously uncorrelated factors to become correlated (and vice versa)\n•\nthe inability to effectively hedge risks related to market-making and investment portfolio positions, or\n•\nother market risks that may not have been appropriately taken into account in the development, structuring or pricing of a financial instrument.\nIf JPMorganChase experiences significant losses in its investment portfolio or from market-making activities, this could reduce JPMorganChase’s profitability and its liquidity and capital levels, and thereby constrain the growth of its businesses.\nJPMorganChase’s consumer businesses can be negatively affected by adverse economic conditions and governmental policies.\nJPMorganChase’s consumer businesses are particularly affected by U.S. and global economic conditions, including:\n•\npersonal and household income distribution\n•\nunemployment or underemployment\n•\nprolonged periods of exceptionally high or low interest rates, or significant changes to interest rates\n•\nchanges in the value of collateral such as residential real estate and vehicles\n•\nchanges in housing prices\n•\nthe level of inflation and its effect on prices for goods and services\n•\nconsumer and small business confidence levels, and\n•\nchanges in consumer spending or in the level of consumer debt.\nHeightened levels of unemployment or underemployment that result in reduced personal and household income could negatively affect consumer credit performance to the extent that consumers are less able to service their debts. In addition, sustained low growth, low or negative interest rates, inflationary pressures or recessionary conditions could diminish customer demand for the products and services offered by JPMorganChase’s consumer businesses. \n16\nAdverse economic conditions could also lead to an increase in delinquencies, additions to the allowance for credit losses and higher net charge-offs, which can reduce JPMorganChase’s earnings. These consequences could be significantly worse in certain geographies, including where declining industrial or manufacturing activity has resulted in or could result in higher levels of unemployment, or where high levels of consumer debt, such as outstanding student loans, could impair the ability of customers to pay their other consumer loan obligations.\nJPMorganChase’s earnings from its consumer businesses could also be adversely affected by governmental policies and actions that affect consumers, including:\n•\npolicies and initiatives relating to medical insurance, education, immigration and housing, or that may impact employment status\n•\nlaws, rules and regulations relating specifically to the financial services industry, such as limitations on late payment, overdraft and interchange fees, and\n•\npolicies aimed at the economy more broadly, such as higher taxes and increased regulation, which could result in reductions in consumer disposable income.\nUnfavorable market and economic conditions can have an adverse effect on JPMorganChase’s wholesale businesses.\nIn JPMorganChase’s wholesale businesses, market and economic factors can affect the volume of transactions that JPMorganChase executes for its clients or for which it advises clients, and, therefore, the revenue that JPMorganChase receives from those transactions. These factors can also influence the willingness of other financial institutions and investors to participate in capital markets transactions that JPMorganChase manages, such as loan syndications or securities underwriting. Furthermore, if a significant and sustained deterioration in market conditions were to occur, the profitability of JPMorganChase’s businesses engaged in capital markets activities, including loan syndication, securities underwriting and leveraged lending activities, could be reduced to the extent that those businesses:\n•\nearn less fee revenue due to lower transaction volumes, including when clients are unwilling or unable to refinance their outstanding debt obligations in unfavorable market conditions, or\n•\ndispose of portions of credit commitments at a loss, or hold larger residual positions in credit commitments that cannot be sold at favorable prices.\nThe fees that JPMorganChase earns from managing client assets or holding assets under custody for clients could be diminished by declining asset values \nor other adverse macroeconomic conditions. For example, higher interest rates or a downturn in financial markets could affect the valuation of client assets that JPMorganChase manages or holds under custody, which, in turn, could affect JPMorganChase’s revenue from fees that are based on the amount of assets under management or custody. Similarly, adverse macroeconomic or market conditions could prompt outflows from JPMorganChase funds or accounts, or cause clients to invest in products that generate lower revenue. Substantial and unexpected withdrawals from a JPMorganChase fund can also hamper the investment performance of the fund, particularly if the outflows create the need for the fund to dispose of fund assets at disadvantageous times or prices, and could lead to further withdrawals based on the weaker investment performance.\nAn adverse change in market conditions in particular segments of the economy, such as a sudden and severe downturn in oil and gas prices or an increase in commodity prices, severe declines in commercial real estate values, or sustained changes in consumer behavior that affect specific economic sectors, could have a material adverse effect on clients of JPMorganChase whose operations or financial condition are directly or indirectly dependent on the health or stability of those market segments or economic sectors, as well as clients that are engaged in related businesses. JPMorganChase could incur credit losses on its loans and other commitments to clients that operate in, or are dependent on, any sector of the economy that is or comes under stress.\nAn economic downturn or sustained changes in consumer behavior that results in shifts in consumer and business spending could also have a negative impact on certain of JPMorganChase’s wholesale clients, and thereby diminish JPMorganChase’s earnings from its wholesale operations. For example, the businesses of certain of JPMorganChase’s wholesale clients are dependent on consistent streams of rental income from commercial real estate properties, including offices, which are owned or being built by those clients. Sustained adverse economic conditions or hybrid work models could result in reductions in the rental cash flows that owners or developers receive from their tenants which, in turn, could depress the values of the properties, impair the ability of borrowers to service or refinance their commercial real estate loans and lead to an increase in foreclosures. These consequences could result in JPMorganChase experiencing increases in the allowance for credit losses, higher delinquencies, defaults and charge-offs within its commercial real estate loan portfolio and incurring higher costs for servicing a larger volume of delinquent loans in that portfolio. An increase in foreclosures could result in higher operational risk associated with JPMorganChase owning and managing real property, \n17\nPart I\nand any inadequacy in governance or control over the foreclosed properties could result in regulatory scrutiny and reputational harm.\nChanges in interest rates and credit spreads can adversely affect JPMorganChase’s earnings, its liquidity or its capital levels. \nWhen interest rates are high or increasing, JPMorganChase can generally be expected to earn higher net interest income. However, higher interest rates can also lead to:\n•\nfewer originations of commercial and residential real estate loans \n•\nlosses on underwriting exposures or incremental client-specific downgrades, or increases in the allowance for credit losses and net charge-offs due to higher financing costs for clients\n•\nthe loss of deposits, particularly if customers withdraw deposits because they believe that interest rates offered by JPMorganChase are lower than those of competitors or if JPMorganChase makes incorrect assumptions about depositor behavior\n•\nlosses on available-for-sale (“AFS”) securities held in the investment securities portfolio\n•\nlower net interest income if central banks introduce interest rate increases more quickly than anticipated and this results in a misalignment in the pricing of short-term and long-term borrowings\n•\nless liquidity in the financial markets, and\n•\nhigher funding costs.\nAll of these outcomes could adversely affect JPMorganChase’s earnings or its liquidity and capital levels, and any negative outcomes could be more severe in a prolonged period of high interest rates. Higher interest rates can also negatively affect the payment performance on loans within JPMorganChase’s consumer and wholesale loan portfolios that are linked to variable interest rates. If borrowers of variable rate loans are unable to afford higher interest payments, those borrowers may reduce or stop making payments, thereby causing JPMorganChase to incur losses and increased operational costs related to servicing a higher volume of delinquent loans. \nOn the other hand, a low or negative interest rate environment may cause:\n•\nnet interest margins to be compressed, which could reduce the amounts that JPMorganChase earns on its investment securities portfolio to the extent that it is unable to reinvest contemporaneously in higher-yielding instruments\n•\nunanticipated or adverse changes in depositor behavior, which could negatively affect JPMorganChase’s broader asset and liability management strategy, and\n•\na reduction in the value of JPMorganChase’s mortgage servicing rights (“MSRs”) asset, resulting in decreased revenues.\nWhen credit spreads widen, it becomes more expensive for JPMorganChase to borrow. JPMorganChase’s credit spreads may widen or narrow not only in response to events and circumstances that are specific to JPMorganChase but also as a result of general economic and geopolitical events and conditions. Changes in JPMorganChase’s credit spreads will affect, positively or negatively, JPMorganChase’s earnings on certain liabilities, such as derivatives, that are recorded at fair value. \nJPMorganChase’s results may be materially affected by market fluctuations and significant changes in the valuation of financial instruments.\nThe value of securities, derivatives and other financial instruments which JPMorganChase owns or in which it makes markets can be materially affected by market fluctuations. Market volatility, illiquid market conditions and other disruptions in the financial markets may make it extremely difficult to value certain financial instruments. Subsequent valuations of financial instruments in future periods, in light of factors then prevailing, may result in significant changes in the value of these instruments. In addition, at the time of any disposition of these financial instruments, the price that JPMorganChase ultimately realizes will depend on the demand and liquidity in the market at that time and may be materially lower than their current fair value. Any of these factors could cause a decline in the value of financial instruments that JPMorganChase owns or in which it makes markets, which may have an adverse effect on JPMorganChase’s results of operations.\nJPMorganChase’s risk management and monitoring processes, including its stress testing framework, seek to quantify and manage JPMorganChase’s exposure to more extreme market moves. However, JPMorganChase’s hedging and other risk management strategies may not be effective, and it could incur significant losses, if extreme market events were to occur.\nCredit\nJPMorganChase can be negatively affected by adverse changes in the financial condition of clients, counterparties, custodians and CCPs.\nJPMorganChase routinely executes transactions with clients and counterparties such as corporations, financial institutions, asset managers, hedge funds, securities exchanges and government entities within and outside the U.S. Many of these transactions expose JPMorganChase to the credit risk of its clients and counterparties, and can involve JPMorganChase in disputes and litigation if a client or counterparty defaults. JPMorganChase can also be subject to losses \n18\nor liability where a financial institution that it has appointed to provide custodial services for client assets or funds becomes insolvent as a result of fraud or the failure to abide by existing laws and obligations, or where clients are unable to access assets held by JPMorganChase as custodian due to governmental actions or other factors.\nA default by, or the financial or operational failure of, a CCP through which JPMorganChase executes contracts would require JPMorganChase to replace those contracts, thereby increasing its operational costs and potentially resulting in losses. In addition, JPMorganChase can be exposed to losses if a member of a CCP in which JPMorganChase is also a member defaults on its obligations to the CCP because of requirements that each member of the CCP absorb a portion of those losses. Furthermore, JPMorganChase can be subject to bearing its share of non-default losses incurred by a CCP, including losses from custodial, settlement or investment activities or due to cyber or other security breaches.\nAs part of its clearing services activities, JPMorganChase is exposed to the risk of nonperformance by its clients, which it seeks to mitigate by requiring clients to provide adequate collateral. JPMorganChase is also exposed to intra-day credit risk of its clients in connection with providing cash management, clearing, custodial and other transaction services to those clients. If a client for which JPMorganChase provides these services becomes bankrupt or insolvent, JPMorganChase may incur losses, become involved in disputes and litigation with one or more CCPs, the client’s bankruptcy estate and other creditors, or be subject to regulatory investigations. All of the foregoing events can increase JPMorganChase’s operational and litigation costs, and JPMorganChase may suffer losses to the extent that any collateral that it has received is insufficient to cover those losses.\nTransactions with government entities, including national, state, provincial, municipal and local authorities, can expose JPMorganChase to enhanced sovereign, credit, operational and reputation risks. Government entities may, among other things, claim that actions taken by government officials were beyond the legal authority of those officials or repudiate transactions authorized by a previous incumbent government. These types of actions have in the past caused, and could in the future cause, JPMorganChase to suffer losses or hamper its ability to conduct business in the relevant jurisdiction.\nIn addition, local laws, rules and regulations could limit JPMorganChase’s ability to resolve disputes and litigation in the event of a counterparty default or unwillingness to make previously agreed-upon payments, which could subject JPMorganChase to losses.\nDisputes may arise with counterparties to derivatives contracts with regard to the terms, the settlement procedures or the value of underlying collateral. The disposition of those disputes could cause JPMorganChase to incur unexpected transaction, operational and legal costs, or result in credit losses. These consequences can also impair JPMorganChase’s ability to effectively manage its credit risk exposure from its market activities, or cause harm to JPMorganChase’s reputation.\nThe financial or operational failure of a significant market participant, such as a major financial institution or a CCP, or concerns about the creditworthiness of such a market participant or its ability to fulfill its obligations, can cause substantial and cascading disruption within the financial markets, including in circumstances where coordinated action by multiple other market participants is required to address the failure or disruption. JPMorganChase’s businesses could be significantly disrupted by such an event, particularly if it leads to other market participants incurring significant losses, experiencing liquidity issues or defaulting, and JPMorganChase is likely to have significant interrelationships with, and credit exposure to, such a significant market participant.\nJPMorganChase may suffer losses if the value of collateral declines in stressed market conditions.\nDuring periods of market stress or illiquidity, JPMorganChase’s credit risk may be further increased when:\n•\nJPMorganChase fails to realize the estimated value of the collateral it holds\n•\ncollateral is liquidated at prices that are not sufficient to recover the full amount owed to it, or\n•\ncounterparties are unable to post collateral, whether for operational or other reasons.\nFurthermore, disputes with counterparties concerning the valuation of collateral may increase in times of significant market stress, volatility or illiquidity, and JPMorganChase could suffer losses during these periods if it is unable to realize the fair value of collateral or to manage declines in the value of collateral.\nJPMorganChase could incur significant losses arising from concentrations of credit and market risk.\nJPMorganChase is exposed to greater credit and market risk to the extent that groupings of its clients or counterparties, or obligors on securities and other financial instruments:\n•\nengage in similar or related businesses, or in businesses in related industries\n•\ndo business in the same geographic region, or\n19\nPart I\n•\nhave business profiles, models or strategies that could cause their ability to meet their obligations to be similarly affected by changes in economic conditions. \nFor example, a significant deterioration in the credit quality of a counterparty, borrower or other obligor could lead to concerns about the creditworthiness of other counterparties, borrowers or obligors in similar, related or dependent industries. This type of interrelationship could exacerbate JPMorganChase’s credit, liquidity and market risk exposure and potentially cause it to incur losses, including fair value losses in its market-making businesses and investment portfolios. In addition, JPMorganChase may be required to increase the allowance for credit losses or establish other reserves with respect to certain clients, industries or country exposures in order to align with directives or expectations of its banking regulators. \nSimilarly, challenging economic conditions that affect a particular industry or geographic area could lead to concerns about the credit quality of counterparties, borrowers or other obligors not only in that particular industry or geography but in related or dependent industries, wherever located. These conditions could also heighten concerns about the ability of customers of JPMorganChase’s consumer businesses who live in those areas or work in those affected industries or related or dependent industries to meet their obligations to JPMorganChase. JPMorganChase regularly monitors various segments of its credit and market risk exposures to assess the potential risks of concentration or contagion, but its ability to diversify or hedge its exposure against those risks may be limited.\nJPMorganChase’s consumer businesses can also be harmed by an excessive expansion of consumer credit by bank or non-bank competitors. Heightened competition for certain types of consumer loans could prompt industry-wide reactions such as significant reductions in the pricing or margins of those loans or the making of loans to less-creditworthy borrowers. If large numbers of consumers subsequently default on their loans, whether due to weak credit profiles, an economic downturn or other factors, this could impair their ability to repay obligations owed to JPMorganChase and result in higher charge-offs and other credit-related losses. More broadly, widespread defaults on consumer debt could lead to recessionary conditions in the U.S. economy, and JPMorganChase’s consumer businesses may earn lower revenues in such an environment.\nIf JPMorganChase is unable to reduce positions effectively during a market dislocation, this can increase both the market and credit risks associated with those positions and the level of risk-weighted-assets (“RWA”) that JPMorganChase holds on its \nbalance sheet. These factors could adversely affect JPMorganChase’s capital position, funding costs and the profitability of its businesses.\nLiquidity\nJPMorganChase’s ability to operate its businesses could be impaired if its liquidity is constrained. \nJPMorganChase’s liquidity can be impacted at any given time as a result of factors such as:\n•\nmarket-wide illiquidity or disruption\n•\nchanges in liquidity or capital requirements resulting from changes in laws, rules and regulations, including those in response to economic effects of systemic events\n•\nactions taken by the U.S. government or by the Federal Reserve to reduce its balance sheet, which may reduce deposits held by JPMorganChase and other financial institutions\n•\ninability to sell assets, or to sell assets at favorable times or prices\n•\ndefault by a CCP or other significant market participant\n•\nunanticipated outflows of cash or collateral\n•\nunexpected loss of deposits or higher than anticipated draws on lending-related commitments, and\n•\nlack of market or customer confidence in JPMorganChase or financial institutions in general. \nA reduction in JPMorganChase’s liquidity may be caused by events over which it has little or no control. For example, periods of market stress, low investor confidence and significant market illiquidity could result in higher funding costs for JPMorganChase and could limit its access to some of its traditional sources of liquidity. \nJPMorganChase may need to raise funding from alternative sources if its access to stable and lower-cost sources of funding, such as deposits and borrowings from Federal Home Loan Banks, is reduced. Alternative sources of funding could be more expensive or limited in availability. JPMorganChase’s funding costs could also be negatively affected by actions that JPMorganChase may take in order to:\n•\nsatisfy applicable liquidity coverage ratio and net stable funding ratio requirements\n•\naddress obligations under its resolution plan, or\n•\nsatisfy regulatory requirements in jurisdictions outside the U.S. relating to the pre-positioning of liquidity in subsidiaries that are material legal entities.\nMore generally, if JPMorganChase fails to effectively manage its liquidity, this could constrain its ability to fund or invest in its businesses and subsidiaries, and thereby adversely affect its results of operations.\n20\nJPMorgan Chase & Co. is a holding company and depends on the cash flows of its subsidiaries to make payments on its outstanding securities.\nJPMorgan Chase & Co. is a holding company that holds the stock of JPMorgan Chase Bank, N.A. and an intermediate holding company, JPMorgan Chase Holdings LLC (the “IHC”). The IHC in turn generally holds the stock of JPMorganChase’s subsidiaries other than JPMorgan Chase Bank, N.A. and its subsidiaries. The IHC also owns other assets and provides intercompany lending to the Parent Company. \nThe Parent Company is obligated to contribute to the IHC substantially all the net proceeds received from securities issuances (including issuances of senior and subordinated debt securities and of preferred and common stock).\nThe ability of JPMorgan Chase Bank, N.A. and the IHC to make payments to the Parent Company is also limited. JPMorgan Chase Bank, N.A. is subject to regulatory restrictions on its dividend distributions, as well as capital adequacy requirements, such as the Supplementary Leverage Ratio (“SLR”), and liquidity requirements and other regulatory restrictions on its ability to make payments to the Parent Company. The IHC is prohibited from paying dividends or extending credit to the Parent Company if certain capital or liquidity thresholds are breached, or if limits are otherwise imposed by the Parent Company’s management or Board of Directors. \nAs a result of these arrangements, the ability of the Parent Company to make various payments is dependent on its receiving dividends from JPMorgan Chase Bank, N.A. and dividends and borrowings from the IHC. These limitations could affect the Parent Company’s ability to:\n•\npay interest on its debt securities\n•\npay dividends on its equity securities\n•\nredeem or repurchase outstanding securities, and\n•\nfulfill its other payment obligations.\nThese arrangements could also result in the Parent Company seeking protection under bankruptcy laws or otherwise entering into resolution proceedings at a time earlier than would have been the case absent the existence of the capital and liquidity thresholds to which JPMorgan Chase Bank, N.A. and the IHC are subject.\nReductions in JPMorganChase’s credit ratings may adversely affect its liquidity and cost of funding.\nJPMorgan Chase & Co. and certain of its principal subsidiaries are rated by credit rating agencies. Rating agencies evaluate general, firm-specific and industry-specific factors when determining credit ratings for a particular financial institution, including:\n•\nexpected future profitability \n•\nrisk management practices\n•\nlegal expenses\n•\nratings differentials between bank holding companies and their bank and non-bank subsidiaries\n•\nregulatory developments \n•\nassumptions about government support, and \n•\neconomic and geopolitical developments. \nJPMorganChase closely monitors and manages, to the extent that it is able, factors that could influence its credit ratings. However, there is no assurance that JPMorganChase’s credit ratings will not be downgraded in the future. Furthermore, any such downgrade could occur at times of broader market instability when JPMorganChase’s options for responding to events may be more limited and general investor confidence is low.\nA reduction in JPMorganChase’s credit ratings could curtail JPMorganChase’s business activities and reduce its profitability in a number of ways, including:\n•\nreducing its access to capital markets \n•\nmaterially increasing its cost of issuing and servicing securities \n•\ntriggering additional collateral or funding requirements, and \n•\ndecreasing the number of investors and counterparties that are willing or permitted to do business with or lend to JPMorganChase.\nAny rating reduction could also increase the credit spreads charged by the market for taking credit risk on JPMorgan Chase & Co. and its subsidiaries. This could, in turn, adversely affect the value of debt and other obligations of JPMorgan Chase & Co. and its subsidiaries.\nCapital\nMaintaining the required level and composition of capital may impact JPMorganChase’s ability to support business activities, meet evolving regulatory requirements and distribute capital to shareholders.\nJPMorganChase is subject to various regulatory capital requirements, including leverage- and risk-based capital requirements. In addition, as a Global Systemically Important Bank (“GSIB”), JPMorganChase is required to hold additional capital buffers, including a GSIB surcharge, a Stress Capital Buffer (“SCB”), and a countercyclical buffer, each of which is reassessed at least annually. The amount of capital that JPMorganChase is required to hold in order to satisfy these leverage- and risk-based requirements could increase at any given time due to factors such as:\n•\nactions by banking regulators, including changes in laws, rules and regulations\n21\nPart I\n•\nchanges in the composition of JPMorganChase’s balance sheet or developments that could increase RWA, such as increased market risk, customer delinquencies, client credit rating downgrades or other factors, and\n•\nincreases in estimated stress losses as determined by the Federal Reserve under the Comprehensive Capital Analysis and Review, which could increase JPMorganChase’s SCB.\nAny failure by or inability of JPMorganChase to maintain the required level and composition of capital, or unfavorable changes in applicable capital requirements, could have an adverse impact on JPMorganChase’s shareholders, such as:\n•\nreducing the amount of common stock that JPMorganChase is permitted to repurchase\n•\nrequiring the issuance of, or prohibiting the redemption of, capital instruments in a manner inconsistent with JPMorganChase’s capital management strategy\n•\nconstraining the amount of dividends that may be paid on common stock, or\n•\ncurtailing JPMorganChase’s business activities or operations.\nIn 2023, U.S. banking regulators released a proposal to implement the final Basel III reforms which would have significantly revised the risk-based capital requirements for banks with assets of $100 billion or more, including JPMorganChase. In addition, in 2023 the Federal Reserve released a proposal to amend the calculation of the GSIB surcharge. Uncertainty remains regarding the content of the final versions of these rule proposals and how they might ultimately apply to JPMorganChase. However, it is possible that the final rules could impact JPMorganChase’s decisions concerning the business activities in which it will engage and its levels of capital distributions to its shareholders. \nOperational\nJPMorganChase’s businesses are dependent on the effectiveness of internal and external operational systems.\nJPMorganChase’s businesses rely on the ability of JPMorganChase’s financial, accounting, transaction execution, data processing and other operational systems, including devices supporting those systems, to process, record, monitor and report a large number of transactions on a continuous basis, and to do so accurately, quickly and securely. In addition to proper design, installation, maintenance and training, the effective functioning of JPMorganChase’s operational systems depends on:\n•\nthe quality of the information contained in those systems, as inaccurate, outdated, incomplete or corrupted data can significantly compromise the \nfunctionality or reliability of a particular system and other systems to which it transmits or from which it receives information, and\n•\nJPMorganChase’s ability to continue to maintain and upgrade its systems on a regular and timely basis in line with technological advancements and evolving security requirements, maintain security and operational continuity of its systems, including by carefully managing any changes introduced to its systems, prevent unauthorized access and the misuse of access to its systems, and adhere to all applicable legal and regulatory requirements, particularly in regions where JPMorganChase may face a heightened risk of malicious activity.\nJPMorganChase has experienced and expects that it will continue to experience failures and disruptions in the stability of its operational systems, including degraded performance of data processing systems, data quality issues, disruptions of network connectivity and malfunctioning software, as well as disruptions in its ability to access and use the operational systems of third parties and interruptions in service from third-party service providers. These incidents have resulted in various negative effects for customers, including the inability to access account information or transact through ATM, internet or mobile channels, the exfiltration of customer personal data, the recording of duplicative transactions and extended delays for customers requiring services from call centers. There can be no assurance that these and other types of operational failures or disruptions will not occur in the future.\nJPMorganChase’s ability to effectively manage the stability of its operational systems and infrastructure could be hindered by many factors, any of which could have a negative impact on JPMorganChase and its clients, customers and counterparties, including:\n•\nJPMorganChase’s ability to effectively maintain and upgrade systems and infrastructure can become more challenging as the speed, frequency, volume, interconnectivity and complexity of transactions continue to increase\n•\nattempts by third parties to defraud JPMorganChase or its clients and customers continue to increase, evolve and become more complex, and during periods of market disruption or economic uncertainty, these attempts can be expected to further increase in volume\n•\nerrors made by JPMorganChase or another market participant, whether inadvertent or malicious, could cause widespread system disruption\n•\nfailure to detect weaknesses or shortcomings in operational systems in a timely manner\n•\nisolated or seemingly insignificant errors in operational systems could compound, or migrate to other systems over time, to become larger issues\n22\n•\ndisruptions in operational systems or in the ability of systems to communicate with each other could be caused by failures in synchronization or encryption software, or degraded performance of microprocessors, and\n•\nattempts by third parties to block the use of key technology solutions by claiming that the use infringes on their intellectual property rights.\nJPMorganChase also depends on its ability to access and use the operational systems of third parties, including its custodians, vendors (such as those that provide data and cloud computing services, and security and technology services) and other market participants (such as clearing and payment systems, CCPs and securities exchanges). These external operational systems with which JPMorgan is connected, whether directly or indirectly, can be sources of operational risk to JPMorganChase. JPMorganChase may be exposed not only to a systems failure or cyber attack that may be experienced by a vendor or market infrastructure with which JPMorganChase is directly connected, but also to a systems breakdown or cyber attack involving another party to which such a vendor or infrastructure is connected. Similarly, retailers, payment systems and processors, data aggregators and other external parties with which JPMorganChase’s customers do business can increase JPMorganChase’s operational risk. This is particularly the case where activities of customers or other parties are beyond JPMorganChase’s security and control systems, including through the use of the internet, cloud computing services, and personal smart phones and other mobile devices or services.\nIf an external party obtains access to customer account data on JPMorganChase’s systems, whether authorized or unauthorized, and that party misappropriates that data, this could result in negative outcomes for JPMorganChase and its clients and customers, including a heightened risk of fraudulent transactions using JPMorganChase’s systems, losses from fraudulent transactions and reputational harm arising from the perception that JPMorganChase’s systems may not be secure.\nAs JPMorganChase’s interconnectivity with clients, customers and other external parties continues to expand, JPMorganChase increasingly faces the risk of operational failure or cyber attacks with respect to the systems of those parties. Security breaches affecting JPMorganChase’s clients or customers, or systems breakdowns or failures, security breaches or human error or misconduct affecting other external parties, may require JPMorganChase to take steps to protect the integrity of its own operational systems or to safeguard confidential information, including restricting the access of customers to their accounts. These actions can increase JPMorganChase’s \noperational costs and potentially diminish customer satisfaction and confidence in JPMorganChase.\nFurthermore, the widespread and expanding interconnectivity among financial institutions, clearing banks, CCPs, payments processors, financial technology companies, securities exchanges, clearing houses and other financial market infrastructures increases the risk that the disruption of an operational system involving one institution or entity, including due to a cyber attack, may cause industry-wide operational disruptions that could materially affect JPMorganChase’s ability to conduct business. In addition, the risks associated with the disruption of an operational system of a third party could be exacerbated to the extent that the services provided by that system are used by a significant number or proportion of market participants.\nThe ineffectiveness, failure or other disruption of operational systems upon which JPMorganChase depends, including due to a systems malfunction, cyber incident or other systems failure, could result in unfavorable ripple effects in the financial markets and for JPMorganChase and its clients and customers, including:\n•\ndelays or other disruptions in providing services, including the provision of liquidity or information to clients and customers\n•\nimpairment of JPMorganChase’s ability to execute transactions, including delays or failures in the confirmation or settlement of transactions or in obtaining access to funds or other assets required for settlement\n•\nthe possibility that funds transfers, capital markets trades or other transactions are executed erroneously\n•\nfinancial losses, including due to loss-sharing requirements of CCPs, payment systems or other market infrastructures, or as possible restitution to clients and customers\n•\nhigher operational costs associated with replacing services provided by a system that has experienced a failure or other disruption \n•\nlimitations on JPMorganChase's ability to collect data needed for its business and operations\n•\nloss of confidence in the ability of JPMorganChase, or financial institutions generally, to protect against and withstand operational disruptions\n•\ndissatisfaction among JPMorganChase’s clients or customers\n•\nsignificant exposure to litigation and regulatory fines, penalties or other sanctions, and \n•\nharm to JPMorganChase’s reputation.\nIf JPMorganChase’s operational systems, or those of acquired businesses or of external parties on which \n23\nPart I\nJPMorganChase’s businesses depend, are unable to meet the requirements of JPMorganChase’s businesses and operations or bank regulatory standards, or if they fail or have other significant shortcomings, JPMorganChase could be materially and adversely affected.\nA successful cyber attack affecting JPMorganChase could cause significant harm to JPMorganChase and its clients and customers.\nJPMorganChase experiences numerous cyber attacks on its computer systems, software, networks and other technology assets on a daily basis from various actors, including groups acting on behalf of hostile countries, cyber-criminals, “hacktivists” (i.e., individuals or groups that use technology to promote a political agenda or social change) and others. These cyber attacks can take many forms, including attempts to introduce computer viruses or malicious code, which are commonly referred to as “malware,” into JPMorganChase’s systems. These attacks are often designed to:\n•\nobtain unauthorized access to JPMorganChase's systems or to confidential information belonging to JPMorganChase or its clients, customers, counterparties or employees\n•\nmanipulate data\n•\ndestroy data or systems with the aim of rendering services unavailable\n•\ndisrupt, sabotage or degrade service on JPMorganChase’s systems\n•\nsteal money, or\n•\nextort money through the use of so-called “ransomware.”\nJPMorganChase also experiences:\n•\ndistributed denial-of-service attacks intended to disrupt JPMorganChase’s websites, including those that provide online banking and other services,\n•\na higher volume and complexity of cyber attacks against the backdrop of heightened geopolitical tensions, and\n•\na high volume of disruptions to internet-based services used by JPMorganChase that are provided by third parties.\nJPMorganChase has experienced security breaches due to cyber attacks in the past, and it is inevitable that additional breaches will occur in the future. Any such breach could result in serious and harmful consequences for JPMorganChase or its clients and customers.\nA principal reason that JPMorganChase cannot provide absolute security against cyber attacks is that it may not always be possible to anticipate, detect or recognize threats to JPMorganChase’s systems, or to \nimplement effective preventive measures against all breaches due to evolving risks, including:\n•\nthe techniques used in cyber attacks evolve frequently and increase in sophistication, and therefore may not be recognized until launched or may go undetected for extended periods\n•\ncyber attacks can originate from a wide variety of sources, including JPMorganChase’s own employees, cyber-criminals, hacktivists, groups linked to terrorist organizations or hostile nation-states that can sustain malicious activities for extended periods, or third parties whose objective is to disrupt the operations of financial institutions more generally\n•\nJPMorganChase does not have control over the cybersecurity of the systems of the large number of clients, customers, counterparties and third-party service providers with which it does business, and\n•\nit is possible that a third party, after establishing a foothold on an internal network without being detected, may gain access to other networks and systems.\nThe risk of a security breach due to a cyber attack could increase in the future due to factors such as: \n•\nJPMorganChase’s ongoing expansion of its digital banking and other internet-based product offerings and its internal use of internet-based products and applications, including those that use cloud computing services\n•\nadvances in artificial intelligence, such as the use of machine learning, generative artificial intelligence and quantum computing by malicious actors to develop more advanced social engineering attacks, including targeted phishing attacks\n•\nthe inability to maintain the security of information transmitted by JPMorganChase due to advances in quantum computing that may counteract or nullify existing information protections, and\n•\nthe acquisition and integration of new businesses.\nIn addition, a third party could misappropriate confidential information obtained by intercepting signals or communications from mobile devices used by JPMorganChase’s employees.\nThe dynamic nature of the cyber threat landscape, including the pace of innovation and increased threat of novel attack methods, necessitates ongoing investment in, as well as enhancement and adaptation of, cybersecurity controls, including the adoption of enhanced security measures in certain jurisdictions. Failure to discover or address emerging threats, known vulnerabilities or shortcomings in cybersecurity controls, or to prioritize or complete enhancements to address them, in each case in a timely manner, may leave JPMorganChase vulnerable to cyber attacks, potentially resulting in data breaches, financial losses, \n24\nreputational damage and regulatory penalties, including the failure to prioritize or complete enhancements relating to:\n•\npreventing unauthorized access and protecting against the misuse of access, including the maintenance and enhancement of controls related to secure software development practices and identity and access management, such as those relating to the management of administrative access to systems\n•\ndetecting, escalating and addressing effectively and in a timely manner any vulnerabilities that may be present either in internally-developed software or externally-provided software or services, including vulnerabilities that could allow attackers to exploit unknown security flaws in software and hardware (“zero-day vulnerabilities”)\n•\noversight of third-party vendors and early detection of attacks against those vendors, including ransomware attacks and attacks targeting vulnerabilities in third-party open-source software, in support of the secure development and maintenance of internal systems\n•\nmaintaining and enhancing controls related to technology asset management and inventory systems to prevent the risk of undetected vulnerabilities that could undermine JPMorganChase’s ability to operate an effective control process \n•\nupgrading the coverage and capabilities of systems and controls to protect JPMorganChase and its clients and customers from the impact of distributed denial-of-service attacks, or to recover from outages that could be caused by a malware or ransomware attack\n•\nthe continuing migration of client-facing services to the cloud, and modernization of those services\n•\nstrengthening network security and managing outbound connections to reduce the risk of data loss \n•\nidentifying, assessing and mitigating insider threat activities that could lead to the misuse of JPMorganChase’s systems or client and customer information, and\n•\nintegrating acquired businesses where system integration may be complex or may require extensive and lengthy remediation or enhancement of controls.\nA successful penetration or circumvention of the security of JPMorganChase’s systems or the systems of a vendor, governmental body or another market participant could cause serious negative consequences, including:\n•\nsignificant disruption of JPMorganChase’s operations and those of its clients, customers and \ncounterparties, including losing access to operational systems\n•\nmisappropriation of confidential information of JPMorganChase or that of its clients, customers, counterparties, employees or regulators\n•\ndisruption of or damage to JPMorganChase’s systems and those of its clients, customers and counterparties\n•\nthe inability, or extended delays in the ability, to fully recover and restore data that has been stolen, manipulated or destroyed, or the inability to prevent systems from processing fraudulent transactions\n•\ndemands that JPMorganChase pay a ransom to a malicious actor that has perpetrated a cybersecurity breach\n•\nunintended violations by JPMorganChase of applicable privacy and other laws\n•\nfinancial loss to JPMorganChase or to its clients, customers, counterparties or employees\n•\nlosses to JPMorganChase in excess of cyber insurance policy coverage\n•\nloss of confidence in JPMorganChase’s cybersecurity and business resiliency measures\n•\ndissatisfaction among JPMorganChase’s clients, customers or counterparties\n•\nsignificant exposure to litigation and regulatory fines, penalties or other sanctions, and\n•\nharm to JPMorganChase’s reputation.\nThe extent of a particular cyber attack, the methods and tools used by various actors, and the steps that JPMorganChase may need to take to investigate the attack may not be immediately clear, and it may take a significant amount of time before such an investigation can be completed. While such an investigation is ongoing, JPMorganChase may not necessarily know the full extent of the harm caused by the cyber attack, and that damage may continue to spread. These factors may inhibit JPMorganChase’s ability to provide rapid, full and reliable information about the cyber attack to its clients, customers, counterparties and regulators, as well as the public. Furthermore, it may not be clear how best to contain and remediate the harm caused by the cyber attack, and certain errors or actions could be repeated or compounded before they are discovered and remediated. Any or all of these factors could further increase the costs and consequences of a cyber attack.\nJPMorganChase can be negatively affected if it fails to identify and address operational risks associated with the introduction of or changes to products, services and delivery platforms or the adoption of new technologies.\nWhen JPMorganChase launches a new product or service, introduces a new platform for the delivery or \n25\nPart I\ndistribution of products or services (including mobile connectivity, electronic trading and cloud computing), acquires or invests in a business, makes changes to an existing product, service or delivery platform, or adopts a new technology, it may not fully appreciate or identify new operational risks that may arise from those changes, including increased reliance on third party providers, or may fail to implement adequate controls to mitigate the risks associated with those changes. Any significant failure in this regard could diminish JPMorganChase’s ability to operate one or more of its businesses or result in:\n•\npotential liability to clients, counterparties and customers\n•\nhigher compliance, operational or integration costs \n•\nhigher litigation costs, including regulatory fines, penalties and other sanctions\n•\ndamage to JPMorganChase’s reputation\n•\nimpairment of JPMorganChase’s liquidity\n•\nregulatory intervention, or \n•\nweaker competitive standing.\nAny of the foregoing consequences could materially and adversely affect JPMorganChase’s businesses and results of operations.\nJPMorganChase’s business and operations rely on its ability, and the ability of key external parties, to maintain appropriately-staffed workforces, and on the competence, trustworthiness, health and safety of employees.\nJPMorganChase’s ability to operate its businesses efficiently and profitably, to offer products and services that meet the expectations of its clients and customers, and to maintain an effective risk management framework is highly dependent on its ability to staff its operations appropriately and on the competence, trustworthiness, health and safety of its employees. JPMorganChase's businesses and operations similarly rely on the workforces of third parties, including employees of vendors, custodians and financial markets infrastructures, and of businesses that it may seek to acquire. JPMorganChase’s businesses could be materially and adversely affected by:\n•\nthe ineffective implementation of business decisions\n•\nany failure to institute controls that appropriately address risks associated with business activities, or to appropriately train employees with respect to those risks and controls\n•\nstaffing shortages, particularly in tight labor markets\n•\nthe possibility that significant portions of JPMorganChase’s workforce are unable to work effectively, including because of illness, quarantines, shelter-in-place arrangements, government actions or other restrictions in connection with health \nemergencies, the spread of infectious diseases, epidemics or pandemics, or due to extraordinary events beyond JPMorganChase’s control such as natural disasters or an outbreak or escalation of hostilities\n•\na significant operational breakdown or failure, theft, fraud or other unlawful conduct, or\n•\nother negative outcomes caused by human error or misconduct by an employee of JPMorganChase or of another party on which JPMorganChase’s businesses or operations rely.\nJPMorganChase’s operations could also be impaired if the measures taken by it or by governmental authorities to protect the health and safety of its employees are ineffective, or if any external party on which JPMorganChase relies fails to take appropriate and effective actions to protect the health and safety of its employees.\nJPMorganChase faces substantial legal and operational risks in the processing and safeguarding of personal information.\nJPMorganChase’s businesses and operations are subject to complex and evolving laws, rules and regulations, both within and outside the U.S., governing the privacy and protection of personal information of individuals. Governmental authorities around the world have adopted and are considering the adoption of numerous legislative and regulatory initiatives concerning privacy, data protection and security. Litigation or enforcement actions relating to these laws, rules and regulations could result in fines or orders requiring that JPMorganChase change its data-related practices, which could have an adverse effect on JPMorganChase’s ability to provide products and otherwise harm its business operations.\nImplementing processes relating to JPMorganChase’s collection, use, sharing and storage of personal information to comply with all applicable laws, rules and regulations in all relevant jurisdictions, including where the laws of different jurisdictions are in conflict, can:\n•\nincrease JPMorganChase’s compliance and operating costs\n•\nhinder the development of new products or services, curtail the offering of existing products or services, or affect how products and services are offered to clients and customers\n•\ndemand significant oversight by JPMorganChase’s management, and \n•\nrequire JPMorganChase to structure its businesses, operations and systems in less efficient ways. \nNot all of JPMorganChase’s clients, customers, vendors, counterparties and other external parties may have appropriate controls in place to protect the confidentiality, integrity or availability of the \n26\ninformation exchanged between them and JPMorganChase, particularly where information is transmitted by electronic means. JPMorganChase could be exposed to litigation or regulatory fines, penalties or other sanctions if personal information of clients, customers, employees or others were to be mishandled or misused, such as situations where such information is:\n•\nerroneously provided to parties who are not permitted to have the information, or\n•\nintercepted or otherwise compromised by unauthorized third parties.\nThe increasing sophistication of artificial intelligence technologies poses a greater risk of identity fraud, as malicious actors may exploit artificial intelligence to create convincing false identities or manipulate verification processes. This challenge necessitates ongoing enhancements to client verification systems and security protocols to prevent unauthorized access and protect sensitive client information. Failure to manage these risks or to implement effective countermeasures could lead to unauthorized transactions, financial losses, reputational damage and increased regulatory scrutiny.\nConcerns regarding the effectiveness of JPMorganChase’s measures to safeguard personal information, or the perception that those measures are inadequate, could cause JPMorganChase to lose existing or potential clients and customers or employees, and thereby reduce JPMorganChase’s revenues. Furthermore, any failure or perceived failure by JPMorganChase to comply with applicable privacy or data protection laws, rules and regulations, or any failure to appropriately calibrate, manage and monitor access by employees or third parties to personal information, could subject JPMorganChase to inquiries, examinations and investigations that could result in requirements to modify or cease certain operations or practices, significant liabilities or regulatory fines, penalties or other sanctions. Any of these could damage JPMorganChase’s reputation and otherwise adversely affect its businesses.\nIn recent years, well-publicized incidents involving the inappropriate collection, use, sharing or storage of personal information have led to expanded governmental scrutiny of practices relating to the processing or safeguarding of personal information by companies in the U.S. and other countries. That scrutiny has in some cases resulted in, and could in the future lead to, the adoption of stricter laws, rules and regulations relating to the collection, use, sharing and storage of personal information. These types of laws, rules and regulations can prohibit or significantly restrict financial services firms such as JPMorganChase from transferring information across national borders or sharing information among affiliates or with third parties such as vendors, thereby \nincrease compliance costs and operational risk, or restrict JPMorganChase’s use of personal information when developing or offering products or services to customers. Some countries are considering or have adopted legislation implementing data protection requirements or requiring local storage and processing of data which could increase the cost and complexity of JPMorganChase’s delivery of products and services. These restrictions could also inhibit JPMorganChase’s development or marketing of certain products or services, or increase the costs of offering them to customers.\nJPMorganChase’s operations, results and reputation could be harmed by occurrences of extraordinary events beyond its control.\nJPMorganChase’s business and operational systems could be seriously disrupted, and its reputation could be harmed, by events or contributing factors that are wholly or partially beyond its control, including material instances of:\n•\ncyber attacks\n•\nsecurity breaches of its physical premises, including threats to health and safety\n•\npower, telecommunications or internet outages, or shutdowns of mass transit\n•\nfailure of, or loss of access to, technology or operational systems, including any resulting loss of critical data\n•\ninterruption of service from third-party service providers \n•\ndamage to or loss of property or assets of JPMorganChase or third parties, and any consequent injuries, including in connection with any construction projects undertaken by JPMorganChase\n•\neffects of climate change\n•\nnatural disasters or severe weather conditions\n•\naccidents such as explosions or structural failures\n•\nhealth emergencies, the spread of infectious diseases, epidemics or pandemics, or\n•\nevents arising from local or larger-scale civil or political unrest, any outbreak or escalation of hostilities, or terrorist acts.\nJPMorganChase operates a Firmwide resiliency framework that is intended to enable it to prepare for and adapt to changing conditions and withstand and recover from, and address any adverse effects on its operations caused by, disruptions that may impact critical business functions and supporting assets, including its staff, technology, data and facilities and those of third-party service providers. \nAlthough not every form of disruption can be anticipated or defended against, JPMorganChase \n27\nPart I\nstrives for resiliency or recovery in a range of scenarios in the event of a disruption, including due to the occurrence of an extraordinary event beyond its control. There can be no assurance that JPMorganChase’s Firmwide resiliency framework will fully mitigate all potential resiliency risks to JPMorganChase, its clients, and customers and third parties with which it does business, or that its resiliency framework will be adequate to address the effects of simultaneous occurrences of multiple or extended disruption events. In addition, JPMorganChase’s ability to respond effectively to a  disruption event could be hampered to the extent that the members of its workforce, physical assets,  systems and other support infrastructure, or those of its third-party service providers, that are needed to address the event are geographically dispersed, or conversely, if such an event were to occur in an area in which they are concentrated. Further, should extraordinary events or the factors that cause or contribute to those events become more chronic, the disruptive effects of those events on JPMorganChase’s business and operations, and on its clients, customers, counterparties and employees, could become more significant and long-lasting. \nAny significant failure or disruption of JPMorganChase’s operations or operational systems, or the occurrence of one or more extraordinary events that are beyond its control, could:\n•\nhinder JPMorganChase’s ability to provide services to its clients and customers or to transact with its counterparties\n•\nrequire it to expend significant resources to correct the failure or disruption or to address the event\n•\ncause it to incur losses or liabilities, including from loss of revenue, damage to or loss of property, or injuries\n•\ndisrupt market infrastructure systems on which JPMorganChase’s businesses rely \n•\nexpose it to litigation or regulatory fines, penalties or other sanctions, and\n•\nharm its reputation.\nThe occurrence of one or more extraordinary events could also negatively impact the financial condition or creditworthiness of JPMorganChase’s clients and customers, and could lead to an increase in delinquencies, additions to the allowance for credit losses and higher net charge-offs, which can reduce JPMorganChase’s earnings.\nData quality is essential to JPMorganChase’s business and operations, and if JPMorganChase fails to maintain adequate data management processes, this could adversely affect its ability to effectively manage its businesses, comply with applicable laws, rules and regulations, or remain competitive. \nJPMorganChase relies on accurate, timely and complete data to effectively operate its systems and processes, including:\n•\nassessing risk exposures and limits\n•\nmonitoring and detecting fraudulent transactions and cyber threats\n•\ndeveloping or maintaining models and other analytical and judgment-based estimations, including those that use machine learning or artificial intelligence\n•\nimplementing and maintaining compliance programs, and\n•\npreparing financial statements, disclosures and regulatory reports, as well as internal reporting\nAny deficiencies in JPMorganChase’s data management processes, including with respect to the accuracy or completeness of data, the timeliness of data collection, the analysis or validation of data, or the safeguarding of data could undermine the reliability and effectiveness of its operations, including:\n•\nrisk management practices, including inaccurate or untimely risk reporting \n•\ndelivery of regulatory reporting or internal or external financial reporting\n•\ncompliance practices, such as those relating to transaction monitoring, customer screening, blocking and rejecting transactions, recordkeeping or reporting\n•\nbusiness activities, such as those related to managing JPMorganChase's market-making positions and liquidity and capital levels, including reliance on timely data for informed decision-making\n•\nproviding services to clients and customers, including transaction processing, lending services, account management and customer support, or\n•\nfraud detection and prevention processes.\nAny or all of these factors could impair the ability of JPMorganChase to make sound business decisions, cause it to incur higher operational and compliance costs, result in operational breakdowns or failure to meet its regulatory requirements, negatively affect clients and customers, or lead to reputational harm.\nEnhanced regulatory and other standards for the oversight of vendors and other service providers can result in higher costs and other potential exposures.\nJPMorganChase must comply with enhanced regulatory and other standards associated with doing \n28\nbusiness with vendors and other service providers, including standards relating to the outsourcing of functions as well as the performance of significant banking and other functions by subsidiaries. JPMorganChase incurs significant costs and expenses in connection with its initiatives to address the risks associated with oversight of its internal and external service providers. JPMorganChase’s failure to appropriately assess and manage these relationships, especially those involving significant banking functions, shared services or other critical activities, could materially adversely affect JPMorganChase. Specifically, any such failure could result in:\n•\npotential harm to clients and customers, and any liability associated with that harm\n•\nregulatory fines, penalties or other sanctions\n•\nlower revenues, and the opportunity cost from lost revenues\n•\nincreased operational costs, or\n•\nharm to JPMorganChase’s reputation.\nJPMorganChase’s risk management framework and control environment will not be effective in identifying and mitigating every risk to JPMorganChase.\nAny inadequacy or lapse in JPMorganChase’s risk management framework, governance structure, practices, models or reporting systems, or in its control environment, could expose it to unexpected losses, and its financial condition or results of operations could be materially and adversely affected. Any such inadequacy or lapse could:\n•\nhinder the timely escalation of material risk issues to JPMorganChase’s senior management and Board of Directors\n•\nlead to business decisions that have negative outcomes for JPMorganChase\n•\nrequire significant resources and time to remediate\n•\nlead to non-compliance with laws, rules and regulations\n•\nattract heightened regulatory scrutiny\n•\nexpose JPMorganChase to litigation, regulatory investigations or regulatory fines, penalties or other sanctions\n•\nlead to potential harm to customers and clients, and any liability associated with that harm\n•\nharm its reputation, or \n•\notherwise diminish confidence in JPMorganChase.\nMany of JPMorganChase’s risk management strategies and techniques consider historical market behavior and to some degree are based on management’s subjective judgment or assumptions. For example, many models used by JPMorganChase are based on assumptions regarding historical \ncorrelations among prices of various asset classes or other market indicators. In times of market stress, including difficult or less liquid market environments, or in the event of other unforeseen circumstances, previously uncorrelated indicators may become correlated. Conversely, previously-correlated indicators may become uncorrelated at those times. Sudden market movements and unanticipated market or economic events could, in some circumstances, limit the effectiveness of JPMorganChase’s risk management strategies, causing it to incur losses.\nJPMorganChase could recognize unexpected losses, its capital levels could be reduced and it could face greater regulatory scrutiny if its models, estimations or judgments, including those used in its financial statements, are inadequate or incorrect.\nJPMorganChase has developed and uses a variety of models and other analytical and judgment-based estimations to measure, monitor and implement controls over its market, credit, capital, liquidity, operational and other risks. JPMorganChase also uses internal models and estimations as a basis for its stress testing and in connection with the preparation of its financial statements under U.S. generally accepted accounting principles (“U.S. GAAP”). \nThese models and estimations are based on a variety of assumptions and historical trends, and are periodically reviewed and modified as necessary. The models and estimations that JPMorganChase uses, including those that use machine learning or artificial intelligence, may not be effective in all cases to identify, observe and mitigate risk due to a variety of factors, such as:\n•\nreliance on historical trends that may not persist in the future, including assumptions underlying the models and estimations such as correlations among certain market indicators or asset prices\n•\ninherent limitations associated with forecasting uncertain economic and financial outcomes\n•\nhistorical trend information may be incomplete, or may not be indicative of severely negative market conditions such as extreme volatility, dislocation or lack of liquidity\n•\nsudden illiquidity in markets or declines in prices of certain loans and securities may make it more difficult to value certain financial instruments\n•\ntechnology that is introduced to run models or estimations may not perform as expected, or may not be well understood by the personnel using the technology\n•\nmodels and estimations may contain erroneous data, valuations, formulas or algorithms\n•\nreview processes may fail to detect flaws in models and estimations, and\n29\nPart I\n•\nmodels may inadvertently incorporate biases present in data used in the models.\nJPMorganChase may experience unexpected losses if models, estimates or judgments used or applied in connection with its risk management activities or the preparation of its financial statements are inadequate or incorrect. For example, where quoted market prices are not available for certain financial instruments that require a determination of their fair value, JPMorganChase may make fair value determinations based on internally developed models or other means which ultimately rely to some degree on management estimates and judgment. In addition, JPMorganChase may experience increased uncertainty in its estimates if assets acquired differ from those used to develop those models, which may lead to unexpected losses.\nSimilarly, JPMorganChase establishes an allowance for expected credit losses related to its credit exposures which requires significant judgments, including forecasts of how macroeconomic conditions might impair the ability of JPMorganChase’s clients and customers to repay their loans or other obligations. These types of estimates and judgments may not prove to be accurate due to a variety of factors, including when the current and forecasted environments are significantly different from the historical environments upon which the models were developed. The increased uncertainty may necessitate a greater degree of judgment and analytics to inform any adjustments that JPMorganChase may make to model outputs than would otherwise be the case.\nSome of the models and other analytical and judgment-based estimations used by JPMorganChase in managing risks are subject to review by, and require the approval of, JPMorganChase’s regulators. These reviews are required before JPMorganChase may use those models and estimations for calculating market risk RWA, credit risk RWA and operational risk RWA under Basel III. If JPMorganChase’s models or estimations are not approved by its regulators, it may be subject to higher capital charges, which could adversely affect its financial results or limit the ability to expand its businesses. \nLapses, weaknesses or deficiencies in controls over disclosure or financial reporting could materially affect JPMorganChase’s profitability or reputation.\nJPMorganChase’s businesses and operations are subject to complex and evolving laws, rules and regulations, both within and outside the U.S., requiring continuous enhancements to various disclosures in its financial statements and regulatory reports.\nThere can be no assurance that JPMorganChase’s disclosure controls and procedures will be effective in every circumstance, or that a material weakness or significant deficiency in internal control over financial reporting will not occur. Any such lapse, weakness or \ndeficiency could result in inaccurate financial reporting which, in turn, could:\n•\nmaterially and adversely affect JPMorganChase’s business and results of operations or financial condition\n•\nrestrict its ability to access the capital markets \n•\nrequire it to expend significant resources to correct the lapse, weakness or deficiency\n•\nexpose it to litigation or regulatory fines, penalties or other sanctions\n•\nharm its reputation, or \n•\notherwise diminish investor confidence in JPMorganChase. \nStrategic\nJPMorganChase’s results or competitive standing could suffer if its management fails to develop and execute effective business strategies, and to anticipate changes affecting those strategies.\nThe development and execution of effective business strategies by JPMorganChase’s management, along with the ability to anticipate and respond to shifts in the competitive environment, are critical to JPMorganChase's competitive standing and to achieving its strategic objectives. These strategies relate to:\n•\nthe products and services that JPMorganChase offers\n•\nthe geographies in which it operates\n•\nthe types of clients and customers that it serves\n•\nthe businesses that it acquires or in which it invests\n•\nthe counterparties with which it does business\n•\nthe technologies that it adopts or in which it invests, which may include new and currently unproven technologies, and\n•\nthe methods, distribution channels and third party service providers by or through which it offers products and services. \nIf management makes choices about these strategies and goals that prove to be incorrect, are based on incomplete, inaccurate or fraudulent information, do not accurately assess the competitive landscape and industry trends, or fail to address changing regulatory and market environments or the expectations of clients, customers, investors, employees and other stakeholders, then the franchise values and growth prospects of JPMorganChase’s businesses may suffer and its earnings could decline.\nJPMorganChase’s growth prospects also depend on management’s ability to develop and execute effective business plans to address these strategic priorities, both in the near term and over longer time horizons. Management’s effectiveness in this regard will affect \n30\nJPMorganChase’s ability to develop and enhance its resources, control expenses and return capital to shareholders. Each of these objectives could be adversely affected by any failure on the part of management to:\n•\ndevise effective business plans and strategies\n•\noffer products and services that meet changing expectations of clients and customers\n•\nallocate capital in a manner that promotes long-term stability to enable JPMorganChase to build and invest in market-leading businesses, even in a highly stressed environment\n•\nallocate capital appropriately due to imprecise modeling or subjective judgments made in connection with those allocations\n•\nappropriately assess and monitor principal investments made to enhance or accelerate JPMorganChase's business strategies \n•\nconduct appropriate due diligence on prospective business acquisitions or investments, or effectively integrate newly-acquired businesses\n•\nappropriately address concerns of clients, customers, investors, employees and other stakeholders, including with respect to climate and other ESG matters\n•\nreact quickly to changes in market conditions or market structures, or\n•\ndevelop and enhance the operational, technology, risk, financial and managerial resources and capabilities necessary to grow and manage JPMorganChase’s businesses.\nFurthermore, JPMorganChase may incur costs in connection with disposing of excess properties, premises and facilities, and those costs could be material to its results of operations.\nJPMorganChase faces significant and increasing competition in the rapidly evolving financial services industry.\nJPMorganChase operates in a highly competitive environment in which it must evolve and adapt to changes  in financial regulation, technological advances, increased public scrutiny and changes in economic conditions. JPMorganChase expects that competition in the U.S. and global financial services industry will continue to be intense. Competitors include:\n•\nother banks and financial institutions\n•\ntrading, advisory and investment management firms\n•\nfinance companies\n•\ntechnology companies, and\n•\nother non-bank firms that are engaged in providing similar as well as new products and services.\nJPMorganChase cannot provide assurance that the significant competition in the financial services industry will not materially and adversely affect its future results of operations. For example, aggressive or less disciplined lending practices by non-bank competitors could lead to a loss of market share for traditional banks, and in an economic downturn could result in instability in the financial services industry and adversely impact other market participants, including JPMorganChase.\nNew competitors in the financial services industry continue to emerge. For example, technological advances and the growth of e-commerce have made it possible for non-depository institutions to offer products and services that traditionally were banking products. These advances have also allowed financial institutions and other companies to provide electronic and internet-based financial solutions, including electronic securities and cryptocurrency trading, lending and other extensions of credit to consumers, payments processing and online automated algorithmic-based investment advice. Furthermore, both financial institutions and their non-banking competitors face the risk that payments processing and other products and services, including deposits and other traditional banking products, could be significantly disrupted by the use of new technologies, such as cryptocurrencies and other applications using secure distributed ledgers, that may not require intermediation. New technologies have required and could require JPMorganChase to spend more to modify or adapt its products to attract and retain clients and customers or to match products and services offered by its competitors, including technology companies. In addition, new technologies may be used by customers, or breached or infiltrated by third parties, in unexpected ways, which can increase JPMorganChase’s costs for complying with laws, rules and regulations that apply to the offering of products and services through those technologies and reduce the income that JPMorganChase earns from providing products and services through those technologies.\nOngoing or increased competition may put pressure on the pricing for JPMorganChase’s products and services or may cause JPMorganChase to lose market share, particularly with respect to traditional banking products. This competition may be based on quality and variety of products and services offered, transaction execution, innovation, reputation and price. The failure of any of JPMorganChase’s businesses to meet the expectations of clients and customers, whether due to general market conditions, under-performance, a decision not to offer a particular product or service, changes in client and customer expectations or other factors, could affect JPMorganChase’s ability to attract or retain clients and customers. Any such impact could, in turn, reduce \n31\nPart I\nJPMorganChase’s revenues. Increased competition also may require JPMorganChase to make additional capital investments in its businesses, or to extend more of its capital on behalf of its clients to remain competitive.\nThe effects of climate change could adversely affect JPMorganChase’s business and operations, both directly and as a result of impacts on its clients and customers.\nJPMorganChase operates in many regions, countries and communities around the world where its business, and the activities of its clients and customers, could be adversely affected by climate change. Climate change could manifest as a financial risk to JPMorganChase either through changes in the physical climate or from the process of transitioning to a lower-carbon economy. Both physical risks and transition risks associated with climate change could have negative impacts on the financial condition or creditworthiness of JPMorganChase’s clients and customers, on JPMorganChase's exposure to affected companies and markets, and on the effectiveness of JPMorganChase’s existing business strategy with respect to its operations, clients and customers.\nPhysical risks include the increased frequency or severity of acute weather events, such as floods, wildfires and tropical cyclones, and chronic shifts in the climate, such as rising sea levels, persistent changes in precipitation levels, or increases in average ambient temperatures. Potential adverse impacts of climate-related physical risks to JPMorganChase, its clients or customers include:\n•\ndeclines in asset values, including due to the destruction or degradation of property\n•\nreduced availability or increased cost of insurance for clients of JPMorganChase\n•\ninterruptions to business operations, including supply chain disruption, and\n•\npopulation migration or unemployment in affected regions.\nTransition risks arise from the financial and economic consequences of society’s shift towards a lower-carbon economy, such as changes in public policy, adoption of new technologies or changes in consumer preferences towards low-carbon goods and services. These risks could also be influenced by changes in the physical climate. Potential adverse impacts of transition risks to JPMorganChase, its clients or customers include:  \n•\nsudden devaluation of assets, including unanticipated write-downs (“stranded assets”)\n•\nincreased operational and compliance costs driven by changes in climate policy  \n•\nincreased energy costs driven by governmental actions and initiatives such as emission pricing and accelerated decarbonization policies\n•\nnegative consequences to business models, and the need to make changes in response to those consequences, and\n•\ndamage to JPMorganChase’s reputation, including due to any perception that its business practices are contrary to public policy or the preferences of different stakeholders. \nClimate risks can also arise from inconsistencies and conflicts in the manner in which climate policy and financial regulations are implemented in the many regions where JPMorganChase operates, including initiatives to apply and enforce policy and regulation with extraterritorial effect. Additionally, internal models and estimations used in climate risk assessments have an increased level of uncertainty due to limited historical trend information and the absence of standardized, reliable and comprehensive greenhouse gas emissions data, which could lead to inaccurate disclosures or financial reporting. \nConduct\nConduct failure by JPMorganChase employees can harm clients and customers, impact market integrity, damage JPMorganChase’s reputation and trigger litigation and regulatory action.\nJPMorganChase’s employees interact with clients, customers, counterparties and other market and industry participants, and with each other, every day. All employees are expected to demonstrate values and exhibit the behaviors that are an integral part of JPMorganChase’s Code of Conduct and Business Principles. JPMorganChase endeavors to embed conduct risk management throughout an employee’s life cycle, including recruiting, onboarding, training and development, and performance management. Conduct risk management is also an integral component of JPMorganChase’s promotion and compensation processes.\nNotwithstanding these expectations, policies and practices, certain employees have engaged in improper or illegal conduct in the past. These instances of misconduct have resulted in litigation, and resolutions of governmental investigations or enforcement actions involving consent orders, deferred prosecution agreements, non-prosecution agreements and other civil or criminal sanctions. There is no assurance that further inappropriate or unlawful actions by employees have not occurred or will not occur, lead to a violation of the terms of these resolutions (and associated consequences), or that any such actions will always be detected, deterred or prevented.\nJPMorganChase’s reputation could be harmed by, and collateral consequences could result from, a failure by \n32\none or more employees to conduct themselves in accordance with JPMorganChase’s expectations, policies and practices, including by acting in ways that harm clients, customers, other market participants, employees or others. Some examples of this include:\n•\nimproperly selling and marketing JPMorganChase’s products or services\n•\nengaging in insider trading, market manipulation or unauthorized trading\n•\nengaging in improper or fraudulent behavior in connection with government relief programs\n•\nfacilitating a transaction where a material objective is to achieve a particular tax, accounting or financial disclosure treatment that may be subject to scrutiny by governmental or regulatory authorities, or where the proposed treatment is unclear or may not reflect the economic substance of the transaction\n•\nfailing to fulfill fiduciary obligations or other duties owed to clients or customers\n•\nviolating antitrust or anti-competition laws by colluding with other market participants\n•\nusing electronic communications channels that have not been approved by JPMorganChase\n•\nengaging in discriminatory behavior or harassment with respect to clients, customers or employees, or acting contrary to JPMorganChase’s goal of fostering an inclusive workplace\n•\nmanaging or reporting risks in ways that subordinate JPMorganChase’s risk appetite to business performance goals or employee compensation objectives, and\n•\nmisappropriating property, confidential or proprietary information, or technology assets belonging to JPMorganChase, its clients and customers or third parties.\nThe consequences of any failure by one or more employees to conduct themselves in accordance with JPMorganChase’s expectations, policies or practices could include litigation, or regulatory or other governmental investigations or enforcement actions. Any of these proceedings or actions could result in judgments, settlements, fines, penalties or other sanctions, or lead to:\n•\nfinancial losses\n•\nincreased operational and compliance costs\n•\ngreater scrutiny by regulators and other parties\n•\nregulatory actions that require JPMorganChase to restructure, curtail or cease certain of its activities\n•\nthe need for significant oversight by JPMorganChase’s management\n•\nloss of clients or customers, and\n•\nharm to JPMorganChase’s reputation.\nThe foregoing risks could be heightened with respect to newly-acquired businesses if JPMorganChase fails to successfully integrate employees of those businesses or any of those employees do not conduct themselves in accordance with JPMorganChase's expectations, policies and practices.\nReputation\nDamage to JPMorganChase’s reputation could harm its businesses.\nMaintaining trust in JPMorganChase is critical to its ability to attract and retain clients, customers, investors and employees. Damage to JPMorganChase’s reputation can therefore cause significant harm to JPMorganChase’s business and prospects, and can arise from numerous sources, including:\n•\nemployee misconduct, including discriminatory behavior or harassment with respect to clients, customers or employees, or actions that are contrary to JPMorganChase’s goal of fostering an inclusive workplace\n•\nsecurity breaches, including as a result of cyber attacks\n•\nfailure to safeguard client, customer or employee information\n•\nfailure to manage risks associated with its client relationships, or with transactions or business activities in which JPMorganChase or its clients engage, including transactions or activities that may be unpopular among one or more constituencies\n•\nrapid and broad dissemination of misinformation and disinformation across the media landscape, including social networking sites\n•\nincorrect, biased or misleading results or content generated by artificial intelligence, leading to harmful outcomes, including discrimination in lending practices against vulnerable populations, fraud, manipulation of customers, privacy breaches or intellectual property infringement\n•\ndeficiencies or perceived failures in managing ESG-related initiatives, including modifying or failing to meet publicly-announced targets\n•\noperational failures\n•\nlitigation or regulatory fines, penalties or other sanctions \n•\nactions taken in executing regulatory and governmental requirements during a global or regional health emergency, spread of infectious disease, epidemic or pandemic\n•\nregulatory investigations or enforcement actions, or resolutions of these matters, and \n•\nfailure or perceived failure to comply with laws, rules or regulations by JPMorganChase or its clients, \n33\nPart I\ncustomers, counterparties or other parties, including newly-acquired businesses, companies in which JPMorganChase has made principal investments, parties to joint ventures with JPMorganChase, and vendors with which JPMorganChase does business.\nSocial and environmental activists have been targeting JPMorganChase and other financial services firms with public criticism concerning their business practices, including business relationships with clients that are engaged in certain sensitive industries, such as companies:\n•\nwhose products are or are perceived to be harmful to human health, or\n•\nwhose activities negatively affect or are perceived to negatively affect the environment, workers’ rights or communities. \nActivists have also taken actions intended to change or influence JPMorganChase’s business practices with respect to ESG matters, including public protests at JPMorganChase’s headquarters and other properties, and submitting specific ESG-related proposals for a vote by JPMorganChase’s shareholders.\nIn addition, JPMorganChase has been and expects that it will continue to be criticized by activists, politicians and other members of the public concerning business practices or positions taken by JPMorganChase with respect to matters of public policy (such as diversity, equity and inclusion initiatives) or regarding transactions or other business or interactions between JPMorganChase and governmental or regulatory bodies. Furthermore, JPMorganChase's relationships or ability to transact with clients and customers, and with governmental or regulatory bodies in jurisdictions in which JPMorganChase does business, could be adversely affected if its decisions with respect to doing business with companies in certain sensitive industries are perceived to harm those companies or to align with particular political viewpoints. The foregoing types of criticism can be more widespread during election years in various jurisdictions, and could have the effect of focusing attention on a company such as JPMorganChase as part of a wider public debate on public policy matters. Furthermore, JPMorganChase's participation in or association with certain environmental and social industry groups or initiatives could be viewed by activists or governmental authorities as boycotting or other discriminatory business behavior.\nThese and other types of criticism and actions directed at JPMorganChase could potentially engender dissatisfaction among clients, customers, investors, employees, government officials and other stakeholders. In all of these cases, JPMorganChase’s reputation and its business and results of operations could be harmed by:\n•\ngreater scrutiny from governmental or regulatory bodies, or further criticism from politicians and other members of the public, including in the form of governmental or regulatory investigations or litigation\n•\nunfavorable coverage or commentary in the media, including through social media campaigns\n•\ncertain clients and customers ceasing doing business with JPMorganChase, and encouraging others to do so\n•\nimpairment of JPMorganChase’s ability to attract new clients and customers, to expand its relationships with existing clients and customers, or to hire or retain employees, or\n•\ncertain investors opting to divest from investments in securities of JPMorganChase.\nActions by the financial services industry generally or individuals in the industry can also affect JPMorganChase’s reputation. For example, the reputation of the industry as a whole can be damaged by concerns that:\n•\nconsumers have been treated unfairly by a financial institution, or\n•\na financial institution has acted inappropriately with respect to the methods used to offer products to customers.\nIf JPMorganChase is perceived to have engaged in these types of behaviors, this could weaken its reputation among clients or customers, employees or other stakeholders.\nFailure to effectively manage potential conflicts of interest or to satisfy fiduciary obligations can result in litigation and enforcement actions, as well as damage JPMorganChase’s reputation.\nJPMorganChase’s ability to manage potential conflicts of interest is highly complex due to the broad range of its business activities which encompass a variety of transactions, obligations and interests with and among JPMorganChase’s clients and customers. JPMorganChase can become subject to litigation, enforcement actions, and heightened regulatory scrutiny, and its reputation can be damaged, by the failure or perceived failure to:\n•\nadequately address or appropriately disclose conflicts of interest, including potential conflicts of interest that may arise in connection with providing multiple products and services in, or having one or more investments related to, the same transaction\n•\nidentify and address any conflict of interest that a third party with which it is does business may have with respect to a transaction involving JPMorganChase\n•\ndeliver appropriate standards of service and quality\n34\n•\ntreat clients and customers fairly and with the appropriate standard of care\n•\nuse client and customer data responsibly and in a manner that meets legal requirements and regulatory expectations\n•\nprovide fiduciary products or services in accordance with the applicable legal and regulatory standards, or \n•\nhandle or use confidential information of customers or clients appropriately and in compliance with applicable data protection and privacy laws, rules and regulations. \nA failure or perceived failure to appropriately address conflicts of interest or fiduciary obligations could result in customer dissatisfaction, litigation and regulatory fines, penalties or other sanctions, and heightened regulatory scrutiny and enforcement actions, all of which can lead to lost revenue and higher operating costs and cause serious harm to JPMorganChase’s reputation.\nCountry\nAn outbreak or escalation of hostilities between countries or within a country or region could have a material adverse effect on the global economy and on JPMorganChase’s businesses within the affected region or globally. \nAggressive actions by hostile governments or groups, including armed conflict or intensified cyber attacks, could expand in unpredictable ways by drawing in other countries or escalating into full-scale war with potentially catastrophic consequences, particularly if one or more of the combatants possess nuclear weapons. Depending on the scope of the conflict, the hostilities could result in:\n•\nworldwide economic disruption\n•\nheightened volatility in financial markets\n•\nsevere declines in asset values, accompanied by widespread sell-offs of investments\n•\nsudden increases in prices in the energy and commodity markets or for certain safe haven currencies\n•\nsubstantial depreciation of local currencies, potentially leading to defaults by borrowers and counterparties in the affected region\n•\ndisruption of global trade\n•\ndiminished consumer, business and investor confidence\n•\nrefugee and humanitarian crises, and\n•\nnew economic sanctions or other regulatory requirements, including those that introduce exceptional compliance challenges for multinational companies such as JPMorganChase.\nAny of the above consequences could have significant negative effects on JPMorganChase’s operations and earnings, both in the countries or regions directly affected by the hostilities or globally. Further, if the U.S. were to become directly involved in such a conflict, this could lead to a curtailment of any operations that JPMorganChase may have in the affected countries or region, as well as in any nation that is aligned against the U.S. in the hostilities. JPMorganChase could also experience more numerous and aggressive cyber attacks launched by or under the sponsorship of one or more of the adversaries in such a conflict.\nJPMorganChase’s business and operations in certain countries can be adversely affected by local economic, political, regulatory and social factors.\nSome of the countries in which JPMorganChase conducts business have economies or markets that are less developed and more volatile or may have political, legal and regulatory regimes that are less established or predictable than other countries in which JPMorganChase operates. In addition, in some jurisdictions in which JPMorganChase conducts business, the local economy and business activities are subject to substantial government influence or control. Some of these countries have in the past experienced economic disruptions, including:\n•\nextreme currency fluctuations\n•\nhigh inflation\n•\nlow or negative growth\n•\ndefaults or reduced ability to service sovereign debt and\n•\nincreased fraud or other misrepresentation of value.\nThe governments in these countries have sometimes reacted to these developments by imposing restrictive policies that adversely affect the local and regional business environment, such as:\n•\nprice, capital or exchange controls, including imposition of punitive transfer and convertibility restrictions or forced currency exchange\n•\nexpropriation or nationalization of assets, including client assets, or confiscation of property, including intellectual property, and\n•\nchanges in laws, rules and regulations. \nThe impact of these actions could be accentuated in trading markets that are smaller, less liquid and more volatile than more-developed markets. These types of government actions can negatively affect JPMorganChase’s operations in the relevant country, either directly or by suppressing the business activities of local clients or multi-national clients that conduct business in the jurisdiction. \nIn addition, emerging markets countries, as well as more developed countries, have been susceptible to \n35\nPart I\nunfavorable social developments arising from poor economic conditions or governmental actions, including: \n•\nwidespread demonstrations, civil unrest or general strikes \n•\ncrime and corruption\n•\nsecurity and personal safety issues\n•\nan outbreak or escalation of hostilities, or other geopolitical instabilities\n•\noverthrow of incumbent governments\n•\nterrorist attacks, and \n•\nother forms of internal discord. \nThese economic, political, regulatory and social developments have in the past resulted in, and in the future could lead to, conditions that can adversely affect JPMorganChase’s operations in those countries and impair the revenues, growth and profitability of those operations. In addition, any of these events or circumstances in one country can affect JPMorganChase’s operations and investments in another country or countries, including in the U.S.\nPeople\nJPMorganChase’s ability to attract and retain qualified employees is critical to its success.\nJPMorganChase’s employees are its most important resource, and in many areas of the financial services industry, competition for qualified personnel is intense. JPMorganChase endeavors to attract talented  new employees from a variety of backgrounds and retain, develop and motivate its existing employees. JPMorganChase's efforts to hire and retain talented  employees could be hindered by factors such as:\n•\nthe emerging need for more-skilled workers in an evolving labor and workplace environment, including due to changes in technology\n•\ntargeted recruitment of JPMorganChase employees by competitors, and\n•\nmodifications to or discontinuation of JPMorganChase's hybrid work models.\nJPMorganChase's performance and competitive position could be materially and adversely affected if it is unable to attract or retain qualified employees for its workforce or to devise and execute effective succession planning for key leadership roles, such as the Chief Executive Officer, members of the Operating Committee and other senior leaders.\nIn addition, advances in technology, such as automation and artificial intelligence, may lead to workforce displacement. This could require JPMorganChase to invest in additional employee training, manage impacts on morale and retention, and compete for employment candidates who possess more advanced technological skills, all of which could \nhave a negative impact on JPMorganChase's business and operations. \nUnfavorable changes in immigration or travel policies could adversely affect JPMorganChase’s businesses and operations.\nJPMorganChase relies on the skills, knowledge and expertise of employees located throughout the world. Changes in immigration or travel policies in the U.S. and other countries that unduly restrict or otherwise make it more difficult for employees or their family members to work in, or travel to or transfer between, jurisdictions in which JPMorganChase has operations or conducts its business could inhibit JPMorganChase’s ability to attract and retain qualified employees, and thereby dilute the quality of its workforce, or could prompt JPMorganChase to make structural changes to its worldwide or regional operating models that cause its operations to be less efficient or more costly.\nLegal\nJPMorganChase faces significant legal risks from litigation and formal and informal regulatory and government investigations.\nJPMorganChase is named as a defendant or is otherwise involved in many legal proceedings, including class actions, derivative actions and other litigation or disputes with third parties, as well as criminal proceedings. Actions currently pending against JPMorganChase may result in judgments, settlements, fines, penalties or other sanctions adverse to JPMorganChase. Any of these matters could materially and adversely affect JPMorganChase’s business, financial condition or results of operations, or cause serious reputational harm. As a participant in the financial services industry, it is likely that JPMorganChase will continue to experience a high level of litigation and regulatory and government investigations related to its businesses and operations.\nRegulators and other government agencies conduct examinations of JPMorganChase and its subsidiaries both on a routine basis and in targeted exams, and JPMorganChase’s businesses and operations are subject to heightened regulatory oversight. This heightened regulatory scrutiny, or the results of such an investigation or examination, may lead to additional regulatory investigations or enforcement actions. There is no assurance that those actions will not result in resolutions or other enforcement actions against JPMorganChase. Furthermore, a single event involving a potential violation of law or regulation may give rise to numerous and overlapping investigations and proceedings, either by multiple federal, state or local agencies and officials in the U.S. or, in some instances, regulators and other governmental officials in non-U.S. jurisdictions.\n36\nIn addition, if another financial institution violates a law or regulation relating to a particular business activity or practice, this will often give rise to an investigation by regulators and other governmental agencies of the same or similar activity or practice by JPMorganChase. \nJPMorganChase could become subject to a significant regulatory investigation and be unable to disclose specific information concerning that investigation to the public if such a disclosure would violate JPMorganChase’s obligations under applicable rules and regulations to maintain the confidentiality of confidential supervisory information, even if the resolution of that investigation could have a material adverse effect on JPMorganChase’s business, operations, results or financial condition.\nRegulatory investigations, examinations or other initiatives by U.S. and non-U.S. governmental authorities may subject JPMorganChase to judgments, settlements, fines, penalties or other sanctions, and may require JPMorganChase to restructure its operations and activities or to cease offering certain products or services. All of these potential outcomes could harm JPMorganChase’s reputation or lead to higher operational costs, thereby reducing JPMorganChase’s profitability, or result in collateral consequences. In addition, the extent of JPMorganChase’s exposure to legal and regulatory matters can be unpredictable and could, in some cases, exceed the amount of reserves that JPMorganChase has established for those matters.\n37\nParts I and II",
    "item1b": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C. Cybersecurity.\nRefer to the Operational Risk Management section of Management’s discussion and analysis on pages 153–156 for a discussion of cybersecurity risk."
  }
}