{
  "ticker": "K",
  "cik": "0000055067",
  "company_name": "KELLANOVA",
  "filing_date": "2025-02-21",
  "accession": "0001628280-25-007118",
  "primary_doc": "k-20241228.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nThe Company.\n Kellanova (formerly Kellogg Company), founded in 1906 and incorporated in Delaware in 1922, and its subsidiaries are engaged in the manufacture and marketing of snacks and convenience foods.\nThe address of the principal business office of Kellanova is 412 N. Wells Street, Chicago, Illinois 60654. Unless otherwise specified or indicated by the context, “Kellanova,” the \"Company,\" “we,” “us” and “our” refer to Kellanova, its divisions and subsidiaries.\nOn October 2, 2023, the Company completed the separation of its North America cereal business resulting in two independent companies, Kellanova and WK Kellogg Co. As a result of the distribution, Kellanova shareowners of record on September 21, 2023, received one share of WK Kellogg Co common stock for every four shares of Kellanova common stock.  \nReported results were prepared in accordance with U.S. GAAP, include all net sales and expenses recognized during the periods, and reflect WK Kellogg Co as discontinued operations for fiscal years 2023 and 2022. All\namounts, percentages and disclosures for all periods presented reflect only the continuing operations of Kellanova unless otherwise noted. See the discussion in",
    "item1a": "Item 1A should be read in conjunction with this",
    "item1c": "Item 1C.\n \nGovernance\n.  \nThe Kellanova Board of Directors has risk oversight responsibility for Kellanova, which it administers directly and with assistance from its committees.  Oversight of the information security program sits with the Audit Committee.  \nThe \nAudit Committee\n has oversight responsibilities with respect to ERM, including cybersecurity, information security and data protection risk exposures, and the steps management has taken to monitor and control these exposures.\n \nIn addition to periodically providing the Executive Management Team with information and cybersecurity briefings, the \nChief Digital and Information Officer (“CDIO”) and Chief Information Security Officer (“CISO”)\n provide at least biannual updates to the Audit Committee regarding cybersecurity, including on strategy and the Company's cybersecurity program.\n  For cybersecurity incidents, the Company’s cybersecurity incident response plan includes a process for incidents to be evaluated for material impact. The escalation protocol includes reporting of security incidents to members of the Kellanova Executive Management Team and reporting of any cyber incidents that could have a material impact on the Company to the Audit Committee.\n \nAs mentioned above, the CISO is the management position with primary responsibility for the development, operation, and maintenance of our information security program. The Company’s CISO has work experience in various roles in risk management, including developing information and cybersecurity strategy/programs, information security audit and assessments, cybersecurity operations focused on identification, mitigation and \n34\nresponse to cybersecurity threats.  The CISO has experience leading enterprise global efforts to align systems to industry-accepted standards and practices, as well as regulatory compliance requirements.  The CISO has degrees in the areas of management of information systems and cybersecurity, and also maintains several information security and technology certifications, including as a Certified Information System Security Professional (“CISSP”) and Boardroom Certified Qualified Technology Expert (“QTE”).      \nThe CISO reports directly to the CDIO, who is a member of the Kellanova Executive Management Team.  The Company’s CDIO has technology experience overseeing and executing technology strategies in complex, global, and matrixed environments.  The CDIO has been in role since February 2019, bringing experience from overseeing and executing technology as European CIO at the Company, and over 20 years of experience leading IT strategy and change initiatives in the consumer packaged goods and manufacturing industries.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\n33"
  }
}