{
  "ticker": "KDP",
  "cik": "0001418135",
  "company_name": "Keurig Dr Pepper Inc.",
  "filing_date": "2025-02-25",
  "accession": "0001418135-25-000013",
  "primary_doc": "kdp-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.   BUSINESS\nOUR COMPANY\nKeurig Dr Pepper Inc. is a leading beverage company in North America that manufactures, markets, distributes, and sells hot and cold beverages and single serve brewing systems. KDP has a broad portfolio of iconic beverage brands, including Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, and The Original Donut Shop, as well as the Keurig brewing system. We have some of the most recognized beverage brands in North America, with significant consumer awareness levels and long histories that evoke strong emotional connections with consumers. We have a portfolio of more than 125 owned, licensed, and partner brands, as well as powerful distribution capabilities. \nKDP was created on July 9, 2018, through the combination of the business operations of Keurig, a leading producer of innovative single serve brewing systems and specialty coffee in the U.S. and Canada, and DPS, a company built over time through a series of strategic acquisitions that brought together iconic beverage brands in North America. Today, we trade on Nasdaq under the symbol KDP.\nOUR STRENGTHS AND STRATEGY\nOur strategic framework starts with our purpose to \nDrink Well. Do Good. \nWe aim to enhance the experience of every beverage occasion and to make a positive impact for people, communities, and the planet. Our vision is to be a total beverage leader, offering a beverage for every need, anytime, anywhere. We support our purpose and vision with five key strategies:\nChampion consumer-obsessed brand building.\n \nWe own a diverse portfolio of well-known beverage brands. Many of our brands enjoy high levels of consumer awareness, preference, and loyalty rooted in their rich heritage. This portfolio provides our customers with a wide variety of products to meet consumers' needs and provides us with a platform for growth and profitability. We drive growth in our business through investments in innovation, renovation, and marketing to support our portfolio of owned brands and partnerships with other leading beverage brands. We lead with deep consumer insights that inform our brand positioning and surface opportunities to address unmet needs. We have a robust innovation program, which is designed to meet consumers' changing flavor and beverage preferences and to grow our share of beverage occasions. \nAmplify our route-to-market advantage.\n \nWe have strategically-located distribution capabilities, which enable us to better align our operations with our customers and our sales channels, to ensure our products are available to meet consumer demand, to reduce transportation costs, and to have greater control over the timing and coordination of new product launches. We actively manage transportation of our products using our fleet (owned and leased) of approximately 7,100 vehicles in the U.S. and 2,200 in Mexico, as well as third party logistics providers. \nWith our Keurig.com website, we have a leading direct-to-consumer e-commerce platform which provides us insights and expertise in the e-commerce channel. We have been able to translate those insights and experiences to our LRB business as the number of fulfillment options that are better suited economically for beverages has evolved, leading to growth in the e-commerce channel. We continually invest in digital tools and capabilities as part of our route-to-market strategy, and as one element of a holistic digital transformation across KDP.\nShape our now and next beverage portfolio. \nWe have cultivated relationships with leading beverage brands to create long-term partnerships that enable us and our partners to benefit equitably in future value creation, and where appropriate, we bring these partner brands into our owned portfolio through acquisitions. We continually evaluate making investments in companies that fill in whitespace in our portfolio.\nGenerate fuel for growth. \nWe focus on critical transformational investments that drive continuous productivity and network optimization. We also maintain an emphasis on lean overheads in order to drive increasing operating leverage and fund our investments in our growth opportunities.\nDynamically allocate capital.\n \nOur highly efficient business model, focused on an optimized capital structure, gives us optionality to invest internally and pursue investments, partnerships, acquisitions, or other opportunities to continue to drive growth and create value.\n1\nTable of Contents\n \nOUR PRODUCTS AND OPERATING STRUCTURE\nWe are a leading integrated brand owner, manufacturer, and distributor of beverages in the U.S., Canada, Mexico, and the Caribbean. \nOperating and Reportable Segments\nAs of December 31, 2024, our operating structure consists of three operating and reportable segments: U.S. Refreshment Beverages, U.S. Coffee, and International. Segment financial data, including financial information about foreign and domestic operations, is included in Note 8 of the Notes to our Consolidated Financial Statements.\nU.S. Refreshment Beverages\nOur U.S. Refreshment Beverages segment is a brand owner, manufacturer, and distributor of LRBs in the U.S. In this segment, we manufacture and distribute beverage concentrates, syrups, and finished beverages of our brands to third-party bottlers, distributors, retailers, and, ultimately, the end consumer.\nWe manufacture beverage concentrates and syrups, which we then sell throughout the U.S. to third party bottlers or use them in our own manufacturing systems. Beverage concentrates, which are highly concentrated proprietary flavors, are combined with carbonation, water, sweeteners, and other ingredients, packaged in cans, bottles, or other packaging, and sold as a packaged beverage to retailers and, ultimately, the end consumer. Beverage concentrates are also manufactured into syrup, which is shipped to fountain customers, such as fast food restaurants, who mix the syrup with water and carbonation to create a finished beverage at the point of sale to consumers. Dr Pepper represents most of our fountain channel volume. \nWe manufacture and distribute finished beverages of our own beverage brands. Additionally, in order to maximize the size and scale of our manufacturing and distribution operations, we also distribute finished beverages for our partner brands and manufacture finished beverages for other third parties, including partners and private labels. We partner with other brands seeking effective route-to-market capabilities, including national selling and distribution scale. These brands can also give us exposure in certain markets to fast growing segments of the beverage industry in a capital-efficient manner. We sell finished beverages through our DSD and our WD systems, both of which include sales to all major retail channels.\nKey brands in this segment include Dr Pepper, Canada Dry, Mott’s, A&W, 7UP, Snapple, Sunkist soda, Squirt, C4 Energy, Hawaiian Punch, Electrolit, Core Hydration, Bai, Evian, Clamato, Yoo-Hoo, Vita Coco, and Big Red.\nU.S. Coffee\nOur U.S. Coffee segment is primarily a brand owner, manufacturer, and distributor of innovative single serve brewers, specialty coffee (including hot and iced varieties), and RTD coffee in the U.S. Our Keurig single serve brewers are aimed at changing the way consumers prepare and enjoy coffee and other beverages both at home and away from home in places such as offices, hotels, restaurants, cafeterias, and convenience stores. We create value by developing and selling our Keurig single serve brewers and by expanding Keurig brewer household adoption, which enables sales of specialty coffee and a variety of other specialty beverages in K-Cup pods (including hot and iced teas, hot cocoa, and other beverages) for use with Keurig brewers. We also compete in the broader coffee category through traditional whole bean and ground coffee in other package types, including bags, fractional packages, and cans, as well as RTD coffee beverages. We, together with our partners, are able to bring consumers high-quality coffee and other beverage experiences from the brands they love, all through the one-touch simplicity and convenience of Keurig brewers. \nWe manufacture and sell 100% of the K-Cup pods of our owned and licensed brands, including Green Mountain Coffee Roasters, The Original Donut Shop, and McCafé, to retailers, away from home channel participants, and end-use consumers. We manufacture K-Cup pods for our partner brands, who in turn sell them to retailers and consumers. Our partner brands include Starbucks, Dunkin', Folgers, and Peet's, among others. We have agreements for manufacturing, distributing, and selling K-Cup pods for tea under brands such as Celestial Seasonings and Bigelow. We produce and sell K-Cup pods for cocoa, including through a licensing agreement for the Swiss Miss brand, and hot apple cider, including under our own brand, Mott's. Generally, we are able to sell these partner brands to our away from home channel participants and directly to consumers through our website at www.keurig.com. We also participate in private label manufacturing arrangements. \n2\nTable of Contents\n \nOur U.S. Coffee segment manufactures K-Cup pods using freshly roasted and ground coffee as well as tea, cocoa, and other products. We offer high-quality, responsibly sourced coffee, including certified single-origin, organic, flavored, limited edition, and proprietary blends. We carefully select our coffee beans and roast them to optimize their taste and flavor differences. We engineer and design most of our single serve brewers and utilize third-party contract manufacturers located in various countries in Asia for brewer appliance manufacturing. We distribute our brewers using third-party distributors, retail partners and directly to consumers through our website at www.keurig.com.\nInternational\nOur International segment includes:\n•\nSales in Canada, Mexico, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages, including sales of our own brands and third-party brands, to third-party bottlers, distributors, and retailers. Key beverage brands include Peñafiel, Clamato, Squirt, Canada Dry, Dr Pepper, Mott’s, and Crush.\n•\nSales in Canada from the manufacture and distribution of finished goods relating to our single serve brewers, K-Cup pods, and other coffee products to partners and retailers, as well as directly to consumer through our website at www.keurig.ca. Key K-Cup pod brands include McCafé, Tim Hortons, and Van Houtte, as well as other partner and private label brands.\nProduct Innovation and New Partnerships\nWe are focused on a robust innovation pipeline within our portfolio of products to build household penetration of our business. We regularly launch new brewers with new features and benefits, technological advances, sustainable attributes, and changes in aesthetics to provide a variety of options to suit individual consumer preferences. We also continuously innovate and renovate our portfolio of K-Cup pods and beverages to provide an expansive array of flavors. \nEffective December 31, 2024, we acquired a controlling interest in GHOST. Founded in 2016, GHOST is a lifestyle sports nutrition business with a portfolio anchored by GHOST Energy, a leading ready-to-drink energy brand. We initially purchased a 60% stake in GHOST, and we also entered into an agreement which requires us to buy the remaining 40% of GHOST in 2028.\nDuring 2024, we launched our Keurig K-Brew+Chill brewer that features Quick Chill Technology which delivers iced beverages at temperatures below 60 degrees straight from the brewer, as well as the ability to brew hot beverages. In addition, we announced our multi-year innovation agenda with the Keurig Alta brewer and K-Rounds plastic- and aluminum-free pods.\nWe debuted Canada Dry Fruit Splash, which partners classic ginger ale with cherry flavors and a splash of real fruit juice, as well as a limited edition offering of Dr Pepper Creamy Coconut. We launched Mott’s Active, a hydrating juice beverage for kids with naturally sourced electrolytes, no added sugar, and no artificial flavors, in Blastin’ Berry and Watermelon Burst. \nWe entered into new partnerships with The Brooklyn Roasting Company, Kahawa 1893, Killah Coffee, and Punk Bunny Coffee, among others, to provide their signature coffee blends in K-Cup pod format. \nWe expanded our partnership with Black Rifle Coffee Company to include a sales and distribution agreement for Black Rifle Energy. We also entered into an agreement with Nutrabolt to distribute Bloom RTD energy beverages. We began distributing under both of these agreements during the fourth quarter of 2024.\n3\nTable of Contents\n \nCUSTOMERS\nWe primarily serve the following types of customers: \nRetailers\nRetailers include supermarkets, hypermarkets, mass merchandisers, club stores, e-commerce retailers, office superstores, vending machines, fountains, grocery and drug stores, convenience stores, and other small outlets. Retailers purchase finished beverages, K-Cup pods, appliances, and accessories directly from us. Our portfolio of strong brands, operational scale and experience in the beverage industry has enabled us to maintain strong relationships with major retailers throughout the U.S., Canada, and Mexico. Our largest retailer, Walmart, represented approximately 16% of our consolidated net sales in 2024. Net sales to Walmart are included in all reportable segments.\nBottlers and Distributors\nIn the U.S. and Canada, we generally grant manufacturing and distribution licenses for our carbonated soft drinks to bottlers for specific geographic areas that are typically exclusive and long-term. These bottlers may be affiliated with Coca-Cola or with PepsiCo, or they may be independent. These agreements prohibit bottlers and distributors from selling the licensed products outside their exclusive territory and from selling any imitative products in that territory. Generally, we may terminate bottling and distribution agreements only for cause or change in control, and the bottler or distributor may terminate without cause upon giving certain specified notice and complying with other applicable conditions. These bottlers and distributor agreements may also contain provisions for fountain distribution rights, which are not exclusive for a territory, but generally do restrict bottlers from carrying imitative product in the territory. \nCertain other brands, such as Snapple, Bai, and Core, are licensed for distribution in various territories to bottlers and a number of smaller distributors such as beer wholesalers, wine and spirit distributors, independent distributors, and retail brokers. \nPartners\nWe have differentiated ourselves and the Keurig brand through our ability to create and sustain partnerships with other leading coffee, tea, and beverage brand companies through multi-year licensing and manufacturing agreements that best suit each brand's interests and strengths. Typically, we manufacture K-Cup pods on behalf of our partners, who in turn sell them to retailers.\nAway from Home Channel Participants\nWe distribute brewers, accessories, and K-Cup pods (owned, licensed, and partner brands) to away from home channel participants, which include office coffee distributors and hotel chains. \nEnd-use Consumers\nWe have robust e-commerce platforms at www.keurig.com and www.keurig.ca where end-use consumers can purchase brewers, accessories, K-Cup pods, and other coffee products, such as bagged traditional coffee and cold brew. \n4\nTable of Contents\n \nCOMPETITORS\nThe beverage industry is highly competitive and continues to evolve in response to changing consumer preferences. Competition is generally based on brand recognition, taste, quality, price, availability, selection, and convenience, among other factors. We compete with multinational corporations with significant financial resources. In our bottling and manufacturing operations, we also compete with a number of smaller bottlers and distributors and a variety of smaller, regional, and private label manufacturers. \nOur primary competitors include Coca-Cola, PepsiCo, Starbucks Corporation, The J.M. Smucker Company, The Kraft Heinz Company, and Nestlé S.A. Although these companies offer competing brands in categories we participate in, many are also our partners or customers, as they purchase beverage concentrates or K-Cup pods directly from us.\nMATERIAL RESOURCES \nRaw Materials\nThe principal raw materials we use in our business, which we commonly refer to as ingredients and materials, represent approximately 55% of our cost of sales and include green coffee, water, aluminum cans and ends, PET bottles and caps, including both virgin and rPET, CO\n2\n, sweeteners, paper products, K-Cup pod packaging materials, fruit, glass bottles and enclosures, cocoa, teas, juices, and other ingredients. We also use post-consumer recycled materials in the manufacturing of our single serve brewers. \nThe availability, quality, and costs of many of these materials have fluctuated, and may continue to fluctuate, over time. Additionally, under many of our supply arrangements for these raw materials, the price we pay fluctuates along with certain changes in indirect commodity costs, such as aluminum in the case of cans and ends, natural gas in the case of glass bottles, resin in the case of K-Cup pods, PET bottles and caps, corn in the case of sweeteners, and pulp in the case of paperboard packaging. \nWhen appropriate, we mitigate the exposure to volatility in the prices of certain commodities used in our production process and transportation to our customers through the use of various commodity derivative contracts or supplier pricing agreements. The intent of the contracts and agreements is to provide a certain level of predictability in our operating margins and our overall cost structure, while remaining in what we believe to be a competitive cost position. \nGreen Coffee\nWe develop and pursue direct relationships with farms, estates, cooperatives, cooperative groups, and exporters in order to purchase green coffee and to support our broader traceability and sustainable supply chain initiatives. We also purchase green coffee through outside brokers.\nEnergy and Transportation Costs\nIn addition to ingredients and packaging costs, we are significantly impacted by changes in fuel costs, which can also fluctuate substantially, due to the large truck fleet we operate in our distribution operations (reflected within SG&A expenses) and the energy costs consumed in the production process (reflected within cost of sales). \nWe are also significantly impacted by changes in other transportation costs, such as ocean freight and tariffs. Transportation costs associated with the transportation and import of certain raw materials and finished goods to our manufacturing and distribution facilities are reflected within cost of sales.\nIntellectual Property\nTrademarks and Patents\nWe possess a variety of intellectual property rights that are important to our business. We rely on a combination of trademarks, copyrights, patents, and trade secrets to safeguard our proprietary rights, including our brands, our technologies, and ingredient and production formulas for our products.\nWe own numerous trademarks in our portfolio within the U.S., Canada, Mexico, and other countries. Depending upon the jurisdiction, trademarks are valid as long as they are in use and/or their registrations are properly maintained. \n5\nTable of Contents\n \nIn many countries outside the U.S., Canada, and Mexico, the manufacturing and distribution rights to many of our CSD brands, including our Dr Pepper trademark and formula, are owned by third parties, including, in certain cases, competitors such as Coca-Cola.\nWe hold U.S. and international patents related to Keurig brewers and coffee pod technology. Of these, a majority are utility patents and the remainder are design patents. We view these patents as valuable assets but we do not view any single patent as critical to our success. We also have pending patent applications associated with our brewers and with coffee pod technology. We take steps that we believe are appropriate to protect such innovation. \nLicensing Arrangements\nWe license various trade names from our partners in order to manufacture and distribute K-Cup pods. Although these licenses vary in length and other terms, they generally are long-term, cover the entire U.S. and/or Canada, and may include royalty payments, upfront payments, or some combination of the two, to the partner in order to use their trade names to manufacture and/or distribute the K-Cup pods.\nWe license various trademarks from third parties, which generally allow us to manufacture and distribute certain products or brands throughout the U.S. and/or Canada and Mexico. For example, we license trademarks for Sunkist soda and Rose's from third parties. Although these licenses vary in length and other terms, they generally are long-term, cover the entire U.S. and/or Canada and Mexico and generally include a royalty payment to the licensor.\nFor beverages in emerging and fast growing categories where we may not currently have a brand presence, we license various trademarks from third party partners, which generally allow us to sell and distribute certain products or brands throughout the U.S., Canada, or Mexico. These partners view us as a distributor with strong route-to-market resources to grow their brands. Although these licenses vary in length and other terms, they generally are long-term and require a payment from the partner if the licensing agreement is terminated. In some instances, we make investments in these companies, which may include a path to acquire the company. As of December 31, 2024, our portfolio of partner brands included, but was not limited to, C4 energy drinks, Electrolit instant hydration beverages, evian water, Vita Coco coconut water, Polar Beverages seltzer water, La Colombe shelf-stable RTD coffee, Black Rifle Coffee Company energy drinks, and Peet's RTD coffee.\nSEASONALITY\nThe beverage market is subject to some seasonal variations. Our cold beverage sales are generally higher during the warmer months, while hot beverage sales are generally higher during the cooler months. Overall beverage sales can also be influenced by the timing of holidays and weather fluctuations. Sales of brewers and related accessories are generally higher during the second half of the year due to the holiday shopping season.\nHUMAN CAPITAL RESOURCES\nOur Employees\nWe have approximately 29,400 employees, primarily located in North America. In the U.S., we have approximately 22,400 employees, of which approximately 5,100 employees are covered by union collective bargaining agreements. In Mexico, we have approximately 5,300 employees, of which approximately 4,000 are covered by union collective bargaining agreements. In Canada, we have approximately 1,400 employees, with approximately 400 covered by union collective bargaining agreements. We also have approximately 300 employees in Europe and Asia.\nOur collective bargaining agreements generally address working conditions, as well as wage rates and benefits, and expire over varying terms over the next several years. We generally believe that these agreements can be renegotiated on terms satisfactory to us as they expire and that we have good relationships with our employees and any representative organizations for our unionized employees. \nOur compensation programs are designed to ensure that we attract and retain the right talent. We generally review and consider median market pay levels when assessing total compensation, but pay decisions are based on a more comprehensive set of considerations such as company performance, individual performance, experience, and internal equity. We continually monitor key talent metrics including employee engagement and employee turnover. \n6\nTable of Contents\n \nOur employee benefits programs strive to deliver competitive benefits that are effective in attracting and retaining talent, and that create a culture of well-being and inclusiveness, designed to support each team member’s unique needs. Our total package of benefits is designed to support the physical, mental, and financial health of our employees, and we currently provide access to medical, dental, vision, life insurance, retirement benefits, and disability benefits, as well as assistance with major life activities such as adoption, childbirth, and eldercare, among other benefits. \nOur Culture\nTogether with our employees, we created a set of core values that define how we work together and are the cornerstone of KDP's culture. We embrace a challenger mindset, which, together with our strategy and core values, are the unifying force for our team and guide our actions, each and every day. Our four core values are:\n•\nTeam First. \nWin together. Be the kind of person you want on your team.\n•\nDeliver Big.\n \nAchieve our commitments. Then push beyond the expected.\n•\nThink Bold. \nChallenge the usual. Dare to try something new.\n•\nBe Fearless and Fair.\n \nTell the truth with courage. Listen and act with respect. \nAdditionally, we have adopted a corporate code of conduct that applies to all of our employees, officers, and our Board, which lays the foundation for ethical behavior for our team. Our code of conduct is available on our website at http://www.keurigdrpepper.com.\nJust as each of our brands brings its own personality to our product portfolio, each of our employees brings their own unique set of experiences, perspectives, and flavor to our business. We believe that to best innovate and deliver for our consumers and customers, our workforce should represent them.\nEmployee Health and Safety\nKDP uses a wide variety of strategies and programs to support the health and safety of our employees. Our Environmental Health & Safety team considers all aspects of what our employees may encounter and works to minimize risk. Key to these efforts are data and preventive actions. KDP measures Lost Time Incident Rate, a reliable indication of Total Recordable Injuries Rate severity, and uses a risk reduction process that thoroughly analyzes injuries and near misses.\nOUR IMPACT\nAs a leading beverage company, we have the opportunity and responsibility to make a positive impact for people, communities, and planet. \nKDP Impact\n is our multi-year environmental, social, and governance agenda comprised of strategic initiatives that aim to make a positive impact with every drink. Rooted in action, realized through partnerships, and measured in results, we focus our commitments in the seven key impact areas where we can create meaningful change. These seven key impact areas are as follows:\n•\nClimate and nature action\n•\nWater use and stewardship \n•\nPackaging and circular economy\n•\nHuman rights, responsible sourcing, and supply chain livelihoods\n•\nConsumer health and well-being\n•\nEmployee health, safety, and well-being; and\n•\nCorporate governance and ethics.\nWe are committed to transparency and disclosure of our strategies, programs, progress, and governance. Our\n \nreport on our impact, which is issued annually, is available on our website at www.keurigdrpepper.com.\n7\nTable of Contents\n \nGOVERNMENTAL REGULATIONS ON OUR BUSINESS\nIn the normal course of our business, we are subject to a variety of federal, state, and local laws and regulations in the countries in which we do business. Regulations in the U.S., as well as jurisdictions including Canada, Mexico, and the European Union, apply to many aspects of our business, including our products and their ingredients, manufacturing, safety, labeling, transportation, packaging, advertising, and sale. For example, our products and their manufacturing, labeling, marketing, and sale in the U.S. are subject to various aspects of the Federal Food, Drug, and Cosmetic Act, the Federal Trade Commission Act, the Robinson-Patman Act, the Clayton Act, the Sherman Act, the Lanham Act, state consumer protection laws, and state warning and labeling laws, such as the state of California’s Safe Drinking Water and Toxic Enforcement Act of 1986.\nVarious countries, states, provinces, and other authorities have enacted eco-taxes, extended producer responsibility laws, deposit or reuse/refill mandates, fees on certain products or packaging, restrictions or bans on the use of certain types of packaging, including single-use plastics, and regulations on PFAS, and other chemicals of concern. Regulators have also expressed concerns about the processing and use of particular ingredients or additives in beverage products. Various jurisdictions have adopted, and others may seek to adopt, bans or restrictions on the use of certain ingredients or substances in products or packaging, as well as significant additional product labeling or warning requirements or limitations on the marketing or sale of our products because of what they contain or allegations that they cause adverse health effects. Certain cities and municipalities within the U.S. have passed various taxes on the distribution of sugar-sweetened and diet beverages, which are at different stages of enactment. We expect that legislation or regulations like those described above will continue to be proposed in the future at local, state and federal levels, both in the U.S. and elsewhere.\nOTHER INFORMATION\nWe are required to file annual, quarterly, and current reports, proxy statements and other information with the SEC. The SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at http://www.sec.gov.\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to the Exchange Act, are also available free of charge on our website at http://www.keurigdrpepper.com as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Information on any of our websites is not incorporated by reference in this document or any of our other filings with the SEC.\nMARKET AND INDUSTRY DATA\nThe market and industry data in this Annual Report on Form 10-K is from Circana, an independent industry source, and is based on retail dollar sales and sales volumes in 2024. Although we believe that this independent source is reliable, we have not verified the accuracy or completeness of this data or any assumptions underlying such data. Circana is a market information provider, primarily serving consumer packaged goods manufacturers and retailers. We use Circana data as our primary management tool to track market performance because it has broad and deep data coverage, is based on consumer transactions at retailers, and is reported to us weekly. Circana data provides measurement and analysis of marketplace trends such as market share, retail pricing, promotional activity, and distribution across various channels, retailers, and geographies. Measured categories provided to us by Circana include K-Cup pods, carbonated soft drinks, RTD teas and coffee, single serve and multi-serve juice and juice drinks, sports drinks, energy drinks, still waters, carbonated waters, and non-alcoholic mixers. Circana also provides data on other food items such as apple sauce. Circana data we present in this report is compiled from scanner transactions in key retail channels, including grocery stores, mass merchandisers (including Walmart), club stores (excluding Costco), drug chains, convenience stores, and gas stations. However, this data does not include the fountain or vending channels, or small independent retail outlets, which together represent a meaningful portion of the U.S. beverage market. This data does not include certain customers and e-commerce sales which represents a significant portion of our U.S. Coffee segment. Our market share data for our brewers is also based on information provided by Circana. The data presented for our brewers is based upon Circana’s Consumer Tracking Service for Coffeemakers in the U.S. and represents the twelve month period ended December 31, 2024.\n8\nTable of Contents",
    "item1a": "Item 1A, Risk Factors, in this Annual Report on Form 10-K.\n22\nTable of Contents",
    "item1b": "ITEM 1B.   UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.   CYBERSECURITY\nWe, and our third-party service providers, use information technology to support our global business processes and activities, which exposes us to cybersecurity risks. KDP’s overall risk management system includes ongoing cybersecurity risk assessment and reporting, incident management, and a diligence and risk management process for third-party service providers. Employees with network access participate in ongoing phishing, social engineering, and cybersecurity awareness training efforts, and we also conduct periodic tabletop exercises led by external consultants.\nOur cybersecurity risk assessment and reporting process leverages the National Institute of Standards and Technology’s Cybersecurity Framework and is managed by our CISO, whose team comprises both internal personnel and third-party cybersecurity consultants. The CISO provides periodic reports to management, including our CEO, as well as other executive leadership members, and to the \nAudit and Finance Committee of our Board\n, which has oversight for cybersecurity risk management. These reports include updates on critical cybersecurity risks and the threat landscape; updates on the status of ongoing cybersecurity improvement initiatives, the internal control environment, and ongoing internal audit activities; and, if relevant, the status of actions taken with respect to certain cybersecurity incidents identified during the period.\nWe have an overall incident management plan, which is intended to provide guidance and protocols to facilitate timely notification and communication to key internal and external stakeholders, as appropriate, during an incident. A subset of this incident management plan is our Security Incident Response Plan, or SIRP, which is based on leading cybersecurity incident response practices. Incidents may be escalated to the CISO, our Chief Information Officer, our Chief Legal Officer, or other members of management or the Board, depending on the severity of the incident, and are handled according to the SIRP protocols, which includes incident detection and analysis; containment, eradication and recovery; and post-incident monitoring. We have developed a framework for assessing the materiality of any such incidents, including a committee responsible for determining whether the incident is material for disclosure. The committee includes our CISO, our Chief Information Officer, our Chief Legal Officer, our Senior Vice President and Controller (Principal Accounting Officer), our head of Internal Audit, and other members of management with relevant subject matter expertise.\n \nOur CISO has more than 26 years of experience in cybersecurity and information technology, including, prior to joining KDP in 2019, more than 11 years as a principal in Ernst & Young’s cybersecurity practice. Our CISO reports directly to our Chief Information Officer, who also has over 37 years of experience in information technology and cybersecurity.\nTo date, we have not identified any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, which have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n For additional description of cybersecurity risks and potential related impacts on us, refer to the risk factors captioned “\nOur use of information technology and third-party service providers exposes us to cybersecurity breaches and other business disruptions that could adversely affect us\n” and “\nThe use of information technology by our third party commercial partners and service providers exposes us to business disruptions or other negative impacts that could adversely affect us\n” in"
  }
}