{
  "ticker": "KEY",
  "cik": "0000091576",
  "company_name": "KEYCORP /NEW/",
  "filing_date": "2025-02-21",
  "accession": "0000091576-25-000038",
  "primary_doc": "key-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOverview\nKeyCorp, organized in 1958 under the laws of the State of Ohio, is headquartered in Cleveland, Ohio. We are a BHC under the BHCA and one of the nation’s largest bank-based financial services companies, with consolidated total assets of approximately $187.2 billion at December 31, 2024. KeyCorp is the parent holding company for KeyBank National Association, its principal subsidiary, through which most of our banking services are provided. Through KeyBank and certain other subsidiaries, we provide a wide range of retail and commercial banking, commercial leasing, investment management, consumer finance, student loan refinancing, commercial mortgage servicing and special servicing, and investment banking products and services to individual, corporate, and institutional clients through two major business segments: Consumer Bank and Commercial Bank. \nAs of December 31, 2024, these services were provided across the country through KeyBank’s 944 full-service retail banking branches and a network of 1,182 ATMs in 15 states, as well as additional offices, online and mobile banking capabilities, including our national digital brand, Laurel Road, and a telephone banking call center. Additional information pertaining to our two business segments is included in the “Business Segment Results” section in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of this report, and in Note 25 (“Business Segment Reporting”) of the Notes to Consolidated Financial Statements presented in Item 8. Financial Statements and Supplementary Data, which are incorporated herein by reference. \nIn addition to the customary banking services of accepting deposits and making loans, our bank and its trust company subsidiary offer personal and institutional trust custody services, personal financial and planning services, access to mutual funds, treasury services, and international banking services. Through our bank, trust company, and registered investment adviser subsidiaries, we provide investment management services to clients that include large corporate and public retirement plans, foundations and endowments, high-net-worth individuals, and multi-employer trust funds established for providing pension or other benefits to employees.\nWe provide other financial services — both within and outside of our primary banking markets — through various nonbank subsidiaries. These services include community development financing, securities underwriting, investment banking and capital markets products, and brokerage. We also provide merchant services to businesses.\nKeyCorp is a legal entity separate and distinct from its banks and other subsidiaries. Accordingly, the right of KeyCorp, its security holders, and its creditors to participate in any distribution of the assets or earnings of its banks and other subsidiaries is subject to the prior claims of the creditors of such banks and other subsidiaries, except to the extent that KeyCorp’s claims in its capacity as a creditor may be recognized.\nWe derive the majority of our revenues within the United States from customers domiciled in the United States. Revenue from foreign countries and external customers domiciled in foreign countries was immaterial to our consolidated financial statements.\nDemographics\nOur management structure and basis of presentation is divided into two business segments, Consumer Bank and Commercial Bank. Note 25 (“Business Segment Reporting”) describes the products and services offered by each of these business segments and provides more detailed financial information pertaining to the segments, including changes in basis of presentation.\nThe Consumer Bank serves individuals and small businesses throughout our 15-state branch footprint and through our Laurel Road digital brand by offering a variety of deposit and investment products, personal finance and financial wellness services, lending, student loan refinancing, mortgage and home equity, credit card, treasury services, and business advisory services. In addition, wealth management and investment services are offered to assist non-profit and high-net-worth clients with their banking, trust, portfolio management, charitable giving, and related needs. \nThe Commercial Bank consists of the Commercial and Institutional operating segments. The Commercial operating segment is a full-service, commercial banking platform that focuses primarily on serving the borrowing, cash \n6\nTable of contents\nmanagement, and capital markets needs of middle market clients within Key’s 15-state branch footprint. The Institutional operating segment operates nationally in providing lending, equipment financing, and banking products and services to large corporate and institutional clients. The industry coverage and product teams have established expertise in the following sectors: Consumer, Energy, Healthcare, Industrial, Public Sector, Real Estate, and Technology. It is also a significant, national, commercial real estate lender and third-party master and special servicer of commercial mortgage loans. The operating segment includes the KBCM platform which provides a broad suite of capital markets products and services including syndicated finance, debt and equity underwriting, fixed income and equity sales and trading, derivatives, foreign exchange, mergers & acquisition and other advisory, and public finance. \nAdditional Information\nOur executive offices are located at 127 Public Square, Cleveland, Ohio 44114-1306, and our telephone number is (216) 689-3000. Our website is www.key.com, and the investor relations section of our website may be reached through www.key.com/ir. We make available free of charge, on or through the investor relations section of our website, annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), as well as proxy statements, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. Also posted on our website, and available in print upon request from any shareholder to our Investor Relations Department, are the charters for the committees of our Board of Directors, which includes the Audit Committee, Compensation and Organization Committee, Executive Committee, Nominating and Corporate Governance Committee, Risk Committee, and Technology Committee; our Corporate Governance Guidelines; the Code of Business Conduct and Ethics for our directors, officers, and employees; our Standards for Determining Independence of Directors; our policy for Review of Transactions Between KeyCorp and Its Directors, Executive Officers and Other Related Persons; our Statement of Political Activity; and our Corporate Responsibility Report. Within the time period required by the SEC and the NYSE, we will post on our website any amendment to the Code of Ethics and any waiver applicable to any senior executive officer or director. We also make available a summary of filings made with the SEC of statements of beneficial ownership of our equity securities filed by our directors and officers under Section 16 of the Exchange Act. The “Regulatory Disclosures & Filings” section under the “Financials” tab of the investor relations section of our website includes public disclosures concerning our historic annual and mid-year stress-testing activities under the Dodd-Frank Act and our quarterly regulatory capital disclosures under the third pillar of Basel III.\nInformation contained on or accessible through, including any reports available on, our website or any other website referenced in this report is not part of this report. References to websites in this report are intended to be inactive textual references only.\nShareholders may obtain a copy of any of the above-referenced corporate governance documents by writing to our Investor Relations Department at Investor Relations, KeyCorp, 127 Public Square, Mailcode OH-01-27-0737, Cleveland, Ohio 44114-1306; by calling (216) 689-4221; or by sending an e-mail to investor_relations@keybank.com.\n7\nTable of contents\nCompetition\nThe market for banking and related financial services is highly competitive and continuously evolving. Legislative, regulatory, economic, and technology changes, as well as consolidation within the financial services industry, could result in increased competition from new and existing market participants. Key competes with other providers of financial services, such as BHCs, commercial banks, savings associations, credit unions, mortgage banking companies, finance companies, mutual funds, insurance companies, investment management firms, private credit funds, investment banking firms, broker-dealers, financial technology companies, and other local, regional, national, and global institutions that offer financial services. Some of our competitors are larger and may have more financial resources, while some of our competitors enjoy fewer regulatory constraints and may have lower cost structures. The financial services industry has become more competitive as technology advances have lowered barriers to entry, enabling more companies, including nonbank companies, to provide financial services. Mergers and acquisitions have also led to increased concentration in the banking industry, placing added competitive pressure on Key’s core banking products and services as we see competitors enter some of our markets or offer similar products. We compete by offering quality products and innovative services at competitive prices, and by maintaining our product and service offerings to keep pace with customer preferences and industry standards. Successfully competing in our markets also depends on our ability to invest in technology and infrastructure, execute transactions reliably and effectively, maintain and enhance our reputation, and attract, retain, and motivate talented employees, all while prudently managing risks and expenses. For more information on competition and related risks, see",
    "item1a": "Item 1A. Risk Factors of this report.\nKey maintains an Information Security Program (the “IS Program”) to support the management of information security risk, including cybersecurity risk, across the organization.\n The IS Program is designed to protect Key’s\nclients, employees, third parties, and assets from threats by managing the confidentiality, availability, and integrity of\nKey’s information assets.\n \nOur Chief Information Security Officer (“\nCISO\n”), who is also the Enterprise Security\nExecutive, oversees the IS Program and its related policy and has overall responsibility for managing the appropriate identification and ownership of cybersecurity risks. Key’s Corporate Information Security Team, under the oversight of the CISO, is responsible for maintaining the IS Program, assessing program-level risks and threats to our information assets, and overseeing the proper level of investment in security resources.\nThe IS Program is designed to provide safeguards for Key’s assets through a series of administrative, technical,\nand physical controls. Key employs a variety of security practices and controls to protect information and assets,\nincluding, but not limited to, access controls, vulnerability scans, network monitoring, internal and external\npenetration testing, monitoring of vendor vulnerability notices and patch releases, scanning of systems and emails\nfor malware and other vulnerabilities, firewalls and intrusion detection and prevention systems, and dedicated\nsecurity personnel.\nAs described in more detail in “Risk Management — Overview” in Item 7 of this report and in “Cybersecurity\nGovernance” below, Key employs the “Three Lines of Defense” in its risk governance framework. Assessing,\nidentifying, and managing cybersecurity risk across the organization in support of the IS Program is a cross-functional effort that requires collaboration and direction from all lines of defense – the lines of business and support functions (First Line of Defense), Risk Management (Second Line of Defense), and the Risk Review Group (RRG), Key’s internal audit function (Third Line of Defense):\n•\nFirst Line of Defense – Lines of Business and Support Functions. Primary responsibility for day-to-day management of cybersecurity risk lies with the senior management of each of Key’s lines of business (LOB) and support functions. The LOB and support functions own and manage the individual processes and procedures that are used throughout the IS Program, implement and manage business-specific security controls, and enforce behavioral controls throughout the management structure.\n•\nSecond Line of Defense – Risk Management. Risk Management oversees risk and monitors the First Line of Defense controls. Operational Risk Management performs review and challenge of controls, monitors the operational risk profile, and ensures Key operates within its operational risk appetite. Compliance Risk Management provides an independent, enterprise-wide function that focuses on compliance with laws, rules, regulations, and guidance applicable to Key. Privacy Compliance, which sits within Compliance Risk Management, provides advisory support, governance, and oversight of privacy-related statutes, regulations, and risks related to Key’s customers, employees, and other individuals from who Key collects personally identifiable information.\n•\nThird Line of Defense – Risk Review Group (RRG). The RRG reviews and evaluates the scope and breadth of security activities throughout Key and the effectiveness of the IS Program. RRG conducts independent internal \n43\nTable of contents\naudits on Key’s LOBs, operations, information systems, and technologies. These internal audits provide an independent perspective on Key’s processes and risks. Technology risks are evaluated in areas including cybersecurity and information security, data control, acquisition and development, delivery and support, business continuity, and information technology governance. RRG shares the results of its audits with the LOB management, Key’s Operational and Compliance Risk Management Groups, the Board’s Audit Committee, and banking regulators.\nAs part of its cybersecurity risk management strategy, Key regularly reviews its security and privacy controls in the context of industry standard practices, frameworks, evolving laws, and changing client expectations. Key engages external providers periodically to perform a maturity assessment of the IS Program against industry cybersecurity frameworks. \nKey also engages external advisors periodically to perform security posture assessments of our environment to proactively identify weakness within our security policy and/or configurations.\n Summary level results from these assessments are shared to internal stakeholders through Key’s Risk Governance committee structure. Key is also subject to cybersecurity and privacy regulatory exams, as required by law for financial institutions.\nKey has implemented cybersecurity, privacy, and fraud education and awareness programs across the\nenterprise to educate teammates on how to identify and report cybersecurity and privacy concerns. Employees and\ncontractors with access to assets or data owned or maintained by Key receive mandatory enterprise-wide\ncybersecurity, privacy, and fraud training on an annual basis. In addition, our management team from time to time participates in cybersecurity tabletop exercises that simulate cybersecurity incidents. These exercises are intended to test our response to potential incidents and assess the procedures outlined in our incident response playbooks. \nWith respect to third party service providers, Key maintains a third party management program that is designed to\nidentify, review, monitor, escalate, and, if necessary, remediate third party information security risks. Key’s third\nparty onboarding process includes risk-based due diligence and security-relevant contract language. Risk-based\ndue diligence can also include an assessment of the strength of certain control areas, including, but not limited to,\ninformation security management, physical security, network security, platform security, application security, cloud\nsecurity, encryption management, business resiliency, and privacy. Once a business relationship is established with a service provider, Key performs risk-based periodic reviews of the third party service provider's security programs. In addition to an established governance approval process for new engagements, Key has established a Third Party Management Committee to oversee compliance with Key’s Third Party Management Policy and Program.\nCybersecurity Governance\nAs described in more detail in “Risk Management — Overview” in Item 7 of this report, the Board serves in an\noversight capacity to ensure that Key’s risks, including risk from cybersecurity threats, are managed in a manner that is effective and balanced and adds value for our shareholders. \nThe Board’s Risk Committee exercises primary oversight over enterprise-wide risk at Key, including operational risk, which includes cybersecurity risk, and provides oversight of management’s activities related to cybersecurity risk. The Board’s Audit Committee monitors and exercises oversight over cybersecurity risk as part of its joint oversight of operational risk with the Risk Committee. The Board’s Technology Committee provides additional oversight of management’s activities related to Key’s technology strategic investment plan, cybersecurity investments, and major technology vendor relationships and is expected to escalate to the Risk Committee on certain risk management issues.\nKey’s CISO oversees the IS Program and its related policies and is responsible for determining whether relevant security risk information is properly integrated into strategic and business decisions, overseeing the appropriate identification and ownership of security risks, monitoring critical risks, and maintaining the appropriate oversight and governance of information security through associated programs and/or standards. Our CISO has served in various roles in information technology and information security at Key for over 30 years, including serving as Enterprise Security Executive. The CISO holds a B.S.B.A in Management Information Systems.\nThe CISO is responsible for reporting on information security matters, including cybersecurity risk, to the Board.\n The CISO provides updates to the Audit Committee on cybersecurity matters at each regularly scheduled Committee meeting (six times in 2024). The CISO’s update to the Committee generally address the cybersecurity threat landscape, information security trends, strategic initiatives related to information security, and cybersecurity program reviews. The CISO also updates the Risk Committee on cybersecurity matters and on Key’s compliance with the Gramm-Leach-Bliley Act on an annual basis and presents the Information Security Policy for approval. The CISO, along with Key’s Deputy CISO, also report annually to the Technology Committee to obtain approval on Key’s Cyber Strategy and Investment Plan. The CISO provides updates to the Board as needs arise and from time to time.\n44\nTable of contents\nKey’s Deputy CISO leads the Corporate Information Security function, including the Cyber Defense Center, Identity\n& Access Management Operations, Information Security Governance and Data Protection, and Security Architecture, Engineering and Platform Operations. The Deputy CISO has over 17 years of cybersecurity and technology risk management experience across financial services and retail, previously served as the Head of Information Security Governance within KeyCorp’s Corporate Information Security group, as well as the Head of Cybersecurity and Technology Risk Oversight within KeyCorp’s Risk Management group. He holds a bachelor’s degree in Finance and Management Information Systems and an MBA.\nThe CISO reports to Key’s Chief Information Officer who oversees all of Key’s shared services for technology,\noperations, data, servicing, cyber and physical security, and corporate real estate solutions. Our Chief Information Officer, who has served in the role since 2012, has extensive experience overseeing technology and operations delivery for critical enterprise functions and has held various leadership roles during her over 30-year career in the financial services industry.\nAt the management level, our Enterprise Risk Management (ERM) Committee, chaired by the Chief Executive\nOfficer and comprising other senior level executives, including the Chief Information Officer, reports to the Board’s\nRisk Committee and is responsible for managing risk, including cybersecurity risk. The ERM Committee serves as a\nsenior level forum for review and discussion of material operational risk issues, including cybersecurity risk, and\nreceives regular updates from the CISO regarding cybersecurity risk. The ERM Committee directly oversees the\nOperational Risk Committee, which provides governance, direction, oversight, and high-level management of\noperational risk, including cybersecurity risk, and includes senior management representation from the LOB and\nsupport areas. The CISO is a voting member of the Operational Risk Committee.\nThe Operational Risk Committee also includes subcommittees which, among other things, address security issues\nand concerns, pursue security-related program enhancements, address fraud trends, provide input on fraud\nstrategy, weigh the impacts of fraud risk on customers, business clients, and the LOB, and cascades awareness of\nfraud risks across Key.\nKey also has a Privacy Team led by a Chief Privacy Officer (CPO) who has over ten years of experience in legal,\ncompliance, and risk roles at financial institutions, focusing primarily on data protection and privacy. Our CPO holds\nan undergraduate degree in finance, a master’s degree in business administration, and a juris doctorate. He is\nlicensed to practice law in the state of Ohio and has obtained the CIPP/US certification through the International\nAssociation of Privacy Professionals. The CPO and Privacy team have the authority to escalate privacy risks to the\nBoard. The Privacy and Information Security teams work together to implement controls around how personally\nidentifiable information is managed and protected and to comply with applicable laws and regulations.\nCybersecurity Incidents\nWhen a cybersecurity incident is identified, we follow established processes in our enterprise privacy and cyber\nincident response plans, which are a supplement to our corporate incident response plan. These plans provide a\nframework to enable the appropriate personnel to recover operations in the event of a cyberattack and manage\nincidents impacting banking information, including our clients’ and employees’ information.\nOur Core Incident Response Rapid Emergency Assessment and Coordination Team (Core IR REACT) is\nresponsible for responding to incidents, including cyberattacks, performing a preliminary assessment, and engaging\nadditional support team members as necessary. The Core IR REACT team is a multidisciplinary team that is\nempowered to escalate issues, as appropriate, to our Crisis Management Team (CMT), which includes the CEO\nand senior executives from Key’s LOB and major support areas. The CMT provides overall strategic\ndirection for incident responses and recovery. Incidents are also reported internally to key stakeholders through Key’s risk governance committee structure.\nAs discussed above in “Cybersecurity Risk Management,” the RRG shares the results of its independent internal\naudits of security activities at Key and the effectiveness of the IS Program with the line of business management,\nKey’s Operational and Compliance Risk Management Groups, the Board’s Audit Committee, and banking\nregulators. Any identified gaps are risk rated, issued a due date for remediation, and tracked through completion of\nremediation. Remediation is then verified by the RRG.\n45\nTable of contents",
    "item1b": "ITEM 1B.  UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Risk Management\nAs a financial services institution, Key faces heightened risk of cybersecurity incidents. Risks and exposures related\nto cybersecurity incidents are expected to remain high for the foreseeable future due to the rapidly evolving nature\nand sophistication of cybersecurity threats and geopolitical events, as well as due to the expanding use of Internet and mobile banking and other technology-based products and services utilized by us and our clients, including products and services that utilize the cloud and artificial intelligence (AI), among other emerging technologies. \nTo date, Key has not experienced material disruption to our operations, or material harm to our client base, from cyberattacks.\n However, we have incurred, and may again incur, expenses related to the investigation of cybersecurity incidents involving third-party providers or related to the protection of our clients from identity theft as a result of such incidents. We have also incurred, and may continue to incur, expenses to enhance our systems or processes to protect against cyber or other security incidents. For more information, see “Risk Factors—We and third parties on which we rely (including their downstream service providers) may experience a cyberattack, technology failure, information system or security breach or interruption” in"
  }
}