{
  "ticker": "KEYS",
  "cik": "0001601046",
  "company_name": "Keysight Technologies, Inc.",
  "filing_date": "2024-12-17",
  "accession": "0001601046-24-000159",
  "primary_doc": "keys-20241031.htm",
  "item_sections": {
    "item1": "Item 1A and elsewhere in this Annual Report on Form 10-K.\nPART I\nItem 1.  \nBusiness\nOverview\nKeysight Technologies, Inc. (“we,” “us,” “Keysight” or the “company”), incorporated in Delaware on December 6, 2013, is a global innovator in the computing, communications and electronics market, committed to advancing our customers’ business success by helping them solve critical challenges in the development and commercialization of their products and services. Our mission, “accelerating innovation to connect and secure the world,” speaks to the value we provide our customers in a world of ever-increasing technological complexity. We deliver this value through a broad range of design and test solutions that address the critical challenges our customers face in bringing their innovations to market on ever-shorter schedules. \nKeysight’s portfolio of hardware, software, and services enables our customers’ engineering workflows as they design, manufacture, deploy, and optimize their products and solutions. Our revenue is derived primarily from solutions addressing research and development (“R&D”) applications, and to a lesser degree, applications in manufacturing and operations. The accelerating pace of technological innovation and engineering intensity are long-term secular drivers of demand for Keysight’s solutions and services. We serve a global set of customers in over 100 countries across a wide range of industry segments, including communications, aerospace defense, government, automotive, energy, industrial, general electronics, and semiconductor.\nWe generated $5.0 billion, $5.5 billion and $5.4 billion of revenue in 2024, 2023 and 2022, respectively. Revenue, income from operations and assets by business segment as of and for the fiscal years ended October 31, 2024, 2023 and 2022, are provided in Note 16, “Segment Information,” to our consolidated financial statements.\nKeysight Leadership Model\nWe trace our heritage back over 80 years to the beginning of Silicon Valley. The fundamental elements of our culture are represented in our Keysight Leadership Model (“KLM”), which provides a framework for sustained value creation for customers, shareholders, and employees. The KLM centers on delivering customer success via a continuous activity system and core values that guide and drive our actions as a company and as individuals. The activities are summarized as an ongoing cycle \n3\nTable \nof\n Contents\nof market insight that drives capital allocation and yields timely solutions that are optimized via operational excellence. More information on the KLM can be found at https://about.keysight.com/en/companyinfo/leadership.shtml.\nCompetitive Advantages\nKeysight conducts business globally with over 40,000 end customers each year, including many Fortune 1000 companies that are developing new electronic technologies, networks, systems, devices, and components. The following advantages enable us to deliver on our commitment of sustained value creation for our stakeholders.\nDeep, long-term global customer relationships\nKeysight’s history of collaborative innovation is demonstrated by our service to leading companies across the diverse markets that we address. Our customers trust Keysight to deliver the technological expertise, leading-edge capabilities, and broad solutions portfolio that they need to achieve their product development goals. Keysight employs a comprehensive global direct sales channel with experienced management and highly technical sales and application engineers, including a strong local presence in emerging markets. These sales personnel are supported by tight collaboration with the engineering teams who create the solutions used by our customers so that problems can be addressed efficiently, and solutions enhanced quickly, to enable customer success.\nOur legacy of over 80 years of contribution in measurement science and the resulting breadth of our products and solutions yields a large, global installed base. This base of customers enables a large and growing services portfolio and offers additional sales opportunities as customers upgrade their products over time.\nUnique technology expertise and capabilities\nKeysight is a technology-driven company, investing in R&D to align our business with available markets and position the company for growth. As our customers’ trusted test and measurement partner, we innovate at the leading edge of the technologies they seek to utilize in their electronic systems under development. We employ a combination of strategies to lead in this area, including engagement with top standards bodies and industry consortia and close collaboration with top research programs in universities and industry. Our central R&D team, Keysight Labs, focuses on developing breakthrough hardware and software technologies that are deployed in application-specific contexts by our business engineering teams. We develop and incorporate proprietary semiconductor and packaging technology to address the specific needs of our solutions, enabling differentiated performance within our industry. \nDifferentiated, first-to-market solutions portfolio\nKeysight’s industry-focused organizational structure emphasizes our engagement with leading customers across our end markets. We leverage these relationships, together with our technology expertise, to identify market opportunities and seek to maximize the lifecycle value of our design and test contributions beginning in R&D. Our development teams leverage the broad array of Keysight hardware, software, and services, adding new capability as necessary, to create market-leading solutions. Providing leading-edge, application-focused solutions for our customers in line with their project schedules is key to our differentiation and value delivery and facilitates the continuous advancement of electronics technology. With a software- and \n4\nTable \nof\n Contents\ncustomer-centric focus, we continue to make strategic investments to expand the R&D mix of our revenue and grow the software and services content of our business, which has the added benefit of increasing recurring revenue.\nDurable and resilient business model\nOur operating model incorporates cost structure flexibility that has allowed Keysight to deliver profitability across a range of economic and market conditions. We employ variable pay mechanisms across our entire employee population and complement this with the strategic use of contingent staffing. We have a diversified go-to-market approach with indirect sales partners and electronic commerce to complement our direct sales force. This approach provides flexibility with the added benefit of expanding our reach and providing improved transactional purchase capability. We use a centralized order fulfillment organization that supplies solutions to customers worldwide, allowing us to leverage the scale of our business to provide high-quality products while maintaining competitive margins. We complement our in-house capabilities with an extensive network of suppliers and subcontractors, which allows us to adapt to changing market conditions. The durability and resilience of our business model has provided strategic flexibility and enabled the company to continue to allocate capital and invest in growth through different market environments.\nInnovative culture\nKeysight's culture has at its foundation the operating principles and values embodied in the KLM, with innovation as a key source of our strength. Our employees around the world embrace these principles and deliver industry-leading capabilities across a range of fields that are not only technical in nature but encompass a wide range of contributions to our business, customers, and shareholders. Keysight continues to be recognized as an employer of choice. We strive to enable employee growth in a diverse, inclusive, and respectful work environment that offers challenging assignments, development opportunities, competitive compensation, and a safe workplace. This environment supports our employees to achieve their full potential and enables collaboration to innovate at the speed of our customers.\nS\ntrategic Priorities\nKeysight’s business strategy is exemplified in four key objectives:\nInvest to deliver differentiated, first-to-market solutions\nThis priority is central to our value contribution for our customers in their world of increasing technology complexity and decreasing time-to-market. To this end, our intent is to invest approximately 16% of our revenue in R&D annually over the cycle. In 2024, R&D investment totaled $919 million. We employ vertical technology integration that leverages investments in core hardware technology, such as advanced semiconductor capability provided by our in-house fab, custom packaging from our technology centers, and other unique competencies. We integrate these hardware technologies with core software functionality enabled by our software engineering teams (representing the majority of our R&D staff) and accelerated by leveraging our broad portfolio. We then add relevant services to deliver differentiated solutions that meet the needs of the market. Deep relationships with market-defining customers provide detailed understanding of their needs and schedules. This enables us to work at our customers’ pace to deliver solutions that enable their development cycles with first-to-market timing.\nCapture opportunities in our served addressable market and expand in attractive adjacencies\nBuilding on our industry-leading position, we are investing to capitalize on emerging technologies, expanding our portfolio of solutions and engaging earlier in our customers’ design and innovation life cycles to enhance our value and target technology inflections. This is an important aspect of our capital allocation strategy to deliver sustainable and profitable growth. We continue to work on multiple potential vectors for growth as we expand Keysight’s contributions across the technology stack, building on our core strength in physical layer test and adding new protocol layer test and system emulation capabilities, as well as new application layer solutions that address opportunities in design and data management. In 2024, we acquired ESI Group SA (“ESI Group”), broadening our software offerings with the addition of computer-aided engineering solutions. In addition, we enhanced our security offerings with the acquisition of Riscure Holding B.V., providing testing solutions and software for semiconductor, embedded systems, and Internet of Things (“IoT”) devices, and extended our range of radio frequency (“RF”) and microwave (“uW”) instruments with the acquisition of AnaPico AG. In fiscal 2024, we announced our intention to acquire Spirent Communications PLC to complement our position in communications test, and entered into a definitive agreement with Synopsys, Inc. (“Synopsys”) to acquire Synopsys’ Optical Solutions Group to further broaden our design engineering software portfolio.\n5\nTable \nof\n Contents\nGrow recurring revenue\nThis component of our strategy benefits from the increasing software content in our solutions and emphasizes delivering continuous value to our customers throughout the solution lifecycle. It also leverages our broad services portfolio as we provide unique and high-value services to extend the value of our solutions. We have a dedicated global enterprise software sales force to drive this priority and maximize cross-selling opportunities across our go-to-market channels.\nBe good stewards of capital\nKeysight strives to be a good steward of capital. Leveraging the strength of our differentiated portfolio and flexible operating model, together with our strong balance sheet and cash generation, we maintain our disciplined approach to capital allocation, balancing investment for organic growth, mergers and acquisitions, and return of capital.\nBroad Portfolio of Design and Test Solutions\nKeysight delivers a portfolio of products and solutions that enable our customers to efficiently develop, deploy, and optimize their product offerings. The main components of our portfolio are hardware, software, and services that are delivered on a standalone basis or combined into application-specific solutions. Application-specific solutions employ a software-centric approach that directly leverages the breadth of our portfolio by combining relevant hardware, software, and services into solutions that address high-value applications and industry-specific requirements. This approach allows Keysight to deliver differentiated value to our customers, built from a foundation of industry-leading products and services that can be configured to meet their needs.\nHardware products include a broad range of platforms delivering precise measurement and control of numerous electrical and information properties in signals. These products consist of modular and integrated instruments in a variety of form factors. Some of the major product categories are:\n•\nSpectrum and Signal Analyzers – a line of products providing detailed analysis of complex communications and radar signals across a wide range of frequencies, including radio frequency, microwave, and optical.\n•\nNetwork Analyzers – an array of products providing detailed characterization of the behavior of electronic components and subsystems when stimulated by a range of input signals.\n•\nPower Analyzers – a range of products to accurately measure voltage, current, and power characteristics of an electronic device or system under a range of operating conditions.\n•\nProtocol Analyzers – a range of products allowing the debug, validation, and optimization of electronic systems employing various protocols for data transmission, usually defined by widely adopted standards, such as PCI Express (“PCIe”) or Universal Serial Bus (“USB”), as well as others.\n•\nOscilloscopes – a range of products offering precise visualization, debug, and characterization of time domain signals across a wide range of operating conditions.\n•\nDigital Multimeters – a range of products in a variety of form factors delivering accurate and reliable measurement of basic electrical parameters.\n•\nSignal Generators (Signal Sources) – a range of products offering flexibility and precise control of the generation of a broad variety of signals used to provide stimulus to electronic devices and systems under test.\n•\nPower Supplies – a range of products used to provide precise control of power delivery to electrical and electronic systems under test.\n•\nNetwork Test Products – a range of systems to debug, validate, and characterize communication networks and network components across a range of operating conditions and measurement types.\n•\nNetwork Visibility Products – a portfolio of products and solutions delivering rich data insight about network traffic, applications, and users across any networking environment to ensure they remain connected and secure.\nThis summary is only a subset of Keysight’s industry-leading array of hardware product offerings. More details can be found on our website using the link at the end of this section. \n6\nTable \nof\n Contents\nSoftware represents a crucial component of our strategy to deliver differentiated, first-to-market solutions to our customers. Our open and scalable PathWave software platform accelerates our ability to deliver application-specific measurement solutions that integrate our instruments into connected workflows with automation, data management, and analytics. Keysight’s software products are characterized in the following three categories: \n•\nInstrument software applications are designed to optimize the value that our customers derive from our instruments, providing faster insight and analytics by integrating the instrument’s hardware and software into an application-focused solution. This approach typically builds on the basic software used to operate our instruments by adding software applications to deliver measurements tailored to a specific application. For example, customers may purchase a signal analyzer equipped with a software application to analyze specific signals such as those used in satellite communications.\n•\nSoftware application solutions unify multiple instruments into an application-specific measurement solution, providing faster time to insight across industry-specific applications, technologies, and lifecycle phases. An example of this is software that enables a signal generator and signal analyzer to be used as a stimulus-response tester for performance characterization of a communications component or device.\n•\nOur standalone software solutions enable customers to address their design, simulation, emulation, test automation, and quality assurance needs in the R&D lab and beyond. These solutions enable our customers to efficiently develop robust product designs and translate them into physical products. Our software test automation platform uses artificial intelligence and machine learning to accelerate customer productivity in software test creation and execution.\nKeysight Global Services provides support services to enable our customers’ success with their Keysight products and solutions. Our global scale is complemented by localized presence with trained engineers and technicians delivering our services via regional support centers located near customers or on-site teams. This approach increases the efficiency and uniformity of our services offerings and allows for close collaboration with our engineering and go-to-market teams. Our services offerings are summarized as follows:\n•\nProduct support services deliver comprehensive support that includes repair, parts, and accredited calibrations of Keysight products and solutions.\n•\nTechnical and application support for hardware, software, and solutions, known as KeysightCare, allows customers to maximize their productivity and the utility of our products and solutions in their application environment.\n•\nProfessional services, including installation, training, and engineering services, optimize equipment and solution adoption, utilization, and integration into customers’ unique environments.\nMore information on our broad portfolio of products and services can be found at https://www.keysight.com/us/en/products.html.\nOperating Segments\nWe have two reportable operating segments, the Communications Solutions Group (“CSG”) and the Electronic Industrial Solutions Group (‘EISG”).\nCommunications Solutions Group\nCSG serves customers spanning the global commercial communications and aerospace, defense, and government end markets. The group’s solutions consist of electronic design and test software, instrumentation, systems, and related services. These solutions are used in the simulation, design, validation, manufacturing, installation, and optimization of communication systems in wireless, wireline, enterprise, and aerospace, defense, and government end markets. In addition, the group provides automated software test solutions to automatically identify, build, and execute tests critical to digital business success and a strong customer experience.\nCommercial Communications\nThe market for Keysight’s commercial communications solutions spans the communications ecosystem from design through operations and across the industry’s broad spectrum of components, devices, equipment, and services. Our solutions address the communications lifecycle in both wireless and wireline domains, from design and simulation, validation, and characterization, through manufacturing, deployment, and optimization, including cybersecurity.\n7\nTable \nof\n Contents\nKeysight’s commercial communications customers develop and deploy communications products and services and operate communications networks around the world. Our customers represent a diverse group of suppliers across the global industry value chain and include original equipment and contract manufacturers supplying wireless and wireline semiconductors, chipsets, modules, and devices. Our customers also include network equipment manufacturers (“NEMs”) as well as those operating communications and computing networks, including enterprises, communications network service providers, and cloud computing service providers.\nThese customers require design, simulation, and measurement tools to validate the correct functional operation, conformance to standards, and parametric performance of their products and systems under development. Their needs span the wide range of technologies employed in modern wired and wireless communications system designs such as 5G, 6G, 800Gb/sec, 1.6Tb/sec, and many others. These needs have also evolved rapidly given the continuous advancement of digital, communications, and computing standards. Keysight’s broad portfolio of products and solutions serve their many specific applications, accelerating the development, validation, quality manufacturing and deployment of their products and services, as well as aiding in their secure and efficient operation, service, and repair. \nAerospace, Defense, and Government\nThe market for Keysight’s aerospace, defense, and government solutions consists of applications addressing secure and highly reliable communications, space and satellite equipment development and operations, and government research across a wide spectrum of electronics technologies used in aerospace and defense. General applications include electromagnetic spectrum operations (e.g., communications, radar, signal intelligence), cybersecurity, and others, often incorporating ruggedized and high-reliability designs for military equipment. Research applications are wide-ranging and include areas such as quantum communications and computing, cyber-physical control systems, energy as well as materials science research.\nOur aerospace, defense, and government customers are research agencies and manufacturers serving the aerospace and defense industries, including commercial and government customers and their contracted suppliers. Commercial suppliers include aerospace, defense, and satellite equipment prime contractors, subcontractors, and related component suppliers. Government customers include a range of government agencies, such as departments and ministries of defense, security agencies, and related government research entities. Our customers need to accelerate the modernization of their defense systems to realize the benefits of the continuous evolution in electronic systems. They strive to embrace new space, energy, and communications advances, and ensure secure supply chains. These customers require design, simulation, and measurement tools to accelerate their efforts to ensure the proper operation and performance of the devices and systems they are developing, deploying, and operating. They use Keysight’s products and solutions to explore design alternatives, validate their component and system designs and prototypes, ensure quality manufacturing, and operate, service, and repair their systems in the field. \nElectronic Industrial Solutions Group    \nEISG serves customers across a diverse set of end markets focused on automotive and energy, semiconductor solutions, and general electronics. The group's solutions consist of electronic design, test and simulation software, instrumentation, systems, and related services. These solutions are used in the simulation, design, validation, manufacturing, installation, and optimization of electronic equipment. In addition, the group provides automated software test solutions to automatically identify, build, and execute tests critical to digital business success and a strong customer experience. Our recent acquisition of ESI Group expands our application layer portfolio with simulation capabilities in automotive and general electronics. \nAutomotive and Energy\nThe market for Keysight’s automotive and energy solutions consists of design and measurement applications addressing the major transformational trends in these industries. These applications include the growth of electric and autonomous vehicles, the evolution of energy systems to incorporate alternative forms of generation and advanced control, and the many new subsystem and component technologies under development to enable and advance these trends. \nOur automotive and energy customers include automotive original equipment manufacturers and Tier 1 and 2 suppliers, along with the component and subsystem suppliers that support them. We also count as customers the suppliers of alternative energy systems for green energy generation, storage, and control, as well as suppliers of enabling electronics technology such as high-power semiconductors and control systems. \nOur customers are innovating in energy management and advanced cyber-physical control systems that are the building blocks of these complex and transformative systems. These customers, many of whom are pioneering new standards and capabilities involving the application of advanced communications, computing, and applied materials research, require advanced design, simulation, and measurement capability to fully explore these new application areas and enable the \n8\nTable \nof\n Contents\ndevelopment of their products and services. They rely on Keysight’s software-centric solutions to analyze and validate their concepts and products, thereby increasing their productivity and ultimately speeding the arrival of their products to market. \nSemiconductor\nThe market for Keysight’s semiconductor solutions consists of design and measurement applications to enable continued innovation in leading-edge semiconductors to address the demand for smaller, more power efficient, and highly integrated chips and chipsets. This innovation requires new approaches to design and measurement to enable realization of the design in the fab along with efficient testing at scale to preserve yield.\nOur semiconductor customers are primarily design and production teams in semiconductor and capital equipment companies who are looking to differentiate their offerings by implementing innovative new silicon architectures and continuing to advance the state of the art in semiconductor device capability. These innovations are the foundation of advances in electronics that are powering many new technologies in today’s high-tech world. These teams require close collaboration with their design and measurement solutions suppliers to continue to advance their capability in this challenging environment of ever-advancing complexity and scale. Keysight is a trusted supplier to the leaders in the semiconductor ecosystem as they engage with our solutions to enable their next-generation offerings. \nGeneral Electronics\nThe market for Keysight’s general electronics solutions spans a broad set of design and measurement applications that enable electronics designers and manufacturers across a wide range of industrial and academic settings. These applications represent basic and advanced design, simulation, and measurement capability that support the electronics industry and is driven by digital transformation and the growth of connected devices (IoT), including consumer electronics, digital health applications, smart manufacturing, and the growth of digital classroom learning. \nOur general electronics customers include design teams in leading and emerging companies that are innovating to bring higher levels of connectivity, utility, and automation, along with new business models, to their customers. In many cases they are embracing new communications technology and working to incorporate the latest electronics to enable longer battery life, higher performance, or other differentiators for their systems. Keysight's design and measurement solutions accelerate our customers’ development and productization processes.\nThe following discussions include information common to each of our businesses.\nCompetition\nKeysight operates in a highly competitive and rapidly changing global marketplace. We believe that our technology leadership serves as a competitive differentiator. The proprietary software and hardware technologies developed by our R&D technology centers around the world enable many Keysight products to deliver differentiated design and measurement solution capability to address our customers’ engineering requirements. We compete with a variety of organizations that offer similar services and solutions, but none of our competitors offer the full range of product and services at the scale we do or serve all the same markets in the aggregate or by segment. Our competitors include companies or divisions of companies with substantial sales, marketing, research, and financial capabilities, as well as well-established regional competitors who are more specialized than we are in particular markets. We also face increased competition in a number of our served markets as a result of the entry of new competitors or consolidation among industries or customers. For a discussion of risks related to competition, please refer to “",
    "item1a": "Item 1A. Risk Factors.”\nGovernance and Oversight\nCybersecurity is an important part of our risk management processes and an area of focus for our Board and management. The Audit and Finance Committee, which is comprised entirely of independent directors with information security experience, oversees and monitors the company’s information security programs. Additionally, one of our independent directors has a CERT Certification in Cybersecurity Oversight from Carnegie Mellon University Software Engineering Institute. The Chief Information Officer (‘‘CIO’’) meets with the Audit and Finance Committee regularly to report on risks, mitigation, initiatives, compliance and outcomes and the Audit and Finance Committee reports relevant information to the full Board.\nThe CISO is responsible for the ISMS and reports directly to the CIO. The CIO is the head of the company’s global IT team which has an integrated governance structure consisting of a Senior Executive Committee, a Cyber Executive Committee and Cyber Leaders. The Senior Executive Committee meets quarterly, prioritizes the information technology components of strategic business imperatives and oversees IT capability and security programs. The Cyber Executive Committee meets monthly, reviews identified risks, sponsors initiatives to address risk and oversees security and compliance responses. Cyber Leaders are management representatives from all functions and lines of business who are responsible for executing programs and initiatives sponsored by the Senior Executive Committee.\n30\nTable \nof\n Contents",
    "item1b": "Item 1B.  \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C.  \nCybersecurity\nRisk Management and Strategy\nOur overall information security program applies an enterprise-wide, risk-based approach to information security that enables us to assess, identify and manage risk exposures, including material risks from cybersecurity threats, in a timely manner. Our information security operations and procedures provide a comprehensive Information Security Management System (‘‘ISMS’’) that enable us to maintain the confidentiality, integrity, and availability of information and systems in our environment. Our information security policies are based on National Institute of Standards and Technology (“NIST”) Special Publication (“SP”) 800-171 framework and apply to the entire enterprise. \nWe have a dedicated Information Security and Compliance organization (“ISC”) that owns and operates the ISMS. The ISC organization reports directly to Keysight’s Chief Information Security Officer (“CISO”) and includes functions such as information security policy management, risk management, vulnerability management, compliance assurance, identify and access management, incident management, security awareness and education and information technology (“IT’’) disaster recovery. \nOur management team has relevant expertise and experience in understanding risks from cybersecurity threats and overseeing risk management processes. Our CISO is an experienced cybersecurity senior executive with more than 25 years experience in building and leading cybersecurity, risk management and information technology teams.\n \nOur cybersecurity risk management program includes:\n•\nCybersecurity incident detection and response plan to prepare for, detect, respond to and recover from cybersecurity incidents, which include processes to triage, assess severity for, escalate, contain, investigate, and remediate the incident, as well as to comply with potentially applicable legal obligations and mitigate brand and reputational damage.\n•\nRisk Assessment: Our enterprise-wide risk management programs and Information Security Review process is designed to identify, assess, document, monitor and report information security risks. Based on this information, we evaluate the likelihood and impact of harmful events and deliver recommendations regarding a response to risks presented. Feedback from internal audits, external assessments, and industry benchmarks is used to improve our cybersecurity posture.\n•\nTraining and Awareness: Implementation of enterprise-wide mandatory annual security awareness training for employees, including cybersecurity and data privacy training. We regularly deploy enterprise-wide phishing simulation tests with mandatory follow-up training and education, which are reviewed at least annually and are updated as needed. Additionally, we provide an easy mechanism for employees to report suspicious email messages to the information security team for additional investigation.\n•\nSecurity Tools Optimization: Utilize a variety of tools designed to protect our network and systems, including firewalls, intrusion detection and prevention systems, web content filtering protection, anti-virus and malware detection tools, system scans and full disk encryption.\n•\nThird Party Risk: Keysight’s Third Party Cyber Risk Management (“TPCRM”) is a systematic process for managing exposure to cybersecurity risks throughout the supply chain and developing appropriate response strategies, policies, processes, and procedures.\n \nIn addition, Keysight maintains information security risk insurance to offset the costs of an information security breach. The policy is reviewed annually and updated as needed. \nWe also engage with approved third-party companies that review our regulatory compliance, validate control performance, perform penetration testing and provide impartial risk assessments.\nTo date, we have \nnot identified\n risks from cybersecurity threats or incidents, including as a result of any previous cybersecurity incidents, that have materially affected the company or are reasonably likely to materially affect our operations, business strategy, results of operations, or financial condition. \n29\nTable \nof\n Contents\nFor more information on how cybersecurity risk could materially affect the company’s business strategy, results of operations, or financial condition, please refer to “"
  }
}