{
  "ticker": "KHC",
  "cik": "0001637459",
  "company_name": "Kraft Heinz Co",
  "filing_date": "2025-02-13",
  "accession": "0001637459-25-000011",
  "primary_doc": "khc-20241228.htm",
  "item_sections": {
    "item1": "Item 1.  Business. \nGeneral\nWe are driving transformation at The Kraft Heinz Company (Nasdaq: KHC), inspired by our Purpose, \nLet’s Make Life Delicious\n. Consumers are at the center of everything we do. With 2024 net sales of approximately $26 billion, we are committed to growing our iconic and emerging food and beverage brands on a global scale. We leverage our scale and agility to unleash the full power of Kraft Heinz across a portfolio of eight consumer-driven product platforms. As global citizens, we’re dedicated to making a sustainable, ethical impact while helping to feed the world in healthy, responsible ways.\nOn July 2, 2015, through a series of transactions, we consummated the merger of Kraft Foods Group, Inc. (“Kraft”) with and into a wholly-owned subsidiary of H.J. Heinz Holding Corporation (“Heinz”) (the “2015 Merger”). At the closing of the 2015 Merger, Heinz was renamed The Kraft Heinz Company, and H. J. Heinz Company changed its name to Kraft Heinz Foods Company (“KHFC”).\nWe operate on a 52- or 53-week fiscal year ending on the last Saturday in December in each calendar year. Unless the context requires otherwise, references to years and quarters contained herein pertain to our fiscal years and fiscal quarters. Our 2024 fiscal year was a 52-week period that ended on December 28, 2024, our 2023 fiscal year was a 52-week period that ended on December 30, 2023, and our 2022 fiscal year was a 53-week period that ended on December 31, 2022.\nReportable Segments: \nIn the first quarter of 2024, we divided our International segment into three operating segments — Europe and Pacific Developed Markets (“EPDM” or “International Developed Markets”), West and East Emerging Markets (“WEEM”), and Asia Emerging Markets (“AEM”) — to enable enhanced focus on the different strategies required for each of these regions as part of our long-term strategic plan. \nSubsequently, we manage our operating results through four operating segments. We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nSee Note 20, \nSegment Reporting\n, in Item 8,\n Financial Statements and Supplementary Data\n, for our geographic financial information by segment.\nResources\nTrademarks and Intellectual Property:\nOur trademarks are material to our business and are among our most valuable assets. Depending on the country, trademarks generally remain valid for as long as they are in use or their registration status is maintained. Significant trademarks by segment based on net sales in 2024 were:\nMajority Owned and Licensed Trademarks\nNorth America\nKraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Capri Sun*, Maxwell House, Kool-Aid, Jell-O\nInternational Developed Markets\nHeinz, Golden Circle, Wattie’s, Plasmon\nEmerging Markets\n(a)\nHeinz, ABC, Master, Quero, Kraft, Pudliszki\n(a)     Emerging Markets represents the aggregation of our WEEM and AEM operating segments.\n    \n*Used under license.\nWe sell certain products under brands we license from third parties. In 2024, brands used under licenses from third parties included \nCapri Sun\n packaged drink pouches for sale in our North America segment. We also grant certain licenses to third parties to use our intellectual property rights in select jurisdictions. In our agreements with an affiliate of Groupe Lactalis (“Lactalis”), we granted the other party various licenses to use certain of our and their respective intellectual property rights in perpetuity, including perpetual licenses for the \nKraft\n and \nVelveeta\n brands for certain cheese products.\nWe also own numerous patents worldwide. We consider our portfolio of patents, patent applications, patent licenses under patents owned by third parties, proprietary trade secrets, technology, know-how processes, and related intellectual property rights to be material to our operations. Patents, issued or applied for, cover inventions ranging from packaging techniques to processes relating to specific products and to the products themselves. While our patent portfolio is material to our business, the loss of one patent or a group of related patents would not have a material adverse effect on our business.\n1\nOur issued patents extend for varying periods according to the date of the patent application filing or grant and the legal term of patents in the various countries where patent protection is obtained. The actual protection afforded by a patent, which can vary from country to country, depends upon the type of patent, the scope of its coverage as determined by the patent office or courts in the country, and the availability of legal remedies in the country.\nRaw Materials and Packaging:\nWe manufacture (and contract for the manufacture of) our products from a wide variety of raw materials. We purchase and use large quantities of commodities, including dairy products, meat products, tomato products, sugar and other sweeteners, soybean and vegetable oils, coffee beans, wheat and processed grains, eggs, and other fruits and vegetables to manufacture our products. In addition, we purchase and use significant quantities of plastics, cardboard, resin, glass, and metal to package our products, and we use electricity, diesel fuel, and natural gas in the manufacturing and distribution of our products. For commodities that we use across many of our product categories we coordinate sourcing requirements and centralize procurement to leverage our scale. In addition, some of our product lines and brands separately source raw materials that are specific to their operations. We source these commodities from a variety of providers, ranging from large, international producers to smaller, local, independent sellers. Where appropriate, we seek to establish preferred purchaser status and have developed strategic partnerships with many of our suppliers with the objective of achieving favorable pricing and dependable supply for many of our commodities. The prices of raw materials that we use in our products are affected by external factors, such as global competition for resources, currency fluctuations, severe weather or global climate change, pandemics, geopolitical conflicts, consumer, industrial, or investment demand, and changes in governmental regulation and trade, tariffs, alternative energy, and agricultural programs. In 2024, we experienced moderate inflation in our supply chain costs compared to the prior year period, which we expect to continue through 2025. While inflationary pressures within procurement, manufacturing, and logistics costs had a negative impact on our results of operations, we experienced increased stability of these costs as compared to the prior year period.\nOur procurement teams monitor worldwide supply and cost trends so we can obtain ingredients and packaging needed for production at competitive prices. Although the prices of our principal raw materials can be expected to fluctuate, we believe there will be an adequate supply of the raw materials we use and that they are generally available from numerous sources. We use a range of hedging techniques in an effort to limit the impact of price fluctuations on many of our principal raw materials. However, we do not fully hedge against changes in commodity prices, and our hedging strategies may not protect us from increases in specific raw material costs. We actively monitor changes to commodity costs so that we can seek to mitigate the effect through pricing and other operational measures.\nResearch and Development\nOur research and development efforts focus on achieving the following four objectives:\n•\nproduct innovations, renovations, and new technologies to meet changing consumer needs, support our environmental and sustainability goals, and drive growth;\n•\nworld-class and uncompromising food safety, quality, and consistency;\n•\nsuperior, consumer-preferred product and package performance; and\n•\ncontinuous process, product, and supply chain optimization and productivity initiatives.\nCompetition\nOur products are sold in highly competitive marketplaces, including e-commerce retailers, large-format retailers, and discounters. Our competitors include large national and international food and beverage companies and numerous local and regional companies. We compete with both branded and private label products sold by retailers, wholesalers, and cooperatives. We compete on the basis of product innovation, price, product quality, nutritional value, service, taste, convenience, brand recognition and loyalty, effectiveness of marketing and distribution, promotional activity, and the ability to identify and satisfy changing consumer preferences. Improving our market position or introducing new products requires substantial advertising, promotional, and research and development expenditures.\n2\nSales\nSales and Customers:\nOur products are sold through our own sales organizations and through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; and institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies. Our products are also sold online through various e-commerce platforms and retailers.\nWe have key customers in different regions around the world. In 2024, the five largest customers in our North America segment accounted for approximately 46% of North America segment net sales, the five largest customers in our International Developed Markets segment accounted for approximately 28% of International Developed Markets net sales, and the five largest customers in Emerging Markets accounted for approximately 12% of Emerging Markets net sales. Our largest customer, Walmart Inc., represented approximately 21% of our net sales in 2024, 2023, and 2022. Both of our reportable segments have sales to Walmart Inc.\nIn the first quarter of 2024, we changed the way we manage our product portfolio to align with our future growth strategy. As of December 28, 2024, we manage our sales portfolio through eight consumer-driven product platforms. A platform is a lens created for the portfolio based on a grouping of consumer needs and includes the following for Kraft Heinz: Taste Elevation, Easy Ready Meals, Substantial Snacking, Desserts, Hydration, Cheese, Coffee and Meats. \nTaste Elevation includes condiments, sauces, dressings, and spreads. Easy Ready Meals includes Kraft Mac & Cheese varieties, frozen potato products, and other frozen meals. Substantial Snacking includes Lunchables meal kits, frozen snacks, and pickles. Desserts includes dry packaged desserts, refrigerated ready to eat desserts, and other dessert toppings. Hydration includes ready to drink beverages, powdered beverages, and liquid concentrates. Cheese includes American sliced and recipe cheeses. Coffee includes mainstream coffee, coffee pods, and premium coffee. Meats includes cold cuts, bacon, and hot dogs.\nThe platforms are modular and configurable by reportable segment and market and help us to manage and organize our business effectively by providing insight into our various product categories and brands. Further, each platform is assigned a role within our business to help inform our resource allocation and investment decisions, which are made at the operating segment level. These roles include Accelerate, Protect, and Balance. The role of a platform may also vary by reportable segment and market.\nNet Sales by Platform:\nNet sales by platform as a percentage of consolidated net sales for the periods presented were:\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\nACCELERATE\nTaste Elevation\n44 \n%\n44 \n%\n41 \n%\nEasy Ready Meals\n18 \n%\n18 \n%\n19 \n%\nSubstantial Snacking\n5 \n%\n5 \n%\n6 \n%\nPROTECT\nDesserts\n4 \n%\n4 \n%\n4 \n%\nHydration\n9 \n%\n9 \n%\n9 \n%\nBALANCE\nCheese\n7 \n%\n7 \n%\n7 \n%\nCoffee\n3 \n%\n3 \n%\n3 \n%\nMeats\n8 \n%\n8 \n%\n9 \n%\nOther\n2 \n%\n2 \n%\n2 \n%\nSeasonality\nAlthough crops constituting certain of our raw food ingredients are harvested on a seasonal basis, the majority of our products are produced throughout the year.\nSeasonal factors inherent in our business change the demand for products, including holidays, changes in seasons, or other annual events. While these factors influence our quarterly net sales, operating income/(loss), and cash flows at the product level, unless the timing of such events shift period-over-period (e.g., a shift in Easter timing), this seasonality does not typically have a significant effect on our consolidated results of operations or segment results.\n3\nGovernment Regulation\nThe manufacture and sale of consumer food and beverage products is highly regulated. Our business operations, including the production, transportation, storage, distribution, sale, display, advertising, marketing, labeling, quality, and safety of our products and their ingredients, and our occupational safety, health, and privacy practices, are subject to various laws and regulations. In the United States, our activities are subject to regulation by various federal government agencies, including the Food and Drug Administration, Department of Agriculture, Federal Trade Commission, Department of Labor, Department of Commerce, and Environmental Protection Agency, as well as various state and local agencies. We are also subject to numerous laws and regulations outside of the United States in markets where our products are manufactured, distributed, or sold, including laws and regulations governing food safety, health and safety, anti-corruption, and data privacy. In our business dealings, we are also required to comply with the U.S. Foreign Corrupt Practices Act (“FCPA”), the U.K. Bribery Act, the U.S. Trade Sanctions Reform and Export Enhancement Act, and various other anti-corruption regulations in the regions in which we operate. We rely on legal and operational compliance programs, as well as in-house and outside counsel, to guide our businesses in complying with applicable laws and regulations. In addition, regulatory regime changes may add cost and complexity to our compliance efforts.\nEnvironmental Regulation:\nOur activities throughout the world are highly regulated and subject to government oversight regarding environmental matters. Various laws concerning the handling, storage, and disposal of hazardous materials and the operation of facilities in environmentally sensitive locations may impact aspects of our operations.\nIn the United States, where a significant portion of our business operates, these laws and regulations include the Clean Air Act, the Clean Water Act, the Resource Conservation and Recovery Act, and the Comprehensive Environmental Response, Compensation, and Liability Act (“CERCLA”). CERCLA imposes joint and several liability on each potentially responsible party. We are involved in a number of active proceedings in the United States under CERCLA (and other state actions under similar legislation) related to certain closed, inactive, or divested operations for which we retain liability. \nAs of December 28, 2024, we had accrued an amount we deemed appropriate for environmental remediation. Based on information currently available, we believe that the ultimate resolution of existing environmental remediation actions and our general compliance with environmental laws and regulations will not have a material effect on our earnings or financial condition. However, it is difficult to predict with certainty the potential impact of future compliance efforts and environmental remedial actions and, thus, future costs associated with such matters may exceed current reserves.\nHuman Capital Management\nWe are driven by our Purpose– \nLet’s make life delicious\n, our Company Dream—\nTo be the leader in elevating and creating food that makes you feel good, \nand our Values and Leadership Principles. Those elements represent the foundation upon which our culture is built. They represent the expectations we have for ourselves and the environment we aspire to create for our Company. We recognize that our ownership-centric culture is vital to our overall success and a key competitive advantage.\nOur people are at the heart of who we are at Kraft Heinz. We drive growth through high accountability, development and career opportunities, empowerment, and autonomy. We recognize and reward outstanding and differentiated performance at every level, creating a true spirit of ownership, ambition, and meritocracy. We strive to channel our employees’ passion, curiosity, and attitude to make an impact on our future and our legacy by leading as learners, acting as owners, and being change agents. Our Board of Directors (“Board”), through the Human Capital and Compensation Committee, oversees our human resources strategy and key policies.\nEngagement:\nWe are committed to attracting, developing, and retaining world-class talent and creating an engaging and inclusive culture that embodies our Purpose, Dream, Values, and Leadership Principles. As of December 28, 2024, Kraft Heinz had approximately 36,000 employees globally. Driven by our Value \nWe champion great people\n, we support our employees’ health, safety, and professional development and reward outstanding and differentiated performance at every level. Our rewards strategies (compensation, benefits, recognition, and wellbeing) aim to help our employees help themselves to LiveWell. LiveWell represents our total rewards offerings that are designed to attract and engage highly skilled and performance-oriented talent, meet individual and family needs, and inspire, celebrate, and engage our people and teams through enhanced interactions in moments that matter in an environment where employees feel productive, trusted, and empowered.\nGuided by our Values, we conduct a global engagement survey annually to provide employees with an opportunity to share anonymous feedback with management across a variety of topic areas. The results and comments are reviewed by the Board, senior leadership, managers, and human resources to help determine where changes are needed to support our people and teams.\n4\nOur November 2024 survey showed that we hit an all-time high for employee engagement since the 2015 Merger and achieved our aspiration to rank in the top-quartile on the Inclusion Index, which measures employees feeling like their opinions count, belonging and inclusive leadership.\nWe believe our culture is the secret sauce that sets us apart and drives our success. It is the key ingredient that unites us as a Community of Owners, fosters a sense of belonging, and inspires us to lead the future of food. It is the foundation of our employee value proposition.\nWe grow our people to grow our business. Our Employee Value Proposition is built on three core pillars:\n•\nWe develop people for greatness, unlocking their full potential through continuous learning and growth opportunities.\n•\nWe nurture an ownership-centric culture, encouraging people to act with autonomy and treat our business as their own.\n•\nWe drive impact by challenging the status quo, celebrating differences, and sparking innovation in pursuit of leading the future of food.\nOver the past decade, we have been on a journey to create a workplace that resembles the consumers that we serve and provide delicious innovations that better serve our people, business, and communities. We have made significant progress, learned a lot, and plan to build on our successes as we set the table for the future.\nWellbeing and Safety:\nOur employees’ health, safety, and wellbeing are a top priority. We establish and administer company-wide policies and processes to protect the health, safety, and security of our employees, subcontractors, and all those who visit our facilities, and to comply with applicable regulations. We review and monitor our performance closely to drive improvement. To help us evaluate how effective our safety efforts are in lowering incidents rates, we use a Total Recordable Incident Rate (“TRIR”). TRIR is a medical incident rate based on the U.S. Occupational Safety and Health Administration (“OSHA”) record-keeping criteria (injuries per 200,000 hours). Our TRIR globally was 0.39 in 2024 and 0.53 in 2023.\nOur global LiveWell program focuses on four wellbeing elements — physical, emotional, financial, and social health — and provides specific programs and resources to support our employees and their families within each of these areas.\nLearning and Development:\nThrough Ownerversity, our Kraft Heinz learning ecosystem, we provide learning opportunities for each of our employees, designed to inspire and grow talent within Kraft Heinz while developing employees’ skills and competencies to help them navigate their career journey. Our learning and development offerings are created to enable employees to live our Value \nWe dare to do better every day\n and own their personal learning and development. We believe this empowers employees to execute with excellence in their current role, accelerate their learning curves, and grow a great career. Through Ownerversity, employees have access to custom Kraft Heinz training, learning and development materials, and external content libraries and articles. \nRewards and Compensation:\nOur Total Rewards philosophy is to provide a meaningful and flexible spectrum of programs that equitably support our workforce and their families, and compliment Kraft Heinz’ strategy and values. Total Rewards includes compensation elements of base pay and wages and incentives, healthcare, savings and insurance plans, wellbeing plans, employee recognition programs, and other voluntary elected benefits. Kraft Heinz is a great place for those who dare to win in a challenging, meritocratic, ambitious, and engaging environment. We believe in ownership and meritocracy, recognizing and rewarding our people on their achievements and impact as they grow their careers with us. We aim for global consistency while respecting local market practices and employee preferences. The plans are designed to be market competitive and data-driven to promote our high-performance and results-oriented growth culture and realize our Purpose to \nMake Life Delicious\n for employees and their families. \nEthics and Transparency:\nThe Kraft Heinz Ethics Helpline is available to our partners, suppliers, customers, and consumers to ask questions or report potential violations of various policies and ethical guidelines, including our Code of Conduct, Supplier Guiding Principles, and Global Human Rights Policy. \nWe report more detailed information regarding our programs and initiatives related to our people and human capital management in our Environmental Social Governance Report. Our 2024 report, which provides our progress through 2023, is available on our website at \nwww.kraftheinzcompany.com/esg\n. The information on our website, including our ESG Report, is not, and shall not be deemed to be, a part of this Annual Report on Form 10-K or incorporated into any other filings we make with the Securities and Exchange Commission (“SEC”).\n5\nInformation about our Executive Officers\nThe following are our executive officers as of February 8, 2025:\nName and Title\nAge\nBusiness Experience in the Past Five Years\nCarlos Abrams-Rivera,\nChief Executive Officer and Director\n57\nChief Executive Officer (since December 2023); President Kraft Heinz (August to December 2023); Executive Vice President and President, North America (December 2021 to August 2023); and U.S. Zone President (February 2020 to December 2021). Executive Vice President and President, Campbell Snacks (May 2019 to February 2020), and President, Campbell Snacks (March 2018 to May 2019) at Campbell Soup Company (“Campbell”), a food and beverage company.\nAndre Maciel,\nExecutive Vice President and Global Chief Financial Officer\n50\nExecutive Vice President and Global Chief Financial Officer (since March 2022); Senior Vice President, U.S. Chief Financial Officer, and Head of Digital Transformation (September 2019 to March 2022); Managing Director, Continental Europe (January to August 2019); Chief Financial Officer, U.S. (2017 to January 2019); and Head of U.S. Commercial Finance (2015 to 2017).\nDiana Frost,\nGlobal Chief Growth Officer\n42\nGlobal Chief Growth Officer (since December 2023); Chief Growth Officer, North America (August to December 2023); Head of North America Disruption and Canada Chief Marketing Officer (January to August 2022); and Chief Growth Officer, Canada (September 2020 to December 2021). Head of Portfolio Transformation, Mars Wrigley (January 2019 to September 2020) at Mars, Incorporated, a multinational confections company.\nMarcos Eloi Lima,\nExecutive Vice President and Global Chief Procurement and Sustainability Officer\n47\nExecutive Vice President and Global Chief Procurement and Sustainability Officer (since December 2023); Executive Vice President and Global Chief Procurement Officer (December 2021 to December 2023); Chief Procurement Officer (October 2019 to December 2023); and Advisor in the area of procurement (July to October 2019). Vice President Procurement & Sustainability Middle Americas Zone (2016 to July 2019) at Anheuser-Busch InBev SA/NV (“AB InBev”), a multinational drink and brewing holdings company.\nPedro Navio,\nExecutive Vice President and President, North America\n44\nExecutive Vice President and President, North America (since December 2023); President – Taste, Meals, and Away From Home (March 2022 to December 2023); President, Latin America (November 2019 to February 2022); and President, Brazil (2017 to November 2019).\nCory Onell,\nExecutive Vice President and Chief Omnichannel Sales and Asian Emerging Markets Officer\n51\nExecutive Vice President and Chief Omnichannel Sales and Asian Emerging Markets Officer (since December 2023) and Chief Sales Officer, U.S. (August 2020 to December 2023). Senior Vice President and Head of U.S. Retail Sales (April to July 2020) at The J. M. Smucker Company, a food and beverage company. Senior Vice President, Sales (2017 to April 2020) at Campbell.\nFlávio Barros Torres,\nExecutive Vice President and Global Chief Supply Chain Officer\n55\nExecutive Vice President and Global Chief Supply Chain Officer (since December 2021); and Head of Global Operations (January 2020 to December 2021). Global Operations Vice President (2017 to 2019) at AB InBev.\nMelissa Werneck,\nExecutive Vice President and Global Chief People Officer\n52\nExecutive Vice President and Global Chief People Officer (since December 2021); Global Chief People Officer (2016 to December 2021); and Head of Global Human Resources, Performance and Information Technology (2015 to 2016).\nAngel Willis\nExecutive Vice President, Global General Counsel and Corporate Affairs Officer\n54\nExecutive Vice President, Global General Counsel and Corporate Affairs Officer (since November 2024); and Vice President, General Counsel and Secretary (January 2019 to November 2024) at Sealed Air Corporation, a global provider of packaging solutions.\n6\nAvailable Information\nOur website address is \nwww.kraftheinzcompany.com\n. We use our investor relations website, ir.kraftheinzcompany.com, as a routine channel for distribution of important, and often material, information about Kraft Heinz, including quarterly and annual earnings results and presentations, press releases and other announcements, webcasts, analyst presentations, investor days, sustainability initiatives, financial information, and corporate governance practices, as well as archives of past presentations and events. We encourage you to follow our investor relations website in addition to our filings with the SEC to receive timely information about the Company. The information on our website is not part of this Annual Report on Form 10-K and shall not be deemed to be incorporated by reference into this report or any other filings we make with the SEC. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, (the “Exchange Act”), are available free of charge on our website as soon as reasonably practicable after we electronically file them with, or furnish them to, the SEC. In addition, the SEC maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements, and other information regarding issuers, including Kraft Heinz, that are electronically filed with the SEC.",
    "item1a": "Item 1A, \nRisk Factors\n.",
    "item1b": "Item 1B.  Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C. Cybersecurity\nCybersecurity Risk Management, Strategy, Governance, and Incident Disclosure\nThe Company assesses, identifies, and manages cybersecurity risk using a data-driven risk management program intended to reduce risks to the following impact classes: the Company’s obligations to prevent harm to parties, including employees, customers, and stockholders; and the Company’s business objectives\n.\nAs part of our cybersecurity strategy, we set risk targets based on our risk thresholds using industry-recognized standards for controlling and evaluating the risk of cybersecurity threats. The Company has developed cybersecurity policies supported by defined standards, including identity and access control, network controls, operational security, information classification, cybersecurity risk management, incident management and reporting, and security in software development lifecycle.\nWe undertake scheduled and targeted cybersecurity risk assessments to identify and prioritize risks to our three impact classes so that foreseeably harmed parties (which include our employees, contractors, partners, customers, stockholders, consumers, and suppliers) are explicitly included in our risk analysis and risk management priorities. We plan for, implement, and improve safeguards that are designed to reduce unacceptable risks to any foreseeably harmed party. \nWe engage third-party service \n21\nproviders (including contractors and vendors) as part of our normal business operations, including collaborating with third-party experts to assist with evaluating, identifying, and managing our cybersecurity risks.\n \nOur cybersecurity risk management program includes:\n•\nOngoing audits of third-party service providers, including penetration testing and reviews of program maturity based on the National Institute of Standards and Technology (“NIST”) cybersecurity framework;\n•\nDue diligence reviews of third-party service providers’ information security programs;\n•\nRegular phishing, social engineering, and cybersecurity awareness training for employees with Company emails and access to connected devices;\n•\nAnnual tabletop exercises to educate and train our personnel on response capabilities and inform adjustments to our controls and response;\n•\nRegular consultation with external advisors and specialists regarding opportunities and enhancements to strengthen our cybersecurity practices and policies;\n•\nOngoing cybersecurity event monitoring, management, and testing of incident response procedures; and\n•\nOngoing enhancements to cybersecurity capabilities based on evolving threats.\nWe have adopted an incident response plan that applies in the event of a cybersecurity threat or incident to provide a standardized framework for responding to such cybersecurity incidents. The plan sets out a coordinated approach to investigating, containing, documenting, and mitigating incidents, including reporting findings and keeping senior management, the Board, and other key stakeholders informed and involved as appropriate. The plan is aligned to NIST guidance. It also adheres to standards of practice and includes the involvement of any personnel who may detect incidents, respond to incidents, resolve incidents, and manage communications and responsibilities with authorities about those incidents. The plan applies to all Company personnel (including third-party contractors, vendors, and partners) that perform functions or services requiring access to secure Company information, and to all devices and network services that are owned or managed by the Company.\nWe also employ systems and processes designed to oversee, identify, and reduce the potential impact of a cybersecurity incident at a third-party service provider. We maintain a third-party cyber risk management process to review and monitor potentially material third-party service providers’ security controls. Third-party service providers are required to provide independent attestation reports of their control environment, which are reviewed to validate that the controls meet Company security requirements. In the absence of such reports, third-party service providers are required to complete a detailed questionnaire describing their controls and provide relevant documentation. As part of the third-party risk management process, we request and review annual penetration test reports for the third-party service providers designed to assess whether all high and medium risk findings are addressed. The control environments for third-party service providers are reviewed annually based on risk.\n \nOur cybersecurity risk mitigation strategy includes the use of cybersecurity insurance that provides protection against certain potential losses arising from certain cybersecurity incidents.\nRisk management concerns, priorities, and progress are reported to the Company’s Enterprise Risk Committee quarterly as part of the Company’s overall enterprise risk management process. Risk management reports describe cybersecurity priorities, planned safeguards, and resource requirements necessary to achieve acceptable risk outcomes for foreseeably harmed parties.\nThe Company governs cybersecurity risk through a risk management program designed to enable employees, members of the Audit Committee, Enterprise Risk Committee, executive officers, and other personnel to make informed decisions about cybersecurity risk management that are appropriate for their level of responsibility. \nOur \nChief Information Security Officer\n (“CISO”) oversees the team responsible for leading enterprise-wide information security strategy, policy, standards, architecture, and processes.\n \nOur CISO has extensive cybersecurity knowledge and skills gained from more than 20 years of work experience in information security in the consumer goods, banking, legal, healthcare, and education sectors as well as the government. Our CISO holds a master’s degree in computer and information systems security/information assurance and designations as a Certified Information Systems Security Professional (CISSP) and Certified Information Security Manager (CISM).\n \nThe CISO evaluates cybersecurity risks, plans for reduction of risks, directs resources and priorities to improve cybersecurity safeguards, measures the results of those efforts, reports to our senior and executive leaders (including our Global Chief Information Officer and Global Chief Financial Officer), the Enterprise Risk Management Committee, and the Audit Committee regarding our cybersecurity risk priorities and progress, and solicits support from senior and executive leaders to further reduce risks through resources, prioritization, or other means.\n The CISO receives reports on cybersecurity threats from our Security Operations Center, external threat intel, trusted third-party security suppliers, and a peer network of CISOs at other global companies on an ongoing basis. Our Security Operations Center verifies and validates the threat information and modifies our detection and preventative controls as appropriate. Our CISO works closely with our Chief Global Ethics and Compliance Officer and Global General Counsel and Corporate Affairs Officer to oversee compliance with legal, regulatory, \n22\nand contractual security requirements. The CISO’s team evaluates third-party service providers to a degree commensurate with the risk their services pose to us. As part of that program, we also provide feedback to service providers about risks they can reduce using commercially available safeguards. Additionally, the information security team works in partnership with the Company’s internal audit team to review information technology-related internal controls as part of our overall internal controls process.\nThe Audit Committee is responsible for oversight of the Company’s information technology and cybersecurity risks.\n To fulfill its oversight responsibilities, the Audit Committee reviews the measures implemented by the Company to identify and mitigate cybersecurity risks and the Audit Committee receives updates from our Global Chief Information Officer and CISO at least twice a year, which cover topics related to information security, privacy, and cybersecurity risks, and the risk management processes, including the status of significant cybersecurity incidences, the emerging threat landscape, and the status of projects to strengthen the Company’s information security posture. \nThe Audit Committee regularly reports to the Board on information technology, cybersecurity, and privacy matters. We have protocols by which certain cybersecurity incidents that meet established reporting thresholds are escalated within the Company and, where appropriate, reported promptly to the Audit Committee or Board, with ongoing updates regarding any such incident until it has been addressed.\nWe also rely on information technology, third-party service providers, and strategic joint venture partners to support our business and operations, including our secure processing of personal, confidential, financial, sensitive, proprietary, and other types of information, and to enable our service offerings. Despite ongoing efforts to improve our and third parties’ ability to protect against cybersecurity threats, we may not be able to protect all information systems, products, and service technologies.\n \nWhile we have not experienced any material cybersecurity threats or incidents as of the date of this Annual Report on Form 10-K, there can be no guarantee that we will not be the subject of future successful attacks, threats, or incidents that may materially affect the Company or its business strategy, results of operations or financial condition.\n Additional information on cybersecurity-related risks is discussed under the heading “\nWe are significantly dependent on information technology, and we may be unable to protect our information systems against service interruption, misappropriation of data, or breaches of security\n.” under"
  }
}