{
  "ticker": "KLAC",
  "cik": "0000319201",
  "company_name": "KLA CORP",
  "filing_date": "2025-08-08",
  "accession": "0000319201-25-000024",
  "primary_doc": "klac-20250630.htm",
  "item_sections": {
    "item1": "Item 1A “Risk Factors” as well as Item 1 “Business” and Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in this Annual Report on Form 10-K. You should carefully review these risks and also review the risks described in other parts of this report and in documents we file from time to time with the Securities and Exchange Commission (“SEC”), including the Quarterly Reports on Form 10-Q that we will file in the fiscal year ending June 30, 2026. You are cautioned not to place undue reliance on these forward-looking statements, and we expressly assume no obligation and do not intend to update the forward-looking statements in this report after the date hereof.\niii\nTable of Contents\nPART I\nITEM  1.\nBUSINESS\nThe Company\nKLA Corporation and its majority-owned subsidiaries (“KLA” or the “Company” and also referred to as “we,” “our,” “us” or similar references) are suppliers of industry-leading equipment and services that enables innovation throughout the electronics industry. We provide advanced process control and process-enabling solutions for manufacturing wafers, reticles/masks, chemicals/materials, integrated circuits (“IC” or “chip”), packaged ICs and printed circuit boards (“PCB”), as well as comprehensive support and services across our installed base. Our suite of advanced products, coupled with our unique process control software and services, allow us to deliver the solutions our customers need to achieve their technology advancement and high-volume production goals by significantly improving yields, while simultaneously reducing waste, risks and costs. This improves our customers’ overall profitability and return on investment. Our services business, which accounted for approximately 22% of our revenue in fiscal 2025, increases the value of our contract offerings and promotes the extension of system lifetimes.\nKLA was formed as KLA-Tencor Corporation in April 1997 through the merger of KLA Instruments Corporation and Tencor Instruments, two long-time leaders in the semiconductor capital equipment industry that began operations in 1975 and 1976, respectively. We are organized into three reportable segments: Semiconductor Process Control; Specialty Semiconductor Process; and PCB and Component Inspection. \nWithin the Semiconductor Process Control segment, our comprehensive portfolio of inspection, metrology and software products, as well as related services, help IC, wafer, reticle/mask and chemical/materials manufacturers achieve target yields throughout the entire fabrication process, from R&D to final volume production. These products and services are designed to provide comprehensive solutions to help customers accelerate development and production ramp cycles, achieve higher and more stable product yields and improve their overall profitability.\nWithin the Specialty Semiconductor Process segment, we develop and sell advanced vacuum deposition and etching process tools, which are used by a broad range of specialty semiconductor customers, including manufacturers of microelectromechanical systems (“MEMS”), radio frequency (“RF”) communication semiconductors, and power semiconductors for automotive and industrial applications.\nWithin the PCB and Component Inspection segment, we enable electronic device manufacturers to inspect, test and measure PCBs, IC substrates and packaged ICs to verify their quality, pattern the desired electronic circuitry on the relevant substrate and perform three-dimensional shaping of metalized circuits on multiple surfaces.\nAdditional information about KLA is available at www.kla.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act are available free of charge on our website as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. Information on our website is not part of this Annual Report on Form 10-K or our other filings with the SEC. Additionally, these filings may be obtained through the SEC’s website (www.sec.gov), which contains reports, proxy and information statements and other information regarding issuers that file electronically.\nInvestors and others should note that we may announce material financial information to investors using our investor relations website (ir.kla.com), which includes our SEC filings, press releases, public earnings calls and conference webcasts. The investor relations website is used to communicate with the public about us and our products, services and other matters. \nIndustry\nOur core focus is enabling technological advances and improving manufacturing yields in the semiconductor industry. The semiconductor fabrication process begins with a bare silicon wafer - a round disk typically 200 millimeters or 300 millimeters in diameter, about as thick as a credit card and gray in color. The process of manufacturing wafers is highly sophisticated and involves the creation of large ingots of silicon by pulling them out of a vat of molten silicon. The ingots are then sliced into wafers. Prime silicon wafers are then polished to a mirror finish. Other, more specialized wafers, such as epitaxial silicon (“epi”), silicon on insulator (“SOI”), gallium nitride (“GaN”) and silicon carbide (“SiC”) are also used in the semiconductor industry.\nThe manufacturing cycle of an IC is grouped into three phases: design, fabrication and testing. IC design involves the architectural layout of the circuit, as well as design verification and reticle generation. The fabrication of a semiconductor chip (or “semiconductor”) is accomplished by depositing a series of film layers that act as conductors, semiconductors or insulators \n1\nTable of Contents\non bare wafers. The deposition of these film layers is interspersed with numerous other process steps that create circuit patterns, remove portions of the film layers, and perform other functions such as heat treatment, measurement and inspection. Most advanced chip designs require hundreds of individual steps, many performed multiple times. Most chips consist of two main structures: the lower structure, typically consisting of transistors or capacitors, which performs the “smart” functions; and the upper “interconnect” structure, typically consisting of circuitry, which connects the components in the lower structure. When the layers on the wafer have been fabricated, each chip on the wafer is tested for functionality. The wafer is then cut into individual chips, and the chips that pass functional testing are packaged. Final testing is performed on all packaged chips. Packaged chips are then mounted onto PCBs for connection to the rest of the electronic system.\nOur business depends upon the capital expenditures of semiconductor, semiconductor-related and electronic device manufacturers. This is driven by the current and anticipated market demand for ICs, products utilizing ICs and other electronic components. We do not consider our business to be seasonal. Still, our business has historically been cyclical with respect to the capital equipment procurement practices of semiconductor, semiconductor-related and electronic device manufacturers, and it is impacted by the investment patterns of such manufacturers in different global markets. Downturns in the semiconductor or other industries in which we operate, slowdowns in the worldwide economy, customer consolidation as well as recent political and regulatory changes could have a material adverse effect on our future business and financial results.\nCompanies anticipating future market demands by developing and advancing new technologies and manufacturing processes are better positioned to lead in the semiconductor market. Accelerating the yield ramp and maximizing production yields of high-performance devices are critical goals of modern semiconductor and related electronics manufacturing. Ramping to high-volume production ahead of competitors can dramatically increase IC manufacturers’ revenue and profit for a given product. Leading semiconductor manufacturers invest in simultaneous production integration of multiple new process technologies, some requiring new substrate and film materials, new geometries, new transistor architectures, new power distribution schemes, advanced multi-patterning optical and extreme ultraviolet (“EUV”) lithography, and advanced packaging techniques. As design rules decrease, yields become more sensitive to the size and density of defects. Device performance characteristics (namely speed, capacity or power management) also become more sensitive to parameters such as linewidth and film thickness variation. New process materials require extensive characterization before they can be used in the manufacturing process. Moving several of these advanced technologies into production at once only adds to the risks that chipmakers face. The continuing evolution of semiconductors to smaller geometries and more complex multi-level circuitry has significantly increased the performance and cost requirements of the capital equipment used to manufacture these devices. Construction of an advanced IC fabrication facility today can cost well above $10 billion, substantially more than previous-generation facilities. In addition, chipmakers are demanding increased productivity and higher returns from their manufacturing equipment and are also seeking ways to extend the performance of their existing equipment.\nThe semiconductor capital equipment industry has been experiencing multiple growth drivers bolstered by demand for semiconductors from leading-edge foundry and logic manufacturers to support computational power and connectivity and continued investment by our customers in legacy nodes. Adoption of EUV in high volume manufacturing (“HVM”) for Logic and DRAM memory is driving new process control requirements and growth in key markets for KLA. Demand for advanced semiconductor technologies, particularly evident in the 2-nanometer node, which is seeing higher levels of investment and process control intensity, continues to drive investments in AI. Increasing complexity and value of semiconductor packages, particularly for AI and High-performance computing (“HPC”) applications, is also driving significant growth in the advanced packaging business. The digitization of all industries, including 5G markets and advances in healthcare and industrial applications, together with the increasing adoption of electric vehicles and intelligence in automobiles, are powering leading-edge design node technology investments and capacity expansions. \nRegionalization of semiconductors has become a trend as access to semiconductors is viewed from the lens of national security. China remains as a major region for the manufacturing of legacy node logic and memory chips, adding to its role as the world’s largest consumer of ICs. The Chinese government initiatives around self-sustainability are propelling China to expand its domestic manufacturing capacity. Although China is currently seen as an important long-term growth region for the semiconductor capital equipment sector, Commerce has added certain China-based entities to the U.S. Entity List (a list of parties that are generally ineligible to receive U.S. regulated items without prior licensing from Commerce), restricting our ability to provide products and services to such entities without an export license. In addition, Commerce has imposed export licensing requirements on China-based customers that are military end users or engaged in military end uses. It also requires our customers to obtain an export license when they use certain semiconductor capital equipment based on U.S. technology to manufacture products connected to certain entities on the U.S. Entity List.\n2\nTable of Contents\nResearch and Development\nThe market for semiconductor and electronics industries is characterized by rapid technological development and product innovation. These technical innovations are inherently complex and require long development cycles and appropriate professional staffing. We make significant investments in product R&D for the timely development of new products and enhancements necessary to maintain our competitive position. Accordingly, we devote a significant portion of our human and financial resources to R&D programs and seek to maintain close relationships with customers to remain responsive to their needs.\nOur key R&D activities during the fiscal year ended June 30, 2025 involved the development of process control and process-enabling solutions for front end semiconductors and advanced packaging. Our primary R&D centers are located in the U.S., United Kingdom (“U.K.”), India, China, Singapore and Israel. For information regarding our R&D expenses during the last three fiscal years, see Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in this Annual Report on Form 10-K.\nThe strength of our competitive positions in many of our existing markets is primarily due to our leading technology, which is the result of our continuing significant investments in product R&D. Even during down cycles in the semiconductor industry, we have remained committed to significant engineering efforts toward both product improvement and new product development to enhance our competitive position.\nCustomers\nWe count among our largest customers the leading semiconductor, semiconductor-related and electronic device manufacturers in Asia, the U.S. and Europe. Our future performance will depend, in part, on our ability to continue to compete successfully in Asia, one of the largest markets for our equipment. Our business depends on capital expenditures from these manufacturers which, in turn, depend on many factors including general economic conditions, anticipated market demand, evolving government regulations and capacity constraints. Our ability to compete in this area depends upon the continuation of favorable trading relationships between countries in the region and the U.S., and our continuing ability to maintain satisfactory relationships with leading semiconductor companies in the region. \nFor the fiscal years ended June 30, 2025, 2024 and 2023, the following customers each accounted for more than 10% of total revenues, primarily in the Semiconductor Process Control segment:\nFiscal Year Ended June 30,\n2025\n2024\n2023\nTaiwan Semiconductor Manufacturing Company Limited\nTaiwan Semiconductor Manufacturing Company Limited\nTaiwan Semiconductor Manufacturing Company Limited\nSamsung Electronics Co., Ltd.\nSales, Service and Marketing\nOur sales, service and marketing efforts aim to build deep long-term relationships with our customers. We focus on providing comprehensive resources for the full breadth of process control, process-enabling and yield management solutions for manufacturing and testing wafers and reticles, a wide variety of ICs, PCBs, IC substrates and packaging as well as general materials research. Our revenues are derived primarily from product sales and related service contracts, mostly through our direct sales force.\nWe believe that the size and location of our field sales, service engineering, applications engineering, and marketing organizations represent a competitive advantage in our served markets. We have direct sales forces in Asia, the U.S. and Europe. We maintain an export compliance program designed to meet the requirements of Commerce and the U.S. Department of State and the trade regulations of the international jurisdictions in which we operate.\nIn addition to sales and service offices in the U.S., we conduct sales, marketing and services out of subsidiaries or branches in many regions; some of the largest include China, Germany, Israel, Japan, Korea, Singapore, Taiwan and the U.K. We believe sales outside the U.S. will continue to be a significant percentage of our total revenues. International revenues accounted for approximately 89% of our total revenues in both of the fiscal years ended June 30, 2025 and 2024 and 88% of our total revenues in the fiscal year ended June 30, 2023. Additional information regarding our revenues from foreign operations for our last three fiscal years can be found in Note 18 “Segment Reporting and Geographic Information” to our Consolidated Financial Statements.\nInternational sales and operations may be adversely affected by the imposition of governmental controls, restrictions on \n3\nTable of Contents\nexport technology, political instability, trade restrictions, changes in tariffs and the difficulties associated with staffing and managing international operations. In addition, international sales may be adversely affected by the economic conditions in each country and by fluctuations in currency exchange rates. Such fluctuations may negatively impact our ability to compete on price with local providers or the value of revenues we generate from our international business. Although we attempt to manage some of the currency risk inherent in non-U.S. dollar product sales through hedging activities, there can be no assurance that such efforts will be adequate. These factors, as well as any of the other risk factors related to our international business and operations that are described in",
    "item1a": "Item 1A “Risk Factors – \nWe depend on information technology for our business and are exposed to risks related to cybersecurity threats and cyber incidents affecting our, our customers’, suppliers’ and other service providers’ systems and networks.\n”\nCybersecurity Governance\nOur Board considers cybersecurity risk as part of its risk oversight function and has delegated to the Audit Committee (the “Committee”) oversight of cybersecurity risks, including oversight of management’s implementation of our cybersecurity risk management process.\n32\nTable of Contents\nThe Committee receives quarterly reports from management on our cybersecurity risks. In addition, management updates the Committee, where it deems appropriate, regarding cybersecurity incidents it considers to be significant or potentially significant.\nThe Committee reports to the full Board regarding its activities, including those related to cybersecurity.\n The full Board also regularly receives briefings from management on our cyber risk management process. Board members receive presentations on cybersecurity topics from management or external experts as part of the Board’s continuing education on topics that impact public companies.\nOur \nmanagement team, including our Chief Legal Officer and Chief Information Security Officer (“CISO”)\n, is responsible for assessing and managing our material risks from cybersecurity threats. The team has primary responsibility for our overall cybersecurity risk management process and supervises both our internal cybersecurity personnel and our retained external cybersecurity consultants.\n \nOur CISO has a degree with a focus on information technology, and is a Certified Information Systems Auditor with over 20 years of experience in information technology related roles, including building and leading cybersecurity, risk management and information protection teams.\n \nOur CISO reports to our Chief Legal Officer who oversees cybersecurity, and holds a Carnegie Mellon University Software Engineering Institute CERT Certificate for Cybersecurity Oversight. The other members of the operational cybersecurity team collectively have decades of relevant education and experience and maintain a wide range of industry certifications. We invest in regular, ongoing cybersecurity training for the cybersecurity team.\nOur management team takes steps to stay informed about and monitor efforts to prevent, detect, mitigate and remediate cybersecurity risks and incidents through various means, which may include: briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including external consultants engaged by us; and alerts and reports produced by security tools deployed in our information technology environment.",
    "item1b": "ITEM  1B.\nUNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM  1C.\nCYBERSECURITY \nCybersecurity Risk Management and Strategy\nWe have a cybersecurity risk management process intended to protect the confidentiality, integrity and availability of our critical systems and information. We design and assess our process based on the National Institute of Standards and Technology Cybersecurity Framework (“NIST CSF”). This does not imply that we meet any particular technical standards, specifications or requirements, only that we use the NIST CSF as a guide to help us identify, assess and manage cybersecurity risks relevant to our business.\nOur cybersecurity risk management process is integrated into our overall risk management process, and shares common methodologies, reporting channels and governance processes that apply across the risk management process to other legal, compliance, strategic, operational and financial risk areas.\nKey elements of our cybersecurity risk management process include, but are not limited to, the following:\n•\nRisk assessments designed to help identify material risks from cybersecurity threats to our critical systems and     information;\n•\nA cybersecurity team principally responsible for managing (1) our cybersecurity risk assessment processes, (2) our security controls, and (3) our response to cybersecurity incidents;\n•\nThe use of external service providers, where appropriate, to assess, test or otherwise assist with aspects of our security processes;\n•\nCybersecurity awareness training of our workforce;\n•\nA cybersecurity incident response plan and processes for responding to cybersecurity incidents; and\n•\nRisk management processes based on our assessment of the respective risk profile of key third parties.\nWe face risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition.\n See Part I"
  }
}