{
  "ticker": "KMB",
  "cik": "0000055785",
  "company_name": "KIMBERLY CLARK CORP",
  "filing_date": "2025-02-13",
  "accession": "0000055785-25-000013",
  "primary_doc": "kmb-20241231.htm",
  "item_sections": {
    "item1": "Item 1A, \"Risk Factors\" in this Form 10-K for additional information.\nBusiness Environment and Trends\nOur results of operations have been, and we expect them to continue to be, affected by the following factors and key trends, which may cause our future results of operations to differ from our historical results discussed under “Consolidated Results of Operations.”\nBirth Rate Trends\n - Sales of our baby and child care products are highly correlated with birth rate trends. In recent years, birth rate declines in key countries, including China, South Korea and the U.S., have pressured category volume growth rates. To help mitigate the effects of birth rate declines, we aim to drive sales growth at or ahead of category growth rates through innovation, premiumization, strong brand building plans and digital marketing investment as part of our growth strategy.\nCompetition\n - Our products are sold in a highly competitive global marketplace. Our competitors include global, regional and local manufacturers, including private label manufacturers which offer products that are typically sold at lower prices. In particular, private label market share has been increasing in the tissue category. Increased purchases of private label products could reduce net sales of our higher-margin products which would negatively impact our profitability. While the global marketplace in which we operate has always been highly competitive, we continue to experience increased concentration and the growing presence of large-format retailers, discounters and e-tailers. This market environment has resulted in increased pressure on pricing and other competitive factors, and we expect these pressures to continue in the coming year.\nPricing\n - Our net sales growth and profitability may be affected as we adjust prices to address market conditions. We adjust our product prices based on a number of variables including demand, the competitive environment, technological improvements, product innovations and changes in our raw material, distribution, energy and other input costs. Price changes may affect net sales, earnings and market share in the near term as the market adjusts to new pricing and other market conditions.\nOperating Costs\n - Our operating costs include raw materials, labor, selling, general and administrative expenses, general business taxes, currency impacts and financing costs. We manage these costs through cost saving and productivity initiatives, sourcing and hedging programs, and pricing actions. To remain competitive on our operating structure, we continue to work on programs to expand our profitability, including our 2024 Transformation Initiative. While we saw stabilization in input costs in 2024 with tailwinds in fiber, resin and energy, the overall cost basket remains elevated versus pre-pandemic levels. In 2025, we expect net input costs to be inflationary, including the impact from currency on our non-U.S. operations. \nEvolving Consumer Product and Shopping Preferences\n - The retail landscape in many of our markets continues to evolve due to the rapid growth of e-commerce retailers, changing consumer preferences (as consumers increasingly shop online) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. Changing consumer preferences also include increased concerns in regard to post-consumer waste and packaging materials and their impact on environmental sustainability. If we experience \n20\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nlower sales due to changes in consumer demand for our products, our earnings could decrease. We believe our strategic growth focus, sustainability initiatives, innovation pipeline and continued investment in e-commerce capabilities has us well positioned relative to these changing dynamics.\nVolatility of Global Markets\n - Our growth strategy depends in part on our ability to expand our international operations, including in emerging markets.  Some of these markets have greater political, economic and currency volatility and greater vulnerability to infrastructure and labor disruptions. Volatility in these markets affects our production costs and the demand for our products and may impact our supply chain and distribution networks. Volatility in global consumer demand, commodity costs and foreign currency exchange rates increased significantly over the past few years and is expected to continue in the near term.\nClimate Change\n - We operate in many regions around the world where our businesses could be disrupted by climate change. Our climate change risk categories include risks related to the transition to a lower-carbon economy (“Transition Risks”) and risks related to the physical impacts of climate change (“Physical Risks”). Transition Risks include increased costs of carbon emission, increased cost to produce products in compliance with future regulations, increased raw materials cost, shifts in customer/consumer values and other legal, regulatory and technological risks. \nP\nhysical Risks include the risk of direct damage to assets or supply chain disruption caused by severe weather events such as floods, storms, wildfires and droughts. We continue to progress toward our 2030 Sustainability Goals which include elements that aim for reductions in greenhouse gas emissions, use of natural forest fibers, use of plastics and use of water in water-stressed regions.\nWar in Ukraine\n - Consistent with the humanitarian nature of our products, we manufacture and sell only essential items in Russia, such as baby diapers and feminine pads, which are critical to the health and hygiene of women, girls and babies. Beginning in March 2022, we significantly adjusted our business in Russia, substantially curtailing media, advertising and promotional activity and suspending capital investments, other than certain maintenance investments, in our sole manufacturing facility in Russia. Our Russia business has represented approximately 1% to 2% of our net global sales, operating profit and total assets. Our ability to continue our operations in Russia may change as the situation evolves. We have experienced high input costs, supply chain complexities, reduced consumer demand, restricted access to raw materials and production assets, and restricted access to financial institutions, as well as supply chain, professional services, monetary, currency, trade and payment/investment sanctions and related controls. As the business, geopolitical and regulatory environment concerning Russia evolves, we may not be able to sustain the limited manufacture and sale of our products, and our assets may be partially or fully impaired. \n21\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nConsolidated Results of Operations\nThe following discussion and analysis compares our consolidated net sales, operating profit and other information for 2024 with 2023.\nYear Ended December 31\n2024\n2023\nChange\n2024 vs. 2023\nNet Sales\n$\n20,058\n$\n20,431\n(1.8)\n%\nGross Profit\n7,180\n7,032\n2.1 \n%\nOperating Profit\n3,210\n2,344\n36.9 \n%\nProvision for income taxes\n(565)\n(453)\n24.7 \n%\nNet Income Attributable to Kimberly-Clark Corporation\n2,545\n1,764\n44.3 \n%\nDiluted Earnings per Share\n7.55\n5.21\n44.9 \n%\nAdjusted Gross Profit\n(a)\n7,324\n7,047\n3.9 \n%\nAdjusted Operating Profit\n(a)\n3,237\n2,958\n9.4 \n%\nAdjusted Earnings per Share\n(a)\n7.30\n6.57\n11.1 \n%\nAdjusted Effective Tax Rate\n(a)\n23.0\n \n%\n23.2 \n%\n(0.2)\n%\n(a)    Adjusted amounts are Non-GAAP financial measures. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to Non-GAAP measures.\nNet Sales:\nDrivers of the changes in net sales were:\nPercent Change in Net Sales \nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\n2024 versus 2023\n0.8\n0.4\n1.9\n(1.2)\n(3.8)\n(1.8)\n3.2\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the Brazil tissue and professional business, sale of the PPE business and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\nNet sales of $20.1 billion for the year ended December 31, 2024 declined 1.8% primarily due to unfavorable currency impacts and divestitures and business exits. Excluding these items, organic growth was 3.2% driven by a 1.9% increase in price, primarily in hyperinflationary economies, coupled with volume and mix gains across all three reportable segments.  \nGross and Operating Profits\nGross profit of $7.2 billion for the year ended December 31, 2024 increased 2.1%, while gross margin of 35.8% increased 140 basis points. Gross margin in the current year included approximately 70 basis points for charges related to the 2024 Transformation Initiative. Excluding these charges, adjusted gross margin increased 200 basis points to 36.5% primarily due to gross productivity savings from integrated margin management of approximately $500 million, favorable pricing net of inflation and volume gains, partially offset by higher manufacturing costs.  \nOperating profit of $3.2 billion for the year ended December 31, 2024 increased 36.9%. Results in 2024 included a  $565 million gain from the sale of our PPE business, offset by charges of $456 million related to the 2024 Transformation Initiative and $136 million from the impairment of intangible assets and litigation and regulatory matters associated with a previously exited business. Results in 2023 included $658 million of charges from the impairment of intangible assets and a $44 million net benefit related to the sale of our Brazil tissue and professional business. Excluding these items, adjusted operating profit was $3.2 billion in 2024 and $3.0 billion in 2023.\n22\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDrivers of the changes in adjusted operating profit were:\nPercent Change in\nAdjusted Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\nCurrency Translation\nOther\n(a)\nTotal\n(b)\n2024 versus 2023\n1.6\n13.5\n(5.8)\n9.0\n(6.2)\n(2.7)\n9.4\n(a)    Includes impact of changes in product mix and marketing, research and general expenses.\n(b)    Adjusted Operating Profit is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\nAdjusted operating results benefited from higher adjusted gross profit discussed above, partially offset by unfavorable currency impacts, primarily due to hyperinflationary economies, and higher marketing, research and general expenses. \nNet Income and Diluted EPS\nNet income of $2.5 billion for the year ended December 31, 2024 increased 44.3% primarily due to the increase in operating profit discussed above. Net interest expense of $222 was largely in line with the prior year period. Our share of net income of equity companies was $216 million, an increase of 10.2% primarily driven by Kimberly-Clark de Mexico, S.A.B. de C.V., which benefited from volume, mix and pricing growth and productivity savings, partially offset by unfavorable foreign currency effects and higher general and administrative expenses. The effective tax rate was 19.3% in 2024 compared to 22.4% in 2023, with the decline primarily due to the net benefit of items not reflective of our underlying operations discussed in the section above. Excluding these benefits, the adjusted effective tax rate was 23.0% in 2024 compared to 23.2% in 2023. \nDiluted earnings per share of $7.55 for the year ended December 31, 2024 increased 44.9% reflective of the growth in net income discussed above. Adjusted earnings per share of $7.30 increased 11.1% primarily driven by higher adjusted operating profit.\nResults of Operations by Segment\nThe following presents the results of the Company’s reportable segments and compares our segment net sales, operating profit and other information for 2024 with 2023 and 2023 with 2022. Certain data from prior periods presented have been recast to reflect the changes in reportable segments noted above. \nDrivers of the changes in segment net sales and operating profit were:\nPercent Change in Segment Net Sales\nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\n2024 versus 2023\nNA\n0.5\n0.5\n0.1\n(0.8)\n(0.1)\n0.2\n1.1\nIPC\n0.9\n0.5\n7.8\n(0.1)\n(12.2)\n(3.1)\n9.2\nIFP\n1.5\n0.3\n(2.0)\n(4.4)\n(1.2)\n(5.9)\n(0.2)\n2023 versus 2022\nNA\n0.3\n0.4\n4.3\n0.2\n(0.3)\n4.9\n5.0\nIPC\n(4.2)\n1.6\n7.9\n—\n(7.9)\n(2.6)\n5.3\nIFP\n(7.6)\n1.1\n9.3\n(3.9)\n(1.8)\n(2.9)\n2.8\n23\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nPercent Change in\nSegment Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\n(d)\nCurrency Translation\nOther\n(e)\nTotal\n2024 versus 2023\nNA\n0.9\n0.4\n—\n1.9\n(0.1)\n(2.0)\n1.1\nIPC\n3.6\n73.0\n(33.3)\n8.3\n(27.8)\n0.7\n24.5\nIFP\n0.9\n(25.2)\n13.8\n54.9\n(2.7)\n(10.3)\n31.4\n2023 versus 2022\nNA\n(0.6)\n21.5\n5.5\n5.5\n(0.3)\n(12.8)\n18.8\nIPC\n(7.3)\n71.2\n(35.7)\n2.4\n(16.8)\n(19.5)\n(5.7)\nIFP\n(31.9)\n130.5\n(46.7)\n(30.5)\n(3.5)\n(5.8)\n12.1\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the Brazil tissue and professional business, sale of the PPE business and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\n(d)    Includes net impact of productivity initiatives, product and supply chain investments and other changes in cost of products sold.\n(e)    Includes impact of changes in product mix and marketing, research and general expenses.\nNorth America\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n11,008\n \n$\n10,988 \n$\n10,470 \n0.2 \n%\n4.9 \n%\nOperating Profit\n2,534\n \n2,507 \n2,110 \n1.1 \n%\n18.8 \n%\n2024 versus 2023\nNet sales of $11.0 billion were flat as an increase in organic sales of 1.1% was largely offset by divestitures and business exits. Organic sales benefited from volume and mix gains, led by Baby & Child Care and Adult Care. \nOperating profit of $2.5 billion increased 1.1% primarily due to gross productivity savings and volume growth, partially offset by incremental manufacturing costs and higher advertising and promotion expenses. \n2023 versus 2022\nNet sales of $11.0 billion increased 4.9% primarily due to higher net selling prices across the entire product portfolio, led by Professional and Family Care. \nOperating profit of $2.5 billion increased 18.8% primarily due to favorable pricing net of inflation and gross productivity savings. These increases were partially offset by incremental advertising and promotion and research, selling and general expenses.   \nInternational Personal Care\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n5,715\n \n$\n5,899 \n$\n6,054 \n(3.1)\n%\n(2.6)\n%\nOperating Profit\n787\n \n632 \n670 \n24.5 \n%\n(5.7)\n%\n2024 versus 2023\nNet sales of $5.7 billion decreased 3.1% as unfavorable currency impacts of 12.2% were partially offset by a 9.2% increase in organic sales. Organic sales benefited from higher net selling prices of 7.8%, primarily from hyperinflationary economies, and volume growth of 0.9%, led by China. \n24\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nOperating profit of $787 million increased 24.5% primarily due to favorable pricing net of inflation and gross productivity savings, partially offset by unfavorable currency impacts and higher manufacturing costs. Pricing and unfavorable currency impacts were primarily driven by hyperinflationary economies. Other operating costs, namely incremental advertising investments, were largely offset by lower monetary losses from changes in exchange rates in highly inflationary economies. \n2023 versus 2022\nNet sales of $5.9 billion decreased 2.6% as unfavorable currency impacts of 7.9% were partially offset by a 5.3% increase in organic sales. Organic sales benefited from higher net selling prices of 7.9%, primarily from hyperinflationary economies, and product mix gains of 1.6%, partially offset by lower volumes.\nOperating profit of $632 million decreased 5.7% primarily due to unfavorable currency impacts, higher advertising and promotion expenses, and lower volumes, partially offset by favorable pricing net of inflation. Pricing and unfavorable currency impacts were primarily driven by hyperinflationary economies.    \nInternational Family Care & Professional\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n3,335\n \n$\n3,544 \n$\n3,651 \n(5.9)\n%\n(2.9)\n%\nOperating Profit\n377\n \n287 \n256 \n31.4 \n%\n12.1 \n%\n2024 versus 2023\nNet sales of $3.3 billion decreased 5.9% primarily due to divestitures and business exits and unfavorable currency impacts. Organic sales were relatively flat as volume and mix gains were offset by lower pricing in Europe due to temporary energy surcharge-related price increases in the prior year.\nOperating profit of $377 million increased 31.4% driven by gross productivity savings, partially offset by unfavorable pricing net of inflation and higher research, selling and general expenses. \n2023 versus 2022\nNet sales of $3.5 billion decreased 2.9% primarily due to divestitures and business exits and unfavorable currency impacts, partially offset by organic sales. Organic sales benefited from an increase in net selling prices and product mix of 9.3% and 1.1%, respectively, partially offset by lower volumes reflecting expected elasticity from pricing actions. The increase in net selling prices was driven by temporary energy surcharge-related price increases.   \nOperating profit of $287 million increased 12.1% primarily due to favorable pricing net of inflation, partially offset by lower volumes and higher manufacturing costs.  \nLiquidity and Capital Resources\nCash Provided by Operations\nCash provided by operations for the year ended December 31, 2024 was $3.2 billion compared to $3.5 billion in the prior year. Cash flow from operations benefited from higher operating profit, excluding the effect of non-cash charges, however this increase was more than offset by changes in working capital relative to the prior year coupled with cash payments for the 2024 Transformation Initiative. The impact to cash from working capital was primarily driven by the timing of cash flows associated with the lapping of higher commodity and energy costs in prior periods.  \n25\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nObligations\nThe following table presents our total contractual obligations for which cash flows are fixed or determinable. \nTotal\n2025\n2026\n2027\n2028\n2029\n2030+\nLong-term debt\n$\n7,451 \n$\n566 \n$\n410 \n$\n606 \n$\n700 \n$\n704 \n$\n4,465 \nInterest payments on long-term debt\n2,814 \n272 \n252 \n246 \n223 \n189 \n1,632 \nOperating lease liabilities\n480 \n146 \n130 \n82 \n43 \n28 \n51 \nUnconditional purchase obligations\n2,188 \n1,507 \n427 \n226 \n10 \n3 \n15 \nOpen purchase orders\n2,338 \n1,885 \n412 \n28 \n6 \n3 \n4 \nTotal contractual obligations\n$\n15,271 \n$\n4,376 \n$\n1,631 \n$\n1,188 \n$\n982 \n$\n927 \n$\n6,167 \nThe unconditional purchase obligations are for the purchase of raw materials, primarily superabsorbent materials, pulp and utilities. Although we are primarily liable for payments on the above operating leases and unconditional purchase obligations, based on historic operating performance and forecasted future cash flows, we believe exposure to losses, if any, under these arrangements is not material.\nThe open purchase orders displayed in the table represent amounts for goods and services we have negotiated for delivery.\nThe table does not include amounts where payments are discretionary or the timing is uncertain. The following payments are not included in the table:\n•\nWe will fund our defined benefit pension plans to meet or exceed statutory requirements and currently expect to contribute approximately $15 to these plans in 2025. \n•\nOther postretirement benefit payments are estimated using actuarial assumptions, including expected future service, to project the future obligations. Based upon those projections, we anticipate making annual payments for these obligations of approximately $50 through 2034.\n•\nAccrued income tax liabilities for uncertain tax positions, deferred taxes and noncontrolling interests.\nInvesting\nCash used for investing for the year ended \nDecember 31, 2024 \nwas \n$100 compared to $418 in the prior year as capital spending in the current year was largely offset by proceeds from asset and business dispositions. Capital spending was $721 for the year ended December 31, 2024 compared to $766 in the prior year. Proceeds from asset and business dispositions of $651 primarily reflected the sale of our PPE business while prior year proceeds of $245 primarily reflected the sale of our Brazil tissue and professional business. We expect capital spending to be approximately $1.0 to $1.2 billion in 2025, including incremental spending from the 2024 Transformation Initiative.\nFinancing\nCash used for financing for the year ended December 31, 2024 was $3.2 billion compared to $2.4 billion in the prior year. This increase was primarily due to increased share repurchases, debt repayments and dividends paid. During 2024, we repurchased 7.2 million shares of our common stock at a cost of $1.0 billion through a broker in the open market, and paid $1.6 billion in dividends.\nWe issue long-term debt in the public market periodically. Proceeds from the offerings are used for general corporate purposes, including repayment of maturing debt or outstanding commercial paper indebtedness. See Item 8, Note 6 to the consolidated financial statements for details.\nOur short-term debt, which consists of U.S. commercial paper with original maturities up to 90 days and/or other similar short-term debt issued by non-U.S. subsidiaries, was $3 as of December 31, 2024 (included in debt payable within one year on the consolidated balance sheets). The average month-end balance of short-term debt for the year ended December 31, 2024 was $5. These short-term borrowings provide supplemental funding to support our operations. The level of short-term debt generally fluctuates depending upon the amount of operating cash flows and the timing of customer receipts and payments for items such as pension contributions, dividends and income taxes. \nWe maintain a \n$2.0 billion\n revolving credit facility which expires in \nJune 2028\n and \na $750 revolving credit \n26\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nfacility which expires in May 2025.\n \nThese facilities, currently unused, support our commercial paper program, and would provide liquidity in the event our access to the commercial paper markets is unavailable for any reason.\nAs of December 31, 2024, total debt was $7.4 billion compared to \n$8.0 billion\n as of December 31, 2023.\nIn October 2021, members of the Organization for Economic Co-operation and Development/G20 Inclusive Framework on Base Erosion and Profit Shifting Project (“Inclusive Framework”) agreed to a two-pillar solution to reform the international tax framework to realign international taxation with economic activities and value creation. Inclusive Framework members agreed to a coordinated system of Global anti-Base Erosion rules, referred to as Pillar 2, that are designed to ensure large multinational enterprises pay a minimum 15% level of tax on the income arising in each jurisdiction in which they operate. Many countries have formally implemented Pillar 2, and several other countries have draft legislation to implement this framework. The insignificant impact of Pillar 2 has been included in our consolidated financial statements. We will continue to monitor and evaluate new legislation and guidance, which could change our current assessment.\nWe believe that our ability to generate cash from operations and our capacity to issue short-term and long-term debt are adequate to fund working capital, capital spending, pension contributions, share repurchases, dividends and other needs for the foreseeable future. Further, we do not expect restrictions or taxes on repatriation of cash held outside of the U.S. to have a material effect on our overall business, liquidity, financial condition or results of operations for the foreseeable future.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make significant estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of net sales and expenses during the reporting period. The critical accounting estimates we used in the preparation of the consolidated financial statements are those that are important both to the presentation of our financial condition and results of operations and require significant judgments by management with regard to estimates used. The critical judgments by management relate to accruals for sales incentives and trade promotion allowances, pension and other postretirement benefits, deferred income taxes and potential income tax assessments, and goodwill and other intangible assets. These critical accounting estimates have been reviewed with the Audit Committee of the Board of Directors.\nSales Incentives and Trade Promotion Allowances\nTrade promotion programs include introductory marketing funds such as slotting fees, cooperative marketing programs, temporary price reductions and other activities conducted by our customers to promote our products. Rebate and promotion accruals are based on estimates of the quantity of customer sales. Promotion accruals also consider estimates of the number of consumer coupons that will be redeemed and timing and costs of activities within the promotional programs. Generally, the estimated redemption value of consumer coupons and related expense are based on historical patterns of coupon redemption, influenced by judgments about current market conditions such as competitive activity in specific product categories, and the cost is recorded when the related revenue from customers is realized. Our related accounting policies are discussed in Item 8, Note 1 to the consolidated financial statements.\nEmployee Postretirement Benefits\nSubstantially all regular employees in the U.S. and the United Kingdom are covered by defined contribution retirement plans and certain U.S. and United Kingdom employees previously earned benefits covered by defined benefit pension plans that currently provide no future service benefit (the \"Principal Plans\"). Certain other subsidiaries have defined benefit pension plans or, in certain countries, termination pay plans covering substantially all regular employees. Our related accounting policies and account balances are discussed in Item 8, Note 8 to the consolidated financial statements.\nChanges in certain assumptions could affect pension expense and the benefit obligations, particularly the estimated long-term rate of return on plan assets and the discount rate used to calculate the obligations:\n27\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n•\nLong-term rate of return on plan assets\n. The expected long-term rate of return is evaluated on an annual basis. In setting these assumptions, we consider a number of factors including projected future returns by asset class relative to the target asset allocation. Actual asset allocations are regularly reviewed and they are periodically rebalanced to the targeted allocations when considered appropriate. \nAs of December 31, 2024, the Principal Plans had cumulative unrecognized investment and actuarial losses of approximately $1.0 billion. These unrecognized net losses may increase future pension expense if not offset by (i) actual investment returns that exceed the assumed investment returns, (ii) other factors, including reduced pension liabilities arising from higher discount rates used to calculate pension obligations, or (iii) other actuarial gains, and whether such accumulated actuarial losses at each measurement date exceed the \"corridor\" as required\n. \nIf the expected long-term rate of return on assets for the Principal Plans were lowered by 0.25%, the impact on annual pension expense would not be material in 2025\n.\n•\nDiscount rate\n. The discount (or settlement) rate used to determine the present value of our future U.S. pension obligation as of December 31, 2024 was based on a portfolio of high quality corporate debt securities with cash flows that largely match the expected benefit payments of the plan. For the United Kingdom plan, the discount rate was determined based on yield curves constructed from a portfolio of high quality corporate debt securities. Each year's expected future benefit payments were discounted to their present value at the appropriate yield curve rate to determine the pension obligations. If the discount rate assumptions for these same plans were reduced by 0.25%, the increase in annual pension expense would not be material in 2025, and the December 31, 2024 pension liability would increase by about $50.\n•\nOther assumptions\n. There are a number of other assumptions involved in the calculation of pension expense and benefit obligations, primarily related to participant demographics and benefit elections. \nPension expense for defined benefit pension plans is estimated to approximate $50 in 2025. Pension expense beyond 2025 will depend on future investment p\nerformance, our contributions to the pension trusts, changes in discount rates and various other factors related to the covered participants in the plans.\nSubstantially all U.S. retirees and employees have access to our unfunded health care and life insurance benefit plans. Changes in significant assumptions could affect the consolidated expense and benefit obligations, particularly the discount rate used to calculate the obligations and the health care cost trend rate:\n•\nDiscount rate\n. The determination of the discount rates used to calculate the benefit obligations of the plans is discussed in the pension ben\nefit section above, and the methodology for each country is the same as the methodology used to determine the discount rate for that country's pension obligation. If the discount rate assumptions for these plans were reduced by 0.25%, the impact to 2025 other postretirement benefit expense and the increase in the December 31, 2024 benefit liability would not be material. \n•\nHealth care cost trend rate\n. The health care cost trend rate is based on a combination of inputs including our recent claims history and insights from external advisers regarding recent developments in the health care marketplace, as well as projections of future trends in the marketplace.\nDeferred Income Taxes and Potential Assessments\nAs a global organization, we are subject to income tax requirements in various jurisdictions in the U.S. and internationally. Changes in certain assumptions related to income taxes could significantly affect consolidated results, particularly with regard to valuation allowances on deferred tax assets, undistributed earnings of subsidiaries outside the U.S. and uncertain tax positions. Our income tax related accounting policies, account balances and matters affecting income taxes are discussed in Item 8, Note 13 to the consolidated financial statements. \n•\nDeferred tax assets and related valuation allowances\n. We have recorded deferred tax assets related to, among other matters, income tax loss carryforwards, income tax credit carryforwards and capital loss carryforwards and have established valuation allowances against these deferred tax assets. These carryforwards are primarily in non-U.S. taxing jurisdictions and in certain states in the U.S. Foreign tax credits earned in the U.S. in current and prior years, which cannot be used currently, also give rise to net deferred tax assets. In determining the valuation allowances to establish against these deferred tax assets, \n28\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nmany factors are considered, including the specific taxing jurisdiction, the carryforward period, income tax strategies and forecasted earnings for the entities in each jurisdiction. A valuation allowance is recognized if, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred tax asset will not be realized.\n•\nUndistributed earnings\n. A\ns of December 31, 2024, we have accumulated undistributed earnings generated by our foreign subsidiaries of approximately $10.6 billion. Earnings of $3.4 billion were previously subject to U.S. federal income tax. Any additional taxes due with respect to such previously-taxed foreign earnings, if repatriated, would generally be limited to foreign and U.S. state income taxes. Deferred taxes have been recorded on $932 of earnings of foreign consolidated subsidiaries expected to be repatriated. We do not intend to distribute any remaining foreign earnings and therefore have not recorded deferred taxes for foreign and U.S. income taxes on such earnings. We consider any excess of the amount for financial reporting over the tax basis in our foreign subsidiaries to be indefinitely reinvested. The determination of deferred tax liabilities on the amount of financial reporting over tax basis or the remaining foreign earnings is not practicable.\n•\nUncertain tax positions\n. We record our global tax provision based on the respective tax rules and regulations for the jurisdictions in which we operate. Where we believe that a tax position is supportable for income tax purposes, the item is included in our income tax returns. Where treatment of a position is uncertain, a liability is recorded based upon the expected most likely outcome taking into consideration the technical merits of the position based on specific tax regulations and facts of each matter. These liabilities may be affected by changing interpretations of laws, rulings by tax authorities or the expiration of the statute of limitations.\nGoodwill and Other Intangible Assets\nGoodwill and other indefinite-lived intangible assets are not subject to amortization and are tested for impairment annually and whenever events or changes in circumstances indicate that impairment may have occurred. Intangible assets that are deemed to have finite lives are amortized over their useful lives, generally ranging from 4 to 20 years. We typically obtain the assistance of third-party valuation specialists to measure the acquisition date fair values of goodwill and other intangible assets acquired.\nEvents and conditions that could result in impairment include a sustained drop in the market price of our common shares, increased competition or loss of market share, obsolescence, product claims that result in a significant loss of sales or profitability over the product life, deterioration in macroeconomic conditions, or declining financial performance in comparison to projected results.\nGoodwill\nIn our evaluation of goodwill impairment, we have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of each reporting unit is more than its carrying value. Qualitative factors include macroeconomic, industry and competitive conditions, legal and regulatory environments, historical and projected financial performance, significant changes in the reporting unit and the magnitude of excess fair value over carrying amount from the previous quantitative impairment testing. If the qualitative assessment determines that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, then a quantitative impairment test to estimate fair value must be performed. When a quantitative test is considered necessary, estimates of fair value for goodwill impairment testing are determined based on a discounted cash flow model and a market-based approach. We use inputs from our long-range planning process to determine growth rates for sales and earnings. The other key estimates and factors used in the discounted cash flow model include, but are not limited to, discount rates, actual business trends experienced, commodity prices, foreign exchange rates, inflation and terminal growth rates.\nWe completed our required annual assessment of goodwill for impairment for all our reporting units using a qualitative assessment as of the first day of the third quarter of the year ended December 31, 2024, concluding that it was more likely than not that the fair value of each reporting unit significantly exceeded the respective carrying amounts. \n29\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDuring the fourth quarter of 2024, our internal reporting and management structure changed, resulting in the identification of three new reportable segments defined by geographic regions and product groupings. Further, this reorganization resulted in changes to the composition of our reporting units.\nAs a result of our segment reorganization, we reassigned assets and liabilities to the applicable reporting units and allocated goodwill using a relative fair value approach. As this change in the composition of our reporting units was considered a goodwill triggering event, we performed an impairment test on both a pre- and post- reorganization basis. In both cases, we concluded there was no goodwill impairment as the fair value of each reporting unit significantly exceeded the respective carrying amounts. \nOther Intangible Assets\nWe evaluate the useful lives of our other intangible assets, primarily brands, to determine if they are finite or indefinite-lived. Reaching a determination on useful life requires significant judgments and assumptions regarding the future effects of obsolescence, demand, competition, other economic factors (such as the stability of the industry, known technological advances and expected changes in distribution channels), the level of required maintenance expenditures, and the expected lives of other related groups of assets.\nOur estimate of the fair value of our brand assets is based on a discounted cash flow model and a market-based approach using inputs which include projected revenues from our long-range plan, assumed royalty rates that could be payable if we did not own the brands, and a discount rate. The cash flows used in the discounted cash flow model are consistent with those we use in our internal planning, which gives consideration to actual business trends experienced and the long-term business strategy.\nWe performed our 2024 impairment assessment of our intangible assets as of the first day of the third quarter using a qualitative assessment. Other than discussed in Item 8, Note 4 to the consolidated financial statements, no additional impairment indicators were found to be present. \nNew Accounting Standards\nSee Item 8, Note 1 to the consolidated financial statements for a description of recent accounting standards and their anticipated effects on our consolidated financial statements.\nForward Looking Statements\nCertain matters contained in this report concerning the business outlook, including raw material, energy and other input costs, the anticipated charges and savings from the 2024 Transformation Initiative, cash flow and uses of cash, growth initiatives, innovations, marketing and other spending, net sales, anticipated currency rates and exchange risks, including the impact in Argentina and Türkiye, effective tax rate, contingencies and anticipated transactions of Kimberly-Clark, including dividends, share repurchases and pension contributions, constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and are based upon management's expectations and beliefs concerning future events impacting Kimberly-Clark. There can be no assurance that these future events will occur as anticipated or that our results will be as estimated. Forward-looking statements speak only as of the date they were made, and we undertake no obligation to publicly update them.\nThe assumptions used as a basis for the forward-looking statements include many estimates that, among other things, depend on the achievement of future cost savings and projected volume increases. In addition, many factors outside our control, including the risk that we are not able to realize the anticipated benefits of the 2024 Transformation Initiative (including risks related to disruptions to our business or operations or related to any delays in implementation), war in Ukraine (including the related responses of consumers, customers, and suppliers and sanctions issued by the U.S., the European Union, Russia or other countries), pandemics, epidemics, fluctuations in foreign currency exchange rates, the prices and availability of our raw materials, supply chain disruptions, disruptions in the capital and credit markets, counterparty defaults (including customers, suppliers and financial institutions with which we do business), failure to realize the expected benefits or synergies from our acquisition and disposition activity, impairment of goodwill and intangible assets and our projections of operating results and other factors that may affect our impairment testing, changes in customer preferences, severe weather conditions, regional instabilities and hostilities (including the war in Israel), government trade or similar regulatory actions, \n30\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\npotential competitive pressures on selling prices for our products, energy costs, general economic and political conditions globally and in the markets in which we do business, as well as our ability to maintain key customer relationships, could affect the realization of these estimates.\nThe factors described under",
    "item1a": "Item 1A, \"Risk Factors,\" there can be no assurance we will be fully protected against substantial changes in the price or availability of energy sources. In addition, we are subject to price risk for utilities and manufacturing inputs, used in our manufacturing operations. Derivative instruments are used in accordance with our risk management policy to hedge a portion of the price risk.\n35\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n \nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nYear Ended December 31\n(In millions, except per share amounts)\n2024\n2023\n2022\nNet Sales\n$\n20,058\n \n$\n20,431\n \n$\n20,175\n \nCost of products sold\n12,878\n \n13,399\n \n13,956\n \nGross Profit\n7,180\n \n7,032\n \n6,219\n \nMarketing, research and general expenses\n4,311\n \n3,961\n \n3,581\n \nImpairment of intangible assets\n97\n \n658\n \n—\n \nOther (income) and expense, net\n(\n438\n)\n69\n \n(\n43\n)\nOperating Profit\n3,210\n \n2,344\n \n2,681\n \nNonoperating expense\n(\n61\n)\n(\n96\n)\n(\n73\n)\nInterest income\n48\n \n66\n \n14\n \nInterest expense\n(\n270\n)\n(\n293\n)\n(\n282\n)\nIncome Before Income Taxes and Equity Interests\n2,927\n \n2,021\n \n2,340\n \nProvision for income taxes\n(\n565\n)\n(\n453\n)\n(\n495\n)\nIncome Before Equity Interests\n2,362\n \n1,568\n \n1,845\n \nShare of net income of equity companies\n216\n \n196\n \n116\n \nNet Income\n2,578\n \n1,764\n \n1,961\n \nNet income attributable to noncontrolling interests\n(\n33\n)\n—\n \n(\n27\n)\nNet Income Attributable to Kimberly-Clark Corporation\n$\n2,545\n \n$\n1,764\n \n$\n1,934\n \nPer Share Basis\nNet Income Attributable to Kimberly-Clark Corporation\nBasic\n$\n7.58\n \n$\n5.22\n \n$\n5.73\n \nDiluted\n$\n7.55\n \n$\n5.21\n \n$\n5.72\n \nSee notes to the consolidated financial statements.\n36\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended December 31\n(In millions)\n2024\n2023\n2022\nNet Income\n$\n2,578\n \n$\n1,764\n \n$\n1,961\n \nOther Comprehensive Income (Loss), Net of Tax\n   Unrealized currency translation adjustments\n(\n408\n)\n89\n \n(\n355\n)\n   Employee postretirement benefits\n24\n \n(\n15\n)\n103\n \n   Cash flow hedges and other\n188\n \n12\n \n(\n185\n)\nTotal Other Comprehensive Income (Loss), Net of Tax\n(\n196\n)\n86\n \n(\n437\n)\nComprehensive Income\n2,382\n \n1,850\n \n1,524\n \n   Comprehensive income attributable to noncontrolling interests\n(\n21\n)\n1\n \n(\n19\n)\nComprehensive Income Attributable to Kimberly-Clark Corporation\n$\n2,361\n \n$\n1,851\n \n$\n1,505\n \nSee notes to the consolidated financial statements.\n37\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nDecember 31\n(In millions, except par value)\n2024\n2023\nASSETS\nCurrent Assets\nCash and cash equivalents\n$\n1,021\n \n$\n1,093\n \nAccounts receivable, net\n2,009\n \n2,135\n \nInventories\n1,822\n \n1,955\n \nOther current assets\n728\n \n520\n \nTotal Current Assets\n5,580\n \n5,703\n \nProperty, Plant and Equipment, Net\n7,513\n \n7,913\n \nInvestments in Equity Companies\n314\n \n306\n \nGoodwill\n1,964\n \n2,085\n \nOther Intangible Assets, Net\n87\n \n197\n \nOther Assets\n1,088\n \n1,140\n \nTOTAL ASSETS\n$\n16,546\n \n$\n17,344\n \nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities\nDebt payable within one year\n$\n568\n \n$\n567\n \nTrade accounts payable\n3,715\n \n3,653\n \nAccrued expenses and other current liabilities\n2,319\n \n2,316\n \nDividends payable\n402\n \n394\n \nTotal Current Liabilities\n7,004\n \n6,930\n \nLong-Term Debt\n6,875\n \n7,417\n \nNoncurrent Employee Benefits\n643\n \n669\n \nDeferred Income Taxes\n326\n \n374\n \nOther Liabilities\n686\n \n860\n \nRedeemable Preferred Securities of Subsidiaries\n37\n \n26\n \nStockholders' Equity\nKimberly-Clark Corporation\nPreferred stock - \nno\n par value - authorized\n \n20.0\n \nmillion shares, \nnone\n issued\n—\n \n—\n \nCommon stock - $\n1.25\n par value - authorized\n \n1,200.0\n million\n shares;\nissued \n378.6\n million shares as of December 31, 2024 and 2023\n473\n \n473\n \nAdditional paid-in capital\n862\n \n878\n \nCommon stock held in treasury, at cost - \n46.8\n and \n41.6\n million\nshares as of December 31, 2024 and 2023, respectively\n(\n5,986\n)\n(\n5,222\n)\nRetained earnings\n9,257\n \n8,368\n \nAccumulated other comprehensive income (loss)\n(\n3,766\n)\n(\n3,582\n)\nTotal Kimberly-Clark Corporation Stockholders' Equity\n840\n \n915\n \nNoncontrolling Interests\n135\n \n153\n \nTotal Stockholders' Equity\n975\n \n1,068\n \nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY \n$\n16,546\n \n$\n17,344\n \nSee notes to the consolidated financial statements.\n38\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\n(In millions, except per share amounts. Shares in thousands)\nCommon Stock\nIssued\nAdditional\nPaid-in\nCapital\nTreasury Stock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nNon-\ncontrolling\nInterests\nTotal Stockholders' \nEquity\nShares\nAmount\nShares\nAmount\nBalance at \n December 31, 2021\n378,597\n \n$\n473\n \n$\n605\n \n41,762\n \n$\n(\n5,183\n)\n$\n7,858\n \n$\n(\n3,239\n)\n$\n223\n \n$\n737\n \nNet income in stockholders' equity\n(a)\n \n— \n— \n— \n— \n— \n1,934\n \n— \n38\n \n1,972\n \nOther comprehensive income, net of tax\n(a)\n— \n— \n— \n— \n— \n— \n(\n429\n)\n(\n9\n)\n(\n438\n)\nStock-based awards exercised or vested\n— \n— \n(\n86\n)\n(\n1,406\n)\n145\n \n— \n— \n— \n59\n \nShares repurchased\n— \n— \n— \n779\n \n(\n100\n)\n— \n— \n— \n(\n100\n)\nRecognition of stock-based compensation\n— \n— \n147\n \n— \n— \n— \n— \n— \n147\n \nDividends declared ($\n4.64\n per share)\n— \n— \n— \n— \n— \n(\n1,566\n)\n— \n(\n98\n)\n(\n1,664\n)\nOther\n— \n— \n13\n \n— \n1\n \n(\n25\n)\n(\n1\n)\n(\n1\n)\n(\n13\n)\nBalance at\n December 31, 2022\n378,597\n \n473\n \n679\n \n41,135\n \n(\n5,137\n)\n8,201\n \n(\n3,669\n)\n153\n \n700\n \nNet income in stockholders' equity\n(a)\n— \n— \n— \n— \n— \n1,764\n \n— \n37\n \n1,801\n \nOther comprehensive income, net of tax\n(a)\n— \n— \n— \n— \n— \n— \n87\n \n(\n3\n)\n84\n \nStock-based awards exercised or vested\n— \n— \n(\n70\n)\n(\n1,327\n)\n140\n \n— \n— \n— \n70\n \nShares repurchased\n— \n— \n— \n1,791\n \n(\n225\n)\n— \n— \n— \n(\n225\n)\nRecognition of stock-based compensation\n— \n— \n165\n \n— \n— \n— \n— \n— \n165\n \nDividends declared ($\n4.72\n per share)\n— \n— \n— \n— \n— \n(\n1,594\n)\n— \n(\n35\n)\n(\n1,629\n)\nOther\n— \n— \n104\n \n— \n— \n(\n3\n)\n— \n1\n \n102\n \nBalance at\n December 31, 2023\n378,597\n \n473\n \n878\n \n41,599\n \n(\n5,222\n)\n8,368\n \n(\n3,582\n)\n153\n \n1,068\n \nNet income in stockholders' equity\n(a)\n—\n \n—\n \n—\n \n—\n \n—\n \n2,545\n \n—\n \n31\n \n2,576\n \nOther comprehensive income, net of tax\n(a)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n184\n)\n(\n12\n)\n(\n196\n)\nStock-based awards exercised or vested\n—\n \n—\n \n(\n155\n)\n(\n2,027\n)\n235\n \n—\n \n—\n \n—\n \n80\n \nShares repurchased\n—\n \n—\n \n—\n \n7,226\n \n(\n1,000\n)\n—\n \n—\n \n—\n \n(\n1,000\n)\nRecognition of stock-based compensation\n—\n \n—\n \n128\n \n—\n \n—\n \n—\n \n—\n \n—\n \n128\n \nDividends declared ($\n4.88\n per share)\n—\n \n—\n \n—\n \n—\n \n—\n \n(\n1,636\n)\n—\n \n(\n35\n)\n(\n1,671\n)\nOther\n—\n \n—\n \n11\n \n—\n \n1\n \n(\n20\n)\n—\n \n(\n2\n)\n(\n10\n)\nBalance at\n December 31, 2024\n378,597\n \n$\n473\n \n$\n862\n \n46,798\n \n$\n(\n5,986\n)\n$\n9,257\n \n$\n(\n3,766\n)\n$\n135\n \n$\n975\n \n(a)    Excludes redeemable interests' share.\nSee notes to the consolidated financial statements.\n39\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended December 31\n(In millions)\n2024\n2023\n2022\nOperating Activities\nNet income\n$\n2,578\n \n$\n1,764\n \n$\n1,961\n \nDepreciation and amortization\n781\n \n753\n \n754\n \nAsset impairments\n114\n \n676\n \n—\n \nGain on previously held equity investment in Thinx\n—\n \n—\n \n(\n85\n)\nStock-based compensation\n131\n \n169\n \n150\n \nDeferred income taxes\n(\n38\n)\n(\n322\n)\n(\n57\n)\nNet (gains) losses on asset and business dispositions\n(\n448\n)\n(\n75\n)\n15\n \nEquity companies' earnings (in excess of) less than dividends paid\n(\n62\n)\n(\n59\n)\n6\n \nOperating working capital\n178\n \n582\n \n(\n17\n)\nPostretirement benefits\n3\n \n24\n \n(\n4\n)\nOther\n(\n3\n)\n30\n \n10\n \nCash Provided by Operations\n3,234\n \n3,542\n \n2,733\n \nInvesting Activities\nCapital spending\n(\n721\n)\n(\n766\n)\n(\n876\n)\nAcquisition of business, net of cash acquired\n—\n \n—\n \n(\n46\n)\nProceeds from asset and business dispositions\n651\n \n245\n \n12\n \nInvestments in time deposits\n(\n605\n)\n(\n720\n)\n(\n658\n)\nMaturities of time deposits\n562\n \n815\n \n797\n \nOther\n13\n \n8\n \n(\n14\n)\nCash Used for Investing\n(\n100\n)\n(\n418\n)\n(\n785\n)\nFinancing Activities\nCash dividends paid\n(\n1,628\n)\n(\n1,588\n)\n(\n1,558\n)\nChange in short-term debt\n1\n \n(\n371\n)\n261\n \nDebt proceeds\n—\n \n363\n \n—\n \nDebt repayments\n(\n554\n)\n(\n475\n)\n(\n312\n)\nProceeds from exercise of stock options\n136\n \n97\n \n94\n \nAcquisitions of common stock for the treasury\n(\n1,000\n)\n(\n225\n)\n(\n100\n)\nCash paid for redemption of common securities of Thinx\n—\n \n(\n95\n)\n—\n \nCash dividends paid to noncontrolling interests\n(\n35\n)\n(\n35\n)\n(\n98\n)\nOther\n(\n86\n)\n(\n45\n)\n(\n47\n)\nCash Used for Financing\n(\n3,166\n)\n(\n2,374\n)\n(\n1,760\n)\nEffect of Exchange Rate Changes on Cash and Cash Equivalents\n(\n40\n)\n(\n84\n)\n(\n31\n)\nChange in Cash and Cash Equivalents\n(\n72\n)\n666\n \n157\n \nCash and Cash Equivalents - Beginning of Year\n1,093\n \n427\n \n270\n \nCash and Cash Equivalents - End of Year\n$\n1,021\n \n$\n1,093\n \n$\n427\n \nSee notes to the consolidated financial statements.\n40\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNote 1.    \nAccounting Policies\nBasis of Presentation\nThe consolidated financial statements present the accounts of Kimberly-Clark Corporation and all subsidiaries in which it has a controlling financial interest as if they were a single economic entity in conformity with accounting principles generally accepted in the United States of America (\"GAAP\"). All intercompany transactions and accounts are eliminated in consolidation. The terms \"Corporation,\" \"Kimberly-Clark,\" \"we,\" \"our,\" and \"us\" refer to Kimberly-Clark Corporation and all subsidiaries in which it has a controlling financial interest. Amounts are reported in millions of dollars, except per share amounts, unless otherwise noted.\nIn the fourth quarter of 2024, we realigned our internal operating and management structure to streamline our global supply chain and improve the efficiency of our corporate and regional overhead cost structures. As a result of this realignment, we manage and report our operations through three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). These changes reflect the manner in which our chief operating decision maker develops, executes and evaluates global strategies to drive growth and profitability. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. These segment changes had no impact on our previously reported consolidated net sales, operating profit, net income attributable to Kimberly-Clark or earnings per share. \nUse of Estimates\n \nThe preparation of financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of net sales and expenses during the reporting periods. Actual results could differ from these estimates, and changes in these estimates are recorded when known. Estimates are used in accounting for, among other things, sales incentives and trade promotion allowances, employee postretirement benefits, and deferred income taxes and potential assessments.\nCash Equivalents\nCash equivalents are short-term investments with an original maturity date of three months or less.\nInventories and Distribution Costs\nMost U.S. inventories are valued at the lower of cost, using the Last-In, First-Out (\"LIFO\") method, or market. The balance of the U.S. inventories and inventories of consolidated operations outside the U.S. are valued at the lower of cost or net realizable value using either the First-In, First-Out (\"FIFO\") or weighted-average cost methods. Net realizable value is the estimated selling prices in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation. Distribution costs are classified as cost of products sold.\nProperty and Depreciation\nProperty, plant and equipment are stated at cost and are depreciated on the straight-line method. Buildings are depreciated over their estimated useful lives, primarily \n40\n years. Machinery and equipment are depreciated over their estimated useful lives, primarily ranging from \n16\n to \n20\n years. Purchases of computer software, including external costs and certain internal costs (including payroll and payroll-related costs of employees) directly associated with developing significant computer software applications for internal use, are capitalized. Computer software costs are amortized on the straight-line method over the estimated useful life of the software, which generally does not exceed \n5\n years.\nEstimated useful lives are periodically reviewed and, when warranted, changes are made to them. Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that their carrying amount may not be recoverable. An impairment loss would be indicated when estimated undiscounted future cash flows from the use and eventual disposition of an asset group, which are identifiable and largely independent of the \n41\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\ncash flows of other asset groups, are less than the carrying amount of the asset group. Measurement of an impairment loss would be based on the excess of the carrying amount of the asset group over its fair value. Fair value is measured using discounted cash flows or independent appraisals, as appropriate. When property is sold or retired, the cost of the property and the related accumulated depreciation are removed from the consolidated balance sheets and any gain or loss on the transaction is included in income.\nGoodwill and Other Intangible Assets\nGoodwill represents costs in excess of fair values assigned to the underlying net assets of acquired businesses. Goodwill is not amortized, but rather is assessed for impairment annually on the first day of our third fiscal quarter and whenever events and circumstances indicate that impairment may have occurred. Impairment testing compares the reporting unit carrying amount, including goodwill, with its fair value. If the reporting unit carrying amount, including goodwill, exceeds its fair value, a goodwill impairment charge for the excess amount above fair value would be recorded. In our evaluation of goodwill impairment, we have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of each reporting unit is more than its carrying value. Qualitative factors include macroeconomic, industry and competitive conditions, legal and regulatory environments, historical and projected financial performance, significant changes in the reporting unit and the magnitude of excess fair value over carrying amount from the previous quantitative impairment testing. If the qualitative assessment determines that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, then a quantitative impairment test to estimate fair value must be performed. This quantitative estimate of fair value is based on a discounted cash flow model and a market-based approach. We use inputs from our long-range planning process to determine growth rates for sales and earnings. The other key estimates and factors used in the discounted cash flow model include, but are not limited to, discount rates, actual business trends experienced, commodity prices, foreign exchange rates, inflation and terminal growth rates. \nIndefinite-lived intangible assets, other than goodwill, consist of certain brand names related to our acquisition of Softex Indonesia and are tested for impairment annually at the same time as our goodwill impairment assessment and whenever events and circumstances indicate that impairment may have occurred. Our estimate of the fair value of our brand assets is\n based on a discounted cash flow model and a market-based approach using in\nputs which include projected revenues from our long-range plan, assumed royalty rates that could be payable if we did not own the brands, and a discount rate.\nIntangible assets with finite lives are amortized over their estimated useful lives, generally ranging from \n4\n to \n20\n years, and are reviewed for impairment whenever events or changes in circumstances indicate that their carrying amount may not be recoverable. An impairment loss would be indicated when estimated undiscounted future cash flows from the use of the asset are less than its carrying amount. An impairment loss would be measured as the difference between the fair value (based on discounted future cash flows) and the carrying amount of the asset.\n \nInvestments in Equity Companies\nInvestments in companies which we do not control but over which we have the ability to exercise significant influence and that, in general, are at least 20% owned by us, are stated at cost plus equity in undistributed net income. These investments are evaluated for impairment whenever events or changes in circumstances indicate that the carrying amount of the investments might not be recoverable. An impairment loss would be recorded whenever a decline in value of an equity investment below its carrying amount is determined to be other than temporary. In judging \"other than temporary,\" we would consider the length of time and extent to which the fair value of the equity company investment has been less than the carrying amount, the near-term and longer-term operating and financial prospects of the equity company, and our longer-term intent of retaining the investment in the equity company.\nRevenue Recognition\nSales revenue is recognized at the time of product shipment or delivery, depending on when control passes, to unaffiliated customers, and when all of the following have occurred: a firm sales agreement is in place, pricing is fixed or determinable, and collection is reasonably assured. Sales are reported net of returns, consumer and trade promotions, rebates and freight allowed. Taxes imposed by governmental authorities on our revenue-producing activities with customers, such as sales taxes and value-added taxes, are excluded from net sales.\n42\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nSales Incentives and Trade Promotion Allowances\nThe cost of promotion activities provided to customers is classified as a reduction in sales revenue. In addition, the estimated redemption value of consumer coupons and related expense are recorded when the related revenue from customers is realized. Rebate and promotion accruals are based on estimates of the quantity of customer sales. Promotion accruals also consider estimates of the number of consumer coupons that will be redeemed and timing and costs of activities within the promotional programs.\nAdvertising Expense\nAdvertising costs are expensed in the year the related advertisement or campaign is first presented through traditional or digital media. For interim reporting purposes, advertising expenses are charged to operations as a percentage of sales based on estimated sales and related advertising expense for the full year.\nResearch Expense\nResearch and development costs are charged to expense as incurred.\nOther Income and Expense, Net\nOther (income) and expense, net primarily includes gains and losses associated with business divestitures and acquisitions, re-measurement adjustments for financial statements in highly inflationary economies and other transactional exchange gains and losses. \nForeign Currency Translation\nThe income statements of foreign operations, other than those in highly inflationary economies, are translated into U.S. dollars at rates of exchange in effect each month. The balance sheets of these operations are translated at period-end exchange rates, and the differences from historical exchange rates are reflected in stockholders' equity as unrealized translation adjustments. Under highly inflationary accounting, the countries' functional currency becomes the U.S. dollar, and its income statement and balance sheet are measured in U.S. dollar using both current and historical rates of exchange.\nAs of July 1, 2018, we adopted highly inflationary accounting for our subsidiaries in Argentina (“K-C Argentina”). The effect of changes in exchange rates on peso-denominated monetary assets and liabilities has been reflected in earnings in Other (income) and expense, net. As of December 31, 2024, K-C Argentina had an immaterial net peso monetary position. Net sales of K-C Argentina were approximately \n1\n% of our consolidated net sales in 2024, 2023 and 2022\n.\nAs of April 1, 2022, we adopted highly inflationary accounting for our subsidiary in \nTürkiye\n (“K-C \nTürkiye\n”). The effect of changes in exchange rates on lira-denominated monetary assets and liabilities has been reflected in earnings in Other (income) and expense, net. As of December 31, 2024, K-C \nTürkiye\n had an immaterial net lira monetary position. Net sales of K-C \nTürkiye\n were less than \n1\n% of our consolidated net sales in 2024, 2023, and 2022.\nDerivative Instruments and Hedging\nOur policies allow the use of derivatives for risk management purposes and prohibit their use for speculation. Our policies also prohibit the use of any leveraged derivative instrument. Consistent with our policies, foreign currency derivative instruments, interest rate swaps and locks, and the majority of commodity hedging contracts are entered into with a diversified group of major financial institutions, which limits our credit exposure under these arrangements. At inception, we formally designate certain derivatives as cash flow, fair value or net investment hedges and establish how the effectiveness of these hedges will be assessed and measured. This process links the derivatives to the transactions or financial balances they are hedging. Changes in the fair value of derivatives not designated as hedging instruments are recorded in earnings as they occur. All derivative instruments are recorded as assets or liabilities on the balance sheet at fair value. Changes in the fair value of derivatives are either recorded in the income statement or other comprehensive income, as appropriate. The gain or loss on derivatives designated as fair value hedges and the offsetting loss or gain on the hedged item attributable to the hedged risk are included in income in the period that changes in fair value occur. The gain or loss on derivatives designated as cash flow hedges is included in other comprehensive income in the period that changes in fair value occur, and is reclassified \n43\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nto income in the same period that the hedged item affects income. The gain or loss on derivatives designated as hedges of investments in foreign subsidiaries is recognized in other comprehensive income to offset the change in value of the net investments being hedged. Certain foreign-currency derivative instruments not designated as hedging instruments have been entered into to manage certain non-functional currency denominated monetary assets and liabilities. The gain or loss on these derivatives is included in income in the period that changes in their fair values occur. Cash flows from derivatives are classified within the consolidated statements of cash flows in the same category as the items being hedged. Cash flows from derivatives are classified within Operating Activities, except for derivatives designated as net investment hedges which are classified in Investing Activities. See Note 12 for disclosures about derivative instruments and hedging activities.\nLeases\nLease assets and lease liabilities are recognized at the commencement of an arrangement where it is determined at inception that a lease exists. Lease assets represent the right to use an underlying asset for the lease term, and lease liabilities represent the obligation to make lease payments arising from the lease. These assets and liabilities are initially recognized based on the present value of lease payments over the lease term calculated using our incremental borrowing rate generally applicable to the location of the lease asset, unless the implicit rate is readily determinable. Lease assets also include any upfront lease payments made and exclude lease incentives. Lease terms include options to extend or terminate the lease when it is reasonably certain that those options will be exercised.\nVariable lease payments are generally expensed as incurred and include certain index-based changes in rent, certain nonlease components, such as maintenance and other services provided by the lessor, and other charges included in the lease. Leases with an initial term of 12 months or less are not recorded on the balance sheet, and the expense for these short-term leases and for operating leases is recognized on a straight-line basis over the lease term.\nCertain lease agreements with lease and nonlease components are combined as a single lease component. The depreciable life of lease assets and leasehold improvements is limited by the expected lease term, unless there is a transfer of title or purchase option reasonably certain of exercise.\nAccounting Standards - Adopted During 2024\nIn September 2022, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standard Update (“ASU”) No. 2022-04, \nLiabilities – Supplier Finance Programs (Subtopic 405-50)\n. The new guidance requires that a buyer in a supplier finance program disclose sufficient information about the program to allow a user of the financial statements to understand the program’s nature, activity during the period, changes from period to period, and potential magnitude. T\nhis ASU was effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the provision on roll forward information, which is effective for fiscal years beginning after December 15, 2023\n. We adopted this ASU as of January 1, 2023, except for the amendment on roll forward information which was adopted January 1, 2024, on a prospective basis. \nAs the guidance requires only additional disclosure, there were no effects of this standard on our financial position, results of operations or cash flow\ns.\nIn November 2023, the FASB issued ASU No. 2023-07, \nSegment Reporting (Topic 280)\n. The new guidance improves reportable segment disclosures primarily through enhanced disclosures about significant segment expenses and by requiring current annual disclosures to be provided in interim periods. The amendments in this ASU are effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted. The new guidance is to be applied retrospectively to all prior periods presented unless impracticable to do so. We adopted this ASU as of January 1, 2024 on a retrospective basis. As the guidance requires only additional disclosure, there were no effects of this standard on our financial position, results of operations or cash flows.\nAccounting Standards Issued - Not Adopted as of December 31, 2024\nIn December 2023, the FASB issued ASU No. 2023-09, \nIncome Taxes (Topic 740)\n. The new guidance is intended to enhance the transparency and decision usefulness of income tax disclosures. The amendments in this ASU are \n44\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\neffective for fiscal years beginning after December 15, 2024. Early adoption is permitted, and the amendments should be applied on a prospective basis with retrospective application permitted. As the guidance requires only additional disclosure, there will be no effects of this standard on our financial position, results of operations or cash flows.\nIn March 2024, the Securities and Exchange Commission (“SEC”) adopted final rules under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate-Related Disclosures for Investors\n. The rules require disclosure of, among other things: climate-related risks that are reasonably likely to have a material impact on its business, results of operations, or financial condition, and material direct greenhouse gas (\"GHG\") emissions from operations owned or controlled (Scope 1) and/or indirect GHG emissions from purchased energy consumed in operations (Scope 2). Additionally, the rules require disclosure of certain climate-related metrics subject to certain materiality thresholds, including the effects of severe weather events and other natural conditions. Disclosure requirements will begin phasing in prospectively for fiscal years beginning on or after January 1, 2025. Subsequent to issuance, the rules became the subject of litigation, and the SEC has issued a stay to allow the legal process to proceed. We are currently evaluating the impact of the rules on our disclosures and will monitor the litigation progress for possible impacts on the disclosure requirements under the rules.\nIn November 2024, the FASB issued ASU No. 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Topic 220)\n. The new guidance requires disclosure in the notes to the financial statements of disaggregated information about specific expense categories underlying certain income statement expense line items. The amendments in this ASU are effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted. The amendments should be applied on a prospective basis with retrospective application permitted. We are currently evaluating the impact of this update on our consolidated financial statements and related disclosures.\nNote 2.    \n2024 Transformation Initiative \nOn March 27, 2024, we announced the 2024 Transformation Initiative intended to improve our focus on growth and reduce our structural cost base by realigning our internal operating and management structure to streamline our global supply chain and improve the efficiency of our corporate and regional overhead cost structures.\n \nThe transformation is expected to impact our organization in all major geographies, and workforce reductions are expected to be in the range of \n4\n%\n \nto \n5\n%.\n \nCertain actions under the 2024 Transformation Initiative are being finalized for implementation, and accounting for such actions will commence when the actions are authorized for execution.\nThe transition to the new organizational structure was completed as of October 1, 2024, and the 2024 Transformation Initiative is expected to be completed by the end of 2026, with total costs anticipated to be approximately $\n1.5\n billion pre-tax. Cash costs are expected to be approximately half of that amount, primarily related to workforce reductions. Expected non-cash charges are primarily related to incremental depreciation and asset write-offs, including losses associated with the expected exit of certain markets. \n45\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe following charges were incurred in connection with the 2024 Transformation Initiative:\n  Year Ended December 31, 2024\nCost of products sold:\nCharges for workforce reductions\n$\n69\n \nAsset write-offs\n27\n \nIncremental depreciation\n38\n \nOther exit costs\n10\n \nTotal\n144\n \nMarketing, research and general expenses:\nCharges for workforce reductions\n116\n \nOther exit costs\n112\n \nTotal\n228\n \nOther (income) and expense, net\n(a)\n84\n \nNonoperating expense\n1\n \nTotal charges\n(b)\n457\n \nProvision for income taxes\n(\n118\n)\nNet charges\n$\n339\n \n(a)\nOther (income) and expense, net includes losses recognized for the exit of certain businesses and markets as part of the 2024 Transformation Initiative.\n(b)\nWe do not include 2024 Transformation Initiative charges within our segment operating results. Total impact of these charges to the NA, IPC and IFP segments would have been $\n147\n, $\n187\n and $\n82\n, respectively, with the residual relating to Corporate & Other. See further discussion around our segment operating results in Note 15.\nThe following summarizes the 2024 Transformation Initiative liabilities activity:\n2024\n2024 Transformation Initiative liabilities as of January 1\n$\n—\n \nCharges for workforce reductions and other cash exit costs\n291\n \nCash payments\n(\n156\n)\nCurrency and other\n(\n5\n)\n2024 Transformation Initiative liabilities as of December 31\n$\n130\n \n2024 Transformation Initiative liabilities of $\n130\n are recorded in Accrued expenses and other current liabilities as of December 31, 2024. The charges related to the 2024 Transformation Initiatives are reflected within Operating Activities of our consolidated statements of cash flows.\nNote 3\n.    \nA\ncquisitions and Divestitures\nOn February 24, 2022, we completed our acquisition of a majority and controlling share of Thinx Inc. (“Thinx”), an industry leader in the reusable period and incontinence underwear category, for total consideration of $\n181\n. We previously accounted for our ownership interest in Thinx as an equity method investment, but upon increasing our ownership to \n58\n%,we began consolidating the operations of Thinx into our consolidated financial statements at the end of the first quarter of 2022.\nIn the first quarter of 2023, we delivered a redemption notice to the third-party minority owner with respect to a portion of the remaining common securities of Thinx. The redemption closed in the second quarter of 2023, and we acquired additional ownership of Thinx for $\n48\n, increasing our controlling ownership to \n70\n%. As part of the completion of a negotiated final redemption, we acquired the remaining \n30\n% ownership of Thinx for $\n47\n in the fourth quarter of 2023. As the purchase of additional ownership in an already controlled subsidiary represents an equity transaction, no gain or loss was recognized in consolidated net income or comprehensive income. The following \n46\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\ntable discloses the effect of the change in the ownership interest between us and the previous noncontrolling interest:\nYear Ended December 31, 2023\nNet income attributable to Kimberly-Clark Corporation\n$\n1,764\n \nIncrease in Kimberly-Clark Corporation's additional paid-in capital for purchase of the remaining shares of Thinx\n(a)\n87\n \nChange in net income attributable to Kimberly-Clark Corporation and transfer to noncontrolling interests\n$\n1,851\n \n(a)    The acquisition of the remaining ownership of Thinx was recorded as a reduction in Redeemable Preferred Securities of Subsidiaries of $\n234\n, an increase to retained earnings of $\n52\n, an increase to additional paid-in capital of $\n87\n, and a reduction of cash of $\n95\n.\n \nDivestitures\nOn July 1, 2024, we completed the sale transaction that was announced on April 7, 2024, of the personal protective equipment (\"PPE\") business for total consideration of $\n635\n, including the initial purchase price of $\n640\n less working capital and other closing adjustments of $\n5\n. The transaction included Kimtech branded products, such as gloves, apparel and masks, and KleenGuard branded products, such as gloves, apparel, respirators and eyewear, which serve a variety of scientific and industrial industries globally. Upon closure of the transaction, a pre-tax gain of $\n566\n ($\n453\n after-tax) was recognized in Other (income) and expense, net. This gain is net of transaction costs of $\n14\n that were determined to be directly attributable to the sale transaction.\nOn June 1, 2023, we completed the sale of our Neve tissue brand and related consumer and professional tissue assets in Brazil for $\n212\n, including the base purchase price of $\n175\n and working capital and other closing adjustments of $\n37\n. This transaction also included a licensing agreement to allow the acquirer to manufacture and market in Brazil the Kleenex, Scott and Wypall brands to consumers and professional customers for a period of time. Upon closure of the transaction, a gain of $\n74\n pre-tax was recognized in Other (income) and expense, net. We incurred divestiture-related costs of $\n30\n pre-tax, which were recorded in Cost of products sold and Marketing, research and general expenses, resulting in a net benefit of $\n44\n pre-tax ($\n26\n after-tax).\nNote 4\n.    \nGoodwill and Other Intangible Assets\nDuring the fourth quarter of 2024, our internal reporting and management structure changed in connection with our 2024 Transformation Initiative, resulting in the identification of three new reportable segments defined by geographic regions and product groupings. Further, this reorganization resulted in changes to the composition of our reporting units. As a result, we have allocated goodwill to the new reporting units using the relative fair value approach, and have reflected the impact of these segment changes in all historical periods presented. Refer to Note 1 and 15 for further information on this reorganization and the impact to our segments. \nThe changes in the carrying amount of goodwill by reportable segment were as follows:\nNA\nIPC\nIFP\nTotal\nBalance as of December 31, 2022\n$\n1,128\n \n$\n752\n \n$\n194\n \n$\n2,074\n \nDivestiture\n—\n \n—\n \n(\n7\n)\n(\n7\n)\nEffect of foreign currency translation\n—\n \n14\n \n4\n \n18\n \nBalance as of December 31, 2023\n1,128\n \n766\n \n191\n \n2,085\n \nDivestiture\n(\n15\n)\n—\n \n(\n6\n)\n(\n21\n)\nEffect of foreign currency translation\n—\n \n(\n83\n)\n(\n17\n)\n(\n100\n)\nBalance as of December 31, 2024\n$\n1,113\n \n$\n683\n \n$\n168\n \n$\n1,964\n \nPrior to the reorganization discussed above, we completed our required annual assessment of goodwill for impairment for all our reporting units using a qualitative assessment as of the first day of the third quarter of the year ended \nDecember 31, 2024, concluding\n that it was more likely than not that the fair value of each reporting unit significantly exceeded the respective carrying amounts. \n47\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nAs a result of our segment reorganization, we reassigned assets and liabilities to the applicable reporting units and allocated goodwill using a relative fair value approach. As this change in the composition of our reporting units was considered a goodwill triggering event, we performed an impairment test on both a pre- and post- reorganization basis. In both cases, we concluded there was no goodwill impairment as the fair value of each reporting unit significantly exceeded the respective carrying amounts.\n \nThe carrying amounts of Other Intangible Assets, Net, were \nas follows:\nDecember 31\n2024\n2023\nGross Carrying Amount\n(b)\nAccumulated Amortization\n(b)\nNet\n Carrying\n Amount\nGross Carrying Amount\n(b)\nAccumulated Amortization\n(b)\nNet\nCarrying\nAmount\nIntangible assets with indefinite lives:\nBrand names\n$\n46\n \n$\n—\n \n$\n46\n \n$\n68\n \n$\n—\n \n$\n68\n \nIntangibles with finite lives:\nTrademarks and brand names\n101\n \n(\n81\n)\n20\n \n148\n \n(\n83\n)\n65\n \nOther intangible assets\n(a)\n33\n \n(\n12\n)\n21\n \n76\n \n(\n12\n)\n64\n \nTotal intangible assets with finite lives\n134\n \n(\n93\n)\n41\n \n224\n \n(\n95\n)\n129\n \nTotal\n$\n180\n \n$\n(\n93\n)\n$\n87\n \n$\n292\n \n$\n(\n95\n)\n$\n197\n \n(a)    \nOther intangible assets primarily include customer and distributor relationships.\n(b)    \nAmounts reflect impairments noted below and are subject to foreign currency adjustments\n.\nAmortization expense relating to the intangible assets with finite lives was $\n8\n, $\n13\n and $\n15\n for the years ended December 31, 2024, 2023 and 2022, respectively. Based on the carrying values of the intangible assets with finite lives as of December 31, 2024, amortization expense for each of the next five years is estimated to be approximately $\n2\n.\nFor 2024, we completed the required annual assessment of indefinite-lived intangible assets, other than goodwill, for impairment using a qualitative assessment as of the first day of the third quarter, and other than discussed below, we determined that it is more likely than not that the fair value is more than the carrying amount for each of these intangible assets.\n2024 Intangible Asset Impairment\nDuring the third quarter of 2024, we revised internal financial projections for our Softex and Thinx businesses to reflect updated expectations of future financial performance in light of current performance and as part of our re-organization efforts discussed in Note 2. As part of these revisions, we performed impairment assessments for our indefinite-lived brand names and finite-lived intangible assets, primarily brand names and distributor relationships. As a result of these assessments, we recognized impairment charges of $\n97\n pre-tax ($\n57\n after-tax) to write-down these intangible assets to their respective fair values. The valuation methods used in the assessments included the relief from royalty and distributor relationships methods. These impairment charges were primarily caused by increased attrition in our distributor relationships valuation model and the continued challenges arising from modified consumer shopping behavior in the post-COVID-19 period coupled with revisions to our long-term strategy and outlook. These noncash charges were included in Impairment of intangible assets in our consolidated statements of income and in Asset impairments within Operating Activities in our consolidated statements of cash flows. \n48\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n2023 Intangible Asset Impairment\nIn the second quarter of 2023, we conducted forecasting and strategic reviews and integration assessments of our Softex Indonesia business, acquired in the fourth quarter of 2020, and with performance below expectations since acquisition, we revised internal financial projections of the business to reflect updated expectations of future financial performance. These reviews and the subsequent revisions in the projections highlighted challenges for the Softex business arising from modified consumer shopping behavior in the post-COVID-19 period, inflationary pressures and other macroeconomic factors and increased competitive activity in the region. As a result of separate management reviews, we also have revised internal financial projections associated with our acquisition of a controlling interest in Thinx as a result of performance below expectations due to the impact of modified consumer shopping behavior in the post-COVID-19 period. \nThese revisions were considered triggering events requiring interim impairment assessments to be performed relative to the intangible assets that had been recorded as part of these acquisitions. These intangible assets included indefinite-lived and finite-lived brands and finite-lived distributor and customer relationships. As a result of the interim impairment assessments, we recognized impairment charges, principally arising from the impairment charge of $\n593\n related to the Softex business, totaling $\n658\n pre-tax ($\n483\n after-tax) to write-down these intangible assets to their respective fair values aggregating to $\n188\n as of June 30, 2023. The valuation methods used in the assessments included the relief from royalty and distributor and customer relationships methods. This noncash charge was included in Impairment of intangible assets in our consolidated statements of income and in Asset impairments within Operating Activities in our consolidated statements of cash flows.\nWe believe our estimates and assumptions used in the valuations are reasonable and comparable to those that would be used by other market participants; however, actual events and results could differ substantially from those used in the valuation, and to the extent such factors result in a failure to achieve the projected cash flows used to estimate fair value, additional noncash impairment charges could be required in the future.\nNote 5.    \nFair Value Information\nThe following fair value information is based on a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The three levels in the hierarchy used to measure fair value are:\nLevel 1—Unadjusted quoted prices in active markets accessible at the reporting date for identical assets and liabilities.\nLevel 2—Quoted prices for similar assets or liabilities in active markets. Quoted prices for identical or similar assets and liabilities in markets that are not considered active or financial instruments for which all significant inputs are observable, either directly or indirectly.\nLevel 3—Prices or valuations that require inputs that are significant to the valuation and are unobservable.\nA financial instrument's level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement.\nDuring 2024 and 2023, there were no significant transfers to or from level 3 fair value determinations.\nDerivative assets and liabilities are measured on a recurring basis at fair value. As of December 31, 2024 and 2023, derivative assets were $\n189\n and $\n70\n, respectively, and derivative liabilities were $\n137\n and $\n259\n, respectively. The fair values of derivatives used to manage interest rate risk and commodity price risk are based on the Secured Overnight Financing Rate (\"SOFR\") and interest rate swap curves and on commodity price quotations, respectively. The fair values of hedging instruments used to manage foreign currency risk are based on published quotations of spot currency rates and forward points, which are converted into implied forward currency rates. Measurement of our derivative assets and liabilities is considered a level 2 measurement. See Note 12 for additional information on our use of derivative instruments.\nRedeemable preferred securities of subsidiaries are measured on a recurring basis at their estimated redemption values, which approximate fair value. As of December 31, 2024 and 2023, the securities were valued at $\n37\n and \n49\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n$\n26\n, respectively. The securities are not traded in active markets, and their measurement is considered a level 3 measurement.\nCompany-owned life insurance (\"COLI\") assets are measured on a recurring basis at fair value. COLI assets were $\n71\n and $\n67\n as of December 31, 2024 and 2023, respectively. The COLI policies are a source of funding primarily for our nonqualified employee benefits and are included in Other Assets in the consolidated balance sheets. The COLI policies are measured at fair value using the net asset value per share practical expedient, and therefore, are not classified in the fair value hierarchy.\nThe following table includes the fair value of our financial instruments for which disclosure of fair value is required:\nFair Value Hierarchy Level\nCarrying Amount\nEstimated Fair Value\nCarrying Amount\nEstimated Fair Value\nDecember 31, 2024\nDecember 31, 2023\nAssets\nCash and cash equivalents\n(a)\n1\n$\n1,021\n \n$\n1,021\n \n$\n1,093\n \n$\n1,093\n \nTime deposits\n(b)\n1\n196\n \n196\n \n169\n \n169\n \nNon-US government bonds\n(c)\n2\n15\n \n15\n \n—\n \n—\n \nLiabilities\nShort-term debt\n(d)\n2\n3\n \n3\n \n2\n \n2\n \nLong-term debt\n(e)\n2\n7,440\n \n6,853\n \n7,982\n \n7,569\n \n(a)\nCash equivalents are composed of certificates of deposit, time deposits and other interest-bearing investments with original maturity dates of 90 days or less. Cash equivalents are recorded at cost, which approximates fair value.\n(b)\nTime deposits are composed of deposits with original maturities of more than 90 days but less than one year and instruments with original maturities of greater than one year, included in Other current assets or Other Assets in the consolidated balance sheets, as appropriate. Time deposits are recorded at cost, which approximates fair value.\n(c)\nNon-US government bonds are composed of foreign issued debt securities that are classified as held-to-maturity because we have the positive intent and ability to hold the securities to maturity. These securities are recorded at amortized cost and are included in Other current assets or Other Assets in the consolidated balance sheets, as appropriate.\n(d)\nShort-term debt is composed of U.S. commercial paper and/or other similar short-term debt issued by non-U.S. subsidiaries, all of which are recorded at cost, which approximates fair value.\n(e)\nLong-term debt includes the current portion of these debt instruments. Fair values were estimated based on quoted prices for financial instruments for which all significant inputs were observable, either directly or indirectly.\nNote 6.    \nDebt\nLong-term debt is composed of the following:\nWeighted-Average Interest Rate\nMaturities\nDecember 31\n2024\n2023\nNotes and debentures\n3.5\n%\n2025 - 2050\n$\n7,310\n \n$\n7,851\n \nIndustrial development revenue bonds\n4.1\n%\n2029 - 2045\n59\n \n59\n \nBank loans and other financings in various currencies\n4.2\n%\n2025 - 2039\n71\n \n72\n \nTotal long-term debt\n7,440\n \n7,982\n \nLess current portion\n565\n \n565\n \nLong-term portion\n$\n6,875\n \n$\n7,417\n \nScheduled maturities of long-term debt for the next five years are $\n566\n in 2025, $\n410\n in 2026, $\n606\n in 2027, $\n700\n in 2028 and $\n704\n in 2029.\nIn February 2023, we issued $\n350\n aggregate principal amount of \n4.50\n% notes due February 16, 2033. Proceeds from the offering were used for general corporate purposes including the repayment of a portion of our commercial paper indebtedness.\n50\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nWe maintain a $\n2.0\n billion revolving credit facility which expires in June 2028 and a $\n750\n revolving credit facility which expires in May 2025. These facilities, currently unused, support our commercial paper program, and would provide liquidity in the event our access to the commercial paper markets is unavailable for any reason.\nNote 7.    \nStock-Based Compensation\nWe have a stock-based Equity Participation Plan and an Outside Directors' Compensation Plan (the \"Plans\"), under which we can grant stock options, restricted shares and restricted share units to employees and outside directors. As of December 31, 2024, the number of shares of common stock available for grants under the Plans aggregated to \n7.5\n million shares.\nStock options are granted at an exercise price equal to the fair market value of our common stock on the date of grant, and they have a term of \n10\n years. Stock options are subject to graded vesting whereby options vest \n30\n% at the end of each of the first two 12-month periods following the grant and \n40\n% at the end of the third 12-month period.\nTime-vested restricted share unit grants starting in 2022 are valued at the closing market price of our common stock on the grant date and are generally subject to a graded vesting whereby shares vest \n30\n% at the end of each of the first two 12-month periods following the grant and \n40\n% at the end of the third 12-month period. Time-vested restricted share unit grants issued prior to 2022 or issued for special one-time awards, restricted shares units, and performance-based restricted share units granted to employees are valued at the closing market price of our common stock on the grant date and vest generally at the end of \nthree years\n. The number of performance-based share units that ultimately vest ranges from \nzero\n to \n200\n% of the number granted based on the attainment of performance metrics. Performance metrics are tied to modified free cash flow and organic sales growth during the three-year performance period. Modified free cash flow and organic sales growth are set at the beginning of the performance period. Restricted share units granted to outside directors are valued at the closing market price of our common stock on the grant date and vest when they are granted. The restricted period begins on the date of grant and expires on the date the outside director retires from or otherwise terminates service on our Board.\nAt the time stock options are exercised or restricted shares and restricted share units vest, common stock is issued from our accumulated treasury shares. Dividend equivalents are credited on restricted share units on the same date and at the same rate as dividends are paid on Kimberly-Clark's common stock. These dividend equivalents, net of estimated forfeitures, are charged to retained earnings.\nStock-based compensation expense is recognized on a straight-line basis over the requisite service period of the award, net of estimated forfeitures, based on the fair value of the award at the date of grant. Stock-based compensation costs of $\n131\n, $\n169\n and $\n150\n and related deferred income tax benefits of $\n29\n, $\n36\n and $\n33\n were recognized for 2024, 2023 and 2022, respectively.\nThe fair value of stock option awards is determined on the date of grant using a Black-Scholes-Merton option-pricing model utilizing a range of assumptions related to dividend yield, volatility, risk-free interest rate, and historical employee exercise behavior. Dividend yield is based on historical experience and expected future dividend actions. Expected volatility is based on a blend of historical volatility and implied volatility from traded options on Kimberly-Clark's common stock. The risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of grant. We estimate forfeitures based on historical data.\nDuring 2024 and 2023, no stock options were granted. In 2022, the weighted-average fair value of stock options granted was estimated at $\n21.28\n per option based on the following assumptions:\nYear Ended December 31, 2022\nDividend yield\n3.3\n \n%\nVolatility\n22.1\n \n%\nRisk-free interest rate\n2.8\n \n%\nExpected life - years\n4.6\n51\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nTotal remaining unrecognized compensation costs and amortization period are as follows:\nDecember 31, 2024\nWeighted-Average Service Years\nStock options\n$\n1\n \n0.3\nRestricted shares and time-vested restricted share units\n68\n \n1.3\nNonvested performance-based restricted share units\n23\n \n1.6\nA summary of stock-based compensation is presented below:\nStock Options\nShares\n(in thousands)\nWeighted-Average Exercise Price\nWeighted-Average Remaining Contractual Term\nAggregate Intrinsic Value\nOutstanding as of January 1, 2024\n4,197\n \n$\n128.80\n \nGranted\n—\n \n—\n \nExercised\n(\n1,107\n)\n140.66\n \nForfeited or expired\n(\n114\n)\n120.46\n \nOutstanding as of December 31, 2024\n2,976\n \n131.05\n \n4.7\n$\n12\n \nExercisable as of December 31, 2024\n2,791\n \n130.73\n \n4.2\n$\n11\n \nThe total intrinsic value of options exercised during 2024, 2023 and 2022 was $\n19\n, $\n23\n and \n$\n21\n, respectively. \nTime-Vested\nRestricted Share Units\nPerformance-Based\nRestricted Share Units\nOther Stock-Based Awards\nShares\n(in thousands)\nWeighted-Average Grant-Date Fair Value\nShares\n(in thousands)\nWeighted-Average Grant-Date Fair Value\nNonvested as of January 1, 2024\n1,205\n \n$\n133.14\n \n903\n \n$\n130.36\n \nGranted\n925\n \n135.31\n \n655\n \n136.41\n \nVested\n(\n580\n)\n137.70\n \n(\n820\n)\n131.82\n \nForfeited\n(\n158\n)\n138.40\n \n(\n52\n)\n137.97\n \nNonvested as of December 31, 2024\n1,392\n \n137.79\n \n686\n \n134.87\n \nThe total fair value of restricted share units that vested during 2024, 2023 and 2022 was $\n185\n, $\n99\n and \n$\n118\n, respectively.\nNote 8.    \nEmployee Postretirement Benefits \nSubstantially all regular employees in the U.S. and the United Kingdom are covered by defined contribution retirement plans and certain U.S. and United Kingdom employees previously earned benefits covered by defined benefit pension plans that currently provide no future service benefit (the \"Principal Plans\"). Certain other subsidiaries have defined benefit pension plans or, in certain countries, termination pay plans covering substantially all regular employees. The funding policy for our qualified defined benefit pension plans is to contribute assets at least equal in amount to regulatory minimum requirements. Nonqualified U.S. plans providing pension benefits in excess of limitations imposed by the U.S. income tax code are not funded.\nSubstantially all U.S. retirees and employees have access to our unfunded health care and life insurance benefit plans. The annual increase in the consolidated weighted-average health care cost trend rate is expected to be \n5.9\n% in 2025 and to decline to \n4.5\n% in \n2034\n and thereafter. Assumed health care cost trend rates affect the amounts reported for postretirement health care benefit plans. \n52\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nSummarized financial information about postretirement plans, excluding defined contribution retirement plans, is presented below:\nPension Benefits\nOther Benefits\nYear Ended December 31\n2024\n2023\n2024\n2023\nChange in Benefit Obligation\nBenefit obligation at beginning of year\n$\n2,469\n \n$\n2,441\n \n$\n531\n \n$\n533\n \nService cost\n12\n \n13\n \n4\n \n4\n \nInterest cost\n115\n \n121\n \n28\n \n30\n \nActuarial (gain) loss\n(a)\n(\n129\n)\n59\n \n(\n3\n)\n13\n \nCurrency and other\n(\n42\n)\n51\n \n(\n12\n)\n5\n \nBenefit payments from plans\n(\n175\n)\n(\n141\n)\n—\n \n—\n \nDirect benefit payments\n(\n9\n)\n(\n9\n)\n(\n51\n)\n(\n54\n)\nSettlements and curtailments\n(\n5\n)\n(\n66\n)\n—\n \n—\n \nBenefit obligation at end of year\n2,236\n \n2,469\n \n497\n \n531\n \nChange in Plan Assets\nFair value of plan assets at beginning of year\n2,329\n \n2,321\n \n—\n \n—\n \nActual return on plan assets\n(\n29\n)\n137\n \n—\n \n—\n \nEmployer contributions\n15\n \n26\n \n—\n \n—\n \nCurrency and other\n(\n43\n)\n52\n \n—\n \n—\n \nBenefit payments\n(\n175\n)\n(\n141\n)\n—\n \n—\n \nSettlements\n(\n4\n)\n(\n66\n)\n—\n \n—\n \nFair value of plan assets at end of year\n2,093\n \n2,329\n \n—\n \n—\n \nFunded Status\n$\n(\n143\n)\n$\n(\n140\n)\n$\n(\n497\n)\n$\n(\n531\n)\n(a)    \nThe actuarial net gains in 2024 and actuarial net losses in 2023 were primarily due to discount rate increases and decreases, respectively.\nSubstantially all of the funded status of pension and other benefits is recognized in the consolidated balance sheets in Noncurrent Employee Benefits, with the remainder recognized in Accrued expenses and other current liabilities and Other Assets. \nInformation for the Principal Plans and All Other Pension Plans\n \nPrincipal Plans\nAll Other Pension Plans\nTotal\nYear Ended December 31\n2024\n2023\n2024\n2023\n2024\n2023\nProjected benefit obligation (“PBO”)\n$\n1,900\n \n$\n2,123\n \n$\n336\n \n$\n346\n \n$\n2,236\n \n$\n2,469\n \nAccumulated benefit obligation (“ABO”)\n1,900\n \n2,123\n \n289\n \n298\n \n2,189\n \n2,421\n \nFair value of plan assets\n1,795\n \n2,019\n \n298\n \n310\n \n2,093\n \n2,329\n \nApproximately one-half of the PBO and fair value of plan assets for the Principal Plans relate to the U.S. qualified and nonqualified pension plans.\nInformation for Pension Plans with an ABO in Excess of Plan Assets\nDecember 31\n2024\n2023\nABO\n$\n2,056\n \n$\n2,273\n \nFair value of plan assets\n1,877\n \n2,095\n \n53\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nInformation for Pension Plans with a PBO in Excess of Plan Assets\nDecember 31\n2024\n2023\nPBO\n$\n2,067\n \n$\n2,288\n \nFair value of plan assets\n1,878\n \n2,102\n \nComponents of Net Periodic Benefit Cost\nPension Benefits\nOther Benefits\nYear Ended December 31\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n12\n \n$\n13\n \n$\n16\n \n$\n4\n \n$\n4\n \n$\n7\n \nInterest cost\n115\n \n121\n \n89\n \n28\n \n30\n \n21\n \nExpected return on plan assets\n(a)\n(\n124\n)\n(\n128\n)\n(\n123\n)\n—\n \n—\n \n—\n \nRecognized net actuarial (gain) loss\n40\n \n39\n \n34\n \n—\n \n(\n3\n)\n1\n \nSettlements and curtailments\n2\n \n35\n \n52\n \n—\n \n—\n \n—\n \nOther\n—\n \n—\n \n1\n \n—\n \n1\n \n(\n1\n)\nNet periodic benefit cost\n$\n45\n \n$\n80\n \n$\n69\n \n$\n32\n \n$\n32\n \n$\n28\n \n(a)\nThe expected return on plan assets is determined by multiplying the fair value of plan assets at the remeasurement date, typically the prior year-end adjusted for estimated current year cash benefit payments and contributions, by the expected long-term rate of return.\nThe components of net periodic benefit cost other than the service cost component are included in the line item Nonoperating expense in our consolidated statements of income.\nWeighted-Average Assumptions Used to Determine Net Periodic Benefit Cost for Years Ended December 31\nPension Benefits\nOther Benefits\nProjected 2025\n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n5.33\n \n%\n4.89\n \n%\n5.19\n \n%\n2.71\n \n%\n5.66\n \n%\n5.92\n \n%\n3.15\n \n%\nExpected long-term return on plan assets\n6.09\n \n%\n5.57\n \n%\n5.75\n \n%\n3.80\n \n%\n—\n \n—\n \n—\n \nRate of compensation increase\n3.47\n \n%\n3.53\n \n%\n3.49\n \n%\n3.23\n \n%\n—\n \n—\n \n—\n \nWeighted-Average Assumptions Used to Determine Benefit Obligations as of December 31\nPension Benefits\nOther Benefits\n2024\n2023\n2024\n2023\nDiscount rate\n5.33\n \n%\n4.89\n \n%\n6.04\n \n%\n5.66\n \n%\nRate of compensation increase\n3.47\n \n%\n3.53\n \n%\n—\n \n—\n \nInvestment Strategies for the Principal Plans\nStrategic asset allocation decisions are made considering several risk factors, including plan participants' retirement benefit security, the estimated payments of the associated liabilities, the plan funded status, and Kimberly-Clark's financial condition. The resulting strategic asset allocation is a diversified blend of equity and fixed income investments. Equity investments are typically diversified across geographies and market capitalization. Fixed income investments are diversified across multiple sectors including government issues and corporate debt instruments with a portfolio duration that is consistent with the estimated payment of the associated liability. Actual asset allocation is regularly reviewed and periodically rebalanced to the strategic allocation when considered appropriate. Our 2025 target plan asset allocation for the Principal Plans is approximately \n85\n% fixed income securities and \n15\n% equity securities.\n54\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe expected long-term rate of return is generally evaluated on an annual basis. In setting this assumption, we consider a number of factors including projected future returns by asset class relative to the current asset allocation. The weighted-average expected long-term rate of return on pension fund assets used to calculate pension expense for the Principal Plans was \n5.73\n% in 2024, \n6.05\n% in 2023 and \n3.55\n% in 2022, and will be \n6.34\n% in 2025.\nSet forth below are the pension plan assets of the Principal Plans measured at fair value, by level in the fair-value hierarchy. More than 60% of the assets are held in pooled funds and are measured using a net asset value (or its equivalent). Accordingly, such assets do not meet the Level 1, Level 2, or Level 3 criteria of the fair value hierarchy. \nFair Value Measurements as of December 31, 2024\nTotal Plan Assets\nAssets at Quoted Prices in Active Markets for Identical Assets\n(Level 1)\nAssets at Significant Observable Inputs\n(Level 2)\nAssets at Significant Unobservable Inputs\n(Level 3)\nCash and Cash Equivalents\nHeld directly\n$\n25\n \n$\n16\n \n$\n9\n \n$\n—\n \nFixed Income\nHeld directly\nU.S. government and municipals\n112\n \n94\n \n18\n \n—\n \nU.S. corporate debt\n304\n \n—\n \n304\n \n—\n \nU.S. securitized\n1\n \n—\n \n1\n \n—\n \nInternational bonds\n50\n \n—\n \n50\n \n—\n \nHeld through mutual and pooled funds measured at net asset value\nU.S. government and municipals\n289\n \n—\n \n—\n \n—\n \nNon-U.S. securitized\n69\n \n—\n \n—\n \n—\n \nInternational bonds\n509\n \n—\n \n—\n \n—\n \nEquity\nHeld directly\nU.S. equity\n14\n \n14\n \n—\n \n—\n \nInternational equity\n11\n \n11\n \n—\n \n—\n \nHeld through mutual and pooled funds measured at net asset value\nNon-U.S. equity\n2\n \n—\n \n—\n \n—\n \nGlobal equity\n218\n \n—\n \n—\n \n—\n \nInsurance Contracts\n194\n \n—\n \n—\n \n194\n \nOther\n(\n3\n)\n(\n3\n)\n—\n \n—\n \nTotal Plan Assets\n$\n1,795\n \n$\n132\n \n$\n382\n \n$\n194\n \n55\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nFair Value Measurements as of December 31, 2023\nTotal Plan Assets\nAssets at Quoted Prices in Active Markets for Identical Assets\n(Level 1)\nAssets at Significant Observable Inputs\n(Level 2)\nAssets at Significant Unobservable Inputs \n(Level 3)\nCash and Cash Equivalents\nHeld directly\n$\n34\n \n$\n23\n \n$\n11\n \n$\n— \nFixed Income\nHeld directly\nU.S. government and municipals\n98\n \n97\n \n1\n \n— \nU.S. corporate debt\n203\n \n— \n203\n \n— \nInternational bonds\n38\n \n— \n38\n \n— \nHeld through mutual and pooled funds measured at net asset value\nU.S. government and municipals\n85\n \n— \n— \n— \nU.S. corporate debt\n408\n \n— \n— \n— \nNon-U.S. securitized\n67\n \n— \n— \n— \nInternational bonds\n591\n \n— \n— \n— \nEquity\nHeld directly\nU.S. equity\n21\n \n21\n \n— \n— \nInternational equity\n15\n \n15\n \n— \n— \nHeld through mutual and pooled funds measured at net asset value\nNon-U.S. equity\n3\n \n— \n— \n— \nGlobal equity\n224\n \n— \n— \n— \nInsurance Contracts\n230\n \n— \n— \n230\n \nOther\n2\n \n2\n \n— \n— \nTotal Plan Assets\n$\n2,019\n \n$\n158\n \n$\n253\n \n$\n230\n \nFutures contracts are used when appropriate to manage duration targets. As of December 31, 2024 and 2023, the U.S. plan held directly Treasury futures contracts with a total notional value of approximately $\n278\n and $\n288\n, respectively, and an insignificant fair value. As of December 31, 2024 and 2023, the United Kingdom plan held through a pooled fund future contracts with a total notional value of approximately $\n418\n and $\n417\n, and an insignificant fair value.\nDuring 2024 and 2023, the plan assets did not include a significant amount of Kimberly-Clark common stock.\nInputs and valuation techniques used to measure the fair value of plan assets vary according to the type of security being valued. Substantially all of the equity securities held directly by the plans are actively traded and fair values are determined based on quoted market prices. Fair values of U.S. government securities are determined based on trading activity in the marketplace.\nFair values of U.S. corporate debt, U.S. municipals and international bonds are typically determined by reference to the values of similar securities traded in the marketplace and current interest rate levels. Multiple pricing services are typically employed to assist in determining these valuations.\nFair values of equity securities and fixed income securities held through units of pooled funds are based on net asset value of the units of the pooled fund determined by the fund manager. Pooled funds are similar in nature to \n56\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nretail mutual funds, but are typically more efficient for institutional investors. The fair value of pooled funds is determined by the value of the underlying assets held by the fund and the units outstanding. \nEquity securities held directly by the pension trusts and those held through units in pooled funds are monitored as to issuer and industry. Except for U.S. Treasuries, concentrations of fixed income securities are similarly monitored for concentrations by issuer and industry. As of December 31, 2024, \nthere were no significant concentrations of equity or debt securities in any single issuer or industry.\n \nNo level 3 transfers (in or out) were made in 2024 or 2023. Fair values of insurance contracts are based on an evaluation of various factors, including purchase price. \nWe expect to contribute approximately $\n15\n to our defined benefit pension plans in 2025. \nOver the next ten years, we expect that the following gross benefit payments will occur:\nPension Benefits\nOther Benefits\n2025\n$\n179\n \n$\n53\n \n2026\n182\n \n55\n \n2027\n182\n \n54\n \n2028\n181\n \n52\n \n2029\n178\n \n50\n \n2030-2034\n866\n \n218\n \nDefined Contribution Pension Plans\nOur 401(k) profit sharing plan and supplemental plan provide for a matching contribution of a U.S. employee's contributions and accruals, subject to predetermined limits, as well as a discretionary profit sharing contribution, in which contributions will be based on our profit performance. We also have defined contribution pension plans for certain employees outside the U.S. Costs charged to expense for our defined contribution pension plans were $\n178\n in 2024, $\n185\n in 2023, and $\n132\n in 2022. Approximately 25% of these costs were for plans outside the U.S.\n57\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nNote 9.    \nStockholders' Equity\nThe changes in the components of Accumulated Other Comprehensive Income (\"AOCI\") attributable to Kimberly-Clark, net of tax, are as follows:\nUnrealized Translation\nDefined Benefit Pension Plans\nOther Postretirement Benefit Plans\nCash Flow Hedges and Other\nBalance as of December 31, 2021\n$\n(\n2,422\n)\n$\n(\n803\n)\n$\n(\n34\n)\n$\n20\n \nOther comprehensive income (loss) before reclassifications\n(\n347\n)\n(\n51\n)\n86\n \n(\n139\n)\n(Income) loss reclassified from AOCI\n—\n \n65\n \n(a)\n—\n \n(a)\n(\n44\n)\nNet current period other comprehensive income (loss)\n(\n347\n)\n14\n \n86\n \n(\n183\n)\nBalance as of December 31, 2022\n(\n2,769\n)\n(\n789\n)\n52\n \n(\n163\n)\nOther comprehensive income (loss) before reclassifications\n84\n \n(\n57\n)\n(\n9\n)\n(\n153\n)\n(Income) loss reclassified from AOCI\n7\n \n55\n \n(a)\n(\n4\n)\n(a)\n164\n \nNet current period other comprehensive income (loss)\n91\n \n(\n2\n)\n(\n13\n)\n11\n \nBalance as of December 31, 2023\n(\n2,678\n)\n(\n791\n)\n39\n \n(\n152\n)\nOther comprehensive income (loss) before reclassifications\n(\n434\n)\n(\n15\n)\n10\n \n131\n \n(Income) loss reclassified from AOCI\n44\n \n(b)\n31\n \n(a)\n(\n2\n)\n(a)\n51\n \nNet current period other comprehensive income (loss)\n(\n390\n)\n16\n \n8\n \n182\n \nBalance as of December 31, 2024\n$\n(\n3,068\n)\n$\n(\n775\n)\n$\n47\n \n$\n30\n \n(a)    \nIncluded in computation of net periodic pension and other postretirement benefits costs (see Note 8).\n(b)    Included in Other (income) and expense, net as part of the charges related to the 2024 Transformation Initiative (see\n \nNote 2)\n.\nIncluded in the above defined benefit pension plans and other postretirement benefit plans balances as of December 31, 2024 is $\n727\n and $\n1\n of unrecognized net actuarial loss and unrecognized net prior service cost, respectively. \n58\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe changes in the components of AOCI attributable to Kimberly-Clark, including the tax effect, are as follows:\nYear Ended December 31\n2024\n2023\n2022\nUnrealized translation\n$\n(\n373\n)\n$\n84\n \n$\n(\n324\n)\nTax effect\n(\n17\n)\n7\n \n(\n23\n)\n$\n(\n390\n)\n$\n91\n \n$\n(\n347\n)\nDefined benefit pension plans\nUnrecognized net actuarial loss and transition amount\nFunded status recognition\n$\n(\n26\n)\n$\n(\n49\n)\n$\n(\n109\n)\nAmortization\n40\n \n39\n \n34\n \nSettlements and curtailments\n2\n \n35\n \n52\n \nCurrency and other\n6\n \n(\n23\n)\n36\n \n22\n \n2\n \n13\n \nUnrecognized prior service cost/credit\nFunded status recognition\n—\n \n3\n \n2\n \n—\n \n3\n \n2\n \nTax effect\n(\n6\n)\n(\n7\n)\n(\n1\n)\n$\n16\n \n$\n(\n2\n)\n$\n14\n \nOther postretirement benefit plans\nUnrecognized net actuarial loss and transition amount\n$\n10\n \n$\n(\n18\n)\n$\n113\n \nTax effect\n(\n2\n)\n5\n \n(\n27\n)\n$\n8\n \n$\n(\n13\n)\n$\n86\n \nCash flow hedges and other\nRecognition of effective portion of hedges\n$\n198\n \n$\n(\n178\n)\n$\n(\n165\n)\nAmortization\n69\n \n208\n \n(\n58\n)\nCurrency and other\n(\n15\n)\n(\n14\n)\n(\n22\n)\nTax effect\n(\n70\n)\n(\n5\n)\n62\n \n$\n182\n \n$\n11\n \n$\n(\n183\n)\nChange in AOCI\n$\n(\n184\n)\n$\n87\n \n$\n(\n430\n)\nAmounts are reclassified from AOCI into Cost of products sold, Nonoperating expense, Interest expense, or Other (income) and expense, net, as applicable, in the consolidated statements of income.\nNet unrealized currency gains or losses resulting from the translation of assets and liabilities of foreign subsidiaries, except those in highly inflationary economies, are recorded in AOCI. For these operations, changes in exchange rates generally do not affect cash flows; therefore, unrealized translation adjustments are recorded in AOCI rather than net income. Upon sale or substantially complete liquidation of any of these subsidiaries, the applicable unrealized translation adjustment would be removed from AOCI and reported as part of the gain or loss on the sale or liquidation. The change in unrealized translation in 2024 is primarily due to the weakening of various foreign currencies versus the U.S. dollar. Also included in unrealized translation amounts are the effects of foreign exchange rate changes on intercompany balances of a long-term investment nature and transactions designated as hedges of net foreign investments.\nNote 10.    \nLeases and Commitments\nWe have entered into leases for certain facilities, vehicles, material handling and other equipment. Our leases have remaining contractual terms up to \n94\n years, some of which include options to extend the leases for up to \n99\n years, \n59\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nand some of which include options to terminate the leases within \n1\n year. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants. Our lease costs are primarily related to facility leases for inventory warehousing and administration offices.\nLease Expense\n \nYear Ended December 31\n2024\n2023\n2022\nIncome Statement Classification\nOperating lease expense\n$\n153\n \n$\n147\n \n$\n145\n \nCost of products sold, Marketing, research and general expenses\nFinance lease expense:\nAmortization of lease assets\n18\n \n16\n \n15\n \nCost of products sold\nInterest on lease liabilities\n3\n \n2\n \n1\n \nInterest expense\nTotal finance lease expense\n21\n \n18\n \n16\n \nVariable lease expense\n(a)\n162\n \n253\n \n242\n \nCost of products sold, Marketing, research and general expenses\nTotal lease expense\n$\n336\n \n$\n418\n \n$\n403\n \n(a)    \nIncludes short-term leases, which are immaterial.\nLease Assets and Liabilities\nDecember 31\n2024\n2023\nBalance Sheet Classification\nAssets\nOperating lease\n$\n413\n \n$\n450\n \nOther Assets\nFinance lease\n72\n \n79\n \nProperty, Plant and Equipment, Net\nTotal lease assets\n$\n485\n \n$\n529\n \nLiabilities\nCurrent:\nOperating lease\n$\n131\n \n$\n130\n \nAccrued expenses and other current liabilities\nFinance lease\n16\n \n14\n \nDebt payable within one year\nNoncurrent:\nOperating lease\n305\n \n346\n \nOther Liabilities\nFinance lease\n53\n \n57\n \nLong-Term Debt\nTotal lease liabilities\n$\n505\n \n$\n547\n \nAs of December 31, 2024 and 2023, accumulated amortization of finance lease \nassets was $\n40\n and\n $\n37\n, respectively.\n60\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nMaturity of Lease Liabilities\nDecember 31, 2024\nOperating Leases\nFinance Leases\nTotal\n2025\n$\n146\n \n$\n18\n \n$\n164\n \n2026\n130\n \n15\n \n145\n \n2027\n82\n \n13\n \n95\n \n2028\n43\n \n9\n \n52\n \n2029\n28\n \n6\n \n34\n \nThereafter\n51\n \n17\n \n68\n \nTotal lease payments\n480\n \n78\n \n558\n \nLess imputed interest\n44\n \n9\n \n53\n \nPresent value of lease liabilities\n$\n436\n \n$\n69\n \n$\n505\n \nSupplemental Information Related to Leases\nYear Ended December 31\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating leases\n$\n156\n \n$\n147\n \n$\n148\n \nFinance leases\n19\n \n17\n \n11\n \nLease assets obtained in exchange for new lease obligations:\nOperating leases\n74\n \n66\n \n57\n \nFinance leases\n23\n \n24\n \n6\n \nOther non-cash modifications to lease assets:\nOperating leases\n39\n \n39\n \n72\n \nDecember 31, 2024\nDecember 31, 2023\nOperating Leases\nFinance Leases\nOperating Leases\nFinance Leases\nWeighted-average remaining lease term (years)\n4.3\n6.0\n4.4\n7.1\nWeighted-average discount rate\n4.1\n \n%\n4.8\n \n%\n3.8\n \n%\n3.9\n \n%\nWe have entered into long-term contracts for the purchase of raw materials, primarily superabsorbent materials, pulp and certain utilities. Commitments under these contracts based on current prices are $\n1,507\n in 2025, $\n427\n in 2026, $\n226\n in 2027, $\n10\n in 2028, $\n3\n in 2029, and $\n15\n beyond the year 2029. \nAlthough we are primarily liable for payments on the above-mentioned leases and purchase commitments, our exposure to losses, if any, under these arrangements is not material.\nNote 11.    \nLegal Matters\nWe routinely are involved in legal proceedings, claims, disputes, tax matters, regulatory matters and governmental inspections or investigations arising in the ordinary course of or incidental to our business, including those noted below in this section. We record accruals in the consolidated financial statements for pending litigation when we determine that an unfavorable outcome is probable and the amount of the loss can be reasonably estimated. For the matters we disclose that do not include an estimate of the amount of loss or range of losses, such an estimate is not possible or is immaterial, and we may be unable to estimate the possible loss or range of losses that could potentially result from the application of non-monetary remedies, unless disclosed below. At present we believe that the ultimate outcome of these proceedings, individually and in the aggregate, will not materially harm our financial position, results of operations or cash flows. However, legal proceedings and government investigations are subject \n61\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nto inherent uncertainties, and unfavorable rulings or other events could occur. Unfavorable resolutions could involve substantial monetary damages. In addition, in matters for which conduct remedies are sought, unfavorable resolutions could include an injunction or other order prohibiting us from selling one or more products at all or in particular ways, precluding particular business practices or requiring other remedies. An unfavorable outcome might result in a material adverse impact on our business, results of operations or financial position.\nWe are party to certain legal proceedings relating to our former health care business, Avanos Medical, Inc. (\"Avanos\", previously Halyard Health, Inc.), which we spun-off on October 31, 2014, including a qui tam matter and certain subpoena and document requests from the federal government. The subpoena and document requests include subpoenas from the United States Department of Justice (\"DOJ\") concerning allegations of potential criminal and civil violations of federal laws, including the Food, Drug, and Cosmetic Act, in connection with the manufacturing, marketing and sale of surgical gowns by our former health care business. We continue to cooperate in this investigation and have progressed our efforts to reach a resolution of all related matters.\nWe are subject to federal, state and local environmental protection laws and regulations with respect to our business operations and are operating in compliance with, or taking action aimed at ensuring compliance with, these laws and regulations. We have been named a potentially responsible party under the provisions of the U.S. federal Comprehensive Environmental Response, Compensation and Liability Act, or analogous state statutes, at a number of sites where hazardous substances are present. None of our compliance obligations with environmental protection laws and regulations, individually or in the aggregate, is expected to have a material adverse effect on our business, liquidity, financial condition or results of operations.\nNote 12.    \nObjectives and Strategies for Using Derivatives\nAs a multinational enterprise, we are exposed to financial risks, such as changes in foreign currency exchange rates, interest rates, and commodity prices. We employ a number of practices to manage these risks, including operating and financing activities and, where appropriate, the use of derivative instruments. \nAs of December 31, 2024 and 2023, derivative as\nsets \nwere $\n189\n and $\n70\n, respectively, and derivative liabilities were $\n137\n a\nnd $\n259\n, respectively, primarily comprised of foreign currency exchange, interest rate and commodity price contracts. Derivative assets are recorded in Other current assets or Other Assets, as appropriate, and derivative liabilities are recorded in Accrued expenses and other current liabilities or Other Liabilities, as appropriate.\nForeign Currency Exchange Rate Risk\nTranslation adjustments result from translating foreign entities' financial statements into U.S. dollars from their functional currencies. The risk to any particular entity's net assets is reduced to the extent that the entity is financed with local currency borrowings. A portion of our balance sheet translation exposure for certain affiliates, which results from changes in translation rates between the affiliates’ functional currencies and the U.S. dollar, is hedged with cross-currency swap contracts and certain foreign denominated debt which are designated as net investment hedges. The foreign currency exposure on certain non-functional currency denominated monetary assets and liabilities, primarily intercompany loans and accounts payable, is hedged primarily with undesignated derivative instruments. \nDerivative instruments are used to hedge a portion of forecasted cash flows denominated in foreign currencies for non-U.S. operations' purchases of raw materials, which are priced in U.S. dollars, and imports of intercompany finished goods and work-in-process priced predominantly in U.S. dollars and euros. The derivative instruments used to manage these exposures are designated as cash flow hedges.\nInterest Rate Risk\nInterest rate risk is managed using a portfolio of variable and fixed-rate debt composed of short and long-term instruments. Interest rate swap contracts may be used to facilitate the maintenance of the desired ratio of variable \n62\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nand fixed-rate debt and are designated as fair value hedges. From time to time, we also hedge the anticipated issuance of fixed-rate debt, and these contracts are designated as cash flow hedges.\nCommodity Price Risk\nWe use derivative instruments, such as commodity forward and price swap contracts, to hedge a portion of our exposure to market risk arising from changes in prices of certain commodities. These derivatives are designated as cash flow hedges of specific quantities of the underlying commodity expected to be purchased in future months. In addition, we utilize negotiated contracts of varying durations along with strategic pricing mechanisms to manage volatility for a portion of our commodity costs.\nFair Value He\ndges\nDerivative instruments that are designated and qualify as fair value hedges are predominantly used to manage interest rate risk. The fair values of these derivative instruments are recorded as an asset or liability, as appropriate, with the offset recorded in current Interest expense. The offset to the change in fair values of the related debt is also recorded in Interest expense. Any realized gain or loss on the derivatives that hedge interest rate risk is amortized to Interest expense over the life of the related debt. As of December 31, 2024, the aggregate notional values and carrying values of debt subject to outstanding interest rate contracts designated as fair value hedges were $\n525\n and $\n488\n, respectively. For years ended December 31, 2024, 2023 and 2022, gains or losses recognized in Interest expense for interest rate swaps were not material. \nCash Flow Hedges\nFor derivative instruments that are designated and qualify as cash flow hedges, the gain or loss on the derivative instrument is initially recorded in AOCI, net of related income taxes, and recognized in earnings in the same income statement line and period that the hedged exposure affects earnings. As of December 31, 2024, the aggregate notional value of outstanding foreign exchange derivative contracts designated as cash flow hedges was $\n3.1\n billion. For the years ended December 31, 2024, 2023 and 2022, no material gains or losses were reclassified into Interest expense, Cost of products sold or Other (income) and expense, net as a result of the discontinuance of cash flow hedges due to the original forecasted transaction no longer being probable of occurring. As of December 31, 2024, amounts to be reclassified from AOCI into Interest expense, Cost of products sold or Other (income), net during the next twelve months are not expected to be material. The maximum maturity of cash flow hedges in place as of December 31, 2024 is November 2027.\nNet Investment Hedges\nFor derivative instruments that are designated and qualify as net investment hedges, the aggregate notional value was $\n1.6\n billion as of December 31, 2024. We exclude the interest accruals on cross-currency swap contracts and the forward points on foreign exchange forward contracts from the assessment and measurement of hedge effectiveness. We recognize the interest accruals on cross-currency swap contracts in earnings within Interest expense. We amortize the forward points on foreign exchange contracts into earnings within Interest expense over the life of the hedging relationship. Changes in fair value of net investment hedges are recorded in AOCI and offset the change in the value of the net investment being hedged. For the year ended December 31, 2024, unrealized gains of $\n64\n related to net investment hedge fair value changes were recorded in AOCI and no material amounts were reclassified from AOCI to Interest expense.\nFor the years ended \nDecember 31, 2024, \n2023 and 2022 no material amounts we\nre excluded from the assessment of net investment, fair value or cash flow hedge effectiveness.\nUndesignated Hedging Instruments\nGa\nins or losses on undesignated foreign exchange hedging instruments are immediately recognized in Other (income) and expense, net. For the years ended \nDecember 31, 2024, \n2023 and 2022, we recognized a loss of $\n49\n, a gain of $\n2\n and a loss of $\n29\n, respectively. The effect on earnings from the use of these non-designated derivatives is substantially neutralized by the transactional gains and losses recorded on the underlying assets and liabilities. As of December 31, 2024, the notional amount of these undesignated derivative instruments was approximately $\n3.0\n billion.\n63\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nNote 13.    \nIncome Taxes\nThe \nProvision for income taxes consists of the following:\nYear Ended December 31\n2024\n2023\n2022\nCurrent income taxes\n  United States\n$\n243\n \n$\n370\n \n$\n248\n \n  State\n59\n \n54\n \n16\n \n  Other countries\n301\n \n351\n \n288\n \n    Total\n603\n \n775\n \n552\n \nDeferred income taxes\n  United States\n(\n11\n)\n(\n133\n)\n(\n27\n)\n  State\n(\n18\n)\n(\n28\n)\n(\n1\n)\n  Other countries\n(\n9\n)\n(\n161\n)\n(\n29\n)\n    Total\n(\n38\n)\n(\n322\n)\n(\n57\n)\nTotal Provision for income taxes\n$\n565\n \n$\n453\n \n$\n495\n \nThe components of Income Before Income Taxes and Equity Interests are as follows: \nYear Ended December 31\n2024\n2023\n2022\nUnited States\n$\n2,361\n \n$\n2,004\n \n$\n1,802\n \nOther countries\n566\n \n17\n \n538\n \nTotal Income Before Income Taxes and Equity Interests\n$\n2,927\n \n$\n2,021\n \n$\n2,340\n \nDeferred income tax assets and liabilities are comprised of the following:\nDecember 31\n2024\n2023\nDeferred tax assets\nPension and other postretirement benefits\n$\n173\n \n$\n182\n \nTax credits and loss carryforwards \n656\n \n668\n \nCapitalized research costs\n272\n \n224\n \nLease liabilities\n120\n \n137\n \nOther\n400\n \n437\n \n1,621\n \n1,648\n \nValuation allowances\n(\n301\n)\n(\n302\n)\nTotal deferred tax assets \n1,320\n \n1,346\n \nDeferred tax liabilities\nProperty, plant and equipment\n882\n \n943\n \nInvestments in subsidiaries\n113\n \n110\n \nGoodwill\n70\n \n80\n \nLease assets\n113\n \n128\n \nOther\n228\n \n189\n \nTotal deferred tax liabilities\n1,406\n \n1,450\n \nNet deferred tax assets (liabilities)\n$\n(\n86\n)\n$\n(\n104\n)\n64\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nValuation allowances as of December 31, 2024 primarily relate to tax credits, capital loss carryforwards, and income tax loss carryforwards of $\n1.2\n billion. If these items are not utilized against taxable income, $\n520\n of the income tax loss carryforwards will expire from 2025 through 2044. The remaining $\n724\n has no expiration date.\nRealization of income tax loss carryforwards is dependent on generating sufficient taxable income prior to expiration of these carryforwards. Although realization is not assured, we believe it is more likely than not that all of the deferred tax assets, net of applicable valuation allowances, will be realized. The amount of the deferred tax assets considered realizable could be reduced or increased due to changes in the tax environment or if estimates of future taxable income change during the carryforward period.\nPresented below is a reconciliation of the Provision for income taxes computed at the U.S. federal statutory tax rate to the actual effective tax rate:\nYear Ended December 31\n2024\n2023\n2022\nU.S. statutory rate applied to income before income taxes and equity interests\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income taxes, net of federal tax benefit\n1.1\n \n1.0\n \n0.5\n \nRoutine tax incentives\n(\n2.2\n)\n(\n3.9\n)\n(\n3.5\n)\nNet nondeductible expenses\n0.9\n \n2.4\n \n1.4\n \nNet tax (benefit) cost on foreign income\n1.5\n \n1.1\n \n2.4\n \nValuation allowance\n1.7\n \n2.8\n \n1.3\n \nTax effects of the impairment of intangible assets\n(\n0.5\n)\n(\n1.4\n)\n—\n \nSoftex tax reserve release\n(\n2.3\n)\n—\n \n—\n \nNigeria worthless stock deduction\n(\n1.4\n)\n—\n \n—\n \nOther - net\n(a)\n(\n0.5\n)\n(\n0.6\n)\n(\n1.9\n)\nEffective income tax rate\n19.3\n \n%\n22.4\n \n%\n21.2\n \n%\n(a)    \nOther - net is composed of numerous items, none of which are greater than 1.05% of income before income taxes and equity interests.\nAs of December 31, 2024, we have accumulated undistributed earnings generated by our foreign subsidiaries of approximately $\n10.6\n billion. Earnings of\n \n$\n3.4\n billion\n \nwere previously subject to U.S. federal income tax. Any additional taxes due with respect to such previously-taxed foreign earnings, if repatriated, would generally be limited to foreign and U.S. state income taxes. Deferred taxes have been recorded on $\n932\n of earnings of foreign consolidated subsidiaries expected to be repatriated. We do not intend to distribute any remaining foreign earnings and therefore have not recorded deferred taxes for foreign and U.S. income taxes on such earnings. \nWe consider any excess of the amount for financial reporting over the tax basis in our foreign subsidiaries to be indefinitely reinvested. The determination of deferred tax liabilities on the amount of financial reporting over tax basis or the remaining foreign earnings is not practicable.\nPresented below is a reconciliation of the beginning and ending amounts of unrecognized income tax benefits:\n2024\n2023\n2022\nBalance as of January 1\n$\n588\n \n$\n488\n \n$\n506\n \nGross increases for tax positions of prior years\n61\n \n38\n \n22\n \nGross decreases for tax positions of prior years\n(\n114\n)\n(\n13\n)\n(\n38\n)\nGross increases for tax positions of the current year\n50\n \n109\n \n36\n \nSettlements\n(\n32\n)\n(\n26\n)\n(\n21\n)\nOther\n(\n20\n)\n(\n8\n)\n(\n17\n)\nBalance as of December 31\n$\n533\n \n$\n588\n \n$\n488\n \n65\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nOf the amounts recorded as unrecognized income tax benefits as of December 31, 2024, $\n460\n would reduce our effective tax rate if recognized.\nWe recognize accrued interest and penalties related to unrecognized income tax benefits in Provision for income taxes. The net impact of interest and penalties for the years ended December 31, 2024, 2023, and 2022 was not significant. Total accrued penalties and net accrued interest was $\n54\n and $\n45\n as of December 31, 2024 and 2023, \nrespectively. \nIt is reasonably possible that a number of uncertainties could be resolved within the next 12 months. The aggregate resolution of the uncertainties could be up to \n$\n140\n, whil\ne none of the uncertainties is individually significant. Resolution of these matters is not expected to have a material effect on our financial condition, results of operations or liquidity.\nAs of December 31, 2024, the following tax years remain subject to examination for the major jurisdictions where we conduct business:\nJurisdiction\nYears\nUnited States\n2017\nto\n2024\nUnited Kingdom\n2021\nto\n2024\nBrazil\n2019\nto\n2024\nChina\n2014\nto\n2024\nSouth Korea\n2020\nto\n2024\nOur originally filed U.S. federal income tax returns have been audited through 2016; however, our amended U.S. federal income tax returns are subject to audit for 2014-2015 and 2017-2018.\nState income tax returns are generally subject to examination for a period of 3 to 5 years after filing of the respective return. The state effect of any changes to filed federal positions remains subject to examination by various states for a period of up to two years after formal notification to the states. We have various state income tax return positions in the process of examination, administrative appeals or litigation.\nThe Brazilian tax authority, Secretaria da Receita Federal do Brasil (\"RFB\"), concluded an audit for the taxable periods from 2008-2013. This audit included a review of our determinations of amortization of certain goodwill arising from prior acquisitions in Brazil, and the RFB has proposed adjustments that effectively eliminate the goodwill amortization benefits related to these transactions. Administrative appeals have been exhausted with a partial favorable decision for our position, and the remaining dispute is in the judicial phase. Based upon the matters that remain in dispute, the amount of the proposed tax and penalty adjustments is approximately $\n40\n as of December 31, 2024 (translated at the December 31, 2024 currency exchange rate). The amount ultimately in dispute will be significantly greater because of interest. The first instance judge has issued a decision in our favor, finding that our amortization of the goodwill at issue was valid; however, an appeal is pending and final resolution of this matter is expected to take a number of years.\nAs part of the tax audit of our U.S. federal income tax returns for the taxable years ended December 31, 2017 and 2018, the U.S. Internal Revenue Service issued an adjustment that would increase the amount of the one-time transition tax on certain undistributed earnings of foreign subsidiaries owed by us. We believe we have adequate reserves and meritorious defenses and intend to vigorously defend against the assessment; however, it is expected to take a number of years to reach resolution of this matter.\nAs part of the tax audit of our U.S. federal income tax returns for the taxable years ended December 31, 2019 and 2020, the U.S. Internal Revenue Service proposed an adjustment that would increase the amount of U.S. income tax on distributions made by minority owned foreign affiliates. We believe we have meritorious defenses and intend to vigorously defend against the proposed adjustment and have therefore not recorded a reserve; however, it is expected to take a number of years to reach resolution of this matter.\n66\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nNote 14.    \nEarnings Per Share (\"EPS\")\nThere are no adjustments required to be made to net income for purposes of computing basic and diluted EPS. The dilutive effect of stock options and other stock-based awards is reflected in diluted EPS by application of the treasury stock method. \nThe average number of common shares outstanding is reconciled to those used in the basic and diluted EPS computations as follows:\n(Millions of shares)\n2024\n2023\n2022\nBasic\n335.6\n \n337.8\n \n337.4\n \nDilutive effect of stock options and restricted share unit awards\n1.4\n \n1.0\n \n0.9\n \nDiluted\n337.0\n \n338.8\n \n338.3\n \nOptions outstanding not included in the computation of diluted EPS because their exercise price was greater than the average market price of the common shares were insignificant. The number of common shares outstanding as of December 31, 2024, 2023 and 2022 was \n331.8\n million, \n337.0\n million\n and \n337.5\n million\n, respectively.\nNote 15.    \nSegment Reporting\nIn the fourth quarter of 2024, we realigned our internal operating and management structure to streamline our supply chain and improve the efficiency of our corporate and regional overhead cost structures. As a result of this realignment, we manage and report our operations through operating segments that have been aggregated into three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). Further, our measure of segment profitability was changed to include the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. \nThe reportable segments were determined in accordance with how our Chief Executive Officer, who is our chief operating decision maker (\"CODM\"), develops and executes global strategies to drive growth and profitability. These strategies include global plans for branding and product positioning, technology, research and development programs, cost reductions including supply chain management, and capacity and capital investments for each of these businesses. The primary measure of segment profitability utilized by our CODM is segment operating profit. Our CODM uses this measure to assess the operating results and performance of our segments, perform analytical comparisons to budget and allocate resources to each segment. Segment operating profit excludes Corporate & Other, which primarily encompasses certain unallocated general corporate expenses, impairment charges, one-time (gains) or losses associated with acquisitions and divestitures, and costs related to our reorganization activities that are not associated with the ongoing operations of the segments. Our CODM does not use assets by segment to evaluate performance or allocate resources. Therefore, we do not disclose assets by segment.\nThe principal sources of revenue in each segment are described below:\n•\nNorth America\n consists of products encompassing each of our five global daily-need categories across consumer and professional channels including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers and other related products. These products are sold under the Huggies, Pull-Ups, GoodNites, Kotex, Poise, Depend, Kleenex, Scott, Cottonelle, Viva, Wypall  and other brand names.\n•\nInternational Personal Care \nconsists of three core categories — Baby & Child Care, Adult Care and Feminine Care, including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear and other related products. These products are sold under the Huggies, Kotex, Goodfeel, Intimus, Depend and other brand names.\n•\nInternational Family Care and Professional \nconsists of two core categories — Family Care and Professional, including facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers and other related products. These products are sold under the Kleenex, Scott, Viva, Andrex, Scottex, Wypall and other brand names.\n67\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe tables below present net sales and the significant expense categories that are included in Segment Operating Profit and regularly provided to our CODM:  \nYear Ended December 31, 2024\nNA\nIPC\nIFP\nTotal\nNet Sales\n$\n11,008\n \n$\n5,715\n \n$\n3,335\n \n$\n20,058\n \nCost of Products Sold\n6,518\n \n3,761\n \n2,442\n \n12,721\n \nAdvertising and Promotion Expense\n806\n \n416\n \n74\n \n1,296\n \nResearch, Selling and General Expense\n1,150\n \n738\n \n441\n \n2,329\n \nOther (Income) and Expense, net\n(a)\n—\n \n13\n \n1\n \n14\n \nSegment Operating Profit\n$\n2,534\n \n$\n787\n \n$\n377\n \n$\n3,698\n \nCorporate & Other\n(\n488\n)\nTotal Operating Profit\n$\n3,210\n \nYear Ended December 31, 2023\nNA\nIPC\nIFP\nTotal\nNet Sales\n$\n10,988\n \n$\n5,899\n \n$\n3,544\n \n$\n20,431\n \nCost of Products Sold\n6,607\n \n4,008\n \n2,754\n \n13,369\n \nAdvertising and Promotion Expense\n739\n \n400\n \n58\n \n1,197\n \nResearch, Selling and General Expense\n1,135\n \n763\n \n437\n \n2,335\n \nOther (Income) and Expense, net\n(a)\n—\n \n96\n \n8\n \n104\n \nSegment Operating Profit\n$\n2,507\n \n$\n632\n \n$\n287\n \n$\n3,426\n \nCorporate & Other\n(\n1,082\n)\nTotal Operating Profit\n$\n2,344\n \nYear Ended December 31, 2022\nNA\nIPC\nIFP\nTotal\nNet Sales\n$\n10,470\n \n$\n6,054\n \n$\n3,651\n \n$\n20,175\n \nCost of Products Sold\n6,784\n \n4,258\n \n2,907\n \n13,949\n \nAdvertising and Promotion Expense\n608\n \n348\n \n53\n \n1,009\n \nResearch, Selling and General Expense\n968\n \n764\n \n434\n \n2,166\n \nOther (Income) and Expense, net\n(a)\n—\n \n14\n \n1\n \n15\n \nSegment Operating Profit\n$\n2,110\n \n$\n670\n \n$\n256\n \n$\n3,036\n \nCorporate & Other\n(\n355\n)\nTotal Operating Profit\n$\n2,681\n \n(a)\nOther (income) and expense, net primarily includes the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. \n68\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDepreciation and amortization expense and capital spending by segment were:\nNA\nIPC\nIFP\nCorporate\n& Other\nTotal\nDepreciation and Amortization\n2024\n$\n440\n \n$\n200\n \n$\n133\n \n$\n8\n \n$\n781\n \n2023\n430\n \n205\n \n115\n \n3\n \n753\n \n2022\n429\n \n199\n \n123\n \n3\n \n754\n \nCapital Spending\n2024\n443\n \n157\n \n116\n \n5\n \n721\n \n2023\n455\n \n196\n \n100\n \n15\n \n766\n \n2022\n502\n \n236\n \n134\n \n4\n \n876\n \nSales of Principal Products for the years ended were: \nYear Ended December 31\n2024\n2023\n2022\nBaby and Child Care\n$\n7,056\n \n$\n7,054\n \n$\n7,166\n \nFamily Care\n6,157\n \n6,290\n \n6,243\n \nProfessional\n3,176\n \n3,404\n \n3,256\n \nAdult Care\n1,864\n \n1,809\n \n1,730\n \nFeminine Care\n1,721\n \n1,787\n \n1,695\n \nAll Other\n84\n \n87\n \n85\n \nConsolidated\n$\n20,058\n \n$\n20,431\n \n$\n20,175\n \nNet sales in the U.S. to third parties totaled $\n10.4\n billion in 2024 and 2023 and $\n9.8\n billion in 2022. No other individual country's net sales exceed 10% of consolidated net sales.\nNet sales to Walmart Inc. as a percent of our consolidated net sales were approximately \n14\n% in 2024 and \n13\n% in 2023 and 2022. Net sales to Walmart Inc. were primarily in the NA segment.\nNote 16.    \nSupplemental Data\nSupplemental Income Statement Data\nYear Ended December 31\n2024\n2023\n2022\nAdvertising expense\n$\n1,184\n \n$\n1,075\n \n$\n901\n \nResearch expense\n338\n \n312\n \n292\n \n69\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nEquity Companies' Data\nNet\nSales\nGross\nProfit\nOperating\nProfit\nNet\nIncome\nCorporation’s\nShare of Net\nIncome\n2024\n$\n3,180\n \n$\n1,063\n \n$\n727\n \n$\n451\n \n$\n216\n \n2023\n3,135\n \n1,003\n \n683\n \n410\n \n196\n \n2022\n2,690\n \n707\n \n438\n \n240\n \n116\n \nCurrent\nAssets\nNon-Current\nAssets\nCurrent\nLiabilities\nNon-Current\nLiabilities\nStockholders’\nEquity\n2024\n$\n1,536\n \n$\n1,135\n \n$\n1,050\n \n$\n1,177\n \n$\n444\n \n2023\n1,974\n \n1,362\n \n1,175\n \n1,687\n \n474\n \n2022\n1,585\n \n1,303\n \n814\n \n1,751\n \n323\n \nEquity companies are principally engaged in the manufacture and sale of products similar to those produced by the C\nompany. As of December 31, 2024, our ownership interest in Kimberly-Clark de Mexico, S.A.B. de C.V. and subsidiaries (\"KCM\") was \n47.9\n%. KCM is partially owned by the public, and its stock is publicly traded in Mexico. As of December 31, 2024, our investment in this equity company was $\n256\n, and the estimated fair value of the investment was $\n2.0\n billion based on the market price of publicly traded shares. Our other equity ownership interests are not significant to our consolidated financial statements.\nAs of December 31, 2024, undistributed net income of equity companies included in consolidated retained earnings was $\n1.2\n billion.\nSupplemental Balance Sheet Data\nDecember 31\nSummary of Accounts Receivable, Net\n2024\n2023\nFrom customers\n$\n1,908\n \n$\n2,063\n \nOther\n154\n \n150\n \nLess allowance for doubtful accounts and sales discounts\n(\n53\n)\n(\n78\n)\nTotal\n$\n2,009\n \n$\n2,135\n \nDecember 31\n2024\n2023\nSummary of Inventories by Major Class\nLIFO\nNon-LIFO\nTotal\nLIFO\nNon-LIFO\nTotal\nRaw materials\n$\n122\n \n$\n261\n \n$\n383\n \n$\n121\n \n$\n292\n \n$\n413\n \nWork in process\n116\n \n74\n \n190\n \n116\n \n95\n \n211\n \nFinished goods\n510\n \n631\n \n1,141\n \n520\n \n692\n \n1,212\n \nSupplies and other\n—\n \n308\n \n308\n \n—\n \n311\n \n311\n \n748\n \n1,274\n \n2,022\n \n757\n \n1,390\n \n2,147\n \nExcess of FIFO or weighted-average cost over LIFO cost\n(\n200\n)\n—\n \n(\n200\n)\n(\n192\n)\n—\n \n(\n192\n)\nTotal\n$\n548\n \n$\n1,274\n \n$\n1,822\n \n$\n565\n \n$\n1,390\n \n$\n1,955\n \nInventories are valued at the lower of cost or net realizable value, determined on the FIFO or weighted-average cost methods, and at the lower of cost or market, determined on the LIFO cost method.\n70\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDecember 31\nSummary of Other Current Assets\n2024\n2023\nPrepaid expenses\n$\n303\n \n$\n252\n \nTime deposits\n186\n \n157\n \nDerivative assets\n114\n \n42\n \nOther\n125\n \n69\n \nTotal\n$\n728\n \n$\n520\n \nDecember 31\nSummary of Property, Plant and Equipment, Net\n2024\n2023\nLand\n$\n157\n \n$\n149\n \nBuildings\n2,901\n \n3,067\n \nMachinery and equipment\n15,020\n \n15,132\n \nConstruction in progress\n854\n \n803\n \n18,932\n \n19,151\n \nLess accumulated depreciation\n(\n11,419\n)\n(\n11,238\n)\nTotal\n$\n7,513\n \n$\n7,913\n \nProperty, plant and equipment, net in the U.S. as of December 31, 2024 and 2023 was $\n4.4\n billion. Depreciation expense was $\n773\n, $\n740\n and $\n739\n for the years ended December 31, 2024, 2023 and 2022, respectively.\nDecember 31\nSummary of Accrued Expenses and Other Current Liabilities\n2024\n2023\nAccrued advertising and promotion\n$\n540\n \n$\n524\n \nAccrued salaries and wages\n462\n \n518\n \nAccrued rebates\n245\n \n268\n \nAccrued taxes - income and other\n288\n \n294\n \nOperating leases\n131\n \n130\n \n2024 Transformation Initiative liabilities\n130\n \n—\n \nAccrued interest\n99\n \n88\n \nDerivative liabilities\n82\n \n139\n \nOther\n342\n \n355\n \nTotal\n$\n2,319\n \n$\n2,316\n \nSupplemental Cash Flow Statement Data\nSummary of Cash Flow Effects of Operating Working Capital\nYear Ended December 31\n2024\n2023\n2022\nAccounts receivable\n$\n48\n \n$\n127\n \n$\n(\n151\n)\nInventories\n10\n \n290\n \n(\n76\n)\nTrade accounts payable\n179\n \n(\n109\n)\n109\n \nAccrued expenses\n106\n \n125\n \n92\n \nAccrued income taxes\n(\n110\n)\n122\n \n20\n \nDerivatives\n79\n \n(\n15\n)\n9\n \nCurrency and other\n(\n134\n)\n42\n \n(\n20\n)\nTotal\n$\n178\n \n$\n582\n \n$\n(\n17\n)\n71\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nYear Ended December 31\nOther Cash Flow Data\n2024\n2023\n2022\nInterest paid\n$\n268\n \n$\n277\n \n$\n270\n \nIncome taxes paid\n587\n \n648\n \n468\n \nSupplier Finance Program\nWe have a supplier finance program managed through two global financial institutions under which we agree to pay the financial institutions the stated amount of confirmed invoices from our participating suppliers on the invoice due date. We, or the global financial institutions, may terminate our agreements at any time upon 30 days written notice. The global financial institutions may terminate our agreements at any time upon three days written notice in the event there are insufficient funds available for disbursement. We do not provide any forms of guarantees under these agreements. Supplier participation in the program is solely up to the supplier, and the participating suppliers negotiate their arrangements directly with the global financial institutions. We have no economic interest in a supplier’s decision to participate in the program, and their participation has no bearing on our payment terms or amounts due. The payment terms that we have with our suppliers under this program generally range from 75 to 180 days and are considered commercially reasonable. The outstanding amount related to the suppliers participating in this program was $\n1.0\n billion as of December 31, 2024 and 2023, and was recorded within \nTrade accounts payable.\nThe rollforward of the Company's outstanding obligations confirmed as valid under its supplier finance program for the year ended December 31, 2024, are as follows:\n2024\nConfirmed obligations outstanding at the beginning of the year\n$\n960\n \nInvoices confirmed during the year\n3,033\n \nConfirmed invoices paid during the year\n(\n2,989\n)\nConfirmed obligations outstanding at the end of the year\n$\n1,004\n \n72\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Kimberly-Clark Corporation: \nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Kimberly-Clark Corporation and subsidiaries (the \"Corporation\") as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes and the financial statement schedules listed in the Table of Contents at Item 15 (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Corporation as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Corporation's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 13, 2025, expressed an unqualified opinion on the Corporation's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Corporation's management. Our responsibility is to express an opinion on the Corporation's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Corporation in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nSales Incentives and Trade Promotion Allowances —Refer to Note 1 to the Financial Statements\nCritical Audit Matter Description\nThe Corporation utilizes various trade promotion programs globally. The cost of promotion activities is classified as a reduction in sales revenue and can result in a period of time between the date the customer earns a promotion and the date the customer claims the promotion. The Corporation records an estimate for trade promotions using customer sales associated with valid promotion events, actual promotion claims, and forecasted information of amounts earned by the customer but not yet claimed. \nWe identified the reductions to revenue associated with trade promotions and the related accrual as a critical audit matter because of the complexity and volume of the Corporation’s processes related to trade promotion programs \n73\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nand the subjectivity of estimating future customer claims. This required an extensive audit effort due to the complexity and volume of the trade promotion programs and information systems utilized globally as well as the subjectivity of estimating future customer claims related to the trade promotion accrual. \nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the reduction in revenue associated with trade promotions and the related accrual included the following, among others: \n•\nWith the assistance of our Information Technology (IT) specialists, we: \n–\nIdentified the significant systems used to process trade promotion transactions and tested the general IT controls over each of these systems, including testing of user access controls, change management controls, and IT operations controls.\n–\nTested the effectiveness of automated controls over revenue streams, including those over the evaluation of the accuracy and completeness of trade promotions.\n•\nWe tested the effectiveness of internal controls over the trade promotions and the related accrual, including those over the quantity of customer sales associated with valid promotion events and the estimated future promotion claims associated with the trade accrual.\n•\nWe evaluated trade promotion transactions using either substantive analytical procedures or by evaluating individual transactions. When analytical procedures were performed, we developed an expectation for reduction in revenue associated with trade promotions based on the relationship with gross sales adjusted for changes in data, if warranted. These adjustments to our expectation may consist of changes in product mix, sales margin, or inflation, and compared to the recorded amount. When individual promotion transactions were evaluated, we obtained evidence of the promotion agreement with the customer and the amounts of the promotions earned.\n \n•\nWe evaluated management’s ability to estimate future promotion claims by comparing actual promotion claims to management’s historical estimates.\n \n•\nWe evaluated the reasonableness of management’s estimate of future promotion claims by testing the underlying data related to (1) customer sales associated with valid promotion events, (2) actual promotion claims, and (3) forecasted information.\n/s/ DELOITTE & TOUCHE LLP  \nDeloitte & Touche LLP\nDallas, Texas\nFebruary 13, 2025\nWe have served as the Corporation’s auditor since 1928.\n74\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nAs of December 31, 2024, an evaluation was performed under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a - 15(e) and 15d - 15(e) of the Securities Exchange Act of 1934 (Exchange Act)). Based on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that our disclosure controls and procedures were effective as of December 31, 2024.\nManagement's Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining an adequate system of internal control over financial reporting, including safeguarding of assets against unauthorized acquisition, use or disposition. This system is designed to provide reasonable assurance to management and our Board of Directors regarding preparation of reliable published financial statements and safeguarding of our assets. This system is supported with written policies and procedures, contains self-monitoring mechanisms and is audited by the internal audit function. Appropriate actions are taken by management to correct deficiencies as they are identified. All internal control systems have inherent limitations, including the possibility of circumvention and overriding of controls, and, therefore, can provide only reasonable assurance as to the reliability of financial statement preparation and such asset safeguarding.\nWe have assessed the effectiveness of our internal control over financial reporting as of December 31, 2024. In making this assessment, we used the criteria described in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management believes that, as of December 31, 2024, our internal control over financial reporting is effective.\nDeloitte & Touche LLP has audited the effectiveness of our internal control over financial reporting as of December 31, 2024, and has expressed an unqualified opinion in their report, which appears in this report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting identified in connection with the evaluation described above in \"Internal Control Over Financial Reporting\" that occurred during our fourth fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Kimberly-Clark Corporation:\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Kimberly-Clark Corporation and subsidiaries (the “Corporation”) as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Corporation maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the \n75\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nCorporation and our report dated February 13, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion \nThe Corporation’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Corporation’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Corporation in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ D\nELOITTE\n & T\nOUCHE\n LLP  \nDeloitte & Touche LLP\nDallas, Texas\nFebruary 13, 2025\nITEM 9B.    OTHER INFORMATION\n(b)\nOur directors and officers may from time to time enter into plans or other arrangements for the purchase or sale of our shares that are intended to satisfy the affirmative defense conditions of Rule 10b5–1(c) or may represent a non-Rule 10b5-1 trading arrangement under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). During the quarter ended December 31, 2024, no such plans or other arrangements were \nadopted\n or \nterminated.\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n76\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following sections of our Proxy Statement for the 2025 Annual Meeting of Stockholders (the \"2025 Proxy Statement\") are incorporated in this Item 10 by reference:\n•\n\"The Nominees\" under \"Proposal 1. Election of Directors,\" which identifies our directors and nominees for our Board of Directors.\n•\n\"Corporate Governance - Other Corporate Governance Policies and Practices - Code of Conduct,\" which describes our Code of Conduct.\n•\n\"Corporate Governance - Stockholder Rights,\" \"Proposal 1. Election of Directors,\" \"General Information about our Annual Meeting - Stockholder Director Nominees for Inclusion in Next Year's Proxy Statement,\" and \"General Information about our Annual Meeting - Stockholder Director Nominees Not Included in Next Year's Proxy Statement,\" which describe the procedures by which stockholders may nominate candidates for election to our Board of Directors.\n•\n\"Corporate Governance - Board Committees - Audit Committee,\" which identifies members of the Audit Committee of our Board of Directors and audit committee financial experts.\n•\n“Compensation Discussion and Analysis - Additional Information about Our Compensation Practices - Insider Trading Policy; Anti-Hedging and Pledging Policy,” which describes our Insider Trading Policy.\nInformation regarding our executive officers is reported under the caption \"Information About Our Executive Officers\" in Part I of this Report.\nITEM 11.    EXECUTIVE COMPENSATION\nThe information in the sections of our 2025 Proxy Statement captioned \"Compensation Discussion and Analysis,\" \"Compensation Tables,\" \"Director Compensation,\" \"Corporate Governance - Compensation Committee Interlocks and Insider Participation,\" \"Other Information - CEO Pay Ratio Disclosure\" and \"Other Information - Pay Versus Performance\" is incorporated in this Item 11 by reference.\nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information in the sections of our 2025 Proxy Statement captioned \"Compensation Tables - Equity Compensation Plan Information\" and \"Other Information - Security Ownership Information\" is incorporated in this Item 12 by reference.\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information in the sections of our 2025 Proxy Statement captioned \"Other Information - Transactions with Related Persons\" and \"Corporate Governance - Director Independence\" is incorporated in this Item 13 by reference.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES (Deloitte & Touche LLP, PCAOB ID \n34\n)\nThe information in the sections of our 2025 Proxy Statement captioned \"Principal Accounting Firm Fees\" and \"Audit Committee Approval of Audit and Non-Audit Services\" under \"Proposal 2. Ratification of Auditor\" is incorporated in this Item 14 by reference. \n77\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nPART IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nDocuments filed as part of this report.\n1.\nFinancial statements.\nThe financial statements are set forth under Item 8 of this report on Form 10-K.\n2.\nFinancial statement schedules.\nThe following information is filed as part of this Form 10-K and should be read in conjunction with the financial statements contained in Item 8:\n•\nReport of Independent Registered Public Accounting Firm\nSchedule for Kimberly-Clark Corporation and Subsidiaries:\n•\nSchedule II Valuation and Qualifying Accounts\nAll other schedules have been omitted because they were not applicable or because the required information has been included in the financial statements or notes thereto.\n3.\nExhibits\nExhibit No. (3)a.\nAmended and Restated Certificate of Incorporation of Kimberly-Clark Corporation, incorporated by reference to Exhibit No. (3)a of the Corporation's Current Report on Form 8-K filed on May 2, 2024.\nExhibit No. (3)b.\nBy-Laws, as amended April 29, 2021, incorporated by reference to Exhibit No. (3)b of the Corporation's Current Report on Form 8-K filed on April 29, 2021.\nExhibit No. (4)a.\nFirst Amended and Restated Indenture dated as of March 1, 1988 between the Corporation and The Bank of New York Mellon Trust Company, N.A. (as successor in interest to The First National Bank of Chicago) as Trustee (originally executed with Bank of America National Trust and Savings Association) (incorporated by reference to Exhibit No. 4.1 to the Registration Statement on Form S-3 filed on February 2, 1998 (Registration No. 333-45399)).\nExhibit No. (4)b.\nFirst Supplemental Indenture, dated as of November 6, 1992, to the Indenture (incorporated by reference to Exhibit No. 4.3 to the Registration Statement on Form S-3 filed on June 17, 1994 (Registration No. 33-54177)).\nExhibit No. (4)c.\nSecond\n \nSupplemental Indenture, dated as of May 25, 1994, to the Indenture (incorporated by reference to Exhibit No. 4.4 to the Registration Statement on Form S-3 filed on June 17, 1994 (Registration No. 33-54177)).\nExhibit No. (4)d.\nEighth Supplemental Indenture, dated as of October 27, 2021, to the Indenture, among the Corporation, The Bank of New York Mellon Trust Company, N.A., as successor trustee, and U.S. Bank National Association, as successor trustee, incorporated by reference to Exhibit No. 4.3 of the Corporation's Current Report on Form 8-K filed on November 2, 2021.\nExhibit No. (4)e.\nCopies of instruments defining the rights of holders of long-term debt will be furnished to the Securities and Exchange Commission on request.\nExhibit No. (4)f.\nDescription of the Corporation's Common Stock, incorporated by reference to Exhibit No. (4)f of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2023.\n78\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nExhibit No. (10)a.\nManagement Achievement Award Program, as amended and restated January 1, 2021, incorporated by reference to Exhibit (10)a of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2020.*\nExhibit No. (10)b.\nForm of Executive Severance Agreement, incorporated by reference to Exhibit No. (10)b of the Corporation's Current Report on Form 8-K filed on September 16, 2020.*\nExhibit No. (10)c.\nSeventh Amended and Restated Deferred Compensation Plan for Directors, effective January 1, 2008, incorporated by reference to Exhibit No. (10)c of the Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2008.*\nExhibit No. (10)d.\nKimberly-Clark Corporation Voluntary Deferred Compensation Plan, incorporated by reference to Exhibit (10)d of the Corporation's Current Report on Form 8-K dated September 15, 2022.*\nExhibit No. (10)e.\nFirst Amendment to the Kimberly-Clark Corporation Voluntary Deferred Compensation Plan, \neffective \nJanuary 1, 2023, \nincorporated by reference to Exhibit No. (10)e of the Corporation's Annual Report on Form 10-K for the year ended December 31, 202\n2\n.*\nExhibit No. (10)f.\nSummary of Kimberly-Clark Corporation Executive Long-Term Disability Plan, incorporated by reference to Exhibit (10)g of the Corporation's Quarterly Report on Form 10-Q for the quarter ended September 30, 2022.*\nExhibit No. (10)g.\nOutside Directors' Stock Compensation Plan, as amended, incorporated by reference to Exhibit No. 10(g) of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2002.*\nExhibit No. (10)h.\nSupplemental Benefit Plan to the Kimberly-Clark Corporation Pension Plan, as amended and restated effective April 17, 2009, incorporated by reference to Exhibit No. (10)h of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2009.*\nExhibit No. (10)i.\nSecond Supplemental Benefit Plan to the Kimberly-Clark Corporation Pension Plan, as amended and restated, effective April 17, 2009\n, incorporated by reference to Exhibit (\n10)i of the Corporation's Annual Report on Form 10-K for the year ended De\ncember \n31, \n2009\n.\n*\n \nExhibit No. (10)j.\nKimberly-Clark Corporation Supplemental Retirement 401(k) and Profit Sharing Plan, as amended and restated effective January 1, 2023\n, incor\nporated by reference to Exhibit \nNo. (10)j of the Corporation\n's Annual Report o\nn Form 10-K for the year ended December 31, 2022.\n*\nExhibit No. (10)k.\n2021 Outside Directors' Compensation Plan effective April 29, 2021, incorporated by reference to Exhibit No. (10)k of the Corporation's Current Report on Form 8-K filed on April 29, 2021.*\nExhibit No. (10)l.\n2011 Outside Directors' Compensation Plan, as amended and restated, effective May 4, 2016, incorporated by reference to Exhibit No. (10)l of the Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2016.*\nExhibit No. (10)m.\n2011 Equity Participation Plan, as amended and restated, effective April 21, 2011, incorporated by reference to Exhibit No. 10.2 of the Corporation's Current Report on Form 8-K filed on April 26, 2011.*\n79\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nExhibit No. (10)n.\nForm of Award Agreements under 2021 Equity Participation Plan for Nonqualified Stock Options, incorporated by reference to Exhibit No. (10)n of the Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2022.*\nExhibit No. (10)o.\n2021 Equity Participation Plan effective April 29, 2021, incorporated by reference to Exhibit No. (10)o of the Corporation's Current Report on Form 8-K filed on April 29, 2021.*\nExhibit No. (10)p.\nSeverance Pay Plan,\n as amended and restated effect\nive January 1, 2024,\n incorporated by reference to Exhibit No. (10)p of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2023.*\nExhibit No. (10)q.\nForm of Award Agreements under 2021 Equity Participation Plan for Performance Restricted Stock Units, incorporated by reference to Exhibit No. (10)q of the Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2024.*\nExhibit No. (10)r.\nForm of Award Agreements under 2021 Equity Participation Plan for Off-Cycle Time-Vested Restricted Stock Units, incorporated by reference to Exhibit No. (10)r of the Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2024.*\nExhibit No. (10)s.\nFirst Amendment to 2011 Equity Participation Plan, effective February 12, 2020, incorporated by reference to Exhibit No. (10)s of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2019.*\nExhibit No. (10)t.\nForm of Award Agreements under 2021 Equity Participation Plan for Annual Time-Vested Restricted Stock Units, incorporated by reference to Exhibit No. (10)t of the Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2024.*\nExhibit No. (19).\nKimberly-Clark Corporation Insider Trading Policy, effective October 25, 2024, filed herewith.\nExhibit No. (21).\nSubsidiaries of the Corporation, filed herewith.\nExhibit No. (23).\nConsent of Independent Registered Public Accounting Firm, filed herewith.\nExhibit No. (24).\nPowers of Attorney, filed herewith.\nExhibit No. (31)a.\nCertification of Chief Executive Officer required by Rule 13a-14(a) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), filed herewith.\nExhibit No. (31)b.\nCertification of Chief Financial Officer required by Rule 13a-14(a) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), filed herewith.\nExhibit No. (32)a.\nCertification of Chief Executive Officer required by Rule 13a-14(b) or Rule 15d-14(b) of the Exchange Act and Section 1350 of Chapter 63 of Title 18 of the United States Code, furnished herewith.\nExhibit No. (32)b.\nCertification of Chief Financial Officer required by Rule 13a-14(b) or Rule 15d-14(b) of the Exchange Act and Section 1350 of Chapter 63 of Title 18 of the United States Code, furnished herewith.\nExhibit No. (97)a.\nExecutive Officer Incentive Compensation Recovery Policy, incorporated by reference to Exhibit No. (97)a of the Corporation's Annual Report on Form 10-K for the year ended December 31, 2023.\n80\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nExhibit No. (101).INS\nXBRL Instance Document - the instant document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\nExhibit No. (101).SCH\nXBRL Taxonomy Extension Schema Document\nExhibit No. (101).CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\nExhibit No. (101).DEF\nXBRL Taxonomy Extension Definition Linkbase Document\nExhibit No. (101).LAB\nXBRL Taxonomy Extension Label Linkbase Document\nExhibit No. (101).PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\nExhibit No. (104)\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*A management contract or compensatory plan or arrangement required to be identified pursuant to Item 15(a)(3) of this Annual Report on Form 10-K.\n    \nITEM 16.     FORM 10-K SUMMARY\nNone. \n81\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKIMBERLY-CLARK CORPORATION\nFebruary 13, 2025\nBy:\n/s/ Andrew S. Drexler\nAndrew S. Drexler\nVice President and Controller\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \n/s/ Michael D. Hsu\nChairman of the Board and Chief Executive Officer and Director\n(Principal Executive Officer)\nFebruary 13, 2025\nMichael D. Hsu\n/s/ Nelson Urdaneta\nSenior Vice President and Chief Financial Officer\n(Principal Financial Officer)\nFebruary 13, 2025\nNelson Urdaneta\n/s/ Andrew S. Drexler\nVice President and Controller\n(Principal Accounting Officer)\nFebruary 13, 2025\nAndrew S. Drexler\n \n \nDirectors\nSylvia M. Burwell\nSherilyn S. McCoy\nJohn W. Culver\n  \nChrista S. Quarles\nMae C. Jemison\n  \nJaime A. Ramirez\nDeeptha Khanna\nJoseph Romanelli\nS. Todd Maclin\n  \nDunia A. Shive\nDeirdre A. Mahlan\n  \nMark T. Smucker\n \nBy:\n/s/ Andrew S. Drexler\nFebruary 13, 2025\nAndrew S. Drexler\nAttorney-in-Fact\n82\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nKIMBERLY-CLARK CORPORATION AND SUBSIDIARIES\nSCHEDULE II\nVALUATION AND QUALIFYING ACCOUNTS\nFOR THE YEARS ENDED DECEMBER 31, 2024, 2023 AND 2022 \n(In millions)\nDescription\nBalance at\nBeginning\nOf Period\nAdditions\nDeductions\n \n \nCharged to\nCosts and\nExpenses\nCharged to\nOther\nAccounts\n(a)\nWrite-Offs and\nReclassifications\n \nBalance\nat End of\nPeriod\nDecember 31, 2024\nAllowances deducted from assets to which they apply\nAllowance for doubtful accounts\n$\n59\n \n$\n(\n6\n)\n$\n(\n4\n)\n$\n15\n \n(b)\n$\n34\n \nAllowances for sales discounts\n19\n \n250\n \n(\n7\n)\n243\n \n(c)\n19\n \nDecember 31, 2023\nAllowances deducted from assets to which they apply\nAllowance for doubtful accounts\n$\n47\n \n$\n15\n \n$\n3\n \n$\n6\n \n(b)\n$\n59\n \nAllowances for sales discounts\n17\n \n248\n \n(\n4\n)\n242\n \n(c)\n19\n \nDecember 31, 2022\nAllowances deducted from assets to which they apply\nAllowance for doubtful accounts\n$\n40\n \n$\n14\n \n$\n(\n3\n)\n$\n4\n \n(b)\n$\n47\n \nAllowances for sales discounts\n15\n \n239\n \n(\n3\n)\n234\n \n(c)\n17\n \n(a)\nIncludes bad debt recoveries and the effects of changes in foreign currency exchange rates.\n(b)\nPrimarily uncollectible receivables written off.\n(c)\nSales discounts allowed.\n \nAdditions\n \n \nDescription\nBalance at\nBeginning\nof Period\nCharged to\nCosts and\nExpenses\nCharged to\nOther\nAccounts\nDeductions\n(a)\nBalance\nat End\nof  Period\nDecember 31, 2024\nDeferred taxes\nValuation allowance\n$\n302\n \n$\n11\n \n$\n—\n \n$\n12\n \n$\n301\n \nDecember 31, 2023\nDeferred taxes\nValuation allowance\n$\n299\n \n$\n46\n \n$\n—\n \n$\n43\n \n$\n302\n \nDecember 31, 2022\nDeferred taxes\nValuation allowance\n$\n279\n \n$\n37\n \n$\n—\n \n$\n17\n \n$\n299\n \n(a)\nRepresents the net currency effects of translating valuation allowances at current rates of exchange and benefits recognized to Other Comprehensive Income.\n \n83\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report"
  }
}