{
  "ticker": "KO",
  "cik": "0000021344",
  "company_name": "COCA COLA CO",
  "filing_date": "2025-02-20",
  "accession": "0000021344-25-000011",
  "primary_doc": "ko-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.  BUSINESS\nIn this report, the terms “The Coca-Cola Company,” “Company,” “we,” “us” and “our” mean The Coca-Cola Company and all entities included in our consolidated financial statements.\nGeneral\nThe Coca-Cola Company is a total beverage company, and beverage products bearing our trademarks, sold in the United States since 1886, are now sold in more than 200 countries and territories. We own or license and market numerous beverage brands, which we group into the following categories: Trademark Coca-Cola; sparkling flavors; water, sports, coffee and tea; juice, value-added dairy and plant-based beverages; and emerging beverages. We own and market several of the world’s largest nonalcoholic sparkling soft drink brands, including Coca-Cola, Sprite, Coca-Cola Zero Sugar, Fanta and Diet Coke/Coca-Cola Light. \nWe make our branded beverage products available to consumers throughout the world through our network of independent bottling partners, distributors, wholesalers and retailers as well as our consolidated bottling and distribution operations. Beverages bearing trademarks owned by or licensed to the Company account for 2.2 billion of the estimated 65 billion servings of all beverages consumed worldwide every day.\nWe believe our success depends on our ability to connect with consumers by providing them with a wide variety of beverage options to meet their desires, needs and lifestyles. Our success further depends on the ability of our people to execute effectively, every day.\nWe are guided by our purpose, which is to refresh the world and make a difference. Our vision for growth has three connected pillars:\n•\nLoved Brands. We craft meaningful brands and a choice of drinks that people love and enjoy and that refresh them in body and spirit.\n•\nDone Sustainably. We grow our business in ways that achieve positive change in the world and build a more sustainable future for our planet.\n•\nFor a Better Shared Future. We invest to improve people’s lives, from our employees to all those who touch our business system, to our investors, to the communities we call home.\nThe Coca-Cola Company was incorporated in September 1919 under the laws of the State of Delaware and succeeded to the business of a Georgia corporation with the same name that had been organized in 1892.\n2\nOperating Segments\nThe Company’s operating structure is the basis for our internal financial reporting. Our operating structure includes the following operating segments:\n•\nEurope, Middle East and Africa\n•\nLatin America\n•\nNorth America\n•\nAsia Pacific\n•\nGlobal Ventures\n•\nBottling Investments\nAdditionally, our operating structure includes operating units, which sit under our four geographic operating segments. The operating units are focused on regional and local execution and are highly interconnected, with the goal of eliminating duplication of resources and scaling new products more quickly. The operating units work closely with five global marketing category leadership teams to rapidly scale ideas while staying close to the consumer. The global marketing category leadership teams primarily focus on innovation as well as marketing efficiency and effectiveness. \nOur operating structure also includes Corporate, which consists of two components: (1) a center focusing on strategic initiatives, policy, governance and scaling global initiatives, and (2) a platform services organization supporting the operating units, global marketing category leadership teams and the center by providing efficient and scaled global services and capabilities, including, but not limited to, transactional work, data management, consumer analytics, digital commerce and social/digital hubs. \nThe Global Ventures operating segment was established primarily to oversee the Company’s ownership of Costa Limited (“Costa”), innocent and doğadan, as well as the fees earned pursuant to distribution coordination agreements between the Company and Monster Beverage Corporation (“Monster”). In November 2024, we announced plans to sunset our Global Ventures operating segment to streamline and simplify our current operating structure. Effective January 1, 2025, the results of our Costa (excluding the ready-to-drink business), innocent and doğadan businesses will report to the Company’s Europe, Middle East and Africa operating segment. Costa’s ready-to-drink business and the fees related to Monster will be the responsibility of the respective geographic operating segments. For additional information about our operating segments and Corporate, refer to Note 20 of Notes to Consolidated Financial Statements set forth in Part II, “Item 8. Financial Statements and Supplementary Data” of this report.\nExcept to the extent that differences among operating segments are material to an understanding of our business taken as a whole, the description of our business in this report is presented on a consolidated basis.\nProducts and Brands\nAs used in this report:\n•\n“concentrates” means flavorings and other ingredients which, when combined with water and, depending on the product, sweeteners (nutritive or non-nutritive) are used to prepare syrups or finished beverages, and includes powders/minerals for purified water products;\n•\n“syrups” means intermediate products in the beverage manufacturing process produced by combining concentrates with water and, depending on the product, sweeteners (nutritive or non-nutritive);\n•\n“fountain syrups” means syrups that are sold to fountain retailers, such as restaurants and convenience stores, which use dispensing equipment to mix the syrups with sparkling or still water at the time of purchase to produce finished beverages that are served in cups or glasses for immediate consumption;\n•\n“Company Trademark Beverages” means beverages bearing our trademarks and certain other beverages bearing trademarks licensed to us by third parties for which we provide marketing support and from the sale of which we derive an economic benefit; and\n•\n“Trademark Coca-Cola Beverages” or “Trademark Coca-Cola” means nonalcoholic beverages bearing the trademark Coca-Cola or any trademark that includes Coca-Cola or Coke (that is, Coca-Cola, Diet Coke/Coca-Cola Light and   Coca-Cola Zero Sugar and all their variations and any line extensions, including caffeine free Diet Coke, Cherry Coke, etc.). Likewise, when we use the capitalized word “Trademark” together with the name of one of our other beverage products (such as “Trademark Fanta,” “Trademark Sprite” or “Trademark Simply”), we mean nonalcoholic beverages bearing the indicated trademark (that is, Fanta, Sprite or Simply, respectively) and all its variations and line extensions (such that “Trademark Fanta” includes Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, etc.; \n3\n“Trademark Sprite” includes Sprite, Sprite Zero Sugar, etc.; and “Trademark Simply” includes Simply Orange, Simply Apple, Simply Grapefruit, etc.).\nOur Company operates in two lines of business: concentrate operations and finished product operations.\nOur concentrate operations typically generate net operating revenues by selling beverage concentrates, sometimes referred to as “beverage bases,” syrups, including fountain syrups, and certain finished beverages to authorized bottling operations (to which we typically refer as our “bottlers” or our “bottling partners”). Our bottling partners either combine concentrates with still or sparkling water and sweeteners (depending on the product), or combine syrups with still or sparkling water, to produce finished beverages. The finished beverages are packaged in authorized containers, such as cans and refillable and nonrefillable glass and plastic bottles, bearing our trademarks or trademarks licensed to us and are then sold to retailers directly or, in some cases, through wholesalers or other bottlers. In addition, outside the United States, our bottling partners are typically authorized to manufacture fountain syrups, using our concentrates, which they sell to fountain retailers for use in producing beverages for immediate consumption, or to authorized fountain wholesalers who in turn sell and distribute the fountain syrups to fountain retailers. Our concentrate operations are included in our geographic operating segments and our Global Ventures operating segment.\nOur finished product operations generate net operating revenues by selling sparkling soft drinks and a variety of other finished beverages to retailers, or to distributors and wholesalers who in turn sell the beverages to retailers. Generally, finished product operations generate higher net operating revenues but lower gross profit margins than concentrate operations. These operations consist primarily of our consolidated bottling and distribution operations, which are included in our Bottling Investments operating segment. In certain markets, the Company also operates non-bottling finished product operations in which we sell finished beverages to distributors and wholesalers that are generally not one of the Company’s bottling partners. These operations are generally included in one of our geographic operating segments or our Global Ventures operating segment. Additionally, we sell directly to consumers through retail stores operated by Costa. These sales are included in our Global Ventures operating segment. In the United States, we manufacture fountain syrups and sell them to fountain retailers, who use the fountain syrups to produce beverages for immediate consumption, or to authorized fountain wholesalers or bottling partners who in turn sell and distribute the fountain syrups to fountain retailers. These fountain syrup sales are included in our North America operating segment. \nFor information regarding net operating revenues and unit case volume related to our concentrate operations and finished product operations, refer to the heading “Our Business — General” set forth in Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this report.\nFor information regarding how we measure the volume of Company beverage products sold by the Company and our bottling partners (“Coca-Cola system”), refer to the heading “Operations Review — Beverage Volume” set forth in Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this report.\nWe own and market numerous valuable beverage brands, including the following:\n•\nsparkling soft drinks: Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Fanta, Fresca, Schweppes\n1\n, Sprite and Thums Up;\n•\nwater, sports, coffee and tea: Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Crystal, Dasani, doğadan, Fuze Tea, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, I LOHAS, Powerade and Topo Chico; and \n•\njuice, value-added dairy and plant-based beverages: Core Power, Del Valle, fairlife, innocent, Maaza, Minute Maid, Minute Maid Pulpy and Simply. \n1 \nSchweppes is owned by the Company in certain countries other than the United States.\nThe Company has also directly entered the alcohol beverage category in numerous markets outside the United States. In the United States, the Company has established a wholly owned, indirect, firewalled subsidiary, which uses third-party manufacturers and distributors to produce and sell alcohol products in certain regions of the United States and also authorizes alcohol-licensed third parties to use certain of our trademarks and related intellectual property on alcohol beverages that contain Company beverage bases. The Company’s approach in alcohol focuses on three segments of alcohol ready-to-drink beverages: pre-mixed cocktails (e.g., Jack Daniel’s & Coca-Cola), flavored alcohol beverages (e.g., Lemon-Dou) and hard seltzers (e.g., Topo Chico Hard Seltzer). \nIn addition to the beverage brands we own, we also provide marketing support and otherwise participate in the sales of other beverage brands through licenses, joint ventures and strategic relationships. For example, certain Coca-Cola system bottlers distribute certain brands of Monster, primarily Monster Energy, in designated territories in the United States, Canada and other international territories pursuant to distribution coordination agreements between the Company and Monster and related distribution agreements between Monster and Coca-Cola system bottlers.\n4\nConsumer demand determines the optimal menu of Company product offerings. Consumer demand can vary from one market to another and can change over time within a single market. Our Company continually seeks to further optimize its portfolio of brands, products and services in order to create and satisfy consumer demand in every market.\nDistribution System\nWe make our branded beverage products available to consumers in more than 200 countries and territories through our network of independent bottling partners, distributors, wholesalers and retailers as well as our consolidated bottling and distribution operations. Consumers enjoy finished beverage products bearing trademarks owned by or licensed to the Company at a rate of 2.2 billion servings each day. Our strong and stable bottling and distribution system helps us capture growth by manufacturing, distributing and selling existing, enhanced and new innovative products to consumers throughout the world.\nThe Coca-Cola system sold 33.7 billion and 33.3 billion unit cases of our products in 2024 and 2023, respectively. Sparkling soft drinks represented 69% of our worldwide unit case volume in both 2024 and 2023. Trademark Coca-Cola accounted for 47% of our worldwide unit case volume in both 2024 and 2023. In 2024, unit case volume in the United States represented 16% of the Company’s worldwide unit case volume. Of the U.S. unit case volume, 61% was attributable to sparkling soft drinks. Trademark Coca-Cola accounted for 42% of U.S. unit case volume. Unit case volume outside the United States represented 84% of the Company’s worldwide unit case volume in 2024. The countries outside the United States in which our unit case volumes were the largest were Mexico, China, Brazil and India, which together accounted for 33% of our worldwide unit case volume. Of the non-U.S. unit case volume, 71% was attributable to sparkling soft drinks. Trademark Coca-Cola accounted for 48% of non-U.S. unit case volume.\nOur five largest independent bottling partners based on unit case volume in 2024 were as follows:\n•\nCoca-Cola FEMSA, S.A.B. de C.V. (“Coca-Cola FEMSA”), which has bottling and distribution operations in\n \nMexico (a substantial part of central Mexico, as well as southeast and northeast Mexico), Guatemala, Colombia (most of the country), Nicaragua, Costa Rica, Panama, Venezuela, Uruguay, Brazil (a major part of the states of São Paulo and Minas Gerais; the states of Mato Grosso do Sul, Paraná, Rio Grande do Sul, and Santa Catarina; and part of the states of Goiás and Rio de Janeiro), and Argentina (federal capital of Buenos Aires and surrounding areas); \n•\nCoca-Cola Europacific Partners plc (“CCEP”), which has bottling and distribution operations in Andorra, Australia, Belgium, continental France, Germany, Great Britain, Iceland, Indonesia, Luxembourg, Monaco, the Netherlands, New Zealand and Pacific Islands, Norway, Papua New Guinea, the Philippines, Portugal, Spain and Sweden; \n•\nCoca-Cola HBC AG (“Coca-Cola Hellenic”), which has bottling and distribution operations in Armenia, Austria, Belarus, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, the Czech Republic, Egypt, Estonia, Greece, Hungary, Italy, Latvia, Lithuania, Moldova, Montenegro, Nigeria, North Macedonia, Northern Ireland, Poland, the Republic of Ireland, Romania, Russia, Serbia, Slovakia, Slovenia, Switzerland and Ukraine;\n•\nArca Continental, S.A.B. de C.V., which has bottling and distribution operations in northern and western Mexico, northern Argentina, Ecuador, Peru, and the state of Texas and part of the states of New Mexico, Oklahoma and Arkansas in the United States; and\n•\nSwire Coca-Cola Limited, which has bottling and distribution operations in 11 provinces and the Shanghai municipality in mainland China, Hong Kong, Taiwan, Cambodia, Laos, Thailand, Vietnam and territories in 13 states in the western United States.\nIn 2024, these five bottling partners combined represented 44% of our total worldwide unit case volume.\nBeing a bottler does not create a legal partnership or joint venture between us and our bottlers. Our bottlers are independent contractors and are not our agents.\nBottler’s Agreements\nWe have separate contracts, to which we generally refer as “bottler’s agreements,” with our bottling partners under which our bottling partners are granted certain authorizations by us. Subject to specified terms and conditions and certain variations, the bottler’s agreements generally authorize the bottlers to prepare, package, distribute and sell Company Trademark Beverages in authorized containers in (but, subject to applicable local law, generally only in) an identified territory. The bottler is obligated to purchase its entire requirement of concentrates or syrups for the designated Company Trademark Beverages from the Company or Company-authorized suppliers. We typically agree to refrain from selling or distributing, or from authorizing third parties to sell or distribute, the designated Company Trademark Beverages throughout the identified territory in the particular authorized containers. However, we typically reserve for us or our designee the right (1) to prepare and package such Company Trademark Beverages in such containers in the territory for sale outside the territory; (2) to prepare, package, distribute and sell such Company Trademark Beverages in the territory in any other manner or form (territorial restrictions on bottlers vary in some cases in accordance with local law); and (3) to handle certain key accounts (accounts that cover multiple territories).\n5\nWhile under most of our bottler’s agreements we generally have complete flexibility to determine the price and other terms of sale of the concentrates and syrups we sell to our bottlers, as a practical matter, our Company’s ability to exercise its contractual flexibility to determine the price and other terms of sale of concentrates and syrups is subject, both outside and within the United States, to competitive market conditions. However, in an effort to allow our Company and our bottling partners to grow together through shared value, aligned financial objectives and the flexibility necessary to meet consumers’ always changing needs and tastes, we have implemented an incidence-based concentrate pricing model in most markets. Under this model, the concentrate price we charge is impacted by a number of factors, including, but not limited to, bottler pricing, the channels in which the finished products produced from the concentrates are sold, and package mix. \nAs further discussed below, our bottler’s agreements for territories outside the United States differ in some respects from our bottler’s agreements for territories within the United States. \nBottler’s Agreements Outside the United States\nBottler’s agreements between us and our authorized bottlers outside the United States generally are of stated duration, subject in some cases to possible extensions or renewals. Generally, these bottler’s agreements are subject to termination by the Company following the occurrence of certain designated events, including defined events of default and certain changes in ownership or control of the bottlers. Most of the bottler’s agreements in force between us and bottlers outside the United States authorize the bottlers to manufacture and distribute fountain syrups, usually on a nonexclusive basis.\nIn certain parts of the world outside the United States, we have not granted comprehensive beverage production and distribution rights to the bottlers. In such instances, we have authorized certain bottlers to (1) prepare and package Company Trademark Beverages for sale to other bottlers or (2) purchase Company Trademark Beverages from other bottlers for sale and distribution throughout their respective designated territories, often on a nonexclusive basis.\nBottler’s Agreements Within the United States\nIn the United States, most bottlers operate under a contract to which we generally refer as a “Comprehensive Beverage Agreement” (“CBA”) that is of stated duration, subject in most cases to renewal rights of bottlers and in some cases to renewal rights of the Company. A small number of bottlers continue to operate under legacy bottler’s agreements with no stated expiration date for Trademark Coca-Cola Beverages and other cola-flavored Company Trademark Beverages. In all instances, the bottler’s agreements in the United States are subject to termination by the Company for nonperformance or upon the occurrence of certain defined events of default that may vary from contract to contract.\nCertain U.S. bottlers have been granted certain additional exclusive territory rights for the distribution, promotion, marketing and sale of Company-owned and licensed beverage brands (as defined by the CBAs). We refer to these bottlers as “expanding participating bottlers” or “EPBs.” EPBs operate under CBAs (“EPB CBAs”) under which the Company generally retained the rights to produce the applicable beverage products for territories not covered by specific manufacturing agreements, and such bottlers purchase from the Company (or from Company-authorized manufacturing bottlers) substantially all of the finished beverage products needed in order to service the customers in these territories. Each EPB CBA has a term of 10 years and is renewable, in most cases by the bottler, and in some cases by the Company, indefinitely for successive additional terms of      10 years each and includes additional requirements that provide for, among other things, a binding national governance model, mandatory incidence pricing and certain core performance requirements. The Company has also entered into manufacturing agreements that authorize certain EPBs that have executed EPB CBAs to manufacture certain beverage products for their own account and for supply to other bottlers. \nIn addition, certain U.S. bottlers that were not granted additional exclusive territory rights, which we refer to as “participating bottlers,” converted their legacy bottler’s agreements to CBAs, to which we refer as “participating bottler CBAs,” each of which has a term of 10 years, is renewable by the bottler indefinitely for successive additional terms of 10 years each, and is substantially similar in most material respects to the EPB CBAs, including with respect to requirements for a binding national governance model and mandatory incidence pricing, but includes core performance requirements that vary in certain respects from those in the EPB CBAs.\nThose bottlers that have not signed CBAs continue to operate under legacy bottler’s agreements that include pricing formulas that generally provide for a baseline price for Trademark Coca-Cola Beverages and other cola-flavored Company Trademark Beverages. This baseline price may be adjusted periodically by the Company, up to a maximum indexed ceiling price, and is adjusted quarterly based upon changes in certain sugar or sweetener prices, as applicable. The U.S. unit case volume prepared, packaged, sold and distributed under these legacy bottler’s agreements is not material.\nUnder the terms of the bottler’s agreements, bottlers in the United States generally are not authorized to manufacture fountain syrups. Rather, the Company manufactures and sells fountain syrups to authorized fountain wholesalers (including certain authorized bottlers) and some fountain retailers. These wholesalers in turn sell the syrups, or deliver them on our behalf, to restaurants and other retailers.\n6\nPromotional and Marketing Programs\nIn addition to conducting our own independent advertising and marketing activities, we may provide promotional and marketing support and/or funds to our bottlers. In most cases, we do this on a discretionary basis under the terms of commitment letters or agreements, even though we are not obligated to do so under the terms of the bottler’s agreements between our Company and the bottlers. Also, on a discretionary basis in most cases, our Company may develop and introduce new products, packages and equipment to assist the bottlers. Likewise, in many instances, we provide promotional and marketing support and/or funds and/or dispensing equipment and repair services to fountain and bottle/can retailers, typically pursuant to marketing agreements. \nInvestments in Bottling Operations\nMost of our branded beverage products are prepared, packaged, distributed and sold by independent bottling partners. However, from time to time we acquire or take control of a bottling operation, often in underperforming markets where we believe we can use our resources and expertise to improve performance. Owning a bottling operation enables us to compensate for limited local resources; help focus the bottler’s sales and marketing programs; assist in the development of the bottler’s business and information systems; and establish an appropriate capital structure for the bottler. In line with our long-term bottling strategy, we may periodically consider options for divesting or reducing our ownership interest in a consolidated bottling operation, typically by selling all or a portion of our interest in the bottling operation to an independent bottler to improve Coca-Cola system efficiency. When we sell a consolidated bottling operation to an independent bottling partner in which we have an equity method investment, our Company continues to participate in the bottler’s results of operations through our share of the equity method investee’s earnings or losses.\nIn addition, from time to time we make equity investments representing noncontrolling interests in certain bottling operations with the intention of maximizing the strength and efficiency of the Coca-Cola system’s production, marketing, sales and distribution capabilities around the world by providing expertise and resources to strengthen those businesses. These investments are intended to result in increases in unit case volume, net operating revenues and profits at the bottler level, which in turn generate increased sales for our Company’s concentrate operations. When our equity investment provides us with the ability to exercise significant influence over the investee bottler’s operating and financial policies, we account for the investment under the equity method.\nSeasonality\nSales of our ready-to-drink beverages are somewhat seasonal, with the second and third calendar quarters historically accounting for the highest sales volumes. The volume of sales in the beverage business may be affected by weather conditions.\nCompetition\nThe commercial beverage industry is highly competitive and consists of numerous companies, ranging from small or emerging to very large and well established. These include companies that, like our Company, compete globally in multiple geographic areas, as well as businesses that are primarily regional or local in operation. Competitive products include numerous nonalcoholic sparkling soft drinks; water products, including flavored and enhanced waters; juices, juice drinks and nectars; dilutables (including syrups and powders); coffees; teas; energy drinks; sports drinks; milk and other dairy-based drinks; plant-based beverages; functional beverages, including vitamin-based products and relaxation beverages; and various other nonalcoholic beverages. These competitive products are sold to consumers in both ready-to-drink and non-ready-to-drink form. The Company has directly entered the alcohol beverage category in numerous markets outside the United States. In the United States, the Company has established a wholly owned, indirect, firewalled subsidiary, which uses third-party manufacturers and distributors to produce and sell alcohol products in certain regions of the United States and also authorizes alcohol-licensed third parties to use certain of our trademarks and related intellectual property on alcohol beverages that contain Company beverage bases. Competitive products include all alcohol ready-to-drink beverages containing various alcohol bases. In many of the countries in which we do business, PepsiCo, Inc. is a primary competitor. Other significant competitors include, but are not limited to, Nestlé S.A., Keurig Dr Pepper Inc., Danone S.A., Suntory Beverage & Food Limited, Anheuser-Busch InBev, Kirin Holdings, Heineken N.V., Diageo plc and Red Bull GmbH. We also compete against numerous regional and local companies and, increasingly, against smaller companies that are developing microbrands and selling them directly to consumers through  e-commerce retailers and other e-commerce platforms. In addition, in some markets, we compete against retailers that have developed their own store or private-label beverage brands.\nCompetitive factors impacting our business include, but are not limited to, pricing, advertising, sales promotion programs,     in-store displays and point-of-sale marketing, digital marketing, product and ingredient innovation, availability, increased efficiency in production techniques, the introduction of new packaging as well as new vending and dispensing equipment, contracting with marketing assets (theaters, sports arenas, universities, etc.), and brand and trademark development and protection.\n7\nOur competitive strengths include leading brands with high levels of consumer recognition and loyalty; a worldwide network of bottlers and distributors of Company products; sophisticated marketing capabilities; and a talented group of dedicated employees. Our competitive challenges include strong competitors in all geographic regions; in many countries, a concentrated retail sector with powerful buyers able to freely choose among Company products, products of competitive beverage suppliers and individual retailers’ own store or private-label beverage brands; new industry entrants; and dramatic shifts in consumer shopping methods and patterns due to a rapidly evolving digital landscape.\nRaw Materials\nWe and our bottling partners use various ingredients in our business, such as sucrose, high fructose corn syrup (“HFCS”), aspartame, acesulfame potassium, sucralose, saccharin, cyclamate, steviol glycosides, ascorbic acid, citric acid, phosphoric acid, caffeine, caramel color and flavors; other raw materials such as orange and other fruit juices and juice concentrates, milk, coffee and tea; packaging materials such as polyethylene terephthalate (“PET”), bio-based PET and recycled PET for bottles; and aluminum cans, glass bottles and other containers. \nWater is a main ingredient in substantially all of our products. While historically we have not experienced significant water supply difficulties, water is a limited natural resource in many parts of the world, and our Company recognizes water availability, quality and sustainability, for both our operations and also the communities where we operate, as one of the key challenges facing our business.\nIn addition to water, the principal raw materials used in our business are nutritive and non-nutritive sweeteners. In the United States, the principal nutritive sweetener is HFCS, which is nutritionally equivalent to sugar. HFCS is available from numerous domestic sources and has historically been subject to fluctuations in its market price. Adverse weather conditions may affect the supply of agricultural commodities from which key ingredients for our products are derived. For example, drought conditions in certain parts of the United States or in other major corn-producing areas of the world may negatively affect the supply of corn, which in turn may result in shortages of and higher prices for HFCS. The principal nutritive sweetener used by our business outside the United States is sucrose (i.e., table sugar), which is also available from numerous sources and has historically been subject to fluctuations in its market price. Our Company generally has not experienced any difficulties in obtaining its requirements for nutritive sweeteners. In the United States, we purchase HFCS to meet our and our bottlers’ requirements with the assistance of Coca-Cola Bottlers’ Sales & Services Company LLC (“CCBSS”). CCBSS is a limited liability company that is owned by authorized Coca-Cola bottlers doing business in the United States and Canada. Among other things, CCBSS provides procurement services to our North American operations and to our U.S. and Canadian bottling partners for the purchase of various goods and services, including HFCS.\nThe principal non-nutritive sweeteners we use in our business are aspartame, acesulfame potassium, sucralose, saccharin, cyclamate and steviol glycosides. Generally, these raw materials are readily available from numerous sources. We purchase sucralose, which we consider a critical raw material, from suppliers mainly in the United States and also China. Our Company generally has not experienced major difficulties in obtaining its requirements for non-nutritive sweeteners. \nJuice and juice concentrate from various fruits, particularly orange juice and orange juice concentrate, are the principal raw materials for our juice and juice drink products. We source our orange juice and orange juice concentrate from Florida and the Southern Hemisphere (particularly Brazil). We work closely with Cutrale Citrus Juices U.S.A., Inc., our primary supplier of orange juice from Florida and Brazil, to ensure an adequate supply of orange juice and orange juice concentrate that meets our Company’s standards. However, the citrus industry is impacted by citrus greening disease and the variability of weather conditions that can affect the quality and supply of orange juice and orange juice concentrate. In particular, freezing weather or hurricanes in central Florida may result in shortages and higher prices for orange juice and orange juice concentrate throughout the industry. In addition, changing weather patterns are adversely affecting citrus production, contributing to challenges such as citrus greening disease and droughts, which have resulted in a reduced number of citrus trees and increased grower costs and prices.\nMilk is the principal raw material for our dairy products. We derive the majority of our dairy revenues through fairlife, LLC (“fairlife”), which purchases milk from dairy cooperatives that in turn source milk from farms within the cooperatives. While our sourcing for milk is currently concentrated among a few dairy cooperatives, we believe we have access to alternate suppliers, if necessary, to help deliver an adequate supply of milk.\nWe generate most of our coffee revenues through Costa. Costa purchases Rainforest Alliance Certified and other certified green coffee through multiple suppliers, enabling us to source from alternative suppliers as changing weather patterns impact yields in some geographies. Similarly, we procure tea from a diverse supplier base, which helps mitigate the effects of weather-related yield reductions in certain geographies.\nOur consolidated bottling operations and our non-bottling finished product operations also purchase various other raw materials, including, but not limited to, PET resin, preforms and bottles; glass and aluminum bottles; aluminum and steel cans; plastic closures; aseptic fiber packaging; labels; cartons; cases; postmix packaging; and beverage gases, including carbon \n8\ndioxide and liquid nitrogen. While we generally purchase these raw materials from multiple suppliers and historically have not experienced significant shortages, certain packaging materials, such as aluminum cans, are available from a limited number of suppliers. \nPatents, Copyrights, Trade Secrets and Trademarks\nOur Company owns numerous patents, copyrights, trade secrets and other know-how and technology, which we collectively refer to as “technology.” This technology generally relates to beverage products and the processes for their production; packages and packaging materials; design and operation of processes and equipment useful for our business; and certain software. Some of the technology is licensed to suppliers and other parties. Trade secrets are an important aspect of our technology, and our sparkling beverage and other beverage formulas are among the important trade secrets of our Company.\nWe also own numerous trademarks that are very important to our business. Depending upon the jurisdiction, trademarks are valid as long as they are in use and/or their registrations are properly maintained. Pursuant to our bottler’s agreements, we authorize our bottlers to use applicable Company trademarks in connection with their preparation, packaging, distribution and sale of Company products. In addition, we authorize certain third parties to use applicable Company trademarks in connection with their preparation, packaging, distribution and sale of beverages bearing Company trademarks in certain territories. We also grant licenses to third parties from time to time to use certain of our trademarks in conjunction with certain merchandise and food products. \nGovernmental Regulation\nOur Company is required to comply, and it is our policy to comply, with all applicable laws in the countries and territories throughout the world in which we do business. In many jurisdictions, our operations may come under special scrutiny by competition law authorities due to our competitive position in those jurisdictions.\nIn the United States, the safety, production, storage, transportation, distribution, advertising, marketing, labeling and sale of our Company’s products and their ingredients are subject to the Federal Food, Drug, and Cosmetic Act; the Federal Trade Commission Act; the Lanham Act; state consumer protection laws; various federal and state laws and regulations governing competition and trade practices, including the Robinson-Patman Act of 1936, as amended, and the Clayton Antitrust Act of 1914, as amended; federal, state and local workplace health and safety laws; various federal and state laws and regulations governing our employment practices, including those related to equal employment opportunity and compensation; various federal, state and local environmental protection laws; privacy and personal data protection laws; trade laws and regulations, including laws regarding the import or export of our products or ingredients used in our products and tariffs; and various other federal, state and local statutes and regulations. We are also required to comply with the Foreign Corrupt Practices Act and the Trade Sanctions Reform and Export Enhancement Act. Outside the United States, our business is subject to numerous similar statutes and regulations, as well as other legal and regulatory requirements and regulatory reviews.\nRegulators in the United States and abroad have been expressing concerns about processing and the use of particular ingredients or additives in beverage products. Various jurisdictions have adopted, and others may seek to adopt, bans or restrictions on the use of certain ingredients or substances in products, as well as significant additional product labeling or warning requirements or limitations on the marketing or sale of our products because of what they contain or allegations that they cause adverse health effects. If these types of requirements become applicable to one or more of our products under current or future environmental or health laws or regulations, they may inhibit sales of such products or make it necessary for us to reformulate certain of our products. Under the Safe Drinking Water and Toxic Enforcement Act of 1986 (“Proposition 65”) of the state of California, if the state has determined that a substance causes cancer or harms human reproduction or development, a warning must be provided for any product sold in the state that exposes consumers to that substance, unless the conditions of an exemption (described below) can be met. The state maintains lists of these substances and periodically adds other substances to these lists. The detection of even a trace amount of a listed substance can subject an affected product to the requirement of a warning label. However, Proposition 65 exempts a product from a warning if the manufacturer can demonstrate that the use of that product exposes consumers to a daily quantity of a listed substance that is:\n•\nbelow a “safe harbor” threshold that may be established;\n•\nnaturally occurring;\n•\nthe result of necessary cooking; or\n•\nsubject to another applicable exemption.\nOne or more substances that are currently on the Proposition 65 list can be detected in certain Company products at low levels that are safe. The Company maintains that the presence of each such substance in Company products is subject to an applicable exemption from the warning requirement or that the product is otherwise in compliance with Proposition 65. However, the state of California and other parties have in the past taken a contrary position and may do so in the future. Additionally, the state of California may include other substances on the Proposition 65 list in the future. \n9\nBottlers of our beverage products presently offer, among other beverage containers, nonrefillable recyclable containers in the United States and various other markets around the world. Some of these bottlers also offer and use refillable containers, which are also recyclable. Legal requirements apply in various jurisdictions in the United States and elsewhere around the world requiring that deposits or certain ecotaxes or fees be charged in connection with the sale, marketing and use of certain beverage containers. The precise requirements imposed by these measures vary. Other types of statutes and regulations relating to beverage container deposits, recycling, ecotaxes, extended producer responsibility and/or restrictions or bans on the use of certain types of packaging, including certain packaging containing per- and polyfluoroalkyl substances (“PFAS”), also apply in various jurisdictions in the United States and elsewhere around the world. We anticipate that additional such legal requirements may be proposed or enacted in the future at federal, state and local levels, both in the United States and elsewhere around the world.\nAll of our Company’s facilities and other operations in the United States and elsewhere around the world are subject to various environmental protection statutes and regulations, including those relating to the use and treatment of water resources, discharge of wastewater and air emissions. In addition, increasing concern over climate change is expected to continue to result in additional legal or regulatory requirements (both inside and outside the United States) designed to reduce or mitigate the effects of carbon dioxide and other greenhouse gas emissions on the environment, to discourage the use of plastic materials, to limit or impose additional costs on commercial water use due to local water scarcity concerns, or to expand disclosure of certain sustainability metrics. Our policy is to comply with all such legal requirements. We have made, and plan on continuing to make, expenditures necessary to comply with applicable environmental laws and regulations and that aim to make progress toward achieving our sustainability goals. While compliance has not had a material adverse effect on our Company’s capital expenditures, net income or competitive position to date, changes in environmental compliance requirements along with expenditures necessary to comply with such requirements or that aim to make progress toward achieving our sustainability goals could adversely affect our financial performance. \nWe are also subject to various federal, state and international laws and regulations related to cybersecurity, privacy and data protection, including the European Union’s General Data Protection Regulation, China’s Personal Information Protection Law and the California Consumer Privacy Act of 2018 (“CCPA”), which became effective on January 1, 2020, as amended by the California Privacy Rights Act (“CPRA”), which became effective on January 1, 2023. In addition to California, at least 18 other states in the United States have passed comprehensive privacy laws similar to the CCPA and the CPRA. These laws are either in effect or will go into effect during 2025 or in the future, and we expect other states to consider adopting similar laws in the future. Like the CCPA and the CPRA, these laws create, or are expected to create, obligations related to the processing of personal information, as well as special obligations for the processing of “sensitive” data. Some of the provisions of these laws may apply to our business activities. The U.S. Congress has also considered legislation relating to data privacy and data protection, and the U.S. federal government may in the future pass such legislation. The interpretation and application of privacy, data protection and data residency laws are often uncertain and are expanding in the United States and internationally, including in the European Union, Brazil, China and other jurisdictions. We monitor pending and proposed legislation and regulatory initiatives to ascertain their relevance to and potential impact on our business, and we develop strategies to address regulatory trends and developments, including any required changes to our privacy and data protection compliance programs and policies. Globally, we see a trend toward data protection laws and regulations increasing in complexity and number, and we anticipate that our obligations will expand commensurately. As a result, our ability to maximize the utility of our data could be impacted and we may need to modify our practices to accommodate legal and regulatory constraints and obligations or meet consumer expectations.\nFor additional information, refer to Part I, “Item IA. Risk Factors” of this report.\nHuman Capital Management\nOur people and culture strategies are critical business priorities. The board of directors of the Company (“Board of Directors”), through the Talent and Compensation Committee, provides oversight of the Company’s policies and strategies relating to talent, leadership and culture, and the Company’s compensation philosophy and programs. The Talent and Compensation Committee also evaluates and approves the Company’s compensation plans, policies and programs applicable to our senior executives. In addition, the Corporate Governance and Sustainability Committee of our Board of Directors oversees succession planning and talent development for our senior executives. \nWe believe people are our most important asset, and we strive to attract and retain high-performing talent. As of December 31, 2024 and 2023, our Company had approximately 69,700 and 79,100 employees, respectively, of which approximately 8,900 and 9,000, respectively, were located in the United States. The decrease in the total number of employees was primarily due to 2024 refranchising activity. Our Company, through its divisions and subsidiaries, is a party to numerous collective bargaining agreements. As of December 31, 2024, approximately 400 employees in North America were covered by collective bargaining \n10\nagreements. These agreements typically have terms of three to five years. We currently anticipate that we will continue to successfully negotiate such agreements with representatives of our bargained-for employees. \nOur diverse, high-performing global employee base helps drive a culture of inclusion, innovation and growth. We aspire to develop a global workforce with diverse perspectives, experiences and backgrounds that reflect the broad range of consumers and markets we serve around the world; we aim to enable an inclusive culture where all employees thrive; and we are focused on providing access to equal opportunities and fostering belonging both in our workplaces and the local communities we proudly serve. We believe that these efforts are critical to the Company’s continued growth and success. \nWe support many employee-led inclusion networks around the world. Our inclusion networks are open to all employees and are regionally structured to meet relevant local needs. They provide employees with the opportunity to engage with colleagues around the world and foster relationships based on common interests or backgrounds. \nThrough our comprehensive global talent and development programs, we continuously invest in our talent for growth in our networked organization. We believe in providing challenging and diverse experiences and opportunities to our people to help them develop and grow. \nOur global career strategy program, called Thrive, is designed to provide clarity to employees on what it means to have a career at the Company. Through our people-centered approach, we strive to create an integrated, streamlined and inspiring career experience. We believe that development is anchored in acquiring skills and work experiences. We focus on investing in inspirational leadership, capability development, and providing learning opportunities to equip our global workforce with the skills they need for the future and to improve employee engagement and retention. We provide a range of formal and informal learning and leadership development programs, which are designed to help all of our employees continuously grow and strengthen their skills throughout their careers. We provide online learning through a robust catalog of digital content as well as experiential learning opportunities, and we are continually identifying opportunities to provide access to capability development content for all of our employees. We also have Thrive Opportunity Marketplace, a technology solution that helps connect project opportunities to interested employees who have the capacity, skills and interest in short-term experiences and assignments. Additionally, we offer comprehensive Company-wide onboarding, coaching and mentoring programs that support leadership and employee development at all levels in our organization.\nWe also believe that talent thrives in a growth-oriented environment where high performance and leadership effectiveness are valued. Our talent practices rely on data and feedback from multiple sources to help our employees get the transparent and timely feedback they need to be successful.\nThrough comprehensive and competitive compensation and benefits, ongoing employee learning and development, and a focus on health and well-being, we strive to support our employees in all aspects of their lives. Our compensation programs are designed to reinforce our growth agenda and our talent strategy as well as to drive a strong connection between the contributions of our employees and their pay. We review our compensation programs regularly to help ensure fairness, including conducting pay equity analyses. \nWe believe our compensation packages provide the appropriate incentives to attract, retain and motivate our employees. We provide base pay that is competitive and that aligns with employee positions, skill levels, experience and geographic location. In addition to base pay, we seek to reward employees, based on performance, with annual incentive awards, recognition programs and equity awards for employees at certain job levels. \nWe also offer competitive employee benefits packages, which vary by country and region, and our benefits strategy includes establishing global minimum standards that we aim to apply consistently across the world. These employee benefits packages may include a 401(k) plan, pension plan, core and supplemental life insurance, financial courses and advisors, employee assistance programs, tuition assistance, commuter assistance, adoption assistance, \nmedical and dental insurance, vision insurance, health savings accounts, health reimbursement and flexible spending accounts, well-being rewards programs, \nvacation pay, holiday pay, and parental and adoption leave\n.\nAs our employees work together to achieve our purpose to refresh the world and make a difference, they collectively build and reinforce our culture. Our culture is rooted in our growth mindset, which expects each employee, leader and function to be curious, empowered, inclusive and agile. We use a variety of practices to measure and support progress against these growth behaviors and to ensure that our employees are engaged and fulfilled at work. For example, our Performance Enablement and Culture & Engagement Survey platforms provide regular opportunities for employees across the organization to provide feedback on how their leaders, teammates and work experiences support the growth behaviors. Data from questionnaires are anonymized and plotted against historical results to inform teams and functions on areas of strength and opportunities for improvement. We also encourage regular, live communication across the organization and host quarterly global town halls with our senior leadership that include employee question-and-answer sessions. In addition, function-level town halls are held on a regular basis. \n11\nAvailable Information\nThe Company maintains a website at the following address: www.coca-colacompany.com. The information on the Company’s website is not incorporated by reference in this report. We make available on or through our website certain reports and amendments to those reports that we file with or furnish to the Securities and Exchange Commission (“SEC”) in accordance with the Securities Exchange Act of 1934, as amended (“Exchange Act”). These include our Annual Reports on Form 10-K, our Quarterly Reports on Form 10-Q and our Current Reports on Form 8-K. We make this information available on our website free of charge as soon as reasonably practicable after we electronically file the information with, or furnish it to, the SEC. In addition, we routinely post on the “Investors” page of our website news releases, announcements and other statements about our business and results of operations. We may use the “Investors” page of our website as a means of disclosing material, non-public information and to comply with our disclosure obligations under Regulation FD. Therefore, we encourage investors to monitor the “Investors” page of our website and review the information we post on that page. \nThe SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at the following address: http://www.sec.gov.",
    "item1a": "Item 1A. Risk Factors.”\nCybersecurity Governance and Oversight\nThe Company’s cybersecurity risk management program is supervised by our CISO, who reports directly to the Company’s Chief Information Officer (“CIO”). The CISO and his team are responsible for leading enterprise-wide cybersecurity strategy, policy, standards, architecture and processes.\n \nOur current CISO received his Master of Business Administration degree from Columbia University and has over 25 years of cybersecurity experience, including relevant prior senior leadership positions held with three other large companies.\nThe CISO chairs the Company’s Cybersecurity Oversight Council, a cross-functional management committee that drives awareness, ownership and alignment across broad governance and risk stakeholder groups for effective cybersecurity risk management. The Cybersecurity Oversight Council is sponsored by the Company’s Global General Counsel and CIO and is composed of senior leaders from our privacy, legal, information technology, cybersecurity, internal audit, and global security and asset protection functions, among others. Subject matter experts are also invited, as appropriate. The Cybersecurity Oversight Council meets at least quarterly and has responsibility for oversight and validation of the Company’s cybersecurity strategic direction, risks, threats and priorities. The Cybersecurity Oversight Council acts in alignment with the Company’s Risk Steering Committee, another cross-functional management committee, which provides strategic direction and oversight over the Company’s ERM program.\n The CISO and his team are informed about and monitor the prevention, detection, mitigation and remediation of cybersecurity incidents in accordance with the Company’s cyber incident response plan.\nThe Audit Committee of the Board of Directors is charged with oversight of cybersecurity matters and receives regular reports from the CISO and the CIO\n on, among other things, the Company’s cyber risks and threats, the status of projects to strengthen the Company’s information security systems, assessments of the Company’s security program and the emerging threat landscape.\n \nIn accordance with our cybersecurity incident response plan, the Audit Committee is promptly informed by management of cybersecurity incidents with the potential to materially adversely affect the Company or its information systems and is regularly updated about incidents with lesser impact potential. The Chair of the Audit Committee regularly briefs the full Board on these matters. In addition, the Board also periodically receives cybersecurity updates directly from management.\n \nIn an effort to detect and defend against cybersecurity threats, the Company annually provides its employees with various cybersecurity and data protection training programs. These programs cover timely and relevant topics, including social engineering, phishing, deep fakes, password protection, confidential data protection, asset use and mobile security, and educate employees on the importance of reporting all incidents promptly to the Company’s centrally managed cyber defense and security operations.",
    "item1b": "ITEM 1B.  UNRESOLVED STAFF COMMENTS\nNot applicable.",
    "item1c": "ITEM 1C.  CYBERSECURITY\nCybersecurity Risk Management and Strategy\nWe face various cybersecurity risks, including, but not limited to, risks related to unauthorized access, misuse, data theft, computer viruses, system disruptions, ransomware, malicious software and other intrusions. We utilize a multilayered, proactive approach to identify, evaluate, mitigate and prevent potential cybersecurity and information security threats through our cybersecurity risk management program. \nOur cybersecurity risk management program is integrated into our broader Enterprise Risk Management (“ERM”) program\n, which is designed to identify, assess, prioritize and mitigate risks across the organization to enhance our resilience and support the achievement of our strategic objectives. This integrated approach helps ensure that cyber risks are not viewed in isolation, but are assessed, prioritized and managed in alignment with the Company’s operational, financial and strategic risks, assisting the Company in more effectively managing interdependencies among risks and enhancing risk mitigation strategies.\nWe devote significant resources to protecting the security of our computer systems, software, networks and other technology assets. Our efforts are designed to adapt with the evolution of information security risks and appropriate best practices and include physical, administrative and technical safeguards. Our practices are generally developed from, and benchmarked against, recognized cybersecurity frameworks, such as the National Institute of Standards and Technology Cybersecurity Framework. Our acquired businesses and consolidated bottling operations maintain separate cybersecurity systems and environments that may differ in scope and complexity from our own. However, for all consolidated entities, our cybersecurity risk management program is designed to help coordinate the Company’s identification of, response to and recovery from, cybersecurity incidents and includes processes to triage, assess the severity of, escalate, contain, investigate and remediate incidents, as well as to comply with applicable legal obligations. \nOur internal audit team assesses the effectiveness of our internal controls relating to cybersecurity. Our management team also engages certain outside advisors and consultants to assist in the identification, oversight, evaluation and management of cybersecurity risks on a regular basis, as well as to advise on specific topics. For example, we conduct tests that help discover potential vulnerabilities, including external penetration testing and tabletop and other exercises, to evaluate our core information systems and cybersecurity practices that enable improved decision-making and prioritization, as well as to promote monitoring and reporting across compliance functions.\n As part of our overall risk mitigation strategy, the Company also maintains cybersecurity insurance coverage; however, such insurance may not be sufficient in type or amount to cover us against claims related to security breaches, cyberattacks and other related incidents.\nIn order to oversee and identify risks from cyb\nersecurity threats associated with the Company’s independent bottling partners, distributors, wholesalers, retailers and other business partners, as well as our use of third-party service providers, we maintain a \n26\nthird-party risk management program designed to help protect against the misuse of information technology. We have various processes and procedures to evaluate cybersecurity threats associated with third parties, including requiring key third-party service providers to complete initial and periodic security assessments. In addition, our Global Chief Information Security Officer (“CISO”) and other senior leaders regularly meet with key bottling partners to discuss cybersecurity risks and mitigation programs in order to advance risk management capabilities and proactively share cybersecurity guidelines and best practices.\n \nWe do not believe that there are currently any risks from known cybersecurity threats that have materially affected or are reasonably likely to materially affect the Company, including our business strategy, results of operations, or financial condition.\n However, we have been the target of cyberattacks and expect them to continue as cybersecurity threats have been rapidly evolving in sophistication and becoming more prevalent in the industry. We cannot eliminate all risks from cybersecurity threats or provide assurances that we have not experienced an undetected cybersecurity incident in the past or that we will not experience such an incident in the future. For more information on the risks from cybersecurity threats that we face, refer to  Part I, “"
  }
}