{
  "ticker": "KR",
  "cik": "0000056873",
  "company_name": "KROGER CO",
  "filing_date": "2025-04-01",
  "accession": "0001558370-25-004267",
  "primary_doc": "kr-20250201x10k.htm",
  "item_sections": {
    "item1": "ITEM 1.\nBUSINESS.\n​\nThe Kroger Co. (the “Company” or “Kroger”) was founded in 1883 and incorporated in 1902. Our Company is built on the foundation of our retail grocery business, which includes the added convenience of our retail pharmacies and fuel centers. Our strategy is focused on growing households and increasing customer loyalty by delivering great value and convenience, and investing in four strategic pillars: Fresh, \nOur Brands\n, Data & Personalization and Seamless. \n​\nWe utilize the data and traffic generated by our retail business to create personalized experiences and value for our customers. This data and traffic also enables our fast-growing, high operating margin alternative profit business, including data and analytic services and third-party media revenue. In turn, the value generated from these businesses enables us to reinvest back into our retail business. \n​\nOur revenues are predominately earned and cash is generated as consumer products are sold to customers in our stores, fuel centers and via our online platforms. We earn income predominately by selling products at price levels that produce revenues in excess of the costs we incur to make these products available to our customers. Such costs include procurement and distribution costs, facility occupancy and operational costs, and overhead expenses. Our fiscal year ends on the Saturday closest to January 31. All references to 2024, 2023 and 2022 are to the fiscal years ended February 1, 2025, February 3, 2024 and January 28, 2023, respectively, unless specifically indicated otherwise.\n​\nWe maintain a web site (www.thekrogerco.com) that includes additional information about the Company. Kroger’s website and any reports or other information made available by Kroger through its website are not part of or incorporated by reference into this Annual Report on Form 10-K. We make available through our web site, free of charge, our annual reports on Form 10-K, our quarterly reports on Form 10-Q, our current reports on Form 8-K and our interactive data files, including amendments. These forms are available as soon as reasonably practicable after we have filed them with, or furnished them electronically to, the Securities and Exchange Commission (SEC), and are also available at www.sec.gov.\n​\nKroger is diversified across brands, product categories, channels of distribution, geographies and consumer demographics. Our combination of assets includes the following:\n​\nStores\n​\nAs of February 1, 2025, Kroger operates supermarkets under a variety of local banner names in 35 states and the District of Columbia. As of February 1, 2025, Kroger operated, either directly or through its subsidiaries, 2,731 supermarkets, of which 2,273 had pharmacies and 1,702 had fuel centers. Approximately 51% of our supermarkets were operated in Company-owned facilities, including some Company-owned buildings on leased land. Our stores operate under a variety of banners that have strong local ties and brand recognition. We connect with customers through our expanding seamless ecosystem and the consistent delivery of a full, fresh, and friendly customer experience. \nFuel sales are an important part of our revenue, net earnings and loyalty offering. \nOur fuel strategy is to include a fuel center at each of our supermarket locations when it is feasible and it is expected to be profitable. \nEach fuel center typically includes five to ten islands of fuel dispensers and storage tanks with capacity for 40,000 to 50,000 gallons of fuel. \nSupermarkets are generally operated under one of the following formats: combination food and drug stores (“combo stores”); multi-department stores; marketplace stores; or price impact warehouses.\n​\n3\n\n\nThe combo store is the primary grocery store format. We believe this format is successful because the stores are large enough to offer the specialty departments, including natural food and organic sections, pharmacies, general merchandise, pet centers and high-quality perishables such as fresh seafood and organic produce.\n​\nMulti-department stores are significantly larger in size than combo stores. In addition to the departments offered at a typical combo store, multi-department stores sell a wide selection of general merchandise items such as apparel, home fashion and furnishings, outdoor living, electronics, automotive products and toys.\n​\nMarketplace stores are smaller in size than multi-department stores. They offer full-service grocery, pharmacy and health and beauty care departments as well as an expanded perishable offering and general merchandise area that includes apparel, home goods and toys.\n​\nPrice impact warehouse stores offer a “no-frills, low cost” warehouse format and feature everyday low prices plus promotions for a wide selection of grocery and health and beauty care items. Quality meat, dairy, baked goods and fresh produce items provide strategic differentiation for price impact warehouse stores. The average size of a price impact warehouse store is similar to that of a combo store.\n​\nSeamless Digital Ecosystem\n​\nWe offer a convenient shopping experience for our customers regardless of how they choose to shop with us, including Pickup, Delivery and Ship. We offer Pickup and Harris Teeter ExpressLane™ — personalized, order online, pick up at the store services — at 2,412 of our supermarkets and provide Delivery, which allows us to offer digital solutions to substantially all of our customers. Our Delivery solutions include orders delivered to customers from retail store locations, customer fulfillment centers and orders placed through third-party platforms. These channels allow us to serve customers anything, anytime and anywhere with zero compromise on selection, convenience, and price. We also provide relevant customer-facing apps and interfaces that have the features customers want that are also reliable, easy to use and deliver a seamless customer experience across our store and digital channels.\n​\nMerchandising and Manufacturing\n​\nOur Brands \nproducts play an important role in our merchandising strategy and represented over $32 billion of our sales in 2024. Our supermarkets, on average, stock over 12,000 private label items. \nOur Brands \nproducts are primarily produced and sold in three “tiers.” Private Selection® is our main premium quality brand, offering customers culinary foods and ingredients that deliver amazing eating experiences. The Kroger® brand, which represents the majority of our private label items, is designed to consistently satisfy and delight customers with quality products that exceed or meet the national brand in taste and efficacy, as well as with unique and differentiated products. Big K®, Smart Way® and Heritage Farm® are some of our value brands, designed to deliver good quality at a very affordable price. In addition to our three “tiers,” \nOur Brands\n offers customers a variety of natural and organic products with Simple Truth® and Simple Truth Organic®. Both Simple Truth® and Simple Truth Organic® are free from a defined list of artificial ingredients that some customers have told us they do not want in their food, and the Simple Truth Organic products are USDA certified organic.\n​\nApproximately 31% of \nOur Brands\n units sold in our supermarkets are produced in our food production plants; the remaining \nOur Brands\n items are produced to our strict specifications by outside manufacturers. We perform a “make or buy” analysis on \nOur Brands\n products and decisions are based upon a comparison of market-based transfer prices versus open market purchases. As of February 1, 2025, we owned 33 food production plants. These plants consisted of 14 dairies, nine deli or bakery plants, five grocery product plants, two beverage plants, one meat plant and two cheese plants.\n​\n4\n\n\nOur Data\n​\nThe traffic and data generated by our retail business, including pharmacies and fuel centers, enables our diverse business. Kroger serves approximately 63 million households annually and because of our rewards program, over 95% of customer transactions are tethered to a Kroger loyalty card. Our over 20 years of investment in data science capabilities allows us to utilize this data to create personalized experiences and value for our customers and enables our growing, high operating margin alternative profit businesses, including data analytic services and third-party media revenue. Our retail media business – Kroger Precision Marketing – provides differentiated media capabilities for our consumer packaged goods partners and other industry verticals. It is a key driver of our digital profitability and alternative profit.\n​\nSEASONALITY\n​\nThe majority of our revenues are generally not seasonal in nature. However, revenues tend to be higher during the major holidays throughout the year. Additionally, certain significant events including inclement weather systems, particularly winter storms, tend to affect our sales trends.\n​\nHUMAN CAPITAL MANAGEMENT\n​\nOur People \n​\nWe want Kroger to be a place where our customers love to shop and associates love to work. This is why we aim to create working environments where associates feel encouraged and supported to be their best selves every day. As of February 1, 2025, Kroger employed over 409,000 full- and part-time employees. Our people are essential to our success, and we focus intentionally on attracting, developing and engaging a diverse workforce that represents the communities we serve. We strive to create a culture of opportunity and take seriously our role as a leading employer in the United States. Kroger has provided a large number of people with first jobs, new beginnings and lifelong careers. We have long been guided by our values – Honesty, Integrity, Respect, Safety, Diversity and Inclusion.\n​\nAttracting & Developing Our Talent\n​\nTo deliver on our customers’ experiences and remain competitive with union and non-union employers, we continually try to improve how we attract and retain talent. In addition to competitive wages, quality benefits and a safe work environment, we offer a broad range of employment opportunities for workers of all ages and aspirations. Many retail roles offer opportunities to learn new skills, where new associates come for a job, and discover a career.\n​\nAssociates at all levels of Kroger have access to training and education programs to build their skills and prepare for the roles they want. In 2024, we spent approximately $192 million on training our associates through onboarding, leadership development programs and programs designed to upskill associates across the Company. We continue to invest in new platforms and applications to make learning more accessible to our associates. \n​\nBeyond our own training programs, associates can take advantage of our tuition reimbursement benefit, which offers up to $3,500 annually — $21,000 over the course of employment — toward continuing education. These funds can be applied to education programs like certifications, associate or graduate degrees. Approximately 5,500 associates, 89% of whom are hourly, have taken advantage of our tuition reimbursement program in 2024. Kroger has invested approximately $64 million in this program since it launched in 2018.\n​\n5\n\n\nRewarding Our Associates\n​\nAs we continue to operate in a challenging labor market, we are dedicated to attracting and retaining the right talent across the organization to be able to continue delivering for our customers. We are investing in our associates by expanding our industry-leading benefits, including continuing education, training and development and health and wellness. During 2024, we increased associate wages resulting in an average hourly rate of more than $19, and a rate of more than $25 with comprehensive benefits factored in, which is a 38% increase in rate in the last seven years. Over the last five years, we have now invested more than $2.7 billion in incremental wage investments. We remain committed to supporting our associates with investments in wages and comprehensive benefits that are sustainable and will allow us to continue to keep products affordable for the communities we serve. We expect to make continued associate investments in 2025. \n​\nCreating a Safe Environment\n​\nOur associates’ safety is a top priority. It is also one of our core values. We prioritize providing the right safety training and equipment, safe working conditions and resources to maintain and improve associates’ well-being. Through our strategy to set clear expectations, routine monitoring, and regular communication and engagement, we reduce the number of injuries and accidents that happen in our workplace. We track health and safety metrics centrally for an enterprise-wide view of issues, trends and opportunities and monitor associate injury performance including total injuries, Occupational Safety and Health Administration (“OSHA”) injury rates, and lost-time injuries, as well as customer injury metrics like slip-and-fall injuries. We also track the completion of required training for associates, and we regularly share these metrics with leaders and relevant team members to inform management decisions.\n​\nSupporting Labor Relations\n​\nA majority of our employees are covered by collective bargaining agreements negotiated with local unions affiliated with one of several different international unions. There are approximately 350 such agreements, usually with terms of three to five years. Wages, health care and pensions are included in all of these collective bargaining agreements that cover approximately 64% of our associates. Our objective is to negotiate contracts that balance wage increases that are competitive with union and non-union employers and provide affordable healthcare for associates with keeping groceries affordable for the communities we serve. Our obligation is to do this in a way that maintains a financially sustainable business.\n​\nCLIMATE RESILIENCIES\n​\nManaging greenhouse gas emissions to reduce our impact on the environment is an important part of Thriving Together, our responsible business strategy, and has been a focus for our business for many years. With a large portfolio of supermarkets, distribution warehouses, and food production plants, as well as a complex supply chain, we continue to take steps to reduce both the effects of our operations on the environment and the potential effects of a changing climate on our operations. \n​\nTo help identify and manage climate-related risks to our business, we conducted a quantitative climate risk assessment to determine the likelihood that different physical climate risks, including drought, extreme heat and extreme precipitation, would affect our operations at representative facilities in different geographies and, in turn, potentially increase operating costs for these facilities. As a result of our risk assessments, we do not currently anticipate the modeled physical risks to adversely affect our financial condition, results of operations or cash flows for the foreseeable future. We plan to update these climate risk assessments moving forward as needed.\n​\nWe also acknowledge that climate-related legislation could affect our business. As a result of current state and federal requirements regarding the phasedown of hydrofluorocarbon (“HFC”) refrigerants, we anticipate steadily replacing our refrigerant infrastructure to reach required levels, which could incur significant costs to the business. Any such legislation will affect all retailers using refrigerants in their operations. We also monitor utility and technology availability and costs to help anticipate how these could affect our business operations in the future.\n​\n6\n\n\nTo help prepare for and manage a variety of risk scenarios, including natural disasters and business disruptions to our supply chain, we maintain more than 200 business continuity plans. We have installed technologies and processes to ensure our supermarkets, food production plants, fulfillment centers and supply chain can respond quickly and remain operational to serve our customers.\n​\nThis topic is managed by leadership with input from several departments across the business. The Public Responsibilities Committee of the Board of Directors oversees our responsibilities as a responsible business and our practices related to environmental sustainability, including potential climate effects, along with other environmental and social topics of material importance.\n​\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\n​\nThe following is a list of the names and ages of the executive officers and the positions held by each such person as of March 21, 2025. Except as otherwise noted, each person has held office for at least five years. Each officer will hold office at the discretion of the Board for the ensuing year until removed or replaced.\n​\nName\nName\n​\nAge\n​\nRecent Employment History\n​\n​\n​\n​\n​\nMary E. Adcock\n​\n49\n​\nMs. Adcock was elected Executive Vice President and Chief Merchant and Marketing Officer in March 2025 and is responsible for sales and category planning for fresh foods, center store and general merchandise categories, as well as analytics & execution, e-commerce and digital merchandising, fuel and \nOur Brands\n. Prior to that, Ms. Adcock served as Senior Vice President and Chief Merchant and Marketing Officer from December 2024 to March 2025.  From May 2019 to December 2024, she served as Senior Vice President of Retail Operations, and from June 2016 to April 2019, she served as Group Vice President of Retail Operations. Prior to that, Ms. Adcock held leadership roles in Kroger’s Columbus Division, including Vice President of Operations and Vice President of Merchandising. Prior to that, she served as Vice President of Natural Foods Merchandising and as Vice President of Deli/Bakery Manufacturing and held several leadership positions in the manufacturing department, including human resources manager, general manager and division operations manager. Ms. Adcock joined Kroger in 1999 as human resources assistant manager at the Country Oven Bakery in Bowling Green, Kentucky.\n​\n​\n​\n​\n​\nGabriel Arreaga\n​\n50\n​\nMr. Arreaga was elected Executive Vice President of Supply Chain in March 2025. He is responsible for the Company’s industry-leading Supply Chain organization, Logistics, Inventory & Replenishment, Manufacturing, and Fulfillment Centers. From December 2020 to March 2025, Mr. Arreaga served as Senior Vice President of Supply Chain. Prior to joining Kroger, Mr. Arreaga served as Senior Vice President of Supply Chains for Mondelez, where he was responsible for all operations and functions from field to consumer, internal and external factories, fulfillment centers, direct to store branches, Logistics and product development. He was also Global Vice President of Operations for Stanley Black and Decker and held numerous leadership roles at Unilever including Vice President of Food and Beverage Operations\n​\n​\n​\n​\n​\n7\n\n\nYael Cosset\n​\n51\n​\nMr. Cosset was elected Executive Vice President and Chief Digital Officer in March 2025 and is responsible for leading Kroger’s digital strategy, focused on building Kroger’s presence in the marketplace in digital channels, personalization and e-commerce. He is also responsible for Kroger’s alternative profit businesses, including Kroger’s data analytics subsidiary, 84.51 ͦ LLC and Kroger Personal Finance. From May 2019 to March 2025, Mr. Cosset served as Senior Vice President and Chief Information Officer.  Prior to that, he served as Group Vice President and Chief Digital Officer, and also as Chief Commercial Officer and Chief Information Officer of 84.51° LLC. Prior to joining Kroger, Mr. Cosset served in several leadership roles at dunnhumby USA, LLC, including Executive Vice President of Consumer Markets and Global Chief Information Officer. \n​\n​\n​\n​\n​\nCarin L. Fike\n​\n56\n​\nMs. Fike was elected Vice President and Treasurer effective April 2017. Prior to that, she served as Assistant Treasurer and also as Director of Investor Relations. Ms. Fike began her career with Kroger in 1999 as a manager in the Financial Reporting department after working with PricewaterhouseCoopers in various roles, including audit manager.\n​\n​\n​\n​\n​\nTodd A. Foley\n​\n55\n​\nMr. Foley was named Senior Vice President and Interim Chief Financial Officer in March 2024. Prior to that, he served as Group Vice President, Interim Chief Financial Officer and Corporate Controller from February 2024 to March 2024. Prior to that, he served as Group Vice President and Corporate Controller from October 2021 to February 2024. From April 2017 to September 2021, Mr. Foley served as Vice President and Corporate Controller. Before that, he held several leadership roles, including Vice President and Treasurer, Assistant Corporate Controller, and Controller of Kroger’s Cincinnati/Dayton division. Mr. Foley began his career with Kroger in 2001 as an audit manager in the Internal Audit Department after working for PricewaterhouseCoopers in various roles, including senior audit manager.\n​\n​\n​\n​\n​\nValerie L. Jabbar\n​\n56\n​\nMs. Jabbar was elected Senior Vice President effective August 19, 2021 and is responsible for the oversight of several Kroger retail divisions. From July 2020 to August 2021, she served as Group Vice President of Center Store Merchandising, and from September 2018 to June 2020, as Group Vice President of Merchandising.  Prior to that, she served as President of the Ralphs Division from July 2016 to August 2018. Before that, Ms. Jabbar served as Vice President of Merchandising for the Ralphs Division and as Vice President of Merchandising for the Mid-Atlantic Division. She also held several leadership roles, including assistant store director, category manager, Drug/GM coordinator, G.O. Seasonal manager, assistant director of Drug/GM and director of Drug GM, and district manager in the Fry’s Division.  She joined the Company in 1987 as a clerk in the Fry’s Division.\n​\n​\n​\n​\n​\n8\n\n\nDavid J. C. Kennerley\n​\n51\n​\nMr. Kennerley was elected Executive Vice President in March 2025. Prior to joining Kroger, he held various leadership roles at PepsiCo from 2001 to 2025, most recently serving as CFO, Europe. Mr. Kennerley joined PepsiCo in 2001 as a manager in the International Corporate Finance/Treasury Department, then in 2005 moved to the U.K. business as a business development director and subsequently held a number of roles across Planning and Commercial Finance. In 2011, he became the company’s senior finance director for the Global Beverages Group and then moved into the North American Beverage business. After that, Mr. Kennerley held a number of roles across Commercial Finance before being appointed to SVP Finance for the company’s North American Bottling business. He served in his most recent role as CFO, Europe from March 2020 to March 2025.\n​\n​\n​\n​\n​\nKenneth C. Kimball\n​\n59\n​\nMr. Kimball was elected Senior Vice President in March 2022 and is responsible for the oversight of several Kroger retail divisions. From April 2016 to March 2022, he served as President of the Smith’s Division. Prior to that, he held several leadership roles with the Ralphs Division, including Vice President of Operations and Vice President of Merchandising. Prior to that, he held leadership roles, including store manager, district manager, and director in the Smith’s Division as well as Senior Vice President of Sales and Merchandising and Group Vice President of Retail Operations. Mr. Kimball joined the Company in 1984 as a clerk in the Smith’s Division.\n​\n​\n​\n​\n​\nTimothy A. Massa\n​\n58\n​\nMr. Massa was elected Executive Vice President in March 2025 and serves as the company’s Chief People Officer, leading all areas of Human Resources and Labor Relations, including total rewards, labor relations, diversity, business unit human resources, people operations, training and development, talent hiring, retention and engagement, corporate affairs, and associate communications. He also leads the areas of shared services and aviation. From June 2018 to March 2025, Mr. Massa served as Senior Vice President and Chief People Officer, and from June 2014 to June 2018, he served as Group Vice President of Human Resources and Labor Relations. Mr. Massa joined Kroger in October 2010 as Vice President, Corporate Human Resources and Talent Development.  Prior to joining Kroger, he served in various Human Resources leadership roles for 21 years at Procter & Gamble, most recently serving as Global Human Resources Director of Customer Business Development.\n​\n​\n​\n​\n​\nBrian W. Nichols\n​\n52\n​\nMr. Nichols was elected Vice President, Corporate Controller in March 2024 and is responsible for oversight of Kroger’s Corporate Accounting and Corporate Tax departments, as well as the Company’s Accounting Centers and Accounting Modernization teams. Prior to that, he served as Vice President, Assistant Corporate Controller from April 2021 to March 2024. From May 2018 to April 2021, Mr. Nichols served as Senior Director and Assistant Corporate Controller. Prior to that, he held several leadership roles, including Senior Manager of Corporate and External Financial Reporting and Senior Financial Analyst of SEC Reporting. Mr. Nichols joined Kroger in 2000 as Assistant Controller of the Central Division.\n​\n​\n​\n​\n​\n9\n\n\nRonald L. Sargent\n​\n69\n​\nMr. Sargent was named Interim Chief Executive Officer and Chairman of the Board in March 2025.  He has been a Kroger director since 2006 and served as the Lead Director from June 2018 to March 2025. Mr. Sargent was Chairman and Chief Executive Officer of Staples, Inc., a business products retailer, from 2002 until his retirement in 2016 after joining the company in 1989. Prior to joining Staples, Mr. Sargent spent 10 years with Kroger in several roles across stores, sales, marketing, manufacturing and strategy.\n​\n​\n​\n​\n​\nChristine S. Wheatley\n​\n54\n​\nMs. Wheatley was elected Executive Vice President, General Counsel, and Secretary in March 2025.  Prior to that, she served as Senior Vice President, General Counsel, and Secretary from May 2023 to March 2025. From May 2014 to May 2023, Ms. Wheatley served as Group Vice President, Secretary and General Counsel. She joined Kroger in February 2008 as Corporate Counsel, and thereafter served as Senior Attorney, Senior Counsel, and Vice President. Before joining Kroger, Ms. Wheatley was engaged in the private practice of law for 11 years, most recently as a partner at Porter Wright Morris & Arthur in Cincinnati.\n​\nCOMPETITIVE ENVIRONMENT\n​\nFor the disclosure related to our competitive environment, see",
    "item1a": "Item 1A. Risk Factors” for more information on our cybersecurity-related risks.\n​\n19\n\n\nGOVERNANCE\n​\nProtection of our customers’ data is a fundamental priority for our Board and management team. \nOur risk management team is integrated into our CIS function and is led by our \nCDO and CISO\n. The risk management team reports to the CISO and has combined experience in information security, governance, and compliance, including domains such as engineering, architecture, cybersecurity, and privacy. This team is responsible for defining the program, cybersecurity governance, and gathering insights related to assessing, identifying, and managing cybersecurity threat risks, their severity, and mitigations.\n​\nKroger’s CDO reports to the CEO and leads technology and digital capabilities for the Kroger Co., including the overall cybersecurity strategy. \nKroger’s CDO has over 20 years of both leading and transforming technology, digital growth, and e-commerce in the retail and food industry. He graduated with a master’s degree in business administration and management from Ecole Supérieure de Commerce de Chambéry, Rhône-Alpes, France. Kroger’s interim CISO brings nearly 20 years of experience developing and leading security and risk programs. His experience includes governance, information security, and threat management. He graduated from Miami University with a bachelor’s degree in management information systems and marketing.\n​\nThe \nAudit Committee\n of Kroger’s Board of Directors is charged with oversight of data privacy and cybersecurity risks. Kroger’s \nCDO and CISO\n provide quarterly updates on cybersecurity risks and related mitigating actions to the Audit Committee, meet with the full Board at least annually and inform the Audit Committee immediately if a cybersecurity incident is deemed material. \nThey report to the Audit Committee and the Board on compliance and regulatory issues, provide updates concerning continuously-evolving threats and mitigating actions, and present a NIST Cybersecurity Framework Scorecard.\n Additionally, the CDO and CISO discuss and present strategies to address geopolitical threats that may affect operations as well as technological changes, such as AI and quantum computing.\n In overseeing cybersecurity risks, the Audit Committee focuses on aggregated, thematic issues with a risk-based approach. Oversight of cybersecurity risk incorporates strategy metrics, third-party assessments, and internal audit and controls. An independent third party also regularly reports to the Audit Committee and the full Board on cybersecurity, and outside counsel advises the Board on best practices for cybersecurity oversight by the Board, and the evolution of that oversight over time. Management also reports on strategic key risk indicators, ongoing initiatives, and significant incidents and their effect.\n​",
    "item1b": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS.\n​\nNone.\n​",
    "item1c": "ITEM 1C.\nCYBERSECURITY.\n​\nRISK MANAGEMENT AND STRATEGY\n​\nSecuring Kroger’s business information, intellectual property, customer and employee data and technology systems is essential for the continuity of our businesses, meeting applicable regulatory requirements and maintaining the trust of our stakeholders. We have adopted enterprise cybersecurity risk mitigation and governance processes, which are set forth in the Kroger Cybersecurity Risk Management program (“CRM”), the Kroger Third-Party Cybersecurity Risk Management (“TPCRM”) program and the Kroger Cyber Incident Response Plan (“IR Plan”). Our approach is guided by the principles of the CRM, which includes monitoring threats and vulnerabilities and assessing and monitoring related controls, supporting the Corporate Information Security function, the Chief Information Security Officer (“CISO”) and Chief Digital Officer (“CDO”). \nKroger’s cybersecurity policies, standards, processes, and practices are integrated into our overarching risk management\n system in an effort to enhance our ability to safeguard our operations and information, which includes quarterly cybersecurity reporting to the Board, delivered by senior leadership. \n​\n18\n\n\nKroger Cyber Risk Management Program \n​\nThe \nCRM was developed in collaboration with third-party consultants\n and is aligned with the National Institute of Standards and Technology (“NIST”), Risk Management Framework (“RMF”), Cybersecurity Framework (“CSF”) and the International Organization for Standardization 27001 (“ISO 27001”). The program includes security and privacy, risk-based controls, and incorporates lessons learned from cybersecurity incidents. Under Kroger’s CRM, cyber risks, including cyber threats and cyber events/incidents, are assessed, treated, and monitored on a continuous basis. We integrate lessons learned from incident response and cyber risk mitigation into our cyber risk management strategy, in an effort to improve overall cybersecurity on an ongoing basis. Kroger's CRM program is spearheaded by specific management positions, chosen for their expertise in the field as further discussed below.\n​\nIn line with cyber risk management best practices, we have collaborated with recognized third-party experts as needed to align the CRM’s foundational processes, metrics, monitoring, and reporting with common frameworks such as the NIST RMF and the NIST CSF.\n​\nThird-Party Cyber Risk Management \n​\nRecognizing the potential vulnerabilities posed by third-party relationships, Kroger has implemented a comprehensive TPCRM program. The \nTPCRM program is designed to assess third-party cybersecurity risks by employing third-party cyber risk assessments, vendor tiering, and a dedicated team tasked with recommending holistic improvements to strengthen Kroger’s cybersecurity posture, sourcing, and contracting processes. Kroger’s Information Security Operations Center (“iSOC”) responds to known third-party incidents on a continuous basis.\n The iSOC is a part of the Corporate Information Security (“CIS”) department and is responsible for detecting, responding to, and escalating security incidents. We partner directly with business stakeholders and technology custodians to determine an appropriate response to manage incident risk to minimize the effect to the business. This response process is a regular and critical function of the iSOC and is defined in a separate appendix to the IR Plan. Any material risk identified from these incidents is escalated and communicated using formal severity and impact criteria as defined in the IR Plan.\n​\nKroger Cyber Incident Response Plan\n​\nThe IR Plan documents the processes by which information security events are detected, identified, prioritized, and analyzed. The Kroger iSOC, CISO, legal counsel, and corporate affairs stakeholders are then engaged depending on the incident’s scope, business effect, and potential material risk. This cross-functional team is responsible for assessing an appropriate response and mitigation pathway. Once security events are identified through the enterprise detection and monitoring ecosystem, the IR Plan sets forth an incident prioritization/decision workflow to determine scope, business effect, and potential material risk. This workflow is implemented through collaboration with the iSOC, CISO, legal counsel, and corporate affairs stakeholders and correlates to industry standard severity levels.\n​\nIn addition to the processes outlined above, we have also implemented an information security training program for employees that includes security awareness training related to cyber security risks, simulated phishing emails and regular communication to the enterprise regarding cyber security risks.\n​\nWe experience cybersecurity threats and incidents from time to time. \nWe are not aware of any material risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our business strategy, our financial condition, results of operations or cash flows, and we have not experienced a cybersecurity threat or incident that has materially affected Kroger in at least the last three years.\n There can be no assurance that cybersecurity threats will not have a material effect on us, including our business strategy, our financial condition, results of operations or cash flows. Please see “"
  }
}