{
  "ticker": "KVUE",
  "cik": "0001944048",
  "company_name": "Kenvue Inc.",
  "filing_date": "2025-02-24",
  "accession": "0001944048-25-000033",
  "primary_doc": "kvue-20241229.htm",
  "item_sections": {
    "item1": "Item 1, “Business”) on our business.\nAs used in this Annual Report on Form 10-K, “Kenvue,” “the Company,” “we,” “us,” “our,” and similar terms include Kenvue Inc. and its subsidiaries, unless the context indicates otherwise.\nBecause forward-looking statements are based on current beliefs, expectations, and assumptions regarding future events, they are subject to risks, uncertainties, and changes that are difficult to predict and many of which are outside of our control. You should realize that if underlying assumptions prove inaccurate, or known or unknown risks or uncertainties materialize, our actual results and financial condition could vary materially from expectations and projections expressed or implied in our forward-looking statements. Risks and uncertainties include but are not limited to:\n•\nOur ability to expand globally, implement our digital strategy, and respond appropriately to competitive pressure, including from private-label brands and generic non-branded products, market trends, increased costs, and customer and consumer preferences;\n•\nThe rapidly changing retail landscape, including our dependence on key retailers, policies of our customers, the emergence of e-commerce and other alternative retail channels, and challenges with innovation and research and development;\n•\nProduct reliability, safety, and/or efficacy concerns, whether or not based on scientific or factual evidence, potentially resulting in governmental investigations, regulatory action (including, but not limited to, the shutdown of manufacturing facilities, product relabeling or withdrawal of product from the market), private claims and lawsuits, significant remediation and related costs, safety alerts, product shortages, product recalls, declining sales, reputational damage, and share price impact; \n•\nThe potential that the expected benefits and opportunities from the 2024 Multi-Year Restructuring Initiative (as defined in Note 19, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Consolidated Financial Statements included herein) or any other planned or completed restructuring, cost-saving, or other strategic initiative, acquisition, or divestiture may not be realized or may take longer to realize than expected;\n•\nOur ability to establish, maintain, protect, and enforce intellectual property rights, as well as address the threats of counterfeit and other unauthorized versions of our products;\n•\nAllegations that our products infringe the intellectual property rights of third parties;\n•\nThe impact of negative publicity and failed marketing efforts;\n•\nDifficulties and delays in manufacturing, internally or within the supply chain, that may lead to business interruptions, product shortages, withdrawals or suspensions of products from the market, and potential regulatory action;\n•\nOur reliance on third-party relationships, global supply chains, and production and distribution processes, which may adversely affect supply, sourcing, and pricing of materials used in our products, and impact our ability to forecast product demand;\n•\nInterruptions, breakdowns, invasions, corruptions, destruction, and breaches of our information technology or operational technology systems or those of a third party;\n•\nUncertainty in the development, deployment, use, and regulation of artificial intelligence in our internal processes, manufacturing operations, products and services, as well as our business more broadly;\n•\nThe potential for labor disputes, strikes, work stoppages, and similar labor relations matters, and the impact of minimum wage increases;\n•\nOur ability to attract and retain talented, highly skilled employees and to implement succession plans for our senior management;\n•\nClimate change, extreme weather, and natural disasters, or legal, regulatory or market measures to address climate change;\n3\n•\nThe impact of increasing scrutiny, emerging legal requirements, and rapidly evolving expectations from stakeholders regarding environmental, social, and governance matters;\n•\nThe potential for insurance to be unavailable or insufficient to cover losses we may incur;\n•\nLegal proceedings related to talc or talc-containing products, such as Johnson’s\n®\n Baby Powder, sold outside the United States and Canada, and other risks and uncertainties related to talc or talc-containing products, including the ability of our former parent Johnson & Johnson (“J&J”) to fully satisfy its obligation to indemnify us in the United States and Canada for the Talc-Related Liabilities (as defined in Note 17, “Commitments and Contingencies,” to the Consolidated Financial Statements included herein);\n•\nThe impact of legal proceedings and the uncertainty of their outcome, whether or not we believe they have merit;\n•\nChanges to applicable laws, regulations, policies, and related interpretations;\n•\nChanges in tax laws and regulations, increased audit scrutiny by tax authorities, and exposures to additional tax liabilities potentially in excess of existing reserves;\n•\nPotential changes in export/import and trade laws, regulations, and policies, such as new or increased tariffs, sanctions, quotas, or trade barriers;\n•\nThe impact of inflation and fluctuations in interest rates and currency exchange rates;\n•\nThe impact of a natural disaster, catastrophe, epidemic, pandemic, and global tension, including armed conflict, or other event;\n•\nThe impact of impairment of our goodwill and other intangible assets;\n•\nOur ability to maintain satisfactory credit ratings and access credit markets;\n•\nOur ability to achieve the expected benefits of the Separation from J&J and related transactions;\n•\nRestrictions on our business, potential tax and indemnification liabilities and substantial charges in connection with the Separation and related transactions;\n•\nFailure of our rebranding efforts in connection with the Separation to achieve market acceptance, and the impact of our continued use of legacy J&J branding, including the “Johnson’s\n®\n” brand; and\n•\nOur substantial indebtedness, including the restrictions and covenants in our debt agreements.\nAdditional information about these factors and about the material factors or assumptions underlying such forward-looking statements may be found elsewhere in this Annual Report on Form 10-K, including under Part\n \nI,",
    "item1a": "Item 1A, “Risk Factors—Risks Related to Our Operations—An information security incident, including a cybersecurity breach, or the failure of an information technology or operational technology system owned or operated by us or a third party, could adversely affect us.”",
    "item1c": "Item 1C. CYBERSECURITY\nRisk Management and Strategy\nOur process for assessing, identifying, and managing material risks from cybersecurity threats is integrated into our broader risk management framework to promote a company-wide culture of cybersecurity risk management. Our cybersecurity organization continually evaluates and addresses cybersecurity risk in alignment with our business objectives to address the evolving regulatory landscape and emerging risks, including those resulting from geopolitical shifts and technological innovations such as the growth of cloud technologies and artificial intelligence. We maintain a formal cybersecurity training program, including annual trainings for all Kenvuers, covering, among other topics, phishing, email security, and data privacy. We employ automation, and we also engage our internal audit function and a range of external consultants and other expert third parties in connection with the evaluation and management of cybersecurity risk and the maturation of our cybersecurity program. \nOur cybersecurity organization assesses, monitors, and manages cybersecurity risk through technical, physical, and administrative controls, including \nimplementing cybersecurity policies\n, procedures, and strategies, with the ultimate goal of preventing cybersecurity incidents to the extent feasible, while increasing our system resilience in an effort to minimize business impact should an incident occur.\n The underlying controls of the cybersecurity risk management program are based on \n47\nrecognized best practices and standards for cybersecurity and information technology, including the National Institute of Standards and Technology Cybersecurity Framework. \nIn addition, we maintain a Data Incident Response Program, which is designed to identify, assess, manage, and report significant data incidents, including those reasonably likely to affect our business strategy, results of operations, or financial condition. In the event of a cybersecurity incident, our cybersecurity team assesses, among other factors, safety impact, supply chain and manufacturing disruption, data and personal information loss, business operations disruption, projected cost, and potential for reputational harm, with support from external technical and legal advisors and law enforcement, as appropriate. The Data Incident Response Program outlines the steps to be followed from incident detection to mitigation, recovery, and notification, including notifying functional areas, senior management, and the Company’s Disclosure Committee or a sub-committee thereof as appropriate. The Disclosure Committee or a sub-committee thereof will consider the materiality of an incident elevated by the Data Incident Response Program, inform our Board and other key stakeholders as appropriate, and determine the Company’s reporting obligation on a timely basis. Our organization tests and monitors these processes, including through table-top exercise testing with senior leaders. \nWe rely heavily on our supply chain to deliver our products to our customers and consumers, and a cybersecurity incident at a supplier or partner could materially adversely impact us. \nAs such, we have processes in place to oversee and identify risks from cybersecurity threats associated with suppliers and our use of third-party service providers, including through our Supplier Cyber Risk Assessment process, which assesses third-party cybersecurity controls through a combination of risk assessment questionnaires, commercially available risk data, and proprietary algorithms.\n We also include security and privacy addendums to our contracts where applicable. We require that our suppliers and partners report cybersecurity incidents to us so that we can assess the impact of such an incident on us and have dedicated processes to respond to cybersecurity incidents at third parties.\nRisks from cybersecurity threats did not materially affect our results of operations or financial condition during the fiscal twelve months ended December 29, 2024.\nGovernance\nCybersecurity-related risks are one of the key risks contemplated by our Enterprise Risk Management (“ERM”) Framework. The ERM Framework informs our strategic planning activities through a collaborative risk management environment that proactively identifies and prioritizes our strategic, preventable, and external risks (including new or changing regulations). The ERM Framework enables a clear understanding of the top risks and the exposure they have to our performance and strategic decisions. \nThe ERM Framework is reviewed annually as part of a risk assessment that is presented to our Board.\nOur ERM Framework describes the roles and responsibilities of the Integrated Risk Management Council, a cross-functional group of senior enterprise risk leaders, which meets regularly to review and discuss significant risk facing our business, including cybersecurity risk. Our Integrated Risk Management Council, which includes our \nChief Information Security Officer\n (“CISO”), proactively identifies, assesses, and prioritizes key or emerging risks, which are then escalated to senior management as needed and, in the case of cybersecurity risk, reported to \nour Board’s Nominating, Governance & Sustainability Committee (the “NG&S Committee”) or our full Board\n.\n \nThe NG&S Committee is responsible for assisting our Board with respect to designated risk oversight matters, including privacy and cybersecurity. The NG&S Committee receives reports from, and meets at least twice a year and as needed with, the CISO and the Chief Privacy and Digital Officer (“CPDO”).\n \nThe CISO and the CPDO inform the NG&S Committee, which in turn informs our Board, of risks from cybersecurity threats during such meetings. The NG&S Committee reports to our full Board following each of its regularly scheduled meetings at a minimum and reviews with our Board significant issues or concerns that arise at NG&S Committee meetings. In addition, in February 2025, the CISO and the CPDO reviewed with our Board the cybersecurity and privacy programs, the Data Incident Response Program, and the role of our Board related thereto.\nOur CISO leads a global cybersecurity organization, which develops our strategic cybersecurity priorities and executes operational plans.\n \nOur CISO has over 25 years of cybersecurity experience in the healthcare, finance, and telecommunications industries and in government. Prior to his role at Kenvue, our CISO spent over 10 years at J&J in cybersecurity, and he retired from the United States Air Force Reserves in 2018 as a Lieutenant Colonel, where he had responsibility for cybersecurity. He is a Certified Information Systems Security Professional and holds a Masters in Telecommunications Management from the University of Maryland, University College and a Directorship Certification from the National Association of Corporate Directors. Our CPDO has over 10 years of privacy and digital legal experience. Prior to his role at Kenvue, our CPDO worked for over 15 years in J&J’s Law Department. He also worked as a lawyer in private practice at the law firm Linklaters LLP, in industry associations, and in government, and he acted as Vice Chair of the Consumer Goods Privacy+ Consortium, an association developing compliance strategies and best practices to meet requirements of global privacy laws. He holds a Juris Doctor from Luiss Guido Carli University (Rome, Italy) and a Master of Laws in European Law and Economic Analysis from the College of Europe (Bruges, Belgium). The other members of the cybersecurity organization have decades of experience \n48\nselecting, deploying, and operating cybersecurity technologies, initiatives, and processes around the world, and rely on threat intelligence as well as other information obtained from governmental, public, or private sources, including external consultants.\nNotwithstanding our cybersecurity measures, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us. While we maintain cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be fully insured. For a discussion of cybersecurity risks, see Part\n \nI,",
    "item1b": "Item 1B. UNRESOLVED STAFF COMMENTS\nNot applicable."
  }
}