{
  "ticker": "LDOS",
  "cik": "0001336920",
  "company_name": "Leidos Holdings, Inc.",
  "filing_date": "2025-02-11",
  "accession": "0001336920-25-000006",
  "primary_doc": "ldos-20250103.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOUR COMPANY\nLeidos Holdings, Inc. (“Leidos”), a Delaware corporation, is a holding company whose direct 100%-owned subsidiary and principal operating company is Leidos, Inc. Leidos was founded in 1969 by physicist Dr. Robert Beyster. Since our founding 56 years ago, we have applied our expertise in science, research and engineering in rapidly-evolving technologies and markets to solve complex problems of global concern.\nWe use the terms “we,” “us” and “our” to refer collectively to Leidos Holdings, Inc. and its consolidated subsidiaries. Leidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 48,000, global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Applying our technically-advanced solutions to help solve our customers’ most difficult problems has enabled us to build strong relationships with key customers. Our customers include the U.S. Department of Defense (“DoD”), the U.S. Intelligence Community, the U.S. Department of Homeland Security (“DHS”), the Federal Aviation Administration (“FAA”), the Department of Veterans Affairs (“VA”), National Aeronautics and Space Administration (“NASA”) and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. With a focus on delivering mission-critical solutions, Leidos generated 87% of revenues for the fiscal year ended January 3, 2025, (“fiscal 2024”) from U.S. government contracts, either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government. Approximately 8% of our revenues are generated by entities located outside of the United States.\nBy leveraging expertise in multiple disciplines, tailoring our services and solutions to the particular needs of our targeted markets and using advanced analytics, we work to securely deliver services and solutions that not only meet customers’ current goals, but also support their future missions. \nFor additional discussion and analysis related to recent business developments, see “Business Environment and Trends” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II of this Annual Report on Form 10-K.\nOUR BUSINESS SEGMENTS\nBeginning in fiscal 2024, we realigned our business and operate in four reportable segments that are focused on specific, defined capability sets we bring to our customers. As a result of this change, prior year segment results and disclosures have been recast to reflect the current reportable segment structure. We now operate in the following reportable segments: National Security & Digital, Health & Civil, Commercial & International and Defense Systems. We also separately present the unallocated costs associated with corporate functions as Corporate. \nWe provide a wide array of scientific, engineering and technical services and solutions across these reportable segments. \nNATIONAL SECURITY & DIGITAL\nOur National Security & Digital business provides leading-edge and technologically advanced services, solutions and products, as well as mission software capabilities for defense and intelligence customers in the areas of cyber, logistics, security operations and decision analytics. We also deliver IT operations and digital transformation programs across all U.S. federal government customers. Our advanced capabilities include the delivery of technology-enabled services, mission software capabilities and IT modernization services. Our capabilities allow us to provide innovative technology solutions in software development, engineering & design, modeling & simulation, analytics, cyber security, intelligence analysis, linguistics and mission operations.\nu\nMission Software – We deliver trusted national security software for defense, intelligence, and homeland security customers. Our mission software aims to provide the decision advantage for protecting the homeland, securing critical infrastructure, enabling logistics and conducting multi-domain operations. The core of this capability offering is our Secure Development Operations approach that is designed to ensure our code is secure and assured from the start, enabling our mission partners to focus on execution.\nLeidos Holdings, Inc. Annual Report\n3\nTable of Contents\nPART I\nu\nMulti-Domain Solutions – We provide services by using artificial intelligence and machine learning to coordinate sea, ground, air and space rapidly and securely, helping our warfighters have the right information at the right time to take action with decision advantage. We apply an open architecture approach to digitally connect the joint force across air, land, sea, cyber and space domains in support of the DoD’s multi-domain operations through innovative solutions, essential services and enriched data management tools facilitating critical decision making.\nu\nCyber Operations – We offer full-spectrum cyber solutions to include offensive, defensive, and physical cyber operations. We drive new advances for our customers in the areas of Zero Trust, Cognitive Cyber, Quantum Cryptography, Identity, Credential and Access Management. We deliver global-scale cryptographic management solutions to protect our customers’ most critical information and assets.\nu\nIntelligence Analysis, Mission Support, and Global Logistics Services – We provide intelligence analysis, operational support, logistics operations, security, linguistics, force production, biometrics, Chemical, Biological, Radiological, Nuclear, and Explosives, energetics, and training. In addition, we deliver tailored IT services and solutions to our customers. We offer product support and lifecycle sustainment services to our customers, including planning and managing the cost and performance across the product’s lifecycle. We offer reverse engineering, classified manufacturing and design, and threat exploitation services to U.S. Intelligence Community customers. We use predictive analytics and AI to securely deliver transformational logistics to our customers. We provide a wide range of integrated logistics systems, including rapid procurement, inventory and facility management, and distribution systems.\nu\nDigital Modernization – We provide worldwide digital support for our nation’s largest and most critical infrastructure. We design, develop, implement and maintain IT environments to provide stability and flexibility to mission needs. Our capabilities support offerings including cybersecurity, data analytics, and operations and logistics. Our cybersecurity solutions help detect and manage the most sophisticated cyber threats. \nu\nDigital Transformation – We deliver secure, user-centric IT solutions in cloud computing, mobility, application modernization, DevOps, data center and network modernization, asset management, help desk operations and digital workplace enablement. We help our customers achieve their missions and business goals by delivering purpose-built solutions, cybersecurity as a standard, efficient project delivery and end-user satisfaction. We accelerate enterprise transformation using customizable roadmaps and repeatable processes, enabling customers to effectively use their resources and advance their objectives. Using our cyber expertise, we continually enhance our techniques and processes to build systems that operate resiliently in the face of evolving cyber threats. Leidos is modernizing enterprise IT in classified and unclassified environments, including programs with the FAA, NASA, U.S. Department of Justice, Internal Revenue Service, U.S. MINT, U.S. Department of Commerce, U.S. Federal Trade Commission, and U.S. Department of Housing and Urban Development.\nNational Security & Digital represented 44% of total revenues for fiscal 2024, 47% of total revenues for both the fiscal year ended December 29, 2023 (“fiscal 2023”) and the fiscal year ended December 30, 2022 (“fiscal 2022”).\nHEALTH & CIVIL\nOur Health & Civil business provides services and solutions to federal and commercial customers in the areas of public health, care coordination, life and environmental sciences and transportation. We are dedicated to delivering effective and affordable solutions that are responsible for the health and well-being of people, including service members and veterans. Our core capabilities include health information management services, managed health services, systems and infrastructure modernization, and life sciences research and development. We help customers achieve their missions and take on the connected world with data-driven insights, improved efficiencies and technological advantages. Health & Civil represented 30% of total revenues for fiscal 2024 and 27% of total revenues for both fiscal 2023 and fiscal 2022.\nu\nTransportation Solutions – Leidos is a trusted systems developer, service provider and integrator serving Air Navigation Service Providers around the world, including the FAA. We provide air traffic control systems that help manage the world’s most complex airspace. We deliver many of the FAA’s key automation systems and services, including the En Route Automation Modernization (“ERAM”), Advanced Technologies and Oceanic Procedures (“ATOP”), Time Based Flow Management, Terminal Flight Data Manager, Enterprise-Information Display System, Geo-7 and Future Flight Services. Leidos received 10 plus year extensions to the ERAM and ATOP contracts for continued delivery of the evolving National Airspace System needs. In addition, under the Mode S Beacon Replacement Systems contract, Leidos is supporting the replacement of the FAA’s Mode S Beacon Systems, which are secondary surveillance radar capable of providing surveillance and specific aircraft information necessary to support Air Traffic Control automation in all traffic environments. We also provide key air traffic control systems around the world, including New Zealand and South Korea.\n4\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nu\nHealth Mission Software\n – Leidos employs holistic-systems used for fielding applied technology solutions across the entire continuum of healthcare. We deliver a single, common electronic health record to both DoD and VA hospitals and treatment facilities worldwide. Our responsibilities range from integrating software for the electronic healthcare record vendor and dental record vendors to integrating picture archiving and communications software and more. We support cybersecurity across all integrated systems. We also provide enterprise IT solutions to the VA, National Institutes of Health (“NIH”), DoD and other federal health customers to help operate mission critical infrastructure reliably and at a reasonable cost. \nu\nManaged Health Services – We deploy a national footprint of health clinics and health providers to support care delivery services, including medical disability and behavioral health examinations for the VA, as well as serving other independent medical exam markets. We have developed unique capabilities in behavioral health management through many decades of experience with a special emphasis on substance abuse services and non-medical counseling. We believe that these capabilities can be expanded into other clinical adjacencies. Our managed health services activities leverage our IT and mission enablement capabilities, which underpin solutions we offer to our customers across all of our served markets.\nu\nClimate, Energy and Environment – We believe that we are trusted by government agencies with substantial environmental and sustainability driven-missions. We strive to ensure that our reputation across climate science, environmental management and operations, nuclear security, infrastructure management, mission support and IT modernization provides the applicable expertise needed to transform operations while modernizing aging infrastructure and maintaining environmental stewardship. We support the critical missions of the Department of Energy (“DoE”), National Nuclear Security Administration, and National Science Foundation. At the DoE Hanford site, we provide site-wide infrastructure management and operation, including oversight of land and logistics, public works, information technology, fleet transportation, environmental sustainability, and compliance, first responder services and future project planning. At the National Energy Technology Laboratory, we actively conduct and support fundamental and applied research efforts, including providing product and logistical support comprising strategic business development, technology transfer and agreements and education and outreach support for the effective and efficient execution of research programs. \nu\nLife Sciences Research & Development – We provide life science research and development support to the NIH, Center for Disease Control, Army Medical Research community and commercial biotech companies. Most notably, on behalf of the U.S. government and the public trust, we operate the Frederick National Laboratory for Cancer Research, where we employ thousands of scientists, technicians, administrators and support staff. Our professionals operate a wide range of leading-edge research and development laboratories in the areas of genetics and genomics, proteins and proteomics, advanced biomedical computing and information technology, biopharmaceutical development and manufacturing, nanotechnology characterization and clinical trials management. \nFrom the biomedical sciences to implementing and optimizing electronic health records and enabling providers to perform care coordination and population health management, Leidos is pioneering the use of the depth and breadth of systems integration principles, processes and technologies to transform the health industry’s evolution towards better quality and more efficient and effective care.\nCOMMERCIAL & INTERNATIONAL\nCommercial & International delivers a portfolio of products, services, and solutions aimed at securing national assets, modernizing energy and critical infrastructure, and enhancing mission outcomes. Our key customers include Investor-Owned Utilities, government agencies in the United Kingdom and Australia, the Transportation Security Administration, U.S. Customs & Border Protection (\"CBP\"), as well as airports and ports and borders authorities. We offer a broad range of capabilities, including design and engineering services, security products and solutions, digital modernization, mission software, logistics, and airborne solutions. Commercial & International represented 14% of total revenues for both fiscal 2024 and 2023, and 13% of total revenues for fiscal 2022.\nu\nEnergy Infrastructure – Leidos partners with utilities seeking reliable energy modernization solutions, demonstrated by our strong relationships and collaboration with over 75 investor-owned utilities. Our project portfolio spans large-scale energy initiatives across the United States, serving electric utilities, generation owners, and industrial clients. We support utilities and industrial customers in modernizing power delivery systems for enhanced reliability, implementing energy management strategies, advancing vehicle electrification, transforming digital infrastructure, and optimizing operational efficiency to meet evolving energy demands and market expectations. Our expertise spans power grid engineering and design, grid modernization, utility planning and consulting, energy management and efficiency, technical and financial consulting, and technology-driven innovation, including software and application development. \nLeidos Holdings, Inc. Annual Report\n5\nTable of Contents\nPART I\nu\nGlobal Security Products and Services – Leidos is a global leader in fully integrated security detection solutions, enhancing the safety of screening and checkpoints for aviation, ports, borders, and critical infrastructure worldwide. With over 30,000 products deployed across more than 120 countries, we lead the aviation screening equipment sector, including people scanners, computed tomography carry-on baggage scanners, checked baggage scanners, and explosive trace detectors. Leidos is also the primary supplier of mobile, non-intrusive inspection systems to CBP and other international customers. Our Ports & Borders solutions secure the flow of travel and trade by effectively detecting and mitigating threats across cargo, vehicles, and individuals. Our digital solution features a secure and scalable open-architecture platform that transforms airport security by integrating disparate devices and technologies into a unified management system. This holistic approach provides real-time data and automated controls, improving throughput and operational efficiency.\nu\nInternational – Leidos delivers a wide range of mission-focused services across multiple domains to address critical threats and provide innovative solutions to government agencies in the UK and Australia. Our core areas of expertise include Digital Modernization, Mission Software, Logistics, and Airborne Solutions. In the UK, we are a trusted partner of the Ministry of Defense, delivering logistics and transformation solutions, developing advanced biometric and smart border protection systems to enhance national security, and leading IT service management and transformation programs. In Australia, we provide secure, resilient, and innovative technology solutions that support the Defense sector’s modern warfighting capabilities. We also conduct aerial border surveillance and search-and-rescue operations, covering Australia’s exclusive economic zone and search-and-rescue region.\nDEFENSE SYSTEMS\nDefense Systems addresses threats facing our nation by rapidly prototyping and delivering advanced hardware, software, and integrated systems solutions for the U.S. Department of Defense, Army, Navy, Air Force, Space Force, Marine Corps, United States Special Operations Command, NASA, Defense Advanced Research Projects Agency, intelligence agencies, and international customers. We are heavily engaged in the top defense Research Development Test and Evaluation priorities that are driven by critical evolving threat-driven needs. Defense Systems provides services in the air, land, sea, space and cyberspace environments. The Defense Systems business is dedicated to delivering cost-effective solutions in the space, airborne, land, maritime and cyber domains and supporting critical missions worldwide. Defense Systems represented 12% of total revenues for both fiscal 2024 and 2023, and 13% of total revenues for fiscal 2022.\nu\nAirborne Systems – Leidos develops and integrates mission-enhancing airborne solutions, equipping government and Leidos-owned fixed-wing, rotary-wing, and unmanned aircraft with advanced sensors and processing systems. We execute airborne training, intelligence, surveillance, and reconnaissance missions as a service for the DoD, the U.S. Intelligence Community, and military services worldwide. Our key served markets include aircraft integration and operations, sensor and autonomous systems, and Multi-Domain Operation enablers, addressing diverse missions such as target identification, border security, and counter-narcotics operations. We design and integrate open-architecture sensing systems powered by advanced sensors, algorithms, and processing capabilities to meet complex mission requirements. Beyond integration, we deliver high-end solutions and services globally, providing intelligence analysis, operational support, and logistics. Leidos airborne also designs and manufactures low-cost, high-impact airborne effectors, including guided munitions (e.g. GBU-69), cruise missiles (e.g. Black Arrow), and components for air-to-air and air-to-ground missions. In the realm of autonomous systems, we develop innovative software and hardware solutions for unmanned aerial systems and autonomous platforms. Our unique autonomy algorithms enhance system capabilities, decision-making, alleviate the burden on warfighters, and enable seamless coordination between manned and autonomous platforms, ensuring mission success in dynamic environments.\nu\nLand Systems – We develop Integrated Air and Missile Defense systems, including the US Army Enduring Indirect Fire Protection Capability and AirShield systems. Enduring Shield is a ground-based, mobile system that defends against cruise missiles and unmanned aircraft systems. The system protects and defends critical civilian and military infrastructure, bridging the gap between tactical short range air defense and strategic systems. We are delivering systems for Initial Operational Test & Evaluation, and we are under contract to deliver systems in support of Guam Defense. AirShield delivers robust air defense while on the move, providing capabilities among the most advanced in the industry. The system employs advanced threat assessment along with kinetic and non-kinetic effectors that is designed to provide air defense against unmanned aerial vehicles, particularly in dynamic operational environments. We design and manufacture persistent surveillance radar systems, advanced sensors, and radio frequency seekers, including the associated advanced algorithms that accompany them. We use this expertise to provide military sensor and electronic system R&D services for our customers. \n6\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nu\nMaritime Systems – On and under the sea, we offer a wide range of capabilities. We continue to enhance our surface and subsurface autonomous and unmanned technologies to help make maritime operations safer and more efficient for government and industry by providing innovative platforms, software solutions for vessel control and autonomous behaviors, leading sensor systems, signal processing, communications hardware and software to support these vital missions. We are a market leader in submarine data collection technologies and anti-submarine warfare system installation and maintenance and are expanding our capabilities in these areas to meet market demand for this growing threat. We also provide prototyping and research and development support services to a wide variety of DoD customers from concept analysis to classified manufacturing. Our naval architecture services span the entire ship’s lifetime, from early-stage concept designs through detailed design, shipyard construction support, full lifecycle and sustainment support, ship alterations, service life extensions, and disposal. Our marine engineering involves a wide range of activities, beginning with concept and feasibility design and continues through land-based test sites, cyber and shock hardening of key components, detailed design, construction support, life-cycle support and into ship-alt design for service-life extensions.\nu\nAerospace Systems – We provide expertise in the design, manufacturing, and integration of space-based electro-optic infrared system, multi/hyperspectral, electronic warfare and signals intelligence, and communications payloads. In space we provide sensor, algorithm development and integrated payload capabilities to identify and track threats and cue defensive systems. We have developed and delivered full integrated small satellite systems and are under contract for payload deliveries on the Space Development Agency Wide Field of View Tranches 0, 1, and 2 programs. We manufacture structures and thermal protection systems for hypersonic boost-glide missiles, and we provide testing services for hypersonic vehicles. \nu\nCyber and Threat Systems - We offer reverse engineering, classified manufacturing and design, and threat exploitation services to a wide breadth of U.S. Intelligence Community customers. We model, simulate, and analyze cyber and electro-magnetic threats, develop threat emulators for range testing, and develop cyber-physical solutions.\nCORPORATE\nCorporate includes the operations of various corporate activities, certain expense items that are not reimbursed by our U.S. government customers and certain other expense items excluded from a reportable segment’s performance. \nACQUISITIONS AND DIVESTITURES\nDuring fiscal 2022, we completed the acquisition of Cobham Aviation Services Australia’s Special Mission business. See “Note 5—Acquisitions and Divestitures” in Part II of this Annual Report on Form 10-K for further information.\nDuring fiscal 2023, we completed an immaterial disposition of a business within our Defense Solutions segment. During fiscal 2022, we completed the disposition of Aviation & Missile Solutions LLC within our Defense Solutions segment. For further information, see “Note 5—Acquisitions and Divestitures” in Part II of this Annual Report on Form 10-K.\nKEY CUSTOMERS\nThe majority of our revenues are generated in the United States. Our consolidated revenues are largely attributable to prime contracts or to subcontracts with other contractors engaged in work for the U.S. government, with the remaining attributable to international customers, including the UK Ministry of Defence and Australian Department of Defence, and customers across a variety of commercial markets. Within the U.S. government, our revenues are diversified across many agencies, including various intelligence agencies, the U.S. Army, Navy and Air Force, U.S Space Force, DHS, Defense Information Security Agency, FAA, Transportation Security Administration, CBP, Defense Health Agency, VA, Department of Health and Human Services, NASA, National Science Foundation, DoE, the Environmental Protection Agency and research agencies such as Defense Advanced Research Projects Agency. \nThese customers have a number of subsidiary agencies that have separate budgets and procurement functions. Our contracts may be with the highest level of these agencies or with the subsidiary agencies of these customers.\nLeidos Holdings, Inc. Annual Report\n7\nTable of Contents\nPART I\nHUMAN CAPITAL\nEMPLOYEE AND WORKFORCE DEMOGRAPHICS\nAs of January 3, 2025, we employed approximately 48,000 full and part-time employees of whom approximately 42,600 are located in the United States and the remainder of which are located in approximately 50 countries worldwide. Approximately 37% of our employees have degrees in science, technology, engineering or mathematics fields, approximately 24% of our employees have advanced degrees, 52% of our employees possess U.S. security clearances and approximately 19% of our employees are military veterans.\nAs of January 3, 2025, our workforce consisted of the following:\nGender of global employees\n(1)\nMale\n65 \n%\nFemale\n35 \n%\n(1)\nBased on employees who self-identify.\nAge of global employees\nLess than 30 years\n15 \n%\n30-50 years\n48 \n%\nGreater than 50 years\n37 \n%\nEthnicity of U.S. employees\n(1)\nWhite\n59 \n%\nBlack\n14 \n%\nAsian/Indian\n10 \n%\nHispanic/Latino\n10 \n%\nOther\n4 \n%\nUndisclosed\n3 \n%\n(1)\nBased on employees who self-identify.\nCULTURE AND CORPORATE VALUES\nLeidos has adopted six values that help define its culture: integrity, inclusion, innovation, agility, collaboration and commitment. These values provide a roadmap for our workplace behavior and help guide our business decisions. They are a key component of our corporate culture and are part of our employees’ annual performance assessments. Our values are based on our commitment to do the right thing for our customers, our employees and our communities. Our values are demonstrated by our employees as they help our customers execute important missions in the world’s most complex markets. \nOur policies, procedures, training and communications form a comprehensive program that promotes a culture of integrity as a foundation for employee conduct. For the seventh consecutive year, the Ethisphere Institute named Leidos one of the World’s Most Ethical Companies in 2024.\nOur approach to workplace culture and employee development focuses on education and best practices for leaders and employees. Leidos has programs designed to promote our corporate values throughout the enterprise and with our senior leadership. Leaders, managers and employees of the Company are required to take annual training to reinforce our corporate values.\nWe continue to grow and expand our learning and upskilling tools to develop and enhance our employees technical and leadership skills to actively maintain our workplace culture. Company councils continue to champion and integrate Leidos values across the enterprise and are comprised of employees across our business areas and functions with oversight and guidance from executive leadership.\n8\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nTALENT ACQUISITION PRACTICES\nLeidos is committed to promoting hiring practices that are designed and executed to recruit, hire, train and retain best-in-class talent, including building a deep and broad pipeline of candidates. We leverage college campuses, military veteran resources, industry associations, and other sources to expand our outreach. Each year we also attend and sponsor national conferences and local career fairs that target our key market segments and talent.\nOur military veteran outreach program attracts, retains and supports current veterans, transitioning service members and military spouses. Our college campus outreach engages talent from multiple university sources.\nCAREER MOBILITY AND GROWTH\nWe have a strong focus on our employees’ career, flexibility and well-being. We embrace what makes Leidos great by advancing a culture that helps every employee achieve personal and professional success. This is part of our broader Employee Value Proposition to 'break limits' and a commitment to make Leidos an even better place to work. Leidos empowers and challenges employees to continuously seek, share and apply new knowledge, skills and behaviors. We recognize the value of a high-performing workforce where every member of the team has an opportunity to feel motivated, valued and fulfilled, and have a purposeful and long career at Leidos. We provide resources, development, and experiential learning to enable employees to grow, including a talent marketplace where employees can fill temporary roles to develop skills or provide additional assistance. We provide leaders with the knowledge, skills and resources needed to coach employees and enable employees’ career development.\nWe value and develop a future-ready workforce to meet customer needs and stay ahead of emerging technologies. We have a strong technical upskilling and reskilling program to develop, mobilize and retain talent. We offer formal programs to help employees earn many industry-standard professional and technical certifications. Additionally, we offer tuition reimbursement and certification exam reimbursement to full-time employees at accredited universities.\nOur Internal Mobility Program has a dedicated team that proactively focuses on the mobilization of our employees. We teach employees how to use the tools and resources available to them and help them gain visibility across the enterprise. We assist managers and recruiters in identifying internal candidates for their programs. \nWe conduct formal employee engagement surveys to listen to employees and develop customized strategies to drive engagement, inclusion and retention across the organization.\nWe invest in our current and future leaders in several ways. We provide a variety of leadership development programs, targeted for each level of leader, and numerous resources for leader development. Annually, we host a two-day Leadership Summit for approximately 350 of our most senior leaders to align our growth strategy and transformation initiatives.\nThrough our ongoing talent planning processes, we identify and develop high-potential employees for future roles. We create succession plans for all executive-level positions as well as for other roles throughout the organization considered vital to our success. In addition, we establish development and engagement plans for top talent that may include formal training, mentoring, coaching, sponsorship and experiential learning opportunities. \nHEALTH AND WORKPLACE SAFETY\nOur primary focus is on the health and safety of our employees, with the physical and mental well-being of our employees being top priority. To support the physical and mental well-being of our employees, we provide many well-being and mental health benefits to all employees, including access to our Employee Assistance Program, Headspace, Personify Health and meQuilibrium resources. These partners provide a multitude of free resources to assist employees with their mental, financial, and physical health.\nWe are a leader in the field of occupational health and safety (“OH&S”), and place a strong emphasis on these activities, both internally and on behalf of our customers. Internally, we emphasize direct management responsibility, corporate policies and procedures, OH&S program implementation, employee training and compliance assessments. Our corporate policies and procedures support compliance with OH&S regulations at work locations. We have a proactive compliance program of employee education, training, auditing and reporting that, through employee awareness and integration into our business operations, supports our commitment to a safe and healthy work environment. \nLeidos Holdings, Inc. Annual Report\n9\nTable of Contents\nPART I\nENVIRONMENTAL MATTERS\nOur operations are subject to various foreign, federal, state and local environmental protection and health and safety laws and regulations. In addition, our operations may become subject to future laws and regulations, including those related to climate change and environmental sustainability. See “Risk Factors” in this Annual Report on Form 10-K for further details. Although we do not currently anticipate that the costs of complying with, or the liabilities associated with, environmental laws will materially and adversely affect us, we cannot ensure that we will not incur material costs or liabilities in the future.\nRESEARCH AND DEVELOPMENT\nWe conduct research and development activities under customer-funded contracts and with company-funded research and development funds. Company-funded research and development includes independent research and development (“IR&D”) and commercial and international research and development. Company-funded research and development expenses are included in selling, general and administrative expenses. Our company-funded research and development expense was $150 million, $128 million and $116 million for fiscal 2024, 2023 and 2022, respectively, which as a percentage of consolidated revenues was 0.9% for fiscal 2024 and 0.8% for both fiscal 2023 and 2022. We charge expenses for research and development activities performed under customer contracts directly to those contracts.\nINTELLECTUAL PROPERTY RIGHTS\nOur technical services and products are not generally dependent upon patent protection, although we do selectively seek patent protection. We claim a proprietary interest in certain of our products, software programs, methodologies and know-\nhow. This proprietary information is protected in confidence as trade secrets, using non-disclosure and other definitive agreements. We selectively pursue opportunities to license or transfer our technologies to third parties.\nIn connection with the performance of services and solutions, the U.S. government has certain rights to inventions, data, software codes and related material that we develop under U.S. government-funded contracts and subcontracts. Generally, the U.S. government may disclose or license such information to third parties, including, in some instances, our competitors. In the case of some subcontracts that we perform, the prime contractor generally obtains rights to use the programs and products that we deliver under the subcontract to perform its prime contract obligations.\nCOMPETITION\nCompetition for contracts is significant, and we often compete against many well-established corporations with strong name and brand recognition. We also compete against smaller, more specialized companies that concentrate their resources in particular areas, the U.S. government’s own capabilities and federal non-profit contract research centers. Due to the diverse requirements of the U.S. government and our commercial customers, we frequently collaborate with other companies to compete for large contracts and bid against these same companies in other situations.\nOur principal competitors currently include the following companies: Accenture Federal Systems, Amentum Services Inc., BAE Systems, Booz Allen Hamilton Inc., CACI International Inc., Deloitte, General Dynamics Corporation, GovCIO, IBM, KBR Inc., L3Harris, Lockheed Martin Corporation, ManTech, Northrop Grumman Corporation, Optum, Parsons Corp, Peraton, Raytheon Technologies Corporation and SAIC. These companies span across sectors that include systems development and integration, engineering and technical services divisions of large defense contractors, diversified U.S. and international IT providers and contractors focused solely on technical services, supply chain management, other logistics services and major systems operations and maintenance, homeland security and health solutions. \nWe compete on various factors, including our technical expertise and qualified professional and/or security-cleared personnel, our ability to deliver innovative high value solutions in a timely manner, successful program execution, our understanding of our customers’ missions, the size and scale of our company and past performance credentials.\n10\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nCONTRACT PROCUREMENT\nOur business is heavily regulated, and we must comply with and are affected by laws and regulations relating to the formation, administration and performance of U.S. government and other contracts. The U.S. government procurement environment has evolved due to statutory and regulatory procurement reform initiatives. Today, U.S. government customers employ several contracting methods to purchase services and products. Budgetary pressures and reforms in the procurement process have caused many U.S. government customers to increasingly purchase services and products using contracting methods that give them the ability to select multiple contract winners or pre-qualify certain contractors to provide services or products on established general terms and conditions rather than through single-award contracts. The predominant contracting methods through which U.S. government agencies procure services and products include the following:\nu\nDefinitive Award Contracts. U.S. government agencies may procure services and products through single definitive award contracts which specify the scope of services or products purchased and identify the contractor that will provide the specified services or products. When an agency has a requirement, the agency will issue a solicitation or request for proposal to which interested contractors can submit a proposal. The bidding and selection process can take a year or more to complete. For the contractor, this method of contracting may provide greater certainty of the timing and amounts to be received at the time of contract award because it generally results in the customer contracting for a specific scope of services or products from the single definitive successful awardee.\nu\nIndefinite Delivery/Indefinite Quantity (“IDIQ”) Contracts.\n \nThe U.S. government uses IDIQ contracts to obtain commitments from contractors to provide certain services or products on pre-established terms and conditions. The U.S. government then issues task orders under the IDIQ contracts to purchase specific services or products. IDIQ contracts are awarded to one or more contractors following a competitive procurement process. Under a single-award IDIQ contract, all task orders under that contract are issued to the one contractor awarded the IDIQ. Under a multiple-award IDIQ contract, task orders are competitively bid by the contractors awarded the IDIQ. Multiple-award IDIQ contracts that are open for any government agency to use for procurement are commonly referred to as “government-wide acquisition contracts.” IDIQ contracts often have multi-\nyear terms and unfunded ceiling amounts, therefore enabling, but not committing, the U.S. government to purchase substantial amounts of services or products from one or more contractors. At the time an IDIQ contract is awarded (prior to the award of any task orders), a contractor may have limited or no visibility as to the ultimate amount of services or products that the U.S. government will purchase under the contract, and in the case of a multiple-award IDIQ contracts, the contractor from which such purchases may be made.\nu\nU.S. General Services Administration (“GSA”) Schedule Contracts. The GSA maintains listings of approved suppliers of services and products with agreed-upon prices for use throughout the U.S. government. In order for a company to provide services under a GSA Schedule contract, a company must be pre-qualified and awarded a contract by the GSA. When an agency uses a GSA Schedule contract to meet its requirements, the agency, or the GSA on behalf of the agency, conducts the procurement. The user agency, or the GSA on its behalf, evaluates the user agency’s requirements and initiates a competition limited to GSA Schedule qualified contractors. GSA Schedule contracts are designed to provide the user agency with reduced procurement time and lower procurement costs. Similar to IDIQ contracts, at the time a GSA Schedule contract is awarded, a contractor may have limited or no visibility as to the ultimate amount of services or products that the U.S. government will purchase under the contract.\nu\nOther Transaction Authority (“OTA”) agreements. Under certain circumstances, U.S. government agencies can enter into OTA agreements instead of traditional contracts. Agencies are explicitly authorized by Congress for specific uses, limitations or restrictions in the use of OTAs. In the case of DoD, the department is authorized to use OTAs to carry out basic, applied or advanced research projects, prototype development projects or follow-on production to initial prototype projects. OTA agreements are generally exempt from federal procurement regulations. These exemptions grant the U.S. government the flexibility to include, amend or exclude contract clauses and requirements that are mandatory in traditional procurements. OTA agreements also grant more flexibility to structure agreements in numerous ways, including joint ventures, partnerships or multiple agencies joining together to fund an agreement encompassing multiple providers.\nWe often team together with other companies to submit bids for large U.S. government procurements or other opportunities where we believe that the combination of services and products that we can provide as a team will help us win and perform the contract. Our relationships with our teammates, including whether we serve as the prime contractor or as a subcontractor, vary with each contract opportunity and typically depend on the program, contract or customer requirements, as well as the relative size, qualifications, capabilities, customer relationships and experience of our company and our teammates.\nLeidos Holdings, Inc. Annual Report\n11\nTable of Contents\nPART I\nContracting with the U.S. government also subjects us to substantial regulation and unique risks, including the U.S. government’s ability to cancel any contract at any time through a termination for the convenience. Most of our contracts have cancellation terms that would permit us to recover all or a portion of our incurred costs and fees for work performed prior to U.S. government termination for convenience. These regulations and risks are described in more detail below under “Business–Regulation” and “Risk Factors” in this Annual Report on Form 10-K.\nCONTRACT PAYMENT TYPES\nGenerally, the type of contract for our services and products is determined by or negotiated with the U.S. government and may depend on certain factors, including the type and complexity of the work to be performed, degree and timing of the responsibility to be assumed by the contractor for the costs of performance, the extent of price competition and the amount and nature of the profit incentive offered to the contractor for achieving or exceeding specified standards or goals. We generate revenues under several types of contracts, including the following:\nu\nCost-reimbursement contracts include cost-plus-fixed-fee, award-fee and incentive-fee contracts. These contracts provide for reimbursement of our direct contract costs and allocable indirect costs, plus a fee. These contracts are typically used when uncertainties involved in contract performance do not permit costs to be estimated with sufficient accuracy to use a fixed-price contract. Cost-reimbursement contracts generally subject us to lower risk but require us to use our best efforts to accomplish the scope of the work within a specified time and budget. Award and incentive fees are generally based on performance criteria such as cost, schedule, quality and/or technical performance. Award fees are determined and earned based on customer evaluation of the Company’s performance against contractual criteria. Incentive fees that are based on cost provide for an initially negotiated fee to be adjusted later, typically using a formula to measure performance against the associated criteria, based on the relationship of total allowable costs to total target costs. \nu\nFixed-price-incentive-fee (“FPIF”) contracts are substantially similar to cost-plus-incentive-fee contracts except they establish specified targets for cost and profit, a price ceiling (but not a profit ceiling or floor) and a profit adjustment formula. Under an FPIF contract, the allowable costs incurred are eligible for reimbursement but are subject to a cost-share arrangement, which affects profitability. Generally, if our costs exceed the contract target cost or are not allowable under the applicable regulations, we may not be able to obtain reimbursement for all costs and may have our fees reduced or eliminated.\nu\nTime-and-materials (“T&M”) contracts typically provide for negotiated fixed hourly rates for specified categories of direct labor plus reimbursement of other direct costs. This type of contract is generally used when there is uncertainty about the extent or duration of the work to be performed by the contractor at the time of contract award or it is not possible to anticipate costs with any reasonable degree of confidence. On T&M contracts, we assume the risk of providing appropriately qualified staff to perform these contracts at the hourly rates set forth in the contracts over the period of performance of the contracts.\nu\nFixed-price-level-of-effort (“FPLOE”) contracts are substantially similar to T&M contracts except they require a specified level of effort over a stated period of time on work that can be stated only in general terms. This type of contract is generally used when the contractor is required to perform an investigation or study in a specific research and development area and to provide a report showing the results achieved based on the level of effort. Payment is based on the effort expended rather than the results achieved.\nu\nFirm-Fixed-Price (“FFP”) contracts provide for a fixed price for specified products, systems and/or services. This type of contract is typically used when the customer acquires products and services on the basis of reasonably definitive specifications that allow parties to develop an estimate of the costs to complete the work. The price for a FFP contract is often determined through competitive bidding by multiple contractors vying for award of the contract, but the price may also be determined through price negotiations with the customer. These contracts offer us potential increased profits if we can complete the work at lower costs than planned, but FFP contracts increase our exposure to the risk of cost overruns.\nOur earnings and profitability may vary materially depending on changes in the proportionate amount of revenues derived from each type of contract, the nature of services or products provided, as well as the achievement of performance objectives, and the stage of performance at which the right to receive fees, particularly under incentive-fee and award-fee contracts, is finally determined. Cost-reimbursement and T&M contracts generally have lower profitability than FFP contracts. \n12\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nSEASONALITY\nThe U.S. government’s fiscal year ends on September 30 of each year. While not certain, it is not uncommon for U.S. government agencies to award extra tasks or complete other contract actions in the timeframe leading up to the end of its fiscal year in order to avoid the loss of unexpended fiscal year funds, which may favorably impact our third fiscal quarter. In addition, our quarterly results may be impacted by the number of working days in a given quarter. We tend to generate less revenue from our labor services during the fourth quarter as a result of the holiday season.\nREGULATION\nWe are heavily regulated in most of the fields in which we operate. We provide services and products to numerous U.S. government agencies and entities, including to the DoD, the U.S. Intelligence Community and the DHS. When working with these and other U.S. government agencies and entities, we must comply with various laws and regulations relating to the formation, administration and performance of contracts. Some significant laws and regulations that affect us include:\nu\nthe Federal Acquisition Regulation (“FAR”) and supplements, including the DoD Federal Acquisition Regulation Supplement (“DFARS”), which regulate the formation, administration and performance of U.S. government contracts;\nu\nthe Truthful Cost or Pricing Data Act, which requires certification and disclosure of cost and pricing data in connection with certain contract negotiations;\nu\nthe Procurement Integrity Act, which regulates access to competitor bid and proposal information and government source selection information and our ability to provide compensation to certain former government officials;\nu\nthe Civil False Claims Act, which provides for substantial civil penalties for violations, including for submission of a false or fraudulent claim to the U.S. government for payment or approval;\nu\nthe False Statements Act, which imposes civil and criminal liability for making false statements to the U.S. government;\nu\nthe U.S. government Cost Accounting Standards (“CAS”), which imposes accounting requirements that govern our right to reimbursement under certain cost-based U.S. government contracts; and\nu\nThe International Trade in Arms Regulation (“ITAR”), which governs the manufacture, export, and temporary import of defense articles, the furnishing of defense services, and brokering activities involving items described on the U.S. munitions list.\nThese regulations impose a broad range of requirements, many of which are unique to government contracting, including various procurement, import and export, security, contract pricing and cost, contract termination and adjustment and audit requirements. Among other things, these laws and regulations:\nu\nrequire certification and disclosure of all cost and pricing data in connection with certain contract negotiations;\nu\ndefine allowable and unallowable costs and otherwise govern our right to reimbursement under various cost-type U.S. government contracts;\nu\nrequire compliance with U.S. government CAS;\nu\nrequire reviews by the Defense Contract Audit Agency (“DCAA”), Defense Contract Management Agency (“DCMA”) and other U.S. government agencies of compliance with government requirements for a contractor’s business systems;\nu\nrestrict the use and dissemination of and require the protection of unclassified contract-related information and information classified for national security purposes and the export of certain products and technical data; and\nu\nrequire us not to compete for work if an actual or potential organizational conflict of interest, as defined by these laws and regulations, related to such work exists and/or cannot be appropriately mitigated, neutralized or avoided.\nThe U.S. government may revise its procurement practices or adopt new contract rules and regulations at any time. In order to help ensure compliance with these complex laws and regulations, all of our employees are required to complete ethics and other compliance trainings relevant to their position.\nLeidos Holdings, Inc. Annual Report\n13\nTable of Contents\nPART I\nDATA PRIVACY AND SECURITY LAWS\nSome of our operations and service offerings involve access to and use by us of personal information and/or protected health information. These activities are regulated by extensive federal, state and international data privacy and security laws requiring organizations to, among other things, provide certain privacy protections and security safeguards for such information. For example, among others:\nu\nthe European Union’s (“EU’s”) General Data Protection Regulation (“GDPR”), which imposes compliance obligations for companies that process personal data of EU data subjects, necessitating investment into ongoing data protection activities and documentation requirements, and creates the potential for significant fines for noncompliance; \nu\nthe United Kingdom’s (“UK’s”) General Data Protection Regulation, (“U.K. GDPR”), which creates similar compliance obligations for companies that process personal data of UK data subjects as are imposed by the GDPR; \nu\nthe California Consumer Privacy Act, as amended by the California Privacy Rights Act (collectively, “CCPA”), which broadly defines personal information and provides expanded consumer privacy rights to natural persons residing in California, such as affording them the right to access and request deletion of their information and to opt out of certain sharing and sales of personal information; and\nu\nthe Health Insurance Portability and Accountability Act, as amended by the Health Information Technology for Economic and Clinical Health Act, which establishes privacy and security compliance obligations with respect to the processing of protected health information by covered entities and business associates, necessitating investment in technical and organizational compliance measures and creates the potential for substantial fines for noncompliance.\nThese regulations and related risks are described in more detail below under “Risk Factors” in this Annual Report on Form 10-K.\nCOMPANY WEBSITE AND INFORMATION\nOur corporate headquarters is located at 1750 Presidents Street, Reston, VA 20190 and our telephone number is (571) 526-6000. Our website can be accessed at www.leidos.com. The website contains information about our company and operations. Through a link on the Investor Relations section of our website, copies of each of our filings with the U.S. Securities and Exchange Commission (“SEC”) on Form 10-K, Form 10-Q and Form 8-K, and all amendments to those reports, can be viewed and downloaded free of charge as soon as reasonably practicable after the reports and amendments are electronically filed with or furnished to the SEC. The SEC also maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, including Leidos. The information on our website is not incorporated by reference into and is not a part of this Annual Report on Form 10-K.",
    "item1a": "Item 1A. Risk Factors \nIn your evaluation of our company and business, you should carefully consider the risks and uncertainties described below, together with information disclosed elsewhere in this Annual Report on Form 10-K, including our consolidated financial statements and the related notes and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II of this Annual Report, and other documents we file with the SEC. The risks and uncertainties described below are those that we have identified as material but are not the only risks and uncertainties facing us. If any of these risks or uncertainties actually occurs, our business, financial condition or operating results could be materially harmed, and our stock price could decline. Our business is also subject to general risks and uncertainties that affect many other companies, such as our ability to collect receivables, overall U.S. and global economic and industry conditions, geopolitical events, changes in laws or accounting rules, fluctuations in interest, exchange rates and inflation, terrorism, international conflicts, major health concerns, climate change or other disruptions of expected economic and business conditions. Additional risks and uncertainties not currently known to us or that we currently believe are immaterial also may materially harm our business, financial condition or operating results. In that event, the trading price of our stock could decline, and you could lose part or all of your investment.\n14\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nSUMMARY OF RISK FACTORS\nThis risk factor summary contains a high-level summary of risks associated with our business. It does not contain all of the information that may be important to you, and you should read this risk factor summary together with the more detailed discussion of risks and uncertainties set forth following this summary. A summary of our risks includes, but is not limited to, the following:\nu\nWe depend on government agencies as our primary customers and if our reputation or relationships with these agencies were harmed, our future revenues and growth prospects could be adversely affected.\nu\nA decline in the U.S. government budget, changes in spending or budgetary priorities or delays in contract awards may significantly and adversely affect our future revenues and limit our growth prospects. \nu\nBecause we depend on U.S. government contracts, a delay in the completion of the U.S. government’s budget and appropriations process could delay procurement of the products, services and solutions we provide and adversely affect our future revenues.\nu\nDue to the competitive process to obtain contracts and the likelihood of bid protests, we may be unable to achieve or sustain revenue growth and profitability.\nu\nThe U.S. government may terminate, cancel, modify, renew on less favorable terms or curtail our contracts at any time prior to their completion and, if we do not replace them, this may adversely affect our future revenues and profitability.\nu\nWe face intense competition that can impact our ability to obtain contracts and therefore affect our future revenues and growth prospects.\nu\nDeterioration of economic conditions or weakening in credit or capital markets may have a material adverse effect on our business, results of operations and financial condition.\nu\nWe cannot predict the consequences of current or future geopolitical events, but they may adversely affect the markets in which we operate and our results of operations.\nu\nGlobal supply chain issues and inflationary pressures have disrupted supply and increased the prices of goods and services, which could raise the costs associated with providing our services, diminish our ability to compete for new contracts or task orders and reduce customer buying power.\nu\nOur failure to comply with various complex procurement rules and regulations could result in our being liable for penalties, including termination of our U.S. government contracts, disqualification from bidding on future U.S. government contracts and suspension or debarment from U.S. government contracting.\nu\nThe U.S. government may adopt new contract rules and regulations or revise its procurement practices in a manner adverse to us at any time.\nu\nApplication of the U.S. government's organizational conflict of interest (OCI) rules could limit our ability to successfully compete for new contracts or task orders, which would adversely affect our results of operations.\nu\nAs a U.S. government contractor, our partners and we are subject to reviews, audits and cost adjustments by the U.S. government, which could adversely affect our profitability, cash position or growth prospects if resolved unfavorably to us.\nu\nOur business is subject to governmental review and investigation, which could adversely affect our financial position, operating results and growth prospects.\nu\nInvestigations, audits, claims, disputes, enforcement actions, litigation, arbitration or other legal proceedings could require us to pay potentially large damage awards or penalties and could be costly to defend, which would adversely affect our cash balances and profitability, and could damage our reputation.\nu\nOur business and operations expose us to numerous legal and regulatory requirements, and any violation of these requirements could harm our business.\nu\nOur business is subject to complex and evolving laws and regulations regarding data privacy and security which could subject us to investigations, claims or monetary penalties against us, require us to change our business practices or otherwise adversely affect our revenues and profitability.\nu\nMisconduct of employees, subcontractors, agents, suppliers, business partners or joint ventures and others working on our behalf could cause us to lose existing contracts or customers and adversely affect our ability to obtain new contracts and could have a material adverse impact on our business, reputation and future results.\nLeidos Holdings, Inc. Annual Report\n15\nTable of Contents\nPART I\nu\nA failure to attract, retain, and develop talent with critical skills, including our leadership team, would adversely affect our ability to execute our strategy and may disrupt our operations.\nu\nWe may not realize the full amounts reflected in our backlog as revenues, which could adversely affect our expected future revenues and growth prospects.\nu\nOur earnings and profitability may vary based on the mix of our contracts and may be adversely affected by our failure to estimate and manage costs, time and resources accurately.\nu\nWe use estimates in recognizing revenues, and if we make changes to estimates used in recognizing revenues, our profitability may be adversely affected.\nu\nCybersecurity breaches and other information security incidents could negatively impact our business and financial results, impair our ability to effectively provide our services to our customers and cause harm to our reputation or competitive position.\nu\nInternal system or service failures, or failures in the systems or services of third parties on which we rely, could disrupt our business and impair our ability to effectively provide our services and products to our customers, which could damage our reputation and adversely affect our revenues and profitability.\nu\nCustomer systems failures could damage our reputation and adversely affect our revenues and profitability.\nu\nOur success depends, in part, on our ability to work with complex and rapidly changing technologies to meet the needs of our customers.\nu\nWe utilize artificial intelligence, which could expose us to liability or adversely affect our business, especially if we are unable to compete effectively with others in adopting artificial intelligence.\nu\nWe have classified contracts with the U.S. government, which may limit investor insight into portions of our business.\nu\nWe have made and continue to make acquisitions, investments, joint ventures and divestitures that involve numerous risks and uncertainties.\nu\nGoodwill represents a significant asset on our balance sheet and any impairment of this asset could negatively impact our results of operations, and shareholders’ equity. \nu\nWe depend on our teaming arrangements and relationships with other contractors and subcontractors. If we are not able to maintain these relationships, or if these parties fail to satisfy their obligations to us or the customer, our revenues, profitability and growth prospects could be adversely affected.\nu\nWe could incur significant liabilities and suffer negative publicity if our inspection or detection systems fail to detect bombs, explosives, weapons, contraband or other threats.\nu\nWe face risks associated with our international business.\nu\nChanges in tax laws and regulations or exposure to additional tax liabilities could adversely affect our financial results.\n16\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nINDUSTRY AND ECONOMIC RISKS\nWe depend on government agencies as our primary customers and if our reputation or relationships with these agencies were harmed, our future revenues and growth prospects could be adversely affected.\nOur revenues from contracts with the U.S. government (including all branches of the U.S. military), either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government, generated approximately 87% of our total revenue in both fiscal 2024 and 2023, and 86% in fiscal 2022. We expect to continue to derive most of our revenues from work performed under U.S. government contracts. Our reputation and relationships with the U.S. government, particularly with the agencies of the DoD and the U.S. Intelligence Community, are key factors in maintaining and growing our revenues, and enable us to provide informal input and advice to government entities and agencies prior to the development of a formal bid. In addition, negative publicity, including reports from the press or social media coverage, regardless of accuracy or completeness, and which could pertain to employee or subcontractor misconduct, conflicts of interest, poor contract performance, deficiencies in services, reports, products or other deliverables, security breaches or other security incidents or other aspects of our business, could harm our reputation with these agencies and with certain non-U.S. customers. Due to the sensitive nature of our work and our confidentiality obligations to our customers, and despite our ongoing efforts to provide transparency, we may be unable to or limited in our ability to respond to such negative publicity, which could also harm our reputation and our business. If our reputation is negatively affected or if we are unable to successfully maintain our relationships with government entities and agencies, certain customers could cease to do business with us and our ability to bid successfully for new business may be adversely affected, which could cause our actual results to differ materially and adversely from those anticipated. In addition, our ability to hire or retain employees and our standing in professional communities, to which we contribute and receive expert knowledge, could be diminished. If any of the foregoing occurs, the amount of business with the U.S. government and other customers could decrease, and our business, future revenues, financial condition, and growth prospects could be adversely affected.\nA decline in the U.S. government budget, changes in spending or budgetary priorities or delays in contract awards may significantly and adversely affect our future revenues and limit our growth prospects. \nRevenues under contracts with the DoD and U.S. Intelligence Community, either as a prime contractor or subcontractor to other contractors, represented approximately 48% of our total revenues for fiscal 2024, 49% of our total revenues for fiscal 2023 and 44% of our total revenues for fiscal 2022. U.S. government and DoD spending levels are difficult to predict and subject to significant risk. Laws and plans adopted by the U.S. government relating to, along with pressures on and uncertainty surrounding the U.S. federal budget, potential changes in budgetary priorities and defense spending levels, the appropriations process and the permissible federal debt limit, could adversely affect the funding for individual programs and delay purchasing or payment decisions by our customers. Considerable uncertainty exists regarding how future budget and program decisions will unfold, including the defense spending priorities of the U.S. Presidential Administration and Congress and what challenges potential budget reductions will present for us and our industry generally.\nCurrent U.S. government spending levels for defense-related or other programs may not be sustained. Future spending and program authorizations may not increase or may decrease or shift to programs in areas where we do not provide services or are less likely to be awarded contracts. Such changes in spending authorizations and budgetary priorities may occur as a result of uncertainty surrounding the federal budget and the federal government’s ability to meet its debt obligations, changes in the priorities of the U.S. Presidential Administration as a result of the recent election cycle, increasing political pressure and legislation, shifts in spending priorities from defense-related or other programs as a result of competing demands for federal funds, the number and intensity of military conflicts or other factors. For example, the conflicts between Russia and Ukraine and in the Middle East have resulted in increased security assistance to each of Ukraine and Israel to help preserve their territorial integrity, secure their borders, and with respect to the Russia/Ukraine conflict, improve interoperability with NATO. Changes in the priorities of the U.S. Presidential Administration in respect thereto could have an adverse impact on our results. In addition, if government funding relating to our contracts with the U.S. government or DoD becomes unavailable, or is reduced or delayed, or planned orders are reduced, our contracts or subcontracts under such programs may be terminated or adjusted by the U.S. government or the prime contractor. Our operating results could also be adversely affected by spending caps or changes in the U.S. government or the DoD’s budgetary priorities, as well as delays in program starts or the award of contracts or task orders under contracts.\nLeidos Holdings, Inc. Annual Report\n17\nTable of Contents\nPART I\nThe U.S. government also conducts periodic reviews of U.S. defense strategies and priorities, which may shift DoD or other budgetary priorities, reduce overall U.S. government spending, or delay contract or task order awards for defense-related or other programs from which we would otherwise expect to derive a significant portion of our future revenues. In addition, changes to the federal or DoD acquisition system and contracting models could affect whether and how we pursue certain opportunities and the terms under which we are able to do so. A significant decline in overall U.S. government spending, including in the areas of national security, intelligence, homeland security, and health and civilian services, a significant shift in its spending priorities, the substantial reduction or elimination of particular defense-related programs or significant delays in contract or task order awards for large programs could adversely affect our future revenues and results of operations and limit our growth prospects. In addition, our ability to grow in advanced technology areas, such as hypersonics programs, space systems, maritime and undersea systems, and classified programs, will also be affected by the overall budget environment, whether development programs transition to production and the timing of such transition, all of which are dependent on U.S. Government authorization and funding.\nBecause we depend on U.S. government contracts, a delay in the completion of the U.S. government’s budget and appropriations process could delay procurement of the products, services, and solutions we provide and adversely affect our future revenues.\nThe funding of U.S. government programs is subject to an annual congressional budget authorization and appropriations process. In years when the U.S. government does not complete its appropriations before the beginning of the new fiscal year on October 1, government operations are typically funded pursuant to a “continuing resolution,” which allows federal government agencies to operate at spending levels approved in the previous appropriations cycle but does not authorize new spending initiatives. When the U.S. government operates under a continuing resolution, delays can occur in the procurement of the products, services and solutions that we provide and may result in new initiatives being canceled. From time to time, we have experienced a decline in revenues in our fourth quarter as a result of this annual appropriations cycle, and we could experience similar declines in revenues from future delays in the appropriations process. When the U.S. government fails to complete its appropriations process or provide for a continuing resolution, a full or partial federal government shutdown may result. A federal government shutdown could, in turn, result in our incurrence of substantial labor or other costs without reimbursement under customer contracts, the delay or cancellation of key programs, or the delay, or cancellation of contract payments, which could have a negative effect on our cash flows and adversely affect our future results of operations. Congress appropriates funds on an annual fiscal year basis for many programs, even though the program performance period may extend over several years. Consequently, programs are often partially funded initially, and additional funds are committed only as Congress makes further appropriations. If we incur costs in excess of funds obligated on a contract, we may be at risk for reimbursement of those costs unless or until additional funds are obligated to the contract. In addition, if and when supplemental appropriations are required to operate the U.S. government or fund specific programs and passage of legislation needed to approve any supplemental appropriations bill is delayed, the overall funding environment for our business could be adversely affected. \nDue to the competitive process to obtain contracts and the likelihood of bid protests, we may be unable to achieve or sustain revenue growth and profitability.\nWe expect that a majority of the business that we seek in the foreseeable future will be awarded through a competitive bidding process. The U.S. government has increasingly relied on contracts that are subject to a continuing competitive bidding process, including GSA Schedule and other multi-award contracts, which has resulted in greater competition and increased pricing pressure. The competitive bidding process involves substantial costs, including labor cost and managerial time to prepare bids and proposals for contracts that may not be awarded to us, may be split among competitors, or that may be awarded but for which we do not receive meaningful task orders, and several risks, including the risk of inaccurately estimating the resources and costs that will be required to fulfill any contract we win. Following contract award, we may encounter significant expense, delay, contract modifications, or even cancellation of the contract award as a result of our competitors protesting the award of contracts to us. Any resulting loss or delay of start-up and funding of work under protested contract awards may adversely affect our revenues and profitability. In addition, multiple-award contracts require that we make sustained post-award efforts to obtain task orders under the contract. As a result, we may not be able to obtain these task orders or recognize revenues under these multiple-award contracts. We are also experiencing increased competition, which impacts our ability to obtain contracts; see the risk factor “We face intense competition that can impact our ability to obtain contracts and, therefore, affect our future revenues and growth prospects.” Our failure to compete effectively in this procurement environment would adversely affect our revenues and profitability.\n18\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nThe U.S. government may terminate, cancel, modify, renew on less favorable terms or curtail our contracts at any time prior to their completion, and if we do not replace them, this may adversely affect our future revenues and profitability.\nMany of the U.S. government programs in which we participate as a contractor or subcontractor extend for several years and include one or more base years and one or more option years. These programs are typically funded on an annual basis. Under our contracts, the U.S. government generally has the right not to exercise options to extend or expand our contracts and may otherwise terminate, cancel, modify or curtail our contracts at its convenience. Any decisions by the U.S. government to not exercise contract options or to terminate, cancel, modify, renew on less favorable terms or curtail our major programs or contracts would adversely affect our revenues, revenue growth and profitability.\nIn addition, we have experienced performance issues under certain of our contracts. Some of our contracts involve developing complex systems and products to achieve challenging customer goals in a competitive procurement environment. As a result, we sometimes experience technological, schedule or other performance difficulties, which have in the past and may in the future result in delays, cost overruns and failures in our performance of these contracts. If a government customer terminates a contract for default, we may be exposed to liability, including for excess costs incurred by the customer in procuring undelivered services and products from another source. Depending on the nature and value of the contract, a performance issue or termination for default could cause our actual results to differ from those anticipated and could harm our reputation.\nWe face intense competition that can impact our ability to obtain contracts and, therefore, affect our future revenues and growth prospects.\nOur business is highly competitive, and we compete with larger companies with greater name recognition, financial resources, and a larger technical staff. We also compete with smaller, more specialized companies that can concentrate their resources on particular areas. Additionally, we compete with the U.S. government’s own capabilities and federal non-profit contract research centers. For example, some customers, including the DoD, are turning to commercial contractors, rather than traditional defense contractors, for some products and services, and may utilize small business contractors or source work internally rather than hiring a contractor. The markets in which we operate are characterized by rapidly changing customer needs and technology and our success depends on our ability to invest in and develop products and services that address such needs. To remain competitive, we must consistently provide high value differentiated solutions to our customers that incorporate technology, superior service, and performance to our customers on a cost-effective basis while understanding customer priorities and maintaining customer relationships. Our competitors may be able to provide our customers with different or greater capabilities or technologies or better contract terms than we can provide, including technical qualifications, past contract experience, geographic presence, price and the availability of qualified professional personnel, or be willing to accept more risk or lower profitability in competing for contracts. \nSome of our competitors have made or could make acquisitions of businesses or establish teaming or other agreements among themselves or third parties, which could allow them to offer more competitive and comprehensive solutions. As a result of such acquisitions or arrangements, our current or potential competitors may be able to accelerate the adoption of new technologies that better address customer needs, devote more significant resources to bring these products and services to market, initiate or withstand substantial price competition, develop and expand their product and service offerings more quickly than we do or limit our access to certain suppliers. These competitive pressures in our market or our failure to compete effectively may result in fewer orders, reduced revenue and margins, and loss of market share. Further industry consolidation may also impact customers’ perceptions of the viability of smaller or even mid-size software firms and, consequently, customers’ willingness to purchase from such firms.\nDeterioration of economic conditions or weakening in credit or capital markets may have a material adverse effect on our business, results of operations and financial condition.\nVolatile, negative, or uncertain economic conditions, an increase in the likelihood of a recession, or concerns about these or other similar risks may negatively impact our customers’ ability and willingness to fund their projects. For example, declines in state and local tax revenues, as well as other economic declines, may result in lower government spending. Our customers reducing, postponing, or canceling spending on projects in respect of which we provide services may reduce demand for our services quickly and with little warning, which could have a material adverse effect on our business, results of operations, and financial condition.\nLeidos Holdings, Inc. Annual Report\n19\nTable of Contents\nPART I\nMoreover, instability in the credit or capital markets in the U.S. and related market-wide reduction in liquidity, or concerns or rumors about events of these kinds or similar risks, could affect the availability of credit or our credit ratings, making it relatively difficult or expensive to obtain additional capital at competitive rates, on commercially reasonable terms or in sufficient amounts, or at all, thus making it more difficult or expensive for us to access funds or refinance our existing indebtedness, or obtain financing for strategic projects and acquisitions. Such instability could also cause counterparties, including vendors, suppliers, and subcontractors, to be unable to perform their obligations or to breach their obligations to us under our contracts with them. In addition, instability in the credit or capital markets could negatively impact our customers’ ability to fund their projects and, therefore, utilize our services, which could have a material adverse effect on our business, results of operations, and financial condition.\nWe cannot predict the consequences of current or future geopolitical events, but they may adversely affect the markets in which we operate and our results of operations.\nOngoing instability and current conflicts in global markets, including in Eastern Europe, the Middle East, and Asia, and the potential for other conflicts and future terrorist activities and other recent geopolitical events throughout the world, including the ongoing conflict between Russia and Ukraine, the ongoing conflict in the Middle East, which continues to expand, and increased tensions in Asia, have created and may continue to create economic and political uncertainties and impacts that could have a material adverse effect on our business, operations, and profitability. These types of matters cause uncertainty in financial markets and may significantly increase the political, economic and social instability in the geographic areas in which we operate.\nIn addition, in connection with the current status of international relations with Russia, particularly in light of the conflict between Russia and Ukraine, the U.S. government has imposed enhanced export controls on certain products and sanctions on certain industry sectors and parties in Russia. The governments of other jurisdictions in which we operate, such as the European Union and Canada, may also implement sanctions or other restrictive measures. These potential sanctions and export controls, as well as any responses from Russia, could adversely affect us and/or our supply chain, business partners, or customers.\nGlobal supply chain issues and inflationary pressures have disrupted supply and increased the prices of goods and services, which could raise the costs associated with providing our services, diminish our ability to compete for new contracts or task orders and reduce customer buying power.\nFor a variety of reasons, the global economy in which we operate has faced, and may continue to face, heightened inflationary pressure, impacting the cost of doing business in both supply and labor markets. Although inflation has moderated somewhat in 2024, these inflationary pressures have been and could continue to be exacerbated by geopolitical turmoil and economic policy actions. We generate revenue through various fixed-price and multi-year government contracts, our primary customer being the U.S. government, which has traditionally been viewed as less affected by inflationary pressures. However, our approach to include modest annual price escalations in our bids for multi-year work may be insufficient to account for and mitigate inflationary cost pressures, which may result in cost overruns on contracts. This could result in reduced profits or even losses if inflation increases, particularly for fixed-priced contracts and our longer-term multi-year contracts as contractual prices become less favorable to us over time. In the competitive environment in which we operate as a government contractor, the lack of pricing leverage and power to renegotiate long-term, multi-year contracts, coupled with reduced customer buying power as a result of inflation, could reduce our profits, disrupt our business or otherwise materially adversely affect our results of operations.\nLEGAL AND REGULATORY RISKS\nOur failure to comply with various complex procurement rules and regulations could result in our being liable for penalties, including termination of our U.S. government contracts, disqualification from bidding on future U.S. government contracts and suspension or debarment from U.S. government contracting.\nWe must comply with laws and regulations relating to the formation, administration and performance of U.S. government contracts, which affect how we do business with our customers. Such laws and regulations may impose added costs on our business and our failure to comply with them may lead to civil or criminal penalties, termination of our U.S. government contracts, or suspension or debarment from contracting with federal agencies. For additional background on the regulations that apply to our business and the related compliance risks, see “Regulation” within Item 1 of this Annual Report on Form 10-K and the risk factor “Our business is subject to governmental review and investigation, which could adversely affect our financial position, operating results and growth prospects.” \n20\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nGovernment contract laws and regulations can impose terms or obligations that are different than those typically found in commercial transactions. One of the significant differences is that the U.S. Government may terminate any of our government contracts, not only for default based on our performance but also at its convenience. Generally, prime contractors have a similar right under subcontracts related to government contracts. If a contract is terminated for convenience, we typically would be entitled to receive payments for our allowable costs incurred and the proportionate share of fees or earnings for the work performed, but we would receive no payment or other consideration for the loss of revenue or profit associated with the future work that was cancelled. If a contract is terminated for default, the U.S. Government could seek the return of any amounts previously paid to us under the contract and also seek to recover from us any added costs for having another contractor complete the work, exposing us to liability and adversely affecting our ability to compete for future contracts and orders. In addition, the U.S. Government could terminate a prime contract under which we are a subcontractor, notwithstanding the fact that our performance and the quality of the products or services we delivered were consistent with our contractual obligations as a subcontractor. Similarly, the U.S. Government could indirectly terminate a program or contract by not funding it, or by reducing the amount of funding previously obligated to the program or contract. The decision to terminate programs or contracts for convenience or default could adversely affect our business and future financial performance.\nThe U.S. government may adopt new contract rules and regulations or revise its procurement practices in a manner adverse to us at any time.\nOur industry has experienced, and we expect it will continue to experience, significant changes to business practices as a result of an increased focus on affordability, efficiencies, and recovery of costs, among other items. From time to time, new laws and regulations are enacted, and government agencies adopt new interpretations and enforcement priorities relative to laws and regulations already in effect. U.S. government agencies may face restrictions or pressure regarding the type and amount of services that they may obtain from private contractors. Legislation, regulations and initiatives dealing with procurement reform, mitigation of potential conflicts of interest and environmental responsibility or sustainability as well as any resulting shifts in the buying practices of U.S. government agencies (such as increased usage of fixed-price contracts, multiple-award contracts and small business set-aside contracts) could have adverse effects on government contractors, including us. Any of these changes could impair our ability to obtain new contracts or renew our existing contracts when customers recompete those contracts. Any new contracting requirements or procurement methods could be costly or administratively difficult to implement and could adversely affect our future revenues, profitability, and prospects.\nAdditionally, the DoD and other customers are increasingly pursuing rapid acquisition pathways and procedures for new technologies, including through so-called “other transaction authority” agreements (\"OTAs\"). OTAs are exempt from many traditional procurement laws, including the FAR, and an OTA award may be subject, in certain cases, to the condition that a significant portion of the work under the OTA is performed by a non-traditional defense contractor or that a portion of the cost of the prototype project is funded by non-governmental sources. If we cannot successfully adapt to our customers’ rapid acquisition processes, then we may lose strategic new business opportunities in high-growth areas, and our future performance and results could be adversely affected.\nApplication of the U.S. government's organizational conflict of interest (OCI) rules could limit our ability to successfully compete for new contracts or task orders, which would adversely affect our results of operations.\nThe U.S. government has adopted rules and practices that are designed to avoid or mitigate organizational conflicts of interest (\"OCIs\"). OCIs may arise from circumstances in which a contractor has:\nu\nimpaired objectivity during performance;\nu\nunequal access to non-public information; or\nu\nthe ability to set the “ground rules” for another procurement for which the contractor intends to compete.\nU.S. federal contacting rules require that government contracting officers identify, analyze and address potential OCIs for each acquisition they conduct. The rules specify a number of methods contracting officers may use to address OCIs, and each contracting officer has significant discretion in deciding whether an OCI exists, and if so, how it should be addressed. As a result, it may be difficult for us to predict whether a given contracting opportunity will be found to pose an actual or potential OCI, whether such an OCI will be determined to be disqualifying, and if not disqualifying what steps we would be required to take in order to be found eligible to compete for and perform the work. \nLeidos Holdings, Inc. Annual Report\n21\nTable of Contents\nPART I\nSimilarly, OCIs remain an active area of bid protest litigation, increasing the likelihood that competitors may leverage such arguments in an attempt to overturn agency award decisions. To the extent that the U.S. government's OCI laws, regulations, and rules or interpretations thereof limit our ability to successfully compete for new contracts or task orders with the U.S. government, either because of OCI issues arising from our business, or because companies with which we are affiliated, or with which we otherwise conduct business, create OCI interest issues for us, our financial metrics and results of operations could be materially and adversely affected.\nAs a U.S. government contractor, our partners and we are subject to reviews, audits and cost adjustments by the U.S. government, which could adversely affect our profitability, cash position or growth prospects if resolved unfavorably to us.\nU.S. government contractors (including their subcontractors and others with whom they do business) operate in a highly regulated environment and are routinely audited and reviewed by the U.S. government and its agencies, including the DCAA, DCMA, the DoD Inspector General, and others. These agencies review a contractor’s performance on government contracts, cost structure, indirect rates and pricing practices, compliance with applicable contracting and procurement laws, regulations, terms, and standards, and the adequacy of our systems and processes in meeting government requirements. They also review the adequacy of the contractor’s compliance with government standards for its business systems, including a contractor’s accounting system, earned value management system, estimating system, materials management and accounting system, property management system, and purchasing system.\nAs a result of increased scrutiny on contractors and U.S. government agencies, audits and reviews are conducted rigorously and the applicable standards are strictly interpreted, increasing the likelihood of an audit or review resulting in an adverse outcome. A finding of significant control deficiencies in our business system audits or other reviews can result in the suspension of payments or lower billing rates to our U.S. government customers until the control deficiencies are corrected and the DCMA accepts our remediations. Government audits and reviews may conclude that our practices are not consistent with applicable laws and regulations and result in adjustments to contract costs and mandatory customer refunds. Such adjustments can be applied retroactively, which could result in significant customer refunds. Our receipt of adverse audit findings or the failure to obtain an “approved” determination of our various business systems from the responsible U.S. government agency could significantly and adversely affect our business, including our ability to bid on new contracts and our competitive position in the bidding process. A determination of noncompliance could also result in the U.S. government imposing penalties and sanctions against us, including reductions of the value of contracts, contract modifications reflecting less favorable terms or termination, withholding of payments, the loss of export/import privileges, administrative or civil judgments and liabilities, criminal judgments or convictions, liabilities and consent or other voluntary decrees or agreements, other sanctions, the assessment of penalties, fines or compensatory, treble or other damages or non-monetary relief or actions, suspension or debarment, suspension of payments and increased government scrutiny that could negatively impact our reputation, delay or adversely affect our ability to invoice and receive timely payment on contracts, perform contracts or compete for contracts with the U.S. government. As of January 3, 2025, indirect cost audits by the DCAA remain open for fiscal 2022 and subsequent fiscal years. Although we have recorded contract revenues based upon our estimate of costs that we believe will be approved upon final audit or review, we cannot predict the outcome of any ongoing or future audits or reviews and adjustments and, if future adjustments exceed our estimates, our profitability may be adversely affected.\nOur business is subject to governmental review and investigation, which could adversely affect our financial position, operating results and growth prospects.\nWe are routinely subject to governmental investigations relating to compliance with various laws and regulations with respect to our role as a contractor to federal, state and local government customers and in connection with performing services in countries outside the United States. If a review or investigation identifies improper or unlawful activities, we may be subject to disgorgement of profits, fines, damages, litigation, civil or criminal penalties, exclusion from sales channels or sales opportunities, injunctions, or administrative sanctions, including the termination of contracts, the triggering of price reduction clauses, suspension of payments, suspension or debarment from doing business with governmental agencies or other consequences. We may suffer harm to our reputation if allegations of impropriety are made against us, which would impair our ability to win new contract awards or receive contract renewals. Penalties and sanctions are not uncommon in our industry. If we incur a material penalty or administrative sanction or otherwise suffer harm to our reputation, our revenues, profitability, cash position and future prospects could be adversely affected. More generally, increases in scrutiny and investigations into business practices and major programs supported by contractors from government organizations, legislative bodies, or agencies may lead to increased legal costs and may harm our reputation, revenues, profitability and growth prospects. For a description of our current legal proceedings, see “Item 3. Legal Proceedings” along with “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\n22\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nInvestigations, audits, claims, disputes, enforcement actions, litigation, arbitration, or other legal proceedings could require us to pay potentially large damage awards or penalties and could be costly to defend, which would adversely affect our cash balances and profitability, and could damage our reputation.\nWe are subject to and may become a party to various other litigation, claims, investigations, audits, enforcement actions, arbitrations, or other legal proceedings that arise from time to time in the ordinary course of our business. Adverse judgments or settlements in some or all of these legal disputes may result in significant monetary damages, penalties, or injunctive relief against us. Any claims or litigation could be costly to defend, and even if we are successful or fully indemnified or insured, they could damage our reputation and make it more difficult to compete effectively or obtain adequate insurance in the future, and responding to any action may result in a significant diversion of management’s attention and resources. Litigation and other claims are subject to inherent uncertainties and management’s view of these matters may change in the future. For a description of our current legal proceedings, see “Item 3. Legal Proceedings” along with “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nOur business and operations expose us to numerous legal and regulatory requirements, and any violation of these requirements could harm our business.\nWe are subject to numerous state, federal and international laws and directives and regulations in the U.S. and abroad that involve matters central to our business, including but not limited to, data privacy and security, employment and labor relations, immigration, taxation, anti-corruption, anti-bribery, import-export controls, trade restrictions, internal and disclosure control obligations, securities regulation and anti-competition restrictions. Compliance with legal requirements is costly, time-consuming and requires significant resources. We also conduct business in certain identified growth areas, such as health information technology, energy and environmental services, which are highly regulated and may expose us to increased compliance risk. Violations of one or more of these legal requirements in the conduct of our business could result in significant fines and other damages, criminal sanctions against us or our officers, prohibitions on doing business and damage to our reputation. Violations of these regulations or contractual obligations related to regulatory compliance in connection with the performance of customer contracts could also result in liability for significant monetary damages, fines and criminal prosecution, unfavorable publicity, and other reputational damage, restrictions on our ability to compete for certain work and allegations by our customers that we have not performed our contractual obligations.\nOur business is subject to complex and evolving laws and regulations regarding data privacy and security, which could subject us to investigations, claims, or monetary penalties against us, require us to change our business practices, or otherwise adversely affect our revenues and profitability.\nWe are subject to various laws and regulations in the U.S. and globally relating to data privacy and security. These laws and regulations are complex, constantly evolving, and may be subject to significant change in the future. In addition, the application, interpretation and enforcement of these laws and regulations are often uncertain, particularly in new and rapidly evolving areas of technology, and may differ in material respects among jurisdictions, interpreted and applied inconsistently among jurisdictions or in a manner that is inconsistent with our current policies and practices, all of which can make compliance challenging and costly, and expose us to related risks and liabilities.\nIn the U.S., numerous federal, state, and local data privacy and security laws and regulations govern the collection, sharing, use, retention, disclosure, security, storage, transfer, and other processing of personal information, including protected health information. Numerous other states also are enacting or considering, comprehensive state-level data privacy and security laws.\nAs a contractor supporting defense, health care, and national security customers, we are also subject to additional, specific regulatory compliance requirements relating to data privacy and security. Under DFARS and other federal regulations, we are required to implement the security and privacy controls in National Institute of Standards and Technology Special Publications on certain of our networks and information technology systems. To the extent that we do not comply with applicable security and control requirements, and there is unauthorized access or disclosure of sensitive information (including personal information), this could potentially result in a contract termination or loss of intellectual property, which could materially and adversely affect our business and financial results and lead to reputational harm. We will also be subject to numerous emerging and as yet unspecified cybersecurity requirements under the FAR and through federal regulation, to include the DOD Cybersecurity Maturity Model Certification (“CMMC”) program, which, once implemented, will require successful assessment by a third party against specified cyber controls. Should we or our supply chain fail to implement these new requirements, this may adversely affect our ability to receive awards or execute on relevant government programs. We are in the process of evaluating our readiness against these new requirements and while we have confidence we will meet or \nLeidos Holdings, Inc. Annual Report\n23\nTable of Contents\nPART I\nexceed requirements, to the extent we do not, we will be unable to bid on such contract awards, which could adversely impact our revenue and our profitability.\nThe overarching complexity of data privacy and security laws and regulations around the world poses a compliance challenge that could manifest in costs, damages, or liability in other forms as a result of failure to implement proper programmatic controls, failure to adhere to those controls, or the breach of applicable data privacy and security requirements by us, our employees, our business partners (including our service providers, suppliers or subcontractors) or our customers. We also expect that there will continue to be new proposed laws, regulations, and industry standards concerning data privacy and security, and we cannot yet determine the impact such future laws, regulations and standards, or amendments to or re-\ninterpretations of existing laws, regulations or standards, may have on our business. Any failure or perceived failure by us, our service providers, suppliers, subcontractors, or other business partners to comply with applicable laws, regulations, our public privacy policies and other public statements about data privacy and security and other obligations in these areas could result in regulatory or government actions lawsuits against us (including civil claims, such as representative actions and other class action-type litigation), legal liability, monetary penalties, fines, sanctions, damages and other costs, orders to cease or change our processing of data, changes to our business practices, diversion of internal resources, and harm to our reputation, all of which could adversely affect our business, financial condition and results of operations. We may also incur substantial expenses in implementing and maintaining compliance with such laws, regulations, and other obligations. For additional background on the data privacy and security laws that apply to our business and the related compliance risks, see “Regulation” within Item 1 of this Annual Report on Form 10-K.\nEnvironmental matters, including unforeseen costs associated with compliance and remediation efforts and government and third-party claims, could have a material adverse effect on our reputation and our financial position, results of operations, and cash flows.\nOur operations are subject to and affected by various federal, state, local, and foreign environmental laws and regulations, as they may be expanded, changed, or enforced differently over time. Compliance with these existing and evolving environmental laws and regulations requires and is expected to continue to require significant operating and capital costs. We may be subject to substantial administrative, civil, or criminal fines, penalties, or other sanctions (including suspension and debarment) for violations. If we are found to be in violation of the Federal Clean Air Act or the Clean Water Act, the facility or facilities involved in the violation could be placed by the Environmental Protection Agency on a list of facilities that generally cannot be used in performing on U.S. government contracts until the violation is corrected.\nStricter or different remediation standards or enforcement of existing laws and regulations; new requirements, including regulation of new substances; discovery of previously unknown contamination or new contaminants; imposition of fines, penalties, or damages (including natural resource damages); a determination that certain remediation or other costs are unallowable; rulings on allocation or insurance coverage; and/or the insolvency, inability or unwillingness of other parties to pay their share, could require us to incur material additional costs in excess of those anticipated.\nWe may become a party to legal proceedings and disputes involving government and private parties (including individual and class actions) relating to alleged impacts from pollutants released into the environment, including bodily injury and property damage. These matters could result in material compensatory or other damages, remediation costs, penalties, non-\nmonetary relief, and adverse allowability or insurance coverage determinations.\nThe impact of these factors is difficult to predict, but one or more of them could harm our reputation and business and have a material adverse effect on our financial position, results of operations and cash flows.\nIncreasing attention and changing expectations from governmental authorities, customers, and our employees with respect to our ESG-related practices may impose additional costs on us or expose us to new or additional risks.\nThere is increased attention from governmental organizations, customers, employees, and other stakeholders globally on companies’ environmental, social, and governance (“ESG”) practices and disclosures such as diversity, equity and inclusion, workplace culture, community investment, environmental management, climate impact, and information security. We may be expected to expend resources to monitor, report on, and adopt policies and practices that we believe will improve alignment with our evolving ESG strategy and goals, as well as ESG-related standards and expectations of legal regimes and stakeholders such as customers, investors, stockholders, raters, employees, and business partners.\n24\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nIf our practices and disclosures do not meet evolving rules and regulations or our stakeholder expectations and standards (or if we are viewed negatively based on positions we do or do not take or work we do or do not perform or cannot publicly disclose for certain customers and industries), then our reputation, our ability to attract or retain leading experts, employees and other professionals and our ability to attract new business and customers could be negatively impacted, as could our attractiveness as an investment, service provider, employer, or business partner. Similarly, our failure or perceived failure in our efforts to execute our ESG strategy, or to satisfy various reporting standards within the timelines expected by us and stakeholders or at all, could also result in similar negative impacts. Organizations that provide information to investors on corporate governance and related matters have developed rating processes for evaluating companies on their approach to ESG matters, and unfavorable ratings of our ESG efforts may lead to negative investor sentiment, diversion of investment to other companies, and difficulty in hiring skilled employees. In addition, complying or failing to comply with existing or future federal, state, local, and foreign ESG legislation and regulations applicable to our business and operations, which may conflict with one another, including those related to greenhouse gas emissions, climate change, or other matters could cause us to incur additional compliance and operational costs or actions and suffer reputational harm, which could adversely affect our business. In addition, our share price and demand for our securities could be adversely affected.\nBUSINESS AND OPERATIONAL RISKS\nThe effects of an epidemic, pandemic, or similar outbreak have negatively impacted and could negatively impact, our business and financial results. \nAny epidemics, pandemics, or similar outbreaks have in the past created (as in the case of COVID-19 and its variants) and could again create economic uncertainty and disruptions to the global economy that could adversely affect our businesses, or could lead to operational difficulties, including travel limitations, that could impair our ability to manage or conduct our business. Any future epidemic, pandemic, or similar outbreak may have similar impacts, and we cannot currently anticipate the potential impact on our business and results of operations.\nMisconduct of employees, subcontractors, agents, suppliers, business partners or joint ventures and others working on our behalf could cause us to lose existing contracts or customers and adversely affect our ability to obtain new contracts and could have a material adverse impact on our business, reputation and future results.\nMisconduct encompasses a wide range of improper activities that could pose risks to our business. This includes fraud, falsifying time records or other documentation, and violations of laws such as the Anti-Kickback Act. Non-compliance with our internal policies and procedures, as well as failure to adhere to federal, state, or local government procurement regulations—including those related to the use and protection of classified or sensitive information—also constitute misconduct. Examples include failure to comply with legislation on labor pricing and costs in government contracts, violating environmental, health, or safety laws, engaging in bribery of foreign government officials, breaching import-export controls, and participating in improper lobbying or similar activities.\nAny incidents of data loss or information security lapses that compromise personal information or lead to the improper use or disclosure of sensitive or classified data could negatively impact us. We could face legal claims, incur remediation costs, and be subjected to regulatory investigations or sanctions. Such events might corrupt or disrupt our systems or those of our customers, impair our ability to provide services, result in the loss of existing and future contracts, and impose indemnity obligations. The damage to our reputation could be significant, leading to other potential liabilities. See also the risk factor: “Cybersecurity breaches and other information security incidents could negatively impact our business and financial results, impair our ability to effectively provide our services to our customers and cause harm to our reputation or competitive position.”\nWhile we have established policies, procedures, training programs, and other compliance controls designed to prevent and detect misconduct, these measures may not be effective, exposing us to unforeseen risks or losses. This risk may increase as we continue to grow and engage with new partners. In our regular business operations, we form and participate in joint ventures—joint efforts or business arrangements of various types—which can introduce additional compliance complexities. Failure to comply with applicable laws or regulations could damage our reputation and subject us to administrative, civil, or criminal investigations and enforcement actions. Potential repercussions include fines and penalties, restitution or other damages, and the loss of security clearances. We might also face the loss of current and future customer contracts, revocation of privileges, and other sanctions such as suspension or debarment from contracting with federal, state, or local government agencies. Any of these outcomes would adversely affect our business, reputation, and future results. \nLeidos Holdings, Inc. Annual Report\n25\nTable of Contents\nPART I\nA failure to attract, retain, and develop talent with critical skills, including our leadership team, would adversely affect our ability to execute our strategy and may disrupt our operations.\nOur continued success and ability to compete in a highly competitive environment depends on our ability to attract, retain and develop highly trained and skilled technical and professional talent. Competition for skilled talent is intense, and the costs associated with attracting and retaining them are high and made even more competitive as a result of the external environment, including increasing rates of job transition and low unemployment. In addition, many U.S. government programs require contractors to have security clearances, some of which can be difficult and time-consuming to obtain and talent with such security clearances are in great demand. As a result, it is difficult to retain employees and meet all of our needs for employees in a timely manner, which may affect our growth. Although we intend to continue to devote significant resources to attracting, retaining and developing qualified employees, we may not be able to attract, retain, and effectively develop these employees. Any failure to do so could impair our ability to perform our contractual obligations efficiently and on schedule to meet our customers’ needs and win new business, which could adversely affect our future results. We believe our success will also depend on the continued employment of a highly qualified and experienced senior leadership team and its ability to retain existing business, generate new business, execute our business plans in an efficient and effective manner, and our ability to adequately plan for the succession of our senior leadership team and continually develop new members of senior leadership. An inability to retain appropriately qualified and experienced senior executives, our failure to do adequately succession planning, or our failure to continue to develop new leaders could cause us to lose customers or new business.\nWe may not realize the full amounts reflected in our backlog as revenues, which could adversely affect our expected future revenues and growth prospects.\nAs of January 3, 2025, our total backlog was $43.6 billion, including $8.4 billion in funded backlog. Due to the U.S. government’s ability to not exercise contract options or to terminate, modify, or curtail our programs or contracts and the rights of our non-U.S. government customers to terminate contracts and purchase orders in certain circumstances, we may realize less than expected revenues or may never realize revenues from some of the contracts that are included in our backlog. Our unfunded backlog, in particular, contains management’s estimate of amounts expected to be realized on unfunded contract work that may never be realized as revenues. If we fail to realize as revenues amounts included in our backlog, our future revenues, profitability and growth prospects could be adversely affected.\nOur earnings and profitability may vary based on the mix of our contracts and may be adversely affected by our failure to estimate and manage costs, time, and resources accurately.\nWe generate revenues under various types of contracts, including cost-reimbursement, FPIF, T&M, FPLOE and FFP contracts. Our earnings and profitability may vary materially depending on changes in the proportionate amount of revenues derived from each type of contract, the nature of services or products provided, the achievement of performance objectives, and the stage of performance at which the right to receive fees, particularly under incentive-fee and award-fee contracts, is finally determined. Cost-reimbursement and T&M contracts are generally less profitable than FFP contracts. Our operating results in any period may also be affected, positively or negatively, by customers’ variable purchasing patterns of our more profitable proprietary products.\nOur profitability is adversely affected when we incur contract costs that we cannot bill to our customers. To varying degrees, each of our contract types involves some risk of underestimating the costs and resources necessary to fulfill the contract. While FFP contracts allow us to benefit from cost savings, these contracts also increase our exposure to the risk of cost overruns. Revenues from FFP contracts represented approximately 43% of our total revenues for fiscal 2024. When making proposals on these types of contracts, we rely heavily on our estimates of costs and timing to complete the associated projects, as well as assumptions regarding technical issues. In each case, our failure to accurately estimate costs or the resources and technology needed to perform our contracts or to effectively manage and control our costs during performance could result, and in some instances has resulted, in reduced profits or losses. More generally, any increased or unexpected costs or unanticipated delays in the performance of our contracts, including costs and delays caused by contractual disputes or other factors outside of our control, such as performance failures of our subcontractors, rising inflationary pressures, and fluctuations in interest rates, natural disasters or other force majeure events, could make our contracts less profitable than expected or unprofitable.\n26\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nWe use estimates in recognizing revenues, and if we make changes to estimates used in recognizing revenues, our profitability may be adversely affected.\nWe recognize revenue on our service-based contracts primarily over time as there is a continuous transfer of control to the customer throughout the contract as we perform the promised services, which generally requires estimates of total costs at completion, fees earned on the contract, or both. This estimation process, particularly due to the technical nature of the services performed, and the long-term nature of certain contracts, is complex and involves significant judgment. Adjustments to original estimates are often required as work progresses, experience is gained and additional information becomes known, even though the scope of the work required under the contract may not change. Any adjustment as a result of a change in estimate is recognized as events become known. Changes in the underlying assumptions, circumstances or estimates could result in adjustments that may adversely affect our future financial results. For a discussion of our use of estimates in the preparation of our consolidated financial statements, see “Critical Accounting Estimates” in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this Report, “Note 3—Summary of Significant Accounting Policies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nCybersecurity breaches and other information security incidents could negatively impact our business and financial results, impair our ability to effectively provide our services to our customers and cause harm to our reputation or competitive position.\nAs a government contractor and a provider of information technology services operating in multiple regulated industries and geographies, we and our service providers, suppliers and subcontractors collect, store, transmit, and otherwise process personal, confidential, proprietary, and sensitive information, including protected health information, personnel information, personal information, classified information, controlled unclassified information, intellectual property and financial information, concerning our business, employees, and customers. Therefore, we are continuously exposed to unauthorized attempts to compromise access, release or otherwise compromise such information through cyber-attacks and other information security threats, including, among other things, physical break-ins, theft, denial-of-service attacks, worms, computer viruses, software bugs, malicious or destructive code, social engineering, phishing attacks and impersonating authorized users, credential stuffing, account takeovers, insider threats, malfeasance or improper access by employees or service providers, human error, fraud, use of AI, “bots” or other automation software, or other similar disruptions. We are also exposed to hackers who have requested “ransom” in exchange for not disclosing information or restoring access to information or systems. These techniques may be perpetrated by internal bad actors, such as employees or contractors, or by third parties (including traditional computer hackers, persons involved with well-funded organized crime or state-sponsored actors). Any electronic or physical break-in or other security breach or compromise of our information technology systems and networks or facilities, or those of our service providers, suppliers, joint ventures or subcontractors, may jeopardize the confidentiality, integrity or availability of information, including personal, confidential, proprietary or sensitive information, stored or transmitted through these systems and networks or stored in those facilities. This could lead to disruptions in mission-\ncritical systems, unauthorized access to or release of personal, confidential, proprietary, sensitive or otherwise protected information and corruption of data or systems. We could also be subject to operational downtimes, delays and other detrimental impacts on our operations or ability to provide products and services to our customers. We are also increasingly subject to customer-driven cybersecurity certification requirements, including but not limited to CMMC, which are expected to be necessary to win future contracts. Security incidents could also result in liability, trigger other obligations under such contracts, or increase the difficulty of winning future contracts. Many statutory requirements, both in the U.S. and abroad, also include different obligations for companies to provide notice of information security incidents involving certain types of information (including obligations to notify affected individuals and regulators in the event of cybersecurity breaches involving certain personal information), which could result from breaches of our service providers, our suppliers or subcontractors.\nAlthough we have implemented policies, procedures and controls designed to protect against, detect and mitigate these threats and attacks, we and our service providers, suppliers, joint ventures, and subcontractors have faced and continue to face advanced and persistent attacks on our and their information systems. We cannot guarantee that future incidents will not occur, and if an incident does occur, our incident response planning may not prove fully adequate. We may also not be able to mitigate its impacts successfully. Techniques used by others to gain unauthorized access to personal, confidential, proprietary, or sensitive information or disrupt systems and networks for economic or strategic gain are constantly evolving, increasingly sophisticated, increasingly difficult to detect and successfully defend against and may see their frequency increased, and effectiveness enhanced, by the use of AI. Further, cybersecurity risks may be heightened as a result of ongoing global conflicts such as the military conflict between Russia and Ukraine and the related sanctions imposed by the United States and other countries, or the ongoing conflict in the Middle East, which continues to expand.\nLeidos Holdings, Inc. Annual Report\n27\nTable of Contents\nPART I\nWe do not control our service providers and our ability to monitor their cybersecurity is limited, so we cannot ensure the cybersecurity measures they take will be sufficient to protect any information we share with them. Due to applicable laws and regulations or contractual obligations, we may be held accountable for cybersecurity breaches or other information security incidents attributed to our service providers as they relate to the information we share with them.\nWe seek to detect and investigate all information security incidents and to prevent their occurrence, prolongation, or recurrence. We continue to invest in and improve our threat protection, detection and mitigation policies, procedures and controls. In addition, we work with other companies in the industry and government participants on increased awareness and enhanced protections against information security and malicious insider threats. However, because of the evolving nature and sophistication of these security threats, which can be difficult to detect, there can be no assurance that our policies, procedures and controls, or those of our service providers, suppliers, or subcontractors, have protected against, detected, mitigated or will detect, prevent or mitigate, any of these threats and we cannot predict the full impact of any such past or future incident. We may be currently unaware of certain vulnerabilities or lack the capability to detect them, which may allow them to persist in our information technology environment over long periods, and, even if discovered, it could take considerable time for us to obtain full and reliable information about the extent, amount and type of information compromised, and our remediation efforts may not be completely successful. As cybersecurity threats continue to evolve, we may be required to expend significant additional resources to continue to modify or enhance our protective measures or to investigate or remediate any information security vulnerabilities, cybersecurity breaches or other information security incidents.\nWe may also experience similar security threats to the information technology systems we develop, install, or maintain under customer contracts. Although we work cooperatively with our customers and other business partners, including our service providers, suppliers, and subcontractors, to seek to minimize the potential for and impact of cyber-attacks and other security threats, we must rely on the safeguards put in place by those entities. See also the risk factor “Internal system or service failures, or failures in the systems or services of third parties on which we rely, could disrupt our business and impair our ability to effectively provide our services and products to our customers, which could damage our reputation and adversely affect our revenues and profitability.”\nThe occurrence of any unauthorized access to, attacks on cybersecurity breaches of other information security threats to our or our service providers’, suppliers’ or subcontractors’ information technology infrastructure, systems or networks or data, or our failure to make adequate or timely disclosure to the public, regulators, or law enforcement agencies following any such event, could disrupt our infrastructure, systems, or networks or those of our customers, impair our ability to provide services to our customers and may jeopardize the security of data collected, stored, transmitted or otherwise processed through our information technology infrastructure, systems and networks. As a result, we could be exposed to claims, fines, penalties, loss of revenues, product development delays, compromise, corruption, or loss of confidential, proprietary, or sensitive information (including personal information or technical business information), contract terminations and damages, remediation costs and other costs and expenses, regulatory investigations or sanctions, indemnity obligations, and other potential liabilities. Any of the foregoing could adversely affect our reputation, ability to win work on sensitive contracts or loss of current and future contracts (including sensitive U.S. government contracts), business operations and financial results. While we have insurance against some cyber-risks and attacks, our insurer may deny coverage as to any future claim, our insurance coverage may not be sufficient to offset the impact of a material loss event, and such insurance may increase in cost or cease to be available on commercial terms in the future.\nInternal system or service failures, or failures in the systems or services of third parties on which we rely, could disrupt our business and impair our ability to effectively provide our services and products to our customers, which could damage our reputation and adversely affect our revenues and profitability.\nAny system or service disruptions, including those caused by ongoing projects to improve our information technology systems and networks and the delivery of services, whether through our shared services organization or outsourced services, if not anticipated and appropriately mitigated, could materially and adversely affect our business including, among other things, an adverse effect on our ability to perform on contracts, bill our customers for work performed on our contracts, collect the amounts that have been billed and produce accurate financial statements in a timely manner. We, and the service providers, suppliers and subcontractors on which we rely, are also subject to systems failures, including network, software or hardware failures, whether caused by us, third-party service providers, cybersecurity threats, malicious insiders, software bugs or errors, natural disasters, power shortages, terrorist attacks, pandemics or other events, which could cause loss of data and interruptions or delays in our business, cause us to incur remediation costs, subject us to claims and damage our reputation. In addition, the failure or disruption of our communications, or those of our service providers, suppliers or subcontractors, could cause us to interrupt or suspend our operations or otherwise adversely affect our business. Our property and business \n28\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\ninterruption insurance may be inadequate to compensate us for all losses resulting from any system or operational failure or disruption.\nOur business is subject to disruption caused by physical or transition risks that could adversely affect our operations, profitability and overall financial position.\nWe have significant operations, including infrastructure, information technology systems, research facilities, and centers of excellence, located in regions that may be exposed to physical risks, such as hurricanes, earthquakes, other damaging storms, water levels, wildfires and other natural disasters, including places such as Alabama, Florida, California, and Texas. Our subcontractors and suppliers are also subject to physical risks that could affect their ability to deliver or perform under a contract, including as a result of disruptions to their workforce and critical industrial infrastructure needed for normal business operations. Although we maintain crisis management and disaster response plans, such events could make it difficult or impossible for us to deliver our services to our customers, could decrease demand for our services, could make existing customers unable or unwilling to fulfill their contractual requirements to us, including their payment obligations, and could cause us to incur substantial expense, including expenses or liabilities arising from potential litigation. If insurance or other risk transfer mechanisms are unavailable or insufficient to recover all costs or if we experience a significant disruption to our business due to a natural disaster, it could adversely affect our financial position, results of operations, and cash flows.\nThere are also concerns over the risks of climate change and related environmental sustainability matters. In addition to physical risks, climate change risks include longer-term shifts in climate patterns, such as extreme heat, rising sea levels, and more frequent and prolonged drought. Such events could disrupt certain of our operations or those of our customers or third parties on which we rely, including direct damage to assets and indirect impacts from supply chain disruption and market volatility. We could also incur significant costs to improve the climate resiliency of our infrastructure and supply chain and otherwise prepare for, respond to, and mitigate the effects of climate change. Additionally, transitioning to a low-carbon economy may entail extensive policy, legal, technology and market initiatives. Such changes could result in laws, regulations or policies that significantly increase our direct and indirect operational and compliance burdens, which could adversely affect our financial condition and results of operations. We monitor developments in climate change-related laws, regulations and policies for their potential effect on us. However, we currently are not able to accurately predict the materiality of any potential costs associated with such developments. \nIn addition, our reputation and customer relationships may be negatively impacted as a result of our practices and policies, actual or perceived, related to climate change, including our involvement, or our customers’ involvement, in certain industries or projects associated with causing or exacerbating climate change, as well as any decisions we make to continue to conduct or change our activities in response to considerations relating to climate change.\nCustomer systems failures could damage our reputation and adversely affect our revenues and profitability.\nMany of the systems and networks that we develop, install and maintain for our customers involve managing and protecting personal information and information relating to national security and other sensitive government functions. While we have programs designed to comply with relevant data privacy and security laws and restrictions, if a system or network that we develop, install, or maintain were to fail or experience a security breach or service interruption, whether caused by us, third-\nparty service providers, cybersecurity threats or other events, we may experience loss of revenue, remediation costs or face claims for damages or contract termination. Any such event could cause serious harm to our reputation and prevent us from having access to or being eligible for further work on such systems and networks. Our errors and omissions liability insurance may be inadequate to compensate us for all of the damages that we may incur, and, as a result, our future results could be adversely affected.\nOur success depends, in part, on our ability to work with complex and rapidly changing technologies to meet the needs of our customers.\nWe design and develop technologically advanced and innovative products and services applied by our customers in various environments. The needs of our customers change and evolve regularly, particularly driven by complex and rapidly evolving technologies. Our success depends upon our ability to identify emerging technological trends, develop technologically advanced, innovative, and cost-effective products and services, and market these products and services to our customers. Our success also depends on our continued access to suppliers of important technologies and components. Many of our contracts contain performance obligations that require innovative design capabilities, are technologically complex, or depend on factors not wholly within our control. Problems and delays in development or delivery as a result of issues with respect to design, technology, licensing and patent rights, labor, learning curve assumptions, or materials and components could prevent us from achieving such contractual requirements. Failure to meet these obligations could adversely affect our profitability and future prospects. In addition, our offerings cannot be tested and proven in all situations and are otherwise subject to unforeseen problems that could negatively affect revenue and profitability, such as problems with quality and \nLeidos Holdings, Inc. Annual Report\n29\nTable of Contents\nPART I\nworkmanship, country of origin, delivery of subcontractor components or services, unplanned degradation of product performance, and unauthorized use or modifications of our products and services. Among the factors that may affect revenue and profits could be unforeseen costs and expenses not covered by insurance or indemnification from the customer, diversion of management focus in responding to unforeseen problems, loss of follow-on work, and, in the case of certain contracts, repayment to the government customer of contract costs and fee payments we previously received.\nWe utilize artificial intelligence, which could expose us to liability or adversely affect our business, especially if we are unable to compete effectively with others in adopting artificial intelligence.\nWe utilize artificial intelligence, including generative artificial intelligence, machine learning, and similar tools and technologies that collect, aggregate, analyze, or generate data or other materials or content (collectively, “AI”) in connection with our business. There are significant risks involved in using AI and no assurance can be provided that our use of AI will enhance our products or services, produce the intended results, or keep pace with our competitors. For example, AI algorithms may be flawed, insufficient, of poor quality, rely upon incorrect or inaccurate data, reflect unwanted forms of bias, or contain other errors or inadequacies, any of which may not be easily detectable; AI has been known to produce false or “hallucinatory” inferences or outputs; our use of AI can present ethical issues and may subject us to new or heightened legal, regulatory, ethical, or other challenges; and inappropriate or controversial data practices by developers and end-users, or other factors adversely affecting public opinion of AI, could impair the acceptance of AI solutions, including those incorporated in our products and services. If the AI tools that we use are deficient, inaccurate, or controversial, we could incur operational inefficiencies, competitive harm, legal liability, brand or reputational harm, or other adverse impacts on our business and financial results. If we do not have sufficient rights to use the data or other material or content on which the AI tools we use rely, we also may incur liability through the violation of applicable laws and regulations, third-party intellectual property, data privacy, or other rights, or contracts to which we are a party.\nIn addition, AI regulation is rapidly evolving worldwide as legislators and regulators increasingly focus on these powerful emerging technologies. The technologies underlying AI and its uses are subject to a variety of laws and regulations, including intellectual property, data privacy and security, consumer protection, competition, and equal opportunity laws, and are expected to be subject to increased regulation and new laws or new applications of existing laws and regulations. AI is the subject of ongoing review by various U.S. governmental and regulatory agencies, and various U.S. states and other foreign jurisdictions are applying, or are considering applying, their platform moderation, data privacy, and security laws and regulations to AI or are considering general legal frameworks for AI. For example, the EU’s Artificial Intelligence Act (the “AI Act”), which entered into force on August 1, 2024, establishes, among other things, a risk-based governance framework for regulating AI systems operating in the EU. We may not be able to anticipate how to respond to these rapidly evolving frameworks, and we may need to expend resources to adjust our operations or offerings in certain jurisdictions if the legal frameworks are inconsistent across jurisdictions. Furthermore, because AI technology itself is highly complex and rapidly developing, it is not possible to predict all of the legal, operational, or technological risks that may arise relating to the use of AI.\nWe have classified contracts with the U.S. government, which may limit investor insight into portions of our business.\nWe derive a portion of our revenues from programs with the U.S. government and its agencies that are subject to security restrictions (e.g., contracts involving classified information and classified programs), which preclude the dissemination of information and technology that is classified for national security purposes under applicable law and regulation. In general, access to classified information, technology, facilities, or programs requires appropriate personnel security clearances, is subject to additional contract oversight and potential liability, and may also require appropriate facility clearances and other specialized infrastructure. In the event of a security incident involving classified information, technology, facilities, programs, or personnel holding clearances, we may be subject to legal, financial, operational and reputational harm. We are limited in our ability to provide information about these classified programs, their risks or any disputes or claims relating to such programs. As a result, investors have less insight into our classified business or our business overall. However, historically the business risks associated with our work on classified programs have not differed materially from those of our other government contracts.\n30\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nWe have made and continue to make acquisitions, investments, joint ventures and divestitures that involve numerous risks and uncertainties.\nFrom time to time, we pursue strategic acquisitions, investments and joint ventures. We also may enter into relationships with other businesses to expand our products or our ability to provide services. These transactions require a significant investment of time and resources and may disrupt our business and distract our management from other responsibilities. Even if successful, these transactions could result in unfavorable public perception or reduce earnings for a number of reasons, including the amortization of intangible assets, impairment charges, adverse tax consequences, acquired operations that are not yet profitable, or the payment of additional consideration under earn-out arrangements if an acquisition performs better than expected. Acquisitions, investments and joint ventures pose many other risks that could adversely affect our reputation, operations, or financial results, including that:\nu\nwe may not be able to identify, compete effectively for or complete suitable acquisitions and investments at prices we consider attractive;\nu\nwe may not be able to accurately estimate the financial effect of acquisitions and investments on our business or realize anticipated synergies, business growth, or profitability and may be unable to recover investments in any such acquisitions and investments; \nu\nwe may not be able to manage the integration process for acquisitions successfully, and the integration process may divert management time and focus from operating our business, including as a result of incompatible accounting, information management, or other control systems; \nu\nacquired technologies, capabilities, products, and service offerings, particularly those that are still in development when acquired, may not perform as expected, may have defects or may not be integrated into our business as expected; \nu\nwe may have trouble retaining key employees and customers of an acquired business; \nu\nwe may need to implement or improve controls, procedures and policies at a business that prior to the acquisition may have lacked sufficiently effective controls, procedures and policies, including those relating to financial reporting, revenue recognition or other financial or control deficiencies; \nu\nwe may assume legal or regulatory risks, particularly with respect to smaller businesses that have immature business processes and compliance programs, or may be required to comply with additional laws and regulations or to engage in remediation efforts to cause the acquired company to comply with applicable laws and regulations, or result in liabilities resulting from the acquired company’s failure to comply with applicable laws or regulations;\nu\nwe may face litigation or material liabilities that were not identified or were underestimated as part of our due diligence or for which we are unable to receive a purchase price adjustment or reimbursement through indemnification, including intellectual property claims and disputes or claims from terminated employees, customers, former stockholders or other third parties, or there may be other unanticipated write-offs or charges; \nu\nwe may be required to spend a significant amount of cash or to incur debt, resulting in limitations on other potential uses for cash, increased fixed payment obligations or covenants or other restrictions on us, or issue shares of our common stock or convertible debt, resulting in dilution of ownership; \nu\nwe may not be able to influence the operations of our joint ventures effectively, or we may be exposed to certain liabilities if our joint venture partners do not fulfill their obligations; and\nu\nif our acquisitions, investments, or joint ventures fail, perform poorly, or their value is otherwise impaired for any reason, including contractions in credit markets and global economic conditions, our business and financial results could be adversely affected.\nIn addition, we periodically divest businesses, including businesses that are no longer a part of our ongoing strategic plan. These divestitures similarly require a significant investment of time and resources, may disrupt our business, distract management from other responsibilities and may result in losses on disposal or continued financial involvement in the divested business, including through indemnification, guarantee or other financial arrangements, for a period of time following the transaction, which would adversely affect our financial results.\nLeidos Holdings, Inc. Annual Report\n31\nTable of Contents\nPART I\nGoodwill represents a significant asset on our balance sheet and any impairment of this asset could negatively impact our results of operations, and shareholders\n’\n equity.\nAs of January 3, 2025, goodwill was 46% of our total assets. The amount of our goodwill may substantially increase in the future as a result of any acquisitions that we make. Goodwill is tested for impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable and at least annually. The impairment test is based on several factors requiring judgment. Examples of events could include a significant adverse change in legal factors or in the business climate, an adverse action or assessment by a regulator, unanticipated competition, adverse contract acquisition performance, loss of key personnel, or a more-likely-than-not expectation that a reporting unit or a significant portion of a reporting unit will be sold or otherwise disposed. Adverse changes in fiscal and economic conditions, such as those related to federal budget cuts and the nation’s debt ceiling, deteriorating market conditions for companies in our industry and unfavorable changes in discount rates could result in an impairment of goodwill. For example, during fiscal 2023, the SES reporting unit refined its portfolio and made strategic business decisions to exit certain product offerings, and cease operations in certain countries in order to align the operations of the reporting unit with its strategic business plan. These decisions, along with the delays in airline travel infrastructure projects and higher than anticipated costs of servicing, contributed to a significant reduction in the reporting unit’s forecasted revenue and cash flows. As a result, we conducted a quantitative goodwill impairment analysis, and our estimates led us to determine that the carrying value of the SES reporting unit exceeded its estimated fair value. Accordingly, we recognized a non-cash goodwill impairment charge of $596 million in fiscal 2023. Any future impairment of goodwill could have a negative impact on our results of operations and shareholders’ equity in the period in which they are recognized. For additional information on our accounting policies related to impairment of goodwill, see our discussion under “Critical Accounting Estimates” in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this Annual Report on Form 10-K, “Note 3—Summary of Significant Accounting Policies” and “Note 8—Goodwill and Intangible Assets” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nWe depend on our teaming arrangements and relationships with other contractors and subcontractors. If we are not able to maintain these relationships, or if these parties fail to satisfy their obligations to us or the customer, our revenues, profitability and growth prospects could be adversely affected.\nWe rely on our teaming relationships with other prime contractors and subcontractors, who are also often our competitors in other contexts, to submit bids for large procurements or other opportunities where we believe the combination of services and products provided by us and other companies will help us to win and perform the contract. Our future revenues and growth prospects could be adversely affected if other contractors eliminate or reduce their contract relationships with us or if the U.S. government terminates or reduces these other contractors’ programs, does not award them new contracts, or refuses to pay under a contract. Companies that do not have access to U.S. government contracts may perform services as our subcontractor, and that experience could enhance such companies’ prospect of securing a future position as a prime U.S. government contractor, which could increase competition for future contracts and impair our ability to perform on contracts. We may have disputes with our subcontractors arising from, among other things, the quality and timeliness of work performed by the subcontractor, customer concerns about the subcontractor, our failure to extend existing task orders or issue new task orders under a subcontract, our hiring of a subcontractor’s personnel or the subcontractor’s failure to comply with applicable law. If any of our subcontractors fail to meet their contractual obligations in a timely manner or have regulatory compliance or other problems, our ability to fulfill our obligations as a prime contractor or higher tier subcontractor may be jeopardized. Significant losses could arise in future periods and subcontractor performance deficiencies could result in our termination for default. A termination for default could eliminate a revenue source, expose us to liability and have an adverse effect on our ability to compete for future contracts and task orders, especially if the customer is an agency of the U.S. government.\nOur services and operations, which sometimes involve using, handling, or disposing of hazardous substances, are subject to numerous environmental, health and safety laws and regulations, pursuant to which we could face potentially significant liabilities, costs or obligations.\nOur services are subject to numerous environmental, health, and safety laws and regulations. Some of our services and operations involve using, handling, or disposing of hazardous substances, including explosive, chemical, biological, or radioactive materials. These activities and our operations generally subject us to complex and stringent foreign, federal, state, and local environmental, health, and safety laws and regulations, which have tended to become more stringent over time. Among other things, these laws and regulations require us to incur costs to comply and could impose liability on us for handling or disposing of hazardous substances. For example, we provide infrastructure and site services necessary to accomplish critical waste management and the continued environmental cleanup of the Hanford Site in southeastern Washington. In addition, some of our work sites put our employees and others in close proximity with mechanized \n32\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nequipment, moving vehicles, chemical and manufacturing processes, and highly regulated materials. On some work sites, we may be responsible for safety and have an obligation to implement effective safety procedures. If we fail to implement these procedures, or if the procedures we implement are ineffective, we may suffer the loss of or injury to our employees, as well as expose ourselves to possible litigation.\nFailure to comply with these environmental, health and safety laws and regulations could result in civil, criminal, regulatory, administrative, or contractual sanctions, including fines, penalties, suspension or debarment from contracting with the U.S. government, or reputational harm. In addition, our failure to maintain adequate safety standards and equipment could result in reduced profitability and loss of work or customers. Our current and previous ownership, leasing and operation of real property, and disposal of hazardous substances also subject us to environmental laws and regulations, some of which hold current or previous owners or operators of businesses and real property jointly and severally liable for hazardous substance releases, even if they did not know of and were not responsible for the releases. Past business practices at companies that we have acquired may also expose us to future unknown environmental liabilities. Liabilities related to environmental contamination, human exposure to hazardous substances, or violations of these laws or regulations, could result in substantial costs to us, including cleanup costs, fines, civil or criminal sanctions, and third-party claims for property loss or damage or personal injury. Our continuing work in the areas governed by these laws and regulations exposes us to the risk of substantial liability and may adversely affect our financial condition and operating results.\nWe could incur significant liabilities and suffer negative publicity if our inspection or detection systems fail to detect bombs, explosives, weapons, contraband or other threats.\nWe design, develop, manufacture, sell, service, and maintain various inspection systems and related integration and automation systems designed to assist in detecting bombs, explosives, weapons, contraband, or other threats. In some instances, we also train operators of such systems. Such systems utilize detection technology and software algorithms to interpret data produced by the system and signal to the operator when a dangerous object or substance may be present. Such algorithms are probabilistic in nature and are generally designed to meet requirements established by regulatory agencies. Many of these systems require that an operator interpret an image of suspicious items within a bag, parcel, container, vehicle, or other vessel. Others signal to the operator that further investigation is required, and the training, reliability, and competence of the customer’s operator are crucial to the detection of suspicious items. Nevertheless, if such a system were to fail to signal to an operator when an explosive or other contraband was, in fact, present, resulting in significant damage, we could become the subject of significant product liability claims. There are many factors, some of which are beyond our control, that could result in the failure of our products to help detect the presence of bombs, explosives, weapons, contraband, or other threats. Some of these factors could include inherent limitations in our systems and misuse or malfunction of our systems. The failure of our systems to help detect the presence of any of these dangerous materials could lead to injury, death, and extensive property damage and may lead to product liability, professional liability, or other claims against us. Further, if our security and inspection systems fail to, or are perceived to have failed to, help detect a threat, we could experience negative publicity and reputational harm, which could reduce demand for our inspection or detection systems and adversely affect our business.\nOur insurance, customer indemnifications or other liability protections may be insufficient to protect us from product and other liability claims or losses.\nNot every risk or liability we face is or can be protected by insurance, and for those risks we insure, the limits of coverage that are reasonably obtainable may not be sufficient to cover all actual losses or liabilities incurred. We are limited in the amount of insurance we can obtain to cover certain risks, such as cybersecurity risks and natural hazards, including earthquakes, fires, and extreme weather conditions, some of which can be worsened by climate change and pandemics. If any of our third-party insurers fail, become insolvent, cancel our coverage or otherwise are unable to provide us with adequate insurance coverage or renew our insurance coverage on favorable terms, then our overall risk exposure and our operational expenses would increase, and the management of our business operations would be disrupted. Our insurance may be insufficient to protect us from significant product and other liability claims or losses. Moreover, there is a risk that commercially available liability insurance will not continue to be available to us at a reasonable cost, if at all. In some circumstances, we are entitled to certain legal protections or indemnifications from our customers through contractual provisions, laws, regulations, or otherwise. However, these protections are not always available, can be difficult to obtain, are typically subject to certain terms or limitations, including the availability of funds, and may not be sufficient to cover all losses or liabilities incurred. If liability claims or losses exceed our current or available insurance coverage, customer indemnifications, or other legal protections, our business, financial position, operating results and prospects may be harmed. Any significant claim may have an adverse effect on our industry and market reputation, leading to a substantial decrease in demand for our products and services and reduced revenues, making it more difficult for us to compete effectively, and could affect the cost and availability of insurance coverage at adequate levels in the future.\nLeidos Holdings, Inc. Annual Report\n33\nTable of Contents\nPART I\nWe face risks associated with our international business.\nDuring fiscal 2024, revenue attributable to our services provided outside of the United States to non-U.S. customers was approximately 8% of our total revenue. Our international business operations may be subject to additional and different risks than our U.S. business. These risks and challenges include:\nu\nfailure to comply with U.S. government and foreign laws and regulations applicable to international business, including, without limitation, those related to employment, data privacy and security, taxes, technology transfer, information security, environment, data transfer, import and export controls (including the International Traffic in Arms Regulations (“ITAR”) administered by the U.S. Department of State and the anti-boycott provisions of the Export Administration Regulations (“EAR”) administered by the U.S. Department of Commerce’s Bureau of Industry and Security), sanctions, and other administrative, legislative or regulatory actions that could materially interfere with our ability to offer our products or services in certain countries or have an adverse impact on our business with the U.S. government, and expose us to risks and costs of noncompliance with such laws and regulations, in addition to administrative, civil or criminal penalties; \nu\nincreased financial and legal risks arising, for example, from foreign exchange rate variability, imposition of tariffs or additional taxes, inflation, restrictive trade policies, longer payment cycles, delays or failures to collect amounts due to us and differing legal systems, and which may adversely affect the performance of our services, sale of our products or repatriation of our profits;\nu\npolitical or economic instability, international security concerns and geopolitical conflict in countries where we provide services and products in support of the U.S. government and other customers in countries, which increases the risk of an incident resulting in injury or loss of life, damage or destruction of property, inability to meet our contractual obligations or retaliatory measures taken in respect thereof;\nu\nthe ongoing conflict between Russia and Ukraine, which has resulted in the imposition by the U.S. and other nations of restrictive actions against Russia, Belarus and certain banks, companies and individuals; and\nu\nthe ongoing conflict in the Middle East, which continues to expand.\nWe are also subject to the U.S. Foreign Corrupt Practices Act (“FCPA”), the U.K. Bribery Act of 2010 (the “U.K. Bribery Act”) and other anti-corruption and anti-bribery laws and regulations in jurisdictions where we do business. These laws and regulations generally prohibit improper payments or offers of improper payments to government officials, political parties, or commercial partners to obtain or retain business or secure an improper business advantage. We have operations, and deal with and make sales to governmental or quasi-governmental entities in non-U.S. countries, including those known to experience corruption, and further expansion of our non-U.S. sales efforts may involve additional regions. In many countries, particularly countries with developing economies, it may be common for businesses to engage in practices prohibited by the FCPA or other applicable laws and regulations. Our activities in these countries pose a heightened risk of unauthorized payments or offers of payments by one of our employees or third-party business partners, representatives, and agents that could violate various laws, including the FCPA. The FCPA, U.K. Bribery Act and other applicable anti-bribery and anti-\ncorruption laws may also hold us liable for acts of corruption and bribery committed by our third-party business partners, representatives, and agents. We and our third-party business partners, representatives, and agents may have direct or indirect interactions with officials and employees of government agencies or state-owned or affiliated entities, and we may be held liable for the corrupt or other illegal activities of our employees or such third parties even if we do not explicitly authorize such activities. The FCPA or other applicable laws and regulations also require that we keep accurate books and records and maintain internal controls and compliance procedures designed to prevent any such actions. While we have implemented policies and procedures to address compliance with such laws, we cannot assure you that our employees or other third parties working on our behalf have not engaged or will not engage in conduct in violation of our policies or applicable law for which we might ultimately be held responsible. \nViolations of any of these laws or regulations, including the FCPA and the U.K. Bribery Act, may result in whistleblower complaints, negative media coverage, investigations, imposition of significant legal fees, loss of export privileges, as well as severe criminal or civil sanctions, including suspension or debarment from U.S. government contracting. We may also be subject to other liabilities and adverse effects on our reputation, which could negatively affect our business, results of operations, financial condition, and growth prospects. In addition, responding to any enforcement action may result in a significant diversion of management’s attention and resources and significant defense costs and other professional fees. Although our international operations have historically generated a small proportion of our revenues, we are seeking to grow our international business. Our exposure for violating these laws will increase as our non-U.S. presence expands and as we increase sales and operations in foreign jurisdictions. \n34\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nFor additional information regarding government investigations and reviews we are subject to, see “Government Investigations and Reviews” in “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nWe have only a limited ability to protect or exploit intellectual property rights, which are important to our success. Our failure to adequately obtain, maintain, protect, defend and enforce our proprietary information and intellectual property rights could adversely affect our competitive position.\nWe rely on a combination of confidentiality, intellectual property, and other contractual arrangements, including licenses and copyright, trademark, and trade secret law, to protect much of our proprietary information and intellectual property in cases where we do not believe patent protection is appropriate or obtainable. Despite our efforts to protect our intellectual property and other proprietary rights, third parties may attempt to obtain, copy, use, or disclose our intellectual property or other proprietary information or technology without our authorization. In addition to protection under the law and contractual arrangements with our corporate and joint venture partners, employees, consultants, advisors, service providers, suppliers, subcontractors, and customers, we generally attempt to limit access to and distribution of our proprietary information. Although our employees and contractors are subject to confidentiality obligations and use restrictions, this protection may be inadequate to deter or prevent them from infringing, misappropriating, or otherwise violating our confidential information, technology, or other intellectual property or proprietary rights, and can be difficult to enforce. In addition, trade secrets are generally difficult to protect, and some courts inside and outside the United States may be less willing or unwilling to protect trade secrets.\nWe may be unable to detect unauthorized use of our intellectual property or otherwise take appropriate steps to enforce our rights. Our intellectual property rights may be challenged by others, invalidated, narrowed in scope, or held unenforceable through administrative process or litigation in the United States or foreign jurisdictions. We may be required to expend significant resources and efforts to monitor and protect our intellectual property and other proprietary rights, and we may conclude that, in at least some instances, the benefits of protecting our intellectual property or other proprietary rights may be outweighed by the expense or distraction to our management. We may initiate claims or litigation against third parties for infringement, misappropriation, or other violations of our intellectual property or other proprietary rights or to establish the validity of our intellectual property or other proprietary rights, but outcomes in any such litigation can be difficult to predict and could be time-consuming, result in significant expense to us and divert the efforts of our technical and management personnel. Additionally, because of the substantial amount of discovery required in connection with intellectual property litigation, there is a risk that some of our confidential information could be compromised by disclosure during this type of litigation. If we are unable to detect or prevent third parties from infringing, misappropriating, or otherwise violating our rights in our patents, copyrights, trademarks, trade secrets or other proprietary rights or information, our competitive position could be adversely affected. Also, in connection with our performance of services for the U.S. government, the U.S. government has certain rights to inventions, data, software codes and related material and intellectual property that we develop under government-funded contracts and subcontracts, which means that the U.S. government may disclose or license our information and intellectual property to third parties, including, in some instances, our competitors. Any exercise of such rights by the U.S. government could adversely affect our competitive position, business, financial condition, results of operations and prospects. We also may be limited in our ability to disclose or license such information and intellectual property to third parties and the U.S. government may also decline to make the intellectual property of others available to us under acceptable terms.\nThird parties may also, from time to time, claim that we have infringed the intellectual property rights of others, resulting in claims against our customers or us, or we may face allegations that we or our service providers, suppliers, subcontractors, or customers have violated the intellectual property rights of others. Even if we believe that intellectual property-related claims are without merit, litigation may be necessary to determine the scope and validity of intellectual property or proprietary rights of others or to protect or enforce our intellectual property rights. If, with respect to any claim against us for violation of third-\nparty intellectual property rights, we are unable to prevail in the litigation, retain or obtain sufficient rights, develop non-\ninfringing solutions or otherwise alter our business practices on a timely or cost-efficient basis, our business and competitive position may be adversely affected. Such claims could also subject us to injunctions and significant liability for damages, potentially including treble damages if we are found to have willfully infringed a third party’s intellectual property rights. In addition, our contracts generally indemnify our customers for third-party claims for intellectual property infringement by our services and products. Besides the expense and time to defend such claims and the cost of any large indemnity payments, any dispute with a customer with respect to such obligations could also have adverse effects on our relationship with that customer and other existing and new customers, requiring us to pay substantial royalty or licensing fees, and divert management’s attention, any of which could harm our business, financial condition and results of operations.\nLeidos Holdings, Inc. Annual Report\n35\nTable of Contents\nPART I\nChanges in tax laws and regulations or exposure to additional tax liabilities could adversely affect our financial results.\nWe are subject to income taxes in the U.S. and numerous foreign jurisdictions. Changes in U.S. (federal or state) or foreign tax laws and regulations, or their interpretation and application, including those with retroactive effect, could result in increases in our tax expense and adversely affect our financial results. See “Liquidity and Capital Resources” in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained within this Annual Report on Form 10-K for additional information on the impact of this change.\nSignificant judgment is required in determining our worldwide provision for income taxes. In the ordinary course of our business, there are many transactions and calculations where the ultimate tax determination is uncertain. We are regularly under audit by tax authorities. Although we believe that our tax estimates and tax positions are reasonable, they could be materially affected by many factors, including the final outcome of tax audits and related litigation, the introduction of new tax accounting standards, legislation, regulations, and related interpretations, our global mix of earnings, the realizability of deferred tax assets and changes in uncertain tax positions. An increase or decrease in our effective tax rate, or an ultimate determination that we owe more taxes than the amounts previously accrued, could have a material adverse impact on our financial condition and results of operations.\nThe U.S. government may prefer minority-owned, small and small disadvantaged businesses; therefore, we may have fewer opportunities to bid on certain contracts.\nAs a result of the Small Business Administration set-aside program, the U.S. government may decide to restrict certain procurements only to bidders that qualify as minority-owned, small, or small disadvantaged businesses. As a result, we would not be eligible to perform as a prime contractor on those programs and would be restricted to a maximum of 49% of the work as a subcontractor on those programs. An increase in the number of procurements under the Small Business Administration set-aside program may impact our ability to bid on new procurements as a prime contractor or restrict our ability to re-compete on incumbent work that is placed in the set-aside program.\nWe might be adversely impacted by fluctuations in foreign currency exchange rates.\nWe conduct our business in various currencies, including the U.S. dollar, the British pound and the Australian dollar. Changes in foreign currency exchange rates could reduce our revenues, increase our costs or otherwise adversely affect our financial results reported in U.S. dollars. We may from time to time enter into foreign currency contracts, foreign currency borrowings or other techniques intended to hedge a portion of our foreign currency exchange rate risks. These hedging activities may not completely offset the adverse financial effects of unfavorable movements in foreign currency exchange rates during the time hedges are in place. Any of these risks might have an adverse impact on our business operations and our financial position, results of operations or cash flows.\nRISKS RELATING TO OUR STOCK\nWe cannot assure you that we will continue to pay or increase dividends on our common stock or to repurchase shares of our common stock.\nThe timing, declaration, amount, and payment of any future dividends fall within the discretion of our Board and depend on many factors, including our available cash, estimated cash needs, cash deployment alternatives, earnings, financial condition, operating results, and capital requirements, as well as limitations in our contractual agreements, applicable law, regulatory constraints, industry practice and other business considerations that our Board considers relevant. Decreases in asset values or increases in liabilities, including liabilities associated with employee benefit plans and assets and liabilities associated with taxes, can reduce cash, net earnings, and stockholders’ equity. In addition, the timing and amount of share repurchases under Board-approved share repurchase plans are within the discretion of management and will depend on many factors, including our ability to generate sufficient cash flows from operations in the future or to borrow money from available financing sources, results of operations, capital requirements, general business conditions, and applicable law. Our payment of dividends and share repurchases could vary from historical practices or our stated expectations. A change in our dividend or share repurchase programs could have an adverse effect on the market price of our common stock.\nProvisions in our charter documents and under Delaware law could delay or prevent transactions that many stockholders may favor.\nSome provisions of our certificate of incorporation and bylaws may delay, discourage, or prevent a merger or acquisition that our stockholders may consider favorable, including transactions in which stockholders might receive a premium for their shares. These restrictions, which may also make it more difficult for our stockholders to elect directors not endorsed by our current directors and management, include mergers and certain other business combinations between a related person and \n36\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nus requiring approval by the holders of a majority of the voting power of such securities that are not owned by the related person unless approved by a majority of continuing directors or certain other exceptions; our stockholders may not act by written consent; our Board may issue, without stockholder approval, shares of undesignated preferred stock, the terms of which may be determined by the Board; and we are also subject to certain restrictions on business combinations under Section 203 of the Delaware General Corporation Law, which imposes additional requirements for business combinations, and may prevent our stockholders from receiving the benefit from any premium to the market price of our common stock offered by a bidder in a takeover context.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity \nRISK MANAGEMENT AND STRATEGY\nCybersecurity risk management is an integral part of our digital posture and enterprise risk management strategy. Cybersecurity is critical to maintaining the trust of our customers and business partners, and we are committed to protecting our and their confidential and sensitive information, including personal information, and mitigating cybersecurity risks that impact our systems and networks. We maintain technologies, programs and processes designed to assess, identify, manage and mitigate cybersecurity risks. Our efforts include regular monitoring of Leidos-managed systems and networks for internal and external cybersecurity threats, providing cybersecurity training to our employees during the onboarding process and annually, and continually reviewing and refining formal policies and procedures designed to deter, identify and remediate cybersecurity incidents. We regularly perform evaluations of our cybersecurity program and continue to invest in our capabilities to keep our customers, partners, suppliers and information assets in our possession safe. Although we employ service provider due diligence and onboarding procedures to identify potential cybersecurity risk, our ability to monitor the cybersecurity practices of our service providers is limited and there can be no assurance that we can prevent or mitigate the risk of any compromise or failure in the information system, software, networks and other assets owned or controlled by our vendors.\nOur Chief Information Security Officer leads our Cybersecurity Intelligence and Response Team (“CSIRT”) whose function is to stay apprised of existing and emerging cyber threats and monitor our global enterprise and proactively identify and protect against cybersecurity risk. The CSIRT uses intelligence collected from various sources, fused with intelligence collected from analysis and response actions, to proactively search for, and address adversary activity against the Leidos network. \nThe CSIRT possesses in-depth knowledge of network, endpoint, perimeter security systems, identity, data protection, threat intelligence, forensics, penetration testing and malware reverse engineering, as well as the functioning of specific applications or underlying information technology infrastructure.\nLeidos CSIRT owns the incident response process and provides direction and guidance to users of Leidos computing resources when responding to cybersecurity incidents. Leidos CSIRT also provides intrusion monitoring of networks and information systems and continuously monitors the Leidos computing environments and performs triage and analysis of events to identify potential incidents.\nWe employ multiple security and monitoring systems and applications throughout the Company to identify, alert, report and log authorized and unauthorized access to the Leidos systems and networks. We use an application that collects, correlates, and notifies CSIRT analysts regarding any item meeting an electronic intrusion event. We categorize anomalous cyber events into discrete levels in which cybersecurity matters are escalated to certain levels of management, as well as our Board, based on the severity of the incident, as appropriate. Sharing cyber threat information at these levels supports the Company’s ability to integrate cybersecurity considerations into its overarching risk management system and processes.\nWe also conduct periodic internal and third-party assessments to test our cybersecurity controls, perform cyber simulations and exercises, and continually evaluate our internal governing policies and procedures to help detect and respond to cybersecurity events in order to reduce harms or impacts from breaches and other information security incidents.\n \nLeidos Holdings, Inc. Annual Report\n37\nTable of Contents\nPART I\nGOVERNANCE\nMANAGEMENT’S RESPONSIBILITIES\nOur global information security program is led by our corporate Chief Information Security Officer, who works closely with key corporate functional and line of business stakeholders. The Chief Information Security Officer partners with these functions for the purpose of identifying, considering and assessing material cybersecurity risks on an ongoing basis, establishing processes to ensure that such potential cybersecurity risks are monitored, implementing appropriate mitigation measures, reporting cybersecurity breaches and other information security incidents, and maintaining our cybersecurity program. \nThe team of senior management officers, who support our information security program, have expertise with cybersecurity, as demonstrated qualifications such as by prior work experience, possession of a cybersecurity certification, degree, or other cybersecurity experience.\n Our management team receives regular updates on our cybersecurity posture and reviews detailed information about our cybersecurity preparedness. Additionally, we have a Leidos Security Council that is co-chaired by the Chief Information Security Officer and the Chief Security Officer to address “all security hazards” across our global enterprise to ensure cohesion and effectiveness of our combined security governance and risk mitigations.\nBOARD’S ROLES AND RESPONSIBILITIES\nWe have a \nTechnology and Information Security Committee\n, comprised of six board members, with relevant backgrounds and experience, that oversees and advises the Board and management on matters involving the Company’s overall strategic direction and significant business risks and opportunities in the areas of technology and information security.\n \nAt least quarterly, management provides our Board and the Technology and Information Security Committee with updates about our cybersecurity and related risk exposures, our policies and procedures to mitigate such exposures and the status of projects to strengthen our information security infrastructure and program maturity and defend against and respond to cybersecurity threats.\n In addition, we use a risk-based escalation process to notify the Board and the Technology and Information Security Committee outside of the regular reporting cycle should we identify a significant emerging risk or potentially material issue that should be brought to their attention.\nCYBERSECURITY THREATS\nTo date, we have not identified any cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of our operations, or our financial condition.\n However, despite our efforts to identify and respond to cybersecurity threats, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced an undetected cybersecurity incident. For more information about these risks, please see “Risk Factors – Cybersecurity breaches and other information security incidents could negatively impact our business and financial results, impair our ability to effectively provide our services to our customers and cause harm to our reputation or competitive position” in this Annual Report on Form 10-K."
  }
}