{
  "ticker": "LEN",
  "cik": "0000920760",
  "company_name": "LENNAR CORP /NEW/",
  "filing_date": "2025-01-23",
  "accession": "0001628280-25-002404",
  "primary_doc": "len-20241130.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n92\nSignatures\n93\nFinancial Statement Schedule\n95\nTable of \nContents\nItem 1.    Business.\nOverview of Lennar Corporation\nWe are one of the largest homebuilders in the United States by deliveries, revenues and net earnings, an originator of residential and commercial mortgage loans, a provider of title insurance and closing services and a developer of multifamily rental properties. In addition, we are a sponsor and manager of funds and joint ventures engaged in development and ownership of multifamily rental properties and a sponsor and manager of a fund engaged in ownership of single-family rental properties. We also have investments in companies that are engaged in applying technology to improve the homebuilding industry and real estate related aspects of the financial services industry.\nOur homebuilding operations are the most substantial part of our business, generating $34 billion in revenues, or approximately 96% of consolidated revenues, in fiscal 2024. \nAs of November 30, 2024, our reportable Homebuilding segments and all Other Homebuilding operations not required to be reported separately have divisions located in:\nEast:\n Alabama, Florida, New Jersey and Pennsylvania\nCentral:\n Georgia, Illinois, Indiana, Maryland, Minnesota, North Carolina, South Carolina, Tennessee and Virginia\nTexas: \nTexas\nWest:\n Arizona, California, Colorado, Idaho, Nevada, Oregon, Utah and Washington\nOther:\n Urban divisions and other homebuilding related investments primarily in California, including FivePoint Holdings, LLC (\"FivePoint\")\nOur other reportable segments are Financial Services, Multifamily and Lennar Other.\n \nFinancial information about our Homebuilding, Financial Services, Multifamily and Lennar Other operations is contained in \nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations \nof this Report.\nAbout Our Company \nOur company was founded as a local Miami homebuilder in 1954. We completed our initial public offering in 1971 and listed our common stock on the New York Stock Exchange in 1972. During the 1980s and 1990s, we entered and expanded operations in a number of homebuilding markets, including California, Florida and Texas, through both organic growth and acquisitions, such as Pacific Greystone Corporation in 1997. In 2000, we acquired U.S. Home Corporation, which expanded our operations into New Jersey, Maryland, Virginia, Minnesota and Colorado and strengthened our position in other states. From 2002 through 2005, we acquired several regional homebuilders, which brought us into new markets and strengthened our position in several existing markets. From 2010 through 2013, we expanded our homebuilding operations into Georgia, Oregon, Washington and Tennessee. In 2017, we acquired WCI Communities, Inc., a homebuilder of luxury single-family and multifamily homes, including a small number of luxury high-rise tower units, in Florida. In 2018, we acquired CalAtlantic Group, Inc. (\"CalAtlantic\"), a major homebuilder which was building homes across the homebuilding spectrum, from entry level to luxury, in 43 metropolitan statistical areas spanning 19 states, and providing mortgage, title and escrow services.\nWe are focused on increasing efficiencies in our building process and reducing selling, general and administrative expenses by using technology and innovative strategies to reduce customer acquisition costs. Our construction playbook has three primary areas of focus: lowering construction costs, reducing cycle time and achieving even flow production. We have aimed to maintain strong operating margins by deferring home sale price commitments until construction costs are finalized to protect against cost escalations. We focus on executing our operating strategy to be a consistent and high-volume homebuilder with production pace in sync with sales pace while using our gross margin as a shock absorber. In addition, we are continuing our transition to a land light operating model by increasing the percentage of land we control through options or agreements but do not own, which reduces our years’ supply of owned homesites. In connection with this transition, we expect to spin off a significant portion of our land assets to Millrose (as defined below), as discussed further below under the caption “Homebuilding Operations – Millrose Spin-Off.”\nHomebuilding Operations\nOverview\nOur homebuilding operations include the construction and sale of single-family attached and detached homes as well as the purchase, development and sale of residential land directly through entities in which we have investments. New home deliveries, including deliveries from unconsolidated entities, were 80,210 in fiscal 2024, compared to 73,087 in fiscal 2023 and 66,399 in fiscal 2022. We primarily sell homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The average sales price of a Lennar home varies depending on product and geographic location. For fiscal 2024, the average sales price, excluding deliveries from unconsolidated entities, was $423,000, compared to $446,000 in fiscal 2023 and $480,000 in fiscal 2022.\n1\nTable of \nContents\nWe operate primarily under the Lennar brand name. Our homebuilding mission is focused on the profitable development of residential communities. Key elements of our strategy include:\n•\nStrong Operating Margins -\n Our purchasing leverage combined with our focus on reducing selling, general and administrative costs by using technology and innovative strategies and reducing interest expense through paydowns of debt has enabled us to achieve strong gross profit and operating margins. \n•\nEverything’s Included\n®\n Approach\n - We are focused on distinguishing our products, including through our Everything’s Included\n®\n approach, which maximizes our purchasing power, enables us to include luxury features as standard items in our homes and simplifies our homebuilding operations. \n•\nInnovative Homebuilding -\n We are constantly innovating the homes we build to create products that better meet our customers' needs and desires. Our Next Gen\n®\n home provides what can be a home within a home to accommodate children or parents or can be an office from which to work remotely. \n•\nCore Plans\n - We are integrating standardized, highly efficient, value engineered Plan series across all divisions at different price points. The Core Plans are driving cost savings and strong operating margins, while delivering great value for our homebuyers.\n•\nFlexible Operating Structure\n - Our local operating structure gives us the flexibility to make operating decisions based on local homebuilding conditions and customer preferences, while our centralized management structure provides strategic oversight for our homebuilding operations.\n•\nDigital Marketing \n- We are increasingly advertising homes through digital channels, which is significantly increasing the cost effectiveness of our marketing efforts.\n•\nDynamic pricing model\n - We match up unsold production as homes progress toward completion, with pricing information from our dynamic pricing model on a community-by-community and home-by-home basis.\n•\nTechnology Focused \n- We partner with and/or invest in technology companies that are looking to improve the homebuilding and financial services industries to increase efficiencies, reduce customer acquisition costs and create a better customer experience.\n•\nLand light strategy \n- We are focused on reducing our years' supply of owned homesites and increasing the percentage of land we control through options or agreements, including agreements with strategic land banks and joint ventures, rather than ownership. In connection with this strategy, we expect to spin off a significant portion of our land assets to Millrose, as discussed further below under the caption “Homebuilding Operations – Millrose Spin-Off.”\n•\nEven flow production\n - We adjust prices, with our gross margin being a shock absorber, in an effort to maintain consistent starts and sales paces in order to generate increased market share in all the markets we build in.\nDiversified Program of Property Acquisition\nWe generally acquire, or obtain options to acquire, land for development and for the construction of homes that we sell to homebuyers. Land purchases are subject to specified underwriting criteria and are made through our diversified program of property acquisition, which may consist of:\n•\nAcquiring land through option contracts, which generally enables us to control portions of properties owned by land banks and other third parties or entities in which we have investments until we have determined whether to exercise the options;\n•\nAcquiring land directly from individual land owners/developers, or other homebuilders;\n•\nAcquiring local or regional homebuilders that own, or have options to purchase, land in strategic markets;\n•\nAcquiring access to land through joint ventures or partnerships, which among other benefits, limits the amount of our capital invested in land while helping to ensure our access to potential future homesites and allowing us to participate in strategic ventures;\n•\nInvesting in regional developers in exchange for preferential land purchase opportunities; and\n•\nAcquiring land in conjunction with our Multifamily business.\nFor the last several years, we have been reducing our reliance on land we own and increasing our access to land through options and joint ventures, most significantly through our use of land banks which is a critical part of our operating strategy. At November 30, 2024, 82% of our total homesites were controlled through options with land banks, land sellers and joint ventures compared to 76% at November 30, 2023. For additional information about our investments in and relationships with unconsolidated entities, see Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of this Report.\n2\nTable of \nContents\nConstruction and Development\nWe are involved in all phases of planning and building in our residential communities, including land acquisition, site planning, preparation and improvement of land and design, construction and marketing of homes. We use independent subcontractors for most aspects of land development and home construction. At November 30, 2024, we were actively building and marketing homes in 1,447 communities, including 11 communities being constructed by unconsolidated entities. This was an increase from the 1,260 communities, including five communities being constructed by unconsolidated entities, in which we were actively building and marketing homes at November 30, 2023. At November 30, 2024 and 2023, we had about 2,900 and 1,200 completed unsold homes, respectively.\nWe generally supervise and control the development of land and the design and building of our residential communities with a relatively small labor force. We hire subcontractors for site improvements and virtually all of the work involved in the construction of homes. Arrangements with our subcontractors generally provide that our subcontractors will complete specified work in accordance with price and time schedules and in compliance with applicable building codes and laws. The price schedules may be subject to change to meet changes in labor and material costs or for other reasons. Although we, like homebuilders throughout the country, encountered shortages of materials and skilled labor during 2022, we believe that because of our size and our builder of choice program, where we work with our trade partners to drive efficiencies for them, we were less affected by these shortages than many of our competitors. Most shortages were eliminated due to the supply chain environment catching up to homebuilder demand as well as Lennar’s continued effort to work with our suppliers and manufacturers on the volume and specific products needed to build homes. We generally do not own heavy construction equipment. We finance construction and land development activities primarily with cash generated from operations and historically from proceeds of unsecured corporate debt. Following the Millrose Spin-Off, we expect that, when Millrose acquires undeveloped or partially developed land that we have options to purchase, Millrose will finance the horizontal development of all such homesites up to pre-negotiated development budgets, which will be incorporated into the takedown prices for Lennar’s purchase options on the properties.\nMarketing\nWe offer a diversified line of homes for first-time, move-up, active adult, luxury and multi-generational homebuyers in a variety of locations ranging from urban infill communities to suburban golf course communities. Our Everything’s Included\n® \nmarketing program enables us to differentiate our homes from those of our competitors by including luxury items as standard features at competitive prices, while reducing construction and overhead costs through a simplified construction process, product standardization and volume purchasing. In addition, we include built in wireless capability, home automation and solar power in many of the homes we sell, which enhances our brand and improves our ability to generate traffic and sales.\nWe sell our homes from models that we have designed and constructed. We employ new home consultants who are paid salaries, commissions or both to conduct on-site sales of our homes. We also sell homes through independent realtors. We have made it possible for potential homebuyers to take virtual tours of model homes. During fiscal 2024 and 2023, even with shifts in macroeconomic factors and adjusting to an inflationary environment in much of the period, we were able to develop, enhance, use, and improve the Lennar machine. Our sales, marketing, and dynamic pricing machine is quickly becoming an advanced digital engine that has materially benefited from aggressive, focused use and engagement while the market was most difficult.\nOur marketing strategy has increasingly involved advertising through digital channels including real estate listing sites, paid search, display advertising, social media and e-mail marketing, all of which drive traffic to our website, www.lennar.com. This has allowed us to attract more qualified and knowledgeable homebuyers. However, we also continue to advertise through more traditional media on a limited basis, including newspapers, other local and regional publications, radio and on billboards where appropriate. We tailor our marketing strategy and message based on the community being advertised and the customers being targeted, such as advertising our active adult communities in areas where prospective active adult homebuyers live or will potentially want to purchase. During fiscal 2024 and 2023, increased interest rates as compared to prior years have made our homes less affordable to many prospective buyers and led us to reduce prices or increase sales incentives in a number of our communities to maintain sales pace.\nQuality Service\nWe continually strive to improve homeowner customer satisfaction throughout the pre-sale, sale, construction, closing and post-closing periods. We strive to create a quality homebuying experience for our customers through the participation of sales associates, on-site construction supervisors and customer care associates, all working in a team effort, as well as use of technology to simplify the homebuying and financing process. We believe this leads to enhanced customer retention and referrals. The quality of our homes is substantially affected by the efforts of on-site management and others engaged in the construction process, by the materials we use in particular homes, and by other similar factors.\n3\nTable of \nContents\nWe warrant our new homes against defective materials and workmanship for a minimum period of one year after the date of closing. Although we subcontract virtually all segments of construction to others and our contracts call for the subcontractors to repair or replace any deficient items related to their trades, we are primarily responsible to the homebuyers for the correction of any deficiencies.\nLocal Operating Structure and Centralized Management\nWe balance a local operating structure with centralized corporate level management. Our local operating structure consists of homebuilding divisions across the country, each of which is usually managed by a division president, a controller and personnel focused on land acquisition, entitlement and development, sales, construction, customer service and purchasing. This local operating structure gives our division presidents and their teams, who generally have significant experience in the homebuilding industry, and in most instances, in their particular markets, the flexibility to make local operating decisions, including land identification, entitlement and development, the management of inventory levels for our current sales volume, community development, home design, construction and marketing of our homes. We centralize at the corporate level decisions related to our overall strategy, acquisitions and disposition of land and businesses, risk management, financing, cash management and information systems.\nBacklog\nBacklog represents the number of homes under sales contracts. Homes are sold using sales contracts, which are generally accompanied by deposits. In some instances, purchasers are permitted to cancel sales contracts if they fail to qualify for financing or under certain other circumstances. We experienced a cancellation rate of 14% in 2024 and 16% in 2023. We do not recognize revenue on homes that are the subject of sales contracts until the sales are closed and title passes to the new homeowners. \nThe backlog dollar value including unconsolidated entities at November 30, 2024 was $5.4 billion, compared to $6.6 billion at November 30, 2023. We expect that a significant portion of all homes currently in backlog will be delivered in fiscal year 2025.\nHomebuilding Investments in Unconsolidated Entities\nWe create and participate in joint ventures that acquire and develop land for our homebuilding operations, for sale to third parties or for use in the ventures' own homebuilding operations. Through these joint ventures, we reduce the amount we invest in potential future homesites, thereby reducing risks associated with land acquisitions and improving the return on our investments, and, in some instances, we obtain access to land to which we could not otherwise have obtained access or could not have obtained access on as favorable terms. As of both November 30, 2024 and 2023, we had equity investments in 51 active homebuilding and land unconsolidated entities, in which we were participating, and our maximum recourse debt exposure related to Homebuilding unconsolidated joint ventures was $44.2 million and $42.1 million, respectively. This is discussed in greater detail in Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of this Report.\nMillrose Spin-Off\nWe are currently preparing to spin off (the “Millrose Spin-Off”) a wholly owned subsidiary of Lennar, Millrose Properties Inc. (“Millrose”) into an independent, publicly traded company that will be listed on the New York Stock Exchange. In connection with the Millrose Spin-Off, we plan to contribute to Millrose, in exchange for all outstanding shares of its common stock, a significant portion of our undeveloped, partially developed, and some of our fully developed, land, with an expected total aggregate value between $5.0 billion and $6.0 billion, as well as approximately $1.0 billion of cash. To consummate the Millrose Spin-Off, on January 10, 2025, our Board of Directors (\"Board\") declared a stock dividend, pursuant to which we will distribute to Lennar’s stockholders of record as of January 21, 2025 approximately 80% of the total outstanding number of shares of Millrose common stock on February 7, 2025. The goal of the Millrose Spin-off is to generally complete our migration to an asset-light operating model by spinning off a significant portion of our land assets from our balance sheet. We expect Millrose to qualify as a real estate investment trust that will acquire and develop land and will deliver fully developed homesites under a land option contract on a just in time basis for Lennar and potentially other homebuilders. Millrose is expected to maintain a business model with a self-sustaining, recycling source of land acquisition and development capital. Millrose is expected to be responsible for paying to develop the undeveloped and partially developed land into homesites up to a certain pre-negotiated budget, with Lennar  performing the actual construction work. Lennar will have options to purchase the homesites in accordance with pre-set takedown schedules when Lennar expects to be ready to build homes on them. Millrose is expected to use option exercise proceeds to purchase additional land designated by Lennar or other homebuilders in the future, usually giving Lennar or the other homebuilders options to purchase the land when it is developed.\nAs a result of the Millrose Spin-Off, both our inventory and our equity will be reduced by the amount of assets contributed to Millrose. However, our balance sheet will remain very strong after the Millrose Spin-Off and we expect to have ample funds with which to pay down debt, issue dividends and repurchase stock.\n4\nTable of \nContents\nMillrose has filed with the Securities and Exchange Commission a registration statement on Form S-11 relating to the Millrose Spin-Off, which became effective on January 17, 2025. We expect that the Millrose Spin-Off will be completed by February 7, 2025, the distribution date of the Millrose common stock shares to Lennar’s stockholders, but there is no guarantee that the transaction will be completed on our anticipated timeline.\nPending Acquisition of Rausch Coleman Homes\nDuring the fourth quarter of 2024, we entered into a definitive agreement to purchase Rausch Coleman Homes, a residential homebuilder based in Fayetteville, Arkansas. With this acquisition, we will expand our footprint into new markets in Arkansas, Oklahoma, Alabama, Kansas and Missouri while adding to our existing footprint in Texas, Oklahoma, Alabama and Florida. As previously disclosed in Millrose’s registration statement on Form S-11, in connection with furthering our land light strategy, we intend to assign the purchase of Rausch Coleman's land assets (the “Rausch Land Assets”) to Millrose. Similar to the other land assets that Lennar expects to contribute to Millrose in connection with the Millrose Spin-Off, Lennar expects to enter into options to purchase the developed Rausch Land Assets in accordance with pre-set takedown schedules. We are expecting the acquisition to be completed in our first quarter of 2025.\nFinancial Services Operations\nResidential Mortgage Financing\nWe offer conforming conventional, FHA-insured and VA-guaranteed residential mortgage loan products and other residential mortgage products primarily to buyers of our homes through our financial services subsidiary, Lennar Mortgage, from locations in most of the states in which we have homebuilding operations. In fiscal year 2024, our financial services subsidiaries provided loans to 84% of our homebuyers who obtained mortgage financing in areas where we offered services. Because of the availability of mortgage loans from our financial services subsidiaries, as well as from independent mortgage lenders, we believe almost all creditworthy potential purchasers of our homes have access to financing.\nDuring fiscal year 2024, we originated approximately 54,600 residential mortgage loans totaling $19.8 billion, compared to 47,000 residential mortgage loans totaling $17.4 billion during fiscal year 2023. Substantially all of the residential mortgage loans we originate are sold within a short period in the secondary mortgage market, a majority of them on a servicing-released, non-recourse basis. After the loans are sold, we retain potential liability for claims by purchasers that we breached certain limited industry-standard representations and warranties in the loan sale agreements. Occasional claims of this type are a normal incident of loan securitization activities. We do not believe that the ultimate resolution of these claims will have a material adverse effect on our business or financial position. During fiscal year 2024, we also locked interest rates on approximately 54,200 residential mortgage loans totaling $19.5 billion, compared to 46,600 residential mortgage loans totaling $17.2 billion during fiscal year 2023. \nWe finance our mortgage loan activities with borrowings under our financial services warehouse facilities or funds from our operating activities. At November 30, 2024, Financial Services had six warehouse residential facilities maturing at various dates through fiscal 2027 with a total maximum borrowing capacity of $3.1 billion including an uncommitted amount of $675 million. We expect the facilities to be renewed or replaced with other facilities when they mature. If they are not renewed or replaced, we would have to find other sources of funding for our mortgage originations, which might include our own funds. We have a corporate risk management policy under which we hedge our interest rate risk on rate-locked loan commitments and loans held-for-sale to mitigate exposure to interest rate fluctuations.\nWe have been using new technology to automate portions of our mortgage loan origination process. This new technology has made the mortgage financing process easier for homebuyers and improved the customer experience. This new technology has also enabled us to increase the number of digital closings, with digital document signing and, where legally permitted, digital notarization.\nTitle, Insurance and Closing Services\nWe are licensed to provide title insurance, and closing services for residential and/or commercial transactions in 41 states to our homebuyers and others. During fiscal 2024 and 2023, we provided closing services with regard to approximately 82,400 and 74,900, real estate transactions, respectively, in 25 states.\nCommercial Mortgage Origination\nOur LMF Commercial subsidiary originates and sells into securitizations first mortgage loans, which are secured by income producing commercial properties. The loans generally are between $5 million and $50 million each. LMF Commercial also originates floating rate loans secured by commercial real estate properties, many of which are in transition, undergoing lease-up, sell-out, renovation or repositioning. In order to finance LMF Commercial lending activities, as of November 30, 2024, LMF Commercial had two warehouse repurchase financing agreements maturing at various dates from 2025 through \n5\nTable of \nContents\nfiscal 2026 with commitments totaling $300 million. This is discussed in greater detail in Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of this Report.\nLennar Other\nStrategic Technology Investments\nWe strategically invest in companies involved in technology initiatives that, among other things, help us enhance the homebuying or home ownership experience, reduce our SG&A expenses and help us stay at the forefront of homebuilding innovation. Six of the companies in which we have strategic investments are publicly traded. They are: \n•\nBlend Labs, Inc. (\"Blend\"), a digital lending platform developer simplifying and fast tracking the consumer finance process; \n•\nHippo Holdings, Inc. (\"Hippo\"), a company that provides an efficient means of obtaining home insurance;\n•\nOpendoor Technologies, Inc. (\"Opendoor\"), a company that uses technology to significantly streamline the homebuying and selling process;\n•\nSmartRent, Inc. (\"SmartRent\"), an enterprise smart home automation company;\n•\nSonder Holdings, Inc. (\"Sonder\"), a company that manages short-term rentals, such as rental hotels; and\n•\nSunnova Energy International, Inc. (\"Sunnova\"), a leading national residential solar company, to which during 2021, we sold our solar power business in return for equity.\nEach of the investments listed above is reflected in our financial statements at market value, with changes to the fair values of those investments generating gains or losses on our financial statements. At November 30, 2024, the book value of our investment in strategic technology investments was $587.1 million and is included in our Lennar Other segment.\nFor additional information about our investments in strategic technology investments, see Management's Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of this Report. \nMultifamily Operations\nOur Multifamily business has been engaged in the development of multifamily communities since 2011. Initially, the Multifamily business almost exclusively participated in shorter-duration joint ventures that built multifamily communities with the intention of selling them soon after they were built, and in most cases after they were substantially occupied. However, the Multifamily business now manages, and owns interests in, longer-duration funds that build multifamily communities with the intention of retaining them as rental income-generating assets. At November 30, 2024, Multifamily had interests in, and was managing, three funds and 23 joint ventures. \nFrom inception through November 30, 2024, the Multifamily business has capitalized and developed 123 multifamily residential communities with approximately 37,100 rental units across 20 states throughout the United States. The communities developed by the Multifamily business include a diversified mix of conventional garden, mid-rise and high-rise multifamily properties in urban and suburban locations near major employment centers. Most communities offer residents a mix of studio, one, two, and three-bedroom homes. \nAs of November 30, 2024, funds and ventures managed by Multifamily had a pipeline of 57 potential future developments, which were owned, under contract or subject to letters of intent, totaling approximately $6.5 billion in anticipated development costs across several states.\nMultifamily has co-investments in all the funds and ventures it manages, and receives returns on these investments. In addition, it has carried interests in the funds or ventures it manages, and receives distributions with regard to those carried interests. \nLennar Multifamily Venture Fund I (“LMV I\") is a long-term multifamily development investment vehicle involved in the development, construction and property management of class-A multifamily assets. As of November 30, 2023, there were 38 rental operation projects in LMV I. During the second half of fiscal 2024, the LMV I partners decided to liquidate and sell all of the individual rental operation projects of LMV I as the fund has come to the end of its contractual life. During the year ended November 30, 2024, 33 LMV I rental operation projects were sold to various third-party buyers. We recognized a net gain of $211.5 million on the sale of these rental operation projects which was recorded as equity in earnings (losses) in the condensed consolidated statement of operations and received net cash distributions of $199.5 million. The remaining LMV I rental operation projects are expected to be monetized in the near term.\nSingle-Family Home Rentals \nIn December 2020, Lennar formed the Upward America Venture, LLC (“Upward America”), which (a) acquires communities of single-family rental properties (including townhomes, duplexes and condominium buildings developed or \n6\nTable of \nContents\nacquired for rental purposes), and (b) leases and manages homes in those communities. Lennar subsidiaries are the manager and the general partner of Upward America. The investment period for Upward America closed in 2024, reducing the equity commitments from investors from $1.6 billion to $1.0 billion. As of November 30, 2024, institutional investors and Lennar had committed $1.0 billion to Upward America, part of which was used to reduce an initial commitment Lennar had made from $225 million to $78.1 million. Proceeds of commitments by other investors may be used to redeem more of Lennar’s ownership, but Lennar has agreed not to reduce its ownership below $50 million.\nAs owner of the general partner of Upward America, Lennar has the right to receive, in addition to distributions regarding its own commitments, distributions based on the amounts by which returns to limited partners exceed specified amounts (i.e., carried interests). As the manager of Upward America, Lennar receives management and acquisition fees. Lennar subsidiaries may also receive fees for property management, leasing, construction management and other services that they render through subcontractors. In April 2024, Upward America entered into a joint venture agreement and property management agreement with Invitation Homes. In addition, Lennar engaged Invitation Homes to provide certain asset management services for the Upward America Venture. \nAt November 30, 2024, Upward America had purchased 4,697 homes in 103 communities across 19 metropolitan statistical areas for a total purchase price of $1.2 billion (an average price of $258,000 per home) and disposed of 92 homes for a total sales price of $26.0 million (an average price of $283,000 per home). The Limited Partnership Agreement of Upward America gives Upward America the right to purchase from Lennar for their appraised value all homes or communities that are purpose built by Lennar for single-family home rental. Upward America also is free to purchase homes from homebuilders other than Lennar or to purchase previously occupied homes. Initially all the homes purchased by Upward America were purchased from Lennar, but subsequently, Upward America began purchasing homes from multiple homebuilders. At both November 30, 2024 and 2023, approximately 6% of the homes owned by Upward America were built by homebuilders other than Lennar.\nFive Point Holdings, LLC\nWe own an indirect approximately 40% interest in FivePoint, which is a publicly traded developer of three large master planned mixed-use developments in California (Newhall Ranch, Great Park Neighborhoods, and San Francisco Shipyard/Candlestick Point). We sometimes purchase properties from FivePoint for use in our homebuilding operations. We have no active role in the management of FivePoint, except that since August 2021 our Executive Chairman and Co-Chief Executive Officer has been the non-employee Executive Chairman of the Board of Directors (but not the chief executive officer) of FivePoint. As of November 30, 2024, the carrying amount of our investment in FivePoint was $470.8 million.\nRialto Fund Investments\nUntil November 30, 2018, we had a group of subsidiaries, including Rialto Capital Management, LLC (\"Rialto\"), that primarily managed real estate related investment funds and other real estate related investment vehicles. We sold the Rialto Management Group on November 30, 2018. However, we retained the right to share in carried interest distributions from some of the funds and other investment vehicles Rialto manages. We also retained limited partner investments in several Rialto funds and investment vehicles that totaled $140.1 million as of November 30, 2024.\nSeasonality\nWe historically have experienced, and expect to continue to experience, variability in quarterly results. Our homebuilding business is seasonal in nature and generally reflects higher levels of new home order activity in our second and third fiscal quarters and increased deliveries in the second half of our fiscal year. However, a variety of factors can alter seasonal patterns. In addition, we are working towards moving to a more even flow production where we start, sell and deliver a similar number of homes each quarter.\n7\nTable of \nContents\nCompetition\nThe residential homebuilding industry is highly competitive. In each of the market regions where we operate, we compete for homebuyers with numerous national, regional and local homebuilders, as well as with resales of existing homes and with the rental housing market. We compete for homebuyers on the basis of a number of interrelated factors including location, price, reputation for customer satisfaction, amenities, design, quality and financing. In addition to competition for homebuyers, we also compete with other homebuilders for desirable properties, raw materials and access to reliable, skilled labor. We compete with a wide variety of property owners in our efforts to sell land to homebuilders and others. We believe we are competitive in the market regions where we operate primarily due to our:\n•\nEverything’s Included\n®\n marketing program, which simplifies the homebuying experience by including the most desirable features as standard items;\n•\nInnovative home designs, such as our Next Gen\n®\n homes that provide both privacy and togetherness for multi-generational families or a home office to accommodate working from home;\n•\nInclusion of built-in Wi-Fi, solar power systems and advanced technology in many of our homes;\n•\nConsumer insight capabilities, which allow us to continually stay tapped into consumer preferences and feedback so we can continuously evolve and fine-tune our offerings, processes and communications for our customers; \n•\nFinancial position as a result of our ability to finance land purchases and development activities with operating revenues and corporate level unsecured borrowing;\n•\nAccess to land, particularly in land-constrained markets;\n•\nPricing to current market conditions;\n•\nCost efficiencies realized through our national purchasing programs and production of value-engineered homes;\n•\nQuality construction and home warranty programs, which are supported by a responsive customer care team; \n•\nOur builder of choice program through which we maximize the efficiency of our suppliers' dealing with us;\n•\nSize and scale in leading markets; \n•\nUse of digital channels to advertise homes; and\n•\nStrategic investments in technology initiatives through our LEN\nX \ninvestments in companies that help us enhance the homebuying and home ownership experience, and help us stay at the forefront of homebuilding innovation.\nOur residential financial services operations compete with other residential mortgage lenders, including national, regional and local mortgage bankers and brokers, banks, savings and loan associations, non-bank mortgage lenders and other financial institutions, in the origination and sale of residential mortgage loans. Principal competitive factors include interest rates and other features of mortgage loan products available to the consumer. We compete with other title insurance agencies and underwriters for closing services and title insurance. Principal competitive factors include service and price.\nOur LMF Commercial subsidiary's commercial mortgage origination and sale business competes with a wide variety of banks and other lenders that offer small and mid-sized mortgage loans to commercial enterprises. Competition is based primarily on service, price and relationships with mortgage brokers and other referral sources. LMF Commercial is run by highly seasoned managers who have been originating and securitizing loans for over 30 years and benefit from long-standing relationships with referral sources, as well as being able to leverage Lennar's infrastructure facilities for rapid market entrances and analysis. We believe these factors give LMF Commercial an advantage over many of the lenders with which it competes. Additionally, we believe access to Lennar's local homebuilding teams provides LMF Commercial with a distinct advantage in its evaluation of real estate assets.\nIn each region where we develop and operate multifamily properties, there is competition for residents with other owners of residential real estate (whether for-rent or for-sale). In addition, when capital raising, we compete with a wide variety of other investment opportunities that are being marketed by other firms, related both to real estate and to a variety of other investment products. We also compete for developable land with other developers of real estate for a variety of uses. \nIn each region where our funds offer single-family homes for rent, there is competition for residents with other owners of residential real estate (whether for-rent or for-sale). In addition, in seeking investors to acquire interests in funds we form, we will be competing with a wide variety of investment opportunities, related both to real estate and to a variety of other investment products. Also, in seeking to acquire single-family homes that our funds can hold as rental properties, our funds will be competing with other persons who plan to hold them as rental properties as well as persons who might want to purchase those homes to live in them. \nRegulation\nThe residential communities and multifamily apartment developments that we build are subject to a large variety of local, state and federal statutes, ordinances, rules and regulations relating to, among other things, zoning, construction permits \n8\nTable of \nContents\nor entitlements, construction materials, density, building design and property elevation, building codes and handling of waste. These include laws requiring the use of construction materials that reduce the need for energy-consuming heating and cooling systems. These laws and regulations are subject to frequent change and often increase construction costs. For example, the California Energy Commission has adopted a requirement that most newly built homes in California must have rooftop solar panels. In some instances, we must comply with laws that require commitments from us to provide roads and other offsite infrastructure, and may require them to be in place prior to the commencement of new home construction. These laws and regulations are usually administered by counties and municipalities and may result in fees and assessments or building moratoriums. In addition, many new development projects are subject to assessments for schools, parks, streets and highways and other public improvements, the costs of which can be substantial. Also, some governmental agencies are attempting to make homebuilders responsible for violations of wage and other labor laws by their subcontractors. \nResidential homebuilding and apartment development are also subject to a variety of local, state and federal statutes, ordinances, rules and regulations concerning the protection of health and the environment. These environmental laws include such subjects as storm water and surface water management, soil, groundwater and wetlands protection, subsurface conditions and air quality protection and enhancement. Environmental laws may result in delays in developing properties, may cause us to incur substantial compliance and other costs and may prohibit or severely restrict homebuilding activity in environmentally sensitive regions or areas.\nOver the years, several cities and counties in which we have developments have submitted to voters \"slow growth\" initiatives and other ballot measures that could impact the affordability and availability of land suitable for residential development within those localities. Although many of these initiatives have been defeated, if similar initiatives were approved, residential construction by us and others within certain cities or counties could be seriously impacted.\nIn order to make it possible for some of our homebuyers to obtain FHA-insured or VA-guaranteed mortgages, we must construct the homes they buy in compliance with regulations promulgated by those agencies. Various states have statutory disclosure requirements relating to the marketing and sale of new homes. These disclosure requirements vary widely from state-to-state. In some states, we are required to be registered as a licensed contractor and comply with applicable rules and regulations. In various states, our new home consultants are required to be registered as licensed real estate agents and to adhere to the laws governing the practices of real estate agents.\nOur mortgage and title subsidiaries must comply with applicable real estate, lending and insurance laws and regulations. The subsidiaries are licensed in the states in which they do business and must comply with laws and regulations in those states. These laws and regulations include provisions regarding capitalization, operating procedures, investments, lending and privacy disclosures, forms of policies and premiums. The Dodd-Frank Wall Street Reform and Consumer Protection Act contains a number of requirements relating to mortgage lending and securitizations. These include, among others, minimum standards for lender practices, limitations on certain fees and a requirement that the originator of loans that are securitized retain a portion of the risk, either directly or by holding interests in the securitizations.\nSeveral federal, state and local laws, rules, regulations and ordinances, including, but not limited to, the Federal Fair Debt Collection Practices Act (\"FDCPA\") and the Federal Trade Commission Act and comparable state statutes, regulate consumer debt collection activity. Although, for a variety of reasons, we may not be specifically subject to the FDCPA or to some state statutes that govern debt collectors, it is our policy to comply with applicable laws in our collection activities. To the extent that some or all of these laws apply to our collection activities, our failure to comply with such laws could have a material adverse effect on us. We are also subject to regulations promulgated by the Federal Consumer Financial Protection Bureau regarding residential mortgage loans.\nEnvironment\nWe are focused on creating environmentally sustainable products, and our purchasing power enables us to include green features in our homes. Each new home we build is healthier and more energy efficient, and has less impact on the environment, than prior generations of homes as a result of features like:\n•\nLow-VOC paint that reduces pollution with less odor and hazard;\n•  WaterSense® faucets that reduce water flow without sacrificing performance;\n•  Low-E windows that reduce infrared and ultraviolet light coming into the home, make homes cooler, and reduce damage to furnishing; and\n•  Energy Star® appliances that reduce energy consumption.\nIn addition, our home design and engineering work optimizes efficient use of building materials and reduces construction waste. \nWe also believe in the value of clean energy from solar power, which is why we formed our own captive solar power company in 2013. In 2021, we sold our SunStreet solar operations to Sunnova, a leading national residential solar company, in exchange for stock in the company. We consistently seek opportunities to integrate solar power where it provides great value for our homebuyers.\n \n9\nTable of \nContents\nHuman Capital Management\nDiversity, Equity and Inclusion; Talent Management and Leadership Development\nOur associates (i.e., employees) are our most valuable asset, and we are committed to supporting each associate’s unique career journey. We were built on a culture of inclusivity and a conscious focus on the associate experience, bringing together the best talent to drive success as part of our “Lennar family.” We believe having an inclusive work environment, where everyone has a sense of belonging, not only drives engagement but fosters innovation, which is critical to driving growth. Our “Everyone’s Included” mantra relative to inclusion and diversity within our company anchors our unique culture.\nOur success starts and ends with having the best talent, and, as a result, we are focused on attracting, developing, engaging and retaining our associates. We understand the importance of balance, and offer associates a competitive and comprehensive benefits package, including paid parental leave and resources for whole-self well-being (physical, social, and financial).\nHealth and Safety\nWe are committed to the health and safety of our associates and trade partners. We hired a full-time Chief Medical Officer in early 2020 at the beginning of the COVID-19 pandemic. Our experienced teams adapted quickly to changes in safety protocols to protect our associates, trade partners and homebuyers, and we have continued these protocols even after the COVID-19 pandemic receded. We are also committed to worker safety and regulatory compliance, and among other things, require that office associates with oversight of construction and associates who work in the field take additional safety courses. Our Board and its Audit Committee regularly review the results of OSHA visits and other safety-related information\n \nto ensure that we are successfully managing and improving our safety program.\nEmployees and Labor Relations\nAlthough we subcontract the land development and construction aspects of our homebuilding activities, we are highly dependent on our skilled employees for critical aspects of what we do. That includes senior executives who are responsible for our operational strategies and for approving significant land acquisitions and other major investments we make. It also includes the people who head our homebuilding divisions and non-homebuilding segments. And it includes the many people who are involved in design, construction oversight, marketing and other aspects of our homebuilding business and in carrying out our other activities.\nAt November 30, 2024, we employed 13,265 individuals of whom 10,653 were involved in the Homebuilding operations, 2,066 were involved in the Financial Services operations and 546 were involved in the Multifamily operations, compared to November 30, 2023, when we employed 12,284 individuals of whom 9,622 were involved in the Homebuilding operations, 1,792 were involved in the Financial Services operations and 870 were involved in the Multifamily operations. We do not have collective bargaining agreements relating to any of our associates. However, we subcontract many phases of our homebuilding operations and some of the subcontractors we use have employees who are represented by labor unions. We believe our overall relations with our workforce are healthy.\nWe are firmly committed to providing equal employment opportunities for all applicants and employees. Our Code of Business Ethics and Conduct prohibits discrimination on the basis of a person’s race, color, religion, sex, sexual orientation, gender identity or expression, national origin, disability, veteran status, genetic information, or any other legally protected status.  \nAvailable Information\nThis Report on Form 10-K and all other reports and amendments we file with or furnish to the SEC are publicly available free of charge on the investor relations section of the Lennar website as soon as reasonably practicable after we file such materials with, or furnish them to, the SEC. Our website is www.lennar.com. We caution you that the information on our website is not incorporated herein and is not a part of this or any other report we file with, or furnish to, the SEC. In addition, the SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers, where you may obtain a copy of all of the materials we file publicly with the SEC. The SEC website address is www.sec.gov.\nSpecial Note Regarding Forward-Looking Statements\nThis annual report on Form 10-K contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These statements concern expectations, beliefs, projections, plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. These forward-looking statements typically include the words “anticipate,” “believe,” “consider,” “estimate,” “expect,” “forecast,” “intend,” “objective,” “plan,” “predict,” “projection,” “seek,” “strategy,” “target,” “will”, \"may\" or other words of similar meaning. Some of them are opinions formed based upon general observations, anecdotal evidence and industry experience, but that are not supported by specific investigation or analysis.\n10\nTable of \nContents\nThese forward-looking statements reflect our current views about future events and are subject to risks, uncertainties and assumptions. We wish to caution readers that certain important factors may have affected and could in the future affect our actual results and could cause actual results to differ significantly from what is anticipated by our forward-looking statements. The most important factors that could cause actual results to differ materially from those anticipated by our forward-looking statements include, but are not limited to: slowdowns in real estate markets in regions where we have significant Homebuilding or Multifamily development activities or own a substantial number of single-family homes for rent; decreased demand for our homes, either for sale or for rent, or Multifamily rental apartments; the potential impact of inflation; the impact of increased cost of mortgage financing for homebuyers, increased or continued high interest rates or increased competition in the mortgage industry; supply shortages and increased costs related to construction materials and labor; the possibility that increased tariffs will increase the cost of production materials; cost increases related to real estate taxes and insurance; the effect of increased interest rates with regard to our funds' borrowings on the willingness of the funds to invest in new projects; reductions in the market value of the Company's investments in public companies; natural disasters or catastrophic events for which our insurance may not provide adequate coverage; our inability to successfully execute our strategies, including our land lighter strategy and our planned spin-off; problems exercising options to purchase homesites; a decline in the value of the land and home inventories we maintain and resulting possible future write downs of the carrying value of our real estate assets; the forfeiture of deposits related to land purchase options we decide not to exercise; the potential negative impact to our business of public health issues; possible unfavorable outcomes in legal proceedings; changes in general economic and financial conditions that reduce demand for our products and services, lower our profit margins or reduce our access to credit; our inability to acquire land at anticipated prices; the possibility that we will incur nonrecurring costs that affect earnings in one or more reporting periods; the possibility that the benefit from our increasing use of technology will not justify its cost; increased competition for home sales from other sellers of new and resale homes; becoming unable to pay down debt; government actions or other factors that might force us to terminate our program of repurchasing our stock; the failure of the participants in various joint ventures to honor their commitments; difficulty obtaining land-use entitlements or construction financing; harm to our business from information technology failures and data security breaches; new laws or regulatory changes that adversely affect the profitability of our businesses (including changes in tax laws or liabilities); our inability to refinance our debt on terms that are as favorable as our current arrangements; and changes in accounting conventions that adversely affect our reported earnings.\nPlease see",
    "item1a": "Item 1A of this Annual Report on Form 10-K for more information on risks from cybersecurity threats that are reasonably likely to materially affect our business strategy, results of operations and financial condition.\nGovernance\nManagement \nOur \nChief Technology Officer (“CTO”)\n is responsible for assessing and managing our material risks from cybersecurity threats. We have also established a cross-functional Cyber Steering Committee, which includes our CTO, Chief Information Security Officer (“CISO”), General Counsel, certain business leaders on a rotating basis and representatives of human resources and communications. The CISO, supported by inputs from the CTO team leads, delivers quarterly updates to the Committee on key risks and overall security program posture, as well as monthly strategic updates to the CTO on high visibility and key action items. \nOur CTO regularly reports to our Board and the Audit Committee.\nOur CTO has served in this role since 2023 and has over 25 years of experience in the technology industry. Prior to his current role, he served as the CTO of Tyson Foods and before arriving at Tyson, he was the Chief Information Officer at Hewlett Packard, and then CIO at Hewlett Packard Enterprise.\nBoard of Directors\nOur Audit Committee is responsible for the oversight of cybersecurity risks and receives a cybersecurity report from \n23\nTable of \nContents\nour CTO at least quarterly, and more often as needed, including in the event of a significant cybersecurity incident. The report includes information regarding the nature of threats, defense and detection capabilities, incident response plans and associate training activities. Our Board retains responsibility for the oversight of our overall risk management systems and processes and is briefed our CTO on cybersecurity risks on a quarterly basis.",
    "item1b": "Item 1B.    Unresolved Staff Comments.\nNot applicable.\nInformation about our Executive Officers\nThe following individuals are our executive officers as of January 23, 2025:\nName\nPosition\nAge\nStuart Miller\nExecutive Chairman and Co-Chief Executive Officer\n67\nJonathan M. Jaffe\nCo-Chief Executive Officer and President\n65\nDiane J. Bessette\nVice President and Chief Financial Officer\n64\nMark Sustana\nVice President, General Counsel and Secretary\n63\nDavid Collins\nVice President and Controller\n55\nMr. Miller has served as our Executive Chairman since April 2018 and as our Executive Chairman and Co-Chief Executive Officer since September 2023. Mr. Miller served as our Chief Executive Officer from 1997 to April 2018 and as our President from 1997 to April 2011. Before 1997, Mr. Miller held various executive positions with us. Mr. Miller also serves as non-employee Executive Chairman of the Board of Directors of Five Point Holdings, LLC and served as a member of the Board of Directors of Doma Holdings, Inc. from 2019 to 2024. \n Mr. Jaffe is one of our Directors and has served as our Co-Chief Executive Officer and President since September 2023. Prior to that, Mr. Jaffe served as our Co-Chief Executive Officer and Co-President from November 2020 to September 2023. Mr. Jaffe previously served as our President from April 2018 to November 2020 and as our Chief Operating Officer from December 2004 to January 2019. Mr. Jaffe served as a Vice President from 1994 to April 2018 and prior to that, served as a Regional President in our Homebuilding operations.\nMs. Bessette has served as our Chief Financial Officer since April 2018 and as a Vice President since 2000. Ms. Bessette initially joined us in 1995 and served as our Controller from 1997 to 2008 and as our Treasurer from February 2008 to April 2024. Ms. Bessette is a member of the Board of the Miami Branch of the Federal Reserve Bank of Atlanta. \nMr. Sustana has served as Vice President since April 2018, and as our Secretary and General Counsel since 2005.\nMr. Collins \njoined us in 1998 and has served as a Vice President since January 2021, and as our Controller since February 2008.\n22\nTable of \nContents",
    "item1c": "Item 1C.    Cybersecurity.\nRisk Management and Strategy\nWe rely extensively on information technology (“IT”) systems, including Internet sites, data hosting facilities and other hardware and software platforms, some of which are hosted by third parties, to assist in conducting our businesses. These systems, like those used by most companies, may be vulnerable to a variety of disruptions, including, but not limited to, those caused by natural disasters, telecommunications failures, hackers, and other security issues. Moreover, these IT systems, like those used by most companies, are subject to the possibility of computer viruses or other malicious codes, and to security breaches, cyber incidents, ransomware attack or phishing-attacks. \nCybersecurity is an integral part of risk management at our Company, and we maintain a comprehensive process for assessing, identifying and managing material risks from cybersecurity threats, which is part of our overall risk management system and processes.\nWe have installed and continually upgrade an array of protections against cyber-intrusions. Our cybersecurity risk management processes are based upon the National Institute of Standards and Technology (NIST) Cybersecurity Framework, as well as various other regulatory requirements and industry-specific standards. We implement risk-based controls to protect our information, the information of our customers, suppliers, and other third parties, our information systems, our business operations, and our products and related services. These controls include multifactor authentication on all critical systems, firewalls, encryption, anti-virus protections, intrusion detection and prevention systems and identity management systems. We provide mandatory cybersecurity awareness training of threats to associates at least annually and routinely deploy simulated phishing tests to increase security awareness.\n \nOur IT team regularly tests our controls through penetration testing, vulnerability scanning, internal compliance assessments, threat-hunting operations and attack simulation.\nAdditionally, in connection with our cybersecurity risk management processes, from time to time, \nwe engage independent third parties to assess our cybersecurity program and to assist us with defining our cybersecurity strategy, uplifting our processes and aligning our objectives.\n Outside counsel has also advised the Board about legal obligations in managing cybersecurity issues and risks.\nWe maintain a cybersecurity incident response plan, which provides a framework for handling cybersecurity incidents based on, among other factors, the potential severity of the incident and facilitates cross-functional coordination across the Company. We also conduct “tabletop” exercises, including exercises facilitated by third parties, during which we simulate cybersecurity incidents to ensure that we are prepared to respond to such an incident and to highlight any areas for potential improvement in our cybersecurity incident response plan. These exercises are conducted at both the technical level and senior management level and have included participation by members of our Board.\nOur cybersecurity risk management processes extend to the oversight and identification of threats associated with our use of third-party service providers, including through due diligence of such providers’ cybersecurity practices, contractual obligations to operate their IT systems in accordance with certain cybersecurity standards and ongoing monitoring.\nOur business strategy, results of operations and financial condition have not been materially affected by risks from cybersecurity threats, including as a result of previous cybersecurity incidents, but we cannot provide assurance that they will not be materially affected in the future by such risks and any future material incidents\n. See “Risk Factors” in"
  }
}