{
  "ticker": "LH",
  "cik": "0000920148",
  "company_name": "LABCORP HOLDINGS INC.",
  "filing_date": "2025-02-25",
  "accession": "0000920148-25-000032",
  "primary_doc": "lh-20241231.htm",
  "item_sections": {
    "item1": "Item 1.       BUSINESS\nLabcorp® Holdings Inc. (Labcorp or the Company) is a global leader of innovative and comprehensive laboratory services that provides vital information to help doctors, hospitals, pharmaceutical companies, researchers, and patients make clear and confident decisions. By leveraging its unparalleled diagnostics and drug development capabilities, the Company provides insights and accelerates innovations to improve health and improve lives. The Company’s nearly 70,000 employees serve clients in approximately 100 countries, provided support for more than 75% of the new drugs and therapeutic products approved in 2024 by the FDA, and performed more than 700 million tests annually for patients around the world.\nOn April 25, 2024, Laboratory Corporation of America Holdings (LCAH) announced plans to implement a new public holding company structure, with Labcorp Holdings Inc. as the holding company. On May 17, 2024, the Company completed the holding company reorganization (Reorganization) and became the successor issuer to LCAH. Labcorp Holdings Inc. has no independent assets or operations and its sole ownership interest is in LCAH.\nThe Company is organized under two segments, consisting of Diagnostics Laboratories (Dx), which includes routine testing and specialty/esoteric testing, and Biopharma Laboratory Services (BLS), consisting of Early Development Research Laboratories (ED) and Central Laboratory Services. The Company\n’\ns strength in science, technology, and innovation, as well as its global scale, enable it to play a leading role in advancing healthcare across the globe.\nThe significant reach, breadth, and advancement of the Company’s offerings have resulted in Base Business revenue growth of 4.9% from 2023 through 2024 and 7.4% versus 2019 compound annual growth rate (CAGR). Base Business includes the Company’s business operations except for COVID-19 PCR testing (COVID-19 Testing).\nFor the year ended December 31, 2024, the Company generated revenues of $13,008.9 million, diluted earnings per share from continuing operations of $8.84, and had a total operating cash flow provided by continuing operations of $1,585.8 million.\nThe Company believes that science, technology, and innovation drive its continued success, differentiate the Company, and are foundational to its future. They are critical to the Company’s ability to carry out its mission to improve health and improve lives. \nSpin-off of Fortrea Holdings Inc.\nOn June 30, 2023, the Company completed the previously announced separation (Spin-off) of its former clinical development and commercialization services (CDCS) business, Fortrea Holdings Inc. (Fortrea), through the Company’s pro-rata distribution of 100% of the outstanding shares of Fortrea common stock to holders of record of Labcorp common stock (Common Stock). Each holder of record of Common Stock received one share of Fortrea common stock for every share of Common Stock. \nUpon closing of the Spin-off, Fortrea made a cash distribution to the Company of approximately $1,600.0 million. In 2023, these proceeds were mainly used to repurchase approximately $1,000.0 million in the aggregate of Common Stock pursuant to accelerated share repurchase agreements and paying down $300.0 million of debt that matured in 2023. The remaining funds were used in 2024 to support continued programs to return value to shareholders, through cash dividends and/or share repurchases.\nAs a result of the Spin-off, all current and historical operating results of Fortrea are presented as Earnings from discontinued operations, net of tax, in the Consolidated Statements of Operations and the Company has recast its BLS segment results to exclude the historical results of the CDCS business for all periods presented. \nEnterprise Strategy\n \nThrough leadership in science, technology and innovation, the Company provides vital information and services to help its customers make clear and confident health decisions and helps millions of people improve health and improve lives.\nThe Company is expanding its role in the rapidly evolving healthcare market by strengthening its positions across its portfolio of capabilities, growing strategic opportunities that drive new business, and differentiating its unique offerings, capabilities, and financial performance. The Company is focused on two near-term strategic opportunities for growth across both Dx and BLS:\n1.\nBe the Partner of Choice for Health Systems and Local and Regional Laboratories\nThe Company expects industry consolidation to continue, as hospitals and health systems focus on investing in core patient care services. The depth and the breadth of opportunity and the quality of the pipeline is robust, and the Company is optimistic \n7\nIndex\nabout continued expansion. The Company seeks partnerships that meet financial criteria, including being accretive in the first year, returning each transaction’s cost of capital within three years, and providing a clear path to improve margins.\nThe Company signed or completed 10 collaboration transactions with health systems and local and regional laboratories in 2024. The Company believes it is an attractive partner for hospitals and health systems for multiple reasons, including its: \n•\ninnovative offerings in high growth specialty areas;\n•\nindustry-leading test portfolio and national presence;\n•\nunique data and analytics capabilities; and\n•\nability to integrate a hospital’s laboratory services seamlessly.\n2.\nLead in the Development, Licensing, and Scaling of Specialty Testing\nThe Company is focused on four primary specialty testing areas: oncology, women's health, autoimmune disease, and neurology, which the Company believes represent significant growth areas. The development of specialty tests and companion diagnostics (CDx) are attractive to health systems partners and biopharma as they continue to develop more products in specialty areas and cell and gene therapy. The Company has demonstrated its ability to provide comprehensive portfolios in these four areas, which comprise more than half of clinical trials conducted in its Central Laboratory Services business. \nLonger-term, the Company is focused on three enterprise-wide strategic priorities to drive growth:\n1.\nEstablish leadership and partnership capabilities in cell and gene therapy\nCell and gene therapy is a growing focus of biopharma pipelines, with approximately 2,000 clinical trials being conducted globally and representing approximately 20% of all biopharma drug pipelines. The Company expects the cell and gene therapy market to grow at a substantially higher rate than other types of therapies over the next five years. As cell and gene therapies expand, the Company has an opportunity to leverage its strong drug development capabilities, scientific expertise, and pharma relationships to become a development lab of choice. Longer-term as these therapies develop, the Company believes it can harness its diagnostic assets to support biopharma in commercializing cell and gene therapies and scaling these therapies through its hospital and health system business over time.\n2.\nExpand Consumer-centric Capabilities\nConsumerism trends, such as greater choice, convenience, and transparency, continue to have a growing influence across the healthcare landscape and present new opportunities for growth. Through its core customer groups, the Company has approximately 175 million patient encounters per year and has invested in modern capabilities to digitize and improve the patient journey across patient service centers. Through the Labcorp OnDemand™ channel, the Company has also demonstrated its ability to connect with consumers directly and is now offering 75 health and wellness tests through Labcorp OnDemand. Across its core businesses, the Company has an opportunity to make strategic investments to continue to enhance the customer experience through its patient portal, patient service center network, and other consumer-focused initiatives, and to capitalize on select direct revenue streams that require elevated consumer capabilities. The Company’s scaled operations, trusted brand, scientific leadership, and broad customer base are key differentiators that will support its efforts to expand over time to meet the evolving needs of its customer groups.\n3.\nExpand Global Reach, Including Through Companion Diagnostics\nInternational expansion of specialized diagnostics remains a key opportunity for future growth as the Company continues to add to its pipeline of specialty diagnostics. The Company is already a key partner to biopharma in CDx. \nAs its pip\neline of specialty diagnostics grows, the Company will seek to leverage its scientific leadership in new markets through a differentiated set of capabilities, including:\n•\na global central laboratory footprint;\n•\ninnovative science and technology;\n•\na comprehensive and competitive testing portfolio; and\n•\ndeep customer relationships in diagnostics and biopharma laboratory services.\nAs CDx continues to become more important for serving customers across the enterprise, the Company has a unique set of capabilities to be an end-to-end partner to biopharma and will continue to expand these capabilities to fuel further targeted growth internationally.\nCapital Allocation\nThe Company believes it has a strong track record of deploying capital to investments that enhance the Company’s business and return capital to shareholders. \n8\nIndex\nDuring 2024, the Company invested $839.0 million in strategic business acquisitions. The acquisitions have enhanced the Company’s service offerings, expanded its customer and revenue mix, and strengthened and broadened the scope of its geographic presence. The Company continues to evaluate acquisition opportunities that leverage the Company’s core competencies, complement existing scientific and technological capabilities, increase the Company’s presence in key geographic, therapeutic and strategic areas, and meet or exceed the Company’s financial criteria. \nDuring 2024, the Company repurchased 1.1 million shares of Common Stock at an average price of $219.57 per share for a total cost of $250.1 million and paid dividends of $243.1 million. At the end of 2024, the Company had outstanding authorization from its Board of Directors (Board) to purchase up to $1,280.4 million maximum value of Common Stock.\nDuring 2024, capital expenditures were $489.9 million, or 3.8% of the Company’s revenues. The Company expects this level of spending to remain consistent in 2025, primarily in connection with projects to support growth in the Company’s core businesses, facility expansion and updates, projects related to its LaunchPad initiative, and further acquisition integration initiatives. \nThe Company will continue to evaluate opportunities for strategic deployment of capital in light of market conditions.\nSeasonality and External Factors\nThe Company experiences seasonality across its business. For example, testing volume generally declines during the year-end holiday period and other major holidays and can also decline due to inclement weather or natural disasters. Testing volumes can also be impacted by changes in the global economy, exchange rate fluctuations, political and regulatory changes, the progress of ongoing studies and the startup of new studies, as well as the level of expenditures made by the pharmaceutical, biotechnology and medical device industries in research and design (R&D). Declines in testing volume reduce revenues, operating margins, and cash flows.\nIn 2024, approximately 13.7% of the Company’s revenues were billed in currencies other than the U.S. dollar, with the Swiss franc, British pound, Canadian dollar, and the euro representing the largest components of its currency exposure. \nGiven the seasonality and changing economic factors impacting the business, comparison of the results for successive quarters may not accurately reflect trends or results for the full year.\nCompany Reporting \nThe Company’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and all amendments to those reports are made available free of charge through the Investor Relations section of the Company’s website at www.labcorp.com as soon as reasonably practicable after such material is electronically filed with, or furnished to, the U.S. Securities and Exchange Commission (SEC). Additionally, the SEC maintains a website at http://www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers, including the Company, that file electronically with the SEC. \nThe matters discussed in this “Business” section should be read in conjunction with the Consolidated Financial Statements found in Item 8 of Part II of this Annual Report, which include additional financial information about the Company. This Annual Report includes forward-looking statements that involve risks or uncertainties. The Company’s results could differ materially from those anticipated in these forward-looking statements as a result of certain factors, including the risk factors described in",
    "item1a": "Item 1A. “Risk Factors” of this Annual Report, which disclosures are incorporated by reference herein. \n43\nIndex\nIn July 2018, the Company experienced a ransomware incident which affected certain Dx information technology systems. The incident also temporarily affected certain other information technology systems involved in conducting Company-wide operations. An investigation determined that the ransomware did not and could not transfer patient or client data outside of Company systems and that there was no theft or misuse of patient or client data. This incident did not have a material effect on the Company.\nOn May 14, 2019, Retrieval-Masters Credit Bureau, Inc. d/b/a/ American Medical Collections Agency (AMCA), an external collection agency, notified the Company about a security incident AMCA experienced that may have involved certain personal information about some of the Company's patients (the AMCA Incident). The Company is involved in pending and threatened litigation related to  the AMCA Incident, as well as various government and regulatory inquiries and processes. For additional information about the AMCA Incident, see Note 15 Commitments and Contingencies to the Consolidated Financial Statements “Cybersecurity\" and “Risk Factors - Risks Related to Technology and Cybersecurity”.\nGovernance\nThe Company’s \nboard of directors\n has oversight responsibility for the Company’s enterprise risk management process and it delegates oversight responsibility for certain significant functional areas of risk management to the board’s committees. \nThe Audit Committee of the board of directors is responsible for oversight and review of the Company’s cybersecurity and other information technology risks, controls, and procedures, including the potential impact of such risks on the Company’s business, financial results, operations, and reputation, as well as the Company’s plans to mitigate cybersecurity risks and to respond to cybersecurity incidents.\n \nThe CIRO and CITO routinely present cybersecurity reports to the Audit Committee at its regularly scheduled meetings. These reports may address cyber risks and threats, the status of projects to strengthen the Company’s information security systems, assessments of the Company’s security program, prior incidents, and the emerging cyber threat landscape. In addition, the full Board receives briefings from the CIRO and CITO on at least an annual basis.\n \nManagement is responsible for day-to-day assessment and oversight of cybersecurity risks. At the senior management level, the CITO is responsible for overseeing the Company’s information technology systems, technology capabilities, and cybersecurity practices. \nThe CITO has more than 15 years of experience working in information technology-related roles and is a member of the Company’s executive leadership team and reports to the Chief Executive Officer. Prior to joining the Company, the CITO held various leadership positions with global companies.\nThe CIRO, under the direction of the CITO, is responsible for overseeing the OIS. In this role, the CIRO oversees the cyber risk management function, which identifies cybersecurity threats, assesses cybersecurity risks, and supports the CITO and the Company in managing such risks. The CIRO has over 30 years of experience in information security, and prior to joining the Company held various chief information security officer roles, including seven years at a global healthcare company. The CIRO has also served on the board of directors of Health-ISAC, an organization of critical infrastructure owners and operators within the health and public health sectors.\n The CITO and CIRO together lead efforts to design, implement and operate controls deemed appropriate for the management of Company information assets and systems. OIS manages the policies, control procedures, and control standards designed to identify, detect, protect against, respond to, and recover from cybersecurity threats and cybersecurity incidents. This group includes a cybersecurity operations team that is responsible for the information technology security monitoring and incident response activities, the latter covering the response coordination to cybersecurity incidents under the leadership and pursuant to the direction of the CIRO. OIS also oversees the Company’s cybersecurity training program for employees.\n44\nIndex",
    "item1c": "Item 1C.     CYBERSECURITY\nRisk Management and Strategy\nProtecting the information maintained by the Company about its patients, customers, colleagues, and partners against external and internal threats is a priority for the Company. Accordingly, the Company invests in the development and implementation of cybersecurity policies, control standards, and control procedures, including a risk management and assessment program, security and event monitoring capabilities, an incident response plan, and other detection, prevention, and protection capabilities, including practices and tools to monitor and mitigate external and insider threats. \nThe Company engages in a risk monitoring process through its \nOffice of Information Security (OIS)\n within the Information Technology organization that seeks to identify the likelihood and impact of threats to its systems and data, and assesses the effectiveness of the controls in place.\nThe Company has implemented a formal cybersecurity program aligned to the Secure Controls Framework (SCF), a cybersecurity and privacy framework that consolidates and maps controls across multiple regulations, standards, and best practices. The Company’s program includes the evaluation of the cybersecurity posture of third-party suppliers and vendors that have access to the Company’s data or information technology systems. Consistent with business requirements, components of the Company’s information technology and controls are assessed by independent third parties against various frameworks and standards. With the assistance of these frameworks and standards, the Company assesses risks from cybersecurity threats, monitors its information systems for potential vulnerabilities, assesses those systems pursuant to the Company’s cybersecurity policies, control standards, and control procedures, and implements appropriate mitigation measures. Mitigation of identified threats and vulnerabilities may be delayed.\nThe Company has implemented an Incident Response Plan (IR Plan), which is aligned to its overall crisis management program. The IR Plan provides a framework for responding to and managing cybersecurity incidents. The IR Plan outlines incident response requirements, reporting processes, protocols for incident evaluation, and procedures for notifying and escalating information to the Company’s senior management, and the Board and/or appropriate Board committees, as applicable. The IR Plan is reviewed, tested, and updated under the leadership of the Company’s Chief Information and Technology Officer (CITO) and Chief Information Risk Officer (CIRO). \nThe Company’s cybersecurity team also provides enterprise-wide cybersecurity training for employees to maintain and continuously improve the Company’s mitigation against human-driven risk. Cybersecurity training is conducted annually, in addition to periodic simulations and exercises to test the efficacy of this training, and expanded training is required for specific roles.\n \nEngagement with External Cybersecurity Professionals\nThe Company engages with third parties to assess the effectiveness of, and assist with, its cybersecurity risk and response systems and processes.\n \nThese third parties include cybersecurity assessors, consultants, and professionals who help identify, verify, and validate cybersecurity risks and support mitigation or incident response plans as needed.\n \nOversight of Third-Party Service Providers\nThe Company’s processes also are designed to evaluate the cybersecurity threat risks associated with its use of third-party service providers that have applicable levels of access to the Company’s data or information technology systems. The Company performs due diligence on third parties that have access to its systems, data, or facilities that house such systems or data, and it monitors cybersecurity threat risks identified through such due diligence. \nCybersecurity Incident Impact\nThe Company describes whether and how risks from identified cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect it, including its business and operating results, financial condition, and impact on the Company’s reputation and customer relationships under the “Risks Related to Technology and Cybersecurity” heading and subheadings thereunder in Part I,",
    "item1b": "Item 1B.     UNRESOLVED STAFF COMMENTS\nNone."
  }
}