{
  "ticker": "LHX",
  "cik": "0000202058",
  "company_name": "L3HARRIS TECHNOLOGIES, INC. /DE/",
  "filing_date": "2025-02-14",
  "accession": "0000202058-25-000023",
  "primary_doc": "hrs-20250103.htm",
  "item_sections": {
    "item1": "Item 1A. Risk Factors\n of this Report. For additional \ninformation, see  \nPart I. Item 1. Business\n - Cautionary Statement Regarding Forward-Looking Statements\n of this \nReport\n.\nOVERVIEW\nWe are the Trusted Disruptor in the defense industry. \nWith customers’ mission-critical needs in mind, we deliver \nend-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of global \nsecurity. We support government customers in more than\n \n100\n \ncountries, with our largest customers being various \ndepartments and agencies of the U.S. Government, their prime contractors and international allies. Our products and \n_____________________________________________________________________\n21\nservices have defense and civil government applications, as well as commercial applications.\n As of \nJanuary 3, 2025\n, \nwe had approximately \n47,000\n employees, including approximately \n18,000\n engineers and scientists\n.\nWe structure our operations primarily around the products, systems and services we sell and the markets we \nserve, and we report our\n financial results in four business segments\n: SAS, IMS, CS and AR. See \nNote 14: Business \nSegments\n in the Notes for further information regarding our business segments\n. \nU.S. and International Budget Environment\nThe\n percentage of \nour\n revenue that was derived from sales to U.S. Government customers, including foreign \nmilitary sales funded through the U.S. Government, whether directly or through prime contractors, was \n76%\n, \n76%\n \nand \n74%\n, in \nfiscal 2024\n, \n2023\n and \n2022\n, respectively.\nOn March 9, 2024, the President signed the first tranche of \nGFY\n 2024 appropriations funding bills into law, \nwhich funded six government agencies, including\n \nthe National Aeronautics and Space Administration, the National \nOceanic and Atmospheric Administration, and the Federal Aviation Administration, through the remainder of \nGFY\n \n2024 which ended on September 30, 2024. A second funding bill, signed into law on March 23, 2024, funded all \nremaining agencies, including the \nDoD\n, through the remainder of \nGFY\n 2024. The bill \nprovided\n approximately \n$844 billion\n in funding for \nDoD\n. This was in line with our expectations for 3% growth for defense over \nGFY\n 2023 \nlevels and in line with the first year of the Fiscal Responsibility Act of 2023 (“\nFRA\n”) caps. \nOn March 11, 2024, the President’s Budget Request for \nGFY\n 2025 was released. The \nDoD\n requested \n$850 billion\n, a 1% topline increase consistent with the \nFRA\n caps. \nOn April 24, 2024, the President signed into law a supplemental \nGFY\n 2024 appropriations package that included \n$67 billion\n in funding for key \nDoD\n programs, bringing the \nDoD\n funding for \nGFY\n 2024 to \n$911 billion\n.\nCongress has not yet reached a final agreement on \nGFY\n 2025 funding. A short-term \nCR\n was enacted on \nDecember 21, 2024 that will fund the U.S. Government until March 14, 2025. While operating under a \nCR\n, \ngovernment agencies are allocated a portion of \nGFY\n 2024 enacted funds, and \nDoD\n is prohibited from starting new \nprograms. If Congress does not enact all 12 \nGFY\n 2025 appropriations bills by April 30, 2025, a 1% automatic \nsequestration cut will go into effect as mandated by the \nFRA\n.\nFurther complicating the budget outlook is the need to raise the debt ceiling in 2025. Congressional inaction \nmay lead to a default and potentially create economic instability.\nThe overall defense spending environment, both in the U.S. and internationally, reflects the continued impacts of \nglobal conflicts and geopolitical tensions, and changes to U.S. Government or international spending priorities\n have \nand could in the future impact our business\n.\nFor a discussion of U.S. Government funding risks and international business risks see “Item 1. Business - \nInternational Business,” “",
    "item1a": "Item 1A. Risk Factors” of this Report.\nInternational\n \nAs an international company, we are, from time to time, the subject of investigations relating to our international \noperations, including under U.S. export control laws (such as ITAR), the FCPA and other similar U.S. and \ninternational laws.\nCommercial Commitments\nIn the normal course of business, we have entered into commercial commitments primarily relating to the \nguarantee of future performance on certain contracts to provide products and services to customers or to obtain \ninsurance policies with our insurance carriers. \nAt \nJanuary 3, 2025\n, we had the following commercial commitments outstanding:\n(In millions)\nCommercial \nCommitment Total\nCommitments \nexpiring within\n1 Year\n \nSurety bonds used for performance\n$\n506\n$\n386\nStandby letters of credit used for:\nAdvance payments\n312\n211\nPerformance\n327\n198\nFinancial\n62\n61\nWarranty\n1\n1\nTotal standby letters of credit\n702\n471\nTotal commitments\n$\n1,208\n$\n857\nThe surety bonds and standby letters of credit used for performance are primarily related to our Public Safety \nbusiness sector. As is customary in bidding for and completing network infrastructure projects for public safety \nsystems, contractors are required to procure surety bonds and/or standby letters of credit for bids, performance, \nwarranty and other purposes (collectively, “\nPerformance Bonds\n”). Such Performance Bonds normally have \nmaturities of up to \nthree years\n and are standard in the industry as a way to provide customers a mechanism to seek \nredress if a contractor does not satisfy performance requirements under a contract. \nTypically, a customer is permitted to draw on a Performance Bond if we do not fulfill all terms of a project \ncontract. In such an event, we would be obligated to reimburse the financial institution that issued the Performance \nBond for the amounts paid\n. \n_____________________________________________________________________\n88\nEnvironmental Matters\nWe are subject to numerous U.S. federal, state, local and international environmental laws and regulatory \nrequirements and are involved from time to time in investigations or litigation of various potential environmental \nissues. We or companies we have acquired\n are\n responsible, or alleged to be responsible, for environmental \ninvestigation and/or remediation of multiple sites, including sites owned by us and third party sites. These sites are \nin various stages of investigation and/or remediation, and in some cases our liability is considered de minimis. \nNotices from the U.S. Environmental Protection Agency or equivalent state or international environmental agencies \nallege that several sites formerly or currently owned and/or operated by us or companies we have acquired, and \nother properties or water supplies that may be or have been impacted from those operations, contain disposed or \nrecycled materials or wastes and require environmental investigation and/or remediation. These sites include \ninstances of being identified as a potentially responsible party (“\nPRP\n”) under the Comprehensive Environmental \nResponse, Compensation and Liability Act (commonly known as the “\nSuperfund Act\n”), the Resource Conservation \nRecovery Act and/or equivalent state and international laws, and in some instances, our liability and proportionate \nshare of costs that may be shared among other PRPs have not been determined largely due to uncertainties as to \nthe nature and extent of site conditions and our involvement.\nAs of \nJanuary 3, 2025\n, \nwe\n were named, and continue to be named, as a potentially responsible party at \n111\n \nsites where future liabilities could exist. These sites included \n13\n sites owned by us, \n71\n sites associated with our \nformer and current locations or operations and \n27\n hazardous waste treatment, storage or disposal facility sites not \nowned by us that contain hazardous substances allegedly attributable to us fro\nm past operations.\nBased on an assessment of relevant factors, we estimated that our liability under applicable environmental \nstatutes and regulations for identified sites was\n \n$\n637\n million\n \nand\n \n$\n613\n million\n, respectively, as of \nJanuary 3, 2025\n \nand \nDecember 29, 2023\n. The current portion of our estimated \nenvironmental liability\n is included in the “\nOther \ncurrent liabilities\n” line item and the non-current portion is included in the “\nOther long-term liabilities\n” line item in \nour \nConsolidated Balance Sheet\n. Some of these environmental costs are eligible for future recovery in the pricing of \nour products and services to the U.S. Government. We consider the recovery probable based on U.S. Government \ncontracting regulations. As of \nJanuary 3, 2025\n and \nDecember 29, 2023\n, we had an asset for the recoverable portion \nof these reserves of \n$\n462\n million\n and \n$\n432\n million\n, respectively. The current and non-current portion of the \nrecoverable costs are included as a component of the “\nOther current assets\n” and “\nOther non-current assets\n” line \nitems, respectively, in our \nConsolidated Balance Sheet\n.\n \n ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL \nDISCLOSURE.\nNot applicable.\n \n ITEM 9A.\nCONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures \nPursuant to Rule 13a-15 under the Exchange Act, management, with the participation of our \nprincipal executive \nofficer (CEO) and principal financial officer (CFO)\n, carried out an evaluation of the Company’s disclosure controls and \nprocedures as of \nJanuary 3, 2025\n. Based on this evaluation, the CEO and CFO concluded that as of \nJanuary 3, 2025\n, \nour disclosure controls and procedures \nwere\n designed at a reasonable assurance level and were effective to provide \nreasonable assurance that information required to be disclosed in our reports filed or submitted under the Exchange \nAct is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and \nthat such information is accumulated and communicated to management, including our CEO and CFO, as \nappropriate, to allow timely decisions regarding required disclosures. \nManagement’s Report on Internal Control Over Financial Reporting \nThe Company’s management is responsible for establishing and maintaining adequate internal control over \nfinancial reporting as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of \n1934, as amended. The Company’s internal control over financial reporting is designed to provide reasonable \nassurance \nregarding the reliability of financial reporting and the preparation of financial statements for external \npurposes in accordance with U.S. generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect \nmisstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that \ncontrols may become inadequate because of changes in conditions, or that the degree of compliance with the \npolicies or procedures may deteriorate.\n_____________________________________________________________________\n89\nOur management, with the participation of our CEO and CFO,  \nassessed\n the effectiveness of the Company’s \ninternal control over financial reporting as of \nJanuary 3, 2025\n. In making this assessment, management used the \ncriteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal \nControl-Integrated Framework\n (2013 framework). Based on this assessment, management concluded that the \nCompany’s internal control over financial reporting was effective as of \nJanuary 3, 2025\n.\nThe Company’s independent registered public accounting firm, Ernst & Young LLP, has issued a report on the \neffectiveness of the Company’s internal control over financial reporting. This report appears on the following page of \nthis Report.\nChanges in Internal Control Over Financial Reporting \nOther than changes related to incorporating our controls and procedures with respect to AJRD operations, there \nhave been no changes in our internal control over financial reporting that occurred during the quarter ended \nJanuary 3, 2025\n that have materially affected, or are reasonably likely to materially affect, our internal control over \nfinancial reporting.\n_____________________________________________________________________\n90\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of L3Harris Technologies, Inc. \n \nOpinion on Internal Control Over Financial Reporting\nWe have audited L3Harris Technologies, Inc.’s internal control over financial reporting as of \nJanuary 3, 2025\n, based \non criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring \nOrganizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, L3Harris \nTechnologies, Inc. (the Company) maintained, in all material respects, effective internal control over financial \nreporting as of \nJanuary 3, 2025\n, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United \nStates) (PCAOB), the consolidated balance sheets of the Company as of \nJanuary 3, 2025\n and \nDecember 29, 2023\n, \nthe related consolidated statements of operations, comprehensive income, cash flows and equity for each of the \nthree years in the period ended \nJanuary 3, 2025\n, and the related notes and our report dated \nFebruary 14, 2025\n \nexpressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for \nits assessment of the effectiveness of internal control over financial reporting included in the accompanying \nManagement’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on \nthe Company’s internal control over financial reporting based on our audit. We are a public accounting firm \nregistered with the PCAOB and are required to be independent with respect to the Company in accordance with the \nU.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and \nthe PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and \nperform the audit to obtain reasonable assurance about whether effective internal control over financial reporting \nwas maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a \nmaterial weakness exists, testing and evaluating the design and operating effectiveness of internal control based on \nthe assessed risk, and performing such other procedures as we considered necessary in the circumstances. We \nbelieve that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance \nregarding the reliability of financial reporting and the preparation of financial statements for external purposes in \naccordance with generally accepted accounting principles. A company’s internal control over financial reporting \nincludes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, \naccurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable \nassurance that transactions are recorded as necessary to permit preparation of financial statements in accordance \nwith generally accepted accounting principles, and that receipts and expenditures of the company are being made \nonly in accordance with authorizations of management and directors of the company; and (3) provide reasonable \nassurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s \nassets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect \nmisstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that \ncontrols may become inadequate because of changes in conditions, or that the degree of compliance with the \npolicies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nOrlando, Florida\nFebruary 14, 2025\n_____________________________________________________________________\n91\n ITEM 9B.\nOTHER INFORMATION.\nSecurities Trading Plans of Directors and Executive Officers\nWe require all executive officers and directors to effect purchase and sale transactions in L3Harris securities \npursuant to a trading plan (each, a “10b5-1 Plan”) intended to satisfy the requirements of Rule 10b5-1 under the \nExchange Act (“Rule 10b5-1”). We limit executive officers to a single 10b5-1 Plan in effect at any time, subject to \nlimited exceptions in accordance with Rule 10b5-1. \nThe following table includes the material terms (other than with respect to the price) of each 10b5-1 Plan \nadopted\n or \nterminated\n by our executive officers and directors during the quarter ended \nJanuary 3, 2025\n:\nName and title\nDate of adoption of \n10b5-1 Plan\n(1)\nScheduled expiration \ndate of 10b5-1 Plan\n(2)\nAggregate number of shares of common stock to \nbe purchased or sold\n(3)\nChristopher E. Kubasik\n       \nChair and CEO\nNovember 26, 2024\nMarch 25, 2025\nUp to \n112,138\n shares underlying options \nexpiring in 2027\nJonathan P. Rambeau\n \nPresident, IMS\nDecember 3, 2024\nMarch 14, 2025\nUp to \n3,178\n shares\nEdward J. Zoiss\n \nPresident, SAS\nDecember 6, 2024\nJune 6, 2025\nUp to \n20,579\n shares including 9,012 \nshares of underlying options expiring in \n2028\n_______________\n(1)    Transactions under each Rule 10b5-1 Plan commence no earlier than 90 days after adoption, \nor such later date as required by Rule 10b5-1.\n(2)    Each Rule 10b5-1 Plan may expire on such earlier date as all transactions are completed.\n(3)    Each Rule 10b5-1 Plan provides for shares to be sold on multiple predetermined dates.\n ITEM 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III\n ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nInformation regarding our directors, executive officers and corporate governance is included in our Proxy \nStatement for our \n2025\n Annual Meeting of Shareholders scheduled to be held on \nApril 18, 2025\n (our “\n2025\n Proxy \nStatement”), which is expected to be filed within 120 days after the end of our \nfiscal 2024\n.\nDirectors.\n The information required by this Item with respect to our directors and corporate governance is \nincorporated herein by reference to the discussion under the headings \nProposal 1: Election of Directors\n \nand \nCorporate Governance \nin our \n2025\n Proxy Statement.\nIdentification of Executive Officers.\n Certain information regarding our executive officers is included in Part I of \nthis Report under the heading “Information about our Executive Officers” in accordance with General \nInstruction G(3) of Form 10-K.\nCode of Ethics.\n All of our directors and employees, including our Chief Executive Officer, Chief Financial Officer, \nPrincipal Accounting Officer and other senior accounting and financial officers, are required to abide by our Code of \nConduct. Our Code of Conduct is posted on our website at \nhttps://www.l3harris.com/resources/other/l3harris-code-\nconduct\n and is also available free of charge by written request to our Director of Ethics and Compliance, L3Harris \nTechnologies, Inc., 1025 West NASA Boulevard, Melbourne, Florida 32919. We intend to disclose on the Code of \nConduct section of our website at \nhttps://www.l3harris.com/resources/other/l3harris-code-conduct\n any amendment \nto, or waiver from, our Code of Conduct that is required to be disclosed to shareholders, within four business days \nfollowing such amendment or waiver. The information required by this Item with respect to codes of ethics is \nincorporated herein by reference to the discussion under the heading \nCode of Conduct\n in our \n2025\n Proxy Statement.\nInsider Trading\n \nPolicies.\n \nWe have adopted an Insider Trading Policy\n, which governs the purchase, sale, and/or \nother dispositions of our securities by directors, officers and employees and other covered persons and is designed \nto promote compliance with insider trading laws, rules and regulations, and listing standards applicable to us. A \ncopy of our Insider Trading Policy is filed as Exhibit 19 to this Report.\n \n_____________________________________________________________________\n92\n ITEM 11.\nEXECUTIVE COMPENSATION.\nThe information required by this Item with respect to compensation of our directors and executive officers is \nincorporated herein by reference to the discussions under the headings \nDirector Compensation and Benefits\n, \nCompensation Discussion and Analysis, Compensation Committee Report, Compensation Tables, CEO Pay Ratio \nand \nPay Versus Performance\n in our \n2025\n Proxy Statement.\n ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND \nRELATED STOCKHOLDER MATTERS.\nThe following table provides information about our common stock that may be issued, whether upon the \nexercise of options, warrants and rights or otherwise, under our existing equity compensation plans, as of \nJanuary 3, \n2025\n: \nPlan Category\n \nNumber of securities\n to be issued upon \nexercise of\noutstanding options,\nwarrants and rights\n(a)\n(2)\n \nWeighted-\naverage\nexercise price of\noutstanding \noptions,\nwarrants and \nrights\n(b)\n(2)\n  \nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation \nplans\n(excluding securities\nreflected in column (a))\n(c) \nEquity compensation plans approved by shareholders\n(1)\n3,544,971\n$191.09\n21,172,833\nEquity compensation plans not approved by \nshareholders\n—\n—\n—\nTotal\n3,544,971\n191.09\n21,172,833\n_______________\n(1)    Consists of awards under the L3Harris SIPs.\n(2)\n    Under the L3Harris SIPs, in addition to stock options, we have granted share-based compensation awards in the form of \nPSUs\n, \nRSUs\n \nand \nother similar types of share-based awards\n. As of \nJanuary 3, 2025\n, there were awards outstanding under those plans with respect to \n1,008,116\n shares, consisting of awards of (i) \n582,326\n \nRSUs\n and (ii) \n425,790\n \nPSUs\n, for which all \n1,008,116\n were payable in shares but for \nwhich no shares were yet issued and outstanding. The\n \n3,544,971\n shares to be issued upon exercise of outstanding options, warrants and \nrights as listed in column (a) consisted of shares to be issued in respect of the exercise of \n2,536,855\n outstanding stock \noptions\n and awards \nof \n1,008,116\n \nPSUs\n and \nRSUs\n payable in shares. Because there is no exercise price associated with awards of \nPSUs\n or \nRSUs\n, all of which are \ngranted to employees at no cost, such awards are not included in the weighted-average exercise price calculation in column (b).\nSee \nNote 10: Share-Based Compensation\n in the Notes for a general description of our share-based incentive \nplans. \nThe other information required by this Item with respect to security ownership of certain of our beneficial \nowners and management is incorporated herein by reference to the discussions under the headings \nPrincipal \nShareholders\n and \nShares Owned By Directors, Nominees and Executive Officers\n in our \n2025\n Proxy Statement. \n ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR \nINDEPENDENCE.\nThe information required by this Item is incorporated herein by reference to the discussions under the headings \nDirector Independence Standards\n and \nRelated Person Transactions\n in our \n2025\n Proxy Statement.\n ITEM 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required by this Item is incorporated herein by reference to the discussion under the heading \nProposal 4: Ratification of Appointment of Independent Registered Public Accounting Firm\n in our \n2025\n Proxy \nStatement. \n_____________________________________________________________________\n93\nPART IV\n \n ITEM 15.\nEXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following documents are filed as a part of this Report:\n \nPage\nFinancial Statements\nThe following consolidated financial statements of L3Harris Technologies, Inc. are included in Item 8 of \nthis Report at the page numbers referenced below:\nConsolidated Statement of Operations\n — Fiscal Years Ended \nJanuary 3, 2025\n,\n \nDecember 29, 2023\n \nand\n \nDecember 30, 2022\n \n \n \n \n \n....................................................................................................................................\n39\nConsolidated Statement of Comprehensive Income\n — \nFiscal Years Ended \nJanuary 3, 2025\n,\n \nDecember 29, 2023\n and \nDecember 30, 2022\n \n \n \n \n..............................................................................................\n40\nConsolidated Balance Sheet\n —\n \nJanuary 3, 2025\n and \nDecember 29, 2023\n \n \n \n \n \n...................................................\n41\nConsolidated Statement of Cash Flows\n — \nFiscal Years Ended \nJanuary 3, 2025\n, \nDecember 29, 2023\n \nand \nDecember 30, 2022\n \n \n \n \n \n...................................................................................................................................\n42\nConsolidated Statement of Equity\n — \nFiscal Years Ended \nJanuary 3, 2025\n,\n \nDecember 29, 2023\n and \nDecember 30, 2022\n \n \n \n \n \n...........................................................................................................................................\n43\nNotes to \nConsolidated Financial Statements\n \n \n \n \n \n \n......................................................................................................\n44\nThe following report of L3Harris Technologies, Inc.’s independent registered public accounting firm with \nrespect to the above referenced consolidated financial statements and their report on internal controls \nover financial reporting are included in Item 8 and Item 9A of this Report at the page numbers referenced \nbelow:\nReport of Independent Registered Public Accounting Firm (PCAOB ID:\n \n42\n) on the \nConsolidated \nFinancial Statements\n \n \n \n..........................................................................................................................................\n36\nReport of Independent Registered Public Accounting Firm on the Effectiveness of Internal Control \nOver Financial Reporting\n \n \n....................................................................................................................................\n90\nFinancial Statement Schedules\nAll schedules are omitted because they are not applicable, the amounts are not significant or the \nrequired information is shown in the \nConsolidated Financial Statements\n or the Notes thereto.\nExhibits\nThe following exhibits are filed herewith or are incorporated herein by reference to exhibits previously filed with \nthe SEC:\n(3)(a)        \nRestated Certificate of Incorporation of L3Harris Technologies, Inc. (1995), as amended, incorporated \nherein by reference to Exhibit 4(a) to the L3Harris Technologies, Inc.’s Registration Statement on Form \nS-8, Registration No. 333-279040 filed with the SEC on May 1, 2024.\n(3)(b)        \nBy-Laws of L3Harris Technologies, Inc., as amended and restated effective December 8, 2022, \nincorporated herein by reference to Exhibit 3.1 to the L3Harris Technologies, Inc.’s Current Report on \nForm 8-K filed with the SEC on December 13, 2022. (Commission File Number 1-3863)\n(4)(a)        \n(i) Indenture, dated as of May 1, 1996, between L3Harris Technologies, Inc. (formerly known as Harris \nCorporation) and The Bank of New York, as Trustee, relating to unlimited amounts of debt securities \nwhich may be issued from time to time by L3Harris Technologies, Inc. (formerly known as Harris \nCorporation) when and as authorized by L3Harris Technologies, Inc.’s (formerly known as Harris \nCorporation) Board of Directors or a Committee of the Board, incorporated herein by reference to Exhibit \n4 to L3Harris Technologies, Inc.’s (formerly known as Harris Corporation) Registration Statement on \nForm S-3, Registration Statement No. 333-03111, filed with the SEC on May 3, 1996.\n(ii) Instrument of Resignation from Trustee and Appointment and Acceptance of Successor Trustee, \ndated as of November 1, 2002 (effective November 15, 2002), among L3Harris Technologies, Inc. \n(formerly known as Harris Corporation), JP Morgan Chase Bank, as Resigning Trustee, and The Bank of \nNew York, as Successor Trustee, incorporated herein by reference to Exhibit 99.4 to L3Harris \nTechnologies, Inc.’s (formerly known as Harris Corporation) Quarterly Report on Form 10-Q for the fiscal \nquarter ended September 27, 2002. (Commission File Number 1-3863)\n_____________________________________________________________________\n94\n(iii) Supplemental Indenture, dated June 2, 2015, among L3Harris Technologies, Inc. (formerly known \nas Harris Corporation), Exelis Inc. and The Bank of New York Mellon (as successor to Chemical Bank), to \nthe Indenture dated as of May 1, 1996 between L3Harris Technologies, Inc. (formerly known as Harris \nCorporation) and The Bank of New York (as successor to Chemical Bank), incorporated herein by \nreference to Exhibit 4.2 to L3Harris Technologies, Inc.’s (formerly known as Harris Corporation) Current \nReport on Form 8-K filed with the SEC on June 2, 2015. (Commission File Number 1-3863)\n**(4)(b)     (i) Indenture, dated as of October 1, 1990, between L3Harris Technologies, Inc. (formerly known as \nHarris Corporation) and U.S. Bank National Association (as successor to National City Bank), as Trustee, \nrelating to unlimited amounts of debt securities which may be issued from time to time by L3Harris \nTechnologies, Inc. (formerly known as Harris Corporation) when and as authorized by L3Harris \nTechnologies, Inc.’s (formerly known as Harris Corporation) Board of Directors or a Committee of the \nBoard, incorporated herein by reference to Exhibit 4 to L3Harris Technologies, Inc. (formerly known as \nHarris Corporation) Registration Statement on Form S-3, Registration Statement No. 33-35315, filed \nwith the SEC on June 8, 1990.\n(ii) Supplemental Indenture, dated June 2, 2015, among L3Harris Technologies, Inc. (formerly known as \nHarris Corporation), Exelis Inc. and U.S. Bank National Association (as successor to National City Bank), \nto the Indenture dated as of October 1, 1990 between L3Harris Technologies, Inc. (formerly known as \nHarris Corporation) and U.S. National Association (as successor to National City Bank), incorporated \nherein by reference to Exhibit 4.1 to L3Harris Technologies, Inc.’s (formerly known as Harris \nCorporation) Current Report on Form 8-K filed with the SEC on June 2, 2015. (Commission File Number \n1-3863)\n(4)(c)        \n(i) Indenture, dated as of September 3, 2003, between L3Harris Technologies, Inc. (formerly known as \nHarris Corporation) and The Bank of New York Mellon Trust Company, N.A., as successor to The Bank of \nNew York, as Trustee, relating to unlimited amounts of debt securities which may be issued from time to \ntime by L3Harris Technologies, Inc. (formerly known as Harris Corporation) when and as authorized by \nL3Harris Technologies, Inc.’s (formerly known as Harris Corporation) Board of Directors or a Committee \nof the Board, incorporated herein by reference to Exhibit 4(b) to L3Harris Technologies, Inc.'s (formerly \nknown as Harris Corporation) Registration Statement on Form S-3, Registration Statement No. \n333-108486, filed with the SEC on September 3, 2003\n(ii) Instrument of Resignation of Trustee, Appointment and Acceptance of Successor Trustee, dated as \nof June 2, 2009, among L3Harris Technologies, Inc. (formerly known as Harris Corporation), The Bank of \nNew York Mellon (formerly known as The Bank of New York) and The Bank of New York Mellon Trust \nCompany, N.A., as to Indenture dated as of September 3, 2003, incorporated herein by reference to \nExhibit 4(m) to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Registration \nStatement on Form S-3, Registration Statement No. 333-159688, filed with the SEC on June 3, 2009\n(iii) Supplemental Indenture, dated June 2, 2015, among L3Harris Technologies, Inc. (formerly known \nas Harris Corporation), Exelis Inc. and The Bank of New York Mellon Trust Company, N.A. (as successor \nto The Bank of New York), to the Indenture dated as of September 3, 2003 between L3Harris \nTechnologies, Inc. (formerly known as Harris Corporation) and The Bank of New York Mellon Trust \nCompany, N.A. (as successor to The Bank of New York), incorporated herein by reference to Exhibit 4.3 \nto L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Current Report on Form 8-K filed \nwith the SEC on June 2, 2015. (Commission File Number 1-3863)\n(4)(d)        \n(i) Subordinated Indenture, dated as of September 3, 2003, between L3Harris Technologies, Inc. \n(formerly known as Harris Corporation) and The Bank of New York Mellon Trust Company, N.A., as \nsuccessor to The Bank of New York, as Trustee, relating to unlimited amounts of debt securities which \nmay be issued from time to time by L3Harris Technologies, Inc. (formerly known as Harris Corporation) \nwhen and as authorized by the L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) \nBoard of Directors or a Committee of the Board, incorporated herein by reference to Exhibit 4(c) to the \nL3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Registration Statement on Form \nS-3, Registration Statement No. 333-108486, filed with the SEC on September 3, 2003\n(ii) Instrument of Resignation of Trustee, Appointment and Acceptance of Successor Trustee, dated as \nof June 2, 2009, among L3Harris Technologies, Inc. (formerly known as Harris Corporation), The Bank of \nNew York Mellon (formerly known as The Bank of New York) and The Bank of New York Mellon Trust \nCompany, N.A., as to Subordinated Indenture dated as of September 3, 2003, incorporated herein by \nreference to Exhibit 4(n) to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) \n_____________________________________________________________________\n95\nRegistration Statement on Form S-3, Registration Statement No. 333-159688, filed with the SEC on \nJune 3, 2009\n(4)(e)        Pursuant to Regulation S-K, Item 601(b)(4)(iii)(A), L3Harris Technologies, Inc. by this filing agrees, upon \nrequest, to furnish to the SEC a copy of other instruments defining the rights of holders of long-term \ndebt of L3Harris Technologies, Inc.\n(4)(f)      \n   \nDescription of L3Harris Technologies, Inc.’s Securities, incorporated herein by reference to Exhibit 4(x) \nto the L3Harris Technologies, Inc's Annual Report on Form 10-K filed for the fiscal year ended \nDecember 30, 2022 (Commission File Number 1-3863)\n*(10)(a)    \nForm of Director and Officer Indemnification Agreement, for use on or after June 29, 2019, incorporated \nherein by reference to Exhibit 10.5 to L3Harris Technologies, Inc.’s Current Report on Form 8-K filed \nwith the SEC on July 1, 2019. (Commission File Number 1-3863) \n*(10)(b)    \nL3Harris Technologies, Inc. Executive Change in Control Severance Plan, effective as of July 21, 2023, \nincorporated herein by reference to Exhibit 10.1 to L3Harris Technologies, Inc.’s Current Report on Form \n8-K filed with the SEC on July 24, 2023. (Commission File Number 1-3863)\n*(10)(c)   \n L3Harris Technologies, Inc. Severance Pay Plan, effective as of March 1, 2020, incorporated herein by \nreference to Exhibit 10.2 to L3Harris Technologies, Inc.’s Current Report on Form 8-K filed with the SEC \non March 4, 2020. (Commission File Number 1-3863)\n*(10)(d)   \n L3Harris Technologies, Inc. Annual Incentive Plan (Amended and Restated Effective as of August 28, \n2020), incorporated herein by reference to Exhibit 10.1 to L3Harris Technologies, Inc.’s Current Report \non Form 8-K filed with the SEC on September 1, 2020. (Commission File Number 1-3863)\n*(10)(e)   \n (i) 2015 Equity Incentive Plan, incorporated herein by reference to Exhibit 10.1 to L3Harris \nTechnologies, Inc.'s (formerly known as Harris Corporation) Current Report on Form 8-K filed with the \nSEC on October 28, 2015. (Commission File Number 1-3863) \n(ii) Non-Employee Director Share Unit Agreement Terms and Conditions (as of June 29, 2019), \nincorporated herein by reference to Exhibit 10(f)(x) to L3Harris Technologies, Inc.’s Transition Report on \nForm 10-KT for the fiscal year ended January 3, 2020. (Commission File Number 1-3863)\n(iii) L3Harris Technologies, Inc. Restricted Unit Award Agreement Terms and Conditions (as of February \n5, 2020), incorporated herein by reference to Exhibit 10.3 to L3Harris Technologies, Inc.’s Quarterly \nReport on Form 10-Q for the fiscal quarter ended April 3, 2020. (Commission File Number 1-3863)\n(iv) L3Harris Technologies, Inc. Performance Unit Award Agreement Terms and Conditions (as of \nFebruary 28, 2020), incorporated herein by reference to Exhibit 10.4 to L3Harris Technologies, Inc.’s \nQuarterly Report on Form 10-Q for the fiscal quarter ended April 3, 2020. (Commission File Number \n1-3863)\n(v) L3Harris Technologies, Inc. Stock Option Award Agreement Terms and Conditions (as of February 28, \n2020), incorporated herein by reference to Exhibit 10.5 to L3Harris Technologies, Inc.’s Quarterly \nReport on Form 10-Q for the fiscal quarter ended April 3, 2020. (Commission File Number 1-3863)\n*(10)(f)    \n(i) L3Harris Technologies, Inc. 2015 Equity Incentive Plan (Amended and Restated Effective as of August \n28, 2020), incorporated herein by reference to Exhibit 10.2 to L3Harris Technologies, Inc.’s Current \nReport on Form 8-K filed with the SEC on September 1, 2020. (Commission File Number 1-3863)\n(ii) L3Harris Technologies, Inc. Restricted Unit Award Agreement Terms and Conditions (as of February \n23, 2023), incorporated herein by reference to Exhibit 10.1 to L3Harris Technologies, Inc.’s Quarterly \nReport on Form 10-Q for the fiscal quarter ended March 31, 2023. (Commission File Number 1-3863)\n(iii) L3Harris Technologies, Inc. Performance Unit Award Agreement Terms and Conditions (as of \nFebruary 23, 2023), incorporated herein by reference to Exhibit 10.2 to L3Harris Technologies, Inc.’s \nQuarterly Report on Form 10-Q for the fiscal quarter ended March 31, 2023. (Commission File Number \n1-3863)\n(iv) L3Harris Technologies, Inc. Stock Option Award Agreement Terms and Conditions (as of February \n23, 2023), incorporated herein by reference to Exhibit 10.3 to L3Harris Technologies, Inc.’s Quarterly \nReport on Form 10-Q for the fiscal quarter ended March 31, 2023. (Commission File Number 1-3863)\n_____________________________________________________________________\n96\n*10(g)       \n(i) L3Harris Technologies, Inc. 2024 Equity Incentive Plan, incorporated herein by reference to Exhibit \n4(d) to L3Harris Technologies, Inc.’s Registration Statement on Form S-8, Registration No. 333-279040, \nfiled with the SEC on May 1, 2024. (Commission File Number 1-3863)\n(ii) L3Harris Technologies, Inc. 2024 Performance Unit Award Agreement Terms and Conditions \n(Effective April 19, 2024), incorporated herein by reference to Exhibit 10.2 to L3Harris Technologies, \nInc. Quarterly Report on Form 10-Q for the fiscal year ended December 29, 2023, filed with the SEC on \nJuly 26, 2024. (Commission File Number 1-3863)\n(iii) L3Harris Technologies, Inc. 2024 Restricted Unit Award Agreement Terms and Conditions (Effective \nApril 19, 2024), incorporated herein by reference to Exhibit 10.3 to L3Harris Technologies, Inc. \nQuarterly Report on Form 10-Q for the fiscal year ended December 29, 2023, filed with the SEC on July \n26, 2024. (Commission File Number 1-3863)\n(iv) L3Harris Technologies, Inc. 2024 Stock Option Award Agreement Terms and Conditions (Effective \nApril 19, 2024), incorporated herein by reference to Exhibit 10.4 to L3Harris Technologies, Inc. \nQuarterly Report on Form 10-Q for the fiscal year ended December 29, 2023, filed with the SEC on July \n26, 2024. (Commission File Number 1-3863)\n*10(h)    \n \n \n(i) L3Harris Retirement Savings Plan (Amended and Restated Effective January 1, 2025).\n                  \n(ii) Amendment Number One to the L3Harris Retirement Savings Plan (Amended and Restated Effective \nJanuary 1, 2025), dated February 12, 2025\n.\n*(10)(i)   \n \n \n(i) L3Harris Excess Retirement Savings Plan, as amended and restated effective June 1, 2024, \nincorporated herein by reference to Exhibit 10.7 to L3Harris Technologies, Inc.’s Quarterly Report on \nForm 10-Q for the fiscal quarter ended June 28,  2024, filed with the SEC on July 26, 2024. \n(Commission File Number 1-3863) \n(ii) Amendment Number One to the L3Harris Excess Retirement Savings Plan (Amended and Restated \nEffective January 1, 2020), dated December 14, 2020, incorporated herein by reference to Exhibit 10.4 \nto L3Harris Technologies, Inc.'s Quarterly Report on Form 10-Q for the fiscal quarter ended April 2, \n2021. (Commission File Number 1-3863)\n*(10)(k)   \n \nL3Harris Technologies, Inc. 2019 Non-Employee Director Deferred Compensation Plan, incorporated \nherein by reference to Exhibit 10(j) to L3Harris Technologies, Inc.’s Transition Report on Form 10-KT for \nthe fiscal year ended January 3, 2020. (Commission File Number 1-3863)\n*(10)(l)    \n \n(i) Amended and Restated Master Trust Agreement and Declaration of Trust, made as of December 2, \n2003, by and between L3Harris Technologies, Inc. (formerly known as Harris Corporation) and The \nNorthern Trust Company, incorporated herein by reference to Exhibit 10(c) to L3Harris Technologies, \nInc.'s (formerly known as Harris Corporation) Quarterly Report on Form 10-Q for the fiscal quarter \nended January 2, 2004. (Commission File Number 1-3863)\n(ii) Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master Trust, \ndated May 21, 2009, incorporated herein by reference to Exhibit 10(m)(ii) to L3Harris Technologies, \nInc.'s (formerly known as Harris Corporation) Annual Report on Form 10-K for the fiscal year ended July \n3, 2009. (Commission File Number 1-3863)\n(iii) Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master Trust, \ndated December 8, 2009 and effective December 31, 2009, incorporated herein by reference to Exhibit \n4(e)(iii) to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Registration Statement \non Form S-8, Registration Statement No. 333-163647, filed with the SEC on December 10, 2009\n(iv) Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master Trust, \ndated and effective May 3, 2010, incorporated herein by reference to Exhibit 4(e)(iv) to L3Harris \nTechnologies, Inc.'s (formerly known as Harris Corporation) Registration Statement on Form S-8, \nRegistration Statement No. 333-222821, filed with the SEC on February 1, 2018\n*(10)(m)   \n(i) Master Rabbi Trust Agreement, amended and restated as of December 2, 2003, by and between \nL3Harris Technologies, Inc. (formerly known as Harris Corporation) and The Northern Trust Company, \nincorporated herein by reference to Exhibit 10(d) to L3Harris Technologies, Inc.'s (formerly known as \nHarris Corporation) Quarterly Report on Form 10-Q for the fiscal quarter ended January 2, 2004. \n(Commission File Number 1-3863)\n_____________________________________________________________________\n97\n(ii) First Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master \nRabbi Trust Agreement, dated September 24, 2004, incorporated herein by reference to Exhibit 10(b) to \nL3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Quarterly Report on Form 10-Q for \nthe fiscal quarter ended October 1, 2004. (Commission File Number 1-3863)\n(iii) Second Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) \nMaster Rabbi Trust Agreement, dated as of December 8, 2004, incorporated herein by reference to \nExhibit 10.5 to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Current Report on \nForm 8-K filed with the SEC on December 8, 2004. (Commission File Number 1-3863)\n(iv) Third Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master \nRabbi Trust Agreement, dated January 15, 2009 and effective January 1, 2009, incorporated herein by \nreference to Exhibit 10(i) to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) \nQuarterly Report on Form 10-Q for the fiscal quarter ended January 2, 2009. (Commission File Number \n1-3863)\n(v) Fourth Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master \nRabbi Trust Agreement, dated October 27, 2010 and effective as of August 28, 2010, incorporated \nherein by reference to Exhibit 10(n) to L3Harris Technologies, Inc.'s (formerly known as Harris \nCorporation) Quarterly Report on Form 10-Q for the fiscal quarter ended October 1, 2010. (Commission \nFile Number 1-3863)\n(vi) Fifth Amendment to the L3Harris Technologies, Inc. (formerly known as Harris Corporation) Master \nRabbi Trust Agreement, dated and effective as of February 28, 2019, incorporated herein by reference \nto Exhibit 10 to L3Harris Technologies, Inc.'s (formerly known as Harris Corporation) Quarterly Report \non Form 10-Q for the fiscal quarter ended March 29, 2019. (Commission File Number 1-3863)\n*10(n)       \nSummary of Annual Compensation of L3Harris Technologies, Inc., Non-Employee Directors  effective as \nof January 1, 2024, incorporated herein by reference to Exhibit 10.2 to L3Harris Technologies, Inc.’s \nCurrent Report on Form 8-K filed with the SEC on July 24, 2023. (Commission File Number 1-3863)\n**10(o)   \nRevolving Credit Agreement, dated as of July 29, 2022, by and among L3Harris Technologies, Inc. and \nthe other parties thereto, incorporated herein by reference to Exhibit 10.1 to L3Harris Technologies, \nInc.’s Current Report on Form 8-K filed with the SEC on August 4, 2022. (Commission File Number \n1-3863)\n*10(p)      \nOffer Letter, dated August 12, 2022, between L3Harris Technologies, Inc. and Jon Rambeau \nincorporated herein by reference to Exhibit 10(b)(b) to L3Harris Technologies, Inc.’s Annual Report on \nForm 10-K for fiscal year-ended December 30, 2022. (Commission File Number 1-3863)\n***10(q)   \n364-Day Credit Agreement, dated January 26, 2024, by and among L3Harris Technologies, Inc. and the \nother parties thereto, incorporated herein by reference to Exhibit 10.2 to L3Harris Technologies, Inc.’s \nQuarterly Report on Form 10-Q filed with the SEC on April 26, 2024 (Commission File Number 1-3863)\n***10(r)   \nForm of Commercial Paper Dealer Agreement, dated March 14, 2023, between L3Harris Technologies, \nInc. and the Dealer party thereto, incorporated herein by reference to Exhibit 10.2 to L3Harris \nTechnologies, Inc.’s Current Report on Form 8-K filed with the SEC on March 16, 2023 (Commission File \nNumber 1-3863)\n*10(s)      \n \nOffer Letter, dated November 30, 2023, between L3Harris Technologies, Inc. and Kenneth L. \nBedingfield, incorporated herein by reference to Exhibit 10(z) to L3Harris Technologies, Inc.’s Annual \nReport of Form 10-K for the fiscal year ended December 29, 2023. (Commission File Number 1-3863)\n*10(t)       \n \nOffer Letter, November 4, 2022, between L3Harris Technologies, Inc. and Samir B. Mehta, incorporated \nherein by reference to Exhibit 10(a)(a)(i) to L3Harris Technologies, Inc.’s Annual Report on Form 10-K \nfor the fiscal year ended December 29, 2023. (Commission File Number 1-3863)\n*10(u)      \n Letter Agreement, dated February 23, 2024, between L3Harris Technologies, Inc. and Christopher E. \nKubasik, incorporated herein by reference to Exhibit 10.1 to L3Harris Technologies, Inc.’s Current \nReport on Form 8-K filed with the SEC on February 23, 2024. (Commission File Number 1-386\n3)\n(19)           \nInsider Trading Policy.\n(21)           \nSubsidiaries of the Registrant.\n(23)           \nConsent of Ernst & Young LLP, Independent Registered Public Accounting Firm.\n_____________________________________________________________________\n98\n(24)           \nPower of Attorney.\n(31.1)       \nRule 13a-14(a)/15d-14(a) Certification of Chief Executive Officer.\n(31.2)       \nRule 13a-14(a)/15d-14(a) Certification of Chief Financial Officer.\n(32)          \nSection 1350 Certifications.\n(97)          \nIncentive-Based Compensation Recovery Policy, incorporated herein by reference to Exhibit 97 to \nL3Harris Technologies, Inc’s Annual Report on Form 10-K for the fiscal year ended December 29, 2023. \n(Commission File Number 1-3863).\n(101)        The financial information from L3Harris Technologies, Inc.’s Annual Report on Form 10-K for the period \nfrom December 31, 2022 to December 29, 2023 formatted in Inline XBRL (Extensible Business \nReporting Language) includes: (i) the Consolidated Balance Sheet, (ii) the Consolidated Statement of \nOperations, (iii) the Consolidated Statement of Comprehensive Income, (iv) the Consolidated Statement \nof Changes in Stockholders Equity, (v) the Consolidated Statement of Cash Flows and (vi) the Notes to \nthe Consolidated Financial Statements.\n(104)        Cover Page Interactive Data File formatted in Inline XBRL and contained in Exhibit 101.\n_______________\n*        Management contract or compensatory plan or arrangement.\n**      Paper filing.\n***    Schedules have been omitted pursuant to Item 601(a)(5) of Regulation S-K. L3Harris Technologies, Inc. hereby undertakes to furnish \nsupplementally copies of any of the omitted schedules upon request by the SEC.\n ITEM 16.\nFORM 10-K SUMMARY.\nNone.\n_____________________________________________________________________\n99\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly \ncaused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nL3HARRIS TECHNOLOGIES, INC.\n \n(Registrant)\nDate: February 14, 2025\n \nBy:\n \n/s/ Christopher E. Kubasik\n \n \nChristopher E. Kubasik\n \n \nChair and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the \nfollowing persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\n \nTitle\n \nDate\n/s/    C\nHRISTOPHER\n E. K\nUBASIK\nChair and Chief Executive Officer \n(Principal Executive Officer)\nFebruary 14, 2025\nChristopher E. Kubasik\n/s/    K\nENNETH\n L. B\nEDINGFIELD\n \nSenior Vice President, Chief Financial Officer \nand President, Aerojet Rocketdyne\n(Principal Financial Officer)\n \nFebruary 14, 2025\nKenneth L. Bedingfield\n/s/    J\nOHN \nP. C\nANTILLON\n \nVice President, Principal Accounting Officer \n(Principal Accounting Officer)\n \nFebruary 14, 2025\nJohn P. Cantillon\n*\nDirector\nFebruary 14, 2025\nSallie B. Bailey\n*\nDirector\nFebruary 14, 2025\nThomas A. Dattilo\n*\nDirector\n \nFebruary 14, 2025\nRoger B. Fradin\n*\nDirector\n \nFebruary 14, 2025\nJoanna L. Geraghty\n*\nDirector\nFebruary 14, 2025\nKirk S. Hachigian\n*\nDirector\nFebruary 14, 2025\nHarry B. Harris, Jr. \n*\nDirector\nFebruary 14, 2025\nLewis Hay III\n*\n \nDirector\n \nFebruary 14, 2025\nRita S. Lane\n*\n \nDirector\n \nFebruary 14, 2025\nRobert B. Millard\n*\n \nDirector\n \nFebruary 14, 2025\nDavid S. Regnery\n*\nDirector\nFebruary 14, 2025\nEdward A. Rice, Jr. \n*\n \nDirector\n \nFebruary 14, 2025\nWilliam H. Swanson\n*\nDirector\nFebruary 14, 2025\nChristina L. Zamarro\n* By Christoph T. Feddersen pursuant to a Power of Attorney executed by the Directors listed above, which has been                                 \nfiled with this Annual Report on Form 10-K. \n \nDate: February 14, 2025\nBy:  \n/s/ Christoph T. Feddersen\n         \n                                                                                                                                  Christoph T. Feddersen, Attorney-in-Fact"
  }
}