{
  "ticker": "LLY",
  "cik": "0000059478",
  "company_name": "ELI LILLY & Co",
  "filing_date": "2025-02-19",
  "accession": "0000059478-25-000067",
  "primary_doc": "lly-20241231.htm",
  "item_sections": {
    "item1": "Item 1A, \"Risk Factors—Risks Related to Our Business and Industry—Pharmaceutical research and development is very costly and highly uncertain; we may not succeed in developing, licensing, or acquiring commercially successful products sufficient in number or value to replace revenues of products that have lost or will lose intellectual property protection or are displaced by competing products or therapies,\" for additional information.\nWe manage research and development spending across our portfolio of potential new medicines and indications. A delay in, or termination of, any one project will not necessarily cause a significant change in our total research and development spending. Due to the risks and uncertainties involved in the research and development process, we cannot reliably estimate the nature, timing, and costs of the efforts necessary to complete the development of our research and development projects, nor can we reliably estimate the future potential revenue that will be generated from any successful research and development project. Each project represents only a portion of the overall pipeline, and none is individually material to our consolidated research and development expense. While we do accumulate certain research and development costs on a project level for internal reporting purposes, we must make significant cost estimations and allocations, some of which rely on data that are neither reproducible nor validated through accepted control mechanisms. Therefore, we do not have sufficiently reliable data to report on total research and development costs by project, by pre-clinical versus clinical spend, or by therapeutic category. \nOther Matters\nPatent Matters\nWe depend on patents or other forms of intellectual property protection for most of our revenue, cash flows, and earnings. \nSee Note 16 to the consolidated financial statements for a description of legal proceedings currently pending regarding certain of our patents.\nSee Item 1, \"Business—Patents, Trademarks, and Other Intellectual Property Rights,\" for a discussion of the impacts of trends involving intellectual property on our business and results.\n44\nTrends Affecting Pharmaceutical Pricing, Reimbursement, and Access and Certain Other Regulatory Developments\nReforms, including those that may stem from political initiatives, periods of uneven economic growth or downturns, or as a result of inflation or deflation, the emergence or escalation of, and responses to, international tension and conflicts, or government budgeting priorities, are expected to continue to result in added pressure on pricing and reimbursement for our products.\nGlobal concern over access to, and affordability of, pharmaceutical products continues to drive regulatory and legislative debate and action, as well as cost containment efforts by governmental authorities. Such measures include the use of mandated discounts, price reporting requirements, mandated reference prices, restrictive formularies, changes to available intellectual property protections, as well as other efforts. In 2022, the U.S. government enacted the Inflation Reduction Act of 2022 (IRA). Among other measures, the IRA requires the U.S. Department of Health and Human Services (HHS) to effectively set prices for certain single-source drugs and biologics reimbursed under Medicare Part B and Part D. Generally, these government prices apply beginning at nine years (for medicines approved under a New Drug Application) or thirteen years (for medicines approved under a Biologics License Application) following FDA approval or licensure for the molecule and are set at a price that generally represents a significant discount from existing prices to wholesalers and direct purchasers. While the law specifies a maximum price that HHS can set, it does not set a minimum price. The Medicare price HHS determines may impact the product's best price determination under the Medicaid Drug Rebate Program and the 340B Drug Pricing Program, potentially leading to a negative impact on both Medicaid and 340B prices. In August 2023, HHS selected Jardiance, which is part of our collaboration with Boehringer Ingelheim, as one of the first ten medicines subject to government-set prices effective in 2026. In August 2024, HHS announced the government-set prices for these medicines with Jardiance subject to a 66% discount compared to the 2023 U.S. calendar year list price for a 30-day supply and discounts for the other nine medicines ranging from approximately 38% to 79% below list price. Given our product portfolio, we expect additional significant products will be selected in future years, which would have the effect of accelerating revenue erosion prior to expiry of exclusivities. The effect of reducing prices and reimbursement for certain of our products could significantly impact our business and consolidated results of operations. \nOther IRA provisions require drug manufacturers to provide rebates for Medicare Part B and Part D medicines under certain circumstances. Also, on January 1, 2025, the Part D benefit redesign replaced the Part D Coverage Gap Discount Program with a new manufacturer discount program. Manufacturers that fail to comply with the IRA may be subject to various penalties, including civil monetary penalties, which could be significant.\nThe IRA has, and will continue to, meaningfully influence our business strategies and those of our competitors. In particular, the nine-year timeline to set prices for medicines approved under a New Drug Application reduces the attractiveness of investment in small molecule innovation. The IRA can cause changes to development approach and timing and investments at-risk. The full impact of the IRA on our business and the pharmaceutical industry, including the implications to us of a competitor's product being selected for price setting, remains uncertain.\nAdditional policies, regulations, legislation, or enforcement, including those proposed or pursued by lawmakers, regulators, and other authorities in the U.S. and worldwide, could adversely impact our business and consolidated results of operations. For example, the U.S. House of Representatives recently passed the BIOSECURE Act, which is under consideration in the U.S. Senate. This legislation, if passed, could affect elements of the pharmaceutical supply chain; although as currently drafted we do not anticipate the bill would have a material impact on our business.\n45\nConsolidation and integration of private payers and pharmacy benefit managers in the U.S. has also significantly impacted the market for pharmaceuticals by increasing payer leverage in negotiating manufacturer price or rebate concessions and pharmacy reimbursement rates. Furthermore, restrictive or unfavorable pricing, coverage, or reimbursement determinations for our medicines or product candidates by governments, regulatory agencies, courts, or private payers may adversely impact our business and consolidated results of operations. We expect that these actions may intensify and could particularly affect certain products, which could adversely affect our business. In addition, we are engaged in litigation and investigations related to the 340B program, access to insulin, pricing, product safety, and other matters that, if resolved adversely to us, could negatively impact our business and consolidated results of operations. It is not currently possible to predict the overall potential adverse impact to us or the general pharmaceutical industry of continued cost containment efforts worldwide.\nIn addition, regulatory issues concerning compliance with current Good Manufacturing Practices, quality assurance, safety signals, evolving standards, and increased scrutiny around excipients and potential impurities such as nitrosamines, and similar regulations and standards (and comparable foreign regulations and standards) for our products in some cases lead to regulatory and legal actions, product recalls and seizures, fines and penalties, interruption of production leading to product shortages, import bans or denials of import certifications, inability to realize the benefit of capital expenditures, or delays or denials in new product approvals, line extensions or supplemental approvals of current products pending resolution of the issues, or other negative impacts, any of which result in reputational harm or adversely affect our business. \nSee Item 1, \"Business—Regulations and Private Payer Actions Affecting Pharmaceutical Pricing, Reimbursement, and Access,\"",
    "item1a": "Item 1A, \"Risk Factors,\" for additional information on risk factors that could impact our business and operations. \n47\nRESULTS OF OPERATIONS\nOperating Results—2024 \nRevenue\nThe following table summarizes our revenue activity by region:\nYear Ended December 31,\n2024\n2023\nPercent Change\nU.S.\n$\n30,375.2\n \n$\n21,791.0 \n39\nOutside U.S.\n14,667.5\n \n12,333.1 \n19\nRevenue\n$\n45,042.7\n \n$\n34,124.1 \n32\nNumbers may not add due to rounding.\nThe following are components of the change in revenue compared with the prior year:\n2024 vs. 2023\nU.S.\nOutside U.S.\nConsolidated\nVolume\n31 \n%\n20 \n%\n27 \n%\nPrice\n8 \n%\n— \n%\n5 \n%\nForeign exchange rates\n— \n%\n(1)\n%\n— \n%\nPercent change\n39 \n%\n19 \n%\n32 \n%\nNumbers may not add due to rounding.\nIn the U.S. the increase in volume in 2024 was primarily driven by Zepbound and Mounjaro, partially offset by Trulicity. In the U.S. the higher realized prices in 2024 were primarily driven by Humalog, Mounjaro, Verzenio, and Zepbound. \nOutside the U.S. the increase in volume in 2024 was primarily driven by Mounjaro and, to a lesser extent, Verzenio, as well as a one-time payment received of $300.0 million related to Jardiance associated with an amendment to our collaboration with Boehringer Ingelheim. Outside the U.S. the increase in volume in 2024 was partially offset by the 2023 sale of rights for the olanzapine portfolio.\n48\nThe following table summarizes our revenue, including net product revenue and collaboration and other revenue, by product in 2024 compared with 2023:\nYear Ended December 31,\n \n2024\n2023\nPercent Change\nU.S.\nOutside U.S.\nTotal\nTotal\nMounjaro\n$\n8,949.9\n \n$\n2,590.2\n \n$\n11,540.1\n \n$\n5,163.1 \n124\nVerzenio\n3,420.6\n \n1,886.0\n \n5,306.6\n \n3,863.4 \n37\nTrulicity\n3,693.8\n \n1,559.7\n \n5,253.5\n \n7,132.6 \n(26)\nZepbound\n4,925.7\n \n—\n \n4,925.7\n \n175.8 \nNM\nJardiance\n(1)\n1,597.5\n \n1,743.4\n \n3,340.9\n \n2,744.7 \n22\nTaltz\n2,152.3\n \n1,108.1\n \n3,260.4\n \n2,759.6 \n18\nHumalog\n(2)\n1,502.6\n \n822.2\n \n2,324.8\n \n1,663.3 \n40\nCyramza\n442.2\n \n531.0\n \n973.3\n \n974.7 \n—\nOlumiant\n228.7\n \n728.7\n \n957.4\n \n922.6 \n4\nHumulin\n643.4\n \n273.7\n \n917.1\n \n852.1 \n8\nEmgality\n559.7\n \n310.7\n \n870.4\n \n678.3 \n28\nBasaglar\n(3)\n375.4\n \n301.5\n \n676.9\n \n728.3 \n(7)\nErbitux\n562.1\n \n65.3\n \n627.4\n \n596.5 \n5\nTyvyt\n—\n \n526.0\n \n526.0\n \n393.4 \n34\nZyprexa\n(4)\n2.0\n \n114.3\n \n116.3\n \n1,694.8 \n(93)\nBaqsimi\n2.5\n \n26.7\n \n29.1\n \n677.6 \n(96)\nOther products\n1,316.8\n \n2,080.0\n \n3,396.8\n \n3,103.3 \n9\nRevenue\n$\n30,375.2\n \n$\n14,667.5\n \n$\n45,042.7\n \n$\n34,124.1 \n32\nNumbers may not add due to rounding.\nNM - not meaningful\n(1) \nJardiance revenue includes Glyxambi,\n \nSynjardy, and Trijardy XR. \n(2) \nHumalog revenue includes insulin lispro. \n(3) \nBasaglar revenue includes Rezvoglar.\n \n(4) \nZyprexa revenue includes sale of the rights for the olanzapine portfolio in 2023.\nRevenue of Mounjaro increased 85 percent in the U.S., primarily driven by strong demand and increased supply. Revenue outside of the U.S. was $2.59 billion in 2024 compared to $328.9 million in 2023, primarily driven by volume growth in launched markets. \nRevenue of Verzenio increased 36 percent in the U.S., driven by increased demand, wholesaler buying patterns and, to a lesser extent, higher realized prices. Revenue outside the U.S. increased 39 percent, driven by increased demand.\nRevenue of Trulicity decreased 32 percent in the U.S., driven by decreased volume primarily due to competitive dynamics and supply constraints during the first half of 2024. Revenue outside the U.S. decreased 8 percent, driven by decreased volume primarily due to competitive dynamics and actions we have taken to manage demand.\nRevenue of Zepbound in the U.S. in 2024 was $4.93 billion, compared to $175.8 million in 2023. Zepbound launched in the U.S. for the treatment of adult patients with obesity or overweight with weight-related comorbidities in November 2023.\nRevenue of Jardiance remained relatively flat in the U.S. as increased demand was offset by lower realized prices. Revenue outside the U.S. increased 52 percent, driven by increased volume and a one-time payment received of $300.0 million associated with an amendment to our collaboration with Boehringer Ingelheim. Pursuant to the amendment, we and Boehringer Ingelheim adjusted commercialization responsibilities for Jardiance within certain smaller markets. See Note 4 to the consolidated financial statements for information regarding our collaboration with Boehringer Ingelheim involving Jardiance.\nRevenue of Taltz increased 18 percent in the U.S., driven by higher realized prices due to changes in estimates for rebates and discounts, as well as increased demand. Revenue outside the U.S. increased 19 percent, primarily driven by increased demand. \n49\nGross Margin, Costs, and Expenses\nThe following table summarizes our gross margin, costs, and expenses:\nYear Ended December 31,\nPercent Change\n2024\n2023\nGross margin\n$\n36,624.4\n \n$\n27,041.9 \n35\nGross margin as a percent of revenue\n81.3\n \n%\n79.2 \n%\nResearch and development\n$\n10,990.6\n \n$\n9,313.4 \n18\nMarketing, selling, and administrative\n8,593.8\n \n7,403.1 \n16\nAcquired in-process research and development\n3,280.4\n \n3,799.8 \n(14)\nAsset impairment, restructuring, and other special charges\n860.6\n \n67.7 \nNM\nOther—net, (income) expense\n218.6\n \n(96.7)\nNM\nIncome taxes\n2,090.4\n \n1,314.2 \n59\nEffective tax rate\n16.5\n \n%\n20.1 \n%\nNM - not meaningful\nGross margin as a percent of revenue in 2024 increased 2.1 percentage points compared with 2023, primarily driven by favorable product mix and higher realized prices.\nResearch and development expenses increased 18 percent in 2024, primarily driven by continued investments in our early and late-stage portfolio.\nMarketing, selling, and administrative expenses increased 16 percent in 2024, primarily driven by promotional efforts supporting ongoing and future launches.\nAcquired in-process research and development (IPR&D) charges recognized in 2024 primarily related to the acquisition of Morphic. Acquired IPR&D charges recognized in 2023 primarily related to acquisitions of DICE Therapeutics, Inc., Versanis Bio, Inc., Emergence Therapeutics AG, and Mablink Biosciences SAS and from a business development transaction with Beam Therapeutics Inc. See Note 3 to the consolidated financial statements for additional information.\nAsset impairment, restructuring, and other special charges recognized in 2024 primarily related to a $435.0 million litigation charge and an intangible asset impairment for Vitrakvi, driven by expected commercial projections. See Notes 5 and 16 to the consolidated financial statements for additional information.\nOur effective tax rate was 16.5 percent in 2024, compared with an effective tax rate of 20.1 percent in 2023. The effective tax rates for 2024 and 2023 were both unfavorably impacted by non-deductible acquired IPR&D charges, with a larger impact occurring in 2023. See Note 14 to the consolidated financial statements for additional information.\nFor additional information for other–net, (income) expense, see Note 18 to the consolidated financial statements.\nOperating Results—2023 \nFor a discussion of our results of operations pertaining to 2023 and 2022 see Item 7, \"Management's Discussion and Analysis of Results of Operations and Financial Condition\" in our Annual Report on \nForm 10-K\n for the year ended December 31, 2023.\n50\nFINANCIAL CONDITION AND LIQUIDITY\nWe believe our available cash and cash equivalents, together with our ability to generate operating cash flow and our access to short-term and long-term borrowings, are sufficient to fund our existing and planned capital requirements, which include: \n•\nworking capital requirements, including related to employee payroll and benefits, clinical trials, manufacturing materials, and taxes;\n•\ncapital expenditures;\n•\nshare repurchases and dividends;\n•\nrepayment of outstanding short-term and long-term borrowings; \n•\nmilestone and royalty payments; \n•\npotential business development activities, including acquisitions, collaborations, investments, and licensing arrangements; and \n•\ncontributions to our defined benefit pension and retiree health benefit plans.\nOur management continuously evaluates our liquidity and capital resources, including our access to external capital, to ensure we can adequately and efficiently finance our capital requirements. As of December 31, 2024, our material cash requirements primarily related to purchases of goods and services to produce our products and conduct our operations, income tax payments, capital expenditures, dividends, milestone and royalty payments, business development activities, share repurchases and repayment of outstanding borrowings (see Notes 14, 4, 3, 13, and 11 to the consolidated financial statements). We anticipate our cash requirements related to ordinary course purchases of goods and services will be consistent with our past levels relative to revenues.\nCapital expenditures were $5.06 billion during 2024, compared to $3.45 billion in 2023. We are making investments in global facilities to manufacture existing and future products. These investments, and other capital investments that support our operations, have increased our capital expenditures and will result in meaningfully higher capital expenditures over the next several years. \nAs we expand our manufacturing capacity in order to meet existing and expected demand of our medicines, we have entered, and expect to continue to enter, into various agreements for contract manufacturing and for supply of materials. The executed agreements could, under certain circumstances, require us to pay up to approximately $14 billion if we do not purchase specified amounts of goods or services primarily related to our incretin medicines, including medicines in development, over the durations of the agreements, which are generally up to 8 years. \nCash and cash equivalents increased to $3.27 billion as of December 31, 2024, compared with $2.82 billion at December 31, 2023. Net cash provided by operating activities increased to $8.82 billion in 2024, compared with $4.24 billion in 2023. Refer to the consolidated statements of cash flows for additional information on the significant sources and uses of cash for the years ended December 31, 2024 and 2023. \nIn addition to our cash and cash equivalents, we held total investments of $3.37 billion and $3.16 billion as of December 31, 2024 and 2023, respectively. See Note 7 to the consolidated financial statements for additional information.\nWe paid $3.35 billion in 2024 for acquired IPR&D primarily related to the acquisition of Morphic. We paid $947.7 million in 2024 primarily related to the acquisition of a manufacturing site in Wisconsin. See Note 3 to the consolidated financial statements for additional information.\nAs of December 31, 2024, total debt was $33.64 billion, an increase of $8.42 billion compared with $25.23 billion at December 31, 2023. In February 2025, we issued $6.5 billion of fixed-rate notes. We expect to use the net cash proceeds from the offering to fund potential business development activities, as well as general business purposes, including the repayment of outstanding commercial paper. See Note 11 to the consolidated financial statements for additional information. \n51\nAs of December 31, 2024, we had a total of $8.45 billion of unused committed bank credit facilities, $8.00 billion of which is available to support our commercial paper program. See Note 11 to the consolidated financial statements for additional information. We believe that amounts accessible through existing commercial paper markets should be adequate to fund short-term borrowing needs.\nDividends of $5.20 per share and $4.52 per share were paid in 2024 and 2023, respectively. The quarterly dividend was increased to $1.50 per share effective for the dividend to be paid in the first quarter of 2025, resulting in an indicated annual rate for 2025 of $6.00 per share.\nIn 2024, we repurchased $2.50 billion of shares, which completed our $5.00 billion share repurchase program that our board authorized in May 2021. Our board authorized a $15.00 billion share repurchase program in December 2024. No shares were repurchased under this new program as of December 31, 2024. See Note 13 to the consolidated financial statements for additional information.\nSee \"—Executive Overview—Other Matters—Patent Matters\" for information regarding losses of patent protection.\nBoth domestically and abroad, we monitor the potential impacts of the economic environment and international tension and conflicts; the creditworthiness of our wholesalers and other customers, including foreign government-backed agencies and suppliers; the uncertain impact of healthcare legislation; and various international government funding levels.\nIn the normal course of business, our operations are exposed to fluctuations in interest rates, currency values, and fair values of equity securities. These fluctuations impact the costs of financing, investing, and operating our business. We seek to address a portion of these risks through a controlled program of risk management that includes the use of derivative financial instruments. The objective of this risk management program is to limit the impact on earnings of fluctuations in interest and currency exchange rates. All derivative activities are for purposes other than trading.\nOur primary interest rate risk exposure results from changes in short-term U.S. dollar interest rates. In an effort to manage interest rate exposures, we strive to achieve an acceptable balance between fixed and floating rate debt positions and in some cases we enter into interest rate derivatives to help maintain that balance. As of December 31, 2024, all of our total long-term debt is at a fixed rate. We have converted approximately 5 percent of our long-term fixed-rate notes to floating rates through the use of interest rate swaps. Based on our overall interest rate exposure at December 31, 2024 and 2023, including derivatives and other interest rate risk-sensitive instruments, a hypothetical 10 percent change in interest rates applied to the fair value of the instruments as of December 31, 2024 and 2023, respectively, would not have a material impact on earnings, cash flows, or fair values of interest rate risk-sensitive instruments over a one-year period.\nOur foreign currency risk exposure results from fluctuating currency exchange rates, primarily the U.S. dollar against the euro, Japanese yen, and Chinese yuan. We face foreign currency exchange exposures when we enter into transactions arising from subsidiary trade and loan payables and receivables denominated in foreign currencies. We also face currency exposure that arises from translating the results of our global operations to the U.S. dollar at exchange rates that have fluctuated from the beginning of the period. We in some cases enter into foreign currency forward or option derivative contracts to reduce the effect of fluctuating currency exchange rates (primarily the euro, Chinese yuan, and Japanese yen). Our corporate risk-management policy outlines the minimum and maximum hedge coverage of such exposures. Gains and losses on these derivative contracts offset, in part, the impact of currency fluctuations on the existing assets and liabilities. We periodically analyze the fair values of the outstanding foreign currency derivative contracts to determine their sensitivity to changes in foreign exchange rates. A hypothetical 10 percent change in exchange rates (primarily against the U.S. dollar) applied to the fair values of our outstanding foreign currency derivative contracts as of December 31, 2024 and 2023, would not have a material impact on earnings, cash flows, or financial position over a one-year period. This sensitivity analysis does not consider the impact that hypothetical changes in exchange rates would have on the underlying foreign currency denominated transactions.\nOur fair value risk exposure relates primarily to our public equity investments and to our equity investments that do not have readily determinable fair values. As of December 31, 2024 and 2023, our carrying values of these investments were $1.35 billion and $1.32 billion, respectively. A hypothetical 20 percent change in fair value of the equity instruments would have impacted other-net, (income) expense by $269.9 million and $263.9 million as of December 31, 2024 and 2023, respectively. \n52\nWe have no off-balance sheet arrangements that have a material current effect or that are reasonably likely to have a material future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources. We acquire and collaborate on potential products still in development and enter into research and development arrangements with third parties that often require milestone and royalty payments to the third-party contingent upon the occurrence of certain future events linked to the success of the asset in development. Milestone payments may be required contingent upon the successful achievement of an important point in the development life cycle of the pharmaceutical product (e.g., approval for marketing by the appropriate regulatory agency or upon the achievement of certain sales levels). If required by the arrangement, we may make royalty payments based upon a percentage of the sales of the product in the event that regulatory approval for marketing is obtained. \nIndividually, these arrangements are generally not material in any one annual reporting period. However, if milestones for multiple products covered by these arrangements were reached in the same reporting period, the aggregate expense or aggregate milestone payments made could be material to our results of operations or cash flows, respectively, in that period. See Note 4 to the consolidated financial statements for additional information. These arrangements often give us the discretion to unilaterally terminate development of the product, which would allow us to avoid making the contingent payments; however, we are unlikely to cease development if the compound successfully achieves milestone objectives. We view these payments as positive because they signify that the product is successfully moving through development and is now generating or is more likely to generate cash flows from sales of products.\nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES\nIn preparing our financial statements in accordance with accounting principles generally accepted in the U.S., we must often make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures. Some of those judgments can be subjective and complex, and consequently actual results could differ from those estimates. For any given individual estimate or assumption we make, it is possible that other people applying reasonable judgment to the same facts and circumstances could develop different estimates. We believe that, given current facts and circumstances, it is unlikely that applying any such other reasonable judgment would cause a material adverse effect on our consolidated results of operations, financial position, or liquidity for the periods presented in this Annual Report on Form 10-K. Our most critical accounting estimates have been discussed with our audit committee and are described below.\nRevenue Recognition and Sales Return, Rebate, and Discount Accruals\nBackground and Uncertainties\nWe recognize revenue primarily from two different types of contracts, product sales to customers (net product revenue) and collaborations and other arrangements. For product sales to customers, provisions for returns, rebates and discounts are established in the same period the related product sales are recognized. To determine the appropriate transaction price for our product sales at the time we recognize a sale to a direct customer, we estimate any rebates or discounts that ultimately will be due to the direct customer and other customers in the distribution chain under the terms of our contracts. Significant judgments are required in making these estimates. The largest of our sales rebate and discount amounts include rebates associated with sales covered by managed care, Medicare, Medicaid, and chargeback programs, as well as reductions in revenue related to our patient assistance programs, in the U.S. In determining the appropriate accrual amount, we consider our historical rebate payments for these programs, as well as patient assistance program costs, by product as a percentage of our historical sales as well as any significant changes in sales trends (e.g., patent expiries and product launches), an evaluation of the current contracts for these programs, the percentage of our products that are sold via these programs, and our product pricing. Although we accrue a liability for revenue reductions related to these programs at the time we record the sale, the reduction related to that sale is typically paid up to six months later. Because of this time lag, in any particular period our net product revenue may incorporate revisions of accruals for several periods.\nRefer to Note 2 to the consolidated financial statements for further information on revenue recognition and sales return, rebate, and discount accruals.\nRevenue recognized from collaborations and other arrangements includes our share of profits from the collaborations, as well as royalties, upfront and milestone payments we receive under these types of contracts.\n53\nFinancial Statement Impact\nWe believe that our accruals for sales returns, rebates, and discounts are reasonable and appropriate based on current facts and circumstances. Our rebate and discount liabilities are included in sales rebates and discounts on our consolidated balance sheet. Our sales return liability is included in other current liabilities and other noncurrent liabilities on our consolidated balance sheet. As of December 31, 2024, a 5 percent change in our consolidated sales return, rebate, and discount liability would result in a change in revenue of approximately $600 million. \nThe portion of our consolidated sales return, rebate, and discount liability resulting from sales of our products in the U.S. was approximately 90 percent as of December 31, 2024 and 2023.\nThe following represents a roll-forward of our most significant U.S. sales return, rebate, and discount liability balances, including managed care, Medicare, Medicaid, chargeback, and patient assistance programs:\n2024\n2023\nSales return, rebate, and discount liabilities, beginning of year\n$\n10,667.5\n \n$\n8,214.1 \nReduction of net sales\n(1) \n41,452.3\n \n37,866.8 \nCash payments\n(41,807.0)\n(35,413.4)\nSales return, rebate, and discount liabilities, end of year\n$\n10,312.8\n \n$\n10,667.5 \n(1) \nAdjustments of the estimates for these returns, rebates, and discounts to actual results were less than 2 percent of consolidated revenue for each of the years presented.\nLitigation Liabilities and Other Contingencies\nBackground and Uncertainties\nLitigation liabilities and other contingencies are, by their nature, uncertain and based upon complex judgments and probabilities. The factors we consider in developing our litigation liability reserves and other contingent liability amounts include the merits and jurisdiction of the litigation, the nature and the number of other similar current and past matters, the nature of the product and the current assessment of the science subject to the litigation, as applicable, and the likelihood of settlement and current state of settlement discussions, if any. In addition, we accrue for certain product liability claims incurred but not filed to the extent we can formulate a reasonable estimate of their costs based primarily on historical claims experience and data regarding product usage. \nWe also consider the insurance coverage we have to diminish the exposure for periods covered by insurance. In assessing our insurance coverage, we consider the policy coverage limits and exclusions, the potential for denial of coverage by the insurance company, the financial condition of the insurers, and the possibility of and length of time for collection. Due to a very restrictive market for liability insurance, we are predominantly self-insured for liability losses for all our currently and previously marketed products, as well as for litigation or investigations related to our pricing practices or other similar matters. In addition to insurance coverage, we consider any third-party indemnification to which we are entitled or under which we are obligated. With respect to our third-party indemnification rights, these considerations include the nature of the indemnification, the financial condition of the indemnifying party, and the possibility of and length of time for collection.\nThe litigation accruals and environmental liabilities and the related estimated insurance recoverables are reflected on a gross basis as liabilities and assets, respectively, on our consolidated balance sheets.\n54\nAcquisitions\nBackground and Uncertainties\nTo determine whether acquisitions or licensing transactions should be accounted for as a business combination or as an asset acquisition, we make certain judgments, which include assessing whether the acquired set of activities and assets would meet the definition of a business under the relevant accounting rules. \nIf the acquired set of activities and assets meets the definition of a business, assets acquired and liabilities assumed are required to be recorded at their respective fair values on our consolidated balance sheet as of the acquisition date. The excess of the purchase price over the fair value of the acquired net assets, where applicable, is recorded as goodwill. If the acquired set of activities and assets does not meet the definition of a business, the transaction is recorded as an acquisition of assets and, therefore, any acquired IPR&D that does not have an alternative future use is charged to acquired IPR&D on our consolidated statement of operations at the acquisition date, and goodwill is not recorded. See Note 3 to the consolidated financial statements for additional information. \nThe judgments made in determining estimated fair values assigned to assets acquired and liabilities assumed in a business combination, as well as estimated asset lives, can materially affect our consolidated results of operations. The fair values of intangible assets, including acquired IPR&D, are determined using information available near the acquisition date based on estimates and assumptions that are deemed reasonable by management. Significant estimates and assumptions include, but are not limited to, probability of technical success, revenue projections, and discount rate. Depending on the facts and circumstances, we may deem it necessary to engage an independent valuation expert to assist in valuing significant assets and liabilities. \nThe fair values of identifiable intangible assets are primarily determined using the \"income method,\" as described in Note 8 to the consolidated financial statements.\nThe fair value of any contingent consideration liability that results from a business combination is primarily determined using a discounted cash flow analysis, as described in Note 7 to the consolidated financial statements. Estimating the fair value of contingent consideration requires the use of significant estimates and judgments, including, but not limited to, probability of technical success, timing of the potential milestone event, and the discount rate.\nFinancial Statement Impact\nAs of December 31, 2024, a 5 percent change in the contingent consideration liabilities would result in a change in income before income taxes of $1.6 million.\n55\nImpairment of Indefinite-Lived and Long-Lived Assets\nBackground and Uncertainties\nWe review the carrying value of long-lived assets (both intangible and tangible) for potential impairment whenever events or changes in circumstances indicate the carrying value of an asset (or asset group) may not be recoverable. We identify impairment by comparing the projected undiscounted cash flows to be generated by the asset (or asset group) to its carrying value. If an impairment is identified, a loss is recorded equal to the excess of the asset's net book value over its fair value, and the cost basis is adjusted.\nGoodwill and indefinite-lived intangible assets are reviewed for impairment at least annually, or more frequently if impairment indicators are present, by first assessing qualitative factors to determine whether it is more likely than not that the fair value of the asset is less than its carrying amount. If we conclude it is more likely than not that the fair value is less than the carrying amount, a quantitative test that compares the fair value of the intangible asset to its carrying value is performed to determine the amount of any impairment.\nSeveral methods may be used to determine the estimated fair value of long-lived assets, all of which require multiple assumptions. When determining the fair value of indefinite-lived acquired IPR&D as well as the fair value of finite-lived intangible assets for impairment testing purposes, we utilize the \"income method,\" as described in Note 8 to the consolidated financial statements.\nFor acquired IPR&D assets, the risk of failure has been factored into the fair value measure and there can be no certainty that these assets ultimately will yield a successful product, as discussed previously in \"—Executive Overview—Clinical Development Pipeline.\" The nature of the pharmaceutical business is high-risk and requires that we invest in a large number of projects to maintain a successful portfolio of approved products. As such, it is likely that some acquired IPR&D assets will become impaired in the future.\nEstimates of future cash flows, based on what we believe to be reasonable and supportable assumptions and projections, require management's judgment. Actual results could vary materially from these estimates.\nIncome Taxes\nBackground and Uncertainties\nWe file tax returns based upon our interpretation of tax laws and regulations, and we record estimates in our financial statements based upon these interpretations at the applicable tax rates in the jurisdictions in which we operate. Our tax returns are routinely subject to examination by taxing authorities, which could result in future tax, interest, and penalty assessments. Inherent uncertainties also exist in estimates of many tax positions due to the complexity of tax laws. We recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained upon examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate resolution. The amount of unrecognized tax benefits is adjusted for changes in facts and circumstances such as changes to existing tax law, the issuance of regulations by taxing authorities, new information obtained during a tax examination, or resolution of a tax examination. We believe our estimates for uncertain tax positions are both appropriate and sufficient to pay assessments that may result from examinations of our tax returns; however, given the uncertainty of positions that could be taken by taxing authorities during the examinations of our tax returns, the ultimate outcome of any tax matters may result in liabilities that are greater than amounts accrued. We recognize both accrued interest and penalties related to unrecognized tax benefits in income tax expense.\nWe have recorded valuation allowances against certain of our deferred tax assets, primarily those that have been generated from net operating losses, tax credits, and other tax carryforwards in certain taxing jurisdictions, when the amount of future taxable income is unlikely to support their utilization.\nFinancial Statement Impact\nAs of December 31, 2024, a 5 percent change in the amount of uncertain tax positions and the valuation allowance would result in a change in net income of $131.3 million and $48.2 million, respectively.\n56\nRetirement Benefits Assumptions\nBackground and Uncertainties\nDefined benefit pension plan and retiree health benefit plan costs include assumptions for the discount rate, expected return on plan assets, and retirement age. These assumptions have a significant effect on the amounts reported. In addition to the analysis below, see Note 15 to the consolidated financial statements for additional information regarding our retirement benefits.\nAnnually, we evaluate the discount rate and the expected return on plan assets in our defined benefit pension and retiree health benefit plans. We use an actuarially determined, plan-specific yield curve of high quality, fixed income debt instruments to determine the discount rates. In evaluating the expected return on plan assets, we consider many factors, with a primary analysis of current and projected market conditions, asset returns and asset allocations (approximately 75 percent of which are growth investments), and the views of leading financial advisers and economists. We may also review our historical assumptions compared with actual results, as well as the discount rates and expected return on plan assets of other companies, where applicable. In evaluating our expected retirement age assumption, we consider the retirement ages of our past employees eligible for pension and medical benefits together with our expectations of future retirement ages.\nFinancial Statement Impact\nIf the 2024 discount rate for the U.S. defined benefit pension and retiree health benefit plans (U.S. plans) were to change by a quarter percentage point, income before income taxes would change by $15.0 million. If the 2024 expected return on plan assets for U.S. plans were to change by a quarter percentage point, income before income taxes would change by $33.2 million. If our assumption regarding the 2024 expected age of future retirees for U.S. plans were adjusted by one year, our income before income taxes would be affected by $35.9 million. The U.S. plans, including Puerto Rico, represent approximately 80 percent for total projected benefit obligation and 85 percent for total plan assets at December 31, 2024.\nLEGAL AND REGULATORY MATTERS \nInformation relating to certain legal proceedings can be found in Note 16 to the consolidated financial statements and is incorporated here by reference.\nItem 7A.\nQuantitative and Qualitative Disclosures About Market Risk\nYou can find quantitative and qualitative disclosures about market risk (e.g.\n,\n interest rate risk) at Item 7, \"Management's Discussion and Analysis - Financial Condition and Liquidity.\" That information is incorporated by reference herein.\n57\nItem 8.\nFinancial Statements and Supplementary Data\nConsolidated Statements of Operations\nELI LILLY AND COMPANY AND SUBSIDIARIES\n(Dollars in millions, except per-share data, and shares in thousands)\nYear Ended December 31,\n2024\n2023\n2022\nRevenue (Note 2)\n$\n45,042.7\n \n$\n34,124.1\n \n$\n28,541.4\n \nCosts, expenses, and other:\nCost of sales\n8,418.3\n \n7,082.2\n \n6,629.8\n \nResearch and development\n10,990.6\n \n9,313.4\n \n7,190.8\n \nMarketing, selling, and administrative\n8,593.8\n \n7,403.1\n \n6,440.4\n \nAcquired in-process research and development (Note 3)\n3,280.4\n \n3,799.8\n \n908.5\n \nAsset impairment, restructuring, and other special charges \n(Note 5)\n860.6\n \n67.7\n \n244.6\n \nOther—net, (income) expense (Note 18)\n218.6\n \n(\n96.7\n)\n320.9\n \n32,362.3\n \n27,569.5\n \n21,735.0\n \nIncome before income taxes\n12,680.4\n \n6,554.6\n \n6,806.4\n \nIncome taxes (Note 14)\n2,090.4\n \n1,314.2\n \n561.6\n \nNet income\n$\n10,590.0\n \n$\n5,240.4\n \n$\n6,244.8\n \nEarnings per share:\nBasic\n$\n11.76\n \n$\n5.82\n \n$\n6.93\n \nDiluted\n$\n11.71\n \n$\n5.80\n \n$\n6.90\n \nShares used in calculation of earnings per share:\nBasic\n900,605\n \n900,181\n \n901,736\n \nDiluted\n904,059\n \n903,284\n \n904,619\n \nSee notes to consolidated financial statements.\n58\nConsolidated Statements of Comprehensive Income\nELI LILLY AND COMPANY AND SUBSIDIARIES\n(Dollars in millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n10,590.0\n \n$\n5,240.4\n \n$\n6,244.8\n \nOther comprehensive income (loss):\nChange in foreign currency translation gains (losses)\n(\n424.2\n)\n(\n25.8\n)\n(\n248.1\n)\nChange in net unrealized gains (losses) on available-for-sale securities\n(\n7.1\n)\n14.1\n \n(\n53.2\n)\nChange in retirement benefit plans (Note 15)\n651.8\n \n(\n776.5\n)\n616.9\n \nChange in net unrealized gains (losses) on cash flow hedges\n79.3\n \n109.5\n \n432.9\n \nOther comprehensive income (loss) before income taxes\n299.8\n \n(\n678.7\n)\n748.5\n \nBenefit (expense) for income taxes related to other comprehensive income (loss) \n(\n294.7\n)\n196.3\n \n(\n250.0\n)\nOther comprehensive income (loss), net of tax (Note 17)\n5.1\n \n(\n482.4\n)\n498.5\n \nComprehensive income\n$\n10,595.1\n \n$\n4,758.0\n \n$\n6,743.3\n \nSee notes to consolidated financial statements.\n59\nConsolidated Balance Sheets\nELI LILLY AND COMPANY AND SUBSIDIARIES\n(Dollars in millions, shares in thousands)\nDecember 31,\n2024\n2023\nAssets\nCurrent Assets\nCash and cash equivalents (Note 7)\n$\n3,268.4\n \n$\n2,818.6\n \nShort-term investments (Note 7)\n154.8\n \n109.1\n \nAccounts receivable, net of allowances of \n$\n14.9\n \n(2024)\n and $\n14.8\n (2023)\n11,005.7\n \n9,090.5\n \nOther receivables\n2,269.7\n \n2,245.7\n \nInventories (Note 6)\n7,589.2\n \n5,772.8\n \nPrepaid expenses\n8,340.5\n \n5,540.8\n \nOther current assets\n111.4\n \n149.5\n \nTotal current assets\n32,739.7\n \n25,727.0\n \nInvestments (Note 7)\n3,215.9\n \n3,052.2\n \nGoodwill (Note 8)\n5,770.3\n \n4,939.7\n \nOther intangibles, net (Note 8)\n6,166.3\n \n6,906.6\n \nDeferred tax assets (Note 14)\n8,000.6\n \n5,477.3\n \nProperty and equipment, net (Note 9)\n17,102.4\n \n12,913.6\n \nOther noncurrent assets\n5,719.7\n \n4,989.9\n \nTotal assets\n$\n78,714.9\n \n$\n64,006.3\n \nLiabilities and Equity\nCurrent Liabilities\nShort-term borrowings and current maturities of long-term debt (Note 11)\n$\n5,117.1\n \n$\n6,904.5\n \nAccounts payable\n3,228.6\n \n2,598.8\n \nEmployee compensation\n2,093.9\n \n1,650.4\n \nSales rebates and discounts\n11,539.3\n \n11,689.0\n \nDividends payable\n1,346.3\n \n1,169.2\n \nOther current liabilities\n5,051.4\n \n3,281.3\n \nTotal current liabilities\n28,376.6\n \n27,293.2\n \nNoncurrent Liabilities\nLong-term debt (Note 11)\n28,527.1\n \n18,320.8\n \nAccrued retirement benefits (Note 15)\n1,300.5\n \n1,438.8\n \nLong-term income taxes payable (Note 14)\n4,060.9\n \n3,849.2\n \nOther noncurrent liabilities\n2,178.2\n \n2,240.6\n \nTotal noncurrent liabilities\n36,066.7\n \n25,849.4\n \nCommitments and Contingencies (Note 16)\nEli Lilly and Company Shareholders' Equity (Notes 12 and 13)\nCommon stock—no par value\nAuthorized shares: \n3,200,000\nIssued shares: \n947,903\n (2024)\n and \n949,781\n (2023)\n592.4\n \n593.6\n \nAdditional paid-in capital\n7,439.3\n \n7,250.4\n \nRetained earnings\n13,545.0\n \n10,312.3\n \nEmployee benefit trust\n(\n3,013.2\n)\n(\n3,013.2\n)\nAccumulated other comprehensive loss (Note 17)\n(\n4,321.9\n)\n(\n4,327.0\n)\nCost of common stock in treasury\n(\n49.5\n)\n(\n44.2\n)\nTotal Eli Lilly and Company shareholders' equity\n14,192.1\n \n10,771.9\n \nNoncontrolling interests\n79.5\n \n91.8\n \nTotal equity\n14,271.6\n \n10,863.7\n \nTotal liabilities and equity\n$\n78,714.9\n \n$\n64,006.3\n \nSee notes to consolidated financial statements.\n60\nConsolidated Statements of Shareholders' Equity\nELI LILLY AND COMPANY AND SUBSIDIARIES\nEquity of Eli Lilly and Company Shareholders\n(Dollars in millions, except per-share data, and shares in thousands)\nCommon Stock\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nEmployee Benefit Trust\nAccumulated Other Comprehensive Loss\nCommon Stock in Treasury\nNoncontrolling Interest\nShares\nAmount\nShares\nAmount\nBalance at January 1, 2022\n954,116\n \n$\n596.3\n \n$\n6,833.4\n \n$\n8,958.5\n \n$\n(\n3,013.2\n)\n$\n(\n4,343.1\n)\n463\n \n$\n(\n52.7\n)\n$\n175.6\n \nNet income (loss)\n6,244.8\n \n(\n20.9\n)\nOther comprehensive income, net of tax\n498.5\n \nCash dividends declared per share: $\n4.07\n(\n3,667.5\n)\nRetirement of treasury shares\n(\n5,607\n)\n(\n3.5\n)\n(\n1,496.5\n)\n(\n5,607\n)\n1,500.0\n \nPurchase of treasury shares\n5,607\n \n(\n1,500.0\n)\nIssuance of stock under employee stock plans, net\n2,123\n \n1.3\n \n(\n283.1\n)\n(\n13\n)\n2.2\n \nStock-based compensation\n371.1\n \nOther\n3.3\n \n(\n29.1\n)\nBalance at December 31, 2022\n950,632\n \n594.1\n \n6,921.4\n \n10,042.6\n \n(\n3,013.2\n)\n(\n3,844.6\n)\n450\n \n(\n50.5\n)\n125.6\n \nNet income\n5,240.4\n \n11.0\n \nOther comprehensive loss, net of tax\n(\n482.4\n)\nCash dividends declared per share: $\n4.69\n(\n4,221.3\n)\nRetirement of treasury shares\n(\n2,299\n)\n(\n1.4\n)\n(\n748.6\n)\n(\n2,299\n)\n750.0\n \nPurchase of treasury shares\n2,299\n \n(\n750.0\n)\nIssuance of stock under employee stock plans, net\n1,448\n \n0.9\n \n(\n299.5\n)\n(\n48\n)\n8.8\n \nStock-based compensation\n628.5\n \nOther\n(\n0.8\n)\n(\n2.5\n)\n(\n44.8\n)\nBalance at December 31, 2023\n949,781\n \n593.6\n \n7,250.4\n \n10,312.3\n \n(\n3,013.2\n)\n(\n4,327.0\n)\n402\n \n(\n44.2\n)\n91.8\n \nNet income (loss)\n10,590.0\n \n(\n6.0\n)\nOther comprehensive income, net of tax\n5.1\n \nCash dividends declared per share: $\n5.40\n(\n4,857.5\n)\nRetirement of treasury shares\n(\n2,964\n)\n(\n1.8\n)\n(\n2,498.2\n)\n(\n2,964\n)\n2,500.0\n \nPurchase of treasury shares\n2,964\n \n(\n2,500.0\n)\nIssuance of stock under employee stock plans, net\n1,086\n \n0.6\n \n(\n456.7\n)\n(\n37\n)\n11.5\n \nStock-based compensation\n645.6\n \nOther\n(\n1.6\n)\n(\n16.8\n)\n(\n6.3\n)\nBalance at December 31, 2024\n947,903\n \n$\n592.4\n \n$\n7,439.3\n \n$\n13,545.0\n \n$\n(\n3,013.2\n)\n$\n(\n4,321.9\n)\n365\n \n$\n(\n49.5\n)\n$\n79.5\n \nSee notes to consolidated financial statements.\n61\nConsolidated Statements of Cash Flows\nELI LILLY AND COMPANY AND SUBSIDIARIES\n(Dollars in millions)\nYear Ended December 31,\n2024\n2023\n2022\nCash Flows from Operating Activities\nNet income\n$\n10,590.0\n \n$\n5,240.4\n \n$\n6,244.8\n \nAdjustments to Reconcile Net Income to Cash Flows from Operating Activities:\nDepreciation and amortization\n1,766.6\n \n1,527.3\n \n1,522.5\n \nChange in deferred income taxes\n(\n2,683.1\n)\n(\n2,341.0\n)\n(\n2,185.2\n)\nStock-based compensation expense\n645.6\n \n628.5\n \n371.1\n \n Investment (gains) losses, net\n49.8\n \n23.5\n \n420.0\n \nGains on sale of product rights\n(\n223.8\n)\n(\n1,878.9\n)\n(\n156.5\n)\nAcquired in-process research and development\n3,280.4\n \n3,799.8\n \n908.5\n \nOther operating activities, net\n777.4\n \n295.5\n \n461.3\n \nOther changes in operating assets and liabilities, net of acquisitions and divestitures:\nReceivables—(increase) decrease\n(\n2,155.2\n)\n(\n2,451.0\n)\n(\n299.6\n)\nInventories—(increase) decrease\n(\n2,507.4\n)\n(\n1,425.0\n)\n(\n599.7\n)\nPrepaid expenses and other assets—(increase) decrease\n(\n3,331.2\n)\n(\n3,453.4\n)\n(\n793.5\n)\nAccounts payable and other liabilities—increase (decrease)\n2,608.8\n \n4,274.4\n \n1,692.0\n \nNet Cash Provided by Operating Activities\n8,817.9\n \n4,240.1\n \n7,585.7\n \nCash Flows from Investing Activities\nPurchases of property and equipment\n(\n5,057.8\n)\n(\n3,447.6\n)\n(\n1,854.3\n)\nProceeds from sales and maturities of short-term investments\n148.9\n \n192.2\n \n121.4\n \nPurchases of short-term investments\n(\n98.5\n)\n(\n98.2\n)\n(\n107.4\n)\nProceeds from sales of and distributions from noncurrent investments\n373.6\n \n508.1\n \n342.2\n \nPurchases of noncurrent investments\n(\n677.3\n)\n(\n730.8\n)\n(\n600.2\n)\nProceeds from sale of product rights\n601.3\n \n1,604.3\n \n95.8\n \nPurchases of in-process research and development\n(\n3,345.8\n)\n(\n3,944.5\n)\n(\n1,131.0\n)\nCash paid for acquisitions, net of cash acquired\n(\n947.7\n)\n(\n1,044.3\n)\n(\n327.2\n)\nOther investing activities, net\n(\n298.2\n)\n(\n191.9\n)\n(\n302.2\n)\nNet Cash Used for Investing Activities\n(\n9,301.5\n)\n(\n7,152.7\n)\n(\n3,762.9\n)\nCash Flows from Financing Activities\nDividends paid\n(\n4,680.4\n)\n(\n4,069.3\n)\n(\n3,535.8\n)\nNet change in short-term borrowings\n(\n1,851.8\n)\n4,691.4\n \n1,498.0\n \nProceeds from issuance of long-term debt\n11,417.1\n \n3,958.5\n \n—\n \nRepayments of long-term debt\n(\n664.2\n)\n—\n \n(\n1,560.0\n)\nPurchases of common stock\n(\n2,500.0\n)\n(\n750.0\n)\n(\n1,500.0\n)\nOther financing activities, net\n(\n490.6\n)\n(\n335.0\n)\n(\n308.9\n)\nNet Cash Provided by (Used for) Financing Activities\n1,230.1\n \n3,495.6\n \n(\n5,406.7\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n296.7\n)\n168.6\n \n(\n167.6\n)\nNet increase (decrease) in cash and cash equivalents\n449.8\n \n751.6\n \n(\n1,751.5\n)\nCash and cash equivalents at beginning of year\n2,818.6\n \n2,067.0\n \n3,818.5\n \nCash and Cash Equivalents at End of Year\n$\n3,268.4\n \n$\n2,818.6\n \n$\n2,067.0\n \nSee notes to consolidated financial statements.\n62\nNotes to Consolidated Financial Statements\nELI LILLY AND COMPANY AND SUBSIDIARIES\n(Tables present dollars in millions)\nNote 1: \nSummary of Significant Accounting Policies and Implementation of New Financial Accounting Standards\nBasis of Presentation\nThe accompanying consolidated financial statements include Eli Lilly and Company and all subsidiaries and have been prepared in accordance with accounting principles generally accepted in the United States (GAAP). We consider majority voting interests, as well as effective economic or other control over an entity when deciding whether or not to consolidate an entity. We generally do not have control by means other than voting interests. Where our ownership of consolidated subsidiaries is less than 100 percent, the noncontrolling shareholders' interests are reflected as a separate component of equity. All intercompany balances and transactions have been eliminated.\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures at the date of the financial statements and during the reporting period. Actual results could differ from those estimates. We issued our financial statements by filing with the Securities and Exchange Commission (SEC) and have evaluated subsequent events up to the time of the filing of this Annual Report on Form 10-K.\nWe operate as a single operating segment engaged in the discovery, development, manufacturing, marketing, and sales of pharmaceutical products worldwide. A global research and development organization and a supply chain organization are responsible for the discovery, development, manufacturing, and supply of our products. Our commercial organizations market, distribute, and sell the products. The business is also supported by global corporate staff functions. See Note 19 for additional information.\nResearch and Development Expenses and Acquired In-Process Research and Development (IPR&D)\nResearch and development costs are expensed as incurred. Research and development costs consist of expenses incurred in performing research and development activities, including but not limited to, compensation and benefits, facilities and overhead expense, clinical trial expense and fees paid to contract research organizations.\nAcquired IPR&D includes the initial costs and development milestones incurred related to externally developed IPR&D projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use. Development milestones are milestone payment obligations that are incurred prior to regulatory approval of the compound and are expensed when the event triggering an obligation to pay the milestone occurs.\nEarnings Per Share (EPS)\nAll per-share amounts, unless otherwise stated in the notes to the consolidated financial statements, are presented on a diluted basis. We calculate basic EPS based on the weighted-average number of common shares outstanding plus the effect of incremental shares from potential participating securities. We calculate diluted EPS based on the weighted-average number of common shares outstanding plus the effect of incremental shares from our stock-based compensation programs.\n \nForeign Currency Translation\nOperations in our subsidiaries outside the United States (U.S.) are recorded in the functional currency of each subsidiary which is determined by a review of the environment where each subsidiary primarily generates and expends cash. The results of operations for our subsidiaries outside the U.S. are translated from functional currencies into U.S. dollars using the weighted-average currency rate for the period. Assets and liabilities are translated using the period end exchange rates. The U.S. dollar effects that arise from translating the net assets of these subsidiaries are recorded in other comprehensive income (loss).\n63\nAdvertising Expenses\nCosts associated with advertising are expensed as incurred and are included in marketing, selling, and administrative expenses.\n Global advertising expenses, comprised primarily of online marketing and television advertising, totaled $\n1.44\n billion, $\n1.12\n billion, and $\n966.8\n million in 2024, 2023, and 2022, respectively, which were less than \n5\n percent of revenue each year.\nOther Significant Accounting Policies\nOur other significant accounting policies are described in the remaining appropriate notes to the consolidated financial statements.\nReclassifications\nCertain reclassifications have been made to prior periods in the consolidated financial statements and accompanying notes to conform with the current presentation.\n \nImplementation of New Financial Accounting Standards\nEffective January 1, 2024, we adopted Accounting Standards Update (ASU) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, \nwhich requires disclosures about significant segment expenses and additional interim disclosure requirements. This standard also requires a single reportable segment company to provide all disclosures required by Topic 280. See Note 19 for the segment disclosures as required by Topic 280, as amended by ASU 2023-07.\nASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, establishes incremental disaggregation of income tax disclosures pertaining to the effective tax rate reconciliation and income taxes paid. This standard is effective for fiscal years beginning after December 15, 2024, and requires prospective application with the option to apply it retrospectively. We intend to adopt this standard in our Annual Report on Form 10-K for the year ending December 31, 2025. We are currently evaluating the potential impact of adopting this standard on our disclosures.\nASU 2024-03, \nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses,\n requires disaggregation of specific expense categories in the notes to the financial statements and a qualitative description of the remaining expense amounts not separately disaggregated. This standard is effective for annual reporting periods beginning after December 15, 2026, and requires prospective application with the option to apply it retrospectively. We intend to adopt this standard in our Annual Report on Form 10-K for the year ending December 31, 2027. We are currently evaluating the potential impact of adopting this standard on our disclosures.\nNote 2: \nRevenue\nThe following table summarizes our revenue recognized in our consolidated statements of operations:\n2024\n2023\n2022\nNet product revenue\n$\n40,747.9\n \n$\n28,813.9\n \n$\n25,462.8\n \nCollaboration and other revenue\n4,294.8\n \n5,310.2\n \n3,078.6\n \nRevenue\n$\n45,042.7\n \n$\n34,124.1\n \n$\n28,541.4\n \nWe recognize revenue primarily from two different types of contracts, product sales to customers (net product revenue) and collaborations and other arrangements. Revenue recognized from collaborations and other arrangements includes our share of profits from the collaborations, as well as royalties, upfront and milestone payments we receive under these types of contracts. See Note 4 for additional information related to our collaborations and other arrangements. Collaboration and other revenue disclosed above includes the revenue resulting from our collaboration with Boehringer Ingelheim, as well as from the 2023 sales of rights for the olanzapine portfolio, including Zyprexa, and for Baqsimi, all of which are discussed in Note 4. Substantially all of the remainder of collaboration and other revenue is related to contracts accounted for as contracts with customers. Collaboration and other revenue associated with intellectual property licensed in prior periods was not material for the years ended December 31, 2024, 2023, and 2022.\n64\nNet Product Revenue\nRevenue from sales of products is recognized at the point where the customer obtains control of the goods and we satisfy our performance obligation, which generally is at the time we ship the product to the customer. Payment terms differ by jurisdiction and customer, but payment terms in most of our major jurisdictions typically range from \n30\n to \n70\n days from date of shipment. Revenue for our product sales has not been adjusted for the effects of a financing component as we expect, at contract inception, that the period between when we transfer control of the product and when we receive payment will be \none year\n or less. Any exceptions are either not material or we collect interest for payments made after the due date. Provisions for rebates, discounts, and returns are established in the same period the related product sales are recognized. We generally ship product shortly after orders are received; therefore, we generally only have a few days of orders received but not yet shipped at the end of any reporting period. Shipping and handling activities are considered to be fulfillment activities and are not considered to be a separate performance obligation. We exclude from the measurement of the transaction price all taxes assessed by a governmental authority that are imposed on our sales of product and collected from a customer.\nMost of our products are sold to wholesalers that serve pharmacies, physicians and other healthcare professionals, and hospitals. For the years ended December 31, 2024, 2023, and 2022, our three largest wholesalers each accounted for between \n16\n percent and \n24\n percent of consolidated revenue. Further, they each accounted for between \n21\n percent and \n29\n percent of accounts receivable as of December 31, 2024 and 2023. \nSignificant judgments must be made in determining the transaction price for our sales of products related to anticipated rebates, discounts, and returns. The following describe the most significant of these judgments:\nSales Rebates and Discounts - Background and Uncertainties\n•\nWe initially invoice our customers at contractual list prices. Contracts with direct and indirect customers may provide for various rebates and discounts that may differ in each contract. As a consequence, to determine the appropriate transaction price for our product sales at the time we recognize a sale to a direct customer, we estimate any rebates or discounts that ultimately will be due to the direct customer and other customers in the distribution chain under the terms of our contracts. Significant judgments are required in making these estimates.\n•\nThe rebate and discount amounts are recorded as a deduction to arrive at our net product revenue. Sales rebates and discounts that require the use of judgment in the establishment of the accrual include managed care, Medicare, Medicaid, chargebacks, long-term care, hospital, patient assistance programs, and various other programs. We estimate these accruals using an expected value approach.\n•\nThe largest of our sales rebate and discount amounts include rebates associated with sales covered by managed care, Medicare, Medicaid, and chargeback programs, as well as reductions in revenue related to our patient assistance programs, in the U.S. In determining the appropriate accrual amount, we consider our historical rebate payments for these programs, as well as patient assistance program costs, by product as a percentage of our historical sales as well as any significant changes in sales trends (e.g., patent expiries and product launches), an evaluation of the current contracts for these programs, the percentage of our products that are sold via these programs, and our product pricing. Although we accrue a liability for revenue reductions related to these programs at the time we record the sale, the reduction related to that sale is typically paid up to \nsix months\n later. Because of this time lag, in any particular period our net product revenue may incorporate revisions of accruals for several periods.\n•\nMost of our rebates outside the U.S. are contractual or legislatively mandated and are estimated and recognized in the same period as the related sales. In some large European countries, government rebates are based on the anticipated budget for pharmaceutical payments in the country. An estimate of these rebates, updated as governmental authorities revise budgeted deficits, is recognized in the same period as the related sale.\n65\nSales Returns - Background and Uncertainties\n•\nWhen product sales occur, to determine the appropriate transaction price for our sales, we estimate a reserve for future product returns related to those sales using an expected value approach. This estimate is based on several factors, including: historical return rates, expiration date by product (on average, approximately \n24\n months after the initial sale of a product to our customer), and estimated levels of inventory in the wholesale and retail channels, as well as any other specifically identified anticipated returns due to known factors such as the loss of patent exclusivity, product recalls and discontinuations, or a changing competitive environment. We maintain a returns policy that allows most U.S. customers to return most of our products for dating issues within a specified period prior to and subsequent to the product's expiration date. Following the loss of exclusivity for a patent-dependent product, we expect to experience an elevated level of product returns as product inventory remaining in the wholesale and retail channels expires. Adjustments to the returns reserve have been and may in the future be required based on revised estimates to our assumptions. We record the return amounts as a deduction to arrive at our net product revenue. Once the product is returned, it is destroyed; we do not record a right of return asset. Our returns policies outside the U.S. are generally more restrictive than in the U.S. as returns are not allowed for reasons other than failure to meet product specifications in many countries. Our reserve for future product returns for product sales outside the U.S. is not material.\n•\nAs a part of our process to estimate a reserve for product returns, we regularly review the supply levels of our significant products at the major wholesalers in the U.S. and in major markets outside the U.S., primarily by reviewing periodic inventory reports supplied by our major wholesalers and available prescription volume information for our products, or alternative approaches. We attempt to maintain U.S. wholesaler inventory levels at an average of approximately \none month\n or less. Causes of unusual wholesaler buying patterns include actual or anticipated product-supply issues, weather patterns, anticipated changes in the transportation network, redundant holiday stocking, and changes in wholesaler business operations. In the U.S., the current structure of our arrangements provides us with data on inventory levels at our wholesalers; however, our data on inventory levels in the retail channel is more limited. Wholesaler stocking and destocking activity historically has not caused any material changes in the rate of actual product returns.\n•\nActual U.S. product returns have been less than \n1\n percent of our U.S. revenue during each of the past three years and have not fluctuated significantly as a percentage of revenue, although fluctuations are more likely in periods following loss of patent exclusivity for major products in the U.S. market. \nAdjustments to Revenue\nAdjustments to revenue recognized as a result of changes in estimates for our most significant U.S. sales returns, rebates, and discounts liability balances for products shipped in previous periods were less than \n3\n percent of U.S. revenue during the year ended December 31, 2024, and less than \n1\n percent of U.S. revenue during each of the years ended December 31, 2023 and 2022.\nCollaboration and Other Arrangements\nWe recognize several types of revenue from our collaborations and other arrangements, which we discuss in general terms immediately below and more specifically in Note 4 for each of our significant collaborations and other arrangements. Our collaborations and other arrangements are evaluated to determine if the arrangements in their entirety, or contain aspects that, are contracts with customers. \n•\nRevenue related to products we sell pursuant to these arrangements is included in net product revenue at the earlier of when control of the asset transfers to the other party or when the product has no alternative use to us and we have right to payment. \n•\nProfit-sharing due from our collaboration partners, which is based upon gross margins reported to us by our partners, is recognized as collaboration and other revenue as earned.\n•\nRoyalty revenue from licensees and certain of our collaboration partners, which is based on sales to third parties of licensed products and technology, is recorded when the third-party sale occurs and the performance obligation to which some or all of the royalty has been allocated has been satisfied (or partially satisfied). This royalty revenue is included in collaboration and other revenue.\n66\n•\nThe net gain or loss related to the sale of rights of a product is included in collaboration and other revenue when control of the asset transfers to the other party.\n•\nFor arrangements that involve variable consideration where we have sold intellectual property, we recognize revenue based on estimates of the amount of consideration we believe we will be entitled to receive from the other party, but only to the extent a significant reversal in the amount of revenue recognized is not probable of occurring when the uncertainties associated with the variable consideration are subsequently resolved. These estimates are adjusted to reflect the actual amounts to be collected when those facts and circumstances become known. Significant judgments must be made in determining the transaction price for our sales of intellectual property. Because of the risk that products in development will not receive regulatory approval, we generally do not recognize any contingent payments that would be due to us upon or after regulatory approval. \n•\nFor arrangements involving multiple goods or services (e.g., research and development, marketing and selling, manufacturing, and distribution), each required good or service is evaluated to determine whether it is distinct. If a good or service does not qualify as distinct, it is combined with the other non-distinct goods or services within the arrangement and these combined goods or services are treated as a single performance obligation for accounting purposes. The arrangement's transaction price is then allocated to each performance obligation based on the relative standalone selling price of each performance obligation. \nContract Liabilities\nOur contract liabilities result from arrangements where we have received payment in advance of performance under the contract and do not include sales returns, rebates, and discounts. Changes in contract liabilities are generally due to either receipt of additional advance payments or our performance under the contract. \nThe following table summarizes contract liability balances at December 31:\n \n2024\n2023\nContract liabilities\n$\n166.3\n \n$\n193.6\n \nThe contract liabilities balances disclosed above as of December 31, 2024 and 2023 were primarily related to the remaining license period of symbolic intellectual property and obligations to supply product for a defined period of time.\nDuring the years ended December 31, 2024, 2023, and 2022, revenue recognized from contract liabilities as of the beginning of the respective year was not material. Revenue expected to be recognized in the future from contract liabilities as the related performance obligations are satisfied is not expected to be material in any one year.\n67\nDisaggregation of Revenue \nThe following table summarizes revenue, including net product revenue and collaboration and other revenue, by product:\nU.S.\nOutside U.S.\n2024\n2023\n2022\n2024\n2023\n2022\nCardiometabolic Health:\nMounjaro\n$\n8,949.9\n \n$\n4,834.2\n \n$\n366.6\n \n$\n2,590.2\n \n$\n328.9\n \n$\n115.9\n \nTrulicity\n3,693.8\n \n5,433.3\n \n5,688.8\n \n1,559.7\n \n1,699.2\n \n1,750.9\n \nZepbound\n4,925.7\n \n175.8\n \n—\n \n—\n \n—\n \n—\n \nJardiance\n(1)\n1,597.5\n \n1,600.4\n \n1,194.5\n \n1,743.4\n \n1,144.2\n \n871.5\n \nHumalog\n(2)\n1,502.6\n \n863.2\n \n1,191.9\n \n822.2\n \n800.2\n \n868.7\n \nHumulin\n643.4\n \n610.1\n \n730.2\n \n273.7\n \n242.0\n \n289.2\n \nBasaglar\n(3)\n375.4\n \n443.1\n \n470.7\n \n301.5\n \n285.2\n \n289.7\n \nBaqsimi\n2.5\n \n645.7\n \n110.4\n \n26.7\n \n31.9\n \n28.9\n \nOther cardiometabolic health\n159.6\n \n175.0\n \n158.0\n \n353.1\n \n355.2\n \n338.9\n \nTotal cardiometabolic health\n21,850.4\n \n14,780.8\n \n9,911.1\n \n7,670.5\n \n4,886.8\n \n4,553.7\n \nOncology:\nVerzenio\n3,420.6\n \n2,509.0\n \n1,653.2\n \n1,886.0\n \n1,354.3\n \n830.3\n \nCyramza\n442.2\n \n402.3\n \n351.4\n \n531.0\n \n572.4\n \n620.0\n \nErbitux\n562.1\n \n528.9\n \n500.1\n \n65.3\n \n67.6\n \n66.4\n \nTyvyt\n—\n \n—\n \n—\n \n526.0\n \n393.4\n \n293.3\n \nOther oncology\n610.9\n \n356.8\n \n713.4\n \n708.3\n \n473.6\n \n638.1\n \nTotal oncology\n5,035.8\n \n3,797.0\n \n3,218.1\n \n3,716.6\n \n2,861.3\n \n2,448.1\n \nImmunology:\nTaltz\n2,152.3\n \n1,831.6\n \n1,724.6\n \n1,108.1\n \n928.0\n \n757.4\n \nOlumiant\n(4)\n228.7\n \n225.5\n \n148.2\n \n728.7\n \n697.2\n \n682.3\n \nOther immunology\n76.6\n \n0.8\n \n20.0\n \n98.5\n \n114.4\n \n12.1\n \nTotal immunology\n2,457.6\n \n2,057.9\n \n1,892.8\n \n1,935.3\n \n1,739.6\n \n1,451.8\n \nNeuroscience:\nEmgality\n559.7\n \n482.2\n \n462.8\n \n310.7\n \n196.0\n \n188.1\n \nZyprexa\n(5)\n2.0\n \n79.4\n \n30.4\n \n114.3\n \n1,615.4\n \n306.5\n \nOther neuroscience\n218.2\n \n134.4\n \n119.2\n \n268.5\n \n371.1\n \n439.2\n \nTotal neuroscience\n779.9\n \n696.0\n \n612.4\n \n693.5\n \n2,182.5\n \n933.8\n \nOther:\nCOVID-19 antibodies\n(6)\n—\n \n—\n \n2,008.9\n \n—\n \n—\n \n14.7\n \nOther\n251.4\n \n459.3\n \n546.8\n \n651.6\n \n662.9\n \n949.3\n \nTotal other\n251.4\n \n459.3\n \n2,555.7\n \n651.6\n \n662.9\n \n964.0\n \nRevenue\n$\n30,375.2\n \n$\n21,791.0\n \n$\n18,190.0\n \n$\n14,667.5\n \n$\n12,333.1\n \n$\n10,351.3\n \nNumbers may not add due to rounding.\n(1) \nJardiance revenue includes Glyxambi,\n \nSynjardy,\n \nand Trijardy XR. \n(2) \nHumalog revenue includes insulin lispro. \n(3) \nBasaglar revenue includes Rezvoglar.\n(4) \nOlumiant revenue includes sales for baricitinib that were made pursuant to Emergency Use Authorization (EUA) or similar regulatory authorizations.\n(5) \nZyprexa revenue includes sale of rights for the olanzapine portfolio in July 2023.\n(6) \nCOVID-19 antibodies include sales for bamlanivimab administered alone, for bamlanivimab and etesevimab administered together, and for bebtelovimab and were made pursuant to EUAs or similar regulatory authorizations.\n68\nThe following table summarizes revenue by geographical area:\n2024\n2023\n2022\nRevenue\n(1)\n:\nU.S.\n$\n30,375.2\n \n$\n21,791.0\n \n$\n18,190.0\n \nEurope\n6,920.7\n \n6,174.7\n \n4,299.2\n \nJapan\n1,814.9\n \n1,672.6\n \n1,747.3\n \nChina\n1,660.4\n \n1,539.7\n \n1,452.8\n \nRest of world\n4,271.4\n \n2,946.2\n \n2,852.0\n \nRevenue\n$\n45,042.7\n \n$\n34,124.1\n \n$\n28,541.4\n \nNumbers may not add due to rounding.\n(1) \nRevenue is attributed to the countries based on the location of the customer or other party\n.\nNote 3: \nAcquisitions\nWe engage in various forms of business development activities to enhance or refine our product pipeline, including acquisitions, collaborations, investments, and licensing arrangements. In connection with these arrangements, our partners may be entitled to future royalties and/or commercial milestones based on sales should products be approved for commercialization and/or milestones based on the successful progress of compounds through the development process. We account for each arrangement as either a business combination or an asset acquisition in accordance with GAAP.\nBusiness Combinations\nWhen an acquisition met the definition of a business under GAAP, the assets acquired and liabilities assumed were recorded at their respective fair values as of the acquisition date in our consolidated financial statements. The determination of estimated fair value required management to make significant estimates and assumptions. The excess of the purchase price over the fair value of the acquired net assets was recorded as goodwill. The results of operations of the acquisition are included in our consolidated financial statements from the date of acquisition.\nManufacturing Facility Acquisition\nOverview of Transaction\nIn May 2024, we acquired all outstanding membership interests of NexPharm Parent HoldCo, LLC and Isopro Holdings, LLC, which together own the assets of a manufacturing site in Wisconsin, for a purchase price of $\n924.7\n million, net of cash acquired. The facility is intended to further expand our global parenteral (injectable) product manufacturing network. \n69\nAssets Acquired and Liabilities Assumed\nThe following table summarizes the amounts recognized for assets acquired and liabilities assumed as of the acquisition date:\nEstimated Fair Value at May 23, 2024\nCash\n$\n2.3\n \nGoodwill\n(1)\n816.5\n \nProperty and equipment\n108.5\n \nOther assets and liabilities, net\n(\n0.3\n)\nAcquisition date fair value of consideration transferred \n927.0\n \nLess: \nCash acquired\n(\n2.3\n)\nCash paid, net of cash acquired\n$\n924.7\n \n(1) \nThe goodwill recognized from this acquisition is primarily attributable to the synergies between the manufacturing capabilities of the site and our products as well as the assembled workforce of the site, which is deductible for tax purposes.\nThe results of operations attributable to this acquisition for the year ended December 31, 2024 were not material.\nPro forma information has not been included as this acquisition did not have a material impact on our consolidated statements of operations for the year ended December 31, 2024.\nPOINT Acquisition\nOverview of Transaction\nIn December 2023, we acquired all shares of POINT Biopharma Global Inc. (POINT) for a purchase price of $\n12.50\n per share in cash (or an aggregate of $\n1.04\n billion, net of cash acquired). POINT has capabilities in radiopharmaceutical discovery, development, and manufacturing efforts, as well as clinical and pre-clinical radioligand therapies in development for the treatment of cancer. \nAssets Acquired and Liabilities Assumed\nThe following table summarizes the amounts recognized for assets acquired and liabilities assumed as of the acquisition date:\nEstimated Fair Value at December 27, 2023\nCash\n$\n302.7\n \nAcquired IPR&D\n196.0\nGoodwill\n(1)\n853.9\nOther assets and liabilities, net\n(\n14.3\n)\nAcquisition date fair value of consideration transferred \n1,338.5\n \nLess: \nCash acquired\n(\n302.7\n)\nCash paid, net of cash acquired\n$\n1,035.8\n \n(1) \nThe goodwill recognized from this acquisition is primarily attributable to the radiopharmaceutical discovery, development, and manufacturing capabilities and the assembled workforce for POINT, which is not deductible for tax purposes.\nThe results of operations attributable to POINT for the years ended December 31, 2024 and 2023 were not material.\nPro forma information has not been included as this acquisition did not have a material impact on our consolidated statements of operations for the year ended December 31, 2023.\n70\nAkouos Acquisition\nOverview of Transaction\nIn December 2022, we acquired all shares of Akouos, Inc. (Akouos) for a purchase price that included $\n12.50\n per share in cash (or an aggregate of $\n327.2\n million, net of cash acquired) plus \none\n non-tradable contingent value right (CVR) per share. The CVR entitles the Akouos shareholders up to an additional $\n3.00\n per share in cash (or an aggregate of approximately $\n122\n million) payable, subject to certain terms and conditions, upon the achievement of certain specified milestones prior to December 2028.\nUnder the terms of the agreement, we acquired potential gene therapy treatments for hearing loss and other inner ear conditions. The lead gene therapies in clinical development that we acquired included GJB2 (which encodes connexin 26) for a common form of monogenic deafness and hearing loss; AK-OTOF for hearing loss due to mutations in the otoferlin gene; AK-CLRN1 for Usher Type 3A, an autosomal recessive disorder characterized by progressive loss of both hearing and vision; and AK-antiVEGF for vestibular schwannoma.\nAssets Acquired and Liabilities Assumed\nThe following table summarizes the amounts recognized for assets acquired and liabilities assumed as of the acquisition date:\nEstimated Fair Value at December 1, 2022\nCash\n$\n153.2\n \nAcquired IPR&D\n(1)\n184.0\nGoodwill\n(2)\n185.6\nOther assets and liabilities, net\n24.5\n \nAcquisition date fair value of consideration transferred \n547.3\nLess: \nCash acquired\n(\n153.2\n)\nFair value of CVR liability\n(3)\n(\n66.9\n)\nCash paid, net of cash acquired\n$\n327.2\n \n(1) \nAcquired IPR&D intangibles primarily relate to GJB2.\n(2) \nThe goodwill recognized from this acquisition is primarily attributable to future unidentified projects and products and the assembled workforce for Akouos and is not deductible for tax purposes. \n(3) \nSee Note 7 for a discussion on the estimation of the CVR liability.\n \nThe results of operations attributable to Akouos for the years ended December 31, 2024, 2023 and 2022 were not material.\nPro forma information has not been included as this acquisition did not have a material impact on our consolidated statements of operations for the year ended December 31, 2022.\n71\nAsset Acquisitions\nUpon each asset acquisition, the cost allocated to acquired IPR&D was immediately expensed as acquired IPR&D if the compound has no alternative future use. Milestone payment obligations incurred prior to regulatory approval of the compound were expensed when the event triggering an obligation to pay the milestone occurred. We recognized acquired IPR&D charges of $\n3.28\n billion, $\n3.80\n billion, and $\n908.5\n million for the years ended December 31, 2024, 2023, and 2022, respectively. \nThe following table summarizes our significant asset acquisitions during 2024, 2023, and 2022.\nCounterparty\nCompound, Therapy, or Asset\nAcquisition Month\nPhase of Development\n(1)\nAcquired IPR&D Charge\nMorphic Holding, Inc. (Morphic)\nMORF-057, inhibitor of α4β7 integrin for the treatment of inflammatory bowel disease\nAugust 2024\nPhase 2\n$\n2,548.5\n \nMablink Biosciences SAS\nMBK-103, a folate receptor alpha antibody drug conjugate for the treatment of ovarian cancer\nDecember 2023\nPre-clinical\n256.6\n \nBeam Therapeutics Inc.\nOpt-in right for programs targeting PCSK9, ANGPTL3 and an undisclosed liver-mediated, cardiovascular target\nOctober 2023\nPhase 1\n216.3\n \nDICE Therapeutics, Inc. (DICE)\nDC-806, an oral IL-17 inhibitor for the treatment of chronic diseases in immunology\n(2)\nAugust 2023\nPhase 2\n1,915.5\n \nVersanis Bio, Inc. (Versanis)\nBimagrumab, a monoclonal antibody for the treatment of people living with obesity and obesity-related complications\nAugust 2023\nPhase 2\n604.1\n \nEmergence Therapeutics AG (Emergence)\nETx-22, a Nectin-4 antibody-drug conjugate for the treatment of urothelial cancer\nAugust 2023\nPre-clinical\n406.5\n \nBioMarin Pharmaceutical Inc.\nPriority Review Voucher\nFebruary 2022\nNot applicable\n110.0\n \n(1) \nThe phase of development presented is as of the date of the arrangement and represents the phase of development of the most advanced asset acquired, where applicable.\n(2) \nIn 2024, we discontinued development of this molecule in favor of another molecule in development.\nIn connection with our acquisition of Petra Pharma Corporation (Petra) in 2020, we were required to make milestone payments to Petra shareholders contingent upon the occurrence of certain future events linked to the success of the mutant-selective PI3Kα inhibitor. In 2022, we entered into agreements with substantially all Petra shareholders to acquire their rights to receive any future milestone payments in exchange for a one-time payment. As a result of these agreements, we recognized a charge of $\n333.8\n million as acquired IPR&D in 2022. Any remaining contingent milestones payments linked to the success of the mutant-selective PI3Kα inhibitor are not expected to be material. \nWe recognized no other significant acquired IPR&D charges during the years ended December 31, 2024, 2023, and 2022.\n \n72\nNote 4: \nCollaborations and Other Arrangements\nWe often enter into collaborative and other arrangements to develop and commercialize drug candidates or to sell the rights of a product. See Note 2 for a discussion of our recognition of revenue from our collaborations and other arrangements. \nCollaborative activities may include research and development, marketing and selling, manufacturing, and distribution for which we may receive from or pay to the collaboration partner expense reimbursements. Operating expenses for costs incurred pursuant to these arrangements are reported in their respective expense line item, net of any payments due to or reimbursements due from our collaboration partners, with such reimbursements being recognized at the time the party becomes obligated to pay. Each arrangement is unique in nature, and our more significant arrangements are discussed below.\nBoehringer Ingelheim Collaboration\nWe and Boehringer Ingelheim have a global agreement to jointly develop and commercialize a portfolio of compounds. Significant product families included in the collaboration are Boehringer Ingelheim's Jardiance product family and our Basaglar product family. Glyxambi, Synjardy, and Trijardy XR are included in the Jardiance product family. Rezvoglar is included in the Basaglar product family.\nFor the Jardiance product family, we and Boehringer Ingelheim generally share equally the ongoing development and commercialization costs in the most significant markets, and we record our portion of the development and commercialization costs as research and development expense and marketing, selling, and administrative expense, respectively. We receive a royalty on net sales of the Jardiance product family in the most significant markets and recognize the royalty as collaboration and other revenue. Boehringer Ingelheim is entitled to potential performance payments depending on the net sales of the Jardiance product family; therefore, our reported revenue for Jardiance may be reduced by any potential performance payments we make related to this product family. The royalty received by us related to the Jardiance product family may also be increased or decreased depending on whether net sales for this product family exceed or fall below certain thresholds. We pay to Boehringer Ingelheim a royalty on net sales for the Basaglar product family in the U.S. We record our sales of the Basaglar product family to third parties as net product revenue with the royalty payments made to Boehringer Ingelheim recorded as cost of sales. \nThe following table summarizes our revenue recognized:\n2024\n2023\n2022\nJardiance\n$\n3,340.9\n \n$\n2,744.7\n \n$\n2,066.0\n \nBasaglar\n676.9\n \n728.3\n \n760.4\n \n2024 revenue from Jardiance included a one-time payment received of $\n300.0\n million associated with an amendment to our collaboration with Boehringer Ingelheim. Pursuant to the amendment, we and Boehringer Ingelheim adjusted commercialization responsibilities for Jardiance within certain smaller markets.\nOlumiant\nWe have a worldwide license and collaboration agreement with Incyte Corporation (Incyte), which provides us the development and commercialization rights to baricitinib, which is branded and trademarked as Olumiant, and certain follow-on compounds, for the treatment of inflammatory and autoimmune diseases and COVID-19. Incyte has the right to receive tiered, double digit royalty payments on worldwide net sales with rates ranging up to \n20\n percent. Incyte has the right to receive an additional royalty ranging up to the low teens on worldwide net sales for the treatment of COVID-19 that exceed a specified aggregate worldwide net sales threshold.\nWe record our sales of Olumiant, including sales of baricitinib that were made pursuant to EUA or similar regulatory authorizations, to third parties as net product revenue with the royalty payments made to Incyte recorded as cost of sales. \nThe following table summarizes our net product revenue recognized:\n2024\n2023\n2022\nOlumiant\n$\n957.4\n \n$\n922.6\n \n$\n830.5\n \n73\nTyvyt\nWe have a collaboration agreement with Innovent Biologics, Inc. (Innovent) to jointly develop and commercialize sintilimab injection in China, where it is branded and trademarked as Tyvyt. We record our sales of Tyvyt to third parties as net product revenue, with payments made to Innovent for its portion of the gross margin reported as cost of sales. We report as collaboration and other revenue our portion of the gross margin for Tyvyt sales made by Innovent to third parties. \nThe following table summarizes our revenue recognized: \n2024\n2023\n2022\nTyvyt\n$\n526.0\n \n$\n393.4\n \n$\n293.3\n \nEbglyss\nWe have a license agreement with F. Hoffmann-La Roche Ltd and Genentech, Inc. (collectively, Roche), which provides us the worldwide development and commercialization rights to lebrikizumab, which is branded and trademarked as Ebglyss. Roche receives tiered royalty payments on worldwide net sales ranging in percentages from high single digits to high teens, which we recognize as cost of sales. As of December 31, 2024, Roche is eligible to receive additional payments from us, including up to $\n1.03\n billion in potential sales-based milestones. During the years ended December 31, 2024, 2023, and 2022, milestone payments to Roche were not material. \nWe have a license agreement with Almirall, S.A. (Almirall), under which Almirall licensed the rights to develop and commercialize Ebglyss for the treatment or prevention of dermatology indications, including, but not limited to, atopic dermatitis in Europe. We receive tiered royalty payments on net sales in Europe ranging in percentages from low double digits to low twenties, which we recognize as collaboration and other revenue. During the years ended December 31, 2024, 2023, and 2022, collaboration and other revenue recognized under this license agreement was not material. As of December 31, 2024, we are eligible to receive additional payments up to $\n1.25\n billion in a series of sales-based milestones.\nOrforglipron\nWe have a license agreement with Chugai Pharmaceutical Co., Ltd (Chugai), which provides us with the worldwide development and commercialization rights to orforglipron. Chugai has the right to receive tiered royalty payments on future worldwide net sales from mid single digits to low teens if the product is successfully commercialized. As of December 31, 2024, Chugai is eligible to receive up to $\n140.0\n million contingent upon the achievement of success-based regulatory milestones and up to $\n250.0\n million in a series of sales-based milestones, contingent upon the commercial success of orforglipron. During the years ended December 31, 2024, 2023, and 2022, milestone payments to Chugai were not material.\nCOVID-19 Antibodies\nWe have a worldwide license and collaboration agreement with AbCellera Biologics Inc. (AbCellera) to co-develop therapeutic antibodies for the potential prevention and treatment of COVID-19, including bamlanivimab and bebtelovimab, for which we hold development and commercialization rights. AbCellera received royalty payments, recorded as cost of sales, in the mid-teens to mid-twenties on worldwide net sales of bamlanivimab and bebtelovimab.\nPursuant to EUAs or similar regulatory authorizations, we recognized net product revenue associated with our sales of our COVID-19 antibodies of $\n2.02\n billion during 2022. We had \nno\n sales of our COVID-19 antibodies during the years ended December 31, 2024 and 2023.\nDivestitures\nOlanzapine Portfolio (including Zyprexa)\nIn July 2023, we sold the rights for the olanzapine portfolio, including Zyprexa, to Cheplapharm Arzneimittel GmbH (Cheplapharm), a European company. Under the terms of the agreement, we received $\n1.05\n billion in cash in 2023 and an additional $\n305.0\n million in cash in 2024. We included both in the transaction price in 2023.\nWe entered into a supply agreement with Cheplapharm that obligates Cheplapharm to purchase Zyprexa product we are manufacturing at an amount which represents a standalone selling price. As the product we are manufacturing under this supply agreement has no alternative use to us and we have right to payment, we recognize net product revenue over time as we manufacture the product.\n74\nDuring the year ended December 31, 2023, we recognized $\n1.45\n billion in revenue primarily related to the net gain on the sale of rights for the olanzapine portfolio. \nBaqsimi\nIn June 2023, we sold the rights for Baqsimi\n \nto Amphastar Pharmaceuticals, Inc. (Amphastar). Under the terms of the agreement, we received $\n500.0\n million in cash in 2023 and an additional $\n125.0\n million in cash in 2024. We included both in the transaction price in 2023. We are eligible to receive payments of up to $\n450.0\n million in a series of sales-based milestones, that have not been included in the transaction price as of December 31, 2024. \nWe entered into a supply agreement with Amphastar that obligates Amphastar to purchase Baqsimi product we are manufacturing at an amount which represents a standalone selling price. As the product we are manufacturing under this supply agreement has no alternative use to us and we have right to payment, we recognize net product revenue over time as we manufacture the product.\nDuring the year ended December 31, 2023, we recognized $\n579.0\n million in revenue primarily related to the net gain on the sale of rights for Baqsimi.\n \nNote 5: \nAsset Impairment, Restructuring, and Other Special Charges\nAsset impairment, restructuring, and other special charges were $\n860.6\n million, $\n67.7\n million, and $\n244.6\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nAsset impairment, restructuring, and other special charges\n recognized during the year ended December 31, 2024 were primarily related to a $\n435.0\n million litigation charge and an intangible asset impairment for Vitrakvi, driven by expected commercial projections. See Note 16 for additional information related to the litigation charge. \nAsset impairment, restructuring, and other special charges recognized during the year ended December 31, 2022 were primarily related to an intangible asset impairment driven by delays in estimated launch timing.\nNote 6: \nInventories\nWe use the last-in, first-out (LIFO) method for the majority of our inventories located in the continental U.S. Other inventories are valued by the first-in, first-out (FIFO) method. FIFO cost approximates current replacement cost.\n Inventories measured using LIFO must be valued at the lower of cost or market. Inventories measured using FIFO must be valued at the lower of cost or net realizable value. \nInventories at December 31 consisted of the following:\n2024\n2023\nFinished products\n$\n1,220.8\n \n$\n791.7\n \nWork in process\n3,979.5\n \n3,248.6\n \nRaw materials and supplies\n2,326.0\n \n1,630.1\n \nTotal (approximates replacement cost)\n7,526.3\n \n5,670.4\n \nIncrease to LIFO cost\n62.9\n \n102.4\n \nInventories\n$\n7,589.2\n \n$\n5,772.8\n \nInventories valued under the LIFO method comprised $\n2.70\n billion and $\n1.77\n billion of total inventories at December 31, 2024 and 2023, respectively.\nWhen we believe that future commercialization is probable and the future economic benefit is expected to be realized, we capitalize pre-launch inventory prior to regulatory approval. A number of factors are considered, including the current status in the regulatory approval process, potential impediments to the approval process such as safety or efficacy, viability of commercialization, and marketplace trends. Pre-launch inventory capitalized as of December 31, 2024 was $\n548.1\n million, primarily related to orforglipron.\n75\nNote 7: \nFinancial Instruments\nInvestments in Equity and Debt Securities\nOur equity investments are accounted for using three different methods depending on the type of equity investment:\n•\nInvestments in companies over which we have significant influence but not a controlling interest are accounted for using the equity method, with our share of earnings or losses reported in other-net, (income) expense. \n•\nFor equity investments that do not have readily determinable fair values, we measure these investments at cost, less any impairment, plus or minus changes resulting from observable price changes in orderly transactions for the identical or similar investment of the same issuer. Any change in recorded value is recorded in other-net, (income) expense. \n•\nOur public equity investments are measured and carried at fair value. Any change in fair value is recognized in other-net, (income) expense. \nWe adjust our equity investments without readily determinable fair values based upon changes in the equity instruments' values resulting from observable price changes in orderly transactions for an identical or similar investment of the same issuer. Downward adjustments resulting from an impairment are recorded based upon impairment considerations, including the financial condition and near-term prospects of the issuer, general market conditions, and industry specific factors.\n Adjustments recorded for the years ended December 31, 2024, 2023, and 2022 were not material.\nThe net losses recognized in our consolidated statements of operations for equity securities were $\n49.5\n million, $\n20.2\n million, and $\n410.7\n million for the years ended December 31, 2024, 2023, and 2022, respectively. The net gains (losses) recognized for the years ended December 31, 2024, 2023, and 2022 on equity securities sold during the respective periods were not material.\nAs of December 31, 2024, we had approximately $\n899\n million of unfunded commitments to invest in venture capital funds, which we anticipate will be paid over a period of up to \n10\n years.\nWe record our available-for-sale debt securities at fair value, with changes in fair value reported as a component of accumulated other comprehensive income (loss). We periodically assess our investment in available-for-sale securities for impairment losses and credit losses. The amount of credit losses is determined by comparing the difference between the present value of future cash flows expected to be collected on these securities and the amortized cost. Factors considered in assessing credit losses include the position in the capital structure, vintage and amount of collateral, delinquency rates, current credit support, and geographic concentration.\n Impairment and credit losses related to available-for-sale securities were not material for the years ended December 31, 2024, 2023, and 2022.\nThe table below summarizes the contractual maturities of our investments in debt securities measured at fair value as of December 31, 2024:\n \nMaturities by Period\nTotal\nLess Than\n1 Year\n1-5\nYears\n6-10\nYears\nMore Than 10 Years\nFair value of debt securities\n$\n668.8\n \n$\n95.2\n \n$\n225.5\n \n$\n93.3\n \n$\n254.8\n \nA summary of the amount of unrealized gains and losses in accumulated other comprehensive loss and the fair value of available-for-sale securities in an unrealized gain or loss position follows:\n2024\n2023\nUnrealized gross gains\n$\n1.6\n \n$\n3.4\n \nUnrealized gross losses\n43.2\n \n37.9\n \nFair value of securities in an unrealized gain position\n142.6\n \n159.2\n \nFair value of securities in an unrealized loss position\n491.2\n \n452.0\n \n76\nAs of December 31, 2024, the available-for-sale securities in an unrealized loss position include primarily fixed-rate debt securities of varying maturities, which are sensitive to changes in the yield curve and other market conditions. Substantially all of the fixed-rate debt securities in a loss position are investment-grade debt securities. As of December 31, 2024, we do not intend to sell, and it is not more likely than not that we will be required to sell, the securities in a loss position before the market values recover or the underlying cash flows have been received, and there is no indication of a material default on interest or principal payments for our debt securities.\nRealized gains and losses on sales of available-for-sale investments are computed based upon specific identification of the initial cost adjusted for any other-than-temporary declines in fair value that were recorded in earnings and were not material for the years ended December 31, 2024, 2023, and 2022. Proceeds from sales of available-for-sale investments were $\n98.0\n million, $\n145.6\n million, and $\n132.9\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n77\nFair Value of Investments\nThe following table summarizes certain fair value information at December 31, 2024 and 2023 for investment assets measured at fair value on a recurring basis, as well as the carrying amount and amortized cost of certain other investments:\n \n \n \nFair Value Measurements Using\n \nCarrying\nAmount\nCost\n(1)\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nFair\nValue\nDecember 31, 2024\nCash equivalents\n(2)\n$\n1,506.9\n \n$\n1,506.9\n \n$\n1,494.1\n \n$\n12.8\n \n$\n—\n \n$\n1,506.9\n \nShort-term investments:\nU.S. government and agency securities\n$\n29.2\n \n$\n29.3\n \n$\n29.2\n \n$\n—\n \n$\n—\n \n$\n29.2\n \nCorporate debt securities\n65.3\n \n65.4\n \n—\n \n65.3\n \n—\n \n65.3\n \nAsset-backed securities\n0.6\n \n0.7\n \n—\n \n0.6\n \n—\n \n0.6\n \nOther securities\n59.7\n \n59.7\n \n—\n \n16.7\n \n43.0\n \n59.7\n \nShort-term investments\n$\n154.8\n \nNoncurrent investments:\nU.S. government and agency securities\n$\n140.2\n \n$\n156.4\n \n$\n140.2\n \n$\n—\n \n$\n—\n \n$\n140.2\n \nCorporate debt securities\n211.4\n \n225.0\n \n—\n \n211.4\n \n—\n \n211.4\n \nMortgage-backed securities\n165.3\n \n177.2\n \n—\n \n165.3\n \n—\n \n165.3\n \nAsset-backed securities\n56.7\n \n57.5\n \n—\n \n56.7\n \n—\n \n56.7\n \nOther securities\n150.3\n \n102.6\n \n—\n \n6.3\n \n144.0\n \n150.3\n \nMarketable equity securities\n485.5\n \n494.6\n \n485.5\n \n—\n \n—\n \n485.5\n \nEquity investments without readily determinable fair values\n(3)\n863.8\n \nEquity method investments\n(3)\n1,142.7\n \nNoncurrent investments\n$\n3,215.9\n \nDecember 31, 2023\nCash equivalents\n(2)\n$\n1,088.4\n \n$\n1,088.4\n \n$\n1,079.3\n \n$\n9.1\n \n$\n—\n \n$\n1,088.4\n \nShort-term investments:\nU.S. government and agency securities\n$\n32.1\n \n$\n32.3\n \n$\n32.1\n \n$\n—\n \n$\n—\n \n$\n32.1\n \nCorporate debt securities\n52.0\n \n52.1\n \n—\n \n52.0\n \n—\n \n52.0\n \nOther securities\n25.0\n \n25.0\n \n—\n \n13.6\n \n11.4\n \n25.0\n \nShort-term investments\n$\n109.1\n \nNoncurrent investments:\nU.S. government and agency securities\n$\n148.1\n \n$\n161.0\n \n$\n148.1\n \n$\n—\n \n$\n—\n \n$\n148.1\n \nCorporate debt securities\n214.3\n \n226.6\n \n—\n \n214.3\n \n—\n \n214.3\n \nMortgage-backed securities\n157.3\n \n167.1\n \n—\n \n157.3\n \n—\n \n157.3\n \nAsset-backed securities\n53.5\n \n54.4\n \n—\n \n53.5\n \n—\n \n53.5\n \nOther securities\n197.4\n \n100.2\n \n—\n \n23.5\n \n173.9\n \n197.4\n \nMarketable equity securities\n711.3\n \n493.2\n \n711.3\n \n—\n \n—\n \n711.3\n \nEquity investments without readily determinable fair values\n(3)\n608.0\n \nEquity method investments\n(3)\n962.3\n \nNoncurrent investments\n$\n3,052.2\n \n(1)\n For available-for-sale debt securities, amounts disclosed represent the securities' amortized cost.\n(2)\n We consider all highly liquid investments with a maturity of three months or less from the date of purchase to be cash equivalents. The cost of these investments approximates fair value.\n(3)\n Fair value disclosures are not applicable for equity method investments and investments accounted for under the measurement alternative for equity investments.\n78\nWe determine our Level 1 and Level 2 fair value measurements based on a market approach using quoted market values, significant other observable inputs for identical or comparable assets or liabilities, or discounted cash flow analyses. Level 3 fair value measurements for other investment securities are determined using unobservable inputs, including the investments' cost adjusted for impairments and price changes from orderly transactions. Fair values are not readily available for certain equity investments measured under the measurement alternative.\nDebt\nFair Value of Debt\nThe following table summarizes certain fair value information for our short-term and long-term debt:\n \nFair Value Measurements Using\n \nCarrying\nAmount\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nFair\nValue\nShort-term commercial paper borrowings\nDecember 31, 2024\n$\n4,337.6\n \n$\n—\n \n$\n4,319.4\n \n$\n—\n \n$\n4,319.4\n \nDecember 31, 2023\n6,189.4\n \n—\n \n6,166.4\n \n—\n \n6,166.4\n \nLong-term debt, including current portion\nDecember 31, 2024\n29,306.7\n \n—\n \n26,249.0\n \n—\n \n26,249.0\n \nDecember 31, 2023\n19,035.9\n \n—\n \n17,221.7\n \n—\n \n17,221.7\n \nRisk Management and Related Financial Instruments\nFinancial instruments that potentially subject us to credit risk consist principally of trade receivables and interest-bearing investments. Wholesale distributors of our products account for a substantial portion of our trade receivables; collateral is generally not required. We seek to mitigate the risk associated with this concentration through our ongoing credit-review procedures and insurance. The majority of our cash is held by a few major financial institutions that have been identified as Global Systemically Important Banks (G-SIBs) by the Financial Stability Board. G-SIBs are subject to rigorous regulatory testing and oversight and must meet certain capital requirements. We monitor our exposures with these institutions and do not expect any of these institutions to fail to meet their obligations. In accordance with documented corporate risk-management policies, we monitor the amount of credit exposure to any one financial institution or corporate issuer based on credit rating of our counterparty. We are exposed to credit-related losses in the event of nonperformance by counterparties to risk-management instruments but do not expect significant counterparties to fail to meet their obligations given their investment grade credit ratings.\nWe have entered into accounts receivable factoring agreements with financial institutions to sell certain of our non-U.S. accounts receivable. These transactions are accounted for as sales and result in a reduction in accounts receivable because the agreements transfer effective control over, and risk related to, the receivables to the buyers. We derecognized $\n421.6\n million and $\n431.9\n million of accounts receivable as of December 31, 2024 and 2023, respectively, under these factoring arrangements. The costs of factoring such accounts receivable as well as estimated credit losses were not material for the years ended December 31, 2024, 2023, and 2022.\nOur derivative activities are initiated within the guidelines of documented corporate risk-management policies and are intended to offset losses and gains on the assets, liabilities, and transactions being hedged. Management reviews the correlation and effectiveness of our derivatives on a quarterly basis.\n79\nFor derivative instruments that are designated and qualify as fair value hedges, the derivative instrument is marked to market, with gains and losses recognized currently in income to offset the respective losses and gains recognized on the underlying exposure. For derivative instruments that are designated and qualify as cash flow hedges, gains and losses are reported as a component of accumulated other comprehensive income (loss) (see Note 17) and reclassified into earnings in the same period the hedged transaction affects earnings. For derivative and non-derivative instruments that are designated and qualify as net investment hedges, the foreign currency translation gains or losses due to spot rate fluctuations are reported as a component of accumulated other comprehensive income (loss) (see Note 17). Derivative contracts that are not designated as hedging instruments are recorded at fair value with the gain or loss recognized in earnings during the period of change.\nForeign currency exchange risk is managed through the use of foreign currency debt, cross-currency interest rate swaps, and foreign currency forward contracts. Our foreign currency-denominated notes had carrying amounts of $\n6.03\n billion\n \nand\n \n$\n7.14\n billion as of December 31, 2024 and 2023, respectively, of which $\n5.34\n billion and $\n5.67\n billion have been designated as, and are effective as, hedges of net investments in certain of our foreign operations as of December 31, 2024 and 2023, respectively. At December 31, 2024, we had outstanding cross-currency interest rate swaps with notional amounts of $\n218.0\n million swapping U.S. dollars to euro and \n402.0\n million Swiss francs swapping to U.S. dollars, with settlement dates ranging through 2028. Our cross-currency interest rate swaps have been designated as, and are effective as, net investment and cash flow hedges, respectively. At December 31, 2024, we had outstanding foreign currency forward contracts to sell \n7.59\n billion euro and to sell \n4.20\n billion Chinese yuan, with settlement dates ranging through 2025, which have been designated as, and are effective as, hedges of net investments.\nWe may also enter into foreign currency forward or option contracts as economic hedges to manage exposures arising from subsidiary trade and loan payables and receivables denominated in foreign currencies (primarily the euro and Japanese yen). Foreign currency derivatives used for hedging are put in place using the same or like currencies and duration as the underlying exposures. These contracts are recorded at fair value with the gain or loss recognized in other–net, (income) expense. \nForward contracts generally have maturities not exceeding \n12\n months. \nAt December 31, 2024, our significant outstanding foreign currency forward commitments were as follows, all of which have settlement dates within \n180\n days:\nDecember 31, 2024\nPurchase\nSell\nCurrency\nAmount\n(in millions)\nCurrency\nAmount\n(in millions)\nEuro\n7,522.1\nU.S. dollars\n7,905.8\nU.S. dollars\n7,095.3\nEuro\n6,803.9\nU.S. dollars\n468.3\nJapanese yen\n72,355.7\nJapanese yen\n49,713.2\nU.S. dollars\n316.1\nIn the normal course of business, our operations are exposed to fluctuations in interest rates which can vary the costs of financing, investing, and operating. We seek to address a portion of these risks through a controlled program of risk management that includes the use of derivative financial instruments. The objective of controlling these risks is to limit the impact of fluctuations in interest rates on earnings. Our primary interest-rate risk exposure results from changes in short-term U.S. dollar interest rates. In an effort to manage interest-rate exposures, we strive to achieve an acceptable balance between fixed- and floating-rate debt and investment positions and may enter into interest rate swaps or collars to help maintain that balance. \nInterest rate swaps or collars that convert our fixed-rate debt to a floating rate are designated as fair value hedges of the underlying instruments. Interest rate swaps or collars that convert floating-rate debt to a fixed rate are designated as cash flow hedges. Interest expense on the debt is adjusted to include the payments made or received under the swap agreements. Cash proceeds from or payments to counterparties resulting from the termination of interest rate swaps are classified as operating activities in our consolidated statements of cash flows.\n At December 31, 2024, all of our total long-term debt is at a fixed rate. We have converted approximately \n5\n percent of our long-term fixed-rate notes to floating rates through the use of interest rate swaps.\n80\nWe also may enter into forward-starting interest rate swaps and treasury locks, which we designate as cash flow hedges, as part of any anticipated future debt issuances in order to reduce the risk of cash flow volatility from future changes in interest rates. The change in fair value of these instruments is recorded as part of other comprehensive income (loss) (see Note 17) and, upon completion of a debt issuance and termination of the instrument, is amortized to interest expense over the life of the underlying debt. Cash proceeds or payments from the termination of these instruments are classified as operating activities in our consolidated statements of cash flows.\n \nThe Effect of Risk Management Instruments on the Consolidated Statements of Operations\nThe following effects of risk-management instruments were recognized in other–net, (income) expense:\n2024\n2023\n2022\nFair value hedges:\nEffect from hedged fixed-rate debt\n$\n(\n16.3\n)\n$\n31.5\n \n$\n(\n209.8\n)\nEffect from interest rate contracts\n16.3\n \n(\n31.5\n)\n209.8\n \nCash flow hedges:\nEffective portion of losses on interest rate contracts reclassified from accumulated other comprehensive loss\n7.2\n \n13.5\n \n16.5\n \nCross-currency interest rate swaps\n93.0\n \n(\n108.6\n)\n8.6\n \nNet losses on foreign currency exchange contracts not designated as hedging instruments\n288.3\n \n26.4\n \n191.3\n \nTotal \n$\n388.5\n \n$\n(\n68.7\n)\n$\n216.4\n \nDuring the years ended December 31, 2024, 2023, and 2022, the amortization of losses related to the portion of our risk management hedging instruments, fair value hedges, and cash flow hedges that was excluded from the assessment of effectiveness was not material. \nThe Effect of Risk-Management Instruments on Other Comprehensive Income (Loss)\nThe effective portion of risk-management instruments that was recognized in other comprehensive income (loss) is as follows:\n2024\n2023\n2022\nNet investment hedges:\nForeign currency-denominated notes\n$\n337.9\n \n$\n(\n219.9\n)\n$\n324.9\n \nCross-currency interest rate swaps\n16.4\n \n(\n27.4\n)\n52.0\n \nForeign currency forward contracts\n343.1\n \n(\n107.1\n)\n(\n15.4\n)\nCash flow hedges:\nForward-starting interest rate swaps\n53.8\n \n85.6\n \n391.5\n \nCross-currency interest rate swaps\n24.9\n \n15.2\n \n29.8\n \nDuring the years ended December 31, 2024, 2023, and 2022, the amounts excluded from the assessment of hedge effectiveness recognized in other comprehensive income (loss) were not material. As of December 31, 2024, the amount of pre-tax gains or losses on cash flow hedges expected to be reclassified from accumulated other comprehensive income (loss) to other–net, (income) expense over the next 12 months is not material.\n81\nFair Value of Risk-Management Instruments\nThe following table summarizes certain fair value information at December 31, 2024 and 2023 for risk-management assets and liabilities measured at fair value on a recurring basis:\n \nFair Value Measurements Using\n \nCarrying\nAmount\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nFair\nValue\nDecember 31, 2024\nRisk-management instruments\nInterest rate contracts designated as fair value hedges:\nOther current liabilities\n$\n(\n2.0\n)\n$\n—\n \n$\n(\n2.0\n)\n$\n—\n \n$\n(\n2.0\n)\nOther noncurrent liabilities\n(\n117.8\n)\n—\n \n(\n117.8\n)\n—\n \n(\n117.8\n)\nCross-currency interest rate contracts designated as net investment hedges:\nOther receivables\n10.3\n \n—\n \n10.3\n \n—\n \n10.3\n \nCross-currency interest rate contracts designated as cash flow hedges:\nOther noncurrent assets\n50.7\n \n—\n \n50.7\n \n—\n \n50.7\n \nForeign exchange contracts designated as net investment hedges:\nOther receivables\n297.0\n \n—\n \n297.0\n \n—\n \n297.0\n \nForeign exchange contracts not designated as hedging instruments:\nOther receivables\n39.5\n \n—\n \n39.5\n \n—\n \n39.5\n \nOther current liabilities\n(\n93.4\n)\n—\n \n(\n93.4\n)\n—\n \n(\n93.4\n)\nContingent consideration liabilities:\nOther noncurrent liabilities\n(\n32.3\n)\n—\n \n—\n \n(\n32.3\n)\n(\n32.3\n)\n82\n \nFair Value Measurements Using\n \nCarrying\nAmount\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nFair\nValue\nDecember 31, 2023\nRisk-management instruments\nInterest rate contracts designated as fair value hedges:\nOther current liabilities\n$\n(\n2.4\n)\n$\n—\n \n$\n(\n2.4\n)\n$\n—\n \n$\n(\n2.4\n)\nOther noncurrent liabilities\n(\n100.3\n)\n—\n \n(\n100.3\n)\n—\n \n(\n100.3\n)\nInterest rate contracts designated as cash flow hedges:\nOther noncurrent assets\n291.2\n \n—\n \n291.2\n \n—\n \n291.2\n \nCross-currency interest rate contracts designated as net investment hedges:\nOther current liabilities\n(\n28.4\n)\n—\n \n(\n28.4\n)\n—\n \n(\n28.4\n)\nOther noncurrent liabilities\n(\n3.5\n)\n—\n \n(\n3.5\n)\n—\n \n(\n3.5\n)\nCross-currency interest rate contracts designated as cash flow hedges:\nOther receivables\n113.8\n \n—\n \n113.8\n \n—\n \n113.8\n \nOther noncurrent assets\n63.1\n \n—\n \n63.1\n \n—\n \n63.1\n \nForeign exchanges contracts designated as hedging instruments:\nOther current liabilities\n(\n115.8\n)\n—\n \n(\n115.8\n)\n—\n \n(\n115.8\n)\nForeign exchange contracts not designated as hedging instruments:\nOther receivables\n129.6\n \n—\n \n129.6\n \n—\n \n129.6\n \nOther current liabilities\n(\n55.9\n)\n—\n \n(\n55.9\n)\n—\n \n(\n55.9\n)\nContingent consideration liabilities:\nOther current liabilities\n(\n39.5\n)\n—\n \n—\n \n(\n39.5\n)\n(\n39.5\n)\nOther noncurrent liabilities\n(\n64.4\n)\n—\n \n—\n \n(\n64.4\n)\n(\n64.4\n)\nRisk-management instruments above are disclosed on a gross basis. There are various rights of setoff associated with certain of the risk-management instruments above that are subject to enforceable master netting arrangements or similar agreements. Although various rights of setoff and master netting arrangements or similar agreements may exist with the individual counterparties to the risk-management instruments above, individually, these financial rights are not material.\nContingent consideration liabilities relate to our liabilities arising in connection with the CVRs issued as a result of acquisitions of businesses. The fair values of the CVR liabilities were estimated using a discounted cash flow analysis and Level 3 inputs, including projections representative of a market participant's view of the expected cash payments associated with the agreed upon regulatory milestones based on probabilities of technical success, timing of the potential milestone events for the compounds, and estimated discount rates.\n \n83\nNote 8: \nGoodwill and Other Intangibles\nGoodwill\nGoodwill results from excess consideration in a business combination over the fair value of identifiable net assets acquired. Goodwill is not amortized but is reviewed for impairment at least annually, or more frequently if impairment indicators are present, by first assessing qualitative factors to determine whether it is more likely than not that the fair value is less than its carrying amount. If we conclude it is more likely than not that the fair value is less than the carrying amount, a quantitative test that compares the fair value to its carrying value is performed to determine the amount of any impairment.\n The change in goodwill during 2024 was primarily related to our acquisition of a manufacturing site in Wisconsin. See Note 3 for additional information.\nNo\n impairments occurred with respect to the carrying value of goodwill for the years ended December 31, 2024, 2023, and 2022.\nOther Intangibles\nThe components of intangible assets other than goodwill at December 31 were as follows:\n \n2024\n2023\nCarrying\nAmount, \nGross\nAccumulated\nAmortization\nCarrying\nAmount, \nNet\nCarrying\nAmount, \nGross\nAccumulated\nAmortization\nCarrying\nAmount, \nNet\nFinite-lived intangible assets:\nMarketed products\n$\n8,090.2\n \n$\n(\n2,821.6\n)\n$\n5,268.6\n \n$\n8,216.8\n \n$\n(\n2,277.0\n)\n$\n5,939.8\n \nIndefinite-lived intangible assets:\nAcquired IPR&D\n897.7\n \n—\n \n897.7\n \n966.8\n \n— \n966.8\n \nOther intangibles\n$\n8,987.9\n \n$\n(\n2,821.6\n)\n$\n6,166.3\n \n$\n9,183.6\n \n$\n(\n2,277.0\n)\n$\n6,906.6\n \nMarketed products consist primarily of the amortized cost of the rights to assets acquired in business combinations and approved for marketing in a significant global jurisdiction (U.S., Europe, and Japan) and capitalized milestone payments. \nFor transactions other than a business combination, we capitalize milestone payments incurred at or after the product has obtained regulatory approval for marketing.\nAcquired IPR&D consists of the fair values of acquired IPR&D projects acquired in business combinations, adjusted for subsequent impairments, if any. \nThe costs of acquired IPR&D projects acquired directly in a transaction other than a business combination are capitalized as other intangible assets if the projects have an alternative future use; otherwise, they are expensed immediately. See Note 3 for significant acquired IPR&D projects that had no alternative future use. \nSeveral methods may be used to determine the estimated fair value of other intangibles acquired in a business combination. We utilize the \"income method,\" which is a Level 3 fair value measurement and applies a probability weighting that considers the risk of development and commercialization to the estimated future net cash flows that are derived from projected revenues and estimated costs. These projections are based on factors such as relevant market size, patent protection, historical pricing of similar products, analyst expectations, and expected industry trends. The estimated future net cash flows are then discounted to the present value using an appropriate discount rate. This analysis is performed for each asset independently. The acquired IPR&D assets are treated as indefinite-lived intangible assets until completion or abandonment of the projects, at which time the assets are tested for impairment and amortized over the remaining useful life or written off, as appropriate.\n \nIndefinite-lived intangible assets are reviewed for impairment at least annually, or more frequently if impairment indicators are present, by first assessing qualitative factors to determine whether it is more likely than not that the fair value of the asset is less than its carrying amount. If we conclude it is more likely than not that the fair value is less than the carrying amount, a quantitative test that compares the fair value of the intangible asset to its carrying value is performed to determine the amount of any impairment. Finite-lived intangible assets are reviewed for impairment when an indicator of impairment is present. When required, a comparison of fair value to the carrying amount of assets is performed to determine the amount of any impairment. When determining the fair value of indefinite-lived acquired IPR&D as well as the fair value of finite-lived intangible assets for impairment testing purposes, we utilize the \"income method\" discussed above.\n \n84\nIntangible assets with finite lives are capitalized and are amortized primarily to cost of sales over their estimated useful lives, ranging from \none\n to \n20\n years. As of December 31, 2024, the remaining weighted-average amortization period for finite-lived intangible assets was approximately \n12\n years. \nAmortization expense related to finite-lived intangible assets was as follows:\n2024\n2023\n2022\nAmortization expense\n$\n552.9\n \n$\n505.6\n \n$\n579.7\n \nThe estimated amortization expense for each of the next five years associated with our finite-lived intangible assets as of December 31, 2024 is as follows:\n2025\n2026\n2027\n2028\n2029\nEstimated amortization expense\n$\n500.6\n \n$\n490.0\n \n$\n488.0\n \n$\n481.3\n \n$\n467.2\n \nNote 9: \nProperty and Equipment\nProperty and equipment is stated on the basis of cost. Provisions for depreciation of buildings and equipment are computed generally by the straight-line method at rates based on their estimated useful lives (\n12\n to \n50\n years for buildings and \nthree\n to \n25\n years for equipment). We review the carrying value of long-lived assets for potential impairment on a periodic basis and whenever events or changes in circumstances indicate the carrying value of an asset may not be recoverable. Impairment is determined by comparing projected undiscounted cash flows to be generated by the asset to its carrying value. If an impairment is identified, a loss is recorded equal to the excess of the asset's net book value over its fair value, and the cost basis is adjusted.\nAt December 31, property and equipment consisted of the following:\n2024\n2023\nLand\n$\n382.0\n \n$\n319.8\n \nBuildings\n8,806.8\n \n8,280.0\n \nEquipment\n11,457.8\n \n10,329.0\n \nConstruction in progress\n8,244.8\n \n5,084.1\n \n28,891.4\n \n24,012.9\n \nLess accumulated depreciation\n(\n11,789.0\n)\n(\n11,099.3\n)\nProperty and equipment, net\n$\n17,102.4\n \n$\n12,913.6\n \nDepreciation expense related to property and equipment was as follows:\n2024\n2023\n2022\nDepreciation expense\n$\n1,058.0\n \n$\n901.9\n \n$\n816.6\n \nCapitalized interest costs were not material for the years ended December 31, 2024, 2023, and 2022. \nThe following table summarizes long-lived assets by geographical area:\n2024\n2023\nLong-lived assets\n(1)\n:\nU.S. and Puerto Rico\n$\n13,401.5\n \n$\n9,993.2\n \nIreland\n3,205.0\n \n2,722.6\n \nRest of world\n2,158.9\n \n1,784.2\n \nLong-lived assets\n$\n18,765.4\n \n$\n14,500.0\n \n(1) \nLong-lived assets consist of property and equipment, net, operating lease assets, and unamortized computer software costs.\n \n85\nNote 10: \nLeases\nWe determine if an arrangement is a lease at inception. We have leases with terms up to \n15\n years primarily for corporate offices, research and development facilities, vehicles, and equipment, including some of which have options to extend and/or early-terminate the leases. We determine the lease term by assuming the exercise of any renewal and/or early-termination options that are reasonably assured.\nOperating lease right-of-use assets are presented as other noncurrent assets in our consolidated balance sheets, and the current and long-term portions of operating lease liabilities are included in other current liabilities and other noncurrent liabilities, respectively, in our consolidated balance sheets. Short-term leases, which are deemed at inception to have a lease term of 12 months or less, are not recorded on the consolidated balance sheets. \nOperating lease assets represent our right to use an underlying asset for the lease term, and operating lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. \nLease expense for operating lease assets, which is recognized on a straight-line basis over the lease term, was $\n209.6\n million, $\n171.2\n million, and $\n148.8\n million during the years ended December 31, 2024, 2023, and 2022, respectively. Variable lease payments, which represent non-lease components such as maintenance, insurance and taxes, and which vary due to changes in facts or circumstances occurring after the commencement date other than the passage of time, are expensed in the period in which the payment obligation is incurred and were not material during the years ended December 31, 2024, 2023, and 2022. Short-term lease expense was not material during the years ended December 31, 2024, 2023, and 2022.\nSupplemental balance sheet information related to operating leases as of December 31 was as follows:\n2024\n2023\nOperating lease right-of-use assets\n$\n1,050.1\n$\n1,024.2\nOperating lease liabilities, current portion\n175.7\n156.3\nOperating lease liabilities, noncurrent portion\n970.9\n948.5\nWeighted-average remaining lease term\n9\n years\n9\n years\nWeighted-average discount rate\n4.6\n \n%\n4.4\n \n%\nSupplemental cash flow information related to operating leases was as follows:\n2024\n2023\n2022\nOperating cash flows from operating leases\n$\n201.8\n \n$\n171.0\n \n$\n149.7\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n210.0\n \n590.0\n \n155.4\n \nThe annual minimum lease payments of our operating lease liabilities as of December 31, 2024 were as follows:\n2025\n$\n221.2\n \n2026\n189.1\n \n2027\n172.2\n \n2028\n130.3\n \n2029\n108.6\n \nAfter 2029\n625.6\n \nTotal lease payments\n1,447.0\n \nLess imputed interest\n300.4\n \nTotal\n$\n1,146.6\n \n86\nFinance leases are included in property and equipment, short-term borrowings and current maturities of long-term debt, and long-term debt in our consolidated balance sheets. Finance leases are not material to our consolidated financial statements.\nNote 11: \nBorrowings\nDebt at December 31 consisted of the following:\n2024\n2023\nShort-term commercial paper borrowings\n$\n4,337.6\n \n$\n6,189.4\n \nLong-term notes \n29,474.0\n \n19,104.6\nOther long-term debt\n6.8\n \n6.5\n \nUnamortized debt issuance costs\n(\n160.8\n)\n(\n90.5\n)\nFair value adjustment on hedged long-term notes\n(\n13.4\n)\n15.3\n \nTotal debt\n33,644.2\n \n25,225.3\n \nLess current portion\n(\n5,117.1\n)\n(\n6,904.5\n)\nLong-term debt\n$\n28,527.1\n \n$\n18,320.8\n \nThe weighted-average effective borrowing rates on short-term commercial paper borrowings were \n4.61\n percent and \n5.39\n percent at December 31, 2024 and 2023, respectively.\n87\nThe following table summarizes long-term notes at December 31:\n2024\n2023\n0.15\n% Swiss franc denominated notes due 2024\n$\n—\n \n$\n714.6\n \n7.125\n% notes due 2025\n217.5\n \n217.5\n \n2.75\n% notes due 2025\n560.6\n \n560.6\n \n5.0\n% notes due 2026\n750.0\n \n750.0\n \n1.625\n% euro denominated notes due 2026\n779.1\n \n830.7\n \n4.500\n% notes due 2027\n1,000.0\n \n—\n \n5.5\n% notes due 2027\n364.3\n \n364.3\n \n3.1\n% notes due 2027\n401.5\n \n401.5\n \n4.150\n% notes due 2027\n750.0\n \n—\n \n0.45\n% Swiss franc denominated notes due 2028\n441.6\n \n476.4\n \n4.500\n% notes due 2029\n1,000.0\n \n—\n \n3.375\n% notes due 2029\n930.6\n \n930.6\n \n4.200\n% notes due 2029\n1,000.0\n \n—\n \n0.42\n% Japanese yen denominated notes due 2029\n145.6\n \n162.5\n \n2.125\n% euro denominated notes due 2030\n779.1\n \n830.7\n \n0.625\n% euro denominated notes due 2031\n623.2\n \n664.6\n \n4.7\n% notes due 2033\n1,000.0\n \n1,000.0\n \n0.50\n% euro denominated notes due 2033\n623.2\n \n664.6\n \n4.700\n% notes due 2034\n1,500.0\n \n—\n \n4.600\n% notes due 2034\n1,250.0\n \n—\n \n0.56\n% Japanese yen denominated notes due 2034\n58.9\n \n65.8\n \n6.77\n% notes due 2036\n158.6\n \n158.6\n \n5.55\n% notes due 2037\n444.7\n \n444.7\n \n5.95\n% notes due 2037\n266.8\n \n266.8\n \n3.875\n% notes due 2039\n240.3\n \n240.3\n \n1.625\n% British pound denominated notes due 2043\n313.8\n \n318.5\n \n4.65\n% notes due 2044\n38.3\n \n38.3\n \n3.7\n% notes due 2045\n386.8\n \n386.8\n \n3.95\n% notes due 2047\n347.0\n \n347.0\n \n3.95\n% notes due 2049\n958.2\n \n958.2\n \n1.70\n% euro denominated notes due 2049\n1,038.7\n \n1,107.6\n \n0.97\n% Japanese yen denominated notes due 2049\n48.5\n \n54.2\n \n2.25\n% notes due 2050\n1,250.0\n \n1,250.0\n \n1.125\n% euro denominated notes due 2051\n519.4\n \n553.8\n \n4.875\n% notes due 2053\n1,250.0\n \n1,250.0\n \n5.000\n% notes due 2054\n1,500.0\n \n—\n \n5.050\n% notes due 2054\n1,250.0\n \n—\n \n4.15\n% notes due 2059\n591.3\n \n591.3\n \n2.50\n% notes due 2060\n850.0\n \n850.0\n \n1.375\n% euro denominated notes due 2061\n727.1\n \n775.3\n \n4.95\n% notes due 2063\n1,000.0\n \n1,000.0\n \n5.100\n% notes due 2064\n1,500.0\n \n—\n \n5.200\n% notes due 2064\n750.0\n \n—\n \nUnamortized note discounts\n(\n130.7\n)\n(\n121.2\n)\nTotal long-term notes\n$\n29,474.0\n \n$\n19,104.6\n \n88\nThe weighted-average effective borrowing rate for each issuance of the long term-notes approximates the stated interest rate. \nAt December 31, 2024, we had a total of $\n8.45\n billion of unused committed bank credit facilities, which consisted primarily of a $\n3.00\n billion credit facility that expires in December 2028 and a $\n5.00\n billion \n364\n-day facility that expires in September 2025, both of which are available to support our commercial paper program. We have not drawn against the $\n3.00\n billion and $\n5.00\n billion facilities as of December 31, 2024. Of the remaining committed bank credit facilities, the outstanding balances as of December 31, 2024 and 2023 were not material. Compensating balances and commitment fees are not material, and there are no conditions that are probable of occurring under which the lines may be withdrawn. \nIn February 2025, we issued $\n1.00\n billion of \n4.550\n percent fixed-rate notes due in 2028, $\n1.25\n billion of \n4.750\n percent fixed-rate notes due in 2030, $\n1.00\n billion of \n4.900\n percent fixed-rate notes due in 2032, $\n1.25\n billion of \n5.100\n percent fixed-rate notes due in 2035, $\n1.25\n billion of \n5.500\n percent fixed-rate notes due in 2055, and $\n750.0\n million of \n5.600\n percent fixed-rate notes due in 2065, all with interest to be paid semi-annually. We expect to use the net cash proceeds from the offering to fund potential business development activities, as well as general business purposes, including the repayment of outstanding commercial paper.\nIn August 2024, we issued $\n750.0\n million of \n4.150\n percent fixed-rate notes due in 2027, $\n1.00\n billion of \n4.200\n percent fixed-rate notes due in 2029, $\n1.25\n billion of \n4.600\n percent fixed-rate notes due in 2034, $\n1.25\n billion of \n5.050\n percent fixed-rate notes due in 2054, and $\n750.0\n million of \n5.200\n percent fixed-rate notes due in 2064, all with interest to be paid semi-annually. We used a portion of the net cash proceeds from the offering of $\n4.96\n billion to fund the acquisition of Morphic and related fees and expenses, with any remaining funds used for general business purposes, including the repayment of outstanding commercial paper.\nIn February 2024, we issued $\n1.00\n billion of \n4.500\n percent fixed-rate notes due in 2027, $\n1.00\n billion of \n4.500\n percent fixed-rate notes due in 2029, $\n1.50\n billion of \n4.700\n percent fixed-rate notes due in 2034, $\n1.50\n billion of \n5.000\n percent fixed-rate notes due in 2054, and $\n1.50\n billion of \n5.100\n percent fixed-rate notes due in 2064, all with interest to be paid semi-annually. We used, or may be using, the net cash proceeds from the offering of $\n6.45\n billion for general business purposes, including the repayment of outstanding commercial paper, repayment of current maturities of long-term debt, and repayment of the $\n750.0\n million of \n5.000\n percent fixed-rate notes due in 2026.\nIn February 2023, we issued $\n750.0\n million of \n5.000\n percent fixed-rate notes due in 2026, $\n1.00\n billion of \n4.700\n percent fixed-rate notes due in 2033, $\n1.25\n billion of \n4.875\n percent fixed-rate notes due in 2053, and $\n1.00\n billion of \n4.950\n percent fixed-rate notes due in 2063, all with interest to be paid semi-annually. We used the net cash proceeds from the offering of $\n3.96\n billion for general business purposes, including the repayment of outstanding commercial paper. \nThe aggregate amounts of maturities on long-term debt for the next five years are as follows:\n2025\n2026\n2027\n2028\n2029\nMaturities on long-term debt\n$\n780.9\n \n$\n1,529.1\n \n$\n2,515.8\n \n$\n441.6\n \n$\n3,076.1\n \nWe have converted approximately \n5\n percent of our long-term fixed-rate notes to floating rates through the use of interest rate swaps. The weighted-average effective borrowing rates based on long-term debt obligations and interest rates at December 31, 2024 and 2023, including the effects of interest rate swaps for hedged debt obligations, were \n3.95\n percent and \n3.37\n percent, respectively.\nThe aggregate amount of cash payments for interest on borrowings, net of capitalized interest, are as follows:\n2024\n2023\n2022\nCash payments for interest on borrowings\n$\n577.5\n \n$\n404.2\n \n$\n323.7\n \nIn accordance with the requirements of derivatives and hedging guidance, the portion of our fixed-rate debt obligations that is hedged as a fair value hedge is reflected in the consolidated balance sheets as an amount equal to the sum of the debt's carrying value plus the fair value adjustment representing changes in fair value of the hedged debt attributable to movements in market interest rates subsequent to the inception of the hedge.\n89\nNote 12: \nStock-Based Compensation\nOur stock-based compensation expense consists of restricted stock units (RSUs), shareholder value awards (SVAs), performance awards (PAs), and relative value awards (RVAs). \nWe recognize the fair value of stock-based compensation as expense over the requisite service period of the individual grantees, which generally equals the vesting period. We provide newly issued shares of our common stock and treasury stock to satisfy the issuance of RSU, SVA, PA, and RVA shares.\nStock-based compensation expense and the related tax benefits were as follows:\n2024\n2023\n2022\nStock-based compensation expense\n$\n645.6\n \n$\n628.5\n \n$\n371.1\n \nTax benefit\n135.6\n \n132.0\n \n77.9\n \nAt December 31, 2024, stock-based compensation awards may be granted under the 2002 Lilly Stock Plan for not more than \n48.8\n million additional shares. \nRestricted Stock Units\nRSUs are granted to certain employees and are payable in shares of our common stock. RSU shares are accounted for at fair value based upon the closing stock price on the date of grant. The corresponding expense is amortized over the vesting period, typically \nthree years\n. The weighted-average fair values of RSU awards granted during the years ended December 31, 2024, 2023, and 2022 were $\n749.74\n, $\n339.30\n, and $\n239.88\n, respectively. The number of shares ultimately issued for the RSU program remains constant with the number of shares originally granted less forfeitures. Pursuant to this program, \n0.9\n million, \n1.0\n million, and \n1.0\n million shares were granted and approximately \n0.3\n million, \n0.5\n million, and \n0.8\n million shares were issued during the years ended December 31, 2024, 2023, and 2022, respectively. We expect to issue approximately \n0.5\n million shares in 2025. As of December 31, 2024, the total estimated remaining unrecognized compensation cost related to nonvested RSUs was $\n485.1\n million, which will be amortized over the weighted-average remaining requisite service period of \n23\n months.\nShareholder Value Award Program\nSVAs are granted to officers and management and are payable in shares of our common stock. The number of shares actually issued, if any, varies depending on our stock price at the end of the \nthree-year\n vesting period compared to pre-established target stock prices. We measure the fair value of the SVA unit on the grant date using a Monte Carlo simulation model. The model utilizes multiple input variables that determine the probability of satisfying the market condition stipulated in the award grant and calculates the fair value of the award. Expected volatilities utilized in the model are based on implied volatilities from traded options on our stock, historical volatility of our stock price, and other factors. Similarly, the dividend yield is based on historical experience and our estimate of future dividend yields. The risk-free interest rate is derived from the U.S. Treasury yield curve in effect at the time of grant. \nThe weighted-average fair values of the SVA units granted during the years ended December 31, 2024, 2023, and 2022 were $\n1,030.87\n, $\n349.63\n, and $\n203.88\n, respectively, determined using the following assumptions:\n2024\n2023\n2022\nExpected dividend yield\n0.70\n \n%\n1.07\n \n%\n1.60\n \n%\nRisk-free interest rate\n4.26\n \n4.08\n \n1.57\n \nVolatility\n28.64\n \n29.87\n \n32.99\n \nPursuant to this program, approximately \n0.2\n million, \n0.3\n million, and \n0.5\n million shares were issued during the years ended December 31, 2024, 2023, and 2022, respectively. We expect to issue approximately \n0.3\n million shares in 2025. As of December 31, 2024, the total estimated remaining unrecognized compensation cost related to nonvested SVAs was $\n61.4\n million, which will be amortized over the weighted-average remaining requisite service period of \n21\n months.\n90\nPerformance Award Program\nPAs were granted to officers and management prior to 2024 and are payable in shares of our common stock. The number of PA shares actually issued, if any, varied depending on the achievement of certain pre-established earnings-per-share targets over a \ntwo-year\n period. PA shares were accounted for at fair value based upon the closing stock price on the date of grant and fully vest at the end of the measurement period. The fair values of PAs granted for the years ended December 31, 2023 and 2022 were, $\n335.86\n and $\n234.93\n, respectively. Pursuant to this program, approximately \n0.4\n million, \n0.5\n million, and \n0.7\n million shares were issued during the years ended December 31, 2024, 2023, and 2022, respectively. We expect to issue approximately \n0.6\n million shares in 2025. As of December 31, 2024, there was no remaining unrecognized compensation cost related to PAs, as we discontinued the program.\nRelative Value Award Program \nRVAs are granted to officers and management and are payable in shares of our common stock. The number of shares actually issued, if any, varies depending on the growth of our stock price at the end of the \nthree-year\n vesting period compared to our peers. We measure the fair value of the RVA unit on the grant date using a Monte Carlo simulation model. The model utilizes multiple input variables that determine the probability of satisfying the market condition stipulated in the award grant and calculates the fair value of the award. Expected volatilities utilized in the model are based on implied volatilities from traded options on our stock, historical volatility of our stock price and our peers' stock price, and other factors. Similarly, the dividend yield is based on historical experience and our estimate of future dividend yields. The risk-free interest rate is derived from the U.S. Treasury yield curve in effect at the time of grant. \nThe weighted-average fair value of the RVA units granted during the years ended December 31, 2024, 2023 and 2022 were $\n1,106.40\n, $\n397.95\n, and $\n230.00\n, respectively, determined using the following assumptions:\n2024\n2023\n2022\nExpected dividend yield\n0.70\n \n%\n1.07\n \n%\n1.60\n \n%\nRisk-free interest rate\n4.26\n \n4.08\n \n1.57\n \nVolatility\n27.69\n \n31.25\n \n32.86\n \nPursuant to this program, approximately \n0.1\n million shares were issued during each of the years ended December 31, 2024 and 2023. We expect to issue approximately \n0.1\n million shares in 2025. As of December 31, 2024, the total estimated remaining unrecognized compensation cost related to nonvested RVAs was $\n27.5\n million, which will be amortized over the weighted-average remaining requisite service period of \n22\n months.\nNote 13: \nShareholders' Equity\nIn 2024, 2023, and 2022, we repurchased $\n2.50\n billion, $\n750.0\n million, and $\n1.50\n billion, respectively, of shares associated with our share repurchase programs. \nIn 2024, we repurchased $\n2.50\n billion of shares, which completed our $\n5.00\n billion share repurchase program that our board authorized in May 2021. Our board authorized a $\n15.00\n billion share repurchase program in December 2024. \nNo\n shares were repurchased under this new program as of December 31, 2024. \nWe have \n5.0\n million authorized shares of preferred stock. As of December 31, 2024 and 2023, \nno\n preferred stock was issued.\nWe have an employee benefit trust that held \n50.0\n million shares of our common stock at both December 31, 2024 and 2023, to provide a source of funds to assist us in meeting our obligations under various employee benefit plans. The cost basis of the shares held in the trust was $\n3.01\n billion at both December 31, 2024 and 2023, and is shown as a reduction of shareholders' equity. Any dividend transactions between us and the trust are eliminated. Stock held by the trust is not considered outstanding in the computation of EPS. The assets of the trust were not used to fund any of our obligations under these employee benefit plans during the years ended December 31, 2024, 2023, and 2022.\n91\nNote 14: \nIncome Taxes\nDeferred taxes are recognized for the future tax effects of temporary differences between financial and income tax reporting based on enacted tax laws and rates. Deferred taxes related to global intangible low-taxed income (GILTI) are also recognized for the future tax effects of temporary differences.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position, based on its technical merits, will be sustained upon examination by the taxing authority. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate resolution.\nFollowing is the composition of income tax expense:\n2024\n2023\n2022\nCurrent:\nFederal\n(1)\n$\n3,312.0\n \n$\n3,017.9\n \n$\n2,153.6\n \nForeign\n1,430.3\n \n613.0\n \n547.7\n \nState\n31.2\n \n24.3\n \n45.5\n \nTotal current tax expense\n4,773.5\n \n3,655.2\n \n2,746.8\n \nDeferred:\nFederal\n(\n2,178.7\n)\n(\n2,369.0\n)\n(\n1,992.4\n)\nForeign\n(\n473.1\n)\n34.2\n \n(\n78.2\n)\nState\n(\n31.3\n)\n(\n6.2\n)\n(\n114.6\n)\nTotal deferred tax benefit\n(\n2,683.1\n)\n(\n2,341.0\n)\n(\n2,185.2\n)\nIncome taxes\n$\n2,090.4\n \n$\n1,314.2\n \n$\n561.6\n \n(1)\n The 2024, 2023, and 2022 current tax expense includes $\n129.9\n million, $\n69.3\n million, and $\n189.5\n million of tax benefit, respectively, from utilization of net operating loss and other tax carryforwards.\n \n92\nSignificant components of our deferred tax assets and liabilities as of December 31 were as follows:\n2024\n2023\nDeferred tax assets:\nCapitalized research and development\n$\n4,598.7\n \n$\n2,997.5\n \nPurchases of intangible assets\n1,781.4\n \n1,981.9\n \nSales rebates and discounts\n1,775.7\n \n1,632.5\n \nCorrelative tax adjustments\n1,604.3\n \n1,031.3\n \nTax loss and other tax carryforwards\n586.9\n \n527.2\n \nTax credit carryforwards\n577.0\n \n577.0\n \nCompensation and benefits\n565.2\n \n521.4\n \nForeign tax redeterminations\n334.8\n \n323.7\n \nOperating lease liabilities\n240.5\n \n253.3\n \nOther\n358.6\n \n463.4\n \nTotal gross deferred tax assets\n12,423.1\n \n10,309.2\n \nValuation allowances\n(\n963.7\n)\n(\n913.5\n)\nTotal deferred tax assets\n11,459.4\n \n9,395.7\n \nDeferred tax liabilities:\nIntangibles\n(\n1,176.4\n)\n(\n1,338.2\n)\nEarnings of foreign subsidiaries\n(\n773.1\n)\n(\n796.6\n)\nPrepaid employee benefits\n(\n611.0\n)\n(\n460.6\n)\nProperty and equipment\n(\n557.6\n)\n(\n495.2\n)\nOperating lease assets\n(\n219.1\n)\n(\n237.1\n)\nFinancial instruments\n(\n137.3\n)\n(\n75.1\n)\nInventories\n(\n58.2\n)\n(\n619.5\n)\nTotal deferred tax liabilities\n(\n3,532.7\n)\n(\n4,022.3\n)\nDeferred tax assets - net\n$\n7,926.7\n \n$\n5,373.4\n \nThe deferred tax asset and related valuation allowance amounts for U.S. federal, international, and state net operating losses and tax credits shown above have been reduced for differences between financial reporting and tax return filings.\nAt December 31, 2024, based on filed tax returns we have tax credit carryforwards and carrybacks of $\n1.13\n billion available to reduce future income taxes; $\n148.8\n million, if unused, will expire in 2026, and $\n53.6\n million, if unused, will expire between 2030 and 2044. The remaining portion of the tax credit carryforwards is related to federal tax credits of $\n68.0\n million, international tax credits of $\n109.4\n million, and state tax credits of $\n754.8\n million, all of which are fully reserved.\nAt December 31, 2024, based on filed tax returns we have net operating losses and other carryforwards for U.S. federal and international tax purposes of $\n1.74\n billion available to reduce future income taxes: $\n5.8\n million will expire by 2029, $\n355.7\n million will expire between 2030 and 2044, and $\n861.5\n million of the carryforwards will never expire. The remaining net operating losses and other carryforwards for U.S. federal and international tax purposes of $\n481.0\n million and $\n32.4\n million, respectively, are fully reserved. Deferred tax assets related to state net operating losses and other carryforwards of $\n282.6\n million are fully reserved as of December 31, 2024.\nAt December 31, 2024 and 2023, prepaid expenses included prepaid taxes of $\n7.13\n billion and $\n4.26\n billion, respectively.\nDomestic and Puerto Rican companies contributed approximately \n20\n percent, \n14\n percent, and \n33\n percent for the years ended December 31, 2024, 2023, and 2022, respectively, to consolidated income before income taxes. \n93\nSubstantially all of the unremitted earnings of our foreign subsidiaries are considered not to be indefinitely reinvested for continued use in our foreign operations. At December 31, 2024 and 2023, we accrued an immaterial amount of foreign withholding taxes and state income taxes that would be owed upon future distributions of unremitted earnings of our foreign subsidiaries that are not indefinitely reinvested. For the amount considered to be indefinitely reinvested, it is not practicable to determine the amount of the related deferred income tax liability due to the complexities in the tax laws and assumptions we would have to make.\nCash payments of U.S. federal, state, and foreign income taxes, net of refunds, were as follows: \n2024\n2023\n2022\nCash payments of income taxes\n$\n6,562.1\n \n$\n5,558.8\n \n$\n2,672.9\n \n As of December 31, 2024, we have noncurrent income tax payables of $\n490.7\n million that we expect to pay in 2026 and $\n3.57\n billion that we cannot reasonably estimate the timing of future cash outflows.\nFollowing is a reconciliation of the consolidated income tax expense applying the U.S. federal statutory rate to income before income taxes to reported consolidated income tax expense: \n2024\n2023\n2022\nIncome tax at the U.S. federal statutory tax rate\n$\n2,662.9\n \n$\n1,376.5\n \n$\n1,429.3\n \nAdd (deduct):\nNon-deductible acquired IPR&D\n(1)\n566.0\n \n677.2\n \n68.3\n \nForeign-derived intangible income deduction\n(\n307.0\n)\n(\n236.7\n)\n(\n287.5\n)\nInternational operations, including Puerto Rico\n(2)\n(\n302.1\n)\n(\n187.1\n)\n(\n299.5\n)\nGeneral business credits\n(\n290.6\n)\n(\n258.0\n)\n(\n155.0\n)\nStock-based compensation\n(3)\n(\n184.7\n)\n(\n79.9\n)\n(\n48.9\n)\nValuation allowance release\n(\n23.9\n)\n(\n4.2\n)\n(\n116.4\n)\nOther\n(\n30.2\n)\n26.4\n \n(\n28.7\n)\nIncome taxes\n$\n2,090.4\n \n$\n1,314.2\n \n$\n561.6\n \n(1) \nNon-deductible acquired IPR&D was primarily related to the acquisitions of Morphic in 2024, and DICE, Versanis, and Emergence in 2023. See Note 3 for additional information related to acquisitions.\n(2) \nIncludes the impact of GILTI tax, Puerto Rico Excise Tax (for 2022), and other U.S. taxation of foreign income.\n(3) \nIncludes excess tax benefits from stock-based compensation and non-deductible stock-based compensation.\nA reconciliation of the beginning and ending amount of gross unrecognized tax benefits is as follows:\n2024\n2023\n2022\nBeginning balance at January 1\n$\n3,395.0\n \n$\n2,987.0\n \n$\n2,798.3\n \nAdditions based on tax positions related to the current year\n694.2\n \n364.3\n \n274.2\n \nAdditions for tax positions of prior years\n41.7\n \n78.2\n \n34.6\n \nReductions for tax positions of prior years\n(\n63.1\n)\n(\n39.0\n)\n(\n10.9\n)\nSettlements\n(\n33.4\n)\n(\n4.7\n)\n(\n44.8\n)\nLapses of statutes of limitation\n(\n8.9\n)\n(\n21.5\n)\n(\n11.8\n)\nChanges related to the impact of foreign currency translation\n(\n49.7\n)\n30.7\n \n(\n52.6\n)\nEnding balance at December 31\n$\n3,975.8\n \n$\n3,395.0\n \n$\n2,987.0\n \nThe total amount of unrecognized tax benefits that, if recognized, would affect our effective tax rate was $\n2.62\n billion at December 31, 2024.\nWe file U.S. federal, foreign, and various state and local income tax returns. We are no longer subject to U.S. federal income tax examination for years before 2016. In most major foreign and state jurisdictions, we are no longer subject to income tax examination for years before 2014.\nThe U.S. examination of tax years 2019-2021 began in 2023 and remains ongoing. For tax years 2016-2018, we are pursuing competent authority assistance through the Mutual Agreement Procedure (MAP) process for the pricing of certain intercompany transactions. The resolution of both audit periods will likely extend beyond the next 12 months.\n94\nInterest and penalties related to unrecognized tax benefits are recognized in income tax expense and were not material for the years ended December 31, 2024, 2023, and 2022. Our accrued interest and penalties related to unrecognized tax benefits were $\n594.2\n million and $\n414.9\n million at December 31, 2024 and 2023, respectively.\nNote 15: \nRetirement Benefits\nWe use a measurement date of December 31 to determine the change in benefit obligation, change in plan assets, funded status, and amounts recognized in the consolidated balance sheets at December 31 for our defined benefit pension and retiree health benefit plans, which were as follows: \n \nDefined Benefit\nPension Plans\nRetiree Health\nBenefit Plans\n2024\n2023\n2024\n2023\nChange in benefit obligation:\nBenefit obligation at beginning of year\n$\n14,257.9\n \n$\n13,222.0\n \n$\n1,310.3\n \n$\n1,258.8\n \nService cost\n338.7\n \n290.4\n \n35.4\n \n31.8\n \nInterest cost\n661.7\n \n648.2\n \n62.1\n \n61.3\n \nActuarial (gain) loss\n(\n1,083.6\n)\n590.5\n \n(\n96.5\n)\n34.5\n \nBenefits paid\n(\n634.3\n)\n(\n610.5\n)\n(\n82.2\n)\n(\n80.6\n)\nForeign currency exchange rate changes and other adjustments\n(\n125.0\n)\n117.3\n \n(\n6.4\n)\n4.5\n \nBenefit obligation at end of year\n13,415.4\n \n14,257.9\n \n1,222.7\n \n1,310.3\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n13,708.7\n \n13,195.8\n \n2,580.3\n \n2,492.5\n \nActual return on plan assets\n583.2\n \n881.9\n \n58.5\n \n166.8\n \nEmployer contribution\n115.3\n \n120.6\n \n9.2\n \n1.7\n \nBenefits paid\n(\n634.3\n)\n(\n610.5\n)\n(\n82.2\n)\n(\n80.6\n)\nForeign currency exchange rate changes and other adjustments\n(\n114.5\n)\n120.9\n \n—\n \n(\n0.1\n)\nFair value of plan assets at end of year\n13,658.4\n \n13,708.7\n \n2,565.8\n \n2,580.3\n \nFunded status\n243.0\n \n(\n549.2\n)\n1,343.1\n \n1,270.0\n \nUnrecognized net actuarial loss\n2,662.9\n \n3,357.9\n \n149.3\n \n109.6\n \nUnrecognized prior service (benefit) cost\n4.1\n \n6.4\n \n(\n3.7\n)\n(\n9.5\n)\nNet amount recognized\n$\n2,910.0\n \n$\n2,815.1\n \n$\n1,488.7\n \n$\n1,370.1\n \nAmounts recognized in the consolidated balance sheets consisted of:\nOther noncurrent assets\n$\n1,481.6\n \n$\n810.6\n \n$\n1,484.6\n \n$\n1,427.7\n \nOther current liabilities\n(\n71.4\n)\n(\n70.4\n)\n(\n8.2\n)\n(\n8.3\n)\nAccrued retirement benefits\n(\n1,167.2\n)\n(\n1,289.4\n)\n(\n133.3\n)\n(\n149.4\n)\nAccumulated other comprehensive loss\n2,667.0\n \n3,364.3\n \n145.6\n \n100.1\n \nNet amount recognized\n$\n2,910.0\n \n$\n2,815.1\n \n$\n1,488.7\n \n$\n1,370.1\n \nThe unrecognized net actuarial (gain) loss and unrecognized prior service (benefit) cost have not yet been recognized in net periodic pension costs and were included in accumulated other comprehensive loss at December 31, 2024 and 2023. Unrecognized net actuarial (gain) loss for the U.S. and Puerto Rico defined benefit pension and retiree health benefit plans are amortized over the average remaining service period of active employees in the plan. The amortization of actuarial (gains) losses for U.S. and Puerto Rico defined benefit pension plans are determined by using a 10% corridor of the greater of the market related value of assets or the projected benefit obligations.\nThe $\n930.1\n million decrease in benefit obligation in 2024 was primarily driven by increases in the discount rates. The $\n1.09\n billion increase in benefit obligation in 2023 was primarily driven by decreases in the discount rates.\n95\nThe following represents our weighted-average assumptions:\n \nDefined Benefit\nPension Plans\nRetiree Health\nBenefit Plans\n2024\n2023\n2022\n2024\n2023\n2022\nWeighted-average assumptions used to determine net periodic benefit costs:\nDiscount rate\n4.8\n \n%\n5.1\n \n%\n2.8\n \n%\n5.0\n \n%\n5.2\n \n%\n3.0\n \n%\nRate of compensation increase\n4.3\n \n4.3\n \n3.5\n \nExpected return on plan assets\n8.1\n \n8.1\n \n8.1\n \n7.3\n \n7.3\n \n7.3\n \nWeighted-average assumptions used to determine benefit obligation as of December 31:\nDiscount rate\n5.5\n \n%\n4.8\n \n%\n5.1\n \n%\n5.7\n \n%\n5.0\n \n%\n5.2\n \n%\nRate of compensation increase\n4.0\n \n4.3\n \n4.3\n \nWe annually evaluate the expected return on plan assets in our defined benefit pension and retiree health benefit plans. In evaluating the expected return on plan assets, we consider many factors, with a primary analysis of current and projected market conditions; asset returns and asset allocations; and the views of leading financial advisers and economists. In U.S. and Puerto Rico, the expected return on plan assets uses a market-related value of assets. For U.S. dollar denominated investment grade debt securities and derivatives, the market-related value of assets is the actual fair value. For all other asset categories, the market-related value of assets uses a method that recognizes investment gains and losses arising from the difference between expected and actual returns on plan assets over a five-year period.\nWe may also review our historical assumptions compared with actual results, as well as the assumptions and trend rates utilized by similar plans, where applicable. \nGiven the design of our retiree health benefit plans, healthcare-cost trend rates do not have a material impact on our financial condition or results of operations.\nExpected benefit payments, which reflect expected future service, are as follows:\n2025\n2026\n2027\n2028\n2029\n2030 - 2034\nDefined benefit pension plans\n$\n677.0\n \n$\n694.4\n \n$\n721.4\n \n$\n746.9\n \n$\n778.4\n \n$\n4,388.7\n \nRetiree health benefit plans\n93.4\n \n93.6\n \n94.4\n \n95.0\n \n95.1\n \n477.5\n \nAmounts relating to defined benefit pension plans with projected benefit obligations in excess of plan assets were as follows at December 31:\n \n2024\n2023\nProjected benefit obligation\n$\n2,297.0\n \n$\n2,395.3\n \nFair value of plan assets\n1,058.4\n \n1,035.4\n \nAmounts relating to defined benefit pension plans and retiree health benefit plans with accumulated benefit obligations in excess of plan assets were as follows at December 31:\nDefined Benefit\nPension Plans\nRetiree Health \nBenefit Plans\n \n2024\n2023\n2024\n2023\nAccumulated benefit obligation\n$\n1,655.8\n \n$\n1,659.5\n \n$\n141.5\n \n$\n157.7\n \nFair value of plan assets\n595.0\n \n564.3\n \n—\n \n—\n \nThe total accumulated benefit obligation for our defined benefit pension plans was $\n12.18\n billion and $\n12.74\n billion at December 31, 2024 and 2023, respectively.\n96\nNet periodic (benefit) cost included the following components:\n \nDefined Benefit\nPension Plans\nRetiree Health\nBenefit Plans\n2024\n2023\n2022\n2024\n2023\n2022\nComponents of net periodic (benefit) cost:\nService cost\n$\n338.7\n \n$\n290.4\n \n$\n351.7\n \n$\n35.4\n \n$\n31.8\n \n$\n46.6\n \nInterest cost\n661.7\n \n648.2\n \n398.1\n \n62.1\n \n61.3\n \n37.8\n \nExpected return on plan assets\n(\n1,112.2\n)\n(\n1,055.0\n)\n(\n947.6\n)\n(\n192.3\n)\n(\n182.1\n)\n(\n152.1\n)\nAmortization of prior service (benefit) cost\n2.1\n \n2.4\n \n2.4\n \n(\n5.6\n)\n(\n52.9\n)\n(\n54.8\n)\nRecognized actuarial (gain) loss\n125.1\n \n122.0\n \n342.4\n \n(\n2.6\n)\n(\n5.8\n)\n0.9\n \nNet periodic (benefit) cost\n$\n15.4\n \n$\n8.0\n \n$\n147.0\n \n$\n(\n103.0\n)\n$\n(\n147.7\n)\n$\n(\n121.6\n)\nThe following represents the amounts recognized in other comprehensive income (loss) for the years ended December 31:\nDefined Benefit\nPension Plans\nRetiree Health\nBenefit Plans\n2024\n2023\n2022\n2024\n2023\n2022\nActuarial gain (loss) arising during period\n$\n554.5\n \n$\n(\n763.9\n)\n$\n823.6\n \n$\n(\n37.2\n)\n$\n(\n49.8\n)\n$\n(\n552.2\n)\nAmortization of prior service (benefit) cost included in net income\n2.1\n \n2.4\n \n2.4\n \n(\n5.6\n)\n(\n52.9\n)\n(\n54.8\n)\nAmortization of net actuarial (gain) loss included in net income\n125.1\n \n122.0\n \n342.4\n \n(\n2.6\n)\n(\n5.8\n)\n0.9\n \nForeign currency exchange rate changes and other\n15.6\n \n(\n29.2\n)\n55.5\n \n(\n0.1\n)\n0.7\n \n(\n0.9\n)\nTotal other comprehensive income (loss) during period\n$\n697.3\n \n$\n(\n668.7\n)\n$\n1,223.9\n \n$\n(\n45.5\n)\n$\n(\n107.8\n)\n$\n(\n607.0\n)\nWe have defined contribution savings plans that cover our eligible employees worldwide. The purpose of these plans is generally to provide additional financial security during retirement by providing employees with an incentive to save. Our contributions to the plans are based on employee contributions and the level of our match. Expenses under the plans totaled $\n249.7\n million, $\n222.6\n million, and $\n170.6\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nBenefit Plan Investments\nOur benefit plan investment policies are set with specific consideration of return and risk requirements in relationship to the respective liabilities. U.S. and Puerto Rico plans represent approximately \n85\n percent of our global investments. Given the long-term nature of our liabilities, these plans have the flexibility to manage an above-average degree of risk in the asset portfolios. At the investment-policy level, there are no specifically prohibited investments. However, within individual investment manager mandates, restrictions and limitations are contractually set to align with our investment objectives, ensure risk control, and limit concentrations.\nWe manage our portfolio to minimize concentration of risk by allocating funds within asset categories. In addition, within a category we use different managers with various management objectives to eliminate any significant concentration of risk.\nOur global benefit plans may enter into contractual arrangements (derivatives) to implement the local investment policy or manage particular portfolio risks. Derivatives are principally used to increase or decrease exposure to a particular public equity, fixed income, commodity, or currency market more rapidly or less expensively than could be accomplished through the use of the cash markets. The plans utilize both exchange-traded and over-the-counter instruments. The maximum exposure to either a market or counterparty credit loss is limited to the carrying value of the receivable, and is managed within contractual limits. We expect all of our counterparties to meet their obligations. The gross values of these derivative receivables and payables are not material to the global asset portfolio, and their values are reflected within the tables below.\n97\nThe defined benefit pension and retiree health benefit plan allocation for the U.S. and Puerto Rico currently comprises approximately \n80\n percent growth investments and \n20\n percent fixed-income investments. The growth investment allocation encompasses U.S. and international public equity securities, hedge funds, private equity-like investments, and real estate. These portfolio allocations are intended to reduce overall risk by providing diversification, while seeking moderate to high returns over the long term.\nPublic equity securities are well diversified and invested in U.S. and international small-to-large companies across various asset managers and styles. The remaining portion of the growth portfolio is invested in private alternative investments.\nFixed-income investments primarily consist of fixed-income securities in U.S. treasuries and agencies, emerging market debt obligations, corporate bonds, bank loans, mortgage-backed securities, commercial mortgage-backed obligations, and any related repurchase agreements.\nHedge funds are privately owned institutional investment funds that generally have moderate liquidity. Hedge funds seek specified levels of absolute return regardless of overall market conditions, and generally have low correlations to public equity and debt markets. Hedge funds often invest substantially in financial market instruments (stocks, bonds, commodities, currencies, derivatives, etc.) using a very broad range of trading activities to manage portfolio risks. Hedge fund strategies focus primarily on security selection and seek to be neutral with respect to market moves. Common groupings of hedge fund strategies include relative value, tactical, and event driven. Relative value strategies include arbitrage, when the same asset can simultaneously be bought and sold at different prices, achieving an immediate profit. Tactical strategies often take long and short positions to reduce or eliminate overall market risks while seeking a particular investment opportunity. Event strategy opportunities can evolve from specific company announcements such as mergers and acquisitions, and typically have little correlation to overall market directional movements. Our hedge fund investments are made through limited partnership interests in fund-of-funds structures and directly into hedge funds. Plan holdings in hedge funds are valued based on net asset values (NAVs) calculated by each fund or general partner, as applicable, and we have the ability to redeem these investments at NAV.\nPrivate equity-like investment funds typically have low liquidity and are made through long-term partnerships or joint ventures that invest in pools of capital invested in primarily non-publicly traded entities. Underlying investments include venture capital (early stage investing), buyout, special situations, private debt, and private real estate investments. Private equity management firms typically acquire and then reorganize private companies to create increased long term value. Private equity-like funds usually have a limited life of approximately 10-15 years, and require a minimum investment commitment from their limited partners. Our private equity-like investments are made both directly into funds and through fund-of-funds structures to ensure broad diversification of management styles and assets across the portfolio. Plan holdings in private equity-like investments are valued using the value reported by the partnership, adjusted for known cash flows and significant events through our reporting date. Values provided by the partnerships are primarily based on analysis of and judgments about the underlying investments. Inputs to these valuations include underlying NAVs, discounted cash flow valuations, comparable market valuations, and may also include adjustments for currency, credit, liquidity and other risks as applicable. The vast majority of these private partnerships provide us with annual audited financial statements including their compliance with fair valuation procedures consistent with applicable accounting standards.\nReal estate is composed of public holdings. Real estate investments in registered investment companies that trade on an exchange are classified as Level 1 on the fair value hierarchy. Real estate investments in funds measured at fair value on the basis of NAV provided by the fund manager are classified as such. These NAVs are developed with inputs including discounted cash flow, independent appraisal, and market comparable analyses.\nOther assets include cash and cash equivalents and mark-to-market value of derivatives.\nThe cash value of the trust-owned insurance contract is primarily invested in investment-grade publicly traded equity and fixed-income securities.\nOther than hedge funds, private equity-like investments, and a portion of the real estate holdings, which are discussed above, we determine fair values based on a market approach using quoted market values, significant other observable inputs for identical or comparable assets or liabilities, or discounted cash flow analyses.\n98\nThe fair values of our defined benefit pension plan and retiree health plan assets as of December 31, 2024 by asset category were as follows:\n \n \nFair Value Measurements Using\nAsset Class\nTotal\nQuoted Prices in Active Markets for\nIdentical Assets\n(Level 1)\nSignificant\nObservable \nInputs\n(Level 2)\nSignificant\nUnobservable Inputs\n(Level 3)\nInvestments Valued at Net Asset Value\n(1)\nDefined Benefit Pension Plans\nPublic equity securities:\nU.S.\n$\n1,905.6\n \n$\n602.4\n \n$\n0.3\n \n$\n—\n \n$\n1,302.9\n \nInternational\n1,517.3\n \n453.7\n \n336.7\n \n—\n \n726.9\n \nFixed income:\nDeveloped markets\n2,343.2\n \n20.6\n \n2,161.9\n \n0.1\n \n160.6\n \nDeveloped markets - repurchase agreements\n(\n641.0\n)\n—\n \n(\n641.0\n)\n—\n \n—\n \nEmerging markets\n320.4\n \n21.0\n \n34.9\n \n—\n \n264.5\n \nPrivate alternative investments:\nHedge funds\n3,057.6\n \n—\n \n—\n \n—\n \n3,057.6\n \nEquity-like funds\n3,931.5\n \n—\n \n—\n \n9.4\n \n3,922.1\n \nReal estate\n450.9\n \n301.0\n \n—\n \n—\n \n149.9\n \nOther\n772.9\n \n10.2\n \n25.9\n \n—\n \n736.8\n \nTotal\n$\n13,658.4\n \n$\n1,408.9\n \n$\n1,918.7\n \n$\n9.5\n \n$\n10,321.3\n \nRetiree Health Benefit Plans\nPublic equity securities:\nU.S.\n$\n184.2\n \n$\n56.9\n \n$\n—\n \n$\n—\n \n$\n127.3\n \nInternational\n103.7\n \n41.0\n \n—\n \n—\n \n62.7\n \nFixed income:\nDeveloped markets\n63.0\n \n—\n \n63.0\n \n—\n \n—\n \nEmerging markets\n26.0\n \n—\n \n—\n \n—\n \n26.0\n \nPrivate alternative investments:\nHedge funds\n285.2\n \n—\n \n—\n \n—\n \n285.2\n \nEquity-like funds\n346.1\n \n—\n \n—\n \n0.9\n \n345.2\n \nCash value of trust owned insurance contract\n1,464.9\n \n—\n \n1,464.9\n \n—\n \n—\n \nReal estate\n28.4\n \n28.4\n \n—\n \n—\n \n—\n \nOther\n64.3\n \n3.6\n \n(\n7.0\n)\n—\n \n67.7\n \nTotal\n$\n2,565.8\n \n$\n129.9\n \n$\n1,520.9\n \n$\n0.9\n \n$\n914.1\n \n(1) \nCertain investments that are measured at fair value using the NAV per share (or its equivalent) as a practical expedient have not been classified in the fair value hierarchy.\nNo material transfers between Level 1, Level 2, or Level 3 occurred during the year ended December 31, 2024. The activity in the Level 3 investments during the year ended December 31, 2024 was not material.\n99\nThe fair values of our defined benefit pension plan and retiree health plan assets as of December 31, 2023 by asset category were as follows:\n \n \nFair Value Measurements Using\nAsset Class\nTotal\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant Observable Inputs\n(Level 2)\nSignificant Unobservable Inputs\n(Level 3)\nInvestments Valued at Net Asset Value\n(1)\nDefined Benefit Pension Plans\nPublic equity securities:\nU.S.\n$\n1,379.7\n \n$\n490.5\n \n$\n0.3\n \n$\n—\n \n$\n888.9\n \nInternational\n1,408.9\n \n441.2\n \n333.4\n \n—\n \n634.3\n \nFixed income:\nDeveloped markets\n2,783.9\n \n21.2\n \n2,597.3\n \n0.1\n \n165.3\n \nDeveloped markets - repurchase agreements\n(\n772.8\n)\n13.2\n \n(\n786.0\n)\n—\n \n—\n \nEmerging markets\n295.6\n \n10.4\n \n35.7\n \n—\n \n249.5\n \nPrivate alternative investments:\nHedge funds\n3,125.9\n \n—\n \n—\n \n—\n \n3,125.9\n \nEquity-like funds\n4,093.7\n \n—\n \n—\n \n25.1\n \n4,068.6\n \nReal estate\n369.7\n \n261.9\n \n—\n \n—\n \n107.8\n \nOther\n1,024.1\n \n170.8\n \n42.6\n \n—\n \n810.7\n \nTotal\n$\n13,708.7\n \n$\n1,409.2\n \n$\n2,223.3\n \n$\n25.2\n \n$\n10,051.0\n \nRetiree Health Benefit Plans\nPublic equity securities:\nU.S.\n$\n127.0\n \n$\n44.2\n \n$\n—\n \n$\n—\n \n$\n82.8\n \nInternational\n89.9\n \n38.2\n \n—\n \n—\n \n51.7\n \nFixed income:\nDeveloped markets\n74.9\n \n—\n \n74.9\n \n—\n \n—\n \nEmerging markets\n23.4\n \n—\n \n—\n \n—\n \n23.4\n \nPrivate alternative investments:\nHedge funds\n281.2\n \n—\n \n—\n \n—\n \n281.2\n \nEquity-like funds\n335.1\n \n—\n \n—\n \n2.4\n \n332.7\n \nCash value of trust owned insurance contract\n1,526.5\n \n—\n \n1,526.5\n \n—\n \n—\n \nReal estate\n24.5\n \n24.5\n \n—\n \n—\n \n—\n \nOther\n97.8\n \n23.2\n \n2.1\n \n—\n \n72.5\n \nTotal\n$\n2,580.3\n \n$\n130.1\n \n$\n1,603.5\n \n$\n2.4\n \n$\n844.3\n \n(1) \nCertain investments that are measured at fair value using the NAV per share (or its equivalent) as a practical expedient have not been classified in the fair value hierarchy.\nNo material transfers between Level 1, Level 2, or Level 3 occurred during the year ended December 31, 2023. The activity in the Level 3 investments during the year ended December 31, 2023 was not material.\nIn 2025, we expect to contribute approximately $\n30\n million to our defined benefit pension plans to satisfy minimum funding requirements for the year. We do not currently expect to make material discretionary contributions in 2025.\n100\nNote 16: \nContingencies\nWe are involved in various lawsuits, claims, government investigations and other legal proceedings that arise in the ordinary course of business. These claims or proceedings can involve various types of parties, including governments, regulatory agencies, competitors, customers, suppliers, service providers, licensees, employees, or shareholders, among others. These matters may involve patent infringement, antitrust, securities, pricing, access, sales and marketing practices, environmental, commercial, contractual rights, licensing obligations, health and safety matters, consumer fraud, employment matters, product liability, insurance coverage, and regulatory compliance, among others. The resolution of these matters often develops over a long period of time and expectations can change as a result of new findings, rulings, appeals or settlement arrangements. Legal proceedings that are significant or that we believe could become significant or material are described below. \nWe are defending against the legal proceedings in which we are named as defendants vigorously. It is not possible to determine the final outcome of these matters, and, unless otherwise noted, we cannot reasonably estimate the maximum potential exposure or the range of possible loss in excess of amounts accrued for any of these matters; however, we believe that the resolution of all such matters will not have a material adverse effect on our consolidated financial position or liquidity, but could possibly be material to our consolidated results of operations in any one accounting period.\nLitigation accruals and environmental liabilities and the related estimated insurance recoverables are reflected on a gross basis as liabilities and assets, respectively, on our consolidated balance sheets. With respect to the product liability claims currently asserted against us, we have accrued for our estimated exposures to the extent they are both probable and reasonably estimable based on the information available to us. We accrue for certain product liability claims incurred but not filed to the extent we can formulate a reasonable estimate of their costs. We estimate these expenses based primarily on historical claims experience and data regarding product usage. Legal defense costs expected to be incurred in connection with significant product liability loss contingencies are accrued when both probable and reasonably estimable.\nBecause of the nature of pharmaceutical products, it is possible that we could become subject to large numbers of additional product liability and related claims in the future. Due to a very restrictive market for litigation liability insurance, we are self-insured for litigation liability losses for all our currently and previously marketed products.\n \nPatent Matters\nEmgality Patent Litigation\nIn September 2018, Teva Pharmaceuticals International GmbH and Teva Pharmaceuticals USA, Inc. (collectively, Teva) filed a complaint in the U.S. District Court for the District of Massachusetts alleging that Lilly's launch and continued sales of Emgality infringed various claims in \nthree\n Teva patents. In November 2022, following a trial, a jury returned a verdict in favor of Teva. In September 2023, the trial court overruled the jury verdict, found all asserted claims invalid, and entered judgment in Lilly's favor. In October 2023, Teva appealed to the U.S. Court of Appeals for the Federal Circuit. The appeal is pending.\nEnvironmental Matters\n \nSuperfund Matters\nUnder the Comprehensive Environmental Response, Compensation, and Liability Act, commonly known as \"Superfund,\" we have been designated as one of several potentially responsible parties with respect to the cleanup of fewer than \n10\n sites. Under Superfund, each responsible party may be jointly and severally liable for the entire amount of the cleanup.\nBrazil Litigation – Cosmopolis Facility\nLabor Attorney Litigation\n101\nIn March 2008, the state Labor Public Attorney (LPA) filed a public civil action against Eli Lilly do Brasil Limitada (Lilly Brasil) in the Labor Court of Paulinia, State of Sao Paulo, alleging harm to employees and former employees from alleged exposure to soil and groundwater contaminants at a former manufacturing facility in Cosmopolis, operated by the company between 1977 and 2003. In May 2014, the trial court ruled against Lilly Brasil, ordering it to undertake several remedial and compensatory actions, including health coverage for a class of individuals and certain of their children. The trial court's ruling included a liquidated award of \n300\n million Brazilian reais, which, when adjusted for inflation, is approximately \n1.4\n billion Brazilian reais (approximately $\n226\n million as of December 31, 2024). In July 2018, the appeals court generally affirmed the trial court's ruling. Lilly Brasil has appealed to the superior labor court (TST).\nIn July 2019, at the LPA's request, the trial court ordered a freeze of Lilly Brasil's immovable property in the amount of \n500\n million Brazilian reais, which was reduced on Lilly Brasil's appeal and, when adjusted for inflation, is approximately \n145\n million Brazilian reais (approximately $\n23\n million as of December 31, 2024). Both parties have appealed this order to the TST. \nThe trial court is currently assessing the status of Lilly Brasil's compliance with the obligations as to the land, and an inspection in the industrial plant occurred in October 2023.\nFormer Employee Litigation\nVarious former employees have filed related claims against Lilly Brasil in the trial court. These lawsuits are at various stages in the litigation process.\nPricing Matters\n340B Litigation and Investigations\nIn January 2021, we filed a lawsuit in the U.S. District Court for the Southern District of Indiana against the U.S. Department of Health and Human Services (HHS), the Secretary of HHS, the Health Resources and Services Administration (HRSA), and the Administrator of HRSA. The lawsuit challenges HHS's December 2020 advisory opinion that the 340B program requires drug manufacturers to deliver discounts to all contract pharmacies, as well as HHS's December 2020 administrative dispute resolution (ADR) regulations. It seeks a declaratory judgment that the defendants violated the Administrative Procedure Act (APA) and the U.S. Constitution, a preliminary injunction enjoining implementation of the ADR process and application of the advisory opinion, and other related relief. In March 2021, the court preliminarily enjoined the government's use of the ADR process as to us. In May 2021, we amended the complaint to add claims related to a May 2021 letter from HRSA asserting that Lilly's contract pharmacy policy violated the 340B statute. In October 2021, the court granted in part and denied in part the parties' cross-motions for summary judgment. Both parties appealed to the U.S. Court of Appeals for the Seventh Circuit. The appeal remains pending.\nWe received a civil investigative subpoena in February 2021 from the Office of the Attorney General for the State of Vermont relating to the sale of pharmaceutical products to Vermont covered entities under the 340B program. We are cooperating with the subpoena. \nWe have been named in various ADR petitions, filed in 2021, 2023, and 2024, seeking declaratory, injunctive, and/or monetary relief related to the 340B program. In light of the preliminary injunction order described above, these petitions are being held in abeyance as to us.\nIn July 2021, Mosaic Health, Inc. filed a putative class action lawsuit in the U.S. District Court for the Western District of New York against us, Sanofi-Aventis U.S., LLC (Sanofi), Novo Nordisk Inc. (Novo Nordisk), and AstraZeneca Pharmaceuticals LP (AstraZeneca), alleging antitrust and unjust enrichment claims related to the defendants' 340B programs. In October 2021, an amended complaint added Central Virginia Health Services, Inc. as a plaintiff. In September 2022, the court dismissed the amended complaint for failure to state a claim but allowed the plaintiffs to move for leave to file a second amended complaint. In January 2024, the court denied the plaintiffs' motion for leave to amend and dismissed the case. In February 2024, the plaintiffs appealed to the U.S. Court of Appeals for the Second Circuit. The appeal remains pending. \nWe have multiple other challenges against HHS and related parties related to interpretations and actions under the 340B program.\n102\nInsulin Pricing Litigation\nSince 2017, various plaintiffs, including consumers, states and state attorneys general, counties, municipalities, Native American tribes, school districts, wholesalers, third-party payers, and others, have filed lawsuits, including putative class actions, against us, other manufacturers, pharmacy benefit managers, and others, relating to the pricing of insulin medications, and in some cases other diabetes medications, and rebates paid by manufacturers to pharmacy benefit managers. The complaints in the various lawsuits assert a variety of claims, including among others consumer protection, unfair or deceptive trade practices, fraud, false advertising, unjust enrichment, civil conspiracy, racketeering, antitrust, and unfair competition claims. Most cases have been coordinated or consolidated for pretrial proceedings in a multidistrict litigation (MDL) pending in the U.S. District Court for the District of New Jersey. The lawsuits are at various stages in the litigation process.\nIn the first-filed case, a putative consumer class action, we and the plaintiffs reached a proposed settlement in May 2023. In January 2024, the court denied the plaintiffs' motion for class certification. We and the plaintiffs subsequently terminated our proposed settlement and stipulated that the court's ruling denying class certification applied to Lilly. The MDL court has issued various case management orders, including but not limited to orders establishing separate tracks for state attorney general claims (State AG Track), putative class actions (Class Action Track), and non-class suits by self-funded payers (Self-Funded Payer Track).\nIn January 2022, the Michigan attorney general filed a petition in Michigan state court seeking authorization to investigate Lilly for potential violations of the Michigan Consumer Protection Act (MCPA), along with a complaint seeking a declaratory judgment that the state has authority to investigate Lilly's sale of insulin under the MCPA. The court authorized the proposed investigation and the issuance of civil investigative subpoenas. In April 2022, however, the parties entered into a stipulation providing that the state will not issue any civil investigative subpoena to us under the MCPA until the declaratory judgment action is resolved, and in July 2022, the court dismissed the case in its entirety. In June 2023, the Michigan Court of Appeals affirmed the judgment in our favor. In August 2023, the state filed an application for leave to appeal to the Michigan Supreme Court, and oral argument was held in October 2024. The state's request for leave to appeal remains pending.\nLilly has entered into settlement agreements with two states to resolve allegations relating to insulin pricing. In particular, in February 2024, after discovery, Lilly entered into a non-monetary settlement with the Minnesota attorney general's office that resolved a lawsuit filed by Minnesota in 2018; and Lilly entered into a similar non-monetary settlement with the New York attorney general’s office in May 2023. These agreements involved no monetary payments and no admission of wrongdoing or liability.\nInsulin and Other Pricing Investigations\nWe have been subject to various investigations and received subpoenas, civil investigative demands, information requests, interrogatories, and other inquiries from various governmental entities related to pricing issues, including the pricing and sale of insulin medications, and in some instances certain other diabetes medications, and/or calculations of average manufacturer price and best price. These include subpoenas from the Vermont attorney general office, civil investigative demands from the U.S. Department of Justice, the U.S. Federal Trade Commission, and the Colorado, Indiana, Louisiana, Oregon, Texas, and Washington attorney general offices, as well as information requests from the California, Florida, Hawaii, Mississippi, New Mexico, Nevada, and Washington D.C. attorney general offices. \nTo the extent the foregoing governmental entities have not filed lawsuits, we are cooperating with the various investigations, subpoenas, and inquiries.\nAverage Manufacturer Price Litigation\nIn November 2014, a relator filed a \nqui tam\n action in the U.S. District Court for the Northern District of Illinois against us and Takeda Pharmaceuticals America, Inc. The relator's complaint alleges that the defendants should have treated certain credits from distributors as retroactive price increases and included such increases in calculating average manufacturer prices. In August 2022, following a trial, the jury returned a verdict in favor of the relator. Lilly has appealed to the U.S. Court of Appeals for the Seventh Circuit, and the appeal remains pending.\n103\nOther Matters\nActos Litigation\nWe, along with Takeda Chemical Industries, Ltd. and Takeda affiliates (collectively, Takeda), are named in a third party payer class action in the U.S. District Court for the Central District of California. The plaintiffs allege that bladder cancer risk was concealed from them and claim that as a result they and a proposed class of third-party payers are entitled to recover money paid for Actos prescriptions. Our agreement with Takeda calls for Takeda to defend and indemnify us against losses and expenses with respect to U.S. litigation arising out of the manufacture, use, or sale of Actos and other related expenses in accordance with the terms of the agreement. In May 2023, the district court granted class certification. In August 2023, the U.S. Court of Appeals for the Ninth Circuit granted our and Takeda's petition for permission to appeal the class certification order. That appeal remains pending. \nMounjaro and Trulicity Product Liability Litigation\nSince August 2023, various plaintiffs have filed lawsuits against us, Novo Nordisk A/S (Novo), and other related Novo entities, alleging injuries following purported use of incretin medicines, including Mounjaro and Trulicity. The complaints assert a variety of claims and generally seek damages, medical monitoring, or other relief. Most of these lawsuits have been coordinated or consolidated for pretrial proceedings in a federal MDL pending in the U.S. District Court for the Eastern District of Pennsylvania; cases outside the MDL include one case pending in Georgia state court, as well as a class action petition in Israel. In November 2024, the MDL plaintiffs filed a master complaint.\nBranchburg Manufacturing Facility\nIn May 2021, we received a subpoena from the U.S. Department of Justice requesting the production of certain documents relating to our manufacturing site in Branchburg, New Jersey. We are cooperating with the subpoena.\nPuerto Rico Tax Matter\nIn May 2013, the Municipality of Carolina in Puerto Rico (Municipality) filed a lawsuit against us alleging noncompliance with respect to a contract with the Municipality and seeking a declaratory judgment. In June 2019, the Court of First Instance (CFI) granted summary judgment in our favor, dismissing the Municipality's complaint in its entirety. In December 2020, the Puerto Rico Appellate Court (AP) reversed and remanded the case to the CFI for trial on the merits. After trial began in May 2022, the Municipality filed a motion requesting the CFI to execute an alleged judgment. The CFI denied the request, and the Municipality filed for revision at the AP, which we opposed, staying the case. The AP denied the Municipality's motion for revision. Trial resumed in October 2024. \nHealth Choice Alliance \nIn October 2019, a relator filed a \nqui tam\n lawsuit against us in Texas state court asserting claims under the Texas Medicaid Fraud Prevention Act based on allegations about certain patient support programs related to our products Humalog, Humulin, and Forteo. The lawsuit seeks to recover the value of payments by the Texas Medicaid Program for these products, as well as civil penalties and other relief. The action has been stayed since 2020.\nResearch Corporation Technologies, Inc.\nIn April 2016, Research Corporation Technologies, Inc. (RCT) filed a lawsuit against us in the U.S. District Court for the District of Arizona asserting damages claims for breach of contract, unjust enrichment, and conversion related to processes used to manufacture certain products, including Humalog and Humulin. In October 2021, the court issued a summary judgment decision in favor of RCT on certain issues, including with respect to a disputed royalty. In July 2024, we reached a confidential agreement with RCT that requires different payments based on various litigation outcomes as determined on appeal. The settlement agreement is not an admission of liability or fault, and is subject to conditions. Pursuant to the agreement, the court entered final judgment, Lilly filed a notice of appeal to the U.S. Court of Appeals for the Ninth Circuit, and Lilly made an initial payment under the agreement. Lilly's appeal remains pending. The remaining amount payable under the agreement, if any, should not have a material impact on our financial position, liquidity or results of operations.\n104\nNote 17: \nOther Comprehensive Income (Loss)\nThe following table summarizes the activity related to each component of other comprehensive income (loss):\n(Amounts presented net of taxes)\nForeign Currency Translation Gains (Losses)\nNet Unrealized Gains (Losses) on Available-For-Sale Securities\nRetirement Benefit Plans\nNet Unrealized Gains (Losses) on Cash Flow Hedges\nAccumulated Other Comprehensive Loss\nBeginning balance at January 1, 2022\n$\n(\n1,550.2\n)\n$\n3.7\n \n$\n(\n2,583.6\n)\n$\n(\n213.0\n)\n$\n(\n4,343.1\n)\nOther comprehensive income (loss) before reclassifications\n(\n324.4\n)\n(\n52.2\n)\n291.5\n \n332.8\n \n247.7\n \nNet amount reclassified from accumulated other comprehensive loss\n0.4\n \n11.4\n \n229.8\n \n9.2\n \n250.8\n \nNet other comprehensive income (loss)\n(\n324.0\n)\n(\n40.8\n)\n521.3\n \n342.0\n \n498.5\n \nBalance at December 31, 2022\n(\n1,874.2\n)\n(\n37.1\n)\n(\n2,062.3\n)\n129.0\n \n(\n3,844.6\n)\nOther comprehensive income (loss) before reclassifications\n78.9\n \n10.1\n \n(\n686.9\n)\n79.7\n \n(\n518.2\n)\nNet amount reclassified from accumulated other comprehensive loss\n(\n23.7\n)\n0.8\n \n51.9\n \n6.8\n \n35.8\n \nNet other comprehensive income (loss)\n55.2\n \n10.9\n \n(\n635.0\n)\n86.5\n \n(\n482.4\n)\nBalance at December 31, 2023\n(\n1,819.0\n)\n(\n26.2\n)\n(\n2,697.3\n)\n215.5\n \n(\n4,327.0\n)\nOther comprehensive income (loss) before reclassifications\n(\n580.2\n)\n(\n5.0\n)\n424.6\n \n62.0\n \n(\n98.6\n)\nNet amount reclassified from accumulated other comprehensive loss\n9.6\n \n(\n0.5\n)\n94.0\n \n0.6\n \n103.7\n \nNet other comprehensive income (loss)\n(\n570.6\n)\n(\n5.5\n)\n518.6\n \n62.6\n \n5.1\n \nEnding balance at December 31, 2024\n$\n(\n2,389.6\n)\n$\n(\n31.7\n)\n$\n(\n2,178.7\n)\n$\n278.1\n \n$\n(\n4,321.9\n)\nThe tax effects on the net activity related to each component of other comprehensive income (loss) for the years ended December 31, were as follows:\nTax benefit (expense)\n2024\n2023\n2022\nForeign currency translation gains/losses\n$\n(\n146.4\n)\n$\n81.0\n \n$\n(\n75.9\n)\nNet unrealized gains/losses on available-for-sale securities\n1.6\n \n(\n3.2\n)\n12.4\n \nRetirement benefit plans\n(\n133.2\n)\n141.5\n \n(\n95.6\n)\nNet unrealized gains/losses on cash flow hedges\n(\n16.7\n)\n(\n23.0\n)\n(\n90.9\n)\nBenefit (expense) for income taxes related to other comprehensive income (loss)\n$\n(\n294.7\n)\n$\n196.3\n \n$\n(\n250.0\n)\nExcept for the tax effects of foreign currency translation gains and losses related to our foreign currency-denominated notes, cross-currency interest rate swaps, and other foreign currency exchange contracts designated as net investment hedges (see Note 7), income taxes were not provided for foreign currency translation. Generally, the assets and liabilities of foreign operations are translated into U.S. dollars using the current exchange rate. For those operations, changes in exchange rates generally do not affect cash flows; therefore, resulting translation adjustments are made in shareholders' equity rather than in the consolidated statements of operations.\n105\nReclassifications out of accumulated other comprehensive loss were as follows:\nAffected Line Item in the Consolidated Statements of Operations\n2024\n2023\n2022\nAmortization of retirement benefit items:\nPrior service benefits, net\n$\n(\n3.5\n)\n$\n(\n50.5\n)\n$\n(\n52.4\n)\nOther—net, (income) expense\nActuarial losses\n122.5\n \n116.2\n \n343.3\n \nOther—net, (income) expense\nTotal before tax\n119.0\n \n65.7\n \n290.9\n \nTax benefit\n(\n25.0\n)\n(\n13.8\n)\n(\n61.1\n)\nIncome taxes\nNet of tax\n94.0\n \n51.9\n \n229.8\n \nOther, net of tax\n9.7\n \n(\n16.1\n)\n21.0\n \nOther—net, (income) expense\nTotal reclassifications for the period, net of tax\n$\n103.7\n \n$\n35.8\n \n$\n250.8\n \nNote 18: \nOther–Net, (Income) Expense\nOther–net, (income) expense consisted of the following:\n2024\n2023\n2022\nInterest expense\n$\n780.6\n \n$\n485.9\n \n$\n331.6\n \nInterest income\n(\n175.2\n)\n(\n173.6\n)\n(\n62.8\n)\nNet investment losses on equity securities (Note 7)\n49.5\n \n20.2\n \n410.7\n \nRetirement benefit plans\n(\n461.7\n)\n(\n461.9\n)\n(\n372.9\n)\nOther (income) expense\n25.4\n \n32.7\n \n14.3\n \nOther–net, (income) expense\n$\n218.6\n \n$\n(\n96.7\n)\n$\n320.9\n \nNote 19: \nSegment Information\nWe operate as a single reportable segment engaged in the discovery, development, manufacturing, marketing, and sales of pharmaceutical products worldwide. A global research and development organization and a supply chain organization are responsible for the discovery, development, manufacturing, and supply of our products. Our commercial organizations market, distribute, and sell the products. The business is also supported by global corporate staff functions. Our determination that we operate as a single segment is consistent with the nature of our operations and the financial information regularly reviewed by the chief executive officer, in his capacity as the chief operating decision maker (CODM), for the purposes of evaluating performance, allocating resources, setting incentive compensation targets, and planning and forecasting for future periods.\nOur purpose is to unite caring with discovery to create medicines that make life better for people around the world. Our long-term success is significantly dependent on our ability to research and develop innovative medicines. The CODM uses consolidated net income to assess performance of our company, ensuring that we are investing in future research and development while efficiently delivering products to patients. The CODM allocates research and development resources based upon several factors, including the likelihood of technical success, unmet medical needs, and the viability of commercial success. A significant component of the CODM’s decision-making process is to ensure a balanced investment in our research and development portfolio to drive near-term success and sustain for the long-term.\n106\nThe following table summarizes our segment revenue, significant segment expenses, and segment profit:\n2024\n2023\n2022\nRevenue\n$\n45,042.7\n \n$\n34,124.1\n \n$\n28,541.4\n \nLess:\nCost of sales\n8,418.3\n \n7,082.2\n \n6,629.8\n \nEarly-stage research and development\n(1)\n3,916.9\n \n3,092.5\n \n2,406.6\n \nLate-stage research and development\n(1)\n7,073.7\n \n6,220.9\n \n4,784.2\n \nMarketing, selling, and administrative\n8,593.8\n \n7,403.1\n \n6,440.4\n \nAcquired in-process research and development\n3,280.4\n \n3,799.8\n \n908.5\n \nOther segment items\n(2)\n3,169.6\n \n1,285.2\n \n1,127.1\n \nNet income\n$\n10,590.0\n \n$\n5,240.4\n \n$\n6,244.8\n \n(1) \nEarly-stage research and development primarily includes costs incurred from discovery through Phase 2 clinical trials. Late-stage research and development primarily includes costs incurred from Phase 3 clinical trials.\n(2) \nOther segment items primarily include income taxes and asset impairment, restructuring, and other special charges.\nThe following tables summarize additional segment information:\n2024\n2023\n2022\nInterest income\n$\n175.2\n \n$\n173.6\n \n$\n62.8\n \nInterest expense\n780.6\n \n485.9\n \n331.6\n \nDepreciation and amortization\n1,766.6\n \n1,527.3\n \n1,522.5\n \nAsset impairment, restructuring, and other special charges\n860.6\n \n67.7\n \n244.6\n \nEarnings (loss) in equity method investments\n89.8\n \n(\n10.1\n)\n(\n138.0\n)\nIncome taxes\n2,090.4\n \n1,314.2\n \n561.6\n \nExpenditures for long-lived assets\n(1)\n5,560.8\n \n3,830.2\n \n2,289.2\n \n(1) \nIncludes expenditures for property and equipment and computer software costs.\n2024\n2023\nTotal assets\n$\n78,714.9\n \n$\n64,006.3\n \nEquity method investments\n1,142.7\n \n962.3\n \n107\nManagement's Reports\nManagement's Report for Financial Statements—Eli Lilly and Company and Subsidiaries\nManagement of Eli Lilly and Company and subsidiaries is responsible for the accuracy, integrity, and fair presentation of the financial statements. The statements have been prepared in accordance with generally accepted accounting principles in the United States and include amounts based on judgments and estimates by management. In management's opinion, the consolidated financial statements present fairly our financial position, results of operations, and cash flows.\nIn addition to the system of internal accounting controls, we maintain a code of conduct (known as \"\nThe Red Book\"\n) that applies to all employees worldwide, requiring proper overall business conduct, avoidance of conflicts of interest, compliance with laws, and confidentiality of proprietary information. All employees must take training annually on \nThe Red Book\n and are required to report suspected violations. A hotline number is available on our lilly.com website and on the internal LillyNow website to enable reporting of suspected violations anonymously. Employees who report suspected violations are protected from discrimination or retaliation by the company. In addition to \nThe Red Book\n, the chief executive officer and all financial management must sign a financial code of ethics, which further reinforces their ethical and fiduciary responsibilities.\nThe consolidated financial statements have been audited by Ernst & Young LLP, an independent registered public accounting firm (PCAOB ID: \n42\n). Their responsibility is to examine our consolidated financial statements in accordance with generally accepted auditing standards of the Public Company Accounting Oversight Board (United States). Ernst & Young's opinion with respect to the fairness of the presentation of the statements is included in Item 8 of our Annual Report on Form 10-K. Ernst & Young reports directly to the audit committee of the board of directors.\nOur audit committee includes four nonemployee members of the board of directors, all of whom are independent from our company. The committee charter, which is available on our website, outlines the members' roles and responsibilities. It is the audit committee's responsibility to appoint an independent registered public accounting firm subject to shareholder ratification, pre-approve both audit and non-audit services performed by the independent registered public accounting firm, and review the reports submitted by the firm. The audit committee meets several times during the year with management, the internal auditors, and the independent public accounting firm to discuss audit activities, internal controls, and financial reporting matters, including reviews of our externally published financial results. The internal auditors and the independent registered public accounting firm have full and free access to the committee.\nWe are dedicated to ensuring that we maintain the high standards of financial accounting and reporting that we have established. We are committed to providing financial information that is transparent, timely, complete, relevant, and accurate. Our culture demands integrity and an unyielding commitment to strong internal practices and policies. Finally, we have the highest confidence in our financial reporting, our underlying system of internal controls, and our people, who are objective in their responsibilities, operate under a code of conduct and are subject to the highest level of ethical standards.\nManagement's Report on Internal Control Over Financial Reporting—Eli Lilly and Company and Subsidiaries\nManagement of Eli Lilly and Company and subsidiaries is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. We have global financial policies that govern critical areas, including internal controls, financial accounting and reporting, fiduciary accountability, and safeguarding of corporate assets. Our internal accounting control systems are designed to provide reasonable assurance that assets are safeguarded, that transactions are executed in accordance with management's authorization and are properly recorded, and that accounting records are adequate for preparation of financial statements and other financial information. A staff of internal auditors regularly monitors, on a worldwide basis, the adequacy and effectiveness of internal accounting controls. The general auditor reports directly to the audit committee of the board of directors.\nWe conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \"Internal Control—Integrated Framework\" (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. \n108\nBased on our evaluation under this framework, we concluded that our internal control over financial reporting was effective as of December 31, 2024. However, because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe effectiveness of internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their attestation report, which appears herein. Their responsibility is to evaluate whether internal control over financial reporting was designed and operating effectively.\nDavid Ricks\nLucas Montarce\nChair, President, and Chief Executive Officer\nExecutive Vice President and Chief Financial Officer\nFebruary 19, 2025 \n109\nReport of Independent Registered Public Accounting Firm \nTo the Shareholders and the Board of Directors of Eli Lilly and Company\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Eli Lilly and Company and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income (loss), shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 19, 2025, expressed an unqualified opinion thereon.\nBasis for Opinion \nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\n110\nMedicaid, Managed Care, and Medicare sales rebate accruals\nDescription of the Matter\nAs described in Note 2 to the consolidated financial statements under the caption “Net\nProduct Revenue,” the Company establishes provisions for sales rebate and discounts in the same period as the related sales occur. At December 31, 2024, the Company had\n$11,539.3 million in sales rebate and discount accruals. A large portion of these accruals\nare rebates associated with sales in the United States for which payment for purchase of the product is covered by Medicaid, Managed Care, and Medicare.\nAuditing the Medicaid, Managed Care, and Medicare sales rebate and discount liabilities is challenging because of the subjectivity of certain assumptions required to estimate the rebate liabilities. In calculating the appropriate accrual amount, the Company considers historical Medicaid, Managed Care, and Medicare rebate payments by product as a percentage of their historical sales as well as any significant changes in sales trends, the lag in payment timing, changes in rebate contracts, an evaluation of the current Medicaid and Medicare laws and interpretations, the percentage of products that are sold via Medicaid, Managed Care, and Medicare, and product pricing. Given variability in prescription drug costs and variability in prescription data, historical rebate information may not be predictive for management to estimate the rebate accrual and thus, management supplements its historical data analysis with qualitative adjustments based upon current expectations, particularly for select products which contribute the largest portion of the Company's revenue.\nHow We Addressed the Matter in Our Audit\nWe tested the Company’s controls addressing the identified risks of material misstatement related to the valuation of the sales rebate and discount liabilities. This included testing controls over management’s review of the significant assumptions used to calculate the Medicaid, Managed Care, and Medicare rebate liabilities, including the significant assumptions discussed above. This testing also included management’s control to compare actual activity to estimated activity and controls to ensure the data used to evaluate the significant assumptions was complete and accurate.\nOur audit procedures included, among others, evaluating for reasonableness the significant assumptions in light of economic trends, product profiles, and other regulatory factors. Our testing involved assessing the historical accuracy of management’s estimates by comparing actual activity to previous estimates and performing analytical procedures, based on internal and external data sources, to evaluate the completeness of the reserves. Additionally, our procedures included reviewing a sample of contracts, testing a sample of rebate payments and testing the underlying data used in management’s evaluation. For Medicaid, we involved our professionals with an understanding of the statutory reimbursement requirements to assess the consistency of the Company’s calculation methodologies with the applicable government regulations and policy.\n/s/ \nErnst & Young LLP\nWe have served as the Company's auditor since 1940. \nIndianapolis, Indiana\nFebruary 19, 2025 \n111\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of Eli Lilly and Company\nOpinion on Internal Control Over Financial Reporting\nWe have audited Eli Lilly and Company and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Eli Lilly and Company and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income (loss), shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and our report dated February 19, 2025, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n112\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nIndianapolis, Indiana\nFebruary 19, 2025 \n113\nItem 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nUnder applicable Securities and Exchange Commission (SEC) regulations, management of a reporting company, with the participation of the principal executive officer and principal financial officer, must periodically evaluate the company's \"disclosure controls and procedures,\" which are defined generally as controls and other procedures designed to ensure that information required to be disclosed by the reporting company in its periodic reports filed with the SEC (such as this Form 10-K) is recorded, processed, summarized, and reported on a timely basis.\nOur management, with the participation of David Ricks, president and chief executive officer, and Lucas Montarce, executive vice president and chief financial officer, evaluated our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934) as of December 31, 2024, and concluded that they were effective.\nManagement's Report on Internal Control over Financial Reporting\nMr. Ricks and Mr. Montarce provided a report on behalf of management on our internal control over financial reporting, in which management concluded that the company's internal control over financial reporting is effective at December 31, 2024 based on the framework in \"Internal Control—Integrated Framework\" (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles in the United States. Due to the inherent limitations, no evaluation over internal control can provide absolute assurance that no material misstatements or fraud exist. \nIn addition, Ernst & Young LLP, the company's independent registered public accounting firm, issued an attestation report on the company's internal control over financial reporting as of December 31, 2024. \nSee Item 8 for the full text of management's report and Ernst & Young's attestation report.\nChanges in Internal Control over Financial Reporting\nDuring the fourth quarter of 2024, there were no changes in our internal control over financial reporting that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \nItem 9B.\nOther Information\nOn \nNovember 20, 2024\n, \nDonald Zakrowski\n, \nsenior vice president, finance, and chief accounting officer\n, \nadopted\n a sales plan (Plan). The Plan was entered into during an open trading window and is intended to satisfy the affirmative defense conditions of \nRule 10b5-1(c)\n of the Exchange Act of 1934 and our policies regarding trading in our securities. The Plan calls for the sale of up to \n4,000\n shares of company common stock between March 13, 2025 and \nNovember 19, 2025\n subject to the terms and conditions of the Plan.\nItem 9C.     Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n114\nPart III\nItem 10.\nDirectors, Executive Officers, and Corporate Governance\nDirectors and Executive Officers\nInformation relating to our board of directors is found in our Definitive Proxy Statement, to be dated on or about March 21, 2025 (Proxy Statement), under \"Governance - How We Build an Effective Board\" and is incorporated in this Annual Report on Form 10-K by reference.\nInformation relating to our \ninsider trading procedure and processes\n is found in our Proxy Statement under \"Ownership of Company Stock - Common Stock Ownership by Directors and Executive Officers\" and is incorporated in this Annual Report on Form 10-K by reference.\nInformation relating to our executive officers is found at Item 1, \"Business - Executive Officers of the Company\" and is incorporated by reference herein. \nCode of Ethics\nInformation relating to our code of ethics is found in our Proxy Statement under \"Governance - How We Operate an Effective Board - Governance Practices - Board Oversight - Key Areas of Oversight by the Board and Its Committees - Governance - Code of Ethics\" and is incorporated in this Annual Report on Form 10-K by reference.\nCorporate Governance\nInformation about the procedures by which shareholders can recommend nominees to our board of directors is found in our Proxy Statement under \"Governance - How We Build an Effective Board - Director Nominations - Shareholder Director Candidates\" and is incorporated in this Annual Report on Form 10-K by reference.\nThe board of directors has appointed an audit committee consisting entirely of independent directors in accordance with applicable Securities and Exchange Commission and New York Stock Exchange requirements for audit committees. Information about our audit committee is found in our Proxy Statement under \"Governance - How We Operate an Effective Board - Board Structure - Meetings of the Board and Its Committees - Committees of the Board - Audit Committee\" and is incorporated in this Annual Report on Form 10-K by reference.\nSection 16(a) Reporting Compliance\nInformation about our compliance with Section 16(a) is found in our Proxy Statement under \"Ownership of Company Stock - Delinquent Section 16(a) Reports\" and is incorporated in this Annual Report on Form 10-K by reference.\nItem 11.\nExecutive Compensation\nInformation on director compensation, executive compensation, and talent and compensation committee matters can be found in the Proxy Statement under \"Governance - How We Build an Effective Board - Director Compensation,\" \"- How We Operate an Effective Board - Board Structure - Meetings of the Board and Its Committees - Committees of the Board - Talent and Compensation Committee,\" \"Compensation - Compensation Discussion and Analysis,\" \"- Talent and Compensation Committee Matters,\" and \"- Executive Compensation.\" Such information is incorporated in this Annual Report on Form 10-K by reference. \n115\nItem 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners and Management\nInformation relating to ownership of the company's common stock by management and by persons known by the company to be the beneficial owners of more than five percent of the outstanding shares of common stock is found in the Proxy Statement under \"Ownership of Company Stock\" and incorporated in this Annual Report on Form 10-K by reference.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table presents information as of December 31, 2024 regarding the company's compensation plans under which shares of the company's common stock have been authorized for issuance.\nPlan category\n(a) Number of securities to be issued upon exercise of outstanding options, warrants, and rights \n(1)\n(b) Weighted-average exercise price of outstanding options, warrants, and rights\n(c) Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders\n— \n$\n—\n48,827,102\nEquity compensation plan not approved by security holders\n— \n—\n— \nTotal\n— \n—\n48,827,102 \n(1)\n 2,396,006 shares are underlying outstanding equity awards.\nItem 13.\nCertain Relationships and Related Transactions, and Director Independence\nRelated Person Transactions\nInformation relating to the policies and procedures for approval of related person transactions by our board of directors can be found in the Proxy Statement under \"Governance - How We Operate an Effective Board - Board Alignment - Conflicts of Interest and Transactions with Related Persons.\" Such information is incorporated in this Annual Report on Form 10-K by reference.\nDirector Independence\nInformation relating to director independence can be found in the Proxy Statement under \"Governance - How We Build an Effective Board - Director Qualifications - Independence\" and is incorporated in this Annual Report on Form 10-K by reference.\nItem 14.\nPrincipal Accountant Fees and Services\nInformation related to the fees and services of our principal independent accountants, Ernst & Young LLP, can be found in the Proxy Statement under \"Audit Matters - Item 3. Ratification of the Appointment of the Independent Auditor - Services Performed by the Independent Auditor\" and \"- Independent Auditor Fees.\" Such information is incorporated in this Annual Report on Form 10-K by reference.\n116\nItem 15.\nExhibits and Financial Statement Schedules\n(a)1.    Financial Statements\nThe following consolidated financial statements of the company and its subsidiaries are found at Item 8:\n•\nConsolidated Statements of Operations—Years Ended December 31, 2024, 2023, and 2022 \n•\nConsolidated Statements of Comprehensive Income—Years Ended December 31, 2024, 2023, and 2022\n•\nConsolidated Balance Sheets—December 31, 2024 and 2023\n•\nConsolidated Statements of Shareholders' Equity—Years Ended December 31, 2024, 2023, and 2022\n•\nConsolidated Statements of Cash Flows—Years Ended December 31, 2024, 2023, and 2022\n•\nNotes to Consolidated Financial Statements\n(a)2.    Financial Statement Schedules\nThe consolidated financial statement schedules of the company and its subsidiaries have been omitted because they are not required, are inapplicable, or are adequately explained in the financial statements.\nFinancial statements of interests of 50 percent or less, which are accounted for by the equity method, have been omitted because they do not, considered in the aggregate as a single subsidiary, constitute a significant subsidiary.\n(a)3.    Exhibits\nThe following documents are filed as part of this Annual Report on Form 10-K:\nExhibit\nDescription\n3.1\nAmended Articles of Incorporation, incorporated by reference to Exhibit 3.1 to the Company's Current Report on Form 8-K filed on May 4, 2022\n3.2\nBylaws, as amended, incorporated by reference to Exhibit 3.2 to the Company's Current Report on Form 8-K filed on May 4, 2022\n4.1\nIndenture, dated February 1, 1991, between the Company and Deutsche Bank Trust Company Americas, as successor trustee to Citibank, N.A., as Trustee, incorporated by reference to Exhibit 4.1 to the Company's Registration Statement on Form S-3, Registration No. 333-186979\n4.2\nTripartite Agreement, dated September 13, 2007, appointing Deutsche Bank Trust Company Americas as Successor Trustee under the Indenture listed in Exhibit 4.1, incorporated by reference to Exhibit 4.2 to the Company's Annual Report on Form 10-K for the year ended December 31, 2008\n4.3\nDescription of the Company's Common Stock\n, incorporated by reference to Exhibit 4.3 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023\n4.4\nDescription of the Company's 1.625% Notes due 2026 and 2.125% Notes due 2030, incorporated by reference to Exhibit 4.4 to the Company's Annual Report on Form 10-K for the year ended December 31, 2019\n4.5\nDescription of the Company's 6.77% Notes due 2036, incorporated by reference to Exhibit 4.5 to the Company's Annual Report on Form 10-K for the year ended December 31, 2019\n4.6\nDescription of the Company's 7 1/8% Notes due 2025, incorporated by reference to Exhibit 4.6 to the Company's Annual Report on Form 10-K for the year ended December 31, 2019\n4.7\nDescription of the Company's 0.625% Notes due 2031 and 1.700% Notes due 2049, incorporated by reference to Exhibit 4.7 to the Company's Annual Report on Form 10-K for the year ended December 31, 2019\n4.8\nDescription of the Company's 0.500% Notes due 2033, 1.125% Notes due 2051, and 1.375% Notes due 2061, incorporated by reference to Exhibit 4.8 to the Company's Annual Report on Form 10-K for the year ended December 31, 2021\n117\n4.9\nDescription of the Company's 1.625% Notes due 2043, incorporated by reference to Exhibit 4.9 to the Company's Annual Report on Form 10-K for the year ended December 31, 2021\n10.1\nAmended and Restated 2002 Lilly Stock Plan(1), incorporated by reference to Exhibit 10.1 to the Company's Quarterly Report on Form 10-Q for the quarter ended June 30, 2024\n10.2\nForm of Performance Award under the 2002 Lilly Stock Plan\n(1)\n incorporated by reference to Exhibit 10.2 to the Company's Annual Report on Form 10-K for the year ended December 31, 2022\n10.3\nForm of Shareholder Value Award under the 2002 Lilly Stock Plan\n(1)\n*\n10.4\nForm of Relative Value Award under the 2002 Lilly Stock Plan\n(1)\n*\n10.5\nForm of Restricted Stock Unit Award under the 2002 Lilly Stock Plan\n(1)\n*\n10.6\nForm of Non-Compete Payment Agreement\n(1)\n, incorporated by reference to Exhibit 10.5 to the Company's Annual Report on Form 10-K for the year ended December 31, 2022\n10.7\nThe Lilly Deferred Compensation Plan, as amended\n(1)\n*\n10.8\nThe Lilly Directors' Deferral Plan, as amended\n(1\n)\n*\n10.9\nThe Eli Lilly and Company Bonus Plan, as amended\n(1)\n, incorporated by reference to Exhibit 10.14 to the Company's Annual Report on Form 10-K for the year ended December 31, 2020\n10.10\n2007 Change in Control Severance Pay Plan for Select Employees, as amended\n(1)\n, \nincorporated by reference\n to Exhibit 10.10 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023\n19\nTrading Lilly Securities Global Procedure*\n21\nList of Subsidiaries*\n23\nConsent of Independent Registered Public Accounting Firm*\n31.1\nRule 13a-14(a) Certification of David Ricks, Chair, President, and Chief Executive Officer*\n31.2\nRule 13a-14(a) Certification of \nLucas Montarce\n, Executive Vice President and Chief Financial Officer*\n32\nSection 1350 Certification*\n97\nExecutive Compensation Recovery Policy\n, incorporated by reference to Exhibit 97 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023\n101\nInteractive Data File*\n104\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)*\n(1)\n Indicates management contract or compensatory plan.\n* Filed herewith.\nLong-term debt instruments under which the total amount of securities authorized does not exceed 10 percent of our consolidated assets are not filed as exhibits to this Annual Report. We will furnish a copy of these agreements to the Securities and Exchange Commission upon request.\nItem 16.\nForm 10-K Summary\nNot applicable.\n118\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nEli Lilly and Company\nBy\n \n/s/    David Ricks\nDavid Ricks\nChair, President, and Chief Executive Officer\nFebruary 19, 2025 \n119\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on February 19, 2025 by the following persons on behalf of the Registrant and in the capacities indicated.\nSignature\nTitle\n/s/    David Ricks\nChair, President, and Chief Executive Officer (principal executive officer)\nDAVID RICKS\n/s/    Lucas Montarce\nExecutive Vice President and Chief Financial Officer (principal financial officer)\nLUCAS MONTARCE\n/s/    Donald Zakrowski\nSenior Vice President, Finance, and Chief Accounting Officer (principal accounting officer)\nDONALD ZAKROWSKI\n/s/    Ralph Alvarez\nDirector\nRALPH ALVAREZ\n/s/    Katherine Baicker, Ph.D.\nDirector\nKATHERINE BAICKER, Ph.D.\n/s/    Erik Fyrwald\nDirector\nERIK FYRWALD\n/s/    Mary Lynne Hedley, Ph.D.\nDirector\nMARY LYNNE HEDLEY, Ph. D.\n/s/    Jamere Jackson\nDirector\nJAMERE JACKSON\n/s/    Kimberly Johnson\nDirector\nKIMBERLY JOHNSON\n/s/    William Kaelin, Jr., M.D.\nDirector\nWILLIAM KAELIN, JR., M.D.\n/s/    Juan Luciano\nDirector\nJUAN LUCIANO\n/s/    Jon Moeller\nDirector\nJON MOELLER\n/s/    Gabrielle Sulzberger\nDirector\nGABRIELLE SULZBERGER\n120"
  }
}