{
  "ticker": "LMT",
  "cik": "0000936468",
  "company_name": "LOCKHEED MARTIN CORP",
  "filing_date": "2025-01-28",
  "accession": "0000936468-25-000009",
  "primary_doc": "lmt-20241231.htm",
  "item_sections": {
    "item1": "ITEM 16.\nForm 10-K Summary\n105\nSIGNATURES\n106\n \nTable of Contents \nPART I\nITEM 1.\n    \nBusiness\nGeneral\nWe are a global aerospace and defense company principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services. We also provide a broad range of management, engineering, technical, scientific, logistics, system integration and cybersecurity services. Our main areas of focus are in defense, space, intelligence, homeland security and information technology, including cybersecurity. We serve both U.S. and international customers with products and services that have defense, civil and commercial applications, with our principal customers being agencies of the U.S. Government. \nOur 21st Century Security\n®\n vision is to accelerate the adoption of advanced networking and other leading-edge technologies into the American defense enterprise, while enhancing the performance and value of our platforms and products for our customers. The aim of 21st Century Security is to integrate and continuously upgrade new and existing systems across all domains with advanced, open-architecture networking and operational technologies that make defense forces more agile, adaptive and unpredictable, enabling overmatch and strengthening deterrence today and into the future.\n21st Century Security guides our strategy and investments. As our growth pillars continue to evolve, we are focusing on advancing all-domain mission solutions through investments in digital technologies such as Artificial Intelligence (AI)/Machine Learning (ML), Autonomy and Crewed/Uncrewed Teaming, Generative Design and other technologies and capabilities enabling Combined Joint All-Domain Command and Control (CJADC2). Innovations in these areas will expand capability, improve interoperability, increase demand for our multi-domain solutions and drive efficient conversion of backlog into growth across our portfolio. We have well established programs across our business segments that continue to experience growth, including F-35 sustainment activity (Aeronautics); increased Patriot Advanced Capability-3 (PAC-3) production rates and increased demand for High Mobility Artillery Rocket System (HIMARS\n®\n) and Guided Multiple Launch Rocket Systems (GMLRS) (Missiles and Fire Control); radar surveillance systems and CH-53K King Stallion heavy lift helicopter (Rotary and Mission Systems); and the modernization of and enhancements to the Trident II D5 Fleet Ballistic Missile (FBM) (Space). Additionally, our teams continue to transform our products and rapidly innovate for the future, developing 6th generation air dominance technologies within Skunk Works\n®\n, demonstrating autonomous capabilities with the X-62A (F-16) and optionally piloted BLACK HAWK\n®\n, creating new Joint All-Domain Operating systems with Defense of Guam and AIR 6500 in Australia, establishing small-to-medium satellite capabilities to support proliferated space constellations and advancing hypersonic capabilities. Finally, we are always in pursuit of new program awards to develop future platforms that enable us to continue to strengthen our national defense and advance deterrence and global security.\nKeys to enabling success of our strategy include developing and investing in differentiating technologies, forging strategic partnerships, including with commercial companies, executing on our multi-year business transformation initiative to enhance our digital infrastructure and increase efficiencies and collaboration throughout our business and maintaining fiscal discipline. Underpinning our ability to execute our strategy is our talent and culture. We invest substantially in our people to ensure that our workforce has the technical skills necessary to succeed, and we expect to continue to invest internally in innovative technologies that address rapidly evolving mission requirements for our customers. We also will continue to evaluate our portfolio and will make strategic acquisitions or divestitures, as appropriate, while deepening our connection to commercial industry through cooperative partnerships, joint ventures and equity investments.\nBusiness Segments\nWe operate in four business segments: Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS) and Space. We organize our business segments based on the nature of the products and services offered. \nAeronautics\nAeronautics is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. Aeronautics also has contracts with the U.S. Government for various classified programs. Aeronautics’ major programs include:\n•\nF-35 Lightning II – international multi-role, multi-variant, fifth generation stealth fighter.\n•\nC-130 Hercules – international tactical airlifter.\n•\nF-16 Fighting Falcon – combat-proven, international multi-role fighter.\n•\nF-22 Raptor – air dominance and multi-role fifth generation stealth fighter.\n3\nTable of Contents \nThe F-35 program is our largest program, generating 26% of our total consolidated net sales, as well as 65% of Aeronautics’ net sales in 2024. The F-35 program consists of multiple development, production and sustainment contracts. Development is focused on modernization of F-35’s capability and addressing emerging threats. Sustainment provides logistics and training support for the aircraft delivered to F-35 customers. For additional information on the F-35 program, see “Status of the F‑35 Program” in Management’s Discussion and Analysis of Financial Condition and Results of Operations. See also",
    "item1a": "Item 1A. “Risk Factors” for a discussion of cybersecurity risks.",
    "item1c": "ITEM 1C.    Cybersecurity\nRisk Management and Strategy \nWe believe cybersecurity is critical to advancing our 21st Century Security vision and enabling our digital transformation efforts. As an aerospace and defense company, we face a multitude of cybersecurity threats that range from attacks common to most industries, such as ransomware and denial-of-service, to attacks from more advanced and persistent, highly organized adversaries, including nation state actors, some of which target the defense industrial base and other critical infrastructure sectors. Our customers, suppliers, subcontractors and joint venture partners face similar cybersecurity threats, and a cybersecurity incident impacting us or any of these entities could materially adversely affect our operations, performance and results of operations. These cybersecurity threats and related risks make it imperative that we strive to be a leader in the information security field, and we expend considerable resources on cybersecurity. \nOur corporate information security organization has implemented a governance structure and processes to assess, identify, manage and report cybersecurity risks. We also have a corporate-wide counterintelligence and insider threat detection program to proactively identify external and internal threats and mitigate those threats in a timely manner. As a defense contractor, we must comply with extensive regulations, including requirements imposed by the Defense Federal Acquisition Regulation Supplement (DFARS) related to adequately safeguarding controlled unclassified information (CUI) and reporting cybersecurity incidents to the DoD. We have implemented cybersecurity policies and frameworks based on industry and governmental \n22\nTable of Contents \nstandards to align closely with DoD requirements, instructions and guidance. Moreover, we continue to work with the DoD on assessing cybersecurity risk and on policies and practices aimed at mitigating these risks. For example, we have worked in collaboration with the other members of the defense industrial base to support DoD’s development of the Cybersecurity Maturity Model Certification (CMMC) program, DoD’s program to ensure members of the defense industrial base meet cybersecurity requirements for handling CUI and federal contract information. We believe we are well positioned to meet the requirements of the CMMC and are preparing for certification. In addition to following DoD guidance and implementing pre-existing third party frameworks, we have developed our own practices and frameworks, which we believe enhance our ability to identify and manage cybersecurity risks. For example, we use a proactive risk management strategy that we developed and implemented called the Intelligence Driven Defense\n®\n model that seeks to identify and prevent cybersecurity incidents by understanding the nature of adversaries and using this information to minimize the impact of an attack. \nThird parties\n also play a role in our cybersecurity. We engage third-party services to conduct evaluations of our security controls, whether through penetration testing, independent audits or consulting on best practices to address new challenges. These evaluations include testing both the design and operational effectiveness of security controls. We also share and receive threat intelligence with our defense industrial base peers, government agencies, information sharing and analysis centers and cybersecurity associations. \nWe rely heavily on our supply chain to deliver our products and services to our customers, and a cybersecurity incident at a supplier, subcontractor, joint venture partner, or service provider could materially adversely impact us. We assess \nthird party\n cybersecurity controls through a cybersecurity questionnaire and include security and privacy addendums to our contracts where applicable. We also contractually flow cybersecurity regulatory requirements to our subcontractors as required by the DFARS and other government agency specific requirements. These contractual flow downs include the requirement that our subcontractors implement certain security controls, and that our subcontractors self-report the status of their implementation of these controls to the U.S. Government. These government contracting regulations may create challenges for our supply chain and increase costs. We also require that our subcontractors report cybersecurity incidents to us so that we can assess the impact of the incident on us. For select suppliers, we engage third-party cybersecurity monitoring and alerting services, and seek to work directly with those suppliers to address potential deficiencies identified. We also make available cybersecurity education and awareness materials and briefings to our suppliers.\nGovernance \nThe Board of Directors oversees management’s processes for identifying and mitigating risks, including cybersecurity risks, to help align our risk exposure with our strategic objectives. \nSenior leadership, including our Chief Information Security Officer (CISO), regularly briefs the Board of Directors on our cybersecurity and information security posture and the Board of Directors is apprised of cybersecurity incidents deemed to have a moderate or higher business impact, even if immaterial to us. The Classified Business and Security Committee of the Board of Directors is briefed by senior leadership, as appropriate, on the cybersecurity of classified programs and the security of our classified business supply chain. Other than oversight of classified business cybersecurity, the full Board retains oversight of cybersecurity because of its importance to Lockheed Martin and the heightened risk in the aerospace and defense industry. \nIn the event of an incident, we intend to follow our detailed incident response playbook, which outlines the steps to be followed from incident detection to mitigation, recovery and notification, including notifying functional areas (e.g., legal), as well as senior leadership, the Board, and regulators, as appropriate.\nOur corporate information security organization, led by our \nCISO\n, is responsible for our overall information security strategy, policy, security engineering, operations and cyber threat detection and response.\n \nThe current CISO has extensive information technology and program management experience, and has served many years in our corporate information security organization.\n The corporate information security organization manages and continually enhances a robust enterprise security structure with the ultimate goal of preventing cybersecurity incidents to the extent feasible, while simultaneously increasing our system resilience in an effort to minimize the business impact should an incident occur. Central to this organization is our computer incident response team (CIRT), which is responsible for the protection, detection and response capabilities used in the defense of Lockheed Martin’s data and enterprise computing networks. Employees outside of our corporate information security organization also have a role in our cybersecurity defenses and they are immersed in a corporate culture supportive of security, which we believe improves our cybersecurity.\nAssessing, identifying and managing cybersecurity related risks are integrated into our overall enterprise risk management (ERM) process.\n Cybersecurity related risks are included in the risk universe that the ERM function evaluates to assess top risks to the enterprise on an annual basis. To the extent the ERM process identifies a heightened cybersecurity related risk, risk owners are assigned to develop risk mitigation plans, which are then tracked to completion.\n The ERM process’s annual risk assessment and relevant mitigations are presented to the \nBoard of Directors\n.\nNotwithstanding the extensive approach we take to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us. While Lockheed Martin maintains cybersecurity \n23\nTable of Contents \ninsurance, the costs related to cybersecurity threats or disruptions may not be fully insured.\n See",
    "item1b": "ITEM 1B.    Unresolved Staff Comments\nNone."
  }
}