{
  "ticker": "LOW",
  "cik": "0000060667",
  "company_name": "LOWES COMPANIES INC",
  "filing_date": "2025-03-24",
  "accession": "0000060667-25-000049",
  "primary_doc": "low-20250131.htm",
  "item_sections": {
    "item1": "Item 1 - Business\n \nGeneral Information\nLowe’s Companies, Inc. and subsidiaries (the Company or Lowe’s) is a Fortune\n®\n 50 company and the world’s second largest home improvement retailer.  As of January 31, 2025, Lowe’s opera\nted 1,748 \nhome improvement stores and outlets in the United States, representing approximately 195 million\n sq\nuare feet of retail selling space.  \nLowe’s was founded in 1921 with the opening of its first hardware store in North Wilkesboro, North Carolina.  The Company was incorporated in North Carolina in 1952 and has been publicly held since 1961.  The Company’s common stock is listed on the New York Stock Exchange - ticker symbol “LOW”.\nFor additional information about the Company’s performance and financial condition, see \nItem 7\n, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”, of this Annual Report. \nOur Strategy\nLowe’s is an omnichannel retailer whose focus is on helping customers solve problems and fulfill dreams for their homes by providing an excellent customer experience, creating a great place to work for our associates, and improving our communities, which we believe will create long-term, sustainable value for our shareholders.  In fiscal 2024, we continued to execute on our Total Home strategy that was introduced in fiscal 2020, by focusing on serving the professional customer (Pro customer), accelerating our online business, expanding installation services, improving localization efforts and elevating our product assortment.  In December 2024, we updated our Total Home strategy, aligned with the key drivers of home improvement demand, to help our customers solve their home improvement needs with more value and exceptional service.  The five pillars of our Total Home strategy are as follows:\nDrive \nPro penetration\nAccelerate\nonline sales\nExpand\nhome services\nCreate a\nloyalty ecosystem\nIncrease\nspace productivity\n•\nWe continue to transform our Pro offerings to drive Pro penetration by continuing to enhance our Pro product assortment, investing in inventory of high-volume Pro products, launching our redesigned loyalty program, improving job site delivery capabilities, and rolling out our new Pro extended aisle.  \n•\nWe are investing in our omnichannel retail capabilities to accelerate our online business through project design tools and our online product marketplace.  \n•\nWe are expanding our installation services to create a high value simplified installation solution, which are provided by our network of independent installers or outsourced to our third-party model that sells, furnishes, and installs both smaller refresh projects and more complex projects.  \n•\nWe are creating a loyalty ecosystem that drives brand preference and includes building out our MyLowe’s Rewards infrastructure for both Pro and do-it-yourself (DIY) customers.  \n•\nFinally, we are increasing space productivity by optimizing our assortments and tailoring them to the local markets, and balancing our value-oriented private brands with our national brands.    \nOur Customers and Market\nThe home improvement market in which we operate is highly fragmented, serving Pro customers, individual homeowners, and renters completing a wide array of projects that vary along the spectrum of DIY and do-it-for-me (DIFM).  The Pro customer at Lowe’s is primarily the small to medium sized Pro, which includes three broad categories: tradespeople, repair and remodelers, and property managers.  \n \n1\nTable of Contents\nThere are many variables that affect consumer demand for the home improvement products and services we offer.  Key indicators we monitor include home price appreciation, age of the housing stock, real disposable personal income, and housing turnover.  We also monitor demographic and societal trends that shape home improvement industry growth over time as the US population moves through major life stages and events.  These include strong millennial household formation, an increased preference among older generations to age in place, and the persistence of remote work.\nOur Competition\nThe home improvement industry includes a broad competitive landscape that continues to evolve.  We compete with national and regional home improvement warehouse chains and lumber yards in most of the markets we serve.  We also compete with traditional hardware, plumbing, electrical, and home supply retailers, as well as paint stores, lumber yards, garden centers, and maintenance and repair organizations.  In addition, we compete with general merchandise retailers, home goods specialty stores, warehouse clubs, online retailers, other specialty retailers, providers of equipment and tool rental, service providers that install home improvement products, and wholesalers that provide home-related products and services to homeowners, renters, businesses, and the government.  \nLocation of stores, product assortment, product pricing, and customer service continue to be key competitive factors in our industry, while the evolution of technology, including artificial intelligence (AI) and machine learning technologies, expansion of fulfillment capabilities, and customer expectations also underscore the importance of omnichannel capabilities as a competitive factor.  See further discussion of competition in",
    "item1a": "Item 1A\n of this Annual Report on Form 10-K for more information on our cybersecurity-related risks.\n \nGovernance\nOur Chief Digital and Information Officer (\nCDIO), our CISO, and senior members of our information security group\n are responsible for identifying, assessing, and managing risks from cybersecurity threats.  \nOur CISO, who manages our cybersecurity program and receives information regarding cybersecurity incidents and threats from our information security group and through internal escalation procedures, reports to the CDIO, who reports directly to our Chairman, President, and Chief Executive Officer.\nThe CDIO has served in various roles in information technology for over 25 years, holds undergraduate and graduate degrees in electrical and electronics engineering and computer science, and brings significant insights into cybersecurity strategies.  The CISO has served in various roles in information security for over 30 years, including serving as a CISO of four public companies.  The senior members of the information security group who report to the CISO have extensive experience in technology and security roles from serving with several large public companies and possess cybersecurity certifications, including Certified Information Systems Security Professional, Certified Information Security Manager, and Certified Information Systems Auditor, among others.\nOversight responsibility over cybersecurity risk is shared by the Board and the Audit Committee, with the Audit Committee being primarily responsible for overseeing risks related to cybersecurity, data protection, privacy, and significant emerging technology.\n  The Audit Committee regularly reviews metrics about cyber threat response preparedness, program maturity milestones, risk mitigation status, and the current and emerging threat landscape, in addition to the results of third-party reviews and assessments of our security controls.  \nOur CDIO or CISO provide regular cybersecurity updates in the form of written reports and presentations to the Audit Committee at its quarterly meetings, which are also provided to the full Board.\n  We also have protocols by which certain cybersecurity incidents are escalated and, where appropriate, reported to the Audit Committee in a timely manner.\n18\nTable of Contents",
    "item1c": "Item 1C - Cybersecurity\nWe maintain a robust cybersecurity program that we have designed with the goal of identifying, deterring, detecting, responding to, and managing potential cybersecurity risks and threats.\n \nRisk Management and Strategy\nRisk management is a central part of our cybersecurity program.  We conduct regular risk assessments and monitor our information systems for potential vulnerabilities.  We employ a risk quantification model to identify, measure, and prioritize cybersecurity and technology risks, and we implement corresponding security controls and safeguards based on model outputs.\n \nAs part of our focus on the use of AI technology in our business, we developed an AI cybersecurity strategy designed to enable the building of secure and reliable AI systems while also managing ethical, legal, cyber, data privacy, and other technology risks.  The Company also established an AI Governance Committee, which is composed of leaders across a variety of business, technology, and support functions, to oversee the creation and implementation of risk control and strategic implementation frameworks. \nIn addition to cybersecurity risks being tracked, managed, and monitored directly by the information security group, cybersecurity risks are also integrated into, and are among the risks evaluated and considered by, our enterprise risk management program.\n  The Company’s Chief Legal Officer provides centralized oversight of our enterprise risk management program, which is managed by our Chief Compliance Officer and the Office of Enterprise Risk Management in partnership with the Enterprise Risk Council (ERC).  The ERC is comprised of senior Company leaders with broad enterprise experience, including our Chief Information Security Officer (CISO).  \nProcesses and Procedures\nWe have adopted physical, technological, and administrative controls on cybersecurity.  Our risk management processes include, among others, the following features:  \n•\nWe leverage the National Institute of Standards and Technology security frameworks as well as established internal security standards, industry practices, and applicable regulatory requirements.  Our program is designed to comply with a range of applicable industry standards, such as the Payment Card Industry Data Security Standard.\n•\nWe maintain cybersecurity insurance coverage that provides protection against potential losses arising from certain cybersecurity incidents.\n•\nWe require that cybersecurity awareness and data privacy training, along with company-wide and tailored training programs, be provided to associates annually.  We also regularly conduct phishing and social engineering simulations, and host events to increase awareness, including an annual cybersecurity awareness summit and monthly campaigns.\n•\nWe have a cybersecurity incident response plan in place which provides a framework for responding to cybersecurity incidents.  Our information security team leverages technologies and vendors to monitor and respond to security threats via a dedicated security operations center.  In the event of a security incident, a defined procedure outlines containment, response, and recovery actions that draw on resources and leadership across the Company, as needed.  \n•\nA cross-functional team conducts periodic simulated exercises, and we perform regular vulnerability scanning and conduct vulnerability testing during the software development life cycle. \n•\nWe collaborate with internal stakeholders and third-party assessors and consultants to conduct regular reviews, tests, and audits of our security program.\n  This coordinated approach reviews security controls that safeguard our information assets, including payment information, through processes such as security control assessments and third-party penetration testing.  Additionally, we utilize tabletop exercises, penetration and vulnerability testing, red team exercises, simulations, and other evaluations to improve our security measures and strategies.\n•\nWe also participate in various cybersecurity and retail industry groups to remain apprised of emerging cybersecurity risks, defense, mitigation strategies, and governance best practices.\n17\nTable of Contents\nThird-Party Risk Management\nOur cybersecurity risk management processes extend to the oversight and identification of threats associated with our use of third-party service providers.  We have developed contracting processes and terms to gain commitments from certain vendors and third-party service providers to adhere to appropriate security practices and outline specific security requirements and expectations, including compliance with industry standards, applicable laws and regulations, and our internal security policies.  We regularly evaluate and assess vendor risk levels based on a variety of factors, such as the nature of shared data, potential impact to business continuity, and vendors' security posture.  Our processes extend beyond initial evaluations to include proactive monitoring and routine oversight.\n \nCybersecurity incidents and risks of which we are aware as of the date of this Form 10-K have not materially affected our business strategy, results of operations, and financial condition, although we face ongoing risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our business strategy, reputation, results of operations, or financial condition.\n \nSee “Risk Factors” in",
    "item1b": "Item 1B - Unresolved Staff Comments\nNone.\n16\nTable of Contents"
  }
}