{
  "ticker": "LRCX",
  "cik": "0000707549",
  "company_name": "LAM RESEARCH CORP",
  "filing_date": "2025-08-11",
  "accession": "0000707549-25-000075",
  "primary_doc": "lrcx-20250629.htm",
  "item_sections": {
    "item1": "Item 1.     \nBusiness\nIncorporated in 1980, Lam Research Corporation (“Lam Research,” “Lam,” “we,” “our,” “us,” or the “Company”) is a Delaware corporation, headquartered in Fremont, California. We maintain a network of facilities throughout Asia, Europe, and the United States in order to meet the needs of our dynamic customer base.\nAdditional information about Lam Research is available on our website at www.lamresearch.com. The content on any website referred to in this Form 10-K is not a part of or incorporated by reference in this Form 10-K unless expressly noted.\nOur Annual Report on Form 10-K, Quarterly Reports on Forms 10-Q, Current Reports on Forms 8-K, Proxy Statements and all other filings we make with the SEC are available on our website, free of charge, as soon as reasonably practical after we file them with or furnish them to the SEC and are also available online at the SEC’s website at www.sec.gov. \nLam Research Corporation 2025 10-K \n3\nTable of Contents\nThe Lam Research logo, Lam Research, and all product and service names used in this report are either registered trademarks or trademarks of Lam Research Corporation or its subsidiaries in the United States and/or other countries. All other marks mentioned herein are the property of their respective holders.\nWe are a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas such as nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering, and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices. \nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers (“IDMs”) that make products such as non-volatile memory (“NVM”), dynamic random-access memory (“DRAM”), and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits (“ICs”) on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing (the “Cloud”)\n,\n artificial intelligence, 5G, the Internet of Things (“IoT”), and other markets is driving the need for increasingly powerful and cost\n-\nefficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional (“3D”) architecture as well as multiple patterning to enable shrinks. \nWe believe we are in a strong position with our leadership and expertise in deposition\n,\n etch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Several factors create opportunity for sustainable differentiation for us: (i) our focus on research and development, with several on-going programs relating to sustaining engineering, product and process development, and concept and feasibility; (ii) our ability to effectively leverage cycles of learning from our broad installed base; (iii) our collaborative focus with semi-ecosystem partners, including our close-to-customer focus; (iv) our ability to identify and invest in the breadth of our product portfolio to meet technology inflections; and (v) our focus on delivering our multi-product solutions with a goal to enhance the value of Lam’s solutions to our customers.\nWe also address processes for back-end wafer-level packaging (“WLP”), which is an alternative to traditional wire bonding and can offer a smaller form factor, increased interconnect speed and bandwidth, and lower power consumption, among other benefits. We offer advanced packaging solutions that support fan-out panel-level packaging, a process in which chips or chiplets are cut from a large format substrate sheet several times the size of a traditional silicon wafer, which increases yield and reduces waste and solutions that meet the need for 3D stacking of high bandwidth memory (“HBM”). In addition, our products are well-suited for related markets that rely on semiconductor processes and require production-proven manufacturing capability, such as complementary metal-oxide-semiconductor image sensors (“CIS”) and micro-electromechanical systems (“MEMS”).\nOur Customer Support Business Group (“CSBG”) provides products and services to maximize installed equipment performance, predictability, and operational efficiency. We offer a broad range of services to deliver value throughout the lifecycle of our equipment, including customer service, spares, upgrades, and new and refurbished non-leading edge products in our deposition, etch, and clean markets. Many of the technical advances that we introduce in our newest products are also available as upgrades, which provide customers with a cost-effective strategy for extending the performance and capabilities of their existing wafer fabrication lines. Service offerings include fleet level Equipment Intelligence\n® \nsolutions to maximize the productivity of our customers through system uptime or availability optimization, throughput improvements, and defect reduction. Our spares product line offers running cost optimization programs and focuses on product life extension to help customers increase the return on their capital purchases. Additionally, within CSBG, our Reliant\n®\n product line offers new and refurbished non-leading edge products in deposition, etch and clean markets for those applications that do not require the most advanced wafer processing capability. \nLam Research Corporation 2025 10-K \n4\nTable of Contents\nProducts\nMarket\n \nProcess/Application\n \nTechnology\n \nProducts\nDeposition\nMetal Films\nElectrochemical Deposition (“ECD”) (Copper & Other)\nSABRE\n®\n family \nChemical Vapor Deposition (“CVD”)\nAtomic Layer Deposition (“ALD”)\n(Tungsten & Molybdenum)\nALTUS\n®\n family\n Dielectric Films\nPlasma-enhanced CVD (“PECVD”)\nALD \nGapfill High-Density Plasma CVD (“HDP-CVD”)\nVECTOR\n®\n family\nStriker\n®\n \nfamily\nSPEED\n®\n family\nEtch\nConductor Etch\nReactive Ion Etch\nKiyo\n®\n family, \nVersys\n®\n Metal family\nDielectric Etch\nReactive Ion Etch\nFlex\n®\n family\nVantex\n®\n family\nThrough-silicon Via (“TSV”) Etch\nDeep Reactive Ion Etch\nSyndion\n®\n family\nClean\nWafer Cleaning\nWet Clean\nEOS\n®\n, DV-Prime\n®\n, \nDa Vinci\n®\n, SP Series\nBevel Cleaning\nDry Plasma Clean\nCoronus\n®\n family\nDeposition Processes and Product Families\n \nDeposition processes create layers of dielectric (insulating) and metal (conducting) materials used to build a semiconductor device. Depending on the type of material and structure being made, different techniques are employed. Electrochemical deposition creates the copper wiring (interconnect) that links devices in an integrated circuit (“IC” or “chip”). Plating of copper and other metals is also used for TSV and WLP applications. Tiny molybdenum or tungsten connectors and thin barriers are made with the precision of chemical vapor deposition and atomic layer deposition, which adds only a few layers of atoms at a time. Plasma-enhanced CVD, high-density plasma CVD, and ALD are used to form the critical insulating layers that isolate and protect all of these electrical structures. Lastly, post-deposition treatments such as ultraviolet thermal processing are used to improve dielectric film properties.\nALTUS\n®\n Product Family\nTungsten and/or molybdenum deposition is used to form conductive features such as contacts, vias, and wordlines on a chip. These features are small, often narrow, and use only a small amount of metal, so minimizing resistance and achieving complete fill can be difficult. At these nanoscale dimensions, even slight imperfections can impact device performance or cause a chip to fail. Our ALTUS\n®\n systems combine CVD and ALD technologies to deposit the highly conformal or selective films as needed for advanced tungsten or molybdenum metallization (ALTUS\n® \nHalo) applications in both logic and memory. The Multi-Station Sequential Deposition architecture enables nucleation layer formation and bulk CVD/ALD fill to be performed in the same chamber (“in situ”). Our ALD technologies are used in the deposition of barrier films to achieve high step coverage with reduced thickness at lower temperatures relative to a conventional process.\nSABRE\n®\n Product Family\nCopper deposition lays down the electrical wiring for most semiconductor devices. Even the smallest defect - say, a microscopic pinhole or dust particle - in these conductive structures can impact device performance, from loss of speed to complete failure. The SABRE\n®\n ECD product family, which helped pioneer the copper interconnect transition, offers the precision needed for copper damascene manufacturing in logic and memory. System capabilities include cobalt deposition for logic applications and copper deposition directly on various liner materials, which is important for next-generation metallization schemes. For advanced packaging applications, such as forming conductive bumps, redistribution layers, TSV filing, and wafer level bonding, the SABRE\n®\n 3D family combines Lam’s SABRE Electrofill\n®\n technology with additional innovation to deliver the high-quality films needed at high productivity. The modular architecture can be configured with multiple plating and pre/post-treatment cells, providing flexibility to address a variety of packaging applications, including HBM.\nSPEED\n®\n Product Family\nDielectric gapfill processes deposit critical insulation layers between conductive and/or active areas by filling openings of various aspect ratios between conducting lines and between devices. With advanced devices, the structures being filled can be very tall and narrow. As a result, high-quality dielectric films are especially important due to the ever-increasing possibility of cross-talk and device failure. Our SPEED\n®\n HDP-CVD products provide a multiple dielectric film solution for high-quality gapfill with industry-leading throughput and reliability. SPEED\n®\n products have excellent particle performance, and their design allows large batch sizes between cleans and faster cleans.\nLam Research Corporation 2025 10-K \n5\nTable of Contents\nStriker\n®\n Product Family\nThe latest memory, logic, and imaging devices require extremely thin, highly conformal dielectric films for continued device performance improvement and scaling. For example, ALD films are critical for low-k spacers for device power consumption/speed, dielectric gapfills in high aspect ratio features for isolation and device performance, as well as for spacer-based multiple patterning schemes where the spacers help define critical dimensions. These applications have little tolerance for voids and even the smallest defect. The Striker\n®\n single-wafer ALD products provide dielectric film solutions for these challenging requirements through application-specific material, process and hardware options that deliver film technology and defect performance. \nVECTOR\n® \nProduct Family\nDielectric film deposition processes are used to form some of the most difficult-to-produce insulating layers in a semiconductor device, including those used in the latest transistors and 3D structures. In some applications, these films require dielectric films to be exceptionally uniform and defect free since slight imperfections are multiplied greatly in subsequent layers. Our VECTOR\n®\n PECVD products are designed to provide the performance and flexibility needed to create these enabling structures within a wide range of challenging device applications. As a result of its design, VECTOR\n®\n produces superior thin film quality, along with exceptional within-wafer and wafer-to-wafer uniformity. \nEtch Processes and Product Families\nEtch processes create chip features by selectively removing dielectric, metal, silicon and poly silicon materials, including films that have been added during deposition. Reactive ion etch processing enables device-critical formation steps to enable transistor performance, create storage capacitors, and memory cells. Low temperature, cryogenic etching enables the use of new, novel chemistries to deliver increased high aspect ratio etch capability.\nFlex\n®\n Product Family\nDielectric etch carves patterns in insulating materials to create barriers between the electrically conductive parts of a semiconductor device. For advanced devices, these structures can be extremely tall and thin and involve complex, sensitive materials. Slight deviations from the target feature profile - even at the atomic level - can negatively affect electrical properties of the device. To precisely create these challenging structures, our Flex\n®\n product family offers differentiated technologies and application-focused capabilities for critical dielectric etch applications. Uniformity, repeatability, and tunability are enabled by a unique multi-frequency, small-volume, confined plasma design. Flex\n®\n offers in situ multi-step etch and continuous plasma capability that delivers high productivity with low defectivity.\nVantex\n®\n Product Family\nDielectric etch processes remove non-conductive materials during the manufacturing of a semiconductor device. Leading-edge memory devices have especially challenging structures, such as extremely deep holes and trenches, that must be manufactured with tight tolerances. Our latest dielectric etch system, Vantex\n®\n creates high aspect ratio device features while maintaining critical dimension (“CD”) uniformity and selectivity. Vantex\n® \nis part of our Sense.i\n®\n platform and offers advanced RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence\n®\n solutions to meet the needs of advanced memory manufacturing, primarily in 3D NAND high aspect ratio hole, trench, contact, and capacitor cell applications.\nKiyo\n®\n Product Family\nConductor etch helps shape the electrically active materials used in the parts of a semiconductor device. Even a slight variation in these miniature structures can degrade device performance. In fact, these structures are so tiny and sensitive that etch processes push the boundaries of the basic laws of physics and chemistry. Our Kiyo\n®\n product family delivers the high-performance capabilities needed to precisely and consistently form these features precisely and with high productivity. Proprietary Hydra technology in Kiyo\n®\n products improves CD uniformity by correcting for incoming pattern variability, and atomic-scale variability control with production-worthy throughput.\nSyndion\n®\n Product Family \nPlasma etch processes used to remove silicon and other materials deep into the wafer are collectively referred to as deep silicon etch. These may be deep trenches for CMOS image sensors, trenches for power and other devices, TSVs for HBM and advanced packaging, and other high aspect ratio features. These are created by etching through multiple materials sequentially, where each new material involves a change in the etch process. The Syndion\n®\n etch product family is optimized for deep silicon etch, providing the fast process switching with depth and cross-wafer uniformity control required to achieve precision etch results. The systems support both conventional single-step etch and rapidly alternating process, which minimizes damage and delivers precise depth uniformity.\nVersys\n®\n Metal Product Family\nMetal etch processes play a key role in connecting the individual components that form an IC, such as forming wires and electrical connections. These processes can also be used to drill through metal hardmasks that are used to form the wiring for advanced devices. To enable these critical etch steps, the Versys\n®\n Metal product family provides high-productivity capability on a flexible \nLam Research Corporation 2025 10-K \n6\nTable of Contents\nplatform. Superior CD, profile uniformity, and uniformity control are enabled by a symmetrical chamber design with independent process tuning features.\nClean Processes and Product Families\nClean techniques are used between manufacturing steps to clear away particles, contaminants, residues and other unwanted material that could later lead to defects and to prepare the wafer surface for subsequent processing. Wet processing technologies can be used for wafer cleaning and etch applications. Plasma bevel cleaning is used to enhance die yield by removing unwanted materials from the wafer’s edge that could impact the device area. \nCoronus\n®\n Product Family\nBevel cleaning removes unwanted masks, residues, and films from the edge of a wafer between manufacturing steps. If not cleaned, these materials become defect sources. For instance, they can flake off and re-deposit on the device area during subsequent processes. Even a single particle that lands on a critical part of a device can ruin the entire chip. By inserting bevel clean processes at strategic points, these potential defect sources can be eliminated and more functional chips produced. By combining the precise control and flexibility of plasma with technology that protects the active die area, the Coronus\n®\n \nbevel clean family cleans the wafer’s edge to enhance die yield.\n \nThe systems provide active die area protection by using plasma processing with proprietary confinement technology. Applications include post-etch, pre- and post-deposition, pre-lithography, and metal film removal to prevent arcing during plasma etch or deposition steps.\nDV-Prime\n®\n,\n \nDa Vinci\n®\n,\n \nEOS\n®\n, and SP Series Product Families\nWafer cleaning is performed repeatedly during semiconductor device manufacturing and is a critical process that affects product yield and reliability. Unwanted microscopic materials - some no bigger than the tiny structures themselves - need to be cleaned effectively. At the same time, these processes must selectively remove residues that are chemically similar to the device films. For advanced WLP, the wet clean steps used between processes that form the package and external wiring have surprisingly complex requirements. These processes are called on to completely remove specific materials and leave other fragile structures undisturbed. In IoT products that include power devices, MEMS and image sensors, there is a unique requirement for wafer backside wet etch to uniformly thin the silicon wafer while protecting the device side of the wafer.\nBased on our pioneering single-wafer spin technology, the DV-Prime\n®\n and Da Vinci\n®\n products provide the process flexibility needed with high productivity to address a wide range of wafer cleaning steps throughout the manufacturing process flow. As the latest of Lam’s wet clean products, EOS\n®\n delivers exceptionally low on-wafer defectivity and high throughput to address progressively demanding wafer cleaning applications. With a broad range of process capability, our SP Series products deliver cost-efficient, production-proven wet clean and silicon wet etch solutions for challenging WLP and IoT applications. \nFiscal Periods Presented\nAll references to fiscal years apply to our fiscal years, which ended June 29, 2025, June 30, 2024, and June 25, 2023.\nResearch and Development\nThe market for semiconductor capital equipment is characterized by rapid technological change and product innovation. Our ability to achieve and maintain our competitive advantage depends in part on our continued and timely development of new products and enhancements to existing products. Accordingly, we devote a significant portion of our personnel and financial resources to research and development (“R&D”) programs and seek to maintain close and responsive relationships with our customers and suppliers.\nWe believe current challenges for customers at various points in the semiconductor manufacturing process present opportunities for us. We expect to continue to make substantial investments in R&D to meet our customers’ product needs, support our growth strategy, and enhance our competitive position.\nMarketing, Sales, and Service\nOur marketing, sales, and service efforts are focused on building long-term relationships with our customers and targeting product and service solutions designed to meet their needs. These efforts are supported by a team of product marketing and sales professionals as well as equipment and process engineers who work closely with individual customers to develop solutions for their wafer processing needs. We maintain ongoing service relationships with our customers and have an extensive network of service engineers in place throughout the United States (“U.S.”), China, Europe, India, Japan, Korea, Southeast Asia, and Taiwan. We believe that comprehensive support programs and close working relationships with customers are essential to maintaining high customer satisfaction and our competitiveness in the marketplace.\nWe provide standard warranties for our systems. The warranty provides that systems will be free from defects in material and workmanship and will conform to agreed-upon specifications. The warranty is limited to repair of the defect or replacement with new or like-new equivalent goods and is valid when the buyer provides prompt notification within the warranty period of the claimed defect or non-conformity and also makes the items available for inspection and repair. \nLam Research Corporation 2025 10-K \n7\nTable of Contents\nInternational Sales\nA significant portion of our sales and operations occur outside the United States and, therefore, may be subject to certain risks, including but not limited to compliance with U.S. and international laws and regulations, including U.S. export restrictions; tariffs and other barriers; difficulties in staffing and managing non-U.S. operations; adverse tax consequences; foreign currency exchange rate fluctuations; changes in currency controls; and economic and political conditions. Any of these factors may have a material adverse effect on our business, financial position, and results of operations and cash flows. For geographical reporting, revenue is attributed to the geographic location in which the customers’ facilities are located. Refer to \nNote 19\n of our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K, for the attribution of revenue by geographic region. \nLong-lived Assets\nRefer to \nNote 19\n of our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K, for information concerning the geographic locations of long-lived assets.\nCustomers\nOur customers include many of the world’s leading semiconductor manufacturers. Customers continue to establish joint ventures, alliances, and licensing arrangements which have the potential to positively or negatively impact our competitive position and market opportunities. Refer to \nNote 9\n of our Consolidated Financial Statements, included in Part II, Item 8 of this report, for information concerning customer concentrations. Our most significant customers during the fiscal years ending June 29, 2025, June 30, 2024, and June 25, 2023 included Samsung Electronics Company, Ltd. and Taiwan Semiconductor Manufacturing Company.\nA material reduction in orders from our customers could adversely affect our results of operations and projected financial condition. Our business depends upon the expenditures of semiconductor manufacturers. Semiconductor manufacturers’ businesses, in turn, depend on many factors, including their economic capability, the current and anticipated market demand for ICs, and the availability of equipment capacity to support that demand.\nManufacturing\nOur manufacturing operations mainly consist of assembling and testing components, sub-assemblies, and modules that are then integrated into finished systems prior to shipment to or at the location of our customers. The assembly and testing of our products is conducted predominately in cleanroom environments. \nWe have agreements with third parties to outsource certain aspects of our manufacturing, production warehousing, and logistics functions. These outsourcing contracts may provide us more flexibility to scale our operations up or down in a timely and cost-effective manner. We believe that we have selected reputable providers and have secured their performance on terms documented in written contracts. However, it is possible that one or more of these providers could fail to perform as we expect, and such failure could have an adverse impact on our business and have a negative effect on our operating results and financial condition. Overall, we believe we have effective mechanisms to manage risks associated with our outsourcing relationships. Refer to \nNote 17\n of our Consolidated Financial Statements, included in Part II, Item 8 of this report, for further information concerning our outsourcing commitments, reported as a component of purchase obligations.\nCertain components and sub-assemblies that we include in our products may only be obtained from a single supplier. We are engaged in efforts to obtain and qualify alternative sources to supply these products and in some circumstances protect against potential supply challenges by carrying inventory in excess of current need. Any prolonged inability to obtain these components could have an adverse effect on our operating results and could unfavorably impact our customer relationships.\nCompliance with Government Regulations\nAs a public company with global operations, we are subject to a variety of governmental regulations across multiple jurisdictions, including those related to export controls, financial and other disclosures, corporate governance, anti-trust, intellectual property, privacy, anti-bribery, anti-corruption, anti-boycott, tax, tariffs, labor, health and safety, conflict minerals, human trafficking, the management of hazardous materials, and carbon emissions, among others. Each of these regulations imposes costs on our business and has the potential to divert our management’s time and attention from revenue-generating and other profit maximizing activities to those associated with compliance. Efforts to comply with new and changing regulations have resulted in, and are likely to continue to result in, decreased net income and increased capital expenditures. If we are alleged or found by a court or regulatory agency not to be in compliance with regulations, we may be subject to fines, restrictions on our actions, reputational damage, and harm to our competitive position, and our business, financial condition, and/or results of operations could be adversely affected. For additional details, please refer to “Legal, Regulatory and Tax Risks – We Are Exposed to Various Risks from Our Regulatory Environment” in",
    "item1a": "Item 1A: Risk Factors\n.",
    "item1b": "Item 1B.\n    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.\n    Cybersecurity\nWe recognize the significant role of information security in safeguarding our valuable intellectual property along with the confidentiality, integrity and availability of the data of our customers, employees, and suppliers. We have implemented certain policies, procedures, and systems that are designed to identify and address material risks related to cybersecurity and cybersecurity incidents. \nWe have a comprehensive enterprise risk management (“ERM”) program, which is implemented by management and overseen by our Board of Directors (“Board”). \nOur identification, assessment, and management of material risks from cybersecurity threats is integrated into the Company’s overall ERM system and processes.\n Our ERM program is designed to leverage existing management processes to (i) identify critical enterprise risks, including both information security and cybersecurity risks, (ii) design and implement appropriate risk mitigation strategies, and (iii) assess the status of risks and mitigation plans.\n \nA key component within our ERM framework is a robust information security risk management program, which includes: \n•\nrisk assessments designed to help identify risks to our critical systems, information, services, and our broader global information systems environment; \n•\na security team principally responsible for managing (i) our cybersecurity risk assessment processes, (ii) our security controls, and (iii) our response to cybersecurity incidents; \n•\nthe use of external service providers, where appropriate, to aid in assessing specific risks, providing benchmarking data, providing information regarding trends or recent regulatory changes applicable to our risk profile, or to test or otherwise assist with aspects of our security processes; \n•\nthe periodic engagement of an independent third-party expert to evaluate our security capabilities\n;\n•\nmandatory annual cybersecurity awareness training of our employees, including incident response personnel and senior management, as well as conducting periodic tests with our user population to reinforce good information security practices; \n•\na cybersecurity incident response plan that includes procedures for responding to cybersecurity incidents, including those impacting the Company’s manufacturing sites; \n•\nprocesses to identify vulnerabilities, breach attempts and possible criminal activity by external parties; and \n•\nprocesses to assess the practices of our suppliers and third-party service providers relative to protecting the security of our information.\n \nThe Company holds ISO 27001-2022 certification for information security at our corporate headquarters. \nOur \nChief Information Security Officer (“CISO”)\n, who has over 30 years of experience in information security and technology leadership, has primary responsibility for (i) leading our global information security program, (ii) managing the cybersecurity risks identified as part of the ERM program, and (iii) developing, implementing, and enforcing security policies and maintaining information security systems.\n \nOur global information security program, led by our CISO, includes dedicated teams specialized in (i) identity access management, (ii) incident response, (iii) vulnerability governance, (iv) security operations and engineering (v) governance, risk, and compliance, and (vi) insider risk and intelligence. The members of the information security team are responsible for managing, maintaining, and monitoring the systems and processes that prevent, detect, mitigate and remediate cybersecurity incidents, and for informing our CISO of status of such systems and processes, as well as any significant incidents.\nOur Board is responsible for overseeing our strategy and approach to addressing information security risks, including managing and assessing risks from cybersecurity threats, both directly and through the audit committee.\n \nThe audit committee is responsible for reviewing and monitoring the Company’s cybersecurity and information security policies and its internal controls regarding cybersecurity and information security. In addition, the audit committee is responsible for regularly reporting to the Board on the substance of such reviews and, as necessary, recommending to the Board such actions as it deems appropriate. \nOur CISO reports on information security risks at least annually to the Board and quarterly to the audit committee or Board.\n \nWe experience cybersecurity and other threats and incidents in the course of our operations. To date, we have not determined that such threats and incidents have materially and adversely affected the Company, including our business strategy, results of operations or financial condition. Furthermore, to date, we have not determined that such threats and incidents are reasonably likely to materially and adversely affect the Company, including our business strategy, results of operations or financial condition.\nLam Research Corporation 2025 10-K \n25\nTable of Contents\nFor additional information on certain risks associated with cybersecurity, please refer to “Our Business Relies on Technology, Data, Intellectual Property and Other Sensitive information That is Susceptible to Cybersecurity and Other Threats or Incidents” in"
  }
}