{
  "ticker": "LULU",
  "cik": "0001397187",
  "company_name": "lululemon athletica inc.",
  "filing_date": "2025-03-27",
  "accession": "0001397187-25-000013",
  "primary_doc": "lulu-20250202.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGeneral\nlululemon athletica inc. is principally a designer, distributor, and retailer of technical athletic apparel, footwear, and accessories. We have a vision to create transformative products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. Since our inception, we have fostered a distinctive corporate culture; we promote a set of core values in our business which include taking personal responsibility, acting with courage, valuing connection and inclusion, and choosing to have fun. These core values attract passionate and motivated employees who are driven to achieve personal and professional goals, and share our purpose \"to elevate human potential by helping people feel their best.\"\nIn this Annual Report on Form 10-K for the fiscal year ended February 2, 2025, lululemon athletica inc. (together with its subsidiaries) is referred to as \"lululemon,\" \"the Company,\" \"we,\" \"us,\" or \"our.\" We refer to the fiscal year ended February 2, 2025 as \"2024,\" the fiscal year ended January 28, 2024 as \"2023.\" Our next fiscal year ends on February 1, 2026 and is referred to as \"2025.\"\nComponents of this discussion of our business include:\n•\nOur Products\n•\nOur Markets and Segments\n•\nIntegrated Marketing\n•\nProduct Design and Development\n•\nSourcing and Manufacturing\n•\nDistribution Facilities\n•\nCompetition\n•\nSeasonality\n•\nHuman Capital\n•\nIntellectual Property\n•\nSecurities and Exchange Commission Filings\nOur Products\nWe offer a comprehensive line of technical athletic apparel, footwear, and accessories marketed under the lululemon brand. Our apparel assortment includes items such as pants, shorts, tops, and jackets designed for a healthy lifestyle including \n1\nTable\n of Contents\nathletic activities such as yoga, running, training, and most other activities. We also offer apparel designed for being on the move and fitness-inspired accessories. We expect to continue to broaden our merchandise offerings through expansion across these product areas. \nOur design and development team continues to source technically advanced fabrics, with new feel and fit, and craft innovative functional features for our products. Through our vertical retail strategy and direct connection with our customers, whom we refer to as guests, we are able to collect feedback and incorporate unique performance and fashion needs into our design process. In this way, we believe we are better positioned to address the needs of our guests, helping us advance our product lines and differentiate us from our competitors.\nDuring 2024, our women's range represented 63% of net revenue and our men's range represented 24% of net revenue. Our comprehensive men's line is a key pillar of our strategic growth plans. We believe net revenue from our men's range is growing as more guests discover the technical rigor and premium quality of our men's products, and are attracted by our distinctive brand. \nWe continue to innovate and introduce new products for our guests. This includes introducing new product categories and expanding our accessories assortment. We believe this is another way in which we can attract new guests and enable them to experience our products. Net revenue from our other product categories represented 13% of net revenue in 2024.\nOur Markets and Segments\nWe operate in over 25 countries around the world and organize our operations into four regional markets: Americas, China Mainland, Asia Pacific (\"APAC\"), and Europe and the Middle East (\"EMEA\"). \nWe report three segments, Americas, China Mainland, and Rest of World, which is comprised of the APAC and EMEA regions on a combined basis. \nWe operate an omni-channel retail model and aim to efficiently and effectively serve our guests in the ways most convenient to them. We continue to evolve and integrate our digital and physical channels in order to enrich our interactions with our guests, and to provide a seamless omni-channel experience. We have invested in technologies which enable our omni-channel retailing model. Our capabilities differ by market and include: \n•\nBuy online pick-up in store\n - guests can purchase our products via our website or digital app and then collect that product from a retail location; \n•\nBack-back room\n - our store educators can access inventory located at our other locations and have product shipped directly to a guest's address or a store;\n•\nShip from store\n – we are able to fulfill e-commerce orders by accessing inventory at both our distribution centers and at our retail locations, expanding the pool of accessible inventory;\n•\nReturns processing\n – e-commerce guests are able to return products either online or in-store; and\n•\nOne inventory pool\n – we are able to view and allocate the product held at our distribution centers to either our physical retail locations, or make it available to fulfill online demand.\n2\nTable\n of Contents\nWe operate a combination of physical retail locations and e-commerce services via our websites, other region-specific websites, digital marketplaces, and mobile apps. Our physical retail locations remain a key part of our growth strategy and we view them as a valuable tool in helping us build our brand and product line as well as enabling our omni-channel capabilities. We plan to continue to expand square footage and open new company-operated stores to support our growth objectives. \nAmericas\nWe have operated in the Americas for over 25 years. We opened our first ever store in Vancouver, Canada in 1998. In 2024, the net revenue we generated in the Americas represented 75% of our total net revenue. \n2024\n2023\n(In thousands)\nNet revenue\n$\n7,928,156 \n$\n7,631,647 \nNet revenue growth\n3.9 \n%\n11.9 \n%\nOur operations in the Americas are core to our business and we aim to continue to grow our net revenue in this market through ongoing product innovation and by building brand awareness. We also plan to continue to invest in our omni-channel capabilities, to open new retail locations, and to relocate, optimize, and renovate our existing locations as needed.\nWe generate net revenue in the Americas through our lululemon branded retail locations which include different sizes of company-operated stores, outlets, pop-ups, and other temporary locations. We also serve our guests via our e-commerce website www.lululemon.com, our mobile app, our “Like New” re-commerce program, and through certain wholesale arrangements including university campus retailers and other organizations that we partner with to sell co-branded lululemon products as well as through wholesale arrangements with yoga and fitness studios and other select partners. \nOn September 10, 2024, we acquired the lululemon branded retail locations and operations run by a third party in Mexico. We had previously granted the third party the right to operate retail locations and to sell lululemon products in Mexico. \nChina Mainland \nWe opened our first store in China Mainland in fiscal 2014. In 2024, the net revenue we generated in China Mainland represented 13% of our total net revenue. \n2024\n2023\n(In thousands)\nNet revenue\n$\n1,361,337 \n$\n963,760 \nNet revenue growth\n41.3 \n%\n67.2 \n%\nWe have experienced significant net revenue growth in China Mainland and believe that as we continue to expand our operations and build our brand awareness, net revenue will continue to increase in this market. We believe China Mainland net revenue growth will drive an increase in our overall international net revenue. We plan to continue to invest in China Mainland and expect that the majority of our company-operated store openings in 2025 will be in this market. \nWe operate lululemon branded retail locations in China Mainland in a variety of different formats including different sizes of company-operated stores, outlets, pop-ups, and other temporary locations. We also serve our guests via our WeChat store and on third party marketplaces such as T-Mall and JD.com. \n3\nTable\n of Contents\nRest of World \nIn 2024, the net revenue we generated in APAC and EMEA represented 12% of our total net revenue. \n2024\n2023\n(In thousands)\nNet revenue\n$\n1,298,633 \n$\n1,023,871 \nNet revenue growth\n26.8 \n%\n42.9 \n%\nWe have experienced significant net revenue growth in APAC and EMEA and intend to continue to invest in these markets to build brand awareness. Where we identify growth opportunities, we plan to open new retail locations, including in new markets across the EMEA and APAC regions. \nWe operate lululemon branded retail locations in these markets in a variety of different formats including different sizes of company-operated stores, outlets, pop-ups, and stores operated by third-parties under license and supply arrangements. We also serve our guests via our country specific websites, our mobile app, and through third party regional marketplaces, such as Zalando, Lazada, and SSG. \nOur Selling Channels \nWe conduct our business through a number of different channels in each market: \nCompany-operated stores\n: In addition to serving as a venue to sell our products, our stores give us a direct connection to our guests, which we view as a valuable tool in helping us build our brand and product lines as well as enabling our omni-channel capabilities. Our retail stores are located primarily on street locations, in lifestyle centers, and in malls. Our sales per square foot was $1,574 and $1,609 for 2024 and 2023, respectively.\nNumber of company-operated stores by market\nFebruary 2, 2025\nJanuary 28, 2024\nUnited States\n374 \n367 \nCanada\n71 \n71 \nMexico\n17 \n— \nAmericas\n462 \n438 \nChina Mainland\n151 \n127 \nAustralia\n33 \n33 \nSouth Korea\n20 \n19 \nHong Kong SAR\n10 \n9 \nJapan\n10 \n8 \nNew Zealand\n8 \n8 \nTaiwan\n8 \n8 \nSingapore\n7 \n7 \nMalaysia\n5 \n3 \nThailand\n4 \n1 \nMacau SAR\n2 \n2 \nAPAC\n107 \n98 \n4\nTable\n of Contents\nNumber of company-operated stores by market\nFebruary 2, 2025\nJanuary 28, 2024\nUnited Kingdom\n19 \n20 \nGermany\n9 \n9 \nFrance\n6 \n6 \nIreland\n4 \n4 \nSpain\n3 \n3 \nNetherlands\n2 \n2 \nSweden\n2 \n2 \nNorway\n1 \n1 \nSwitzerland\n1 \n1 \nEMEA\n47 \n48 \nTotal company-operated stores\n767 \n711 \nE-commerce\n: We believe e-commerce is convenient for our guests and also allows us to reach and serve guests in markets beyond where our physical retail locations are based. We believe this channel is effective in building brand awareness, especially in new markets. We serve our guests via our e-commerce websites, other country and region-specific websites, digital marketplaces, and mobile apps. E-commerce net revenue includes our buy online pick-up in store, back-back room, and ship from store omni-channel retailing capabilities. \nOther channels\n: We also use certain other distribution channels, generally with the goal of building brand awareness and providing broader access to our products. These other channels include:\n•\nTemporary locations \n- Our seasonal stores and pop-ups are typically opened for a short period of time enabling us to serve guests during peak shopping periods in markets where we do not ordinarily have a physical location, or to expand access in markets where we see high demand at our existing locations. \n•\nWholesale\n - We sell to partners that offer convenient access for both core and new guests, including university campus retailers and other organizations that we partner with to sell co-branded lululemon products. We also sell to yoga and fitness studios and other select partners. \n•\nOutlets\n - We utilize outlets to sell slower moving inventory and inventory from prior seasons at discounted prices. As of February 2, 2025, we operated 52 outlets, the majority of which were in the Americas.\n•\nLike New\n - Our re-commerce program allows guests to exchange their gently used lululemon products for merchandise credit. Those products are then verified and quality checked before being resold online at likenew.lululemon.com. We believe this program is a step towards a circular eco-system and helps reduce our environmental footprint. \n•\nLicense and supply arrangements\n - We enter into license and supply arrangements when we believe it will be to our advantage to partner with third parties with significant experience and proven success in certain target markets. Under these arrangements we have granted certain third parties the right to operate lululemon branded retail locations and to sell lululemon products on websites in specific countries. On September 10, 2024, we acquired the lululemon branded retail locations and operations run by a third party in Mexico. We had previously granted the third party the right to operate retail locations and to sell lululemon products in Mexico.\n5\nTable\n of Contents\nNumber of retail locations operated by third parties by market\nFebruary 2, 2025\nJanuary 28, 2024\nMexico\n— \n15 \nUnited Arab Emirates\n10 \n8 \nSaudi Arabia\n8 \n6 \nIsrael\n7 \n3 \nKuwait\n4 \n3 \nQatar\n4 \n3 \nBahrain\n1 \n1 \nTotal locations operated by third parties under license and supply arrangements\n34 \n39 \nIntegrated Marketing\nWe believe that our brand awareness is relatively low, especially outside of the Americas, and also with men. This represents an opportunity for us and we have designed a multi-faceted strategy that leverages what guests know us for; our products, community, and experiences. This strategy is designed to leverage owned and paid channels, our ambassador network, events, and content – to drive awareness, consideration, engagement, conversion, and ultimately loyalty and engagement at the global, regional, and local levels. \nProduct Design and Development\nOur product design and development efforts are led by a team of researchers, scientists, engineers, and designers. Our team is comprised of athletes and users of our products who embody our design philosophy and dedication to premium quality. Our design and development team identifies trends based on market intelligence and research, proactively seeks the input of our guests and our ambassadors, and broadly seeks inspiration consistent with our goals of function, style, and technical superiority.\nAs we strive to continue to provide our guests with technically advanced fabrics, our team works closely with our suppliers to incorporate the latest in technical innovation, bringing particular specifications to our products. We partner with independent inspection, verification, and testing companies, who conduct a variety of tests on our fabrics, testing performance characteristics including pilling, shrinkage, abrasion resistance, and colorfastness. We develop proprietary fabrics and collaborate with leading fabric and trims suppliers to manufacture fabrics and trims that we generally seek to protect through agreements, trademarks, and as trade-secrets.\nSourcing and Manufacturing\nWe do not own or operate any manufacturing facilities. We rely on a limited number of suppliers to provide fabrics for, and to produce, our products. The following statistics are based on cost.\nWe work with a group of approximately 52 vendors that manufacture our products, five of which produced 49% of our products in 2024, with the largest manufacturer producing 15%. During 2024, 40% of our products were manufactured in Vietnam, 17% in Cambodia, 11% in Sri Lanka, 11% in Indonesia, and 7% in Bangladesh, and the remainder in other regions.\nWe work with a group of approximately 67 suppliers to provide the fabrics for our products. In 2024, 52% of our fabrics were produced by our top five fabric suppliers, with the largest manufacturer producing 18%. During 2024, 35% of our fabrics originated from Taiwan, 28% from China Mainland, and 11% from South Korea, and the remainder from other regions. \nWe also source other raw materials which are used in our products, including items such as content labels, elastics, buttons, clasps, and drawcords from suppliers located predominantly in APAC and China Mainland.\nWe have developed long-standing relationships with a number of our vendors and take care to ensure that they share our commitment to quality and ethics. We do not, however, have any long-term contracts with the majority of our suppliers or manufacturing sources for the production and supply of our fabrics and garments, and we compete with other companies for fabrics, raw materials, and production. Our product quality and sustainability teams closely assess and monitor each supplier's compliance with applicable laws and our Vendor Code of Ethics, including by partnering with leading inspection and verification firms.\n6\nTable\n of Contents\nDistribution Facilities\nWe operate and distribute finished products from our distribution facilities in the United States, Canada, and Australia. We own our distribution center in Groveport, Ohio, and lease our other distribution facilities. We also utilize third-party logistics providers in a number of countries in which we operate to warehouse and distribute finished products from their warehouse locations. We regularly evaluate our distribution infrastructure and consolidate or expand our distribution capacity as we believe appropriate for our operations and to meet anticipated needs.\nCompetition\nCompetition in the athletic apparel industry is based principally on brand image and recognition as well as product quality, innovation, style, distribution, and price. We believe we successfully compete on the basis of our premium brand image and our technical product innovation. We also believe our ability to introduce new product innovations, combine function and fashion, and connect through in-store, online, and community experiences sets us apart from our competition. In addition, we believe our vertical retail distribution strategy and community-based marketing differentiates us further, allowing us to more effectively control our brand image and connect with our guests.\nThe market for athletic apparel is highly competitive. It includes increasing competition from established companies that are expanding their production and marketing of performance products, as well as from frequent new entrants to the market. We are in direct competition with global as well as regional and country-specific wholesalers and direct sellers of athletic apparel and footwear.\nSeasonality\nOur business is affected by the general seasonal trends common to the retail apparel industry. Our annual net revenue is typically weighted more heavily toward our fourth fiscal quarter, reflecting our historical strength in sales during the holiday season in the Americas, while our operating expenses are generally more equally distributed throughout the year. As a result, a substantial portion of our operating profits are typically generated in the fourth quarter of our fiscal year. For example, we generated approximately 42% of our full year operating profit during the fourth quarter of 2024. \nHuman Capital\nOur Impact Agenda sets out our social and environmental goals and strategy across three pillars - Be Human, Be Well, and Be Planet. Details can be found in our Impact Report on our website. Included within our Impact Agenda is a goal to invest a total of $75.0 million to advance equity in well-being by the end of 2025. As of February 2, 2025, we have invested a total of $71.0 million\n(1)\n towards this goal. \nThe Be Human pillar of our Impact Agenda sets out our focus areas with respect to human capital, including inclusion for all, employee empowerment, and fair labor practices and the well-being of the people who make our products. \nInclusion for All\nWe are committed to fostering an environment where every individual feels valued and included, recognizing that diverse perspectives drive innovation and enrich our workplace.\nWe are proud that as of February 2, 2025, approximately 55% of our board of directors, 60% of our senior executive leadership team, and 45% of our vice presidents and above are women, while approximately 75% of our overall workforce are women. \nDuring 2024, we implemented an ongoing feedback approach to gain insights into our workforce composition and gather measurable data on employees' feelings of engagement, inclusion, and belonging. Our primary objective is to cultivate a workforce inspired and informed by the diversity of the communities we serve and where we operate. \nWe strive to maintain equitable pay, by geography, for comparable work across all our global operations. We have achieved full pay equity across various demographics in regions where we analyze this data.\nWe offer all employees education, training, and facilitated discussions on topics such as preventing bias, ensuring equal opportunity, and fostering inclusive leadership behaviors. We see strong engagement in inclusion-focused education and \n(1)\n We have contributed $71.0 million to lululemon's Centre for Social Impact, $45.5 million of which has been contributed directly to social impact organizations. The remaining $25.5 million primarily consists of contributions toward a donor-advised fund for future grant making.\n7\nTable\n of Contents\ntraining across our global employee base. We strive to foster a culture where inclusion is part of everyday conversations and regularly review our policies, programs, and practices to try to ensure they support a more inclusive and fair workplace.\nEmployee Empowerment\nWe believe our people are key to the success of our business. As of February 2, 2025, we employed approximately 39,000 people worldwide. We strive to foster a distinctive culture rooted in our core values that attracts and retains passionate and motivated employees who are driven to achieve personal and professional goals. We believe our people succeed because we create an environment that fosters growth and provides opportunities for all.\nWe understand that health and wealth programs need to offer choice at all stages of life. Our current offerings support our goal of becoming the number one place where people come to develop and grow as inclusive leaders, and we regularly use feedback to inform opportunities to support this goal. These offerings include, among other things: \n•\nCompetitive compensation which rewards exceptional performance;\n•\nA Fund your Future program for eligible employees which offers partial contribution matches to a pension plan and employee share purchase plan;\n•\nAn annual paid VALUES (Volunteer, Awareness, Life, Unity, Empowerment, Support) Day, competitive paid time off, and sick leave;\n•\nAn employee discount program, which includes a lifetime discount to celebrate the contribution of our long-tenured employees to keep them within our collective, even when they have moved on to pursue goals outside of lululemon; \n•\nReimbursement programs which reward physical activity;\n•\nA parenthood program that provides all eligible employees up to six months of paid leave; \n•\nAn employee assistance program which provides free confidential support to all our employees and their families in a variety of areas from mental well-being to financial services to advice for new parents; and\n•\nTraining and development of all of our employees including, but not limited to, mentorship programs, global internships, leadership development, vision and goals, and coaching.\nFair Labor Practices and the Well-Being of the People who Make our Products \nWe work with suppliers who we believe share our values and collaborate with us to uphold robust standards, address systemic challenges, and support the well-being of people who make our products. Our Responsible Supply Chain program is built on three pillars:\n•\nMonitoring\n - Assessing and, in collaboration with suppliers, improving working conditions in facilities.\n•\nIntegration\n - Integrating responsible purchasing practices across key lululemon strategies, processes, and tools. \n•\nCollaboration\n - Working with multi-stakeholder organizations, industry, suppliers, and brands to support systemic change and impact. \n8\nTable\n of Contents\nOur Vendor Code of Ethics outlines our commitment to respect human and labor rights, and promote safe and fair working conditions for people in our supply chain. The code, which is based on international standards, sets the minimum standards for our supplier partners and is a component of our supplier and manufacturer agreements. Our finished goods and fabric suppliers are assessed against the Vendor Code of Ethics prior to forming a business relationship, and regularly thereafter; we work with factories that can uphold our strict requirements.\nOur Foreign Migrant Worker Standard sets out our minimum requirements for what we believe are the appropriate and ethical recruitment, employment, and repatriation of foreign migrant workers.\nIntellectual Property\nWe have trademark rights on many of our products and believe having distinctive marks that are readily identifiable is an important factor in building our brand image and in distinguishing our products from the products of others. We consider our lululemon and wave design trademarks to be among our most valuable assets. In addition, we own many other trademarks for the names of several of our brands, slogans, fabrics and products. We own registered and pending U.S. and foreign utility and design patents, industrial designs in Canada, and registered community designs in Europe that protect our product innovations, distinctive apparel, and accessory designs.\nSecurities and Exchange Commission Filings\nOur website address is www.lululemon.com. We provide free access to various reports that we file with, or furnish to, the United States Securities and Exchange Commission, or the SEC, through our website, as soon as reasonably practicable after they have been filed or furnished. These reports include, but are not limited to, our Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports. Our SEC reports can also be accessed through the SEC's website at www.sec.gov. Also available on our website are printable versions of our Global Code of Business Conduct and Ethics and charters of the standing committees of our board of directors. Information contained on or accessible through our websites is not incorporated into, and does not form a part of, this annual report or any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.",
    "item1a": "Item 1A. Risk Factors of this annual report.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy \nOur business operations and relationships with customers and suppliers are heavily reliant on technology. We operate a cybersecurity program designed to assess our security risks and threats, to manage those risks and protect our technology systems and data, and to detect and respond to cybersecurity incidents. \nWe manage strategic risks, including cybersecurity risk, through our Enterprise Risk Management program which has direct involvement from the board of directors, the audit committee, and senior management.\n Through this process, we have identified cybersecurity as a risk management priority.\n \nGovernance\nOur \nboard of directors\n is responsible for the oversight of cybersecurity risks and has delegated primary responsibility to the audit committee, which is responsible for overseeing our enterprise risk assessments and management policies, procedures, and practices (including regarding those risks related to information security, cybersecurity, and data protection).\n \nThe audit committee maintains a cybersecurity sub-committee that is comprised of our EVP, Chief Information Officer (\"CIO\"), our SVP, Chief Information Security Officer (\"CISO\"), and representatives from the audit committee and board of directors that have knowledge and experience in cybersecurity matters. The cybersecurity sub-committee reviews our cybersecurity risk assessments and the steps being taken to monitor, control, and report on those risks as well as discusses regulatory and market developments. They also review our process for identifying and responding to cybersecurity incidents in a timely manner, and details of cybersecurity attacks or incidents which have occurred.\nManagement generally meets with, and provides reports to, the cybersecurity sub-committee on a quarterly basis. Our CIO and CISO also meet with and provide reports to the audit committee at least quarterly. The board of directors receives periodic reports regarding the activities of the cybersecurity sub-committee. These reports and meetings are designed to inform the board of directors and committees about the current state of our information security program including cybersecurity risks, the nature, timing, and extent of cybersecurity incidents, if any, and the resolution of such matters.\nCybersecurity Program and Incident Response \nOur \nCISO\n is responsible for our cybersecurity program, including risk assessments, information security activities, and controls. The CISO is responsible for establishing and maintaining corporate information security policies and overseeing our risk management activities, which prioritize vulnerability management, risk reduction, and prevention. Our CISO also leads our Cyber Defense and Incident Response (“CDIR”) team which identifies, assesses, escalates, and remediates cybersecurity incidents.\n \nOur CISO has over 30 years of experience in the field of cybersecurity, bringing an extensive understanding of cybersecurity threats, regulatory compliance, and industry best practices.\n \nThe CDIR team monitors and manages key cybersecurity risks, including threats related to third parties, cloud security, malicious code, e-commerce systems, and store technology. It also conducts security reviews, assesses vulnerabilities, and analyzes threat intelligence to strengthen our cyber defenses and incident response efforts. \nAs part of our cybersecurity program, we conduct cybersecurity awareness training including phishing simulations and supplemental campaigns as well as mandatory e-learning for all our employees. Our employees have multiple mechanisms for reporting cybersecurity and data privacy concerns. We work with third-party cybersecurity advisors to undertake assessments of our critical systems and to remediate any high-risk vulnerabilities identified. We also engage third parties to perform penetration testing on our key systems to identify potential weaknesses.\nAs part of our cyber incident response plan, we utilize an established framework to assess the severity of cybersecurity incidents. Under the plan, incidents are escalated to relevant senior management, and the board of directors, as appropriate, based on their severity. Our disclosure committee assesses the materiality of severe incidents including both quantitative and qualitative factors.\n \n22\nTable\n of Contents\nThird Parties\nWe utilize third-party service providers as a normal part of our business operations. To address cybersecurity risks arising from our relationships with third-party service providers, we employ a \nvendor risk program\n. We monitor risks relating to potential compromises of sensitive information at our third-party service providers and re-evaluate the risks associated with our partners periodically. Prior to exchanging our data with third-party service providers, they are required to go through a vendor risk assessment. We also conduct third-party security reviews and evaluate their network, processes, and systems. In addition, we obtain annual attestation reports related to data security and privacy from certain third-party service providers to further support compliance with industry-standard cybersecurity protocols. \nImpact of Cybersecurity Risks on Strategy and Results \nAs of the date of this annual report, we are not aware of any cybersecurity incidents that have had a material impact on our business. However, like many companies, we continue to face ongoing cyber threats, including phishing and other unauthorized access attempts, which if successful could have a material impact in the future.\n For more information, see “Risks related to information security and technology” included in"
  }
}