{
  "ticker": "LUV",
  "cik": "0000092380",
  "company_name": "SOUTHWEST AIRLINES CO",
  "filing_date": "2025-02-07",
  "accession": "0000092380-25-000024",
  "primary_doc": "luv-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n161\nSignatures\n162\n2\nTable of Contents\n-PART I-\nItem 1.\n    \nBusiness \nCompany Overview \nSouthwest Airlines Co. (the “Company” or “Southwest”) operates Southwest Airlines, a major passenger airline that provides scheduled air transportation in the United States and near-international markets. Southwest commenced service on June 18, 1971, with three Boeing 737 aircraft serving three Texas cities: Dallas, Houston, and San Antonio. Southwest’s unique route network, low fares, and famous Hospitality continue to make the Company an attractive choice for Customers in cities across the United States and near-international destinations. As of December 31, 2024, Southwest had a total of 803 Boeing 737 aircraft in its fleet and served 117 destinations in 42 states, the District of Columbia, the Commonwealth of Puerto Rico, and ten near-international countries: Mexico, Jamaica, The Bahamas, Aruba, Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos.\nCompany Initiatives\nAs part of the Company's ongoing modernization efforts, during third quarter 2024, the Company announced several transformational initiatives designed to elevate the Customer Experience on its flights, improve financial performance, and drive Shareholder value, including:\n•\nAssigned Seating\n: Southwest will introduce an assigned seating model to better align with airline passenger preferences. The Company expects to begin selling assigned seats in the second half of 2025, with its first flights operating with the new seating model in the first half of 2026.\n•\nPremium Seating\n: Southwest will offer extra legroom options with additional pitch while maintaining a standard economy seat pitch.\n•\nRedesigned Boarding Model\n: Southwest will evolve its boarding process with seat assignments while focusing on operational efficiency and improving the Customer Experience. The updated boarding process will be designed to maintain Southwest's unique and popular approach in boarding through position numbers and signage displayed on stanchions within the gate area. \n•\nGlobal Airline Partnerships\n: Southwest is seeking partnerships with international carriers to expand its network and connect Customers with more global destinations to generate additional demand for travel across the Southwest network. Icelandair will become Southwest's initial partner with an expected launch on February 13, 2025 through Baltimore-Washington International Airport, which will serve as its first U.S. gateway for the carriers. The Icelandair partnership is expected to add Denver and Nashville gateways during 2025, and Southwest intends to add at least one additional partner carrier in 2025.\n•\nGetaways by Southwest™\n: In 2025, Southwest intends to launch a new product, Getaways by Southwest, offering vacation packages that are unique to the industry and come with Customer-friendly policies. These customizable vacation bundles are expected to feature Southwest's generous cancellation policy and flexibility with its no change fees for flights extending to hotels and other elements of packaged vacations.\n•\n24-Hour Operations\n: Southwest is scheduled to add 24-hour operation capabilities with the introduction of overnight \n(i.e., redeye) \nflights on February 13, 2025 in key markets to maximize aircraft utilization.\n•\nMarketing & Distribution Evolution\n: In order to attract new Customers and reach them where they are performing travel searches today, Southwest has expanded into new channels such as Google Flights, Kayak, and Skyscanner to broaden its Customer base and begin to engage them in its loyalty program.\n•\nService Modernization\n: To drive efficiency and improvement in Customer Service, Southwest is transitioning to a digital-first model, offering more self-service options designed to augment the Company’s contact centers and airport experience.\nCompany Operations\nRoute Structure\n3\nTable of Contents\nSouthwest primarily provides “point-to-point” service, rather than the “hub-and-spoke” service provided by most major U.S. airlines. A point-to-point system enables airlines to connect directly to destinations without providing connecting service. By contrast, the hub-and-spoke system concentrates most of an airline's operations at a limited number of central hub cities and serves most other destinations in the system by providing one-stop or connecting service through a hub. By not concentrating operations exclusively through one or more central transfer points, Southwest's route structure has allowed for more direct nonstop routing than a traditional hub-and-spoke service. To provide greater connectivity and support operational reliability and recoverability, in recent years the Company has increasingly focused on designing its network around core stations. Southwest’s unique network blends intentional connectivity offered by hub-and-spoke models and point-to-point nonstops, allowing the Company to capture nonstop demand and provide reliable one-stop itinerary options. \nSouthwest’s unique route network has also enabled it to provide its markets with frequent, conveniently timed flights and low fares. For example, Southwest currently offers 12 weekday roundtrips between Dallas Love Field and Houston Hobby, six weekday roundtrips between Denver and Chicago Midway, six weekday roundtrips between Los Angeles International and Las Vegas, eight weekday round trips between Burbank and Oakland, and ten weekday roundtrips between Phoenix and Denver. Southwest complements its high-frequency short-haul routes with mid-range and long-haul nonstop service, including flights between Hawaii and California, Las Vegas, and Phoenix, and between markets such as Los Angeles and Nashville, New York LaGuardia and Houston, Los Angeles and Baltimore, Oakland and Houston, and San Diego and Baltimore. In 2024, the United States Department of Transportation (“DOT”) approved the Company’s bid to offer nonstop round-trip flights between Las Vegas and Washington Reagan. Service between Las Vegas and Washington Reagan begins February 13, 2025, with daily service beginning March 6, 2025. As the domestic travel market has matured and structural changes have reduced the demand for short-haul travel, especially post-pandemic, the Company has increased its proportion of longer-haul flights. Further, during 2024, the Company announced 24-hour operation capabilities with the introduction of redeye flights. Booking of redeye flying on initial routes became available in July 2024, with the first redeye flights scheduled on February 13, 2025, in five initial nonstop markets: Las Vegas to Baltimore and Orlando; Los Angeles to Baltimore and Nashville; and Phoenix to Baltimore.\nThe table below sets forth data regarding the Company's nonstop service, aircraft stage length, and trip duration over the last three years:\nYear ended December 31,\n2024\n2023\n2022\nPercentage of Customers flying nonstop\n74%\n73%\n74%\nNonstop city pairs\n850\n805\n825\nAverage stage length (miles)\n763\n730\n728\nAverage trip duration (hours)\n2.0\n2.0\n2.0\nThe Company continually works to better optimize its route network and schedule through the adjustment of flights in its existing markets and the addition of new markets and itineraries, while also pruning less profitable flights from its schedule. During 2024, the Company sought to restructure and better optimize its network to better match capacity to demand and adjust for post-pandemic Customer travel patterns by reducing short-haul trips, redistributing resources to longer-haul trips in more profitable markets, and reducing flying on weekdays and at off-peak times with lower travel demand. In response to market conditions, the Company ceased service at Cozumel, Mexico; Houston Bush Intercontinental; Syracuse; and Bellingham in 2024. Further, the Company redeployed underperforming capacity by significantly reducing service at Atlanta, Fort Lauderdale, and Chicago O’Hare, while expanding service at Nashville. The Company is continuing to improve the connectivity and efficiency of its network through redesigns in smaller cities and the planned introduction of redeye flying. Additionally, the Company is taking a cross-functional, methodical approach to market maturation efforts. The Company’s unique route network allows for these adjustments without structurally disrupting its airports in core markets and other large cities. To further improve international connectivity with its domestic network, as discussed under “Company Initiatives,” the Company is scheduled to begin operating as a partner with Icelandair on February 13, 2025 to provide for transatlantic connectivity and announced plans to add at least one more partner during 2025.\n4\nTable of Contents\nCost Structure\nA key component of the Company's business strategy is its focus on cost discipline and charging competitively low fares. The Company's low-cost strategy includes, among other elements, (i) the use of a single aircraft type, the Boeing 737, and (ii) the Company's route structure. Southwest's use of a single aircraft type has historically allowed for simplified scheduling, maintenance, flight operations, safety management, and training activities. Southwest's route structure includes service to and from many secondary or downtown airports such as Dallas Love Field, Houston Hobby, Chicago Midway, Baltimore-Washington International, Burbank, Manchester, Oakland, San Jose, and Providence. These conveniently located airports are typically less congested than other airlines' hub airports, which has contributed to Southwest's ability to achieve high asset utilization because aircraft can be scheduled to minimize the amount of time they are on the ground. This, in turn, has reduced the number of aircraft and gate facilities that would otherwise be required and is designed to allow for higher Employee productivity over a long period of time. Given ever-evolving travel patterns and labor market challenges, the Company continues to focus on better optimizing its route network, improving operational efficiency and reliability, and increasing Employee productivity. The Company expects to further increase asset utilization through its introduction of redeye flights and its initiatives to decrease the amount of time it takes to turn an aircraft (the time needed to unload Passengers from an arriving flight and load Passengers on the same aircraft for its subsequent flight). Such investments include moving to a fully digital (i.e., paperless) process, improved communication tools for Employees, and better visual and real-time information to assist both Customers and Employees. These initiatives are designed to lower unit costs, as the Company is expected to be able to generate either the same number of available seat miles (“ASMs”) with fewer aircraft or produce more ASMs utilizing the same number of aircraft in its fleet. These efforts are underway and are scheduled to be fully implemented by November 2025. In addition, the Company is targeting other cost savings initiatives, including capitalizing on identified supply chain opportunities and improving its corporate efficiency through automation and better allocation of resources. \nThe Company's focus on controlling costs also includes a continued commitment to pursuing, implementing, and enhancing initiatives to reduce fuel consumption and improve fuel efficiency (ASMs per fuel gallon consumed). The Company focuses on minimizing fuel consumption and improving fuel efficiency through fleet modernization and other fuel initiatives. For example, in 2024, the Company added 22 Boeing 737 MAX 8 (“-8”) aircraft to its fleet, with the goal of lowering operating costs, improving potential growth opportunities, better optimizing the Company's network, reducing carbon emissions per ASM, and further modernizing the Company's fleet with more fuel-efficient aircraft. \nFuel and oil expense can be extremely volatile and unpredictable, and even a small change in market fuel prices can significantly affect profitability. Although the Company’s jet fuel prices per gallon were generally lower in 2024, as compared with 2023, they remain at high levels. Fuel and oil expense remained the Company's second largest operating cost category for 2024. As evidenced by the table below, energy prices can fluctuate significantly in a relatively short amount of time. The table below shows the Company's average cost of jet fuel inclusive of fuel taxes and fuel hedging impacts, for each year beginning in 2011 and during each quarter of 2024.\n5\nTable of Contents\nYear\nCost\n(Millions)\nAverage\nCost Per\nGallon\nPercentage of\nOperating\nExpenses\n2011\n$\n5,751 \n$\n3.25 \n38.2 \n%\n2012\n$\n6,156 \n$\n3.32 \n37.3 \n%\n2013\n$\n5,823 \n$\n3.19 \n35.3 \n%\n2014\n$\n5,355 \n$\n2.97 \n32.6 \n%\n2015\n$\n3,740 \n$\n1.96 \n23.6 \n%\n2016\n$\n3,801 \n$\n1.90 \n22.7 \n%\n2017\n$\n4,076 \n$\n1.99 \n23.0 \n%\n2018\n$\n4,616 \n$\n2.20 \n24.6 \n%\n2019\n$\n4,347 \n$\n2.09 \n22.3 \n%\n2020\n$\n1,849 \n$\n1.45 \n14.4 \n%\n2021\n$\n3,310 \n$\n1.98 \n23.5 \n%\n2022\n$\n5,975 \n$\n3.10 \n26.2 \n%\n2023\n$\n6,217 \n$\n2.89 \n24.0 \n%\n2024\n$\n5,812 \n$\n2.64 \n21.4 \n%\nFirst Quarter 2024\n$\n1,531 \n$\n2.92 \n22.8 \n%\nSecond Quarter 2024\n$\n1,599 \n$\n2.76 \n23.0 \n%\nThird Quarter 2024\n \n$\n1,417 \n$\n2.52 \n20.7 \n%\nFourth Quarter 2024\n \n$\n1,264 \n$\n2.38 \n19.0 \n%\nThe Company’s fuel efficiency was aided in 2024, as compared with 2023, through the addition of \n22\n -8 aircraft to its fleet and by the retirement of \n34\n of its oldest, least fuel-efficient Boeing 737-700 (“-700”) aircraft and the retirement of two Boeing 737-800 (\"-800\") aircraft. As of December 31, 2024, the Company had 245 -8 aircraft in its fleet. In second and fourth quarter 2024, the Company entered into supplemental agreements (the “Supplements”) to its purchase agreement with The Boeing Company (“Boeing”) relating to the Company's purchase of -8 and Boeing 737-7 (\"-7\", and, together with -8, the \"MAX aircraft\"). Pursuant to the Supplements, the Company amended its order book delivery schedule to better allocate aircraft deliveries to the Company’s network and capacity plans. The Company held 180 remaining MAX options as of December 31, 2024, in addition to 492 firm orders of MAX aircraft to be delivered through 2031. The Company retains significant flexibility to manage its fleet size, including opportunities to accelerate fleet modernization efforts (e.g., through accelerated retirements of the Company's -700 aircraft) if growth opportunities do not materialize. The Company previously announced plans to pursue opportunities to take advantage of current market conditions through the sale and/or sale-leaseback of certain aircraft, with the intention of replacing most, if not all, of such aircraft with new -8 and -7 aircraft from Boeing, at the favorable pricing available in the Company’s order book with Boeing, by the end of 2031, assuming that Boeing is able to meet aircraft delivery expectations. During December 2024, the Company received gross proceeds of $871 million from the sale-leaseback of 35 aircraft (see Note 7 to the Consolidated Financial Statements for more details on the sale-leaseback transactions), which the Company expects to use in support of its capital allocation strategy, which includes funding future fleet modernization and providing Shareholder returns. As a result of these efforts, the Company expects its net fleet capital expenditures during the near term to moderate significantly from recent levels, with the added benefit of further accelerating the modernization of the Company’s fleet. For further information regarding the Company’s aircraft contractual order book see “Properties” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” The delivery schedule for the -7 is dependent on the Federal Aviation Administration (“FAA”) issuing required certifications and approvals to Boeing and the Company. The FAA will ultimately determine the timing of the -7 certification and entry into service, and the Company therefore offers no assurances that current estimations and timelines are correct. \nThe Company continues to undertake a number of other fuel conservation initiatives, which are discussed in detail under “Environmental Sustainability.”\n6\nTable of Contents\nThe table below sets forth the Company's ASMs produced per fuel gallon consumed (fuel-efficiency) over the last five years:\n \nYear ended December 31,\n \n \n2024\n \n2023\n2022\n2021\n2020\nAvailable seat miles per fuel gallon consumed\n \n80.8\n \n79.5\n \n77.3\n79.2\n81.3\nThe Company has also entered into fuel derivative contracts to manage its risk associated with significant increases in fuel prices. Based on the current geopolitical and market dynamics, higher premium costs over time, and aggressive cost reductions underway, the Company does not intend to add new hedging positions to its current hedge book. The Company's fuel hedging activities, as well as the risks associated with high and/or volatile fuel prices, are discussed in more detail below under “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and Note 10 to the Consolidated Financial Statements.\nSalaries, wages, and benefits expense constituted approximately 45.1 percent of the Company's operating expenses in 2024 and was the Company's largest operating cost category. The Company's ability to control labor costs is largely limited by the terms of its collective-bargaining agreements, and increased labor costs from recently ratified contracts and rate inflation have negatively impacted both the Company's low-cost structure and the overall airline industry’s costs. During 2024, active full-time equivalent headcount decreased 2,356, or 3.1 percent, compared with year-end 2023, in an effort to right-size staffing to current operations. The Company expects to continue these efforts in 2025 by minimizing hiring and improving corporate efficiency. The Company's labor costs, and risks associated therewith, are discussed in more detail below under “Business—Employees,” “Risk Factors,” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nFare Structure\nGeneral\nSouthwest offers a relatively simple fare structure that features competitive fares and product benefits, including unrestricted fares, as well as lower fares available on a restricted basis. \nSouthwest fare products include four major categories: “Wanna Get Away®,” “Wanna Get Away Plus®,” “Anytime,” and “Business Select®,” to provide Customers options when choosing a fare. All fare products include the privilege of two free checked bags (weight and size limits apply). Southwest does not charge fees for cancellations or changes to flight reservations, although fare differences may apply.\n•\n“Wanna Get Away” fares are generally the lowest fares and are often subject to advance purchase requirements. They are non-refundable, but, subject to Southwest’s No-Show Policy, flight credit for the fare paid for unused travel by the Customer (“flight credit”) may be applied towards future travel on Southwest. Subject to Southwest’s No-Show Policy, Wanna Get Away fares also enable a same-day standby listing, free of airline charges, if there is another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with voluntary changes in their itinerary. Under Southwest's Rapid Rewards® loyalty program, Wanna Get Away fares earn six Rapid Rewards points for each dollar spent on the base fare. The Company’s loyalty program is discussed below under “Rapid Rewards Loyalty Program.”\n•\n“Wanna Get Away Plus” fares are often subject to advance purchase requirements. They are non-refundable, but, subject to Southwest’s No-Show Policy, flight credit may be applied towards future travel on Southwest. Wanna Get Away Plus fares earn eight Rapid Rewards points for each dollar spent on the base fare. Wanna Get Away Plus fares offer Transferable Flight Credit™ that enables Customers to transfer an eligible unused flight credit to another traveler for future use. Both travelers must be Rapid Rewards members and only one transfer is permitted. For bookings through a Southwest Business (corporate travel) channel, a transfer may only be made to an employee of the same organization. Subject to Southwest’s No-Show Policy, Wanna Get Away Plus fares also enable a same-day confirmed change, free of airline charges, \n7\nTable of Contents\nif there is an open seat on another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with voluntary changes in their itinerary. If there is no open seat on this different flight, a traveler may request to be added to the standby list for that flight.\n•\n“Anytime” fares are often subject to advance purchase requirements. They are refundable if canceled, subject to Southwest’s No-Show Policy, or flight credit may be applied towards future travel on Southwest. If this fare is purchased with non-refundable flight credit, then the resulting flight credit will be non-refundable if travel is canceled. Anytime fares earn 10 Rapid Rewards points for each dollar spent on the base fare. Anytime fares also receive EarlyBird Check-In®. See “Ancillary Services” below for further information about EarlyBird Check-In. Additionally, Anytime fares receive Priority Lane and Express Lane access through check-in and security lines where available. Further, Anytime fares receive all of the benefits of Wanna Get Away Plus fares, including Transferable Flight Credit and same-day confirmed changes and standby.\n•\n“Business Select” fares are often subject to advance purchase requirements. They are refundable if canceled, subject to Southwest’s No-Show Policy, or flight credit may be applied towards future travel on Southwest. If this fare is purchased with non-refundable flight credit, then the resulting flight credit will be non-refundable if travel is canceled. Business Select fares also include additional perks such as priority boarding with a boarding position in the first 15 boarding positions within boarding group “A,” 12 Rapid Rewards points per dollar spent on the base fare—the highest loyalty point multiplier of all Southwest fare products, one complimentary premium beverage coupon for the day of travel on flights over 250 miles (Customers must be of legal drinking age to drink alcoholic beverages), and free inflight internet service, where available. Business Select fares also receive all of the benefits of Anytime fares, including Priority Lane and Express Lane access through check-in and security lines where available, Transferable Flight Credit, and same-day confirmed changes and standby.\nSouthwest’s No-Show Policy applies if a Customer does not change or cancel a flight segment at least ten minutes prior to scheduled departure and the Customer does not travel on the scheduled flight. In such event, subject to certain exceptions, all unflown segments associated with the reservation will be canceled, and (i) with respect to a Wanna Get Away and Wanna Get Away Plus fares, the fare paid for unused travel will be forfeited; and (ii) with respect to Anytime and Business Select fares, the fare paid for unused travel will be held as a flight credit for future travel on Southwest.\nIn order to enhance and expand upon its already generous and flexible ticketing policies, the Company announced in July 2022 that flight credits will no longer expire. Flight credits for non-refundable fa\nres are issued as long as the reservation is cancelled more than ten minutes prior to the scheduled departure. Transferable Flight Credits or refunds for refundable fares are issued regardless of cancellation time.\nAncillary Services\nThe Company offers ancillary services such as Southwest’s EarlyBird Check-In®, Upgraded Boarding, and transportation of pets and unaccompanied minors, in accordance with Southwest’s respective policies.\nEarlyBird Check-In provides Customers with automatic check-in and an assigned boarding position before general boarding positions become available, thereby improving Customers’ seat selection options (priority boarding privileges are already a benefit of being an “A-List” or “A-List Preferred” tier member under the Company’s Rapid Rewards loyalty program). EarlyBird Check-In pricing is based on multiple factors, including the length of the flight and the historical popularity of EarlyBird Check-In on the route.\nWhen available, Southwest sells Upgraded Boarding at the airport or on Customer mobile devices, which allows a Customer to pay for an open priority boarding position in the first 15 positions in its “A” boarding group.\n8\nTable of Contents\nSouthwest’s Pet Policy provides Customers an opportunity to travel with a small cat or dog in the aircraft cabin on domestic flights. Southwest also has an unaccompanied minor travel policy, with pricing to address the administrative costs and the extra care necessary to safely transport these Customers.\nRapid Rewards Loyalty Program\nSouthwest’s Rapid Rewards loyalty program enables program members (“Members”) to earn points for every dollar spent on Southwest base fares, also including purchases paid with LUV Vouchers, gift cards, or flight credit, with no portion of the purchase price paid with Rapid Rewards points. The amount of points earned under the program is based on the base fare and fare class purchased, with higher fare products (e.g., Business Select) earning more points than lower fare products (e.g., Wanna Get Away). As discussed above under “Fare Structure – General,” each fare class is associated with a points earning multiplier, and points for flights are calculated by multiplying the base fare for the flight by the fare class multiplier. The amount of points required to be redeemed for a flight is based on the base fare and a multiplier. Under the program, (i) Members are able to redeem their points for every available seat, every day, on every flight, with no blackout dates; and (ii) points do not expire.\nUnder the program, Members continue to accumulate points until the time they decide to redeem them. As a result, the program provides Members significant flexibility and options for earning and redeeming rewards. For example, Members can earn more points (and achieve tier status such as A-List, A-List Preferred, or a Companion Pass® faster) by purchasing higher fare tickets. Members also have significant flexibility in redeeming points, such as the opportunity to book in advance to take advantage of a lower fare ticket (including many fare sales) requiring fewer points, or by being able to redeem at the last minute, if seats are still available for sale. Members can also earn points through qualifying purchases with Rapid Rewards Partners (which include, for example, car rental agencies, hotels, and restaurants), as well as by using Southwest’s co-branded Chase® Visa credit cards. In addition to earning points for revenue flights and qualifying purchases with Rapid Rewards Partners, Members also have the ability to purchase, gift, and transfer points, as well as the ability to donate points to selected charities.\nSouthwest’s Rapid Rewards loyalty program features tier status and Companion Pass programs for the most active Members, including “A-List” and “A-List Preferred” status. A Member who flies 20 qualifying one-way flight segments booked through Southwest or earns 35,000 tier qualifying points per calendar year will qualify for A-List status. A Member who flies 40 qualifying one-way flights booked through Southwest or earns 70,000 tier qualifying points per calendar year will qualify for A-List Preferred status. The Member will maintain A-List or A-List Preferred status for the remainder of the calendar year in which the status is earned and for the entire calendar year immediately following. Both A-List and A-List Preferred Members enjoy benefits such as priority check-in and security lane access, where available, as well as dedicated phone lines, standby priority, and an earnings bonus on eligible revenue flights (25 percent for A-List and 100 percent for A-List Preferred). In addition, A-List Preferred Members enjoy free inflight internet service, where available, and up to two complimentary premium drinks per flight on flights traveling 250 miles or more, added directly to their mobile boarding passes. Members who attain A-List or A-List Preferred status receive priority boarding privileges. When these Customers purchase travel at least 36 hours prior to flight time, they receive the best boarding position available (generally, an “A” boarding pass). If an A-List or A-List Preferred Member’s plans change, subject to Southwest’s No Show Policy, they are entitled to same-day confirmed change, free of airline charges, if there is an open seat on another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with changes in their itinerary. If there is no open seat on this different flight, a traveler may request to be added to the standby list for that flight. Another feature of the Rapid Rewards loyalty program is the Companion Pass. Members who fly 100 qualifying one-way flights or earn 135,000 qualifying points in a calendar year automatically receive a Companion Pass, which provides for unlimited travel for the designated Companion free of charges (other than taxes and fees). The Companion Pass is valid for the remainder of the calendar year in which status is earned and for the following full calendar year to any destination available on Southwest for a designated Companion of the qualifying Member. The Member and designated Companion must travel together on the same flight.\n9\nTable of Contents\nIn addition, since early 2024, Members are able to pay for their flights with a combination of cash and Rapid Rewards points—starting with as few as 1,000 points. Bookings with flights completed before January 1, 2025, paid for with a combination of points plus other forms of eligible payment did not earn Rapid Rewards points, tier qualifying points for A-List or A-List Preferred status, or Companion Pass qualifying points, but did earn tier qualifying segment credits. However, starting January 1, 2025, the cash portion of a cash plus points booking earns Rapid Rewards points, Rapid Rewards Business points, tier qualifying points for A-List or A-List Preferred status, and Companion Pass qualifying points.\nDuring 2021, the Company added Rapid Rewards Business, giving businesses the ability to earn Rapid Rewards points. By joining Rapid Rewards Business, companies earn Rapid Rewards points that can be applied toward travel on the company’s behalf, while travelers who are Rapid Rewards Members also earn Rapid Rewards points in their personal accounts. Rapid Rewards business accounts generally have the same opportunities and benefits to earn and redeem points as individual Member accounts.\nSouthwest’s Rapid Rewards loyalty program has been designed to drive more revenue by (i) bringing in new Customers, including new Members, as well as new holders of Southwest’s co-branded Chase Visa credit cards; (ii) increasing business from existing Customers; and (iii) strengthening the Company’s Rapid Rewards hotel, rental car, credit card, and other partnerships.\nAs part of the Company’s transformation initiatives announced in third quarter 2024, Southwest plans to update its Tier Benefits, giving A-List and A-List Preferred Members even better benefits, and has updated its credit card program to offer cardmembers more value through assigned seats and premium seating. The Company also anticipates eventually providing Rapid Rewards Members more opportunities to earn and redeem points for longer-haul international destinations with the development of its airline partnerships and the evolution of its \nGetaways by Southwest\n \nproduct.\nYear ended December 31,\n2024\n2023\n2022\nFlight awards redeemed (millions)\n10.1\n10.9\n9.2\nFor 2024, 2023, and 2022, Customer redemption of flight awards accounted for approximately 14.7 percent, 16.3 percent, and 15.0 percent of revenue passenger miles flown, respectively. The Company’s accounting policies with respect to its loyalty programs are discussed in more detail in Note 1 to the Consolidated Financial Statements.\nInvestments in Customer Experience\nIn 2022, the Company announced a multi-year plan to modernize and transform the Customer Experience.\n \nThese enhancements, expected to cost over $2 billion over a five-year period, include the Company’s plans to:\n•\nbring enhanced WiFi connectivity onboard aircraft;\n•\ninstall latest-technology onboard power ports on MAX aircraft to charge personal devices at every seat;\n•\noffer larger overhead bins on new aircraft deliveries with more space and easier access to carryon items;\n•\nintroduce more entertainment options and a wider variety of refreshments in the cabin; and\n•\nenable new self-service capabilities to bring elevated ease in doing business with the Company, benefiting Employees and Customers.\nDuring 2023, the Company completed the enhanced WiFi connectivity onboard its aircraft in order to improve WiFi speed, reliability, and bandwidth. Its new -8 aircraft deliveries are equipped with latest-generation WiFi hardware, and the Company completed its upgrade of the WiFi hardware on its existing fleet. In late 2023, the Company also began taking delivery of MAX aircraft with the latest-generation of onboard USB-A and USB-C power ports on every seat, with a space-saving system that preserves legroom. The Company is also installing the in-seat power ports onboard its existing MAX fleet. Retrofits for in-seat power have begun and occurred at a pace of approximately 11 aircraft per month in 2024. As of December 31, 2024, the Company had 164 aircraft with in-seat power. Further, the Company's new -8 aircraft will come equipped with larger overhead bin space, which is \n10\nTable of Contents\nexpected to result in better operational metrics, fewer gate checked bags, and an improved Customer Experience. As of December 31, 2024, the Company had approximately 91 -8 aircraft with larger overhead bins, and plans to retrofit the remainder of its -8 fleet, as well as its -800 fleet, with larger overhead bins, beginning in 2025. Additionally, in 2024, the Company also announced a refreshed cabin design, which includes new and more comfortable RECARO seats. Southwest has also invested in modernizing its airport spaces by installing new lobby signage, which is expected to facilitate self-service, enhance the overall visual appeal of the lobbies, and make Customers’ travel journey easier.\nSouthwest offers inflight entertainment and connectivity service. Southwest’s suite of complimentary offerings includes, where available, movies-on-demand, messaging, live and on-demand television, a flight tracker, and more. The free inflight entertainment offerings include over 125 free movies-on-demand each month and free app messaging via iMessage or WhatsApp. The television product consists of at least 13 live channels and approximately 70 on-demand recorded episodes from popular television series. The inflight entertainment service allows Customers to enjoy gate-to-gate entertainment directly on their personal wireless devices. Customers can also purchase satellite internet service while A-List Preferred Members and Business Select Customers receive complimentary satellite internet service. Activating internet service gives Customers the ability to stream videos, complete work tasks, and browse social media.\nIn third quarter of 2024, the Company announced its “Southwest. Even Better.” transformation plan to evolve and improve its Customer Experience. The plan includes the Company’s intentions to:\n•\nintroduce assigned seating and premium seating options with extra legroom;\n•\nevolve its boarding process;\n•\nformalize partnerships with international carriers to expand its network, beginning with a partnership with Icelandair that is expected to launch on February 13, 2025 through Baltimore-Washington International Airport;\n•\nlaunch a new \nGetaways by Southwest\n \nvacation\n \nproduct; and\n•\nenhance its Rapid Rewards program and benefits.\nThese initiatives stem from continued monitoring of Customer feedback, travel patterns, and preferences. The introduction of assigned seating is intended to address changes in Customer travel frequency and preferences for a seat assignment, particularly as the Company has increased its proportion of longer-haul flights in light of reduced demand for short-haul travel. Research indicates that a vast majority of both existing Southwest Customers and potential Customers prefer an assigned seat.\nIn addition to assigning seats, the Company plans to offer a premium, extended legroom portion of the cabin that research shows many Customers also prefer. The Company also plans to evolve its boarding process with the introduction of assigned seating and premium seating options, maintaining the Company’s unique approach in boarding through position numbers and signage displayed on stanchions within the gate area. \nThe move to assigned and premium seating will be a significant undertaking by the Company. In addition to incorporating new technologies and procedures for a seamless transition, the new cabin layout will require approvals from the FAA along with other regulatory agencies and vendor partners. The Company expects to make assigned seat and extended legroom bookings available in the second half of 2025, with related flights occurring in the first half of 2026.\nGetaways by Southwest \nBeginning in 2025, the Company plans to offer Customers an in-house vacation package product called “Getaways by Southwest”, replacing the outsourced product Southwest has historically offered. This new vacation booking platform is expected to allow the Company to appeal directly to its broad existing Customer base with an enhanced offering that includes both lodging and excursions, which is designed to drive growth with leisure travelers and grow higher-margin revenues.\nDistribution and Marketing Approach\n11\nTable of Contents\nThe Company primarily offers its fare products directly to Customers through its Internet website, Southwest.com\n®\n, and the Southwest App. For the years ended December 31, 2024, and December 31, 2023, approximately 81 percent and 82 percent, respectively, of the Company’s Passenger revenues originated from Southwest.com or the Southwest App (including revenues from SWABIZ®, the Company's online booking tool designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest). This “direct to Customer” distribution approach has historically provided a cost advantage for the Company because it eliminates fees associated with the use of third-party distribution channels such as third-party online travel platforms.  \nIn light of changing travel patterns post-pandemic, in 2024 the Company focused on attracting new and less frequent Customers, in part, through new distribution channels and the launching of new ad campaigns. The Company expanded its distribution channels through partnerships with flight meta search engines, including Google Flights, Kayak, and Skyscanner, to increase visibility and drive traffic for bookings to Southwest.com. \nIn April 2024, the Company launched “The Big Flex”: a bold new brand marketing campaign showcasing the Company’s fun-loving personality and flexible and Customer-friendly policy points of difference on every fare, everywhere. The campaign highlights choice and flexibility for the Company’s Customers delivered with the Hospitality for which the Company is famous. Additionally, in May 2024, the Company launched “Wanna Go Wednesdays” on Southwest.com, a new weekly program that allows Customers to book the latest low fares on routes that are still available for last minute bookings. The Company also invested in technology to support artificial intelligence (\"AI\")-based marketing efforts and more personalized marketing capabilities throughout 2024.\nThe Company supports its distribution approach by offering a broad suite of digital platforms to support Customers' travel needs, including full featured websites and apps. These digital platforms help Customers book and manage their Southwest air travel and facilitate the purchase of the Company’s ancillary products, including Fare Upgrades, EarlyBird Check-In, Upgraded Boarding, vacation packages, rental car reservations, hotel reservations, and travel activities. In addition, the digital platforms provide self-service tools for trip management and Customer support.\nDigital Hospitality\nThe Company is committed to its goal of widening its Customer Service advantage by enhancing digital Hospitality. The Company is amid a multi-year digital service modernization program designed to, among other things, provide better Customer Service at a lower cost. Key focus areas of the digital service modernization program include contact center service modernization, airport service modernization, Customer Service communications, and disruptions management.  \nIn 2024, the Company implemented digital enhancements to empower Customer self-service and provide more efficient Customer Service. Key updates included a revamped Help Center, an expanded chatbot for improved information access, and enhanced disruption management tools (such as options to rebook or cancel flights and access nearby airports). In compliance with new DOT regulations, Southwest introduced automated ancillary refunds for canceled flights, additional flight rebooking flexibility for applicable schedule adjustments, and improved content to clearly communicate Customer options. The Company added additional Customer Service capabilities, including improved error messaging for increased clarity and actionable options for Customers, improved booking options when booking trips with youth travelers on mobile devices, increased passenger capacity per reservation, self-service features that enable self-management of companion designations, inbound flight tracking, and increased travel flexibility with improved standby booking options for connecting flights.\nIn 2024, the Company introduced generative AI capabilities and automation tools with a goal to improve Customer Service, increase efficiency, and drive lower cost while exceeding Customers’ Hospitality expectations. The Company continues to test the effectiveness of generative AI capabilities across the Customer journey.\nDuring 2024, as a result of these efforts, the Company experienced fewer contact center calls per trip, while increasing app utilization on the day of travel, each as compared with 2023. The Company’s digital service modernization program is expected to continue to deliver additional enhancements and efficiencies in 2025. \n12\nTable of Contents\nThe Company continues to enhance digital revenue-generating capabilities through strategic investments and innovations. The Company deployed a comprehensive suite of optimizations designed to improve product performance across air sales and ancillary offerings, including Upgraded Boarding, EarlyBird Check-In, Cars, Hotels, and Vacations. These efforts are designed to drive incremental revenue while enhancing the Customer Experience.\nThe Company has made significant advancements in marketing automation, particularly on the mobile app. Generative AI-powered copy testing has been introduced to refine marketing messages and optimize conversion rates, yielding increased sales per marketing effort. The Company has also implemented enhanced Rapid Rewards acquisition techniques, promotional text message campaigns, increased push messaging marketing, and improved co-brand acquisition strategies to drive Customer engagement and loyalty. The Company continues to test ongoing improvements to its digital shopping and booking experience to further increase fare upsells and booking conversion effectiveness. \nFurther, the Company has expanded its offerings to include overnight connection flight options, enhanced Rapid Rewards marketing content, and added the ability for Customers to pay for flights using cash plus points. Improvements to account management tools underscore the Company’s commitment to meeting diverse customer needs and growing its market presence. \nSouthwest Business\n®\n Initiatives\nIn addition to improvements in the Company's consumer-direct Southwest.com channel of distribution and new flight search engine partnerships, in recent years the Company has taken significant action, including investments in Employees, processes, and technology, in order to grow its corporate travel business with the goal of making it easier for corporate travel Customers and travel management companies to do business with Southwest. The Company employs a multi-channel distribution strategy for its corporate business travel, offering the ability for business travelers and travel decision makers to book Southwest fares within all major Global Distribution System platforms via Amadeus, Travelport, and Sabre channels, through third-party partners directly connected to the Company's host reservation system, or through the Company’s free corporate online booking tool, SWABIZ®. \nThe Company utilizes Airlines Reporting Corporation to implement industry standard processes to handle the settlement of tickets booked through Travelport, Amadeus, and Sabre channels. The Company also utilizes ATPCO Routehappy to provide detailed product information that supports robust shopping and selling processes in third-party booking channels.\nThe Company offers Southwest Business Meetings, a product for its corporate Customers that is designed to make it easier for meeting planners to manage travel on Southwest by streamlining the process to book group travel for meetings and conventions. In late 2024, the Company beta-launched a new group travel tool, Southwest Groups, designed to bring many self-service features to travel managers in early 2025. The Company also offers Southwest Business Assist™, a travel portal that enables corporate travel buyers, travel decision makers, and travel management companies to better manage their business travel on Southwest using dashboards, reports, automated processing of travel benefits, and Customer Service. The on-demand self-service tool provides access to real-time information and reporting. Southwest Business has also continued to invest in and enhance SWABIZ with mobile capabilities. SWABIZ is designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest. The site also facilitates car and hotel bookings and offers a suite of reports for travel managers. The Company has additionally developed a new data-sharing API channel, Southwest Business TravelTrack®, that provides business travel Customers and third-party partners more visibility into the business they do with Southwest. \nTechnology Initiatives\n13\nTable of Contents\nThe Company is focused on the prioritization and execution of its technology investments through an evolving multi-year plan, with the goal of developing stronger, more adaptable, more efficient, and more reliable technology systems to support the Company's strategic priorities. The Company has committed, and plans to continue to commit, significant resources to technology improvements in support of its ongoing operations and initiatives. During 2024, among other things, the Company (i) replaced its legacy flight planning system; (ii) expanded its distribution channels via multiple search engine partnerships; (iii) improved communication tools for Employees; (iv) delivered better visual and real-time information to assist both Customers and Employees; (v) leveraged AI to expedite support and call resolution time for Customer Service agents; (iv) worked towards moving to a fully digital (i.e., paperless) turn process; and (v) enabled Rapid Rewards Members to pay for their flights with a combination of cash and Rapid Rewards points. During 2023, among other things, the Company invested in technology and tools that are expected to enhance resiliency and improve its recovery during irregular operations, implemented a new revenue management system, introduced Customer bag tracking, enhanced Customer digital self-service capabilities, and launched Southwest Business Meetings. During 2022, the Company added technology for (i) a new fare product launch; (ii) a new human resources and payroll system; (iii) a new business travel management system; and (iv) enhanced cyber controls and monitoring.\nThe Company continues to invest significantly in technology resources including, among others, the Company's systems related to (i) new assigned seating, premium seating, and boarding processes; (ii) industry standard interline and codeshare capabilities; (iii) 24-hour operations; (iv) flight planning and scheduling designed to improve operating efficiency; (v) daily flight schedule management designed to improve fleet utilization at lower incremental costs; (vi) aircraft turn capabilities designed to improve operating efficiency; (vii) crew mobility and scheduling designed to improve operating quality and resiliency; (viii) foundational airline operating systems; (ix) ancillary products, including vacation packages such as the announced Getaways by Southwest platform; (x) financial planning; (xi) Customer Service Agent mobility; (xii) technology infrastructure and cybersecurity; and (xiii) digital Customer Service modernization. The move to assigned and premium seating, airline partnerships, and 24-hour operations represent significant undertakings by the Company and will require the incorporation of new technologies and procedures for a seamless transition.\nEnvironmental Sustainability\nThe Company remains steadfast in its desire to pursue, implement, and enhance initiatives to address the Company's impact on the environment. Over the years, the Company has undertaken a number of initiatives that have a direct impact on its fuel conservation and emissions-related reduction efforts, such as the following:\n•\nintroduction of the MAX aircraft into the Company's fleet, which is more fuel-efficient and releases fewer CO₂ emissions per ASM than the Company's previous generation of 737 aircraft;\n•\ninstallation of winglets, which reduce drag and increase fuel efficiency, on all aircraft in the Company's fleet;\n•\napplication of periodic engine washes, which helps improve fuel efficiency;\n•\nimplementation of procedures for the use of electric ground power and pre-conditioned air for aircraft at the gate, when available;\n•\nreplacement of eligible internal combustion ground support equipment with electric equipment at select locations;\n•\ndeployment of auto-throttle and vertical navigation to maintain optimum cruising speeds;\n•\nimplementation of engine start procedures to support the Company's single engine taxi procedures;\n•\nimplementation of procedures on the timing of auxiliary power unit starts on originating flights to reduce auxiliary power unit usage;\n•\nimplementation of fuel planning initiatives to safely reduce loading of excess fuel;\n•\nimplementation of procedures to reduce aircraft engine idle speed while on the ground, which also increases engine life;\n•\nutilization of Company-optimized routes (including flying the best wind routes to take advantage of tailwinds or to minimize headwinds);\n14\nTable of Contents\n•\nimprovements in flight planning algorithms to better match the Company's aircraft flight management system and thereby enabling the Company to fly at the most efficient altitudes;\n•\nsubstitution of Pilot and Flight Attendant flight bags and paper manuals with lighter Electronic Flight Bag tablets; and\n•\nimplementation of Real Time Descent Winds (automatic uplinking of up-to-date wind data to the aircraft, allowing crews to time the descent to minimize thrust inputs and, as a result, improve fuel efficiency per flight). \nThe Company participates in Required Navigation Performance (“RNP”) operations as part of the FAA's Performance Based Navigation program, a key component of the Next Generation Transportation System (“NextGen”), which is intended to modernize the U.S. air traffic system by addressing limitations on air transportation capacity and making more efficient use of airspace. RNP combines the capabilities of advanced aircraft avionics, satellite navigation (instead of less precise ground-based navigation), and new flight procedures to enhance navigational and operational capabilities, improve fuel efficiency, and minimize greenhouse gas (“GHG”) emissions. RNP approaches, which are published by the FAA, are currently available at a limited number of the airports Southwest serves, but the Company continues to work with the FAA to develop and seek more use of RNP approaches and to evolve air traffic control rules to support greater utilization of RNP.\nIn 2021, the Company announced near- and long-term environmental sustainability goals, in addition to a series of actions and initiatives designed to assist the Company in achieving these goals. The Company refreshed its environmental sustainability plan in early 2023 and continually monitors developments related to climate change and evaluates its goals and progress against these developments. The Company expects its path toward achievement of these goals will depend on, among other things, (i) increased use of sustainable aviation fuel (“SAF”), which is not presently available at scale or at prices competitive to jet fuel; (ii) improved fuel efficiency from fleet renewal or planned fuel efficiency initiatives; (iii) operational initiatives; and (iv) technological innovation.\nAs part of its corporate sustainability efforts, the Company has published the Southwest One Report describing the Company's environmental sustainability goals, actions, initiatives, and strategies, which include the foregoing and other efforts to address GHG emissions and other environmental matters such as energy and water conservation, waste minimization, and recycling. Information contained in the Southwest One Report is not incorporated by reference into, and does not constitute a part of, this Form 10-K. While the Company believes that the disclosures contained in the Southwest One Report and other voluntary disclosures regarding environmental, social, and governance (“ESG”) matters are responsive to various areas of investor interest, the Company believes that certain of these disclosures do not currently address matters that are material to the Company’s operations, strategy, financial condition, or financial results, although this view may change in the future based on new information that could materially alter the estimates, assumptions, or timelines used to create these disclosures. Given the estimates, assumptions and timelines used to create the Southwest One Report and other voluntary disclosures, the materiality of these disclosures is inherently difficult to assess in advance. \nRegulation\nThe airline industry is heavily regulated, especially by the federal government, and there are a significant number of governmental agencies and legislative bodies that have the ability to directly or indirectly affect the Company and/or the airline industry financially and/or operationally. Regulations affecting the Company and/or the airline industry that have been or may be imposed by several of these governmental agencies and legislative \nbodies\n include, but are not limited to, those discussed below.\nIn May 2024, Congress enacted the FAA Reauthorization Act of 2024 (the “2024 Reauthorization Act”). This statute authorizes funding for the FAA through federal fiscal year 2028 and provides direction to various FAA and DOT offices and programs over the next several years. The 2024 Reauthorization Act resulted in changes in federal law that will impact commercial air carriers. For example, the 2024 Reauthorization Act mandates that the DOT or the FAA promulgate numerous new rulemakings (or standards setting actions), including: (i) rulemakings regarding \n15\nTable of Contents\npassenger accessibility, including training, aircraft accessibility, airport announcements and communications, and online portal accessibility, and (ii) mandates for the FAA, including for flight data recovery from overwater operations, modernization and improvements to aircraft evacuations, minimum qualifications for overseas mechanics working on U.S. registered aircraft, crewmember self-defense training, cybersecurity, and cabin air safety. Some notable rulemakings and a summary of other major initiatives being pursued by the DOT and the FAA related to the airline industry are described below. With the change of presidential administrations in January 2025, it is unclear which of these initiatives will be fully implemented, and whether the DOT, the FAA, and other agencies will pursue new initiatives \nfor regulating airlines.\nEconomic and Consumer Protection Regulation\nRegulation by the U.S. Department of Transportation\nThe DOT regulates economic operating authority for air carriers and consumer protection for airline passengers. The DOT may take legal enforcement action against air carriers for violating the DOT’s statutes or regulations by imposing civil penalties up to $75,000 per occurrence. In January 2023, the DOT issued a notice stating that, going forward, it intends to seek higher civil penalties, and the DOT’s recent enforcement actions have reflected significant increases in the level of civil penalties assessed for violations. \nTo provide passenger transportation in the United States, a domestic airline is required to hold a Certificate of Public Convenience and Necessity from the DOT. A Certificate of Public Convenience and Necessity is unlimited in duration, and the Company’s certificate generally permits it to operate among any points within the United States and its territories and possessions. Additional DOT authority, in the form of a certificate or exemption from certificate requirements, is required for a U.S. airline to serve foreign destinations either with its own aircraft or via code-sharing with another airline. Exemptions granted by the DOT to serve international markets are generally limited in duration and are subject to periodic renewal requirements. The DOT may revoke a certificate or exemption, in whole or in part, for failure to comply with federal aviation statutes, regulations, orders, or the terms of the certificate or exemption itself.\nThe DOT's consumer protection and enforcement authority is derived primarily from a federal statutory prohibition on “unfair or deceptive practices or unfair methods of competition” by air carriers. In January 2021, the DOT codified the definitions for the terms “unfair” and “deceptive” by adopting the definitions used by the Federal Trade Commission and amended and clarified the procedures the DOT will follow when engaging in aviation consumer protection rulemaking and enforcement. The purpose of this rule is to help establish clear and consistent criteria for unfair or deceptive practices while aligning the DOT’s oversight of aviation entities with other government agencies’ oversight of other sectors of the economy regarding unfair or deceptive practices.\nUnder the above-described authority, the DOT has adopted so-called “Passenger Protection Rules,” which address a wide variety of matters, including flight delays on the tarmac, chronically delayed flights, denied boarding compensation, baggage liability requirements, ticket refunds, and advertising of airfares, among others. For example, under the DOT's tarmac delay rule and subject to limited exceptions, air carriers must not allow an aircraft to remain on the tarmac for more than 3 hours (for domestic delays) or more than 4 hours (for international delays), without allowing passengers to deplane, subject to limited exceptions.\nIn addition, the Passenger Protection Rules require airlines to (i) display ontime performance on their websites; (ii) adopt Customer Service plans, publish those plans on their website, and audit their own compliance with their plans; (iii) designate an employee to monitor the performance of airlines' flights; (iv) provide information to passengers on how to file complaints; (v) respond in a timely and substantive fashion to consumer complaints; (vi) pay compensation to each passenger denied boarding involuntarily from an oversold flight; and (vii) prominently disclose all potential fees for optional ancillary services on their websites. \nThe Passenger Protection Rules also require that (i) advertised fares include all government-mandated taxes and fees; (ii) passengers be allowed to either hold a reservation for up to 24 hours without making a payment or cancel a \n16\nTable of Contents\npaid reservation without penalty for 24 hours after the reservation is made, as long as the reservation is made at least seven days in advance of travel; (iii) fares may not increase after purchase; (iv) baggage fees must be disclosed to the passenger at the time of booking; (v) the same baggage allowances and fees must apply throughout a passenger’s trip; (vi) baggage fees must be disclosed on e-ticket confirmations; and (vii) passengers must be promptly notified in the event of delays of more than 30 minutes or if there is a cancellation or diversion of their flight.\nIn 2024, the DOT was active in airline consumer protection, proposing or finalizing several new rules. For example, the DOT finalized a new rule addressing airline ticket refunds which is in effect and being implemented by the Company and other airlines. The rule requires airlines to provide a full ticket refund, which may include ancillary fees in addition to the base fare, if a passenger chooses not to accept a rebooking following a cancellation or significant delay. The DOT also finalized a new rule designed to enhance protections for passengers who use wheelchairs and assistive devices. \nThe DOT has also issued a new final rule related to when and how air carriers must disclose ancillary service fees. The final rule was scheduled to take effect on July 1, 2024. However, in May 2024, various airlines and airline associations challenged the rule in federal court, and the U.S. Court of Appeals for the Fifth Circuit stayed the final rule. Additionally, in August 2024, the DOT issued a proposed rule on family seating that would require U.S. and foreign air carriers to seat children aged 13 and under adjacent to at least one accompanying adult at no additional cost beyond the fare, subject to limited exceptions. This rule is pending, but as of January 28, 2025, is subject to the Executive Order “Regulatory Freeze Pending Review.”   \nIn December 2024, the DOT issued a preliminary proposed rule on airline passenger rights. The DOT was soliciting comments on whether, in the event of a significant flight disruption due to causes within an airline’s control, airlines should be required to provide passengers with a graduated level of cash compensation, free rebooking, and amenities such as meals, lodging for overnight delays, and transportation to and from lodging. As of January 28, 2025, this proposed rule is subject to the Executive Order “Regulatory Freeze Pending Review.”\nThe DOT additionally has statutory authority to prohibit discrimination by airlines against consumers on the basis of (i) disability and (ii) race, color, religion, national origin, sex, or ancestry.\nIn August 2023, the DOT finalized its rule on accessible lavatories. The rule requires airlines to have one accessible (i.e., larger) lavatory on new narrow-body aircraft going forward. Specifically, air carriers must comply with these measures with respect to new aircraft that an air carrier operates that are (i) originally ordered after October 3, 2033, (ii) delivered after October 2, 2035, or (iii) part of a new type-certificated design filed with the FAA or a foreign carrier’s safety authority after October 2, 2024. The new rule does not require a retrofit of existing aircraft. The Company anticipates that this rule could impose substantial costs on the Company and have a material effect on the Company's capital expenditures, earnings, and competitive position. \nAviation Taxes and Fees\nThe statutory authority for the federal government to collect most types of aviation taxes, which are used, in part, to finance programs administered by the FAA, must be periodically reauthorized by the U.S. Congress. The 2024 Reauthorization Act extended, but did not modify, most commercial aviation taxes through September 30, 2028. This includes the two principal FAA-related taxes paid by airline consumers when purchasing an airline ticket: (i) the 7.5% excise tax (applied to the base fare of an airline ticket as well as any mandatory passenger fees charged by the airline) and (ii) the domestic segment tax ($5.00 per passenger segment), capped at two segments each way. The domestic segment tax is adjusted annually for inflation by the Internal Revenue Service. Air carriers also directly pay the commercial jet fuel tax (4.3 cents per gallon).\nIn addition to FAA-related taxes, there are federal taxes related to the U.S. Department of Homeland Security. These taxes do not need to be reauthorized periodically. Congress has set the Transportation Security Fee paid by passengers at $5.60 per one-way passenger trip originating in the United States. Additionally, international passengers arriving in the United States are subject to U.S. immigration and customs fees that are indexed to \n17\nTable of Contents\ninflation. These fees are used to support the operations of U.S. Customs and Border Protection (“CBP”). Finally, the U.S. Department of Agriculture's Animal and Plant Health Inspection Service imposes an agriculture inspection fee on international passengers arriving in the United States.\nAirline passengers are also required to pay a Passenger Facility Charge (“PFC”), a user fee that is authorized via federal statute but assessed by each airport. The maximum PFC is $4.50 per passenger enplanement. \nNew or higher aviation taxes or user fees on air carriers and/or their customers may be imposed by Congress at any time, including during Congress’s anticipated consideration of comprehensive budget and tax legislation in 2025.  \nOperational and Safety Regulation\nThe FAA, an agency within the DOT, has the authority to regulate safety aspects of civil aviation operations. Specifically, the Company and certain of its third-party service providers are subject to the jurisdiction of the FAA with respect to aircraft maintenance and operations, including equipment, ground facilities, dispatch, communications, training, and other matters affecting air safety. The FAA, from time to time, issues orders or directives relating to the maintenance and operation of aircraft that require significant expenditures or operational restrictions. The FAA, acting through its own powers or through the appropriate U.S. Attorney, has the power to bring proceedings for the imposition and collection of civil penalties for violation of the FAA's regulations.\nThe FAA requires airlines to obtain and maintain an Air Carrier Operating Certificate, as well as other certificates, approvals, and authorities. These certificates, approvals, and authorities are subject to amendment, suspension, or revocation for cause.\nAs the airlines’ safety regulator, the FAA uses tools, such as temporary flight restrictions, to control aircraft operations within designated areas. The FAA may also issue advisory circulars to provide guidance for compliance with aircraft and pilot certification standards, operational standards, training standards, and other FAA rules. These regulatory tools may create additional costs and/or operational restrictions for the Company. For example, the FAA has expressed concern about the deployment of certain wireless telecommunications systems that may cause interference with certain aircraft avionics, such as radio altimeters. In response, the FAA could impose temporary flight restrictions until the agency believes any safety concerns are resolved. The FAA could also require mitigations from aircraft operators (e.g., aircraft retrofits) to avoid any potential interference.\nWith respect to airline operations, the FAA has rules in effect with respect to crew flight, duty, and rest times. Among other things, the rules (i) require a ten-hour minimum rest period prior to a pilot’s flight duty period; (ii) mandate that a pilot must have an opportunity for eight hours of uninterrupted sleep within the rest period; and (iii) impose pilot “flight time” and \"duty time” limitations based upon report times, the number of scheduled flight segments, and other operational factors. The FAA has imposed similar duty and rest time requirements for flight attendants.\nThe FAA also manages the nation’s air traffic control (“ATC”) system, a major focus of the 2024 Reauthorization Act. The congressional appropriations committees, as well as FAA leadership are addressing persistent shortages of fully licensed and trained air traffic controllers. Controller shortages at key FAA-managed ATC facilities have been the cause of air carrier delays and cancellations, especially when controller shortages are combined with severe weather in places like Florida and the New York/New Jersey/Philadelphia corridor. Moreover, the increase in commercial space operations in some areas of the country and the expected introduction of advanced air mobility aircraft, could further degrade the FAA’s ability to provide consistently efficient and reliable ATC services.\nThe FAA is also the safety regulator of airplane manufacturers and oversees the aircraft certification process. The certification of the -7 is stalled due in part to the FAA’s heightened oversight of aircraft manufacturers and control over the aircraft certification process. The FAA’s oversight of the Company’s original equipment manufacturers and the rate of production of new planes are outside of the Company’s control.\n18\nTable of Contents\nIn June 2023, the FAA finalized a new rule requiring that airplane manufacturers install a physical secondary barrier between the aircraft’s flight deck and cabin in order to provide additional protection against unauthorized access to the flight deck. The final rule provided a two-year compliance period through August 25, 2025, after which a physical secondary barrier meeting the requirements of the rule is required for any transport category airplane manufactured and used in regularly scheduled passenger-carrying operations. Compliance with this rule could impose substantial costs on the Company. Per the 2024 Reauthorization Act, the FAA convened an Aviation Rulemaking Committee (“ARC”) in the fall of 2024 to explore additional requirements to retrofit a secondary barrier on existing mainline airliners. Depending on the ARC’s recommendations, the FAA may initiate rulemaking on a retrofit mandate in 2025, which could apply to the Company’s current fleet.\nIn addition, the 2024 Reauthorization Act, like the FAA Reauthorization Act of 2018, contains provisions directing the FAA to examine whether to issue new regulations establishing minimum dimensions for seat size based on safety and evacuation considerations. Since 2022, the FAA has examined the issue and solicited stakeholder feedback on the topic. The FAA has not yet issued a proposed rule. If the FAA issues a rule with minimum dimensions that exceed the Company’s current seat dimensions, the Company could incur substantial compliance costs.\nIn addition to its day-to-day management of the nation’s air traffic control system, the FAA has continued its lengthy and ongoing effort to implement a multi-faceted, airspace modernization program, NextGen. According to the U.S. government, once fully implemented, NextGen is expected to improve airspace capacity and contribute to a safer, more efficient, and more predictable system, which may potentially contribute to reduced fuel burn, emissions, and noise. As part of the NextGen initiative, in 2010 the FAA published rules requiring most commercial aircraft operating in the national airspace system to be equipped with Automatic Dependent Surveillance - Broadcast (“ADS-B”) technology by January 1, 2020. ADS-B technology is intended to enhance safety and efficiency by moving from ground-based radar and navigational aids to precise tracking using satellite signals. In addition to environmental and efficiency benefits, ADS-B technology gives pilots and air traffic controllers new tools to reduce the risk of runway incursions and aircraft collisions. The Company has implemented technology and programs intended to comply with all applicable ADS-B requirements. On November 9, 2021, the U.S. government announced an Aviation Climate Action Plan to reduce emissions by, among other initiatives and efforts, operationalizing NextGen to realize the full potential of modernized infrastructure and systems, and enhancing data quality and information distribution to enable operators to fly more fuel-efficient trajectories. However, with the new presidential administration, this initiative may be postponed.\nThe Air Traffic Organization (“ATO”) is the operational arm of the FAA. The ATO is responsible for providing safe and efficient air navigation services to all of the United States and large portions of the Atlantic and Pacific Oceans. The Company is subject to any operational changes imposed by the FAA/ATO as they relate to the NextGen program, as well as the day-to-day management of the air traffic control system.\nPassenger and Occupational Health Regulation \nThe Company is subject to various other federal, state, and local laws and regulations relating to health and occupational safety, including Department of Health and Human Services, Centers for Disease Control and Prevention, Occupational Safety and Health Administration, and Food and Drug Administration regulations. In response to the COVID-19 pandemic, federal, state, and local government authorities implemented directives, orders, and regulations intended to mitigate the spread of the virus, and in response, the Company modified its practices, policies, and procedures, as appropriate. New health requirements or standards, whether mandated by government agencies or voluntarily adopted by the Company, related to the COVID-19 pandemic or otherwise intended to mitigate the spread of communicable diseases could affect the Company’s costs and performance.\nSecurity Regulation\nPursuant to the Aviation and Transportation Security Act (“ATSA”), the Transportation Security Administration (“TSA”), a federal agency of the U.S. Department of Homeland Security, is responsible for certain civil aviation \n19\nTable of Contents\nsecurity matters. The ATSA and subsequent TSA regulations and procedures implementing the ATSA and related statutes address, among other things, (i) flight deck security; (ii) the use of federal air marshals onboard flights; (iii) airport and aircraft access security; (iv) airline crew security training; (v) security screening of passengers, baggage, cargo, mail, employees, and vendors; (vi) training and qualifications of security screening personnel; (vii) provision of passenger data to CBP; (viii) background checks; and (ix) certain cybersecurity requirements.\nUnder the ATSA, substantially all security officers at airports are federal employees, and significant other elements of airline and airport security are overseen and performed by federal employees, including federal security managers, federal law enforcement officers, and federal air marshals. TSA personnel and TSA-mandated security procedures can affect the Company's operations, costs, and Customer Experience. For example, as part of its security measures, the TSA regulates the types of liquid items that can be carried onboard aircraft. In addition, as part of its Secure Flight program, the TSA requires airlines to collect a passenger's full name (as it appears on a government-issued ID), date of birth, gender, and Redress Number (if applicable). Airlines must transmit this information to Secure Flight, which uses the information to perform matching against terrorist watch lists. After matching passenger information against the watch lists, Secure Flight transmits the matching results back to airlines. This serves to identify individuals for more extensive security screening and to prevent individuals on watch lists from boarding an aircraft. It also helps prevent the misidentification of passengers who have names similar to individuals on watch lists. The TSA's multi-layered, risk-based approach to airport security also includes physical pat down procedures at security checkpoints. These procedures have raised privacy concerns by some air travelers and have caused delays at screening checkpoints.\nThe Company, in conjunction with the TSA, participates in TSA PreCheck™, a pre-screening initiative that allows passengers deemed low risk by the TSA to move through security checkpoints with greater efficiency and ease when traveling. Eligible passengers may use dedicated screening lanes at certain airports the Company serves for screening benefits, which include leaving on shoes, light outerwear, and belts, as well as leaving laptops and permitted liquids in carryon bags. A similar CBP-administered program, Global Entry\n®\n, allows expedited clearance for pre-approved, low-risk international travelers upon arrival in the United States. The TSA has expressed its plans to leverage advanced transportation security screening technologies, including biometric solutions, to improve security effectiveness and operational efficiency, while also enhancing the passenger experience. The advanced technologies have prompted privacy, cost, and legal concerns from air carriers, travelers, and advocacy groups, which could affect the timing and viability of the TSA's plans.\nThe Company also participates in the TSA Known Crewmember\n®\n program, which is a risk-based screening system that enables TSA security officers to positively verify the identity and employment status of flight-crew members. The program expedites flight crew member access to sterile areas of airports.\nThe Company works collaboratively with the TSA, foreign national governments, and airports to provide risk-based security measures at international locations served by the Company. The Company has also made significant investments in facilities, equipment, and technology to process Customers, checked baggage, and cargo efficiently in compliance with applicable security regulations. However, the Company is not able to predict the impact, if any, t\nhat any new security measures or TSA resource limitations at certain airports will have on Passenger revenues and the Company’s costs, either in the short-term or the long-term.\nEnvironmental Regulation\nThe Company is subject to various federal laws and regulations relating to the protection of the environment, including the Clean Air Act, the Resource Conservation and Recovery Act, the Clean Water Act, the Safe Drinking Water Act, and the Comprehensive Environmental Response, Compensation and Liability Act (“CERCLA”), as well as state and local laws and regulations. These laws and regulations govern aircraft drinking water, emissions, storm water discharges from operations, and the disposal of materials such as jet fuel, chemicals, hazardous waste, and aircraft deicing fluid.\n20\nTable of Contents\nAdditionally, in conjunction with airport authorities, other airlines, and state and local environmental regulatory agencies, the Company, as a normal course of business, undertakes voluntary investigation or remediation of soil or groundwater contamination at various airport sites. The Company has not historically experienced any airport site environmental liability that has had a material adverse effect on its capital expenditures, earnings, or competitive position. However, many airports, as well as federal, state, and local governmental authorities, are increasingly focused on groundwater contamination caused by what are sometimes referred to as “forever chemicals,” most notably per- and polyfluoroalkyl substances (“PFAS”). PFAS have been used in many manufacturing and industrial applications over many decades and can be found in numerous products, including building materials and household products. Most notably for aviation, PFAS are a key component in aqueous film-forming foam (“AFFF”), which are commonly available for use to fight petroleum-based fires at both commercial and military aviation facilities. The FAA and the U.S. Department of Defense have strict performance specifications for fire suppression systems, which has contributed to the use of AFFF/PFAS over the decades. PFAS is now the focus of regulatory oversight at airports, as well as the source of litigation by airports against AFFF manufacturers. Moreover, regulatory authorities at the federal, state, and local levels are moving forward with prohibitions on the manufacturing, use, or sale of PFAS-based AFFF, as well as costly remediation efforts at airports to address groundwater contamination. In addition, in April 2024, the U.S. Environmental Protection Agency (the “EPA”) issued a final rule listing two specific types of PFAS, perfluorooctanoic acid (“PFOA”) and perfluorooctanesulfonic acid (“PFOS”), which may be found in AFFF, as hazardous substances under CERCLA and requiring entities to report releases that meet or exceed the reportable quantity immediately to the EPA’s National Response Center, and any other applicable state or local agencies. Accompanying the final rule, the EPA also separately issued an enforcement discretion policy that describes how the EPA intends to generally seek to impose liability under CERCLA on those responsible for releasing or exacerbating the spread of PFAS into the environment, such as those who have manufactured PFAS or used PFAS in the manufacturing process, and other industrial parties. At this time, the Company cannot predict to what extent, if any, this enforcement discretion may ultimately provide any relief from potential PFAS liability. Furthermore, while the new presidential administration is expected to generally pursue a deregulatory agenda, the Company cannot predict what actions the new administration may take with respect to PFAS regulation and the timing and scope of any such changes. The evolving legal and regulatory activity surrounding PFAS could lead to an inadequate supply of FAA-certified AFFF throughout the aviation system, additional costs associated with transitioning away from AFFF products containing PFOA and PFOS, potential environmental incident prevention or cleanup costs, and/or increased operating costs at certain airports. Moreover, listing PFAS compounds under CERCLA may give rise to strict, joint and several liability for removal, remedial, response, and other costs, the costs of which could be material.\nThe federal government and the United Nations’ International Civil Aviation Organization (“ICAO”) have agreed to a series of measures to reduce GHG emissions within the aviation sector. At the federal level, in July 2016, the EPA issued a final endangerment finding for GHG emissions from certain types of aircraft engines, which the agency determined contribute to pollution that causes climate change and endangers public health and the environment. Following this endangerment finding, per the federal Clean Air Act, the EPA adopted aircraft GHG emissions standards in December 2020. These standards apply to airframe and aircraft engine manufacturers and align with the standards previously adopted by ICAO. The Company has not and does not expect to incur any material costs related to the EPA’s aircraft GHG emissions rules at this time, and the rules are not expected to adversely impact the Company's current aircraft fleet; however, the Company cannot guarantee that more stringent standards will not be adopted by Congress, the FAA, or the EPA in the future that could require material capital expenditures to modernize or replace its aircraft fleet or incur other costs related to GHG emissions from its aircraft.\nIn addition to aircraft emissions standards, ICAO implemented a “global market-based measure” framework in an effort to control carbon dioxide emissions from international aviation. The focal point of this framework is a carbon offsetting system applicable to aircraft operators designed to cap the growth of emissions related to international aviation. ICAO's Carbon Offsetting and Reduction Scheme for International Aviation (“CORSIA”) program is a global market-based measure intended to cap carbon emissions from international civil aviation at their 2019 levels from 2021 to 2023 and 85 percent of their 2019 levels from 2024 to 2035, addressing carbon emissions from the growth of international air traffic by requiring that international aviation emissions above these levels be offset or reduced through the use of CORSIA Eligible Fuel, such as a CORSIA SAF, or CORSIA Eligible Emissions Units. \n21\nTable of Contents\nThe U.S. federal government has opted to participate in the voluntary phases of the CORSIA program from 2021-2026 (additional phases extend through 2035). However, it is unclear at this time whether the new presidential administration will take action to limit the implementation of the mandatory phases beginning in 2027. For example, on January 20, 2025, President Trump issued an Executive Order withdrawing from the Paris Agreement and, at this time, it is unclear what impact this action may have on the United States’ participation in CORSIA in the short term. As part of the CORSIA program, the Company is currently monitoring its international emissions for reporting purposes. Data collected from applicable international flight activity in 2019 forms the baseline and is used in the calculations to determine subsequent carbon offsetting requirements under the CORSIA program. To the extent CORSIA revises any of its emission accounting methodologies or options for meeting emission reduction levels, the Company could face increased costs to purchase additional volumes of SAF, carbon offsets, or take other measures to comply with the CORSIA program. To date, the Company has not incurred any material costs related to its compliance with CORSIA; however, the Company could experience material costs as a result of any future expansion of its international operations, which would increase its compliance obligations under CORSIA, the need to purchase additional carbon offsets or volumes of SAF than what the Company has currently projected based on any changes to the CORSIA program, any similar program, or other unforeseeable reasons given the evolving nature of climate-change-related laws, regulations, and programs. Regardless of the method of regulation or application of CORSIA, further policy changes with regard to climate change are possible, which could significantly increase operating costs in the airline industry and, as a result, adversely affect operations. Until the timing, scope, and extent of such future developments become known, the Company cannot predict their effect on the Company’s cost structure or its operating results.\nThere are additional areas of rulemaking occurring at the state and federal levels with respect to climate-change-related matters that could also increase the Company’s compliance obligations and costs and expenditures related to the same. While there have been a number of federal efforts to require the disclosure of certain climate-related information in recent years, and there may be similar efforts to require such disclosures in the future, the new presidential administration is expected to repeal or otherwise reverse these efforts. Moreover, on his first day in office, on January 20, 2025, President Trump issued an Executive Order reversing many of the climate-related actions of the previous administration. However, to the extent any future rules mandate that the Company make additional disclosure on matters related to climate change, it is possible that such disclosures may result in reputational harm or impact lending or investment decisions of third parties. If the Company is not perceived as meeting any climate change-related standards established by such third parties, the Company could face greater restrictions on or increased costs of access to capital. For example, in March 2024, the U.S. Securities and Exchange Commission (“SEC”) adopted a new rule called, “The Enhancement and Standardization of Climate-Related Disclosures for Investors.” This rule is being challenged legally in the U.S. Court of Appeals for the Eighth Circuit and implementation of the rule has been voluntarily stayed by the SEC pending the outcome of the legal challenge; moreover, the SEC may seek to repeal or revise the rule, though the Company cannot predict whether or how such action would occur or its timing. Should the rule be implemented as finalized, however, the rule would place new requirements on Southwest and other large publicly-traded corporations. For instance, the rule requires a domestic or foreign registrant to include certain climate-related information in its registration statements and periodic reports, such as on Form 10-K, including: (i) climate-related risks and their actual or likely material impacts on the registrant’s business, strategy, and outlook; (ii) the registrant’s governance of climate-related risks and relevant risk management processes; (iii) the registrant’s GHG emissions, which for accelerated and large accelerated filers and with respect to certain emissions would be subject to assurance; (iv) certain climate-related financial statement metrics and related disclosures in a note to its audited financial statements; and (v) information about climate-related targets and goals, and transition plan, if any. Additionally, in 2023, the State of California enacted a number of climate-disclosure related laws, including the Climate Corporate Data Accountability Act (“CCDAA”) and Climate-Related Financial Risk Act (“CRFRA”). The CCDAA requires both public and private U.S. companies that are “doing business in California” and that have a total annual revenue of $1 billion to publicly disclose and verify, on an annual basis, Scopes 1, 2 and 3 GHG emissions. The CRFRA requires the disclosure of a climate-related financial risk report (in line with the Task Force on the Climate-related Financial Disclosures recommendations or equivalent disclosure requirements under the International Sustainability Standards Board’s climate-related disclosure standards) every other year for public and private companies that are “doing business in California” and have total annual revenue of $500 million. Reporting under the CCDAA and CRFRA is scheduled to take effect \n22\nTable of Contents\nbeginning in 2026. The ultimate impact of these laws on the Company remains uncertain and the California Air Resources Board (“CARB”) is presently soliciting comments on certain of the rule’s details, so the specific final requirements may not be known for some time. Furthermore, each of these laws has been subject to legal challenge. While the outcome of such challenge is uncertain at this time, the judge in the case has declined to grant a temporary injunction of the laws while the litigation moves forward. Additionally, in October 2023, California also enacted the Voluntary Carbon Markets Disclosure Act (“VCMDA”) which creates new reporting obligations related to voluntary carbon offsets. The VCMDA requires business entities that (i) market or sell voluntary carbon offsets in California, (ii) purchase or use voluntary carbon offsets sold in California that make emissions-related claims, or (iii) make claims that an entity or product has eliminated or made significant reductions to its carbon dioxide or GHG emissions to make certain public disclosure on the business entity’s website. Furthermore, climate-related laws are presently being developed in the legislatures of several U.S. states and the timing and scope of such legislation, if passed into law, is uncertain at this time. The reporting obligations of the CCDAA, CRFRA, VCMDA, and other state or federal laws or rules requiring the disclosure of climate-related risks may cause the Company to incur increased costs with respect to modifying existing disclosure controls, financial reporting practices, and the gathering and reporting of emissions data. In addition, failure to comply with these disclosure laws and regulations could result in the imposition of substantial fines or penalties. The Company could also face increased risks of litigation resulting from any enhanced disclosure requirements related to climate change. For further discussion of the risks relating to these reporting obligations, see “Risk Factors—Legal, Regulatory, Compliance, and Reputational Risks.”\nOn November 12, 2022, the Biden-Harris Administration proposed the Federal Supplier Climate Risks and Resilience Rule, which would require major federal contractors to publicly disclose their greenhouse gas emissions and climate-related financial risks and set science-based emissions reduction targets verified by the Science-Based Target initiative and in accordance with third-party standards that preclude the use of carbon offsets to achieve emission reduction goals. On January 13, 2025, the proposed rule was withdrawn. However, there may be similar efforts to require such disclosures in the future and compliance with similar rules could require the Company to incur increased costs due to increased reporting obligations, modify its operations to meet emissions reduction targets, accelerate its fleet replacement plans, or otherwise revise or restate its existing sustainability goals.\nIn addition to climate change, aircraft noise continues to be an environmental focus, especially as the FAA implements new flight procedures as part of its NextGen airspace modernization program discussed above. The Airport Noise and Capacity Act of 1990 gives airport operators the right, under certain circumstances, to implement local noise abatement programs, provided they do not unreasonably interfere with interstate or foreign commerce or the national air transportation system and meet other requirements. Some airports have established airport restrictions to limit noise, including restrictions on aircraft types to be used and limits on the number of hourly or daily operations or the time of operations. These types of restrictions can cause curtailments in service or increases in operating costs, limit the ability of air carriers to expand operations at the affected airports, and result in civil fines when operators violate curfews or noise limitations.\nAt the federal level, the FAA has committed to inform and involve the public, engage with communities, and give meaningful consideration to community concerns and views when developing new flight procedures, and there is a possibility that Congress may enact legislation in the future to address local noise concerns at one or more commercial airports in the United States. In addition, the FAA Reauthorization Act of 2018 requires the FAA to consider community noise concerns when proposing a new navigation departure procedure or amending an existing navigation procedure that would direct aircraft over noise sensitive areas. This requirement could delay or otherwise impede the implementation or use of more efficient flight paths.\nIn general, government efforts at the international, federal, state, or local levels to address worldwide climate change, manage GHG emissions, and reduce aircraft noise, to the extent pursued or implemented, could affect the Company, aircraft operators, original equipment manufacturers, producers and sellers of aviation fuel, and other third parties on which the Company is dependent. Additional legislative or regulatory activity in this area could require modifications to the Company’s equipment, operations, and strategy, and have a material effect on the Company's capital expenditures, earnings, or competitive position.\n23\nTable of Contents\nData Privacy and Cybersecurity Regulation\nThe data privacy and cybersecurity regulatory landscape has become increasingly complex with a growing patchwork of legal obligations that require engaging with an increasing number of regulators. Additionally, the interpretation and application of many data privacy and cybersecurity legal obligations is rapidly evolving, non-uniform, and may be subject to significant change. Interpretation of data privacy and cybersecurity legal obligations may also be applied inconsistently across jurisdictions. The Company continues to monitor a growing set of data privacy and cybersecurity legal requirements from a growing number of applicable authorities and regulators. For further discussion of the risks relating to data privacy and cybersecurity, see “Risk Factors—Information Technology, Cybersecurity, and Data Privacy Risks.”\nRegulators and certain jurisdictions, including the European Union, the U.K., and numerous states within the United States, have passed laws relating to the notice, collection, processing, use, retention, protection, and transfer of personal information as well as the protection of sensitive information and critical systems. In some cases, such laws and regulations can be enforced by private parties in addition to regulators. The Company processes, stores, or transmits sensitive data that includes information such as Customer or Employee data, credit card numbers, and other personally identifiable information for a variety of business purposes. The Company, therefore, is subject to various risks and costs associated with such activities, including costs associated with compliance with U.S. and foreign data collection and privacy laws and various contractual obligations. \nThe Company must also comply with evolving payment card association and network operating rules, including data security rules, certification requirements, and rules governing electronic fund transfers. For example, the Company must comply with evolving Payment Card Industry Data Security Standards (“PCI DSS”), which impose stringent requirements on how the Company processes and protects payment card data. Failure to maintain PCI DSS compliance or the compromise of cardholder data that the Company processes, stores, or transmits could result in costs, fees, fines, penalties, and restrictions on the Company’s ability to process payment card transactions, which could materially impact operations and Customer Experience.\nFurthermore, as the Company enters into airline partnerships with international carriers, the Company will need to comply with foreign laws like the EU's General Data Protection Regulation in certain scenarios, which could impose additional data privacy and security requirements upon the Company along with significant compliance obligations and substantial penalties for non-compliance.\nThe Company has experienced heightened legislative and regulatory focus on cybersecurity from a critical infrastructure perspective, a federal contractor perspective, and broadly applicable cybersecurity legal obligations. As a result, the Company must comply with a developing set of cybersecurity requirements, including but not limited to incident and other reporting, internal and external coordination, affirmative risk‑management obligations, compliance, and technical requirements related to information technology systems and operational technology systems. For example, in March 2023, the TSA issued emergency cybersecurity program changes applicable to TSA-regulated airport and aircraft operators, including the requirement to develop a TSA-approved cybersecurity implementation plan describing measures taken to improve cybersecurity and to assess the effectiveness of those measures on an ongoing basis. The TSA also continues to make significant cybersecurity program changes. In December 2023, the SEC’s new rules on cybersecurity risk management, strategy, governance, and incident disclosure became effective. For additional information, see",
    "item1c": "Item 1C.    \nCybersecurity\nCybersecurity Risk Management and Strategy \n \nRisk Assessment and Management\nThe Company is increasingly dependent on the use of complex technology and systems to run its operations and support its strategic objectives. These technologies and systems include, among others, the Company's website and \n52\nTable of Contents\nreservation system; mobile application; flight dispatch and tracking systems; flight simulators; check-in kiosks; aircraft maintenance, planning, and record keeping systems; telecommunications systems; flight planning and scheduling systems; crew scheduling systems; human resources systems; and financial planning, management, and accounting systems. Additionally, the Company must receive and process certain confidential or personal information related to its Customers and Employees to run its business, and the Company's operations depend upon secure collection, processing, retention, and transmission of such information. Therefore, the performance, reliability, and security of the Company's technology infrastructure and information systems are critical to the Company's operations and initiatives. \nThe Company has an enterprise risk management (“ERM”) program to identify, evaluate, and manage risks. Cybersecurity risks are evaluated alongside other critical business risks under the ERM program to align cybersecurity efforts with the Company's broader business goals and objectives. The Company believes that integrating cybersecurity risks into its ERM program fosters a proactive and holistic approach to cybersecurity, which helps safeguard the Company’s operations, financial condition, and reputation in an ever-evolving threat landscape.\nThe Company maintains a cybersecurity program that is designed to identify, protect from, detect, respond to, and recover from cybersecurity threats and risks, and protect the confidentiality, integrity, and availability of its information systems, including the information residing on such systems. The National Institute of Standards and Technology Cybersecurity Framework helps the Company inform its cybersecurity agenda and prioritize its cybersecurity activities. The Company takes a risk-based, threat-informed approach to cybersecurity, which begins with the identification and evaluation of cybersecurity risks or threats that could affect the Company’s operations, finances, legal or regulatory compliance, or reputation. Once identified, cybersecurity risks and related mitigation efforts are evaluated and prioritized based on their potential impact, likelihood, velocity, and vulnerability, considering both quantitative and qualitative factors. Risk mitigation strategies are developed and implemented based on the specific nature of each cybersecurity risk or threat. These strategies include, among others, the application of cybersecurity policies and procedures, implementation of administrative, technical, and physical controls, and Employee training, education, and awareness initiatives. The Company’s cybersecurity program also includes a Security Operations Center (“SOC”) that conducts ongoing monitoring of networks and systems for potential signs of suspicious activity. The SOC is a centralized function that monitors security alerts to initiate triage, verification, and remediation activities. Additionally, the Company’s cybersecurity program provides mechanisms for Employees to report any unusual or potentially malicious activity they observe. The Company tracks key performance indicators and cybersecurity metrics to evaluate the efficacy of its cybersecurity controls and practices. Further, the Company’s cybersecurity program is periodically reviewed by its Chief Information Officer (\"CIO\") and Chief Information Security Officer (\"CISO\" and, together with the CIO, the Company’s “Cybersecurity Leaders”) and adjusted in an effort to maintain the program’s agility and responsiveness as circumstances evolve, new cybersecurity threats emerge, and regulations change.\n \nIncident Response \nThe Company has a dedicated cybersecurity incident response team responsible for managing and coordinating the Company’s cybersecurity incident response efforts. This team collaborates closely with other internal teams as well as with external legal advisors, communication specialists, and other key stakeholders, as appropriate, in identifying, protecting from, detecting, responding to, and recovering from cybersecurity incidents. Cybersecurity incidents that meet certain thresholds are escalated to the Cybersecurity Leaders and cross-functional teams on an as-needed basis for support and guidance. Additionally, this team tracks cybersecurity incidents to help identify and analyze them. The Company maintains a cybersecurity incident response plan to prepare for and respond to cybersecurity incidents. The incident response plan includes standard processes for reporting and escalating cybersecurity incidents, as appropriate, to senior management, the Audit Committee, and the Board. Additionally, the Company conducts at least one cybersecurity tabletop exercise on an annual basis, where members of a cross-functional team engage in a simulated cybersecurity incident scenario. This preparedness exercise is intended to provide hands-on training for the participants and helps the Company assess its cybersecurity response plan and its processes and capabilities in addressing cybersecurity threats.\n53\nTable of Contents\n            Use of Third Parties\nCybersecurity Service Providers and Third-Party Consultants\n. The Company engages cybersecurity consultants, assessors, and other third parties to assess and enhance its cybersecurity practices. These third parties conduct assessments, penetration testing, and vulnerability evaluations to help identify potential weaknesses and recommend improvements. Additionally, the Company leverages a number of third-party tools and technologies as part of its efforts to enhance cybersecurity functions, such as a managed security service provider to augment the Company’s dedicated SOC team, an endpoint detection and response system for continuous monitoring, detection, and response capabilities, and a security information and event management solution to automate real-time threat detection, investigation, and prioritization of high-fidelity alerts.\nOversight of Third-Party Service Providers\n. The Company also uses third-party service providers to support its operations and many of its technology initiatives. The Company evaluates third-party service providers from a cybersecurity risk perspective, which may include an assessment of that service provider’s cybersecurity posture and/or a recommendation of specific mitigation activities. Following an evaluation, the Company determines and prioritizes service provider risk based on potential threat impact and likelihood, and such risk determinations drive the level of due diligence and ongoing compliance monitoring required for each service provider. \n \nRisks from Material Cybersecurity Threats\nAs of the date of this report, the Company has not identified any cybersecurity threats that have materially affected or are reasonably likely to have a material effect on the Company's business strategy, results of operations, or financial condition.\n Although the Company has not experienced cybersecurity incidents that are individually, or in the aggregate, material, the Company and its service providers have experienced cyber-attacks in the past, which the Company believes have thus far been mitigated by preventative, detective, and responsive measures put in place. For a detailed discussion of the Company’s cybersecurity related risks, see “",
    "item1a": "Item 1A Risk Factors—Information Technology, Cybersecurity, and Data Privacy Risks.”\nCybersecurity Governance \n \nBoard Oversight\nThe Board is responsible for overseeing management’s assessments of major risks facing the Company and for reviewing options to mitigate such risks. The Board’s oversight of major risks, including cybersecurity risks, occurs at both the full Board level and at the Board committee level through the Audit Committee. \nThe Board\n. The Chief Executive Officer, the Chief Operating Officer, the Chief Financial Officer, members of senior management, and other personnel and advisors, as requested by the \nBoard\n, report on the Company’s financial, operating, and commercial strategies, as well as major related risks, which may include cybersecurity risks, at regularly scheduled meetings of the Board. Based on these reports, the Board may request follow-up information and presentations to address any specific concerns and recommendations. Additionally, the Audit Committee has opportunities to report regularly to the entire Board and review with the Board any major issues that arise at the committee level, which may include cybersecurity risks.\nThe Audit Committee. \nThe Audit Committee reviews with management the Company’s technology and cybersecurity frameworks, policies, programs, opportunities, and risk profile as needed at its regularly scheduled meetings. The Company’s CIO, CISO, members of the cybersecurity team, or other advisors, as requested by the Audit Committee, report quarterly on the Company’s technology, data protection, and cybersecurity strategies and risks. Cybersecurity topics are presented to the Audit Committee on a quarterly basis and generally highlight any significant cybersecurity incidents, the cyber threat landscape, cybersecurity program enhancements, cybersecurity risks and related mitigation activities, and any other relevant cybersecurity topics. Management believes that this regular cadence of reporting helps to provide the Audit Committee with an informed understanding of the Company’s dynamic cybersecurity program and threat landscape. As needed, the Audit Committee reviews with \n54\nTable of Contents\nmanagement the Company’s business continuity and disaster recovery plans and capabilities and the effectiveness of the Company’s escalation procedures. Based on these management reports, the Audit Committee may request follow-up information and presentations to address any specific concerns and recommendations. In addition to this regular reporting, cybersecurity risks or threats may also be escalated on an as-needed basis to the Audit Committee.\n \nManagement’s Role\nThe Company has a dedicated cybersecurity organization within its technology department that focuses on current and emerging cybersecurity matters. The Company’s cybersecurity function is led by the Company’s \nCISO\n, who reports to the Company’s CIO. The Cybersecurity Leaders are actively involved in assessing and managing cybersecurity risks. They are responsible for implementing cybersecurity policies, programs, procedures, and strategies. The responsibilities and relevant experience of each of the Cybersecurity Leaders are listed below:\n•\nThe CIO provides leadership for the Company’s technology department. The CIO holds an undergraduate degree from Cornell and has served in various roles in information technology for over 20 years, including Vice President, Senior Director, Manager and Consultant. \n•\nThe CISO is responsible for leading the Company’s cybersecurity strategy and department while ensuring the protection of data and assets across the Company’s facilities, airports, and aircraft. The CISO has served in various roles in cybersecurity for over 15 years. The CISO earned a Bachelor of Business Administration in Management Information Systems from The University of Oklahoma and holds a Certified Information Systems Security Professional certification. The CISO also participates in the Aviation Information Sharing and Analysis Center Board and is the Vice Chair of the Cybersecurity Council at Airlines for America.\nThe Company’s cybersecurity department is comprised of teams that engage in a range of cybersecurity activities such as threat intelligence, incident response, security operations, vulnerability management, risk and compliance and security engineering. These teams conduct vulnerability management and penetration testing to identify, classify, prioritize, remediate, and mitigate vulnerabilities. Leaders from each team regularly meet with the Cybersecurity Leaders to provide visibility of relevant issues and seek alignment with strategy. As noted above under “Incident Response,” the Company’s cybersecurity incident response plan includes standard processes for reporting and escalating cybersecurity incidents, as appropriate, to senior management, the Audit Committee, and the Board. Cybersecurity incidents that meet certain thresholds are escalated to the Cybersecurity Leaders and cross-functional teams on an as-needed basis for support and guidance. The Company’s incident response team also coordinates, as needed, with external legal advisors, communication specialists, and other key stakeholders.\n \n55\nTable of Contents",
    "item1b": "Item 1B.    \nUnresolved Staff Comments\nNone."
  }
}