{
  "ticker": "LVS",
  "cik": "0001300514",
  "company_name": "LAS VEGAS SANDS CORP",
  "filing_date": "2025-02-07",
  "accession": "0001300514-25-000040",
  "primary_doc": "lvs-20241231.htm",
  "item_sections": {
    "item1": "ITEM 16\n—\nFORM 10-K SUMMARY\n119\nSIGNATURES\n120\n2\nTable of Contents\nPART I\nITEM 1. — \nBUSINESS\nOur Company\nLas Vegas Sands Corp. (“LVSC,” or together with its subsidiaries “we” or the “Company”) is a Fortune 500 company and the leading global developer and operator of destination properties (“Integrated Resorts”) that feature premium accommodations, world-class gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants and other amenities.\nWe currently own and operate Integrated Resorts in Macao and Singapore.  We believe our geographic diversity, best-in-class properties and convention-based business model provide us with the best platform in the hospitality and gaming industry to continue generating growth and cash flow while simultaneously pursuing new development opportunities.  We focus on the mass market, which comprises our most profitable gaming segment.  We believe the mass market segment will continue to deliver long-term growth as a result of continuing economic growth, expansion of the middle class and an increasing number of high net worth individuals across our markets in Asia.  We also offer loyalty programs at our properties, which provide access to rewards, privileges and members-only events.  Additionally, we believe being in the retail mall business and, specifically, owning some of the largest retail properties in Asia will provide meaningful value for us, particularly as the retail market in Asia continues to grow.\nOur properties also cater to high-end patrons by providing them with luxury amenities and premium service levels.  These amenities include luxury accommodations, restaurants, lounges, invitation-only clubs and private gaming salons.  In each of the regions where we operate, the Paiza brand is associated with certain of these exclusive facilities and represents an important part of our VIP gaming marketing strategy.\nOur unique convention-based marketing strategy allows us to attract business travelers during the slower mid-week periods while leisure travelers occupy our properties during the weekends.  Our convention, trade show and meeting facilities, combined with the on-site amenities offered at our Macao and Singapore Integrated Resorts, provide flexible and expansive space for meetings, incentives, conventions and exhibitions (“MICE”).  \nThrough our 72.29% ownership of Sands China Ltd. (“SCL”), as of the date of this filing, we own and operate a collection of Integrated Resorts in the Macao Special Administrative Region (“Macao”) of the People's Republic of China (“PRC” or “China”).  These properties include The Venetian Macao Resort Hotel (“The Venetian Macao”); The Londoner Macao; The Parisian Macao; The Plaza Macao and Four Seasons Hotel Macao (the “Four Seasons Macao”); and the Sands Macao.\nIn Singapore, we own and operate the iconic Marina Bay Sands, which opened in 2010 and is one of Singapore's major tourist, business and retail destinations.\nWe are dedicated to sustainability across environmental, social and governance (“ESG”) priorities, anchored by our People, Communities and Planet corporate responsibility platform.  In 2024, we were named to the Dow Jones Sustainability North America Index for the seventh consecutive year and to the Dow Jones Sustainability World Index for the fifth consecutive year, recognizing our ESG leadership and performance.  We strive to deliver a positive working environment for our team members worldwide and pledge to promote the advancement of aspiring team members through a range of educational partnerships, grants and leadership training.  We are committed to creating and investing in industry-leading policies and procedures to safeguard our customers, partners, employees and neighbors.  We drive social impact through, among other things, our Sands Cares charitable giving and community engagement program.  Our industry-leading Integrated Resorts provide substantial contributions to our host communities including growth in leisure and business tourism, sustained job creation and ongoing financial opportunities for local small and medium-sized businesses.  We continuously make efforts to improve our environmental performance through our Sands ECO360 global sustainability program (“Sands ECO360”).  Through Sands ECO360, we develop and implement environmental practices to advance energy efficiency and transition to renewables, reduce waste, conserve water and source products and materials responsibly.\nLVSC was incorporated in Nevada in August 2004.  Our common stock is traded on the New York Stock Exchange (the “NYSE”) under the symbol “LVS.”  Our principal executive office is located at 5420 S. Durango Dr., Las Vegas, Nevada 89113 and our telephone number at that address is (702) 923-9000.  Our website address is \nwww.sands.com\n.  The information on our website is not part of this Annual Report on Form 10-K.\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements and other Securities and Exchange Commission (“SEC”) filings, and any amendments to those reports and any other filings we file with, or furnish to, the SEC under the Securities Exchange Act of 1934 are made available free of charge on our website as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC and are also available at the SEC's website address at \nwww.sec.gov\n.\n3\nTable of Contents\nInvestors and others should note we announce material financial information using our investor relations website (\nhttps://investor.sands.com\n), our company website, SEC filings, investor events, news and earnings releases, public conference calls and webcasts.  We use these channels to communicate with our investors and the public about our company, our products and services, and other issues. \nIn addition, we post certain information regarding SCL (a subsidiary of LVSC with ordinary shares listed on The Stock Exchange of Hong Kong Limited) from time to time on our company website and our investor relations website.  It is possible the information we post regarding SCL could be deemed to be material information. \nThe contents of these websites are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file or furnish with the SEC, and any references to these websites are intended to be inactive textual references only.\nThis Annual Report on Form 10-K contains certain forward-looking statements.  See “Item 7 — Management's Discussion and Analysis of Financial Condition and Results of Operations — Special Note Regarding Forward-Looking Statements.”\nOur principal operating and developmental activities occur in two geographic areas: Macao and Singapore.  Management reviews the results of operations for each of its operating segments, which generally are our Integrated Resorts.  In Macao, our operating segments are: The Venetian Macao; The Londoner Macao; The Parisian Macao; The Plaza Macao and Four Seasons Macao; and Sands Macao.  In Singapore, our operating segment is Marina Bay Sands.  We also review construction and development activities for our primary projects under development, in addition to our reportable segments noted above.  We also have ferry operations and various other operations that are ancillary to our Macao properties (collectively, “Ferry Operations and Other”). \nStrengths and Strategies\nWe believe we have a number of strengths that differentiate our business from our competitors, including:\nDiversified, high quality Integrated Resort offerings with substantial non-gaming amenities.  \nOur Integrated Resorts feature non-gaming attractions and amenities including world-class entertainment, expansive retail offerings and market-leading MICE facilities.  These attractions and amenities enhance the appeal of our Integrated Resorts, contributing to visitation, length of stay and customer spending at our properties.  The broad appeal of our market-leading Integrated Resort offerings in our various markets enables us to serve the widest array of customer segments in each market.\nSubstantial and diversified cash flow from existing operations. \n Our Integrated Resorts in Macao and Singapore have contributed 53% and 47% of our total adjusted property EBITDA, respectively, during 2024.  In each of these jurisdictions, our cash flow from operations was derived from a combination of gaming and non-gaming sources, including retail malls, hotel, food and beverage, entertainment and MICE.\nMarket leadership in the growing higher-margin mass market gaming segment.\n  In our gaming business, we focus on the higher-margin mass gaming segment.  Our combined SCL properties continue to have the highest percentage of gaming win from mass tables and slots of the Macao operators.  Management estimates our mass market table revenues typically generate a gross margin substantially higher than the gross margin on our VIP table revenues.  Additionally, gross gaming revenue from mass tables and slots has contributed to approximately two-thirds of total gross gaming revenue at Marina Bay Sands during the previous five years.\nEstablished brands with broad regional and international market awareness and appeal.\n  Through a combination of its diversity of amenities, scale of facilities and its distinctive design, The Venetian Macao has remained the foremost example of a themed Integrated Resort in Macao.  The Londoner Macao, our largest themed property on the Cotai Strip, with replicas of the Houses of Parliament and the Elizabeth Tower, along with The Parisian Macao, our themed property with an iconic replica of the Eiffel Tower and other attractions, has established an interconnected critical mass of \nEurope\nan-themed Integrated Resorts that attract multiple segments of leisure and business tourism and drive broad brand awareness both regionally and globally.  As awareness of The Londoner Macao increases, we believe this Integrated Resort has both the quality and scale to enhance the overall reputation and recognition of our Macao portfolio.\nMarina Bay Sands is an iconic, architecturally significant Integrated Resort with meaningful scale and visitation.  Due to its distinctive design, multitude of amenities and customer experiences shared on social media, and a prominent position as part of the Singapore skyline, Marina Bay Sands is recognized throughout Asia and globally.  We believe the brand of Marina Bay Sands is unique and as a result, the property is often featured prominently on social media, in filmed entertainment and in other media.\nExperienced management team with a proven track record.\n  Mr. Robert G. Goldstein, our Chairman and Chief Executive Officer, has been an integral part of our executive team from the beginning, joining our founder and previous Chairman and Chief Executive Officer, Mr. Sheldon G. Adelson, before The Venetian Resort Las Vegas was constructed.  Mr. Goldstein is one of the most respected and experienced executives in our industry today.  Mr. Patrick Dumont, our President and Chief Operating Officer, has been with the Company for more than 14 years, including previously serving as our Executive Vice President and Chief Financial Officer, and has prior experience in corporate finance and management.  Our management team is focused on delivering growth, increasing our return on invested capital, \n4\nTable of Contents\nbalance sheet strength, preserving the Company’s financial flexibility to pursue development opportunities and continuing to execute return of capital to stockholders. \nUnique MICE and entertainment facilities.  \nOur market-leading MICE and entertainment facilities contribute to our markets’ diversification and appeal to business and leisure travelers while diversifying our cash flows and increasing revenues and profit.  Our approximately 2.8 million square feet of global MICE space is designed to meet the needs of meeting planners and corporate events and trade show organizers from around the world.  Our experience and expertise in this industry supports our ability to drive leisure and business tourism to our markets.  The live entertainment program at our properties has been a key traffic driver and has established us as a leader in the field of tourism and leisure activities.\nBuilding on our key strengths, we seek to enhance our position as the leading developer and operator of Integrated Resorts and casinos by continuing to implement the following business strategies:\nDeveloping and diversifying our Integrated Resort offerings to include a full complement of products and services to cater to different market segments.  \nOur Integrated Resorts include MICE space, retail, dining and entertainment facilities and a range of hotel offerings, including branded suites and hotel rooms, to cater to different segments of our markets.  We are able to leverage the recognition and the sales, marketing and reservation capabilities of premier hotel brands to attract a wide range of customers in different market segments to our properties.  We believe our partnerships with renowned hotel management partners, our diverse Integrated Resort offerings and the convenience and accessibility of our properties will continue to increase the appeal of our properties to both the business and leisure customer segments.\nLeveraging our scale of operations to create and maintain an absolute cost advantage.  \nManagement expects to benefit from lower unit costs due to the economies of scale inherent in our operations.  Opportunities for lower unit costs include, but are not limited to: lower utility costs; more efficient staffing of hotel and gaming operations; and centralized transportation, marketing and sales, and procurement.  In addition, our scale allows us to consolidate certain administrative functions.\nFocusing on the higher-margin mass market gaming segment, while continuing to provide luxury amenities and high service levels to our VIP and premium players.  \nThe scale and product mix of our Integrated Resorts allow us to participate very effectively in all segments of the market.  We believe the mass market segment will continue to exhibit long-term growth as a result of continuing economic growth, expansion of the middle class and increasing number of high net worth individuals across our markets in Asia, accompanied by supportive long-term trends in business and leisure tourism.  Our properties are positioned to harness future growth in the mass market that comprise our most profitable gaming segment, while delivering the immersive destination resort experiences that create loyalty with VIP and premium players.\nIdentifying targeted investment opportunities to drive growth across our portfolio. \n We will continue to invest in the expansion of our facilities and the enhancement of the leisure and business tourism appeal of our property portfolio.  Our planned development projects include fulfilling capital and operating investment requirements as part of our Macao gaming concession, the continuing renovation and redevelopment of The Londoner Macao and the extensive renovation and expansion of Marina Bay Sands.\nOur Operations\nMacao\nThe Venetian Macao is the anchor property of our Cotai Strip development and is located approximately two miles from the Taipa Ferry Terminal on Macao's Taipa Island and six miles from the bridge linking Hong Kong, Macao and Zhuhai.  The Venetian Macao includes approximately 503,000 square feet of gaming space and gaming support area with approximately 678 table games and 1,140 slot machines and electronic table games (“ETGs”).  The Venetian Macao features a 39-floor luxury hotel tower with 2,905 elegantly appointed luxury suites and the Shoppes at Venetian, approximately 952,000 square feet of unique retail shopping with 350 stores featuring many international brands and home to 60 restaurants and food outlets featuring an international assortment of cuisines.  In addition, The Venetian Macao has approximately 1.2 million square feet of convention facilities and meeting room space, an 1,800-seat theater and the recently renovated 14,000-seat Venetian Arena that hosts world-class entertainment and sporting events.\nThe Londoner Macao, our largest Integrated Resort on the Cotai Strip, is located across the street from The Venetian Macao, The Parisian Macao and The Plaza Macao and Four Seasons Macao.  The Londoner Macao presents a range of attractions and features, including some of London’s most recognizable landmarks, such as the Houses of Parliament and the Elizabeth Tower (commonly known as “Big Ben”), and interactive guest experiences.  The Integrated Resort features four hotel towers.  The first hotel tower consists of Londoner Court with 368 luxury suites and 400 rooms and suites under the St. Regis brand.  The second hotel tower consists of 659 five-star rooms and suites under the Conrad brand and The Londoner Macao Hotel with 594 London-themed suites, including 14 exclusive Suites by David Beckham.  We continue to work on Phase II of The Londoner Macao, which commenced in 2023 and primarily includes the renovation of the rooms in the third and fourth hotel towers, previously the Sheraton Grand Macao, and will result in 1,382 and 1,023 rooms and suites, respectively, upon completion.  The Sheraton Grand Macao is being rebranded into the Londoner Grand hotel, which \n5\nTable of Contents\nwill become Macao’s first Marriott International Luxury Collection hotel.  Additionally, Phase II of The Londoner Grand includes an upgrade of the gaming areas and the addition of attractions, dining, retail and entertainment offerings and is expected to be substantially complete during the first half of 2025 (see “Development Projects” for further information).  The Londoner Grand casino opened on September 26, 2024.  The Integrated Resort includes approximately 400,000 square feet of gaming space and gaming support area with approximately 513 table games and 1,281 slot machines and ETGs, approximately 358,000 square feet of meeting space, a 1,701-seat theater, the 6,000-seat Londoner Arena, approximately 566,000 square feet of retail space with 164 stores and home to 50 restaurants and food outlets featuring an international assortment of cuisines. \nThe Parisian Macao, which is connected to The Venetian Macao and The Plaza Macao and Four Seasons Macao, includes approximately 272,000 square feet of gaming space and gaming support area with approximately 267 table games and 900 slot machines and ETGs.  The Parisian Macao also features 2,541 rooms and suites and the Shoppes at Parisian, approximately 297,000 square feet of unique retail shopping with 109 stores featuring many international brands and home to 24 restaurants and food outlets featuring an international assortment of cuisines.  Other non-gaming amenities at The Parisian Macao include a meeting room complex of approximately 62,000 square feet and a 1,200-seat theater.  Directly in front of The Parisian Macao, and connected via a covered walkway to the main building, is a half-scale authentic re-creation of the Eiffel Tower containing a viewing platform and restaurant. \nThe Plaza Macao and Four Seasons Macao, which is located adjacent to The Venetian Macao, has approximately 108,000 square feet of gaming space and gaming support area with approximately 105 table games and 13 slot machines and ETGs at its Plaza Casino.  The Plaza Macao and Four Seasons Macao also has 360 elegantly appointed rooms and suites managed by FS Macau Lda., several food and beverage offerings, and conference and banquet facilities.  The Grand Suites at Four Seasons features 289 luxury suites.  The Shoppes at Four Seasons includes approximately 262,000 square feet of retail space with 138 stores and 10 restaurant and food outlets, and is connected to the Shoppes at Venetian.  The Plaza Macao and Four Seasons Macao also features 19 ultra-exclusive Paiza Mansions, which are individually designed and made available by invitation only. \nThe Sands Macao, the first U.S. operated Las Vegas-style casino in Macao, is situated near the Macao-Hong Kong Ferry Terminal on a waterfront parcel centrally located between Macao's Gongbei border gate with China and Macao's central business district.  The Sands Macao includes approximately 176,000 square feet of gaming space and gaming support area with approximately 117 table games and 366 slot machines and ETGs.  The Sands Macao also includes a 289-suite hotel tower, spa facilities and several restaurants and entertainment areas.\nWe operate the gaming areas within our Macao properties pursuant to a 10-year gaming concession that expires in December 2032.  See “Regulation and Licensing — \nMacao Concession\n.”\nSingapore\nMarina Bay Sands opened with approximately 2,600 rooms and suites located in three 55-story hotel towers.  We are currently undertaking extensive renovation work with 1,844 rooms and suites resulting upon completion, which is expected to greatly enhance the positioning of our hotel product.  Atop the three towers is the Sands SkyPark, an extensive outdoor recreation area with a 150-meter infinity swimming pool and leading restaurant and nightlife brands.  The Integrated Resort offers approximately 162,000 square feet of gaming space with approximately 543 table games and 3,000 slot machines and ETGs; approximately 616,000 square feet at The Shoppes at Marina Bay Sands, an enclosed retail, dining and entertainment complex with signature restaurants from world-renowned chefs; an event plaza and promenade; and an art/science museum.  Marina Bay Sands also includes approximately 1.2 million square feet of meeting and convention space and a state-of-the-art theater for top Broadway shows, concerts and gala events. \nWe operate the gaming area within our Singapore property pursuant to a 30-year casino concession provided under a development agreement entered into in August 2006.  See “Regulation and Licensing — Development Agreement with Singapore Tourism Board.”  Additionally, see “Development Projects — Singapore.”\nOur Markets \nMacao\nMacao is the largest gaming market in the world and the only market in China to offer legalized casino gaming.  According to Macao government statistics issued publicly on a monthly basis by the Gaming Inspection and Coordination Bureau (commonly referred to as the “DICJ”), annual gross gaming revenues were 226.78 billion patacas in 2024 (approximately $28.35 billion at exchange rates in effect on December 31, 2024), an increase of 23.9% compared to 2023.\nVisitation to Macao was approximately 35 million in 2024, an increase of 23.8% compared to 2023.  We believe visitation will continue to experience long-term growth.  We believe this growth will be driven by a variety of factors, including the movement of Chinese citizens to urban centers in China, continued growth of the Chinese outbound tourism market, the increased utilization of existing transportation infrastructure, the introduction of new transportation infrastructure and the continued increase in hotel room inventory in \n6\nTable of Contents\nMacao and neighboring Hengqin Island.  There has been significant investment announced and recently completed by concessionaires in new resort development projects on Cotai.  These factors should help increase the critical mass on Cotai and further drive Macao's transformation into a leading business and leisure tourism hub in Asia.  We believe the development of additional integrated resort products in Macao will also drive a higher demand for gaming products.\nTable games are the dominant form of gaming in Asia, with Baccarat being the most popular game.  We believe we will continue to experience Macao market-leading visitation and are focused on driving higher-margin mass market gaming, while providing luxury amenities and high service levels to our VIP and premium players.  We intend to continue to introduce more modern and popular products that appeal to the Asian marketplace and believe our continued improvement in our high-quality gaming product offerings has enabled us to capture a meaningful share of the overall Macao gaming market across all player segments.\nProximity to Major Asian Cities\nVisitors from Hong Kong, South China, Taiwan and other locations in Asia can reach Macao in a relatively short time, using a variety of transportation methods, and visitors from more distant locations in Asia can take advantage of short travel times by air to Zhuhai, Shenzhen, Guangzhou or Hong Kong, followed by a road, ferry or helicopter trip to Macao.  In addition, numerous air carriers fly directly into Macau International Airport from many major cities in Asia. \nMacao draws in a significant number of customers who are visitors or residents of Hong Kong.  One of the major methods of transportation to Macao from Hong Kong is the jetfoil ferry service, including our ferry services, Cotai Water Jet.  The Hong Kong-Zhuhai-Macao Bridge (the “HZMB”), which connects Hong Kong, Macao and Zhuhai, has reduced the travel time between Hong Kong and Macao from one hour by ferry to approximately 45 minutes on the road.  The HZMB is part of the Greater Bay Area Initiative and plays a key role in connecting the cities in the Greater Bay Area, facilitating the visitation to Macao.  Macao is also accessible from Hong Kong by helicopter.\nCompetition in Macao\nGaming in Macao is administered by the government through concessions awarded to six different concessionaires, of which we are one.  The other concessionaires are SJM Resorts, S.A., Wynn Resorts (Macau), S.A., Galaxy Casino, S.A., MGM Grand Paradise, S.A. and Melco Resorts (Macau), S.A.\nOur Macao operations also face competition from other gaming and resort destinations, both in Asia and globally.\nSingapore\nSingapore is regarded as having the most developed financial and transportation infrastructure in the Southeast Asia region.  Singapore has established itself as a destination for both business and leisure visitors, offering convention and exhibition facilities as well as world-class shopping malls and hotel accommodations.  In 2006, the Singapore government awarded two concessions to develop and operate two Integrated Resorts.  We were awarded the concession for the Marina Bay site, which is adjacent to Singapore's central business district, and Genting International was awarded the second site, located on Singapore's Sentosa Island.\nBased on figures released by the Singapore Tourism Board (the \"STB\"), Singapore welcomed approximately 16.5 million international visitors in the twelve months ended December 31, 2024, a 21.4% increase compared to the same period in 2023.  Tourism receipts were estimated to be 27.16 billion Singapore dollars (\"SGD\", approximately $19.97 billion at exchange rates in effect on December 31, 2024) in 2023 (the latest information publicly available at the time of filing).  The Gambling Regulatory Authority (the “GRA”), the gaming regulator in Singapore, does not disclose gaming revenue for the market and thus no official figure exists.\nWe believe Marina Bay Sands is ideally positioned within Singapore to cater to both business and leisure visitors.  The Integrated Resort is centrally located within a 20-minute drive from Singapore's Changi International Airport and near the Marina Bay Cruise Center, a deep-water cruise ship terminal, and Bayfront station, a mass rapid transit station.  Marina Bay Sands is also located near several entertainment attractions, including the Gardens by the Bay botanical gardens and the Singapore Sports Hub, a sports complex featuring the 55,000-seat National Stadium.\nBaccarat is the preferred table game in both VIP and mass gaming.  Additionally, contributions from slot machines and from mass gaming, including ETG offerings, have enhanced the growth of the market.  As Marina Bay Sands and the Singapore market as a whole continue to mature, we expect to broaden our visitor base to continue to capture visitors from around the world.\nProximity to Major Asian Cities\nMore than 100 airlines operate in Singapore, connecting it to some 150 cities in approximately 50 countries.  In the twelve months ended December 31, 2024, 68 million passengers passed through Singapore's Changi Airport, an increase of 14.8% compared to the same period in 2023.  Work is currently underway to expand the number of runways and open a fifth terminal at Changi Airport, which would increase passenger capacity.  Based on figures released by the STB, the largest source markets for visitors to Singapore over the last five \n7\nTable of Contents\nyears ending in 2024 were China and Indonesia.  The STB's methodology for reporting visitor arrivals does not recognize Malaysian citizens entering Singapore by land, although this method of visitation is generally thought to be substantial.\nCompetition in Singapore\nGaming in Singapore is administered by the government through the award of licenses to two operators, our Company and Resorts World Sentosa, which is 100% owned by Genting Singapore PLC.  The GRA is required to ensure there will not be more than two casino licenses until January 1, 2031.\nOur Singapore operations also face competition from other gaming and resort destinations, both in Asia and globally.\nRetail Mall Operations\nWe own and operate retail malls at our Integrated Resorts at The Venetian Macao, The Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Macao and Marina Bay Sands.  We currently own approximately 2.7 million square feet of gross retail space.  Management believes being in the retail mall business and, specifically, owning some of the largest retail properties in Asia provides meaningful value for us, particularly as the retail market in Asia continues to grow.\nOur malls are designed to complement our other unique amenities and service offerings provided by our Integrated Resorts.  Our strategy is to seek out desirable tenants that appeal to our patrons and provide a wide variety of shopping options.  We generate our mall revenue primarily from leases with tenants through base minimum rents, overage rents and reimbursements for common area maintenance (“CAM”) and other expenditures.  For further information related to the financial performance of our malls, see “Part II — Item 7 — Management's Discussion and Analysis of Financial Condition and Results of Operations.”\nThe tables below set forth certain information regarding our mall operations on the Cotai Strip and at Marina Bay Sands as of December 31, 2024.  These tables do not reflect subsequent activity in 2025.\nMall Name\nTotal GLA\n(1)\nSelected Significant Tenants\nShoppes at Venetian\n822,424\n(2)\nZara, Victoria's Secret, Uniqlo, Tiffany & Co., Rolex, Bvlgari, Muji, Marks & Spencer, Tommy Hilfiger, Cartier, Chaumet, Longines, OMEGA, Polo Ralph Lauren, Kenzo, Boucheron, Diesel, Lululemon, Arc'teryx, Nike, Audemars Piguet \nShoppes at Londoner\n566,251\nMarks & Spencer, Chow Tai Fook, Apple, Bottega Veneta, Gucci, Burberry, Tod's, V&A, DFS, Tory Burch, The Cheesecake Factory, Shake Shack, Jimmy Choo, Alexander McQueen, Polo Ralph Lauren, Stella McCartney, Emporio Armani, Louis Vuitton, Alexander Wang, Mikimoto, Uniqlo, Lord Stow's Bakery & Cafe\nShoppes at Parisian\n296,818\nAntonia, Champion, Jaeger-LeCoultre, Breitling, I.T Menswear, Temptation\nShoppes at Four Seasons\n261,898\nCartier, Chanel, Louis Vuitton, Hermès, Gucci, Dior, Versace, Zegna, Loro Piana, Saint Laurent, Balenciaga, Loewe, Roger Vivier, Christian Louboutin, Alexander McQueen, Miu Miu, Tiffany & Co., Rimowa\nThe Shoppes at Marina Bay Sands\n615,869\n(3)\nLouis Vuitton, Zara, Chanel, Gucci, Dior, Burberry, Prada, Fendi, Moncler, Hermès, Cartier, Apple\n____________________\n(1)\nRepresents Gross Leasable Area in square feet.\n(2)\nExcludes approximately 130,000 square feet of space on the fifth floor currently not on the market for lease.\n(3)\nExcludes approximately 150,000 square feet of space operated by the Company.\n8\nTable of Contents\nThe following table reflects our tenant representation by category for our mall operations as of December 31, 2024:\nCategory\nSquare Feet\n% of\nSquare Feet\nRepresentative Tenants\nFashion (luxury, women's, men's, mixed)\n779,339 \n36 \n%\nLouis Vuitton, Dior, Gucci, Versace, Chanel, Hermès, Balenciaga, Loewe, Saint Laurent, Burberry, Prada, Moncler, Fendi, Kenzo, Alexander McQueen, Bottega Veneta, ZEGNA, Givenchy, Loro Piana, Miu Miu, Berluti \nRestaurants and lounges\n408,049 \n19 \n%\nLei Garden, Ce La Vi, North, The Cheesecake Factory, Shake Shack, Haidilao, Tai Er Chinese Sauerkraut Fish, Jin Yue Xuan, Hip Seng Seafood Hot Pot Restaurant, Lord Stow’s Bakery &\nCafé\nMulti-Brands\n244,109 \n11 \n%\nDuty Free Americas, The Atrium, DFS, Temptation\nJewelry\n172,270 \n8 \n%\nBvlgari, Cartier, Rolex, Tiffany & Co., Chaumet, Van Cleef & Arpels, Longines,  Jaeger-LeCoultre, Breitling, Breguet, Chopard, PIAGET, Audemars Piguet\nHealth and beauty\n110,790 \n5 \n%\nSephora, Sa Sa, Chanel, Helena Rubinstein, La Prairie, Dior, Le Labo\nFashion accessories and footwear\n109,404 \n5 \n%\nRimowa, Charles & Keith, Tod’s, Jimmy Choo, Roger Vivier, Christian Louboutin, Spectacle Hut, Gentle Monster\nLifestyle, sports and entertainment\n97,782 \n4 \n%\nManchester United, Adidas, Lululemon, Under Armour, Sandbox VR, Limited Edt, Arc’teryx\nHome furnishing and electronics\n92,986 \n4 \n%\nApple, MUJI\nArts and gifts\n65,640 \n3 \n%\nEmporio di Gondola, Pop Mart\nBanks and services\n63,447 \n3 \n%\nBank of China, ICBC, BR Aesthetic Medical Clinic\nSpecialty foods\n42,655 \n2 \n%\nGodiva, Haagen Dazs, Jason’s Deli, Venchi\nTotal\n2,186,471 \n100 \n%\nHuman Capital \nTalent Management\nWe directly employ approximately 40,300 employees worldwide, including approximately 39,900 full-time employees, and hire additional temporary employees on an as-needed basis.  Of our full-time employees, approximately 49% are female.\nOur success depends in large part upon our ability to attract, retain, train, manage and motivate skilled managers and employees at our properties.  Our strategy is to be the employer of choice by ensuring a thriving workforce built on integrity and opportunity and to support our employees’ personal, professional and financial well-being.  We strive to enhance our culture by creating a safe environment that consists of an inclusive and diverse workforce where all employees are treated fairly and equally and can excel in the performance of their duties.  Some examples of key programs and initiatives we have implemented to attract, develop and retain our diverse workforce include:\n•\nCompetitive pay; \n•\nHealthcare: medical/prescription, dental, vision, short-term disability, life and accidental death and disability insurance options at no premium cost; group healthcare insurance; and other support for both physical and mental health, such as a free Employee Assistance Program for employees and their household, which provides information regarding nutrition, disease management, stress reduction and injury prevention;\n9\nTable of Contents\n•\nRetirement benefits: all eligible employees are able to participate in retirement planning schemes, which may include contributions from the employer, as well as the employee; \n•\nDiversity, Equity and Inclusion Program: through policies, procedures, hiring practices and support systems, we seek to promote diversity, equity and inclusion and integrate these values into our Company;\n•\nSubsidized child care programs;\n•\nOn-site provision of meals for employees; and\n•\nTraining and development: through Sands Academy, our global training and development platform, we provide courses, learning tools, coaching opportunities and one-on-one consulting to help employees fulfill their potential, as well as provide tuition reimbursement.\nOur employees are not covered by collective bargaining agreements.  We believe we have good relations with our employees and any relevant union.\nCommitment to Environmental Sustainability\nWe focus significant attention on minimizing our environmental impact with the goal of reducing the environmental footprint of our existing properties and offsetting the impact of new developments.  Through Sands ECO360, we endeavor to adapt to emerging trends, support new technologies and foster environmental stewardship in the areas of building design and development, resort management and operations, and meetings, events and entertainment.  The program is aligned with the United Nations Sustainable Development Goals and other key environmental standards in the areas of low carbon transition, water stewardship, waste, materials and resources and biodiversity. \nOur Environmental, Social and Governance Report (the “Report”) is available on our website and contains further information on our environmental sustainability performance, including data that reflect the reporting standards of the Global Reporting Initiative, the International Sustainability Standards Board and the Sustainability Accounting Standards Board.  The contents of the Report and our website are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file or furnish with the SEC, and any reference to the Report and our website are intended to be inactive textual references only.\nIn addition to our internal initiatives, we have developed the Drop by Drop Project, a collaborative water stewardship initiative in conjunction with Clean the World Foundation.  The Drop by Drop Project is designed to encourage sustainability in our local regions with grants for innovative water projects in Macao and Singapore.  \nDevelopment Projects\nWe regularly evaluate opportunities to improve our product offerings, such as refreshing our meeting and convention facilities, suites and rooms, retail malls, restaurant and nightlife mix and our gaming areas, as well as other revenue generating additions to our Integrated Resorts.\nMacao\nOur investment plan in Macao includes investments in projects across a number of key areas including attracting international visitors, conventions and exhibitions, entertainment shows, sporting events, culture and art, health and wellness, themed attractions, supporting Macao's status as a city of gastronomy, and enhancing community and maritime tourism. \nKey aspects of our investment plan remain subject to Macao government approval and include:\n•\nMICE Facility Expansion\n.  Our vision is to elevate convention sector capabilities. To this end, we are proposing the construction of a state-of-the-art MICE facility.  The facility is intended to connect to our existing Venetian Macao exhibition center (the “Cotai Expo”).  This expansion aims to increase our hosting capacity and enhance Macao’s appeal as a premier destination for significant corporate events, supported by advanced resources to help organize such events and targeted marketing strategies.\n•\nTropical Garden Redevelopment\n.  We plan to transform the Le Jardin garden, situated adjacent to The Londoner Macao, into a distinctive garden-themed attraction.  Key highlights include an iconic conservatory and meticulously designed themed green spaces.  We anticipate this venue will evolve into a renowned Macao landmark and year-round attraction for tourists and local residents, further solidifying Macao's reputation as a premier destination.\nWe continue work on Phase II of The Londoner Macao, which commenced in 2023 and primarily includes the renovation of the rooms in the Sheraton hotel towers, an upgrade of the gaming areas and the addition of attractions, dining, retail and entertainment offerings.  The Londoner Grand casino opened on September 26, 2024.  In September 2024, SCL announced the unveiling of the Londoner Grand, which represents the conversion of the Sheraton Grand Macao into Macao's first Marriott International Luxury Collection hotel.  Upon completion, the Londoner Grand will have 2,405 rooms and suites\n.  \nAs of December 31, 2024, more than 300 newly renovated \n10\nTable of Contents\nrooms and suites were available for occupancy at the Londoner Grand.  These projects have a total estimated cost of $1.2 billion and are expected to be substantially completed during the first half of 2025.\nSingapore\nIn April 2019, our wholly owned subsidiary, Marina Bay Sands Pte. Ltd. (“MBS”) and the STB entered into a development agreement (the “Second Development Agreement”) pursuant to which MBS has agreed to construct a development (the “MBS Expansion Project”) on a land parcel adjacent to Marina Bay Sands.\nThe MBS Expansion Project will include a hotel tower with luxury rooms and suites, a rooftop attraction, premium gaming areas, convention and meeting facilities and a state-of-the-art live entertainment arena with approximately 15,000 seats. \nOur estimated total project cost is approximately $8.0 billion, inclusive of financing fees and interest, land premiums and the purchase of an additional 2,000 square meters of gaming area (the “Additional Gaming Area”), increasing Marina Bay Sands’ total approved gaming area to 17,000 square meters across the existing property and the MBS Expansion Project.\nOn January 8, 2025, MBS entered into a second supplemental agreement to the Second Development Agreement with the STB (the “Second Supplemental Agreement”) whereby MBS committed to assume liability for the cost of the land premium associated with the Additional Gaming Area purchase as well as other adjustments to the land premiums resulting from the consequential changes to the allocations of gross floor area for the MBS Expansion Project since the first payment made in 2019 (the \"Additional Land Premium\").  These allocations prescribe and limit the use of the gross floor area for hotel, gaming, retail, food and beverage, MICE and arena at the MBS Expansion Project site. The Second Supplemental Agreement also formalized the dates by which MBS has agreed with the Singapore government to commence and complete construction of the MBS Expansion Project, being July 8, 2025 and July 8, 2029, respectively.  These dates were previously agreed by way of the letter agreement, dated April 1, 2024, between the STB and MBS.\nWe have incurred approximately $1.36 billion as of December 31, 2024, inclusive of the payment made in 2019 for the lease of the parcels of land underlying the MBS development project site.  The Additional Land Premium is estimated to be approximately $1.0 billion, $850 million of which we expect will be due during the second quarter of 2025, with the remainder to be due in 2026.\nWhile our current estimate is that construction will be complete by June 2030 with an anticipated opening date in January 2031, any extension of the completion date beyond the July 8, 2029 deadline is subject to the approval of the Singapore government.\nThe renovation of Towers 1 and 2 of Marina Bay Sands is now complete and has introduced world class suites and other luxury amenities at a cost of approximately $1.0 billion.  We are continuing with the renovation of the Tower 3 hotel rooms into world class suites and other property changes at an estimated cost of approximately $750 million to be completed in phases during the first half of 2025.  These renovations at Marina Bay Sands will result in a total of 1,844 rooms and suites upon completion and are substantially upgrading the overall guest experience for our premium customers, including new dining and retail experiences, and upgrading the casino floor including introducing tower gaming, among other things.  These projects are in addition to the MBS Expansion Project.\nNew York\nOn June 2, 2023, we paid $241 million to acquire the Nassau Veterans Memorial Coliseum (the “Nassau Coliseum”) from Nassau Live Center, LLC and related entities, which included the right to lease the underlying land from the County of Nassau (the “County”) in the State of New York (the “Nassau Coliseum Transaction”).  \nThere is litigation associated with our right to lease the underlying land of the Nassau County Coliseum from the County of Nassau in the State of New York and there can be no assurance as to the positive outcome of such litigation.  See “Item 8 — Financial Statements and Supplementary Data — Notes to Consolidated Financial Statements — Note 16 — Leases for further description of this litigation.\nWe purchased the Nassau Coliseum with the intent to obtain a casino license from the State of New York to develop and operate an Integrated Resort.  There is no assurance we will be able to obtain a casino license from the State of New York.\nOther\nWe continue to evaluate additional development projects in each of our markets and pursue new development opportunities globally. \nRegulation and Licensing\nMacao Concession\nOn December 16, 2022, the Macao government awarded Venetian Macau Limited (\"VML\"), SCL's wholly owned subsidiary, one of six concessions to operate casinos in Macao.  VML entered into a concession agreement with the Macao government for the duration of ten years, beginning January 1, 2023 (the “Concession”).  \n11\nTable of Contents\nOn December 30, 2022, pursuant to the terms of VML’s subconcession, VML and certain other subsidiaries of SCL committed to the Macao government to transfer back the casinos, gaming areas and respective supporting areas (\"Gaming Assets\") without compensation and free of any liens or charges upon the subconcession's expiry.  On the same day, VML and the Macao government entered into a Handover Record granting VML the right to operate the Gaming Assets for the duration of the Concession in exchange for an annual fee.  This fee, calculated based on a price per square meter of reverted gaming area, is set at 750 patacas per square meter for the first three years and will increase to 2,500 patacas for the remaining seven years (approximately $94 and $313, respectively, at exchange rates in effect on December 31, 2024).  Furthermore, the fee per square meter will be subject to an annual adjustment based on the previous year's average price index in Macao.  For each of the years ended December 31, 2023 and 2024, we incurred a fee of $13 million.  The annual fee for 2025 is estimated at $13 million, followed by an estimated $42 million annually for the subsequent seven years, subject to the aforementioned index adjustment. \nOur Concession mandates that we operate casino games of chance in Macao and authorizes us to manage and operate the Gaming Assets at Sands Macao, The Venetian Macao, The Plaza Macao and Four Seasons Macao, The Londoner Macao and The Parisian Macao.\nInvestment Plan\nIn accordance with the Concession, we committed to invest, or cause to be invested, at least 30.24 billion patacas (approximately $3.78 billion at exchange rates in effect on December 31, 2024) in Macao (the \"Investment Plan\").  Of this total, 27.80 billion patacas (approximately $3.48 billion\n \nat exchange rates in effect on December 31, 2024) must be invested in non-gaming projects.  \nThe Concession includes a provision that mandates an increased investment in non-gaming projects by up to 20% in the event that Macao’s annual market gross gaming revenue reaches or surpasses 180 billion patacas (approximately $22.50 billion\n \nat exchange rates in effect on December 31, 2024) for the year ended December 31, 2023.  The condition was met as Macao's annual gross gaming revenue for 2023 reached 183.06 billion patacas (approximately $22.88 billion\n \nat exchange rates in effect on December 31, 2024).  As a result, we are now obligated to invest, or cause to be invested, an additional 5.56 billion patacas (approximately $695 million at exchange rates in effect on December 31, 2024), increasing our non-gaming investment commitment from 27.80 billion patacas (approximately $3.48 billion at exchange rates in effect on December 31, 2024) to 33.36 billion patacas (approximately $4.17 billion at exchange rates in effect on December 31, 2024).  The total investment commitment after the above provision is now 35.80 billion patacas (approximately $4.48 billion at exchange rates in effect on December 31, 2024).  These investments must be completed by December 2032.\nMacao Regulations\nTo operate casino games of chance, we must hold a gaming concession issued by the Macao government and we are subject to regulation by the Macao gaming authorities.  Our Concession is not transferable, and we must pay periodic and regular fees and taxes.  We must periodically submit detailed financial and operating reports to the Macao gaming authorities, as well as any other information they may request.  No person may acquire any rights over the shares or assets of VML without prior consent of the Macao gaming authorities.  Similarly, no person may operate the casino premises whose use has been temporarily transferred to us, either through a management agreement or any other contract or through step in rights without first obtaining the approval of the Macao gaming authorities.  The transfer or creation of encumbrances over ownership of shares representing the share capital of VML or other rights relating to such shares, as well as any act involving the granting of voting rights or other shareholders' rights to persons other than the original owners, requires the approval of the Macao government and subsequent reporting to the Macao gaming authorities.\nOur Concession and the applicable Macao laws require, among other things: (i) the approval of the Macao government for transfers of shares in VML, or of any rights over or inherent to such shares, such as the granting of voting rights or other shareholders' rights to persons other than the original owners, as well as for the creation of any charge, lien or encumbrance on such shares; (ii) the approval of the Macao government for transfers of shares or rights over such shares, in any of our direct or indirect shareholders, provided that such shares or rights represent, directly or indirectly, 5% or more of VML's share capital; (iii) that the Macao government be notified of the creation of any encumbrance or the grant of voting rights or other shareholders' rights to persons other than the original owners on shares in any of the direct or indirect shareholders in VML, provided that such shares or rights represent 5% or more of VML's share capital; and (iv) that the Macao government be given notice of the listing on a stock exchange by any indirect shareholders holding shares representing 5% or more of VML's share capital.  The requirements in provisions (ii) and (iii) above will not apply, however, to securities listed as tradable on a stock exchange.  VML and any of its subsidiaries in which VML is a dominant shareholder are prohibited from being listed on any stock exchange.\nThe Macao gaming authorities may investigate any individual who has a material relationship or involvement with VML to determine whether this individual affects our suitability and/or financial capacity.  LVSC and SCL shareholders who hold 5% or more of VML's share capital, directly or indirectly, as well as VML's directors and its key employees, must undergo a suitability assessment.  They must also maintain appropriate qualifications during the Concession and submit to the Macao government's ongoing inspection and supervision.  VML must immediately notify the Macao government of any fact of which it is aware that may be material to the qualification of any shareholder who holds 5% or more of the share capital of VML, directly or indirectly, or any VML director or key \n12\nTable of Contents\nemployee.  In addition to having the authority to deny an application for a finding of unsuitability, the Macao gaming authorities also have the authority to disapprove a change in corporate position.  If the Macao gaming authorities determine that one of VML's directors or key employees is unsuitable, we would be required to sever all ties with that individual.  In addition, the Macao gaming authorities may require us to terminate the employment of any employee who refuses to submit the required documentation.  A person may be deemed unsuitable if they fail or refuse to apply for a finding of suitability after being ordered to do so by the Macao gaming authorities.  \nAny shareholder deemed unsuitable who continues to hold, directly or indirectly, any beneficial ownership of the shares of VML (or any other Macao-registered subsidiary of the Company) for longer than the period prescribed by the Macao gaming authorities may lose their rights to the shares.  After we receive notice that a person is unsuitable to be a shareholder or to have any other relationship with us, we will be subject to disciplinary action if we:\n•\npay that person any dividend or interest upon the shares;\n•\nallow that person to exercise, directly or indirectly, any voting right conferred through shares held by that person;\n•\npay remuneration in any form to that person for services rendered or otherwise; or\n•\nfail to pursue all lawful efforts to require that person to relinquish the shares.\nThe Macao gaming authorities also have the authority to approve all persons who own or control the shares of a concessionaire.\nIn addition, prior approval from the Macao gaming authorities is required for any loan or similar financing transaction exceeding 100 million patacas (approximately $13 million at exchange rates in effect on December 31, 2024) where VML is a borrower or a lender, or which involves the creation of liens and encumbrances over VML's assets.\nMacao gaming authorities must also be notified five days in advance of any relevant financial decision, including the internal movement of funds that exceed 50% of VML's share capital and any other financial decision that exceeds 10% of VML's share capital, including decisions related to remunerations and employee benefits.\nThe Macao gaming authorities must approve any change in control of VML resulting from a merger, consolidation, acquisition of shares or assets, management or consulting agreement, or any other act or conduct whereby a person obtains control.  Entities seeking to acquire control must first satisfy the Macao gaming authorities on a number of criteria.  As part of the approval process, the Macao gaming authorities may also require an investigation and sustainability assessment be carried out into controlling shareholders, officers, directors and other individuals with a material relationship or involvement with the entity proposing to acquire control.\nAny recapitalization plan proposed by VML's board of directors must be approved by the Macao gaming authorities prior to implementation.  If deemed necessary, the Chief Executive of Macao may also require VML to increase its share capital.\nThe Concession also permits the Macao government to request modifications to the plans and specifications of our Macao properties as well as to make various other decisions and determinations that may be binding on us.  For instance, the Macao government may require that we contribute additional capital to our Macao subsidiaries or provide certain deposits or other performance guarantees in any amount deemed necessary by the Macao government.  \nBefore it raises debt or equity, VML must first obtain the approval of the Macao gaming and governmental authorities, which constrains the company's ability to raise additional capital.\nThe Concession requires VML to submit to the Macao government, three months prior to the start of each calendar year, an annual execution plan for the specific projects in the Investment Plan, detailing each project it intends to execute, the proposed amount to be spent and the execution schedule.  The Macao government will then decide whether to approve the annual execution plan within two months of its submission, and may request modifications to specific projects, investment amounts and execution schedules.  If any of the annual execution proposals or portions thereof are not approved, VML must propose allocating the corresponding funds to other projects, which are also subject to approval by the Macao government.  VML must submit a report detailing the execution of the previous year's annual execution proposal within three months following the end of each calendar year.  In addition, VML is subject to the oversight of the Macao government in regard to the implementation of the Investment Plan development projects, and VML must submit regular progress reports every two months and may be required to submit additional reports whenever the progress of a development project is compromised. \nIf our Concession is terminated due to a breach of its terms, the Gaming Assets would be returned to the Macao government without compensation, and we would cease to generate any revenues from these operations.  In many of these instances, the Concession does not provide a specific cure period within which such events may be remedied; instead, we would rely on consultations and negotiations with the Macao government to enable us to remedy any such breach.\nOur Concession allows us to operate casino games of chance, but excludes mutual bets, lotteries, raffles, interactive gaming and games of chance or other gaming, betting or gambling activities on ships or aircraft.  \n13\nTable of Contents\nOur Concession is governed exclusively by Macao law, and we are subject to the exclusive jurisdiction of the Macao courts in case of any dispute or conflict relating to our Concession.\nOur Concession expires on December 31, 2032.  If our Concession is not extended or renewed, VML may be prohibited from conducting gaming operations in Macao, and we could cease generating revenues from our gaming operations when our Concession expires.  In addition, upon the expiry of our Concession, the Gaming Assets, the use of which has been temporarily transferred to VML by the Macao government, will be returned to the Macao government without compensation, along with any gaming-related equipment we acquire during our Concession.  Furthermore, any new casinos, gaming areas and respective supporting areas that VML is authorized to operate during the Concession will revert to the Macao government without compensation to us. \nUnder the terms of our Concession, we are required to pay to the Macao government an annual gaming premium consisting of a fixed portion and a variable portion based on the number and type of gaming tables and gaming machines we operate.  The fixed portion of the premium is 30 million patacas (approximately $4 million at exchange rates in effect on December 31, 2024).  The variable portion is equal to 300,000 patacas per gaming table reserved exclusively for certain kinds of games or players, 150,000 patacas per gaming table not so reserved and 1,000 patacas per electrical or mechanical gaming machine, including slot machines (approximately $37,503, $18,751 and $125, respectively, at exchange rates in effect on December 31, 2024), subject to a minimum of 76 million patacas (approximately $10 million at exchange rates in effect on December 31, 2024).  In addition, we must pay a special gaming tax of 35% of gross gaming revenues and withholding taxes, where applicable.  We are also required to pay a special annual gaming premium if the average of the gross gaming revenues of our gaming tables and our electrical or mechanical gaming machines, including slot machines, is lower than a certain minimum amount set by the Macao government, with the special premium being the difference between the special gaming tax based on the actual gross gaming revenues and the minimum amount.  The minimum amount set by the Macao government is 7 million patacas per gaming table and 300,000 patacas per gaming machine (approximately $1 million and $37,503, respectively, at exchange rates in effect on December 31, 2024).  Based on the maximum number of gaming tables and gaming machines we are currently authorized to operate, if the aggregate monthly special gaming taxes paid during the year is less than 4.50 billion patacas (approximately $563 million at exchange rates in effect on December 31, 2024), we would be required to pay the difference as the special annual gaming premium.  During the year ended December 31, 2024, we did not have to pay a special gaming premium under the Concession requirements as the special gaming taxes were higher than the minimum threshold.  VML must also contribute 5% of its annual gross gaming revenue to entities designated by the Macao government, including 2% to a public fund for the purpose of promoting, developing or researching cultural, social, economic, educational, scientific, academic and charitable activities, and 3% for urban construction development, the promotion of tourism and the provision of social security.\nOn February 5, 2024, VML received an exemption from Macao's corporate income tax on profits generated by the operation of casino games of chance for the period from January 1, 2023 through December 31, 2027.\nAdditionally, on February 7, 2024, we entered into a shareholder dividend tax agreement with the Macao government, effective for the period from January 1, 2023 through December 31, 2025, providing for a payment at an applicable rate of gross gaming revenue for the tax year 2023 through the tax year 2025 as a substitution for a 12% tax otherwise due from VML's shareholders on dividend distributions paid from VML's gaming profits.\nDevelopment Agreement with Singapore Tourism Board\nOn August 23, 2006, MBS entered into a development agreement, as amended by a supplementary agreement on December 11, 2009 (the “Development Agreement”), with the STB to design, develop, construct and operate the Marina Bay Sands.  The Development Agreement includes a concession for MBS to own and operate a casino within the Integrated Resort.  In addition to the casino, the Integrated Resort includes, among other amenities, a hotel, a retail complex, a convention center and meeting room complex, a theater, restaurants and an art/science museum.  MBS is one of two companies awarded a concession to operate a casino in Singapore.  Only two licensees were granted the right to operate a casino in Singapore during an initial ten-year exclusive period (the “Exclusivity Period”), which expired on February 28, 2017.  This Exclusivity Period was subsequently extended to December 31, 2030, when the Second Development Agreement (see below) was entered into.  In connection with entering into the Development Agreement, MBS entered into a 60-year lease with the STB for the parcels underlying the project site and entered into an agreement with the Land Transport Authority of Singapore for the provision of necessary infrastructure for rapid transit systems and road works within and/or outside the project site.  During the Exclusivity Period, the Company, which is currently the 100% indirect shareholder of MBS, is required to be the single largest entity with direct or indirect controlling interest of at least 20% in MBS, unless otherwise approved by the GRA.\nThe term of the casino concession provided under the Development Agreement is for 30 years commencing from the date the Development Agreement was entered into, or August 23, 2006.  In order to renew the casino concession, MBS must give notice to the STB and other relevant authorities in Singapore at least five years before its expiration in August 2036.  The Singapore government may terminate the casino concession prior to its expiration in order to serve the best interests of the public, in which event fair compensation will be paid to MBS.\n14\nTable of Contents\nIn April 2019, MBS and the STB entered into the Second Development Agreement pursuant to which MBS has agreed to construct a development on land adjacent to Marina Bay Sands.  The Second Development Agreement provides for a total minimum project cost of approximately SGD 4.5 billion (approximately $3.3 billion at exchange rates in effect on December 31, 2024).\nThe MBS Expansion Project will include a hotel tower with luxury rooms and suites, a rooftop attraction, premium gaming areas, convention and meeting facilities and a state-of-the-art live entertainment arena with approximately 15,000 seats.\nIn connection with the Second Development Agreement, MBS entered into a lease with the STB for the parcels of land underlying the project (the “Land”).  In April 2019 and in connection with the lease, MBS provided various governmental agencies in Singapore the required premiums, deposits, stamp duty, goods and services tax and other fees in an aggregate amount of approximately SGD 1.54 billion (approximately $1.14 billion at exchange rates in effect at the time of the transaction).  \nOn March 29, 2022, MBS entered into a letter agreement with the STB to extend the construction commencement date for the MBS Expansion Project from April 8, 2022 to April 8, 2023.  On March 22, 2023, MBS and the STB entered into the Supplemental Agreement, which further extended the construction commencement date to April 8, 2024 and the construction completion date to April 8, 2028, and allowed for changes to the construction and operation plans under the Second Development Agreement.  \nOn January 8, 2025, MBS entered into the Second Supplemental Agreement with the STB, whereby MBS committed to assume liability for the cost of the land premium associated with the Additional Gaming Area purchase as well as other adjustments to the land premiums resulting from the consequential changes to the allocations of gross floor area for the MBS Expansion Project since the first payment made in 2019.  These allocations prescribe and limit the use of the gross floor area for hotel, gaming, retail, food and beverage, MICE and arena at the MBS Expansion Project site. The Second Supplemental Agreement also formalized the dates by which MBS has agreed with the Singapore government to commence and complete construction of the MBS Expansion Project, being July 8, 2025 and July 8, 2029, respectively.  These dates were previously agreed by way of the letter agreement, dated April 1, 2024, between MBS and the STB.  While our current estimate is that construction will be complete by June 2030 with an anticipated opening date in January 2031, any extension of the completion date beyond the July 8, 2029 deadline is subject to the approval of the Singapore government.\nThe Development Agreement contains, among other things, restrictions limiting the use of the leased land to the development and operation of the project, requirements that MBS obtain prior approval from the STB in order to subdivide the hotel and retail components of the project, prohibitions on any such subdivision during the Exclusivity Period and limitations on MBS' ability to assign the lease or sub-lease any portion of the land during the Exclusivity Period.  In addition, the Development Agreement contains events of default, including, among other things, the failure of MBS to perform its obligations under the Development Agreement and events of bankruptcy or dissolution.\nEmployees whose job duties relate to the operations of the casino are required to be licensed by the relevant authorities in Singapore.  MBS also must comply with comprehensive internal control standards or regulations concerning advertising; branch office operations; the location, floor plans and layout of the casino; casino operations including casino-related financial transactions and patron disputes, issuance of credit and collection of debt, relationships with and permitted payments to gaming promoters; security and surveillance; casino access by Singaporeans and non-Singaporeans; compliance functions and the prevention of money laundering; periodic standard and other reports to the GRA; and those relating to social controls including the exclusion of certain persons from the casino.\nThere is a goods and services tax of 7% imposed on gross gaming revenue, which, effective January 1, 2023, increased to 8%, and, effective January 1, 2024, further increased to 9%.  There is also a casino tax imposed on the gross gaming revenue from the casino after reduction for the amount of goods and services tax.  With effect from March 1, 2022, the casino tax rates of 5% for premium players and 15% for mass players were increased to 8% and 18% on gross gaming revenue up to SGD 2.4 billion and SGD 3.1 billion (approximately $1.8 billion and $2.3 billion at exchange rates in effect on December 31, 2024), respectively.  On gross gaming revenue above the stated thresholds, the new casino tax rates are 12% for premium players and 22% for mass players.  The bad debts written off from the extension of credit granted to gaming patrons is not deductible against gross gaming revenue when calculating the casino tax, but is deductible for the purposes of calculating the goods and services tax (subject to the prevailing law).  MBS is permitted to extend casino credit to persons who are not Singapore citizens or permanent residents, but is not permitted to extend casino credit to Singapore citizens or permanent residents except to premium players. \nThe key constraint imposed on the casino under the Development Agreement is the total size of the gaming area, which must not be more than 15,000 square meters (approximately 161,000 square feet), although the Second Development Agreement provides for an option to purchase additional gaming area as described below.  The following are not counted towards the gaming area: back of house facilities, reception, restrooms, food and beverage areas, retail shops, stairs, escalators and lift lobbies leading to the gaming area, aesthetic and decorative displays, performance areas and major aisles.  Under the Development Agreement, the casino located within Marina Bay Sands could not have more than 2,500 gaming machines (although this restriction has been modified by the Second Development Agreement as described below), but there is no limit on the number of tables for casino games permitted in the casino.\n15\nTable of Contents\nUnder the Casino Control Act, as amended (the “Singapore Act”), a casino operator may be subject to a financial penalty, for each ground of disciplinary action which amounts to a serious breach, of a sum not exceeding 10% of the annual gross gaming revenue (as defined in the Singapore Act) of the casino operator for the financial year immediately preceding the date the financial penalty is imposed.\nThe Singapore Act also requires future applicants and/or renewals for a casino license to be a suitable person to develop, maintain and promote the Integrated Resort as a compelling tourist destination that meets prevailing market demand and industry standards and contributes to the tourism industry in Singapore.  The Singapore government has established an evaluation panel that will assess applicants and report to the GRA on this aspect of the casino licensing requirements.  Our casino license, which has a three-year term, is set to expire in April 2025.  We have filed a renewal application and believe it meets the renewal requirements as determined by the GRA; however, no assurance can be given the license renewal will be granted or for what period of time it will be granted.\nThe Second Development Agreement contains provisions relating to the construction of the MBS Expansion Project and associated deadlines for completion, levels of insurance and limitations on MBS’ ability to assign the lease or sub-let any portion of the Land.  In addition, the Second Development Agreement contains events of default, including, among other things, the failure of MBS to perform its obligations under the Second Development Agreement.   The Second Development Agreement also contains, among other things, restrictions limiting the use of the Land to the development and operation of the MBS Expansion Project and requirements that MBS obtain the prior approval of the STB in order to subdivide the Land or any building thereon, which approval, if given, will be subject to such terms and conditions as may be determined by the STB.\nThe Second Development Agreement makes provision for certain benefits and entitlements conferred on MBS on specified terms and conditions.  Among these, upon the achievement of certain milestones, MBS is entitled to make available an additional 1,000 gaming machines over and above its existing 2,500 gaming machines.  On October 7, 2019, MBS was granted entitlement to make available 500 of these additional 1,000 gaming machines.  In addition, under the Second Development Agreement, MBS is granted approval for the change of use of the area comprising the whole of the 53rd and 54th floors of Marina Bay Sands’ hotel Tower 2, or such other areas as may be agreed, to be developed and used as part of Marina Bay Sands’ casino; and MBS is granted an option to purchase an additional 2,000 square meters of casino gaming area at a price to be determined by the relevant Singapore government authority upon written request by MBS to exercise the option.  In addition, the Second Development Agreement contemplates that for a period of not less than 10 years commencing no sooner than March 1, 2022, the rate of casino tax applicable to MBS will not exceed specified tiered rates; there shall not be more than two casino licenses in force under the Casino Control Act at any time prior to January 1, 2031; and for a period of five years from the date of the Second Development Agreement, the entry levy payable by a Singapore citizen or permanent resident for entry into the casino will not exceed SGD 150 for a 24-hour period and SGD 3,000 for a 12-month period.  The Second Development Agreement also provides for MBS to be entitled to compensation by STB for any losses or damages suffered under certain conditions and events related to the above-described benefits and entitlements.  The Second Development Agreement further provides MBS must maintain compliance with the material terms of the Second Development Agreement to obtain the above-described benefits and entitlements.\nDoing Business in Macao, Hong Kong and Mainland China\nWe are a parent company with limited business operations of our own; our main asset is the capital stock of our subsidiaries.  A significant portion of our business operations are based in Macao and held by various Macao-incorporated indirect subsidiaries of SCL, our majority-owned subsidiary incorporated in Cayman Islands and listed in Hong Kong (collectively referred to as the “Macao Operations”).  We also have subsidiaries incorporated in mainland China and Hong Kong that provide back-office support, such as information technology, accounting, hotel management and marketing services, which complement and support SCL’s main back-office functions in Macao.\nWe face various legal and operational risks and uncertainties relating to having a majority of our operations based in Macao and held by various Macao-incorporated indirect subsidiaries of SCL.  Substantially all of SCL’s assets are located in Macao and substantially all of SCL’s revenue is derived from Macao.  Accordingly, our results of operations, financial position and prospects are subject to a significant degree to the economic, political and legal situation in Macao.  On December 20, 1999, Macao became a Special Administrative Region of China when China resumed the exercise of sovereignty over Macao.  The Basic Law of Macao provides that Macao will be governed under the principle of “one country, two systems” with its own separate government and legislature and that Macao will have a high degree of legislative, judicial and economic autonomy. \nWe also face risks and uncertainties associated with evolving Chinese laws and regulations, such as those associated with the extent to which the level of Chinese government involvement, control of capital inflows and outflows, control of foreign exchange and allocation of resources currently applicable within mainland China may become applicable to us and other risks and uncertainties as to whether and how recent Chinese government statements and regulatory developments, such as those relating to data and cyberspace security and anti-monopoly which, where applicable to us, could result in a material change in our operations and/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors, cause the value of such securities to significantly decline or be worthless and affect our ability to list securities on a U.S. or other foreign exchange.  If, in the future, there were \n16\nTable of Contents\nto be a significant change in the manner in which the Chinese government exercises direct or indirect oversight, discretion or control over businesses operated in Macao, mainland China and Hong Kong, including the current interpretation and application of existing Chinese laws and regulations on how the Chinese government exercises direct or indirect oversight, discretion or control over businesses operated in Macao, mainland China and Hong Kong, it could potentially result in our Macao Operations being materially adversely affected and it could potentially adversely affect our results of operations, financial position and cash flows.\nAs advised by our PRC legal advisers, Haiwen & Partners, our Macao Operations are currently not required to obtain any permission or approval from the China Securities Regulatory Commission (“CSRC”), Cyberspace Administration of China (“CAC”) or any other mainland Chinese governmental authority to operate its business or to issue securities to foreign investors, other than those related to its two subsidiaries incorporated in mainland China that only provide back-office support.  We have received all requisite permissions and approvals for the back-office supporting functions located in mainland China, primarily being the standard business licenses issued by the relevant authorities in mainland China, and we have never been denied such permissions and approvals.  If we do not receive or maintain such permissions or approvals in relation to such back-office support functions, we do not expect there will be any material adverse impact on our business, financial condition and results of operations.  In the event that we have inadvertently concluded that such permissions or approvals are not required for our Macao Operations or if, in the future, applicable laws, regulations or interpretations were to change and require us to obtain such permissions or approvals, the failure to obtain such permissions or approvals could potentially result in penalties and other regulatory actions against us and may materially and adversely affect our business and results of operations.\nSee “",
    "item1a": "Item 1A. — Risk Factors — Failure to maintain the integrity of our information and information systems or comply with \n32\nTable of Contents\napplicable privacy and cybersecurity requirements and regulations could harm our reputation and adversely affect our business” for more detailed information on cybersecurity risks and the potential impacts.",
    "item1b": "ITEM 1B. — \nUNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. — \nCYBERSECURITY\nWe, together with our third-party vendors, employ information technology including networks, systems, and applications to support our business processes and decision-making across the Company.  Our information technology is \nconnected\n to support the flow of information across our business processes.  As such, our information technology infrastructure is susceptible to cybersecurity threats.\nWe maintain detailed technology and cybersecurity programs to manage information security risk within the Company.  We rely on both proprietary and commercially available systems, software, and tools to protect and monitor the processing, transmission, and storage of Company data and both customer and team member information.  The objectives of our programs are to:\n•\nprotect the confidentiality, integrity, and availability of data, \n•\nprotect against anticipated threats, \n•\nprotect against unauthorized access to our information technology systems,\n•\nsafeguard assets, and\n•\nmaintain resiliency and recovery plans regarding Company informational technology.\nTo meet these objectives and oversee the programs, we employ a Chief Information Security Officer (“CISO”).  The CISO has over 28 years of cybersecurity experience, 26 years of cybersecurity leadership experience, an MBA in Information Systems, a Master of Science degree in operational analysis, a bachelor’s degree in operations research and holds a Cyber Risk Oversight Certificate from the National Association of Corporate Directors and is a Certified Information Systems Security Professional (“CISSP”).  The CISO works closely with the head of information technology and the data privacy officer to collectively manage our global cybersecurity, information technology and data privacy programs.\n \nOur cybersecurity programs are informed by or aligned to the ISO/IEC 27001 security framework, an internationally recognized standard.  As part of our programs, we assess our \nthird-party\n vendors for relevant risks which may impact the Company.\nWe also engage \nthird-party\n providers to perform periodic risk-based assessments of our cybersecurity programs, and also leverage our internal audit department, supported by third-party technical experts, to conduct periodic risk-based audits of our cybersecurity programs.\n \nOur Enterprise Risk Management (“ERM”) process, which is governed by an \nERM Committee\n, includes a review of our cybersecurity programs.  \nThe ERM Committee, which is led by our executive vice president and chief financial officer, meets quarterly, and receives updates from the CISO on emerging risks, recent cyber risk events, and any priority risks relating to cybersecurity.  We also have a Cyber & Privacy Steering (“CPS”) Committee, which meets regularly and is comprised of senior management, serving as a multi-disciplinary group for coordinating and overseeing the management of the cybersecurity and privacy programs\n.\n \nThe \nAudit Committee\n of the Board of Directors has oversight responsibility for ERM, including the cybersecurity programs.  \nThe CISO provides regular updates on cyber security to the Audit Committee, including on the cybersecurity aspects noted by the ERM Committee and CPS Committee, and regularly meets with the Audit Committee in executive session.  The presentations highlight the state of our cybersecurity and data security programs, as well as our progress on key initiatives in this area.\n \nTo date, the Company \nhas not experienced\n a cybersecurity threat or incident that has materially affected or is reasonably likely to materially affect the Company.  The Company, however, has experienced and expects to continue to experience cyber incidents of varying degrees.  See “"
  }
}