{
  "ticker": "LW",
  "cik": "0001679273",
  "company_name": "Lamb Weston Holdings, Inc.",
  "filing_date": "2025-07-23",
  "accession": "0001679273-25-000049",
  "primary_doc": "lw-20250525.htm",
  "item_sections": {
    "item1": "ITEM 1A. RISK FACTORS \nOur business is subject to various risks and uncertainties. Any of the risks and uncertainties described below could materially and adversely affect our business, financial condition, and results of operations and should be considered in evaluating us. Although the risks are organized by heading, and each risk is described separately, many of the risks are interrelated. While we believe we have identified and discussed below the material risks affecting our business, there may \n8\nTable of Contents\nbe additional risks and uncertainties that we do not presently know or that we do not currently believe to be material that may adversely affect our business, financial condition, or results of operations in the future.\nBusiness and Operating Risks\nWe may not be able to offset cost increases on inputs necessary for the production and distribution of our products, such as labor, raw materials, energy, fuel, and packaging materials. \nA significant portion of our cost of goods comes from commodities such as raw potatoes, edible oil, grains, starches, and energy. These commodities are subject to price volatility and fluctuations in availability caused by many factors, including: changes in global supply and demand, governmental incentives and controls (including import/export restrictions, such as new or increased tariffs, sanctions, quotas or trade barriers including the tariffs announced by the U.S. in April 2025 on U.S. imports, and any retaliatory tariffs imposed by foreign governments on U.S. exports, as well as selective tariff exemptions), weather conditions (including any potential effects of climate change), fire, natural disasters (such as a hurricane, tornado, earthquake, wildfire or flooding), disease or pests, agricultural uncertainty, water stress, health epidemics or pandemics or other contagious outbreaks,\n \nas was the case with the COVID-19 pandemic, limited or sole sources of supply, inflation, political uncertainties, acts of terrorism, governmental instability, war or other conflicts (such as the war in Ukraine, conflicts in the Middle East and tensions between China and Taiwan), or currency exchange rates.\nDuring fiscal 2025, we continued to experience elevated commodity and supply chain costs, including the costs of labor, raw materials (such as potatoes, edible oil, grain and starch), energy, fuel, packaging materials, and other inputs necessary for the production and distribution of our products, as well as transportation and logistics costs. Commodity price increases, or a sustained interruption or other constraints in the supply or availability of key commodities, including necessary services such as transportation and warehousing, could adversely affect our business, financial condition, and results of operations. Our attempts to offset these cost pressures, such as through increases in the selling prices of some of our products, may not be successful or may not be sustainable. Higher product prices may result in reductions in sales volume, especially given the current highly competitive frozen potato product market and soft restaurant traffic and the volatility of the macroeconomic environment. To the extent that price increases are not sufficient to offset these increased costs adequately or in a timely manner, and/or if they result in significant decreases in sales volume, our business, financial condition, or results of operations may be adversely affected. Though we provide most of our customers with local/regional supply, products we manufacture at our one production facility in Canada and import to the U.S., as well as the 5% of our inputs, primarily edible oils and natural gas, that are sourced in Canada, are currently exempt from these tariffs as they are compliant with the United States-Mexico-Canada trading agreement. Despite the current exemptions, the implementation of new tariffs on imports from Canada, Mexico, China or other countries for an extended period and without specific exemptions for our products may adversely affect our business, financial condition and results of operations. Further, any retaliatory tariffs on U.S. products by other countries, or other trade protection measures by foreign countries in favor of their local producers of competing products, such as governmental subsidies, tax benefits, and other measures giving local producers a competitive advantage over Lamb Weston, may adversely affect our business and results of operations in those countries.\nWe also may not be successful in mitigating the effects of these cost increases through productivity initiatives or through our commodity hedging activity. Our future success and earnings growth depend in part on our ability to maintain the appropriate cost structure and operate efficiently in the highly competitive value-added frozen potato product category. We continue to implement profit-enhancing initiatives to improve the efficiency of our supply chain and general and administrative functions. These initiatives are focused on cost-saving opportunities in procurement, manufacturing, logistics, and customer service, as well as general and administrative functions. However, gaining additional efficiencies may become more difficult over time. In addition, there is currently no active derivatives market for potatoes in the U.S. Although we have experience in hedging against commodity price increases, these practices and experience reduce, but do not eliminate, the risk of negative profit impacts from commodity price increases. As a result, the risk management procedures that we use may not always work as we intend. To the extent we are unable to offset present and future cost increases, our business, financial condition, and results of operations could be materially and adversely affected.\nDisruption to our supply chain could adversely affect our business\n.\nOur ability to manufacture or sell our products may be impaired by damage or disruption to our manufacturing, warehousing or distribution capabilities, or to the capabilities of our suppliers, logistics service providers, or independent distributors. This damage or disruption could result from execution issues, as well as factors that are difficult to predict or beyond our control such as increased temperatures due to climate change, water stress, extreme weather events, natural \n9\nTable of Contents\ndisasters, product or raw material scarcity, fire, terrorism, pandemics, armed hostilities (including the ongoing war in Ukraine and conflicts in the Middle East), strikes, labor shortages, cybersecurity breaches, governmental restrictions or mandates, disruptions in logistics, supplier capacity constraints, or other events. Failure to take adequate steps to mitigate the likelihood or potential impact of such events, or to effectively manage such events if they occur, may adversely affect our business, financial condition, and results of operations. Further, the inability of any supplier, including, but not limited to, those that supply our packaging, ingredients, equipment and other necessary operating materials, co-manufacturer, independent contractor, logistics service provider, or independent distributor to deliver or perform for us in a timely or cost-effective manner could cause our operating costs to increase and our profit margins to decrease. We have experienced, and may continue to experience, disruptions in our supply chain, including as a result of temporary systems disruptions, labor shortages, increased transportation and warehousing costs, longer shipping times, pandemics or other public health crisis, the ongoing war in Ukraine and the conflicts in the Middle East. The occurrence of a significant supply chain disruption or the inability to access or deliver products that meet requisite quality and safety standards in a timely and efficient manner, could lead to increased warehouse and other storage costs or otherwise adversely affect our profitability and weaken our competitive position or harm our business.\nLabor shortages or stoppages, an inability to attract and retain key personnel, increased turnover or increases in labor costs could adversely affect our business, financial condition, and results of operations.\nLabor is a primary component of operating our business. A number of factors may adversely affect the available labor force, or increase labor costs, for us or our third-party business partners, including hybrid or remote work arrangements, higher unemployment subsidies, other government regulations, and general macroeconomic factors. The labor market has been increasingly tight and competitive, and we may face sudden and unforeseen challenges in the availability of labor, such as we experienced in fiscal 2022 and 2023 at some of our production facilities, which reduced our production run-rates and increased our manufacturing costs, or as we and our suppliers experienced in 2022 with the shortage of drivers and reduced trucking capacity, which increased transportation costs. As we experienced with the COVID-19 pandemic, sustained labor shortages or increased turnover rates within our workforce, could lead to production or shipping delays, increased costs, such as increased overtime to meet demand and increased wage rates to attract and retain employees, and could negatively affect our ability to efficiently operate our production and distribution facilities and overall business. Further, our success depends on our ability to attract, retain, and develop effective leaders and personnel with professional and technical expertise, such as agricultural and food manufacturing experience or emerging technologies experience, as well as finance, marketing, and other senior management professionals. The loss of the services of these persons could deplete our institutional knowledge and could have a material adverse effect on our business, financial condition, and results of operations. The market for these employees is competitive, and we could experience difficulty from time to time in hiring and retaining the personnel necessary to support our business. In addition, changes in immigration laws and policies or restrictions could make it more difficult for us to recruit or relocate skilled employees. Our ability to recruit and retain a highly skilled workforce could also be materially impacted if we fail to adequately respond to rapidly changing employee expectations regarding fair compensation, an inclusive workplace, flexible working, or other matters. If we are unable to hire and retain employees capable of performing at a high-level, develop adequate training and succession plans for leadership positions, or if mitigation measures we may take to respond to a decrease in labor availability, such as overtime and third-party outsourcing, have unintended negative effects, our business could be adversely affected. \nIn addition, health care and workers’ compensation costs have been increasing. Inflationary pressures and any shortages in the labor market could continue to increase labor costs, which could have a material adverse effect on our business, financial condition, or results of operations. Our labor costs include the cost of providing employee benefits in the U.S. and foreign jurisdictions, including pension, health and welfare and severance benefits. We are in the process of terminating our pension plan for certain of our U.S. employees. The termination and settlement process preserves retirement benefits due to participants but changes the ultimate payor of such benefits. During fiscal 2026, we expect to complete the purchase of group annuity contracts that will transfer any remaining pension benefit obligation to an insurance company. The final pension settlement charges and the actual amount we will be required to contribute to the plan is dependent on various factors, including the value of plan assets, distributions paid to plan participants, and the cost to purchase annuity contracts to settle the pension obligation. Additionally, the annual costs of benefits vary with increased costs of health care and the outcome of collectively bargained wage and benefit agreements. A significant increase in our obligations could have a negative impact on our results of operations and cash flows from operations. In addition, our financial condition and ability to meet the needs of our customers could be materially and adversely affected if strikes or work stoppages or interruptions occur as a result of delayed negotiations with union-represented employees within or outside the U.S, or if we are unable to renew collectively bargained agreements on satisfactory terms as they expire. As discussed above, most of the union workers at our facilities are represented under contracts that expire at various times over the next several years. Of the hourly employees who are represented by these contracts, 65% are party to a collective \n10\nTable of Contents\nbargaining agreement currently in negotiations or scheduled to expire over the course of the next twelve months. As the agreements expire and are renegotiated, there is no guarantee that they will be renewed in a timely manner or on satisfactory terms.\nOur business, financial condition, and results of operations could be adversely affected by the political and economic conditions of the countries in which we conduct business and other factors related to our international operations, including foreign currency risks and trade barriers.\nWe conduct a substantial and growing amount of business with customers located outside the U.S. During each of fiscal 2025, 2024, and 2023, net sales outside the U.S., primarily in Australia, Canada, China, Europe, Japan, Korea, Mexico, and Taiwan, accounted for approximately 35%, 34%, and 23% of our net sales, respectively. Factors relating to our domestic and international sales and operations, many of which are outside of our control, have had, and could continue to have, a material adverse impact on our business, financial condition, and results of operations, including:\n•\nforeign exchange rates, foreign currency exchange and transfer restrictions, which may unpredictably and adversely impact our combined operating results, asset and liability balances, and cash flow in our Consolidated Financial Statements, even if their value has not changed in their original currency;\n•\nour consolidated financial statements are presented in U.S. dollars, and we must translate the assets, liabilities, revenue and expenses into U.S. dollars for external reporting purposes; \n•\nchanges in trade, monetary and fiscal policies of the U.S. and foreign governments, including modification or termination of existing trade agreements or treaties, creation of new trade agreements or treaties, trade regulations, and increased or new tariffs, sanctions, quotas, import or export licensing requirements, and other trade barriers imposed by governments;\n•\nchanges in capital controls, including currency exchange controls, government currency policies or other limits on our ability to import raw materials or finished products into various countries or repatriate cash from outside the United States;\n•\nnegative economic developments in economies around the world and the instability of governments, including the actual or threat of wars, terrorist attacks, epidemics or civil unrest, including the war in Ukraine and conflicts in the Middle East;\n•\ncurrency devaluations or fluctuations in currency values, including in developed and emerging markets, such as the highly inflationary environment in Argentina; \n•\nearthquakes, tsunamis, droughts, floods or other major disasters that may limit the supply of raw materials that are purchased abroad for use in our international operations or domestically; \n•\nvolatile commodity prices and increased costs of raw and packaging materials, labor, energy and transportation, disruptions in shipping or reduced availability of freight transportation and warehousing, such as the reduced availability of shipping containers that we encountered in fiscal 2022;\n•\npandemics and other public health crises, which may lead, and in the case of the COVID-19 pandemic, led, to measures that decrease revenues, disrupt our supply chain or otherwise increase our storage, production or distribution costs and adversely affect our workforce, local suppliers, customers and consumers of our products;\n•\ndiffering employment practices and labor standards in the international markets in which we operate; \n•\ndiffering levels of protection of intellectual property across the international markets in which we operate;\n•\ndifficulties and costs associated with complying with U.S. laws and regulations applicable to entities with overseas operations, including the Foreign Corrupt Practices Act; \n•\nthe threat that our operations or property could be subject to nationalization and expropriation; \n•\nvarying regulatory, tax, judicial and administrative practices in the international markets in which we operate;\n•\ndifficulties associated with operating under a wide variety of complex foreign laws, treaties and regulations; and \n•\npotentially burdensome taxation.\nThe nature and degree of the various risks we face can differ significantly among our regions and businesses. All these factors could result in increased costs or decreased revenues and could have an adverse effect on our business, financial condition, and results of operations.\n11\nTable of Contents\nChanges in our relationships with significant customers could adversely affect us.\nWe maintain a diverse customer base across our reporting segments. Customers include global, national and regional quick service and fast casual restaurants as well as small, independently operated restaurants, multinational, broadline foodservice distributors, regional foodservice distributors, and major food retailers. Some of these customers independently represent a meaningful portion of our sales. In addition, we depend on foodservice distributors to help us create end-customer demand, provide technical support and other value-added services to customers, fill customer orders, and stock our products. A material change in our relationship with one or more of these distributors or their failure to perform as expected could reduce our revenue. The foodservice distributors also sell products that compete with our products, and we sometimes need to reduce prices or provide rebates and other incentives to focus them on the sale of our products. \nThere can be no assurance that our customers will continue to purchase our products in the same quantities or on the same terms as in the past. The loss of a significant customer or a material reduction in sales to a significant customer could materially and adversely affect our business, financial condition, and results of operations. In addition, the financial condition of our significant customers, including restaurants, distributors and retailers, are affected by events that are largely beyond our control, such as the impacts of past and possible future pandemics or other contagious outbreaks, and political or military conflicts, such as the war in Ukraine or conflicts in the Middle East. Deterioration in the financial condition of significant customers could materially and adversely affect our business, financial condition, and results of operations.\nChanges in our relationships with our growers could adversely affect us.\nWe expend considerable resources to develop and maintain relationships with many potato growers. In some instances, we have entered into long-term agreements with growers; however, a portion of our potato needs are sourced on an annual contracted basis. To the extent we are unable to maintain positive relationships with our long-term growers, contracted growers deliver less supply than we expect, or we are unable to secure sufficient potatoes from uncontracted growers in a given year, we may not have sufficient potato supply to satisfy our business opportunities. To obtain sufficient potato supply, we may be required to purchase potatoes at prices substantially higher than expected, or forgo sales to some market segments, which would reduce our profitability. If we forgo sales to such market segments, we may lose customers and may not be able to regain or replace them later.\nDisruption of our access to export mechanisms could have an adverse impact on our business, financial condition, and results of operations.\nTo serve our customers globally, we rely primarily on our international operations, but also in part on exports from the U.S. During fiscal 2025, 2024, and 2023, export sales from the U.S. accounted for approximately 6%, 6% and 11%, respectively, of our total net sales. Circumstances beyond our control, such as retaliatory non-U.S. tariffs countermeasures, a labor dispute at a port, or workforce disruptions (such as disruptions that occurred during the COVID-19 pandemic), could prevent us from exporting our products in sufficient quantities to meet customer opportunities. For example, during the latter half of fiscal 2022, limited shipping container availability along the U.S. West Coast and disruptions to ocean freight networks across the Pacific Ocean resulted in lower export volumes in our International segment. We have access to production outside of the U.S. through our facilities in Argentina, Australia, Austria, Canada, China, the Netherlands, and the United Kingdom, but we may be unsuccessful in mitigating any future disruption to export mechanisms. If this occurs, we may be unable to adequately supply all our existing customers’ needs and new customer opportunities, which could adversely affect our business, financial condition, and results of operations.\nOur operations are dependent on a wide array of third parties. \nThe success of our end-to-end supply chain relies on the continued performance of a wide array of third parties. Suppliers, co-packers, third-party outsourcers, warehousing partners, and transportation providers are among our critical partners. Although we take steps to qualify and audit third parties with whom we do business, we cannot guarantee that all third parties will perform dependably or at all. It is possible that events beyond our control, such as operational failures, labor issues, heightened inflation, recession, financial and credit market disruptions, or other economic conditions, cybersecurity events, global geopolitical conflict, such as the war in Ukraine and conflicts in the Middle East, pandemics or other health issues, such as was the case with the COVID-19 pandemic, or other issues could impact our third parties. If our third parties fail to deliver on their commitments, introduce unplanned risk to our operations (e.g., through cyber activity), or are unable to fulfill their obligations, we could experience manufacturing challenges, shipment delays, increased costs, or lost revenue, which could also impact our relationships with customers and our brand image. \n12\nTable of Contents\nIn addition to our own production facilities, we source a portion of our products under co-packing agreements. The success of our business depends, in part, on maintaining a strong sourcing and manufacturing platform. We believe that there are a limited number of competent, high-quality co-packers in the industry, and if we were required to obtain additional or alternative co-packing agreements or arrangements in the future, we can provide no assurance that we would be able to do so on satisfactory terms or in a timely manner. Our inability to enter into satisfactory co-packing agreements could limit our ability to implement our business plan or meet customer demand.\nDamage to our reputation as a trusted partner to customers and good corporate citizen could have a material adverse effect on our business, financial condition, and results of operations.\nOur customers rely on us and our co-manufacturers to manufacture safe, high quality food products. Product contamination or tampering, the failure to maintain high standards for product quality, safety, and integrity, or allegations of product quality issues, mislabeling or contamination, even if untrue, may damage the reputation of our customers, and ultimately our reputation as a trusted industry partner. Damage to either could reduce demand for our products or cause production and delivery disruptions.\nOur reputation could also be adversely impacted by any of the following, or by adverse publicity (whether or not valid) relating thereto: the failure to maintain high ethical, social, and environmental standards for our operations and activities, including the health, safety, and security of our employees and our supply chain; our research and development efforts; our environmental impact, including use of agricultural materials, packaging, energy and water use, and waste management, and the failure to set certain goals, or to achieve any stated goals, with respect to such matters; our failure to comply with local laws and regulations; our failure to maintain an effective system of internal controls; or our failure to provide accurate and timely financial information. If we do not successfully manage ESG-related expectations across stakeholders, it could erode stakeholder trust, impact our reputation and adversely affect our business. Moreover, the growing use of social and digital media by consumers and other stakeholders has greatly increased the speed and extent that information or misinformation and opinions can be shared. Negative posts or comments about us, our brands, or our products on social or digital media could damage our reputation and our brands. Damage to our reputation or loss of customer confidence in our products for any of these or other reasons could result in decreased demand for our products and could have a material adverse effect on our business, financial condition, and results of operations, as well as require additional resources to rebuild our reputation.\nWe may not realize the anticipated cost savings and/or operating efficiencies associated with strategic initiatives, including our FY25 Restructuring Plan and recently announced Cost Savings Program.\nOur future success and earnings growth depend in part on our ability to achieve the appropriate cost structure and operate efficiently in the highly competitive industry. We continuously review our operations in an effort to pursue initiatives to reduce costs, increase effectiveness, and optimize cash flow. These initiatives may focus on opportunities to improve the procurement, manufacturing, and logistics within our supply chain as well as general and administrative processes. We may not realize all the anticipated cost savings or other benefits from such initiatives. Other events and circumstances, such as financial or strategic difficulties, delays, or unexpected costs, may also adversely impact our ability to realize all the anticipated cost savings or other benefits, or cause us not to realize such cost savings or other benefits on the expected timetable. If we are unable to realize the anticipated benefits, our ability to fund other initiatives may be adversely affected. Finally, the complexity of the implementation may require a substantial amount of management and operational resources to achieve the anticipated benefits of the initiatives. These and related demands on our resources may divert the organization’s attention from other business issues, have adverse effects on existing business relationships with suppliers and customers, and impact employee morale. Any failure or delay in implementing these initiatives in accordance with our plans could adversely affect our business, operating efficiency, and financial results.\nIn October 2024, we began implementing a restructuring plan (the “FY25 Restructuring Plan”),\n \nwhich is designed to drive operational and cost efficiencies and improve cash flows, which actions were substantially completed by the end of fiscal 2025. See Note 4, Restructuring, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for additional information on the plan. In addition, in July 2025, we announced a new cost savings program (the “Cost Savings Program”). If these initiatives do not achieve the expected financial impact in the aggregate or on the expected timeline, or if the benefits, even if achieved, are not adequate to meet our long-term growth and profitability expectations, our financial results and ability to meet our long-term growth expectations could be adversely impacted. \n13\nTable of Contents\nIf we are unable to execute on large capital projects or complete or realize the projected benefits of acquisitions, divestitures and other strategic transactions, our business, financial condition, and results of operations could be materially and adversely affected. \nTo support growth, we have invested in our production capabilities either through capital expansion or acquisitions, and are currently investing in a new processing facility in Argentina. If we are unable to complete this or other large capital projects, or encounter unexpected delays, higher costs or other challenges, including those related to supply chain disruptions and availability of necessary labor, materials, and equipment, our business, financial condition, and results of operations could be materially and adversely affected.\nIn addition, our ability to meet our objectives with respect to acquisitions and other strategic transactions may depend in part on our ability to identify suitable counterparties, negotiate favorable financial and other contractual terms, obtain all necessary regulatory approvals on the terms expected and complete those transactions. Potential risks also include:\n•\nthe inability to integrate acquired businesses into our existing operations in a timely and cost-efficient manner;\n•\ndiversion of management's attention from other business concerns;\n•\npotential loss of key employees, suppliers and/or customers of acquired businesses;\n•\nassumption of unknown risks and liabilities;\n•\nthe inability to achieve anticipated benefits, including revenues or other operating results;\n•\noperating costs of acquired businesses may be greater than expected;\n•\ndifficulties integrating personnel and financial and other systems;\n•\ninaccurate estimates of fair value made in the accounting for acquisitions and amortization of acquired intangible assets, which would reduce future reported earnings;\n•\nindemnities and potential disputes with the sellers; and\n•\nthe inability to promptly implement an effective control environment.\nIf we are unable to complete or realize the projected benefits of recent or future acquisitions, divestitures or other strategic transactions, our business, financial condition, and results of operations may be adversely impacted.\nIndustry Risks\nOur business is affected by potato crop performance.\nOur primary input is potatoes and every year, we must procure potatoes that meet the quality standards for processing into value-added products. Environmental and climate conditions, such as soil quality, moisture, and temperature, affect the yield and quality of the potato crop on a year-to-year basis. Severe weather conditions, including protracted periods of extreme heat or cold, during the planting and growing season in our potato crop regions have in the past significantly affected, and can significantly affect, potato crop performance and our operations. For example, because of the poor quality of the crop in the Pacific Northwest that was harvested in fall 2021 following the extreme heat in the summer of 2021, we encountered lower raw potato utilization rates in our production facilities, which increased our production costs. On the other hand, too much water, such as in times of prolonged heavy rainfalls or flooding, can promote harmful crop conditions like mildew growth and increase risks of diseases, as well as delay planting or affect our ability to harvest the potatoes. For example, wet conditions in Europe delayed planting in 2024. Potatoes are also susceptible to pests and diseases that can cause crop failure, decreased yields, and negatively affect the physical appearance of the potatoes. If a weather or pest-related event occurs in a particular crop year, and our agronomic programs are insufficient to mitigate the impacts thereof, we may have insufficient potatoes to meet our existing customers’ needs and new customer opportunities, or we may experience manufacturing inefficiencies and higher costs, and our competitiveness and profitability could decrease. Alternatively, overly favorable growing conditions can lead to high per acre yields and over-supply. An increased supply of potatoes could lead to overproduction of finished goods and associated increased storage costs or destruction of unused potatoes at a loss. For example, in fiscal 2025, we had an oversupply of potatoes, largely attributable to soft restaurant traffic trends in North America and other key international markets, which resulted in the write-off of excess raw potatoes that adversely affected our financial results.\n14\nTable of Contents\nIn addition, ideal growing conditions for the potatoes necessary for our value-added products (e.g., french fries) are concentrated in a few geographic regions globally. As a result, we source potatoes from specific regions of the U.S. and specific countries abroad, including Argentina, Australia, Austria, Belgium, Canada, China, France, Germany, the Netherlands, and the United Kingdom, where we believe the optimal potato growing conditions exist. Unfavorable crop conditions in any one region have led at times, and could lead, to significant demand on the other regions for production. Our inability to mitigate any such conditions by leveraging our production capabilities in other regions could negatively impact our ability to meet existing customers’ needs and new customer opportunities and could decrease our profitability. See also “- Legal and Regulatory Risks - Climate change, or legal, regulatory, or market measures to address climate change, may negatively affect our business and operations,” in this",
    "item1a": "Item 1A. Risk Factors\n–\nTechnology Risks” of this Form 10-K for additional discussion of cybersecurity risks and potential related impacts on the Company. \nCorporate Governance \nOur Board has ultimate oversight of cybersecurity risk, which we manage as part of our ERM program. This program is utilized in making decisions with respect to company priorities, resource allocations, and oversight structures. \nThe Board is assisted by the Audit Committee, which regularly reviews our cybersecurity program with management and reports to the Board on its activities on a quarterly basis or more frequently as warranted.\n \nOur cybersecurity program is managed by our interim \nChief Information Security Officer (“CISO”), who reports to our Chief Information Officer (“CIO”)\n. Our CISO is informed about and monitors prevention, detection, mitigation, and remediation efforts through regular communication and reporting from professionals in the Company’s information security team, many of whom hold cybersecurity certifications such as a Certified Information Systems Security Professional or Certified Information Security Manager, and through the use of technological tools and software and results from third-party audits. Our CISO has extensive experience assessing and managing cybersecurity programs and cybersecurity risk. \nOur CISO has served in this position since March 2025 and has over 20 years of experience in information security. His background includes technical experience, strategy and architecture focused roles, governance, risk, and compliance roles, secure application development and implementation roles, cyber and threat experience, and various leadership roles in several areas of information technology. Our CIO joined the Company in May 2025 with 35 years of experience in information technology roles, including implementing new information security teams on a global scale and overseeing information technology teams in multiple industries, including wholesale distribution, retail, manufacturing, finance, and information technology services, leading new global software development, and establishing global information security standards for his previous company.\nOur CISO and CIO regularly update the Audit Committee on the Company's cybersecurity programs, policies, and practices as warranted, including review of the state of the Company's cybersecurity programs and risks, emerging cybersecurity developments, threats and vulnerability, and the Company's strategy and key cybersecurity initiatives designed to improve the Company’s risk posture.\n In addition, we have an escalation process in place to inform senior management and the Board of material cyber-related issues. \nThe Audit Committee also reviews with our CIO, on an annual basis, our global information technology structure and strategic efforts to protect, optimize, and support the growth of the Company. \nThe Chair of the Audit Committee reports to the full Board on its activities.\n \n23\nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy \nWe assess, identify, and manage material risks from cybersecurity threats through our cybersecurity risk management program. \nThis program includes cybersecurity policies, standards, and procedures, a cybersecurity incident response plan, regular risk assessments, including as part of our annual enterprise risk management (“ERM”) assessment, testing of the Company’s internal infrastructure to identify vulnerabilities, cybersecurity insurance, procedures for recovering from disruptions to our operations, workforce cybersecurity trainings, and third-party assessments and programs.\n We maintain a cybersecurity incident response plan to help enable timely, consistent responses to actual or attempted cybersecurity incidents impacting the Company.\n This plan provides guidance to address the overall coordination of our response to a cybersecurity crisis and plan for resources, actions, and decisions we may need to be prepared for; a communication plan for timely and accurate dissemination of evolving information to stakeholders during the crisis; and business continuity plans that document strategies and measures to enable core business activities to continue during a cybersecurity event. To support our cybersecurity incident response plan, we conduct exercises simulating cybersecurity incidents to educate and train our management on response capabilities and inform adjustments to our controls and response. \nWe have engaged third-party cybersecurity firms to advise on these exercises.\n The status and ongoing enhancement of our cybersecurity risk management program is reported to senior management, as well as the Audit Committee of our Board, on a quarterly basis, or more frequently as warranted.\nAs part of our broader risk management and control framework, we have implemented cybersecurity controls over the information technology and process control systems of the Company\n \nand of our third-party service providers, to support the oversight, identification, and remediation or mitigation of risks from cybersecurity threats. We engage third-party organizations to assess the controls around sensitive data, including but not limited to financial, employee, customer, and vendor data as well as data affecting our process controls and data used to operate our manufacturing facilities. As part of our cybersecurity risk management program, we conduct information security and data protection training for employees, including training on matters such as phishing, social engineering, cybersecurity awareness, and email security best practices. In addition, we work with third-party providers to undertake penetration testing and maturity assessments of the Company’s information security program based on the National Institute of Standards and Technology cybersecurity framework. With respect to third-party service providers, we perform information security assessments and due diligence reviews prior to entering into a contractual agreement. Further, after engagement, \nwe periodically perform information security assessments of certain third-party service providers that we consider critical to our operations. In addition, in new or amended supplier contracts, we look to include provisions that require the suppliers to maintain an effective information \n22\nTable of Contents\nsecurity management program and to notify us in the event of a known or suspected cyber incident. For suppliers with required access to our data or systems, a cybersecurity risk assessment is performed to identify potential risk to Company systems or data.\n If risks are identified, we implement measures to mitigate or remediate the risk and, in cases where we cannot do so effectively, we will not grant access to our data or systems to the supplier. We also consult with external advisors and specialists, as necessary, regarding opportunities and enhancements to strengthen our cybersecurity practices and policies and implement enhancements to our cybersecurity capabilities based on evolving threats.\nWhile we have experienced threats to our data and systems, to date, we are not aware of a cybersecurity incident being experienced by the Company that had, or is reasonably likely to have, a material impact on our business or operations;\n however, because of frequently changing attack techniques and the increased volume and sophistication of the attacks, there is the potential for the Company to be adversely impacted. This impact could result in reputational, competitive, operational, or other business harm as well as financial costs and regulatory action. See “"
  }
}