{
  "ticker": "MA",
  "cik": "0001141391",
  "company_name": "Mastercard Inc",
  "filing_date": "2025-02-12",
  "accession": "0001141391-25-000011",
  "primary_doc": "ma-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nItem 1. Business\nOverview\nMastercard is a technology company in the global payments industry.  We connect consumers, financial institutions, merchants, governments, digital partners, businesses and other organizations worldwide by enabling electronic payments and making those payment transactions secure, simple, smart and accessible.  We make payments easier and more efficient by providing a wide range of payment solutions and services using our family of well-known and trusted brands, including Mastercard®, Maestro® and Cirrus®.  We operate a payments network that provides choice and flexibility for consumers, merchants and our customers.  Through our unique and proprietary global payments network, we switch (authorize, clear and settle) payment transactions.  We have additional payments capabilities that include automated clearing house (“ACH”) transactions (both batch and real-time account-based payments).  Using these capabilities, we offer consumer and commercial payment products, capture new payment flows and provide services and solutions.  These services and solutions include, among others, security solutions, consumer acquisition and engagement services, and business and market insights, all of which draw on our principled and responsible use of secure data\n.\n  Our capabilities strengthen, reinforce and complement each other and are fundamentally interdependent.  For our global payments network, our franchise model sets the standards and ground-rules that balance value and risk across all stakeholders and allows for interoperability among them.  We employ a multi-layered approach to help protect the global payments ecosystem in which we operate.\nFor a full discussion of our business, please see page 10.\nOur Performance\nThe following are our key financial and operational highlights for 2024, including growth rates over the prior year:\nGAAP\nNet revenue\nNet income\nDiluted EPS\n$28.2B\n$12.9B\n$13.89\nup 12%\nup 15%\nup 17%\nNon-GAAP \n1\n (currency-neutral)\nAdjusted net revenue\nAdjusted net income\nAdjusted diluted EPS\n$28.2B\n$13.5B\n$14.60\nup 13%\nup 18%\nup 21%\n$13.4B\n$11.0B\nRepurchased shares\n$14.8B\nin capital returned\n \nto stockholders\n$2.4B\nDividends paid\ncash flows\n \nfrom operations\nGross dollar volume\n(growth on a local currency basis)\nCross-border volume growth \n(on a local currency basis)\nSwitched transactions\n$9.8T\nup 18%\n159.4B\nup 11%\nup 11%\n1\nNon-GAAP results (including growth rates) exclude the impact of gains and losses on equity investments, Special Items and/or foreign currency.  See “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Financial Results Overview” in Part II, Item 7 for the reconciliation to the most direct comparable GAAP financial measures.\n \n6\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\nThe following chart provides gross dollar volume (“GDV”) and number of cards featuring our brands in 2024 for select programs and solutions:\nGDV\nCards\nYear Ended December 31, 2024\nAs of December 31, 2024\nMastercard-branded Programs \n1\n(in billions)\n% Increase from \nDecember 31, 2023  (Local)\n% of Total GDV\n(in millions)\n% Increase from \nDecember 31, 2023\n    Consumer Credit\n$\n3,634 \n9 \n%\n37 \n%\n1,070 \n5 \n%\n    Consumer Debit and Prepaid \n2\n4,865 \n12 \n%\n50 \n%\n1,935 \n9 \n%\n    Commercial Credit and Debit\n1,258 \n11 \n%\n13 \n%\n153 \n10 \n%\n1\nExcludes Maestro and Cirrus cards and volume generated by those cards.\n2\nPrepaid includes both consumer and commercial prepaid.\nFor a full discussion of our results of operations, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item II, Part 7. \nOur Strategy\nOur strategy centers on growing our core, diversifying our customers and geographies and building new areas for the future through a combination of organic and inorganic strategic initiatives.  We are executing on this strategy through a focus on three priorities: \n•\nconsumer payments\n•\ncommercial and new payment flows\n•\nservices and other solutions \nOur priorities strengthen, complement and reinforce each other and are fundamentally interdependent.  \nOur Strategy\nGrow\n our core\nDiversify\n into new customers and geographies\nBuild\n \nnew areas for the future\nOur Strategic Priorities\nConsumer payments\nCommercial and new payment flows\nServices and other solutions\nEnabled by\nPeople\nBrand\nData & AI\nTechnology\nFranchise\nDoing well by doing good\n \nMASTERCARD 2024 FORM 10-K     \n7\nPART I\nITEM 1. BUSINESS\nOur Strategic Priorities\nConsumer payments. \n We focus on enabling consumer payments, providing consumers with choice and flexibility to transact across multiple payment rails (including cards, real-time payments and account-based transactions), while ensuring that all payments are safe, secure and seamless.  We do so by:\n•\nCapturing the significant secular opportunity\n \nof cash displacement by increasing acceptance through advancing technology and partnering with players across the payments ecosystem, as well as by opening up closed-loop and domestic networks.  We also pursue incremental volume and transactions by extending our reach across under-penetrated card verticals (such as bill pay) and real-time account-based payments\n•\nDriving brand preference through compelling consumer experiences\n by offering relevant value propositions to consumers (including features, benefits and experiences), providing comprehensive digital functionality (such as Digital First), delivering enhanced security and functionality (increasing tokenization, scaling authentication and streamlining online checkout) and driving increased approval, spend and activation rates\n•\nInvesting in the future and driving market transformation\n \nby extending the reach of our network to enable the tokenization of credentials, identities, assets and data and the exchange of those items between counterparties (providing security, privacy and control).  We also seek to achieve this transformation by modernizing our card switch to meet evolving needs \nCommercial and new payment flows.\n  We focus on capturing opportunities in commercial payments (both point-of-sale purchases and invoiced payments) and disbursements and remittances (specifically, through Mastercard Move, our collection of money movement capabilities that provides solutions for money transfers to consumers from consumers, businesses or governments).  We do so by:\n•\nAccelerating secular shift in commercial point-of-sale purchases\n \nby offering differentiated propositions across cards and platforms (both corporate and small business solutions, including expense management, reporting, reconciliation and data insights); expanding distribution of our point-of-sale offerings across financial institutions, new geographies, new channels and small businesses; and growing acceptance\n•\nCapturing commercial invoiced payments\n by driving engagement across buyers and suppliers to, among other things, simplify workflows, release working capital and improve data reconciliation to reduce end-to-end costs; building on our travel offerings to expand into additional select verticals (including business-to-business (“B2B”) marketplaces, trade and logistics, healthcare, consumer packaged goods and pharmaceuticals); and embedding payments into widely used platforms and workflows \n \n•\nModernizing disbursements and remittances\n by utilizing Mastercard Move to scale use cases across senders (including consumers, businesses and governments) and receiving consumers (both domestic and cross-border) and expand money movement across our global network of financial institution partners\nServices and other solutions.\n  Our services and other solutions, which are interdependent with our payment network, drive value for our customers and the broader payments ecosystem.  We offer security solutions, consumer acquisition and engagement, business and market insights, gateway, processing and open banking, among other services and solutions (including ACH batch and real-time account-based payments and solutions).\n \nAs we drive value, our services and other solutions generate revenue while helping to accelerate our overall financial performance.  We do so by:\n•\nDifferentiating our payments capabilities\n by combining our wide range of services and solutions in various ways to meet the needs and priorities of our\n \npartners, which helps drive market wins and payments growth \n•\nEnhancing and expanding our suite of services\n to better serve our existing customers, including across new buying centers and new capability areas, as well as to reach new customers \n•\nScaling distribution\n by using our technology platforms to enable us to switch more transactions and deliver more services per transaction, selling directly to customers through a dedicated sales force and global account teams, and embedding services with partners (such as tech platforms, system integrators, processors and other networks) to deliver those services at scale\n \n8\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\nOur priorities are fundamentally interdependent and strengthen, reinforce and complement each other.  \n      \n•\nOur payments network helps us scale our services and solutions, and those services and solutions help us differentiate our payments solutions\n•\nWe grow in payments, which allows us to switch more transactions and bring more transaction data onto the network\n•\nWe use that data to create insightful services and solutions that can, in turn, help us win new and renewed customer deals and drive greater payments volume growth\nEnabling Our Success\nThese priorities are supported by six enablers:\nPeople.\n  Our success is driven by the skills, experience, integrity and mindset of our people.  We attract, develop and retain top talent, in alignment with our strategic priorities.  Our winning culture is guided by the Mastercard Way, which outlines the behaviors we expect from employees to deliver for our customers and one another.  We foster a working environment that benefits and provides equal opportunities for all of our employees, where people have opportunities to perform purpose-driven work that advances our business objectives by delivering a positive impact on communities, customers and co-workers across the globe.\nBrand.  \nOur brands and brand identities serve as a differentiator for our business, representing our values and enabling us to accelerate growth in new areas. \nData and AI.  \nWe create a range of products and services for our customers using our data and artificial intelligence (“AI”) assets, technology, platforms and expertise.  We follow our Data and Tech Responsibility Principles in how we design, implement and deliver those solutions.  Our Privacy by Design, Data by Design and AI Governance processes are designed to ensure we embed multiple layers of privacy, data protection and information security controls in all our products and services, keeping a clear focus on protecting customers’ and individuals’ data and privacy. \nTechnology. \n Our technology provides resiliency, scalability and flexibility in how we serve customers.  It unlocks broader reach to scale digital payment services to multiple channels.  Utilizing our technology standards, services and governance model, we connect financial institutions, financial technology companies (fintechs) and others, enabling interoperability and allowing consumers, businesses, governments and merchants to engage through digital channels.\nFranchise.  \nWe manage an ecosystem of stakeholders who participate in our global payments network.  Our franchise model creates and sustains a comprehensive series of value exchanges across our ecosystem.  We provide a balanced ecosystem where all participants benefit from the availability, innovation and safety and security of our network.  Our franchise model enables the scale of our network and provides a single governance structure for its operation.  This structure has the potential to be extended to new opportunities.  \nDoing Well by Doing Good.\n  Sustainable impact is fundamental to our business strategy.  We leverage our employees, technology, resources, partnerships and expertise to address social, economic and environmental challenges, while at the same time creating markets for future growth and driving long-term value for stockholders.  Our environmental, social and governance priorities are expressed through three pillars - People, Prosperity, Planet - and all of the work we do is grounded in strong governance principles.  For more information, please reference our most recently published Environmental, Social and Governance Report located on our website.   \n \nMASTERCARD 2024 FORM 10-K     \n9\nPART I\nITEM 1. BUSINESS\nOur Business\nOur Payments Capabilities \nWe enable a wide variety of payments capabilities (including products, services and solutions) over our network among account holders, merchants, financial institutions, businesses, governments and others, offering our customers one partner for their payment needs.  \nPayment Network\nOur payment network links issuers and acquirers around the globe to facilitate the switching of transactions, permitting account holders to use our products at approximately 150 million acceptance locations and over 250 million digital access points worldwide.  This network facilitates an efficient, safe and secure means for making and receiving payments, a convenient, quick and secure payment method for consumers to access their funds and a channel for businesses to receive insight through information that is derived from our network.  We enable transactions for our customers through our payment network in more than 150 currencies and in more than 220 countries and territories.  \nPayment Network Transactions.\n  Our payment network supports what is often referred to as a “four-party” payments network and includes the following participants: account holder (a person or entity who holds a card or uses another device enabled for payment), issuer (the account holder’s financial institution), merchant and acquirer (the merchant’s financial institution).  \nWe do not issue cards, extend credit, determine or receive revenue from interest rates or other fees charged to account holders by issuers, or establish the rates charged by acquirers in connection with merchants’ acceptance of our products.  In most cases, account holder relationships belong to, and are managed by, our customers. \nThe following graphic depicts a typical transaction on our payment network and our role in that transaction, which includes services and other solutions and payments ecosystem security:\nIn a typical transaction, an account holder purchases goods or services from a merchant using one of our payment products.  After the transaction is authorized by the issuer, the issuer pays the acquirer an amount equal to the value of the transaction, minus the interchange fee (described below) and other applicable fees, and then posts the transaction to the account holder’s account.  The acquirer pays the amount of the purchase, net of a discount (referred to as the “merchant discount” rate), to the merchant.\n•\nInterchange Fees.\n  Interchange fees reflect the value merchants receive from accepting our products and play a key role in balancing the costs and benefits that consumers and merchants derive.  Generally, interchange fees are collected from acquirers and paid to issuers to reimburse the issuers for a portion of the costs incurred.  These costs are incurred by issuers in providing services that benefit all participants in the system, including acquirers and merchants, whose participation in the network enables increased sales to their existing and new customers, efficiencies in the delivery of existing and new products, guaranteed payments and improved customer experience.  We (or, alternatively, financial institutions) establish “default interchange fees” that apply when there are no other established settlement terms in place between an issuer and an acquirer.  We administer the collection and remittance of interchange fees through the settlement process.\n \n10\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\n•\nAdditional Four-Party System Fees.\n \n The merchant discount rate is established by the acquirer to cover its costs of both participating in the four-party system and providing services to merchants.  The rate takes into consideration the amount of the interchange fee which the acquirer generally pays to the issuer.  Additionally, acquirers may charge merchants processing and related fees in addition to the merchant discount rate.  Issuers may also charge account holders fees for the transaction, including, for example, fees for extending revolving credit. \nSwitched Transactions \n•\nAuthorization, Clearing and Settlement.\n  Through our payment network, we enable the routing of a transaction to the issuer for its approval, facilitate the exchange of financial transaction information between issuers and acquirers after a successfully conducted transaction, and settle the transaction by facilitating the exchange of funds between parties via settlement banks chosen by us and our customers.\n•\nCross-Border and Domestic. \n Our payment network switches transactions throughout the world when the merchant country and country of issuance are different (“cross-border transactions”), providing account holders with the ability to use, and merchants to accept, our products and services across country borders.  We also provide switched transaction services to customers where the merchant country and the country of issuance are the same (“domestic transactions”).  We switch approximately 70% of all transactions for Mastercard and Maestro-branded cards, including nearly all cross-border transactions.\nKey 2024 Developments\n•\nIn 2024, we began processing domestic transactions in China through our joint venture.  Mastercard-branded cards are now accepted for both domestic and cross-border purchases.\nWe guarantee the settlement of many of the transactions from issuers to acquirers to help ensure the integrity of our payment network.  We refer to the amount of this guarantee as our settlement exposure.  We do not, however, guarantee payments to merchants by their acquirers or the availability of unspent prepaid account holder account balances.\nPayment Network Architecture. \n Our payment network features a globally integrated structure that provides scale for our issuers, enabling them to expand into regional and global markets.  It is based largely on a distributed (peer-to-peer) architecture that enables the network to adapt to the needs of each transaction.  The network accomplishes this by performing intelligent routing and applying multiple services (such as fraud scoring, tokenization services, etc.) to appropriate transactions in real time.  This architecture enables us to connect all parties regardless of where or how the transaction is occurring.  It has 24-hour a day availability and world-class response time.\nAccount-Based Payments Capabilities\nWe offer ACH batch and real-time account-based payments capabilities, enabling payments for ACH transactions between bank accounts in real-time.  Our real-time account-based payments capabilities provide consumers and businesses the ability to make instant (faster) payments while providing enhanced data and messaging capabilities.  We build, implement, enhance and operate real-time clearing and settlement infrastructure, payment platforms and direct debit systems for jurisdictions globally.  We operate real-time payments infrastructure in several countries around the world.  We also use our real-time account-based payments capabilities to enable consumers, businesses, governments and merchants to send and receive money directly from account to account.  \nWe discuss below under “Our Payment Products and Applications” the ways in which we apply our real-time account-based payments capabilities to capture new payment flows. \nSecurity and Franchise\nPayments Ecosystem Security. \n We employ a multi-layered approach to help protect the global payments ecosystem, including a robust program designed to protect our network from cyber and information security threats.  Our network and platforms incorporate multiple layers of protection, providing greater resiliency and security protection.  Our programs are assessed by third parties and incorporate benchmarking and other data from peer companies and consultants.  We engage in many efforts to mitigate information security challenges, including maintaining an information security program, an enterprise resilience program and insurance coverage, as well as regularly testing our systems to address potential vulnerabilities.  We work with experts across the organization (as well as through other sources such as public-private partnerships) to monitor and respond quickly to a range of cyber and physical threats, including threats and incidents associated with the use of services provided by third-party providers.\n \nMASTERCARD 2024 FORM 10-K     \n11\nPART I\nITEM 1. BUSINESS\nAs another feature of our multi-layered approach, we work with issuers, acquirers, merchants, governments and payments industry associations to develop and put in place technical standards for safe and secure transactions, and we provide solutions and products that are designed to help provide safety and security for the global payments ecosystem.  Our approach includes supporting small businesses by sharing best practices and providing access to free utilities and services, benefiting both them and the entire payments ecosystem.  We discuss specific security solutions that we offer to our customers below under “Services and Other Solutions”. \nOur Franchise.\n  We manage an ecosystem of stakeholders that participate in our global payments network, setting standards and rules for all participants and aiming to ensure interoperability among them while balancing risk and value across all stakeholders.  Our franchise model achieves this by creating and sustaining a comprehensive series of value exchanges across our ecosystem.  Through our franchise model, we work to ensure a balanced ecosystem where all participants may benefit from the availability, innovation, safety and security of our network.  We achieve this goal through the following key activities: \n•\nParticipant Onboarding.\n \nWe determine that each new customer meets the necessary prerequisites to use and contribute to our network by defining clear ecosystem roles and responsibilities for their operations\n•\nOperating Standards.\n \nWe define the technical, operational and financial standards that all network participants are required to uphold\n•\nSafety and Security.\n \nWe establish central principles, including safeguarding consumer protections and integrity, so participants feel confident to transact on the network \n•\nResponsible Stewardship.\n \nWe set performance standards to support ecosystem optimization and growth and use proactive monitoring designed to both ensure participant adherence to operating standards and protect the integrity of the ecosystem\n•\nIssue Resolution.\n \nWe operate a framework to address disputes between our network participants\nOur Payment Products and Applications \nConsumer Payments \nWe provide a wide variety of products and services that support payment products that customers can offer to consumers and merchants.  These offerings facilitate transactions across our payments network and platforms among account holders, merchants, financial institutions, digital partners, businesses, governments and other organizations in markets globally.  \nConsumer Credit.\n  We offer products that enable issuers to provide consumers with credit, allowing them to defer payment.  These programs are designed to meet the needs of our customers around the world and address standard, premium and affluent consumer segments.\nHow We Benefit Consumers\nWe enable our customers to benefit consumers by:\n•\nmaking electronic payments more convenient, secure and efficient\n•\ndelivering better, seamless consumer experiences\n•\nproviding consumers choice, empowering them to make and receive payments in the ways that best meet their daily needs\n•\nprotecting consumers and all other participants in a transaction, as well as consumer data\n•\nproviding loyalty rewards and benefits\nConsumer Debit. \n We support a range of payment products and solutions that allow our customers to provide consumers with convenient access to funds in deposit and other accounts.  Our debit and deposit access programs can be used to make purchases and to obtain cash from bank branches, at ATMs and, in some cases, at the point of sale.  Our branded debit programs consist of Mastercard (including standard, premium and affluent offerings), Maestro (our PIN-based solution that operates globally) and Cirrus (our primary global cash access solution).\nPrepaid. \n Prepaid accounts are a type of electronic payment that enables consumers to pay from pre-funded accounts whether or not they previously had a bank account or a credit history.  These accounts can be tailored to meet specific program, customer or consumer needs, such as paying bills, sending person-to-person payments or withdrawing cash from an ATM.  Our focus ranges from digital accounts (such as fintech and gig economy platforms) to business programs such as employee payroll, health savings accounts and solutions for small business owners.  Our prepaid programs also offer opportunities in the private and public sectors to drive financial inclusion of previously unbanked individuals through social security payments, unemployment benefits and salary cards.\nConsumer Bill Payments.  \nOur solutions enable consumers and small businesses to pay their billers in a seamless and secure way, providing an experience that offers flexibility and benefits consumers, financial institutions and billers.  Utilizing our merchant acceptance network (which includes many billers), we offer consumers the choice of paying their bills in a convenient and secure manner using credit, debit or prepaid as well as account-based payments methods.  \n \n12\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\nCommercial and New Payment Flows \nWe offer platforms, products and applications that apply our payments capabilities to capture commercial and new payment flows, enabling us to serve the needs of a significant addressable market.\nCommercial\nWe offer commercial credit, debit and prepaid payment products and solutions that meet the payment needs of large corporations, midsize companies, small businesses and government entities at the point of sale.  Our point-of-sale solutions streamline procurement and payment processes, manage information and expenses (such as travel and entertainment) and reduce administrative costs.  Our point-of-sale offerings include: \n•\nSmall business cards (credit, debit and prepaid) tailored to small and medium businesses\n•\nCommercial travel and entertainment, procurement and fleet cards, consisting mostly of credit cards and associated platforms for corporations to manage travel and expense, procurement and fleet expenses.  Our Mastercard Smart Data™ platform provides expense management and reporting capabilities.\nWe also offer solutions that enable businesses or governments to make invoiced payments to businesses with whom they have a trusted relationship for goods and services.  As part of our solutions, we offer a platform to optimize supplier payment enablement campaigns for financial institutions.\nAcross both point-of-sale and invoiced payments, we offer a Virtual Card Number (VCN) solution, which is generated dynamically from a physical card and leverages the credit limit of the funding account.  Our VCN solution may include the use of Mastercard In Control™, our virtual card platform that allows buyers to pay suppliers using a one-time use card number that can be set with transaction level controls, providing unmatched configurability, flexibility and control over spending.\nKey 2024 Developments\nIn 2024, we continued to drive VCN adoption by: \n•\nIntegrating for corporate payers our VCN solution into several third-party technology platforms to help streamline and automate card-based payment processes.  \n•\nOffering suppliers Mastercard Receivables Manager, a platform that helps automate the process of receiving payment by virtual card and can enable the provision of enhanced data to support reconciliation. \n•\nProviding companies of all sizes the ability to include a virtual card in a digital wallet, enabling a consumer-like experience for business payments and providing robust spend controls.\nDisbursements and Remittances\nThrough our Mastercard Move platform, we enable consumers, businesses, governments and merchants to send and receive money domestically and across borders to consumers with greater speed and ease, with a payout reach of more than 10 billion endpoints globally across multiple channels, and in more than 60 originating countries and 155 receiving countries: \n \n•\nWe partner with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers.  \n•\nWe partner with central banks, fintechs and financial institutions to help governments and nonprofits more efficiently enable, as applicable, distribution of social and economic assistance and business-to-consumer (“B2C”) disbursements across various use cases (such as wallet funding, cash payouts, gig worker payouts and insurance claims).\n•\nWe enable a wide range of cross-border payment flows and use cases to customers (including trade payments, remittances and disbursements).  These flows are enabled via a distribution network with a single point of access that allows financial institutions, fintechs and digital partners to send and receive money globally through multiple channels, including bank accounts, mobile wallets, cards and cash payouts.\nKey 2024 Developments\n•\nIn 2024, we launched our Alias-Based Remittances and Payouts platform, which is designed to remove the friction of manually capturing required information to complete cross-border remittances and disbursements.  The solution simplifies the experience for both senders and receivers by using a beneficiary’s existing alias (such as their phone number or email) instead of requiring senders to ask for personal information or manually entering such information into numerous fields in order to make cross-border payments.\n \nMASTERCARD 2024 FORM 10-K     \n13\nPART I\nITEM 1. BUSINESS\nBenefiting and Innovating the Payments Ecosystem\nWe provide functionality and technology to help our customers provide benefits and experiences for consumers, merchants, businesses and others.  \n•\nDelivering digital functionality and consumer experiences.\n \nWe use our technologies and security protocols to develop solutions to make digital shopping and selling experiences, such as on smartphones and other connected devices (both online and in person), simpler, faster and safer for consumers, businesses and merchants.  We also offer products that make it easier for merchants to accept payments and expand their customer base.\n◦\nOur contactless payment solutions help deliver a simple and intuitive way to pay.  Solutions such as SmartPOS and SoftPOS reduce the barrier to entry for merchants (including small businesses).  Our Tap on Phone acceptance technology enables businesses of all sizes to accept payments from any contactless card or mobile wallet directly from their device, providing a turnkey and cost-effective solution without any additional hardware required.  We extend our contactless payment solutions to a wide set of commerce use-cases, including instant provisioning of a card into a mobile wallet, verification of a transaction and sending money to family and friends or between businesses.\nKey 2024 Developments\nIn 2024, we reached significant milestones with our contactless, Click to Pay and tokenization efforts: \n•\nContactless payments now represent approximately 70% of all in-person purchase transactions on Mastercard-branded cards\n•\nClick to Pay transactions almost doubled year-over-year\n•\nApproximately 30% of all Mastercard transactions are now tokenized\n•\nOur Mastercard Digital First™ program enables our issuing customers to offer their cardholders a fully digital payment experience with an optional physical card, meeting cardholder expectations of immediacy, safety and convenience during card application, authentication and instant card access, securing purchases (whether contactless, in-store, in-app or online) and managing alerts, controls and benefits.\n◦\nOur Click to Pay checkout experience is designed to provide consumers convenience and security in a digital environment, make it easier for merchants to implement secure digital payments and provide issuers with improved fraud detection and prevention capabilities.  This experience enables a faster, more secure checkout experience across internet and mobile sites, mobile apps and connected devices.  \n•\nEnhancing security and effectiveness of transactions.\n \n We focus on securing transactions by replacing card numbers with secure tokens, scaling Mastercard Authentication (including enabling device-based biometrics, such as fingerprints or facial scans, through Mastercard Payment Passkey Service) and streamlining online checkout by eliminating manual entry (through Click to Pay and Secure Card on File).  We aim to improve the effectiveness of those transactions by increasing the number of transactions we switch through our differentiated services, increasing approval rates by utilizing inputs from our network and lifting spend and activation rates through personalized campaigns and data-driven strategies.\n•\nCreating solutions to unlock new blockchain-based business models.\n  Through a principled approach (including applying prudent risk management practices and maintaining continuous monitoring of our partners that are active in the digital asset market), we are focused on supporting blockchain ecosystems and digital currencies.  We integrate with financial institutions using the Mastercard Multi-Token Network™ to enable programmable payments, which helps make transactions within blockchain ecosystems more secure, scalable and interoperable.  We work with a wide range of crypto players to enable consumers to buy cryptocurrencies on card and spend those balances anywhere our brands are accepted.   \n•\nSimplifying access to, and integration of, our digital assets. \n Our Mastercard Developer platform makes it easy for customers and partners to leverage our many digital assets and services.  By providing a single access point with tools and capabilities to find APIs across a broad range of Mastercard services, we enable easy integration of our services into new and existing solutions.\n•\nIdentifying and experimenting with future technologies, start-ups and trends.\n \n Through Mastercard Foundry, we continue to provide customers and partners access to thought leadership, innovation methodologies, new technologies and relevant early-stage fintech players.\n \n14\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\nOur Services and Other Solutions\nWe offer an expansive and diversified portfolio of services and solutions built on unique and proprietary data sets and supported by global consulting and advisory expertise.  These services and solutions help to differentiate our payments products and serve the needs of sizeable addressable markets beyond payments. \nSecurity Solutions\nWe offer products and services designed to safeguard the payments ecosystem from fraud and cyber-attacks and to enhance security for payments across card and non-card rails.  Our security solutions suite provides organizations with the ability to adapt to the dynamic and multifaceted nature of threats while maintaining continuity and confidence in their operations.  This includes: \nKey 2024 Developments\n•\nWe completed our acquisition of Recorded Future, a global threat intelligence company, which adds threat intelligence capabilities to our identity, fraud prevention, real-time decisioning and cybersecurity services.\n•\nWe launched Decision Intelligence Pro, the next generation of our Decision Intelligence™ real-time fraud solution.  This enhancement, which leverages generative AI techniques to produce additional data points to help assess the validity of a transaction, boosts fraud detection rates. \n•\nWe acquired subscription management capabilities that complement our existing offerings to provide consumers with greater clarity and control of their finances. \n•\nPrevention\n solutions designed to help customers establish and strengthen measures that keep systems, applications and data secure from potential security risks.  We continue to grow global usage of EMV chip and contactless security technology, helping to reduce fraud.  We also utilize our technology to evaluate and continuously monitor the cybersecurity posture of organizations worldwide, offering insights into potential vulnerabilities and risks.\n•\nIdentification\n solutions designed to help banks and merchants verify identities and authenticate consumers during digital interactions like account openings, account access and money movements using identity data and identity signals, device intelligence, biometric technologies and behavioral user data assessments. \n•\nDetection\n solutions designed to both spot and take action to stop fraudulent behavior and cyber-attacks.  Our offerings include fraud scoring technology that scans billions of transactions each day while increasing approvals and reducing false declines, alerts when accounts are exposed to data breaches or security incidents, and network-level monitoring on a global scale to help detect the occurrence of widespread fraud attacks when a customer may be unable to detect or defend against them.\n•\nBusiness continuity\n solutions designed to enable uninterrupted commerce, fostering trust and reliability for both merchants and consumers.  These solutions include Mastercard’s Stand-In processing, which is designed to ensure transaction continuity when a card issuer’s systems are unavailable.  This solution provides a backup mechanism to authorize transactions on behalf of the issuer based on predefined rules and risk parameters. \nTo deliver effective security solutions, we harness our proprietary data assets, combined with our AI, data analytics and cyber risk assessment capabilities.\nAt the core of our security solutions suite is a focus on delivering an exceptional payments experience.  Our solutions are designed to ensure that approvals of legitimate transactions are boosted and transactions flow more smoothly.  Our solutions are also designed so that the consumer bears no responsibility (or “zero liability”) for counterfeit or lost card losses in the event of fraud, increasing consumer confidence.  In addition, our solutions further enhance the consumer experience by providing effective dispute resolution, subscription controls and transparency through digital receipts.\nConsumer Acquisition and Engagement Services\nWe offer solutions that drive customer acquisition, increased activation, deepened engagement, and loyalty, delivering results to customers globally.  Offerings within this area include:  \n•\nMarketing services\n, \nwhich drive business growth and profitability through end-to-end, data- and technology-driven marketing.  We advance our customers’ growth by helping them to acquire new customers, as well as increase engagement with existing customers, through a curated set of direct marketing solutions and strategies.  We focus on business outcomes and combine our proprietary data and insights with our marketing expertise to create innovative solutions that span the entire customer lifecycle, from brand design and product adoption to customer retention and portfolio optimization.  Our end-to-end approach is built on collaboration with our customers and partners to constantly optimize marketing performance and deliver results.\n \nMASTERCARD 2024 FORM 10-K     \n15\nPART I\nITEM 1. BUSINESS\n•\nPersonalization\n \nservices\n, which leverage AI to help businesses provide personalized digital experiences for their customers.  Our personalization platform and decision engine delivers product recommendations, offers and content to consumers across digital channels.  \n•\nIssuer and merchant loyalty\n \nservices\n.\n \n \nWe have built a scalable rewards platform that enables issuers to provide consumers with a variety of benefits and services, such as personalized offers and rewards, access to a global airport lounge network, concierge services, insurance services, emergency card replacement, emergency cash advances and a 24-hour account holder service center.  For merchants, we provide campaigns with targeted offers and rewards, management services for publishing offers, and accelerated points programs for co-brand and rewards program members.  We also provide a loyalty platform that enables stronger relationships with retailers, restaurants, airlines and consumer packaged goods companies by creating experiences that drive loyalty and impactful consumer engagement.\nBusiness and Market Insights\nWe offer solutions that provide organizations with targeted data-powered solutions, insights, and advisory services in order to drive confident decision-making for better outcomes.  Offerings within this area include:\n•\nAdvanced analytics\n, which utilize AI and advanced techniques to help customers solve critical business problems, focusing on marketing, credit risk, custom projects, data strategy and business experimentation. \n•\nBusiness intelligence\n, which provides customers with data and insights designed to decode future trends, optimize portfolio strategies and make informed decisions for sustainable business growth.\n•\nEconomic and location-based insights\n, which are designed to empower decision-makers to drive smarter actions and achieve commercial success\n•\nPayments consulting\n, which offers strategic guidance and innovative solutions designed to help our customers optimize payment processes, enhance their customer engagement and drive their revenue growth through global expertise and localized support\n•\nOperational insights\n, which provides platforms that help customers enhance transaction processing, settlement reconciliation and operational performance through timely and comprehensive operational insights. \nProcessing and Gateway \n \nWe extend our processing capabilities in the payments value chain in various regions with an expanded suite of offerings, including:\n•\nIssuer solutions designed to provide customers with a complete processing solution to help them create differentiated products and services and allow quick deployment of payments portfolios across banking channels\n•\nPayment gateways that offer a single interface to enable e-commerce merchants to process secure online and in-app payments and offer solutions, including outsourced electronic payments, fraud prevention and alternative payment options\nOther Solutions \n \nWe offer an open banking platform that enables data providers and third parties, on a permissioned basis, to reliably access, securely transmit and confidently manage consumer and small business data to improve the customer experience.  Our platform enables individuals to have choice of financial services, providing them the ability to access, control and benefit from the use of their data.  This choice provides individuals with an improved payment experience.  Our platform also serves the needs of the lending market, including through streamlining loan application processes and improving credit decisioning, thereby driving further financial inclusion.  The network connections that underpin this platform utilize API technology and our Data and Tech Responsibility Principles (including data usage guardrails, consumer protection and consent management).  Our advanced open banking solutions include account opening (providing seamless onboarding through our open banking APIs), lending (focusing on empowering confident lending decisions and hassle-free experiences), payments (centered on enabling secure and cost-effective account-to-account payments with valuable transaction insights) and small business solutions (providing real-time data and financial insights to drive informed decision-making).\nWe also offer ACH batch and real-time account-based payments and solutions (both domestic and cross-border).  We discuss these solutions in “Our Payment Products and Applications”.\n \n16\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\nOur People\nAs of December 31, 2024, we employed approximately 35,300 persons globally, of which approximately 69% were employed outside of the U.S. in more than 90 countries.  Our employee base is predominantly full-time.  To supplement our employee base, we also had approximately 5,000 contingent workers in order to meet specific needs.  Our voluntary workforce turnover (rolling 12-month attrition) was approximately 5% as of December 31, 2024.  The total cost of our workforce for the year ended December 31, 2024 was $6.7 billion, which primarily consists of compensation, benefits and other personnel-related costs.* \nManagement reviews our people strategy and culture, as well as related risks, with our Human Resources and Compensation Committee on a quarterly basis, and annually with our Board of Directors.  Additionally, our Board and Board committees are tasked with overseeing other human capital management matters on a regular basis, such as ensuring processes are in place for maintaining an ethical corporate culture; overseeing key initiatives, policies and practices to provide equal opportunities for all of our employees; and monitoring governance trends in areas such as human rights.  Our ability to attract, develop and retain top talent and build a healthy culture is critical to our business strategy. \nSpecifically, to enable our business strategy effectively, our aim is to:\n \n•\nattract and retain talent with the key skills needed to achieve short-term and long-term goals \n•\ndevelop a high-performing, agile workforce that can collaborate and compete in a fast-paced, innovative environment\n•\ncreate an environment that benefits and provides equal opportunities for all of our employees\nAttract talent. \n \n•\nWe continuously recruit talent by leveraging the strength of our brand and utilizing a variety of sources, channels and initiatives in order to support our growth across sectors, markets and emerging industries\n•\nOur acquisition activity has also provided a strong source of talent with differentiated skills\nDevelop and retain talent.\n  We develop and retain our employees, with a focus on staying competitive and responding to both changing market dynamics and our employees’ needs while supporting a culture of innovation grounded in decency.  Our efforts include: \n•\nAn annual cycle that aligns with our “Mastercard Way” and focuses on objective setting, performance assessment, talent evaluation, skill development, opportunities and career progression\n•\nSuccession planning for key roles as well as leadership development programming across various career levels, including personalized coaching  \n•\nLearning resources and courses for all employees\nThe Mastercard Way\nThe Mastercard Way is the statement of our culture.  It consists of three principles:\n•\nCreate value\n•\nGrow together\n•\nMove fast\nThese principles address where we are going as an organization, how we work together and how we deliver for our customers and each other.\n•\nA competitive compensation approach (subject to periodic reviews) under which eligible employees across multiple job levels can receive long-term incentive equity awards\n•\nContributions to employees’ financial well-being as they plan for retirement.  All employees globally are entitled to receive a matching Mastercard contribution of $1.67 for every $1 contributed to a 401(k) or other retirement plan on the first 6% of base pay\n•\nContinued expansion and prioritization of well-being offerings for employees, including access to mental, physical and financial health resources, additional paid time off for dependent care, and support for family planning \n•\nFlexibility policies and programs to support employees, including a four-week ”work from elsewhere” policy, meeting-free days and a hybrid work approach with an average of at least three days in the office per week\n•\nSupporting employees in giving back to their communities, including providing matching gifts for any charitable donations that they make, donating to the charities of their choice for every hour that they volunteer, and providing five paid days per year for full-time employees to engage in eligible volunteer work\n•\nExperience surveys that we periodically run to assess our overall employee engagement areas (with occasional focus on more targeted topics) and prioritize how we address emerging opportunity areas\n \nMASTERCARD 2024 FORM 10-K     \n17\nPART I\nITEM 1. BUSINESS\n•\nA culture of high ethical business practices and compliance standards, grounded in honesty, decency, trust and personal accountability.  It is driven by “tone at the top,” reinforced with regular training, fostered in a speak-up environment, and measured by our periodic employee surveys and other metrics that enable our Board to maintain a pulse on areas of strength and opportunities for improvement\nEnvironment\n.\n \nWe focus on creating an environment that benefits and provides equal opportunities for all of our employees.  This helps us build a healthy culture, attract talent and drive long-term value for stockholders.  We are dedicated to fostering an inclusive environment where everyone feels valued and empowered.  We are continuously evolving our approach, guided by the following priorities:\n•\nWe customize our global inclusion strategies by region.  These strategies, implemented and executed by local leadership, are designed to ensure we reflect the viewpoints of appropriate stakeholders and consider cultural nuances as part of our work towards providing equal opportunities for all of our employees\n•\nWe remain dedicated to practices designed to ensure there is equal pay for equal work.  We have established a framework for examining pay practices annually, supported by third-party analysis and benchmarked to the external market.  We assess compensation decisions for potential pay disparities\n* The employee data provided excludes the workforce of Recorded Future, which was acquired in December 2024.\nBrand\nOur family of well-known brands includes Mastercard, Maestro and Cirrus.  We manage and promote our brands and brand identities through advertising, promotions and sponsorships, as well as digital, mobile and social media initiatives, in order to increase people’s preference for our brands and usage of our products.  We sponsor a variety of sporting, entertainment and charity-related marketing properties to align with consumer segments important to us and our customers.  Our advertising plays an important role in building brand visibility, preference and overall usage among account holders globally.  Our “Priceless®” advertising campaign, which has run in more than 50 languages and in more than 120 countries worldwide, promotes Mastercard usage benefits and acceptance, markets Mastercard payment products and solutions and provides Mastercard with a consistent, recognizable message that supports our brands around the globe.  \nData and AI\nWe create a range of products and services for our customers (including most of our services and solutions) that use our data and AI assets, technology, expertise and platforms.  These products and services are designed to make commerce smarter, safer and more personal.  These data assets include data from an increasing variety of sources, such as transaction data (including from gateway, card, real-time payments and open banking), digital identities, buyer/supplier payment preferences, device attributes, digital threat assessments and rewards redemptions.  We continually invest in data cleansing, structuring and modeling as well as robust governance to make this data available for use in AI to be deployed at scale.  We utilize our data using traditional analytical methodologies and an ever-increasing range of AI, including machine learning, natural-language processing, neural networks and generative AI.  We aim to help power economies and empower people through AI-driven initiatives that enhance security, data analysis, personalization and efficiency.  \nWe do all this while following our Data and Tech Responsibility Principles in how we design, implement and deliver those solutions.  Our Privacy by Design, Data by Design and AI Governance processes are designed to ensure we embed multiple layers of privacy, data protection and information security controls in all our products and services, keeping a clear focus on protecting customers’ and individuals’ data.  We seek to do this in a number of ways: \n•\nImplementing accountability.  \nWe practice robust data and AI governance aimed at ensuring that we have the right controls and oversight over the use of our data and technology\n•\nPracticing data minimization.\n  We practice collecting and retaining only the personal information that is needed for a given product or service, and limiting the amount and type of personal information shared with third parties\n \n18\n     MASTERCARD 2024 FORM 10-K\nPART I\nITEM 1. BUSINESS\n•\nBeing transparent and providing control.\n  We explain how we use personal information and AI and give individuals access and control over how their data is used and shared\n•\nWorking with trusted partners.\n  Our processes are designed to ensure we select partners and service providers who share our principled-approach to protecting data and using AI\n•\nAddressing fairness in our data and AI.\n  We are implementing governance and processes to help test and mitigate for bias when we use advanced analytics, including AI and machine learning, to create fair and inclusive solutions that reflect individual, group and societal interests\n•\nFostering inclusion and advancing positive social impact.\n  Where possible, we utilize our data sets and analytics capabilities to create innovative solutions to societal challenges, benefit society and promote inclusive financial, social, climate, health and education growth\nTechnology\nWe utilize our technology to help grow our core, diversify into new customers and geographies and build new areas for the future, while also enhancing our operational strength and enabling our employees to deliver effectively for our customers.  Our strategy to “lead through technology” includes the following key areas:  \nCreating value for customers around the world:\n•\nStandardizing and simplifying how we connect with customers to provide them with the tools to manage and expand their Mastercard relationship\n•\nDeploying our cloud-native technology infrastructure to adapt to evolving market conditions and further enhance speed, resiliency and scalability\nEnabling our full range of products and services:\n•\nEnhancing payment rails and expanding them across payments and services, including providing seamless customer adoption across new services and solutions\n•\nFurther evolving our data infrastructure and utilizing AI to unlock incremental value and ensure ongoing compliance with evolving data laws and regulations\nEmpowering our employees:\n \n•\nImproving the speed in which we deliver for our customers through a combination of tools and customer-centric practices \n•\nAttracting, developing and retaining top technology talent, as well as strengthening our employees’ technology acumen \nRevenue Sources \nMastercard is a payments network service provider that generates revenue from a wide range of payments solutions we provide to our customers.  We classify our net revenues, which include the impact of rebates and incentives, from contracts with customers into two categories: (i) payment network and (ii) value-added services and solutions. \nWithin our payment network, revenue is primarily generated from charging fees to our customers based on GDV (which includes both domestic and cross-border volume) on the cards that carry our brands and for providing switching and other network-related services.  \nWithin our value-added services and solutions, we generate revenue primarily related to the following: \n•\nSecurity solutions\n•\nConsumer acquisition and engagement services\n•\nBusiness and market insights\n•\nDigital and authentication solutions\n•\nProcessing and gateway\n•\nOther solutions (including ACH batch and real-time account-based domestic and cross-border payments and solutions, as well as open banking)\nSee “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Revenue” in Part II, Item 7 and Note 3, Revenue for more detail about our revenue.\n \nMASTERCARD 2024 FORM 10-K     \n19\nPART I\nITEM 1. BUSINESS\nIntellectual Property\nWe own a number of valuable trademarks that are essential to our business, including Mastercard, Maestro and Cirrus, through one or more affiliates.  We also own numerous other trademarks covering various brands, programs and services offered by us to support our payment programs.  Trademark and service mark registrations are generally valid indefinitely as long as they are used and/or properly maintained.  Through license agreements with our customers, we authorize the use of our trademarks on a royalty-free basis in connection with our customers’ issuing and merchant acquiring businesses.  In addition, we own a number of patents and patent applications relating to payment solutions, transaction processing, smart cards, contactless, mobile, biometrics, AI, security systems, blockchain and other technologies, which are important to our business operations.  These patents expire at varying times depending on the jurisdiction and filing date.\nCompetition\nWe face a number of competitors both within and outside of the global payments industry.  We compete in all categories of payments (including paper-based payments and all forms of electronic payments) as well as in all categories in which we provide services and solutions:\n•\nGeneral Purpose Payments Networks.\n  We compete worldwide with payments networks such as Visa, American Express, JCB, China UnionPay and Discover, among others.  These competitors tend to offer a range of card-based payment products.  Some competitors have more market share than we do in certain jurisdictions.  Some also have different business models that may provide an advantage in pricing, regulatory compliance burdens or otherwise.  Globally, financial institutions may issue both Mastercard- and Visa-branded payment products, and we compete with Visa for business on the basis of individual portfolios or programs.  In addition, a number of our customers issue American Express-, China UnionPay- and/or Discover-branded payment cards in a manner consistent with a four-party system.  We continue to face intense competitive pressure on the prices we charge our issuers and acquirers, and we seek to enter into business agreements with them through which we offer incentives and other support to issue and promote our payment products. \n•\nDebit and Local Networks.\n  We compete with ATM and point-of-sale debit networks.  In various countries, local debit brands serve as the main domestic brands, while our brands are used mostly to enable cross-border transactions (typically representing a small portion of overall transaction volume).  In addition, several governments are promoting, or considering promoting, local networks for domestic switching.  See “Risk Factors” in Part I,",
    "item1a": "Item 1A for more information about these and other risks related to information security.\n \n40\n     MASTERCARD 2024 FORM 10-K\nPART I",
    "item1b": "Item 1B. Unresolved staff comments\nNot applicable.",
    "item1c": "ITEM 1C. CYBERSECURITY"
  }
}