{
  "ticker": "MAA",
  "cik": "0000912595",
  "company_name": "MID AMERICA APARTMENT COMMUNITIES INC.",
  "filing_date": "2025-02-07",
  "accession": "0000950170-25-016287",
  "primary_doc": "maa-20241231.htm",
  "item_sections": {
    "item1": "Item 1. B\nusiness.\n\n\nOverview\n\n\nMAA, an S&P 500 company, is a multifamily-focused, self-administered and self-managed real estate investment trust, or REIT. We own, operate, acquire and selectively develop apartment communities primarily located in the Southeast, Southwest and Mid-Atlantic regions of the U.S. As of December 31, 2024, we maintained full or partial ownership of apartment communities, including communities currently in development, across 16 states and the District of Columbia, summarized as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMultifamily\n\n\n \n\n\nCommunities \n(1)\n\n\n \n\n\n \n\n\nUnits\n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated\n\n\n \n\n\n \n\n\n300\n\n\n \n\n\n(2)\n\n\n \n\n\n102,079\n\n\n \n\n\n(3)\n\n\n\n\n\n\nUnconsolidated\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n269\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n301\n\n\n \n\n\n \n\n\n \n\n\n102,348\n\n\n \n\n\n \n\n\n\n\n\n\n(1)\nAs of December 31, 2024, 35 of the Company’s apartment communities included retail components.\n\n\n(2)\nNumber of communities includes seven communities under development as of December 31, 2024. One of these developments is a phase II expansion of an existing apartment community.\n\n\n(3)\nNumber of units excludes development units not yet delivered as of December 31, 2024.\n\n\nOur business is conducted principally through the Operating Partnership. MAA is the sole general partner of the Operating Partnership, holding 116,883,421 OP Units, comprising a 97.4% partnership interest in the Operating Partnership as of December 31, 2024. MAA and MAALP were formed in Tennessee in 1993.\n \n\n\n3\n\n\n\n\n \n\n\nBusiness Objectives\n\n\nOur primary business objectives are to generate a sustainable, stable and increasing cash flow that will fund our dividends and distributions through all parts of the real estate investment cycle. To achieve these objectives, we intend to continue to pursue the following goals and strategies:\n\n\n•\ncreate value for our shareholders, residents, associates and the communities in which our properties are located;\n\n\n•\neffectively operate our existing properties with an intense property and asset management focus;\n\n\n•\nutilize technology to provide services desired by our residents and create efficiencies and performance advantages in our operations;\n\n\n•\ntake an opportunistic approach to buying, selling, developing and renovating apartment communities;\n\n\n•\ndiversify our portfolio across markets, submarkets, product type (i.e., garden style, mid-rise, and high-rise) and price points to minimize operating performance volatility; \n\n\n•\noffer attractive work environments, compensation and incentive packages and career development opportunities to attract and retain required talent; and \n\n\n•\nactively manage our balance sheet and capital structure.\n\n\nOperations\n\n\nOur goal is to generate return on investment collectively and in each apartment community by increasing revenues, controlling operating expenses, maintaining high occupancy levels and reinvesting in the income producing capacity of each apartment community as appropriate. The steps taken to meet these objectives include:\n\n\n•\nproviding management information and improved customer services through technology innovations;\n\n\n•\nimplementing programs to control expenses through investment in cost-saving initiatives;\n\n\n•\nanalyzing individual asset productivity performances to identify best practices and improvement areas;\n\n\n•\nmaintaining the physical condition of each property through ongoing capital investments;\n\n\n•\nimproving the “curb appeal,” amenities and common areas of the apartment communities through environmentally-thoughtful landscaping and exterior improvements, and repositioning apartment communities from time to time to enhance or maintain market positions;\n\n\n•\neffectively utilizing search engine optimization, internet leasing solutions and other internet tools to generate leasing traffic;\n\n\n•\nmanaging lease expirations to align with peak leasing traffic patterns and to maximize productivity of property staffing; and\n\n\n•\nallocating additional capital, including capital for selective interior and exterior improvements.\n\n\nWe believe in leveraging the strength of our enterprise as a foundation for our operating structure, which capitalizes on local management with specific market knowledge and accountability.  Senior management, along with certain centralized asset management functions, are proactively involved in supporting and optimizing property operations and reviewing property management performance through extensive reporting processes and on-site visits.   Our significant platform allows us to take advantage of technology that makes information sharing easier on a real-time basis, allows for operating efficiencies and continued expense control, and provides for various expanded revenue management practices to improve the support provided to on-site property operations.\n \n\n\nInvestment in technology continues to drive operating efficiencies in our business and helps us to better meet the changing needs of our residents. Our residents have the ability to conduct business with us 24 hours a day, 7 days a week and complete online leasing applications, leases and renewals through our web-based resident portal. Interacting with our residents through such technology has allowed us to improve resident satisfaction ratings and increase the efficiency of our operating teams. We continue to invest in technology to enable potential residents to examine their future homes both online (virtual touring) or by self-guided tour (self-touring) in addition to the more traditional guided tour.\n\n\nAcquisitions and Development\n\n\nOur external growth strategy is to acquire existing apartment communities, utilize our internal development team to develop our own apartment communities and partner with select developers to develop apartment communities that we will own completely after stabilization, which we refer to as a pre-purchase transaction. Acquisitions and development, along with dispositions, help us achieve and maintain our desired product mix, geographic diversification and asset allocation. Portfolio growth allows for maximizing the efficiency of the existing management and overhead structure. We have extensive experience in the acquisition and development of apartment communities. We will continue to evaluate opportunities that arise, and we will utilize this strategy to increase our number of apartment communities in strong and growing markets.\n \n\n\n4\n\n\n\n\n \n\n\nWe acquired the following properties during the year ended December 31, 2024:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMultifamily Acquisitions\n\n\n \n\n\nMarket\n\n\n \n\n\nUnits\n\n\n \n\n\nDate Acquired\n\n\n\n\n\n\nMAA Vale\n\n\n \n\n\nRaleigh, NC\n\n\n \n\n\n306\n\n\n \n\n\nMay 2024\n\n\n\n\n\n\nMAA Boggy Creek\n\n\n \n\n\nOrlando, FL\n\n\n \n\n\n310\n\n\n \n\n\nSeptember 2024\n\n\n\n\n\n\nMAA Cathedral Arts\n\n\n \n\n\nDallas, TX\n\n\n \n\n\n386\n\n\n \n\n\nOctober 2024\n\n\n\n\n\n\nModera Chandler \n(1)\n\n\n \n\n\nPhoenix, AZ\n\n\n \n\n\n345\n\n\n \n\n\nApril 2024\n\n\n\n\n\n\n \n\n\n(1)\nRepresents a pre-purchase multifamily development. We own 95% of the joint venture that owns this property. Construction of this development commenced in the second quarter of 2024. \n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLand Acquisitions\n\n\n \n\n\nMarket\n\n\n \n\n\nAcres\n\n\n \n\n\nDate Acquired\n\n\n\n\n\n\nMAA Porter\n\n\n \n\n\nRichmond, VA\n\n\n \n\n\n3.3\n\n\n \n\n\nAugust 2024\n\n\n\n\n\n\nMAA Nixie II\n\n\n \n\n\nRaleigh/Durham, NC\n\n\n \n\n\n3.3\n\n\n \n\n\nDecember 2024\n\n\n\n\n\n\n \n\n\nDevelopment activities may be conducted through wholly-owned entities or through joint ventures with our pre-purchase transaction partners. Typically, fixed price construction contracts are signed with unrelated parties to minimize the risk of increases in construction costs. We may also engage in limited expansion development opportunities on existing communities in which we typically serve as the developer. During the year ended December 31, 2024, we incurred $313.9 million in development costs and completed three development projects. For information regarding our development costs, see Note 1 (Organization and Summary of Significant Accounting Policies – Development Costs) to the consolidated financial statements included in this Annual Report on Form 10-K.\n\n\nThe following multifamily projects were under development as of December 31, 2024 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProject\n\n\n \n\n\nMarket\n\n\n \n\n\nTotal\nUnits\n\n\n \n\n\n \n\n\nUnits\nCompleted\n\n\n \n\n\n \n\n\nCosts\nto Date\n\n\n \n\n\n \n\n\nBudgeted\nCosts\n\n\n \n\n\n \n\n\nEstimated\nCosts\nPer Unit\n\n\n \n\n\n \n\n\nExpected\nCompletion\n\n\n\n\n\n\nMAA Nixie\n\n\n \n\n\nRaleigh/Durham, NC\n\n\n \n\n\n \n\n\n406\n\n\n \n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n$\n\n\n127,944\n\n\n \n\n\n \n\n\n$\n\n\n145,500\n\n\n \n\n\n \n\n\n$\n\n\n358\n\n\n \n\n\n \n\n\n3rd Quarter 2025\n\n\n\n\n\n\nMAA Breakwater\n\n\n \n\n\nTampa, FL\n\n\n \n\n\n \n\n\n495\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n154,540\n\n\n \n\n\n \n\n\n \n\n\n197,500\n\n\n \n\n\n \n\n\n \n\n\n399\n\n\n \n\n\n \n\n\n4th Quarter 2025\n\n\n\n\n\n\nModera Liberty Row \n(1)\n\n\n \n\n\nCharlotte, NC\n\n\n \n\n\n \n\n\n239\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n100,492\n\n\n \n\n\n \n\n\n \n\n\n112,000\n\n\n \n\n\n \n\n\n \n\n\n469\n\n\n \n\n\n \n\n\n1st Quarter 2026\n\n\n\n\n\n\nMAA Plaza Midwood \n(2)\n\n\n \n\n\nCharlotte, NC\n\n\n \n\n\n \n\n\n302\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29,105\n\n\n \n\n\n \n\n\n \n\n\n101,500\n\n\n \n\n\n \n\n\n \n\n\n336\n\n\n \n\n\n \n\n\n4th Quarter 2026\n\n\n\n\n\n\nModera Chandler \n(2)\n\n\n \n\n\nPhoenix, AZ\n\n\n \n\n\n \n\n\n345\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n34,068\n\n\n \n\n\n \n\n\n \n\n\n117,500\n\n\n \n\n\n \n\n\n \n\n\n341\n\n\n \n\n\n \n\n\n4th Quarter 2026\n\n\n\n\n\n\nMAA Porter\n\n\n \n\n\nRichmond, VA\n\n\n \n\n\n \n\n\n306\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n15,994\n\n\n \n\n\n \n\n\n \n\n\n99,500\n\n\n \n\n\n \n\n\n \n\n\n325\n\n\n \n\n\n \n\n\n3rd Quarter 2027\n\n\n\n\n\n\nMAA Milepost 35 II\n\n\n \n\n\nDenver, CO\n\n\n \n\n\n \n\n\n219\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n15,038\n\n\n \n\n\n \n\n\n \n\n\n78,000\n\n\n \n\n\n \n\n\n \n\n\n356\n\n\n \n\n\n \n\n\n4th Quarter 2026\n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2,312\n\n\n \n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n$\n\n\n477,181\n\n\n \n\n\n \n\n\n$\n\n\n851,500\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nIn July 2024, we agreed to finance the third-party development of this property currently under construction. We have the option to purchase the property once construction is complete and the property is stabilized. We consider an apartment community to be stabilized once it achieves 90% average physical occupancy for 90 days.\n\n\n(2)\nWe own 95% of the joint venture that owns this property. \n\n\nThe following multifamily development projects were completed during the year ended December 31, 2024 (dollars in thousands):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nAs of December 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProject\n\n\n \n\n\nLocation\n\n\n \n\n\nTotal Units\n\n\n \n\n\n \n\n\nDevelopment Costs\n\n\n \n\n\n \n\n\nDevelopment Costs per Unit\n\n\n \n\n\nConstruction Completed\n\n\n\n\n\n\nNovel Daybreak \n(1)\n\n\n \n\n\nSalt Lake City, UT\n\n\n \n\n\n400\n\n\n \n\n\n \n\n\n$\n\n\n95,091\n\n\n \n\n\n \n\n\n$\n\n\n238\n\n\n \n\n\n3rd Quarter 2024\n\n\n\n\n\n\nNovel Val Vista \n(1)\n\n\n \n\n\nPhoenix, AZ\n\n\n \n\n\n317\n\n\n \n\n\n \n\n\n \n\n\n78,707\n\n\n \n\n\n \n\n\n \n\n\n248\n\n\n \n\n\n4th Quarter 2024\n\n\n\n\n\n\nMAA Milepost 35\n\n\n \n\n\nDenver, CO\n\n\n \n\n\n352\n\n\n \n\n\n \n\n\n \n\n\n123,634\n\n\n \n\n\n \n\n\n \n\n\n351\n\n\n \n\n\n4th Quarter 2024\n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,069\n\n\n \n\n\n \n\n\n$\n\n\n297,432\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(1)\nWe own 80% of the joint venture that owns this property. \n\n\n5\n\n\n\n\n \n\n\nDispositions\n\n\nWe sell apartment communities and other assets that no longer meet our long-term strategy or when market conditions are favorable, and we redeploy the proceeds from those sales to acquire, develop and redevelop additional apartment communities and rebalance our portfolio across or within geographic regions. Dispositions also allow us to realize a portion of the value created through our investments and provide additional liquidity. We are then able to redeploy the net proceeds from our dispositions in lieu of raising additional equity or debt capital. In deciding to sell an apartment community, we consider current market conditions and generally solicit competing bids from unrelated parties for these individual properties, considering the sales price and other key terms of each proposal. We also consider portfolio dispositions when such a structure is useful to maximize proceeds and efficiency of execution.  During the year ended December 31, 2024, we disposed of two multifamily communities totaling 488 units.\n \n\n\nProperty Redevelopment and Repositioning Activity\n\n\nWe focus on both interior unit upgrades and property amenity and common area upgrades above and beyond routine capital upkeep on our apartment communities that we believe have the ability to support additional rent growth. During the year ended December 31, 2024, we renovated the kitchens and bathrooms of 5,665 apartment units at an average cost of $6,219 per apartment unit, achieving average rental rate increases of 7.3% above the normal market rate for similar but non-renovated apartment units.\n\n\nWe have installed smart home technology (unit entry locks, mobile control of lights and thermostat and leak monitoring) at many of our apartment communities in order to provide additional resident value and increase rent growth. As of  December 31, 2024, we had completed installation of Smart Home technology in over 96,000 units across our apartment community portfolio providing an increase in average effective rent per unit of approximately $25 per month since the initiative began during the first quarter of 2019. For a definition of average effective rent per unit, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Trends” in this Annual Report on Form 10-K.\n\n\nSeparately, we continued our property repositioning program to upgrade and reposition the amenity and common areas at certain of our apartment communities. The program includes targeted plans to move all apartment units at such apartment communities to higher rents. For the year ended December 31, 2024, we spent $4.8 million on this program.\n \n\n\nPortfolio Strategy\n\n\nOur goal is to maintain a diversified, balanced portfolio that we believe provides the optimal path to maximizing operating performance over the full economic cycle. Maintaining a diverse portfolio includes:\n\n\n•\nOperating apartment communities in a variety of markets across the Southeast, Southwest, and Mid-Atlantic regions of the U.S.\n\n\n•\nOperating apartment communities in a variety of submarkets within our markets (urban, suburban, inner loop, etc.)\n\n\n•\nOperating apartment communities of different product types such as high-rise, mid-rise and garden style\n\n\n•\nOffering a variety of different rent price points within a market or submarket\n\n\nWe believe a diverse portfolio performs well during economic up cycles and weathers economic down cycles better than a more homogenous portfolio.\n\n\nHuman Capital\n\n\nAs of December 31, 2024, we employed 2,532 associates.  Our associates’ time, energy, creativity and passion are essential to our continued success as a company.  With respect to our workforce, we focus on inclusion, providing market-competitive pay and benefits to support our associates’ well-being, encouraging our associates’ growth and development, fostering associate engagement and protecting our associates’ health and safety.\n\n\nWe respect the privilege of providing value to those whose lives we touch. We call this outlook our “Brighter View.” To achieve these objectives, we use our Core Values to guide the way we interact with each other and conduct business by:\n \n\n\n•\nappreciating the uniqueness of each individual;\n\n\n•\ncommunicating openly and with integrity;\n\n\n•\nembracing opportunities; and\n\n\n•\ndoing the right thing at the right time for the right reasons.  \n\n\n6\n\n\n\n\n \n\n\nWe strive to recruit, develop and retain a talented and diverse workforce that mirrors the diversity of our residents and the communities where we do business. We are committed to an inclusive working environment that not only values diversity in ideas and opinions, but also fosters a sense of belonging and connection where associates feel recognized and appreciated regardless of individual differences. Our goal through these efforts is to support and promote inclusive diversity, equal opportunity and fair treatment for all those working at the company and as a result create more value for all the constituents we serve.  Our Inclusive Diversity Council is comprised of individuals across all areas of our company whose aim is to cultivate conversations, expand education and examine our practices surrounding diversity and inclusion. This group works collaboratively with our Chief Executive Officer and other members of our executive team to ensure our policies and actions are guided by our culture of inclusivity and are free from discriminatory practices and bias.\n \n\n\nWe recruit from a diverse range of sources including historically Black colleges and universities as well as technical/trade schools. As of December 31, 2024, ethnic/cultural minorities represented approximately 54% of our workforce, 43% of our collective corporate, regional and property leadership positions and 55% of our associates promoted during the year ended December 31, 2024. Also, as of December 31, 2024, females represented approximately 46% of our workforce, 57% of our collective corporate, regional and property leadership positions and 54% of our associates promoted during the year ended December 31, 2024.\n \n\n\nWe take a comprehensive approach to supporting our associates’ physical and emotional health as well as their financial and professional well-being. Our associates are eligible for many benefit plans and programs for which we pay part or all of the cost, such as medical, dental and vision insurance, life and disability insurance, various wellness programs and an employee assistance program. In addition, we offer several supplemental and voluntary benefit plans, paid sick leave, paid vacation and other paid time off benefits to support our associates’ overall well-being. We strive to maintain an equitable compensation program for performance, designed to reward competitive levels of compensation based on employee contributions, performance and qualifications. We offer a 401(k) savings plan with an employer match as well as educational support for savings strategies. We also offer discounted rent to associates, parental leave and financial assistance with adoption expenses as well as grant up to three scholarships for associates’ dependents each year. Our training and development programs are designed to provide continuous learning for associates in the flow of their workday. Additionally, we encourage and provide financial assistance to our eligible associates to seek education and certification outside of the company through both apartment associations and accredited educational institutions. We encourage our associates to “embrace opportunities” including developing skills and knowledge needed for increased responsibilities as they promote within the company.\n \n\n\nWe place an emphasis on communication in an effort to ensure associates feel informed and connected as an organization. We utilize a variety of communication channels to provide associates with timely information that is relevant to their role in the company, to company-wide initiatives and their professional interests. We also believe the best way to gain in-depth insight into how associates feel about working at MAA is to provide regular, frequent, and trusted opportunities to safely share feedback. From there, we are able to develop and continuously improve our work environment to enhance job satisfaction. We regularly conduct surveys with all associates to measure associate engagement and capture topical feedback to guide current programs, projects and progress. We are also driven to prove that we are listening, and that real action and improvements are executed as a result. Lastly, we conduct an annual review process to provide an opportunity for each associate to build mutual understanding with leadership, gain self-discovery and learn about possible avenues for growth. We encourage a work environment where ideas, problems and solutions can be discussed with immediate managers and other management personnel.\n\n\nCapital Structure\n\n\nWe use a combination of debt and equity sources to fund our business objectives.  We focus on maintaining access, flexibility and low costs, which we believe allows us to proactively support normal business operations and source potential investment opportunities in the marketplace.  We structure our debt maturities to avoid disproportionate exposure in any given year.  Our primary debt financing strategy is to access the unsecured debt markets to provide our debt capital needs, but we also maintain a limited amount of secured debt and maintain our access to both the secured and unsecured debt markets for maximum flexibility.  We also believe that we have significant access to the equity capital markets.\n\n\nWe intend to target our total debt, net of cash held, to a range of approximately 30% to 36% of our adjusted total assets (as defined in the covenants for the unsecured senior notes issued by MAALP). Our charter and bylaws do not limit our debt levels and our Board of Directors can modify this policy at any time. We may issue new equity to maintain our debt within the target range. Covenants for our unsecured senior notes limit our total debt to 60% or less of our adjusted total assets. As of December 31, 2024, our total debt was 29.0% of our adjusted total assets.\n\n\n7\n\n\n\n\n \n\n\nWe intend to target the ratio of our net debt to Adjusted EBITDA\nre\n to a range of 4.5x to 5.5x.  We monitor our debt levels to a ratio of net debt to Adjusted EBITDA\nre\n in order to maintain our investment grade credit ratings.  We believe this is an important factor in the management of our debt levels to maintain an optimal capital structure, and it is also considered in the assignment of our credit ratings.  Adjusted EBITDA\nre\n is measured on a trailing twelve-month basis.  As of December 31, 2024, our net debt to Adjusted EBITDA\nre\n ratio was 4.0x. For additional information on net debt and Adjusted EBITDA\nre\n, including reconciliations of the most directly comparable U.S. generally accepted accounting principles, or GAAP, measures to both net debt and Adjusted EBITDA\nre\n, see “Management’s Discussion and Analysis of Financial Condition and Results of Operation - Non-GAAP Financial Measures - Net Debt, EBITDA, EBITDA\nre\n, and\n \nAdjusted EBITDA\nre\n” in this Annual Report on Form 10-K.\n \n\n\nWe continuously review opportunities for lowering our cost of capital. We plan to continue using unsecured debt to take advantage of the lower cost of capital and flexibility provided by these markets. We will evaluate opportunities to repurchase shares when we believe that our share price is significantly below our net present value. We also look for opportunities where we can acquire or develop apartment communities, selectively funded or partially funded by sales of equity securities, when appropriate opportunities arise. We focus on improving the net present value of our investments by generating cash flow from our portfolio of assets above the estimated total cost of debt and equity capital. We routinely make new investments when we believe it will be accretive to shareholder value over the life of the investments.\n\n\nCompetition and Market Demand\n\n\nOur apartment communities are located in areas that include other apartment communities. Occupancy and rental rates are affected by the number of competitive apartment communities as well as demand for housing in a particular area. The owners of competing apartment communities may have greater resources than us, and the managers of these apartment communities may have more experience than our management. Moreover, single-family rental housing, manufactured housing, condominiums and the new and existing home markets provide housing alternatives to potential residents of apartment communities. Competition for new residents is generally intense across all of our markets. Some competing apartment communities offer features that our apartment communities do not have or may be deemed to be in a more desirable location within the market. Competing apartment communities can use concessions or lower rents to obtain temporary competitive advantages. Also, some competing apartment communities are newer than our apartment communities, may have different amenities or otherwise be more attractive to a prospective resident. The competitive position of each apartment community is different depending upon many factors including submarket supply and demand. In addition, other real estate investors compete with us to acquire existing properties and to develop new properties. These competitors include insurance companies, pension and investment funds, public and private real estate companies, investment companies and other public and private apartment REITs, some of which may have greater resources, greater ability to utilize leverage or lower capital costs than we do.\n\n\nWe believe, however, that we are generally well-positioned to compete effectively for residents and acquisition and development opportunities. We believe our competitive advantages include:\n\n\n•\na fully integrated organization with property management, development, redevelopment, acquisition, marketing, sales and financing expertise;\n\n\n•\nscalable operating and support systems, which include automated systems to meet the changing technological needs of our residents and associates;\n\n\n•\naccess to a wide variety of debt and equity capital sources;\n\n\n•\ngeographic diversification with a presence in 39 defined markets across the Southeast, Southwest and Mid-Atlantic regions of the U.S.; and\n\n\n•\nsignificant presence in many of our major markets that allows us to be a local operating expert and offer varying location, product type and price options within a market to meet a variety of prospective resident preferences.\n\n\nMoving forward, we plan to continue our focus on optimizing lease expiration management, current and prospective resident engagement, expense control and resident retention efforts and also to align employee incentive plans with our performance. We also plan to continue to make capital improvements to both our apartment communities and individual units on a regular basis to maintain a competitive position. We believe this plan of operation, coupled with the portfolio’s strengths in targeting residents across a geographically diverse platform, should position us for continued operational growth.\n\n\nFor information regarding trends in market demand, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Trends” in this Annual Report on Form 10-K.\n\n\n8\n\n\n\n\n \n\n\nEnvironmental Matters\n\n\nAs a part of our standard apartment community acquisition and development processes, we generally obtain environmental studies of the sites from outside environmental engineering firms. The purpose of these studies is to identify potential sources of contamination at the site and to assess the status of environmental regulatory compliance. These studies generally include historical reviews of the site, reviews of certain public records, preliminary investigations of the site and surrounding properties, inspection for the presence of asbestos, poly-chlorinated biphenyls and underground storage tanks and the preparation and issuance of written reports. Depending on the results of these studies, more invasive procedures, such as soil sampling or ground water analysis, may be performed to investigate potential sources of contamination. These studies must be satisfactorily completed before we take ownership of an acquisition or development property; however, no assurance can be given that the studies or additional documents reviewed identify all significant environmental risks.  See “Risk Factors – Environmental problems are possible and can be costly” and “Risk Factors – Compliance or failure to comply with laws and regulations could have an adverse effect on our operations and the values of our properties” in this Annual Report on Form 10-K.\n \n\n\nThe environmental studies we received on properties that we have acquired have not revealed any material environmental liabilities. Should any potential environmental risks or conditions be discovered during our due diligence process, the potential costs of remediation will be assessed carefully and factored into the cost of acquisition, assuming the identified risks and factors are deemed to be manageable and within reason. We are not aware of any existing conditions that we believe would be considered a material environmental liability. Nevertheless, it is possible that the studies do not reveal all environmental risks or that there are material environmental liabilities of which we are not aware. Moreover, no assurance can be given concerning future laws, ordinances or regulations, or the potential introduction of hazardous or toxic substances by neighboring properties or residents.\n\n\nGovernment Regulations\n\n\nWe must own, operate, manage, acquire, develop and redevelop our properties in compliance with numerous federal, state and local laws and regulations, some of which may conflict with one another or are subject to limited judicial or regulatory interpretations. These laws and regulations include landlord-tenant laws, employment laws, antitrust and other competition laws, laws benefiting disabled persons, privacy laws, tax laws, environmental laws, zoning laws, building codes and other laws regulating housing or that are generally applicable to our business and operations.  Noncompliance with laws and regulations could expose us to liability, such as the imposition of fines by the government or the award of damages to private litigants, and could require us to make significant unanticipated expenditures, such as making modifications to our existing apartment communities or increasing construction costs for development communities. Compliance with the various laws and regulations we are subject to did not have a material effect on our capital expenditures, results of operations and competitive position for the year ended December 31, 2024 as compared to prior periods.\n \n\n\nFor additional information, see “Risk Factors – Environmental problems are possible and can be costly” and “Risk Factors – Compliance or failure to comply with laws and regulations could have an adverse effect on our operations and the values of our properties” in this Annual Report on Form 10-K.\n\n\nQualification as a Real Estate Investment Trust\n\n\nMAA has elected to be taxed as a REIT under the Internal Revenue Code of 1986, as amended, or the Code. To continue to qualify as a REIT, MAA must continue to meet certain tests which, among other things, generally require that our assets consist primarily of real estate assets, our income be derived primarily from real estate assets and that we distribute at least 90% of our REIT taxable income (other than our net capital gains) to our shareholders annually. If MAA maintains its qualification as a REIT, MAA generally will not be subject to U.S. federal income taxes at the corporate level on its net income to the extent it distributes such net income to its shareholders annually. Even if MAA continues to qualify as a REIT, it will continue to be subject to certain federal, state and local taxes on its income and its property. For the year ended December 31, 2024, MAA paid total distributions of $5.88 per share of common stock to its shareholders, which was above the 90% REIT distribution requirement.\n\n\nWebsite Access to Our Reports\n\n\nMAA and the Operating Partnership file combined periodic reports with the SEC. Our Annual Reports on Form 10-K, along with our Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and any amendments to those reports, are available on our website at https://www.maac.com as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Reference to our website does not constitute incorporation by reference of the information contained on the site and should not be considered part of this Annual Report on Form 10-K. All of the aforementioned materials may also be obtained free of charge by contacting our Investor Relations Department, 6815 Poplar Avenue, Suite 500, Germantown, Tennessee 38138.\n\n\n9",
    "item1a": "Item 1A. Ris\nk Factors.\n\n\nIn addition to the other information contained in this Annual Report on Form 10-K, we have identified the following risks and uncertainties that may have a material adverse effect on our business prospects, financial condition or results of operations. Investors should carefully consider the risks described below before making an investment decision. Our business faces significant risks and the risks described below may not be the only risks we face. Additional risks that are not presently known to us, that we currently believe are immaterial or that could apply generically to any company may also significantly impact our business operations. If any of these risks occur, our business prospects, financial condition or results of operations could suffer, the market price of our stock and the trading price of our debt securities could decline and you could lose all or part of your investment in our stock or debt securities.\n\n\nRisks Related to Our Real Estate Investments and Our Operations\n \n\n\nUnfavorable market and economic conditions could adversely affect occupancy levels, rental revenues and the value of our properties.\n\n\nGeneral economic conditions in the U.S. have fluctuated in recent quarters, and concerns persist regarding negative macroeconomic conditions, such as inflation and the labor market. Unfavorable market and economic conditions may significantly affect our occupancy levels, our rental rates and collections, the value of our properties and our ability to acquire or dispose of properties on economically favorable terms. Our ability to lease our properties at favorable rates is adversely affected by the increase in supply in the multifamily and other rental markets and is dependent upon the overall level in the economy, which is adversely affected by, among other things, job losses and unemployment levels, personal debt levels, a downturn in the housing market, stock market volatility, inflationary conditions and uncertainty about the future. Some of our major expenses generally do not decline when rents decline. We would expect that declines in our occupancy levels, rental revenues and/or the values of our properties would cause us to have less cash available to make payments on our debt and to make distributions, which could adversely affect our financial condition or the market value of our securities. Factors that may affect our occupancy levels, our rental revenues and/or the value of our properties include the following, among others:\n\n\n•\ndownturns in global, national, regional and local economic conditions, particularly increases in unemployment or decreases in job growth in our markets;\n\n\n•\ndeclines in mortgage interest rates and home pricing, making alternative housing options more affordable;\n\n\n•\ngovernment or builder incentives with respect to home ownership, making alternative housing options more attractive;\n\n\n•\nlocal real estate market conditions, including oversupply of apartments or other housing available for rent, or a reduction in demand for apartments in the area;\n\n\n•\ndeclines in the financial condition of our residents or commercial tenants, which may make it more difficult for us to collect rents from some residents or commercial tenants;\n\n\n•\ndeclines in market rental rates; \n\n\n•\ndeclines in household formation; and\n\n\n•\nincreases in operating costs, if these costs cannot be passed through to our residents or commercial tenants.\n\n\nFailure to generate sufficient cash flow could limit our ability to make payments on our debt and to make distributions.\n\n\nOur ability to make payments on our debt and to make distributions depends on our ability to generate cash flow in excess of operating costs and capital expenditure requirements and/or to have access to the markets for debt and equity financing. Our funds from operations may be insufficient because of factors that are beyond our control. Such factors could include:\n\n\n•\nweakness in the general economy, which lowers job growth and the associated demand for apartment housing;\n\n\n•\ncompetition from other apartment communities or alternative housing options (including condominiums and single-family houses for rent or sale);\n\n\n•\noverbuilding of new apartments or oversupply of available apartments or alternative housing options in our markets, which might adversely affect occupancy or rental rates and/or require rent concessions in order to lease apartments;\n\n\n•\nincreases in operating costs (including real estate taxes, utilities and insurance premiums) due to inflation and other factors, which may not be offset by increased rental rates;\n\n\n•\ninability to rent apartments on favorable economic terms;\n\n\n•\nchanges in governmental regulations and the related costs of compliance;\n\n\n•\nthe enactment of rent control or rent stabilization laws in the areas in which we operate or other laws regulating multifamily housing;\n\n\n•\nother changes in laws, including tax laws and housing laws;\n\n\n•\nan uninsured loss, including those resulting from a catastrophic storm, earthquake or act of terrorism;\n\n\n10\n\n\n\n\n \n\n\n•\nchanges in interest rate levels and the availability of financing, borrower credit standards and down-payment requirements which could lead renters to purchase homes (if interest rates decrease and home loans are more readily available) or increase our acquisition and operating costs (if interest rates increase and financing is less readily available); and\n\n\n•\nthe relative illiquidity of real estate investments.\n\n\nAt times, we have relied on external funding sources to fully fund the payment of distributions to shareholders and our capital investment program, including our property developments. While we have sufficient liquidity to permit distributions at current rates through additional borrowings, if necessary, any significant and sustained deterioration in operations could result in our financial resources being insufficient to make payments on our debt and to make distributions at the current rate, in which event we would be required to reduce the distribution rate. Any decline in our funds from operations could adversely affect our ability to make distributions or to meet our loan covenants and could have a material adverse effect on our stock price or the trading price of our debt securities.\n\n\nWe are dependent on a concentration of our investments in a single asset class, making our results of operations more vulnerable to a downturn or slowdown in the multifamily sector or other economic factors.\n\n\nAs of December 31, 2024, substantially all of our investments are concentrated in the multifamily sector. As a result, we will be subject to risks inherent in investments in a single type of property. A downturn or slowdown in the demand for multifamily housing will have more pronounced effects on our results of operations and on the value of our assets than if we had diversified our investments into more than one asset class.\n\n\nOur operations are concentrated in the Southeast, Southwest and Mid-Atlantic regions of the U.S.; we are subject to general economic conditions in the regions in which we operate.\n\n\nAs of December 31, 2024, approximately 41.2% of our portfolio (based on the number of completed apartment units) was located in our top five markets:  Atlanta, Georgia; Dallas, Texas; Austin, Texas; Charlotte, North Carolina; and Orlando, Florida.  In addition, our overall operations are concentrated in the Southeast, Southwest and Mid-Atlantic regions of the U.S. Our performance could be adversely affected by economic conditions in, and other factors relating to, these geographic areas, including supply and demand for apartments in these areas, zoning and other regulatory conditions and competition from other communities and alternative housing options. In particular, our performance is disproportionately influenced by job growth and unemployment. To the extent the economic conditions, job growth and unemployment in any of these markets deteriorate or any of these areas experiences natural disasters, the value of our portfolio, our results of operations and our ability to make payments on our debt and to make distributions could be adversely affected.\n\n\nSubstantial competition may adversely affect our revenues and limit our acquisition and development opportunities.\n\n\nThere are numerous alternative housing options within the market area of each of our communities that compete with us for residents, including other apartment communities, condominiums and single-family homes. Competitive housing in a particular area, particularly new supply (and especially during lease up efforts), could adversely affect our ability to retain residents, rent our apartments and increase or maintain rents, which could materially adversely affect our results of operations and financial condition. Similarly, some of our competitors may have loan covenants or fund requirements that encourage decisions on occupancy targets or rental rates that vary from decisions based on market conditions, which could require us to react in ways that may negatively affect our performance.\n \n\n\nWe also face competition from other businesses for acquisition and development opportunities. The activities of these competitors could cause us to pay higher prices for new properties than we otherwise would have paid or may prevent us from purchasing desired properties at all, which could have a material adverse effect on us and our ability to make payments on our debt and to make distributions.\n\n\nFailure to succeed in new markets may have adverse consequences on our performance.\n\n\nWe may make acquisitions or pursue developments outside of our existing market areas if appropriate opportunities arise. Our historical experience in our existing markets does not ensure that we will be able to operate successfully in new markets, should we choose to enter them. We may be exposed to a variety of risks if we choose to enter new markets, including an inability to accurately evaluate local market conditions and local economies, an inability to identify appropriate acquisition or development opportunities, an inability to hire and retain key personnel and a lack of familiarity with local governmental and permitting procedures. In addition, we may abandon opportunities to enter new markets that we have begun to explore for any reason and may, as a result, fail to recover expenses already incurred.\n\n\n11\n\n\n\n\n \n\n\nEnvironmental problems are possible and can be costly.\n\n\nUnder various federal, state and local laws, ordinances and regulations, a current or previous owner or operator of real estate may be liable for the costs of removal or remediation of certain hazardous or toxic substances in, on, around or under such property. Such laws often impose such liability without regard to whether the owner or operator knew of, or was responsible for, the presence of such hazardous or toxic substances. The presence of, or failure to properly remediate, hazardous or toxic substances or petroleum product releases may adversely affect the owner’s or operator’s ability to sell or rent the affected property or to borrow using the property as collateral. Persons who arrange for the disposal or treatment of hazardous or toxic substances may also be liable for the costs of removal or remediation of hazardous or toxic substances at a disposal or treatment facility, whether or not the facility is owned or operated by the person. Certain environmental laws impose liability for the release of asbestos-containing materials into the air, and third parties may also seek recovery from owners or operators of real property for personal injury associated with asbestos-containing materials and other hazardous or toxic substances. Federal and state laws also regulate the operation and subsequent removal of certain underground storage tanks. In connection with the current or former ownership (direct or indirect), operation, management, development or control of real property, we may be considered an owner or operator of such apartment communities or as having arranged for the disposal or treatment of hazardous or toxic substances and, therefore, may be potentially liable for removal or remediation costs, as well as certain other costs, including governmental fines, and claims for injuries to persons and property.\n\n\nOur current policy is to obtain a Phase I environmental study on each apartment community that we seek to acquire or develop, which generally does not involve invasive techniques such as soil or ground water sampling, and to proceed accordingly. However, there can be no assurance that the Phase I environmental studies or other environmental studies undertaken with respect to any of our current or future apartment communities will reveal:\n\n\n•\nall or the full extent of potential environmental liabilities; \n\n\n•\nthat any prior owner or operator of a property did not create any material environmental condition unknown to us;\n\n\n•\nthat a material environmental condition does not otherwise exist as to any one or more of such apartment communities; or \n\n\n•\nthat environmental matters will not have a material adverse effect on us and our ability to make payments on our debt and to make distributions. \n\n\nCertain environmental laws impose liability on a previous owner of property to the extent that hazardous or toxic substances were present during the prior ownership period. A transfer of the property does not relieve an owner of such liability. Thus, we may have liability with respect to apartment communities previously sold by our predecessors or by us.  There have been a number of lawsuits against owners and operators of multifamily apartment communities alleging personal injury and property damage caused by the presence of mold in residential real estate. Some of these lawsuits have resulted in substantial monetary judgments or settlements. Insurance carriers have reacted to these liability awards by excluding mold-related claims from standard policies and pricing mold endorsements separately. We have obtained a separate pollution insurance policy that covers mold-related claims and have adopted programs designed to minimize the existence of mold in any of our apartment communities as well as guidelines for promptly addressing and resolving reports of mold. To the extent not covered by our pollution policy, the presence of mold could expose us to liability from residents and others if property damage or health concerns, or allegations thereof, arise.\n\n\nOur business and operations are subject to physical and transition risks related to climate change.\n\n\nMany of our apartment communities are located in areas, such as coastal regions, that have historically been vulnerable to extreme weather events. To the extent climate change causes changes in weather patterns, areas where many of our communities are located could experience more frequent and intense extreme weather events and rising sea levels, which may cause significant damage to our properties, disrupt our operations and adversely impact our residents and rental revenue. Over time, such conditions could result in reduced demand for housing in areas where our communities are located, as well as higher costs for mitigating or repairing damage related to the effects of climate change, some which may not be fully covered by insurance. Similarly, these conditions may also negatively impact the types, pricing and terms of insurance we are able to procure.\n\n\nChanges in federal, state and local laws and regulations on sustainable buildings could result in increased operating costs and capital expenditures for us to meet mandated levels of energy efficiency and/or greenhouse gas emissions performance with respect to our existing communities and could also require us to spend more on our new development communities without a corresponding increase in rental revenues. For example, various laws and regulations have been implemented or are under consideration to mitigate the effects of climate change caused by greenhouse gas emissions. Among other things, “green” building codes may seek to reduce emissions through the imposition of standards for design, construction materials, water and energy efficiency and waste management. The imposition of such requirements could increase the costs of maintaining or improving our existing communities (for example by requiring retrofits of existing communities to improve their energy efficiency and/or resistance to inclement weather) and developing new communities without creating corresponding increases in rental revenues, which would have an adverse impact on our operating results and could adversely impact the value of our properties. Additionally, if non-compliant with building efficiency standards, our existing communities may decrease in value.\n\n\n12\n\n\n\n\n \n\n\nOperations from new acquisitions, development projects and redevelopment activities may fail to perform as expected.\n\n\nWe intend to acquire, develop and redevelop apartment communities as part of our business strategy.  Newly acquired, developed or renovated properties may not perform as we expect.  We may also overestimate the revenue (or underestimate the expenses) that a new or repositioned property may generate.  The occupancy rates and rents at these properties may fail to meet our expectations underlying our investment.\n\n\nIn addition, with respect to acquisitions, we may be unable to quickly and efficiently integrate acquired apartment communities and new personnel into our existing operations, and the failure to successfully integrate those apartment communities or personnel would result in inefficiencies that could adversely affect our expected return on our investments.  Likewise, we may acquire properties that are subject to liabilities or that have problems relating to environmental condition, state of title, physical condition or compliance with zoning laws, building codes or other legal requirements. In each case, our acquisition may be without any, or with only limited, recourse with respect to unknown liabilities or conditions, and we may be obligated to pay substantial sums to settle or cure it, which could adversely affect our cash flow and operating results.\n\n\nOur implementation of long-standing succession planning could have adverse effects.\n\n\nTo reduce the risk of disruption from the planned retirement and unexpected departure of long-term employees and board members, we engage in succession planning to identify and develop in-house candidates for leadership and key executive positions within the company, recruit talented associates to fill areas of expertise needed within the company, and continually assess the needs of MAA’s Board of Directors to ensure stable governance of the company.  In the last three years, we have transformed our executive team by elevating internal candidates to the offices of Chief Executive Officer (effective April 1, 2025), President, Chief Financial Officer, Chief Administrative Officer, Chief Strategy and Analysis Officer and Chief Technology and Innovation Officer. Such significant changes over a relatively short period of time could result in unintended negative effects, such as creating employee dissatisfaction that could affect retention of key employees or impacting short-term strategic initiatives, which could adversely affect our business.\n\n\nWe are subject to certain risks associated with selling apartment communities, which could limit our operational and financial flexibility.\n\n\nWe plan to sell apartment communities that no longer meet our long-term strategy.  However, adverse market conditions could limit our ability to sell properties when we want and to change our portfolio promptly to meet our strategic objectives.  Likewise, federal tax laws applicable to REITs limit our ability to profit on the sale of properties, and this limitation could prevent us from selling properties when market conditions are favorable.  From time to time, we may dispose of properties in transactions intended to qualify as “like-kind exchanges” under Section 1031 of the Code. If a transaction intended to qualify as a Section 1031 exchange is later determined to be taxable, we may face adverse consequences, and if the laws applicable to such transactions are amended or repealed, we may not be able to dispose of properties on a tax deferred basis.\n \n\n\nDevelopment and construction risks could impact our profitability.\n\n\nAs of December 31, 2024, we had seven development communities under construction representing 2,312 units once complete. We may make further investments in these and other development communities as opportunities arise and may do so through joint ventures with unaffiliated parties.  Our development and construction activities are subject to the following risks:\n\n\n•\nwe may be unable to obtain, or face delays in obtaining, necessary zoning, land-use, building, occupancy and other required governmental permits and authorizations, which could result in increased development costs, could delay initial occupancy dates for all or a portion of a development community and could require us to abandon our activities entirely with respect to a project for which we are unable to obtain permits or authorizations;\n\n\n•\nwe may be unable to obtain financing for development activities under favorable terms, which could cause a delay in construction resulting in increased costs, decreases in revenue and potentially cause us to abandon the opportunity;\n\n\n•\nyields may be less than anticipated as a result of delays in completing projects, costs that exceed budget, higher than expected concessions for lease-up and lower rents than initially estimated;\n\n\n•\nbankruptcy of developers in our development projects could impose delays and costs on us with respect to the development of our communities and may adversely affect our financial condition and results of operations;\n\n\n•\nwe may abandon development opportunities that we have already begun to explore, and we may fail to recover expenses already incurred in connection with exploring such opportunities;\n\n\n•\nwe may be unable to complete construction and lease-up of an apartment community on schedule, including by reason of work stoppages, labor disputes, shortages of skilled tradespeople and shortages of building components and materials;\n\n\n•\nwe may incur development or construction costs, including labor and building components and materials, that  exceed our original estimates and we may be unable to charge rents that would compensate for any increase in such costs;\n\n\n13\n\n\n\n\n \n\n\n•\noccupancy rates and rents at a newly developed apartment community may fluctuate depending on a number of factors, including market and economic conditions, preventing us from meeting our profitability goals for that community; \n\n\n•\nwhen we sell apartment communities that we developed or renovated, we may be subject to warranty or construction defects that are uninsured or exceed the limit of our insurance;\n\n\n•\nour failure to successfully enter into a joint venture agreement may prohibit an otherwise advantageous investment;\n\n\n•\nchanges in laws and regulations, or enforcement priorities, such as the imposition of tariffs or changes in immigration laws or their enforcement, could result in higher building component costs, tighter overall labor conditions and a shortage of skilled tradespeople, which could increase our costs of development and cause delays in the construction of our development communities; and\n\n\n•\nadoption of laws and regulations designed to address climate change and its effects, including “green” building codes, could increase our costs of development and cause delays in the construction of our development communities.\n\n\nIncreasing real estate taxes, utilities and insurance premiums, as well as changes in the terms and conditions of our insurance policies, may negatively impact operating results.\n\n\nAs a result of our substantial real estate holdings, the cost of real estate taxes, utilities and insurance for our apartment communities represents a significant component of expense. These costs are subject to substantial increases and fluctuations, which can be widely outside of our control. For example, the current and potential impacts of climate change, along with the increased risk of extreme weather events and natural disasters have caused significant increases in our property insurance premiums and may adversely affect the availability and terms of coverage in the future.   Additionally, “social inflation” has caused the cost of general liability claims to rise at a rate well above general economic inflation, primarily due to a trend in increasing litigation costs related to unpredictable jury verdicts for plaintiffs seeking large monetary relief for their injuries.  Premises liability is of particular concern for multifamily apartment owners.  In general, these factors have pressured insurance premiums and made it more challenging to obtain appropriate coverage at reasonable rates without assuming higher levels of self-retained risk.  If the costs associated with real estate taxes, utilities and insurance premiums continue to rise without being offset by corresponding increases in rental revenues or, in the case of insurance, strategic self-retention of risk, our operating results could be negatively impacted, potentially affecting our ability to meet debt obligations and make distributions.\n\n\nShort-term leases expose us to the effects of declining market rents, and we may be unable to renew leases or relet units as leases expire.\n\n\nOur apartment leases are generally for a term of approximately one year. The short-term nature of these leases generally serves to reduce our risk to adverse effects of inflation as our leases allow for adjustments in the rental rate at the time of renewal, which may enable us to seek rent increases. However, since our leases typically permit the residents to leave at the end of the lease term without penalty, our revenues are impacted by declines in market rents more quickly than if our leases were for longer terms.  If we are unable to promptly renew the leases or relet the units, or if the rental rates upon renewal or reletting are significantly lower than expected rates, then our financial condition and results of operations may be adversely affected.\n\n\nWe rely on information technology systems in our operations, and any breach or security failure of those systems could materially adversely affect our business, financial condition, results of operations and reputation.\n\n\nWe rely on proprietary and third-party information technology systems to process, transmit and store information and to manage or support our business processes. We store and maintain confidential financial and business information regarding us and persons with whom we do business on our information technology systems. We also collect and hold personally identifiable information of our residents and prospective residents in connection with our leasing and property management activities, and we collect and hold personally identifiable information of our employees in connection with their employment. In addition, we engage third-party service providers that may collect and hold personally identifiable information of our residents, prospective residents and employees in connection with providing business services to us, including web hosting, property management, leasing, accounting, payroll and benefit services. The protection of the information technology systems on which we rely is critically important to us. As described in more detail under the heading \"Cybersecurity\" in this Annual Report on Form 10-K, we take steps, and generally require third-party service providers to take steps, to protect the security of the information maintained in our and our service providers’ information technology systems, including the use of systems, software, tools and monitoring to provide security for processing, transmitting and storing of the information. However, we face risks associated with breaches or security failures of the information technology systems on which we rely, which could result from, among other incidents, cyber-attacks or cyber-intrusions over the internet, malware, computer viruses or employee error or misconduct. This risk of a data breach or security failure, particularly through cyber-attacks or cyber-intrusion, has generally increased due to the rise in new technologies, such as ransomware and generative artificial intelligence, and the increased sophistication and activities of the perpetrators of attempted attacks and intrusions, including as a result of the intensification of state-sponsored cybersecurity attacks during periods of geopolitical conflict, such as the ongoing conflicts involving Ukraine and in the Middle East.\n \n\n\n14\n\n\n\n\n \n\n\nThe security measures put in place by us and our service providers cannot provide absolute security and there can be no assurance that we or our service providers will not suffer a data security incident in the future, that unauthorized parties will not gain access to sensitive information stored on our or our service providers’ systems, that such access will not, whether temporarily or permanently, impact, interfere with or interrupt our operations, or that any such incident will be discovered in a timely manner. Even the most well-protected information, networks, systems and facilities remain potentially vulnerable as the techniques used in such attempted security breaches evolve and generally are not recognized until launched against a target, and in some cases are designed to not be detected and, in fact, may not be detected. The rapid evolution and increased adoption of artificial intelligence technologies, by us and our third-party service providers, may also heighten our cybersecurity risks by making cyber attacks more difficult to detect, contain and mitigate. In addition, third-party information technology providers may not provide us with fixes or updates to hardware or software in a manner as to avoid an unauthorized loss or disclosure or to address a known vulnerability, which may subject us to known threats or downtime as a result of those delays.  Accordingly, we and our service providers may be unable to anticipate these techniques or to implement adequate security barriers or other preventative measures. Further, we may be required to expend significant additional resources to continue to enhance information security measures and internal processes and procedures or to investigate and remediate any information security vulnerabilities.\n\n\nA data security incident could compromise our or our service providers’ information technology systems, and the information stored by us or our service providers, including personally identifiable information of residents, prospective residents and employees, could be accessed, misused, publicly disclosed, corrupted, lost or stolen. Any failure to prevent a data breach or a security failure of our or our service providers’ information technology systems could interrupt our operations, result in downtime, divert our planned efforts and resources from other projects, damage our reputation and brand, damage our competitive position, make it difficult for us to attract and retain residents, subject us to liability claims or regulatory penalties and could materially and adversely affect our business, financial condition or results of operations. Similarly, if our service providers fail to use adequate security or data protection processes, or use personal data in an unpermitted or improper manner, we may be liable for certain losses and it may damage our reputation.\n\n\nCompliance or failure to comply with laws and regulations could have an adverse effect on our operations and the values of our properties.\n\n\nWe must own, operate, manage, acquire, develop and redevelop our properties in compliance with numerous federal, state and local laws and regulations, some of which may conflict with one another or are subject to limited judicial or regulatory interpretations. These laws and regulations include landlord-tenant laws, employment laws, laws benefitting disabled persons, antitrust and other competition laws, privacy laws, tax laws, environmental laws, zoning laws, building codes and other laws regulating housing or that are generally applicable to our business and operations.  Noncompliance with laws and regulations could expose us to liability, such as the imposition of fines by the government or the award of damages to private litigants, and could require us to make significant unanticipated expenditures, such as making modifications to our existing apartment communities or increasing construction costs for development communities.\n \n\n\nAs our industry becomes increasingly regulated, we do not know whether the legal requirements we are subject to will change or whether new requirements will be imposed.  For example, privacy laws continue to evolve, with several states passing new data privacy laws that govern the collection, processing, use, security and disclosure of information about state residents, such as the Texas Data Privacy and Security Act. In addition, there are legislative efforts underway at the local, state and federal levels related to tenant screening limitations, affordable housing mandates, increased eviction notice periods, mandatory alternative dispute resolution and access to legal counsel for unrepresented tenants. Likewise, we have seen an increase in governments implementing, considering or being urged by tenant advocacy groups to consider rent control or rent stabilization laws and regulations and other tenants’ rights laws and regulations. New or changed legal requirements implemented in the markets in which we operate could require us to make significant unanticipated expenditures and could also limit our ability to recover increases in operating expenses, impose limitations on our ability to charge market rents or increase rents or charge certain fees, impose limitations on our ability to enforce remedies for the failure to pay rent or otherwise adversely impact our operations.  Therefore, any such new or changed legal requirements could have a significant adverse impact on our results of operations and the value of our properties.\n\n\nLegal proceedings that we become involved in from time to time could adversely affect our business.\n\n\nAs an owner, operator and developer of multifamily apartment communities, we may become involved in various legal proceedings, including, proceedings related to commercial, development, employment, competition, environmental, securities, shareholder, tenant or tort legal issues, some of which could result in a class action lawsuit.  For example, we are currently a defendant, among other companies, in lawsuits filed by plaintiffs individually and on behalf of a purported class of plaintiffs alleging that RealPage, Inc. and many of the largest owners and operators of apartment communities in the country, including us, conspired to artificially inflate the prices of multifamily rents above competitive levels using RealPage’s revenue management software in violation of state and federal antitrust laws. Similarly, another lawsuit alleging violations of the District of Columbia’s antitrust laws has been filed by the District of Columbia against RealPage and a number of large apartment community owners and operators, including us. For more detail on these lawsuits, see Note 11 to the consolidated financial statements included in this Annual Report on Form 10-K.\n\n\n15\n\n\n\n\n \n\n\nLegal proceedings, if decided adversely to or settled by us, and not covered by insurance, could result in liability material to our financial condition, results of operations or cash flows.  Likewise, regardless of outcome, legal proceedings could result in substantial costs and expenses, result in operational changes in our business, affect the availability or cost of some of our insurance coverage and significantly divert the attention of our management. There can be no assurance that we will be able to prevail in, or achieve a favorable settlement of, any pending or future legal proceedings to which we become subject. In addition, other multifamily apartment owners could become involved in legal proceedings, the outcome of which could affect the way we conduct our business.\n \n\n\nExtreme weather or natural disasters may cause significant damage to our properties.\n\n\nMany of our apartment communities are located in areas that may be subject to extreme weather and natural disasters, such as floods, tornados, hurricanes, earthquakes, wildfires and major winter storms, the likelihood or frequency of which events could increase in part based on the impact of climate change.  Such events may cause significant damage to our properties, disrupt our operations, and adversely impact our residents and rental revenue.  There can be no assurances that such conditions will not have a material adverse effect on our properties, operations or business.\n\n\nWe may incur losses that are not covered by our insurance\n.\n\n\nWe have a comprehensive insurance program covering our properties and operations with limits of liability, deductibles and self-insured retentions that we negotiated with our insurance carriers. While we believe the terms and insured limits of these policies are appropriate for our business, there are certain types of losses, generally of a catastrophic nature, such as losses due to environmental matters, extreme weather or natural disasters, that are uninsurable or not economically insurable, or that may be insured subject to limitations, and therefore may be uninsured. We exercise our discretion in determining amounts, coverage limits, deductibles and self-insured retention provisions of our insurance, with a view to maintaining what we believe is appropriate insurance at a reasonable cost and on suitable terms.\n \n\n\nDespite our insurance coverage, we may incur material losses due to uninsured risks, deductibles, self-insured retentions and/or losses in excess of coverage limits. In the event of a substantial loss, our insurance coverage may not be sufficient to cover the full current market value or current replacement cost of our lost investment or any settlement, fine or judgment against us resulting from legal proceedings. Inflation, changes in building codes and ordinances, environmental considerations and other factors also might make it infeasible to use insurance proceeds to replace a property after it has been damaged or destroyed.  In addition, certain casualties or losses incurred may expose us in the future to higher insurance premiums.\n\n\nWe insure our properties and operations with insurance carriers that we believe have a good rating at the time our policies are put into effect. However, the financial condition of one or more of our insurance carriers may be negatively impacted, which would result in their inability to cover the full amount of any insured losses for which we submit a claim. Any such inability to pay future claims could have an adverse impact on our operating results. In addition, the failure, or exit or partial exit from an insurance market, of one or more insurance carriers may adversely affect our ability to obtain insurance in the amounts that we seek, increase our costs to renew or replace our insurance policies, or cause us to self-insure a greater portion of the risk.\n\n\nOur financial condition, results of operations and cash flows could be materially adversely affected by factors relating to disease outbreaks and other public health events.\n\n\nThe U.S. has experienced, and may experience in the future, outbreaks of contagious diseases that affect public health and public perception of health risk. Our rental revenues and operating results depend significantly on the occupancy levels at our properties and the ability of our residents and commercial tenants to meet their rent obligations to us, which could be adversely affected by such disease outbreak or other public health events. For example, in response to the COVID-19 pandemic, extraordinary actions were taken by federal, state and local governmental authorities to combat the spread of COVID-19, including issuance of “stay-at-home” directives and similar mandates for many individuals to substantially restrict daily activities and for many businesses to curtail or cease normal operations. These measures, while intended to protect human life, led to significantly reduced economic activity and a surge in unemployment throughout the U.S., including the markets where our properties are located, and they materially affected our ability to lease our properties and collect rental revenues.\n \n\n\nThe impact of a disease outbreak or other public health event on our business, financial condition, results of operations and cash flows is difficult to predict and, as was demonstrated by the COVID-19 pandemic, will depend on a number of factors, including:\n\n\n•\nthe duration and scope of the event in the U.S.; \t\n\n\n•\nour residents’ and commercial tenants’ ability or willingness to pay rent in full on a timely basis;\n\n\n•\nfederal, state, local and industry-initiated efforts that may adversely affect the ability of landlords, including us, to collect rent and customary fees, adjust rental rates and enforce remedies for the failure to pay rent, such as the various orders that were issued by governmental authorities and public officials during the COVID-19 pandemic to temporarily halt residential evictions;\n\n\n•\nthe regulatory focus on landlords as distinguished from other providers of essential services;\n\n\n16\n\n\n\n\n \n\n\n•\nour ability to renew leases or relet units on favorable terms, or at all, including as a result of unfavorable economic and market conditions in those markets where our properties are located;\n\n\n•\nour ability to lease or relet units due to social distancing or other restrictions that may frustrate our leasing activities;\n\n\n•\nour ability to successfully complete the lease-up of properties in our lease-up portfolio and attain expected rental and occupancy rates due to social distancing or other restrictions that may frustrate our leasing activities, which, for example, led us to temporarily close property amenities and temporarily prohibit public access in our property leasing offices during the COVID-19 pandemic;\n\n\n•\nour ability to continue our apartment unit redevelopment programs and attain increased rental rates for renovated or upgraded units due to social distancing or other restrictions, which, for example, caused us to temporarily suspend our apartment unit redevelopment activities during the COVID-19 pandemic;\n\n\n•\nour ability to complete the construction of properties in our development portfolio on schedule and on budget due to social distancing or other restrictions, labor shortages, supply chain disruptions and escalating labor and material costs;\n\n\n•\nthe impact of supply chain disruptions and inflationary pressures on our normal business operations, including repair and maintenance work and unit renovations and upgrades;\n\n\n•\ndisruption and instability in the financial markets, which experienced significant volatility during the COVID-19 pandemic, or deteriorations in credit and financing conditions (or a refusal or failure of one or more lenders under our unsecured revolving credit facility to fund their respective financing commitment to us), which could affect our ability to access capital necessary to fund our business operations or refinance maturing debt on a timely basis, on attractive terms, or at all, which would adversely affect our ability to meet liquidity and capital expenditure requirements;\n\n\n•\nstock market volatility that negatively affects the market price of our securities, including market conditions unrelated to our operating performance or prospects;\n\n\n•\nthe impact on our workforce of any vaccine mandate implemented by governmental authorities, which could result in employee attrition; and\n\n\n•\nour ability to manage our business to the extent our management or other personnel are impacted in significant numbers and are not willing, available or allowed to conduct work.\n\n\nTo the extent a disease outbreak or other public health event adversely affects our business, financial condition, results of operations and cash flows, it may also have the effect of heightening many of the other risk described in this Annual Report on Form 10-K.\n\n\nActs of violence could decrease the value of our assets and could have an adverse effect on our business and results of operations.\n\n\nOur apartment communities could directly or indirectly be the location or target of actual or threatened terrorist attacks, crimes, shootings or other acts of violence, the occurrence of which could impact the value of our communities through damage, destruction, loss or increased security costs, as well as result in operational losses due to reduced rental demand, and the availability of insurance may be limited or may be subject to substantial costs.  If such an incident were to occur at one of our apartment communities, we may also become subject to significant liability claims. In addition, the adverse effects that actual or threatened terrorist attacks could have on national economic conditions, as well as economic conditions in the markets in which we operate, could similarly have a material adverse effect on our business and results of operations.\n\n\n17\n\n\n\n\n \n\n\nRisks Related to Our Indebtedness and Financing Activities\n\n\nOur substantial indebtedness could adversely affect our financial condition and results of operations.\n\n\nAs of December 31, 2024, the amount of our total debt was $5.0 billion. We may incur additional indebtedness in the future in connection with, among other things, our acquisition, development and operating activities.\n\n\nThe degree of our leverage creates significant risks, including that:\n\n\n•\nwe may be required to dedicate a substantial portion of our funds from operations to servicing our debt and our cash flow may be insufficient to make required payments of principal and interest;  \n\n\n•\ndebt service obligations will reduce funds available for distribution and funds available for acquisitions, development and redevelopment;  \n\n\n•\nwe may be more vulnerable to economic and industry downturns than our competitors that have less debt;  \n\n\n•\nwe may be limited in our ability to respond to changing business and economic conditions; \n\n\n•\nwe may default on our indebtedness, which could result in acceleration of those obligations, assignment of rents and leases and loss of properties to foreclosure; and\n\n\n•\nif one of our subsidiaries defaults, it could trigger a cross default or cross acceleration provision under other indebtedness, which could cause an immediate default or could allow the lenders to declare all funds borrowed thereunder to be due and payable.\n\n\nIf any one of these events was to occur, our financial condition and results of operations could be materially and adversely affected.\n\n\nWe may be unable to renew, repay or refinance our outstanding debt, which could negatively impact our financial condition and results of operations.\n\n\nWe are subject to the normal risks associated with debt financing, including the risk that our cash flow will be insufficient to meet required payments of principal and interest, the risk that either secured or unsecured indebtedness will not be able to be renewed, repaid or refinanced when due or that the terms of any renewal or refinancing will not be as favorable as the existing terms of such indebtedness. If we are unable to refinance our indebtedness on acceptable terms, if at all, we might be forced to dispose of one or more of our apartment communities on disadvantageous terms, which might result in losses to us. Such losses could have a material adverse effect on us and our ability to make payments on our debt and to make distributions. Furthermore, if a property is mortgaged to secure payment of indebtedness and we are unable to meet mortgage payments, the mortgagee could foreclose upon the property, appoint a receiver and receive an assignment of rents and leases or pursue other remedies, all with a consequent loss of our revenues and asset value. Foreclosures could also create taxable income without accompanying cash proceeds, thereby hindering our ability to meet the REIT distribution requirements of the Code.\n\n\nRising interest rates could adversely affect our results of operations and cash flows.\n\n\nWe have incurred and expect in the future to incur indebtedness that bears interest at variable rates. Interest rates increased significantly in 2022 and 2023, and while the Federal Reserve began cutting its benchmark interest rate in 2024, interest rates remain elevated. To the extent the current interest rate environment continues or interest rates increase further, we could experience higher interest expense on our variable-rate debt or increase interest rates when refinancing maturing fixed-rate debt, which could have a material adverse effect on us and our ability to make payments on our debt and to make distributions or cause us to be in default under certain debt instruments. In addition, the current interest rate environment, or any further increase in interest rates, may lead holders of shares of our common stock to demand a higher yield on their shares from distributions by us, which could adversely affect the market price for our common stock. Any increase in the federal funds rate due to key economic indicators, such as the unemployment rate or inflation, may cause interest rates and borrowing costs to rise, which may negatively impact our ability to access the debt markets on favorable terms. Any continued adverse economic conditions could have a material adverse effect on our business, financial condition and results of operations.\n\n\nWe may incur additional debt in the future, which may adversely impact our financial condition.\n\n\nWe currently fund the acquisition and development of apartment communities partially through borrowings (including our commercial paper program and revolving credit facility) as well as from other sources such as sales of apartment communities which no longer meet our investment criteria. In addition, we may fund other of our capital requirements through debt. Our organizational documents do not contain any limitation on the amount of indebtedness that we may incur, and we may incur more debt in the future. Accordingly, subject to limitations on indebtedness set forth in various loan agreements and the indentures governing our unsecured senior notes, we could become more highly leveraged, resulting in an increase in debt service and an increased risk of default on our obligations, which could have a material adverse effect on our financial condition, our ability to access debt and equity capital markets in the future and our ability to make payments on our debt and to make distributions.\n\n\n18\n\n\n\n\n \n\n\nThe restrictive terms of certain of our indebtedness may cause acceleration of debt payments.\n\n\nAs of December 31, 2024, we had outstanding borrowings of $5.0 billion. Our indebtedness contains financial covenants as to interest coverage ratios, maximum secured debt, maintenance of unencumbered asset value, and total debt to gross assets, among others, and cross default provisions with other material debt. Our ability to comply with these financial covenants may be affected by changes in our operating and financial performance, changes in general business and economic conditions, adverse regulatory developments or other events adversely impacting us. In the event that an event of default occurs, our lenders may declare borrowings under the respective loan agreements to be due and payable immediately, which could have a material adverse effect on our financial condition and our ability to make payments on our debt and to make distributions.\n\n\nA downgrade in our credit ratings could have a material adverse effect on our business, financial condition and results of operations.\n\n\nWe have a significant amount of unsecured debt outstanding. We are currently assigned corporate credit ratings from each of the three ratings agencies based on their evaluation of our creditworthiness.  These ratings are based on a number of factors, which include their assessment of our financial strength, liquidity, capital structure, asset quality and sustainability of cash flows and earnings.  If our credit ratings are downgraded or other negative action is taken, we could be required to pay additional interest and fees on our outstanding borrowings.  In addition, a downgrade may adversely impact our ability to borrow secured and unsecured debt, increase our borrowing costs and otherwise limit our access to capital, which could adversely affect our business, financial condition and results of operations.\n\n\nFinancing may not be available and could be dilutive.\n\n\nOur capital requirements depend on numerous factors, including the occupancy and turnover rates of our apartment communities, development and capital expenditures, costs of operations and potential acquisitions. We cannot accurately predict the timing and amount of our capital requirements. If our capital requirements vary materially from our plans, we may require additional financing sooner than anticipated.\n \n\n\nWe and other companies in the real estate industry have experienced limited availability of financing from time to time. Dislocations and liquidity disruptions in capital and credit markets could impact liquidity in the debt markets, which could result in financing terms that are less attractive to us and/or the unavailability of certain types of debt financing.  Likewise, disruptions could impede the ability of our counterparties to perform on their contractual obligations.  Should the capital and credit markets experience volatility and the availability of funds again becomes limited, or be available only on unattractive terms, we will incur increased costs associated with issuing debt instruments.  In addition, it is possible that our ability to access the capital and credit markets may be limited or precluded by these or other factors at a time when we would like, or need, to do so, which would adversely impact our ability to refinance maturing debt and/or react to changing economic and business conditions.  Uncertainty in the credit markets could negatively impact our ability to make acquisitions and make it more difficult or not possible for us to sell properties or may adversely affect the price we receive for properties that we do sell, as prospective buyers may experience increased costs of debt financing or difficulties in obtaining debt financing.  Potential continued disruptions in the financial markets could also have other unknown adverse effects on us or the economy generally and may cause the price of our securities to fluctuate significantly and/or to decline.  If we issue additional equity securities to obtain additional capital, the interest of our existing shareholders could be diluted.\n\n\nRisks Related to MAA’s Organization and Ownership of Its Stock\n\n\nMAA’s ownership limit restricts the transferability of its capital stock.\n\n\nMAA’s charter limits ownership of its capital stock by any single shareholder to 9.9% of the value of all outstanding shares of its capital stock, both common and preferred, unless approved by its Board of Directors. The charter also prohibits anyone from buying shares if the purchase would result in it losing REIT status. This could happen if a share transaction results in fewer than 100 persons owning all of its shares or in five or fewer persons, applying certain broad attribution rules of the Code, owning 50% or more of its shares. If an investor acquires shares in excess of the ownership limit or in violation of the ownership requirements of the Code for REITs, MAA:\n\n\n•\nwill consider the transfer to be null and void;\n\n\n•\nwill not reflect the transaction on its books;\n\n\n•\nmay institute legal action to enjoin the transaction;\n\n\n•\nwill not pay dividends or other distributions with respect to those shares;\n\n\n•\nwill not recognize any voting rights for those shares;\n\n\n•\nwill consider the shares held in trust for its benefit; and\n\n\n19\n\n\n\n\n \n\n\n•\nwill either direct the holder to sell the shares and turn over any profit to MAA, or MAA will redeem the shares. If MAA redeems the shares, the holder will be paid a price equal to the lesser of:\n\n\no\nthe principal price paid for the shares by the holder,\n\n\no\na price per share equal to the market price (as determined in the manner set forth in MAA’s charter) of the applicable capital stock,\n\n\no\nthe market price (as so determined) on the date such holder would, but for the restrictions on transfers set forth in MAA’s charter, be deemed to have acquired ownership of the shares, and\n\n\no\nthe maximum price allowed under the Tennessee Greenmail Act (such price being the average of the highest and lowest closing market price for the shares during the 30 trading days preceding the purchase of such shares or, if the holder of such shares has commenced a tender offer or has announced an intention to seek control of MAA, during the 30 trading days preceding the commencement of such tender offer or the making of such announcement).\n\n\nThe redemption price may be paid, at MAA’s option, by delivering one OP Unit (subject to adjustment from time to time in the event of, among other things, stock splits, stock dividends or recapitalizations affecting its common stock or certain mergers, consolidations or asset transfers by MAA) issued by the Operating Partnership for each excess share being redeemed.\n\n\nIf an investor acquires shares in violation of the limits on ownership described above, the holder may:\n\n\n•\nlose its power to dispose of the shares;\n\n\n•\nnot recognize profit from the sale of such shares if the market price of the shares increases; and\n\n\n•\nbe required to recognize a loss from the sale of such shares if the market price decreases.\n\n\nFuture offerings of debt or equity securities, which may rank senior to MAA’s stock, may adversely affect the market price of MAA’s stock.\n\n\nIf we decide to issue additional debt securities in the future, which would rank senior to MAA’s common stock, it is likely that they will be governed by an indenture or other instrument containing covenants restricting our operating flexibility. Additionally, any equity securities or convertible or exchangeable securities that we issue in the future may have rights, preferences and privileges more favorable than those of MAA’s common stock and may result in dilution to owners of MAA’s common stock. We and, indirectly, MAA’s shareholders, will bear the cost of issuing and servicing such securities. Because our decision to issue debt or equity securities in any future offering will depend on market conditions and other factors beyond our control, we cannot predict or estimate the amount, timing or nature of any future offerings. Thus, holders of MAA’s common stock will bear the risk of our future offerings reducing the market price of MAA’s common stock and diluting the value of their stock holdings.\n\n\nThe form, timing and amount of dividend distributions in future periods may vary and be impacted by economic and other considerations.\n\n\nThough MAA’s Board of Directors has a history of declaring dividends in advance of the quarter they are paid, the form, timing and amount of dividend distributions will be declared, and standing practice changed, at the discretion of the Board of Directors.  The form, timing and amount of dividend distributions will depend on actual cash from operations, our financial condition, capital requirements, the annual distribution requirements under the REIT provisions of the Code and other factors as MAA’s Board of Directors may consider relevant. MAA’s Board of Directors may modify our dividend policy from time to time.\n\n\nProvisions of MAA’s charter and Tennessee law may limit the ability of a third party to acquire control of MAA.\n\n\nOwnership Limit\n\n\nThe 9.9% ownership limit discussed above may have the effect of precluding acquisition of control of MAA by a third party without the consent of MAA’s Board of Directors.\n\n\nPreferred Stock\n\n\nMAA’s charter authorizes its Board of Directors to issue up to 20,000,000 shares of preferred stock, 868,000 of which have been designated as 8.50% Series I Cumulative Redeemable Preferred Stock, which we refer to as MAA Series I preferred stock. In addition to the MAA Series I preferred stock, the Board of Directors may establish the preferences and rights of any other series of preferred shares issued. The issuance of preferred stock could have the effect of delaying or preventing someone from taking control of MAA, even if a change in control were in MAA shareholders’ best interests. As of December 31, 2024, 867,846 shares of preferred stock were issued and outstanding, all of which shares were MAA Series I preferred stock.\n\n\n20\n\n\n\n\n \n\n\nTennessee Anti-Takeover Statutes\n\n\nAs a Tennessee corporation, MAA is subject to various legislative acts, which impose restrictions on and require compliance with procedures designed to protect shareholders against unfair or coercive mergers and acquisitions. These statutes may delay or prevent offers to acquire MAA and increase the difficulty of consummating any such offers, even if MAA’s acquisition would be in MAA shareholders’ best interests.\n\n\nThird-party expectations relating to environmental, social and governance factors may impose additional costs and expose us to new risks.\n\n\nWe have a significant institutional investor base, and there is a heightened focus from institutional investors and other stakeholders on corporate responsibility, specifically related to environmental, social and governance, or ESG, factors. Some institutional investors may use these factors to guide their investment strategies, and many institutional investors focus on positive ESG business practices and may consider a company’s ESG score when making an investment decision.  In addition, many institutional investors may use ESG scores to benchmark companies against their peers. Third-party providers of corporate responsibility ratings and reports on companies have increased in number, resulting in varied and in some cases inconsistent standards. In addition, the criteria by which companies’ ESG practices are assessed are evolving and inconsistent, which could result in greater expectations of us and cause us to undertake costly initiatives to satisfy any new or contradictory criteria.  Alternatively, if we elect not to or are unable to satisfy new criteria or do not meet the criteria of a specific third-party provider, some investors may conclude that our ESG business practices are inadequate. We may face reputational damage in the event that our corporate responsibility standards do not meet the standards set by various stakeholders. In addition, in the event that we communicate certain ESG initiatives and goals, we could fail, or be perceived to have failed, in our achievement of our initiatives or goals, or we could be criticized for the scope of our initiatives or goals or the achievement of our initiatives or goals may be costly. If we fail to satisfy the ESG expectations of investors and other stakeholders or our initiatives are not executed as planned, our reputation and financial results and the market price of MAA’s common stock could be adversely affected.\n\n\nMarket interest rates may have an adverse effect on the market value of MAA’s common stock.\n\n\nThe market price of shares of common stock of a REIT may be affected by the distribution rate on those shares, as a percentage of the price of the shares, relative to market interest rates. If market interest rates increase, prospective purchasers of MAA’s common stock may expect a higher annual distribution rate. Higher interest rates would not, however, result in more funds for MAA to distribute and, in fact, would likely increase MAA’s future borrowing costs and potentially decrease funds available for distribution. This could cause the market price of MAA’s common stock to go down.\n \n\n\nChanges in market conditions or a failure to meet the market’s expectations with regard to our results of operations and cash distributions could adversely affect the market price of MAA’s common stock.\n\n\nWe believe that the market value of a REIT’s equity securities is based primarily upon the market’s perception of the REIT’s growth potential and its current and potential future cash distributions, and is secondarily based upon the real estate market value of the underlying assets. For that reason, MAA’s common stock may trade at prices that are higher or lower than the net asset value per share. To the extent we retain operating cash flow for investment purposes, working capital reserves or other purposes, these retained funds, while increasing the value of our underlying assets, may not correspondingly increase the market price of MAA’s common stock. In addition, we are subject to the risk that our cash flow will be insufficient to pay distributions to MAA’s shareholders. Our failure to meet the market’s expectations with regard to future earnings and cash distributions would likely adversely affect the market price of MAA’s common stock.\n\n\nThe stock markets, including the NYSE, on which MAA lists its common stock, have, at times, experienced significant price and volume fluctuations. As a result, the market price of MAA’s common stock could be similarly volatile, and investors in MAA’s common stock may experience a decrease in the value of their shares, including decreases unrelated to our operating performance or prospects. The market price of MAA’s publicly traded securities may be affected by many factors, including:\n\n\n•\nour financial condition and operating performance and the performance of other similar companies;\n\n\n•\nactual or anticipated differences in our quarterly and annual operating results;\n\n\n•\nchanges in our revenues or earnings estimates or recommendations by securities analysts;\n\n\n•\npublication of research reports about us or our industry by securities analysts;\n\n\n•\nadditions and departures of key personnel;\n\n\n•\ninability to access the capital markets;\n\n\n•\nstrategic decisions by us or our competitors, such as acquisitions, dispositions, spin-offs, joint ventures, strategic investments or changes in business strategy;\n\n\n21\n\n\n\n\n \n\n\n•\nthe issuance of additional shares of MAA’s common stock, or the perception that such sales may occur, including under a forward sale agreement and MAA’s at-the-market share offering program, or ATM program;\n\n\n•\nthe reputation of REITs generally and the reputation of REITs with portfolios similar to ours;\n\n\n•\nthe attractiveness of the securities of REITs in comparison to securities issued by other entities (including securities issued by other real estate companies);\n\n\n•\nan increase in market interest rates, which may lead prospective investors to demand a higher distribution rate in relation to the price paid for MAA’s common stock;\n\n\n•\nthe passage of legislation or other regulatory developments that adversely affect us or our industry;\n\n\n•\nspeculation in the press or investment community;\n\n\n•\nactions by institutional shareholders or hedge funds;\n\n\n•\nthe issuance of ratings, reports and scores related to our corporate responsibility and ESG reports and disclosures;\n\n\n•\nchanges in accounting principles;\n\n\n•\nterrorist acts; and\n\n\n•\ngeneral market conditions, including factors unrelated to our performance.\n\n\nIn the past, securities class action litigation has often been instituted against companies following periods of volatility in their stock price. This type of litigation could result in substantial costs and divert our management’s attention and resources.\n\n\nRisks Related to the Operating Partnership’s Organization and Ownership of OP Units\n\n\nThe Operating Partnership’s existing unitholders have limited approval rights, which may prevent the Operating Partnership’s sole general partner, MAA, from completing a change of control transaction that may be in the best interests of all unitholders of the Operating Partnership and all shareholders of MAA.\n\n\nMAA may not engage in a sale or other disposition of all or substantially all of the assets of the Operating Partnership, dissolve the Operating Partnership or, upon the occurrence of certain triggering events, take any action that would result in any unitholder realizing taxable gain, without the approval of the holders of a majority of the outstanding OP Units held by holders other than MAA or its affiliates, or Class A OP Units. The right of the holders of our Class A OP Units to vote on these transactions could limit MAA’s ability to complete a change of control transaction that might otherwise be in the best interest of all unitholders of the Operating Partnership and all shareholders of MAA.\n\n\nIn certain circumstances, certain of the Operating Partnership’s unitholders must approve the Operating Partnership’s sale of certain properties contributed by the unitholders.\n\n\nIn certain circumstances, as detailed in the limited partnership agreement of the Operating Partnership, the Operating Partnership may not sell or otherwise transfer certain properties unless a specified percentage of the limited partners who were partners in the limited partnership holding such properties at the time of its acquisition by us approves such sale or transfer. The exercise of these approval rights by the Operating Partnership’s unitholders could delay or prevent the Operating Partnership from completing a transaction that may be in the best interest of all unitholders of the Operating Partnership and all shareholders of MAA.\n\n\nMAA, its officers and directors have substantial influence over the Operating Partnership’s affairs.\n\n\nMAA, as the Operating Partnership’s sole general partner and acting through its officers and directors, has a substantial influence on the Operating Partnership’s affairs. MAA, its officers and directors could exercise their influence in a manner that is not in the best interest of the unitholders of the Operating Partnership. Also, as of December 31, 2024, MAA owned approximately 97.4% of the OP Units. As such, MAA has substantial influence on the outcome of substantially all matters submitted to the Operating Partnership’s unitholders for approval.\n\n\nInsufficient cash flow from operations or a decline in the market price of MAA’s common stock may reduce the amount of cash available to the Operating Partnership to meet its obligations.\n\n\nThe Operating Partnership is subject to the risk that its cash flow will be insufficient to make payments on its debt and to make distributions to its unitholders, which may cause MAA to not have the funds to make distributions to its shareholders.  MAA’s failure to meet the market’s expectations with regard to future results of operations and cash distributions would likely adversely affect the market price of its shares and thus potentially reduce MAA’s ability to contribute funds from issuances down to the Operating Partnership, resulting in a lower level of cash available for investment, to make payments on its debt or to make distributions to its unitholders.\n\n\n22\n\n\n\n\n \n\n\nRisks Related to Tax Laws\n\n\nFailure to qualify as a REIT would cause us to be taxed as a corporation, which would significantly reduce funds available for distribution to shareholders.\n\n\nIf MAA fails to qualify as a REIT for federal income tax purposes, MAA will be subject to federal income tax on its taxable income at regular corporate rates without the benefit of the dividends paid deduction applicable to REITs. In addition, unless MAA is entitled to relief under applicable statutory provisions, MAA would be ineligible to make an election for treatment as a REIT for the four taxable years following the year in which it loses its qualification. The additional tax liability resulting from the failure to qualify as a REIT would significantly reduce or eliminate the amount of funds available for distribution to MAA’s shareholders. MAA’s failure to qualify as a REIT also could impair its ability to expand its business and raise capital, and would adversely affect the value of MAA’s common stock.\n\n\nMAA believes that it is organized and qualified as a REIT, and MAA intends to operate in a manner that will allow it to continue to qualify as a REIT. MAA cannot assure, however, that it is qualified or will remain qualified as a REIT. This is because qualification as a REIT involves the application of highly technical and complex provisions of the Code for which there are only limited judicial and administrative interpretations and involves the determination of a variety of factual matters and circumstances not entirely within MAA’s control. In addition, future legislation, new regulations, administrative interpretations or court decisions may significantly change the tax laws or the application of the tax laws with respect to qualification as a REIT for federal income tax purposes or the federal income tax consequences of qualification as a REIT.  Even if MAA qualifies as a REIT, MAA will be subject to various federal, state and local taxes, including property taxes and income taxes on taxable income that MAA does not timely distribute to its shareholders. In addition, MAA may hold certain assets and engage in certain activities that a REIT could not engage in directly through its taxable REIT subsidiaries, or TRS, and those TRS will be subject to federal income tax at regular corporate rates on their taxable income without the benefit of the dividends paid deduction applicable to REITs.\n\n\nFurthermore, we have a subsidiary that has elected to be treated as a REIT, and if our subsidiary REIT were to fail to qualify as a REIT, it is possible that we also would fail to qualify as a REIT unless we (or the subsidiary REIT) could qualify for certain relief provisions. The qualification of our subsidiary REIT as a REIT will depend on satisfaction, on an annual or quarterly basis, of numerous requirements set forth in highly technical and complex provisions of the Code for which there are only limited judicial or administrative interpretations. A determination as to whether such requirements are satisfied involves various factual matters and circumstances not entirely within our control. The fact that we hold substantially all of our assets through the Operating Partnership and its subsidiaries further complicates the application of the REIT requirements for us. No assurance can be given that our subsidiary REIT will qualify as a REIT for any particular year.\n\n\nThe Operating Partnership may fail to be treated as a partnership for federal income tax purposes.\n\n\nWe believe that the Operating Partnership qualifies, and has so qualified since its formation, as a partnership for federal income tax purposes and not as a publicly traded partnership taxable as a corporation. No assurance can be provided, however, that the Internal Revenue Service, or IRS, will not challenge the treatment of the Operating Partnership as a partnership for federal income tax purposes or that a court would not sustain such a challenge. If the IRS were successful in treating the Operating Partnership as a corporation for federal income tax purposes, then the taxable income of the Operating Partnership would be taxable at regular corporate income tax rates. In addition, the treatment of the Operating Partnership as a corporation would cause MAA to fail to qualify as a REIT. See “Failure to qualify as a REIT would cause us to be taxed as a corporation, which would significantly reduce funds available for distribution to shareholders” above.\n\n\nCertain dispositions of property by us may generate prohibited transaction income, resulting in a 100% penalty tax on any gain attributable to the disposition.\n\n\nAny gain resulting from a transfer of property that we hold as inventory or primarily for sale to customers in the ordinary course of business would be treated for federal income tax purposes as income from a prohibited transaction that is subject to a 100% penalty tax.  Since we acquire properties for investment purposes, we do not believe that our occasional transfers or disposals of property would be considered prohibited transactions. Whether property is held for investment purposes is a question of fact that depends on all the facts and circumstances surrounding the particular transaction. As such, the IRS may contend that certain transfers or disposals of properties by us are prohibited transactions. If the IRS were to argue successfully that a transfer or disposition of property constituted a prohibited transaction, then we would be required to pay a 100% penalty tax on any gain allocable to us from the prohibited transaction. In addition, income from a prohibited transaction might adversely affect our ability to satisfy the income tests for qualification as a REIT for federal income tax purposes. A safe harbor to the characterization of the disposition of property as a prohibited transaction and the resulting imposition of the 100% tax is available; however, we cannot assure that we will be able to comply with such safe harbor in connection with any property dispositions.\n\n\n23\n\n\n\n\n \n\n\nLegislative or regulatory income tax changes related to REITs could materially and adversely affect us.\n\n\nThe U.S. federal income tax laws and regulations governing REITs and their shareholders, as well as the administrative interpretations of those laws and regulations, are constantly under review and may be changed at any time, possibly with retroactive effect. No assurance can be given as to whether, when, or in what form changes to the U.S. federal income tax laws applicable to us and MAA’s shareholders may be enacted. Changes to the U.S. federal income tax laws and interpretations of U.S. federal tax laws could adversely affect an investment in MAA’s stock.",
    "item1b": "Item 1B. \nUnresolved Staff Comments.\n\n\nNone.",
    "item1c": "Item 1C. \nCybersecurity.\nCybersecurity Risk Management Program\nWe recognize the importance of maintaining the integrity of our information systems and safeguarding the confidential business and personal information we receive and store about our residents, prospective residents, employees and suppliers. As such, we have implemented a cybersecurity risk management program designed to assess, identify and manage material risks from cybersecurity threats. Our cybersecurity risk management program is designed to employ what we believe are industry best practices, including monitoring and analysis of the threat environment, vulnerability assessments and third-party cybersecurity risks; detecting and responding to cyber attacks, cybersecurity incidents and data breaches; cybersecurity crisis preparedness, incident response plans, and business continuity and disaster recovery capabilities; and investments in cybersecurity infrastructure and program needs.  Key processes in our program include:\n \n•\nregular cybersecurity training and testing for employees with company email and access to connected devices;\n•\ncontinuous security event monitoring, management and incident response;\n•\nregular testing of incident response procedures;\n•\nregular internal reporting;\n•\nregular consulting with external advisors and specialists regarding opportunities and enhancements to strengthen our cyber practices and policies and enhance our cybersecurity maturity;\n•\nindependent third-party testing of our information technology controls and defenses, including penetration tests;\n•\nindependent third-party audits of our cybersecurity controls; and\n•\nannual independent third-party reviews of program maturity based on the National Institute of Standards and Technology (NIST) cybersecurity framework.\nIn addition, as part of our cybersecurity risk management program, we have processes designed to oversee and identify material risks from cybersecurity threats associated with our use of third-party service providers, and our cybersecurity risk management program takes into account third-party systems through which we could be impacted by the compromise of the security of a third-party service provider.  In this regard, we conduct due diligence on third-party service providers with respect to cybersecurity risks prior to entering into relationships with them, and we regularly assess security risks associated with our use of third-party service providers, including onboarding contract employees through the same process we onboard our own employees.  In addition, we contractually require third-party service providers to promptly notify us of any actual or suspected breach impacting our data or operations, and we continuously track mission critical vendors using a third-party monitoring service.\n \nWe maintain a cyber insurance policy, we periodically meet with our insurance broker and insurer to discuss emerging trends in cybersecurity and we utilize self-assessment tools and other services provided by our insurance broker and insurer, including annual tabletop exercises conducted by cybersecurity experts.\nOur cybersecurity risk management program is integrated into our overall risk management system\n. To help identify, assess and manage material risks from cybersecurity threats, we include cyber risk in our enterprise risk management, or ERM, evaluation and strategy process.  Our ERM process takes a top-down, enterprise view of risks; it is an ongoing process consisting of risk identification, risk rating, analysis and action plans, and reporting and monitoring.  Our Vice President Cyber Security has a dotted line reporting relationship to our Chief Administrative Officer and General Counsel to help ensure that risks from cybersecurity threats are considered as part of the broader ERM process. At a management level, our Chief Administrative Officer and General Counsel leads our ERM process.\n\n\n24\n\n\n\n\n \n\n\nWe do not believe that any risks from cybersecurity threats of which we are aware, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition.\n For information regarding the risks we face associated with cybersecurity incidents, see “Risk Factors – We rely on information technology systems in our operations, and any breach or security failure of those systems could materially adversely affect our business, financial condition, results of operations and reputation” included in this Annual Report on Form 10-K.\nGovernance\nThe Audit Committee of our Board of Directors is responsible for oversight of risks from cybersecurity threats.\n \nAt a management level, our cybersecurity risk management program is led by our Chief Technology and Innovation Officer who has over 20 years of experience providing business and information technology, or IT, process consulting and regulatory compliance services, including founding a cyber-security consulting and regulatory compliance firm and serving as Sarbanes-Oxley subject matter specialist for an international public accounting firm, and whose certifications include Certified Public Accountant and Certified Information Systems Auditor.\n  Partnering with our Chief Technology and Innovation Officer is our Vice President Cyber Security, who has over 30 years of IT technical and IT business process experience and has been an IT and cyber security leader for multiple financial services companies. Collectively, our cybersecurity team consists of 5 professionals with an average cybersecurity tenure of 15 years and various relevant certifications. \nMembers of our cybersecurity team deliver regular updates to our Chief Technology and Innovation Officer and Chief Administrative Officer and General Counsel.\nThe Audit Committee of our Board of Directors receives regular reports, including an annual cybersecurity maturity assessment and quarterly scorecards, from our Chief Technology and Innovation Officer. Those reports cover topics related to information security, privacy, and cyber risks and our risk management processes, including the status of any recent cybersecurity events, the emerging threat landscape, and the status of capital investments in our information security infrastructure. \nThe Audit Committee provides regular reports to the full Board of Directors.\n In addition, \nthe Audit Committee and the full Board of Directors have authority to engage external consultants, including legal, accounting or other advisors, such as cybersecurity firms, in carrying out its oversight of our cybersecurity risk management program.\n  Likewise, the Audit Committee or the Board of Directors may request members of management or others to attend meetings at which cybersecurity risk management is addressed.\nAs part of our cybersecurity risk management program, we have adopted an incident response plan which provides for controls and procedures upon the occurrence of a cybersecurity event.  In connection with that plan, we have established a cross-functional critical response team, comprised of members of management under the direction of our \nChief Technology and Innovation Officer and Chief Administrative Officer and General Counsel, which is responsible for monitoring our cybersecurity incident response.\n  In addition, this critical response team performs an impact assessment in the event of the occurrence of a cybersecurity event meeting certain criteria, which is elevated for the team’s review and, if any such cybersecurity event is determined by the critical response team to have the potential to have a material impact on the Company, the cybersecurity event is elevated for further review and assessment by a senior management team, which includes all of the members of our standing crises control committee, and, under certain circumstances, the Audit Committee and/or the full Board of Directors.\n \nCybersecurity risks are part of the broader ERM process overseen by our Board of Directors. ERM risk assessment results are presented annually to the Board of Directors, and status updates are delivered quarterly to the Audit Committee. \n \n\n\n25"
  }
}