{
  "ticker": "MAR",
  "cik": "0001048286",
  "company_name": "MARRIOTT INTERNATIONAL INC /MD/",
  "filing_date": "2025-02-11",
  "accession": "0001628280-25-004818",
  "primary_doc": "mar-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business,” earlier in this report, and the “Properties and Rooms” caption in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” for more information about our company-operated properties.\n \nItem 3.     Legal Proceedings.\nSee the information under the “Litigation, Claims, and Government Investigations” caption in Note 7, which we incorporate here by reference. Within this section, we use a threshold of $1 million in disclosing material environmental proceedings involving a governmental authority, if any.\nFrom time to time, we are also subject to other legal proceedings and claims in the ordinary course of business, including adjustments proposed during governmental examinations of the various tax returns we file. While management presently \n20\nTable of Contents\n    \n                                    \nbelieves that the ultimate outcome of these other proceedings, individually and in aggregate, will not materially harm our financial position, cash flows, or overall trends in results of operations, legal proceedings are inherently uncertain, and unfavorable rulings could, individually or in aggregate, have a material adverse effect on our business, financial condition, or operating results.\nItem 4.     Mine Safety Disclosures.\nNot applicable.\nInformation about our Executive Officers\nSee the information under “Information about our Executive Officers” in Part III, Item 10 of this report for information about our executive officers, which we incorporate here by reference.\nPART II\nItem 5.     Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nMarket Information\nAt January 31, 2025,\n \n275,695,298 shares of our Class A Common Stock (our “common stock”) were outstanding and were held by\n \n29,557 stockholders\n \nof record. Our common stock trades on the Nasdaq Global Select Market under the trading symbol MAR.\nFourth Quarter 2024 Issuer Purchases of Equity Securities\n(in millions, except per share amounts)\nPeriod\nTotal Number of Shares Purchased\nAverage Price per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs \n(1)\nMaximum Number of Shares That May Yet Be Purchased Under the Plans or Programs \n(1)\nOctober 1, 2024 - October 31, 2024\n0.8 \n$\n259.10 \n0.8 \n14.9 \nNovember 1, 2024 - November 30, 2024\n0.3 \n$\n287.09 \n0.3 \n14.6 \nDecember 1, 2024 - December 31, 2024\n0.9 \n$\n288.31 \n0.9 \n13.7 \n(1)\nOn November 9, 2023, we announced that our Board of Directors increased our common stock repurchase authorization by 25 million shares. At year-end 2024, 13.7 million shares remained available for repurchase under Board approved authorizations. We may repurchase shares in the open market or in privately negotiated transactions, and we account for these shares as treasury stock.\nItem 6.     Reserved.\nItem 7.     Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nA discussion regarding our financial condition and results of operations for year-end 2023 compared to year-end 2022 can be found in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, as filed with the SEC on February 13, 2024 (“2023 Form 10-K”).\nBUSINESS AND OVERVIEW\nOverview\nWe are a worldwide operator, franchisor, and licensor of hotel, residential, timeshare, and other lodging properties under more than 30 brand names. We discuss our operations in the following reportable business segments: (1) U.S. & Canada, (2) Europe, Middle East & Africa (“EMEA”), (3) Greater China, and (4) Asia Pacific excluding China (“APEC”). Our Caribbean & Latin America (“CALA”) operating segment does not meet the applicable accounting criteria for separate disclosure as a reportable business segment, and as such, we include its results in “Unallocated corporate and other.”\nUnder our asset-light business model, we typically manage or franchise hotels and other lodging offerings, rather than own them.\n \nTerms of our management agreements vary, but we earn a management fee that is typically composed of a base management fee, which is a percentage of the revenues of the hotel, and an incentive management fee, which is based on the profits of the hotel. In many cases (particularly in our U.S. & Canada, Europe, and CALA regions), incentive management fees are subject to a specified owner return. Under our hotel franchising arrangements, we generally receive an initial application fee and continuing royalty fees, which are typically based on a percentage of room revenues, plus for certain brands, a percentage \n21\nTable of Contents\n    \n                                    \nof food and beverage revenues. We also have license and other agreements with third parties for certain offerings, such as for our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection, under which we receive royalty fees and certain other fees. Additionally, we earn fees for other uses of our intellectual property, including primarily co-branded credit card fees, as well as residential branding fees and certain other licensing fees.\nPerformance Measures \nWe believe Revenue per Available Room (“RevPAR”), which we calculate by dividing property level room revenue by total rooms available for the period, is a meaningful indicator of our performance because it measures the period-over-period change in room revenues. RevPAR may not be comparable to similarly titled measures, such as revenues, and should not be viewed as necessarily correlating with our fee revenue. We also believe occupancy and average daily rate (“ADR”), which are components of calculating RevPAR, are meaningful indicators of our performance. Occupancy, which we calculate by dividing total rooms sold by total rooms available for the period, measures the utilization of a property’s available capacity. ADR, which we calculate by dividing property level room revenue by total rooms sold, measures average room price and is useful in assessing pricing levels. RevPAR, occupancy, and ADR statistics are on a systemwide basis for comparable properties, unless otherwise stated. Unless otherwise stated, all changes refer to year-over-year changes for the comparable period. Comparisons to prior periods are on a constant U.S. dollar basis, which we calculate by applying exchange rates for the current period to the prior comparable period. We believe constant dollar analysis provides valuable information regarding the performance of hotels in our system as it removes currency fluctuations from the presentation of such results.\nWe define our comparable properties as hotels in our system that were open and operating under one of our brands since the beginning of the last full calendar year (since January 1, 2023 for the current period) and have not, in either the current or previous year: (1) undergone significant room or public space renovations or expansions, (2) been converted between company-operated and franchised, or (3) sustained substantial property damage or business interruption. Our comparable properties also exclude MGM Collection with Marriott Bonvoy, Design Hotels, The Ritz-Carlton Yacht Collection, and timeshare properties. For 2024, we had 5,439 comparable U.S. & Canada properties and 1,741 comparable International properties.\nBusiness Trends\nWe saw solid global RevPAR growth during 2024 compared to 2023. In 2024, worldwide RevPAR increased 4.3 percent compared to 2023, reflecting ADR growth of 2.8 percent and occupancy improvement of 1.0 percentage point. The increase in RevPAR was driven by strong year-over-year demand growth in nearly all our regions.\nIn the U.S. & Canada, where demand has normalized, RevPAR increased 3.0 percent in 2024, led by strong demand from group as well as strong demand from transient customer segments across our brand tiers.\nIn EMEA, RevPAR growth of 9.1 percent in 2024 was driven by strong demand in most countries across the region, aided by the 2024 Paris Olympics and other special events. In APEC, RevPAR increased 12.9 percent in 2024, driven by strong demand, including an increase in inbound demand into the region. In CALA, RevPAR increased 8.8 percent in 2024, driven by strong demand throughout the region. In Greater China, RevPAR declined 2.3 percent in 2024 due to lower domestic demand as a result of macro-economic conditions and an increase in outbound travel.\nIn 2024, we launched a comprehensive initiative to enhance our effectiveness and efficiency across the Company. At this point in the process, we expect this initiative to yield $80 million to $90 million of annual general and administrative cost reductions beginning in 2025. These efforts are also anticipated to deliver cost savings to our hotel owners.\nAs part of these efforts, in the second half of 2024, we implemented a voluntary retirement program for certain above-property associates, and some above-property roles in the organization were eliminated or redefined. We substantially completed this initiative as of year-end 2024.\nStarwood Data Security Incident\nOn November 30, 2018, we announced a data security incident involving \nunauthorized access to the Starwood \nreservations database (the “Data Security Incident”). We are currently unable to reasonably estimate the range of total possible financial impact to the Company from the Data Security Incident in excess of the expenses already recorded; however, we do not believe this incident will impact our long-term financial health. See Note 7 for additional information related to legal proceedings and governmental investigations related to the Data Security Incident.\n22\nTable of Contents\n    \n                                    \nSystem Growth and Pipeline\nOur system grew from 8,785 properties (1,597,380 rooms) at year-end 2023 to 9,361 properties (1,706,331 rooms) at year-end 2024. The increase compared to year-end 2023 reflected gross additions of 666 properties (123,389 rooms), including the addition of 16 properties (approximately 38,000 rooms) from our exclusive, long-term strategic licensing agreement with MGM Resorts International and 163 properties (approximately 9,000 rooms) from our long-term agreement with Sonder Holdings Inc., and deletions of 90 properties (14,572 rooms). Our 2024 gross room additions included approximately 52,300 rooms located outside U.S. & Canada and roughly 75,300 rooms converted from competitor brands.\nAt year-end 2024, we had nearly 3,800 properties and over 577,000 rooms in our development pipeline, which includes roughly 29,000 rooms approved for development but not yet under signed contracts. Our development pipeline includes over 229,000 rooms, or 40 percent, that were under construction or in the process of converting to our system at year-end 2024. \nFifty-five percent\n of the rooms in our development pipeline are located outside U.S. & Canada.\nIn 2024, we signed over 1,200 development deals with hotel owners and other counterparties for nearly 162,000 rooms globally. Approximately 34 percent of rooms signed were the result of conversion opportunities. During 2024, we continued to strengthen our luxury portfolio and grow our midscale brands. In December 2024, we also announced the expansion of our outdoor-focused lodging offerings.\nIn 2025, we expect net rooms growth of 4 to 5 percent.\nProperties and Rooms\nThe following table shows our properties and rooms by ownership type.\nProperties\nRooms\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nManaged\n1,981 \n2,046 \n(65)\n(3)\n%\n571,889 \n575,963 \n(4,074)\n(1)\n%\nFranchised/Licensed/Other \n(1) \n7,192 \n6,563 \n629 \n10 \n%\n1,104,446 \n994,354 \n110,092 \n11 \n%\nOwned/Leased\n51 \n50 \n1 \n2 \n%\n14,312 \n13,115 \n1,197 \n9 \n%\nResidential\n137 \n126 \n11 \n9 \n%\n15,684 \n13,948 \n1,736 \n12 \n%\nTotal\n9,361 \n8,785 \n576 \n7 \n%\n1,706,331 \n1,597,380 \n108,951 \n7 \n%\n(1)\nIn addition to franchised, includes our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection.\nLodging Statistics\nThe following table presents RevPAR, occupancy, and ADR statistics for comparable properties for 2024, and 2024 compared to 2023. Systemwide statistics include data from our franchised properties, in addition to our company-operated \n23\nTable of Contents\n    \n                                    \nproperties.\nRevPAR\nOccupancy\nAverage Daily Rate\n2024\nvs. 2023\n2024\nvs. 2023\n2024\nvs. 2023\nComparable Company-Operated Properties\nU.S. & Canada\n$\n177.07 \n3.4 \n%\n69.4 \n%\n0.5 \n%\npts.\n$\n255.23 \n2.6 \n%\nEurope\n$\n215.26 \n7.0 \n%\n72.1 \n%\n0.7 \n%\npts.\n$\n298.73 \n6.0 \n%\nMiddle East & Africa\n$\n132.47 \n11.2 \n%\n68.6 \n%\n2.9 \n%\npts.\n$\n193.15 \n6.5 \n%\nGreater China\n$\n84.57 \n(2.5)\n%\n68.7 \n%\n1.2 \n%\npts.\n$\n123.16 \n(4.2)\n%\nAsia Pacific excluding China\n$\n122.13 \n12.2 \n%\n72.5 \n%\n3.7 \n%\npts.\n$\n168.45 \n6.5 \n%\nCaribbean & Latin America\n$\n182.62 \n8.7 \n%\n66.0 \n%\n2.0 \n%\npts.\n$\n276.82 \n5.5 \n%\nInternational - All \n(1)\n$\n124.96 \n6.6 \n%\n69.9 \n%\n2.1 \n%\npts.\n$\n178.79 \n3.3 \n%\nWorldwide \n(2)\n$\n147.09 \n4.9 \n%\n69.7 \n%\n1.5 \n%\npts.\n$\n211.12 \n2.7 \n%\nComparable Systemwide Properties\nU.S. & Canada\n$\n131.26 \n3.0 \n%\n70.1 \n%\n0.4 \n%\npts.\n$\n187.14 \n2.4 \n%\nEurope\n$\n154.31 \n7.6 \n%\n70.3 \n%\n2.7 \n%\npts.\n$\n219.39 \n3.5 \n%\nMiddle East & Africa\n$\n123.62 \n12.1 \n%\n68.0 \n%\n2.8 \n%\npts.\n$\n181.72 \n7.6 \n%\nGreater China\n$\n78.91 \n(2.3)\n%\n67.7 \n%\n1.0 \n%\npts.\n$\n116.55 \n(3.7)\n%\nAsia Pacific excluding China\n$\n124.66 \n12.9 \n%\n72.5 \n%\n3.8 \n%\npts.\n$\n171.98 \n6.9 \n%\nCaribbean & Latin America\n$\n151.98 \n8.8 \n%\n65.8 \n%\n1.8 \n%\npts.\n$\n231.13 \n5.8 \n%\nInternational - All \n(1)\n$\n121.75 \n7.6 \n%\n69.2 \n%\n2.4 \n%\npts.\n$\n175.89 \n3.9 \n%\nWorldwide \n(2)\n$\n128.23 \n4.3 \n%\n69.8 \n%\n1.0 \n%\npts.\n$\n183.58 \n2.8 \n%\n(1)\nIncludes Europe, Middle East & Africa, Greater China, Asia Pacific excluding China, and Caribbean & Latin America.\n(2)\nIncludes U.S. & Canada and International - All.\nCONSOLIDATED RESULTS\nThe discussion below presents an analysis of our consolidated results of operations for 2024 compared to 2023. Also see the\n \n“Business Trends” section above for further discussion.\nFee Revenues\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nBase management fees\n$\n1,288 \n$\n1,238 \n$\n50 \n4 \n%\nFranchise fees\n3,113 \n2,831 \n282 \n10 \n%\nIncentive management fees\n769 \n755 \n14 \n2 \n%\nGross fee revenues\n5,170 \n4,824 \n346 \n7 \n%\nContract investment amortization\n(103)\n(88)\n(15)\n(17)\n%\nNet fee revenues\n$\n5,067 \n$\n4,736 \n$\n331 \n7 \n%\nThe increase in base management fees primarily reflected higher RevPAR and unit growth ($26 million).\nThe increase in franchise fees primarily reflected higher RevPAR, unit growth ($99 million), higher co-branded credit card fees ($59 million), higher residential branding fees ($36 million), and higher fees from properties that converted from managed to franchised ($31 million).\nThe increase in incentive management fees primarily reflected higher profits at managed hotels. In 2024, we earned incentive management fees from 69 percent of our managed hotels worldwide, compared to 68 percent in 2023. We earned incentive management fees from 31 percent of our U.S. & Canada managed hotels and 85 percent of our International managed hotels in each of 2024 and 2023. In addition, 67 percent of our total incentive management fees in 2024 came from our International managed hotels, primarily in EMEA and APEC, versus 65 percent in 2023.\n24\nTable of Contents\n    \n                                    \nOwned, Leased, and Other\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nOwned, leased, and other revenue\n$\n1,551 \n$\n1,564 \n$\n(13)\n(1)\n%\nOwned, leased, and other - direct expenses\n1,200 \n1,165 \n35 \n3 \n%\nOwned, leased, and other, net\n$\n351 \n$\n399 \n$\n(48)\n(12)\n%\nOwned, leased, and other revenue, net of direct expenses, decreased primarily due to $65 million of higher termination fees recorded in the prior year, largely related to one development project in U.S. & Canada.\nCost Reimbursements\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nCost reimbursement revenue\n$\n18,482 \n$\n17,413 \n$\n1,069 \n6 \n%\nReimbursed expenses\n18,799 \n17,424 \n1,375 \n8 \n%\nCost reimbursements, net\n$\n(317)\n$\n(11)\n$\n(306)\n(2,782)\n%\nCost reimbursements, net (cost reimbursement revenue, net of reimbursed expenses) varies due to timing differences between the costs we incur for centralized programs and services and the related rei\nmbursemen\nts we receive from hotel owners and certain other counterparties.\n \nOver the long term, our centralized programs and services are not designed to impact our economics, either positively or negatively. See Note 2 for more information about the accounting for cost reimbursements, including our Loyalty Program.\nThe decrease in cost reimbursements, net primarily reflected lower revenues, net of expenses, for many of our programs and services, and Loyalty Program activity, which incurred higher program expenses.\nOther Operating Expenses\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nDepreciation, amortization, and other\n$\n183 \n$\n189 \n$\n(6)\n(3)\n%\nGeneral, administrative, and other\n1,074 \n1,011 \n63 \n6 \n%\nRestructuring and merger-related charges\n77 \n60 \n17 \n28 \n%\nGeneral, administrative, and other expenses increased primarily due to higher compensation costs ($53 million) and higher guarantee reserves ($22 million).\nRestructuring and merger-related charges increased primarily due to $37 million of restructuring charges for employee termination benefits discussed in Note 16 and a $30 million reserve for a loan commitment related to the Company’s acquisition of Starwood, partially offset by $35 million of lower charges related to the Data Security Incident discussed in Note 7.\nNon-Operating Income (Expense)\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nGains and other income, net\n$\n31 \n$\n40 \n$\n(9)\n(23)\n%\nInterest expense\n(695)\n(565)\n(130)\n(23)\n%\nInterest income\n40 \n30 \n10 \n33 \n%\nEquity in earnings\n8 \n9 \n(1)\n(11)\n%\nGains and other income, net decreased primarily due to a gain recorded in the prior year on the sale of a hotel in the CALA region ($24 million).\nInterest expense increased primarily due to higher debt balances driven by Senior Notes issuances, net of maturities ($125 million).\n25\nTable of Contents\n    \n                                    \nIncome Taxes\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nProvision for income taxes\n$\n(776)\n$\n(295)\n$\n(481)\n(163)\n%\nOur tax provision increased in 2024 primarily due to intellectual property restructuring transactions resulting in non-U.S. tax benefits in the prior year ($228 million), the prior year release of a tax valuation allowance as the Company concluded it is more likely than not to recognize non-U.S. tax benefits ($223 million), and the prior year release of tax reserves, which was mostly due to the completion of a prior year tax audit ($103 million). The increase was partially offset by a decrease in pre-tax income ($51 million).\nBUSINESS SEGMENTS\nThe following discussion presents an analysis of the operating results of our reportable business segments for 2024 compared to 2023. Also see the\n \n“Business Trends” section above for further discussion.\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nU.S. & Canada\nSegment net fee revenues\n$\n2,875 \n$\n2,734 \n$\n141 \n5 \n%\nSegment profit\n2,640 \n2,724 \n(84)\n(3)\n%\nEMEA\nSegment net fee revenues\n575 \n516 \n59 \n11 \n%\nSegment profit\n512 \n441 \n71 \n16 \n%\nGreater China\nSegment net fee revenues\n249 \n265 \n(16)\n(6)\n%\nSegment profit\n186 \n208 \n(22)\n(11)\n%\nAPEC\nSegment net fee revenues\n340 \n284 \n56 \n20 \n%\nSegment profit\n280 \n243 \n37 \n15 \n%\nProperties\nRooms\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nU.S. & Canada\n6,235 \n5,965 \n270 \n5 \n%\n1,043,224 \n979,631 \n63,593 \n6 \n%\nEMEA\n1,295 \n1,142 \n153 \n13 \n%\n234,167 \n218,167 \n16,000 \n7 \n%\nGreater China\n589 \n525 \n64 \n12 \n%\n172,388 \n159,871 \n12,517 \n8 \n%\nAPEC\n629 \n567 \n62 \n11 \n%\n143,177 \n130,158 \n13,019 \n10 \n%\nIn 2024, net fee revenues grew in U.S. & Canada, EMEA, and APEC compared to 2023, primarily driven by higher RevPAR and unit growth (see the Lodging Statistics and Properties and Rooms tables above for more information), as well as higher profits at managed hotels. In Greater China, net fee revenues decreased in 2024 primarily due to lower RevPAR.\nU.S. & Canada segment profit decreased in 2024 compared to 2023 despite the higher net fee revenues due to $138 million of lower cost reimbursement revenue, net of reimbursed expenses, $59 million of lower owned, leased, and other revenue, net of direct expenses, and $28 million of higher general, administrative, and other expenses. Owned, leased, and other revenue, net of direct expenses decreased primarily due to higher termination fees in the prior year, largely related to one development project. General, administrative, and other expenses increased primarily due to higher guarantee reserves.\nEMEA segment profit increased in 2024 compared to 2023 due to higher net fee revenues and $30 million of lower general, administrative, and other expenses, primarily due to lower litigation accruals, partially offset by $26 million of lower cost reimbursement revenue, net of reimbursed expenses.\nLIQUIDITY AND CAPITAL RESOURCES\nOur Credit Facility\nWe are party to a $4.5 billion multicurrency revolving credit agreement (as amended, the “Credit Facility”). Available borrowings under the Credit Facility support our commercial paper program and general corporate needs. U.S. dollar borrowings under the Credit Facility bear interest at SOFR (the Secured Overnight Financing Rate) plus a spread based on our \n26\nTable of Contents\n    \n                                    \npublic debt rating. We also pay quarterly fees on the Credit Facility at a rate based on our public debt rating. We classify outstanding borrowings under the Credit Facility and outstanding commercial paper borrowings (which generally have short-term maturities of 45 days or less) as long-term based on our ability and intent to refinance the outstanding borrowings on a long-term basis. The Credit Facility expires on December 14, 2027.\nThe Credit Facility contains certain covenants, including a single financial covenant that limits our maximum leverage (consisting of the ratio of Adjusted Total Debt to EBITDA, each as defined in the Credit Facility) to not more than 4.5 to 1.0. Our outstanding public debt does not contain a corresponding financial covenant or a requirement that we maintain certain financial ratios.\n \nWe currently satisfy the covenants in our Credit Facility and public debt instruments, including the leverage covenant under the Credit Facility, and do not expect the covenants will restrict our ability to meet our anticipated borrowing and liquidity needs.\nWe monitor the status of the capital markets and regularly evaluate the effect that changes in capital market conditions may have on our ability to fund our liquidity needs. We believe the Credit Facility, and our access to capital markets, together with cash we expect to generate from operations, remain adequate to meet our liquidity requirements.\nCommercial Paper\nWe issue commercial paper in the U.S. Because we do not have purchase commitments from buyers for our commercial paper, our ability to issue commercial paper is subject to market demand. We do not expect that fluctuations in the demand for commercial paper will affect our liquidity, given our borrowing capacity under the Credit Facility and access to capital markets.\nCash from Operations\nNet cash provided by operating activities decreased by $421 million in 2024 compared to 2023. Net cash provided by operating activities in 2024 reflected a cash outflow of $300 million in the “Restructuring and merger-related charges” caption of our Statements of Cash Flows for the settlement of the guarantee liability associated with the purchase of the Sheraton Grand Chicago (discussed in Note 3). Cash flows for 2023 reflected reduced cash received from U.S. co-branded credit card issuers related to the 2020 prepayment of certain future revenues. Such reductions ended as of year-end 2023. \nOur ratio of current assets to current liabilities was\n \n0.4 to 1.0 at both year-end 2024 and year-end 2023. We have significant borrowing capacity under our Credit Facility should we need additional working capital.\nInvesting Activities Cash Flows\nCapital Expenditures and Other Investments. \nWe made capital and technology expenditures of $750 million in 2024 and $452 million in 2023. Capital and technology expenditures in 2024 increased by $298 million compared to 2023, primarily due to approximately $200 million of spending related to the Sheraton Grand Chicago capitalized assets (discussed in Note 3) and higher than typical spending on our worldwide technology systems transformation, the overwhelming portion of which is expected to be reimbursed over time. In 2023, we also had cash outflows of $101 million due to the City Express brand acquisition.\nWe expect capital expenditures and other investments will total approximately $1.0 billion to $1.1 billion for 2025, including capital and technology expenditures, loan advances, contract acquisition costs, and other investing activities, but excluding any potential property or brand acquisitions, which we cannot forecast with sufficient accuracy and which may be significant. Our anticipated capital and technology expenditures include higher than typical spending on our worldwide technology systems transformation and renovations of hotels in our owned and leased portfolio.\nDispositions.\n Property and asset sales generated $16 million of cash proceeds in 2024 and $71 million in 2023.\nOver time, we have sold lodging properties, both completed and under development, generally subject to long-term management agreements. Our ability to attract third-party purchasers, and their ability to raise the debt and equity capital necessary to acquire such properties, depends in part on the perceived risks in the lodging industry and other constraints inherent in the capital markets. We monitor the status of the capital markets and regularly evaluate the potential impact of changes in capital market conditions on our business operations. We have made, and expect to continue making, selective and opportunistic investments to add units to our lodging business, which may include property acquisitions and renovations, new construction, loans, guarantees, and equity investments. Over time, we seek to minimize capital invested in our business through asset sales subject to long-term management or franchise agreements. \n27\nTable of Contents\n    \n                                    \nFinancing Activities Cash Flows\nDebt. \nDebt increased by $2,574 million in 2024, to $14,447 million at year-end 2024 from $11,873 million at year-end 2023,\n \nprimarily due to the issuances of our Series PP Notes and Series QQ Notes ($1,480 million) and Series NN Notes and Series OO Notes ($1,468 million), partially offset by the maturity of our Series CC Notes ($550 million). See Note 9 for additional information on Senior Notes issuances.\nOur long-term financial objectives include maintaining diversified financing sources, optimizing the mix and maturity of our long-term debt, and reducing our working capital. At year-end 2024, our long-term debt had a weighted average interest rate of 4.5 percent and a weighted average maturity of approximately 5.0 years. The ratio of our fixed-rate long-term debt to our total long-term debt was 0.9 to 1.0 at year-end 2024.\nSee the “Our Credit Facility” caption in this “Liquidity and Capital Resources” section for more information on our Credit Facility.\nShare Repurchases and Dividends. \nWe repurchased\n \n15.4 million shares of our common stock for $3.7 billion in 2024.\n \nYear-to-date through February 7, 2025, we repurchased 1.2 million shares for $350 million. For additional information, see “Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities” in Part II, Item 5.\nOur Board declared the following quarterly cash dividends in 2024: (1) $0.52 per share declared on February 8, 2024 and paid on March 29, 2024 to stockholders of record on February 22, 2024; (2) $0.63 per share declared on May 10, 2024 and paid on June 28, 2024 to stockholders of record on May 24, 2024; (3) $0.63 per share declared on August 2, 2024 and paid on September 30, 2024 to stockholders of record on August 16, 2024; and (4) $0.63 per share declared on November 7, 2024 and paid on December 31, 2024 to stockholders of record on November 21, 2024.\nWe expect to continue to return cash to stockholders through a combination of share repurchases and cash dividends.\nMaterial Cash Requirements\nOur material cash requirements include the following contractual obligations and off-balance sheet arrangements.\n•\nAt year-end 2024, we had $14,447 million of debt plus $3,110 million of future interest payments, of which a total of $1,866 million is payable within the next 12 months from year-end 2024. See Note 9 for further information about our long-term debt and Note 8 for further information about our finance leases.\n•\nWe enter into operating leases primarily for hotels, offices, and equipment, which are discussed in Note 8.\n•\nAt December 31, 2024, projected Deemed Repatriation Transition Tax payments under the 2017 Tax Cuts and Jobs Act totaled $135 million, which is payable within the next 12 months from year-end 2024.\n•\nThe Company had guarantees and letters of credit as of year-end 2024, which are discussed in Note 7. The majority of our remaining guarantee commitments are not expected to be funded within the next 12 months from year-end 2024.\n•\nIn the normal course of business, we enter into purchase commitments related to the programs and services that we typically provide to hotel owners, and we incur other obligations to manage the daily operating needs of the hotels that we manage. Since our contracts with hotel owners generally require reimbursement for expenses incurred in providing these programs and services and managing the daily operating needs of the hotels that we manage, these obligations are not expected to have a material impact on our net income and cash flow over the long term.\nNEW ACCOUNTING STANDARDS\nWe do not expect that accounting standards updates issued to date and that are effective after December 31, 2024 will have a material effect on our Financial Statements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur preparation of financial statements in accordance with GAAP requires management to make estimates and assumptions that affect reported amounts and related disclosures. Management considers an accounting policy and estimate to be critical if: (1) we must make assumptions that were uncertain when the estimate was made; and (2) changes in the estimate, or selection of a different estimate methodology could have a material effect on our consolidated results of operations or financial condition.\n28\nTable of Contents\n    \n                                    \nWhile we believe that our estimates, assumptions, and judgments are reasonable, they are based on information available when the estimate or assumption was made. Actual results may differ significantly. Additionally, changes in our assumptions, estimates or assessments due to unforeseen events or otherwise could have a material impact on our financial position or results of operations.\nSee Note 2 for further information related to our critical accounting policies and estimates, which are as follows:\nLoyalty Program\n, including how we estimate the breakage of hotel points, credit card points, and free night certificates, the volume of points and free night certificates that will be issued under our co-branded credit card agreements, the amount of consideration to which we will be entitled under our co-branded credit card agreements, and the stand-alone selling prices of goods and services provided under our co-branded credit card agreements. Changes in these estimates could result in material changes to our liability for guest loyalty program and Loyalty Program revenue. Based on the conditions existing at December 31, 2024 and holding other factors constant, a one percent decrease in our estimate of the breakage of points could result in an increase in the liability for guest loyalty program of approximately\n \n$50 million. The breakage impact may vary significantly depending on the specific Loyalty Program points for which the anticipated breakage changes.\nGoodwill\n, including how we evaluate the fair value of reporting units and when we record an impairment loss on goodwill. Our reporting units are the same as our operating segments. See Note 14 for more information. During the 2024 fourth quarter, we conducted our annual goodwill impairment test, and no impairment charges were recorded. The estimated fair values of all our reporting units significantly exceeded their carrying amounts at the date of their most recent estimated fair value determination.\nIntangibles and Long-Lived Assets\n, including how we evaluate the fair value of intangibles and long-lived assets and when we record impairment losses on intangibles and long-lived assets. During 2024, we evaluated our intangibles and long-lived asset groups for impairment and did not record any material impairment charges. The estimated fair values of all our indefinite-lived intangible assets significantly exceeded their carrying amounts at the date of their most recent estimated fair value determination.\nItem 7A.    Quantitative and Qualitative Disclosures About Market Risk.\nWe are exposed to market risk primarily from changes in interest rates and currency exchange rates. We manage our exposure to these risks by monitoring available financing alternatives, through the development and application of credit granting policies, and by entering into derivative arrangements. We do not foresee any significant changes in either our exposure to fluctuations in interest rates or currency rates or how we manage such exposure in the future.\nWe use derivative instruments, including cash flow hedges, fair value hedges, net investment in non-U.S. operations hedges, and other derivative instruments, as part of our overall strategy to manage our exposure to market risks associated with fluctuations in interest rates and currency exchange rates. We continue to have exposure to such risks to the extent they are not hedged. See Note 2 for more information on derivative instruments. We use forward contracts not designated as hedging instruments to manage currency exchange rate risk associated with certain cash and intercompany loan balances. We intend to offset the gains and losses related to these forward contracts with the gains and losses related to the remeasurement of our cash and intercompany loan balances, such that there is a negligible effect on earnings. We do not consider the fair value or earnings impact of these forward contracts to be material to our consolidated financial statements.\nWe are exposed to interest rate risk on our floating-rate notes receivable and floating-rate debt, including the effect of interest rate swaps. Changes in interest rates also impact the fair value of our fixed-rate notes receivable and the fair value of our fixed-rate long-term debt.\n29\nTable of Contents\n    \n                                    \nThe following table sets forth the scheduled maturities and the total fair value as of year-end 2024 for our financial instruments that are impacted by interest rate risk:\n \nMaturities by Period\n($ in millions)\n2025\n2026\n2027\n2028\n2029\nThere-\nafter\nTotal Carrying Amount\nTotal Fair Value\nAssets\n - Maturities represent expected principal receipts. Fair values represent assets.\nFixed-rate notes receivable\n$\n7 \n$\n5 \n$\n7 \n$\n4 \n$\n— \n$\n15 \n$\n38 \n$\n33 \nAverage interest rate\n0.75 \n%\nFloating-rate notes receivable\n$\n4 \n$\n76 \n$\n6 \n$\n21 \n$\n— \n$\n— \n$\n107 \n$\n109 \nAverage interest rate\n6.78 \n%\nLiabilities\n - Maturities represent expected principal payments. Fair values represent liabilities.\nFixed-rate debt\n$\n(1,300)\n$\n(1,195)\n$\n(990)\n$\n(1,438)\n$\n(1,279)\n$\n(6,539)\n$\n(12,741)\n$\n(12,402)\nAverage interest rate\n4.43 \n%\nFloating-rate debt\n$\n— \n$\n— \n$\n(1,582)\n$\n— \n$\n— \n$\n— \n$\n(1,582)\n$\n(1,582)\nAverage interest rate\n4.91 \n%\n30\nTable of Contents\n    \n                                    \nItem 8.    Financial Statements.\nThe following financial information is included on the pages indicated:\n \nPage\nManagement’s Report on Internal Control Over Financial Reporting\n32\nReport of Independent Registered Public Accounting Firm\n33\nReport of Independent Registered Public Accounting Firm\n34\nConsolidated Statements of Income\n37\nConsolidated Statements of Comprehensive Income\n38\nConsolidated Balance Sheets\n39\nConsolidated Statements of Cash Flows\n40\nConsolidated Statements of Stockholders’ (Deficit) Equity\n41\nNotes to Consolidated Financial Statements\n42\nBasis of Presentation\n42\nSummary of Significant Accounting Policies\n42\nAcquisition\n49\nEarnings Per Share\n50\nStock-Based Compensation\n50\nIncome Taxes\n51\nCommitments and Contingencies\n53\nLeases\n55\nLong-Term Debt\n56\nIntangible Assets and Goodwill\n57\nProperty and Equipment\n58\nFair Value of Financial Instruments\n59\nAccumulated Other Comprehensive Loss\n59\nBusiness Segments\n60\nRelated Party Transactions\n62\nRestructuring Charges\n62\n31\nTable of Contents\n    \n                                    \nMANAGEMENT’S REPORT ON\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement of Marriott International, Inc. (the “Company”) is responsible for establishing and maintaining adequate internal control over financial reporting and for assessing the effectiveness of internal control over financial reporting. The Company has designed its internal control over financial reporting to provide reasonable assurance on the reliability of financial reporting and the preparation of the consolidated financial statements in accordance with U.S. generally accepted accounting principles.\nThe Company’s internal control over financial reporting includes those policies and procedures that: (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the Company’s transactions and dispositions of the Company’s assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of the consolidated financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Company’s management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the consolidated financial statements.\nBecause of inherent limitations in internal control over financial reporting, such controls may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness of internal controls to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nIn connection with the preparation of the Company’s annual consolidated financial statements, management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in the Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (the “COSO criteria”).\nBased on this assessment, management has concluded that, applying the COSO criteria, as of December 31, 2024, the Company’s internal control over financial reporting was effective to provide reasonable assurance of the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nErnst & Young LLP\n (PCAOB ID: \n42\n), the independent registered public accounting firm that audited the Company’s consolidated financial statements included in this report, has issued an attestation report on the effectiveness of the Company’s internal control over financial reporting, a copy of which appears on the following page.\n32\nTable of Contents\n    \n                                    \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of Marriott International, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Marriott International, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Marriott International, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders’ (deficit) equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes, and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n \n/s/ \nErnst & Young LLP\nTysons, Virginia\nFebruary 11, 2025 \n33\nTable of Contents\n    \n                                    \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of Marriott International, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Marriott International, Inc. (the Company) as of December 31, 2024, and 2023, the related consolidated statements of income, comprehensive income, stockholders’ (deficit) equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n34\nTable of Contents\n    \n                                    \nAccounting for the Loyalty Program\nDescription of the Matter\nDuring 2024, the Company recognized $3,010 million of revenues previously deferred as of December 31, 2023, and had deferred revenue of $7,519 million as of December 31, 2024, associated with the Marriott Bonvoy guest loyalty program (the Loyalty Program). As discussed in Note 2 to the financial statements, the Company recognizes revenue for performance obligations relating to Loyalty Program points and free night certificates as they are redeemed and the related performance obligations are satisfied. The Company recognizes a portion of revenue for the licensed intellectual property performance obligation under the sales-based royalty criteria, with the remaining portion recognized on a straight-line basis over the contract term. Revenue is recognized utilizing complex models based upon the estimated standalone selling price per point and per free night certificate, which includes judgment in making the estimates of variable consideration and breakage of points.\nAuditing Loyalty Program results is complex due to: (1) the complexity of models and high volume of data used to monitor and account for Loyalty Program results, (2) the complexity in accounting for the amendment to one of the Company’s domestic co-branded credit card agreements, as well as the judgment in estimating the relative standalone selling price of the related performance obligations, and (3) the complexity and judgment of estimating the standalone selling price per Loyalty Program point, including both the estimate of variable consideration under the Company’s co-branded credit card agreements which has significant estimation uncertainty associated with projecting future cardholder spending and redemption activity, and the estimated breakage of Loyalty Program points which requires the use of specialists.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s process of accounting for the Loyalty Program. For example, we tested controls over the accounting methods and model used in reporting results of the Loyalty Program, management’s review of the assumptions and data inputs utilized in estimating the standalone selling price per Loyalty Program point, as well as the development of the estimated breakage.\nTo test the recognition of revenues and costs associated with the Loyalty Program, we performed audit procedures that included, among others, testing the clerical accuracy and consistency with US GAAP of the accounting model developed by the Company to recognize revenue and costs associated with the Loyalty Program, and testing significant inputs into the accounting model, including the estimated standalone selling price and recognition of points earned and redeemed during the period. We involved our valuation specialists to assist in our testing procedures with respect to the estimate of relative standalone selling price of the performance obligations associated with the amendment to a domestic co-branded credit card agreement. We involved our actuarial professionals to assist in our testing procedures with respect to the estimate of the breakage of Loyalty Program points. We evaluated management’s methodology for estimating the breakage of Loyalty Program points, and we tested underlying data and actuarial assumptions used in estimating the breakage. We evaluated the reasonableness of management’s assumptions, including projections of cash flows, used to estimate variable consideration under the Company’s co-branded credit cards.\n35\nTable of Contents\n    \n                                    \nAccounting for General and Administrative Expenses and Reimbursed Expenses \nDescription of the Matter\nDuring 2024, the Company recognized $1,074 million of general and administrative expenses and $18,799 million of reimbursed expenses. As discussed in Note 2 to the financial statements, the Company incurs certain expenses that are for the benefit of, and reimbursable from, hotel owners and certain other counterparties. Such amounts are recorded in the period in which the expense is incurred and include judgment with respect to the allocation of certain costs between general and administrative expenses, which are non-reimbursable, and reimbursed expenses.\nAuditing the classification of general and administrative expenses and reimbursed expenses is complex due to: (1) judgment associated with testing management’s conclusions regarding the allocation of costs between reimbursable and non-reimbursable expenses and (2) incentives within management’s compensation structure designed to achieve certain financial targets that exclude the impact of reimbursed expenses.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s process of accounting for reimbursed expenses, general and administrative expenses, and the process for allocating expenses. For example, we tested management’s controls over the review of the allocation of certain costs to determine if they were reasonably classified.\nTo test the recognition of reimbursed expenses for appropriate classification, we performed audit procedures that included, among others, (1) testing manual journal entries made to reimbursed expenses and general and administrative expenses and (2) performing analytical procedures over total reimbursed expenses and general and administrative expenses in order to identify any trends or indicators of material errors in the classification of expenses.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 2002.\nTysons, Virginia\nFebruary 11, 2025 \n36\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC. \nCONSOLIDATED STATEMENTS OF INCOME\nFiscal Years 2024, 2023, and 2022\n(in millions, except per share amounts)\n \n \n2024\n2023\n2022\nREVENUES\nBase management fees\n$\n1,288\n \n$\n1,238\n \n$\n1,044\n \nFranchise fees\n3,113\n \n2,831\n \n2,505\n \nIncentive management fees\n769\n \n755\n \n529\n \nGross fee revenues\n5,170\n \n4,824\n \n4,078\n \nContract investment amortization\n(\n103\n)\n(\n88\n)\n(\n89\n)\nNet fee revenues\n5,067\n \n4,736\n \n3,989\n \nOwned, leased, and other revenue\n1,551\n \n1,564\n \n1,367\n \nCost reimbursement revenue \n(1)\n18,482\n \n17,413\n \n15,417\n \n25,100\n \n23,713\n \n20,773\n \nOPERATING COSTS AND EXPENSES\nOwned, leased, and other - direct\n1,200\n \n1,165\n \n1,074\n \nDepreciation, amortization, and other\n183\n \n189\n \n193\n \nGeneral, administrative, and other\n1,074\n \n1,011\n \n891\n \nRestructuring and merger-related charges\n77\n \n60\n \n12\n \nReimbursed expenses \n(1)\n18,799\n \n17,424\n \n15,141\n \n21,333\n \n19,849\n \n17,311\n \nOPERATING INCOME\n3,767\n \n3,864\n \n3,462\n \nGains and other income, net\n31\n \n40\n \n11\n \nInterest expense\n(\n695\n)\n(\n565\n)\n(\n403\n)\nInterest income\n40\n \n30\n \n26\n \nEquity in earnings\n (1)\n8\n \n9\n \n18\n \nINCOME BEFORE INCOME TAXES\n3,151\n \n3,378\n \n3,114\n \nProvision for income taxes\n(\n776\n)\n(\n295\n)\n(\n756\n)\nNET INCOME\n$\n2,375\n \n$\n3,083\n \n$\n2,358\n \nEARNINGS PER SHARE\nEarnings per share – basic\n$\n8.36\n \n$\n10.23\n \n$\n7.27\n \nEarnings per share – diluted\n$\n8.33\n \n$\n10.18\n \n$\n7.24\n \n(1)\nSee Note 15 for disclosure of related party amounts.\nSee Notes to Consolidated Financial Statements.\n37\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC. \nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFiscal Years 2024, 2023, and 2022\n(in millions)\n \n2024\n2023\n2022\nNet income\n$\n2,375\n \n$\n3,083\n \n$\n2,358\n \nOther comprehensive income (loss)\nForeign currency translation adjustments\n(\n437\n)\n86\n \n(\n389\n)\nOther adjustments, net of tax\n21\n \n(\n4\n)\n2\n \nTotal other comprehensive (loss) income, net of tax\n(\n416\n)\n82\n \n(\n387\n)\nComprehensive income\n$\n1,959\n \n$\n3,165\n \n$\n1,971\n \nSee Notes to Consolidated Financial Statements.\n38\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC. \nCONSOLIDATED BALANCE SHEETS\nFiscal Years Ended 2024 and 2023\n(in millions)\nDecember 31,\n2024\nDecember 31,\n2023\nASSETS\nCurrent assets\nCash and equivalents\n$\n396\n \n$\n338\n \nAccounts and notes receivable, net\n2,795\n \n2,712\n \nPrepaid expenses and other\n294\n \n261\n \n3,485\n \n3,311\n \nProperty and equipment, net\n1,833\n \n1,581\n \nIntangible assets\nBrands\n5,770\n \n5,907\n \nContract acquisition costs and other\n3,718\n \n3,283\n \nGoodwill\n8,731\n \n8,886\n \n18,219\n \n18,076\n \nEquity method investments\n298\n \n308\n \nNotes receivable, net\n136\n \n138\n \nDeferred tax assets\n650\n \n673\n \nOperating lease assets\n845\n \n929\n \nOther noncurrent assets\n716\n \n658\n \n$\n26,182\n \n$\n25,674\n \nLIABILITIES AND STOCKHOLDERS’ DEFICIT\nCurrent liabilities\nCurrent portion of long-term debt\n$\n1,309\n \n$\n553\n \nAccounts payable\n763\n \n738\n \nAccrued payroll and benefits\n1,449\n \n1,390\n \nLiability for guest loyalty program\n3,487\n \n3,328\n \nAccrued expenses and other\n1,641\n \n1,753\n \n8,649\n \n7,762\n \nLong-term debt \n13,138\n \n11,320\n \nLiability for guest loyalty program\n4,032\n \n3,678\n \nDeferred tax liabilities\n81\n \n209\n \nDeferred revenue\n1,103\n \n1,018\n \nOperating lease liabilities\n794\n \n887\n \nOther noncurrent liabilities\n1,377\n \n1,482\n \nStockholders’ deficit\nClass A Common Stock\n5\n \n5\n \nAdditional paid-in-capital\n6,179\n \n6,051\n \nRetained earnings\n16,531\n \n14,838\n \nTreasury stock, at cost\n(\n24,644\n)\n(\n20,929\n)\nAccumulated other comprehensive loss\n(\n1,063\n)\n(\n647\n)\n(\n2,992\n)\n(\n682\n)\n$\n26,182\n \n$\n25,674\n \nSee Notes to Consolidated Financial Statements.\n39\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC. \nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFiscal Years 2024, 2023, and 2022\n(in millions)\n \n \n2024\n2023\n2022\nOPERATING ACTIVITIES\nNet income\n$\n2,375\n \n$\n3,083\n \n$\n2,358\n \nAdjustments to reconcile to cash provided by operating activities:\nDepreciation, amortization, and other (including depreciation and amortization classified in reimbursed expenses) \n(2)\n492\n \n436\n \n400\n \nStock-based compensation\n237\n \n205\n \n192\n \nIncome taxes\n(\n172\n)\n(\n612\n)\n280\n \nLiability for guest loyalty program\n514\n \n301\n \n(\n119\n)\nContract acquisition costs\n(\n341\n)\n(\n221\n)\n(\n149\n)\nRestructuring and merger-related charges\n(\n278\n)\n47\n \n(\n8\n)\nWorking capital changes \n(\n82\n)\n69\n \n(\n542\n)\nOther\n4\n \n(\n138\n)\n(\n49\n)\nNet cash provided by operating activities\n2,749\n \n3,170\n \n2,363\n \nINVESTING ACTIVITIES\nCapital and technology expenditures\n(\n750\n)\n(\n452\n)\n(\n332\n)\nAsset acquisition\n(\n26\n)\n(\n101\n)\n—\n \nDispositions\n16\n \n71\n \n1\n \nLoan advances\n(\n10\n)\n(\n77\n)\n(\n11\n)\nLoan collections\n36\n \n61\n \n14\n \nOther\n—\n \n33\n \n31\n \nNet cash used in investing activities\n(\n734\n)\n(\n465\n)\n(\n297\n)\nFINANCING ACTIVITIES\nCommercial paper/Credit Facility, net\n163\n \n546\n \n(\n182\n)\nIssuance of long-term debt\n2,948\n \n1,918\n \n983\n \nRepayment of long-term debt\n(\n558\n)\n(\n684\n)\n(\n804\n)\nIssuance of Class A Common Stock\n73\n \n29\n \n—\n \nDividends paid\n(\n682\n)\n(\n587\n)\n(\n321\n)\nPurchase of treasury stock\n(\n3,762\n)\n(\n3,953\n)\n(\n2,566\n)\nStock-based compensation withholding taxes \n(\n138\n)\n(\n108\n)\n(\n89\n)\nOther\n—\n \n(\n25\n)\n17\n \nNet cash used in financing activities\n(\n1,956\n)\n(\n2,864\n)\n(\n2,962\n)\nINCREASE (DECREASE) IN CASH, CASH EQUIVALENTS, AND RESTRICTED CASH\n59\n \n(\n159\n)\n(\n896\n)\nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, beginning of period \n(1)\n366\n \n525\n \n1,421\n \nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, end of period \n(1)\n$\n425\n \n$\n366\n \n$\n525\n \n(1)\nThe 2024 amounts include beginning restricted cash of $\n28\n million at December 31, 2023 and ending restricted cash of $\n29\n million at December 31, 2024, which we present in the “Prepaid expenses and other” and “Other noncurrent assets” captions of our Balance Sheets.\n(2)\nWe reclassified depreciation and amortization classified in reimbursed expenses from the “Other” caption within operating activities to the “Depreciation, amortization, and other” caption of our Statements of Cash Flows. We reclassified prior period amounts, which totaled $\n159\n million in 2023 and $\n118\n million in 2022, to conform to our current presentation.\nSee Notes to Consolidated Financial Statements.\n40\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC. \nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ (DEFICIT) EQUITY \nFiscal Years 2024, 2023, and 2022\n(in millions, except per share amounts)\nCommon Shares Outstanding\nTotal\nClass A Common Stock\nAdditional Paid-in-Capital\nRetained Earnings\nTreasury Stock, at Cost\nAccumulated Other Comprehensive Loss \n326.3\n \nBalance at December 31, 2021\n$\n1,414\n \n$\n5\n \n$\n5,892\n \n$\n10,305\n \n$\n(\n14,446\n)\n$\n(\n342\n)\n— \nNet income\n2,358\n \n— \n— \n2,358\n \n— \n— \n— \nOther comprehensive loss\n(\n387\n)\n— \n— \n— \n— \n(\n387\n)\n— \nDividends ($\n1.00\n per share)\n(\n321\n)\n— \n— \n(\n321\n)\n— \n— \n1.1\n \nStock-based compensation plans\n104\n \n— \n73\n \n— \n31\n \n— \n(\n16.8\n)\nPurchase of treasury stock\n(\n2,600\n)\n— \n— \n— \n(\n2,600\n)\n— \n310.6\n \nBalance at December 31, 2022\n568\n \n5\n \n5,965\n \n12,342\n \n(\n17,015\n)\n(\n729\n)\n— \nNet income\n3,083\n \n— \n— \n3,083\n \n— \n— \n— \nOther comprehensive income\n82\n \n— \n— \n— \n— \n82\n \n— \nDividends ($\n1.96\n per share)\n(\n587\n)\n— \n— \n(\n587\n)\n— \n— \n1.4\n \nStock-based compensation plans\n126\n \n— \n86\n \n— \n40\n \n— \n(\n21.5\n)\nPurchase of treasury stock\n(\n3,954\n)\n— \n— \n— \n(\n3,954\n)\n— \n290.5\n \nBalance at December 31, 2023\n(\n682\n)\n5\n \n6,051\n \n14,838\n \n(\n20,929\n)\n(\n647\n)\n— \nNet income\n2,375\n \n— \n— \n2,375\n \n— \n— \n— \nOther comprehensive loss\n(\n416\n)\n— \n— \n— \n— \n(\n416\n)\n— \nDividends ($\n2.41\n per share)\n(\n682\n)\n— \n— \n(\n682\n)\n— \n— \n1.6\n \nStock-based compensation plans\n174\n \n— \n128\n \n— \n46\n \n— \n(\n15.4\n)\nPurchase of treasury stock\n(\n3,761\n)\n— \n— \n— \n(\n3,761\n)\n— \n276.7\n \n(1)\nBalance at December 31, 2024\n$\n(\n2,992\n)\n$\n5\n \n$\n6,179\n \n$\n16,531\n \n$\n(\n24,644\n)\n$\n(\n1,063\n)\n(1)\nOur restated certificate of incorporation authorizes \n800,000,000\n shares of our common stock, with a par value of $\n0.01\n per share and \n10,000,000\n shares of preferred stock, without par value. At year-end 2024, we had \n276,671,710\n of these authorized shares of our common stock and \nno\n preferred stock outstanding.\nSee Notes to Consolidated Financial Statements.\n41\nTable of Contents\n    \n                                    \nMARRIOTT INTERNATIONAL, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \nNOTE 1. \nBASIS OF PRESENTATION \nThe consolidated financial statements present the results of operations, financial position, and cash flows of Marriott International, Inc. and subsidiaries (referred to in this report as “we,” “us,” “Marriott,” or the “Company”). In order to make this report easier to read, we also refer throughout to (1) our Consolidated Financial Statements as our “Financial Statements,” (2) our Consolidated Statements of Income as our “Income Statements,” (3) our Consolidated Balance Sheets as our “Balance Sheets,” (4) our Consolidated Statements of Cash Flows as our “Statements of Cash Flows,” (5) our properties, brands, or markets in the United States and Canada as “U.S. & Canada,” and (6) our properties, brands, or markets in our Europe, Middle East & Africa, Greater China, Asia Pacific excluding China, and Caribbean & Latin America regions, as “International.” References throughout to numbered “Notes” refer to these Notes to Consolidated Financial Statements, unless otherwise stated. In addition, we use the term “hotel owners” throughout this report to refer, collectively, to owners of hotels and other lodging offerings operating in our system pursuant to management agreements, franchise agreements, license agreements or similar arrangements, and we use the term “hotels in our system” to refer to hotels and other lodging offerings operating in our system pursuant to such arrangements, as well as hotels that we own or lease. The terms “hotel owners” and “hotels in our system” exclude Homes & Villas by Marriott Bonvoy\n® \n(which we also exclude from our property and room count), timeshare, residential, and The Ritz-Carlton Yacht Collection\n®\n.\nPreparation of financial statements that conform with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities as of the date of the financial statements, the reported amounts of revenues and expenses during the reporting periods, and the disclosures of contingent liabilities. Accordingly, ultimate results could differ from those estimates.\nThe accompanying Financial Statements reflect all normal and recurring adjustments necessary to present fairly our financial position at fiscal year-end 2024 and fiscal year-end 2023 and the results of our operations and cash flows for fiscal years 2024, 2023, and 2022. We have eliminated all material intercompany transactions and balances between entities consolidated in these Financial Statements.\nNOTE 2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nRevenue Recognition\nBase Management and Incentive Management Fees\n: For our managed properties, we have performance obligations to provide hotel management services and a license to our intellectual property for the use of our brand names. As compensation for such services, we are generally entitled to receive base management fees, which are a percentage of the revenues of properties, and incentive management fees, which are generally based on a measure of hotel profitability. Both the base management and incentive management fees are variable consideration, as the transaction price is based on a percentage of revenue or profit, as defined in each contract. We recognize base management fees on a monthly basis over the term of the agreement as those amounts become payable. We recognize incentive management fees on a monthly basis over the term of the agreement based on each property’s financial results, as long as we do not expect a significant reversal due to projected future hotel performance or cash flows in future periods.\nFranchise Fee and Royalty Fee Revenue\n: For our franchised properties, we have a performance obligation to provide franchisees and operators a license to our intellectual property for use of certain of our brand names. As compensation for such services, we are typically entitled to initial application fees and ongoing royalty fees. Our ongoing royalty fees represent variable consideration, as the transaction price is based on a percentage of certain revenues of the properties, as defined in each contract. We recognize royalty fees on a monthly basis over the term of the agreement as those amounts become payable. Initial application and relicensing fees are fixed consideration payable upon submission of a franchise application or renewal and are recognized on a straight-line basis over the initial or renewal term of the franchise agreements.\nOwned and Leased Hotel Revenue\n: At our owned and leased hotels, we have performance obligations to provide accommodations and other ancillary services to hotel guests. As compensation for such goods and services, we are typically entitled to a fixed nightly fee for an agreed upon period and additional fixed fees for any ancillary services purchased. These fees are generally payable at the time the hotel guest checks out of the hotel. We generally satisfy the performance obligations over time, and we recognize the revenue from room sales and from other ancillary guest services on a daily basis, as the rooms are occupied and we have rendered the services.\nCost Reimbursements\n: Under our agreements with hotel owners and certain other counterparties, we are entitled to be reimbursed for certain costs we incur on behalf of their properties, with no added mark-up. These costs primarily consist of \n42\nTable of Contents\n    \n                                    \npayroll and related expenses at managed properties where we are the employer of the employees at the properties and include certain operational and administrative costs as provided for in our contracts with the hotel owners. We are entitled to reimbursement in the period we incur the related reimbursable costs, which we recognize within the “Cost reimbursement revenue” caption of our Income Statements.\nHotel owners and certain other counterparties participate in certain centralized programs and services, such as marketing, sales, reservations, and insurance programs, which we operate for their benefit. We do not operate these programs and services to generate a profit over the long term, and accordingly, when we recover the costs that we incur for these programs and services from our hotel owners and other counterparties we do not seek a mark-up. The amounts we charge for these programs and services are generally a combination of fixed fees and variable fees based on sales or other metrics and are payable on a monthly basis. We generally recognize revenue within the “Cost reimbursement revenue” caption of our Income Statements when the amounts may be billed to hotel owners and other counterparties, and we recognize expenses within the “Reimbursed expenses” caption as they are incurred. This pattern of recognition results in timing differences between the costs incurred for centralized programs and services and the related reimbursement in our operating and net income. Over the long term, these programs and services are not designed to impact our economics, either positively or negatively.\n \nIn addition, we present in the “\nReimbursed expenses\n” caption of our Income Statements spending funded by the proceeds ($\n664\n million, $\n425\n million after-tax) from the 2017 sale of our interest in Avendra LLC, which we committed would be used for the benefit of hotels in our system. Such spending totaled less than $\n1\n million in 2024, $\n161\n million ($\n120\n million after-tax) in 2023, and $\n69\n million ($\n52\n million after-tax) in 2022. As of December 31, 2024, we have completed our spending funded by the Avendra sale proceeds.\nOther Revenue\n: Includes Global Design fees (described below), termination fees, and other property and brand revenues, which we present within the “Owned, leased, and other revenue” caption of our Income Statements. We generally recognize termination fees when collection is probable and other revenue as services are rendered. Amounts received in advance are deferred as liabilities.\nWe provide certain hotel design and construction review (“Global Design”) services to hotel owners, generally during the period prior to a hotel’s opening or during the period a hotel is converting to a Marriott brand (the “pre-opening period”). As compensation for such services, we may be entitled to receive a fixed fee that is payable during the pre-opening period of the hotel. These services are not a distinct performance obligation, and therefore we recognize the fees on a straight-line basis over the initial term of the management, franchise, or license agreement.\nPractical Expedients and Exemptions\n: We do not disclose the amount of variable consideration that we expect to recognize in future periods in the following circumstances:\n(1) if we recognize the revenue based on the amount invoiced or services performed;\n(2) for sales-based or usage-based royalty promised in exchange for a license of intellectual property; or\n(3) if the consideration is allocated entirely to a wholly unsatisfied promise to transfer a distinct service that forms part of a single performance obligation, and the terms of the consideration relate specifically to our efforts to transfer, or to a specific outcome from transferring the service.\nWe are required to collect certain taxes and fees from customers on behalf of governmental agencies and remit these to the applicable governmental agencies on a periodic basis. We do not include these taxes in determining the transaction price.\nLoyalty Program\n: \nLoyalty Program members earn points based on the money they spend at participating properties; the exchange of timeshare ownership interests; purchases of timeshare interval, fractional ownership, and residential products; and through participation in travel experiences and affiliated partners’ programs, such as those offered by credit card, car rental, airline, and other companies. Members can redeem points for stays at participating properties, airline tickets, airline frequent flyer program miles, rental cars, merchandise, and a variety of other awards. Points cannot be redeemed for cash.\nUnder our Loyalty Program, we have a performance obligation to provide or arrange for the provision of goods or services to Loyalty Program members in exchange for the redemption of points earned from past activities. We operate our Loyalty Program as a cross-brand marketing program to participating properties. Our agreements with hotel owners and certain other counterparties require that properties reimburse us for costs of operating the Loyalty Program, with no added mark-up, including costs related to the following activities, which we expense as incurred in our “Reimbursed expenses” caption of our Income Statements: marketing, promotion, and communications and services provided to Loyalty Program members. We generally receive monthly cash contributions from participating properties based on a portion of qualified spend by Loyalty Program members (when the points are earned). We recognize these contributions into revenue as we provide the related service (when the points are redeemed). The amount of revenue we recognize upon point redemption is based on a blend of historical funding rates and is impacted by our estimate of the “breakage” for points that members will never redeem. Breakage \n43\nTable of Contents\n    \n                                    \nis estimated based on historical member activity and expectations of future member behavior. We recognize revenue net of the redemption cost within our “Cost reimbursement revenue” caption on our Income Statements, as our performance obligation is to facilitate the transaction between the Loyalty Program member and the property or program partner. Our redemption cost could be higher or lower than our revenue recognized in any given period.\nWe have multi-year agreements for our co-branded credit cards associated with our Loyalty Program. Under these agreements, we have performance obligations to provide a license to the intellectual property associated with our brands and marketing lists (“Licensed IP”) to the financial institutions that issue the credit cards, to arrange for the redemption of Loyalty Program points as discussed in the preceding paragraph, and to arrange for the redemption of free night certificates and gift cards provided to cardholders. We receive fees from these agreements, including fixed amounts that are primarily payable at contract inception, and variable amounts that are paid to us monthly over the term of the agreements, generally based on: (1) the number of free night certificates issued or redeemed; (2) the number of Loyalty Program points purchased; (3) the volume of cardholder spend; and (4) the number of gift cards issued. We allocate those fees among the performance obligations, including the Licensed IP, our Loyalty Program points, free night certificates, and gift cards provided to cardholders based on their estimated standalone selling prices. The estimation of the standalone selling prices requires significant judgments based upon generally accepted valuation methodologies regarding the value of our Licensed IP, the amount of funding we will receive, and the number of Loyalty Program points, free night certificates, and gift cards cardholders will ultimately redeem. We base our estimates of these amounts on our historical experience and expectation of future cardholder behavior. We recognize the portion of the Licensed IP revenue that meets the sales-based royalty criteria as the credit cards are used and the remaining portion of the Licensed IP revenue on a straight-line basis over the contract term. In our Income Statements, we primarily recognize Licensed IP revenue in the “Franchise fees” caption, and we recognize a portion in the “Cost reimbursement revenue” caption. We recognize the revenue related to the Loyalty Program points as discussed in the preceding paragraph. We recognize the revenue related to the free night certificates and gift cards when the related service is provided. We recognize revenue net of the redemption cost, as our performance obligation is to facilitate the transaction between the Loyalty Program member and the managed or franchised property.\nContract Balances\n: We generally receive payments from customers as we satisfy our performance obligations. We record a receivable when we have an unconditional right to receive payment and only the passage of time is required before payment is due. We record deferred revenue when we receive payment, or have the unconditional right to receive payment, in advance of the satisfaction of our performance obligations related to franchise application and relicensing fees, Global Design fees, credit card branding license fees, and our Loyalty Program.\nOur current and noncurrent deferred revenue increased by $\n76\n million, to $\n1,299\n million at December 31, 2024, from $\n1,223\n million at December 31, 2023, primarily as a result of revenue deferred in 2024 related to our co-branded credit cards, gift cards, franchise application and relicensing fees, and certain centralized programs and services fees. The increase was partially offset by $\n222\n million of revenue recognized in 2024 that was deferred as of December 31, 2023. \nOur current and noncurrent liability for guest loyalty program increased by $\n513\n million, to $\n7,519\n million at December 31, 2024, from $\n7,006\n million at December 31, 2023, primarily reflecting an increase in points earned by members. The increase was partially\n \noffset by $\n3,010\n million of revenue recognized in 2024, that was deferred as of December 31, 2023. The current portion of our liability for guest loyalty program increased compared to December 31, 2023, due to higher estimated redemptions in the short-term. At each reporting period, we evaluate the estimates used in the recognition of Loyalty Program revenues, including estimates of the breakage of points that members will never redeem and the amount of funding we expect to receive over the life of the agreements with various third parties. In 2024, the updated estimates resulted in a net decrease in revenue, and a corresponding increase\n in the liability for guest loyalty program\n of approximately \n$\n72\n million.\nCosts Incurred to Obtain and Fulfill Contracts with Customers\nWe incur certain costs to obtain and fulfill contracts with customers, which we capitalize and amortize on a straight-line basis over the initial, non-cancellable term of the contract. We classify incremental costs of obtaining a contract with a customer in the “Contract acquisition costs and other” caption of our Balance Sheets, the related amortization in the “Contract investment amortization” caption of our Income Statements, and the cash flow impact in the “Contract acquisition costs” caption of our Statements of Cash Flows. We assess the assets for impairment when events or changes in circumstances indicate that we may not be able to recover the carrying amount. We recognize an impairment loss for the amount by which the carrying amount exceeds the expected net future cash flows. We classify certain direct costs to fulfill a contract with a customer in the “Other noncurrent assets” and “Prepaid expenses and other” captions of our Balance Sheets, and the related amortization in the “Owned, leased, and other - direct” caption of our Income Statements.\n We had capitalized costs to fulfill contracts with customers of $\n419\n million at December 31, 2024 and $\n402\n million at December 31, 2023. See Note 10 for information on capitalized costs incurred to obtain contracts with customers.\n44\nTable of Contents\n    \n                                    \nReal Estate Sales\nWe recognize a gain or loss on real estate transactions when control of the asset transfers to the buyer, generally at the time the sale closes. In sales transactions where we retain a management contract, the terms and conditions of the management contract are generally comparable to the terms and conditions of the management contracts obtained directly with hotel owners in competitive processes.\nRetirement Savings Plan\nWe contribute to tax-qualified retirement plans for the benefit of U.S. employees who meet certain eligibility requirements and choose to participate in the plans. Participating employees specify the percentage or amount of salary they wish to contribute from their compensation, and the Company typically makes matching or supplemental contributions.\n We recognized compensation costs from Company contributions of $\n240\n million in 2024, $\n215\n million in 2023, and $\n137\n million in 2022.\nNon-U.S. Operations\nThe U.S. dollar is the functional currency of our consolidated and unconsolidated entities operating in the U.S. The functional currency of our consolidated and unconsolidated entities operating outside of the U.S. is generally the principal currency of the economic environment in which the entity primarily generates and expends cash. We translate the financial statements of consolidated entities whose functional currency is not the U.S. dollar into U.S. dollars, and we do the same, as needed, for unconsolidated entities whose functional currency is not the U.S. dollar. We translate assets and liabilities at the exchange rate in effect as of the financial statement date and translate income statement accounts using the weighted average exchange rate for the period. We include translation adjustments from currency exchange and the effect of exchange rate changes on intercompany transactions of a long-term investment nature as a separate component of stockholders’ (deficit) equity. We report gains and losses from currency exchange rate changes for intercompany receivables and payables that are not of a long-term investment nature, as well as for third-party transactions, currently in operating costs and expenses.\nStock-Based Compensation\nOur stock-based compensation awards primarily consist of restricted stock units (“RSUs”). We measure compensation costs for our stock-based payment transactions at fair value based on the average of the high and low stock price on the grant date (discounted for the lack of marketability and dividends), and we recognize those costs in our Financial Statements over the vesting period during which the employee provides service in exchange for the award.\nAdvertising Costs\nWe expense costs to produce advertising as they are incurred and to communicate advertising as the communication occurs and record such amounts in our “Reimbursed expenses” caption of our Income Statements to the extent undertaken on behalf of hotel owners.\n We recognized advertising costs of $\n993\n million in 2024, $\n794\n million in 2023, and $\n635\n million in 2022.\nIncome Taxes\nWe record the amounts of taxes payable or refundable for the current year, as well as deferred tax liabilities and assets for the future tax consequences of events we have recognized in our Financial Statements or tax returns, using judgment in assessing future profitability and the likely future tax consequences of those events. We base our estimates of deferred tax assets and liabilities on current tax laws, rates and interpretations, and, in certain cases, business plans and other expectations about future outcomes. We develop our estimates of future profitability based on our historical data and experience, industry projections, micro and macro general economic condition projections, and our expectations. We account for U.S. tax on Global Intangible Low-Taxed Income in the period incurred.\nWe generally recognize the effect of the tax law changes in the period of enactment. Changes in existing tax laws and rates, their related interpretations, and the uncertainty generated by the current economic environment may affect the amounts of our deferred tax liabilities or the valuations of our deferred tax assets over time. Our accounting for deferred tax consequences represents management’s best estimate of future events that can be appropriately reflected in the accounting estimates.\nFor tax positions we have taken or expect to take in a tax return, we apply a more likely than not threshold (that is, a likelihood of more than 50 percent), under which we must conclude a tax position is more likely than not to be sustained, assuming that the position will be examined by the appropriate taxing authority that has full knowledge of all relevant information, to recognize the benefit. In determining our provision for income taxes, we use judgment, reflecting our estimates \n45\nTable of Contents\n    \n                                    \nand assumptions, in applying the more likely than not threshold. We recognize accrued interest and penalties for our unrecognized tax benefits as a component of tax expense. \nSee Note 6 for further information.\nCash and Equivalents\nWe consider all highly liquid investments with an initial maturity of three months or less at date of purchase to be cash equivalents.\nAccounts Receivable \nOur accounts receivable primarily consist of amounts due from hotel owners and include reimbursements of costs we incurred on their behalf. We record an allowance for credit losses measured over the contractual life of the instrument based on an assessment of historical collection activity and current and forecasted future economic conditions by region.\n Our allowance for credit losses was $\n199\n million at December 31, 2024 and $\n197\n million at December 31, 2023.\nAssets Held for Sale\nWe consider properties to be assets held for sale when (1) management commits to a plan to sell the property; (2) it is unlikely that the disposal plan will be significantly modified or discontinued; (3) the property is available for immediate sale in its present condition; (4) actions required to complete the sale of the property have been initiated; (5) sale of the property is probable and we expect the completed sale will occur within one year; and (6) the property is actively being marketed for sale at a price that is reasonable given our estimate of current market value. Upon designation of a property as an asset held for sale, we record the property’s value at the lower of its carrying amount or its estimated fair value, less estimated costs to sell, and we cease depreciation.\nGoodwill \nWe test goodwill for potential impairment at least annually in the fourth quarter, or more frequently if an event or other circumstance indicates that we may not be able to recover the carrying amount of the net assets of the reporting unit. In evaluating goodwill for impairment, we may assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. Factors we consider when making this determination include, but are not limited to, assessing general economic conditions, hospitality industry trends, and overall financial performance of the reporting unit. If we bypass the qualitative assessment, or if we conclude that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, then we perform a quantitative impairment test by comparing the fair value of a reporting unit with its carrying amount.\nWe calculate the estimated fair value of a reporting unit using a combination of the income and market approaches. For the income approach, we use internally developed discounted cash flow models that include the following assumptions, among others: projections of revenues, expenses, and related cash flows based on assumed long-term growth rates and demand trends; expected future investments to grow new units; and estimated discount rates. For the market approach, we use internal analyses based primarily on market comparables. We base these assumptions on our historical data and experience, third-party appraisals, industry projections, micro and macro general economic condition projections, and our expectations.\nWe have had \nno\n goodwill impairment charges for the last three fiscal years.\nIntangibles and Long-Lived Assets\nWe assess indefinite-lived intangible assets for continued indefinite use and for potential impairment annually, or more frequently if an event or other circumstance indicates that we may not be able to recover the carrying amount of the asset. Like goodwill, we may first assess qualitative factors to determine whether it is more likely than not that the fair value of the indefinite-lived intangible is less than its carrying amount. If the carrying amount of the asset exceeds the fair value, we recognize an impairment loss in the amount of that excess.\nWe test definite-lived intangibles and long-lived asset groups for recoverability when changes in circumstances indicate that we may not be able to recover the carrying amount; for example, when there are material adverse changes in projected revenues or expenses, significant underperformance relative to historical or projected operating results, or significant negative industry or economic trends. We also test recoverability when management has committed to a plan to sell or otherwise dispose of an asset group and we expect to complete the plan within a year. We evaluate recoverability of an asset group by comparing its carrying amount, including right-of-use assets, to the future net undiscounted cash flows that we expect the asset group will generate. If the comparison indicates that we will not be able to recover the carrying amount of an asset group, we recognize an impairment loss for the amount by which the carrying amount exceeds the estimated fair value. When we recognize an \n46\nTable of Contents\n    \n                                    \nimpairment loss for assets to be held and used, we depreciate the adjusted carrying amount of those assets over their remaining useful life.\nWe calculate the estimated fair value of an intangible asset or asset group using the income approach or the market approach. We utilize the same assumptions and methodology for the income approach that we describe in the “Goodwill” caption above. For the market approach, we use internal analyses based primarily on market comparables and assumptions about market capitalization rates, growth rates, and inflation.\nInvestments\nWe hold equity interests in ventures established to develop or acquire and own hotel properties or that otherwise support our hospitality operations. We account for these investments as either an equity method investment, a financial asset, or a controlled subsidiary. We apply the equity method of accounting if we have significant influence over the entity, typically when we hold 20 percent or more of the voting common stock (or equivalent) of an investee but do not have a controlling financial interest. In certain circumstances, such as with investments in limited liability companies or limited partnerships, we apply the equity method of accounting when we own as little as three to five percent. We account for financial assets at fair value if it is readily determinable, at our share of the entity’s net assets if the investment qualifies for the net asset value practical expedient, or using the fair value alternative method, whereby investments are measured at cost less impairment, adjusted for observable price changes. We consolidate entities that we control.\nWhen we acquire an investment that qualifies for the equity method of accounting, we determine the acquisition date fair value of the identifiable assets and liabilities. If our carrying amount exceeds our proportional share in the equity of the investee, we amortize the difference on a straight-line basis over the underlying assets’ estimated useful lives when calculating equity method earnings attributable to us, excluding the difference attributable to land, which we do not amortize.\nWe evaluate an investment for impairment when circumstances indicate that we may not be able to recover the carrying amount. When evaluating our ventures, we consider loan defaults, significant underperformance relative to historical or projected operating performance, or significant negative industry or economic trends. Additionally, a venture’s commitment to a plan to sell some or all of its assets could cause us to evaluate the recoverability of the venture’s individual long-lived assets and possibly the venture itself. We impair investments we account for using the equity method of accounting when we determine that there has been an “other-than-temporary” decline in the venture’s estimated fair value compared to its carrying amount. We perform qualitative assessments for investments we account for using the fair value alternative method and we record any associated impairment when the fair value is less than the carrying amount.\nUnder the accounting guidance for the consolidation of variable interest entities, we analyze our variable interests, including equity investments, loans, and guarantees, to determine if an entity in which we have a variable interest is a variable interest entity. Our analysis includes both quantitative and qualitative reviews. We base our quantitative analysis on the forecasted cash flows of the entity, and our qualitative analysis on our review of the design of the entity, its organizational structure including decision-making ability, and relevant financial agreements. We also use our qualitative analysis to determine if we must consolidate a variable interest entity as its primary beneficiary.\nFair Value Measurements\nWe have various financial instruments we must measure at fair value on a recurring basis, including certain marketable securities and derivatives. We also apply the provisions of fair value measurement to various nonrecurring measurements for our financial and nonfinancial assets and liabilities. See Note 12 for further information.\nAccounting standards define fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (an exit price). We measure our assets and liabilities using inputs from the following three levels of the fair value hierarchy:\nLevel 1 inputs are unadjusted quoted prices in active markets for identical assets or liabilities that we have the ability to access at the measurement date.\nLevel 2 inputs include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates, yield curves, etc.), and inputs that are derived principally from or corroborated by observable market data by correlation or other means (market corroborated inputs).\nLevel 3 inputs include unobservable inputs that reflect our assumptions about what factors market participants would use in pricing the asset or liability. We develop these inputs based on the best information available, including our own data.\n47\nTable of Contents\n    \n                                    \nDerivative Instruments\nWe record derivatives at fair value. The designation of a derivative instrument as a hedge and its ability to meet the hedge accounting criteria determine how we reflect the change in fair value of the derivative instrument in our Financial Statements. A derivative qualifies for hedge accounting if, at inception, we expect the derivative will be highly effective in offsetting the underlying hedged cash flows or fair value and we fulfill the hedge documentation standards at the time we enter into the derivative contract. We designate a hedge as a cash flow hedge, a fair value hedge, or a hedge of the net investment in non-U.S. operations based on the exposure we are hedging. For the effective portion of qualifying cash flow hedges, we record changes in fair value in accumulated other comprehensive income (“AOCI”). We release the derivative’s gain or loss from AOCI to match the timing of the underlying hedged items’ effect on earnings. The change in fair value of qualifying fair value hedges as well as changes in fair value of the underlying hedged items to the hedged risks are recorded concurrently in earnings.\nWe review the effectiveness of our hedging instruments quarterly and discontinue hedge accounting for any hedge that we no longer consider to be highly effective. We recognize changes in fair value for derivatives not designated as hedges or those not qualifying for hedge accounting in current period earnings. Upon termination of cash flow hedges, we release gains and losses from AOCI based on the timing of the underlying cash flows or revenue recognized, unless the termination results from the failure of the intended transaction to occur in the expected time frame. Such untimely transactions require us to immediately recognize in earnings the gains and/or losses that we previously recorded in AOCI.\nChanges in interest rates and currency exchange rates expose us to market risk. We manage our exposure to these risks by monitoring available financing alternatives, as well as through development and application of credit granting policies. We also use derivative instruments as part of our overall strategy to manage our exposure to market risks. As a matter of policy, we only enter into transactions that we believe will be highly effective at offsetting the underlying risk, and we do not use derivatives for trading or speculative purposes.\nLeases\nWe determine if an arrangement is a lease or contains a lease at the inception of the contract. We evaluate leases for classification as operating or financing upon lease commencement. Our leases generally contain fixed and variable components. The variable components of our leases are primarily based on operating performance of the leased property. Our lease agreements may also include non-lease components, such as common area maintenance, which we combine with the lease component to account for both as a single lease component.\nLease liabilities, which represent our obligation to make lease payments arising from the lease, and corresponding right-of-use assets, which represent our right to use an underlying asset for the lease term, are recognized at the commencement date of the lease based on the present value of fixed future payments over the lease term. We calculate the present value of future payments using the discount rate implicit in the lease, if available, or our incremental borrowing rate.\nFor operating leases, lease expense relating to fixed payments is recognized on a straight-line basis over the lease term and lease expense relating to variable payments is expensed as incurred. For finance leases, the amortization of the asset is recognized over the shorter of the lease term or useful life of the underlying asset.\nGuarantees\nWe measure and record our liability for the fair value of a guarantee on a nonrecurring basis, that is when we issue or modify a guarantee. We base our calculation of the estimated fair value of a guarantee on the income approach or the market approach, depending on the type of guarantee. For the income approach, we use internally developed discounted cash flow and Monte Carlo simulation models that include the following assumptions, among others: projections of revenues and expenses and related cash flows based on assumed growth rates and demand trends; historical volatility of projected performance; the guaranteed obligations; and applicable discount rates. We base these assumptions on our historical data and experience, industry projections, micro and macro general economic condition projections, and our expectations. For the market approach, we use internal analyses based primarily on market comparable data and our assumptions about market capitalization rates, credit spreads, growth rates, and inflation.\nThe offsetting entry for the guarantee liability depends on the circumstances in which the guarantee was issued. Funding under the guarantee reduces the recorded liability. In most cases, when we do not forecast any funding, we amortize the liability into income on a straight-line basis over the remaining term of the guarantee. On a quarterly basis, we evaluate all material estimated liabilities based on the operating results and the terms of the guarantee. If we conclude that it is probable that we will be required to fund a greater amount than previously estimated, we record a loss except to the extent that the applicable contracts provide that the advance can be recovered as a loan.\n48\nTable of Contents\n    \n                                    \nSelf-Insurance Programs\nWe self-insure for certain levels of liability, workers’ compensation, property insurance, and employee medical coverage. We accrue estimated costs of these self-insurance programs at the present value of projected settlements for known and incurred but not reported claims. We use a discount rate of \n4.25\n percent, based upon market rates, to determine the present value of the projected settlements, which we consider to be reasonable given our history of settled claims, including payment patterns and the fixed nature of the individual settlements. We classify the current portion of our self-insurance reserve in the “Accrued expenses and other” caption and the noncurrent portion in the “Other noncurrent liabilities” caption of our Balance Sheets.\n The current portion of our self-insurance reserve was $\n198\n million at December 31, 2024 and $\n172\n million at December 31, 2023. The noncurrent portion of our self-insurance reserve was $\n422\n million at December 31, 2024 and $\n387\n million at December 31, 2023.\nLegal Contingencies\nWe are subject to various legal proceedings and claims, the outcomes of which are uncertain. We record an accrual for legal contingencies when we determine that it is probable that we have incurred a liability and we can reasonably estimate the amount of the loss. In making such determinations we evaluate, among other things, the probability of an unfavorable outcome and, when we believe it probable that a liability has been incurred, our ability to make a reasonable estimate of the loss. We review these accruals each reporting period and make revisions based on changes in facts and circumstances.\nBusiness Combinations\nWe allocate the purchase price of an acquisition to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values at the acquisition date. We recognize as goodwill the amount by which the purchase price of an acquired entity exceeds the net of the fair values assigned to the assets acquired and liabilities assumed. In determining the fair values of assets acquired and liabilities assumed, we use various recognized valuation methods including the income and market approaches. Further, we make assumptions within certain valuation techniques, including discount rates, royalty rates, and the amount and timing of future cash flows. We record the net assets and results of operations of an acquired entity in our Financial Statements from the acquisition date. We initially perform these valuations based upon preliminary estimates and assumptions by management or independent valuation specialists under our supervision, where appropriate, and make revisions as estimates and assumptions are finalized. We expense acquisition-related costs as we incur them.\nAsset Acquisitions\nAcquisitions that do not meet the definition of a business are accounted for as asset acquisitions. We allocate the cost of the acquisition, including direct and incremental transaction costs, to the individual assets acquired and liabilities assumed on a relative fair value basis. Goodwill is not recognized in an asset acquisition.\nNew Accounting Standards Adopted\nAccounting Standards Update (“ASU”) 2023-07 - “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures”:\n ASU 2023-07, issued by the Financial Accounting Standards Board, requires the disclosure of significant segment expenses by reportable segment if such expenses are regularly provided to the chief operating decision maker (“CODM”) and included in each reported measure of segment profit or loss. ASU 2023-07 also requires disclosure of the CODM’s title and position and an explanation of how the CODM uses the reported measure of a segment profit or loss in assessing segment performance and allocating resources. We adopted ASU 2023-07 retrospectively in the 2024 fourth quarter to the disclosures presented in Note 14.\nNOTE 3. \nACQUISITION \nIn the 2024 fourth quarter, we completed the asset acquisition of the Sheraton Grand Chicago hotel and the fee simple interest in the land underlying the hotel for a purchase price of $\n514\n million, including direct transaction costs. This acquisition is the result of a 2017 transaction in which we granted the owner a one-time right to require us to purchase the leasehold interest in the land and the hotel for $\n300\n million in cash (the “put option”), which we previously accounted for as a guarantee liability. In January 2024, the owner exercised the put option, and at the same time the put transaction closed, we exercised our option to purchase the fee simple interest in the underlying land for an additional $\n200\n million in cash. We determined that the capitalizable value of the acquired assets was $\n214\n million on the acquisition date. We estimated the fair value of the hotel and land using a combination of two income approaches, which included Level 3 inputs such as forecasted future net cash flows, property resale value, and discount rates. We recorded the acquired assets in the Property and equipment, net caption of our Balance Sheets and applied the remaining $\n300\n million of the purchase price to the release of the guarantee liability.\n49\nTable of Contents\n    \n                                    \nNOTE 4. \nEARNINGS PER SHARE\nThe table below illustrates the reconciliation of the earnings and number of shares used in our calculations of basic and diluted earnings per share, the latter of which uses the treasury stock method to calculate the dilutive effect of the Company’s potential common stock: \n(in millions, except per share amounts)\n2024\n2023\n2022\nComputation of Basic Earnings Per Share\nNet income\n$\n2,375\n \n$\n3,083\n \n$\n2,358\n \nShares for basic earnings per share\n284.2\n \n301.5\n \n324.4\n \nBasic earnings per share\n$\n8.36\n \n$\n10.23\n \n$\n7.27\n \nComputation of Diluted Earnings Per Share\nNet income\n$\n2,375\n \n$\n3,083\n \n$\n2,358\n \nShares for basic earnings per share\n284.2\n \n301.5\n \n324.4\n \nEffect of dilutive securities\nStock-based compensation\n1.0\n \n1.4\n \n1.4\n \nShares for diluted earnings per share\n285.2\n \n302.9\n \n325.8\n \nDiluted earnings per share\n$\n8.33\n \n$\n10.18\n \n$\n7.24\n \nNOTE 5. \nSTOCK-BASED COMPENSATION\nRSUs and PSUs\n \nWe granted RSUs in 2024 to certain officers and employees, and those units vest generally over \nfour years\n in equal annual installments commencing \none year\n after the grant date. We also granted performance-based RSUs (“PSUs”) in 2024 to certain executives, which are earned subject to continued employment and the satisfaction of certain performance and market conditions based on the degree of achievement of pre-established targets for 2026 adjusted EBITDA performance and relative total stockholder return over the 2024 to 2026 performance period.\nWe had deferred compensation costs for unvested awards for RSUs, including PSUs, of approximately $\n173\n million at year-end 2024 and $\n171\n million at year-end 2023. The weighted average remaining term for RSUs outstanding at year-end 2024 was \n2.2\n years.\nThe following table provides additional information on RSUs, including PSUs, for the last three fiscal years:\n2024\n2023\n2022\nStock-based compensation expense (in millions)\n$\n203\n \n$\n179\n \n$\n181\n \nWeighted average grant-date fair value (per unit)\n$\n222\n \n$\n167\n \n$\n168\n \nAggregate intrinsic value of distributed RSUs (in millions)\n$\n340\n \n$\n297\n \n$\n253\n \nThe following table presents the changes in our outstanding RSUs, including PSUs, during 2024 and the associated weighted average grant-date fair values:\nNumber of RSUs (in millions)\nWeighted Average Grant-Date Fair Value (per unit)\nOutstanding at year-end 2023\n3.1\n \n$\n144\n \nGranted\n1.0\n \n222\n \nDistributed\n(\n1.4\n)\n133\n \nForfeited\n(\n0.1\n)\n178\n \nOutstanding at year-end 2024\n2.6\n \n$\n178\n \nOther Information\nAt year-end 2024, we had approximately \n11\n million remaining shares authorized for grant under the 2023 Marriott International, Inc. Stock and Cash Incentive Plan.\n50\nTable of Contents\n    \n                                    \nNOTE 6. \nINCOME TAXES\nThe components of our earnings before income taxes for the last three fiscal years consisted of:\n(in millions)\n2024\n2023\n2022\nU.S.\n$\n1,717\n \n$\n2,113\n \n$\n2,268\n \nNon-U.S.\n1,434\n \n1,265\n \n846\n \n$\n3,151\n \n$\n3,378\n \n$\n3,114\n \nOur (provision) benefit for income taxes for the last three fiscal years consisted of:\n(in millions)\n2024\n2023\n2022\nCurrent\n-U.S. Federal\n$\n(\n447\n)\n$\n(\n431\n)\n$\n(\n364\n)\n-U.S. State\n(\n124\n)\n(\n158\n)\n(\n82\n)\n-Non-U.S.\n(\n282\n)\n(\n249\n)\n(\n155\n)\n(\n853\n)\n(\n838\n)\n(\n601\n)\nDeferred\n-U.S. Federal\n125\n \n94\n \n(\n129\n)\n-U.S. State\n19\n \n16\n \n(\n25\n)\n-Non-U.S.\n(\n67\n)\n433\n \n(\n1\n)\n77\n \n543\n \n(\n155\n)\n$\n(\n776\n)\n$\n(\n295\n)\n$\n(\n756\n)\nUnrecognized Tax Benefits\nThe following table reconciles our unrecognized tax benefit balance for each year from the beginning of 2022 to the end of 2024: \n(in millions)\nAmount\nUnrecognized tax benefit at beginning of 2022\n$\n282\n \nChange attributable to tax positions taken in prior years\n(\n15\n)\nChange attributable to tax positions taken during the current period\n3\n \nDecrease attributable to settlements with taxing authorities\n(\n15\n)\nUnrecognized tax benefit at year-end 2022\n255\n \nChange attributable to tax positions taken in prior years\n(\n90\n)\nChange attributable to tax positions taken during the current period\n16\n \nDecrease attributable to settlements with taxing authorities\n(\n9\n)\nUnrecognized tax benefit at year-end 2023\n172\n \nChange attributable to tax positions taken in prior years\n(\n4\n)\nChange attributable to tax positions taken during the current period\n17\n \nDecrease attributable to settlements with taxing authorities\n(\n2\n)\nUnrecognized tax benefit at year-end 2024\n$\n183\n \nOur unrecognized tax benefit balance included $\n171\n million at year-end 2024, $\n161\n million at year-end 2023, and $\n241\n million at year-end 2022 of tax positions that, if recognized, would impact our effective tax rate. It is reasonably possible that within the next 12 months we will reach resolution of income tax examinations in one or more jurisdictions. The actual amount of any change to our unrecognized tax benefits could vary depending on the timing and nature of the settlement. Therefore, an estimate of the change cannot be provided. We recognize accrued interest and penalties for our unrecognized tax benefits as a component of tax expenses. Related interest expense totaled $\n14\n million in 2024, $\n6\n million in 2023, and $\n13\n million in 2022. We accrued interest and penalties related to our unrecognized tax benefits of approximately $\n63\n million at year-end 2024 and $\n52\n million at year-end 2023.\nWe file income tax returns, including returns for our subsidiaries, in various jurisdictions around the world. The U.S. Internal Revenue Service has examined our federal income tax returns, and as of year-end 2024, we have settled all issues for \n51\nTable of Contents\n    \n                                    \ntax years through 2022. Our 2023 and 2024 tax year audits are currently ongoing. Various foreign, state, and local income tax returns are also under examination by the applicable taxing authorities.\nDeferred Income Taxes\nDeferred income tax balances reflect the effects of temporary differences between the carrying amounts of assets and liabilities and their tax bases, as well as from net operating loss and tax credit carry-forwards. We state those balances at the enacted tax rates we expect will be in effect when we pay or recover the taxes. Deferred income tax assets represent amounts available to reduce income taxes we will pay on taxable income in future years. We evaluate our ability to realize these future tax deductions and credits by assessing whether we expect to have sufficient future taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings, and available tax planning strategies to utilize these future deductions and credits. We establish a valuation allowance when we no longer consider it more likely than not that a deferred tax asset will be realized.\nThe following table presents the tax effect of each type of temporary difference and carry-forward that gave rise to significant portions of our deferred tax assets and liabilities as of year-end 2024 and year-end 2023:\n(in millions)\nAt Year-End 2024\nAt Year-End 2023\nDeferred Tax Assets\nEmployee benefits\n$\n302\n \n$\n265\n \nNet operating loss carry-forwards\n1,046\n \n1,132\n \nAccrued expenses and other reserves\n153\n \n219\n \nTax credits\n62\n \n64\n \nLoyalty Program\n313\n \n277\n \nDeferred income\n114\n \n102\n \nLease liabilities\n239\n \n266\n \nInterest limitation\n123\n \n67\n \nProperty and equipment\n15\n \n—\n \nOther\n36\n \n40\n \nDeferred tax assets\n2,403\n \n2,432\n \nValuation allowance\n(\n1,070\n)\n(\n1,149\n)\nDeferred tax assets after valuation allowance\n1,333\n \n1,283\n \nDeferred Tax Liabilities\nProperty and equipment\n—\n \n(\n62\n)\nIntangibles\n(\n477\n)\n(\n471\n)\nRight-of-use assets\n(\n223\n)\n(\n248\n)\nSelf-insurance\n(\n6\n)\n(\n22\n)\nOther\n(\n58\n)\n(\n16\n)\nDeferred tax liabilities\n(\n764\n)\n(\n819\n)\nNet deferred taxes\n$\n569\n \n$\n464\n \nOur valuation allowance is primarily attributable to non-U.S. net operating loss carry-forwards.\nAt year-end 2024, we had approximately $\n50\n million of tax credits that will expire through 2034 and $\n12\n million of tax credits that do not expire. We recorded $\n22\n million of net operating loss benefits in 2024 and $\n25\n million in 2023. At year-end 2024, we had approximately $\n4,611\n million of primarily state and foreign net operating losses, of which $\n2,963\n million will expire through 2044.\nWe made no provision for U.S. income taxes or additional non-U.S. taxes on certain undistributed earnings of non-U.S. subsidiaries. These earnings could become subject to additional taxes if the non-U.S. subsidiaries dividend or loan those earnings to an affiliate or if we sell our interests in the non-U.S. subsidiaries. We cannot practically estimate the amount of additional taxes that might be payable on the undistributed earnings.\n52\nTable of Contents\n    \n                                    \nReconciliation of U.S. Federal Statutory Income Tax Rate to Actual Income Tax Rate\nThe following table reconciles the U.S. statutory tax rate to our effective income tax rate for the last three fiscal years:\n2024\n2023\n2022\nU.S. statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nU.S. state income taxes, net of U.S. federal tax benefit\n2.4\n \n2.8\n \n2.8\n \nNon-U.S. income \n1.6\n \n0.3\n \n(\n0.5\n)\nChange in valuation allowance\n(\n0.9\n)\n(\n5.8\n)\n0.4\n \nChange in uncertain tax positions\n0.4\n \n(\n2.3\n)\n0.3\n \nExcess tax benefits related to equity awards\n(\n1.0\n)\n(\n0.8\n)\n(\n0.7\n)\nU.S. tax on foreign earnings\n1.0\n \n1.1\n \n0.2\n \nIntellectual property restructuring\n0.0\n \n(\n7.9\n)\n0.0\n \nOther, net\n0.1\n \n0.3\n \n0.8\n \nEffective rate\n24.6\n \n%\n8.7\n \n%\n24.3\n \n%\nOther Information\nWe paid cash for income taxes, net of refunds, of $\n947\n million in 2024, $\n907\n million in 2023, and $\n476\n million in 2022.\n \nNOTE 7. \nCOMMITMENTS AND CONTINGENCIES\nGuarantees\nWe issue guarantees to certain lenders and hotel owners, chiefly to obtain long-term management and franchise contracts. The guarantees generally have a stated maximum funding amount and a term of \nthree\n to \n10\n years. The terms of guarantees to lenders generally require us to fund if cash flows from hotel operations are inadequate to cover annual debt service or to repay the loan at maturity. The terms of the guarantees to hotel owners generally require us to fund if the hotels do not attain specified levels of operating profit. Guarantee fundings to lenders and hotel owners are generally recoverable out of future hotel cash flows and/or proceeds from the sale or refinancing of hotels.\nWe present the maximum potential amount of our future guarantee fundings and the carrying amount of our liability for our debt service, operating profit, and other guarantees for which we are the primary obligor at year-end 2024 in the following table:\n(in millions)\nGuarantee Type\nMaximum Potential\nAmount\nof Future Fundings\nRecorded Liability for\nGuarantees\nDebt service\n$\n62\n \n$\n6\n \nOperating profit\n140\n \n89\n \nOther\n18\n \n4\n \n$\n220\n \n$\n99\n \nOur liability at year-end 2024 for guarantees for which we are the primary obligor is reflected in our Balance Sheets as $\n14\n million of “Accrued expenses and other” and $\n85\n million of “Other noncurrent liabilities.”\nOur maximum potential guarantees listed in the preceding table include $\n59\n million of operating profit guarantees that will not be in effect until the underlying properties open and we begin to operate the properties or certain other events occur.\nIn conjunction with financing obtained for specific projects or properties owned by us or entities in which we have an investment, we may provide industry standard indemnifications to the lender for loss, liability, or damage occurring as a result of the actions of the entity or our own actions.\n53\nTable of Contents\n    \n                                    \nLetters of Credit \nAt year-end 2024, we had $\n130\n million of letters of credit outstanding (all outside the Credit Facility, as defined in Note 9), most of which were for our self-insurance programs. Surety bonds issued as of year-end 2024 totaled $\n185\n million, most of which state governments requested in connection with our self-insurance programs. \nStarwood Data Security Incident\nDescription of Event\nOn November 30, 2018, we announced a data security incident involving \nunauthorized access to \nthe Starwood Hotels & Resorts Worldwide, LLC, formerly known as Starwood Hotels & Resorts Worldwide, Inc. (“Starwood”), reservations database \n(the “Data Security Incident”). Working with leading security experts, we\n determined that there was unauthorized access to the \nStarwood network since 2014 and that an unauthorized party had copied information from the Starwood reservations database and taken steps towards removing it. We discontinued use of the Starwood reservations database for business operations at the end of 2018.\nLitigation, Claims, and Government Investigations\nFollowing our announcement of the Data Security Incident, approximately \n100\n lawsuits were filed by consumers and others against us in U.S. federal, U.S. state and Canadian courts related to the incident. The plaintiffs in the cases that remain pending, who generally purport to represent various classes of consumers, generally claim to have been harmed by alleged actions and/or omissions by the Company in connection with the Data Security Incident and assert a variety of common law and statutory claims seeking monetary damages, injunctive relief, costs and attorneys’ fees, and other related relief. The active U.S. cases are consolidated in the U.S. District Court for the District of Maryland (the “District Court”), pursuant to orders of the U.S. Judicial Panel on Multidistrict Litigation (the “MDL”). The District Court granted in part and denied in part class certification of various U.S. groups of consumers. In August 2023, the U.S. Court of Appeals for the Fourth Circuit (the “Fourth Circuit”) vacated the District Court’s class certification decision because the District Court failed to first consider the effect of a class-action waiver signed by all putative class members. On remand, after briefing, the District Court issued an order reinstating the same classes that had previously been certified. We promptly petitioned the Fourth Circuit, seeking leave to appeal that ruling. The Fourth Circuit granted that petition on January 18, 2024, oral argument was held on November 1, 2024, and we await a decision. A case brought by the City of Chicago (which is consolidated in the MDL proceeding) also remains pending. The Canadian cases have effectively been consolidated into a single case in the province of Ontario. We dispute the allegations in these lawsuits and are vigorously defending against such claims. \nIn addition, various U.S. federal, U.S. state and foreign governmental authorities made inquiries, opened investigations, or requested information and/or documents related to the Data Security Incident and related matters. Most of these matters have been resolved or no longer appear to be active. In the 2024 fourth quarter, we reached final resolutions with the U.S. Federal Trade Commission and the Attorney General offices from 49 U.S. states and the District of Columbia (the “AG Offices”). Among other terms, the resolution with the AG Offices included a $\n52\n million monetary payment, the majority of which we paid in the 2024 fourth quarter, and which is not material to our Financial Statements. We do not expect the terms of these resolutions to have a material impact on our current or ongoing operations.\nWhile we believe it is reasonably possible that we may incur losses in excess of the amounts recorded associated with the above described MDL proceedings and unresolved regulatory investigations related to the Data Security Incident, it is not possible to reasonably estimate the amount of such losses or range of loss in excess of the amounts recorded that might result from adverse judgments, settlements, fines, penalties or other resolution of these proceedings and investigations based on: (1) in the case of the above described MDL proceedings, the current stage of these proceedings, the absence of specificity as to alleged damages, the uncertainty as to the certification of a class or classes and the size of any certified class, and the lack of resolution of significant factual and legal issues, and (2) uncertainty regarding unresolved inquiries, investigations, or requests for information and/or documents.\nOther Legal Proceedings\nDuring 2024, we recorded certain expenses related to settled and ongoing claims brought against the Company regarding the use of copyrighted music. These amounts are not material to our Financial Statements. While we believe it is reasonably possible that we may incur losses in excess of the amounts already recorded for the unresolved claims, we are currently unable to reasonably estimate the amount of losses or range of loss in excess of the amounts recorded. At this time, we do not expect these claims or resolutions to have a material impact on the Company’s financial position or operations.\n54\nTable of Contents\n    \n                                    \nNOTE 8. \nLEASES\nWe enter into operating and finance leases primarily for hotels, offices, and equipment. Most leases have initial terms of up to \n20\n years, and contain \none\n or more renewals at our option, generally for \nfive\n- or \n10\n-year periods. We have generally not included these renewal periods in the lease term as it is not reasonably certain that we will exercise the renewal option.\nThe following table details the composition of lease expense and supplemental cash flow information for 2024, 2023, and 2022:\n(in millions)\n2024\n2023\n2022\nOperating lease cost\n \n$\n143\n \n$\n155\n \n$\n165\n \nVariable lease cost\n122\n \n128\n \n90\n \nOperating cash outflows for operating leases\n154\n \n240\n \n191\n \nThe following table presents our future minimum lease payments at year-end 2024:\n(in millions)\nOperating Leases\nFinance Leases\n2025\n$\n145\n$\n14\n2026\n124\n15\n2027\n87\n15\n2028\n82\n16\n2029\n80\n16\nThereafter\n644\n76\nTotal minimum lease payments\n$\n1,162\n$\n152\nLess: Amount representing interest\n264\n28\nPresent value of minimum lease payments\n$\n898\n$\n124\nThe following table presents the composition of our current and noncurrent lease liability at year-end 2024 and 2023:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nOperating Leases\nFinance Leases\nOperating Leases\nFinance Leases\nCurrent \n(1)\n$\n104\n \n$\n9\n \n$\n105\n \n$\n8\n \nNoncurrent \n(2)\n794\n \n115\n \n887\n \n123\n \n$\n898\n \n$\n124\n \n$\n992\n \n$\n131\n \n(1)\nOperating leases are recorded in the “\nAccrued expenses and other\n” and finance leases are recorded in the “\nCurrent portion of long-term debt\n” captions of our Balance Sheets.\n(2)\nOperating leases are recorded in the “Operating lease liabilities” and finance leases are recorded in the “\nLong-term debt\n” captions of our Balance Sheets.\nThe following table presents additional information about our lease obligations at year-end 2024 and 2023:\n2024\n2023\nOperating Leases\nFinance Leases\nOperating Leases\nFinance Leases\nWeighted Average Remaining Lease Term (in years)\n13\n9\n13\n10\nWeighted Average Discount Rate\n4.3\n \n%\n4.4\n \n%\n4.3\n \n%\n4.4\n \n%\n55\nTable of Contents\n    \n                                    \nNOTE 9. \nLONG-TERM DEBT\nWe provide detail on our long-term debt balances, net of discounts, premiums, and debt issuance costs, in the following table at year-end 2024 and 2023:\n(in millions)\nAt Year-End 2024\nAt Year-End 2023\nSenior Notes:\nSeries P Notes, interest rate of \n3.8\n%, face amount of $\n350\n, maturing October 1, 2025 \n(effective interest rate of \n4.0\n%)\n$\n349\n \n$\n349\n \nSeries R Notes, interest rate of \n3.1\n%, face amount of $\n750\n, maturing June 15, 2026 \n(effective interest rate of \n3.3\n%)\n749\n \n748\n \nSeries V Notes, interest rate of \n3.8\n%, face amount of $\n318\n, maturing March 15, 2025 \n(effective interest rate of \n2.8\n%)\n319\n \n321\n \nSeries W Notes, interest rate of \n4.5\n%, face amount of $\n278\n, maturing October 1, 2034 \n(effective interest rate of \n4.1\n%)\n287\n \n288\n \nSeries X Notes, interest rate of \n4.0\n%, face amount of $\n450\n, maturing April 15, 2028\n(effective interest rate of \n4.2\n%)\n447\n \n447\n \nSeries AA Notes, interest rate of \n4.7\n%, face amount of $\n300\n, maturing December 1, 2028\n(effective interest rate of \n4.8\n%)\n298\n \n298\n \nSeries CC Notes, interest rate of \n3.6\n%, face amount of $\n550\n, matured April 15, 2024\n(effective interest rate of \n3.9\n%)\n—\n \n545\n \nSeries EE Notes, interest rate of \n5.8\n%, face amount of $\n600\n, maturing May 1, 2025\n(effective interest rate of \n6.0\n%)\n599\n \n598\n \nSeries FF Notes, interest rate of \n4.6\n%, face amount of $\n1,000\n, maturing June 15, 2030\n(effective interest rate of \n4.8\n%)\n991\n \n990\n \nSeries GG Notes, interest rate of \n3.5\n%, face amount of $\n1,000\n, maturing October 15, 2032\n(effective interest rate of \n3.7\n%)\n989\n \n988\n \nSeries HH Notes, interest rate of \n2.9\n%, face amount of $\n1,100\n, maturing April 15, 2031\n(effective interest rate of \n3.0\n%)\n1,093\n \n1,091\n \nSeries II Notes, interest rate of \n2.8\n%, face amount of $\n700\n, maturing October 15, 2033\n(effective interest rate of \n2.8\n%)\n695\n \n694\n \nSeries JJ Notes, interest rate of \n5.0\n%, face amount of $\n1,000\n, maturing October 15, 2027\n(effective interest rate of \n5.4\n%)\n990\n \n987\n \nSeries KK Notes, interest rate of \n4.9\n%, face amount of $\n800\n, maturing April 15, 2029 \n(effective interest rate of \n5.3\n%)\n788\n \n785\n \nSeries LL Notes, interest rate of \n5.5\n%, face amount of $\n450\n, maturing September 15, 2026\n(effective interest rate of \n5.9\n%)\n447\n \n445\n \nSeries MM Notes, interest rate of \n5.6\n%, face amount of $\n700\n, maturing October 15, 2028\n(effective interest rate of \n5.9\n%)\n693\n \n691\n \nSeries NN Notes, interest rate of \n4.9\n%, face amount of $\n500\n, maturing May 15, 2029\n(effective interest rate of \n5.3\n%)\n491\n \n—\n \nSeries OO Notes, interest rate of \n5.3\n%, face amount of $\n1,000\n, maturing May 15, 2034\n(effective interest rate of \n5.6\n%)\n980\n \n—\n \nSeries PP Notes, interest rate of \n4.8\n%, face amount of $\n500\n, maturing March 15, 2030\n(effective interest rate of \n5.0\n%)\n495\n \n—\n \nSeries QQ Notes, interest rate of \n5.4\n%, face amount of $\n1,000\n, maturing March 15, 2035\n(effective interest rate of \n5.5\n%)\n986\n \n—\n \nCommercial paper\n1,582\n \n1,421\n \nCredit Facility\n—\n \n—\n \nFinance lease obligations\n124\n \n131\n \nOther\n55\n \n56\n \n$\n14,447\n \n$\n11,873\n \nLess current portion\n(\n1,309\n)\n(\n553\n)\n$\n13,138\n \n$\n11,320\n \nAll our long-term debt is recourse to us but unsecured. All the Senior Notes shown in the table above are our unsecured and unsubordinated obligations, which rank equally with our other Senior Notes and all other unsecured and unsubordinated indebtedness that we have issued or will issue from time to time, and are governed by the terms of an indenture, dated as of November 16, 1998, between us and The Bank of New York Mellon (formerly The Bank of New York), as trustee. We may redeem some or all of each series of the Senior Notes before maturity under the terms provided in the applicable form of Senior Note.\n56\nTable of Contents\n    \n                                    \nIn August 2024, we issued $\n500\n million aggregate principal amount of \n4.800\n percent Series PP Notes due March 15, 2030 (the “Series PP Notes”) and $\n1.0\n billion aggregate principal amount of \n5.350\n percent Series QQ Notes due March 15, 2035 (the “Series QQ Notes”). We will pay interest on the Series PP Notes and Series QQ Notes in March and September of each year, commencing in March 2025. Net proceeds from the offering of the Series PP Notes and Series QQ Notes were approximately $\n1.480\n billion, after deducting the underwriting discount and expenses, and were made available for general corporate purposes, including working capital, capital expenditures, acquisitions, stock repurchases, or repayment of outstanding indebtedness.\nIn February 2024, we issued $\n500\n million aggregate principal amount of \n4.875\n percent Series NN Notes due May 15, 2029 (the “Series NN Notes”) and $\n1.0\n billion aggregate principal amount of \n5.300\n percent Series OO Notes due May 15, 2034 (the “Series OO Notes”). We pay interest on the Series NN Notes and Series OO Notes in May and November of each year. Net proceeds from the offering of the Series NN Notes and Series OO Notes were approximately $\n1.468\n billion, after deducting the underwriting discount and expenses, and were made available for general corporate purposes, including working capital, capital expenditures, acquisitions, stock repurchases, or repayment of outstanding indebtedness.\nWe are party to a $\n4.5\n billion multicurrency revolving credit agreement (as amended, the “Credit Facility”). Available borrowings under the Credit Facility support our commercial paper program and general corporate needs. U.S. dollar borrowings under the Credit Facility bear interest at SOFR (the Secured Overnight Financing Rate) plus a spread based on our public debt rating. We also pay quarterly fees on the Credit Facility at a rate based on our public debt rating. We classify outstanding borrowings under the Credit Facility and outstanding commercial paper borrowings (which generally have short-term maturities of 45 days or less) as long-term based on our ability and intent to refinance the outstanding borrowings on a long-term basis. The Credit Facility expires on December 14, 2027.\nThe following table presents future principal payments, net of discounts, premiums, and debt issuance costs, for our debt at year-end 2024:\n(in millions)\nDebt Principal Payments\n2025\n$\n1,309\n \n2026\n1,205\n \n2027\n2,583\n \n2028\n1,450\n \n2029\n1,292\n \nThereafter\n6,608\n \nBalance at year-end 2024\n$\n14,447\n \nWe paid cash for interest, net of amounts capitalized, of\n \n$\n599\n million in 2024, $\n476\n million in 2023, and $\n345\n million in 2022.\nNOTE 10. \nINTANGIBLE ASSETS AND GOODWILL\nThe following table details the composition of our intangible assets at year-end 2024 and 2023: \n(in millions)\nAt Year-End 2024\nAt Year-End 2023\nDefinite-lived Intangible Assets\nCosts incurred to obtain contracts with customers\n$\n2,538\n \n$\n2,185\n \nAcquired contracts and other\n1,918\n \n1,911\n \nSoftware\n792\n \n576\n \n5,248\n \n4,672\n \nAccumulated amortization\n(\n1,471\n)\n(\n1,328\n)\n3,777\n \n3,344\n \nIndefinite-lived Intangible Brand Assets\n5,711\n \n5,846\n \n$\n9,488\n \n$\n9,190\n \nWe capitalize direct costs that we incur to obtain contracts with customers, which we amortize on a straight-line basis over the initial term of the agreements, generally ranging from \n15\n to \n30\n years.\n57\nTable of Contents\n    \n                                    \nFor contracts acquired in business combinations and asset acquisitions, we record a definite-lived intangible asset at the acquisition date, which is amortized on a straight-line basis over the remaining life of the contract. We capitalize costs incurred to develop internal-use software and acquire software licenses and begin amortizing these costs when the software is substantially ready for its intended use on a straight-line basis over its estimated useful life, generally ranging from \ntwo\n to \nseven years\n.\n For acquired contracts, software, and other intangible assets, we recorded amortization expense of $\n255\n million in 2024, $\n226\n million in 2023, and $\n197\n million in 2022 (of which $\n158\n million in 2024, $\n122\n million in 2023, and $\n83\n million in 2022 was included in the “Reimbursed expenses” caption of our Income Statements). For these assets, we estimate that our aggregate amortization expense will be $\n241\n million in 2025, $\n205\n million in 2026, $\n175\n million in 2027, $\n138\n million in 2028, and $\n102\n million in 2029.\nThe following table details the carrying amount of our goodwill at year-end 2024 and 2023:\n(in millions)\nU.S. & Canada\nEMEA\nGreater China\nAPEC\nCALA\nTotal Goodwill\nBalance at year-end 2023\n$\n5,333\n \n$\n1,467\n \n$\n999\n \n$\n763\n \n$\n324\n \n$\n8,886\n \nForeign currency translation\n(\n32\n)\n(\n50\n)\n(\n20\n)\n(\n32\n)\n(\n21\n)\n(\n155\n)\nBalance at year-end 2024\n$\n5,301\n \n$\n1,417\n \n$\n979\n \n$\n731\n \n$\n303\n \n$\n8,731\n \nNOTE 11. \nPROPERTY AND EQUIPMENT\nThe following table presents the composition of our property and equipment balances at year-end 2024 and 2023:\n(in millions)\nAt Year-End 2024\nAt Year-End 2023\nLand\n$\n768\n \n$\n669\n \nBuildings and leasehold improvements\n1,238\n \n1,108\n \nFurniture and equipment\n619\n \n622\n \nConstruction in progress\n89\n \n72\n \n2,714\n \n2,471\n \nAccumulated depreciation\n(\n881\n)\n(\n890\n)\n$\n1,833\n \n$\n1,581\n \nWe record property and equipment at cost, including interest and real estate taxes we incur during development and construction. We capitalize the cost of improvements that extend the useful life of property and equipment when we incur them. These capitalized costs may include structural costs, equipment, fixtures, floor, and wall coverings. We expense all repair and maintenance costs when we incur them. We compute depreciation using the straight-line method over the estimated useful lives of the assets (generally \nthree\n to \n40\n years), and we amortize leasehold improvements over the shorter of the asset life or lease term.\n Our gross depreciation expense totaled $\n128\n million in 2024, $\n122\n million in 2023, and $\n114\n million in 2022 (of which $\n42\n million in 2024, $\n37\n million in 2023, and $\n35\n million in 2022 was included in the “Reimbursed expenses” caption of our Income Statements). Fixed assets attributed to operations located outside the U.S. were $\n554\n million at year-end 2024 and $\n552\n million at year-end 2023.\n58\nTable of Contents\n    \n                                    \nNOTE 12. \nFAIR VALUE OF FINANCIAL INSTRUMENTS\nWe believe that the fair values of our current assets and current liabilities approximate their reported carrying amounts. \nWe present the carrying amounts and the fair values of noncurrent financial assets and liabilities that qualify as financial instruments in the following table:\n \nAt Year-End 2024\nAt Year-End 2023\n(in millions)\nCarrying\nAmount\nFair Value\nCarrying\nAmount\nFair Value\nNotes receivable\n$\n136\n \n$\n133\n \n$\n138\n \n$\n131\n \nTotal noncurrent financial assets\n$\n136\n \n$\n133\n \n$\n138\n \n$\n131\n \nSenior Notes\n$\n(\n11,419\n)\n$\n(\n11,083\n)\n$\n(\n9,720\n)\n$\n(\n9,393\n)\nCommercial paper\n(\n1,582\n)\n(\n1,582\n)\n(\n1,421\n)\n(\n1,421\n)\nTotal noncurrent financial liabilities\n$\n(\n13,001\n)\n$\n(\n12,665\n)\n$\n(\n11,141\n)\n$\n(\n10,814\n)\nOur notes receivable include mezzanine and other loans to hotel owners, generally to facilitate the development or renovation of a hotel and sometimes to facilitate brand programs or initiatives. We estimate the fair value of our notes receivable by discounting cash flows using risk-adjusted rates, both of which are Level 3 inputs.\nWe determine the fair value of our Senior Notes using quoted market prices, which are directly observable Level 1 inputs. The carrying amount of our commercial paper borrowings approximate fair value due to their short maturity and because they bear interest at a market rate.\nSee the “Fair Value Measurements” caption of Note 2 for more information on the input levels we use in determining fair value.\nNOTE 13. \nACCUMULATED OTHER COMPREHENSIVE LOSS\nThe following table details the accumulated other comprehensive loss activity for 2024, 2023, and 2022:\n(in millions)\nForeign Currency Translation Adjustments\nOther Adjustments\nAccumulated Other Comprehensive Loss\nBalance at year-end 2021\n$\n(\n351\n)\n$\n9\n \n$\n(\n342\n)\nOther comprehensive (loss) income before reclassifications \n(1)\n(\n390\n)\n11\n \n(\n379\n)\nReclassification adjustments\n1\n \n(\n9\n)\n(\n8\n)\nNet other comprehensive (loss) income\n(\n389\n)\n2\n \n(\n387\n)\nBalance at year-end 2022\n$\n(\n740\n)\n$\n11\n \n$\n(\n729\n)\nOther comprehensive income (loss) before reclassifications \n(1)\n89\n \n(\n4\n)\n85\n \nReclassification adjustments\n(\n3\n)\n—\n \n(\n3\n)\nNet other comprehensive income (loss)\n86\n \n(\n4\n)\n82\n \nBalance at year-end 2023\n$\n(\n654\n)\n$\n7\n \n$\n(\n647\n)\nOther comprehensive income (loss) before reclassifications \n(1)\n(\n437\n)\n25\n \n(\n412\n)\nReclassification adjustments\n—\n \n(\n4\n)\n(\n4\n)\nNet other comprehensive income (loss)\n(\n437\n)\n21\n \n(\n416\n)\nBalance at year-end 2024\n$\n(\n1,091\n)\n$\n28\n \n$\n(\n1,063\n)\n(1)\nOther comprehensive income (loss) before reclassifications for foreign currency translation adjustments includes intra-entity foreign currency transactions that are of a long-term investment nature, which resulted in gains (losses) of $\n30\n million for 2024, $(\n28\n) million for 2023, and $\n32\n million for 2022.\n59\nTable of Contents\n    \n                                    \nNOTE 14. \nBUSINESS SEGMENTS\nBeginning in the 2024 first quarter, we modified our segment structure as a result of a change in the way our “chief operating decision maker” (“CODM”) evaluates performance and allocates resources within the Company, resulting in the following \nfour\n reportable business segments: (1) U.S. & Canada, (2) Europe, Middle East & Africa (“EMEA”), (3) Greater China, and (4) Asia Pacific excluding China (“APEC”). Our Caribbean & Latin America (“CALA”) operating segment does not meet the applicable accounting criteria for separate disclosure as a reportable business segment, and as such, we include its results in “Unallocated corporate and other.” We revised the prior period amounts shown in the tables below to conform to our current presentation.\nOur President and Chief Executive Officer, who is our CODM, evaluates the performance of our operating segments using “segment profits,” which is based largely on the results of the segment without allocating corporate expenses, income taxes, indirect general, administrative, and other expenses, or restructuring and merger-related charges. We assign gains and losses, equity in earnings or losses, and direct general, administrative, and other expenses to each of our segments. “Unallocated corporate and other” includes a portion of our revenues (such as fees we receive from our credit card programs and timeshare licensing agreements), revenues and expenses for our Loyalty Program, general, administrative, and other expenses, restructuring and merger-related charges, equity in earnings or losses, and other gains or losses that we do not allocate to our segments, as well as results of our CALA operating segment.\nOur CODM uses segment profits to allocate resources (including employees and investment spending) to each segment, primarily as part of the annual budget process. Our CODM reviews budget-to-actual variances on a quarterly basis to assess segment performance. Additionally, our CODM uses segment profits to compare the results of each segment with one another and in the determination of compensation for segment leadership.\nOur CODM monitors assets for the consolidated Company but does not use assets by operating segment when assessing performance or making operating segment resource allocations.\nSegment Revenues, Expenses, and Profits\nThe following tables present our revenues (disaggregated by segment and major revenue stream), segment expenses, and segment profits for each of the last three fiscal years:\n2024\n(in millions)\nU.S. & Canada\nEMEA\nGreater China\nAPEC\nGross fee revenues\n$\n2,951\n \n$\n589\n \n$\n250\n \n$\n345\n \nContract investment amortization\n(\n76\n)\n(\n14\n)\n(\n1\n)\n(\n5\n)\nNet fee revenues\n2,875\n \n575\n \n249\n \n340\n \nOwned, leased, and other revenue\n437\n \n595\n \n27\n \n141\n \nCost reimbursement revenue\n15,300\n \n1,236\n \n306\n \n495\n \nTotal reportable segment revenue\n18,612\n \n2,406\n \n582\n \n976\n \nLess:\nOwned, leased, and other - direct\n330\n \n499\n \n14\n \n118\n \nDepreciation, amortization, and other\n84\n \n38\n \n9\n \n8\n \nGeneral, administrative, and other\n182\n \n110\n \n55\n \n64\n \nReimbursed expenses\n15,381\n \n1,252\n \n319\n \n510\n \nOther segment items (primarily non-operating income and expenses)\n(\n5\n)\n(\n5\n)\n(\n1\n)\n(\n4\n)\nTotal reportable segment profit\n$\n2,640\n \n$\n512\n \n$\n186\n \n$\n280\n \n60\nTable of Contents\n    \n                                    \n2023\n(in millions)\nU.S. & Canada\nEMEA\nGreater China\nAPEC\nGross fee revenues\n$\n2,799\n \n$\n529\n \n$\n265\n \n$\n288\n \nContract investment amortization\n(\n65\n)\n(\n13\n)\n—\n \n(\n4\n)\nNet fee revenues\n2,734\n \n516\n \n265\n \n284\n \nOwned, leased, and other revenue\n506\n \n574\n \n18\n \n135\n \nCost reimbursement revenue\n14,456\n \n1,178\n \n317\n \n411\n \nTotal reportable segment revenue\n17,696\n \n2,268\n \n600\n \n830\n \nLess:\nOwned, leased, and other - direct\n340\n \n481\n \n12\n \n116\n \nDepreciation, amortization, and other\n84\n \n40\n \n10\n \n9\n \nGeneral, administrative, and other\n154\n \n140\n \n55\n \n61\n \nReimbursed expenses\n14,399\n \n1,168\n \n317\n \n409\n \nOther segment items (primarily non-operating income and expenses)\n(\n5\n)\n(\n2\n)\n(\n2\n)\n(\n8\n)\nTotal reportable segment profit\n$\n2,724\n \n$\n441\n \n$\n208\n \n$\n243\n \n2022\n(in millions)\nU.S. & Canada\nEMEA\nGreater China\nAPEC\nGross fee revenues\n$\n2,486\n \n$\n455\n \n$\n120\n \n$\n181\n \nContract investment amortization\n(\n60\n)\n(\n17\n)\n—\n \n(\n3\n)\nNet fee revenues\n2,426\n \n438\n \n120\n \n178\n \nOwned, leased, and other revenue\n479\n \n481\n \n17\n \n97\n \nCost reimbursement revenue\n12,848\n \n1,010\n \n214\n \n289\n \nTotal reportable segment revenue\n15,753\n \n1,929\n \n351\n \n564\n \nLess:\nOwned, leased, and other - direct\n386\n \n369\n \n14\n \n99\n \nDepreciation, amortization, and other\n81\n \n45\n \n12\n \n9\n \nGeneral, administrative, and other\n135\n \n103\n \n50\n \n48\n \nReimbursed expenses\n12,714\n \n979\n \n210\n \n281\n \nOther segment items (primarily non-operating income and expenses)\n(\n9\n)\n(\n2\n)\n3\n \n(\n7\n)\nTotal reportable segment profit\n$\n2,446\n \n$\n435\n \n$\n62\n \n$\n134\n \nThe following table presents reconciliations of our total reportable segment revenue and profit to consolidated revenue and income before income taxes for each of the last three fiscal years:\n(in millions)\n2024\n2023\n2022\nReconciliation of revenue\nTotal reportable segment revenue\n$\n22,576\n \n$\n21,394\n \n$\n18,597\n \nUnallocated corporate and other\n2,524\n \n2,319\n \n2,176\n \nConsolidated revenue\n$\n25,100\n \n$\n23,713\n \n$\n20,773\n \nReconciliation of income before income taxes\nTotal reportable segment profit\n$\n3,618\n \n$\n3,616\n \n$\n3,077\n \nUnallocated corporate and other\n188\n \n297\n \n414\n \nInterest expense, net of interest income\n(\n655\n)\n(\n535\n)\n(\n377\n)\nConsolidated income before income taxes\n$\n3,151\n \n$\n3,378\n \n$\n3,114\n \nRevenues attributed to operations located outside the U.S. were\n \n$\n5,512\n million in 2024, $\n5,160\n million in 2023, and $\n4,032\n million in 2022, including cost reimbursement revenue outside the U.S. of $\n3,018\n million in 2024, $\n2,806\n million in 2023, and $\n2,231\n million in 2022.\nSegment profits attributed to operations located outside the U.S. were $\n1,329\n million in 2024, $\n1,258\n million in 2023, and $\n898\n million in 2022, including cost reimbursements, net (cost reimbursement revenue, net of reimbursed expenses) outside the U.S. of $(\n55\n) million in 2024, $\n23\n million in 2023, and $\n67\n million in 2022.\n61\nTable of Contents\n    \n                                    \nNOTE 15. \nRELATED PARTY TRANSACTIONS\nEquity Method Investments\nWe have equity method investments in entities that own or lease properties for which we provide management services and receive fees. In addition, in some cases we provide loans, preferred equity, or guarantees to these entities. \nThe following table presents Income Statement data resulting from transactions with these related parties. This table does not include our Financial Statement captions with insignificant related party activity.\n(in millions)\n2024\n2023\n2022\nCost reimbursement revenue\n$\n131\n \n$\n122\n \n$\n104\n \nReimbursed expenses\n(\n135\n)\n(\n126\n)\n(\n104\n)\nEquity in earnings\n8\n \n9\n \n18\n \nThe carrying amount of our equity method investments was $\n298\n million at year-end 2024 and $\n308\n million at year-end 2023. This value exceeded our share of the book value of the investees’ net assets by $\n223\n million at year-end 2024 and $\n231\n million at year-end 2023, primarily due to the value that we assigned to land, contracts, and buildings owned by the investees.\nOther Related Parties\nWe earned management fees of approximately $\n13\n million in 2024, $\n13\n million in 2023, and $\n11\n million in 2022, plus reimbursement of certain expenses, from our operation of properties in which JWM Family Enterprises, L.P., which is beneficially owned and controlled by J.W. Marriott, Jr., Deborah Marriott Harrison, David S. Marriott, and other members of the Marriott family, indirectly holds varying percentages of ownership. We earned gross fee revenues of approximately $\n6\n million in 2024, $\n4\n million in 2023, and $\n4\n million in 2022, plus reimbursement of certain expenses, from managed and franchised properties in which other members of the Marriott family hold varying interests.\nNOTE 16. \nRESTRUCTURING CHARGES\nIn 2024, we launched a comprehensive initiative to enhance our effectiveness and efficiency across the Company.\nIn connection with these efforts, in 2024, we recorded $\n68\n million of charges for employee termination benefits, of which we present $\n37\n million in the “\nRestructuring and merger-related charges\n” caption and $\n31\n million in the “\nReimbursed expenses\n” caption of our Income Statements. We substantially completed this initiative as of year-end 2024.\nThe following table presents our restructuring reserve activity during the period:\n(in millions)\nEmployee termination benefits\nBalance at December 31, 2023\n$\n—\n \nCharges\n68\n \nCash payments\n(\n8\n)\nOther\n(\n4\n)\nBalance at December 31, 2024, classified in “Accrued expenses and other”\n$\n56\n \nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.\nItem 9A.    Controls and Procedures.\nDisclosure Controls and Procedures \nWe evaluated the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the “Exchange Act”)) as of the end of the period covered by this annual report under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer. Management necessarily applied its judgment in assessing the costs and benefits of those controls and procedures, which by their nature, can provide only reasonable assurance about management’s control objectives. You should note that the design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and we cannot assure you that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how remote. Based upon this evaluation, our Chief Executive Officer and Chief Financial Officer concluded that \n62\nTable of Contents\n    \n                                    \nour disclosure controls and procedures were effective and operating to provide reasonable assurance that we record, process, summarize, and report the information we are required to disclose in the reports that we file or submit under the Exchange Act within the time periods specified in the rules and forms of the SEC, and to provide reasonable assurance that we accumulate and communicate such information to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions about required disclosure.\nInternal Control Over Financial Reporting\nWe have set forth management’s report on internal control over financial reporting and the attestation report of our independent registered public accounting firm on our internal control over financial reporting in Part II, Item 8 of this Form 10-K, and we incorporate those reports here by reference.\nWe made no changes in internal control over financial reporting during the 2024 fourth quarter that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B.    Other Information.\nDuring the 2024 fourth quarter, no director or Section 16 officer \nadopted\n or \nterminated\n any Rule 10b5-1 plans or non-Rule 10b5-1 trading arrangements.\nItem 9C.    Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\n63\nTable of Contents\n    \n                                    \nPART III\nItems 10, 11, 12, 13, 14.\nAs described below, we incorporate by reference in this Annual Report on Form 10-K certain information appearing in the Proxy Statement that we will furnish to our stockholders for our 2025 Annual Meeting of Stockholders. \nItem 10. Directors, Executive Officers, and Corporate Governance.\nWe incorporate this information by reference to “Nominees to our Board of Directors,” “Committees of the Board — Audit Committee,” “Transactions with Related Persons,” “Delinquent Section 16(a) Reports,” “Selection of Director Nominees” and “Insider Trading Policies and Procedures” sections of our Proxy Statement. We have included information regarding our executive officers and our Code of Ethics below.\nItem 11. Executive Compensation.\nWe incorporate this information by reference to the “Executive and Director Compensation” and “Compensation Committee Interlocks and Insider Participation” sections of our Proxy Statement.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nWe incorporate this information by reference to the “Securities Authorized for Issuance Under Equity Compensation Plans” and the “Stock Ownership” sections of our Proxy Statement.\nItem 13. Certain Relationships and Related Transactions, and Director Independence.\nWe incorporate this information by reference to the “Transactions with Related Persons” and “Director Independence” sections of our Proxy Statement.\nItem 14. Principal Accountant Fees and Services.\nWe incorporate this information by reference to the “Independent Registered Public Accounting Firm Fee Disclosure” and the “Pre-Approval of Independent Auditor Fees and Services Policy” sections of our Proxy Statement.\n64\nTable of Contents\n    \n                                    \nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nWe include below certain information on our executive officers. This information is as of February 1, 2025, except where indicated.\nName and Title\nAge\nBusiness Experience\nAnthony G. (Tony) Capuano\nPresident and Chief Executive Officer\n59 \nTony Capuano was appointed Chief Executive Officer (“CEO”) in February 2021 and was additionally designated President in February 2023. Prior to his appointment as CEO, Mr. Capuano was Group President, Global Development, Design and Operations Services, a role he assumed in January 2020. In that role, he was responsible for leading the Company’s global development and design efforts and overseeing the Company’s Global Operations discipline. Mr. Capuano began his Marriott career in 1995 as part of the Market Planning and Feasibility team. Between 1997 and 2005, he led Marriott’s full-service development efforts in the Western U.S. and Canada. From 2005 to 2008, Mr. Capuano served as Senior Vice President of full-service development for North America. In 2008, his responsibilities expanded to include all of U.S. and Canada and the Caribbean and Latin America, and he became Executive Vice President and Global Chief Development Officer in 2009. Mr. Capuano earned his bachelor’s degree in Hotel Administration from Cornell University. He is a member of the Cornell Hotel Society, The Cornell School of Hotel Administration Dean’s Advisory Board, the Business Roundtable, and the American Hotel and Lodging Association’s IREFAC Council. Additionally, Mr. Capuano serves on the Board of Directors of McDonald’s Corporation, The Economic Club of Washington, D.C., and Save Venice, a nonprofit organization dedicated to preserving the artistic heritage of Venice, Italy.\nSatyajit (Satya) Anand\nPresident, Europe, Middle East & Africa\n60 \nSatya Anand was appointed President, Europe, Middle East & Africa (EMEA) in October 2020, and is responsible for developing and managing Marriott's portfolio in the region. Mr. Anand began his career with Marriott International in 1988 and prior to assuming his role as President, EMEA, he served as Chief Operations Officer, Luxury & Southern Europe and Global Design EMEA from July 2016. Prior to this, Mr. Anand was Marriott’s Chief Financial Officer for Europe for four years and held Area Vice President roles for Western and Central Europe, respectively, as well as various Cluster General Manager, operations and finance positions both on and above property. Mr. Anand holds a bachelor’s degree in Accounting from Bangalore’s MES College of Commerce and completed his Diploma in Hotel and Tourism Management from the Institute of Tourism & Hotel Management in Semmering, Austria.\nBenjamin T. (Ty) Breland\nExecutive Vice President\nand Chief Human Resources Officer\n49 \nTy Breland was appointed Executive Vice President and Chief Human Resources Officer effective October 2021. Prior to that appointment, Mr. Breland served as Global HR Officer for Talent Development & Organizational Capability, a role he assumed in 2016. In that role, Mr. Breland had executive oversight for talent management, including leadership development, organizational capability, and change management. Mr. Breland also oversaw The Ritz-Carlton Leadership Center and served as the senior Human Resources leader for the Company’s Global Development, Design & Operations Services disciplines. Mr. Breland joined Marriott in 2004 as a member of the Company’s Talent Management and Analytics group and held a variety of other senior human resources leadership positions, including Global HR Integration Officer, responsible for the Human Resources integration for Marriott’s merger with Starwood Hotels & Resorts. From 2011 to 2015, Mr. Breland served as Regional Vice President of Human Resources for the Eastern Region of the U.S. Mr. Breland earned his Bachelor of Science in Psychology and Ph.D. in Industrial/Organizational Psychology from Virginia Tech, where he is a board member for the Virginia Tech Hospitality Business School.\n65\nTable of Contents\n    \n                                    \nName and Title\nAge\nBusiness Experience\nWilliam P. (Liam) Brown\nGroup President, United States and Canada\n64 \nLiam Brown was appointed Group President, United States and Canada effective January 2021, and is responsible for developing and managing Marriott's portfolio in the region. Prior to this role, Mr. Brown served as the President and Managing Director of Europe from 2018 to 2019, followed by Group President of Europe, Middle East & Africa in 2020. Mr. Brown joined Marriott in 1989 and served as President for Franchising, Owner Services and Managed by Marriott Select Brands, North America from 2012 to 2018. Other key positions previously held by Mr. Brown include Chief Operations Officer for the Americas for Select Service & Extended Stay Lodging and Owner & Franchise Services, as well as Senior Vice President and Executive Vice President of Development for Marriott’s Select Service & Extended Stay lodging products. Mr. Brown also serves on the Executive Committee of the American Hotel and Lodging Association. He holds a Hotel Diploma and Business Degree from the Dublin Institute of Technology, Trinity College and earned his Master of Business Administration from the Robert H. Smith School of Management at the University of Maryland.\nFelitia O. Lee\nController and \nChief Accounting Officer\n63 \nFelitia Lee was appointed Marriott’s Controller and Chief Accounting Officer and principal accounting officer effective August 2020, with responsibility for the global accounting operations of the Company including oversight of financial reporting and analysis, accounting policy, general accounting, consumer and technology accounting, finance and accounting governance, finance shared services, and financial contract compliance. Ms. Lee joined Marriott in May 2020, supporting the management of the Company’s accounting operations. Prior to joining Marriott, Ms. Lee was the Senior Vice President and Controller for Kohl’s Corporation since 2018, and prior to joining Kohl’s Corporation, Ms. Lee held the title of Vice President and Controller of the Pepsi Beverage Company along with a number of other leadership positions with PepsiCo, Inc. She earned her Bachelor of Science in Accounting from Santa Clara University. She is a Certified Public Accountant and a member of the American Institute of Certified Public Accountants.\nYibing Mao\nPresident, Greater China\n61 \nYibing Mao was appointed President, Greater China in February 2023, and is responsible for developing and managing Marriott's portfolio in the region. Ms. Mao joined Marriott in 1996 and held the title of Senior Vice President & Chief Counsel, Asia Pacific from May 2016 until she stepped down in 2020. From 2021 to February 2023, she was a member of the Board of Directors of Las Vegas Sands Corporation. Ms. Mao received a Bachelor of Laws from Jilin University, Master of Law from Peking University, and a J.D. degree from Duke University School of Law.\nRajeev (Raj) Menon\nPresident, Asia Pacific excluding China\n56 \nRajeev Menon was appointed President, Asia Pacific excluding China (APEC) in October 2019, and is responsible for developing and managing Marriott's portfolio in the region. Prior to being appointed President, APEC, Mr. Menon served as the Chief Operating Officer for APEC from March 2015 through September 2019. Mr. Menon joined Marriott International in April 2001 as the General Manager of Renaissance Mumbai Hotel and Convention Center and Marriott Executive Apartments, Mumbai. Mr. Menon is a Board member of the Singapore Hotel Association, US/ASEAN Business Council, and Singapore Tourism Board. He completed his education including Hotel Management in New Delhi and is also a graduate of the Advanced Management Program (AMP Class 194) at Harvard Business School.\n66\nTable of Contents\n    \n                                    \nName and Title\nAge\nBusiness Experience\nKathleen K. (Leeny) Oberg\nChief Financial Officer and Executive Vice President, Development\n64 \nLeeny Oberg was appointed Executive Vice President and Chief Financial Officer effective January 2016 and was additionally designated Executive Vice President, Business Operations in October 2021. In February 2023, Ms. Oberg began leading the Company’s Global Development organization and was appointed Chief Financial Officer and Executive Vice President, Development. Previously, Ms. Oberg was the Chief Financial Officer for The Ritz-Carlton since 2013. Prior to assuming that role, Ms. Oberg served in a range of financial leadership positions with Marriott, including Senior Vice President, Corporate and Development Finance and Senior Vice President, International Project Finance and Asset Management for Europe and the Middle East and Africa. Ms. Oberg first joined Marriott as part of its Investor Relations group in 1999. Ms. Oberg is an active member of the American Hotel and Lodging Association’s IREFAC Council, and she currently serves on the Board of Directors of Adobe Inc. She earned her Bachelor of Science in Commerce, with concentrations in Finance and Management Information Systems, from the University of Virginia, McIntire School of Commerce and received her Master of Business Administration from Stanford University Graduate School of Business.\nDrew L. Pinto\nExecutive Vice President and Chief Revenue & Technology Officer\n53 \nDrew Pinto was appointed Executive Vice President and Chief Revenue & Technology Officer in February 2023, and is responsible for leading global sales and support channels, revenue management, digital, and information technology strategy for the Company. Since joining the Company in 2004, Mr. Pinto has held various leadership roles, including Global Officer, Global Sales, Distribution, and Revenue Management from January 2021 to February 2023 and Senior Vice President, Distribution & Revenue Strategy from January 2019 to January 2021. Mr. Pinto earned a Bachelor of Arts degree from Yale University and his Master of Business Administration from the University of Michigan Ross School of Business.\nRena Hozore Reiss\nExecutive Vice President and\nGeneral Counsel\n65 \nRena Hozore Reiss was appointed Executive Vice President and General Counsel effective December 2017. Ms. Reiss previously held the position of Executive Vice President, General Counsel and Corporate Secretary at Hyatt Hotels. Prior to her position with Hyatt, Ms. Reiss was an attorney in Marriott’s law department from 2000 to 2010 building her career in roles with increasing responsibility, ultimately holding the position of Senior Vice President and Associate General Counsel in which she led Marriott’s managed development efforts in the Americas region. Ms. Reiss serves on the Board of Directors of the American Hotel and Lodging Association and of Legal Aid DC. She earned her A.B. from Princeton University and her J.D. from Harvard Law School.\nPeggy F. Roe\nExecutive Vice President and Chief Customer Officer\n53 \nPeggy Roe was appointed Executive Vice President and Chief Customer Officer in February 2023, and is responsible for overseeing development and execution of all aspects of Marriott’s global consumer strategy. Since joining Marriott in 2003, Ms. Roe has held various leadership roles focused on growth and innovation. From January 2020 to February 2023, she served as Global Officer, Customer Experience, Loyalty, and New Ventures, and from October 2013 to December 2019, she served as Chief Sales and Marketing Officer, Asia Pacific. She co-founded the Marriott Women in Leadership initiative in Asia Pacific in 2014 and is a board member of the Hong Kong chapter of the Asian University for Women. She currently leads Marriott’s Women’s Associate Resource Group. Ms. Roe is a graduate of the University of Michigan and holds a Master of Business Administration from Harvard Business School.\nCode of Ethics and Business Conduct Guide\nThe Company has long maintained and enforced a Code of Ethics that applies to all Marriott associates, including our Chief Executive Officer, Chief Financial Officer, and Principal Accounting Officer, and to each member of the Board. The Code of Ethics is encompassed in our Business Conduct Guide, which is available in the Investor Relations section of our website (Marriott.com/investor) by clicking on “Governance” and then “Documents & Charters.” We intend to post on that website any future changes or amendments to our Code of Ethics, and any waiver of our Code of Ethics that applies to any of our executive officers or a member of our Board within four business days following the date of the amendment or waiver.\n67\nTable of Contents\n    \n                                    \nPART IV\nItem 15.     Exhibits and Financial Statement Schedules. \nLIST OF DOCUMENTS FILED AS PART OF THIS REPORT\n(1) FINANCIAL STATEMENTS\nWe include this portion of Item 15 under Part II, Item 8 of this Annual Report on Form 10-K.\n(2) FINANCIAL STATEMENT SCHEDULES\nWe include the financial statement schedule information required by the applicable accounting regulations of the SEC in the notes to our financial statements and incorporate that information in this Item 15 by reference.\n(3) EXHIBITS\nAny stockholder who wants a copy of the following Exhibits may obtain one from us upon request at a charge that reflects the reproduction cost of such Exhibits. Requests should be made to the Secretary, Marriott International, Inc., 7750 Wisconsin Avenue, Department 52/862, Bethesda, MD 20814.\nWe have not filed as exhibits certain instruments defining the rights of holders of the long-term debt of Marriott or its subsidiary Starwood Hotels & Resorts Worldwide, LLC, pursuant to Item 601(b)(4)(iii) of Regulation S-K promulgated under the Exchange Act, because the amount of debt authorized and outstanding under each such instrument does not exceed 10 percent of the total assets of the Company’s and its consolidated subsidiaries. The Company agrees to furnish a copy of any such instrument to the SEC upon request.\nExhibit No.\nDescription\nIncorporation by Reference (where a report is indicated below, that document has been previously filed with the SEC and the applicable exhibit is incorporated by reference thereto)\n3.1\nRestated Certificate of Incorporation.\nExhibit No. 3.(i) to our Form 8-K filed August 22, 2006 (File No. 001-13881).\n3.2\nAmended and Restated Bylaws.\nExhibit No. 3.1 to our Form 8-K filed August 4, 2023 (File No. 001-13881).\n4.1\nForm of Common Stock Certificate.\nExhibit No. 4.5 to our Form S-3ASR filed December 8, 2005 (File No. 333-130212).\n4.2\nIndenture, dated as of November 16, 1998, between the Company and The Bank of New York Mellon, as successor to JPMorgan Chase Bank, N.A., formerly known as The Chase Manhattan Bank.\nExhibit No. 4.1 to our Form 10-K\n filed March 16, 1999\n (File No. 001-13881).\n4.3\nDescription of Registrant’s Securities.\nExhibit No. 4.3 to our Form 10-K \nfiled February 1\n3\n, 202\n4\n (File No. 001-13881).\n10.1.1\nU.S. $4,500,000 Sixth Amended and Restated Credit Agreement dated as of December 14, 2022 with Bank of America, N.A. as administrative agent and certain banks.\nExhibit No. 10 to our Form 8-K filed December 1\n5\n, 2022 (File No. 001-13881).\n10.1.2\nFirst Amendment, dated as of May 17, 2024 and effective as of June 4, 2024, to the Sixth Amended and Restated Credit Agreement with Bank of America, N.A. as administrative agent, and certain banks, dated as of December 14, 2022.\nE\nxhibit No. 10.1 to our Form 10-Q filed\n \nJuly 31\n, 2024 (File No. 001-13881).\n10.2\nAmended and Restated License, Services and Development Agreement, dated September 20, 2024 and effective as of January 1, 2024, by and among the Company, Marriott Worldwide Corporation, and Marriott Vacations Worldwide Corporation, and the other signatories thereto.\nExhibit No. 10.2 to our Form 10-Q filed November 4, 2024 (File No. 001-13881).\n68\nTable of Contents\n    \n                                    \nExhibit No.\nDescription\nIncorporation by Reference (where a report is indicated below, that document has been previously filed with the SEC and the applicable exhibit is incorporated by reference thereto)\n10.3.1\nLicense, Services and Development Agreement entered into on November 17, 2011, among The Ritz-Carlton Hotel Company, L.L.C., Marriott Vacations Worldwide Corporation, and the other signatories thereto.\nExhibit No. 10.2 to our Form 8-K filed November 21, 2011 (File No. 001-13881).\n10.3.2\nFirst Amendment to License, Services, and Development Agreement for Ritz-Carlton Projects, dated February 26, 2018, among The Ritz-Carlton Hotel Company, L.L.C., Marriott Vacations Worldwide Corporation, and the other signatories thereto. \nExhibit No. 10.2 to our Form 8-K filed February 27, 2018 (File No. 001-13881).\n10.4\nMarriott Bonvoy Affiliation Agreement entered into on November 10, 2021, among the Company, Marriott Rewards, L.L.C., Marriott Vacations Worldwide Corporation and certain of its subsidiaries, Marriott Ownership Resorts, Inc., and the other signatories thereto.\nExhibit No. 10.4.1 to our Form 10-K filed February 15, 2022 (File No. 001-13881).\n*10.5.1\n2023 Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.1 to our Form 8-K filed May 16, 2023 (File No. 001-13881).\n*10.5.2\nUnited Kingdom Sub-Plan of the 2023 Marriott International, Inc. Stock and Cash Incentive Plan (December 2023).\nExhibit No. 10.6.2 to our Form 10-K filed February 13, 2024 (File No. 001-13881).\n*10.6.1\nForm of Non-Employee Director Deferred Share Award Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.2 to our Form 10-Q filed August 1, 2023 (File No. 001-13881).\n*10.6.2\nForm of Non-Employee Director Deferred Fee Award Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.3 to our Form 10-Q filed August 1, 2023 (File No. 001-13881).\n*10.7\nForm of Non-Employee Director Stock Appreciation Right Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.4 to our Form 10-Q filed August 1, 2023 (File No. 001-13881).\n*10.8.1\nMarriott International, Inc. Stock and Cash Incentive Plan, as amended through February 13, 2014.\nExhibit A to our Definitive Proxy Statement filed April 4, 2014 (File No. 001-13881).\n*10.8.2\nAmendment dated August 7, 2014 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10 to our Form 10-Q filed October 29, 2014 (File No. 001-13881).\n*10.8.3\nAmendment dated September 23, 2016 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.8.2 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.8.4\nAmendment dated November 10, 2016 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.22 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.8.5\nAmendment dated May 5, 2017 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.8.3 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.8.6\nAmendment dated February 15, 2019 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.7.5 to our Form 10-K filed March 1, 2019 (File No. 001-13881).\n*10.8.7\nAmendment dated May 10, 2019 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.1 to our Form 10-Q filed August 6, 2019 (File No. 001-13881).\n*10.8.8\nAmendment dated May 8, 2020 to the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.1 to our Form 10-Q filed August 10, 2020 (File No. 001-13881).\n*10.9.1\nForm of Executive Restricted Stock Unit/MI Shares Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2021).\nExhibit No. 10.4 to our Form 10-Q filed May 10, 2021 (File No. 001-13881).\n*10.9.2\nForm of MI Shares Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2023).\nExhibit No. 10.1 to our Form 10-Q filed May 2, 2023 (File No. 001-13881).\n69\nTable of Contents\n    \n                                    \nExhibit No.\nDescription\nIncorporation by Reference (where a report is indicated below, that document has been previously filed with the SEC and the applicable exhibit is incorporated by reference thereto)\n*10.9.3\nForm of Restricted Stock Unit Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan (February 2024).\nExhibit No. 10.\n3 to our Form 10-Q filed M\nay 1, 2024 (File No. 001-13881). \n*10.10.1\nForm of Stock Appreciation Rights Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (pre-February 2018).\nExhibit No. 10.12 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.10.2\nForm of Stock Appreciation Rights Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2018).\nExhibit No. 10.7 to our Form 10-Q filed May 10, 2018 (File No. 001-13881).\n*10.10.3\nForm of Stock Appreciation Rights Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (March 2019).\nExhibit No. 10.3 to our Form 10-Q filed May 10, 2019 (File No. 001-13881).\n*10.10.4\nForm of Stock Appreciation Rights Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2021).\nExhibit No. 10.5 to our Form 10-Q filed May 10, 2021 (File No. 001-13881).\n*10.10.5\nForm of Stock Appreciation Rights Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2023).\nExhibit No. 10.3 to our Form 10-Q filed May 2, 2023 (File No. 001-13881).\n*10.10.6\nForm of Stock Appreciation Rights Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan (February 2024).\nE\nxhibit No. 10.1 to our Form 10-Q filed\n May 1, 2024\n (File No\n. 001-13881).\n*10.11.1\nForm of Performance Share Unit Award Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2021). \nExhibit No. 10.6 to our Form 10-Q filed May 10, 2021 (File No. 001-13881)\n.\n*10.11.2\nForm of Performance Share Unit Award Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (February 2023).\nExhibit No. 10.2 to our Form 10-Q filed May 2, 2023 (File No. 001-13881).\n*10.11.3\nForm of Performance Share Unit Award Agreement for the 2023 Marriott International, Inc. Stock and Cash Incentive Plan (February 2024).\nE\nxhibit No. 10.2 to our \nForm 10-Q filed May \n1, 2024 (\nFile No. 001-13\n881).\n*10.12.1\nForm of Non-Employee Director Deferred Fee Award Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.2 to our Form 10-Q filed August 2, 2022 (File No. 001-13881).\n*10.12.2\nForm of Non-Employee Director Deferred Share Award Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan.\nExhibit No. 10.3 to our Form 10-Q filed August 2, 2022 (File No. 001-13881).\n*10.13.1\nForm of Non-Employee Director Stock Appreciation Right Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (Pre-May 2022).\nExhibit No. 10.12.2 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.13.2\nForm of Non-Employee Director Stock Appreciation Right Agreement for the Marriott International, Inc. Stock and Cash Incentive Plan (May 2022).\nExhibit No. 10.4 to our Form 10-Q filed August 2, 2022 (File No. 001-13881).\n*10.14.1\nMarriott International, Inc. Executive Deferred Compensation Plan, amended and restated as of February 11, 2022.\nExhibit No. 10.6.1 to our Form 10-K filed February 15, 2022 (File No. 001-13881).\n*10.14.2\nFirst Amendment to the Marriott International, Inc. Executive Deferred Compensation Plan, effective as of October 31, 2022.\nExhibit No. 10.7.2 to our Form 10-K filed February 14, 2023 (File No. 001-13881).\n*10.14.3\nSecond Amendment to the Marriott International, Inc. Executive Deferred Compensation Plan, effective as of January 1, 2024.\nExhibit No. 10.15.3 to our Form 10-K filed February 13, 202\n4\n (File No. 001-13881).\n*10.14.4\nThird Amendment to the Marriott International, Inc. Executive Deferred Compensation Plan, effective as of January 1, 2025.\nExhibit No. 10.1 to our Form 10-Q filed November 4, 2024 (File No. 001-13881).\n70\nTable of Contents\n    \n                                    \nExhibit No.\nDescription\nIncorporation by Reference (where a report is indicated below, that document has been previously filed with the SEC and the applicable exhibit is incorporated by reference thereto)\n*10.15.1\nStarwood 2013 Long-Term Incentive Compensation Plan.\nExhibit No. 4.4 to Starwood’s Form S-8 filed June 28, 2013 (File No. 333-189674).\n*10.15.2\nAmendment dated June 29, 2016 to the Starwood 2013 Long-Term Incentive Compensation Plan.\nExhibit No. 10.20 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.15.3\nAmendment dated September 23, 2016 to the Starwood 2013 Long-Term Incentive Compensation Plan.\nExhibit No. 10.21 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.15.4\nAmendment dated May 5, 2017 to the Starwood 2013 Long-Term Incentive Compensation Plan.\nExhibit No. 10.19.1 to our Form 10-K filed February 15, 2018 (File No. 001-13881).\n*10.16\nAmended and Restated Aircraft Time Sharing Agreement, effective as of September 14, 2023, between Marriott International Administrative Services, Inc. and Anthony Capuano.\nExhibit No. 10.2 to our Form 10-Q filed November 2, 2023 (File No. 001-13881).\n10.17\nThird Amended and Restated Aircraft Time Sharing Agreement, effective as of November 7, 2024, between Marriott International Administrative Services, Inc. and J. Willard Marriott, Jr.\nFiled with this report.\n*10.18\nAircraft Time Sharing Agreement, effective as of February 9, 2023, between Marriott International Administrative Services, Inc. and David Marriott.\nExhibit No. 10.16 to our Form 10-K filed February 14, 2023 (File No. 001-13881).\n19\nMarriott International, Inc. Securities Trading Policy (MIP-11).\nFiled with this report.\n21\nSubsidiaries of Marriott International, Inc.\nFiled with this report.\n23\nConsent of Ernst & Young LLP.\nFiled with this report.\n31.1\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(a).\nFiled with this report.\n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a).\nFiled with this report.\n32\nSection 1350 Certifications.\nFurnished with this report.\n97\nMarriott International, Inc. Rule 10D-1 Clawback Policy.\nExhibit No. 97 to our Form 10-K filed February 13, 2024 (File No. 001-13881).\n101\nThe following financial statements from Marriott International, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (Extensible Business Reporting Language): (i) the Consolidated Statements of Income for the year ended December 31, 2024, December 31, 2023, and December 31, 2022; (ii) the Consolidated Balance Sheets at December 31, 2024, and December 31, 2023; (iii) the Consolidated Statements of Cash Flows for the year ended December 31, 2024, December 31, 2023, and December 31, 2022; (iv) the Consolidated Statements of Comprehensive Income for the year ended December 31, 2024, December 31, 2023, and December 31, 2022; (v) the Consolidated Statements of Stockholders’ (Deficit) Equity for the year ended December 31, 2024, December 31, 2023, and December 31, 2022; and (vi) Notes to Consolidated Financial Statements.\nSubmitted electronically with this report.\n101.INS\nXBRL Instance Document.\nSubmitted electronically with this report.\n101.SCH\nXBRL Taxonomy Extension Schema Document.\nSubmitted electronically with this report.\n101.CAL\nXBRL Taxonomy Calculation Linkbase Document.\nSubmitted electronically with this report.\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase.\nSubmitted electronically with this report.\n71\nTable of Contents\n    \n                                    \nExhibit No.\nDescription\nIncorporation by Reference (where a report is indicated below, that document has been previously filed with the SEC and the applicable exhibit is incorporated by reference thereto)\n101.LAB\nXBRL Taxonomy Label Linkbase Document.\nSubmitted electronically with this report.\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document.\nSubmitted electronically with this report.\n104\nThe cover page from Marriott International, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (included as Exhibit 101).\nSubmitted electronically with this report.\n*    Denotes management contract or compensatory plan.\nItem 16. \n    \nForm 10-K Summary.\nNone.\n72\nTable of Contents\n    \n                                    \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, we have duly caused this Form 10-K to be signed on our behalf by the undersigned, thereunto duly authorized, on this 11th day of February 2025.\nMARRIOTT INTERNATIONAL, INC.\nBy:\n/s/Anthony G. Capuano\nAnthony G. Capuano\nPresident and Chief Executive Officer\nPursuant to the requirements of the Exchange Act, this Form 10-K has been signed by the following persons on our behalf in the capacities indicated and on the date indicated above.\nPRINCIPAL EXECUTIVE OFFICER:\n/s/Anthony G. Capuano\nPresident, Chief Executive Officer and Director\nAnthony G. Capuano\nPRINCIPAL FINANCIAL OFFICER:\n/s/Kathleen K. Oberg\nChief Financial Officer and Executive Vice President, Development\nKathleen K. Oberg\nPRINCIPAL ACCOUNTING OFFICER:\n/s/Felitia O. Lee\nController and Chief Accounting Officer\nFelitia O. Lee\nDIRECTORS:\n/s/David S. Marriott\n/s/Aylwin B. Lewis\nDavid S. Marriott, Chairman of the Board\nAylwin B. Lewis, Director\n/s/Isabella D. Goren\n/s/Margaret M. McCarthy\nIsabella D. Goren, Director\nMargaret M. McCarthy, Director\n/s/Deborah Marriott Harrison\n/s/Grant F. Reid\nDeborah Marriott Harrison, Director\nGrant F. Reid, Director\n/s/Frederick A. Henderson\n/s/Horacio D. Rozanski\nFrederick A. Henderson, Director\nHoracio D. Rozanski, Director\n/s/Lauren R. Hobart\n/s/Susan C. Schwab\nLauren R. Hobart, Director\nSusan C. Schwab, Director\n/s/Debra L. Lee\nDebra L. Lee, Director\n73"
  }
}