{
  "ticker": "MAS",
  "cik": "0000062996",
  "company_name": "MASCO CORP /DE/",
  "filing_date": "2025-02-11",
  "accession": "0000062996-25-000004",
  "primary_doc": "mas-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBusiness. \nMasco Corporation and its subsidiaries (the “Company”) is a global leader in the design, manufacture and distribution of branded home improvement and building products. Our portfolio of industry-leading brands includes BEHR® paint; DELTA® and HANSGROHE® faucets, bath and shower fixtures; LIBERTY® branded decorative and functional hardware; and HOT SPRING® spas. We leverage our powerful brands across product categories, sales channels and geographies to create value for our customers and shareholders.\nWe believe that our solid results of operations and financial position for 2024 resulted from our continued focus on our three strategic pillars: \n•\ndrive the full potential of our core businesses; \n•\nleverage opportunities across our enterprise; and \n•\nactively manage our portfolio.\nIn 2024, we continued to return value to our shareholders by repurchasing approximately 10.0 million shares of our common stock and increasing our quarterly dividend by approximately two percent compared to 2023. In addition, in the third quarter of 2024, we completed the divestiture of our Kichler Lighting business.\nOur Business Segments\nWe report our financial results in two segments, our Plumbing Products segment and our Decorative Architectural Products segment, which are aggregated by product similarity.  Our Decorative Architectural Products segment is impacted by seasonality and normally experiences stronger sales during the second and third calendar quarters, corresponding with the peak season for repair and remodel activity.\n2\nPlumbing Products\nThe businesses in our Plumbing Products segment sell a wide variety of products that are manufactured or sourced by us. \n•\nOur plumbing products include faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, shower drains, steam shower systems, water filtration systems, sinks and kitchen accessories. We primarily sell these products to home center retailers, online retailers, mass merchandisers, wholesalers and distributors that, in turn, sell them to plumbers, building contractors, remodelers, smaller retailers, consumers and homebuilders. The majority of our faucet, bathing and showering products are sold primarily in North America, Europe and China under the brand names DELTA\n®\n, BRIZO\n®\n, PEERLESS\n®\n, HANSGROHE\n®\n, AXOR\n®\n, KRAUS\n®\n, EASY DRAIN\n®\n, NEWPORT BRASS\n®\n, GINGER\n®\n, BRASSTECH\n®\n and WALTEC\n®\n. Our BRISTAN™ and HERITAGE™ products are sold primarily in the United Kingdom. \n•\nWe manufacture acrylic tubs, bath and shower enclosure units\n,\n and shower bases and trays\n.\n Our DELTA, PEERLESS and MIROLIN\n®\n products are sold primarily to home center retailers in North America. Our MIROLIN products are also sold to wholesalers and distributors in Canada.\n•\nOur spas, exercise pools, aquatic fitness systems and saunas are manufactured and sold under our HOT SPRING\n®\n, CALDERA\n®\n, FREEFLOW SPAS\n®\n, FANTASY SPAS\n®\n, AQUATERRA\n®\n, LIFESMART\n®\n, ENDLESS POOLS\n®\n, TYLO\n®\n, FINNLEO\n®\n and HELO\n®\n brands, as well as under other trademarks. Our spas, exercise pools and saunas are sold worldwide to independent specialty retailers and distributors and our spas and saunas are also sold to online mass merchandisers. Certain exercise pools are also available on a consumer-direct basis in North America and Europe, while our aquatic fitness systems are sold through independent specialty retailers as well as on a consumer-direct basis in some areas. \n•\nIncluded in our Plumbing Products segment are brass\n,\n copper and composite plumbing system components and other non-decorative plumbing products that are sold to plumbing, heating and hardware wholesalers, home center and online retailers, hardware stores, building supply outlets and other mass merchandisers. These products are marketed primarily in North America under our BRASSCRAFT\n®\n, PLUMBSHOP\n®\n and MASTER PLUMBER\n®\n brands and are also sold under private label.\n•\nWithin our Plumbing Products segment we develop connected water products that enhance the experience with water in homes and businesses. These systems include touchless activation, voice activation, controlled volume dispensing and provide for monitoring and controlling the temperature and flow of water and are compatible with a range of faucets, showerheads and other showering components.\n•\nWe also supply high-quality, custom thermoplastic solutions, extruded plastic profiles and specialized fabrications, as well as PEX tubing, to manufacturers, distributors and wholesalers for use in diverse applications that include faucets and plumbing supplies, appliances, oil and gas equipment and building products. \nWe believe that our plumbing products are among the leaders in sales in North America and Europe. Competitors of the majority of our products in this segment include Dornbracht AG & Co. KG, Zurn Elkay Water Solutions Corporation, Fortune Brands Innovations, Inc.'s Moen, Rohl and Riobel brands, Kohler Co., Lixil Group Corporation’s American Standard and Grohe brands, Spectrum Brands Holdings, Inc.'s Pfister faucets as well as private label and digitally native brands. Competitors of our spas, exercise pools, aquatic fitness systems and saunas include Artesian Spas, Harvia, Jacuzzi and Master Spas brands, among others. Foreign manufacturers competing with us are located primarily in Europe, China and Canada. Additionally, we face significant competition from private label products and digitally native brands. The businesses in our Plumbing Products segment manufacture products primarily in North America and Europe as well as in Asia and source products from Asia and other regions. Competition for our plumbing products is based largely on brand reputation, product features and innovation, product quality, customer service, breadth of product offering and price. Many of the faucet and showering products with which our products compete are manufactured by low-cost foreign manufacturers that contribute to price competition.\n3\nMany of our plumbing products contain brass, the major components of which are copper and zinc. We have multiple sources, both domestic and foreign, for our raw materials used in this segment. We have encountered price volatility for brass, brass components and any components containing copper and zinc. To help reduce the impact of this volatility, from time to time we may enter into long-term agreements with certain significant suppliers. In addition, some of the products in this segment that we import have been and may in the future be subject to duties and tariffs.\nDecorative Architectural Products\nOur Decorative Architectural Products segment primarily includes architectural coatings, including paints, primers, specialty coatings, stains and waterproofing products, as well as paint applicators and accessories. These products are sold primarily in North America as well as in South America under the brand names BEHR\n®\n, KILZ\n®\n, WHIZZ\n®\n,\n \nElder & Jenks\n®\n \nand other trademarks to “do‑it‑yourself” and professional customers through home center retailers and other retailers. Net sales of architectural coatings comprised approximately 32 percent of our consolidated net sales in 2024, 2023, and 2022. Our BEHR products are sold through The Home Depot, our largest customer overall, as well as this segment’s largest customer. Our Behr business grants Behr brand exclusivity in the retail sales channel in North America to The Home Depot. The granting of exclusivity affects our ability to sell those products and brands to other customers, and the loss of this segment’s sales to The Home Depot would have a material adverse effect on this segment’s business and on our consolidated business as a whole.\nOur competitors in this segment include large national and international brands such as Benjamin Moore & Co., Pittsburgh Paints Co.'s Glidden, Olympic, Pittsburgh Paints and Stains and PPG Paints brands, RPM International, Inc.'s Rust-Oleum and Zinsser brands, The Sherwin‑Williams Company's Minwax, Sherwin-Williams, Thompson’s Water Seal, Valspar and Purdy brands and the Wooster Brush Company, as well as many regional and other national brands. We believe that brand reputation is an important factor in consumer selection, and that competition in this industry is also based largely on product features and innovation, product quality, customer service, breadth of product offering and price. \nAcrylic resins and titanium dioxide are principal raw materials in the manufacture of architectural coatings. The price of acrylic resins fluctuates based on the price of its components, which can have a material impact on our costs and results of operations in this segment. The price for titanium dioxide can fluctuate as a result of global supply and demand dynamics and production capacity limitations, which can have a material impact on our costs and results of operations in this segment. In addition, the prices of crude oil, natural gas, propylene and certain petroleum by-products can impact our costs and results of operations in this segment. We have multiple sources, both domestic and foreign, for the raw materials used in this segment and have encountered price volatility with respect to certain of these materials. To help reduce the impact of this price volatility, we have and may in the future enter into long-term agreements with certain significant suppliers. We import certain materials and products for this segment that have been and may in the future be subject to duties and tariffs. We also have agreements with certain significant suppliers for this segment that are intended to help assure continued supply. \nOur Decorative Architectural Products segment includes branded cabinet and door hardware, functional hardware, wall plates, hook and hook rail products, and outdoor living hardware, which are manufactured for us and sold to home center retailers, mass retailers, online retailers, other specialty retailers, original equipment manufacturers and wholesalers. These products are sold under the LIBERTY\n®\n, BRAINERD\n®\n, FRANKLIN BRASS\n®\n and other trademarks. Our key competitors in North America include Amerock Hardware, Richelieu Hardware Ltd., Top Knobs and private label brands. Decorative bath hardware, shower accessories, mirrors and shower doors are sold under the brand names DELTA\n®\n and FRANKLIN BRASS\n®\n and other trademarks to home center retailers, mass retailers, online retailers, other specialty retailers and wholesalers. Competitors for these products include American Bath Group, LLC's Dreamline brand, Fortune Brands Innovations, Inc.'s Moen brand, Gatco Fine Bathware, Kohler Co. and private label brands.\n4\nAdditional Information\nIntellectual Property\nWe hold numerous U.S. and foreign patents, patent applications, licenses, trademarks, trade names, trade secrets and proprietary manufacturing processes. We view our trademarks and other intellectual property rights as important, but do not believe that there is any reasonable likelihood of a loss of such rights that would have a material adverse effect on our present business as a whole.\nLaws and Regulations Affecting Our Business\nWe are subject to federal, state, local and international government laws and regulations. For a more detailed description of the various laws and regulations that impact our business, see",
    "item1a": "Item 1A. Risk Factors.\nThere are a number of business risks and uncertainties that could impact our business. These risks and uncertainties could cause our actual results to differ from past performance or expected results. We consider the following risks and uncertainties to be most relevant to our specific business activities. Additional risks and uncertainties not presently known to us, or that we currently believe to be immaterial, also may adversely impact our business, results of operations and financial position.\nStrategic Risks\nOur business strategy is focused on residential repair and remodeling activity and, to a lesser extent, on new home construction activity, both of which are impacted by a number of economic and other factors.\nOur business performance relies on residential repair and remodeling activity and, to a lesser extent, on new home construction activity. A number of factors impact consumers’ spending on home improvement projects as well as new home construction activity, including:\n•\nconsumer confidence levels; \n•\nconsumer income and debt levels;\n•\nunemployment and underemployment levels;\n•\nthe availability of home equity loans and mortgages and the interest rates for and tax deductibility of such loans; \n•\ninflationary pressures;\n•\nchanging government policies and programs;\n•\nexisting home sales;\n•\nage of the housing stock;\n•\nfluctuations in home prices;\n•\nhousehold formation;\n•\ntrends in lifestyle and housing design;\n•\nthe availability of skilled tradespeople for repair and remodeling work; and\n•\nnatural disasters, terrorist acts, pandemics, social or civil unrest, wars or conflicts or other catastrophic events.\nWe have been and may in the future be negatively impacted by adverse changes or uncertainty involving one or more of the factors listed above. In addition, the fundamentals driving our business are impacted by economic cycles.\n \nEconomic contractions or recessions have resulted in and could in the future result in a decline in residential repair and remodeling activity or in demand for new home construction, adversely impacting our results of operations and financial position.\nWe may not achieve all of the anticipated benefits of our strategic initiatives. \nWe continue to pursue our strategy of driving the full potential of our core businesses, leveraging opportunities across our enterprise, and actively managing our portfolio. Our strategy is designed to grow revenue, improve profitability and increase shareholder value over the mid- to long-term. We execute our strategy by investing in our brands, developing innovative products, making capital investments, and focusing on continuous productivity improvement and operational excellence, among other initiatives. Our business performance and results of operations could be adversely impacted if we are unable to timely and effectively execute our strategy. We could also be adversely impacted if we have not appropriately prioritized and balanced our strategic initiatives or if we are unable to effectively manage change throughout our organization.\n7\nWe may not be able to successfully execute our acquisition strategy or integrate businesses that we acquire. \nPursuing the acquisition of businesses complementary to our portfolio is a component of our strategy for future growth. If we are not able to identify suitable acquisition candidates or consummate potential acquisitions within a desired time frame or at acceptable terms and prices, our long-term competitive positioning may be impacted. Even if we are successful in acquiring businesses, the businesses we acquire may not be able to achieve the revenue, profitability or growth we anticipate, or we may experience challenges and risks in integrating these businesses into our existing business, including our governance and compliance framework. Such risks include:\n•\ndiversion of management attention and our resources;\n•\nissues or conflicts with our new or existing customers or suppliers; \n•\nrealizing expected synergies and economies of scale;\n•\nretaining key employees of the acquired businesses; and\n•\nunforeseen liabilities. \nInternational acquisitions that we have made, and those that we may make in the future, may continue to increase our exposure to foreign currency risks, and risks associated with interpretation, compliance with and enforcement of international regulations and the policies of other governments. Our failure to address these risks could cause us to incur additional costs and fail to realize the anticipated benefits of our acquisitions and could adversely impact our results of operations and financial position.\nBusiness and Operational Risks\nVariability in the cost and availability of our raw materials, component and finished products could impact our results of operations and financial position.\nWe purchase substantial amounts of raw materials, components and finished products from outside sources, including international sources, and we manufacture certain of our products outside of the United States. Increases in the cost of the materials we purchase, including as a result of diminished availability, increased tariffs and inflation or unfavorable fluctuations in currency exchange rates have increased and may in the future increase the prices for our products and negatively impact our results of operations and financial position. Further, our production has been and may in the future be impacted if we or our suppliers are unable to procure our requirements for various raw materials, including, among others, brass, copper, resins, titanium dioxide and zinc. Elevated energy prices have increased and may in the future increase our production and transportation costs. In addition, water is a significant component of our architectural coatings products and may be subject to shortages and restrictions on supply in certain regions, due to climate-related and other influences. These factors could adversely impact our results of operations and financial position.\nIt can be difficult for us to pass our cost increases on to our customers. Our existing arrangements with customers, competitive considerations and customer resistance to price increases may delay or make us unable to adjust selling prices. If we are not able to sufficiently increase the prices of our products or achieve cost savings to offset increased material, production, transportation and labor costs, our results of operations and financial position could be adversely impacted. Increased selling prices for our products have led and may in the future lead to sales declines and loss of market share, particularly if those prices are not competitive. When our material costs decline, we have received and may in the future receive pressure from our customers to reduce our prices. Such reductions have had and could in the future have an adverse impact on our results of operations and financial position.\nFrom time to time we enter into long-term agreements with certain significant suppliers to help ensure continued availability of the raw materials, components and finished products we require and to establish firm pricing, but these contractual commitments may result in our paying above market prices during the term of the contract and may limit our ability to adjust our sourcing partners in the future. In addition, we may use derivative instruments, including commodity hedges. This strategy increases the possibility that we may forego the benefits that might result from favorable fluctuations in prices, which has had and may in the future have an adverse impact on our results of operations and financial position.\n8\nWe are dependent on suppliers and service providers.\nWe are dependent on third parties for our raw materials, many of our components and finished products and for certain services. Our ability to offer a wide variety of products and provide high levels of service to our customers depends on whether we can obtain an adequate and timely supply of these goods and services. Failure of our suppliers to timely provide us goods and services on commercially reasonable terms or to comply with applicable contractual, legal and regulatory requirements or our supplier business practices policy could have an adverse impact on our results of operations and financial position or could damage our reputation. \nThe operations of the third parties on which we depend have been and could in the future be impacted by: changing laws, regulations and government policies, including those related to climate change; cybersecurity breaches; labor availability; raw material shortages; energy availability; supply disruptions; and adverse weather conditions, pandemics, social or civil unrest, wars or conflicts and other force majeure events. Any of these factors could disrupt our third parties’ operations and result in shortages of supply, assertion of force majeure and increases in the prices charged to us for the raw materials, components and finished products they produce or services they provide. Sourcing these goods and services from alternate suppliers, including suppliers from new geographic regions, or re-engineering our products as a result of supplier disruptions, can be time-consuming and costly and could result in inefficiencies or delays in our business operations or could negatively impact the quality of our products. In addition, the loss of critical suppliers, or a substantial decrease in the availability of supply, has disrupted and could in the future disrupt our business and has had and may in the future have an adverse impact on our results of operations and financial position.\nMany of the suppliers we rely upon are located in countries outside of the United States. The differences in business practices, shipping and delivery requirements and costs, changes in economic conditions and trade policies and laws and regulations, together with the limited number of suppliers available to us, have increased the complexity of our supply chain logistics and the potential for interruptions in our production scheduling. We have experienced and may in the future experience constraints on and disruptions to transporting our raw materials, components and finished products from our international and domestic suppliers as well as higher transportation costs. If we are unable to effectively manage our supply chain our results of operations and financial position could be adversely impacted.\nThere are risks associated with our international operations and global strategies.\nIn 2024, 20 percent of our sales were made outside of North America (particularly in Europe) and transacted in currencies other than the U.S. dollar. In addition to our European operations, we manufacture products in other locations, including Asia and Mexico and source products and components from third parties globally. Risks associated with our international operations include:\n•\ndifferences in culture, economic and labor conditions and practices;\n•\ndifferences in enforcement of contract and intellectual property rights; \n•\ndifferences in the policies of the U.S. and foreign governments; \n•\ndisruptions in trade relations and economic instability;\n•\nnatural disasters, terrorist attacks, pandemics, wars or conflicts or other catastrophic events;\n•\nsocial or civil unrest; and\n•\ntimeliness of transportation and port congestion or disruption.\nWe have been and may in the future be negatively impacted by adverse changes or uncertainty involving one or more of the factors listed above.\n9\nWe are also affected by domestic and international laws, regulations and government policies applicable to companies doing business outside of the U.S., or importing and exporting goods and materials. These include laws and regulations related to anti-bribery/anti-corruption, competition, data privacy, environmental, social and governance (“ESG”) matters, sanctions, tax, trade, including duties and tariffs, and other business practices. Compliance with these laws, regulations and government policies is costly, and future changes to these laws may require significant management attention and disrupt our operations. Additionally, while it is difficult to assess what changes may occur and the relative effect on our international tax structure, significant changes in how U.S. and international jurisdictions tax cross-border transactions could adversely impact our results of operations and financial position.\nOur results of operations and financial position are also impacted by changes in currency exchange rates. Unfavorable currency exchange rates, particularly the euro, the Chinese renminbi, the Canadian dollar, the British pound sterling and the Mexican peso, have in the past adversely impacted us, and could adversely impact us in the future. Fluctuations in currency exchange rates may also present challenges in comparing our operating performance from period to period.\nThe long-term performance of our businesses relies on our ability to attract, develop and retain a talented and diverse workforce.\nFor our businesses to be successful, we must invest significant resources to attract, develop and retain highly qualified, talented and diverse employees, who have the experience, knowledge and expertise to implement our strategic and business initiatives. We compete for employees with a broad range of employers in many different industries, including large multinational firms. We have faced and may in the future face challenges in recruiting, developing, engaging and retaining employees, particularly when the labor market is experiencing low unemployment levels, increasing compensation and increasing competition.\nIf we are unable to successfully implement our talent strategies, including attracting, developing, engaging and retaining key employees, building strong and diverse leadership teams, developing effective succession planning and successfully executing organizational change and leadership transition, our results of operations and financial position could be adversely impacted.\nExtreme weather events and changes in climate could adversely impact our results of operations and financial position.\nExtreme weather events, such as severe winter and other storms, hurricanes, fires, floods, tornados and droughts, as a result of climate change or other factors, have negatively impacted and may in the future negatively impact our business. These types of events can be disruptive to our operations and may impact consumer spending. In addition, some of our suppliers are located in areas that have experienced extreme weather events which have impacted and may in the future impact the availability and cost of some of our raw materials, components and finished products. If the frequency or severity of extreme weather increases, we may experience interruptions to our operations, further impact on our supply chain, increased operating costs or loss or damage to our property or inventory, which could adversely impact our results of operations and financial position.  \nRestrictive covenants in our credit agreement could limit our financial flexibility.\nWe must comply with both financial and nonfinancial covenants in our credit agreement, and in order to borrow under it, we cannot be in default with any of those provisions. Our ability to borrow under the credit agreement could be affected if our earnings significantly decline to a level where we are not in compliance with the financial covenants or if we default on any nonfinancial covenants. In the past, we have been able to amend the covenants in our credit agreement, but there can be no assurance that in the future we would be able to further amend them. If we were unable to borrow under our credit agreement, our financial flexibility could be restricted.\n10\nCompetitive Risks\nWe could lose market share if we do not maintain our strong brands, develop innovative products or respond to changing consumer purchasing practices and preferences.\nOur competitive advantage is due, in part, to our ability to maintain our strong brands and to develop and introduce innovative new and improved products. Our initiatives to invest in brand building, brand awareness and product innovation may not be successful. The uncertainties associated with developing and introducing innovative new and improved products, such as gauging changing consumer demands and preferences and successfully developing, manufacturing, marketing, selling and servicing these products, may impact the success of our product introductions. If the products we introduce do not gain widespread acceptance or if our competitors improve their products more rapidly or effectively than we do, we could lose market share or be required to reduce our prices, which could adversely impact our results of operations and financial position. \nOur customers’ business models and strategies continue to change. As our customers execute their strategies to reach end consumers through multiple channels, they rely on us to support their efforts, including by maintaining our own robust and user-friendly websites with sufficient content for consumer research, providing sufficient product data to support their websites and providing comprehensive supply chain solutions and differentiated product development and service offerings. If we are unable to successfully provide this support to our customers or if our customers are unable to successfully execute their strategies, our brands may lose market share, which could adversely impact our results of operations and financial position.\nConsumer preferences have also changed, including a shift in consumer purchasing practices toward e-commerce and a potential increase in consumer demand for products with certain attributes, such as connected products and sustainable products. If we do not timely and effectively implement our strategic and business initiatives related to these practices and preferences or identify and adequately respond to new changes, our relationships with our customers and with consumers could be harmed, our ability to retain our customers and consumers may be negatively impacted, the demand for our brands and products could be reduced and our results of operations and financial position could be adversely impacted.\nDamage to our public image and reputation could adversely impact our results of operations and financial position.\nOur public image and reputation are important to maintaining our strong brands. Our results of operations and financial position could be adversely impacted by a negative perception regarding our products or company practices, positions or public statements, even if unfounded, negative claims and comments in social media or the press or a data breach. \nFurthermore, stakeholders are increasingly scrutinizing companies' ESG practices, and stakeholders’ expectations regarding ESG practices are diverse and rapidly changing. We may not be able to align our ESG practices with such evolving expectations within the timeframes expected by stakeholders or without incurring significant costs. In addition, we may not be able to achieve our aspirational goals related to our ESG initiatives, which are and may continue to be impacted by many complexities and variables, such as renewable energy infrastructure and availability, a challenging economic environment, changes to our operations and changes to our portfolio of businesses via acquisitions or divestitures. A failure or perceived failure by us in this regard may damage our reputation and adversely impact our results of operations and financial position.  \n11\nWe face significant competition and operate in an evolving competitive landscape.\nOur products face significant competition. We believe that brand reputation is an important factor affecting product selection and that we compete on the basis of product features, innovation, quality, customer service, warranty and price. We sell our products through home center retailers, online retailers, distributors and independent dealers and rely on these customers to market and promote our products to consumers. Our success with our customers is dependent on, among other things, our ability to provide quality products with desired features at acceptable prices with timely delivery and a high level of customer service. Home center retailers, which have historically concentrated their sales efforts on retail consumers and remodelers, are increasingly selling directly to professional contractors and installers, which may adversely impact our margins on our products that contractors and installers would otherwise buy through our dealers and wholesalers. In addition, as home center retailers develop customer experience programs to attract and retain contractors and installers, they are relying on us to support their efforts. Such support has been and could continue to be time-consuming and costly and these efforts may not be successful, which may impact our growth, results of operations and financial position.\nCertain of our customers sell products sourced from low-cost foreign manufacturers under their own private label brands, which directly compete with our brands. As a result of this trend, we have experienced and may in the future experience lower demand for our products or a shift in the mix of some products we sell toward more value-priced or opening price point products, which has impacted and may in the future impact our results of operations and financial position.\nIn addition, we face competitive pricing pressure in the marketplace, including sales promotion programs, that could impact our market share or result in price reductions, which could adversely impact our results of operations and financial position.\nThe growing e-commerce channel brings an increased number of competitors and greater pricing transparency for consumers, as well as conflicts between our existing distribution channels and a need for different distribution methods. These factors have impacted and could in the future impact our results of operations and financial position. In addition, our relationships with our customers, including home center retailers, may be impacted if we increase the amount of business we transact in the e-commerce channel. \nIf we are unable to maintain our competitive position in our industries, our results of operations and financial position could be adversely impacted.\nOur sales are concentrated with three significant customers and this concentration may continue to increase. In 2024, our net sales to The Home Depot were $3.0 billion (approximately 38 percent of our consolidated net sales), and our net sales to Ferguson and Lowe’s were each less than 10 percent of our consolidated net sales. These customers can significantly impact the prices we receive for our products and the terms and conditions on which we do business with them. Additionally, these customers have reduced in the past and may in the future reduce the number of vendors from which they purchase and could make significant changes in their volume of purchases from us. Although other retailers, dealers, distributors and homebuilders represent other channels of distribution for our products and services, we might not be able to quickly replace, or replace at all, the loss of a substantial portion of our sales to The Home Depot or the loss of all of our sales to either Ferguson or Lowe’s. Any such loss would have a material adverse impact on our business, results of operations and financial position.\nIn addition, our Behr business grants Behr brand exclusivity in the retail sales channel in North America to The Home Depot, and from time to time, certain of our other businesses grant product and/or brand exclusivity to our customers. The granting of exclusivity impacts our ability to sell those products and brands to other customers and can increase the complexity of our product offerings and our costs.\n12\nTechnology and Intellectual Property Risks\nWe are subject to cybersecurity attacks, which could adversely impact our results of operations and financial position.\nGlobal cybersecurity vulnerabilities, threats and more frequent, sophisticated and targeted attacks pose a risk to our information technology systems and to critical third-party information technology platforms we utilize. We have implemented security policies, processes and layers of defense designed to help identify and protect against misappropriation or corruption of our systems and information and disruption of our operations. Despite these efforts, systems we utilize have been and may in the future be damaged, disrupted, ransomed or shut down due to cybersecurity attacks by unauthorized access, malware, ransomware, undetected intrusion, hardware failures, or other events, and in these circumstances our disaster recovery plans may be ineffective or inadequate. \nThese attacks could have the following impacts on our business, some of which we have experienced:\n•\nbusiness interruption;\n•\ndamage to our relationships with our employees, suppliers, customers and consumers;\n•\ndamage to the reputation of our brands;\n•\ndata corruption;\n•\nexposure or loss of proprietary confidential or financial information or the personal information of our employees, suppliers, customers or consumers;\n•\nexposure to litigation;\n•\ninability to report our financial results in a timely manner;\n•\nincreased costs associated with the remediation and mitigation of such attacks;\n•\nproduct shipment delays;\n•\nproduction or operational downtime; and \n•\ntheft of our assets.\nIn addition, we could be adversely impacted if any of our significant customers, suppliers or service providers experiences any similar events that disrupt their business operations or damage their reputation. Such events could adversely impact our results of operations and financial position. \nWe rely on information systems and technology, and a breakdown or interruption of these systems could adversely impact our results of operations and financial position.\nWe rely on many on-site and cloud-based information systems and technology to process, transmit, store and manage information to support our business activities. We may be adversely impacted if these information systems breakdown, fail, or if delays in system upgrades or replacements stretch those systems beyond support by third-party service providers, including cloud platform providers. \nIn addition to the consequences that may occur from interruptions in the current systems we utilize, we continue to invest in new technology systems throughout our company, including implementations of and upgrades to critical systems at our business units. System implementations and upgrades are complex and require significant management oversight, and we have experienced, and in the future may experience, unanticipated expenses and interruptions to our operations during these implementations and upgrades. Our results of operations and financial position, as well as the effectiveness of our internal controls over financial reporting, could be adversely impacted if we do not appropriately select, implement, maintain or upgrade our critical systems in a timely manner or if we experience significant unanticipated expenses or disruptions in connection with the implementation, upgrade or update of such systems.\n13\nWe may not be able to adequately protect or prevent the unauthorized use of our intellectual property.\nProtecting our intellectual property is important to our growth and innovation efforts. We own a number of patents, trademarks and other forms of intellectual property in our products and manufacturing processes throughout the world. There can be no assurance that our efforts to protect our intellectual property rights will prevent violations. Our intellectual property has been and may again be challenged or infringed upon by third parties, particularly in countries where property rights are not highly developed or protected. In addition, the global nature of our business increases the risk that we may be unable to obtain or maintain our intellectual property rights on reasonable terms. Furthermore, others have asserted and may in the future assert intellectual property infringement claims against us. Current and former employees, contractors, customers or suppliers have or may have had access to proprietary or confidential information regarding our business operations that could harm us if used by them, or disclosed to others, including our competitors. Protecting and preventing the unauthorized use of our intellectual property is costly, time consuming and requires significant resources. If we are not able to protect our existing intellectual property rights, or prevent unauthorized use of our intellectual property, sales of our products may be impacted and we may experience reputational damage to our brands, increased litigation costs and adverse impact to our competitive position, which could adversely impact our results of operations and financial position.\nLitigation and Regulatory Risks\nClaims and litigation could be costly.\nWe are involved in various claims and litigation, including class actions, mass torts and regulatory proceedings, that arise in the ordinary course of our business and that could have an adverse impact on us. The types of matters may include, among others: advertising, competition, contract, data privacy, employment, environmental, insurance coverage, intellectual property, personal injury, product compliance, product liability, securities and warranty. The outcome and effect of these matters are inherently unpredictable, and defending and resolving them can be costly and can divert management’s attention. We have and may in the future incur significant costs as a result of claims and litigation.\nWe are also subject to product safety regulations, product recalls and direct claims for product liability that can result in significant costs and, regardless of the ultimate outcome, create adverse publicity and damage the reputation of our brands and business. Also, we rely on suppliers to provide finished products and components for products that we sell. Due to the difficulty of controlling the quality of finished products and components we source from these suppliers, we are exposed to risks relating to the quality of such finished products and components and to limitations on our recourse against such suppliers.\nWe maintain insurance against some, but not all, of the risks of loss resulting from claims and litigation. The levels of insurance we maintain may not be adequate to fully cover our losses or liabilities. If any significant accident, judgment, claim or other event is not fully insured or indemnified against, it could adversely impact our results of operations and financial position.\nRefer to Note R to the consolidated financial statements included in Item 8 of this Report for additional information about litigation involving our businesses.\n14\nOur failure to comply with laws, government regulations and other requirements could adversely impact our results of operations and financial position. \nWe are subject to a wide variety of federal, state, local and international laws and regulations, including those relating to:\n•\nadvertising and marketing;\n•\nanti-bribery/anti-corruption;\n•\nclimate change and protection of the environment;\n•\ncompetition;\n•\ndata privacy;\n•\nemployment and labor matters, including wage and hour matters;\n•\nenvironment, health and safety matters;\n•\nproduct safety and performance;\n•\nprotection of employees and consumers;\n•\nsecurities matters;\n•\nsanctions;\n•\ntaxation; and\n•\ntrade, including duties and tariffs.\nIn addition to complying with current requirements and known future requirements, we will be subject to new or more stringent requirements in the future. \nAs we sell new types of products or existing products in new geographies or channels or for new applications, we are subject to the requirements applicable to those sales. Additionally, some of our products must be certified by industry organizations. Compliance with new or changed laws, regulations and other requirements, including as a part of government or industry response to climate change, may require us to alter our product designs, our manufacturing processes, our packaging or our sourcing or may result in restrictions on our operations. These compliance activities are costly and require significant management attention and resources. If we do not effectively and timely comply with such regulations and other requirements, our results of operations and financial position could be adversely impacted.",
    "item1b": "Item 1B. Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C. Cybersecurity. \nCybersecurity risk is a part of our \noverall\n enterprise risk management assessment. Our cybersecurity program is modeled on the National Institute of Security Technology Cybersecurity Framework (NIST CSF) which provides the governance structure for our identification of, protection against, detection of, response to and recovery from cybersecurity threats and incidents, including those associated with our use of third-party applications and service providers. \nKey components of our cybersecurity program include:\n•\nan enterprise organizational framework that consists of enterprise leaders that oversee our cybersecurity governance, including policies and standards, and functional business unit leaders that implement our cybersecurity policies;\n•\nthe identification of our cybersecurity risks and vulnerabilities and the implementation of protections against cybersecurity threats and incidents, including regular training to our employees; \n•\ncontinual global threat monitoring and detection, in partnership with third-party service providers;\n15\n•\na process for assessing the severity of cybersecurity threats, identifying whether the cybersecurity threats are associated with a \nthird-party\n service provider, and implementing an appropriate response and resolution to cybersecurity incidents, as necessary; and\n•\nrisk-based cybersecurity audits led by our internal audit function, which include cybersecurity control maturity assessments (based on NIST CSF), as well as attack simulations and penetration testing performed by third-party service providers.\nOur Board of Directors has overall oversight responsibility for our enterprise risk management and compliance programs, including cybersecurity. \nOur Board is responsible for ensuring that management has processes in place designed to identify and assess cybersecurity risks to which we are exposed, implement the appropriate protections to address such risks, identify cybersecurity threats and respond to and resolve cybersecurity incidents.\n \nManagement is responsible for identifying and assessing material cybersecurity risks on an ongoing basis and for developing, managing and implementing our cybersecurity program to assure that our potential cybersecurity risk exposures are monitored and appropriate mitigation measures are implemented.\n \nOur cybersecurity program is overseen by our Vice President, Information Technology and our Director, Cybersecurity. Our Vice President, Information Technology has significant professional experience in leading the information technology function and our Director, Cybersecurity has held various roles in cybersecurity and is an ISC2 Certified Information Security Professional (CISSP\n®\n). Each periodically participates in various industry cyber forums and communicates industry best practices to the appropriate internal information security professionals.\nOur cybersecurity program is managed and implemented by a team of enterprise level and business unit level information security professionals, partnering with \nthird party\n advisory services, as needed. The team’s focus is on our operational response to cybersecurity threats, exposure analysis, security governance and the design and implementation of our security controls. Our Incident Response Plan and attendant processes, developed by management, governs our process to respond to, remediate and resolve material cybersecurity incidents, including providing appropriate internal and external communication of such incidents.  \nAt least annually, our \nVice President, Information Technology\n discusses with our \nBoard\n a report on cybersecurity, including an update regarding our cybersecurity risks, mitigation activities and industry developments\n.\n In addition, our internal audit function provides regular updates to our Audit Committee on the results of our cybersecurity audits and related mitigation activities.\n In 2024, as part of our enterprise risk management update to our Board, our Vice President, Information Technology discussed risks and trends associated with information technology, including cyber-attacks, and current and future planned actions to mitigate such risks. In addition, in 2024, our Vice President, Information Technology reviewed with our Board updates related to our operational and resource readiness with respect to cyber incidents, our incident response processes and emerging cybersecurity risks. \nIn 2024, we did not identify any cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of operations, or financial condition.\n However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced an undetected cybersecurity incident. For more information about these risks, please see “Risk Factors – We are subject to cybersecurity attacks, which could adversely impact our results of operations and financial position” in this annual report on Form 10-K.\n16"
  }
}