{
  "ticker": "MCHP",
  "cik": "0000827054",
  "company_name": "MICROCHIP TECHNOLOGY INC",
  "filing_date": "2025-05-23",
  "accession": "0000827054-25-000077",
  "primary_doc": "mchp-20250331.htm",
  "item_sections": {
    "item1": "Item 1. Business,\" \"",
    "item1a": "Item 1A. Risk Factors”, including the risk factor titled “\nWe may lose sales if suppliers of raw materials, components or equipment fail to meet our or our customers' needs, increase prices, are impacted by increases in tariffs, or such raw materials, components or equipment become restricted or unavailable.\"\n48\nTable of Contents\nCritical Accounting Policies and Estimates\nGeneral\n \nOur discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with U.S. GAAP.  We review the accounting policies we use in reporting our financial results on a regular basis.  The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent liabilities.  On an ongoing basis, we evaluate our estimates, including those related to revenue recognition, inventories, income taxes and contingencies.  We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources.  Our results may differ from these estimates due to actual outcomes being different from those on which we based our assumptions.  We review these estimates and judgments on an ongoing basis.  We believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our consolidated financial statements.  \nRevenue Recognition \nWe generate revenue primarily from sales of our semiconductor products to distributors and non-distributor customers (direct customers).  We apply the following five-step approach to determine the timing and amount of revenue recognition: (i) identify the contract with the customer, (ii) identify performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when the performance obligation is satisfied.\nSales of semiconductor products to our customers are governed by a purchase order, an order acknowledgment, and a distributor agreement in the case of our distributor customers.  Sales to customers do not meet the definition of a contract until the customer has sent in a purchase order, we have acknowledged the order, we have deemed the collectability of the consideration to be probable, and legally enforceable rights and obligations have been created.  As is customary in the semiconductor industry, we offer price concessions and stock rotation rights to many of our distributors.  As these are forms of variable consideration, we estimate the amount of consideration to which we will be entitled using recent historical data and applying the expected value method.  Substantially all of the revenue generated from contracts with customers is recognized at, or near to, the time risk and title of the inventory transfers to the customer, which is generally upon shipment.\nOverall, our estimates of adjustments to contract price due to variable consideration under our contracts with distributor customers, based on our assumptions, have been materially consistent with our actual results.  However, these estimates are subject to management’s judgment and actual provisions could be different from our estimates, resulting in future adjustments to our revenue and operating results.  A 100-basis point increase in the blended price concession rate would have changed the measurement of our refund liability recorded within accrued liabilities by $5.0 million as of March 31, 2025.\nInventories\n \nInventories are valued at the lower of cost or net realizable value using the first-in, first-out method.  We record a charge to cost of sales to write down our inventory for estimated excess, obsolete or unmarketable inventory in an amount equal to the difference between the cost of inventory and the estimated net realizable value based upon assumptions about future demand and market conditions.  If actual market conditions are less favorable than those we projected, additional inventory write-downs may be required.  Inventory impairment charges establish a new cost basis for inventory and charges are not subsequently reversed to income even if circumstances later suggest that increased carrying amounts are recoverable.  In determining whether there is a risk of excess or obsolete inventory, we evaluate projected demand over periods that align with demand forecasts used to develop manufacturing plans and inventory build decisions and write down inventory on hand that is in excess of estimated demand.  Management reviews and adjusts the estimates as appropriate based on specific situations.  For example, demand can be adjusted up for new products for which historic sales are not representative of future demand.  Alternatively, demand can be adjusted down to the extent any existing products are being replaced or discontinued.  A 1% variance in the estimated demand for our products would have changed the estimated net realizable value of our inventory by approximately $3.8 million as of March 31, 2025.\n \n49\nTable of Contents\nIncome Taxes\n \nAs part of the process of preparing our consolidated financial statements, we are required to record our income taxes in each of the jurisdictions in which we operate.\nVarious taxing authorities in the U.S. and other countries in which we do business may scrutinize the tax structures employed by businesses.  Companies of our size and complexity are regularly audited by the taxing authorities in the jurisdictions in which they conduct significant operations.  We are currently being audited by the tax authorities in the U.S. and in various foreign jurisdictions.  At this time, we do not know what the outcome of these audits will be.  We record benefits for uncertain tax positions based on an assessment of whether it is more likely than not that the tax positions will be sustained based on their technical merits under currently enacted law.  If this threshold is not met, no tax benefit of the uncertain tax position is recognized.  If the threshold is met, we recognize the largest amount of the tax benefit that is more than 50% likely to be realized upon ultimate settlement.  \nThe accounting model related to the measurement of uncertain tax positions requires us to presume that the tax position will be examined by the relevant taxing authority that has full knowledge of all relevant information and that each tax position will be evaluated without consideration of the possibility of offset or aggregation with other positions.  The recognition requirement for the liability exists even if we believe the possibility of examination by a taxing authority or discovery of the related risk matters is remote or where we have a long history of the taxing authority not performing an exam or overlooking an issue.  We will record an adjustment to a previously recorded position if new information or facts related to the position are identified in a subsequent period.  Generally, adjustments to the positions are recorded through the income statement.  Generally, adjustments will be recorded in periods subsequent to the initial recognition in light of changing facts and circumstances, such as the closing of a tax audit, the closing of a statutory audit period or changes in applicable law, or interactions with taxing authorities.  Due to the inherent uncertainty in the estimation process, including the complexity involved to interpret and apply tax laws, and in consideration of the criteria of the accounting model, amounts recognized in the financial statements in periods subsequent to the initial recognition may significantly differ from the estimated exposure of the position under the accounting model.\nResults of Operations\n \nThe following table sets forth certain operational data as a percentage of net sales for fiscal 2025 and fiscal 2024:\nFiscal Year Ended March 31,\n2025\n2024\nNet sales\n100.0 \n%\n100.0 \n%\nCost of sales\n43.9 \n34.6 \nGross profit\n56.1 \n65.4 \nResearch and development\n22.4 \n14.4 \nSelling, general and administrative\n14.0 \n9.6 \nAmortization of acquired intangible assets\n11.2 \n7.9 \nSpecial charges (income) and other, net\n1.8 \n(0.2)\nOperating income\n6.7 \n%\n33.7 \n%\nNet Sales\n \nWe operate in two industry segments and engage primarily in the design, development, manufacture and sale of semiconductor products as well as the licensing of our SuperFlash and other technologies.  We sell our products to distributors and OEMs in a broad range of markets, perform ongoing credit evaluations of our customers and generally require no collateral.  In certain circumstances, a customer's financial condition may require collateral, and, in such cases, the collateral would be typically provided in the form of letters of credit.\nThe following table summarizes our net sales for fiscal 2025 and fiscal 2024 (dollars in millions):\n \nFiscal Year Ended March 31,\n2025\n2024\nChange\nNet sales\n$\n4,401.6 \n$\n7,634.4 \n(42.3)\n%\n50\nTable of Contents\nThe decrease in net sales in fiscal 2025 compared to fiscal 2024 was primarily due to adverse economic conditions, including slowing economic activity, increasing business uncertainty, persistent inflation, high interest rates, and shorter product lead times, which factors resulted in many customers having higher levels of inventory and delaying or reducing orders.  Due to the size, complexity and diversity of our customer base, we are not able to quantify any material factor contributing to the changes in net sales.  See our \"Business and Macroeconomic Environment\" discussion above for further information on our business outlook. \nOther factors that we believe contributed to the decrease in our reported net sales for fiscal 2025 compared to fiscal 2024 and which are drivers of long-term trends in our net sales but which factors we are not able to quantify include:\n•\neconomic and competitive conditions in the semiconductor industry;\n•\nour various new product offerings that have increased our served available market;\n•\ncustomers’ needs for the flexibility offered by our programmable solutions; \n•\nincreasing semiconductor content in our customers’ products; and\n•\ngeopolitical conditions, tariffs and other trade restrictions.\nWe sell a large number of products to a large and diverse customer base and there was not any single product or customer that accounted for a material portion of the change in our net sales in fiscal 2025 or fiscal 2024.    \nNet sales by product line for fiscal 2025 and fiscal 2024 were as follows (dollars in millions): \nFiscal Year Ended March 31,\n2025\n%\n2024\n%\nMixed-signal Microcontrollers\n$\n2,249.7 \n51.1 \n$\n4,272.4 \n56.0 \nAnalog\n1,157.0 \n26.3 \n2,016.4 \n26.4 \nOther\n994.9 \n22.6 \n1,345.6 \n17.6 \nTotal net sales\n$\n4,401.6 \n100.0 \n$\n7,634.4 \n100.0 \nMixed-signal Microcontrollers\n \nOur mixed-signal microcontroller product line represents the largest component of our total net sales.  Mixed-signal microcontrollers and associated application development systems accounted for approximately 51.1% and 56.0% of our net sales in fiscal 2025 and fiscal 2024, respectively.\n \nNet sales of our mixed-signal microcontroller products decreased approximately 47.3% in fiscal 2025 compared to fiscal 2024.  The decrease in net sales was primarily due to adverse economic conditions, including slowing economic activity, increasing business uncertainty, competitive pressures, persistent inflation, high interest rates, and shorter product lead times, which factors resulted in many customers having higher levels of inventory and delaying or reducing orders. \nHistorically, average selling prices in the semiconductor industry decrease over the life of any particular product.  However, the overall average selling prices of our mixed-signal microcontroller products have remained relatively stable in recent periods due to the proprietary nature of these products.  We have in the past been able to moderate average selling price declines in our mixed-signal microcontroller product lines by introducing new products with more features and higher prices.  \nAnalog\n \nOur analog product line includes analog, interface, mixed-signal and timing products.  Our analog product line accounted for approximately 26.3% and 26.4% of our net sales in fiscal 2025 and fiscal 2024, respectively.\nNet sales from our analog product line decreased approximately 42.6% in fiscal 2025 compared to fiscal 2024.  The decrease in net sales was primarily due to adverse economic conditions, including slowing economic activity, increasing business uncertainty, persistent inflation, high interest rates, and shorter product lead times, which factors resulted in many customers having higher levels of inventory and delaying or reducing orders.\n \nWe consider a majority of the products in our analog product line to be proprietary in nature, where prices are relatively stable, similar to the pricing stability experienced in our mixed-signal microcontroller products.  The non-proprietary portion of our analog product line will experience price fluctuations, driven primarily by the current supply and demand for those products.  \n51\nTable of Contents\nOther\n \nOur other product line includes FPGA products, royalties associated with licenses for the use of our SuperFlash and other technologies, sales of our intellectual property, fees for engineering services, memory products, timing systems, manufacturing services (wafer foundry and assembly and test subcontracting), legacy application specific integrated circuits, and certain products for aerospace applications.  Revenue from these services and products accounted for approximately 22.6% and 17.6% of our net sales in fiscal 2025 and fiscal 2024, respectively.  \n Net sales related to these products and services decreased approximately 26.1% in fiscal 2025 compared to fiscal 2024.  This decrease in net sales was primarily due to adverse economic conditions, including slowing economic activity, increasing business uncertainty, persistent inflation, high interest rates, and shorter product lead times, which factors resulted in many customers having higher levels of inventory and delaying or reducing orders.  In fiscal 2025, we settled an ongoing legal matter with one of our licensees which resulted in the release of an accrual, which increased both our revenue and profits by $13.3 million in such fiscal period.  Net sales of our other product line can fluctuate over time based on general economic and semiconductor industry conditions as well as changes in demand for our FPGA products, licenses, engineering services, memory products, timing systems, and manufacturing services (wafer foundry and assembly and test subcontracting).\n  \nDistribution\n \nDistributors accounted for approximately 45% and 47% of our net sales in fiscal 2025 and fiscal 2024, respectively.  With the exception of Arrow Electronics, our largest distributor, which accounted for 10% and 12% of our net sales in fiscal 2025 and in fiscal 2024, respectively, no other distributor or direct customer accounted for more than 10% of our net sales in fiscal 2025 or in fiscal 2024.  Our distributors focus primarily on servicing the product requirements of a broad base of diverse customers.  We believe that distributors provide an effective means of reaching this broad and diverse customer base and that customers recognize Microchip for its products and brand name and use distributors as an effective supply channel.\nGenerally, we do not have long-term agreements with our distributors and we, or our distributors, may terminate our relationships with each other with little or no advance notice.  The loss of, or the disruption in the operations of, one or more of our distributors could reduce our future net sales in a given quarter and could result in an increase in inventory returns.\n \nAt March 31, 2025, our distributors maintained 33 days of inventory of our products compared to 41 days at March 31, 2024.  Over the past ten fiscal years, the days of inventory maintained by our distributors have fluctuated between approximately 17 days and 43 days.  Inventory holding patterns at our distributors have had a material adverse impact on our net sales in recent periods.  Due to the relatively high level of inventory days, we have accommodated efforts by our distributors to manage their inventory levels by allowing them to push-out or cancel orders.\nSales by Geography\n \nSales by geography for fiscal 2025 and fiscal 2024 were as follows (dollars in millions):\nFiscal Year Ended March 31,\n2025\n%\n2024\n%\nAmericas\n$\n1,325.7 \n30.2 \n$\n2,215.4 \n29.0 \nEurope\n878.1 \n19.9 \n1,851.7 \n24.3 \nAsia\n2,197.8 \n49.9 \n3,567.3 \n46.7 \nTotal net sales\n$\n4,401.6 \n100.0 \n$\n7,634.4 \n100.0 \nAmericas sales include sales to customers in the U.S., Canada, Central America and South America.  Sales to foreign customers accounted for approximately 75% of our total net sales in each of fiscal 2025 and fiscal 2024.  The decrease in net sales in the European market in fiscal 2025 compared to fiscal 2024 was due to general weakness in the European economy, and decreases in our net sales in the European industrial and automotive markets, which were particularly weak.  Our net sales in the Americas and Asia market decreased in fiscal 2025 compared to fiscal 2024, primarily due to adverse economic conditions, including slowing economic activity, persistent inflation, high interest rates, and shorter product lead times which resulted in delayed or reduced orders.  Substantially all of our foreign sales are U.S. dollar denominated.  Our sales force in the Americas and Europe supports a significant portion of the design activity for products which are ultimately shipped to Asia. \n \n52\nTable of Contents\nGross Profit\n \nOur gross profit in fiscal 2025 was $2.47 billion, or 56.1% of net sales, compared to $5.00 billion, or 65.4% of net sales, in fiscal 2024.  \nThe primary reason for the decrease in gross profit of $2.34 billion in fiscal 2025 compared to fiscal 2024 was an unfavorable net impact of sales volume, product mix, geographic mix, and average gross profit per unit in fiscal 2025.  The net impact of product mix and average gross profit per unit may fluctuate over time due to the mix of sales volumes of lower or higher margin products, changes in selling prices, and fluctuations in product costs.  We are not able to separately quantify these impacts on our gross profit.  The impact of unabsorbed capacity charges was an adverse impact of $132.3 million in fiscal 2025 compared to fiscal 2024.  Unabsorbed capacity charges are expensed as incurred when we operate our manufacturing facilities below normal levels.  The net impact to our gross profit from inventory reserve charges was an adverse impact of $87.7 million in fiscal 2025 compared to fiscal 2024.  The gross margin impact of changes in licensing revenue, which has no associated cost of sales, was a favorable impact of $27.7 million in fiscal 2025 compared to fiscal 2024.  \nOur overall inventory levels were $1.29 billion at March 31, 2025, compared to $1.32 billion at March 31, 2024.  We maintained 251 days of inventory on our balance sheet at March 31, 2025 compared to 224 days of inventory at March 31, 2024.  Our overall inventory level in dollars was generally flat as a result of our efforts to balance manufacturing production, customer demand and inventory levels.  However, our days of inventory increased significantly due to lower net sales.  Our inventory amounts are impacted by timing of shipment activity in the quarter, the timing of receipt of raw materials, foundry wafers, and strategic last time buy materials and completion of finished goods.  We believe that our current inventory and production capacity are adequate to fulfill the projected requirements of our customers.\n \nWe operate assembly and test facilities in Thailand, the Philippines, and other locations throughout the world.  During fiscal 2025, approximately 67% of our assembly requirements were performed in our internal assembly facilities, compared to approximately 59% during fiscal 2024.  During fiscal 2025, approximately 67% of our test requirements were performed in our internal facilities, compared to approximately 71% during fiscal 2024.  The percentage of our assembly and test operations that are performed internally fluctuates over time based on supply and demand conditions in the semiconductor industry, our internal capacity capabilities and our acquisition activities.  We believe that the assembly and test operations performed at our internal facilities provide us with significant cost savings compared to third-party contractor assembly and test costs, as well as increased control over these portions of the manufacturing process.  We plan to continue to selectively invest in assembly and test equipment to increase our internal capacity capabilities and transition certain outsourced assembly and test capacity to our internal facilities.\nWe rely on outside wafer foundries for a significant portion of our wafer fabrication requirements.  Approximately 64% of our net sales came from products that were produced at outside wafer foundries in each of fiscal 2025 and fiscal 2024.  This percentage may vary based on supply and demand conditions in the market.\nWe anticipate that our gross margins will fluctuate over time, driven primarily by capacity utilization levels, the overall mix of products sold during the period, as well as manufacturing yields, unabsorbed capacity charges, and competitive and economic conditions in the markets we serve.  We continue to transition products to more advanced process technologies to reduce future manufacturing costs.\nResearch and Development\nR&D expenses for fiscal 2025 were $983.8 million, or 22.4% of net sales, compared to $1.10 billion, or 14.4% of net sales, for fiscal 2024.  We are committed to investing in new and enhanced products, including development systems software, and in our design and manufacturing process technologies.  We believe these investments are significant factors in maintaining our competitive position.  R&D costs are expensed as incurred.  Assets purchased to support our ongoing research and development activities are capitalized when related to products which have achieved technological feasibility or that have alternative future uses and are amortized over their expected useful lives.  R&D expenses include labor, depreciation, masks, prototype wafers, and expenses for the development of process technologies, new packages, and software to support new products and design environments.\nR&D expenses decreased $113.6 million, or 10.4%, for fiscal 2025 compared to fiscal 2024.  The primary reasons for the decrease in R&D expenses in fiscal 2025 compared to fiscal 2024 was lower employee compensation costs.\n \nR&D expenses fluctuate over time, primarily due to revenue and operating expense investment levels.\n53\nTable of Contents\nSelling, General and Administrative\nSelling, general and administrative expenses for fiscal 2025 were $617.7 million, or 14.0% of net sales, compared to $734.2 million, or 9.6% of net sales, for fiscal 2024.  Our goal is to continue to be more efficient with our selling, general and administrative expenses.  Selling, general and administrative expenses include salary expenses related to field sales, marketing and administrative personnel, advertising and promotional expenditures and legal expenses as well as costs related to our direct sales force, CEMs and ESEs who work remotely from sales offices worldwide to stimulate demand by assisting customers in the selection and use of our products.\nSelling, general and administrative expenses decreased $116.5 million, or 15.9%, for fiscal 2025 compared to fiscal 2024.  The primary reason for the decrease in selling, general and administrative expenses was lower employee compensation costs.\nSelling, general and administrative expenses fluctuate over time, primarily due to revenue and operating expense investment levels.\nAmortization of Acquired Intangible Assets\nAmortization of acquired intangible assets in fiscal 2025 was $490.9 million compared to $605.4 million in fiscal 2024.  The primary reason for the decrease in acquired intangible asset amortization was due to the use of accelerated amortization methods for assets placed in service in previous fiscal years.\nSpecial Charges (Income) and Other, Net \nDuring fiscal 2025, we incurred special charges and other, net of $79.2 million primarily due to restructuring expenses, including $45.7 million related to contract exit costs and $27.1 million related to employee separation costs.  During fiscal 2024, we earned special income and other, net of $12.3 million primarily related to a favorable resolution of a previously accrued legal matter partially offset by restructuring costs of acquired and existing wafer fabrication operations to increase operational efficiency.  Restructuring expenses incurred during fiscal 2024 include $6.2 million related to the restructuring of our wafer fabrication operations.\nOther Income (Expense)\nInterest income in fiscal 2025 was $9.2 million compared to $7.6 million in fiscal 2024.\nInterest expense in fiscal 2025 was $259.2 million compared to $198.3 million in fiscal 2024.  The primary reasons for the increase in interest expense in fiscal 2025 compared to fiscal 2024 were higher interest rates on our outstanding variable rate debt and higher outstanding debt balances, offset in part by lower interest expense on our revolving credit facility.\nLoss on settlement of debt in fiscal 2025 was $1.7 million compared to $12.2 million in fiscal 2024.  In fiscal 2025, the loss primarily related to the amendment and restatement of our Revolving Credit Facility.  In fiscal 2024, the loss related to the settlement of a portion of our outstanding Convertible Debt. \nOther loss, net, in fiscal 2025 was $5.7 million compared to other loss, net of $2.2 million in fiscal 2024.  The primary reason for the change in other loss during fiscal 2025 compared to fiscal 2024 relates to foreign currency exchange rate fluctuations.\nProvision for Income Taxes\nOur provision for income taxes is attributable to U.S. federal, state, and foreign income taxes.  Our effective tax rate for the fiscal year ended March 31, 2025, increased over the same period last year as a result of changes in the amount of pre-tax income earned, R&D credits, foreign operations and various tax reserves.\nOur effective tax rate in fiscal 2025 includes a $60.1 million tax benefit received from current year generated R&D credits, which reduced our effective tax rate by 154.4%; a $55.0 million tax expense for the effects of foreign operations, which increased our effective tax rate by 141.3%; and a $45.1 million tax expense related to changes in various tax reserves, which increased our effective tax rate by 115.8%.\n54\nTable of Contents\nOur effective tax rate in fiscal 2024 includes a $69.8 million tax benefit received from R&D credits, which reduced our effective tax rate by 3.0%; and a $62.9 million tax expense for the effects of foreign operations, which increased our effective tax rate by 2.7%.\nWe are subject to taxation in many jurisdictions in which we have operations.  The effective tax rates that we pay in these jurisdictions vary widely, but they are generally lower than our combined U.S. federal and state effective tax rate.  Our domestic blended statutory tax rate in each of fiscal 2025 and fiscal 2024 was approximately 22%.  Our non-U.S. blended statutory tax rates in fiscal 2025 and fiscal 2024 were lower than this amount.  The difference in rates applicable in foreign jurisdictions results from a number of factors, including lower statutory rates, tax holidays, financing arrangements and other factors.  Our effective tax rate has been and will continue to be impacted by the geographical dispersion of our earnings and losses.\nOur foreign tax rate differential benefit primarily relates to our operations in Malta taxed at a 5.0% statutory tax rate and Ireland taxed at a 12.5% statutory tax rate.  Additionally, our Thailand manufacturing operations are currently subject to numerous tax holidays granted to us based on our investment in property, plant, and equipment in Thailand.  Our tax holiday periods in Thailand expire at various times in the future; however, we actively seek to obtain new tax holidays, otherwise we will be subject to tax at the statutory tax rate of 20.0%.  We do not expect the future expiration of any of our tax holiday periods in Thailand to have a material impact on our effective tax rate.\nIn September 2021, we received a Statutory Notice of Deficiency (2007 to 2012 Notice) from the United States Internal Revenue Service (IRS) for fiscal 2007 through fiscal 2012.  The disputed amounts largely relate to transfer pricing matters.  In December 2021, we filed a petition in the U.S. Tax Court challenging the 2007 to 2012 Notice.  In September 2023, we received a Revenue Agent Report (RAR) from the IRS for fiscal 2013 and fiscal 2016.  In October 2023, we received a Statutory Notice of Deficiency (2014 to 2015 Notice) from the IRS for fiscal 2014 and fiscal 2015.  The disputed amounts for fiscal 2013 to fiscal 2016 largely relate to transfer pricing matters.  In December 2023, we filed a petition in the U.S. Tax Court challenging the 2014 to 2015 Notice.\nIn May 2023, we received a proposed income adjustment from the Malaysian Inland Revenue Board (IRB) for fiscal 2020.  In December 2023, we received a Notice of Assessment from the IRB asserting the same proposed income adjustment.  In March 2025, we entered into a Consent Judgment before the High Court, agreeing that the dispute will be heard before the Special Commissioners of Income Tax (SCIT).  It was also agreed that the payment on the taxes assessed is stayed and the IRB will pause all enforcement and proceedings against the collection of the taxes assessed until the appeal before the SCIT is concluded.  If the adjustment is upheld by the highest court that has jurisdiction over this matter in Malaysia, it could result in income taxes and penalties up to $410.0 million.  The disputed amounts largely relate to the characterization of certain assets.  The timing of adjudicating this matter is uncertain but could occur in the next 12 months.\nIn January 2025, we received several assessments from the German Tax Authorities (GTA) regarding the German extraterritorial taxation of royalty payments between nonresidents (referred to as offshore receipts in respect of intangible property or ORIP) and intellectual property transfers by nonresidents (referred to as extraterritorial capital gains taxation or ETT).  If the assessment is upheld, it could result in income taxes and penalties up to $92.0 million.  The timing of adjudicating this matter is uncertain but could occur in the next 12 months.\nWe firmly believe that the assessments described above are without merit and we plan to pursue all available administrative and judicial remedies necessary to resolve this matter.  We intend to vigorously defend our position, and we are confident in our ability to prevail on the merits.  We regularly assess the likelihood of adverse outcomes resulting from examinations such as these to determine the adequacy of our tax reserves.  The ultimate outcome of disputes of this nature is uncertain, and if the IRS, IRB and GTA were to prevail on their assertions, the assessed tax, penalties, and deficiency interest could have a material adverse impact on our financial position, results of operations or cash flows.\n \n \nVarious taxing authorities in the U.S. and other countries in which we do business are increasing their scrutiny of the tax structures employed by businesses.  Companies of our size and complexity are regularly audited by the taxing authorities in the jurisdictions in which they conduct significant operations.  For U.S. federal, and in general for U.S. state tax returns, our fiscal 2007 and later tax returns remain effectively open for examination by the taxing authorities.  We are currently being audited by the tax authorities in the U.S. and in various foreign jurisdictions.  At this time, we do not know what the outcome of these audits will be.  We record benefits for uncertain tax positions based on an assessment of whether it is more likely than not that the tax positions will be sustained based on their technical merits under currently enacted law.  If this threshold is not met, no tax benefit of the uncertain tax position is recognized.  If the threshold is met, we recognize the largest amount of the tax benefit that is more than 50% likely to be realized upon ultimate settlement. \n55\nTable of Contents\nIn August 2022, the U.S. government enacted the Inflation Reduction Act into law.  The Inflation Reduction Act includes a new corporate alternative minimum tax (Corporate AMT) of 15.0% on the adjusted financial statement income (AFSI) of corporations with average AFSI exceeding $1.00 billion over a three-year period, as well as a 1% excise tax on the net fair market value of stock repurchases made after December 31, 2022.  The Corporate AMT is effective beginning in fiscal 2024.  The Inflation Reduction Act did not have a material impact on the year ending March 31, 2025 and the year ending March 31, 2024.\nAs of March 31, 2025, 55 countries have enacted various aspects of the Organisation for Economic Co-operation and Development’s Base Erosion and Profit Shifting Project to ensure that multinational enterprises pay a GMT.  In 38 of those countries, the GMT is effective for tax years beginning in our fiscal 2025.  As of March 31, 2025, the impact of GMT on our fiscal 2025 results is not material.   \nLiquidity and Capital Resources \n \nWe had $771.7 million in cash and cash equivalents at March 31, 2025, an increase of $452.0 million from the March 31, 2024 balance.  \n \nOperating Activities\nNet cash provided by operating activities was $898.1 million in fiscal 2025 primarily due to net loss of $0.5 million, adjusted for non-cash and non-operating charges of $798.5 million and net cash inflows of $100.1 million from changes in our operating assets and liabilities.  The primary drivers of the changes in operating assets and liabilities in fiscal 2025 include a decrease in trade accounts receivable driven primarily by reduced revenue and timing of shipments and collections, a decrease in inventories, offset by decreases in accrued liabilities driven by decreases in sales related reserves, and a decrease due to cash refunded to our customers under the LTSAs.  Net cash provided by operating activities was $2.89 billion in fiscal 2024 primarily due to net income of $1.91 billion, adjusted for non-cash and non-operating charges of $1.06 billion and net cash outflows of $76.7 million from changes in our operating assets and liabilities.\nInvesting Activities\nNet cash used in investing activities was $287.8 million for fiscal 2025 compared to $392.1 million for fiscal 2024.  Fiscal 2025 and fiscal 2024, investing cash flows primarily related to capital purchases and investments in other assets.\n \nOur level of capital expenditures varies from time to time as a result of actual and anticipated business conditions.  Capital expenditures were $126.0 million and $285.1 million in fiscal 2025 and fiscal 2024, respectively.  Capital expenditures were primarily for the selective expansion of production capacity and the addition of research and development equipment.  Consistent with the slowing macroeconomic environment in fiscal 2025, we have paused most of our factory expansion actions and reduced our planned capital investments through fiscal 2026.  Our investments in equipment and facilities during the next 12 months are expected to be at or below $100 million.  We believe that the capital expenditures anticipated to be incurred over the next 12 months will provide sufficient manufacturing capacity to support the growth of our production capabilities for our new products and technologies and to bring in-house more of the assembly and test operations that are currently outsourced.  We expect to finance our capital expenditures through our existing cash balances and cash flows from operations.\n \n While select investments are still being made, in the fourth quarter of fiscal 2024, we paused most of our expansion activity.  In the third quarter of fiscal 2025, we announced the closure of Fab 2 in Tempe, Arizona which was completed in May 2025.  Despite pausing our expansion activity, we believe that our current inventory and production capacity are adequate to fulfill the projected requirements of our customers.  In August 2022, the U.S. government enacted the CHIPS Act to provide billions of dollars of cash incentives and a new investment tax credit to increase domestic manufacturing capacity in our industry.  In December 2023, we reached a Preliminary Memorandum of Terms with the U.S. Department of Commerce for $162 million in CHIPS Act grants for two of our U.S. wafer fabrication facilities; however, we have not concluded negotiations with the U.S. Department of Commerce and there can be no assurance that the grants will receive final approval.  If we do receive a CHIPS Act grant, the restrictions and operational requirements that are imposed on CHIPS Act grant recipients could add complexity to our operations and increase our costs.  We expect to receive the cash benefit associated with the investment tax credit for qualifying capital expenditures in future periods and may apply for other incentives provided by the legislation; however, there can be no assurance that we will receive any such other incentives, what the amount and timing of any incentive we receive will be, as to which other companies will receive incentives and whether the legislation will have a positive or negative impact on our competitive position.  \n \n56\nTable of Contents\nFinancing Activities\nNet cash used in financing activities was $158.3 million for fiscal 2025 compared to $2.41 billion for fiscal 2024.  Significant transactions affecting our net financing cash flows included:\n•\nin fiscal 2025, $1.45 billion of net proceeds from the issuances of our Series A Preferred Stock, and\n•\nin fiscal 2025, $516.5 million of net cash used to pay down certain principal of our debt including settlement of our 2020 Convertible Debt, settlement of our 2025 Term Loan Facility, purchase of our capped call options, and the repayment of our 0.983% 2024 Notes partially funded by proceeds from the issuances of our 4.900% 2028 Senior Notes, our 5.050% 2030 Senior Notes, our 2024 Senior Convertible Debt and our Commercial Paper, and\n•\nin fiscal 2024, $537.7 million of cash used to pay down certain principal of our debt, including settlement of a portion of our outstanding Convertible Debt, our 4.333% 2023 Notes, our 2.670% 2023 Notes, our 0.972% 2024 Notes, and our Revolving Credit Facility, partially funded by proceeds from borrowings on our 2025 Term Loan Facility, proceeds from the issuance of our Commercial Paper, and proceeds from the issuance of our 5.050% 2029 Notes, and\n•\nin fiscal 2025 and fiscal 2024, we paid cash dividends to our stockholders of $975.7 million and $911.5 million, respectively, and\n•\nin fiscal 2025 and fiscal 2024, we repurchased shares of our common stock for $96.5 million and $982.1 million, respectively. \nIn March 2025, we entered into a Second Amended and Restated Credit Agreement pursuant to which the amended and restated Credit Agreement, dated as of December 16, 2021 was amended and restated in its entirety.  The second amended and restated Credit Agreement provides for an unsecured revolving loan facility in an aggregate principal amount of up to $2.25 billion, with a $250.0 million foreign currency sublimit, a $25.0 million letter of credit sublimit and a $20.0 million swingline loan sublimit.  The Second Amended and Restated Credit Agreement amended the maximum total leverage ratio financial covenant to the following: 5.50 to 1.00 for period ending March 31, 2025, 5.50 to 1.00 for period ending June 30, 2025, 6.25 to 1.00 for period ending September 30, 2025, 5.75 to 1.00 for period ending December 31, 2025, 4.75 to 1.00 for period ending March 31, 2026, 4.00 to 1.00 for period ending June 30, 2026, 3.75 to 1.00 for period ending September 30, 2026, and 3.50 to 1.00 for any such period ended after the Restatement Effective Date that is not a period ending during the Covenant Relief Period.  The Covenant Relief Period means the period following the Restatement Effective Date to (but excluding) the earlier of (a) December 31, 2026 and (b) the date in which the Total Leverage Ratio for the most recently ended fiscal quarter shall not exceed 3.50 to 1.00 and certain other conditions are satisfied.  In November 2024, the amended and restated Credit Agreement, was amended to amend the maximum total leverage ratio financial covenant for the quarterly periods ending on December 31, 2024 through December 31, 2025 to 4.75 to 1.00.  In August 2023, our amended and restated Credit Agreement, dated as of December 16, 2021 was amended by the first incremental term loan amendment, dated as of August 31, 2023.  Pursuant to this amendment, we borrowed an aggregate principal amount of $750.0 million under the new 2025 Term Loan Facility bearing interest at the Adjusted Term SOFR Rate, plus a margin of 1.125% to 1.5%, or Alternate Base Rate, plus a margin of 0.125% to 0.5%, with a maturity date of August 31, 2025, which was repaid in full in December 2024.  The interest rate margins are determined based on our credit ratings.  \nIn September 2023, we established a Commercial Paper program under which we may issue short-term unsecured promissory notes up to a maximum principal amount outstanding at any time of $2.75 billion with a maturity of up to 397 days from the date of issue.  The Commercial Paper is sold from time to time at a discount from par or alternatively, sold at par and bears interest rates that will vary based on market conditions and the time of issuance.  Our intention is to reduce the amounts that would otherwise be available to borrow under our Revolving Credit Facility by the outstanding amount of Commercial Paper.  Pursuant to the Second Amended and Restated Credit Agreement in March 2025, the maximum principal amount outstanding at any time under the Commercial Paper program was updated to $2.25 billion.  As of March 31, 2025, the principal amount of our outstanding indebtedness was $5.66 billion.  We had no outstanding borrowings under the Revolving Credit Facility at March 31, 2025 and at March 31, 2024.  At March 31, 2025, we had $175.0 million in outstanding principal amount of Commercial Paper compared to $1.36 billion at March 31, 2024.  \nIn March 2025, we issued 29.7 million Depositary Shares, representing approximately 1.5 million shares of our Series A Preferred Stock.  The Series A Preferred Stock has a $1,000.00 per share liquidation preference and $0.001 per share par value.  As a result of the transaction, we received cash proceeds of $1.45 billion, net of underwriting fees and other issuance costs.\n57\nTable of Contents\nCapital Returns\nIn November 2021, our Board of Directors authorized the repurchase of up to $4.00 billion of our common stock in the open market or in privately negotiated transactions.  In fiscal 2025, we repurchased approximately 1.0 million shares of our common stock for $90.0 million under this authorization.  In fiscal 2024, we repurchased approximately 11.9 million shares of our common stock for $982.1 million under this authorization.  As of March 31, 2025, approximately $1.56 billion remained available for repurchases under the program.  As of March 31, 2025, we held approximately 39.3 million shares as treasury shares.  Any future repurchases of shares of our common stock will be evaluated based on our cash generation, leverage metrics, and market conditions.\nIn October 2002, we announced that our Board of Directors had approved and instituted a quarterly cash dividend on our common stock.  To date, our cumulative dividend payments have totaled approximately $7.63 billion.  A quarterly dividend of $0.455 per share was declared on May 8, 2025 and will be paid on June 5, 2025 to stockholders of record as of May 22, 2025.  We expect the aggregate cash dividend for the June 2025 quarter to be approximately $245.1 million.  Our Board is free to change our dividend practices at any time and to increase or decrease the dividend paid, or not to pay a dividend on our common stock on the basis of our results of operations, financial condition, cash requirements and future prospects, and other factors deemed relevant by our Board.  Our current intent is to maintain our level of quarterly cash dividends depending upon market conditions, our results of operations, and potential changes in tax laws.\nWe believe that our existing sources of liquidity combined with cash generated from operations, borrowings under our Revolving Credit Facility and proceeds from issuance of our Commercial Paper will be sufficient to meet our currently anticipated cash requirements for at least the next 12 months.  Our long-term liquidity requirements primarily arise from working capital requirements, interest and principal repayments related to our outstanding indebtedness, capital expenditures, cash dividends, share repurchases, and income tax payments.  For additional information regarding our cash requirements see \"Note 11. Commitments and Contingencies\", \"Note 10. Leases\", \"Note 6. Debt\" and \"Note 12. Income Taxes\" to our consolidated financial statements.  The semiconductor industry is capital intensive and in order to remain competitive, we must constantly evaluate the need to make significant investments in capital equipment for both production and research and development and to expand our existing facilities or potentially construct new facilities.  We may increase our borrowings under our Revolving Credit Facility or our Commercial Paper program or seek additional equity or debt financing from time to time to refinance our existing debt, maintain or expand our wafer fabrication and product assembly and test facilities, for cash dividends, for share repurchases or for acquisitions or other purposes.  The timing and amount of any such financing requirements will depend on a number of factors, including the maturity dates of our existing debt, our level of dividend payments on our common stock and Series A Preferred Stock, changes in tax laws and regulations regarding the repatriation of offshore cash, demand for our products, changes in industry conditions, product mix, competitive factors and our ability to identify suitable acquisition candidates.  We plan to refinance certain of our existing notes as they mature and we may from time to time seek to refinance certain of our other outstanding debt or Convertible Debt through issuances of new notes or convertible debt, term loans, Commercial Paper, tender offers, exchange transactions or open market repurchases.  Such issuances, tender offers or exchanges or purchases, if any, will depend on prevailing market conditions, our ability to negotiate acceptable terms, our liquidity position and other factors.  There can be no assurance that any financing will be available on acceptable terms due to uncertainties resulting from tariffs, high interest rates, high inflation, economic uncertainty, instability in the banking sector, public health concerns, or other factors, and any additional equity financing or convertible debt financing would result in incremental ownership dilution to our existing stockholders.  \nSummarized Financial Information\nThe tables below present the summarized financial information on a combined basis for Microchip Technology Incorporated and the following subsidiaries of Microchip Technology Incorporated that provide guarantees of our Senior Notes: Atmel Corporation, Microchip Holding Corporation, Microchip Technology LLC, Silicon Storage Technology, Inc., Microsemi Corporation, and Microchip Storage Solutions LLC (such subsidiaries collectively, the Subsidiary Obligors).  The debt securities are fully and unconditionally guaranteed by the aforementioned subsidiaries and rank equally in right of payment with all of our existing and future unsecured and unsubordinated obligations.  The summarized financial information is provided in accordance with the reporting requirements of Rule 13-01 under Regulation S-X and is not intended to present our financial position or results of operations in accordance with generally accepted accounting principles as such principles are in effect in the U.S.\nWe have presented summarized financial information below for Microchip Technology Incorporated and the Subsidiary Obligors after the elimination of intercompany transactions and balances among Microchip Technology Incorporated and the Subsidiary Obligors and investments in any subsidiaries (in millions).  The Subsidiary Obligors regularly sell goods and services to non-guarantor subsidiaries (Non-Guarantors) and the Subsidiary Obligors regularly purchase goods and services from Non-\n58\nTable of Contents\nGuarantor through intercompany arrangements.  The summarized financial information does not eliminate the effects of these intercompany arrangements and separately presents the net effect of all of the Subsidiary Obligors’ transactions with Non-Guarantor for the financial measures presented below. \nAs of March 31, 2025\nAs of March 31, 2024\nCurrent assets, excluding intercompany\n$\n671.8 \n$\n470.8 \nIntercompany receivables from Non-Guarantors\n3,527.3 \n2,665.6 \nGoodwill and intangible assets\n4,586.8 \n4,619.0 \nNon-current assets, excluding intercompany\n1,213.6 \n915.7 \nNon-current intercompany receivables from Non-Guarantors\n181.6 \n186.6 \nTotal assets\n$\n10,181.1 \n$\n8,857.7 \nCurrent liabilities, excluding intercompany\n$\n314.9 \n$\n618.1 \nIntercompany payables due to Non-Guarantors\n6,095.1 \n5,867.6 \nLong-term debt\n5,630.4 \n5,000.4 \nNon-current liabilities, excluding intercompany\n959.6 \n1,037.7 \nNon-current intercompany payables due to Non-Guarantors\n2,116.2 \n2,158.3 \nTotal liabilities\n$\n15,116.2 \n$\n14,682.1 \nFor the Year Ended March 31, 2025\nFor the Year Ended March 31, 2024\nRevenue, excluding intercompany\n$\n1,365.3 \n$\n2,242.7 \nRevenue from Non-Guarantors\n400.2 \n560.4 \nTotal revenue\n$\n1,765.5 \n$\n2,803.1 \nGross profit, excluding intercompany\n971.0 \n1,973.4 \nGross loss from Non-Guarantors\n(378.9)\n(692.9)\nTotal gross profit\n$\n592.1 \n$\n1,280.5 \nOperating income, excluding intercompany\n483.0 \n1,419.9 \nOperating loss from Non-Guarantors\n(378.9)\n(692.9)\nTotal operating income\n$\n104.1 \n$\n727.0 \nNet income, excluding intercompany\n210.8 \n1,198.6 \nNet loss from Non-Guarantors\n(402.8)\n(733.4)\nTotal net income (loss)\n$\n(192.0)\n$\n465.2 \nRecently Issued Accounting Pronouncements\n \nRefer to \"Note 1. Significant Accounting Policies\" to our consolidated financial statements regarding recently issued accounting pronouncements.\n59\nTable of Contents\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\n \nInterest Rate Risk\nAs of March 31, 2025, our current and long-term debt totaled $5.66 billion, all of which was fixed rate and not subject to interest rate exposure.  We intend to finance the repayment of our fixed rate debt maturing within the next 12 months using available borrowings under our Revolving Credit Facility and our Commercial Paper program or other instruments at which point, changes in interest rates will have a more significant impact on our interest expense if we refinance such fixed rate debt with variable rate debt.  For additional information, refer to \"Note 6. Debt\" for a summary of our debt obligations by maturity date.  \nInflation Risk\nInflation has not had a material adverse impact on our operating results in recent periods.  However, if our costs were to continue to become subject to significant inflationary pressures, we may not be able to offset such higher costs through price increases which could adversely impact our operating results.\nItem 8. Financial Statements and Supplementary Data\nThe consolidated financial statements listed in the index appearing under Item 15(a)(1) hereof are filed as part of this Form 10-K.  See also Index to Financial Statements below.\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\n \nAs of the end of the period covered by this Annual Report on Form 10-K, as required by paragraph (b) of Rule 13a-15 or Rule 15d-15 under the Exchange Act, we evaluated under the supervision of our Chief Executive Officer and our Chief Financial Officer, the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) of the Exchange Act).  Based on this evaluation, our Chief Executive Officer and our Chief Financial Officer have concluded that our disclosure controls and procedures were effective to ensure that information we are required to disclose in reports that we file or submit under the Exchange Act (i) is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (ii) is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.  Our disclosure controls and procedures are designed to provide reasonable assurance that such information is accumulated and communicated to our management.  Our disclosure controls and procedures include components of our internal control over financial reporting.  Management's assessment of the effectiveness of our internal control over financial reporting is expressed at the level of reasonable assurance because a control system, no matter how well designed and operated, can provide only reasonable, but not absolute, assurance that the control system's objectives will be met.\nManagement Report on Internal Control Over Financial Reporting\n \nOur management, including our principal executive officer and our principal financial officer, is responsible for establishing and maintaining adequate internal control over financial reporting to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP.  Internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\n \nManagement assessed our internal control over financial reporting as of March 31, 2025, the end of our fiscal year.  Management based its assessment on criteria established in Internal Control \n–\n Integrated Framework (2013 framework) \n60\nTable of Contents\nissued by the Committee of Sponsoring Organizations of the Treadway Commission.  Management's assessment included an evaluation of such elements as the design and operating effectiveness of key financial reporting controls, process documentation, accounting policies, and our overall control environment.  This assessment is supported by testing and monitoring performed by our finance organization.\n \nBased on our assessment, management has concluded that our internal control over financial reporting was effective as of the end of the fiscal year to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with U.S. GAAP.  We reviewed the results of management's assessment with the Audit Committee of our Board of Directors.\n \nErnst & Young LLP, an independent registered public accounting firm, who audited our consolidated financial statements included in this Form 10-K has issued an attestation report on our internal control over financial reporting as of March 31, 2025, which is included on page F-\n3\n.\nChanges in Internal Control over Financial Reporting\n \nDuring the three months ended March 31, 2025, there was no change in our internal control over financial reporting identified in connection with the evaluation required by paragraph (d) of Rule 13a-15 or Rule 15d-15 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information\nTrading Arrangements\nNone of our officers or directors \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as defined in Item 408(c) of Regulation S-K) during the fourth quarter of fiscal 2024.\nBoard of Directors Matters\nOn May 20, 2025, Karlton Johnson informed our Board of Directors (the \"Board\") of his decision to step down from the Board, effective as of that date, in order to pursue other professional and governance commitments.  Mr. Johnson's decision was not the result of any disagreement with the Company, its management, or the Board.  Mr. Johnson expressed his appreciation for the opportunity to serve, and the Board thanks Mr. Johnson for his service and contributions during his tenure on the Board.\nUpon the effectiveness of Mr. Johnson's decision, the Board approved a resolution to reduce the authorized number of directors from seven to six.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n61\nTable of Contents\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nInformation on the members of our Board of Directors is incorporated herein by reference to our proxy statement for our 2025 annual meeting of stockholders under the captions \"The Board of Directors,\" and \"Proposal One – Election of Directors.\"\n \nInformation on the composition of our audit committee and the members of our audit committee, including information on our audit committee financial experts, is incorporated by reference to our proxy statement for our 2025 annual meeting of stockholders under the caption \"The Board of Directors – Committees of the Board of Directors – Audit Committee.\"\n \nInformation on our executive officers is provided in Item 1, Part I of this Form 10-K under the caption \"Information About Our Executive Officers\" at page \n12\n, above.\nInformation with respect to compliance with Section 16(a) of the Exchange Act, is incorporated herein by reference to our proxy statement for our 2025 annual meeting of stockholders under the caption \"Delinquent Section 16(a) Reports.\"\nInformation with respect to our code of ethics that applies to our directors, executive officers (including our principal executive officer and our principal financial and accounting officer) and employees is incorporated by reference to our proxy statement for our 2025 annual meeting of stockholders under the caption \"Code of Business Conduct and Ethics.\"  A copy of our Code of Business Conduct and Ethics is available on our website at the Investor Relations section under Mission Statement/Corporate Governance on www.microchip.com.\n \nInformation regarding material changes, if any, to procedures by which security holders may recommend nominees to our Board of Directors is incorporated by reference to our proxy statement for the 2025 annual meeting of stockholders under the caption \"Requirements, Including Deadlines, for Receipt of Stockholder Proposals for the 2025 Annual Meeting of Stockholders; Discretionary Authority to Vote on Stockholder Proposals.\"\nOur Board of Directors has \nadopted\n insider trading policies and procedures governing the purchase, sale, or any other disposition of the Company’s securities and material non-public information that are designed to promote compliance with insider trading laws, rules, regulations, and applicable NASDAQ standards.  Our insider trading policies and procedures apply to the Company and its directors, officers, employees, contractors, agents, service providers, and their immediate family members and continue to apply so long as they remain in possession of material non-public information.  A copy of our insider trading policies and procedures is filed through incorporation by reference as Exhibit 19.1 hereto.\nItem 11. Executive Compensation\nInformation with respect to executive compensation is incorporated herein by reference to the information under the caption \"Executive Compensation\" in our proxy statement for our 2025 annual meeting of stockholders.\n \nInformation with respect to director compensation is incorporated herein by reference to the information under the caption \"The Board of Directors – Director Compensation\" in our proxy statement for our 2025 annual meeting of stockholders.\n \nInformation with respect to compensation committee interlocks and insider participation in compensation decisions is incorporated herein by reference to the information under the caption \"The Board of Directors – Compensation Committee Interlocks and Insider Participation\" in our proxy statement for our 2025 annual meeting of stockholders.\n \nOur Board compensation committee report on executive compensation is incorporated herein by reference to the information under the caption \"Executive Compensation – Compensation Committee Report on Executive Compensation\" in our proxy statement for our 2025 annual meeting of stockholders.\nItem 12.\n \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation with respect to securities authorized for issuance under our equity compensation plans is incorporated herein by reference to the information under the caption \"Executive Compensation – Equity Compensation Plan Information\" in our proxy statement for our 2025 annual meeting of stockholders.\n62\nTable of Contents\nInformation with respect to security ownership of certain beneficial owners, members of our Board of Directors and management is incorporated herein by reference to the information under the caption \"Security Ownership of Principal Stockholders, Directors and Executive Officers\" in our proxy statement for our 2025 annual meeting of stockholders.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item pursuant to Item 404 of Regulation S-K is incorporated by reference to the information under the caption \"Certain Transactions\" contained in our proxy statement for our 2025 annual meeting of stockholders.\n \nThe information required by this Item pursuant to Item 407(a) of Regulation S-K regarding the independence of our directors is incorporated by reference to the information under the caption \"Meetings of the Board of Directors\" contained in our proxy statement for our 2025 annual meeting of stockholders.\nItem 14. Principal Accountant Fees and Services\nThe information required by this Item related to principal accountant fees and services as well as related pre-approval policies is incorporated by reference to the information under the caption \"Independent Registered Public Accounting Firm\" contained in our proxy statement for our 2025 annual meeting of stockholders.\n63\nTable of Contents\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\n(a)         The following documents are filed as part of this Form 10-K:\nPage\n(1)\nFinancial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nF-\n1\nReport of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting\nF-\n3\nConsolidated Balance Sheets as of March 31, 2025 and 2024\nF-\n4\nConsolidated Statements of Operations for each of the three years in the period ended March 31, 2025\nF-\n5\nConsolidated Statements of Comprehensive Income for each of the three years in the period ended March 31, 2025\nF-\n6\nConsolidated Statements of Cash Flows for each of the three years in the period ended March 31, 2025\nF-\n7\nConsolidated Statements of Changes in Equity for each of the three years in the period ended March 31, 2025\nF-\n9\nNotes to Consolidated Financial Statements\nF-\n11\n(2)\nFinancial Statement Schedules\nNone\n(3)\nThe Exhibits filed with this Form 10-K or incorporated herein by reference are set forth in the Exhibit Index, which is incorporated herein by this reference.\n(b)         See Item 15(a)(3) above.\n(c)         See \"Index to Financial Statements\" included under Item 8 to this Form 10-K.\nItem 16. Form 10-K Summary\nNot applicable.\n64\nTable of Contents\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nFiled or Furnished Herewith\n3.1\nAmended and Restated Certificate of Incorporation of Microchip Technology Incorporated\n8-K\n000-21184\n3.1 \nAugust 26, 2021\n \n3.2\nAmended and Restated Bylaws effective August 22, 2023\n8-K\n000-21184\n3.1 \nAugust 23, 2023\n \n3.3\nCertificate of Designations, filed with the Secretary of State of the State of Delaware and effective March 25, 2025\n8-K\n000-21184\n3.1 \nMarch 25, 2025\n \n4.1\nIndenture dated as of February 15, 2017 between Microchip Technology Incorporated and Wells Fargo Bank, National Association (including Form of Global 1.625% Convertible Senior Subordinated Note due 2027)\n8-K\n000-21184\n4.1 \nFebruary 15, 2017\n \n4.2\nDescription of Registered Securities\nX\n \n4.3\nSenior Notes Indenture, dated as of May 29, 2020, by and among Microchip Technology Incorporated, the subsidiary guarantors named therein and Wells Fargo Bank, National Association, as trustee\n8-K\n000-21184\n4.2 \nJune 3, 2020\n \n4.4\nForm of 4.250% Senior Note due 2025 (included in Exhibit 4.2 of 8-K filed on June 3, 2020)\n8-K\n000-21184\n4.4 \nJune 3, 2020\n \n4.5\nIndenture, dated as of December 1, 2020, between Microchip Technology Incorporated and Wells Fargo Bank, National Association, as trustee\n8-K\n000-21184\n4.1 \nDecember 2, 2020\n \n4.6\nForm of 0.125% Convertible Senior Note due 2024 (included in Exhibit 4.1 of the 8-K filed on December 2, 2020)\n8-K\n000-21184\n4.2 \nDecember 2, 2020\n \n4.7\nSenior Secured Notes Indenture, dated as of May 28, 2021, by and among Microchip Technology Incorporated, the subsidiary guarantors named therein and Wells Fargo Bank, National Association, as trustee and collateral agent\n8-K\n000-21184\n4.1 \nMay 28, 2021\n \n4.8\nForm of 0.983% Senior Secured Note due 2024 (included in Exhibit 4.1 of 8-K filed on May 28, 2021)\n8-K\n000-21184\n4.2 \nMay 28, 2021\n \n4.9\nIndenture dated February 29, 2024, by and between Microchip Technology Incorporated and Computershare Trust Company, National Association, as trustee\nS-3ASR\n333-277512\n4.1 \nFebruary 29, 2024\n \n4.10\nFirst Supplemental Indenture, dated as of March 7, 2024, among Microchip Technology Incorporated, the subsidiary guarantors named therein and Computershare Trust Company, National Association, as trustee\n8-K\n000-21184\n4.1 \nMarch 7, 2024\n \n4.11\nForm of Global Note for the 5.050% Senior Notes due 2029 (included as Exhibit A to Exhibit 4.1)\n8-K\n000-21184\n4.2 \nMarch 7, 2024\n \n65\nTable of Contents\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nFiled or Furnished Herewith\n4.12\nIndenture, dated as of May 31, 2024, by and between Microchip Technology Incorporated and Computershare Trust Company, National Association, as trustee\n8-K\n000-21184\n4.1 \nMay 31, 2024\n \n4.13\nForm of 0.75% Convertible Senior Notes due 2030 (included in Exhibit 4.1)\n8-K\n000-21184\n4.2 \nMay 31, 2024\n \n4.14\nSecond Supplemental Indenture, dated as of December 16, 2024, among Microchip Technology Incorporated, the subsidiary guarantors named therein and Computershare Trust Company, National Association, as trustee\n8-K\n000-21184\n4.1 \nDecember 16, 2024\n \n4.15\nForm of Global Note for the 4.900% Senior Notes due 2028 (included as Exhibit A to Exhibit 4.1)\n8-K\n000-21184\n4.2 \nDecember 16, 2024\n \n4.16\nForm of Global Note for the 5.050% Senior Notes due 2030 (included as Exhibit B to Exhibit 4.1)\n8-K\n000-21184\n4.3 \nDecember 16, 2024\n \n4.17\nForm of Certificate for the 7.50% Series A Mandatory Convertible Preferred Stock (included as Exhibit A to Exhibit 3.1)\n8-K\n000-21184\n4.1 \nMarch 25, 2025\n \n4.18\nDeposit Agreement, dated as of March 25, 2025, among Microchip Technology Incorporated and Equiniti Trust Company, LLC, acting as Depositary, and the holders from time to time of the depositary receipts described therein\n8-K\n000-21184\n4.2 \nMarch 25, 2025\n \n4.19\nForm of Depositary Receipt for the Depositary Shares (included as Exhibit A to Exhibit 4.2)\n8-K\n000-21184\n4.3 \nMarch 25, 2025\n \n10.1\nForm of Capped Call Transaction Confirmation \n8-K\n000-21184\n10.1 \nMay 31, 2024\n \n10.2\nForm of Capped Call Transaction Confirmation\n8-K\n000-21184\n10.1 \nMarch 25, 2025\n \n10.3\nAmended and Restated Credit Agreement, dated as of December 16, 2021, by and among Microchip Technology Incorporated, the lenders from time to time party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n8-K\n000-21184\n10.1 \nDecember 16, 2021\n \n \n10.4\nFirst Incremental Term Loan Amendment to the Amended and Restated Credit Agreement, dated as of August 31, 2023, by and among Microchip Technology Incorporated, the subsidiaries of the Company party thereto, JPMorgan Chase Bank, N.A., as administrative agent, and the lenders thereto\n10-Q\n000-21184\n10.4 \nNovember 2, 2023\n \n10.5\nSecond Amendment to the Amended and Restated Credit Agreement, dated as of November 8, 2024, by and among Microchip Technology Incorporated, the subsidiary guarantors party thereto, the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n8-K\n000-21184\n10.1 \nNovember 12, 2024\n \n \n66\nTable of Contents\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nFiled or Furnished Herewith\n10.6\nSecond Amended and Restated Credit Agreement, dated as of March 25, 2025, by and among Microchip Technology Incorporated, the lenders from time to time party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n8-K\n000-21184\n10.1 \nMarch 25, 2025\n \n \n10.7\nForm of Dealer Agreement between Microchip Technology Incorporated, as issuer, and the applicable Dealer party thereto\n8-K\n000-21184\n10.1 \nSeptember 15, 2023\n \n10.8\nForm of Indemnification Agreement between Registrant and its directors and certain of its officers\n10-K\n000-21184\n10.4 \nMay 20, 2022\n \n10.9*\nManagement Incentive Compensation Plan (as amended through February 26, 2021)\n8-K\n000-21184\n10.1 \nMarch 2, 2021\n \n10.10*\nMicrochip Technology Incorporated Supplemental Retirement Plan\nS-8\n333-101696\n4.1.1\nDecember 6, 2002\n \n10.11*\nAmendments to Supplemental Retirement Plan\n10-Q\n000-21184\n10.1 \nFebruary 9, 2006\n \n10.12*\nAmended and Restated Adoption Agreement for the Microchip Technology Incorporated Supplemental Retirement Plan dated January 1, 2024\n10-K\n000-21184\n10.9 \nMay 23, 2024\n \n \n10.13*\nRetirement Agreement and Release, dated as of November 22, 2024, by and between Microchip Technology Incorporated and Ganesh Moorthy\n10-Q\n000-21184\n10.2 \nFebruary 6, 2025\n \n10.14*\n2001 Employee Stock Purchase Plan, as amended and restated through August 22, 2023\n8-K\n000-21184\n10.1 \nAugust 23, 2023\n \n10.15*\n1994 International Employee Stock Purchase Plan, as amended and restated through August 22, 2023\n8-K\n000-21184\n10.2 \nAugust 23, 2023\n \n10.16*\n2004 Equity Incentive Plan, as amended and restated August 20, 2024\n8-K\n000-21184\n10.1 \nAugust 22, 2024\n \n10.17*\nForm of Notice of Grant for 2004 Equity Incentive Plan (including Exhibit A Stock Option Agreement)\n \nS-8\n333-119939\n4.5 \nOctober 25, 2004\n \n10.18*\nForm of RSU Grant Notice and Global RSU Agreement V-4004\n10-K\n000-21184\n10.17 \nMay 30, 2019\n \n10.19*\nForm of Notice of Stock Option Grant and Stock Option Agreement\n10-K\n000-21184\n10.18 \nMay 30, 2019\n \n10.20*\nForm of CEO RSU Grant and RSU Agreement\n10-K\n000-21184\n10.19 \nMay 30, 2019\n \n10.21*\nForm of Notice of Grant of RSU Agreement\n10-K\n000-21184\n10.20 \nMay 30, 2019\n \n10.22*\nForm of Notice of Grant of Restricted Stock Units (TSR)\n8-K\n000-21184\n10.1 \nJanuary 7, 2020\n \n10.23*\nForm of Notice of Grant of Restricted Stock Units (Performance) for 2004 Equity Incentive Plan (including Exhibit A Performance Matrix)\n10-K\n000-21184\n10.18 \nMay 20, 2022\n \n67\nTable of Contents\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nFiled or Furnished Herewith\n10.24*\nForm of Notice of Grant of Restricted Stock Units for 2004 Equity Incentive Plan\n10-K\n000-21184\n10.19 \nMay 20, 2022\n \n10.25*\nForm of Notice of Grant of Restricted Stock Units (Performance) for 2004 Equity Incentive Plan (including Exhibit A Performance Matrix)\n10-Q\n000-21184\n10.1 \nNovember 3, 2022\n \n10.26*\nAmended and Restated Form of Notice of Grant of Restricted Stock Units (Performance) for 2004 Equity Incentive Plan (including Exhibit A Performance Matrix)\n10-Q\n000-21184\n10.1 \nFebruary 2, 2023\n \n10.27*\nForm of Notice of Grant of Restricted Stock Units (PSU, 8 Quarters, Ops Matrix)\n10-K\n000-21184\n10.11 \nMay 25, 2023\n \n10.28*\nForm of Notice of Grant of Restricted Stock Units (PSU, 12 Quarters, Updated Ops Matrix)\n10-K\n000-21184\n10.12 \nMay 25, 2023\n \n10.29*\nForm of Notice of Grant of Restricted Stock Units (PSU, 8 Quarters, Ops Matrix)\nX\n \n10.30*\nForm of Notice of Grant of Restricted Stock Units (PSU, 12 Quarters, Ops Matrix)\nX\n \n10.31*\nChange of Control Severance Agreement\n10-K\n000-21184\n10.27 \nMay 23, 2024\n \n19.1\nInsider Trading Policy\n10-K\n000-21184\n19.1 \nMay 23, 2024\n \n19.2\nRequirements for 10b5-1 Trading Plans\n10-K\n000-21184\n19.2 \nMay 23, 2024\n \n21.1\nSubsidiaries of Registrant\nX\n \n22.1\nSubsidiary Guarantors and Issuers of Guaranteed Securities\n10-Q\n000-21184\n22.1 \nFebruary 6, 2025\n \n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n \n24.1\nPower of Attorney\nX\n \n31.1\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended (the Exchange Act)\nX\n \n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended (the Exchange Act)\nX\n \n32**\nCertifications Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n \n97.1\nCompensation Recovery Policy\n10-K\n000-21184\n97.1 \nMay 23, 2024\n \n101.INS\nXBRL Instance Document - the instance document does not appear in the Interactive File because its XBRL tags are embedded within the Inline XBRL document\nX\n \n101.SCH\nXBRL Taxonomy Extension Schema Document\nX\n \n68\nTable of Contents\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nFiled or Furnished Herewith\n101.CAL\nTaxonomy Extension Calculation Linkbase Document\nX\n \n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\nX\n \n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\nX\n \n101.PRE\nXBRL Taxonomy Presentation Linkbase Document\nX\n \n104\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document and contained in Exhibit 101\nX\n \n*Compensation plans or arrangements in which directors or executive officers are eligible to participate\n \n** Furnished herewith\n \n69\nTable of Contents\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nMICROCHIP TECHNOLOGY INCORPORATED\n \n(Registrant)\n \nMay 22, 2025\nBy: \n/s/ Steve Sanghi                                                   \n \nSteve Sanghi\n \nChief Executive Officer and President\n(Principal Executive Officer)\n70\nTable of Contents\nPower of Attorney\nKNOW ALL PERSONS BY THESE PRESENTS, that the undersigned officer or director of Microchip Technology Incorporated, a Delaware corporation (the Company), does hereby constitute and appoint each of STEVE SANGHI and J. ERIC BJORNHOLT, with full power to each of them to act alone, as the true and lawful attorneys and agents of the undersigned, with full power of substitution and resubstitution to each of said attorneys to execute, file or deliver any and all instruments and to do any and all acts and things which said attorneys and agents, or any of them, deem advisable to enable the Company to comply with the Securities Exchange Act of 1934, as amended, and any requirements of the Securities and Exchange Commission in respect thereto relating to this annual report on Form 10-K, including specifically, but without limitation of the general authority hereby granted, the power and authority to sign such person's name individually and on behalf of the Company as an officer or director (as indicated below opposite such person's signature) to the Company's annual report on Form 10-K or any amendments or supplements thereto; and each of the undersigned does hereby fully ratify and confirm all that said attorneys and agents or any of them, shall do or cause to be done by virtue hereof.  This Power of Attorney revokes any and all previous powers of attorney granted by any of the undersigned which such power would have entitled said attorneys and agents, or any of them, to sign such person's name, individually or on behalf of the Company, to any Form 10-K.\nIN WITNESS WHEREOF, each of the undersigned has executed the foregoing power of attorney on this 22nd day of May, 2025.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName and Signature\n \n \nTitle\n \nDate\n \n \n \n \n \n \n/s/ Steve Sanghi\n \n \nChief Executive Officer and President\n \nMay 22, 2025\nSteve Sanghi\n \n \n(Principal Executive Officer)\n \n \n \n \n \n \n \n \n/s/ Ellen L. Barker\n \n \nDirector\n \nMay 22, 2025\nEllen L. Barker\n \n \n \n \n \nDirector\nRick Cassidy\n/s/ Matthew W. Chapman\nDirector\nMay 22, 2025\nMatthew W. Chapman\n/s/ Victor Peng\nDirector\nMay 22, 2025\nVictor Peng\n/s/ Karen M. Rapp\nDirector\nMay 22, 2025\nKaren M. Rapp\n/s/ J. Eric Bjornholt\n \n \nSenior Vice President and Chief Financial Officer\n \nMay 22, 2025\nJ. Eric Bjornholt\n \n \n(Principal Financial and Accounting Officer)\n \n \n71\nTable of Contents\nAnnual Report on Form 10-K\nItem 8, Item 15(a)(1) and (2), (b) and (c)\n_________________________________\nINDEX TO FINANCIAL STATEMENTS\nCONSOLIDATED FINANCIAL STATEMENTS\nEXHIBITS\n_________________________________\nYEAR ENDED MARCH 31, 2025 \nMICROCHIP TECHNOLOGY INCORPORATED\nAND SUBSIDIARIES\nCHANDLER, ARIZONA\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: \n42\n)\nF-\n1\nReport of Independent Registered Public Accounting Firm on Internal Control Over Financial Reporting\nF-\n3\nConsolidated Balance Sheets as of March 31, 2025 and 2024\nF-\n4\nConsolidated Statements of Operations for each of the three years in the period ended March 31, 2025\nF-\n5\nConsolidated Statements of Comprehensive Income for each of the three years in the period ended March 31, 2025\nF-\n6\nConsolidated Statements of Cash Flows for each of the three years in the period ended March 31, 2025\nF-\n7\nConsolidated Statements of Changes in Equity for each of the three years in the period ended March 31, 2025\nF-\n9\nNotes to Consolidated Financial Statements\nF-\n11\ni\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Microchip Technology Incorporated\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Microchip Technology Incorporated and subsidiaries (the Company) as of March 31, 2025 and 2024, the related consolidated statements of operations, comprehensive income, changes in equity and cash flows for each of the three years in the period ended March 31, 2025, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at March 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended March 31, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of March 31, 2025, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated May 22, 2025 expressed an unqualified opinion thereon.  \n \nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nF-1\nTable of Contents\nUnrecognized tax benefits\nDescription of the Matter\nAs more fully described in Note 12 to the consolidated financial statements, the Company operates in a number of tax jurisdictions and some of its income tax returns are being examined by local tax authorities that have challenged select tax positions taken on their local returns. Because the matters challenged by authorities can be complex and subject to interpretation, their ultimate outcome can be uncertain. For select tax positions the Company uses significant judgment in (1) determining whether, based on its technical merits, it is more-likely-than-not to be sustained upon examination and (2) measuring the amount of tax benefit that qualifies for recognition.\nAuditing the recognition and measurement of unrecognized tax benefits for the select positions that are currently being challenged by local tax authorities was challenging and required a high degree of auditor judgment and increased extent of effort, including the involvement of our tax professionals, because interpreting and applying tax laws can be complex. \nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s accounting process for the select tax positions that are currently being challenged by local tax authorities. This included testing controls over management’s review of the technical merits of these select tax positions, including the process to evaluate whether there is new information relevant to the select tax positions that are being challenged by local tax authorities.\nOur audit procedures included, among others, evaluating the judgments the Company made to develop the select tax positions and related unrecognized tax benefit. We involved our tax professionals, including international tax, transfer pricing and local professionals located in the relevant jurisdictions, who used their knowledge and experience to assess the technical merits of these tax positions and to evaluate the application of relevant tax laws in the Company’s recognition determination. We assessed the Company’s correspondence with the relevant tax authorities and, as applicable, evaluated tax opinions or other third-party advice obtained by the Company. We also evaluated the adequacy of the Company’s disclosures included in Note 12 in relation to these select tax positions. \n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 2001.\nPhoenix, Arizona\nMay 22, 2025 \nF-2\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Microchip Technology Incorporated \nOpinion on Internal Control Over Financial Reporting \nWe have audited Microchip Technology Incorporated and subsidiaries’ internal control over financial reporting as of March 31, 2025, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Microchip Technology Incorporated and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of March 31, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of March 31, 2025 and 2024, the related consolidated statements of operations, comprehensive income, changes in equity and cash flows for each of the three years in the period ended March 31, 2025, and the related notes and our report dated May 22, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nPhoenix, Arizona\nMay 22, 2025\n \nF-3\nTable of Contents\nItem 1\n.\n Financial Statements\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(in millions, except share and per share amounts)\nASSETS\nMarch 31,\nMarch 31,\n \n2025\n2024\nCash and cash equivalents\n$\n771.7\n \n$\n319.7\n \nAccounts receivable, net\n689.7\n \n1,143.7\n \nInventories\n1,293.5\n \n1,316.0\n \nOther current assets\n236.4\n \n233.6\n \nTotal current assets\n2,991.3\n \n3,013.0\n \nProperty, plant and equipment, net\n1,183.7\n \n1,194.6\n \nGoodwill\n6,684.8\n \n6,675.4\n \nIntangible assets, net\n2,389.0\n \n2,781.8\n \nLong-term deferred tax assets\n1,728.1\n \n1,596.5\n \nOther assets\n397.7\n \n611.9\n \nTotal assets\n$\n15,374.6\n \n$\n15,873.2\n \nLIABILITIES AND STOCKHOLDERS' EQUITY\nAccounts payable\n$\n160.6\n \n$\n213.0\n \nAccrued liabilities\n994.5\n \n1,307.0\n \nCurrent portion of long-term debt\n—\n \n999.4\n \nTotal current liabilities\n1,155.1\n \n2,519.4\n \nLong-term debt\n5,630.4\n \n5,000.4\n \nLong-term income tax payable\n633.4\n \n649.2\n \nLong-term deferred tax liability\n33.8\n \n28.8\n \nOther long-term liabilities\n843.6\n \n1,017.6\n \nStockholders' equity:\n \n \nPreferred stock, $\n0.001\n par value; authorized \n5,000,000\n shares; 7.50% Series A mandatory convertible preferred stock, \n1,485,000\n shares issued and outstanding at March 31, 2025 with a liquidation preference of $\n1,000\n per share, or $\n1,485.0\n million in the aggregate; \nno\n shares issued or outstanding at March 31, 2024\n—\n \n—\n \nCommon stock, $\n0.001\n par value; authorized \n900,000,000\n shares; \n577,996,915\n shares issued and \n538,704,604\n shares outstanding at March 31, 2025; \n577,806,659\n shares issued and \n536,663,691\n shares outstanding at March 31, 2024\n0.6\n \n0.5\n \nAdditional paid-in capital\n3,909.9\n \n2,482.9\n \nCommon stock held in treasury: \n39,292,311\n shares at March 31, 2025; \n41,142,968\n shares at March 31, 2024\n(\n2,611.6\n)\n(\n2,581.6\n)\nAccumulated other comprehensive loss\n(\n1.7\n)\n(\n3.5\n)\nRetained earnings\n5,781.1\n \n6,759.5\n \nTotal stockholders' equity\n7,078.3\n \n6,657.8\n \nTotal liabilities and stockholders' equity\n$\n15,374.6\n \n$\n15,873.2\n \nSee accompanying notes to consolidated financial statements\nF-4\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except per share amounts)\nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nNet sales\n$\n4,401.6\n \n$\n7,634.4\n \n$\n8,438.7\n \nCost of sales\n1,933.7\n \n2,638.7\n \n2,740.8\n \nGross profit\n2,467.9\n \n4,995.7\n \n5,697.9\n \nResearch and development\n983.8\n \n1,097.4\n \n1,118.3\n \nSelling, general and administrative\n617.7\n \n734.2\n \n797.7\n \nAmortization of acquired intangible assets\n490.9\n \n605.4\n \n669.9\n \nSpecial charges (income) and other, net\n79.2\n \n(\n12.3\n)\n(\n4.0\n)\nOperating expenses\n2,171.6\n \n2,424.7\n \n2,581.9\n \nOperating income\n296.3\n \n2,571.0\n \n3,116.0\n \nInterest income\n9.2\n \n7.6\n \n2.1\n \nInterest expense\n(\n259.2\n)\n(\n198.3\n)\n(\n203.9\n)\nLoss on settlement of debt\n(\n1.7\n)\n(\n12.2\n)\n(\n8.3\n)\nOther (loss) income, net\n(\n5.7\n)\n(\n2.2\n)\n3.8\n \nIncome before income taxes\n38.9\n \n2,365.9\n \n2,909.7\n \nIncome tax provision\n39.4\n \n459.0\n \n672.0\n \nNet (loss) income\n(\n0.5\n)\n1,906.9\n \n2,237.7\n \nDividends on Series A Preferred Stock\n(\n2.2\n)\n—\n \n—\n \nNet (loss) income attributable to common stockholders\n$\n(\n2.7\n)\n$\n1,906.9\n \n$\n2,237.7\n \nBasic net (loss) income per common share\n$\n(\n0.01\n)\n$\n3.52\n \n$\n4.07\n \nDiluted net (loss) income per common share\n$\n(\n0.01\n)\n$\n3.48\n \n$\n4.02\n \nDividends declared per common share\n$\n1.816\n \n$\n1.682\n \n$\n1.263\n \nBasic common shares outstanding\n537.3\n \n542.0\n \n550.4\n \nDiluted common shares outstanding\n537.3\n \n548.0\n \n557.3\n \nSee accompanying notes to consolidated financial statements\n \nF-5\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\nFiscal Year Ended March 31,\n2025\n2024\n2023\nNet (loss) income\n$\n(\n0.5\n)\n$\n1,906.9\n \n$\n2,237.7\n \nComponents of other comprehensive income:\nActuarial gains related to defined benefit pension plans, net of tax effect\n1.8\n \n0.6\n \n16.6\n \nChange in net foreign currency translation adjustment\n—\n \n—\n \n(\n0.1\n)\nOther comprehensive income, net of tax effect\n1.8\n \n0.6\n \n16.5\n \nComprehensive income\n$\n1.3\n \n$\n1,907.5\n \n$\n2,254.2\n \nSee accompanying notes to consolidated financial statements\n \nF-6\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nCash flows from operating activities:\n \n \nNet (loss) income\n$\n(\n0.5\n)\n$\n1,906.9\n \n$\n2,237.7\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n750.1\n \n879.5\n \n998.4\n \nDeferred income taxes\n(\n143.3\n)\n(\n27.2\n)\n205.5\n \nShare-based compensation expense related to equity incentive plans\n180.4\n \n177.5\n \n170.4\n \nLoss on settlement of debt\n1.7\n \n12.2\n \n8.3\n \nAmortization of debt discount\n64.8\n \n37.5\n \n7.2\n \nAmortization of debt issuance costs\n7.8\n \n7.3\n \n9.5\n \nImpairment of intangible assets\n—\n \n1.8\n \n1.8\n \nOther\n(\n63.0\n)\n(\n26.1\n)\n(\n1.8\n)\nChanges in operating assets and liabilities, excluding impact of acquisitions:\nDecrease (increase) in accounts receivable\n454.0\n \n161.6\n \n(\n232.7\n)\nDecrease (increase) in inventories\n31.6\n \n12.8\n \n(\n483.2\n)\n(Decrease) increase in accounts payable and accrued liabilities\n(\n345.6\n)\n(\n148.4\n)\n323.4\n \nChange in other assets and liabilities\n(\n38.1\n)\n(\n64.2\n)\n404.5\n \nChange in income tax payable\n(\n1.8\n)\n(\n38.5\n)\n(\n28.0\n)\nNet cash provided by operating activities\n898.1\n \n2,892.7\n \n3,621.0\n \nCash flows from investing activities:\n \n \nOther investing\n2.4\n \n0.4\n \n0.9\n \nProceeds from capital-related government incentives\n0.4\n \n6.0\n \n—\n \nInvestments in other assets\n(\n164.6\n)\n(\n113.4\n)\n(\n114.2\n)\nCapital expenditures\n(\n126.0\n)\n(\n285.1\n)\n(\n486.2\n)\nNet cash used in investing activities\n(\n287.8\n)\n(\n392.1\n)\n(\n599.5\n)\nCash flows from financing activities:\n \n \nProceeds from borrowings on Revolving Credit Facility\n68.0\n \n6,271.0\n \n5,935.0\n \nRepayments of Revolving Credit Facility\n(\n68.0\n)\n(\n6,371.0\n)\n(\n7,234.1\n)\nProceeds from borrowings on 2025 Term Loan Facility\n—\n \n750.0\n \n—\n \nRepayments of 2025 Term Loan Facility\n(\n750.0\n)\n—\n \n—\n \nProceeds from issuance of Commercial Paper\n13,937.5\n \n9,039.1\n \n—\n \nRepayments of Commercial Paper\n(\n15,113.9\n)\n(\n7,688.7\n)\n—\n \nProceeds from issuance of senior notes\n1,992.2\n \n994.7\n \n—\n \nRepayment of senior notes\n(\n1,000.0\n)\n(\n3,400.0\n)\n—\n \nProceeds from issuance of convertible debt\n1,250.0\n \n—\n \n—\n \nPayments on settlement of convertible debt\n(\n672.2\n)\n(\n132.8\n)\n(\n170.4\n)\nIssuance of Series A Preferred Stock\n1,449.5\n \n—\n \n—\n \nDeferred financing costs\n(\n19.7\n)\n(\n3.0\n)\n—\n \nPurchase of capped call options\n(\n160.1\n)\n—\n \n—\n \nProceeds from sale of common stock\n65.4\n \n82.1\n \n82.3\n \nTax payments related to shares withheld for vested RSUs\n(\n57.6\n)\n(\n61.1\n)\n(\n75.8\n)\nRepurchase of common stock\n(\n96.5\n)\n(\n982.1\n)\n(\n945.8\n)\nPayment of cash dividends\n(\n975.7\n)\n(\n911.5\n)\n(\n695.3\n)\nCapital lease payments\n(\n1.6\n)\n(\n1.6\n)\n(\n0.8\n)\nOther Financing\n(\n5.6\n)\n—\n \n—\n \nNet cash used in financing activities\n(\n158.3\n)\n(\n2,414.9\n)\n(\n3,104.9\n)\nNet increase (decrease) in cash and cash equivalents\n452.0\n \n85.7\n \n(\n83.4\n)\nCash and cash equivalents, at beginning of period\n319.7\n \n234.0\n \n317.4\n \nCash and cash equivalents, at end of period\n$\n771.7\n \n$\n319.7\n \n$\n234.0\n \nF-7\nTable of Contents\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nSupplemental disclosure of cash flow information:\nNon-cash activities:\nROU assets obtained in exchange of lease liabilities\n$\n10.2\n \n$\n28.0\n \n$\n38.4\n \nCash paid for:\nInterest\n$\n236.2\n \n$\n191.2\n \n$\n181.5\n \nIncome taxes\n$\n175.2\n \n$\n517.1\n \n$\n482.6\n \nOperating lease payments in operating cash flows\n$\n40.0\n \n$\n39.0\n \n$\n39.7\n \n    \nSee accompanying notes to consolidated financial statements\nF-8\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY\n(in millions)\nPreferred Stock Par Value\nCommon Stock Par Value\nAdditional Paid-in-Capital Amount\nCommon Stock Held in Treasury Amount\nAccumulated Other Comprehensive Loss\nRetained Earnings\nTotal Equity\nBalance at March 31, 2022\n$\n— \n$\n0.6\n \n$\n2,535.9\n \n$\n(\n796.3\n)\n$\n(\n20.6\n)\n$\n4,175.2\n \n$\n5,894.8\n \nAdoption of ASU 2020-06, cumulative adjustment\n— \n— \n(\n128.3\n)\n— \n— \n46.5\n \n(\n81.8\n)\nNet income\n— \n— \n— \n— \n— \n2,237.7\n \n2,237.7\n \nOther comprehensive income\n— \n— \n— \n— \n16.5\n \n— \n16.5\n \nProceeds from sales of common stock through employee equity incentive plans\n— \n— \n82.4\n \n— \n— \n— \n82.4\n \nRSU withholdings\n— \n— \n(\n75.8\n)\n— \n— \n— \n(\n75.8\n)\nTreasury stock used for new issuances\n— \n— \n(\n81.9\n)\n81.9\n \n— \n— \n—\n \nRepurchase of common stock\n— \n(\n0.1\n)\n— \n(\n945.8\n)\n— \n— \n(\n945.9\n)\nSettlement of convertible debt\n— \n— \n(\n91.1\n)\n— \n— \n— \n(\n91.1\n)\nShare-based compensation\n— \n— \n172.1\n \n— \n— \n— \n172.1\n \nDividends on common stock\n— \n— \n— \n— \n— \n(\n695.3\n)\n(\n695.3\n)\nBalance at March 31, 2023\n— \n0.5\n \n2,413.3\n \n(\n1,660.2\n)\n(\n4.1\n)\n5,764.1\n \n6,513.6\n \nNet income\n— \n— \n— \n— \n— \n1,906.9\n \n1,906.9\n \nOther comprehensive income\n— \n— \n— \n— \n0.6\n \n— \n0.6\n \nProceeds from sales of common stock through employee equity incentive plans\n— \n— \n82.1\n \n— \n— \n— \n82.1\n \nRSU withholdings\n— \n— \n(\n61.1\n)\n— \n— \n— \n(\n61.1\n)\nTreasury stock used for new issuances\n— \n— \n(\n67.5\n)\n67.5\n \n— \n— \n—\n \nRepurchase of common stock\n— \n— \n— \n(\n988.9\n)\n— \n— \n(\n988.9\n)\nSettlement of convertible debt\n— \n— \n(\n65.3\n)\n— \n— \n— \n(\n65.3\n)\nShare-based compensation\n— \n— \n181.4\n \n— \n— \n— \n181.4\n \nDividends on common stock\n— \n— \n— \n— \n— \n(\n911.5\n)\n(\n911.5\n)\nBalance at March 31, 2024\n— \n0.5\n \n2,482.9\n \n(\n2,581.6\n)\n(\n3.5\n)\n6,759.5\n \n6,657.8\n \nNet (loss)\n— \n— \n— \n— \n— \n(\n0.5\n)\n(\n0.5\n)\nOther comprehensive income\n— \n— \n— \n— \n1.8\n \n— \n1.8\n \nIssuance of Series A Preferred Stock\n— \n— \n1,449.5\n \n— \n— \n— \n1,449.5\n \nProceeds from sales of common stock through employee equity incentive plans\n— \n— \n65.4\n \n— \n— \n— \n65.4\n \nRSU withholdings\n— \n— \n(\n57.6\n)\n— \n— \n— \n(\n57.6\n)\nTreasury stock used for new issuances\n— \n0.1\n \n(\n59.7\n)\n59.6\n \n— \n— \n—\n \nRepurchase of common stock\n— \n— \n— \n(\n89.6\n)\n— \n— \n(\n89.6\n)\nPurchase of capped call options\n— \n— \n(\n160.1\n)\n— \n— \n— \n(\n160.1\n)\nShare-based compensation\n— \n— \n189.5\n \n— \n— \n— \n189.5\n \nDividends on Series A Preferred Stock\n— \n— \n— \n— \n— \n(\n2.2\n)\n(\n2.2\n)\nF-9\nTable of Contents\nPreferred Stock Par Value\nCommon Stock Par Value\nAdditional Paid-in-Capital Amount\nCommon Stock Held in Treasury Amount\nAccumulated Other Comprehensive Loss\nRetained Earnings\nTotal Equity\nDividends on common stock\n— \n— \n— \n— \n— \n(\n975.7\n)\n(\n975.7\n)\nBalance at March 31, 2025\n$\n— \n$\n0.6\n \n$\n3,909.9\n \n$\n(\n2,611.6\n)\n$\n(\n1.7\n)\n$\n5,781.1\n \n$\n7,078.3\n \nSee accompanying notes to consolidated financial statements\nF-10\nTable of Contents\nMICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES\nNotes to Consolidated Financial Statements \nNote 1\n. \nSignificant Accounting Policies\n \nNature of Business\n \nMicrochip Technology Incorporated (Microchip or the Company) develops, manufactures and sells smart, connected and secure embedded control solutions used by its customers for a wide variety of applications.  The Company provides cost-effective embedded control solutions that also offer the advantages of small size, high performance, extreme low power usage, wide voltage range operation, mixed-signal integration, and ease of development, thus enabling timely and cost-effective integration of the Company's solutions by its customers in their end products.\nPrinciples of Consolidation\n \nThe Company prepares its consolidated financial statements in accordance with U.S. GAAP.  The consolidated financial statements include the accounts of Microchip and its majority-owned and controlled subsidiaries.  All significant intercompany accounts and transactions have been eliminated in consolidation.  All dollar amounts in the financial statements and tables in these notes, except per share amounts, are stated in millions of U.S. dollars unless otherwise noted.  For comparative purposes, certain prior year amounts have been reclassified to conform to the current year presentation and such changes are not material to our consolidated financial statements.\nRevenue Recognition \nThe Company generates revenue primarily from sales of semiconductor products to distributors and non-distributor customers (direct customers) and, to a lesser extent, from royalties paid by licensees of intellectual property.  The Company applies the following five-step approach to determine the timing and amount of revenue recognition: (i) identify the contract with the customer, (ii) identify performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when the performance obligations are satisfied.\nSales of semiconductor products to customers are governed by a purchase order, an order acknowledgment, and a distributor agreement in the case of the Company's distributor customers.  Sales to customers do not meet the definition of a contract until the customer has sent in a purchase order, the Company has acknowledged the order, the Company has deemed the collectability of the consideration to be probable, and legally enforceable rights and obligations have been created.  As is customary in the semiconductor industry, the Company offers price concessions and stock rotation rights to many of its distributors.  As these are forms of variable consideration, the Company estimates the amount of consideration to which they will be entitled using recent historical data and applying the expected value method.  Substantially all of the revenue generated from contracts with customers is recognized at, or near to, the time risk and title of the inventory transfers to the customer.\nThe Company entered into LTSAs with certain of its customers that purchase through distributors or directly from the Company.  Under these LTSAs, the Company receives an upfront deposit and minimum purchase commitments from the customer in exchange for assured supply over the contract period, which typically ranges from three to five years.  If the customer meets the minimum purchase commitments defined in the contract, the Company returns the deposit to the customer.  If not, the Company may retain all, or a portion of the deposit which will be recognized as revenue as the remaining performance obligations under the LTSAs are satisfied.  Certain upfront deposits collected by the Company are recorded as deferred revenue in accrued liabilities or other long-term liabilities depending on the expected timing of the satisfaction of the underlying performance obligations.\nRevenue generated from licensees is governed by licensing agreements.  The Company's primary performance obligation related to these agreements is to provide the licensee the right to use the intellectual property.  The final transaction price is determined by multiplying the usage of the license by the royalty, which is fixed in the licensing agreement.  Revenue is recognized as usage of the license occurs.\n \nF-11\nTable of Contents\nResearch and Development\n \nResearch and development costs are expensed as incurred.  Assets purchased to support the Company's ongoing research and development activities are capitalized when related to products which have achieved technological feasibility or that have alternative future uses and are amortized over their estimated useful lives.  Research and development expenses include expenditures for labor, share-based payments, depreciation, masks, prototype wafers, and expenses for development of process technologies, new packages, and software to support new products and design environments.\nRestructuring Charges\nRestructuring charges are included within special charges and other, net in the consolidated statements of operations and are primarily comprised of employee separation costs, contract exit costs, costs of facility consolidation and closure, including the related gains or losses associated with the sale of assets.  Employee separation costs include one-time termination benefits that are recognized as a liability at estimated fair value at the time of communication to employees, unless future service is required, in which case the costs are recognized ratably over the future service period.  Ongoing termination benefits are recognized as a liability at estimated fair value when the amount of such benefits is probable and reasonably estimable.  Contract exit costs include contract termination fees.  A liability for contract termination fees is recognized in the period in which the Company terminates the contract.\nForeign Currency Translation\n \nSubstantially all of the Company's foreign subsidiaries are considered to be extensions of the U.S. company and any translation gains and losses related to these subsidiaries are included in other income (loss), net in the consolidated statements of income.  As the U.S. dollar is utilized as the functional currency, gains and losses resulting from foreign currency transactions (transactions denominated in a currency other than the subsidiaries' functional currency) are also included in income.\n \nIncome Taxes\n \nAs part of the process of preparing its consolidated financial statements, the Company is required to record its income taxes in each of the jurisdictions in which it operates.\nVarious taxing authorities in the U.S. and other countries in which the Company does business may scrutinize the tax structures employed by businesses.  Companies of a similar size and complexity as the Company are regularly audited by the taxing authorities in the jurisdictions in which they conduct significant operations.  During the fiscal year ended March 31, 2025, various jurisdictions finalized their audits for certain periods.  The close of these audits did not have a material adverse impact on the financial statements.  The Company is currently being audited by the tax authorities in the United States and various foreign jurisdictions.  At this time, the Company does not know what the outcome of these audits will be.  The Company records benefits for uncertain tax positions based on an assessment of whether it is more likely than not that the tax positions will be sustained based on their technical merits under currently enacted law.  If this threshold is not met, no tax benefit of the uncertain tax position is recognized.  If the threshold is met, the Company recognizes the largest amount of the tax benefit that is more than \n50\n% likely to be realized upon ultimate settlement. \nThe accounting model related to the measurement of uncertain tax positions requires the Company to presume that the tax position will be examined by the relevant taxing authority that has full knowledge of all relevant information and that each tax position will be evaluated without consideration of the possibility of offset or aggregation with other positions.  The recognition requirement for the liability exists even if the Company believes the possibility of examination by a taxing authority or discovery of the related risk matters is remote or where it has a long history of the taxing authority not performing an exam or overlooking an issue.  The Company will record an adjustment to a previously recorded position if new information or facts related to the position are identified in a subsequent period.  Generally, adjustments to the positions are recorded through the income statement.  Generally, adjustments will be recorded in periods subsequent to the initial recognition in light of changing facts and circumstances, such as the closing of a tax audit, the closing of a statutory audit period, changes in applicable law, or interactions with taxing authorities.  Due to the inherent uncertainty in the estimation process, including the complexity involved to interpret and apply tax laws, and in consideration of the criteria of the accounting model, amounts recognized in the financial statements in periods subsequent to the initial recognition may significantly differ from the estimated exposure of the position under the accounting model.\nIn December 2017, the TCJA was enacted into law and established a new provision designed to tax low-taxed income of foreign subsidiaries known as global intangible low-taxed income (GILTI).  The FASB allows taxpayers to make an accounting \nF-12\nTable of Contents\npolicy election of either (i) treating taxes due on GILTI inclusions as a current-period expense when incurred or (ii) recognizing deferred taxes for temporary basis differences that are expected to reverse as GILTI in future years.  The Company has made a policy choice to treat taxes due on GILTI inclusions as a current-period expense when incurred.\n \nCash and Cash Equivalents\n \nAll highly liquid investments, including marketable securities with an original maturity to the Company of three months or less when acquired are considered to be cash equivalents.\n  \nInventories\n \nInventories are valued at the lower of cost or net realizable value using the first-in, first-out method.  Inventory costs generally consist of material, labor, depreciation and overhead costs.  The Company records a charge to cost of sales to write down its inventory for estimated excess, obsolete or unmarketable inventory in an amount equal to the difference between the cost of inventory and the estimated net realizable value based upon assumptions about future demand and market conditions.  If actual market conditions are less favorable than those projected by the Company, additional inventory write-downs may be required.  Inventory impairment charges establish a new cost basis for inventory and charges are not subsequently reversed to income even if circumstances later suggest that increased carrying amounts are recoverable.  In determining whether there is a risk of excess or obsolete inventory, the Company evaluates projected demand over periods that align with demand forecasts used to develop manufacturing plans and inventory build decisions and writes down inventory on hand that is in excess of estimated demand.  Management reviews and adjusts the estimates as appropriate based on specific situations.  For example, demand can be adjusted up for new products for which historic sales are not representative of future demand.  Alternatively, demand can be adjusted down to the extent any existing products are being replaced or discontinued.\n \nThe valuation of inventory includes determining which fixed production overhead costs can be included in inventory based on the normal operating capacity of the Company's manufacturing facilities.  In periods where the Company's production levels are below normal operating capacity, unabsorbed overhead production costs associated with the reduced production levels of the Company's manufacturing facilities are charged directly to cost of sales.\n \nProperty, Plant and Equipment\n \nProperty, plant and equipment are stated at cost.  Major renewals and improvements are capitalized, while maintenance and repairs are expensed when incurred.  The Company's property and equipment accounting policies incorporate estimates, assumptions and judgments relative to the useful lives of its property and equipment.  Depreciation is provided for assets placed in service on a straight-line basis over the estimated useful lives of the relative assets, which range from \n10\n to \n30\n years for buildings and building improvements and \n5\n to \n7\n years for machinery and equipment.  The Company evaluates the carrying value of its property and equipment when events or changes in circumstances indicate that the carrying value of such assets may be impaired.  Asset impairment evaluations are, by nature, highly subjective.\n \nLeases\nThe Company determines if an arrangement is a lease at its inception.  Operating lease arrangements are comprised primarily of real estate and equipment agreements for which the ROU assets are included in other assets and the corresponding lease liabilities, depending on their maturity, are included in accrued liabilities or other long-term liabilities in the consolidated balance sheets.\nOperating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term.  Operating lease ROU assets also include any initial direct costs and prepayments less lease incentives.  Lease terms may include options to extend or terminate the lease when it is reasonably certain that the Company will exercise such options.\nAs the Company's leases generally do not provide an implicit rate, the Company uses its collateralized incremental borrowing rate based on the information available at the lease commencement date, including lease term, in determining the present value of lease payments.  Lease expense for these leases is recognized on a straight-line basis over the lease term.\nF-13\nTable of Contents\nDebt\n \nThe Company presents short-term debt obligations, which include debt obligations with a contractual maturity within 12 months of the balance sheet date and Convertible Debt that is convertible as of the balance sheet date, as long-term debt on the consolidated balance sheets when the Company has the intent and ability to utilize proceeds from its Revolving Credit Facility to refinance such debt on a long-term basis.  Discounts and issuance costs directly related to the issuance of debt are amortized over the term as interest expense under the effective interest rate method or on a straight-line basis in the case of the Company's Revolving Credit Facility.  \nThe Company accounts for its Convertible Debt as a single liability with no separate accounting for embedded conversion features.  The Company accounts for privately negotiated settlements of its Convertible Debt as induced conversions, resulting in an inducement loss measured as the difference between the fair value of the consideration transferred and the fair value of the original terms of the instrument on the acceptance date.  The remaining consideration transferred, after reducing the carrying amount of the Convertible Debt, is recorded as a reduction to additional paid-in-capital on the Company’s consolidated balance sheets.  Prior to conversion of its Convertible Debt, the Company includes, in the diluted net income per common share calculation, the effect of the additional shares that may be issued when the Company's common stock price exceeds the conversion price using the if-converted method.  The Company's Convertible Debt has no impact on diluted net income per common share unless the average price of the Company's common stock exceeds the conversion price because the Company is required to settle the principal amount of the Convertible Debt in cash upon conversion.\nDefined Benefit Pension Plans\nThe Company maintains defined benefit pension plans, covering certain of its foreign employees.  For financial reporting purposes, net periodic pension costs and pension obligations are determined based upon a number of actuarial assumptions, including discount rates for plan obligations, and assumed rates of compensation increases for employees participating in plans.  These assumptions are based upon management's judgment and consultation with actuaries, considering all known trends and uncertainties.\nContingencies\nIn the ordinary course of business, the Company is exposed to various liabilities as a result of contracts, product liability, customer claims and other matters.  Additionally, the Company is involved in a limited number of legal actions, both as plaintiff and defendant.  Consequently, the Company could incur uninsured liability in any of those actions.  The Company also periodically receives notifications from various third parties alleging infringement of patents or other intellectual property rights, or from customers requesting reimbursement for various costs.  With respect to pending legal actions to which the Company is a party and other claims, although the outcomes are generally not determinable, the Company believes that the ultimate resolution of these matters will not have a material adverse effect on its financial position, cash flows or results of operations.  Litigation and disputes relating to the semiconductor industry are not uncommon, and the Company is, from time to time, subject to such litigation and disputes.  As a result, no assurances can be given with respect to the extent or outcome of any such litigation or disputes in the future.\nThe Company accrues for claims and contingencies when losses become probable and reasonably estimable.  As of the end of each applicable reporting period, the Company reviews each of its matters and, where it is probable that a liability has been or will be incurred, it accrues for all probable and reasonably estimable losses.  Where the Company can reasonably estimate a range of losses it may incur regarding such a matter, it records an accrual for the amount within the range that constitutes its best estimate.  If the Company can reasonably estimate a range but no amount within the range appears to be a better estimate than any other, it uses the amount that is the low end of such range.\n \nGoodwill and Other Intangible Assets\n \nThe Company's intangible assets include goodwill and other intangible assets.  Goodwill is recorded when the purchase price paid for an acquisition exceeds the estimated fair value of the net identified tangible and intangible assets acquired.  Other intangible assets include existing technologies, core and developed technology, in-process research and development, trademarks and trade names, distribution rights and customer-related intangibles.  In-process research and development is capitalized until such time as the related projects are completed or abandoned at which time the capitalized amounts will begin to be amortized or written off.  Indefinite-lived intangible assets consist of goodwill and in-process research and development intangible assets that have not yet been placed in service.  All other intangible assets are definite-lived \nF-14\nTable of Contents\nintangible assets, including in-process research and development assets that have been placed in service, and are amortized over their respective estimated lives, ranging from \n1\n to \n15\n years. \nThe Company is required to perform an impairment review of indefinite-lived intangible assets, including goodwill annually, and more frequently under certain circumstances.  Indefinite-lived intangible assets are subjected to this annual impairment test during the fourth quarter of the Company's fiscal year.  The Company engages primarily in the development, manufacture and sale of semiconductor products as well as technology licensing.  As a result, the Company concluded there are \ntwo\n reporting units, semiconductor products and technology licensing.  The Company's impairment evaluation consists of a qualitative impairment assessment in which management evaluates whether it is more likely than not that the indefinite-lived intangible assets are impaired.  If it is determined that it is more likely than not, the Company performs a quantitative impairment test, which compares the fair value of the reporting unit or indefinite-lived intangible asset to its carrying value.  If the Company determines through the impairment process that the indefinite-lived intangible asset has been impaired, the Company will record the impairment charge in its results of operation.  Through March 31, 2025, the Company has never recorded a goodwill impairment charge.  In the event that facts and circumstances indicate definite-lived intangible assets may be impaired, the Company evaluates the recoverability and estimated useful lives of such assets.  If such indicators are present, recoverability is evaluated based on whether the sum of the estimated undiscounted cash flows attributable to the asset (group) in question is less than their carrying value.  If less, the Company measures the fair value of the asset (group) and recognizes an impairment loss if the carrying amount of the assets exceeds their respective fair values.\n \n \nImpairment of Long-Lived Assets\n \nThe Company assesses whether indicators of impairment of long-lived assets are present.  If such indicators are present, the Company determines whether the sum of the estimated undiscounted cash flows attributable to the asset groups in question is less than their carrying value.  If less, the Company recognizes an impairment loss based on the excess of the carrying amount of the asset groups over their respective fair values.  Fair value is determined by discounted future cash flows, appraisals or other methods.  If the assets determined to be impaired are to be held and used, the Company recognizes an impairment loss through a charge to operating results to the extent the present value of anticipated net cash flows attributable to the asset group are less than the asset's carrying value.  The Company would depreciate the remaining value over the remaining estimated useful life of the asset groups.\nGovernment Incentives\nThe Company receives government incentives for qualifying capital investments, research and development, and other activities as defined by the relevant government entities awarding the grants.  Government grants, including non-income tax incentives, are recognized when there is reasonable assurance that the grant will be received and the Company will comply with the conditions specified in the grant agreement.  The Company records capital-related grants as a reduction to property, plant and equipment within the consolidated balance sheets and recognizes a reduction to depreciation expense over the useful life of the corresponding asset.  The Company records operating grants as a reduction to expense in the same line item on the consolidated statements of income as the expenditure for which the grant is intended to compensate.  As of March 31, 2025, the Company recorded $\n46.4\n million of capital-related grants as a reduction to \nproperty, plant and equipment\n with a corresponding offset of $\n3.4\n million within \nother assets\n and $\n36.0\n million as a reduction to income taxes payable within \naccrued liabilities\n on the consolidated balance sheets.  As of March 31, 2024, the Company recorded $\n126.5\n million of capital-related grants as a reduction to \nproperty, plant and equipment\n with a corresponding offset of $\n93.2\n million within \nother assets\n and $\n27.3\n million as a reduction to income taxes payable within \naccrued liabilities\n on the consolidated balance sheets.  The Company recognized an immaterial benefit to operating income for operating grants and the reduction of depreciation expense for capital-related grants in each of fiscal 2025, fiscal 2024, and fiscal 2023.\nShare-Based Compensation\n \nThe Company has equity incentive plans under which RSUs have been granted to employees and non-employee members of the Board of Directors.  The Company uses RSUs with a service condition as its primary equity incentive compensation instrument for employees and also grants performance-based PSUs to executive officers and employees.  The Company also has employee stock purchase plans for eligible employees.  Share-based compensation cost for RSUs with a service condition or performance-based PSUs is measured on the grant date based on the fair market value of the Company’s common stock discounted for expected future dividends and is recognized as expense on a straight-line attribution method over the requisite service periods, with forfeitures recognized as they occur.  Share-based compensation cost for performance-based PSUs is recognized if and when the Company concludes that it is probable that the performance condition will be achieved.  The Company reassesses the probability of the performance condition at each reporting period and a cumulative catch-up adjustment is recorded to share-based compensation cost for any change in the probability assessment.  If there are any \nF-15\nTable of Contents\nmodifications of the underlying unvested securities, the Company may be required to accelerate or increase any remaining unearned share-based compensation expense.  Prior to fiscal 2023, the Company granted market-based PSUs to executive officers.  As of March 31, 2025, the remaining unearned share-based compensation expense related to market-based PSUs was immaterial.\nTreasury Shares\nFrom time to time, the Company repurchases shares of its common stock in the open market or in privately negotiated transactions.  Shares repurchased are recorded at cost, inclusive of fees, commissions, taxes and other expenses.  Treasury shares are re-issued on a first-in, first-out basis to fund share issuance requirements under the Company's equity incentive plans.\nSeries A Preferred Stock\nThe Company accounts for its Series A Preferred Stock as permanent equity carried at its par value.  The Company computes net income attributable to common stockholders by reducing net income by the dividends on Series A Preferred Stock accumulated during the period.  Prior to the conversion of its Series A Preferred Stock, the Company includes, in the diluted net income per common share calculation, the effect of the conversion of the outstanding Series A Preferred Stock into the Company's common stock at the applicable conversion rate\n \nusing the if-converted method.\nConcentrations of Credit Risk\n \nThe Company is subject to counterparty risks from financial institutions and customers.  Financial instruments that potentially subject the Company to concentrations of credit risk consist primarily of cash deposits in excess of federally insured limits and accounts receivables.  The Company manages credit risk exposure for cash deposits by limiting counterparties to high-grade financial institutions.  Concentrations of credit risk with respect to accounts receivable are generally not significant due to the diversity of the Company's customers and geographic sales areas.  The Company sells its products primarily to OEMs and distributors in the Americas, Europe and Asia.  The Company performs ongoing credit evaluations of its customers' financial condition and, as deemed necessary, may require collateral, primarily letters of credit.  With the exception of Arrow Electronics, the Company's largest distributor, which accounted for \n13\n% of the accounts receivable balance as of March 31, 2024, no other customer accounted for more than 10% of the accounts receivable balance as of March 31, 2025 or March 31, 2024.\n \nDistributor advances in the consolidated balance sheets, totaled $\n234.4\n million and $\n413.2\n million at March 31, 2025 and March 31, 2024, respectively.  On sales to distributors, the Company's payment terms generally require the distributor to settle amounts owed to the Company for an amount in excess of their ultimate cost.  The Company's sales price to its distributors may be higher than the amount that the distributors will ultimately owe the Company because distributors often negotiate price reductions after purchasing the products from the Company and such reductions are often significant.  It is the Company's practice to apply these negotiated price discounts to future purchases, requiring the distributor to settle receivable balances, on a current basis, generally within \n30\n days, for amounts originally invoiced.  This practice has an adverse impact on the working capital of the Company's distributors.  As such, the Company has entered into agreements with certain distributors whereby it advances cash to the distributors to reduce the distributors' working capital requirements.  The Company provides these advances based on a negotiated percentage of the amount of inventory held by the distributor.  Such advances have no impact on revenue recognition or the Company's consolidated statements of income.  The terms of these advances are set forth in binding legal agreements and are unsecured, bear no interest on unsettled balances and are due upon demand.  The agreements governing these advances can be canceled by the Company at any time and, upon cancellation, the amounts are due to the Company.\n \nUse of Estimates\n \nThe Company has made a number of estimates and assumptions relating to the reporting of assets, liabilities, revenues and expenses and the disclosure of contingent assets and liabilities to prepare its consolidated financial statements in conformity with U.S. GAAP.  Actual results could differ from those estimates.\nSubsequent Events\nThe Company evaluated events after March 31, 2025, and through the date the financial statements were issued, and determined any events or transactions occurring during this period that would require recognition or disclosure are \nF-16\nTable of Contents\nappropriately addressed in these financial statements.\nRecently Adopted Accounting Pronouncements\nIn November 2023, the FASB issued ASU 2023-07-\nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires public entities to disclose significant segment expenses that are regularly provided to the Chief Operating Decision Maker and included within each reported measure of segment profit or loss, and an amount and description of the composition of other segment items to reconcile to segment profit or loss.  The amendments in this update also expand the interim segment disclosure requirements.  The Company adopted this standard in fiscal 2025.  See \"Note 3. Geographic and Segment Information\" for further information.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU 2023-09-\nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n,\n \nwhich modifies the rules on income tax disclosures to enhance the transparency and decision-usefulness of income tax disclosures, particularly in the rate reconciliation table and disclosures about income taxes paid.  The amendments are intended to address investors’ requests for income tax disclosures that provide more information to help them better understand an entity’s exposure to potential changes in tax laws and the ensuing risks and opportunities and to assess income tax information that affects cash flow forecasts and capital allocation decisions.  The guidance also eliminates certain existing disclosure requirements related to uncertain tax positions and unrecognized deferred tax liabilities.  ASU 2023-09 is effective for public business entities for annual periods beginning after December 15, 2024 with early adoption permitted.  All entities should apply the guidance prospectively but have the option to apply it retrospectively.  The Company is continuing to assess the timing of adoption and the potential impacts of ASU 2023-09.\nIn November 2024, the FASB issued ASU 2024-03-\nIncome Statement (Subtopic 220-40\n):\n Disaggregation of Income Statement Expenses\n requiring disaggregated disclosures of certain expense captions into specified categories in the notes to the financial statements.  ASU 2024-03 is effective for annual reporting periods beginning after December 15, 2026, and interim periods within annual reporting periods beginning after December 15, 2027.  Early adoption is permitted with updates to be applied prospectively with the option for retrospective application.  The Company is currently evaluating the applicable disclosures.\nSEC Climate Disclosures\nIn March 2024, the SEC issued final rules requiring registrants to include comprehensive climate-related disclosures in annual reports and registration statements.  As adopted, the final rules require large accelerated filers to make their first climate-related disclosures for fiscal years beginning in 2025.  However, in April 2024, the SEC issued an order voluntarily staying the effectiveness of the new rules pending the completion of judicial review of certain legal challenges to their validity.  In March 2025, the SEC withdrew its defense of the rules.  The Company is currently evaluating the status of these rules and monitoring the status of the related litigation and the SEC’s stay.\nNote 2. \nNet Sales \nThe following table represents the Company's net sales by product line (in millions):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nMixed-signal Microcontrollers\n$\n2,249.7\n \n$\n4,272.4\n \n$\n4,755.7\n \nAnalog\n1,157.0\n \n2,016.4\n \n2,376.9\n \nOther\n994.9\n \n1,345.6\n \n1,306.1\n \nTotal net sales\n$\n4,401.6\n \n$\n7,634.4\n \n$\n8,438.7\n \nThe product lines listed above are included entirely in the Company's semiconductor product segment with the exception of the other product line, which includes products from both the semiconductor product and technology licensing segments.\nF-17\nTable of Contents\nThe following table represents the Company's net sales by customer type (in millions):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nDistributors\n$\n1,970.0\n \n$\n3,620.8\n \n$\n3,993.6\n \nDirect customers\n2,300.5\n \n3,910.3\n \n4,284.1\n \nLicensees\n131.1\n \n103.3\n \n161.0\n \nTotal net sales\n$\n4,401.6\n \n$\n7,634.4\n \n$\n8,438.7\n \nDistributors are customers that buy products with the intention of reselling them.  Distributors generally have a distributor agreement with the Company to govern the terms of the relationship.  Direct customers are non-distributor customers, which generally do not have a master sales agreement with the Company.  The Company's direct customers primarily consist of OEMs and, to a lesser extent, contract manufacturers.  Licensees are customers of the Company's technology licensing segment, which include purchasers of intellectual property and customers that have licensing agreements to use the Company's SuperFlash\n®\n embedded flash technology.  All of the customer types listed in the table above are included in the Company's semiconductor product segment with the exception of licensees, which is included in the technology licensing segment.  All of the Company's net sales are recognized from contracts with customers.\nSemiconductor Product Segment\nFor contracts related to the purchase of semiconductor products, the Company satisfies its performance obligation when control of the ordered product transfers to the customer.  The timing of the transfer of control depends on the agreed upon shipping terms with the customer, but generally occurs upon shipment, which is when physical possession of the product has been transferred and legal title of the product transfers to the customer.  Payment is generally due within 30 days of the ship date.  Payment is generally collected after the Company satisfies its performance obligation.  Also, the Company usually does not record contract assets because the Company has an unconditional right to payment upon satisfaction of the performance obligation, and therefore, a receivable is more commonly recorded than a contract asset.  Refer to Note 9 for the opening and closing balances of the Company's receivables. \nThe consideration received from customers is fixed, with the exception of consideration from certain distributors and customers under LTSAs.  Certain of the Company's distributors are granted price concessions and return rights, which result in variable consideration.  The amount of revenue recognized for sales to these certain distributors is adjusted for estimates of the price concessions and return rights that are expected to be claimed.  These estimates are based on the recent history of price concessions and stock rotations, which are recorded as refund liabilities within accrued liabilities on the Company's consolidated balance sheets.\nThe Company collects amounts in advance for certain of its contracts with customers.  These amounts are deferred until control of the product or service is transferred to the customer at which time it is recognized as revenue.  As of March 31, 2025, the Company had approximately $\n597.9\n million of deferred revenue, of which $\n213.4\n million is included within accrued liabilities and the remaining $\n384.5\n million is included within other long-term liabilities on the Company's consolidated balance sheet.  As of March 31, 2024, the Company had approximately $\n933.0\n million of deferred revenue, of which $\n261.8\n million is included within accrued liabilities and the remaining $\n671.2\n million is included within other long-term liabilities on the Company's consolidated balance sheets.  Deferred revenue represents amounts that have been invoiced in advance which are expected to be recognized as revenue in future periods.  Approximately $\n217.2\n million of deferred revenue recorded on the Company's consolidated balance sheets as of March 31, 2024 was recognized as revenue during fiscal 2025\n.  \nApproximately $\n126.1\n million of deferred revenue recorded on the Company's consolidated balance sheets as of March 31, 2023 was recognized as revenue during fiscal 2024.   \nOf the $\n597.9\n million of deferred revenue as of March 31, 2025, $\n501.5\n million is cash collected from customers under LTSAs, of which $\n138.3\n million is included within accrued liabilities and $\n363.2\n million is included within other long-term liabilities.  Under these LTSAs, the Company receives an upfront deposit from the customer in exchange for assured supply over the contract period, which typically ranges from \nthree years\n to \nfive years\n.  If the customer does not meet the minimum purchase commitments defined in the contract, the Company may retain all, or portions of, the deposit as revenue.  If the Company fails to assure supply as defined in the contract, the deposit, or portions of it, will be returned to the customer.  The transaction price for the remaining performance obligations for the LTSAs were approximately $\n2.52\n billion as of March 31, 2025, of which approximately \n28\n% is expected to be recognized as net sales during the next \n12\n months.  The amount and timing of such net sales is uncertain because it depends on the satisfaction of commitments made in the LTSAs, which may be affected by the timing and amount of orders placed by customers, contract modifications, variable consideration, sales \nF-18\nTable of Contents\nchannels, and manufacturing and supply chain conditions.  Accordingly, the amount may not be indicative of net sales in future periods.  The remaining $\n96.4\n million of deferred revenue as of March 31, 2025 is related to other cash payments received from customers in advance of the Company’s performance obligations being satisfied.  Most of the $\n96.4\n million will be recognized as net sales within the next 12 months.  The amount of other firmly committed orders with performance obligations in excess of 12 months at the time of order is immaterial.\nTechnology Licensing Segment\nThe technology licensing segment includes sales and licensing of the Company's intellectual property.  For contracts related to the sale of the Company's intellectual property, the Company satisfies its performance obligation and recognizes revenue when control of the intellectual property transfers to the customer.  For contracts related to the licensing of the Company's technology, the Company satisfies its performance obligation and recognizes revenue as usage of the license occurs.  The transaction price is fixed by the license agreement.  Payment is collected after the Company satisfies its performance obligation, and therefore contract liabilities are generally not recorded.  The Company generally does not record contract assets due to the fact that the Company has an unconditional right to payment upon satisfaction of the performance obligation, and therefore, the Company recognizes a receivable instead of a contract asset.  Refer to Note 9 for the opening and closing balances of the Company's receivables.\nNote 3\n. \nGeographic and Segment Information\n \n \nThe Company's business is made up of \ntwo\n operating segments, semiconductor products and technology licensing.  These segments represent management's view of the business for which separate financial information is available and evaluated regularly by the Chief Operating Decision Maker (CODM), which is the Company’s Chief Executive Officer.\nIn the semiconductor products segment, the Company designs, develops, manufactures and markets mixed-signal microcontrollers, development tools and analog, interface, mixed-signal, timing, wired and wireless connectivity devices, and memory products.  Under the leadership of the CODM, the Company is structured and organized around standardized roles and responsibilities based on product groups and functional activities.  The Company's product groups are responsible for product research, design and development.  The Company's functional activities include sales, marketing, manufacturing, information technology, human resources, legal and finance.  The Company's product groups have similar products, production processes, types of customers and methods for distribution.  In addition, the tools and technologies used in the design and manufacture of the Company's products are shared among the various product groups.  The Company's product group leaders, under the direction of the CODM, define the product roadmaps and team with sales personnel to achieve design wins and revenue and other performance targets.  Product group leaders also interact with manufacturing and operational personnel who are responsible for the production, prioritization and planning of the Company's manufacturing capabilities to help ensure the efficiency of the Company's operations and fulfillment of customer requirements.\nThe technology licensing segment includes sales and licensing of the Company's intellectual property.\nThe CODM uses segment gross profit for evaluating each segment's performance and allocating resources.  The Company does not allocate operating expenses, interest income, interest expense, other income or expense, or provision for or benefit from income taxes to these segments for internal reporting purposes, as the Company does not believe that allocating these expenses is beneficial in evaluating segment performance.  Additionally, the Company does not allocate assets to segments for internal reporting purposes as it does not manage its segments by such metrics.\nThe information that is regularly provided to the Company's CODM includes net sales, cost of sales and gross profit for each segment. The following tables include net sales, cost of sales and gross profit for each segment (in millions):\n \nFiscal Year Ended March 31, 2025\nSemiconductor products\nTechnology licensing\nTotal\nNet sales\n$\n4,270.5\n \n$\n131.1\n \n$\n4,401.6\n \nCost of sales\n1,933.7\n \n—\n \n1,933.7\n \nGross profit\n$\n2,336.8\n \n$\n131.1\n \n$\n2,467.9\n \nF-19\nTable of Contents\nFiscal Year Ended March 31, 2024\nSemiconductor products\nTechnology licensing\nTotal\nNet sales\n$\n7,531.1\n \n$\n103.3\n \n$\n7,634.4\n \nCost of sales\n2,638.7\n \n—\n \n2,638.7\n \nGross profit\n$\n4,892.4\n \n$\n103.3\n \n$\n4,995.7\n \nFiscal Year Ended March 31, 2023\nSemiconductor products\nTechnology licensing\nTotal\nNet sales\n$\n8,277.7\n \n$\n161.0\n \n$\n8,438.7\n \nCost of sales\n2,740.8\n \n—\n \n2,740.8\n \nGross profit\n$\n5,536.9\n \n$\n161.0\n \n$\n5,697.9\n \nThe Company sells its products to distributors and OEMs in a broad range of market segments, performs on-going credit evaluations of its customers and, as deemed necessary, may require collateral, primarily letters of credit.  The Company's operations outside the U.S. consist of product assembly and final test facilities in Thailand, and sales and support centers and design centers in certain foreign countries.  Domestic operations are responsible for the design, development and wafer fabrication of products, as well as the coordination of production planning and shipping to meet worldwide customer commitments.  The Company's Thailand assembly and test facility is reimbursed in relation to value added with respect to assembly and test operations and other functions performed, and certain foreign sales offices receive compensation for sales within their territory.  Accordingly, for financial statement purposes, it is not meaningful to segregate sales or operating profits for the assembly and test and foreign sales office operations.  \nIdentifiable long-lived assets (consisting of property, plant and equipment net of accumulated depreciation and ROU assets) by geographic area are as follows (in millions):\nMarch 31,\n2025\n2024\nUnited States\n$\n869.3\n \n$\n826.8\n \nThailand\n123.7\n \n152.2\n \nVarious other countries\n337.0\n \n371.9\n \nTotal long-lived assets\n$\n1,330.0\n \n$\n1,350.9\n \nSales to unaffiliated customers located outside the U.S., primarily in Asia and Europe, aggregated approximately \n75\n%, \n75\n% and \n78\n%\n \nof consolidated net sales for fiscal 2025, fiscal 2024 and fiscal 2023, respectively.  Sales to customers in Europe represented approximately \n20\n%, \n24\n% and \n21\n% of consolidated net sales for fiscal 2025, fiscal 2024 and fiscal 2023, respectively.  Sales into Germany represented approximately 10% of consolidated net sales for fiscal 2024.  Sales to customers in Asia represented approximately \n50\n%, \n47\n% and \n53\n% of consolidated net sales for fiscal 2025, fiscal 2024 and fiscal 2023, respectively.  Within Asia, sales into China represented approximately \n17\n%, \n18\n%, \n21\n% of consolidated net sales for fiscal 2025, fiscal 2024 and fiscal 2023, respectively.  Sales into Taiwan represented approximately \n16\n%, \n12\n% and \n14\n% of consolidated net sales for fiscal 2025, 2024 and 2023, respectively.  Sales into any other individual foreign country did not exceed 10% of the Company's net sales for any of the three fiscal years presented.\n \nWith the exception of Arrow Electronics, the Company's largest distributor, which accounted for \n10\n%, \n12\n% and \n11\n%\n \nof net sales in fiscal 2025, fiscal 2024, and fiscal 2023, respectively, no other distributor or direct customer accounted for more than 10% of net sales in either of fiscal 2025, fiscal 2024 or fiscal 2023.\n \nF-20\nTable of Contents\nNote 4\n. \nNet (Loss) Income Per Common Share\n \nThe following table sets forth the computation of basic and diluted net (loss) income per common share (in millions, except per share amounts):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nNet (loss) income\n$\n(\n0.5\n)\n$\n1,906.9\n \n$\n2,237.7\n \nDividends on Series A Preferred Stock\n(\n2.2\n)\n—\n \n—\n \nNet (loss) income attributable to common stockholders\n(\n2.7\n)\n1,906.9\n \n2,237.7\n \nBasic weighted average common shares outstanding\n537.3\n \n542.0\n \n550.4\n \nDilutive effect of RSUs\n—\n \n5.1\n \n5.2\n \nDilutive effect of 2015 Senior Convertible Debt\n—\n \n0.2\n \n0.6\n \nDilutive effect of 2017 Senior Convertible Debt\n—\n \n0.7\n \n1.0\n \nDilutive effect of 2017 Junior Convertible Debt\n—\n \n—\n \n0.1\n \nDilutive effect of Series A Preferred Stock\n—\n \n—\n \n—\n \nDiluted weighted average common shares outstanding\n537.3\n \n548.0\n \n557.3\n \nBasic net (loss) income per common share\n$\n(\n0.01\n)\n$\n3.52\n \n$\n4.07\n \nDiluted net (loss) income per common share\n$\n(\n0.01\n)\n$\n3.48\n \n$\n4.02\n \nThe Company computed net (loss) income attributable to common stockholders by reducing net (loss) income by the dividends on Series A Preferred Stock accumulated during the period.  The Company computed basic net (loss) income per common share based on the net (loss) income attributable to common stockholders divided by the weighted average number of common shares outstanding during the period.  The Company computed diluted net (loss) income per common share based on the net (loss) income attributable to common stockholders divided by the weighted average number of common shares outstanding plus potentially dilutive common shares outstanding during the period.  \nPotentially dilutive common shares from employee equity incentive plans are determined by applying the treasury stock method to the assumed vesting of outstanding RSUs. Potentially dilutive common shares from the Series A Preferred Stock is determined by applying the if-converted method on the outstanding Series A Preferred Stock.  Prior to conversion of its Convertible Debt, the Company will include, in the diluted net income per common share calculation, the effect of the additional shares that may be issued when the Company's common stock price exceeds the conversion price using the if-converted method.  The Company's Convertible Debt has no impact on diluted net income per common share unless the average price of the Company's common stock exceeds the conversion price because the Company is required to settle the principal amount of the Convertible Debt in cash upon conversion.  For the fiscal year ended March 31, 2025, the calculation of diluted net loss per common share excluded \n4.0\n million common shares from employee equity incentive plans and, \n0.1\n million and \n0.5\n million common shares issuable upon the exchange of the Company's 2015 Senior Convertible Debt and the 2017 Senior Convertible Debt, respectively, and \n0.6\n million common shares issuable upon the exchange of Company's Series A Preferred Stock as the related impact would have been anti-dilutive as the Company generated a net loss. \nThe following is the weighted average conversion price per share used in calculating the dilutive effect (see Note 6 for details on the Convertible Debt):\nFiscal Year Ended March 31,\n2025\n2024\n2023\n2015 Senior Convertible Debt\n(1)\n$\n28.49\n \n$\n29.02\n \n$\n29.58\n \n2017 Senior Convertible Debt\n$\n44.27\n \n$\n45.26\n \n$\n46.14\n \n2020 Senior Convertible Debt\n(2)\n$\n91.08\n \n$\n91.91\n \n$\n92.82\n \n2024 Senior Convertible Debt\n$\n121.83\n \n$\n—\n \n$\n—\n \n2017 Junior Convertible Debt\n(3)\n$\n—\n \n$\n44.81\n \n$\n45.32\n \nF-21\nTable of Contents\n(1) \n \nThe weighted average conversion price per share for the 2015 Senior Convertible Debt was prior to the settlement of the outstanding principal amount in February 2025.\n(2) \n \nThe weighted average conversion price per share for the 2020 Senior Convertible Debt was prior to the settlement of the outstanding principal amount in November 2024.\n(3) \n \nThe weighted average conversion price per share for the 2017 Junior Convertible Debt was prior to the settlement of the outstanding principal amount in May 2023.\nNote 5\n. \nSpecial Charges and Other, Net\n \n \nThe following table summarizes activity included in the \"Special charges (income) and other, net\" caption on the Company's consolidated statements of operations (in millions):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nRestructuring\nEmployee separation costs\n$\n27.1\n \n$\n—\n \n$\n—\n \nContract exit costs\n45.7\n \n—\n \n—\n \nOther restructuring costs\n3.7\n \n6.2\n \n16.8\n \nGain on sale of assets\n—\n \n—\n \n(\n2.2\n)\nLegal contingencies\n1.0\n \n(\n1.3\n)\n(\n19.4\n)\nOther\n1.7\n \n(\n17.2\n)\n0.8\n \nTotal\n$\n79.2\n \n$\n(\n12.3\n)\n$\n(\n4.0\n)\nIn the third and fourth quarters of fiscal 2025, the Company announced restructuring and cost reduction measures, including closure of its Tempe, Arizona wafer fabrication facility, a reduction in headcount at its manufacturing facilities in Oregon, Colorado Springs and the Philippines.  In addition, the Company announced \n10\n% reductions in employee headcount across the Company to decrease its operating expenses, and cancellation or modification of its LTSAs with certain wafer foundries.\nThe Company's restructuring expenses during fiscal 2025 were primarily due to $\n45.7\n million related to contract exit costs and $\n27.1\n million related to employee separation costs.\nDuring fiscal 2024, the Company earned income primarily due to $\n17.2\n million related to the favorable resolution of a previously accrued unclaimed property audit matter and incurred expenses of $\n6.2\n million related to the restructuring costs of acquired and existing wafer fabrication operations to increase operational efficiency.\nDuring fiscal 2023, the Company earned income primarily due to $\n19.4\n million related to the favorable resolution of a previously accrued legal matter partially offset by $\n16.8\n million by restructuring costs of acquired and existing wafer fabrication operations to increase operational efficiency. \nThe following is a roll forward of accrued restructuring and other exit cost charges for the fiscal year ended March 31, 2025 (in millions):\nRestructuring\nEmployee Separation Costs\nContract Exit Costs\nOther\nTotal\nBalance at March 31, 2024\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nCharges\n27.1\n \n45.7\n \n3.7\n \n76.5\n \nPayments\n(\n9.9\n)\n—\n \n(\n3.3\n)\n(\n13.2\n)\nNon-cash - Other\n(\n0.1\n)\n(\n41.1\n)\n—\n \n(\n41.2\n)\nBalance at March 31, 2025\n$\n17.1\n \n$\n4.6\n \n$\n0.4\n \n$\n22.1\n \nCurrent\n$\n19.0\n \nNon-current\n3.1\n \nTotal\n$\n22.1\n \n \nF-22\nTable of Contents\nThe liability for restructuring and other exit costs on the Company's consolidated balance sheet as of March 31, 2025 is $\n22.1\n million of which $\n19.0\n million is included in accrued liabilities and $\n3.1\n million is included in other long-term liabilities.\n \nNote 6\n. \nDebt\n \nDebt obligations included in the consolidated balance sheets consisted of the following (in millions)\n(1)\n:\nCoupon Interest Rate\nEffective Interest Rate\nMarch 31,\n2025\n2024\n2025 Term Loan Facility\n$\n—\n \n$\n750.0\n \nCommercial Paper\n175.0\n \n1,359.0\n \n0.983% 2024 Notes\n(2)\n0.983\n%\n1.1\n%\n—\n \n1,000.0\n \n4.250% 2025 Notes\n(2)\n4.250\n%\n4.6\n%\n1,200.0\n \n1,200.0\n \n4.900% 2028 Notes\n(2)\n4.900\n%\n5.1\n%\n1,000.0\n \n—\n \n5.050% 2029 Notes\n(2)\n5.050\n%\n5.2\n%\n1,000.0\n \n1,000.0\n \n5.050% 2030 Notes\n(2)\n5.050\n%\n5.2\n%\n1,000.0\n \n—\n \nTotal Senior Indebtedness\n(3)\n4,375.0\n \n5,309.0\n \nSenior Subordinated Convertible Debt - Principal Outstanding\n2015 Senior Convertible Debt\n1.625\n%\n1.8\n%\n—\n \n6.7\n \n2017 Senior Convertible Debt\n1.625\n%\n1.8\n%\n38.0\n \n38.0\n \n2020 Senior Convertible Debt\n0.125\n%\n0.5\n%\n—\n \n665.5\n \n2024 Senior Convertible Debt\n0.750\n%\n1.0\n%\n1,250.0\n \n—\n \nTotal Convertible Debt\n1,288.0\n \n710.2\n \nGross long-term debt including current maturities\n5,663.0\n \n6,019.2\n \nLess: Debt discount\n(4)\n(\n13.1\n)\n(\n13.9\n)\nLess: Debt issuance costs\n(5)\n(\n19.5\n)\n(\n5.5\n)\nNet long-term debt including current maturities\n5,630.4\n \n5,999.8\n \nLess: Current maturities\n(6)\n—\n \n(\n999.4\n)\nNet long-term debt\n$\n5,630.4\n \n$\n5,000.4\n \n(1)  \nThe Company had \nno\n outstanding borrowings under the Revolving Credit Facility at March 31, 2025 and at March 31, 2024. \n(2)\n  The 0.983% 2024 Notes matured on September 1, 2024, and prior to maturity interest accrued at a rate of 0.983% per annum, payable semi-annually in arrears on March 1 and September 1 of each year.  The 4.250% 2025 Notes mature on September 1, 2025 and interest accrues at a rate of 4.250% per annum, payable semi-annually in arrears on March 1 and September 1 of each year.  The 4.900% 2028 Notes mature on March 15, 2028 and interest accrues at a rate of 4.900% per annum, payable semi-annually in arrears on March 15 and September 15 of each year.  The 5.050% 2029 Notes mature on March 15, 2029 and interest accrues at a rate of 5.050% per annum, payable semi-annually in arrears on March 15 and September 15 of each year.  The 5.050% 2030 Notes mature on February 15, 2030 and interest accrues at a rate of 5.050% per annum, payable semi-annually in arrears on February 15 and August 15 of each year.\n(3)\n  All outstanding Senior Notes and the Revolving Credit Facility are senior unsecured debt.\n(4) \n \nThe unamortized discount consists of the following (in millions):\n \nMarch 31,\n2025\n2024\nCommercial Paper\n$\n(\n0.1\n)\n$\n(\n3.9\n)\n0.983% 2024 Notes\n—\n \n(\n0.4\n)\n4.250% 2025 Notes\n(\n1.3\n)\n(\n4.4\n)\n4.900% 2028 Notes\n(\n3.3\n)\n—\n \n5.050% 2029 Notes\n(\n4.3\n)\n(\n5.2\n)\n5.050% 2030 Notes\n(\n4.1\n)\n—\n \nTotal unamortized discount\n$\n(\n13.1\n)\n$\n(\n13.9\n)\nF-23\nTable of Contents\n(5)\n \n \nDebt issuance costs consist of the following (in millions):\nMarch 31,\n2025\n2024\n2025 Term Loan Facility\n$\n—\n \n$\n(\n0.7\n)\n0.983% 2024 Notes\n—\n \n(\n0.2\n)\n4.250% 2025 Notes\n(\n0.2\n)\n(\n0.6\n)\n4.900% 2028 Notes\n(\n1.7\n)\n—\n \n5.050% 2029 Notes\n(\n1.8\n)\n(\n2.2\n)\n5.050% 2030 Notes\n(\n1.7\n)\n—\n \n2017 Senior Convertible Debt\n(\n0.1\n)\n(\n0.1\n)\n2020 Senior Convertible Debt\n—\n \n(\n1.7\n)\n2024 Senior Convertible Debt\n(\n14.0\n)\n—\n \nTotal debt issuance costs\n$\n(\n19.5\n)\n$\n(\n5.5\n)\n(6)\n  As of March 31, 2025, the outstanding Commercial Paper which matures within the three months ending June 30, 2025, and the 4.250% 2025 Notes which matures on September 1, 2025, were excluded from current maturities as the Company has the intent and ability to utilize proceeds from its Revolving Credit Facility to refinance such notes on a long-term basis.  As of March 31, 2024, current maturities consisted of the 0.983% 2024 Notes.  As of March 31, 2024, the outstanding Commercial Paper which matured within the three months ended June 30, 2024, and the 2020 Senior Convertible Debt were excluded from current maturities as the Company had the intent and ability to utilize proceeds from its Revolving Credit Facility to refinance such notes on a long-term basis.  As of March 31, 2024, the 2015 Senior Convertible Debt and the 2017 Senior Convertible Debt were convertible and were excluded from current maturities as the Company had the intent and ability to utilize proceeds from its Revolving Credit Facility to settle the principal portion of its Convertible Debt upon conversion.\nExpected maturities relating to the Company’s debt obligations based on the contractual maturity dates as of March 31, 2025, are as follows (in millions):\nFiscal year ending March 31,\nAmount\n2026\n$\n1,375.0\n \n2027\n38.0\n \n2028\n1,000.0\n \n2029\n1,000.0\n \n2030\n1,000.0\n \nThereafter\n1,250.0\n \nTotal\n$\n5,663.0\n \nRanking of Convertible Debt\n - Each series of Convertible Debt is an unsecured obligation which is subordinated in right of payment to the amounts outstanding under the Company's Senior Indebtedness.  The Senior Subordinated Convertible Debt is subordinated to the Senior Indebtedness; ranks senior to the Company's indebtedness that is expressly subordinated in right of payment to it; ranks equal in right of payment to any of the Company's unsubordinated indebtedness that does not provide that it is senior to the Senior Subordinated Convertible Debt; ranks junior in right of payment to any of the Company's secured and unsecured unsubordinated indebtedness to the extent of the value of the assets securing such indebtedness; and is structurally subordinated to all indebtedness and other liabilities of the Company's subsidiaries. \nSummary of Conversion Features\n - On April 1, 2022, the Company irrevocably elected cash settlement for the principal amount of its Convertible Debt.  Each series of Convertible Debt is convertible, subject to certain conditions, into cash, shares of the Company's common stock or a combination thereof, at the Company's election, at specified conversion rates (see table below), adjusted for certain events including the declaration of cash dividends.  Except during the three-month period immediately preceding the maturity date of the applicable series of Convertible Debt, each series of Convertible Debt is convertible only upon the occurrence of (i) such time as the closing price of the Company's common stock exceeds the applicable conversion price (see table below) by \n130\n% for \n20\n trading days (whether or not consecutive) during a period of \n30\n consecutive trading days ending on the last trading day of the immediately preceding fiscal quarter, (ii) during the \n5\n business day period after any \n10\n consecutive trading day period, or the measurement period, in which the trading price per $\n1,000\n principal amount of notes of a given series for each trading day of the measurement period was less than \n98\n% of the product \nF-24\nTable of Contents\nof the last reported sale price of the Company's common stock and the applicable conversion rate on each such trading day, or (iii) upon the occurrence of certain corporate events specified in the indenture of such series of Convertible Debt.  In addition, for each series, with the exception of the 2024 Senior Convertible Debt, if at the time of conversion the applicable price of the Company's common stock exceeds the applicable conversion price at such time, the applicable conversion rate will be increased by up to an additional maximum incremental shares rate, as determined pursuant to a formula specified in the indenture for the applicable series of Convertible Debt, and as adjusted for cash dividends paid since the issuance of such series of Convertible Debt.  However, in no event will the applicable conversion rate exceed the applicable maximum conversion rate specified in the indenture for the applicable series of Convertible Debt (see table below).  \nThe following table sets forth the applicable conversion rates adjusted for dividends declared since issuance of such series of Convertible Debt and the applicable incremental share factors and maximum conversion rates as adjusted for dividends paid since the applicable issuance date:\nDividend adjusted rates as of March 31, 2025\nConversion Rate\nApproximate Conversion Price\nIncremental Share Factor\nMaximum Conversion Rate\n2017 Senior Convertible Debt\n(1)\n22.8256\n \n$\n43.81\n \n11.4137\n \n32.5264\n \n2024 Senior Convertible Debt\n(1)\n8.2086\n \n$\n121.82\n \n—\n \n10.4659\n \n(1)  \nAs of March 31, 2025, the 2017 Senior Convertible Debt and the 2024 Senior Convertible Debt were not convertible.\n \nWith the exception of the 2024 Senior Convertible Debt, which may be redeemed by the Company on or after June 5, 2027, the Company may not redeem any series of Convertible Debt prior to the relevant maturity date and no sinking fund is provided for any series of Convertible Debt.  Under the terms of the applicable indenture, the Company may repurchase any series of Convertible Debt in the open market or through privately negotiated exchange offers.  Upon the occurrence of a fundamental change, as defined in the applicable indenture of such series of Convertible Debt, holders of such series may require the Company to purchase all or a portion of their Convertible Debt for cash at a price equal to \n100\n% of the principal amount plus any accrued and unpaid interest. \nInterest expense consists of the following (in millions):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nDebt issuance cost amortization\n$\n3.6\n \n$\n4.5\n \n$\n6.8\n \nDebt discount amortization\n64.8\n \n37.5\n \n7.2\n \nInterest expense\n172.2\n \n147.3\n \n179.3\n \nTotal interest expense on Senior Indebtedness\n240.6\n \n189.3\n \n193.3\n \nDebt issuance cost amortization\n4.2\n \n2.8\n \n2.7\n \nCoupon interest expense\n8.9\n \n1.7\n \n2.9\n \nTotal interest expense on Convertible Debt\n13.1\n \n4.5\n \n5.6\n \nOther interest expense\n5.5\n \n4.5\n \n5.0\n \nTotal interest expense \n$\n259.2\n \n$\n198.3\n \n$\n203.9\n \nF-25\nTable of Contents\nThe Company's debt settlement transactions consist of the following (in millions):\nPrincipal Amount Settled\nTotal Cash Consideration\nNet Loss on Inducements and Settlements\nMarch 2025\n(1)\nRevolving Credit Facility\n$\n—\n \n$\n—\n \n$\n1.4\n \nFebruary 2025\n(2)\n2015 Senior Convertible Debt\n$\n0.4\n \n$\n0.4\n \n$\n—\n \nDecember 2024\n(3)\n2025 Term Loan Facility\n$\n750.0\n \n$\n750.0\n \n$\n0.3\n \nNovember 2024\n(4)\n2020 Senior Convertible Debt\n$\n665.5\n \n$\n665.5\n \n$\n—\n \nSeptember 2024\n(4)\n0.983% 2024 Notes\n$\n1,000.0\n \n$\n1,000.0\n \n$\n—\n \nFebruary 2024\n(5)\n0.972% 2024 Notes\n$\n1,400.0\n \n$\n1,400.0\n \n$\n—\n \nSeptember 2023\n(6)\n2.670% 2023 Notes\n$\n1,000.0\n \n$\n1,000.0\n \n$\n—\n \nAugust 2023\n(7)\n2017 Senior Convertible Debt\n$\n18.2\n \n$\n42.7\n \n$\n3.1\n \nJune 2023\n(8)\n4.333% 2023 Notes\n$\n1,000.0\n \n$\n1,000.0\n \n$\n—\n \nMay 2023\n(7)\n2015 Senior Convertible Debt\n$\n5.6\n \n$\n18.9\n \n$\n0.4\n \n2017 Senior Convertible Debt\n$\n25.9\n \n$\n56.3\n \n$\n6.6\n \n2017 Junior Convertible Debt\n$\n6.5\n \n$\n14.9\n \n$\n2.1\n \nAugust 2022\n(2)(7)\n2015 Senior Convertible Debt\n$\n22.0\n \n$\n67.7\n \n$\n1.3\n \n2017 Senior Convertible Debt\n$\n14.9\n \n$\n29.2\n \n$\n0.8\n \nMay 2022\n(2)(7)\n2017 Senior Convertible Debt\n$\n31.0\n \n$\n65.3\n \n$\n5.9\n \n2017 Junior Convertible Debt\n$\n3.6\n \n$\n8.2\n \n$\n0.3\n \n(1)  \nIn connection with the amendment and restatement of its Credit Agreement, the Company recognized a loss on settlement of debt of $\n1.4\n million.\n(2)  \nThe Company used cash generated from operations to finance a portion of such settlement. \n(3)  \nThe Company used proceeds from the issuance of 4.900% 2028 Notes and 5.050% 2030 Notes to finance such settlement.\n(4)  \nThe Company used proceeds from the issuance of Commercial Paper to finance such settlement.\n(5)  \nThe Company used proceeds from the issuance of Commercial Paper and borrowings under its Revolving Credit Facility to finance such settlement.\n(6)  \nThe Company used borrowings under its 2025 Term Loan Facility and its Revolving Credit Facility to finance the settlement.\n(7)  \nThe Company settled portions of its convertible debt in privately negotiated transactions that are accounted for as induced conversions.\n(8)  \nThe Company used borrowings under its Revolving Credit Facility to finance a portion of such settlement.\nF-26\nTable of Contents\nSenior Credit Facilities\n In November 2024, the amended and restated Credit Agreement, dated as of December 16, 2021 (as amended by the first incremental term loan amendment, dated as of August 31, 2023), was amended to amend the maximum total leverage ratio financial covenant for the quarterly periods ending on December 31, 2024 through December 31, 2025 to \n4.75\n to 1.00.\nIn March 2025, the Company entered into a Second Amended and Restated Credit Agreement pursuant to which the Amended and Restated Credit Agreement, dated as of December 16, 2021, was amended and restated in its entirety.  The Second Amended and Restated Credit Agreement provides for an unsecured revolving loan facility in an aggregate principal amount of up to $\n2.25\n billion in addition to certain other sublimit loans that terminates on March 25, 2030.  The Credit Agreement also permits the Company, subject to certain conditions, to add one or more incremental term loan facilities and/or increase the revolving loan commitments up to $\n1.00\n billion subject, in each case, to the receipt of additional commitments from existing and/or new lenders and pro forma compliance with the financial covenants as set forth in the Second Amended and Restated Credit Agreement.\nThe Second Amended and Restated Credit Agreement amended the maximum total leverage ratio financial covenant to the following: \n5.50\n to 1.00 for period ending March 31, 2025, \n5.50\n to 1.00 for period ending June 30, 2025, \n6.25\n to 1.00 for period ending September 30, 2025, \n5.75\n to 1.00 for period ending December 31, 2025, \n4.75\n to 1.00 for period ending March 31, 2026, \n4.00\n to 1.00 for period ending June 30, 2026, \n3.75\n to 1.00 for period ending September 30, 2026, and \n3.50\n to 1.00 for any such period ended after the Restatement Effective Date that is not a period ending during the Covenant Relief Period.  The Covenant Relief Period means the period following the Restatement Effective Date to (but excluding) the earlier of (a) December 31, 2026 and (b) the date in which the Total Leverage Ratio for the most recently ended fiscal quarter shall not exceed \n3.50\n to 1.00 and certain other conditions are satisfied.\nThe revolving loans bear interest, at the Company’s option, at the base rate plus a spread of \n0.00\n% to \n0.50\n%, an adjusted daily simple SOFR rate (or SONIA rate in the case of loans denominated in pounds sterling) plus a spread of \n0.875\n% to \n1.50\n%, or an adjusted term SOFR or adjusted EURIBOR rate (based on one, three or six-month interest periods) plus a spread of \n0.875\n% to \n1.50\n%, in each case, with such spread being determined based on the credit ratings for certain of the Company’s senior, unsecured debt.  The base rate means the highest of the prime rate, the federal funds rate plus a margin equal to \n0.50\n% and the adjusted term SOFR rate for a one-month interest period plus a margin equal to \n1.00\n%.  Interest is due and payable in arrears quarterly for loans bearing interest at the base rate and at the end of an interest period (or at each three-month interval in the case of loans with interest periods greater than three months) in the case of loans bearing interest at the adjusted term SOFR or adjusted EURIBOR rates.\n \n \nThe Company's obligations under the Second Amended and Restated Credit Agreement are guaranteed by certain of its subsidiaries meeting materiality thresholds.  The Second Amended and Restated Credit Agreement contains customary affirmative and negative covenants, including covenants that limit or restrict the Company and its subsidiaries' ability to, among other things, incur subsidiary indebtedness, grant liens, merge or consolidate, dispose of substantially all assets of the Company and its subsidiaries, taken as a whole, make investments, make acquisitions, enter into certain transactions with affiliates, pay dividends or make distributions, repurchase stock and enter into restrictive agreements, in each case subject to customary exceptions for a credit facility of this size and type.  Upon satisfaction of certain conditions specified in the Second Amended and Restated Credit Agreement and at the Company's election, certain of such negative covenants in the Second Amended and Restated Credit Agreement shall no longer apply.  The Company is also required to maintain compliance with a total leverage ratio and an interest coverage ratio, all measured quarterly and calculated on a consolidated basis.  As of March 31, 2025, the Company was in compliance with these financial covenants. \nIn August 2023, the Amended and Restated Credit Agreement, dated as of December 16, 2021, was amended by the first incremental term loan amendment, dated as of August 31, 2023.  Pursuant to this amendment, the Company borrowed an aggregate principal amount of $\n750.0\n million under the new 2025 Term Loan Facility bearing interest at the Adjusted Term SOFR Rate, plus a margin of \n1.125\n% to \n1.5\n%, or Alternate Base Rate, plus a margin of \n0.125\n% to \n0.5\n%, with a maturity date of August 31, 2025, which was fully repaid in December 2024.\nConvertible Debt\nIn May 2024, the Company issued $\n1.25\n billion aggregate principal amount of 2024 Senior Convertible Debt and incurred issuance costs of $\n16.5\n million.  Interest on the 2024 Senior Convertible Debt is payable semi-annually in arrears on June 1 and December 1.  The 2024 Senior Convertible Debt will mature on June 1, 2030 unless redeemed, repurchased or converted. \nF-27\nTable of Contents\nIn connection with the issuance of the 2024 Senior Convertible Debt, the Company entered into capped call option transactions with several financial institutions at a cost of $\n105.0\n million.  The capped call options cover, subject to anti-dilution adjustments, the number of shares of the Company's common stock initially underlying the 2024 Senior Convertible Debt.  Upon conversion of the 2024 Senior Convertible Debt, the Company may exercise the capped call options subject to a cap price of $\n167.23\n per share, subject to certain adjustments under the terms of the capped call options, which are generally expected to reduce the potential dilution to the Company's common stock upon conversion of the 2024 Senior Convertible Debt and/or offset any cash payments the Company is required to make in excess of the principal amount of converted 2024 Senior Convertible Debt.  Upon conversion of the 2024 Senior Convertible Debt, there will be no economic dilution from the 2024 Senior Convertible Debt until the average market price of the Company's common stock exceeds the cap price of $\n167.23\n per share as the exercise of the capped call options will offset any dilution from the 2024 Senior Convertible Debt from the conversion price up to the cap price.  As these transactions meet certain accounting criteria, the capped call options are recorded as a reduction of stockholders' equity and are not accounted for as derivatives.\n \nCommercial Paper\nIn September 2023, the Company established a Commercial Paper program under which the Company may issue short-term unsecured promissory notes up to a maximum principal amount outstanding at any time of $\n2.75\n billion with a maturity of up to \n397\n days from the date of issue.  The Company's obligations with respect to the payment of the Commercial Paper are guaranteed by certain of its subsidiaries.  The Commercial Paper will be sold at a discount from par or alternatively, will be sold at par and bear interest rates that will vary based on market conditions and the time of issuance.  The Company's intention is to reduce the amounts that would otherwise be available to borrow under the Company's Revolving Credit Facility by the outstanding amount of Commercial Paper.  As of March 31, 2025, the Company had $\n175.0\n million of principal amount of Commercial Paper outstanding.  The weighted-average interest rate of the Company's outstanding Commercial Paper was \n4.58\n% as of March 31, 2025.  Pursuant to the Second Amended and Restated Credit Agreement in March 2025, the maximum principal amount outstanding at any time under the Commercial Paper program was updated to $\n2.25\n billion. \nSenior Notes\nThe Company may, at its option, redeem some or all of the applicable series of Senior Notes in the manner set forth in the indenture governing the applicable series of Senior Notes.  If the Company experiences a specific change of control triggering event set forth in the indenture governing the applicable series of Senior Notes, the Company must offer to repurchase each of the notes of such series at a price equal to \n101\n% of the principal amount of each of the notes of such series repurchased, plus accrued and unpaid interest, if any, but excluding, the repurchase date. \nEach indenture governing the applicable series of Senior Notes contain certain customary affirmative and negative covenants, including covenants that limit or restrict the Company and its subsidiaries' ability to, among other things, create or incur certain liens, and enter into sale and leaseback transactions, and consolidate with or merge with or into, or convey, transfer or lease all or substantially all of its assets, to another person.  These covenants are subject to a number of limitations and exceptions set forth in the indenture governing the applicable series of Senior Notes.\nEach series of Senior Notes is guaranteed by certain of the Company's subsidiaries that have also guaranteed the obligation under the Second Amended and Restated Credit Agreement and the Company's existing Senior Indebtedness.  In the future, each subsidiary of the Company that is a guarantor or other obligor of the Second Amended and Restated Credit Agreement is required to guarantee each series of Senior Notes.\n4.900% 2028 Notes and 5.050% 2030 Notes\nIn December 2024, the Company issued $\n1.00\n billion aggregate principal amount of 4.900% 2028 Notes and $\n1.00\n billion aggregate principal amount of 5.050% 2030 Notes in a public offering.  In connection with the issuance of the 4.900% 2028 Notes and 5.050% 2030 Notes, the Company incurred issuance costs of approximately $\n1.8\n million for each series of notes and recorded a debt discount of $\n3.6\n million and $\n4.3\n million, respectively, which includes fees deducted from the proceeds, which will both be amortized using the effective interest method over the term of the debts.  \nThe Company may, at its option, redeem some or all of the 4.900% 2028 Notes at any time, at a redemption price equal to the greater of (a) the sum of the present values of the remaining scheduled payments of principal and interest discounted as defined in the indenture governing the terms of the 4.900% 2028 Notes (the 4.900% 2028 Notes Indenture), plus \n15\n basis points less interest accrued to the date of redemption, and (b) \n100\n% of the principal amount of the 4.900% 2028 Notes to be redeemed, plus, in either case, accrued and unpaid interest to, but excluding, the redemption date.\nF-28\nTable of Contents\nPrior to January 15, 2030 (Par Call Date) the Company may, at its option, redeem some or all of the 5.050% 2030 Notes at a redemption price equal to the greater of (a) the sum of the present values of the remaining scheduled payments of principal and interest discounted as defined in the indenture governing the terms of the 5.050% 2030 Notes (the 5.050% 2030 Notes Indenture), plus \n15\n basis points less interest accrued to the date of redemption, and (b) \n100\n% of the principal amount of the 5.050% 2030 Notes to be redeemed, plus, in either case, accrued and unpaid interest, but excluding, the redemption date.  On or after the Par Call Date, the Company may redeem the 5.050% 2030 Notes, in whole or in part, at any time at a redemption price equal to \n100\n% of the principal amount of the 5.050% 2030 Notes being redeemed, plus any accrued and unpaid interest to, but excluding, the redemption date.\nIf the Company experiences a specific change of control triggering event with respect to the 4.900% 2028 Notes or the 5.050% 2030 Notes, as applicable, the Company must offer to repurchase such 4.900% 2028 Notes or 5.050% 2030 Notes at a price equal to \n101\n% of the principal amount of the Notes repurchased, plus any accrued and unpaid interest to, but excluding, the repurchase date.\nThe 4.900% 2028 Notes Indenture and the 5.050% 2030 Notes Indenture contain certain customary affirmative and negative covenants, including covenants that limit or restrict the Company and its subsidiaries' ability to, among other things, create or incur certain liens, enter into sale and leaseback transactions, and consolidate with or merge with or into, or convey, transfer or lease all or substantially all of its assets.  These covenants are subject to a number of limitations and exceptions set forth in the 4.900% 2028 Notes Indenture and the 5.050% 2030 Notes Indenture.\nThe 4.900% 2028 Notes and 5.050% 2030 Notes are guaranteed by certain of the Company's subsidiaries that have also guaranteed the obligation under the Second Amended and Restated Credit Agreement.\nNote 7\n. \nFair Value of Financial Instruments\n \nFair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants.  As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability.  As a basis for considering such assumptions, the Company utilizes a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows:\nLevel 1-\nObservable inputs such as quoted prices in active markets;\nLevel 2-\nInputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3-\nUnobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\n \nThe carrying amount of cash equivalents, which include money market funds, approximates fair value because their maturity is less than three months.  The Company held $\n491.1\n million of cash and cash equivalents in the form of money-market funds as of March 31, 2025.  The amount of cash and cash equivalents held by the Company in the form of money-market funds as of March 31, 2024 was \nnot\n material.  The carrying amount of accounts receivable, accounts payable and accrued liabilities approximates fair value due to the short-term maturity of the amounts and are considered Level 2 in the fair value hierarchy.  \nThe fair value of the Company's 2025 Term Loan Facility, and the Commercial Paper, is estimated using discounted cash flow analysis, based on the Company's current incremental borrowing rates for similar types of borrowing arrangements.  Based on the borrowing rates currently available to the Company for bank loans with similar terms and average maturities, the fair value of the Company's Commercial Paper at March 31, 2025 approximated the carrying value excluding debt discounts and debt issuance costs and are considered Level 2 in the fair value hierarchy.  The Company measures the fair value of its Convertible Debt and Senior Notes for disclosure purposes.  These fair values are based on observable market prices for this debt, which is traded in less active markets and are therefore classified as a Level 2 fair value measurement.  \nF-29\nTable of Contents\nThe following table shows the carrying amounts and fair values of the Company's debt obligations (in millions):\nMarch 31,\n2025\n2024\nCarrying Amount\n(1)\nFair Value\nCarrying Amount\n(1)\nFair Value\n2025 Term Loan Facility\n$\n—\n \n$\n—\n \n$\n749.3\n \n$\n750.0\n \nCommercial Paper\n174.9\n \n175.0\n \n1,355.1\n \n1,359.0\n \n0.983% 2024 Notes\n—\n \n—\n \n999.4\n \n979.6\n \n4.250% 2025 Notes\n1,198.5\n \n1,196.9\n \n1,195.0\n \n1,181.8\n \n4.900% 2028 Notes\n995.0\n \n1,002.5\n \n—\n \n—\n \n5.050% 2029 Notes\n993.9\n \n1,005.8\n \n992.6\n \n1,000.6\n \n5.050% 2030 Notes\n994.2\n \n996.9\n \n—\n \n—\n \n2015 Senior Convertible Debt\n—\n \n—\n \n6.7\n \n25.6\n \n2017 Senior Convertible Debt\n37.9\n \n57.7\n \n37.9\n \n101.3\n \n2020 Senior Convertible Debt\n—\n \n—\n \n663.8\n \n708.8\n \n2024 Senior Convertible Debt\n1,236.0\n \n1,173.4\n \n—\n \n—\n \nTotal\n$\n5,630.4\n \n$\n5,608.2\n \n$\n5,999.8\n \n$\n6,106.7\n \n(1) \n The carrying amounts presented are net of debt discounts and debt issuance costs (see Note 6 for further information).\nNote 8\n. \nIntangible Assets and Goodwill\n \nNet amounts excluding fully amortized intangible assets, consist of the following (in millions):\nMarch 31, 2025\nGross Amount\nAccumulated Amortization\nNet Amount\nCore and developed technology\n$\n7,149.9\n \n$\n(\n4,981.6\n)\n$\n2,168.3\n \nCustomer-related\n199.5\n \n(\n152.8\n)\n46.7\n \nIn-process research and development\n50.8\n \n— \n50.8\n \nSoftware licenses\n259.3\n \n(\n136.1\n)\n123.2\n \nTotal\n$\n7,659.5\n \n$\n(\n5,270.5\n)\n$\n2,389.0\n \nMarch 31, 2024\nGross Amount\nAccumulated Amortization\nNet Amount\nCore and developed technology\n$\n7,221.3\n \n$\n(\n4,590.9\n)\n$\n2,630.4\n \nCustomer-related\n196.7\n \n(\n140.8\n)\n55.9\n \nSoftware licenses\n230.7\n \n(\n135.2\n)\n95.5\n \nTotal\n$\n7,648.7\n \n$\n(\n4,866.9\n)\n$\n2,781.8\n \nDuring the twelve months ended March 31, 2025, due to acquisitions, the Company acquired $\n50.8\n million of in-process research and development, $\n2.8\n million of customer-related intangible assets, and $\n1.1\n million of software licenses intangible assets.  \nThe following is an expected amortization schedule for the intangible assets for the fiscal 2026 through fiscal 2030, absent any future acquisitions or impairment charges (in millions):  \nFiscal Year Ending March 31,\nAmortization Expense\n2026\n$\n520.8\n \n2027\n$\n423.7\n \n2028\n$\n313.9\n \n2029\n$\n240.4\n \n2030\n$\n236.7\n \nF-30\nTable of Contents\nThe Company amortizes intangible assets over their expected useful lives, which range between \n1\n and \n15\n years.  \nAmortization expense attributed to intangible assets are assigned to cost of sales and operating expenses as follows (in millions): \nFiscal Year Ended March 31,\n2025\n2024\n2023\nAmortization expense charged to cost of sales\n$\n18.5\n \n$\n12.2\n \n$\n15.8\n \nAmortization expense charged to operating expense\n565.8\n \n676.9\n \n737.9\n \nTotal amortization expense\n$\n584.3\n \n$\n689.1\n \n$\n753.7\n \nGoodwill activity by segment was as follows (in millions):\n \nSemiconductor Products Reporting Unit\nTechnology Licensing Reporting Unit\nBalance at March 31, 2023\n$\n6,654.4\n \n$\n19.2\n \nAdditions\n1.8\n \n—\n \nBalance at March 31, 2024\n$\n6,656.2\n \n$\n19.2\n \nAdditions\n9.4\n \n—\n \nBalance at March 31, 2025\n$\n6,665.6\n \n$\n19.2\n \nAt March 31, 2025, the Company applied a qualitative goodwill impairment test to its \ntwo\n reporting units, and concluded that goodwill was not impaired.  Through March 31, 2025, the Company has never recorded a goodwill impairment charge.\nNote 9\n. \nOther Financial Statement Details\n \nAccounts Receivable\n \nAccounts receivable consists of the following (in millions):\n \nMarch 31,\nMarch 31,\n2025\n2024\nTrade accounts receivable\n$\n684.1\n \n$\n1,141.7\n \nOther\n11.5\n \n10.1\n \nTotal accounts receivable, gross\n695.6\n \n1,151.8\n \nLess: allowance for expected credit losses\n5.9\n \n8.1\n \nTotal accounts receivable, net\n$\n689.7\n \n$\n1,143.7\n \nThe Company had a program to sell certain of its trade accounts receivable on a non-recourse basis to a third-party financial institution pursuant to a factoring arrangement.  The Company accounted for these transactions as sales of receivables and presents cash proceeds as cash provided by operating activities in the consolidated statements of cash flows.  Total trade accounts receivable sold under the factoring arrangement were $\n64.9\n million\n \nin\n \nfiscal 2024.  The Company terminated this program in September 2024.\nInventories\nThe components of inventories consist of the following (in millions):\n \nMarch 31,\nMarch 31,\n2025\n2024\nRaw materials\n$\n174.8\n \n$\n184.0\n \nWork in process\n857.6\n \n797.5\n \nFinished goods\n261.1\n \n334.5\n \nTotal inventories\n$\n1,293.5\n \n$\n1,316.0\n \nF-31\nTable of Contents\nProperty, Plant and Equipment\nProperty, plant and equipment consists of the following (in millions):\n \nMarch 31,\nMarch 31,\n2025\n2024\nLand\n$\n84.8\n \n$\n89.3\n \nBuilding and building improvements\n705.9\n \n796.3\n \nMachinery and equipment\n2,311.3\n \n2,778.1\n \nProjects in process\n424.1\n \n349.6\n \nTotal property, plant and equipment, gross\n3,526.1\n \n4,013.3\n \nLess: accumulated depreciation and amortization\n2,342.4\n \n2,818.7\n \nTotal property, plant and equipment, net\n$\n1,183.7\n \n$\n1,194.6\n \n \nDepreciation expense attributed to property, plant and equipment was $\n165.8\n million, $\n190.4\n million and $\n244.7\n million for the fiscal years ended March 31, 2025, 2024 and 2023, respectively.  The changes in depreciation expense in the fiscal years ended March 31, 2025, and 2024, includes the impact of lower production levels, slowing business activity and delays in placing assets into service.  As of March 31, 2025, the Company recorded $\n46.4\n million of capital-related grants for qualifying capital expenditures as a reduction to property, plant and equipment, compared to $\n126.5\n million as of March 31, 2024.  The change in the amounts recorded for capital-related grants in the fiscal year ended March 31, 2025 compared to fiscal year ended March 31, 2024 was because the credits are no longer reasonably assured of being earned based on the delays in placing assets into service.  The release involved reclassifying balances from other assets to property, plant and equipment and the effect to the statement of operations was immaterial.  \nThe Company reviews and evaluates its long-lived assets for impairment when events or changes in circumstances indicate that the related carrying amount of such assets may not be recoverable.  For each of the fiscal years ended March 31, 2025, 2024 and 2023, the Company’s evaluation of its property, plant and equipment did not result in any material impairments. \nAccrued Liabilities\nAccrued liabilities consists of the following (in millions):\n \nMarch 31,\nMarch 31,\n2025\n2024\nAccrued compensation and benefits\n$\n108.1\n \n$\n117.8\n \nIncome taxes payable\n99.1\n \n90.8\n \nDeferred revenue\n213.4\n \n261.8\n \nSales related reserves\n329.7\n \n580.6\n \nCurrent portion of lease liabilities\n35.7\n \n32.6\n \nAccrued expenses and other liabilities\n208.5\n \n223.4\n \nTotal accrued liabilities\n$\n994.5\n \n$\n1,307.0\n \nNote 10\n. \nLeases\n \nOperating lease arrangements are comprised primarily of real estate and equipment agreements for which the ROU assets are included in other assets and the corresponding lease liabilities, depending on their maturity, are included in accrued liabilities or other long-term liabilities in the consolidated balance sheets.  There are certain immaterial finance leases recorded in the consolidated balance sheets.  The Company has elected to account for the lease and non-lease components as a single lease component\n.\nF-32\nTable of Contents\nThe Company's leases are included as a component of the following balance sheet lines (in millions):\nMarch 31,\n2025\n2024\nOther assets:\nROU assets\n$\n146.3\n \n$\n156.3\n \nTotal lease assets\n$\n146.3\n \n$\n156.3\n \nAccrued liabilities:\nCurrent portion of lease liabilities\n$\n35.7\n \n$\n32.6\n \nOther long-term liabilities:\nNon-current portion of lease liabilities\n115.1\n \n128.7\n \nTotal lease liabilities\n$\n150.8\n \n$\n161.3\n \nThe following table presents the maturities of lease liabilities as of March 31, 2025 (in millions):\nFiscal year ending March 31,\nOperating Leases\n2026\n$\n43.0\n \n2027\n39.7\n \n2028\n28.8\n \n2029\n18.7\n \n2030\n15.5\n \nThereafter\n25.2\n \nTotal lease payments\n170.9\n \nLess: Imputed lease interests\n20.1\n \nTotal lease liabilities\n$\n150.8\n \nThe Company's weighted-average remaining lease-term and weighted-average discount rate at March 31, 2025 are as follows:\nWeighted average remaining lease-term (years)\n4.90\nWeighted average discount rate\n4.55\n \n%\nThe Company's total lease expense is as follows (in millions): \n \nFiscal Year Ended March 31,\n2025\n2024\n2023\nOperating lease expense\n$\n61.8\n \n$\n60.4\n \n$\n56.6\n \nNote 11\n. \nCommitments and Contingencies\nPurchase Commitments\nThe Company's purchase commitments primarily consist of agreements for the purchase of goods and services including wafer purchase obligations with the Company's wafer foundries, and manufacturing supply capacity reservation commitments.\nTotal purchase commitments as of March 31, 2025, are as follows (in millions):\nFiscal Year Ending March 31,\nPurchase Commitments\n2026\n$\n221.6\n \n2027\n129.9\n \n2028\n112.5\n \n2029\n64.3\n \n2030\n70.5\n \nThereafter\n72.1\n \nTotal\n$\n670.9\n \nF-33\nTable of Contents\nIndemnification Contingencies\nThe Company's technology license agreements generally include an indemnification clause that indemnifies the licensee against liability and damages (including legal defense costs) arising from any claims of patent, copyright, trademark or trade secret infringement by the Company's proprietary technology.  The terms of these indemnification provisions approximate the terms of the outgoing technology license agreements, which are typically perpetual unless terminated by either party for breach.  The possible amount of future payments the Company could be required to make based on agreements that specify indemnification limits, if such indemnifications were required on all of these agreements, is approximately $\n195.0\n million.  There are some licensing agreements in place that do not specify indemnification limits.  As of March 31, 2025, the Company had not recorded any liabilities related to these indemnification obligations and the Company believes that any amounts that it may be required to pay under these agreements in the future will not have a material adverse effect on its financial position, cash flows or results of operations.\nWarranty Costs and Product Liabilities\nThe Company accrues for known product-related claims if a loss is probable and can be reasonably estimated.  During the periods presented, there have been no material accruals or payments regarding product warranty or product liability.  Historically, the Company has experienced a low rate of payments on product claims.  Although the Company cannot predict the likelihood or amount of any future claims, the Company does not believe these claims will have a material adverse effect on its financial condition, results of operations or liquidity. \nLegal Matters\nIn the ordinary course of the Company's business, it is exposed to various legal actions as a result of contracts, product liability, customer claims, pricing or royalty disputes with customers and licensees, governmental investigations and other matters.  The Company is involved in a limited number of these legal actions, both as plaintiff and defendant, with respect to the foregoing types of matters.  Consequently, the Company could incur uninsured liability in any of these legal actions.  The Company also periodically receives notifications from various third parties alleging infringement of patents or other intellectual property rights, or from customers requesting reimbursement for various costs.  With respect to pending legal actions to which the Company is a party and other claims, although the outcomes are generally not determinable, the Company believes that the ultimate resolution of these matters (other than certain tax matters in the U.S., Germany, and Malaysia as described in Note 12 below) will not have a material adverse effect on its financial position, cash flows or results of operations.  Litigation, governmental investigations and disputes relating to the semiconductor industry are not uncommon, and the Company is, from time to time, subject to such litigation, governmental investigations and disputes.  As a result, no assurances can be given with respect to the extent or outcome of any such litigation, governmental investigations or disputes in the future. \nThe Company accrues for claims and contingencies when losses become probable and reasonably estimable.  As of the end of each applicable reporting period, the Company reviews each of its matters and, where it is probable that a liability has been or will be incurred, the Company accrues for all probable and reasonably estimable losses.  Where the Company can reasonably estimate a range of losses it may incur regarding such a matter, the Company records an accrual for the amount within the range that constitutes its best estimate.  If the Company can reasonably estimate a range but no amount within the range appears to be a better estimate than any other, the Company uses the amount that is the low end of such range.  As of March 31, 2025, the Company's estimate of the aggregate potential liability for legal matters that is possible but not probable is approximately $\n25.0\n million in excess of amounts accrued.\nF-34\nTable of Contents\nNote 12\n. \nIncome Taxes\n \n \nThe income tax provision (benefit) consists of the following (amounts in millions):\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nIncome before income taxes:\nU.S.\n$\n(\n131.5\n)\n$\n555.5\n \n$\n674.7\n \nForeign\n170.4\n \n1,810.4\n \n2,235.0\n \nTotal income before income taxes\n$\n38.9\n \n$\n2,365.9\n \n$\n2,909.7\n \nCurrent provision:\n \n \n \nU.S. Federal\n$\n127.5\n \n$\n347.5\n \n$\n389.5\n \nState\n—\n \n20.0\n \n5.0\n \nForeign\n55.2\n \n118.7\n \n72.0\n \nTotal current provision\n$\n182.7\n \n$\n486.2\n \n$\n466.5\n \nDeferred provision (benefit):\n \n \n \nU.S. Federal\n$\n(\n101.0\n)\n$\n(\n106.4\n)\n$\n53.7\n \nState\n(\n5.5\n)\n(\n12.3\n)\n4.6\n \nForeign\n(\n36.8\n)\n91.5\n \n147.2\n \nTotal deferred provision (benefit)\n(\n143.3\n)\n(\n27.2\n)\n205.5\n \nIncome tax provision\n$\n39.4\n \n$\n459.0\n \n$\n672.0\n \nThe provision (benefit) for income taxes differs from the amount computed by applying the statutory federal tax rate to income before income taxes.  The sources and tax effects of the differences in the total income tax provision are as follows (amounts in millions):\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nComputed expected income tax provision\n$\n8.2\n \n$\n496.8\n \n$\n611.0\n \nState income taxes, net of federal benefit\n(\n2.1\n)\n15.7\n \n8.6\n \nEffects of foreign operations - rate differential\n(\n19.2\n)\n(\n149.3\n)\n(\n184.0\n)\nEffects of foreign operations - other, net of foreign tax credits\n55.0\n \n212.2\n \n258.9\n \nForeign-derived intangible income (FDII)\n(\n3.1\n)\n(\n3.6\n)\n—\n \nBusiness realignment of intellectual property rights\n5.7\n \n0.4\n \n—\n \nChange in uncertain tax positions\n45.1\n \n5.8\n \n50.6\n \nShare-based compensation\n(\n14.1\n)\n(\n8.4\n)\n(\n11.4\n)\nR&D tax credits\n(\n60.1\n)\n(\n69.8\n)\n(\n63.8\n)\nIncome tax holidays\n(\n12.0\n)\n(\n22.5\n)\n(\n26.7\n)\nNondeductible Expenses\n6.0\n \n7.7\n \n9.4\n \nOther\n13.4\n \n2.6\n \n10.3\n \nChange in valuation allowance\n16.6\n \n(\n28.6\n)\n9.1\n \nIncome tax provision\n$\n39.4\n \n$\n459.0\n \n$\n672.0\n \nThe foreign tax rate differential benefit primarily relates to the Company's operations in Malta and Ireland.  The Company's Thailand manufacturing operations are currently subject to numerous tax holidays granted to the Company based on its investment in property, plant, and equipment in Thailand.  The Company's tax holiday periods in Thailand expire between fiscal 2026 and 2033, however, the Company actively seeks to obtain new tax holidays.  The Company does not expect the future expiration of any of its tax holiday periods in Thailand to have a material impact on its effective tax rate.  The aggregate dollar benefit derived from these tax holidays approximated $\n12.0\n million, $\n22.5\n million, and $\n26.7\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively.  The impact of the tax holidays increased each of the basic and diluted net income per common share by $\n0.02\n in fiscal 2025, $\n0.04\n in fiscal 2024, and $\n0.05\n in fiscal 2023.\nF-35\nTable of Contents\nThe tax effects of temporary differences that give rise to significant portions of the Company's deferred tax assets and deferred tax liabilities are as follows (amounts in millions):\n \nMarch 31,\n \n2025\n2024\nDeferred tax assets:\n \n \nAccrued expenses\n$\n51.8\n \n$\n50.2\n \nCapital loss carryforward\n9.8\n \n10.5\n \nDisallowed expense carryforwards\n242.8\n \n97.8\n \nIncome tax credits\n266.8\n \n267.8\n \nIntangible assets\n1,192.1\n \n1,277.0\n \nInventory valuation\n130.4\n \n72.0\n \nLease liabilities\n33.2\n \n36.2\n \nNet operating loss carryforward\n59.3\n \n64.8\n \nShare-based compensation\n53.5\n \n40.6\n \nOther\n25.6\n \n15.5\n \nGross deferred tax assets\n2,065.3\n \n1,932.4\n \nValuation allowances\n(\n287.4\n)\n(\n270.8\n)\nDeferred tax assets, net of valuation allowances\n1,777.9\n \n1,661.6\n \nDeferred tax liabilities:\n \n \nIntangible assets\n(\n50.3\n)\n(\n59.0\n)\nROU assets\n(\n31.7\n)\n(\n34.5\n)\nProperty, plant and equipment\n(\n1.6\n)\n(\n0.4\n)\nDeferred tax liabilities\n(\n83.6\n)\n(\n93.9\n)\nNet deferred tax asset\n$\n1,694.3\n \n$\n1,567.7\n \nReported as:\nNon-current deferred tax assets\n$\n1,728.1\n \n$\n1,596.5\n \nNon-current deferred tax liability\n(\n33.8\n)\n(\n28.8\n)\nNet deferred tax asset\n$\n1,694.3\n \n$\n1,567.7\n \n \nIn assessing whether it is more likely than not that deferred tax assets will be realized, the Company considers all available evidence, both positive and negative, including its recent cumulative earnings experience and expectations of future available taxable income of the appropriate character by taxing jurisdiction, tax attribute carryback and carryforward periods available for tax reporting purposes, and prudent and feasible tax planning strategies.\n \nAdditions and deductions related to the valuation allowance for deferred tax assets for the three fiscal years were as follows (amounts in millions):\nBalance at Beginning of Year\nAdditions Charged to Costs and Expenses\nDeductions\nBalance at End of Year\nFiscal 2025\n$\n270.8\n \n$\n22.2\n \n$\n(\n5.6\n)\n$\n287.4\n \nFiscal 2024\n$\n299.4\n \n$\n6.5\n \n$\n(\n35.1\n)\n$\n270.8\n \nFiscal 2023\n$\n290.3\n \n$\n19.3\n \n$\n(\n10.2\n)\n$\n299.4\n \nThe Company had federal, state and foreign net operating loss (NOL) carryforwards with an estimated tax effect of $\n59.3\n million available at March 31, 2025, which expire at various times between fiscal 2026 and fiscal 2045, of which a portion of the NOL carryforwards do not expire.  The Company had capital loss carryforwards with an estimated tax effect of $\n9.8\n million available at March 31, 2025, which begin to expire in fiscal 2026.  The Company had federal, state and foreign credits of $\n257.3\n million available at March 31, 2025, which begin to expire in fiscal 2026.  The Company had refundable tax credits in foreign jurisdictions of $\n9.5\n million available at March 31, 2025.  The Company had disallowed expense carryforwards with an estimated tax effect of $\n242.8\n million available at March 31, 2025.  These expense carryforwards do not expire.\nThe enactment of the TCJA imposed a tax on all previously untaxed earnings of non-U.S. subsidiaries of U.S. corporations.  Due to this change, the jurisdiction in which the Company's cash is at any given point in time no longer has a significant impact on the Company's liquidity.  The Company intends to invest substantially all of the Company's foreign subsidiary earnings, as \nF-36\nTable of Contents\nwell as the Company's capital in the Company's foreign subsidiaries, indefinitely outside of the U.S. in those jurisdictions in which the Company would incur significant, additional costs upon repatriation of such amounts.  It is not practical to estimate the additional tax that would be incurred, if any, if the permanently reinvested earnings were repatriated.\nDuring fiscal 2018, the Company recognized a one-time transition tax on accumulated unrepatriated foreign earnings, of which the Company expected cash payments of approximately $\n293.6\n million.  This tax is payable over a period of eight years, with \n8\n% of the transition tax payable each year for fiscal 2019 through fiscal 2023, and \n15\n%, \n20\n%, and \n25\n%, respectively, payable during fiscal 2024, fiscal 2025 and fiscal 2026.  As of March 31, 2025, the Company's transition tax payable was $\n73.4\n million, which is payable within the next 12 months and is included within accrued liabilities.\nThe Company recognizes interest and penalties related to unrecognized tax benefits through income tax expense.  The Company is subject to income taxes in the U.S. and numerous foreign jurisdictions.  The Company files U.S. federal, U.S. state, and foreign income tax returns.  For U.S. federal, and in general for U.S. state tax returns, the fiscal 2007 and later tax years remain effectively open for examination by tax authorities.  For foreign tax returns, the Company is generally no longer subject to income tax examinations for years prior to fiscal 2007.\n \nSignificant judgment is required in evaluating the Company's uncertain tax positions and determining its provision for income taxes.  Although the Company believes that it has appropriately reserved for its uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different than expectations.  The Company will adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit, tax litigation, interaction with taxing authorities, the closing of a statutory audit period or changes in applicable tax law.  To the extent that the final tax outcome of these matters is different than the amounts recorded, such differences would impact the provision for income taxes in the period in which such determination is made.  The provision for income taxes includes the impact of reserve provisions and changes to the reserves that are considered appropriate, as well as related net interest.\nThe Company recognizes liabilities for anticipated tax audit issues in the U.S. and other domestic and international tax jurisdictions based on its estimate of whether, and the extent to which, the tax positions are more likely than not to be sustained based on the technical merits.  The Company believes that it has appropriate support for the income tax positions taken and to be taken on its tax returns and that its accruals for tax liabilities are adequate for all open years based on an assessment of many factors including past experience and interpretations of tax laws applied to the facts of each matter.  \nThe Company believes it maintains appropriate reserves to offset potential income tax liabilities for positions that are not more than likely than not to be sustained upon final resolution of matters for open tax years.  If such reserve amounts ultimately prove to be unnecessary, the resulting reversal of such reserves could result in tax benefits being recorded in the period the reserves are no longer deemed necessary.  If such amounts prove to be less than an ultimate assessment, a future charge to expense would be recorded in the period in which the assessment is determined.  \nThe following table summarizes the activity related to the Company's gross unrecognized tax benefits for the three fiscal years (amounts in millions):\n \n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nBeginning gross unrecognized tax benefit\n$\n792.4\n \n$\n848.0\n \n$\n804.1\n \nDecreases related to settlements with tax authorities\n(\n0.7\n)\n(\n5.8\n)\n(\n0.4\n)\nDecreases related to statute of limitation expirations\n(\n6.9\n)\n(\n3.3\n)\n(\n11.7\n)\nIncreases related to current year tax positions\n27.1\n \n37.4\n \n65.9\n \nIncreases (decreases) related to prior year tax positions\n9.3\n \n(\n83.9\n)\n(\n9.9\n)\nEnding gross unrecognized tax benefits\n$\n821.2\n \n$\n792.4\n \n$\n848.0\n \n \nAs of March 31, 2025 and March 31, 2024, the Company had accrued interest and penalties related to tax contingencies of $\n135.8\n million and $\n104.6\n million, respectively, included within long-term income tax payable on the consolidated balance sheets.  During the fiscal years ended March 31, 2025, March 31, 2024, and March 31, 2023 interest and penalties charged to operations were $\n31.2\n million, $\n24.2\n million, and $\n7.6\n million, respectively.\nThe Company is currently under income tax examination in various tax jurisdictions in which it operates.  The years under examination range from fiscal 2007 through fiscal 2024.  In some jurisdictions, the Company has received tax assessments in excess of established reserves.  The Company is contesting these tax assessments, and will continue to do so, including \nF-37\nTable of Contents\npursuing all available remedies such as appeals and litigation, if necessary.  During fiscal 2025, additional assessments were received for these issues and the Company’s position remains unchanged.\nThe total amount of gross unrecognized tax benefits was $\n821.2\n million and $\n792.4\n million as of March 31, 2025, and March 31, 2024, respectively, of which $\n706.4\n million and $\n682.4\n million is estimated to impact the Company's effective tax rate, if recognized.  Unrecognized tax benefits may change in the next 12 months due to expiration of statutes of limitation, changes in the Company’s judgment about the level of uncertainty arising from new information, status of tax examinations, tax litigation, and legislative changes.  The Company is unable to reasonably estimate the change in the unrecognized tax benefits in the next 12 months.  Positions that may be resolved include various U.S. and non-U.S. matters.  \nIn September 2021, the Company received a Statutory Notice of Deficiency (2007 to 2012 Notice) from the United States Internal Revenue Service (IRS) for fiscal 2007 through fiscal 2012.  The disputed amounts largely relate to transfer pricing matters.  In December 2021, the Company filed a petition in the U.S. Tax Court challenging the 2007 to 2012 Notice.  In September 2023, the Company received a Revenue Agent Report (RAR) from the IRS for fiscal 2013 and fiscal 2016.  In October 2023, the Company received a Statutory Notice of Deficiency (2014 to 2015 Notice) from the IRS for fiscal 2014 and fiscal 2015.  The disputed amounts for fiscal 2013 to fiscal 2016 largely relate to transfer pricing matters.  In December 2023, the Company filed a petition in the U.S. Tax Court challenging the 2014 to 2015 Notice.  \nIn May 2023, the Company received a proposed income adjustment from the Malaysian Inland Revenue Board (IRB) for fiscal 2020.  In December 2023, the Company received a Notice of Assessment from the IRB asserting the same proposed income adjustment.  In March 2025, the Company entered into a Consent Judgment before the High Court, agreeing that the dispute will be heard before the Special Commissioners of Income Tax (SCIT).  It was also agreed that the payment on the taxes assessed is stayed and the IRB will pause all enforcement and proceedings against the collection of the taxes assessed until the appeal before the SCIT is concluded.  If the adjustment is upheld by the highest court that has jurisdiction over this matter in Malaysia, it could result in income taxes and penalties up to $\n410.0\n million.  The disputed amounts largely relate to the characterization of certain assets.  The timing of adjudicating this matter is uncertain but could commence in the next 12 months.  \nIn January 2025, the Company received several assessments from the German Tax Authorities (GTA) regarding the German extraterritorial taxation of royalty payments between nonresidents (referred to as offshore receipts in respect of intangible property or ORIP) and intellectual property transfers by nonresidents (referred to as extraterritorial capital gains taxation or ETT).  If the assessment is upheld, it could result in income taxes and penalties up to $\n92.0\n million.  The timing of adjudicating this matter is uncertain but could occur in the next 12 months.\nThe Company firmly believes that the assessments described above are without merit and plans to pursue all available administrative and judicial remedies necessary to resolve these matters.  The Company intends to vigorously defend its positions and the Company is confident in its ability to prevail on the merits.  The Company regularly assesses the likelihood of adverse outcomes resulting from examinations such as these to determine the adequacy of the Company's tax reserves.  The ultimate outcome of disputes of this nature is uncertain, and if the IRS, IRB, and GTA were to prevail on their assertions, the assessed tax, penalties, and deficiency interest could have a material adverse impact on the Company's financial position, results of operations or cash flows.\nNote 13\n. \nEmployee Benefit Plans\n \nDefined Benefit Plans\nThe Company has defined benefit pension plans that cover certain of its foreign employees.  Most of these defined pension plans, which were acquired in prior acquisitions, are unfunded.  Plan benefits are provided in accordance with local statutory requirements and are based on years of service and employee compensation levels.  \nThe change in projected benefit obligation and the accumulated benefit obligation was immaterial for fiscal 2025 and fiscal 2024.  As of March 31, 2025, the Company has recorded $\n74.5\n million related to the pension plans in the consolidated balance sheets.\nF-38\nTable of Contents\nFuture estimated expected benefit payments for fiscal year 2026 through 2035 are as follows (in millions):\nFiscal Year Ending March 31,\nAmount\n2026\n$\n11.2\n \n2027\n6.7\n \n2028\n6.0\n \n2029\n6.9\n \n2030\n6.9\n \n2031 through 2035\n46.2\n \nTotal\n$\n83.9\n \nNote 14\n. \nShare-Based Compensation \n \nShare-Based Compensation Expense\n \nThe following table presents the details of the Company's share-based compensation expense (in millions):\nFiscal Year Ended March 31,\n2025\n2024\n2023\nCost of sales \n(1)\n$\n21.8\n \n$\n25.6\n \n$\n27.2\n \nResearch and development\n104.6\n \n94.3\n \n83.1\n \nSelling, general and administrative\n54.0\n \n57.6\n \n60.1\n \nPre-tax effect of share-based compensation\n180.4\n \n177.5\n \n170.4\n \nIncome tax benefit\n37.9\n \n37.5\n \n36.4\n \nNet income effect of share-based compensation\n$\n142.5\n \n$\n140.0\n \n$\n134.0\n \n \n(1)\n  During the fiscal year ended March 31, 2025, $\n17.4\n million of share-based compensation expense was capitalized to inventory and $\n21.8\n million of previously capitalized share-based compensation expense in inventory was sold.  During the fiscal year ended March 31, 2024, $\n19.0\n million of share-based compensation expense was capitalized to inventory and $\n25.6\n million of previously capitalized share-based compensation expense in inventory was sold.  During the fiscal year ended March 31, 2023, $\n19.7\n million of share-based compensation expense was capitalized to inventory and $\n27.2\n million of previously capitalized share-based compensation expense in inventory was sold.\n \nIncentive Plans\nThe Company has granted RSUs to employees and non-employee members of the Board of Directors under the Company’s 2004 Equity Incentive Plan (the 2004 plan).  The Company grants RSUs with a service condition and PSUs under the 2004 plan.  Under the 2004 plan, \n72,389,717\n shares of common stock have been authorized for issuance and \n10,843,385\n shares of common stock remain available for future grants as of March 31, 2025.  \nRestricted Stock Units\n The Company uses RSUs with a service condition as its primary equity incentive compensation instrument for employees.\nF-39\nTable of Contents\nRSUs share activity is set forth below:\nNumber of \nShares\nWeighted Average Grant Date Fair Value\nNonvested shares at March 31, 2022\n9,848,955\n \n$\n52.74\n \nGranted\n3,054,320\n \n$\n61.76\n \nForfeited\n(\n815,738\n)\n$\n55.14\n \nVested\n(\n3,423,935\n)\n$\n45.08\n \nNonvested shares at March 31, 2023\n8,663,602\n \n$\n58.72\n \nGranted\n2,535,772\n \n$\n77.28\n \nForfeited\n(\n474,397\n)\n$\n64.37\n \nVested\n(\n2,510,781\n)\n$\n48.56\n \nNonvested shares at March 31, 2024\n8,214,196\n \n$\n67.22\n \nGranted\n4,921,190\n \n$\n70.74\n \nForfeited\n(\n1,191,134\n)\n$\n71.27\n \nVested\n(\n2,365,815\n)\n$\n60.12\n \nNonvested shares at March 31, 2025\n9,578,437\n \n$\n70.28\n \nThe total intrinsic value of RSUs which vested during the fiscal years ended March 31, 2025, 2024 and 2023 was $\n176.2\n million, $\n201.4\n million and $\n256.3\n million, respectively.  The aggregate intrinsic value of RSUs outstanding at March 31, 2025 was $\n463.7\n million, calculated based on the closing price of the Company's common stock of $\n48.41\n per share on March 31, 2025.\nThe amount of unearned share-based compensation currently estimated to be expensed in fiscal 2026 through fiscal 2030 related to unvested RSUs at March 31, 2025 is $\n414.3\n million.  The weighted average period over which the unearned RSUs compensation is expected to be recognized is approximately \n2.16\n years.\nPerformance Stock Units\nThe Company has granted performance-based PSUs to a group of executive officers and employees.  For the performance-based PSUs, the number of shares of the Company's common stock expected to vest will range from \n0\n% to \n200\n% of the target grant amount based on the Company's \ntwo-year\n or \nthree-year\n cumulative non-GAAP operating margin percentage.  Prior to fiscal 2023, the Company granted market-based PSUs to executive officers.  For the market-based PSUs, the number of shares of the Company's common stock expected to be received at vesting will range from \n0\n% to \n200\n% of the target grant amount based on the total shareholder return (TSR) of the Company's common stock measured against the TSR of a defined peer group of companies over the applicable \ntwo-year\n or \nthree-year\n measurement period.  TSR is a measure of the stock price appreciation plus any dividends paid in the performance period.  \nPSUs share activity is set forth below:\nNumber of \nShares\nWeighted Average Grant Date Fair Value\nNonvested shares at March 31, 2022\n257,060\n \n$\n74.76\n \nGranted\n172,334\n \n$\n60.88\n \nForfeited\n(\n48,524\n)\n$\n66.71\n \nVested\n—\n \n$\n—\n \nNonvested shares at March 31, 2023\n380,870\n \n$\n69.51\n \nGranted\n123,747\n \n$\n77.61\n \nForfeited\n(\n2,883\n)\n$\n100.20\n \nVested\n—\n \n$\n—\n \nNonvested shares at March 31, 2024\n501,734\n \n$\n71.33\n \nGranted\n183,304\n \n$\n71.92\n \nForfeited\n(\n207,481\n)\n$\n72.21\n \nVested\n(\n159,293\n)\n$\n70.71\n \nNonvested shares at March 31, 2025\n318,264\n \n$\n71.45\n \nF-40\nTable of Contents\nThe aggregate intrinsic value of PSUs outstanding at March 31, 2025 was $\n15.4\n million, calculated based on the closing price of the Company's common stock of $\n48.41\n per share on March 31, 2025.\nThe amount of unearned share-based compensation currently estimated to be expensed in fiscal 2026 through fiscal 2030 related to unvested PSUs at March 31, 2025 is $\n7.8\n million.  The weighted average period over which the unearned PSUs compensation is expected to be recognized is approximately \n1.93\n years.\nEmployee Stock Purchase Plan\nThe Company’s 2001 Employee Stock Purchase Plan and the 1994 International Employee Stock Purchase Plan (collectively referred to as the employee stock purchase plans) allows eligible employees to purchase shares of the Company's common stock at \n85\n% of the value of its common stock on specific dates.  Since the inception of the employee stock purchase plans, \n36,088,751\n shares of common stock have been authorized for issuance and \n8,115,202\n shares remain available for future purchases as of March 31, 2025.\nEmployees purchased \n1,102,689\n shares of common stock in the fiscal year ended March 31, 2025 for an aggregate purchase price of $\n65.5\n million under the employee stock purchase plans compared to \n1,375,324\n shares of common stock for an aggregate purchase price of $\n81.7\n million in the fiscal year ended March 31, 2024 and \n1,424,850\n shares of common stock for a purchase price of $\n81.2\n million in the fiscal year ended March 31, 2023.  As of March 31, 2025, unrecognized share-based compensation costs related to the employee stock plans totaled $\n6.6\n million, which will be recognized over a period of approximately \nfive months\n.\nNote 15\n. \nStockholders' Equity\n \nChanges in Share Balances\nThe following table shows the changes in each class of shares (in millions):\nSeries A Preferred Stock\nCommon Stock\nTreasury Stock\nBalance at March 31, 2022\n— \n577.8\n \n23.3\n \nRepurchase of common stock\n— \n— \n12.9\n \nCommon stock issued under employee equity incentive plans\n— \n4.9\n \n— \nCommon stock withheld for tax withholdings on employee equity awards\n— \n(\n1.0\n)\n— \nTreasury stock used for new issuances\n— \n(\n3.9\n)\n(\n3.9\n)\nBalance at March 31, 2023\n— \n577.8\n \n32.3\n \nRepurchase of common stock\n— \n— \n11.9\n \nCommon stock issued under employee equity incentive plans\n— \n4.0\n \n— \nCommon stock withheld for tax withholdings on employee equity awards\n— \n(\n0.9\n)\n— \nTreasury stock used for new issuances\n— \n(\n3.1\n)\n(\n3.1\n)\nBalance at March 31, 2024\n—\n \n577.8\n \n41.1\n \nRepurchase of common stock\n— \n— \n1.0\n \nIssuance of Series A Preferred Stock\n1.5\n \n— \n— \nCommon stock issued under employee equity incentive plans\n— \n3.6\n \n— \nCommon stock withheld for tax withholdings on employee equity awards\n— \n(\n0.8\n)\n— \nTreasury stock used for new issuances\n— \n(\n2.8\n)\n(\n2.8\n)\nShares issued to settle convertible debt\n— \n0.2\n \n— \nBalance at March 31, 2025\n1.5\n \n578.0\n \n39.3\n \nF-41\nTable of Contents\nTreasury Stock\nIn November 2021, the Company's Board of Directors approved a stock repurchase program to repurchase up to $\n4.00\n billion of the Company's common stock in the open market or in privately negotiated transactions.  There is no expiration date associated with the repurchase program.  During the fiscal year ended March 31, 2025, the Company purchased approximately \n1.0\n million shares of its common stock for a total cost of $\n89.6\n million, including the \n1\n% excise tax on stock repurchases enacted by the Inflation Reduction Act of 2022 (Inflation Reduction Act), compared to approximately \n11.9\n million shares of its common stock repurchased for a total cost of $\n988.9\n million in the fiscal year ended March 31, 2024, and \n12.9\n million shares of its common stock repurchased for a total of $\n945.8\n million in the fiscal year ended March 31, 2023.  As of March 31, 2025, approximately $\n1.56\n billion remained available for repurchases under the program.  Shares repurchased are recorded as treasury shares and are used to fund share issuance requirements under the Company's equity incentive plans.  As of March 31, 2025, the Company had approximately \n39.3\n million treasury shares. \nSeries A Mandatory Convertible Preferred Stock\nIn March 2025, the Company issued \n29.7\n million Depositary Shares, representing approximately \n1.5\n million shares of its Series A Preferred Stock.  The Series A Preferred Stock has a $\n1,000.00\n per share liquidation preference and a $\n0.001\n per share par value.  As a result of the transaction, the Company received cash proceeds of $\n1.45\n billion, net of underwriting fees and other issuance costs.\nDividends are cumulative at an annual rate of \n7.50\n% on the liquidation preference of $\n1,000.00\n per share of Series A Preferred Stock and may be paid in cash, shares of the Company's common stock or a combination of cash and shares of common stock.  Dividends that are declared will be payable on the 15th of March, June, September and December to holders of record on the 1st of each month of the relevant dividend payment date.  Dividends are recorded as a reduction to retained earnings and are reflected in accrued liabilities within the consolidated balance sheets until paid.\nUnless earlier converted, each share of Series A Preferred Stock will automatically convert on March 15, 2028, into between \n16.0060\n shares and \n19.6080\n shares of the Company's common stock, depending on the applicable market value of the common stock and subject to certain anti-dilution adjustments described in the certificate of designations governing the Series A Preferred Stock (Certificate of Designations).  The applicable market value of the Company's common stock will be determined based on the average volume-weighted average price per share of the common stock over the 20 consecutive trading day period beginning on, and including, the 21st scheduled trading day immediately prior to March 15, 2028.\nIf a fundamental change, as defined in the Certificate of Designations, occurs on or prior to March 15, 2028, then holders of the Series A Preferred Stock will be entitled to convert all or any portion of their shares into shares of the Company's common stock at the fundamental change conversion rate, as defined in the Certificate of Designations, for a specified period of time and also to receive an amount to compensate such holders for unpaid accumulated dividends and any remaining future scheduled dividend payments.  Other than during a fundamental change conversion period, at any time prior to March 15, 2028, holders of Series A Preferred Stock may elect to convert all or any portion of their shares at a conversion rate of \n16.0060\n shares of common stock per share of Series A Preferred Stock, subject to certain anti-dilution and other adjustments as described in the Certificate of Designations.\nIn connection with the issuance of the \n29.7\n million Depositary Shares, representing approximately \n1.5\n million shares of its Series A Preferred Stock, the Company entered into capped call option transactions with several financial institutions at a cost of $\n55.1\n million.  Upon conversion of the Series A Preferred Stock, the Company may exercise the capped call options subject to a cap price of $\n71.40\n per share, subject to certain adjustments under the terms of the capped call options, which are generally expected to reduce the potential dilution to the Company's common stock upon conversion of the Series A Preferred Stock and/or offset any cash payments the Company is required to make.  As these transactions meet certain accounting criteria, the capped call options are recorded as a reduction of stockholders' equity and are not accounted for as derivatives.\nF-42\nTable of Contents\nCommon Stock Dividends\nIn October 2002, the Company announced that its Board of Directors had approved and instituted a quarterly cash dividend on its common stock.  The Company has continued to pay quarterly dividends and has increased the amount of such dividends on a regular basis.  Cash dividends paid per share were $\n1.816\n, $\n1.682\n and $\n1.263\n during fiscal 2025, 2024 and 2023, respectively.  Total dividend payments amounted to $\n975.7\n million, $\n911.5\n million and $\n695.3\n million during fiscal 2025, 2024 and 2023, respectively.\nAccumulated Other Comprehensive Loss\nThe following table presents the changes in the components of accumulated other comprehensive loss, net of tax (in millions):\nMinimum Pension Liability\nForeign Currency\nTotal\nBalance at March 31, 2024\n$\n11.6\n \n$\n(\n15.1\n)\n$\n(\n3.5\n)\nNet other comprehensive income\n1.8\n \n—\n \n1.8\n \nBalance at March 31, 2025\n$\n13.4\n \n$\n(\n15.1\n)\n$\n(\n1.7\n)\nBalance at March 31, 2023\n$\n11.0\n \n$\n(\n15.1\n)\n$\n(\n4.1\n)\nNet other comprehensive income\n0.6\n \n—\n \n0.6\n \nBalance at March 31, 2024\n$\n11.6\n \n$\n(\n15.1\n)\n$\n(\n3.5\n)\nF-43"
  }
}