{
  "ticker": "MCK",
  "cik": "0000927653",
  "company_name": "MCKESSON CORP",
  "filing_date": "2025-05-09",
  "accession": "0000927653-25-000036",
  "primary_doc": "mck-20250331.htm",
  "item_sections": {
    "item1": "Item 1 - Business - Forward-Looking Statements in Part I of this Annual Report for additional factors relating to these statements and",
    "item1a": "Item 1A - Risk Factors, in Part I of this Annual Report.\nCRITICAL ACCOUNTING ESTIMATES\nWe consider an accounting estimate to be critical if the estimate requires us to make assumptions about matters based upon past experience and management’s judgment that were uncertain at the time the accounting estimate was made and if different estimates that we reasonably could have used in the current period, or changes in the accounting estimate that are reasonably likely to occur from period to period, could have a material impact on our financial condition or results from operations. Below are the estimates that we believe are critical to the understanding of our operating results and financial condition. Other accounting policies are described in \nFinancial Note 1, “Significant Accounting Policies,”\n to the consolidated financial statements included in this Annual Report. Because of the uncertainty inherent in such estimates, actual results may differ from these estimates.\nAllowances for Credit Losses: \nOur receivables primarily consist of short-term trade accounts receivable from customers that result from the sale of goods and services. We also provide customer financing arrangements to customers who purchase our products and services. Customer financing primarily relates to guarantees provided to our customers, or their creditors, regarding the repurchase of inventories. We also provide financing to certain customers related to the purchase of pharmacies, which serve as collateral for the loans. We estimate the receivables for which we do not expect full collection based on historical collection rates and specific knowledge regarding the current creditworthiness of our customers and record an allowance in our consolidated financial statements for these amounts.\n43\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nThe Company considers historical credit losses, the current economic environment, customer credit ratings, collections on past due amounts, legal disputes, and bankruptcies, as well as reasonable and supportable forecasts to develop its allowance for credit losses. Management reviews these factors quarterly to determine if any adjustments are needed to the allowance. \nSales to the Company’s ten largest customers, including group purchasing organizations (“GPOs”), accounted for approximately 72% of total consolidated revenues in fiscal 2025 and comprised approximately 48% of total trade accounts receivable at March 31, 2025. Sales to our largest customer, CVS Health Corporation (“CVS”), accounted for approximately 24% of our total consolidated revenues in fiscal 2025 and comprised approximately 23% of total trade accounts receivable at March 31, 2025. As a result, our sales and credit concentration is significant. We also have agreements with GPOs, each of which functions as a purchasing agent on behalf of member hospitals, pharmacies and other healthcare providers, as well as with government entities and agencies. The accounts receivable balances are with individual members of the GPOs, and therefore no significant concentration of credit risk exists. A material default in payment, a material reduction in purchases from GPOs or any other large customers, or the loss of a large customer or GPO could have a material adverse impact on our financial position, results of operations, and liquidity.\nReserve methodologies are assessed annually based on historical losses and economic, business, and market trends. In addition, reserves are reviewed quarterly and updated if unusual circumstances or trends are present. We believe the reserves maintained and expenses recorded in fiscal 2025 are appropriate and consistent in the context of historical methodologies employed, as well as assessment of trends currently available.\nAt March 31, 2025, trade and notes receivables were $22.6 billion prior to allowances of $472 million. Our provision for bad debts was a credit of $130 million, in fiscal 2025 and a charge of $819 million, and $45 million in fiscal 2024 and fiscal 2023, respectively. At March 31, 2025 and 2024, the allowance as a percentage of trade and notes receivables was 2.1% and 4.5%, respectively. The provision for bad debts for fiscal 2024 included a charge of $725 million within our U.S. Pharmaceutical segment related to the bankruptcy of our customer Rite Aid, as discussed in the \n“Trends and Uncertainties”\n section of this financial review and the \nFinancial Note 20, “Segments of Business,”\n to the consolidated financial statements included in this Annual Report. This amount represented the uncollected trade accounts receivable balance due from Rite Aid prior to its bankruptcy petition filing in October 2023. During the year ended March 31, 2025, we reassessed our initial estimates made in conjunction with the previously reserved prepetition balances, including cash received during the period, resulting in a reversal of $206 million recorded within “Selling, distribution, general, and administrative expenses” in our Consolidated Statements of Operations and included within our U.S. Pharmaceutical segment. During the year ended March 31, 2025, we released $237 million of allowance for doubtful accounts against trade accounts receivables, representing the write-off of uncollectible receivables related to the Rite Aid provision in the Consolidated Balance Sheet.\nAn increase or decrease of a hypothetical 0.1% in the fiscal 2025 allowance as a percentage of trade and notes receivables would result in an increase or decrease in the provision for bad debts of approximately $23 million. The selected 0.1% hypothetical change does not reflect what could be considered the best or worst-case scenarios. Additional information concerning our allowances for credit losses may be found in Schedule II included in this Annual Report.\nInventories:\n Inventories consist of merchandise held for resale. We report inventories at the lower of cost or net realizable value, except for inventories determined using the LIFO method which are valued at the lower of LIFO cost or market. The LIFO method presumes that the most recent inventory purchases are the first items sold and the inventory cost under LIFO approximates market. The majority of the cost of domestic inventories is determined using the LIFO method. The majority of the cost of inventories held in foreign and certain domestic locations is based on the first-in, first-out (“FIFO”) method or weighted-average purchase prices. Rebates, cash discounts, and other incentives received from vendors relating to the purchase or distribution of inventory are considered product discounts and are accounted for as a reduction in the cost of inventory and are recognized when the inventory is sold. \nIn determining whether an inventory valuation allowance is required, we consider various factors including estimated quantities of slow-moving inventory by reviewing on-hand quantities, outstanding purchase obligations, and forecasted sales. Shifts in market trends and conditions, changes in customer preferences due to the introduction of generic drugs or new pharmaceutical products, or the loss of one or more significant customers are factors that could affect the value of our inventories. We write down inventories which are considered excess and obsolete as a result of these reviews. These factors could make our estimates of inventory valuation differ from actual results.\n44\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nAt March 31, 2025 and 2024, total inventories, net were $23.0 billion and $21.1 billion, respectively, in our Consolidated Balance Sheets. The LIFO method was used to value approximately 63% and 62% of our inventories at March 31, 2025 and 2024, respectively. If we had used the moving average method of inventory valuation, inventories would have been approximately $309 million and $227 million higher than the amounts reported at March 31, 2025 and 2024, respectively. These amounts are equivalent to our LIFO reserves. A LIFO charge is recognized when the net effect of price increases on pharmaceutical and non-pharmaceutical products held in inventory exceeds the impact of price declines, including the effect of branded pharmaceutical products that have lost market exclusivity. A LIFO credit is recognized when the net effect of price declines exceeds the impact of price increases on pharmaceutical and non-pharmaceutical products held in inventory. We recognized a LIFO charge of $82 million in fiscal 2025, a LIFO credit of $157 million in fiscal 2024, and a LIFO charge of $1 million in fiscal 2023, all within “Cost of sales” in our Consolidated Statements of Operations. The LIFO charge in fiscal 2025 compared to a LIFO credit in fiscal 2024 was primarily due to higher brand inflation in the current fiscal year. The LIFO credit in fiscal 2024 compared to a LIFO charge in fiscal 2023 was primarily due to lower brand inflation, offset by higher brand inventory levels, lower deflation from off patent launch activity, and lower generics deflation. Our LIFO valuation amount includes both pharmaceutical and non-pharmaceutical products. \nWe believe that the moving average inventory costing method provides a reasonable estimation of the current cost of replacing inventory (i.e., “market”). As such, our LIFO inventory is valued at the lower of LIFO cost or market. As of March 31, 2025 and 2024, inventories at LIFO did not exceed market. \nBusiness Combinations: \nWe account for business combinations using the acquisition method of accounting whereby the identifiable assets and liabilities of the acquired business, including contingent consideration, as well as any noncontrolling interest in the acquired business, are recorded at their estimated fair values as of the date that we obtain control of the acquired business. Any purchase consideration in excess of the estimated fair values of the net assets acquired is recorded as goodwill. Acquisition-related expenses and related restructuring costs are expensed as incurred.\nSeveral valuation methods may be used to determine the fair value of assets acquired and liabilities assumed. For intangible assets, we typically use a variation of the income approach, whereby a forecast of future cash flows attributable to the asset is discounted to present value using a risk-adjusted discount rate. Some of the more significant estimates and assumptions inherent in the income approach include the amount and timing of projected future cash flows, the discount rate selected to measure the risks inherent in the future cash flows, and the assessment of the asset’s expected useful life. Refer to \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n,”\n to the consolidated financial statements included in this Annual Report for additional information regarding our acquisitions. \nCertain business combinations involve the potential for future payments of consideration that is contingent upon the achievement of performance milestones or other agreed-upon events. The liability for the contingent consideration is measured at its fair value as of the acquisition date using unobservable inputs. These inputs include the estimated amount and timing of projected operational and financial information, the probability of achievement of performance milestones or other agreed-upon events, and the risk-adjusted discount rate used to calculate the present value of the probability-weighted projected financial information\n.\n Contingent liabilities are remeasured to fair value at each reporting date until the liability is resolved with changes in fair value being recognized within “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations. Changes in any of the inputs may result in a significant adjustment to the fair value.\nGoodwill and Long-Lived Assets:\nGoodwill\nAs a result of acquiring businesses, we have $10.0 billion and $10.1 billion of goodwill at March 31, 2025 and 2024, respectively, and $1.5 billion and $2.1 billion of intangible assets, net at March 31, 2025 and 2024, respectively. \nWe perform an impairment test on goodwill balances annually in the first fiscal quarter and more frequently if indicators for potential impairment exist. Indicators that are considered include significant declines in performance relative to expected operating results, significant changes in the use of the assets, significant negative industry or economic trends, or a significant decline in the Company’s stock price and/or market capitalization for a sustained period of time. \nGoodwill impairment testing is conducted at the reporting unit level, which is generally defined as an operating segment or a component, one level below our operating segments, for which discrete financial information is available and where segment management regularly reviews the operating results of that reporting unit.\n45\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nWe apply the goodwill impairment test by comparing the estimated fair value of a reporting unit to its carrying value and an impairment charge is recorded equal to the amount of excess carrying value above the estimated fair value, if any, but not to exceed the amount of goodwill allocated to the reporting unit.\nTo estimate the fair value of our reporting units, we generally use a combination of the market approach and the income approach. Under the market approach, we estimate fair value by comparing the business to similar businesses, or guideline companies whose securities are actively traded in public markets. Under the income approach, we use a discounted cash flow model in which cash flows anticipated over several periods, plus a terminal value at the end of that time horizon, are discounted to their present value using an appropriate rate that is commensurate with the risk inherent within the reporting unit. In addition, we compare the aggregate of the reporting units’ fair values to our market capitalization as further corroboration of the reasonableness of our concluded fair values.\nEstimates of fair value result from a complex series of judgments about future events and uncertainties and rely heavily on estimates and assumptions at a point in time. Judgments made in determining an estimate of fair value may materially impact our results of operations. The valuations are based on information available as of the impairment testing date and are based on expectations and assumptions that have been deemed reasonable by management. Any material changes in key assumptions, including failure to meet business plans, negative changes in government reimbursement rates, deterioration in the U.S. and global financial markets, an increase in interest rates, or an increase in the cost of equity financing by market participants within the industry, or other unanticipated events and circumstances may decrease the projected cash flows or increase the discount rates and could potentially result in an impairment charge. Under the market approach, significant estimates and assumptions also include the selection of appropriate guideline public companies and the determination of appropriate valuation multiples to apply to the reporting unit. Under the income approach, significant estimates and assumptions also include the determination of discount rates. The discount rates represent the weighted-average cost of capital measuring the reporting unit’s cost of debt and equity financing, which are weighted by the percentage of debt and percentage of equity in a company’s target capital structure. Included in the estimate of the weighted-average cost of capital is the assumption of an unsystematic risk premium to address incremental uncertainty related to the reporting units’ future cash flow projections.\nThe annual impairment testing performed for fiscal 2025, fiscal 2024, and fiscal 2023 did not indicate any impairment of goodwill.\nRefer to \nFinancial \nNote 10\n, “\nGoodwill and Intangible Assets, Net\n,\n” to the consolidated financial statements included in this Annual Report for additional information.\nLong-Lived Assets\nCurrently, all of our identifiable intangible and other long-lived assets are amortized or depreciated based on the pattern of their economic consumption or a straight-line basis over their estimated useful lives, ranging from one to 30 years. We review intangible and other long-lived assets for impairment at an asset group level whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. Determination of recoverability of intangible and other long-lived assets is based on the lowest level of identifiable estimated future undiscounted cash flows resulting from the use of the asset and its eventual disposition. Measurement of any impairment loss is based on the excess of the carrying value of the asset group over its fair value. Assumptions and estimates about future values and the remaining useful lives of our purchased intangible assets are complex and subjective. They can be affected by a variety of factors, including external factors such as industry and economic trends, and internal factors such as changes in our business strategy and our internal forecasts.\nOur ongoing consideration of all the factors described previously could result in further impairment charges in the future, which could adversely affect our net income. Refer to \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n,” to the consolidated financial statements included in this Annual Report for additional information on our long-lived asset impairments.\n46\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nLong-lived assets classified as held for sale are measured at the lower of their carrying amount or fair value less costs to sell and are not depreciated or amortized. Fair value is determined based on the total consideration expected to be received by the Company. The fair value of a disposal group, less any costs to sell, is assessed each reporting period it remains classified as held for sale and any remeasurement to the lower of carrying value or fair value less costs to sell is reported as an adjustment to the carrying value of the disposal group. When the net realizable value of a disposal group increases during a period, a gain can be recognized to the extent that it does not increase the value of the disposal group beyond its original carrying value when the disposal group was reclassified as held for sale. \nRestructuring Charges: \nWe have certain restructuring reserves which require significant estimates related to the timing and amount of future employee severance and other exit-related costs to be incurred when the restructuring actions take place. We generally recognize employee severance costs when payments are probable and amounts can be reasonably estimated. Costs related to contracts without future benefit or contract termination are recognized at the earlier of the contract termination or the cease-use dates. Other exit-related costs are expensed as incurred. In connection with these restructuring actions, we also assess the recoverability of long-lived assets used in the business, and as a result, we may recognize accelerated depreciation and amortization reflecting shortened useful lives of the underlying assets. Refer to \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n,”\n to the consolidated financial statements included in this Annual Report for additional information on restructuring matters. \nIncome Taxes: \nOur income tax expense and deferred tax assets and liabilities reflect management’s best assessment of estimated current and future taxes to be paid. We are subject to income taxes in the U.S. and numerous foreign jurisdictions. Significant judgments and estimates are required in determining the consolidated income tax provision and in evaluating income tax uncertainties, including those used to conclude on the unrecognized tax position related to opioid-related litigation and claims, and may differ from the actual amounts of tax benefit recognized. We review our tax positions at the end of each quarter and adjust the balances as new information becomes available.\nDeferred income taxes arise from temporary differences between the tax and financial statement recognition of revenue and expense. In evaluating our ability to recover our deferred tax assets, we consider all available positive and negative evidence including our past operating results, the existence of cumulative net operating losses in the most recent years, and our forecast of future taxable income. In estimating future taxable income, we develop assumptions including the amount of future federal, state, and foreign pre-tax operating income, the reversal of temporary differences, and the implementation of feasible and prudent tax planning strategies. These assumptions require significant judgment about the forecasts of future taxable income and are consistent with the plans and estimates we use to manage the underlying businesses.\nChanges in tax laws and rates could also affect recorded deferred tax assets and liabilities in the future. Should tax laws change, our tax expense and cash flows could be materially impacted. \nIn addition, the calculation of our tax liabilities includes estimates for uncertainties in the application of complex new tax regulations across multiple global jurisdictions where we conduct our operations.\nWe recognize liabilities for tax and related interest for issues in the U.S. and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes and related interest will be due. If our current estimate of tax and interest liabilities is less than the ultimate settlement, an additional charge to income tax expense may result. If our current estimate of tax and interest liabilities is more than the ultimate settlement, a reduction to income tax expense may be recognized. Refer to \nFinancial \nNote 6\n, “\nIncome Taxes\n,”\n to the consolidated financial statements included in this Annual Report for additional information on income tax matters. \n47\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nLoss Contingencies: \nWe are subject to various claims, including claims with customers and vendors, pending and potential legal actions for damages, investigations relating to laws and regulations and other matters arising out of the normal conduct of our business. When a loss is considered probable and reasonably estimable, we record a liability in the amount of our best estimate for the ultimate loss. However, the likelihood of a loss with respect to a particular contingency is often difficult to predict, and determining a meaningful estimate of the loss or a range of loss may not be practicable based on the information available and the potential effect of future events and decisions by third parties that will determine the ultimate resolution of the contingency. Moreover, it is not uncommon for such matters to be resolved over many years, during which time relevant developments and new information must be reevaluated at least quarterly to determine both the likelihood of potential loss and whether it is possible to reasonably estimate a range of possible loss. When a material loss is reasonably possible, or probable but a reasonable estimate cannot be made, disclosure of the proceeding is provided. Legal fees are expensed as incurred when the legal services are provided.\nWe review all contingencies at least quarterly to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the potential loss or range of the loss can be made. As discussed above, development of a meaningful estimate of loss or a range of potential loss is complex when the outcome is directly dependent on future negotiations with or decisions by third parties, such as regulatory agencies, the court system, and other interested parties. \nIn conjunction with the preparation of the consolidated financial statements included in this Annual Report, we considered matters related to ongoing controlled substances claims to which we are a party. For the year ended March 31, 2024, the Company recorded a charge of $149 million within “Claims and litigation charges, net” in the Consolidated Statement of Operations to reflect its portion of a proposed settlement with a nationwide class of acute care hospitals, and the corresponding liability was included within “Other accrued liabilities” in the Consolidated Balance Sheet. For the year ended March 31, 2025, we recorded a charge of $114 million within “Claims and litigation charges, net” in the Consolidated Statement of Operations to reflect the Company’s portion of the settlement with representatives of a nationwide group of certain third-party payors, of which $57 million was recorded within Corporate expenses, net, and U.S. Pharmaceutical, respectively. The corresponding liability was included within “Other accrued liabilities” in the Consolidated Balance Sheet. At March 31, 2025, our estimated accrued liability for opioid-related claims was $6.4 billion. Because of the many uncertainties associated with the remaining opioid-related litigation matters, we are not able to reasonably estimate the upper or lower ends of the range of ultimate possible losses for all opioid-related litigation matters. We are not able to predict the outcome in these matters, and an adverse judgment or negotiated resolution in any of these matters could have a material adverse effect on our results of operations, financial position, and cash flows or liquidity. Refer to \nFinancial \nNote 17\n, “\nCommitments and Contingent Liabilities\n,”\n to the consolidated financial statements included in this Annual Report for additional information.\n48\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nFINANCIAL CONDITION, LIQUIDITY, AND CAPITAL RESOURCES\nWe expect our available cash generated from operations and our short-term investment portfolio, together with our existing sources of liquidity from our credit facilities, commercial paper program, and other borrowings will be sufficient to fund our short-term and long-term capital expenditures, working capital, and other cash requirements. We remain adequately capitalized, including access to liquidity from our $4.0 billion revolving credit facility. At March 31, 2025, we were in compliance with all debt covenants, and believe we have the ability to continue to meet our debt covenants in the future.\nThe following table summarizes the net change in cash, cash equivalents, and restricted cash for the periods shown:\nYears Ended March 31, \n(Dollars in millions)\n2025\n2024\nChange\nNet cash provided by (used in):\nOperating activities\n$\n6,085 \n$\n4,314 \n$\n1,771 \nInvesting activities\n(733)\n(1,072)\n339 \nFinancing activities\n(3,965)\n(3,342)\n(623)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(16)\n6 \n(22)\nNet change in cash, cash equivalents, and restricted cash\n$\n1,371 \n$\n(94)\n$\n1,465 \nOperating Activities\nOperating activities provided cash of $6.1 billion and $4.3 billion for the years ended March 31, 2025 and 2024, respectively. Cash flows from operations can be significantly impacted by factors such as the timing of receipts from customers, inventory receipts, and payments to vendors. Additionally, working capital is primarily a function of sales and purchase volumes, inventory requirements, and vendor payment terms.\nFor the year ended March 31, 2025, net cash provided by operating activities increased by $1.8 billion compared to the prior year period. This increase was primarily due to the following:\n•\nthe Company’s net income increased by $321 million and was favorably impacted by higher net non-cash items of $549 million, compared to the prior year period driven by factors discussed in more detail in the \n“Overview of Consolidated Results”\n section of this Financial Review, including an increase in cash receipts for our share of antitrust legal settlements of $200 million;\n•\nan increase in cash of $3.7 billion related to accounts payable as a result of customary vendor payment scheduling, and higher purchases to support business growth, partially offset by timing related to the day of the week on which the period ends;\n•\na decrease in net cash of $981 million related to accounts receivable primarily due to growth in specialty pharmaceuticals sales and higher volumes from retail national account customers in our U.S. Pharmaceutical segment;\n•\na decrease in net cash of $976 million related to higher inventory purchases to support business growth; and\n•\na decrease in cash driven by higher income tax payments in fiscal 2025 compared to the prior year.\nInvesting Activities\nInvesting activities used cash of $733 million and $1.1 billion for the years ended March 31, 2025 and 2024, respectively. Investing activities for the year ended March 31, 2025 includes $537 million and $322 million, respectively, in capital expenditures for property, plant, and equipment and capitalized software. Investing activities for the year ended March 31, 2025 was also impacted by the receipt of proceeds of $189 million related to investments in equity securities, as discussed in \nFinancial Note 15, “Fair Value Measurements,”\n to the consolidated financial statements included in this Annual Report.\nInvesting activities for the year ended March 31, 2024 includes $431 million and $256 million, respectively,\n \nin capital expenditures for property, plant, and equipment and capitalized software, as well as $272 million of net cash payments for acquisitions.\n49\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nFinancing Activities\nFinancing activities used cash of $4.0 billion and $3.3 billion for the years ended March 31, 2025 and 2024, respectively. Financing activities for the year ended March 31, 2025 includes $3.1 billion of cash paid for share repurchases and $345 million of cash paid for dividends. Financing activities also includes cash receipts and cash payments of $15.1 billion related to short-term borrowings of commercial paper in fiscal 2025. On September 10, 2024, we completed a public offering of 4.25% Notes due September 15, 2029 in a principal amount of $500 million. Proceeds received from this note issuance, net of discounts and offering expenses, were $496 million. We utilized the net proceeds from this note issuance along with cash on hand to redeem our $500 million outstanding principal amount of 5.25% Notes due February 15, 2026 prior to maturity at a redemption price equal to 100% of the principal amount plus accrued and unpaid interest through the settlement date.\nFinancing activities for the year ended March 31, 2024 includes $3.0 billion of cash paid for share repurchases and $314 million of cash paid for dividends. Financing activities also includes cash receipts and cash payments of $20.0 billion related to short-term borrowings of commercial paper in fiscal 2024. \nOn June 15, 2023, we completed a public offering of 4.90% Notes due July 15, 2028 in a principal amount of $400 million and 5.10% Notes due July 15, 2033 in a principal amount of $600 million, for proceeds received, net of discounts and offering expenses, of $397 million and $592 million, respectively. A portion of the net proceeds from these notes was utilized to fund the repurchase of our then outstanding 3.80% Notes due March 15, 2024 (the “2024 Notes”) discussed below, while the remaining net proceeds was available for general corporate purposes.\nOn June 16, 2023, we completed a cash tender offer for any and all of our then outstanding 2024 Notes with a principal amount of $918 million, which was made concurrently with the June 15, 2023 notes offering described above. Using a portion of the proceeds from the June 15, 2023 notes offering, we paid an aggregate consideration of $268 million to repurchase $271 million principal amount of the 2024 Notes. Following the consummation of this tender offer, on June 16, 2023, we irrevocably deposited U.S. government obligations with the trustee under the indenture governing the 2024 Notes sufficient to fund the payment of accrued and unpaid interest of the remaining $647 million principal amount of the 2024 Notes as it became due, and of the principal amount of those 2024 Notes on their March 15, 2024 maturity date.\nCash used for other financing activities generally includes shares surrendered for tax withholding and payments to noncontrolling interests.\nShare Repurchase Plans\nThe Board has authorized the repurchase of common stock. We may repurchase common stock from time-to-time through open market transactions, privately negotiated transactions, accelerated share repurchase programs, or by combinations of such methods, any of which may use pre-arranged trading plans that are designed to meet the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934 (“Exchange Act”). The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, tax implications, restrictions under our debt obligations, other uses for capital, impacts on the value of remaining shares, cash generated from operations, and market and economic conditions.\nEffective January 1, 2023, our repurchase of common stock, adjusted for allowable items, are subject to a 1% excise tax as a result of the Inflation Reduction Act of 2022. Excise taxes incurred on share repurchases of an entity’s own common stock are direct and incremental costs to purchase treasury stock, and accordingly are included in the total cost basis of the common stock acquired and reflected as a reduction of stockholders’ equity within “Treasury shares” in our Consolidated Balance Sheets and Consolidated Statements of Stockholders’ Deficit. Excise taxes do not reduce our remaining authorization for the repurchase of common stock. Excise taxes of $26 million and $25 million were accrued for shares repurchased during the year ended March 31, 2025 and 2024, respectively. On October 30, 2024, we made a payment of $25 million for fiscal 2024 excise taxes previously accrued. As of March 31, 2025 and March 31, 2024, the amount accrued for excise taxes was $26 million, and $25 million, respectively, within “Other accrued liabilities” in our Consolidated Balance Sheets. \n50\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nInformation regarding the share repurchase activity over the last two fiscal years was as follows:\nShare Repurchases \n(1)\n(In millions, except price per share)\nTotal \nNumber of\nShares \nPurchased \n(2) \nAverage Price \nPaid Per Share\nApproximate \nDollar Value of \nShares that May \nYet Be Purchased \nUnder the \nPrograms \n(3) (4)\nBalance, March 31, 2023\n$\n3,613 \nShare repurchase authorization increase in fiscal 2024 \n6,000 \nShares repurchased - Open market\n6.9 \n$\n436.46 \n(2,998)\nBalance, March 31, 2024\n6,615 \nShare repurchase authorization increase in fiscal 2025\n4,000 \nShares repurchased - Open market\n5.8 \n$\n543.05 \n(3,146)\nBalance, March 31, 2025\n$\n7,469 \n(1)\nThis table does not include the value of equity awards surrendered to satisfy tax withholding obligations or forfeitures of equity awards.\n(2)\nThe number of shares purchased reflects rounding adjustments.\n(3)\nThe remaining authorization outstanding for repurchases of common stock excludes $26 million and $25 million of excise taxes incurred on share repurchases for the years ended March 31, 2025 and 2024, respectively.\n(4)\nIn July 2023 and July 2024, the Board authorized the Company to repurchase up to an additional $6.0 billion and $4.0 billion shares of common stock, respectively, both of which have no expiration date.\nSelected Measures of Liquidity and Capital Resources\nMarch 31, \n(Dollars in millions)\n2025\n2024\nCash, cash equivalents, and restricted cash\n$\n5,956 \n$\n4,585 \nWorking capital\n(6,206)\n(4,387)\nDays sales outstanding for: \n(1)\nCustomer receivables\n22 \n22 \nInventories\n24 \n26 \nDrafts and accounts payable\n57 \n58 \nDebt to capital ratio \n(2)\n125.3 \n%\n124.0 \n%\n(1)\nBased on year-end balances and sales or cost of sales for the last 90 days of the year.\n(2)\nThis ratio describes the relationship and changes within our capital resources, and is computed as the sum of total debt divided by the sum of total debt and McKesson stockholders’ deficit, which excludes noncontrolling interests and accumulated other comprehensive loss.\nCash equivalents, which are readily convertible to known amounts of cash, are carried at fair value. Cash equivalents are primarily invested in AAA-rated U.S. government money market funds, short-term deposits with financial institutions, and short-term commercial papers issued by non-financial institutions. Deposits with financial institutions are primarily denominated in U.S. dollars and the functional currencies of our foreign subsidiaries, including Canadian dollars. Deposits could exceed the amounts insured by the Federal Deposit Insurance Corporation in the U.S. and similar deposit insurance programs in other jurisdictions. We mitigate the risk of our short-term investment portfolio by depositing funds with reputable financial institutions and monitoring risk profiles and investment strategies of money market funds.\n51\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nOur cash and cash equivalents balance as of March 31, 2025 and 2024 included approximately $2.9 billion and $1.6 billion, respectively, of cash held by our subsidiaries outside of the U.S. Our primary intent is to utilize this cash for foreign operations for an indefinite period of time. Although the majority of cash held outside the U.S. is available for repatriation, doing so could subject us to foreign withholding taxes and state income taxes. We may remit foreign earnings to the U.S. to the extent it is tax efficient to do so. We do not anticipate the tax impact from remitting these earnings to be material. Following enactment of the 2017 Tax Cuts and Jobs Act, the repatriation of cash to the U.S. is generally no longer taxable for federal income tax purposes.\nWorking capital primarily includes cash and cash equivalents, receivables, inventories, and prepaid expenses, net of drafts and accounts payable, short-term borrowings, current portion of long-term debt, current portion of operating lease liabilities, and other accrued liabilities. Our businesses require substantial investments in working capital that are susceptible to large variations during the year as a result of inventory purchase patterns and seasonal demands. Inventory purchase activity is a function of sales activity and other requirements.\nConsolidated working capital decreased at March 31, 2025 compared to the prior year primarily due to an increase in drafts and accounts payable from increased purchasing driven by increased sales and timing, and an increase in the current portion of long-term debt. These were partially offset by an increase in receivables, net and inventories, net, driven by higher sales and timing, an increase in cash and cash equivalents, and a decrease in other accrued liabilities.\nOur debt to capital ratio increased for the year ended March 31, 2025 compared to the prior year primarily due to share repurchases and dividend payments as well as repayments of long-term debt, partially offset by net income attributable to McKesson for the year and issuance of new long-term debt.\nIn July 2024, we raised our quarterly dividend from $0.62 to $0.71 per share of common stock for dividends declared on or after such date by the Board. Dividends were $2.75 per share in fiscal 2025 and $2.40 per share in fiscal 2024, and we paid total cash dividends of $345 million and $314 million in fiscal 2025 and fiscal 2024, respectively. We anticipate that we will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remain within the discretion of the Board and will depend upon our future earnings, financial condition, capital requirements, legal requirements, and other factors.\nMaterial Cash Requirements: \nThe table and information below presents our significant financial obligations and commitments as of\n \nMarch 31, 2025:\nYears\n(In millions)\nTotal\nWithin 1\nOver 1 to 3\nOver 3 to 5\nAfter 5\nOn balance sheet\nTotal debt\n (1)\n$\n5,654 \n$\n1,184 \n$\n1,612 \n$\n1,736 \n$\n1,122 \nOperating lease obligations\n (2) \n2,078 \n313 \n565 \n423 \n777 \nOther\n (3) \n72 \n18 \n10 \n22 \n22 \nOff balance sheet\nInterest on borrowings\n (4)\n1,240 \n179 \n330 \n245 \n486 \nPurchase obligations\n (5)\n8,823 \n8,804 \n11 \n7 \n1 \nOther \n(6)\n395 \n111 \n240 \n9 \n35 \nTotal\n$\n18,262 \n$\n10,609 \n$\n2,768 \n$\n2,442 \n$\n2,443 \n(1)\nRepresents maturities of the Company’s long-term obligations, including finance lease obligations. Refer to \nFinancial \nNote 11\n, “\nDebt and Financing Activities\n,” \nto the consolidated financial statements included in this Annual Report for more information. \n(2)\nRepresents undiscounted minimum operating lease obligations under non-cancelable operating leases having an initial remaining term over one year and is not adjusted for imputed interest. Refer to \nFinancial \nNote 9\n, “\nLeases\n,”\n to the consolidated financial statements included in this Annual Report for more information. \n(3)\nIncludes estimated benefit payments for our unfunded benefit plans and minimum funding requirements for our pension plans as well as the contingent consideration liability related to our acquisition of RxSS in November 2022. \n(4)\nRepresents interest that will become due on our fixed rate long-term debt obligations.\n52\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Concluded)\n(5)\nPrimarily relates to the expected purchase of goods and services, including inventory and capital commitments, from vendors in the normal course of business. \n(6)\nIncludes agreements under which we have guaranteed the repurchase of our customers’ inventory and our customers’ debt in the event these customers are unable to meet their obligations to those financial institutions. Refer to \nFinancial \nNote 16\n, “\nFinancial Guarantees and Warranties\n,”\n to the consolidated financial statements included in this Annual Report for more information. \nThe material cash requirements table above excludes the following obligations:\nAt March 31, 2025, the Company had accrued liabilities of $6.4 billion related to the settlement of opioid-related litigation claims with U.S. governmental entities, including Native American tribes, and certain non-governmental plaintiffs as described in \nFinancial \nNote 17\n, “\nCommitments and Contingent Liabilities\n,”\n to the consolidated financial statements included in this Annual Report. The majority of this amount relates to governmental entities opioid settlement payable in annual installments through 2038 pursuant to the schedule set forth in the agreement. As of March 31, 2025, $776 million is estimated to be paid within the next twelve months.\nAt March 31, 2025, the liability recorded for uncertain tax positions, excluding associated interest and penalties, was approximately $1.1 billion. The ultimate amount and timing of any related future cash settlements cannot be predicted with reasonable certainty. Refer to \nFinancial \nNote 6\n, “\nIncome Taxes\n,”\n to the consolidated financial statements included in this Annual Report for additional information on income tax matters.\nAt March 31, 2025, our banks and insurance companies have issued $206 million of standby letters of credit and surety bonds. These were issued on our behalf and are mostly related to our customer contracts and to meet the security requirements for statutory licenses and permits, court and fiduciary obligations, pension obligations in Europe, and our workers’ compensation and automotive liability programs.\nCapital Resources\nWe fund our working capital requirements primarily with cash and cash equivalents, proceeds from short-term borrowings from our commercial paper issuances, and longer-term credit agreements and debt offerings. Funds necessary for future debt maturities and our other cash requirements, including any future payments that may be made related to our total estimated litigation liability of $6.4 billion as of March 31, 2025 payable under the terms of various settlement agreements for opioid-related claims, are expected to be met by existing cash balances, cash flow from operations, existing credit sources, and future borrowings. Long-term debt markets and commercial paper markets, our primary sources of capital after cash flow from operations, are open and accessible to us should we decide to access those markets. Detailed information regarding our debt and financing activities is included in \nFinancial Note 11, “Debt and Financing Activities,”\n to the consolidated financial statements included in this Annual Report.\nWe believe that our future operating cash flow, financial assets, and access to capital and credit markets, including our credit facilities, give us the ability to meet our financing needs for the foreseeable future. However, there can be no assurance that an increase in volatility or disruption in the global capital and credit markets will not impair our liquidity or increase our costs of borrowing.\nRELATED PARTY BALANCES AND TRANSACTIONS \nInformation regarding our related party balances and transactions is included in \nFinancial \nNote 19\n, “\nRelated Party Balances and Transactions\n,”\n to the consolidated financial statements included in this Annual Report. \nNEW ACCOUNTING PRONOUNCEMENTS\nNew accounting pronouncements that we have recently adopted, as well as those that have been recently issued but not yet adopted by us, are included in \nFinancial \nNote 1\n, “\nSignificant Accounting Policies\n,”\n to the consolidated financial statements included in this Annual Report.\n53\nTable of Contents\nMcKESSON CORPORATION\nItem 7A.    Quantitative and Qualitative Disclosures about Market Risk.\nInterest rate risk:\n Our long-term debt bears interest predominately at fixed rates, whereas our short-term borrowings are at variable interest rates. Our cash and cash equivalents balances earn interest at variable rates. At March 31, 2025 and 2024, we had $5.7 billion and $4.6 billion, respectively, in cash and cash equivalents. At March 31, 2025 and 2024, we also had fixed-to-floating interest rate swaps with a total notional amount of $750 million and $1.3 billion, respectively. The effect of a hypothetical 50 basis points increase in the underlying interest rate on our cash and cash equivalents, net of short-term borrowings and fixed-to-floating interest rate swaps, would have resulted in a favorable impact of $8 million and $4 million to our earnings in fiscal 2025 and fiscal 2024, respectively.\nForeign currency exchange rate risk: \nWe conduct our business worldwide in U.S. dollars and the functional currencies of our foreign subsidiaries, primarily the Canadian dollar. We are also exposed to foreign currency exchange rate risk related to our foreign currency-denominated notes, intercompany loans denominated in non-functional currencies, and certain foreign subsidiaries, primarily the Euro, British pound sterling, and Canadian dollar. Changes in foreign currency exchange rates could have a material adverse impact on our financial results that are reported in U.S. dollars.\nIn September 2024, we announced an agreement to sell our Rexall and Well.ca businesses in Canada (“Canadian retail disposal group”). We completed the sale of the Canadian retail disposal group on December 30, 2024. In July 2021, we announced our intention to exit our businesses in Europe and completed the divestitures of our Austrian business in fiscal 2022, and the U.K. disposal group and the E.U. disposal group in fiscal 2023. Refer to \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n,”\n to the consolidated financial statements included in this Annual Report for more information on these divestitures. The completion of these divestitures has reduced our foreign currency exchange rate risk as it relates to the Euro and British pound sterling.\nWe have certain foreign currency exchange rate risk programs that utilize cross-currency swaps which are intended to reduce the income statement effects from fluctuations in foreign currency exchange rates and have been designated as net investment hedges, fair value hedges, or cash flow hedges. These programs reduce but do not entirely eliminate foreign currency exchange rate risk. However, our risk management programs are designed such that changes in the value of the underlying exposure would be largely offset by the potential changes in the value of the risk management portfolios. Refer to \nFinancial \nNote 14\n, “\nHedging Activities\n,”\n to the consolidated financial statements included in this Annual Report for more information on our cross-currency swaps.\nThe Company and its subsidiaries are periodically exposed to balances denominated in currencies other than their functional currency. At March 31, 2025 and 2024, the effect of a hypothetical adverse 10% change in the foreign currency exchange rates on underlying balances not reported in the functional currencies of the Company and these subsidiaries would not have resulted in a material impact to our earnings in fiscal 2025 or fiscal 2024. Refer to \nFinancial \nNote 1\n, “\nSignificant Accounting Policies\n,”\n under the section “\nForeign Currency Translation\n” for more information regarding our exposure to transactional gains and losses.\n54\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nItem 8.\n    \nFinancial Statements and Supplementary Data.\nINDEX TO CONSOLIDATED FINANCIAL INFORMATION\nPage\nManagement's Annual Report on Internal Control Over Financial Reporting\n56\nReport of Independent Registered Public Accounting Firm\n57\nConsolidated Financial Statements:\nConsolidated Statements of Operations for the years ended March 31, 2025, 2024, and 2023\n60\nConsolidated Statements of Comprehensive Income for the years ended March 31, 2025, 2024, and 2023\n61\nConsolidated Balance Sheets as of March 31, 2025 and 2024\n62\nConsolidated Statements of Stockholders’ Equity (Deficit) for the years ended March 31, 2025, 2024, and 2023\n63\nConsolidated Statements of Cash Flows for the years ended March 31, 2025, 2024, and 2023\n64\nFinancial Notes\n65\nNote 1 - Significant Accounting Policies\n65\nNote 2 - Business Acquisitions and Divestitures\n73\nNote 3 - Restructuring, Impairment, and Related Charges, Net\n77\nNote 4 - Share-Based Compensation\n79\nNote 5 - Other Income, Net\n82\nNote 6 - Income Taxes\n82\nNote 7 - Noncontrolling Interests\n \n87\nNote 8 - Earnings \nPer Common Share\n87\nNote 9 - Leases\n89\nNote 10 - Goodwill and Intangible Assets, Net\n91\nNote 11 - Debt and Financing Activities\n93\nNote 12 - Variable Interest Entities\n96\nNote 13 - Pension Benefits\n97\nNote 14 - Hedging Activities\n102\nNote 15 - Fair Value Measurements\n107\nNote 16 - Financial Guarantees and Warranties\n109\nNote 17 - Commitments and Contingent Liabilities\n110\nNote 18 - Stockholders' Equity (Deficit)\n116\nNote 19 - Related Party Balances and Transactions\n119\nNote 20 - Segments of Business\n119\n55\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nMANAGEMENT’S ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING \nThe management of McKesson Corporation is responsible for establishing and maintaining an adequate system of internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). With the participation of the Chief Executive Officer and the Chief Financial Officer, our management conducted an assessment of the effectiveness of our internal control over financial reporting based on the framework and criteria established in \nInternal Control—Integrated Framework (2013)\n, issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, our management has concluded that our internal control over financial reporting was effective as of March 31, 2025.\nDeloitte & Touche LLP, an independent registered public accounting firm, audited the financial statements included in this Annual Report on Form 10-K and has also audited the effectiveness of the Company’s internal control over financial reporting as of March 31, 2025. This audit report appears on the following page of this Annual Report on Form 10-K. \nMay 8, 2025 \n/s/ Brian S. Tyler\nBrian S. Tyler\nChief Executive Officer\n(Principal Executive Officer)\n/s/ Britt J. Vitalone\nBritt J. Vitalone\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\n56\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM \nTo the Stockholders and the Board of Directors of McKesson Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of McKesson Corporation and subsidiaries (the \"Company\") as of March 31, 2025, and 2024, the related consolidated statements of operations, comprehensive income, stockholders’ equity (deficit), and cash flows, for each of the three years in the period ended March 31, 2025, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the \"financial statements\"). We also have audited the Company’s internal control over financial reporting as of March 31, 2025, based on criteria established in \nInternal Control — Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). \nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of March 31, 2025, and 2024, and the results of its operations and its cash flows for each of the three years in the period ended March 31, 2025, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of March 31, 2025, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying \nManagement’s Annual Report on Internal Control Over Financial Reporting\n. Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n57\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nUncertain Tax Position, Opioid-Related Claims - refer to Note 1 and Note 6 to the financial statements\nCritical Audit Matter Description\nThe Company has recorded charges and related tax benefit for opioid-related claims. In order to account for the uncertainty associated with the ultimate realization of the income tax benefit related to opioid-related claims, the Company recorded an uncertain tax position reserve. Tax benefits from uncertain tax positions are recognized when, based upon the technical tax merits, it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes. The net amount of income tax benefit recognized by management is measured as the largest amount of tax benefit that is greater than 50 percent likely of being realized. The Company uses significant judgment in evaluating the technical tax merits of income tax benefits that qualify for recognition, including the determination of the amount that is more likely than not of being realized for U.S. federal and state income tax purposes.\nWe identified the Company’s uncertain tax position related to liabilities arising from opioid-related claims as a critical audit matter because of the challenges in auditing management’s estimate of the amount of income tax benefit that qualifies for recognition. Specifically, there is significant judgment associated with the assessment of the technical tax merits, including the related interpretation of applicable tax laws and regulations. Auditing the uncertain tax position related to liabilities arising from opioid-related claims required a high degree of auditor judgment and an increased extent of effort, including the need to involve our tax specialists.\n58\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company’s uncertain tax position associated with liabilities arising from opioid-related claims included the following, among others:\n•\nWe tested the effectiveness of the Company’s internal control related to management’s assessment of the technical merits of its tax position and the amount of benefit more likely than not to be realized related to liabilities arising from opioid-related claims. \n•\nWith the assistance of our income tax specialists, we evaluated the facts, evidence and the Company’s related income tax analysis for the uncertain tax position reserve associated with liabilities arising from opioid-related claims. \n•\nWe held inquiries with the Company’s internal and external income tax specialists related to the uncertain tax position for liabilities arising from opioid-related claims. \n•\nWe evaluated any events after March 31, 2025, that might affect management’s accounting treatment and related applicable disclosures. \n•\nWe obtained written representations from executives and internal legal counsel of the Company.\n•\nWe obtained and reviewed terms related to the Company’s settlements of opioid-related claims and evaluated them against the deductibility criteria set forth by relevant tax laws and regulations.\n•\nWe evaluated the Company’s related disclosures for consistency with our testing and also searched for contradictory evidence by reading disclosures from peer companies, who are also party to opioid-related litigation.\n/s/ \nDeloitte & Touche LLP\nDallas, Texas\nMay 8, 2025\nWe have served as the Company's auditor since 1968.\n59\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\n CONSOLIDATED STATEMENTS OF OPERATIONS\n(In millions, except per share amounts)\nYears Ended March 31, \n \n2025\n2024\n2023\nRevenues\n$\n359,051\n \n$\n308,951\n \n$\n276,711\n \nCost of sales\n(\n345,728\n)\n(\n296,123\n)\n(\n264,353\n)\nGross profit\n13,323\n \n12,828\n \n12,358\n \nSelling, distribution, general, and administrative expenses\n(\n8,507\n)\n(\n8,657\n)\n(\n7,776\n)\nClaims and litigation charges, net\n(\n108\n)\n(\n147\n)\n8\n \nRestructuring, impairment, and related charges, net\n(\n286\n)\n(\n115\n)\n(\n209\n)\nTotal operating expenses\n(\n8,901\n)\n(\n8,919\n)\n(\n7,977\n)\nOperating income\n4,422\n \n3,909\n \n4,381\n \nOther income, net\n202\n \n132\n \n497\n \nInterest expense\n(\n265\n)\n(\n252\n)\n(\n248\n)\nIncome from continuing operations before income taxes\n4,359\n \n3,789\n \n4,630\n \nIncome tax expense\n(\n878\n)\n(\n629\n)\n(\n905\n)\nIncome from continuing operations\n3,481\n \n3,160\n \n3,725\n \nLoss from discontinued operations, net of tax\n—\n \n—\n \n(\n3\n)\nNet income\n3,481\n \n3,160\n \n3,722\n \nNet income attributable to noncontrolling interests\n(\n186\n)\n(\n158\n)\n(\n162\n)\nNet income attributable to McKesson Corporation\n$\n3,295\n \n$\n3,002\n \n$\n3,560\n \nEarnings (loss) per common share attributable to McKesson Corporation\nDiluted\nContinuing operations\n$\n25.72\n \n$\n22.39\n \n$\n25.05\n \nDiscontinued operations\n—\n \n—\n \n(\n0.02\n)\nTotal\n$\n25.72\n \n$\n22.39\n \n$\n25.03\n \nBasic\nContinuing operations\n$\n25.86\n \n$\n22.54\n \n$\n25.25\n \nDiscontinued operations\n—\n \n—\n \n(\n0.02\n)\nTotal\n$\n25.86\n \n$\n22.54\n \n$\n25.23\n \nWeighted-average common shares outstanding\nDiluted\n128.1\n \n134.1\n \n142.2\n \nBasic\n127.4\n \n133.2\n \n141.1\n \nSee Financial Notes\n60\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n(In millions)\n \n \nYears Ended March 31, \n2025\n2024\n2023\nNet income \n$\n3,481\n \n$\n3,160\n \n$\n3,722\n \nOther comprehensive income (loss), net of tax\nForeign currency translation adjustments\n(\n74\n)\n(\n7\n)\n674\n \nUnrealized gains (losses) on cash flow and other hedges\n(\n7\n)\n39\n \n(\n63\n)\nChanges in retirement-related benefit plans\n30\n \n(\n8\n)\n62\n \nOther comprehensive income (loss), net of tax\n(\n51\n)\n24\n \n673\n \nComprehensive income\n3,430\n \n3,184\n \n4,395\n \nComprehensive income attributable to noncontrolling interests\n(\n186\n)\n(\n158\n)\n(\n206\n)\nComprehensive income attributable to McKesson Corporation\n$\n3,244\n \n$\n3,026\n \n$\n4,189\n \nSee Financial Notes\n61\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share amounts)\nMarch 31,\n2025\n2024\nASSETS\nCurrent assets\nCash and cash equivalents\n$\n5,691\n \n$\n4,583\n \nReceivables, net\n25,643\n \n21,622\n \nInventories, net\n23,001\n \n21,139\n \nPrepaid expenses and other\n1,063\n \n626\n \nTotal current assets\n55,398\n \n47,970\n \nProperty, plant, and equipment, net\n2,502\n \n2,316\n \nOperating lease right-of-use assets\n1,782\n \n1,729\n \nGoodwill\n10,022\n \n10,132\n \nIntangible assets, net\n1,464\n \n2,110\n \nOther non-current assets\n3,972\n \n3,186\n \nTotal assets\n$\n75,140\n \n$\n67,443\n \nLIABILITIES AND DEFICIT\nCurrent liabilities\nDrafts and accounts payable\n$\n55,330\n \n$\n47,097\n \nCurrent portion of long-term debt\n1,191\n \n50\n \nCurrent portion of operating lease liabilities\n258\n \n295\n \nOther accrued liabilities\n4,825\n \n4,915\n \nTotal current liabilities\n61,604\n \n52,357\n \nLong-term debt\n4,463\n \n5,579\n \nLong-term deferred tax liabilities\n1,029\n \n917\n \nLong-term operating lease liabilities\n1,478\n \n1,466\n \nLong-term litigation liabilities\n5,601\n \n6,113\n \nOther non-current liabilities\n2,659\n \n2,610\n \nCommitments and contingent liabilities (Note 17)\nMcKesson Corporation stockholders’ deficit\nPreferred stock, $\n0.01\n par value, \n100\n shares authorized, \nno\n shares issued or outstanding\n—\n \n—\n \nCommon stock, $\n0.01\n par value, \n800\n shares authorized, \n279\n and \n278\n shares issued at March 31, 2025 and 2024, respectively\n3\n \n3\n \nAdditional paid-in capital\n8,373\n \n8,048\n \nRetained earnings\n17,921\n \n14,978\n \nAccumulated other comprehensive loss\n(\n932\n)\n(\n881\n)\nTreasury shares, at cost, \n154\n and \n148\n shares at March 31, 2025 and 2024, respectively\n(\n27,439\n)\n(\n24,119\n)\nTotal McKesson Corporation stockholders’ deficit\n(\n2,074\n)\n(\n1,971\n)\nNoncontrolling interests\n380\n \n372\n \nTotal deficit\n(\n1,694\n)\n(\n1,599\n)\nTotal liabilities and deficit\n$\n75,140\n \n$\n67,443\n \nSee Financial Notes\n62\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY (DEFICIT)\n(In millions, except per share amounts)\nMcKesson Corporation Stockholders’ Equity (Deficit)\nCommon \nStock\nAdditional Paid-in Capital\nRetained Earnings\nAccumulated Other\nComprehensive\nLoss\nTreasury\nNoncontrolling\nInterests\nTotal\nEquity (Deficit)\nShares\nAmount\nCommon Shares\nAmount\nBalance, March 31, 2022\n275\n \n$\n2\n \n$\n7,275\n \n$\n9,030\n \n$\n(\n1,534\n)\n(\n130\n)\n$\n(\n17,045\n)\n$\n480\n \n$\n(\n1,792\n)\nIssuance of shares under employee plans, net of forfeitures\n2\n \n1\n \n163\n \n— \n— \n— \n(\n160\n)\n— \n4\n \nShare-based compensation\n— \n— \n161\n \n— \n— \n— \n— \n— \n161\n \nRepurchase of common stock\n— \n— \n127\n \n— \n— \n(\n11\n)\n(\n3,792\n)\n— \n(\n3,665\n)\nNet income\n— \n— \n— \n3,560\n \n— \n— \n— \n162\n \n3,722\n \nOther comprehensive income\n— \n— \n— \n— \n629\n \n— \n— \n44\n \n673\n \nCash dividends declared, $\n2.09\n per common share\n— \n— \n— \n(\n296\n)\n— \n— \n— \n— \n(\n296\n)\nPayments to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n150\n)\n(\n150\n)\nReclassification of recurring compensation to other accrued liabilities\n— \n— \n— \n— \n— \n— \n— \n(\n5\n)\n(\n5\n)\nFormation of SCRI Oncology, LLC\n— \n— \n22\n \n— \n— \n— \n— \n225\n \n247\n \nDerecognition of noncontrolling interests in McKesson Europe AG\n— \n— \n— \n— \n— \n— \n— \n(\n382\n)\n(\n382\n)\nOther\n— \n— \n(\n1\n)\n1\n \n— \n— \n— \n(\n7\n)\n(\n7\n)\nBalance, March 31, 2023\n277\n \n3\n \n7,747\n \n12,295\n \n(\n905\n)\n(\n141\n)\n(\n20,997\n)\n367\n \n(\n1,490\n)\nIssuance of shares under employee plans, net of forfeitures\n1\n \n— \n116\n \n— \n— \n— \n(\n99\n)\n— \n17\n \nShare-based compensation\n— \n— \n182\n \n— \n— \n— \n— \n— \n182\n \nRepurchase of common stock\n— \n— \n— \n— \n— \n(\n7\n)\n(\n3,023\n)\n— \n(\n3,023\n)\nNet income\n— \n— \n— \n3,002\n \n— \n— \n— \n158\n \n3,160\n \nOther comprehensive income\n— \n— \n— \n— \n24\n \n— \n— \n— \n24\n \nCash dividends declared, $\n2.40\n per common share\n— \n— \n— \n(\n320\n)\n— \n— \n— \n— \n(\n320\n)\nPayments to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n152\n)\n(\n152\n)\nOther\n— \n— \n3\n \n1\n \n— \n— \n— \n(\n1\n)\n3\n \nBalance, March 31, 2024\n278\n \n3\n \n8,048\n \n14,978\n \n(\n881\n)\n(\n148\n)\n(\n24,119\n)\n372\n \n(\n1,599\n)\nIssuance of shares under employee plans, net of forfeitures\n1\n \n— \n101\n \n— \n— \n— \n(\n148\n)\n— \n(\n47\n)\nShare-based compensation\n— \n— \n226\n \n— \n— \n— \n— \n— \n226\n \nRepurchase of common stock\n— \n— \n— \n— \n— \n(\n6\n)\n(\n3,172\n)\n— \n(\n3,172\n)\nNet income\n— \n— \n— \n3,295\n \n— \n— \n— \n186\n \n3,481\n \nOther comprehensive loss\n— \n— \n— \n— \n(\n51\n)\n— \n— \n— \n(\n51\n)\nCash dividends declared, $\n2.75\n per common share\n— \n— \n— \n(\n352\n)\n— \n— \n— \n— \n(\n352\n)\nPayments to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n178\n)\n(\n178\n)\nOther\n— \n— \n(\n2\n)\n—\n \n— \n— \n— \n—\n \n(\n2\n)\nBalance, March 31, 2025\n279\n \n$\n3\n \n$\n8,373\n \n$\n17,921\n \n$\n(\n932\n)\n(\n154\n)\n$\n(\n27,439\n)\n$\n380\n \n$\n(\n1,694\n)\nSee Financial Notes\n63\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions) \n \nYears Ended March 31, \n \n2025\n2024\n2023\nOPERATING ACTIVITIES\nNet income\n$\n3,481\n \n$\n3,160\n \n$\n3,722\n \nAdjustments to reconcile to net cash provided by operating activities:\nDepreciation\n242\n \n253\n \n248\n \nAmortization\n394\n \n382\n \n360\n \nLong-lived asset impairment charges\n98\n \n43\n \n72\n \nDeferred taxes\n(\n110\n)\n(\n603\n)\n(\n20\n)\nCharges (credits) associated with last-in, first-out inventory method\n82\n \n(\n157\n)\n1\n \nNon-cash operating lease expense\n245\n \n228\n \n249\n \nLoss (gain) from sales of businesses and investments\n485\n \n(\n17\n)\n(\n211\n)\nProvision for bad debts\n(\n130\n)\n819\n \n45\n \nOther non-cash items\n424\n \n233\n \n253\n \nChanges in assets and liabilities, net of acquisitions:\nReceivables\n(\n3,935\n)\n(\n2,954\n)\n(\n1,082\n)\nInventories\n(\n2,270\n)\n(\n1,294\n)\n(\n1,259\n)\nDrafts and accounts payable\n8,301\n \n4,587\n \n3,788\n \nOperating lease liabilities\n(\n404\n)\n(\n339\n)\n(\n338\n)\nTaxes\n(\n136\n)\n331\n \n363\n \nLitigation liabilities\n(\n401\n)\n(\n395\n)\n(\n1,088\n)\nOther\n(\n281\n)\n37\n \n56\n \nNet cash provided by operating activities\n6,085\n \n4,314\n \n5,159\n \nINVESTING ACTIVITIES\nPayments for property, plant, and equipment\n(\n537\n)\n(\n431\n)\n(\n390\n)\nCapitalized software expenditures\n(\n322\n)\n(\n256\n)\n(\n168\n)\nAcquisitions, net of cash, cash equivalents, and restricted cash acquired\n(\n24\n)\n(\n272\n)\n(\n867\n)\nProceeds from sales of businesses and investments, net\n179\n \n47\n \n1,077\n \nOther\n(\n29\n)\n(\n160\n)\n(\n194\n)\nNet cash used in investing activities\n(\n733\n)\n(\n1,072\n)\n(\n542\n)\nFINANCING ACTIVITIES\nProceeds from short-term borrowings\n15,086\n \n19,964\n \n8,450\n \nRepayments of short-term borrowings\n(\n15,086\n)\n(\n19,964\n)\n(\n8,450\n)\nProceeds from issuances of long-term debt\n498\n \n991\n \n997\n \nRepayments of long-term debt\n(\n519\n)\n(\n288\n)\n(\n1,274\n)\nPurchase of U.S. government obligations for the satisfaction and discharge of long-term debt\n—\n \n(\n647\n)\n—\n \nCommon stock transactions:\nIssuances\n101\n \n116\n \n163\n \nShare repurchases\n(\n3,146\n)\n(\n3,025\n)\n(\n3,638\n)\nDividends paid\n(\n345\n)\n(\n314\n)\n(\n292\n)\nOther\n(\n554\n)\n(\n175\n)\n(\n324\n)\nNet cash used in financing activities\n(\n3,965\n)\n(\n3,342\n)\n(\n4,368\n)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(\n16\n)\n6\n \n25\n \nCash, cash equivalents, and restricted cash classified as Assets held for sale\n—\n \n—\n \n470\n \nNet increase (decrease) in cash, cash equivalents, and restricted cash\n1,371\n \n(\n94\n)\n744\n \nCash, cash equivalents, and restricted cash at beginning of year\n4,585\n \n4,679\n \n3,935\n \nCash, cash equivalents, and restricted cash at end of year\n5,956\n \n4,585\n \n4,679\n \nLess: Restricted cash at end of year included in Prepaid expenses and other\n(\n265\n)\n(\n2\n)\n(\n1\n)\nCash and cash equivalents at end of year\n$\n5,691\n \n$\n4,583\n \n$\n4,678\n \nSUPPLEMENTAL CASH FLOW INFORMATION\nCash paid for:\nInterest, net\n$\n273\n \n$\n234\n \n$\n224\n \nIncome taxes, net of refunds\n1,124\n \n901\n \n562\n \nSee Financial Notes\n64\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES\n1.\n    \nSignificant Accounting Policies \nNature of Operations\n: McKesson Corporation together with its subsidiaries (collectively, the “Company” or “McKesson”) is a diversified healthcare services leader dedicated to advancing health outcomes for patients everywhere. McKesson partners with biopharma companies, care providers, pharmacies, manufacturers, governments, and others to deliver insights, products, and services to help make quality care more accessible and affordable. The Company reports its financial results in \nfour\n reportable segments: U.S. Pharmaceutical, Prescription Technology Solutions (“RxTS”), Medical-Surgical Solutions, and International. Refer to \nFinancial \nNote 20\n, “\nSegments of Business\n,”\n for additional information. \nBasis of Presentation: \nThe consolidated financial statements and accompanying notes are prepared in accordance with United States (“U.S.”) generally accepted accounting principles (“GAAP”). The consolidated financial statements of McKesson include the financial statements of all majority-owned or controlled companies. For those consolidated subsidiaries where the Company’s ownership is less than 100%, the portion of the net income or loss allocable to the noncontrolling interests is reported as “Net income attributable to noncontrolling interests” in the Consolidated Statements of Operations. All significant intercompany balances and transactions have been eliminated in consolidation, including the intercompany portion of transactions with equity method investees.\nThe Company considers itself to control an entity if it is the majority owner of or has voting control over such entity. The Company also assesses control through means other than voting rights and determines which business entity is the primary beneficiary of the variable interest entity (“VIE”). The Company consolidates VIEs when it is determined that it is the primary beneficiary of the VIE. Investments in business entities in which the Company does not have control, but instead has the ability to exercise significant influence over operating and financial policies, are accounted for using the equity method.\n \nFiscal Period: \nThe Company’s fiscal year begins on April 1 and ends on March 31. Unless otherwise noted, all references to a particular year shall mean the Company’s fiscal year.\nReclassifications\n: Certain prior period amounts have been reclassified to conform to the current year presentation.\nUse of Estimates\n: The preparation of financial statements in conformity with U.S. GAAP requires the Company to make estimates and assumptions that affect the reported amounts in the consolidated financial statements and accompanying notes. Actual amounts could differ from those estimated amounts.\nCash and Cash Equivalents\n: All highly liquid debt and money market instruments purchased with an original maturity of three months or less at the date of acquisition are included in cash and cash equivalents. Cash equivalents are carried at fair value. Cash equivalents are primarily invested in AAA-rated U.S. government money market funds, short-term deposits with financial institutions, and short-term commercial papers issued by non-financial institutions. Deposits with financial institutions are primarily denominated in U.S. dollars and the functional currencies of the Company’s foreign subsidiaries, including Canadian dollars, Euro, and British pounds sterling. Deposits could exceed the amounts insured by the Federal Deposit Insurance Corporation in the U.S. and similar deposit insurance programs in other jurisdictions. The Company mitigates the risk of its short-term investment portfolio by depositing funds with reputable financial institutions and monitoring risk profiles and investment strategies of money market funds.\nRestricted Cash\n: Cash that is subject to legal restrictions or is unavailable for general operating purposes is classified as restricted cash and is included in “Prepaid expenses and other” and “Other non-current assets” in the Consolidated Balance Sheets.\nEquity Method Investments:\n Investments in business entities in which the Company does not have control, but instead has the ability to exercise significant influence over operating and financial policies, are accounted for using the equity method. The Company evaluates its equity method investments for impairment whenever an event or change in circumstances occurs that could have a significant adverse impact on the carrying value of the investment. If a loss in value has occurred that is deemed to be other-than-temporary, an impairment loss is recorded.\n \nReceivables, Net and Allowances for Credit Losses: \nThe Company’s receivables are presented net of an allowance for credit losses and primarily consist of trade accounts receivable from customers that result from the sale of goods and services. Receivables, net also includes other receivables, which primarily represent amounts due from suppliers. \n65\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe Company is exposed to credit losses on accounts receivable balances. The Company estimates credit losses by considering historical credit losses, the current economic environment, customer credit ratings, collections on past due amounts, legal disputes, and bankruptcies, as well as reasonable and supportable forecasts to develop its allowance for credit losses. Management reviews these factors quarterly to determine if any adjustments are needed to the allowance. \nTrade accounts receivable represent the majority of the Company's financial assets, for which an allowance for credit losses of $\n450\n million and $\n864\n million were included in “Receivables, net” in the Consolidated Balance Sheets as of March 31, 2025 and 2024, respectively. The increase in the allowance for the year ended March 31, 2024 was primarily due to a provision for bad debts recognized of $\n725\n million related to the bankruptcy of the Company’s customer Rite Aid Corporation (including certain of its subsidiaries, “Rite Aid”). In October 2023, Rite Aid filed a voluntary petition for reorganization under Chapter 11 of the Bankruptcy Code and this amount represents the uncollected trade accounts receivable balance due from Rite Aid prior to its bankruptcy petition filing. During the year ended March 31, 2025, the Company reassessed its initial estimates made in conjunction with the previously reserved prepetition balances, including cash received during the period, resulting in a reversal of $\n206\n million recorded within “Selling, distribution, general, and administrative expenses” in the Company’s Consolidated Statements of Operations and included within the U.S. Pharmaceutical segment. During the year ended March 31, 2025, the Company released $\n237\n million of allowance for doubtful accounts against trade accounts receivables, representing the write-off of uncollectible receivables related to the Rite Aid provision in the Consolidated Balance Sheet.\n \nThe following table presents the components of the Company’s receivables as of March 31, 2025 and 2024:\nMarch 31, \n(In millions)\n2025\n2024\nCustomer accounts\n$\n22,281\n \n$\n19,439\n \nOther\n3,862\n \n3,104\n \nTotal receivables\n26,143\n \n22,543\n \nAllowances\n(\n500\n)\n(\n921\n)\nReceivables, net\n$\n25,643\n \n$\n21,622\n \nConcentrations of Credit Risk and Receivables: \nThe Company’s trade accounts receivable are subject to concentrations of credit risk with customers primarily in its U.S. Pharmaceutical segment. During fiscal 2025, sales to the Company’s ten largest customers, including group purchasing organizations (“GPOs”), accounted for approximately \n72\n% of its total consolidated revenues and approximately \n48\n% of total trade accounts receivable at March 31, 2025. Sales to the Company’s largest customer, CVS Health Corporation (“CVS”), accounted for approximately \n24\n% of its total consolidated revenues in fiscal 2025 and comprised approximately \n23\n% of total trade accounts receivable at March 31, 2025. As a result, the Company’s sales and credit concentration is significant. The Company has agreements with GPOs, each of which functions as a purchasing agent on behalf of member hospitals, pharmacies, and other healthcare providers, as well as with government entities and agencies. The accounts receivable balances are with individual members of the GPOs, and therefore no significant concentration of credit risk exists. A material default in payment, a material reduction in purchases from GPOs or any other large customers, or the loss of a large customer or customer groups could have a material adverse impact on the Company’s financial condition, results of operations, and liquidity. In addition, trade accounts receivables are subject to concentrations of credit risk with customers in the institutional, retail, and healthcare provider sectors, which can be affected by a downturn in the economy, changes in reimbursement policies, and other factors. This credit risk is mitigated by the size and diversity of the Company’s customer base as well as its geographic dispersion.\nInventories: \nInventories consist of merchandise held for resale. The Company reports inventories at the lower of cost or net realizable value, except for inventories determined using the last-in, first-out (“LIFO”) method which are valued at the lower of LIFO cost or market. The LIFO method presumes that the most recent inventory purchases are the first items sold and the inventory cost under LIFO approximates market. The majority of the cost of domestic inventories is determined using the LIFO method. The majority of the cost of inventories held in foreign and certain domestic locations is based on the first-in, first-out (“FIFO”) method or weighted-average purchase prices. Rebates, cash discounts, and other incentives received from vendors are recognized in cost of sales upon the sale of the related inventory.\n66\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nAt March 31, 2025 and 2024, total inventories, net were $\n23.0\n billion and $\n21.1\n billion, respectively, in the Company’s Consolidated Balance Sheets. The LIFO method was used to value approximately \n63\n% and \n62\n% of the Company’s inventories at March 31, 2025 and 2024, respectively. If the Company had used the moving average method of inventory valuation, inventories would have been approximately $\n309\n million and $\n227\n million higher than the amounts reported at March 31, 2025 and 2024, respectively. These amounts are equivalent to the Company’s LIFO reserves. A LIFO charge is recognized when the net effect of price increases on pharmaceutical and non-pharmaceutical products held in inventory exceeds the impact of price declines, including the effect of branded pharmaceutical products that have lost market exclusivity. A LIFO credit is recognized when the net effect of price declines exceeds the impact of price increases on pharmaceutical and non-pharmaceutical products held in inventory. The Company recognized a LIFO charge of $\n82\n million in fiscal 2025, a LIFO credit of $\n157\n million in fiscal 2024, and a LIFO charge of $\n1\n million in fiscal 2023, all within “Cost of sales” in its Consolidated Statements of Operations. The LIFO charge in fiscal 2025 compared to a LIFO credit in fiscal 2024 was primarily due to higher brand inflation in the current fiscal year. The LIFO credit in fiscal 2024 compared to a LIFO charge in fiscal 2023 was primarily due to lower brand inflation, offset by higher brand inventory levels, lower deflation from off patent launch activity, and lower generics deflation. The Company’s LIFO valuation amount includes both pharmaceutical and non-pharmaceutical products. \nThe Company believes that the moving average inventory costing method provides a reasonable estimation of the current cost of replacing inventory (i.e., “market”). As such, its LIFO inventory is valued at the lower of LIFO cost or market. As of March 31, 2025 and 2024, inventories at LIFO did not exceed market.\nShipping and Handling Costs:\n The Company includes costs to pack and deliver inventory to its customers in “Selling, distribution, general, and administrative expenses” in its Consolidated Statements of Operations. Shipping and handling costs of $\n1.1\n billion, $\n1.1\n billion, and $\n1.2\n billion were recognized in fiscal 2025, fiscal 2024, and fiscal 2023, respectively.\nHeld for Sale: \nAssets and liabilities to be disposed of by sale (“disposal groups”) are classified as “held for sale” if their carrying amounts are principally expected to be recovered through a sale transaction rather than through continuing use. The classification occurs when the disposal group is available for immediate sale and the sale is probable. These criteria are generally met when management has committed to a plan to sell the assets within one year. Disposal groups are measured at the lower of carrying amount or fair value less costs to sell, and long-lived assets included within the disposal group are not depreciated or amortized. The fair value of a disposal group, less any costs to sell, is assessed during each reporting period it remains classified as held for sale, and any remeasurement to the lower of carrying value or fair value less costs to sell is reported as an adjustment to the carrying value of the disposal group. When the net realizable value of a disposal group increases during a period, a gain can be recognized to the extent that it does not increase the value of the disposal group beyond its original carrying value when the disposal group was reclassified as held for sale. Refer to \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n,”\n for additional information.\nProperty, Plant, and Equipment, Net: \nProperty, plant, and equipment, net is stated at historical cost and depreciated under the straight-line method over the estimated useful life of each asset, which ranges from \n15\n to \n30\n years for building and improvements and \nthree\n to \n15\n years for machinery, equipment, and other. Leasehold improvements and property, plant, and equipment, net under finance leases are amortized over their respective useful lives of the right-of-use (“ROU”) asset or over the term of the lease, whichever is shorter. Depreciation and amortization begins when an asset is placed in service and ready for its intended use. Repairs and maintenance costs are expensed as incurred. When certain events or changes in circumstances indicate that the carrying amount of an asset or asset group may not be recoverable, an impairment assessment may be performed on the recoverability of the carrying amounts.\n \n67\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe following table presents the components of the Company’s property, plant, and equipment, net as of March 31, 2025 and 2024:\nMarch 31,\n(In millions)\n2025\n2024\nLand\n$\n104\n \n$\n109\n \nBuilding and improvements\n1,433\n \n1,482\n \nMachinery, equipment, and other\n2,772\n \n2,751\n \nConstruction in progress\n722\n \n441\n \nTotal property, plant, and equipment\n5,031\n \n4,783\n \nAccumulated depreciation and amortization \n(\n2,529\n)\n(\n2,467\n)\nProperty, plant, and equipment, net\n$\n2,502\n \n$\n2,316\n \nTotal depreciation expense for property, plant, and equipment, net and amortization of the ROU assets of finance leases was $\n272\n million, $\n279\n million, and $\n272\n million for the years ended March 31, 2025, 2024, and 2023, respectively.\nLeases:\n The Company leases facilities and equipment primarily under operating leases. The Company recognizes lease expense on a straight-line basis over the term of the lease, taking into account, when applicable, lessor incentives for tenant improvements, periods where no rent payment is required, and escalations in rent payments over the term of the lease. As a practical expedient, the Company does not separate lease components from non-lease components, such as common area maintenance, utilities, and repairs and maintenance. Remaining terms for facility leases generally range from \none\n to \n15\n years, while remaining terms for equipment leases generally range from \none\n to \nfive years\n. Most real property leases contain renewal options (typically for \nfive-year\n increments). Generally, the renewal option periods are not included within the lease term as the Company is not reasonably certain to exercise that right at lease commencement. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nOperating ROU assets and operating lease liabilities are recognized at the lease commencement date. ROU assets represent the Company’s right to use an underlying asset for the lease term and operating lease liabilities represent its obligation to make lease payments arising from the lease. Operating lease liabilities are recognized based on the present value of the future lease payments over the lease term, discounted at the Company’s incremental borrowing rate as the implicit rate in the lease is not readily determinable for most of the Company’s leases. The Company estimates the discount rate as its incremental borrowing rate based on qualitative factors including Company specific credit rating, lease term, general economics, and the interest rate environment. Operating lease liabilities are recorded in “Current portion of operating lease liabilities” and “Long-term operating lease liabilities,” and the corresponding lease assets are recorded in “Operating lease right-of-use assets” in the Company’s Consolidated Balance Sheets. Finance lease assets are included in “Property, plant, and equipment, net” and finance lease liabilities are included in “Current portion of long-term debt” and “Long-term debt” in the Company’s Consolidated Balance Sheets. As a practical expedient, short-term leases with an initial term of 12 months or less are excluded from the Consolidated Balance Sheets and charges from these leases are expensed as incurred.\nAs a lessor, the Company primarily leases certain owned equipment, classified as direct financing or sales-type leases, to physician practices.\nRefer to \nFinancial \nNote 9\n, “\nLeases\n,\n” for additional information on the Company’s leases.\nGoodwill: \nGoodwill is tested for impairment on an annual basis in the first fiscal quarter and more frequently if indicators of potential impairment exist. Impairment testing is conducted at the reporting unit level, which is generally defined as an operating segment or one level below an operating segment (also known as a component), for which discrete financial information is available and segment management regularly reviews the operating results.\nThe Company applies the goodwill impairment test by comparing the estimated fair value of a reporting unit to its carrying value and recording an impairment charge equal to the amount of excess carrying value above the estimated fair value, if any, but not to exceed the amount of goodwill allocated to the reporting unit.\n68\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nTo estimate the fair value of its reporting units, the Company generally uses a combination of the market approach and the income approach. Under the market approach, it estimates fair value by comparing the business to similar businesses, or guideline companies whose securities are actively traded in public markets. Under the income approach, it uses a discounted cash flow (“DCF”) model in which cash flows anticipated over future periods, plus a terminal value at the end of that time horizon, are discounted to their present value using an appropriate rate that is commensurate with the risk inherent within the reporting unit. Other estimates inherent in both the market and income approaches include long-term growth rates, projected revenues, and earnings and cash flow forecasts for the reporting units. In addition, the Company compares the aggregate of the reporting units’ fair values to the Company’s market capitalization as further corroboration of the fair values. Goodwill testing requires a complex series of assumptions and judgments by management in projecting future operating results, selecting guideline public companies for comparisons, and assessing risks. The use of alternative assumptions and estimates could affect the fair values and change the impairment determinations.\nIntangible Assets: \nCurrently all of the Company’s identifiable intangible assets are subject to amortization and are amortized based on the pattern of their economic consumption or on a straight-line basis over their estimated useful lives, ranging from \none\n to \n25\n years. The Company reviews intangible assets for impairment at an asset group level whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. Determination of recoverability is based on the lowest level of identifiable estimated future undiscounted cash flows resulting from the use of the asset and its eventual disposition. Measurement of any impairment loss is based on the excess of the carrying value of the asset group over its estimated fair value. The Company also performs a periodic review of its intangible assets and removes from the balance sheet fully amortized intangible assets that no longer provide an economic benefit, are no longer in use, or for which the related contract has expired. During the year ended March 31, 2024, the Company removed from the balance sheet $\n1.4\n billion of fully amortized gross intangible assets and the corresponding accumulated amortization.\nCapitalized Software Held for Internal Use: \nThe Company capitalizes costs of software held for internal use during the application development stage of a project and amortizes those costs using the straight-line method over their estimated useful lives, not to exceed \n10\n years. As of March 31, 2025 and 2024, capitalized software held for internal use was $\n681\n million and $\n495\n million, respectively, net of accumulated amortization of $\n657\n million and $\n560\n million, respectively, and is included in “Other non-current assets” in the Consolidated Balance Sheets. Costs incurred during the preliminary project and post-implementation stages are expensed as incurred. Amortization expense for capitalized software held for internal use was $\n135\n million, $\n102\n million, and $\n101\n million for the years ended March 31, 2025, 2024, and 2023, respectively. The Company performs a periodic review of its capitalized software held for internal use and removes from the balance sheet fully amortized capitalized software costs that are determined to no longer be in use. During the year ended year ended March 31, 2024, the Company removed from the balance sheet $\n1.0\n billion of fully amortized gross capitalized software held for internal use and the corresponding accumulated amortization.\nInsurance Programs:\n The Company maintains insurance programs through its wholly-owned captive insurance subsidiaries (“Captives”) from which it obtains coverage for various exposures, including certain exposures arising from the opioid-related claims of governmental entities against the Company as discussed in more detail in \nFinancial \nNote 17\n, “\nCommitments and Contingent Liabilities\n,”\n as well as those risks required to be insured by law or contract. It is the Company’s policy to retain a significant portion of certain losses, including those related to workers’ compensation and comprehensive general, product, and vehicle liability. Provisions for losses expected under insurance programs are recorded based on the Company’s estimate of the aggregate liability for claims incurred as well as for claims incurred but not yet reported. Such estimates utilize certain actuarial assumptions followed in the insurance industry. The Captives receive direct premiums, which are eliminated on consolidation against the Company’s premium costs within “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations.\nRevenue Recognition:\n Revenue is recognized when an entity satisfies a performance obligation by transferring control of a promised good or service to a customer in an amount that reflects the consideration to which the entity expects to be entitled for that good or service.\n69\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nRevenues generated from the distribution of pharmaceutical and medical products represent the majority of the Company’s revenues. The Company orders product from the manufacturer, receives and carries the product at its central distribution facilities, and delivers the product directly to its customers’ warehouses, hospitals, or retail pharmacies. The distribution business primarily generates revenue from a contract related to a confirmed purchase order with a customer in a distribution arrangement. Revenue is recognized when control of goods is transferred to the customer which occurs upon the Company’s delivery to the customer or upon customer pick-up. The Company also earns revenues from a variety of other sources including its retail, services, and technology businesses. Retail revenues are recognized at the point of sale. Service revenues, including technology service revenues, are recognized when services are rendered. Revenues derived from distribution and retail business at the point of sale represent approximately \n99\n%, \n98\n%, and \n99\n% of total revenues for the years ended March 31, 2025, 2024, and 2023, respectively. Revenues derived from services represent approximately \n1\n%, \n2\n%, and \n1\n% of total revenues for the years ended March 31, 2025, 2024, and 2023, respectively. \nRevenues are recorded gross when the Company is the principal in the transaction, has the ability to direct the use of the goods or services prior to transfer to a customer, is responsible for fulfilling the promise to its customer, has latitude in establishing prices, and controls the relationship with the customer. The Company records its revenues net of sales taxes. Revenues are measured based on the amount of consideration that the Company expects to receive, reduced by estimates for return allowances, discounts, and rebates using historical data. Sales returns from customers were approximately $\n2.9\n billion, $\n3.0\n billion, and $\n3.1\n billion for the years ended March 31, 2025, 2024, and 2023, respectively. Assets for the right to recover products from customers and the associated refund liabilities for return allowances were not material as of March 31, 2025 and 2024. Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as fulfillment costs. The Company records deferred revenues when payments are received or due in advance of its performance. Deferred revenues are primarily from the Company’s services arrangements and are recognized as revenues over the periods when services are performed. \nThe Company had no material contract assets, contract liabilities, or deferred contract costs recorded in its Consolidated Balance Sheets as of March 31, 2025 and 2024. The Company generally expenses costs to obtain a contract as incurred when the amortization period is less than one year.\n \nSupplier Incentives:\n Fees for services and other incentives received from suppliers, relating to the purchase or distribution of inventory, are considered product discounts and are generally reported as a reduction to cost of sales.\n \nSupplier Reserves: \nThe Company establishes reserves against amounts due from suppliers relating to various fees for services and price and rebate incentives, including deductions taken against payments otherwise due to it. These reserve estimates are established based on judgment after considering the status of current outstanding claims, historical experience with the suppliers, the specific incentive programs, and any other pertinent information available. The Company evaluates the amounts due from suppliers on a continual basis and adjusts the reserve estimates when appropriate based on changes in facts and circumstances. Adjustments to supplier reserves are generally included in cost of sales unless consideration from the vendor is in exchange for distinct goods or services or for pass-through rebate purchases. The ultimate outcome of any outstanding claims could be different than the Company’s estimate. The supplier reserves primarily pertain to the Company’s U.S. Pharmaceutical segment.\nIncome Taxes:\n The Company accounts for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or the tax returns. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial statements and the tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. Tax benefits from uncertain tax positions are recognized when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, based on the technical merits. The amount recognized is measured as the largest amount of tax benefit that is greater than 50% likely of being realized.\nInterest Expense\n: Interest expense primarily includes interest for the Company’s long-term debt obligations, commercial paper, net interest settlements of interest rate swaps, and the amortization of deferred issuance costs and original issue discounts on debt.\n \n70\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nForeign Currency Translation:\n The reporting currency of the Company and its subsidiaries is the U.S. dollar. Its foreign subsidiaries generally consider their local currency to be their functional currency. Foreign currency-denominated assets and liabilities of these foreign subsidiaries are translated into U.S. dollars at period-end exchange rates, while revenues and expenses are translated at average exchange rates during the corresponding period and stockholders’ equity or deficit accounts are primarily translated at historical exchange rates. Foreign currency translation adjustments are included in “Other comprehensive income (loss), net of tax” in the Consolidated Statements of Comprehensive Income, and the cumulative effect is included in the stockholders’ deficit section of the Consolidated Balance Sheets. Gains and losses from currency exchange transactions are recorded in “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations and were not material for the years ended March 31, 2025, 2024, and 2023. The Company releases cumulative translation adjustments from stockholders’ equity or deficit into earnings as a gain or loss only upon a complete or substantially complete liquidation of a controlling interest in a subsidiary or a group of assets within a foreign entity. It also releases all or a pro-rata portion of the cumulative translation adjustments into earnings upon the sale of an equity method investment that is a foreign entity or has a foreign component.\nDerivative Financial Instruments:\n Derivative financial instruments are used principally in the management of foreign currency exchange and interest rate exposures and are recorded in the Consolidated Balance Sheets at fair value. The Company uses cross-currency swaps to hedge the changes in the fair value of its foreign currency notes resulting from changes in benchmark interest rates and foreign currency exchange rates. The Company also uses floating interest rate swaps to hedge the changes in the fair value of its U.S. dollar notes resulting from changes in benchmark interest rates. If a derivative is designated as a fair value hedge, the changes in the fair value of the derivative and of the hedged item attributable to the hedged risk are recognized in earnings. The Company has used foreign currency-denominated notes and uses cross-currency swaps to hedge a portion of its net investment in its foreign subsidiaries. The Company uses cash flow hedges primarily to reduce the effects of foreign currency exchange rate risk related to intercompany loans denominated in non-functional currencies. The Company also uses forward contracts to hedge the variability of future benchmark interest rates on any planned bond issuances and to offset the potential income statement effects from obligations denominated in non-functional currencies. If the financial instrument is designated as a cash flow hedge or net investment hedge, the effective portions of changes in the fair value of the derivative are included in “Other comprehensive income (loss), net of tax” in the Consolidated Statements of Comprehensive Income, and the cumulative effect is included in the stockholders’ deficit section of the Consolidated Balance Sheets. The cumulative changes in fair value are reclassified to the same line as the hedged item in the Consolidated Statements of Operations when the hedged item affects earnings. The Company evaluates hedge effectiveness at inception and on an ongoing basis, and ineffective portions of changes in the fair value of cash flow hedges and net investment hedges are recognized in earnings following the date when ineffectiveness was identified. Any cash flows received or paid as part of the termination of derivative financial instruments are classified within the Consolidated Statements of Cash Flows in accordance with the nature of the hedged item. Derivative instruments not designated as hedges are marked-to-market at the end of each accounting period with the change included in earnings. Refer to \nFinancial \nNote 14\n, “\nHedging Activities\n,”\n for additional information. \nComprehensive Income: \nComprehensive income consists of two components: net income and other comprehensive income or loss. Other comprehensive income or loss refers to revenue, expenses, as well as gains and losses that are recorded as an element of stockholders’ deficit but are excluded from earnings. The Company’s other comprehensive income or loss primarily consists of foreign currency translation adjustments from those subsidiaries where the local currency is the functional currency, including gains and losses on net investment hedges, as well as unrealized gains and losses on cash flow hedges and\n \nunrealized gains and losses on retirement-related benefit plans.\n \nNoncontrolling Interests: \nNoncontrolling interests represent the portion of profit or loss, net assets, and comprehensive income or loss that is not allocable to McKesson Corporation. Net income attributable to noncontrolling interests includes third-party equity interests in the Company’s consolidated entities, including: ClarusONE Sourcing Services LLP (“ClarusONE”), a joint venture established between McKesson and Walmart Inc. in fiscal 2017; Vantage Oncology Holdings, LLC (“Vantage”), a provider of integrated oncology and radiation services acquired in fiscal 2017; and SCRI Oncology, LLC (“SCRI Oncology”), an oncology research business formed in fiscal 2023. Net income attributable to noncontrolling interests also included recurring compensation that the Company was obligated to pay to the noncontrolling shareholders of McKesson Europe AG (“McKesson Europe”), formerly known as Celesio AG, under the domination and profit and loss transfer agreement. The Company’s noncontrolling interest in McKesson Europe was included in the divestiture of certain of the Company’s businesses in the European Union (“E.U.”) in October 2022.\n71\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nShare-Based Compensation:\n The Company accounts for all share-based compensation transactions at fair value. The share-based compensation expense, for the portion of the awards that is ultimately expected to vest, is recognized on a straight-line basis over the requisite service period. The Company estimates the number of share-based awards that will ultimately vest primarily based on historical experience. The estimated forfeiture rate established upon grant is re-assessed throughout the requisite service period and is adjusted when actual forfeitures occur. The actual forfeitures in future reporting periods could be higher or lower than current estimates. The share-based compensation expense recognized is classified in the Consolidated Statements of Operations in the same manner as cash compensation paid to the Company’s employees and included in “Selling, distribution, general, and administrative expenses.” Refer to \nFinancial \nNote 4\n, “\nShare-Based Compensation\n,”\n for additional information.\nLoss Contingencies:\n The Company is subject to various claims, including, but not limited to, claims with customers and vendors, pending and potential legal actions for damages, investigations relating to governmental laws and regulations, and other matters arising out of the normal conduct of its business. When a loss is considered probable and reasonably estimable, the Company records a liability in the amount of its best estimate for the ultimate loss. However, the likelihood of a loss with respect to a particular contingency is often difficult to predict and determining a meaningful estimate of the loss or a range of loss may not be practicable based on the information available and the potential effect of future events and decisions by third parties that will determine the ultimate resolution of the contingency. Moreover, it is not uncommon for such matters to be resolved over many years, during which time relevant developments and new information must be reevaluated at least quarterly to determine both the likelihood of potential loss and whether it is possible to reasonably estimate the loss or a range of possible loss. When a material loss is reasonably possible, or probable but a reasonable estimate cannot be made, disclosure of the proceeding is provided. The Company expenses legal fees as incurred when the legal services are provided.\nThe Company reviews all material contingencies at least quarterly to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the loss or a range of the loss can be made. As discussed above, development of a meaningful estimate of loss or a range of potential loss is complex when the outcome is directly dependent on negotiations with or decisions by third parties, such as regulatory agencies, the court system, and other interested parties. Refer to \nFinancial \nNote 17\n, “\nCommitments and Contingent Liabilities\n,” f\nor additional information related to controlled substances claims to which the Company is a party.\nRestructuring Charges\n: Restructuring charges are incurred for programs in which the Company changes its operations, the scope of a business undertaken by its business units, or the manner in which that business is conducted as well as long-lived asset impairments. Such charges may include employee severance, retention bonuses, facility closure or consolidation costs, lease or contract termination costs, asset impairments, accelerated depreciation and amortization, and other related expenses. The restructuring programs may be implemented due to the sale or discontinuation of a product line, reorganization or management structure changes, headcount rationalization, realignment of operations or products, integration of acquired businesses, and/or company-wide cost saving initiatives. The amount and/or frequency of these restructuring charges are not part of the Company’s underlying business, which include normal levels of reinvestment in the business. Employee severance costs are generally recognized when payments are probable and amounts are reasonably estimable. Costs related to contracts without future benefit or contract termination are recognized at fair value at the earlier of the contract termination or the cease-use dates. Other exit-related costs are expensed as incurred. Restructuring charges may also include credit adjustments due to subsequent changes in estimates. Refer to \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n,\n” for additional information.\nBusiness Combinations:\n The Company accounts for business combinations using the acquisition method of accounting whereby the identifiable assets and liabilities of the acquired business, including contingent consideration, as well as any noncontrolling interest in the acquired business, are recorded at their estimated fair values as of the date that the Company obtains control of the acquired business. Any purchase consideration in excess of the estimated fair values of the net assets acquired is recorded as goodwill. Acquisition-related expenses and related restructuring costs are expensed as incurred. \nSeveral valuation methods may be used to determine the fair value of assets acquired and liabilities assumed. For intangible assets, the Company typically uses a variation of the income approach, whereby a forecast of future cash flows attributable to the asset is discounted to present value using a risk-adjusted discount rate. Some of the more significant estimates and assumptions inherent in the income approach include the amount and timing of projected future cash flows, the discount rate selected to measure the risks inherent in the future cash flows, and the assessment of the asset’s expected useful life.\n72\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nContingent consideration liabilities are measured at their fair value as of the acquisition date using unobservable inputs. These inputs include the estimated amount and timing of projected operational and financial information, the probability of achievement of performance milestones or other agreed-upon events, and the risk-adjusted discount rate used to calculate the present value of the probability-weighted projected financial information. Contingent liabilities are remeasured to fair value at each reporting date until the liability is resolved. Changes in any of the inputs could result in a significant adjustment to the fair value.\nTreasury Stock:\n The Company records purchases of treasury stock at cost, which is reflected as a reduction to stockholders’ equity in the Company’s Consolidated Balance Sheets. Incremental direct costs to purchase treasury stock, including any excise tax recognized as a result of the IRA, are included in the cost of the shares acquired. Treasury stock also includes shares withheld to satisfy the tax obligations of recipients of share-based compensation. Refer to \nFinancial Note 18, “Stockholders' Equity (Deficit),\"\n for additional information.\nRecently Adopted Accounting Pronouncements\nIn the fourth quarter of fiscal 2025, the Company adopted Accounting Standards Update (“ASU”) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which expands reportable segment disclosures by requiring disclosure, on an annual and interim basis, of significant segment expenses that are regularly provided to the chief operating decision maker (“CODM”) and included within each reported measure of segment profit or loss, as well as an amount and description of other segment items. The guidance also requires interim disclosures of a reportable segment’s profit or loss and assets, disclosure of the title and position of the CODM, and an explanation of how the CODM uses the reported measure of segment profit or loss in assessing performance and allocating resources. The adoption of this amended guidance resulted in changes in disclosures but did not have an impact on the Company’s Consolidated Statements of Operations, Comprehensive Income (Loss), Balance Sheets, or Cash Flows.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosure\ns. ASU 2023-09 improves the transparency of income tax disclosures by requiring, on an annual basis, consistent categories, and greater disaggregation of information in the rate reconciliation as well as income taxes paid disaggregated by jurisdiction. The update is effective for fiscal years beginning after December 15, 2024, with early adoption permitted. The amendments in this update should be applied prospectively, although optional retrospective application is permitted. While this accounting standard will increase disclosures related to the Company’s income taxes, it will not have a material impact on the Company’s Consolidated Financial Statement results. \nIn November 2024, the FASB issued ASU 2024-03,\n Income Statement – Reporting Comprehensive Income – Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. \nASU 2024-03 requires disclosure of certain costs and expenses on an interim and annual basis in the notes to the financial statements. ASU 2024-03 is effective for the Company for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, as clarified by ASU 2025-01,\n Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40)\n. Early adoption is permitted. The Company is currently evaluating the impact that this guidance will have on its disclosures.\n \n2.    \nBusiness Acquisitions and Divestitures \nAcquisitions \nRx Savings Solutions, LLC\nOn November 1, 2022, the Company completed its acquisition of \n100\n% of the shares of Rx Savings Solutions, LLC (“RxSS”), a privately-owned company headquartered in Overland Park, Kansas, to further connect biopharma and payer services to patients. RxSS is a prescription price transparency and benefit insight company that offers affordability and adherence solutions to health plans and employers. The purchase consideration included a payment of $\n600\n million in cash made upon closing and a maximum of $\n275\n million of contingent consideration based on RxSS’ operational and financial performance through calendar year 2025. The payment made upon closing was funded from cash on hand. The financial results of RxSS are included in the Company’s RxTS segment as of the acquisition date. The transaction was accounted for as a business combination.\n73\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe Company recorded a liability for the contingent consideration at its fair value of $\n92\n million as of the acquisition date. The fair value of the contingent consideration liability was estimated using a Monte Carlo simulation model, utilizing internal cash flow projections which are Level 3 inputs under Accounting Standards Codification (“ASC”) Topic 820, \nFair Value Measurements and Disclosures\n. The contingent consideration liability will be remeasured to fair value at each reporting date until the liability is settled with changes in fair value being recognized within “Selling, distribution, general, and administrative expenses” in the Company’s Consolidated Statements of Operations. During the year ended March 31, 2024, the Company recognized fair value adjustment gains of $\n78\n million, which reduced its contingent consideration liability, based on the estimated amount and timing of projected operational and financial information and the probability of achievement of performance milestones. As of March 31, 2025 and 2024, the current portion of the contingent consideration liability of $\n14\n million is included within “Other accrued liabilities.” Recognition of the initial fair value of this contingent consideration was a non-cash investing activity.\nThe purchase price allocation included acquired identifiable intangible assets of $\n229\n million, primarily representing customer relationships and technology with a weighted average amortization period of \n12\n years, and goodwill of $\n463\n million. Goodwill has been allocated to the Company’s RxTS segment, which reflects the expected future benefits from certain synergies and intangible assets that do not qualify for separate recognition. Goodwill attributable to the acquisition is deductible for tax purposes.\nThe following table summarizes the final purchase price allocation for this acquisition:\n(In millions)\nAmounts Recognized\nas of Acquisition Date\n(Final)\nPurchase consideration:\nCash\n$\n600\n \nContingent consideration\n92\n \nTotal purchase consideration\n$\n692\n \nIdentifiable assets acquired and liabilities assumed:\nCurrent assets\n$\n5\n \nIntangible assets\n229\n \nOther non-current assets\n3\n \nCurrent liabilities\n(\n8\n)\nTotal identifiable net assets\n229\n \nGoodwill\n463\n \nNet assets acquired\n$\n692\n \nSCRI Oncology, LLC\nOn October 31, 2022, the Company completed a transaction with HCA Healthcare, Inc. (“HCA”) to form SCRI Oncology, an oncology research business combining McKesson’s U.S. Oncology Research (“USOR”) and HCA’s Sarah Cannon Research Institute (“SCRI”) based in Nashville, Tennessee, to advance cancer care and increase access to oncology clinical research. McKesson owns a \n51\n% controlling interest in the combined business, and the financial results are consolidated by the Company and reported within its U.S. Pharmaceutical segment as of the acquisition date. Transaction consideration included the transfer of full ownership interest in USOR to the combined business and $\n166\n million of net cash paid to HCA, which was funded from cash on hand. The transaction was accounted for as a business combination.\n74\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe purchase price allocation included acquired identifiable intangible assets of $\n177\n million, primarily representing customer relationships as well as trademarks and trade names with a weighted average amortization period of \n17\n years, and goodwill of $\n113\n million. Goodwill has been allocated to the Company’s U.S. Pharmaceutical segment, which reflects the expected future benefits from certain synergies and intangible assets that do not qualify for separate recognition. Goodwill attributable to the acquisition of $\n46\n million is deductible for tax purposes. The Company recorded noncontrolling interest of $\n225\n million as a component of equity, which includes HCA’s proportionate interest in the identifiable net assets of SCRI at fair value of $\n202\n million and its proportionate interest in the contributed net assets of USOR at carrying value of $\n23\n million. The difference between the fair value of the Company’s acquired interest in SCRI net assets and the $\n166\n million of net cash paid to HCA was recognized as additional paid in capital, as well as the Company’s reduction in ownership interest in USOR net assets. \nThe following table summarizes the final purchase price allocation for this acquisition:\n(In millions)\nAmounts Recognized\nas of Acquisition Date\n(Final)\nPurchase consideration:\nCash\n$\n166\n \nContribution of USOR\n46\n \nTotal purchase consideration\n$\n212\n \nIdentifiable assets acquired and liabilities assumed:\nReceivables\n$\n224\n \nProperty, plant, and equipment\n22\n \nOperating lease right-of-use assets\n31\n \nIntangible assets\n177\n \nOther non-current assets\n6\n \nCurrent liabilities\n(\n42\n)\nLong-term operating lease liabilities\n(\n29\n)\nOther non-current liabilities\n(\n43\n)\nTotal identifiable net assets\n346\n \nNoncontrolling interest\n(\n225\n)\nAdditional paid-in capital\n(\n22\n)\nGoodwill\n113\n \nNet assets acquired\n$\n212\n \nThe fair value of the acquired identifiable intangible assets from the acquisitions discussed above were determined by applying the income approach, using a discounted cash flow model in which cash flows anticipated over several periods are discounted to their present value using an appropriate rate that is commensurate with the risk inherent with the transaction. These inputs are considered Level 3 inputs under the fair value measurements and disclosure guidance. The Company’s fair value assessments of these acquisitions were finalized upon completion of the measurement period in the third quarter of fiscal 2024. There were no material changes to the purchase price allocations since the respective acquisition dates. Pro forma financial information has not been provided as these acquisitions did not have a material impact, individually, or in the aggregate, to the Company’s consolidated results of operations.\n75\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nDivestitures\nCanada Divestiture Activities\nOn December 30, 2024, the Company completed the sale of its Rexall and Well.ca businesses in Canada (“Canadian retail disposal group”) for an adjusted purchase price consisting of a cash payment of $\n9\n million, received at closing, and a note of $\n120\n million, measured at fair value and accruing interest upon satisfaction of certain conditions, and payable to the Company at the end of \nsix years\n. Within the International segment and as part of the transaction, the Company divested net assets of $\n741\n million, including $\n125\n million of intercompany trade accounts payable primarily related to purchases of inventories from McKesson Canada assumed by the buyer upon divestiture. The Company determined that the disposal group did not meet the criteria for classification as discontinued operations.\nDuring the year ended March 31, 2025, the Company recorded net charges of $\n667\n million within “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations, to remeasure the Canadian retail disposal group to fair value less costs to sell. The remeasurement adjustment for the year ended March 31, 2025 includes a $\n48\n million loss related to the accumulated other comprehensive loss balances associated with the Canadian retail disposal group. The Company’s measurement of the fair value of the Canadian retail disposal group was based on the total consideration expected to be received by the Company as outlined in the transaction agreements. Certain components of the total consideration included Level 3 fair value measurements.\nEuropean Divestiture Activities\nIn July 2021, the Company announced its intention to exit its businesses in Europe (“European Divestiture Activities”), as discussed in more detail below. Net gains related to these divestiture activities during the year ended March 31, 2023 were not material. The gains and charges for fiscal 2023 were recorded within “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations. The Company determined that the disposal groups did not meet the criteria for classification as discontinued operations.\nOn October 31, 2022, the Company completed its previously announced transaction to sell certain of its businesses in the E.U. located in France, Italy, Ireland, Portugal, Belgium, and Slovenia, along with its German headquarters and wound-care business, part of a shared services center in Lithuania, and its ownership stake in a joint venture in the Netherlands (“E.U. disposal group”) to the PHOENIX Group. As part of the transaction, the Company received cash proceeds of $\n892\n million and divested net assets of $\n1.3\n billion, including cash of $\n319\n million, derecognized the carrying value of its noncontrolling interest held by minority shareholders of McKesson Europe of $\n382\n million, and released $\n153\n million of net accumulated other comprehensive loss. During the year ended March 31, 2023 the Company recorded net gains of $\n66\n million to remeasure the E.U. disposal group to fair value less costs to sell. The Company’s measurement of the fair value of the E.U. disposal group was based on the total consideration received by the Company as outlined in the transaction agreement. Certain components of the total consideration included fair value measurements that fall within Level 3 of the fair value hierarchy.\nAt March 31, 2025 and 2024, the Company had no assets or liabilities related to European divestiture activities that met the criteria for classification as held for sale. Subsequent to the divestiture activities discussed above, the Company’s European operations primarily consist of its retail and distribution businesses in Norway\n.\nOther\nFor the periods presented, the Company also completed de minimis acquisitions and divestitures within its operating segments. Financial results for the Company’s business acquisitions have been included in its consolidated financial statements as of their respective acquisition dates. Purchase prices for business acquisitions have been allocated based on estimated fair values at the respective acquisition dates.\nOn April 2, 2025, the Company announced the completion of its previously announced acquisition of a controlling interest in PRISM Vision Holdings, LLC (“PRISM Vision”), a leading provider of general ophthalmology and retina management services. The Company acquired an approximate \n80\n% interest in PRISM Vision for approximately $\n850\n million. PRISM Vision physicians retained an approximate \n20\n% interest. The financial results of PRISM Vision will be reported within the Company’s U.S. Pharmaceutical segment.\n76\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n3.    \nRestructuring, Impairment, and Related Charges, Net \nThe Company recorded \nrestructuring, impairment, and related charges, net\n of $\n344\n million, $\n115\n million, and $\n209\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively. Of these charges $\n286\n million were included in “Restructuring, impairment, and related charges, net” and $\n58\n million was included in “Cost of sales” in the Consolidated Statement of Operations for the year ended March 31, 2025.\nRestructuring Initiatives\nDuring the second quarter of fiscal 2025, the Company approved enterprise-wide initiatives to modernize and accelerate the technology service operating model, which are intended to improve business continuity, compliance, operating efficiency and advance investments to streamline the organization. These initiatives included cost reduction efforts and support other rationalization efforts within Corporate, and the Medical-Surgical Solutions, and U.S. Pharmaceutical segments to help realize long-term sustainable growth. The Company anticipates total charges related to these initiatives of $\n650\n million to $\n700\n million, consisting primarily of employee severance and other employee-related costs as well as facility, exit, and other related costs, including long-lived asset impairments. These programs are anticipated to be substantially complete in fiscal 2028. For the year ended March 31, 2025, the Company recorded charges of $\n298\n million related to the initiatives, which primarily includes severance and other employee-related costs as well as facility exit and other related costs, including long-lived asset impairments.\nDuring the fourth quarter of fiscal 2023, the Company approved a broad set of initiatives to drive operational efficiencies and increase cost optimization efforts, with the intent of simplifying its infrastructure and realizing long-term sustainable growth. These initiatives included headcount reductions, primarily consisting of employee severance and other employee-related costs within the RxTS segment, and the exit or downsizing of certain facilities. The Company recorded charges of $\n45\n million and $\n60\n million for the years ended March 31, 2024 and 2023 related to this program, respectively, primarily consisting of employee severance and other employee-related costs within its RxTS segment, asset impairments and accelerated depreciation, including certain asset impairments primarily within its U.S. Pharmaceutical segment and real estate charges within Corporate, as well as facility and other exit-related costs. This restructuring program was substantially complete in fiscal 2024. \nFiscal 2025 \nRestructuring, impairment, and related charges, net for the year ended March 31, 2025 consisted of the following:\nYear Ended March 31, 2025\n(In millions)\nU.S. Pharmaceutical \n(1)\nPrescription Technology Solutions \nMedical-Surgical Solutions \n(2)\nInternational\nCorporate \nTotal\nSeverance and employee-related costs, net\n$\n(\n2\n)\n$\n—\n \n$\n137\n \n$\n—\n \n$\n3\n \n$\n138\n \nExit and other-related costs \n(3)\n3\n \n3\n \n53\n \n—\n \n49\n \n108\n \nAsset impairments and accelerated depreciation\n58\n \n9\n \n14\n \n1\n \n16\n \n98\n \nTotal\n$\n59\n \n$\n12\n \n$\n204\n \n$\n1\n \n$\n68\n \n$\n344\n \n(1)\nIncludes costs related to operational efficiencies and cost optimization efforts described above to support the Company’s U.S. Pharmaceutical segment, including an inventory impairment of $\n58\n million within \"Cost of sales\" in the Consolidated Statement of Operations.\n(2)\nIncludes costs related to operational efficiencies and cost optimization efforts described above to support the Company’s Medical-Surgical Solutions segment.\n(3)\nExit and other-related costs consist of accruals for costs to be incurred without future economic benefits, project consulting fees, and other exit costs expensed as incurred. \n77\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nFiscal 2024\nRestructuring, impairment, and related charges, net for the year ended March 31, 2024 consisted of the following:\nYear Ended March 31, 2024\n(In millions)\nU.S. Pharmaceutical \nPrescription Technology Solutions\n (1)\nMedical-Surgical Solutions \nInternational\nCorporate\n (1)\nTotal\nSeverance and employee-related costs, net\n$\n10\n \n$\n—\n \n$\n(\n1\n)\n$\n2\n \n$\n(\n1\n)\n$\n10\n \nExit and other-related costs \n(2)\n3\n \n11\n \n12\n \n9\n \n27\n \n62\n \nAsset impairments and accelerated depreciation \n4\n \n—\n \n—\n \n10\n \n29\n \n43\n \nTotal\n$\n17\n \n$\n11\n \n$\n11\n \n$\n21\n \n$\n55\n \n$\n115\n \n(1)\nIncludes costs related to operational efficiencies and cost optimization efforts described above to support the Company’s technology solutions.\n(2)\nExit and other-related costs consist of accruals for costs to be incurred without future economic benefits, project consulting fees, and other exit costs expensed as incurred. \nFiscal 2023\nRestructuring, impairment, and related charges, net for the year ended March 31, 2023 consisted of the following:\nYear Ended March 31, 2023\n(In millions)\nU.S. Pharmaceutical \n(1)\nPrescription Technology Solutions \n(1)\nMedical-Surgical Solutions\nInternational\nCorporate\n (1) \nTotal\nSeverance and employee-related costs, net\n$\n6\n \n$\n23\n \n$\n2\n \n$\n4\n \n$\n—\n \n$\n35\n \nExit and other-related costs \n(2)\n7\n \n7\n \n3\n \n21\n \n64\n \n102\n \nAsset impairments and accelerated depreciation\n25\n \n13\n \n5\n \n10\n \n19\n \n72\n \nTotal\n$\n38\n \n$\n43\n \n$\n10\n \n$\n35\n \n$\n83\n \n$\n209\n \n(1)\nIncludes costs related to operational efficiencies and cost optimization efforts described above to support the Company’s technology solutions.\n(2)\nExit and other-related costs consist of accruals for costs to be incurred without future economic benefits, project consulting fees, and other exit costs expensed as incurred. Corporate includes costs for business transformation and optimization efforts related to the Company’s technology organization. The International segment includes costs related to the Company’s European divestitures.\n \n78\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe following table summarizes the activity related to the liabilities associated with the Company’s restructuring initiatives for the years ended March 31, 2025 and 2024: \n(In millions)\nU.S. Pharmaceutical\nPrescription Technology Solutions\nMedical-Surgical Solutions\nInternational\nCorporate\nTotal\nBalance, March 31, 2023 \n(1) \n$\n15\n \n$\n26\n \n$\n3\n \n$\n13\n \n$\n35\n \n$\n92\n \nRestructuring, impairment, and related charges, net\n17\n11\n \n11\n \n21\n \n55\n \n115\nNon-cash charges\n(\n4\n)\n—\n \n—\n \n(\n10\n)\n(\n29\n)\n(\n43\n)\nCash payments\n(\n15\n)\n(\n32\n)\n(\n13\n)\n(\n5\n)\n(\n40\n)\n(\n105\n)\nOther \n(2)\n5\n \n—\n \n—\n \n(\n9\n)\n—\n \n(\n4\n)\nBalance, March 31, 2024 \n(3)\n18\n \n5\n \n1\n \n10\n \n21\n \n55\n \nRestructuring, impairment, and related charges, net\n59\n \n12\n \n204\n \n1\n \n68\n \n344\n \nNon-cash charges\n(\n58\n)\n(\n9\n)\n(\n14\n)\n(\n1\n)\n(\n16\n)\n(\n98\n)\nCash payments\n(\n8\n)\n(\n4\n)\n(\n99\n)\n(\n2\n)\n(\n51\n)\n(\n164\n)\nOther \n(2)\n(\n1\n)\n(\n3\n)\n(\n2\n)\n(\n7\n)\n2\n \n(\n11\n)\nBalance, March 31, 2025 \n(4)\n$\n10\n \n$\n1\n \n$\n90\n \n$\n1\n \n$\n24\n \n$\n126\n \n(1)    As of March 31, 2023, the total reserve balance was $\n92\n million, of which $\n66\n million was recorded in “Other accrued liabilities” and $\n26\n million was recorded in “Other non-current liabilities” in the Company’s Consolidated Balance Sheet. \n(2)    Other primarily includes cumulative translation adjustments as well as adjustments to Canadian retail disposal group reserves within International in fiscal 2025, and transfers to certain other liabilities for the remainder segments.\n(3)    As of March 31, 2024, the total reserve balance was $\n55\n million, of which $\n24\n million was recorded in “Other accrued liabilities” and $\n31\n million was recorded in “Other non-current liabilities” in the Company’s Consolidated Balance Sheet.\n(4)    As of March 31, 2025, the total reserve balance was $\n126\n million, of which $\n103\n million was recorded in “Other accrued liabilities” and $\n23\n million was recorded in “Other non-current liabilities” in the Company’s Consolidated Balance Sheet.\nLong-Lived Asset Impairments\nFiscal 2025\nThere were \nno\n material long-lived asset impairments recorded in fiscal 2025.\nFiscal 2024\nThere were \nno\n material long-lived asset impairments recorded in fiscal 2024.\nFiscal 2023\nThere were \nno\n material long-lived asset impairments recorded in fiscal \n2023\n.\n4.    \nShare-Based Compensation\nThe Company provides share-based compensation to its employees, officers, and non-employee directors, including restricted stock units (“RSUs”), performance-based stock units (“PSUs”), and an employee stock purchase plan (“ESPP”) (collectively, “share-based awards”). Most of the share-based awards are granted in the first quarter of each fiscal year.\nShare-based compensation expense for the share-based awards is recognized for the portion of awards ultimately expected to vest. The Company estimates the number of share-based awards that will ultimately vest primarily based on historical experience. The estimated forfeiture rate established upon grant is re-assessed throughout the requisite service period and is adjusted when actual forfeitures occur. The actual forfeitures in future reporting periods could be higher or lower than current estimates.\nShare-based compensation expense is classified in the Consolidated Statements of Operations in the same manner as cash compensation paid to the Company’s employees and included in “Selling, distribution, general, and administrative expenses.”\n79\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nImpact on Net Income\nThe components of share-based compensation expense and related tax benefits were as follows:\nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nRestricted stock unit awards\n (1)\n$\n211\n \n$\n168\n \n$\n149\n \nEmployee stock purchase plan\n15\n \n14\n \n13\n \nShare-based compensation expense \n226\n \n182\n \n162\n \nTax benefit for share-based compensation expense\n(\n85\n)\n(\n72\n)\n(\n87\n)\nShare-based compensation expense, net of tax\n$\n141\n \n$\n110\n \n$\n75\n \n(1)\nIncludes share-based compensation expense recognized for RSUs and PSUs.\nStock Plans\nIn April 2022, the Company’s stockholders approved the McKesson Corporation 2022 Stock Plan (the “2022 Stock Plan”), which permits the grant of awards in the form of restricted stock, RSUs, PSUs, stock options, and other share-based awards to selected employees, officers, and non-employee directors. As of March 31, 2025, \n4.2\n million shares remain available for future grant under the 2022 Stock Plan.\nRestricted Stock Unit Awards\nRSUs entitle the holder to receive a specified number of shares of the Company’s common stock which vest over a period of generally \nthree\n to \nfour years\n as determined by the Compensation Committee at the time of grant. The fair value of the award is determined based on the price of the Company’s common stock on the grant date and the related share-based compensation expense is recognized over the vesting period on a straight-line basis. \nNon-employee directors receive an annual grant of RSUs, which vest immediately and are expensed upon grant. The director may elect to receive the underlying shares immediately or defer receipt of the shares if they meet director stock ownership guidelines. The shares will be automatically deferred for those directors who do not meet the director stock ownership guidelines. At March 31, 2025, approximately \n33,000\n RSUs for the Company’s directors were vested.\nPerformance Stock Unit Awards\nPSUs are conditional upon the attainment of market and performance objectives over a specified period. The number of vested PSUs is assessed at the end of a \nthree-year\n performance period upon attainment of meeting certain earnings per share targets, average return on invested capital, and for certain participants, total shareholder return relative to a peer group of companies. The Company uses the Monte Carlo simulation model to measure the fair value of the total shareholder return portion of the PSUs. The earnings per share portion of the PSUs is measured at the grant date market price. PSUs have a requisite service period of generally \nthree years\n. Expense is attributed to the requisite service period on a straight-line basis based on the fair value of the PSUs, adjusted for the performance modifier at the end of each reporting period. For PSUs that are designated as equity awards, the fair value is measured at the grant date.\n80\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe weighted-average assumptions used in the Monte Carlo valuations were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nExpected stock price volatility\n21\n \n%\n24\n \n%\n34\n \n%\nExpected dividend yield\n0.5\n \n%\n0.6\n \n%\n0.6\n \n%\nRisk-free interest rate\n4.5\n \n%\n3.9\n \n%\n2.7\n \n%\nExpected life (in years)\n3\n3\n3\nThe following table summarizes activity for RSUs and PSUs during fiscal 2025:\n(In millions, except per share data)\nShares\nWeighted-\nAverage\nGrant Date Fair\nValue Per Share\nNonvested, March 31, 2024\n1.4\n \n$\n307.73\n \nGranted\n0.4\n \n559.18\n \nCancelled\n(\n0.1\n)\n419.14\n \nVested\n(\n0.8\n)\n254.53\n \nNonvested, March 31, 2025\n0.9\n \n$\n434.89\n \nThe following table provides data related to RSU and PSU award activity: \nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nTotal fair value of shares vested\n$\n192\n \n$\n143\n \n$\n200\n \nTotal compensation cost, net of estimated forfeitures, related to nonvested restricted stock unit awards not yet recognized, pre-tax\n$\n191\n \n$\n205\n \n$\n192\n \nWeighted-average period in years over which restricted stock unit award cost is expected to be recognized\n1\n2\n2\nEmployee Stock Purchase Plan\nThe Company has an ESPP under which \n23.1\n million shares have been authorized for issuance. The ESPP allows eligible employees to purchase shares of the Company’s common stock through payroll deductions. The deductions occur over \nthree-month\n purchase periods and the shares are then purchased at \n85\n% of the market price at the end of each purchase period. Employees are allowed to terminate their participation in the ESPP at any time during the purchase period prior to the purchase of the shares, subject to the Company’s insider trading policies and procedures. The \n15\n% discount provided to employees on these shares is included in share-based compensation expense. The shares related to funds outstanding at the end of a quarter are included in the calculation of diluted weighted-average shares outstanding. These amounts have not been significant for all the years presented. The Company recognizes costs for employer matching contributions as ESPP expense over the relevant purchase period. Shares issued under the ESPP were not material in fiscal 2025, fiscal 2024, and fiscal 2023. At March 31, 2025, \n3.3\n million shares remain available for issuance.\n81\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n 5.    \nOther Income, Net\nOther income, net consists of the following:\nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nInterest income \n(1)\n$\n173\n \n$\n118\n \n$\n107\n \nEquity in earnings, net\n9\n \n4\n \n5\n \nNet gains (losses) on investments in equity securities \n(2)\n58\n \n(\n24\n)\n106\n \nOther, net \n(3)\n(\n38\n)\n34\n \n279\n \nTotal\n$\n202\n \n$\n132\n \n$\n497\n \n(1)\nThe increase in interest income for fiscal 2025 compared to fiscal 2024 is primarily due to higher investable cash in fiscal 2025. The increase in fiscal 2024 compared to fiscal 2023 is primarily due to higher interest rates on certain cash balances. \n(2)\nRepresents net realized and unrealized gains and losses as well as impairment charges on the Company’s investments in equity securities of certain U.S. growth stage companies in the healthcare industry. These net gains and losses primarily relate to mark-to-market adjustments for investments which are measured at fair value based on changes in the observable price of the securities and realized gains on the disposal of certain of these investments. Includes net gains of $\n101\n million related to investments in equity securities of certain U.S. growth stage companies in the healthcare industry, partially offset by a loss of $\n43\n million related to an equity method investment for the year ended March 31, 2025. Included a gain of $\n142\n million for the year ended March 31, 2023 related to the exit of one of the Company’s investments in equity securities in July 2022 for proceeds of $\n179\n million. Refer to \nFinancial \nNote 15\n, “\nFair Value Measurements\n,” for more information on these types of investments.\n(3)\nOther, net for all periods presented includes income recognized from finance charges to customers primarily for late fees. \nOther, net for the year ended March 31, 2025 includes charges of $\n87\n million related to the termination of the U.K. pension plan. Refer to \nFinancial Note 13, “Pension Benefits\n,” for more detail. \nOther, net for year ended March 31, 2023 includes the following:\n•\na gain of $\n126\n million related to a cash payment received for the early termination of a tax receivable agreement (“TRA”) exercised by Change Healthcare Inc. (“Change”) in October 2022. The Company was a party to a TRA entered into as part of the formation of the joint venture with Change, from which McKesson has since exited and in October 2022, Change exercised its right pursuant to the TRA to terminate the agreement; and \n•\na gain of $\n97\n million recognized from the termination of certain forward-starting fixed interest rate swaps, as discussed in more detail in \nFinancial Note 14, “Hedging Activities.\"\n6.    \nIncome Taxes\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nIncome from continuing operations before income taxes\nU.S.\n$\n3,735\n \n$\n2,597\n \n$\n3,308\n \nForeign\n624\n \n1,192\n \n1,322\n \nIncome from continuing operations before income taxes\n$\n4,359\n \n$\n3,789\n \n$\n4,630\n \n82\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nIncome tax expense related to continuing operations consists of the following: \nYears Ended March 31,\n(In millions, except percentages)\n2025\n2024\n2023\nCurrent\nFederal\n$\n552\n \n$\n867\n \n$\n619\n \nState\n182\n \n231\n \n126\n \nForeign\n254\n \n134\n \n180\n \nTotal current\n988\n \n1,232\n \n925\n \nDeferred\nFederal\n102\n \n(\n360\n)\n(\n46\n)\nState\n5\n \n(\n133\n)\n36\n \nForeign\n(\n217\n)\n(\n110\n)\n(\n10\n)\nTotal deferred\n(\n110\n)\n(\n603\n)\n(\n20\n)\nIncome tax expense \n$\n878\n \n$\n629\n \n$\n905\n \nReported income tax rate\n20.1\n \n%\n16.6\n \n%\n19.5\n \n%\nFluctuations in the Company’s reported income tax rates are primarily due to changes in the business mix of earnings between various taxing jurisdictions, including the impact of non-cash pre-tax charges related to the remeasurement of the Canadian retail disposal group to fair value less costs to sell as described in \nFinancial Note 2, \"Business Acquisitions and Divestitures,\"\n and recognized discrete tax items. \nThe reconciliation of income tax expense and the amount computed by applying the statutory federal income tax rate of \n21.0\n% to income before income taxes was as follows:\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nIncome tax expense at federal statutory rate\n$\n915\n \n$\n796\n \n$\n972\n \nState income taxes, net of federal tax benefit\n145\n \n104\n \n134\n \nTax effect of foreign operations\n(\n25\n)\n(\n16\n)\n(\n85\n)\nForeign-derived intangible income\n(\n83\n)\n(\n67\n)\n(\n60\n)\nUnrecognized tax benefits and settlements\n91\n \n116\n \n6\n \nNet tax benefit on intellectual property repatriation and sales\n(\n258\n)\n(\n104\n)\n—\n \nCanadian disposal transaction loss\n140\n \n—\n \n—\n \nValuation allowance release\n—\n \n(\n157\n)\n—\n \nShare-based compensation\n(\n42\n)\n(\n37\n)\n(\n58\n)\nOther, net\n(\n5\n)\n(\n6\n)\n(\n4\n)\nIncome tax expense\n$\n878\n \n$\n629\n \n$\n905\n \n \n83\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nDuring the year ended March 31, 2025, the Company recognized a net discrete tax benefit of $\n258\n million related to the sales of certain intellectual property between McKesson wholly-owned legal entities based in foreign tax jurisdictions. The transferor entities of the intellectual property were not subject to income tax on their transaction. The recipient entities of the intellectual property are entitled to amortize the fair value of the assets for tax purposes. As a result of these transactions, and in accordance with ASU 2016-16, \nIntra-Entity Transfers of Assets Other Than Inventory\n, net discrete tax benefits of $\n44\n million and $\n214\n million were recognized in the second and fourth quarters of fiscal 2025, respectively.\nDuring the year ended March 31, 2024, the Company recognized a net discrete tax benefit of $\n157\n million related to the release of a valuation allowance based on management’s reassessment of the amount of its deferred tax assets that are more likely than not to be realized.\nDuring the year ended March 31, 2024, the Company also repatriated certain intellectual property between McKesson wholly-owned legal entities that are based in different tax jurisdictions. The transferor entity of the intellectual property was not subject to income tax on this transaction. The recipient entity of the intellectual property is entitled to amortize the fair value of the assets for tax purposes. As a result of this repatriation and in accordance with ASU 2016-16, \nIntra-Entity Transfers of Assets Other Than Inventory\n, a net discrete tax benefit of $\n147\n million was recognized in the first quarter of fiscal 2024. In addition, the Company sold certain intellectual property between McKesson wholly-owned legal entities that are based in different tax jurisdictions, where the transferor entity was subject to income tax and the recipient entity is entitled to amortize the fair value of the assets for tax purposes. As a result of this sale, a net discrete tax expense of $\n43\n million was recognized in the fourth quarter of fiscal 2024.\nDuring the year ended March 31, 2023, the Company recognized discrete tax benefits primarily consisting of $\n115\n million related to statute of limitation expirations and tax settlements in various taxing jurisdictions and $\n58\n million related to the tax impact of share-based compensation.\n84\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nDeferred tax balances consisted of the following:\nMarch 31, \n(In millions)\n2025\n2024\nAssets\nReceivable allowances\n$\n136\n \n$\n244\n \nOpioid-related litigation and claims\n680\n \n680\n \nCompensation and benefit-related accruals\n287\n \n277\n \nNet operating loss and credit carryforwards\n847\n \n751\n \nLease obligations\n423\n \n438\n \nCapitalized research and development cost\n68\n \n60\n \nIntangibles\n66\n \n5\n \nOther\n170\n \n147\n \nSubtotal\n2,677\n \n2,602\n \nLess: valuation allowance\n(\n644\n)\n(\n653\n)\nTotal assets\n2,033\n \n1,949\n \nLiabilities\nInventory valuation and other assets\n(\n2,139\n)\n(\n2,092\n)\nFixed assets \n(\n72\n)\n(\n16\n)\nLease right-of-use assets\n(\n434\n)\n(\n431\n)\nOther\n(\n50\n)\n(\n10\n)\nTotal liabilities\n(\n2,695\n)\n(\n2,549\n)\nNet deferred tax liability\n$\n(\n662\n)\n$\n(\n600\n)\nLong-term deferred tax asset\n$\n367\n \n$\n317\n \nLong-term deferred tax liability\n(\n1,029\n)\n(\n917\n)\nNet deferred tax liability\n$\n(\n662\n)\n$\n(\n600\n)\nThe Company assesses the available positive and negative evidence to determine whether deferred tax assets are more likely than not to be realized. As a result of this assessment, valuation allowances have been recorded on certain deferred tax assets in various tax jurisdictions. The valuation allowances were approximately $\n644\n million and $\n653\n million in fiscal 2025 and fiscal 2024, respectively, and primarily relate to net operating and capital losses. \nThe Company has federal, state, and foreign net operating loss carryforwards of $\n40\n million, $\n4.1\n billion, and $\n1.3\n billion at March 31, 2025, respectively. Federal and state net operating losses will expire at various dates from 2026 through 2045. Substantially all its foreign net operating losses have indefinite lives. In addition, the Company has foreign capital loss carryforwards of $1.3 billion with indefinite lives. \n85\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe following table summarizes the activity related to the Company’s gross unrecognized tax benefits for the last three fiscal years:\nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nUnrecognized tax benefits at beginning of period\n$\n1,463\n \n$\n1,399\n \n$\n1,523\n \nAdditions based on tax positions related to prior years\n33\n \n10\n \n—\n \nReductions based on tax positions related to prior years\n(\n43\n)\n(\n2\n)\n(\n26\n)\nAdditions based on tax positions related to current year\n97\n \n64\n \n21\n \nReductions based on settlements\n(\n13\n)\n(\n8\n)\n(\n96\n)\nReductions based on the lapse of the applicable statutes of limitations\n(\n7\n)\n(\n2\n)\n(\n16\n)\nExchange rate fluctuations\n2\n \n2\n \n(\n7\n)\nUnrecognized tax benefits at end of period\n$\n1,532\n \n$\n1,463\n \n$\n1,399\n \nAs of March 31, 2025, the Company had $\n1.5\n billion in unrecognized tax benefits, of which $\n1.4\n billion would reduce income tax expense and the effective tax rate, if recognized. The increases in unrecognized tax benefits in both fiscal 2025 and fiscal 2024 primarily relate to additions associated with recurring items. \nDuring the next twelve months, the Company does not anticipate any material reduction in its unrecognized tax benefits based on the information currently available. However, this may change as the Company continues to have ongoing discussions with various taxing authorities throughout the year. \nDuring the fourth quarter of fiscal 2023, the Internal Revenue Service (“IRS”) communicated proposed adjustments to taxable income reported in the Company’s fiscal 2018 and fiscal 2019 U.S. Federal Corporate Income Tax returns. The adjustments would increase the Company’s federal income tax liability in the range of $\n600\n million to $\n700\n million. The Company disagrees with the proposed adjustments and intends to pursue resolution through the administrative process with the IRS Independent Office of Appeals and, if necessary, through judicial remedies. During the first quarter of fiscal 2024, the Company filed a formal protest with the IRS. The Company does not anticipate a final resolution of these matters in the next twelve months. Although the final resolution of these matters is uncertain, the Company believes in the merits of its tax positions and believes that it has adequately reserved for any adjustments to the provision of income taxes that may ultimately result. However, if the IRS prevails in these matters, the assessed tax and interest could have a material adverse effect on the Company’s financial position, results of operations, and cash flows in future periods.\nThe Company reports interest and penalties on income taxes as income tax expense. It recognized income tax expense of $\n80\n million, $\n84\n million, and $\n31\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively, representing interest and penalties, in its Consolidated Statements of Operations. As of March 31, 2025 and 2024, the Company accrued cumulatively $\n302\n million and $\n222\n million, respectively, in interest and penalties on unrecognized tax benefits in its Consolidated Balance Sheets.\nThe Company files income tax returns in the U.S. federal jurisdiction, various U.S. state jurisdictions, and various foreign jurisdictions. The Company is generally subject to audit by taxing authorities in various U.S. states and in foreign jurisdictions for fiscal 2016 through the current fiscal year.\nUndistributed earnings of the Company’s foreign operations of approximately $\n4.0\n billion were considered indefinitely reinvested on March 31, 2025. Following the enactment of the 2017 Tax Act, the repatriation of cash to the U.S. is generally no longer taxable for federal income tax purposes. However, the repatriation of cash held outside the U.S. could be subject to applicable foreign withholding taxes and state income taxes. The Company may remit foreign earnings to the U.S. to the extent it is tax efficient to do so. It does not expect the tax impact from remitting these earnings to be material.\n86\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n7.    \nNoncontrolling Interests\n \nNoncontrolling Interests \nNoncontrolling interests represent third-party equity interests in the Company’s consolidated entities primarily related to ClarusONE, Vantage, and SCRI Oncology. After June 15, 2021, noncontrolling interests also represented minority shareholder equity interests in McKesson Europe. The Company’s noncontrolling interest in McKesson Europe was included in the divestiture of the E.U. disposal group in October 2022, as discussed in Financial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n.”\nNoncontrolling interests in the Company’s Consolidated Balance Sheets were $\n380\n million and $\n372\n million at March 31, 2025 and 2024, respectively. For the years ended March 31, 2025, 2024, and 2023, the Company allocated a total of $\n186\n million, $\n158\n million, and $\n162\n million of net income to noncontrolling interests, respectively.\nChanges in noncontrolling interests for the years ended March 31, 2025, 2024, and 2023 were as follows:\n(In millions)\nNoncontrolling\nInterests\nBalance, March 31, 2022\n$\n480\n \nNet income attributable to noncontrolling interests\n162\n \nOther comprehensive income\n44\n \nPayments to noncontrolling interests\n(\n150\n)\nReclassification of recurring compensation to other accrued liabilities\n(\n5\n)\nFormation of SCRI Oncology\n225\n \nDerecognition of noncontrolling interests in McKesson Europe\n(\n382\n)\nOther\n(\n7\n)\nBalance, March 31, 2023\n367\n \nNet income attributable to noncontrolling interests\n158\n \nPayments to noncontrolling interests\n(\n152\n)\nOther\n(\n1\n)\nBalance, March 31, 2024\n372\n \nNet income attributable to noncontrolling interests\n186\n \nPayments to noncontrolling interests\n(\n178\n)\nBalance, March 31, 2025\n$\n380\n \n8.    \nEarnings Per Common Share\nBasic earnings per common share is computed by dividing net income by the weighted-average number of common shares outstanding during the reporting period. The computation of diluted earning per common share is similar to that of basic earnings per common share, except that the former reflects the potential dilution that could occur if dilutive securities or other obligations to issue common stock were exercised or converted into common stock. Potentially dilutive securities include outstanding stock options, restricted stock units, and performance-based and other restricted stock units.\nLess than \none\n million of potentially dilutive securities for fiscal 2025, fiscal 2024, and fiscal 2023 were excluded from the computation of diluted earnings per common share as they were anti-dilutive.\n87\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe computations for basic and diluted earnings or loss per common share were as follows: \nYears Ended March 31, \n(In millions, except per share amounts)\n2025\n2024\n2023\nIncome from continuing operations\n$\n3,481\n \n$\n3,160\n \n$\n3,725\n \nNet income attributable to noncontrolling interests\n(\n186\n)\n(\n158\n)\n(\n162\n)\nIncome from continuing operations attributable to McKesson Corporation\n3,295\n \n3,002\n \n3,563\n \nLoss from discontinued operations, net of tax\n—\n \n—\n \n(\n3\n)\nNet income attributable to McKesson Corporation\n$\n3,295\n \n$\n3,002\n \n$\n3,560\n \nWeighted-average common shares outstanding:\nBasic\n127.4\n \n133.2\n \n141.1\n \nEffect of dilutive securities:\nStock options\n—\n \n0.2\n \n0.2\n \nRestricted stock units \n(1)\n0.7\n \n0.7\n \n0.9\n \nDiluted\n128.1\n \n134.1\n \n142.2\n \nEarnings (loss) per common share attributable to McKesson Corporation: \n(2)\nDiluted\nContinuing operations\n$\n25.72\n \n$\n22.39\n \n$\n25.05\n \nDiscontinued operations\n—\n \n—\n \n(\n0.02\n)\nTotal\n$\n25.72\n \n$\n22.39\n \n$\n25.03\n \nBasic\nContinuing operations\n$\n25.86\n \n$\n22.54\n \n$\n25.25\n \nDiscontinued operations\n—\n \n—\n \n(\n0.02\n)\nTotal\n$\n25.86\n \n$\n22.54\n \n$\n25.23\n \n(1)\nIncludes dilutive effect from restricted stock units and performance-based restricted stock units.\n(2)\nCertain computations may reflect rounding adjustments.\n \n88\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n9.    \nLeases\nLessee\nSupplemental balance sheet information related to leases was as follows:\nMarch 31,\n(In millions, except lease term and discount rate)\n2025\n2024\nOperating leases \nOperating lease right-of-use assets \n$\n1,782\n \n$\n1,729\n \nCurrent portion of operating lease liabilities\n$\n258\n \n$\n295\n \nLong-term operating lease liabilities\n1,478\n \n1,466\n \nTotal operating lease liabilities \n$\n1,736\n \n$\n1,761\n \nFinance leases\nProperty, plant, and equipment, net\n$\n177\n \n$\n165\n \nCurrent portion of long-term debt\n$\n32\n \n$\n30\n \nLong-term debt\n163\n \n163\n \nTotal finance lease liabilities\n$\n195\n \n$\n193\n \nWeighted-average remaining lease term (years)\nOperating leases\n8.0\n7.0\nFinance leases\n6.3\n7.0\nWeighted-average discount rate\nOperating leases\n4.11\n \n%\n3.62\n \n%\nFinance leases\n3.27\n \n%\n2.98\n \n%\n89\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe components of lease cost were as follows:\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nShort-term lease cost\n$\n8\n \n$\n14\n \n$\n20\n \nOperating lease cost\n418\n \n418\n \n384\n \nFinance lease cost:\nAmortization of right-of-use assets\n30\n \n25\n \n24\n \nInterest on lease liabilities\n7\n \n5\n \n6\n \nTotal finance lease cost \n37\n \n30\n \n30\n \nVariable lease cost \n(1)\n139\n \n131\n \n128\n \nSublease income\n(\n36\n)\n(\n35\n)\n(\n33\n)\nTotal lease cost \n(2)\n$\n566\n \n$\n558\n \n$\n529\n \n(1)    These amounts include payments for maintenance, taxes, payments affected by the consumer price index, and other similar metrics and payments contingent on usage.\n(2)    These amounts were primarily recorded in “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations.\nSupplemental cash flow information related to leases was as follows:\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n(\n404\n)\n$\n(\n339\n)\n$\n(\n338\n)\nOperating cash flows from finance leases\n—\n \n(\n1\n)\n(\n1\n)\nFinancing cash flows from finance leases\n(\n39\n)\n(\n47\n)\n(\n29\n)\nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n$\n599\n \n$\n391\n \n$\n462\n \nFinance leases\n18\n \n21\n \n17\n \nMaturities of lease liabilities as of March 31, 2025 were as follows:\n(In millions)\nOperating Leases\nFinance Leases\nTotal\nFiscal 2026\n$\n313\n \n$\n37\n \n$\n350\n \nFiscal 2027\n304\n \n38\n \n342\n \nFiscal 2028\n261\n \n35\n \n296\n \nFiscal 2029\n226\n \n32\n \n258\n \nFiscal 2030\n197\n \n26\n \n223\n \nThereafter\n777\n \n49\n \n826\n \nTotal lease payments \n(1)\n2,078\n \n217\n \n2,295\n \nLess imputed interest\n(\n342\n)\n(\n22\n)\n(\n364\n)\nPresent value of lease liabilities\n$\n1,736\n \n$\n195\n \n$\n1,931\n \n(1)\nTotal lease payments are not reduced by future minimum sublease income of $\n224\n million, which is due under noncancellable subleases.\n90\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nAs of March 31, 2025, the Company entered into additional leases primarily for facilities that have not yet commenced with future lease payments of $\n260\n million that are not reflected in the table above. These operating leases will commence in calendar year 2025 with noncancellable lease terms of \nthree\n to \n15\n years.\nLessor\nThe Company leases certain owned equipment, classified as direct financing or sales-type leases, to physician practices. As of March 31, 2025 and 2024, the total lease receivable was $\n419\n million and $\n365\n million, respectively, with a weighted-average remaining lease term of approximately \nseven years\n. Interest income from these leases was not material for the years ended March 31, 2025, 2024, and 2023.\n10.    \nGoodwill and Intangible Assets, Net \nGoodwill\nChanges in the carrying amount of goodwill were as follows:\n(In millions)\nU.S. Pharmaceutical \nPrescription Technology Solutions\nMedical-Surgical Solutions\nInternational\nCorporate\nTotal\nBalance, March 31, 2023\n$\n4,050\n \n$\n2,005\n \n$\n2,453\n \n$\n1,439\n \n$\n—\n \n$\n9,947\n \nGoodwill acquired \n80\n \n19\n \n83\n \n13\n \n—\n \n195\n \nForeign currency translation adjustments, net\n—\n \n—\n \n—\n \n(\n3\n)\n—\n \n(\n3\n)\nOther adjustments\n(\n7\n)\n—\n \n—\n \n—\n \n—\n \n(\n7\n)\nBalance, March 31, 2024\n4,123\n \n2,024\n \n2,536\n \n1,449\n \n—\n \n10,132\n \nGoodwill acquired \n1\n \n11\n \n—\n \n4\n \n—\n \n16\n \nDisposals \n(1)\n—\n \n—\n \n—\n \n(\n46\n)\n—\n \n(\n46\n)\nForeign currency translation adjustments, net\n—\n \n—\n \n—\n \n(\n80\n)\n—\n \n(\n80\n)\nOther adjustments \n8\n \n(\n8\n)\n(\n29\n)\n—\n \n29\n \n—\n \nBalance, March 31, 2025\n$\n4,132\n \n$\n2,027\n \n$\n2,507\n \n$\n1,327\n \n$\n29\n \n$\n10,022\n \n(1)\nGoodwill related to the Canadian retail disposal group discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\nGoodwill Impairment Charges\nThe Company evaluates goodwill for impairment on an annual basis in the first fiscal quarter, and more frequently if indicators for potential impairment exist. Goodwill impairment testing is conducted at the reporting unit level, which is generally defined as an operating segment or one level below an operating segment (also known as a component), for which discrete financial information is available and segment management regularly reviews the operating results of that reporting unit. \nThe fair value of the reporting units is determined using a combination of an income approach based on a DCF model and a market approach based on appropriate valuation multiples observed for the reporting unit’s guideline public companies. Fair value estimates result from a complex series of judgments about future events and uncertainties and relies heavily on estimates and assumptions that have been deemed reasonable by management as of the measurement date. Any material changes in key assumptions, including failure to improve operations of certain retail pharmacy stores, additional government reimbursement reductions, deterioration in the financial markets, an increase in interest rates, or an increase in the cost of equity financing by market participants within the industry, or other unanticipated events and circumstances, may affect such estimates. The discount rates are the weighted-average cost of capital measuring the reporting unit’s cost of debt and equity financing weighted by the percentage of debt and percentage of equity in a company’s target capital. The unsystematic risk premium is an input factor used in calculating the discount rate that specifically addresses uncertainty related to the reporting unit’s future cash flow projections. Fair value assessments of the reporting unit are considered a Level 3 measurement due to the significance of unobservable inputs developed using company-specific information.\n91\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe annual impairment testing performed for fiscal 2025, fiscal 2024, and fiscal 2023 did not indicate any impairment of goodwill. \nIntangible Assets\nInformation regarding intangible assets were as follows:\nMarch 31, 2025\nMarch 31, 2024\n(Dollars in millions)\nWeighted-\nAverage\nRemaining\nAmortization\nPeriod\n(Years)\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nGross\nCarrying\nAmount\n (1)\nAccumulated\nAmortization \n(1)\nNet\nCarrying\nAmount\nCustomer relationships\n10\n$\n1,475\n \n$\n(\n650\n)\n$\n825\n \n$\n1,830\n \n$\n(\n701\n)\n$\n1,129\n \nService agreements\n9\n1,116\n \n(\n728\n)\n388\n \n1,126\n \n(\n676\n)\n450\nTrademarks and trade names\n13\n378\n \n(\n278\n)\n100\n \n759\n(\n395\n)\n364\nTechnology\n9\n288\n \n(\n141\n)\n147\n \n284\n(\n125\n)\n159\nOther\n7\n31\n \n(\n27\n)\n4\n \n34\n(\n26\n)\n8\nTotal\n$\n3,288\n \n$\n(\n1,824\n)\n$\n1,464\n \n$\n4,033\n \n$\n(\n1,923\n)\n$\n2,110\n \n(1)\nDuring the third quarter of fiscal 2024, the Company performed a review of its intangible assets and removed from the balance sheet $\n1.4\n billion of fully amortized gross intangible assets and the corresponding accumulated amortization associated with the assets that no longer provide an economic benefit, are no longer in use, or for which the related contract has expired.\nAll intangible assets were subject to amortization as of March 31, 2025 and 2024. Amortization of intangible assets of the Canadian retail disposal group previously classified as held for sale and disposed in December 2024 ceased in the second quarter of fiscal 2025. Amortization expense of intangible assets was $\n226\n million, $\n249\n million, and $\n236\n million for fiscal 2025, fiscal 2024, and fiscal 2023, respectively.\nEstimated amortization expense of the assets listed in the table above is as follows: \n(In millions)\nEstimated Amortization Expense\nFiscal 2026\n$\n173\n \nFiscal 2027\n168\n \nFiscal 2028\n164\n \nFiscal 2029\n162\n \nFiscal 2030\n157\n \nThereafter\n640\n \n92\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n11.    \nDebt and Financing Activities\nLong-term debt consisted of the following:\nMarch 31, \n(In millions)\n2025\n2024\nU.S. Dollar notes\n \n(1) (2)\n0.90\n% Notes due December 3, 2025\n500\n \n500\n \n5.25\n% Notes due February 15, 2026\n—\n \n499\n \n1.30\n% Notes due August 15, 2026\n499\n \n499\n \n7.65\n% Debentures due March 1, 2027\n150\n \n150\n \n3.95\n% Notes due February 16, 2028\n343\n \n343\n \n4.90\n% Notes due July 15, 2028\n399\n \n399\n \n4.75\n% Notes due May 30, 2029\n196\n \n196\n \n4.25\n% Notes due September 15, 2029\n500\n \n—\n \n5.10\n% Notes due July 15, 2033\n597\n \n596\n \n6.00\n% Notes due March 1, 2041\n217\n \n218\n \n4.88\n% Notes due March 15, 2044\n255\n \n255\n \nForeign currency notes\n (1) (3)\n1.50\n% Euro Notes due November 17, 2025\n649\n \n646\n \n1.63\n% Euro Notes due October 30, 2026\n541\n \n540\n \n3.13\n% Sterling Notes due February 17, 2029\n581\n \n568\n \nLease and other obligations\n227\n \n220\n \nTotal debt\n5,654\n \n5,629\n \nLess: Current portion\n1,191\n \n50\n \nTotal long-term debt\n$\n4,463\n \n$\n5,579\n \n(1)\nThese notes are unsecured and unsubordinated obligations of the Company.\n(2)\nInterest on these U.S. dollar notes is payable semi-annually.\n(3)\nInterest on these foreign currency notes is payable annually.\nLong-Term Debt\nThe Company’s long-term debt includes both U.S. dollar and foreign currency-denominated borrowings. At March 31, 2025 and 2024, $\n5.7\n billion and $\n5.6\n billion, respectively, of total debt was outstanding, of which $\n1.2\n billion and $\n50\n million, respectively, was included under the caption “Current portion of long-term debt” in the Company’s Consolidated Balance Sheets.\nPublic Offerings \nOn September 10, 2024, the Company completed a public offering of \n4.25\n% Notes due September 15, 2029 in a principal amount of $\n500\n million (the “2029 Notes”). Interest on the 2029 Notes is payable semi-annually on March 15th and September 15th of each year, commencing on March 15, 2025. Proceeds received from the issuance of the 2029 Notes, net of discounts and offering expenses, were $\n496\n million. The Company utilized the net proceeds from the offering of the 2029 Notes together with cash on hand to redeem its $\n500\n million outstanding principal amount of \n5.25\n% Notes due February 15, 2026 (the “2026 Notes”), which became callable on or after February 15, 2024, prior to maturity at a redemption price equal to \n100\n% of the principal amount plus accrued and unpaid interest through the redemption date. The total loss recognized on the debt extinguishment of the 2026 Notes described above for the year ended March 31, 2025 was not material and is included within “Interest expense” in the Company’s Consolidated Statements of Operations. \n93\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nOn June 15, 2023, the Company completed a public offering of \n4.90\n% Notes due July 15, 2028 in a principal amount of $\n400\n million (the “2028 Notes”) and a public offering of \n5.10\n% Notes due July 15, 2033 in a principal amount of $\n600\n million (the “2033 Notes” and, together with the 2028 Notes, the “Notes”). Interest on the Notes is payable semi-annually on January 15th and July 15th of each year, commencing on January 15, 2024. Proceeds received from the issuance of the Notes, net of discounts and offering expenses, were $\n397\n million for the 2028 Notes and $\n592\n million for the 2033 Notes. The Company utilized a portion of the net proceeds from the offerings of the Notes to fund the purchase price payable with respect to the portion of the Company’s then outstanding \n3.80\n% Notes due March 15, 2024 (the “2024 Notes”) that was validly tendered and accepted for purchase pursuant to the Concurrent Tender Offer (as defined below) and to effect the satisfaction and discharge of the remaining portion of the 2024 Notes, all of which is described further below. The remaining net proceeds from the offerings of the Notes was available for general corporate purposes.\nOn February 15, 2023, the Company completed a public offering of \n5.25\n% Notes due February 15, 2026 (the “February 2026 Notes”) in a principal amount of $\n500\n million. Interest on the February 2026 Notes is payable semi-annually on February 15th and August 15th of each year, commencing on August 15, 2023. Proceeds received from this note issuance, net of discounts and offering expenses, were $\n497\n million. The Company utilized the net proceeds from this note issuance to repay existing debt. On or after February 15, 2024, the Company may redeem the February 2026 Notes at its option, in whole or in part, at any time and from time to time, for cash at a redemption price equal to \n100\n% of the principal amount of the notes being redeemed plus accrued and unpaid interest thereon to, but not including, the redemption date.\nEach of the 2029 Notes, the 2033 Notes and the 2028 Notes, constitutes a “series,” is an unsecured and unsubordinated obligation of the Company and ranks equally with all of the Company’s existing, and future unsecured and unsubordinated indebtedness that may be outstanding from time-to-time. Each series is governed by an indenture and officers’ certificate that are materially similar to those of other series of notes issued by the Company. Upon at least \n10\n days’ and not more than \n60\n days’ notice to holders of the applicable series of the notes, the Company may redeem such series of the notes for cash in whole, at any time, or in part, from time to time, at redemption prices that include accrued and unpaid interest and a make-whole premium before a specified date, and at par plus accrued and unpaid interest thereafter until maturity, each as specified in the indenture and the officers’ certificate. If there were to occur both (a) a change of control of the Company and (b) a downgrade of the applicable series of the notes below an investment grade rating by each of the Ratings Agencies (as defined in the applicable officers’ certificate) within a specified period, then the Company would be required to make an offer to purchase that series at a price equal to \n101\n% of the then outstanding principal amount of that series, plus accrued and unpaid interest to, but not including, the date of repurchase. The indenture and the related officers’ certificate for each series, subject to the exceptions and in compliance with the conditions as applicable, specify that the Company may not consolidate, merge or sell all or substantially all of its assets, incur liens, or enter into sale-leaseback transactions exceeding specific terms, without the lenders’ consent. The indenture also contains customary events of default provisions.\nRetirements and Redemption\nOn March 15, 2023, the Company retired its $\n360\n million outstanding principal amount of \n2.85\n% Notes due 2023 upon maturity. On December 15, 2022, the Company retired its $\n400\n million outstanding principal amount of \n2.70\n% Notes due 2022 upon maturity. All of these notes were repaid or redeemed using cash on hand.\nConcurrent Tender Offer of the 2024 Notes\nOn June 16, 2023, the Company completed a cash tender offer for any and all of its then outstanding 2024 Notes, which was made concurrently with the offerings of the Notes (the “Concurrent Tender Offer”). The Company paid an aggregate consideration of $\n268\n million in the Concurrent Tender Offer to repurchase $\n271\n million principal amount of the 2024 Notes at a repurchase price equal to \n98.75\n% of the principal amount plus accrued and unpaid interest. The repurchase of the 2024 Notes accepted for purchase in the Concurrent Tender Offer was accounted for as a debt extinguishment. \n94\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nSatisfaction and Discharge of the 2024 Notes\nOn June 16, 2023, after completing the Concurrent Tender Offer, the Company irrevocably deposited with the trustee under the indenture governing the 2024 Notes (the “2024 Notes Indenture”) U.S. government obligations in an amount sufficient to fund the payment of accrued and unpaid interest of the remaining $\n647\n million principal amount of the 2024 Notes as it became due, and of the principal amount of those 2024 Notes on their March 15, 2024 maturity date. The U.S. government obligations were purchased using a portion of the net proceeds from the offerings of the Notes. After the deposit of such funds with the trustee, the Company’s obligations under the 2024 Notes Indenture with respect to the 2024 Notes were satisfied and discharged and the transaction was accounted for as a debt extinguishment. \nThe total gain recognized on the debt extinguishments described above for the year ended March 31, 2024 was $\n9\n million and included within “Interest expense” in the Company’s Consolidated Statement of Operations. \nOther Information\nScheduled principal payments of long-term debt are:\n(In millions\n)\nPayments\nFiscal 2026\n$\n1,184\n \nFiscal 2027\n1,228\n \nFiscal 2028\n384\n \nFiscal 2029\n1,011\n \nFiscal 2030\n725\n \nThereafter\n1,122\n \nTotal\n$\n5,654\n \n \nRevolving Credit Facilities\n5-Year Facility\nOn November 7, 2022, the Company entered into a Credit Agreement (the “2022 Credit Facility”) which was subsequently amended on November 7,2024 and May 8, 2025, that provides a syndicated $\n4.0\n billion senior unsecured credit facility with a $\n3.6\n billion aggregate sublimit of availability in Canadian dollars, British pound sterling, and Euro. The 2022 Credit Facility was scheduled to mature in November 2027. On November 7, 2024, the maturity date of the 2022 Credit Facility was extended from November 2028 to November 2029. Borrowings under the 2022 Credit Facility bear interest based upon the Term Secured Overnight Financing Rate (“SOFR”) for credit extensions denominated in U.S. dollars, the Sterling Overnight Index Average Reference Rate for credit extensions denominated in British pound sterling, the Euro Interbank Offered Rate for credit extensions denominated in Euros, the Canadian Overnight Repo Rate Average for credit extensions denominated in Canadian dollars, a prime rate, or alternative overnight rates, as applicable, plus agreed upon margins. The 2022 Credit Facility contains various customary investment grade covenants, including a financial covenant which obligates the Company to maintain a maximum Total Debt to Consolidated EBITDA ratio, as defined in the 2022 Credit Facility. If the Company does not comply with these covenants, its ability to use the 2022 Credit Facility may be suspended and repayment of any outstanding balances under the 2022 Credit Facility may be required to be repaid. The remaining terms and conditions of the 2022 Credit Facility are substantially similar to those previously in place under the 2020 Credit Facility. The Company can use funds obtained under the 2022 Credit Facility for general corporate purposes. There were \nno\n borrowings under the 2022 Credit Facility during the year ended March 31, 2025 and 2024 and \nno\n amounts outstanding at March 31, 2025 or March 31, 2024. At March 31, 2025, the Company was in compliance with all covenants under the 2022 Credit Facility. \n95\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n364-Day Facility\nOn May 8, 2025, the Company entered into a Credit Agreement (the “364 Day Credit Facility”), that provides a syndicated $\n1.0\n billion senior unsecured credit facility. The 364 Day Credit Facility is scheduled to mature in May 2026. \nOn or prior to the maturity date, the Company may, at its election and subject to certain customary conditions, convert the outstanding loans into a term loan that is repayable in May 2027. \nBorrowings under the 364 Day Credit Facility bear interest based upon SOFR for credit extensions denominated in U.S. Dollars and other relevant underlying benchmarks, plus agreed margins. \nThe 364 Day Credit Facility contains various customary investment grade covenants, including a financial covenant which obligates the Company to maintain a maximum Total Debt to Consolidated EBITDA ratio, as defined in the 364 Day Credit Facility. If the Company does not comply with these covenants, its ability to use the 364 Day Credit Facility may be suspended and repayment of any outstanding balances under the 364 Day Credit Facility may be required to be repaid. The terms and conditions of the 364 Day Credit Facility are substantially similar to those under the 2022 Credit Facility. The Company can use funds obtained under the 364 Day Credit Facility for general corporate purposes.\nCommercial Paper\nThe Company maintains a commercial paper program to support its working capital requirements and for other general corporate purposes. Under the program, the Company can issue up to $\n4.0\n billion in outstanding commercial paper notes. During the years ended March 31, 2025, 2024, and 2023, the Company borrowed and repaid $\n15.1\n billion, $\n20.0\n billion, and $\n8.5\n billion, respectively, under the program. At March 31, 2025 and 2024, there were \nno\n commercial paper notes outstanding. Following the execution of the 364 Day Facility on May 8, 2025, the Company can issue up to $\n5.0\n billion in outstanding commercial paper notes.\n \n12.    \nVariable Interest Entities \nThe Company evaluates its ownership, contractual, and other interests in entities to determine if they are VIEs if it has a variable interest in those entities, and the nature and extent of those interests. These evaluations are highly complex and involve management judgment and the use of estimates and assumptions based on available historical information, among other factors. Based on its evaluations, if the Company determines it is the primary beneficiary of such VIEs, it consolidates such entities into its financial statements.\nConsolidated Variable Interest Entities\nThe Company consolidates a VIE when it has the power to direct the activities that most significantly impact the VIE’s economic performance and the obligation to absorb losses or the right to receive benefits of the VIE and, as a result, is considered the primary beneficiary of the VIE. The Company consolidates certain single-lessee leasing entities where it, as the lessee, has the majority risk of the leased assets due to its minimum lease payment obligations to these leasing entities. As a result of absorbing this risk, the leases provide the Company with the power to direct the operations of the leased properties and the obligation to absorb losses or the right to receive benefits of the entity. Consolidated VIEs do not have a material impact on the Company’s Consolidated Statements of Operations or Consolidated Statements of Cash Flows. Total assets and liabilities included in its Consolidated Balance Sheets for these VIEs were $\n610\n million and $\n47\n million, respectively, at March 31, 2025, and $\n601\n million and $\n41\n million, respectively, at March 31, 2024.\n96\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nInvestments in Unconsolidated Variable Interest Entities\nThe Company is involved with VIEs which it does not consolidate because it does not have the power to direct the activities that most significantly impact their economic performance and thus is not considered the primary beneficiary of the entities. Its relationships include equity method investments and lending, leasing, contractual, or other relationships with the VIEs. The Company’s most significant VIE relationships are with oncology and other specialty practices. Under these practice arrangements, the Company generally owns or leases all of the real estate and equipment used by the practices and manages the practices’ administrative functions. The Company’s maximum exposure to loss (regardless of probability) as a result of all unconsolidated VIEs was $\n1.6\n billion and $\n1.5\n billion at March 31, 2025 and 2024, respectively, which primarily represents the value of intangible assets related to service agreements, lease and loan receivables, operating ROU assets, and equity investments. This amount excludes the customer loan guarantees discussed in \nFinancial \nNote 16\n, “\nFinancial Guarantees and Warranties\n.”\n The Company believes there is no material loss exposure on these assets or from these relationships.\n13.    \nPension Benefits\nThe Company maintains a number of qualified and nonqualified defined benefit pension plans and defined contribution plans for eligible employees.\nNon-U.S. Defined Benefit Pension Plans\nAs of March 31, 2025 and 2024, the Company’s non-U.S. defined benefit pension plans cover eligible employees located predominantly in Norway and Canada. Benefits for these plans are based primarily on each employee’s final salary, with annual adjustments for inflation.\nThe Company divested certain pension assets and liabilities as part of the Canadian divestiture activities in fiscal 2025 and European divestiture activities in fiscal 2023 which are discussed in more detail in \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n.\n” During fiscal 2025, changes in the Company pension assets and accumulated other comprehensive loss related to the Canadian divestiture activities were not material. During fiscal 2023, the Company’s divested pension liabilities totaling $\n75\n million, pension assets of $\n49\n million and the Company released $\n17\n million of losses from accumulated other comprehensive loss related to divestiture activities.\nDuring the fourth quarter of fiscal 2025, the Company settled the frozen U.K. pension plan (“U.K. Plan”) by irrevocably transferring future financial responsibilities for the plan to a third-party insurance provider (the “buy-out”). In connection with the buy-out and settlement of the U.K. Plan, a non-cash pre-tax settlement charge of $\n87\n million was recorded in “Other income, net” in the Company’s Consolidated Statements of Operations for the year ended March 31, 2025, consisting of $\n53\n million of pension losses and $\n34\n million of Foreign currency translation adjustments associated with the plan. Excess assets from the U.K. Plan of approximately $\n7\n million are to be reverted to the Company following final wind-up activities and were recognized as a receivable upon settlement.\nDefined benefit plan assets and obligations are measured as of the Company’s fiscal year-end. \nThe net periodic expense for the Company’s pension plans were as follows:\nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nService cost - benefits earned during the year\n$\n2\n \n$\n2\n \n$\n5\n \nInterest cost on projected benefit obligation\n7\n \n8\n \n7\n \nExpected return on assets\n(\n7\n)\n(\n7\n)\n(\n5\n)\nAmortization of unrecognized actuarial loss and prior service costs\n2\n \n2\n \n1\n \nCurtailment/settlement loss (gain)\n56\n \n—\n \n(\n1\n)\nNet periodic pension expense\n$\n60\n \n$\n5\n \n$\n7\n \nThe projected unit credit method is utilized in measuring net periodic pension expense over the employees’ service life for the pension plans. Unrecognized actuarial losses exceeding \n10\n% of the greater of the projected benefit obligation or the market value of assets are amortized straight-line over the average remaining future service period of active employees.\n97\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nInformation regarding the changes in benefit obligations and plan assets for the Company’s pension plans was as follows: \nYears Ended March 31, \n(In millions)\n2025\n2024\nChange in benefit obligations\nBenefit obligation at beginning of period \n(1)\n$\n174\n \n$\n172\n \nService cost\n2\n \n2\n \nInterest cost\n7\n \n8\n \nActuarial loss\n2\n \n—\n \nBenefits paid\n(\n8\n)\n(\n9\n)\nCurtailment/settlement\n (2)\n(\n96\n)\n—\n \nDivestitures \n(3)\n(\n6\n)\n—\n \nForeign exchange impact and other\n2\n \n1\n \nBenefit obligation at end of period \n(1)\n$\n77\n \n$\n174\n \nChange in plan assets\nFair value of plan assets at beginning of period\n$\n171\n \n$\n174\n \nActual return on plan assets\n—\n \n(\n1\n)\nEmployer and participant contributions\n4\n \n5\n \nBenefits paid\n(\n8\n)\n(\n9\n)\nSettlement \n(2)\n(\n96\n)\n—\n \nDivestitures \n(3)\n(\n6\n)\n—\n \nForeign exchange impact and other\n1\n \n2\n \nFair value of plan assets at end of period\n$\n66\n \n$\n171\n \nFunded status at end of period\n$\n(\n11\n)\n$\n(\n3\n)\nAmounts recognized on the balance sheet\nCurrent assets\n$\n7\n \n$\n—\n \nLong-term assets\n2\n \n18\n \nCurrent liabilities\n(\n1\n)\n(\n1\n)\nLong-term liabilities\n(\n19\n)\n(\n20\n)\nTotal\n$\n(\n11\n)\n$\n(\n3\n)\n \n(1)\nThe benefit obligation is the projected benefit obligation.\n(2)\nRelates to the buy-out of the U.K. Plan described above. \n(3)\nRelates to the Canadian divestiture activities discussed in more detail in \nFinancial Note 2, “Business Acquisitions and Divestitures.\n”\nThere was a $\n2\n million actuarial loss in fiscal 2025:\n•\nDiscount rates:\n The weighted average discount rate slightly decreased to \n4.48\n% as of March 31, 2025 from \n4.55\n% as of March 31, 2024. \n•\nDemographic and assumption changes:\n The rate of compensation increase increased to \n3.47\n% as of March 31, 2025 from \n3.21\n% as of March 31, 2024.\nThere was \nno\n actuarial gain in fiscal 2024:\n•\nDiscount rates: \nThe weighted average discount rate increased slightly to \n4.55\n% as of March 31, 2024 from \n4.54\n% as of March 31, 2023.\n98\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n•\nDemographic and assumption changes:\n There were offsetting gains and losses in the demographic and assumption changes. \nAs of March 31, 2025 and 2024, The Company’s accumulated benefit obligations were $\n74\n million and $\n172\n million, respectively. Amounts recognized in accumulated other comprehensive loss as of March 31, 2025 and 2024, were $\n12\n million and $\n58\n million, respectively. \nOther changes in accumulated other comprehensive loss were as follows: \nYears Ended March 31, \n(In millions)\n2025\n2024\n2023\nNet actuarial (gain) loss\n$\n9\n \n$\n9\n \n$\n(\n7\n)\nPrior service cost\n2\n \n—\n \n1\n \nAmortization of:\nNet actuarial loss\n(\n57\n)\n(\n2\n)\n(\n9\n)\nPrior service credit\n—\n \n—\n \n2\n \nForeign exchange impact and other\n—\n \n1\n \n(\n5\n)\nTotal recognized in other comprehensive (income) loss\n$\n(\n46\n)\n$\n8\n \n$\n(\n18\n)\nIn fiscal 2025, the Company recognized $\n53\n million in actuarial losses for the pension plans to stockholders’ deficit as a result of the U.K. plan buy-out. In fiscal 2023, the Company recognized $\n17\n million in net actuarial losses for pension plans to stockholders’ deficit as a result of the divestitures. Refer to \nFinancial Note 2, “Business Acquisitions and Divestitures\n,\n” for more information on the Company’s divestiture activities.\nProjected benefit obligations related to the Company’s unfunded plans were $\n19\n million at March 31, 2025 and 2024. Funding obligations for its plans vary based on the laws of each jurisdiction.\nExpected benefit payments are based on the same assumptions used to measure the benefit obligations and include estimated future employee service. \nExpected benefit payments for the Company’s pension plans were as follows:\n99\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n(In millions)\nExpired Benefit Payments \nFiscal 2026\n$\n4\n \nFiscal 2027\n$\n5\n \nFiscal 2028\n$\n5\n \nFiscal 2029\n$\n5\n \nFiscal 2030\n$\n17\n \nFiscal 2031 through 2035\n$\n22\n \nExpected contributions to be made for the Company’s pension plans are $\n3\n million for fiscal 2026.\nWeighted-average assumptions used to estimate the net periodic pension expense and the actuarial present value of benefit obligations were as follows:\nYears Ended March 31, \n2025\n2024\n2023\nNet periodic pension expense\nDiscount rates\n4.55\n \n%\n4.54\n \n%\n2.67\n \n%\nRate of increase in compensation\n3.21\n \n3.21\n \n3.67\n \nExpected long-term rate of return on plan assets\n4.37\n \n4.05\n \n1.63\n \nBenefit obligation\nDiscount rates\n4.48\n \n%\n4.55\n \n%\n4.54\n \n%\nRate of increase in compensation\n3.47\n \n3.21\n \n3.21\n \nThe Company’s defined benefit pension plan liabilities are valued using a discount rate based on a yield curve developed from a portfolio of high-quality corporate bonds rated AA or better whose maturities are aligned with the expected benefit payments of its plans. The Company’s defined benefit pension plan liabilities are valued using a weighted-average discount rate of \n4.48\n%, which represents a decrease of \nseven\n basis points from its fiscal 2024 weighted-average discount rate of \n4.55\n%.\nPlan Assets \nInvestment Strategy\n: For plan assets, the investment strategies are subject to local regulations and the asset/liability profiles of the plans in each individual country. Plan assets are broadly invested in a manner appropriate to the nature and duration of the expected future retirement benefits payable under the plans. Plan assets are primarily invested in high-quality corporate and government bond funds and equity securities. Assets are properly diversified to avoid excessive reliance on any particular asset, issuer, or group of undertakings so as to avoid accumulations of risk in the portfolio as a whole.\nThe Company develops the expected long-term rate of return assumption based on the projected performance of the asset classes in which plan assets are invested. The target asset allocation was determined based on the liability and risk tolerance characteristics of the plans and at times may be adjusted to achieve overall investment objectives.\n100\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nFair Value Measurements: \nThe fair value hierarchy has three levels based on the reliability of the inputs used to determine fair value. Level 1 refers to fair values determined based on unadjusted quoted prices in active markets for identical assets. Level 2 refers to fair values estimated using significant other observable inputs and Level 3 includes fair values estimated using significant unobservable inputs. \nThe following tables represent the Company’s plan assets as of March 31, 2025 and 2024, using the fair value hierarchy by asset class:\nMarch 31, 2025\nMarch 31, 2024\n(In millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n7\n \n$\n—\n \n$\n—\n \n$\n7\n \n$\n7\n \n$\n—\n \n$\n—\n \n$\n7\n \nEquity securities:\nEquity commingled funds\n—\n \n12\n \n—\n \n12\n \n—\n \n20\n \n—\n \n20\n \nFixed income securities:\nGovernment securities\n1\n \n5\n \n—\n \n6\n \n—\n \n4\n \n—\n \n4\n \nCorporate bonds\n—\n \n4\n \n—\n \n4\n \n—\n \n4\n \n—\n \n4\n \nOther:\nAnnuity contracts\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n103\n \n103\n \nReal estate funds and other\n—\n \n3\n \n—\n \n3\n \n—\n \n3\n \n—\n \n3\n \nTotal\n$\n8\n \n$\n24\n \n$\n—\n \n$\n32\n \n$\n7\n \n$\n31\n \n$\n103\n \n$\n141\n \nAssets held at NAV practical expedient \n(1)\n:\nOther\n34\n \n30\n \nTotal plan assets\n$\n66\n \n$\n171\n \n(1)    Equity commingled funds, fixed income commingled funds, real estate funds, and other investments for which fair value is measured using the NAV per share as a practical expedient are not leveled within the fair value hierarchy and are included as a reconciling item to total investments.\nCash and cash equivalents - Cash and cash equivalents include money market funds and other commingled funds, which have daily net asset values derived from the underlying securities.\nEquity commingled funds - Some equity investments are held in commingled funds, which have daily net asset values derived from quoted prices for the underlying securities in active markets. \nFixed income securities - Fixed income securities consist of bonds and debentures. Inputs to the valuation methodology include quoted prices for similar assets in active markets, and inputs that are observable for the asset, either directly or indirectly, for substantially the full term of the asset. \nAnnuity contracts - The value of the annuity contracts is reported by the Trustee and is based on a valuation of the remaining contracted cash flow of the contract. Inputs in the valuation include discounted future cash flows.\nReal estate funds - The value of the real estate funds is reported by the fund manager and is based on a valuation of the underlying properties. Inputs used in the valuation include items such as cost, discounted future cash flows, independent appraisals, and market based comparable data. \nOther - At March 31, 2025 and 2024, this includes $\n34\n million and $\n30\n million, respectively, of plan asset value relating to obligations in Norway for the state-regulated pension plan which is managed by the Norwegian Public Service Pension Fund (“SPK”). According to the terms of the SPK, the plan assets of state regulated plans in Norway must correspond very closely to the pension obligation calculated using the principles codified in Norwegian law. The investment return credited to this account is determined annually based on the performance of long-term government bonds.\nThe following table presents the changes in the Level 3 plan assets measured on a recurring basis for the years ended March 31, 2025 and 2024:\n101\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n(In millions)\nLevel 3\nBalance, March 31, 2023\n$\n110\n \nReturn on assets\n(\n7\n)\nBalance, March 31, 2024\n$\n103\n \nReturn on assets\n(\n7\n)\nSettlement\n(\n96\n)\nBalance, March 31, 2025\n$\n—\n \nDefined Contribution Plans \nThe Company has a contributory retirement savings plan (“RSP”) for U.S. eligible employees. Eligible employees may contribute to the RSP up to \n75\n% of their eligible compensation on a pre-tax or post-tax basis not to exceed IRS limits. The Company makes matching contributions in an amount equal to \n100\n% of the employee’s first \n3\n% of pay contributed and \n50\n% for the next \n2\n% of pay contributed. The Company, at the discretion of its Board of Directors (the “Board”), may also make an additional annual matching contribution for each plan year to enable participants to receive a full match based on their annual contribution. The Company also contributed to non-U.S. plans that are available in certain countries. Contribution expenses for the RSP and non-U.S. plans were $\n128\n million, $\n138\n million, and $\n125\n million for the years ended March 31, 2025, 2024, and 2023, respectively.\nPostretirement Benefits\nThe Company maintains a number of postretirement benefit plans, primarily consisting of healthcare and life insurance (“welfare”) benefits, for certain eligible U.S. employees. Eligible employees consist of those who retired before March 31, 1999 and those who retired after March 31, 1999, but were an active employee as of that date, after meeting other age-related criteria. It also provides postretirement benefits for certain U.S. executives. Defined benefit plan obligations are measured as of the Company’s fiscal year-end. The net periodic credit or expense for the Company’s postretirement welfare benefits was \nno\nt material for the years ended March 31, 2025, 2024, and 2023. The benefit obligation at March 31, 2025 and 2024 was $\n40\n million and $\n42\n million, respectively.\n14.    \nHedging Activities \nIn the normal course of business, the Company is exposed to interest rate and foreign currency exchange rate fluctuations. At times, the Company limits these risks through the use of derivatives as described below. In accordance with the Company’s policy, derivatives are only used for hedging purposes. The Company does not use derivatives for trading or speculative purposes. The Company uses various counterparties for its derivative contracts to minimize the exposure to credit risk but does not anticipate non-performance by these parties.\nForeign Currency Exchange Risk\nThe Company conducts its business worldwide in U.S. dollars and the functional currencies of its foreign subsidiaries, including Canadian dollars, Euro, and British pounds sterling. Changes in foreign currency exchange rates could have a material adverse impact on the Company’s financial results that are reported in U.S. dollars. The Company is also exposed to foreign currency exchange rate risk related to its foreign subsidiaries, including intercompany loans denominated in non-functional currencies. The Company has certain foreign currency exchange rate risk programs that use foreign currency forward contracts and cross-currency swaps. These forward contracts and cross-currency swaps are generally used to offset the potential income statement effects from intercompany loans and other obligations denominated in non-functional currencies. These programs reduce but do not entirely eliminate foreign currency exchange rate risk. \nInterest Rate Risk\nThe Company has exposure to changes in interest rates, and it utilizes risk programs which use interest rate swaps to hedge the changes in debt fair values caused by fluctuations in benchmark interest rates. The Company also enters into forward contracts to hedge the variability of future benchmark interest rates on any planned bond issuances. These programs reduce but do not entirely eliminate interest rate risk.\n102\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nNon-Derivative Instruments Designated as Hedges\nPrior to the divestiture of the E.U. disposal group, the Company’s €\n1.1\n billion of Euro-denominated notes were designated as non-derivative net investment hedges. These hedges were utilized to hedge portions of the Company’s net investments in non-U.S. subsidiaries against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. For all notes that were designated as net investment hedges and met effectiveness requirements, the changes in carrying value of the notes attributable to the change in spot rates were recorded as foreign currency translation adjustments in “Accumulated other comprehensive loss” in the Consolidated Statements of Stockholders’ Equity (Deficit) where they offset foreign currency translation gains and losses recorded on the Company’s net investments. To the extent foreign currency-denominated notes designated as net investment hedges were ineffective, changes in carrying value attributable to the change in spot rates were recorded in earnings.\nIn connection with the sale of the E.U. disposal group in October 2022, the Company reclassified $\n112\n million of gains from accumulated other comprehensive loss to\n \n“Selling, distribution, general, and administrative expenses” in the Consolidated Statement of Operations for the year ended March 31, 2023. This amount related to the €\n1.1\n billion of Euro-denominated notes described above which were de-designated as net investment hedges, along with certain other Euro-denominated notes which were previously accounted for as net investment hedges and matured in prior periods, and was included in the fiscal 2023 and fiscal 2022 calculations of charges to remeasure the assets and liabilities of the disposal group to fair value less costs to sell.\nIn connection with the sale of the U.K. disposal group in April 2022, the Company reclassified $\n26\n million of gains from accumulated other comprehensive loss to “Selling, distribution, general, and administrative expenses” in the Consolidated Statement of Operations for the year ended March 31, 2023. This amount related to the Company’s £\n450\n million of British pound sterling-denominated notes, which were previously accounted for as net investment hedges until de-designated in fiscal 2020, and was included in the fiscal 2022 calculation of charges to remeasure the assets and liabilities of the disposal group to fair value less costs to sell.\n103\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nForeign currency gains (losses) from non-derivative instruments included in other comprehensive income in the Consolidated Statements of Comprehensive Income were as follows:\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nNon-derivatives designated as net investment hedges: \n(1)\nEuro-denominated notes \n(2)\n$\n—\n \n$\n—\n \n$\n7\n \n(1)\nThere was no ineffectiveness in these hedges for the year ended March 31, 2023.\n(2)\nIncludes amounts reclassified to earnings of $\n112\n million for the year ended March 31, 2023.\nDerivative Instruments \nAt March 31, 2025 and 2024, the notional amounts of the Company’s outstanding derivatives were as follows:\nMarch 31, 2025\nMarch 31, 2024\n(In millions)\nCurrency\nMaturity Date \n(1)\nNotional\nDerivatives designated as net investment hedges: \n(2)\nCross-currency swaps \n(3)\nCAD\nDec-26 to Mar-27\nC$\n6,500\n \nC$\n1,500\n \nDerivatives designated as fair value hedges: \n(2)\nCross-currency swaps \n(3)\nGBP\nNov-28\n£\n450\n \n£\n450\n \nCross-currency swaps \n(3)\nEUR\nAug-25 to Jul-26\n€\n1,100\n \n€\n1,100\n \nFloating interest rate swaps \n(4)\nUSD\nAug-27 to Sep-29\n$\n750\n \n$\n1,250\n \nDerivatives designated as cash flow hedges: \n(2)\nForeign currency forwards\n (5)\nGBP\nApr-25 to Jul-25\n£\n11\n \n£\n39\n \nInterest rate swap locks\n  (6)\nUSD\nAug-30 to Aug-35\n$\n850\n \n$\n—\n \n(1)\nThe maturity date reflected is for outstanding derivatives as of March 31, 2025.\n(2)\nThere was no ineffectiveness in these hedges for the years ended March 31, 2025, 2024, and 2023.\n(3)\nRepresents cross-currency fixed-to-fixed interest rate swaps to mitigate the foreign currency exchange fluctuations on its foreign currency-denominated notes. \n(4)\nRepresents fixed-to-floating interest rate swaps to hedge the changes in fair value caused by fluctuations in the benchmark interest rates. \n(5)\nThe Company entered into agreements with financial institutions to hedge the variability of foreign currency exchange fluctuations in future cash payments due to a third party in the United Kingdom for capital expenditures.\n(6)\nThe Company entered into agreements with financial institutions in the fourth quarter of fiscal 2025 to hedge cash flows associated with interest payments on upcoming financing activities.\nNet Investment Hedges\nThe Company uses cross-currency swaps to hedge portions of the Company’s net investments denominated in Canadian dollars against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. The changes in the fair value of these derivatives attributable to the changes in spot currency exchange rates and differences between spot and forward interest rates are recorded in accumulated other comprehensive loss and offset foreign currency translation gains and losses recorded on the Company’s net investments denominated in Canadian dollars. To the extent cross-currency swaps designated as hedges are ineffective, changes in carrying value attributable to the change in spot rates are recorded in earnings. \n104\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nIn fiscal 2025, the Company expanded the net investment hedging program by entering into new cross-currency swaps and restructuring existing cross-currency swaps as described below. As of March 31, 2025, the outstanding notional amount of cross-currency swaps was C$\n6.5\n billion.\nIn the first quarter of fiscal 2025, the Company entered into cross-currency swaps designated as net investment hedges with a total notional amount of C$\n2.5\n billion to hedge portions of the Company’s net investments denominated in Canadian dollars against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. These cross-currency swaps mature in April 2025 and June 2026. Further, the Company terminated C$\n1.5\n billion of cross-currency swaps designated as net investment hedges with original maturity dates in November 2024 and extending through March 2025.\nIn the third quarter of fiscal 2025, the Company entered into cross-currency swaps designated as net investment hedges with a total notional amount of C$\n6.0\n billion. These cross-currency swaps mature in October, November and December 2026. Further, the Company terminated C$\n5.0\n billion of cross-currency swaps designated as net investment hedges with original maturity dates in April 2025, June, October and November 2026.\nIn the fourth quarter of fiscal 2025, the Company entered into cross-currency swaps designated as net investment hedges with a total notional amount of C$\n3.0\n billion. These cross-currency swaps mature in March 2027.\nFair Value Hedges\nThe Company uses cross-currency swaps to hedge the changes in the fair value of its foreign currency notes resulting from changes in benchmark interest rates and foreign currency exchange rates. In February 2023, £\n450\n million of cross-currency swaps matured and the Company executed new cross-currency swaps with similar terms to continue to mitigate interest rate and foreign exchange rate risks. \nIn fiscal 2023, the Company entered into cross-currency fixed-to-fixed interest rate swaps with a total notional amount of €\n1.1\n billion to hedge the changes in the fair value of its underlying Euro-denominated notes resulting from changes in benchmark interest rates and foreign currency exchange rates.\nIn fiscal 2023, the Company entered into floating interest rate swaps designated as fair value hedges to convert $\n1.3\n billion of its fixed rate debt to floating rate in order to hedge the changes in fair value caused by fluctuations in the benchmark interest rate. In fiscal 2025, $\n500\n million of the $\n1.3\n billion floating interest rate swaps with original maturity dates in February 2026 and callable at any time after February 2024 were terminated. Refer to \nFinancial Note 11, “Debt and Financing Activities,\n” for additional information on the public offering of the 2029 Notes. The changes in the fair value of these derivatives are recorded in “Interest expense” in the Consolidated Statements of Operations. \nThe changes in the fair value of these derivatives and the offsetting changes in the fair value of the hedged notes are recorded in earnings. Gains from the changes in the Company’s fair value hedges recorded in earnings were largely offset by the losses recorded in earnings on the hedged item. For components excluded from the assessment of hedge effectiveness, the initial value of the excluded component is recognized in accumulated other comprehensive income (loss) and then released into earnings over the life of the hedging instrument. The difference between the change in the fair value of the excluded component and the amount amortized into earnings during the period is recorded in other comprehensive income (loss).\n105\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nCash Flow Hedges\nFrom time to time, the Company enters into cross-currency swaps to hedge intercompany loans denominated in nonfunctional currencies to reduce the income statement effects arising from fluctuations in foreign currency exchange rates. The Company also enters into forward contracts to hedge the variability of future benchmark interest rates on any planned bond issuances and to offset the potential income statement effects from obligations denominated in non-functional currencies. The effective portion of changes in the fair value of these hedges is recorded in accumulated other comprehensive loss and reclassified into earnings in the same period in which the hedged transaction affects earnings. Changes in fair values representing hedge ineffectiveness are recognized in current earnings There were \nno\n gains or losses reclassified from accumulated other comprehensive loss and recorded in “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations for the years ended March 31, 2025, 2024, and 2023.\nIn the fourth quarter of fiscal 2025, the Company executed a series of forward-starting interest rate swap locks with notional amounts of $\n850\n million to hedge cash flows associated with interest payments on upcoming financing activities. Refer to \nFinancial \nNote 11\n, “\nDebt and Financing Activities\n,\n” for information on the Company’s debt obligations. \nIn April 2025, the Company executed forward-starting interest rate swap locks with a total notional amount of $\n550\n million. These swaps, in combination with the swaps executed during the fourth quarter of fiscal 2025, will hedge cash flows associated with interest payments on upcoming financing activities.\nIn the third quarter of fiscal 2024, the Company entered into foreign currency forward contracts designated as cash flow hedges with a total notional amount of £\n45\n million to hedge the variability of foreign currency exchange fluctuations in future cash payments due to a third party for capital expenditures, and certain of these contracts matured in the fourth quarter of fiscal 2024 and during fiscal 2025. \nIn fiscal 2023, the Company entered into forward-starting fixed interest rate swaps designated as cash flow hedges, with a combined notional amount of $\n450\n million, and in the first quarter of fiscal 2024 with a notional amount of $\n50\n million, to hedge the variability of future benchmark interest rates on a planned bond issuance. On June 15, 2023, the Company completed a public offering of the 2033 Notes, at which point the $\n500\n million cash flow hedges were terminated and the proceeds are being amortized to interest expense over the life of the 2033 Notes, or \n10\n years. Refer to Financial \nNote 11\n, “\nDebt and Financing Activities\n,” \nfor additional information on the public offering of the 2033 Notes.\nIn fiscal 2023, the Company also terminated its $\n500\n million notional forward-starting fixed interest rate swaps and recognized a gain of $\n97\n million within “Other income, net” in the Consolidated Statement of Operations.\nDerivatives Not Designated as Hedges\nDerivative instruments not designated as hedges are marked-to-market at the end of each accounting period with the change in fair value included in earnings. Changes in the fair values for contracts not designated as hedges were recorded directly into earnings in “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations. Changes in the fair values were not material for the year ended March 31, 2023. The Company did not enter into any derivative instruments not designated as hedges during fiscal 2025 and fiscal 2024.\n \nOther Information on Derivative Instruments\nGains (losses) from derivatives included in other comprehensive income in the Consolidated Statements of Comprehensive Income were as follows:\n106\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nDerivatives designated as net investment hedges:\nCross-currency swaps\n$\n80\n \n$\n3\n \n$\n28\n \nDerivatives designated as cash flow and other hedges:\nCross-currency swaps \n(1)\n$\n(\n4\n)\n$\n39\n \n$\n(\n54\n)\nInterest rate swap locks, Foreign currency forwards and Other\n(\n6\n)\n—\n \n—\n \nFixed interest rate swaps\n—\n \n14\n \n(\n30\n)\n(1)\nIncludes other comprehensive income related to the excluded component of certain fair value hedges.\nInformation regarding the fair value of derivatives on a gross basis were as follows:\nBalance Sheet \nCaption\nMarch 31, 2025\nMarch 31, 2024\nFair Value of \nDerivative\nU.S. Dollar Notional\nFair Value of \nDerivative\nU.S. Dollar Notional\n(In millions)\nAsset\nLiability\nAsset\nLiability\nDerivatives designated for hedge accounting:\nCross-currency swaps (current)\nPrepaid expenses and other/Other accrued liabilities\n$\n54\n \n$\n—\n \n$\n595\n \n$\n13\n \n$\n1\n \n$\n1,122\n \nCross-currency swaps (non-current)\nOther non-current assets/liabilities\n66\n \n18\n \n5,550\n \n108\n \n—\n \n1,638\n \nInterest rate swaps (non-current)\nOther non-current liabilities\n—\n \n18\n \n750\n \n—\n \n35\n \n1,250\n \nInterest Rate Swap Locks\nOther non-current liabilities\n—\n \n6\n \n850\n \n—\n \n—\n \n—\n \nForeign currency forwards (current)\nPrepaid expenses and other \n1\n \n—\n \n14\n \n—\n \n—\n \n35\n \nForeign currency forwards (non-current)\nOther non-current liabilities\n—\n \n—\n \n—\n \n—\n \n—\n \n15\n \nTotal\n$\n121\n \n$\n42\n \n$\n121\n \n$\n36\n \nRefer to \nFinancial \nNote 15\n, “\nFair Value Measurements\n,”\n for more information on these recurring fair value measurements.\n15.    \nFair Value Measurements\nThe Company measures certain assets and liabilities at fair value in accordance with ASC Topic 820, \nFair Value Measurements and Disclosures\n. The fair value hierarchy consists of three levels of inputs that may be used to measure fair value as follows:\nLevel 1 - quoted prices in active markets for identical assets or liabilities.\nLevel 2 - significant other observable market-based inputs.\nLevel 3 - significant unobservable inputs for which little or no market data exists and requires considerable assumptions that are significant to the fair value measurement.\n107\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nAssets and Liabilities Measured at Fair Value on a Recurring Basis\nCash and cash equivalents at March 31, 2025 and 2024 included investments in money market funds of $\n1.0\n billion and $\n705\n million, respectively, which are reported at fair value. The fair value of money market funds was determined using quoted prices for identical investments in active markets, which are considered to be Level 1 inputs under the fair value measurements and disclosure guidance. The carrying value of all other cash equivalents approximates their fair value due to their relatively short-term nature. \nFair values of the Company’s interest rate swaps, cross-currency swaps, and foreign currency forward contracts were determined using observable inputs from available market information, including quoted interest rates, foreign currency exchange rates, and other observable inputs from available market information. These inputs are considered Level 2 under the fair value measurements and disclosure guidance, and may not be representative of actual values that could have been realized or that will be realized in the future. Refer to \nFinancial \nNote 14\n, “\nHedging Activities\n,”\n for fair values and other information on the Company’s derivatives.\nThe Company holds investments in equity and debt securities of U.S. growth stage companies that address both current and emerging business challenges in the healthcare industry and which had a carrying value of $\n103\n million and $\n240\n million at March 31, 2025 and 2024, respectively. These investments primarily consist of equity securities without readily determinable fair values and are included in “Other non-current assets” in the Consolidated Balance Sheets. During fiscal 2025, the Company recognized impairment charges and realized gains on the exit of certain investments. During fiscal 2024, the Company recognized impairment charges and unrealized gains on certain investments. During fiscal 2023, the Company recognized impairment charges and realized gains on the exit of certain investments. The Company recognized a net gain of $\n101\n million in fiscal 2025, a net loss of $\n24\n million in fiscal 2024 and a net loss of $\n36\n million in fiscal 2023. These amounts were recorded in “Other income, net” in the Consolidated Statements of Operations. Of the gain recognized in fiscal 2025, $\n100\n million relates to a recapitalization event of one of the Company’s investments in equity securities which resulted in an increase to the carrying value of this investment. Proceeds from the sale of a portion of this investment were $\n92\n million. Additionally, during the fourth quarter of fiscal 2025, the Company exited one of its publicly-traded investments, receiving cash of $\n97\n million and recognizing a gain of $\n44\n million for the year ended March 31, 2025 offset by $\n44\n million asset impairments recorded in the fourth quarter of fiscal 2025. The carrying value of publicly traded investments was determined using quoted prices for identical investments in active markets and are considered to be Level 1 inputs.\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nIn addition to assets and liabilities that are measured at fair value on a recurring basis, the Company’s assets and liabilities are also subject to nonrecurring fair value measurements. Generally, assets are recorded at fair value on a nonrecurring basis as a result of impairment charges, including long-lived assets associated with the Company’s restructuring initiatives as discussed in more detail in \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n,\n” or as a result of charges to remeasure assets classified as held for sale to fair value less costs to sell.\nAt March 31, 2024, the contingent consideration liability related to the Company’s acquisition of RxSS in November 2022 was measured at fair value on a nonrecurring basis. Refer to \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n\"\n for more information on these transactions. \nThe aforementioned investments in equity securities of U.S. growth stage companies include the carrying value of investments without readily determinable fair values, which were determined using a measurement alternative and are recorded at cost less impairment, plus or minus any changes in observable price from orderly transactions of the same or similar security of the same issuer. These inputs related to changes in observable price are considered Level 2 under the fair value measurements and disclosure guidance and may not be representative of actual values that could have been realized or that will be realized in the future. Inputs related to impairments of investments are generally considered Level 3 fair value measurements due to their inherently unobservable nature based on significant assumptions by management and use of company-specific information.\nThere were no other material assets or liabilities measured at fair value on a nonrecurring basis at March 31, 2025 and 2024.\n108\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nOther Fair Value Disclosures\nAt March 31, 2025 and 2024, the carrying amounts of cash, certain cash equivalents, restricted cash, receivables, drafts and accounts payable, and other current liabilities approximated their estimated fair values because of the short-term maturity of these financial instruments.\nThe Company determines the fair value of commercial paper using quoted prices in active markets for identical instruments, which are considered Level 1 inputs under the fair value measurements and disclosure guidance.\nThe Company’s long-term debt is recorded at amortized cost. The carrying value and fair value of the Company’s long-term debt was as follows:\nMarch 31, 2025\nMarch 31, 2024\n(In millions)\nCarrying Value\nFair Value\nCarrying Value\nFair Value\nLong-term debt, including current maturities\n$\n5,654\n \n$\n5,598\n \n$\n5,629\n \n$\n5,488\n \nThe estimated fair value of the Company’s long-term debt was determined using quoted market prices in a less active market and other observable inputs from available market information, which are considered to be Level 2 inputs, and may not be representative of actual values that could have been realized or that will be realized in the future.\nGoodwill\nFair value assessments of the reporting unit and the reporting unit's net assets, which are performed for goodwill impairment tests, are considered a Level 3 measurement due to the significance of unobservable inputs developed using company-specific information. The Company considered a market approach as well as an income approach using a DCF model to determine the fair value of each reporting unit. \nLong-lived Assets\nThe Company utilizes multiple approaches including the DCF model and market approaches for estimating the fair value of intangible assets. The future cash flows used in the analysis are based on internal cash flow projections from its long-range plans and include significant assumptions by management. Accordingly, the fair value assessment of long-lived assets is considered a Level 3 fair value measurement.\nThe Company measures certain long-lived and intangible assets at fair value on a nonrecurring basis when events occur that indicate an asset group may not be recoverable. If the carrying amount of an asset group is not recoverable, an impairment charge is recorded to reduce the carrying amount by the excess over its fair value.\n Refer to \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n”\n under the heading “\nLong-Lived Asset Impairments” \nfor more information\n.\n16.    \nFinancial Guarantees and Warranties\nFinancial Guarantees\nThe Company has agreements with certain of its customers’ financial institutions, primarily in its International segment, under which it has guaranteed the repurchase of its customers’ inventory or its customers’ debt in the event these customers are unable to meet their obligations to those financial institutions. For the Company’s inventory repurchase agreements, among other requirements, inventories must be in a resalable condition and any repurchase would be at a discount. The inventory repurchase agreements mostly relate to certain Canadian customers and generally range from \none\n to \ntwo years\n. Customers’ debt guarantees generally range from \nthree\n to \nfive years\n and are primarily provided to facilitate financing for certain customers. The majority of the Company’s customers’ debt guarantees are secured by certain assets of the customer. At March 31, 2025, the maximum amounts of inventory repurchase guarantees and customers’ debt guarantees were $\n390\n million and $\n5\n million, respectively, of which the Company has not accrued any amounts. \n109\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe expirations of these financial guarantees were as follows:\n(In millions)\nFinancial Guarantees Subject to Expiration\nFiscal 2026\n$\n111\n \nFiscal 2027\n233\n \nFiscal 2028\n7\n \nFiscal 2029\n3\n \nFiscal 2030\n6\n \nThereafter\n35\n \nAt March 31, 2025, the Company’s banks and insurance companies have issued $\n206\n million of standby letters of credit and surety bonds, which were issued on the Company’s behalf primarily related to its customer contracts and in order to meet the security requirements for statutory licenses and permits, court and fiduciary obligations, pension obligations in Europe, and its workers’ compensation and automotive liability programs.\nThe Company’s software license agreements generally include certain provisions for indemnifying customers against liabilities if its software products infringe a third party’s intellectual property rights. To date, the Company has not incurred any material costs as a result of such indemnification agreements and has not accrued any liabilities related to such obligations.\nIn conjunction with certain transactions, primarily divestitures, the Company may provide routine indemnification agreements (such as retention of previously existing environmental, tax, and employee liabilities) whose terms vary in duration and often are not explicitly defined. Where appropriate, obligations for such indemnifications are recorded as liabilities. Because the amounts of these indemnification obligations often are not explicitly stated, the overall maximum amount of these commitments cannot be reasonably estimated. Other than obligations recorded as liabilities at the time of divestiture, the Company has historically not made material payments as a result of these indemnification provisions.\nWarranties\nIn the normal course of business, the Company provides certain warranties and indemnification protection for its products and services. For example, the Company provides warranties that the pharmaceutical and medical-surgical products it distributes are in compliance with the U.S. Food, Drug, and Cosmetic Act and other applicable laws and regulations. It has received the same warranties from its suppliers, which customarily are the manufacturers of the products. In addition, the Company has indemnity obligations to its customers for these products, which have also been provided from its suppliers, either through express agreement or by operation of law. Accrued warranty costs were not material to the Consolidated Balance Sheets as of March 31, 2025 and 2024.\n17.    \nCommitments and Contingent Liabilities\nIn addition to commitments and obligations incurred in the ordinary course of business, the Company is subject to a variety of claims and legal proceedings, including claims from customers and vendors, pending and potential legal actions for damages, governmental investigations, and other matters. The Company is vigorously defending itself against those claims and in those proceedings. Significant developments in those matters are described below. If the Company is unsuccessful in defending, or if it determines to settle, any of these matters, it may be required to pay substantial sums, be subject to injunction and/or be forced to change how it operates its business, which could have a material adverse impact on its financial position or results of operations.\n110\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nUnless otherwise stated, the Company is unable to reasonably estimate the loss or a range of possible loss for the matters described below. Often, the Company is unable to determine that a loss is probable, or to reasonably estimate the amount of loss or a range of loss, for a claim because of the limited information available and the potential effects of future events and decisions by third parties, such as courts and regulators, that will determine the ultimate resolution of the claim. Many of the matters described are at preliminary stages, raise novel theories of liability, or seek an indeterminate amount of damages. It is not uncommon for claims to remain unresolved over many years. The Company reviews loss contingencies at least quarterly to determine whether the likelihood of loss has changed and whether it can make a reasonable estimate of the loss or range of loss. When the Company determines that a loss from a claim is probable and reasonably estimable, it records a liability for an estimated amount. The Company also provides disclosure when it is reasonably possible that a loss may be incurred or when it is reasonably possible that the amount of a loss will exceed its recorded liability. Amounts included within “Claims and litigation charges, net” in the Consolidated Statements of Operations consist of estimated loss contingencies related to opioid-related litigation matters, as well as any applicable income items or credit adjustments due to subsequent changes in estimates.\nLitigation and Claims Involving Distribution of Controlled Substances\nThe Company and its affiliates have been sued as defendants in many cases asserting claims related to distribution of controlled substances, such as opioids. They have been named as defendants along with other pharmaceutical wholesale distributors, pharmaceutical manufacturers, and retail pharmacies. The plaintiffs in these actions have included state attorneys general, county and municipal governments, school districts, tribal nations, hospitals, health and welfare funds, third-party payors, and individuals. These actions have been filed in state and federal courts throughout the U.S., and in Puerto Rico and Canada. These plaintiffs have sought monetary damages and other forms of relief based on a variety of causes of action, including negligence, public nuisance, unjust enrichment, and civil conspiracy, as well as alleging violations of the Racketeer Influenced and Corrupt Organizations Act (“RICO”), state and federal controlled substances laws, and other statutes. Because of the many uncertainties associated with opioid-related litigation matters, the Company is not able to conclude that a liability is probable or provide a reasonable estimate for the range of ultimate possible loss for opioid-related litigation matters other than those for which an accrual is described below. \nState and Local Government Claims\nThe Company and \ntwo\n other national pharmaceutical distributors (collectively “Distributors”) entered into a governmental entities opioid settlement agreement (the “Settlement”) and consent judgment with \n48\n states and their participating subdivisions, as well as the District of Columbia and all eligible territories (the “Settling Governmental Entities”). Approximately \n2,300\n cases have been dismissed. The Distributors did not admit liability or wrongdoing and do not waive any defenses pursuant to the Settlement. Under the Settlement, the Company has paid the Settling Governmental Entities approximately $\n2.0\n billion as of March 31, 2025, and additionally will pay the Settling Governmental Entities up to approximately $\n5.9\n billion through 2038. A minimum of \n85\n% of the Settlement payments must be used by state and local governmental entities to remediate the opioid epidemic, while the remainder relates to plaintiffs’ attorneys’ fees and costs and will be paid out through 2030. Pursuant to the Settlement, the Distributors are in the process of establishing a clearinghouse to consolidate their controlled-substance distribution data, which will be available to the settling U.S. states to use as part of their anti-diversion efforts. \nAlabama and West Virginia did not participate in the Settlement. Under a separate settlement agreement with Alabama and its subdivisions, the Company has paid approximately $\n75\n million as of March 31, 2025, and additionally will pay approximately $\n99\n million through 2031. The Company previously settled with the state of West Virginia in 2018, so West Virginia and its subdivisions were not eligible to participate in the Settlement. Under a separate settlement agreement, the Company has paid certain West Virginia subdivisions approximately $\n68\n million as of March 31, 2025, and additionally will pay approximately $\n84\n million through 2033. That agreement does not include school districts or the claims of Cabell County and the City of Huntington. After a trial, the claims of Cabell County and the City of Huntington, were decided in the Company’s favor on July 4, 2022. Those subdivisions appealed that decision.\nSome other state and local governmental subdivisions did not participate in the Settlement, including certain municipal governments, government hospitals, school districts, and government-affiliated third-party payors. The Company contends that those subdivisions’ claims are foreclosed by the Settlement or other dispositive defenses, but the subdivisions contend that their claims are not foreclosed. \n111\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe City of Baltimore, Maryland, is \none\n such subdivision. A trial of its claims against the Company and another national pharmaceutical distributor began on September 16, 2024 in the Circuit Court of Maryland for Baltimore City,\n Mayor and City Council of Baltimore v. Purdue Pharma LP, No. 24-C-18-000515\n. Baltimore claims that the defendants’ distribution of controlled substances to certain pharmacies in the City of Baltimore and Baltimore County caused a public nuisance. On November 12, 2024, the jury returned a verdict finding the Company liable and assessing approximately $\n192\n million in compensatory damages. A second phase of the trial, in which the city seeks monetary abatement relief, began on December 11, 2024, and the court is currently considering whether to award additional relief. The judgment is not final, and the Company has filed a motion seeking to set aside the verdict. The Company believes it has valid bases to challenge the verdict and is prepared to appeal, if necessary. Because of the many bases to challenge the verdict, both in the trial court and on appeal, the Company has not adjusted its litigation reserve as a result of the jury verdict.\nThe district attorneys of the City of Philadelphia, Pennsylvania, and Allegheny County, Pennsylvania did not participate in the Settlement and sought to bring separate claims against the Company, notwithstanding the settlement with the state of Pennsylvania and its attorney general. On January 26, 2024, the Commonwealth Court of Pennsylvania ruled that the Pennsylvania attorney general had settled and fully released the claims brought by those district attorneys under Pennsylvania’s Unfair Trade Practices and Consumer Protection Law. The district attorneys have appealed that decision to the Supreme Court of Pennsylvania. An accrual for the remaining governmental subdivision claims is reflected in the total estimated liability for opioid-related claims in a manner consistent with how Settlement amounts were allocated to Settling Governmental Entities.\nNative American Tribe Claims\nThe Company also entered into settlement agreements for opioid-related claims of federally recognized Native American tribes. Under those agreements, the Company has paid the settling Native American tribes approximately $\n112\n million as of March 31, 2025, and additionally will pay approximately $\n84\n million through 2027. A minimum of \n85\n% of the total settlement payments must be used by the settling Native American tribes to remediate the opioid epidemic.\nNon-Governmental Plaintiff Claims\nThe Company is also a defendant in hundreds of opioid-related cases brought in the U.S. by private plaintiffs, such as hospitals, health and welfare funds, third-party payors, and individuals. These claims, and those of private entities generally, are not included in the settlement agreements described above. The Company and \ntwo\n other national distributors have reached settlements with representatives of nationwide groups of acute care hospitals and certain third-party payors. The claims of remaining U.S. non-governmental plaintiffs are not included in the charges recorded by the Company (described below).\nWith respect to the acute care hospitals for the year ended March 31, 2024, the Company recorded a charge of $\n149\n million within “Claims and litigation charges, net” in the Consolidated Statement of Operations to reflect its portion of a settlement with a nationwide class of acute care hospitals, of which $\n75\n million was recorded within Corporate expenses, net, and $\n74\n million was recorded within U.S. Pharmaceutical. The corresponding liability was included within “Other accrued liabilities” in the Consolidated Balance Sheet. On October 30, 2024, the U.S. District Court for the District of New Mexico granted preliminary approval to the proposed settlement, pursuant to which the Company placed approximately $\n149\n million into escrow on November 27, 2024. On March 4, 2025. the Court granted final approval to the settlement, which became effective on April 4, 2025. The escrow payment was presented as restricted cash within “Prepaid expenses and other” in the Company’s Consolidated Balance Sheet as of March 31, 2025. \nWith respect to the third-party payors, for the year ended March 31, 2025, the Company recorded a charge of $\n114\n million within “Claims and litigation charges, net” in the Consolidated Statement of Operations to reflect the Company’s portion of the settlement with representatives of a nationwide group of certain third-party payors, of which $\n57\n million was recorded within Corporate expenses, net and U.S. Pharmaceutical, respectively. The corresponding liability was included within “Other accrued liabilities” in the Consolidated Balance Sheet. On January 15, 2025, the U.S. District Court for the Northern District of Ohio overruled objections to the settlement and granted final approval to the settlement, pursuant to which the Company placed approximately $\n114\n million into escrow on February 12, 2025. An insurer that objected to the settlement has appealed, and, as a result of the appeal, the settlement has not become effective.\n112\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe Company’s estimated accrued liability for the above-described opioid-related claims of U.S. governmental entities, including Native American tribes, and certain non-governmental plaintiffs, including a settlement with certain third-party payors and a nationwide class of acute care hospitals, was as follows:\n(In millions)\nMarch 31, 2025\nMarch 31, 2024\nCurrent litigation liabilities \n(1)\n$\n776\n \n$\n665\n \nLong-term litigation liabilities\n5,601\n \n6,113\n \nTotal litigation liabilities\n$\n6,377\n \n$\n6,778\n \n(1)\nThese amounts, recorded in “Other accrued liabilities” in the Consolidated Balance Sheets, are the amounts estimated to be paid within the next twelve months following each respective period end date.\nDuring the year ended March 31, 2025, 2024, and 2023, the Company made payments totaling $\n515\n million, $\n544\n million, and $\n1.1\n billion, respectively, associated with the Settlement and the separate settlement agreements for opioid-related claims of participating states, subdivisions, and Native American tribes discussed above. \nCanadian Plaintiff Claims\nThe Company and its Canadian affiliate are also defendants in \nfour\n opioid-related cases pending in Canada. These cases involve the claims of the provincial governments, municipal governments, a group representing indigenous people, as well as \none\n case brought by an individual.\nDefense of Opioids Claims\nThe Company believes it has valid legal defenses in all opioid-related matters, including claims not covered by settlement agreements, and it intends to mount a vigorous defense in such matters. Other than the accruals described above, the Company has not concluded a loss is probable in any of the matters; nor is any possible loss or range of loss reasonably estimable. An adverse judgment or negotiated resolution in any of these matters could have a material adverse impact on the Company’s financial position, cash flows or liquidity, or results of operations.\nQui Tam Litigation\nOn August 8, 2018, the Company was served with a \nqui tam\n complaint pending in the United States District Court for the District of Massachusetts alleging that the Company violated the federal False Claims Act and various state false claims acts due to the alleged failure of the Company and other defendants to report providers who were engaged in diversion of controlled substances. \nUnited States ex rel. Manchester v. Purdue Pharma, L.P., et al.\n, Case No. 1-16-cv-10947. On August 22, 2018, the United States filed a motion to dismiss. The relator died, and on February 25, 2019 the court entered an order staying the matter until a proper party can be substituted, and providing that if no party is substituted within \n90\n days of February 25, 2019, the case would be dismissed. In April 2019, the widow of the relator filed a motion to substitute their daughter as the relator; the United States and defendants opposed this substitution request. The motion remains pending and the case remains stayed.\n113\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nOther Litigation and Claims\nOn or about April 25, 2018, a second amended \nqui tam \ncomplaint filed in the U.S. District Court for the Eastern District of New York was served on McKesson Corporation, McKesson Specialty Care Distribution Corporation, McKesson Specialty Distribution LLC, McKesson Specialty Care Distribution Joint Venture, L.P., Oncology Therapeutics Network Corporation, Oncology Therapeutics Network Joint Venture, L.P., US Oncology, Inc., and US Oncology Specialty, L.P. by Omni Healthcare, Inc. as relator, purportedly on behalf of the United States and \n33\n cities and states alleging that from 2001 through 2010 the defendants repackaged and sold single-dose syringes of oncology medications in a manner that violated the federal False Claims Act and various state and local false claims statutes, and seeking damages, treble damages, civil penalties, attorneys’ fees and costs of suit, all in unspecified amounts. \nUnited States of America ex rel. Omni Healthcare, Inc. v. McKesson Corp., et al.\n, 1:12-cv-06440 (E.D.N.Y.). The United States and the other governmental plaintiffs declined to intervene in the suit. In February 2019, the court dismissed all of the defendants except McKesson Corporation and Oncology Therapeutics Network Corp. On or about March 2, 2020, another \nqui tam \ncomplaint filed in the U.S. District Court for the Eastern District of New York was served on US Oncology, Inc. by the same relator purportedly on behalf of the United States and \n33\n cities and states alleging the same misconduct and seeking the same relief. \nUnited States ex rel. Omni Healthcare, Inc. v. US Oncology, Inc.\n, 1:19-cv-05125. The United States and the named states declined to intervene in the case. The relator filed an amended complaint on August 19, 2022. On September 8, 2023, US Oncology, Inc.’s motion to dismiss the amended complaint was granted. The dismissal was affirmed by the Court of Appeals for the Second Circuit on November 12, 2024. On March 27, 2025, the relator filed a petition seeking review by the U.S. Supreme Court.\nIn July 2015, The Great Atlantic & Pacific Tea Company (“A&P”), a former customer of the Company, filed for reorganization in bankruptcy under Chapter 11 of the United States Bankruptcy Code in the Bankruptcy Court for the Southern District of New York. \nIn re The Great Atlantic & Pacific Tea Company, Inc., et al.\n, Case No. 15-23007. A suit filed in 2017 against the Company in this bankruptcy case seeks to recover alleged preferential transfers. \nThe Official Committee of Unsecured Creditors on behalf of the bankruptcy estate of The Great Atlantic & Pacific Tea Company, Inc., et al. v. McKesson Corporation d/b/a McKesson Drug Co.\n, Adv. Proc. No. 17-08264. Trial concluded on July 18, 2024. The outcome of that trial is pending.\nOn October 17, 2024, the Company was served with a qui tam complaint filed in the United States District Court for the Eastern District of New York by a relator alleging that, from 2010 through at least 2012, the Company submitted false certifications to the government in support of Horizon Clinicals, an electronic health record product. \nUnited States ex rel. James Thompson v. McKesson Corporation\n, No. 16-CV-2891. The United States has declined to intervene in the case. The complaint seeks relief under the False Claims Act including damages, treble damages, civil penalties, attorney fees, and costs of suit.\nGovernment Subpoenas and Investigations \nFrom time to time, the Company receives subpoenas or requests for information from various governmental agencies. The Company generally responds to such subpoenas and requests in a cooperative, thorough, and timely manner. These responses sometimes require time and effort and can result in considerable costs being incurred by the Company. Such subpoenas and requests can lead to the assertion of claims or the commencement of civil or criminal legal proceedings against the Company and other members of the healthcare industry, as well as to settlements of claims against the Company. The Company responds to these requests in the ordinary course of business. The following are examples of the type of subpoenas or requests the Company receives from time to time.\nIn July 2024, the United States Department of Justice served a Civil Investigative Demand issued pursuant to the False Claims Act on the Company seeking documents and information related to administration of copay coupon programs associated with certain Sun Pharmaceutical Industries Inc. drugs.\nIn March 2025, the United States Department of Justice served a Civil Investigative Demand issued pursuant to the False Claims Act on NDCHealth Corporation, a subsidiary of the Company, seeking documents and information related to cybersecurity requirements in contracts or sub-contracts with the federal government.\n114\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nState Opioid Statutes\nIn April 2018, the State of New York Opioid Stewardship Act (“OSA”) imposed an aggregate $\n100\n million annual surcharge for 2017 and 2018 on all manufacturers and distributors licensed to sell or distribute opioids in New York. In December 2021, the Company paid $\n26\n million for the 2017 OSA surcharge assessment. On May 18, 2022, the Company filed a lawsuit in New York state trial court challenging the constitutionality of the OSA. In November 2022, the Company received a 2018 OSA surcharge assessment of approximately $\n42\n million. On December 14, 2022, the state court ruled that the OSA is constitutional. The Appellate Division subsequently ruled that the 2017 assessment was unconstitutional, but that the 2018 assessment was proper. The Company has paid $\n42\n million for the 2018 OSA surcharge assessment. The Company’s OSA challenge was pending before the New York Supreme Court. On March 31, 2025, The State of New York agreed to pay the Company $\n28\n million to settle the matter, subject to the availability of appropriations. The Company has not recorded a receivable for this recovery.\nEnvironmental Matters\nPrimarily as a result of the operation of the Company’s former chemical businesses, which were fully divested by 1987, the Company is involved in various matters pursuant to environmental laws and regulations. The Company has received claims and demands from governmental agencies relating to investigative and remedial actions purportedly required to address environmental conditions alleged to exist at \nfour\n sites where it, or entities acquired by it, formerly conducted operations and the Company, by administrative order or otherwise, has agreed to take certain actions at those sites, including soil and groundwater remediation.\nBased on a determination by the Company’s environmental staff, in consultation with outside environmental specialists and counsel, the current estimate of the Company’s probable loss associated with the remediation costs for these \nfour\n sites is $\n25\n million, net of amounts anticipated from third parties. The $\n25\n million is expected to be paid out between April 2025 and March 2055. The Company has accrued $\n25\n million for the estimated probable loss for these environmental matters in its \nConsolidated Balance Sheet\n as of March 31, 2025.\nThe Company has been designated as a Potentially Responsible Party (“PRP”) under the Superfund law for environmental assessment and cleanup costs as the result of its alleged disposal of hazardous substances at \n14\n sites. With respect to these sites, numerous other PRPs have similarly been designated and while the current state of the law potentially imposes joint and several liabilities upon PRPs, as a practical matter, costs of these sites are typically shared with other PRPs. For \none\n such site, the Company was one of multiple recipients of a New Jersey Department of Environmental Protection directive and a separate U.S. Environmental Protection Agency (“EPA”) directive concerning natural resources damages to the Passaic River associated with the Company’s Newark, New Jersey facility. In March 2016, the EPA selected a preferred remedy for this Lower Passaic River site with an estimated cost of approximately $\n1.4\n billion. In December 2022, the Company entered into a Consent Decree with the EPA that is currently pending approval by the U.S. District Court for the District of New Jersey and would require the Company to pay $\n3\n million, for which the Company maintained an escrow deposit as of March 31, 2025. Accordingly, the Company’s estimated probable loss at the remaining \n13\n sites is approximately $\n23\n million, which has been accrued for in the Consolidated Balance Sheet as of March 31, 2025. \nValue Added Tax Assessments\nThe Company operates in various countries outside the U.S. which collect value added taxes (“VAT”). The determination of the manner in which a VAT applies to the Company’s foreign operations is subject to varying interpretations arising from the complex nature of the tax laws. The Company has received assessments for VAT which are in various stages of appeal. The Company disagrees with these assessments and believes that it has a strong legal argument to defend its tax positions. Certain VAT assessments relate to years covered by an indemnification agreement. Due to the complex nature of the tax laws, it is not possible to estimate the outcome of these matters. However, based on currently available information, the Company believes the ultimate outcome of these matters will not have a material adverse effect on its financial position, cash flows or results of operations.\n115\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nAntitrust Settlements\nNumerous lawsuits have been filed against certain pharmaceutical manufacturers alleging that the manufacturer, by itself or in concert with others, took improper actions to delay or prevent generic drugs from entering the market. These lawsuits are sometimes brought as class actions on behalf of those who purchased directly from pharmaceutical manufacturers, including the Company. The Company does not recognize such amounts until received. In certain cases the Company is also named as a plaintiff. Some of these lawsuits have settled in the past with the Company receiving proceeds, including $\n444\n million, $\n244\n million, and $\n129\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively, which were included in “Cost of sales” in the Consolidated Statements of Operations. \nOther Matters \nThe Company is involved in various other litigation, governmental proceedings, and claims, not described above, that arise in the normal course of business. While it is not possible to determine the ultimate outcome or the duration of such litigation, governmental proceedings, or claims, the Company believes, based on current knowledge and the advice of counsel, that such litigation, proceedings, and claims will not have a material impact on the Company’s financial position or results of operations.\n18.    \nStockholders' Equity (Deficit) \nEach share of the Company’s outstanding common stock is permitted \none\n vote on proposals presented to stockholders and is entitled to participate equally in any dividends declared by the Board. \nIn July 2024, the Company’s quarterly dividend was raised from $\n0.62\n to $\n0.71\n per share of common stock for dividends declared on or after such date by the Board. The Company declared regular cash dividends of $\n2.75\n, $\n2.40\n, and $\n2.09\n per share for the years ended March 31, 2025, 2024, and 2023, respectively. The Company anticipates that it will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remain within the discretion of the Board and will depend upon the Company’s future earnings, financial condition, capital requirements, legal requirements, and other factors.\nShare Repurchase Plans\nThe Board has authorized the repurchase of common stock. The Company may repurchase common stock from time-to-time through open market transactions, privately negotiated transactions, accelerated share repurchase programs, or by combinations of such methods, any of which may use pre-arranged trading plans that are designed to meet the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934 (“Exchange Act”). The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, tax implications, restrictions under our debt obligations, other uses for capital, impacts on the value of remaining shares, cash generated from operations, and market and economic conditions.\nEffective January 1, 2023, the Company’s repurchase of common stock, adjusted for allowable items, are subject to a 1% excise tax as a result of the Inflation Reduction Act of 2022. Excise taxes incurred on share repurchases of an entity’s own common stock are direct and incremental costs to purchase treasury stock, and accordingly are included in the total cost basis of the common stock acquired and reflected as a reduction of stockholders’ equity within “Treasury shares” in the Company’s Consolidated Balance Sheets and Consolidated Statements of Stockholders’ Deficit. Excise taxes do not reduce the Company’s remaining authorization for the repurchase of common stock. Excise taxes of $\n26\n million and $\n25\n million were accrued for shares repurchased during the year ended March 31, 2025 and 2024, respectively. On October 30, 2024, the company made a payment of $\n25\n million for fiscal 2024 excise taxes previously accrued. As of March 31, 2025 and March 31, 2024, the amount accrued for excise taxes was $\n26\n million and $\n25\n million, respectively, within “Other accrued liabilities” in the Company’s Consolidated Balance Sheets.\n116\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nInformation regarding share repurchase activity over the last three fiscal years were as follows:\nShare Repurchases \n(1)\n(In millions, except price per share)\nTotal \nNumber of\nShares \nPurchased \n(2) \nAverage Price \nPaid Per Share\nApproximate \nDollar Value of \nShares that May \nYet Be Purchased \nUnder the \nPrograms \n(3)\nBalance, March 31, 2022\n$\n3,278\n \nShares repurchased - February 2022 ASR \n(4)\n0.3\n \n$\n295.16\n \n—\n \nShares repurchased - May 2022 ASR\n3.1\n \n$\n321.05\n \n(\n1,000\n)\nShare repurchase authorization increase in fiscal 2023\n4,000\n \nShares repurchased - December 2022 ASR\n2.6\n \n$\n369.20\n \n(\n972\n)\nShares repurchased - Open market \n(5)\n4.7\n \n$\n363.24\n \n(\n1,693\n)\nBalance, March 31, 2023\n3,613\n \nShare repurchase authorization increase in fiscal 2024 \n6,000\n \nShares repurchased - Open market\n6.9\n \n$\n436.46\n \n(\n2,998\n)\nBalance, March 31, 2024\n6,615\n \nShare repurchase authorization increase in fiscal 2025\n4,000\n \nShares repurchased - Open market\n5.8\n \n$\n543.05\n \n(\n3,146\n)\nBalance, March 31, 2025\n$\n7,469\n \n(1)\nThis table does not include the value of equity awards surrendered to satisfy tax withholding obligations or forfeitures of equity awards.\n(2)\nThe number of shares purchased reflects rounding adjustments.\n(3)\nThe remaining authorization outstanding for repurchases of common stock excludes $\n26\n million and $\n25\n million of excise taxes incurred on share repurchases for the years ended March 31, 2025 and 2024, respectively.\n(4)\nIn February 2022, the Company entered into an ASR program with a third-party financial institution to repurchase $\n1.5\n billion shares of common stock. The total number of shares repurchased under this ASR program was \n5.1\n million shares at an average price per share of $\n295.16\n. The Company received \n4.8\n million shares as the initial share settlement in the fourth quarter of fiscal 2022, and in May 2022, the Company received an additional \n0.3\n million shares upon the completion of this ASR program.\n(5)\nOf the total dollar value, $\n27\n million was accrued within “Other accrued liabilities” in the Company’s Consolidated Balance Sheet as of March 31, 2023 for share repurchases that were executed in late March 2023 and settled in early April 2023.\n117\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nAccumulated Other Comprehensive Loss\nInformation regarding changes in the Company’s accumulated other comprehensive loss by component were as follows:\nForeign Currency Translation Adjustments\n(In millions)\nForeign Currency Translation Adjustments, Net of Tax \n(1)\nUnrealized Gains (Losses) on Net Investment Hedges, \nNet of Tax \n(2)\nUnrealized Gains (Losses) on Cash Flow and Other Hedges, \nNet of Tax \n(3)\nUnrealized Gains (Losses) and Other Components of Benefit Plans, Net of Tax\nTotal Accumulated Other Comprehensive Loss\nBalance, March 31, 2022\n$\n(\n1,504\n)\n$\n10\n \n$\n27\n \n$\n(\n67\n)\n$\n(\n1,534\n)\nOther comprehensive income (loss) before reclassifications \n(\n329\n)\n112\n \n10\n \n28\n \n(\n179\n)\nAmounts reclassified to earnings and \nother \n(4)\n1,027\n \n(\n136\n)\n(\n73\n)\n34\n \n852\n \nOther comprehensive income (loss)\n698\n \n(\n24\n)\n(\n63\n)\n62\n \n673\n \nLess: amounts attributable to noncontrolling and redeemable noncontrolling interests\n41\n \n—\n \n—\n \n3\n \n44\n \nOther comprehensive income (loss) attributable to McKesson\n657\n \n(\n24\n)\n(\n63\n)\n59\n \n629\n \nBalance, March 31, 2023 \n(\n847\n)\n(\n14\n)\n(\n36\n)\n(\n8\n)\n(\n905\n)\nOther comprehensive income (loss) before reclassifications \n(\n9\n)\n2\n \n39\n \n(\n6\n)\n26\n \nAmounts reclassified to earnings and \nother \n—\n \n—\n \n—\n \n(\n2\n)\n(\n2\n)\nOther comprehensive income (loss)\n(\n9\n)\n2\n \n39\n \n(\n8\n)\n24\n \nBalance, March 31, 2024 \n(\n856\n)\n(\n12\n)\n3\n \n(\n16\n)\n(\n881\n)\nOther comprehensive income (loss) before reclassifications \n(\n214\n)\n59\n \n(\n5\n)\n(\n16\n)\n(\n176\n)\nAmounts reclassified to earnings and other \n(5) (6)\n81\n \n—\n \n(\n2\n)\n46\n \n125\n \nOther comprehensive income (loss)\n(\n133\n)\n59\n \n(\n7\n)\n30\n \n(\n51\n)\nBalance,  March 31, 2025\n$\n(\n989\n)\n$\n47\n \n$\n(\n4\n)\n$\n14\n \n$\n(\n932\n)\n(1)\nPrimarily results from the conversion of non-U.S. dollar financial statements of the Company’s operations in Canada and Europe into the Company’s reporting currency, U.S. dollars.\n(2)\nAmounts before reclassifications recorded in fiscal 2023 include gains of $\n7\n million related to net investment hedges from Euro-denominated notes. Amounts before reclassifications recorded in fiscal 2025, fiscal 2024, and fiscal 2023 include gains of $\n80\n million, $\n3\n million, and $\n28\n million, respectively, related to net investment hedges from cross-currency swaps. These amounts are net of income tax (expense) of $(\n21\n) million, $(\n1\n) million, and $(\n33\n) million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively. \n(3)\nAmounts before reclassifications recorded in fiscal 2025, fiscal 2024, and fiscal 2023 include gains (losses) of $(\n4\n) million, $\n39\n million, and $(\n54\n) million, respectively, related to cash flow and other hedges from cross-currency swaps. Amounts before reclassifications recorded in fiscal 2025 include a loss of $(\n6\n) million related to cash flow hedges from Interest rate swap locks and\n \nforeign currency forwards. Amounts before reclassifications recorded in fiscal 2024, and fiscal 2023 include gains (losses) of $\n14\n million, and $(\n30\n) million, respectively, related to cash flow hedges from fixed interest rate swaps. These amounts are net of income tax benefit (expense) of $\n3\n million, $(\n14\n) million, and $\n21\n million in fiscal 2025, fiscal 2024, and fiscal 2023, respectively. \n(4)\nPrimarily includes adjustments for amounts related to the divestitures of the E.U. disposal group in October 2022, including the impact of amounts previously attributed to the noncontrolling interest in McKesson Europe, and the U.K. disposal group in April 2022, as discussed in more detail in \nFinancial Note 2, “Business Acquisitions and Divestitures.”\n These amounts were included in the fiscal 2023 calculations of charges to remeasure the assets and liabilities of the disposal groups to fair value less costs to sell recorded within “Selling, distribution, general, and administrative expenses” in the Consolidated Statements of Operations. Amounts reclassified to earnings and other includes a net income tax impact of $\n6\n million.\n118\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n(5)\nIncludes adjustments to Foreign Currency Translation Adjustments, Net of Tax for the year ended March 31, 2025 related to the Canadian retail disposal group, as discussed in more detail in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n These amounts were included in the current and prior periods calculation of charges to remeasure the assets and liabilities held for sale to fair value less costs to sell recorded within “Selling, distribution, general, and administrative expenses” in the Company’s Consolidated Statements of Operations, and a reclassification related to the termination of the U.K. pension plan, as discussed in more detail in \nFinancial Note 13, “Pension Benefits.”\n(6)\nAdjustments to Unrealized Gains (Losses) and Other Components of Benefit Plans, Net of Tax for the year ended March 31, 2025 include reclassification of losses related to the termination of the U.K. pension plan as discussed in more detail in \nFinancial Note 13, “Pension Benefits.”\n. Amounts reclassified to earnings and other includes a net income tax impact of\n $\n11\n million.\n19.    \nRelated Party Balances and Transactions\nIn fiscal 2025, the U.S pharmaceutical sales to one of the Company’s equity method investees totaled $\n1.1\n billion. Trade receivables related to transactions from this investee were $\n313\n million as of March 31, 2025. In fiscal 2024, the Company’s investment in this entity was not accounted for under the equity method and, as a result, was not classified as a related party.\n \n20.    \nSegments of Business \nThe Company reports its financial results in \nfour\n operating and reportable segments: U.S. Pharmaceutical, RxTS, Medical-Surgical Solutions, and International. The organizational structure also includes Corporate, which consists of income and expenses associated with administrative functions and projects, and the results of certain investments and operations. The factors for determining the segments include the manner in which management evaluates the performance of the Company combined with the nature of the individual business activities. The Company evaluates the performance of its operating segments on a number of measures, including revenues and operating profit (loss) before interest expense and income taxes. \nThe Company’s chief operating decision maker (“CODM”) is its Chief Executive Officer. The CODM uses operating profit (loss) before interest expense and income taxes to assess performance and allocate resources for each reportable segment during the Company’s annual long-term planning process and through quarterly operating reviews focused on each segment’s results compared to the budget and rolling forecast. The CODM is regularly provided with budgeted or forecasted expense information for the segment and also uses consolidated expense information. Assets by segment are not a measure used to assess the performance of the Company by the CODM and thus are not reported in our disclosures.\nThe U.S. Pharmaceutical segment distributes branded, generic, specialty, biosimilar and over-the-counter pharmaceutical drugs, and other healthcare-related products in the U.S. This segment also provides practice management, technology, clinical support, and business solutions to community-based oncology and other specialty practices. In addition, the segment sells financial, operational, and clinical solutions to pharmacies (retail, hospital, alternate sites) and provides consulting, outsourcing, technological, and other services.\nThe RxTS segment helps solve medication access, affordability, and adherence challenges for patients by working across healthcare to connect patients, pharmacies, providers, pharmacy benefit managers, health plans, and biopharma companies. RxTS serves our biopharma and life sciences partners, delivering innovative solutions that help people get the medicine they need to live healthier lives. RxTS offers technology services, which includes electronic prior authorization, prescription price transparency, benefit insight, and dispensing support services, in addition to third-party logistics and wholesale distribution support designed to benefit stakeholders.\nThe Medical-Surgical Solutions segment provides medical-surgical supply distribution, logistics, and other services to healthcare providers, including physician offices, surgery centers, nursing homes, hospital reference labs, and home health care agencies. This segment offers national brand medical-surgical products as well as McKesson’s own line of high-quality products through a network of distribution centers in the U.S.\n119\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nThe International segment includes the Company’s operations in Canada and Norway, bringing together non-U.S.-based drug distribution services, specialty pharmacy, retail, and infusion care services. The Company’s Canadian operations deliver medicines, supplies, and information technology solutions throughout Canada and included Rexall Health retail pharmacies. The Company’s Norwegian operations provide distribution and services to wholesale and retail customers in Norway where it owns, partners, or franchises with retail pharmacies. During fiscal 2025, the Company completed the previously announced transaction to sell the Canadian retail disposal group. During fiscal 2023, the Company completed the divestitures of the U.K. disposal group in April 2022, and the E.U. disposal group in October 2022. Refer to \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n for more information related to these divestitures.\n120\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\nFinancial information relating to the Company’s reportable operating segments and reconciliations to the consolidated totals was as follows:\n \nYears Ended March 31,\n(In millions)\n2025\n2024\n2023\nSegment revenues \n(1)\nU.S. Pharmaceutical\n$\n327,717\n \n$\n278,739\n \n$\n240,616\n \nPrescription Technology Solutions\n5,216\n \n4,769\n \n4,387\n \nMedical-Surgical Solutions\n11,386\n \n11,313\n \n11,110\n \nInternational\n14,721\n \n14,130\n \n20,598\n \nCorporate\n11\n \n—\n \n—\n \nTotal revenues\n$\n359,051\n \n$\n308,951\n \n$\n276,711\n \nOther segment expense, net \n(2) \nU.S. Pharmaceutical \n(3) \n$\n323,715\n \n$\n275,953\n \n$\n237,410\n \nPrescription Technology Solutions \n(4) \n4,341\n \n3,934\n \n3,821\n \nMedical-Surgical Solutions \n(5) \n10,613\n \n10,361\n \n9,993\n \nInternational \n(6) \n14,934\n \n13,811\n \n20,462\n \nTotal other expense, net\n$\n353,603\n \n$\n304,059\n \n$\n271,686\n \nSegment operating profit (loss)\nU.S. Pharmaceutical\n$\n4,002\n \n$\n2,786\n \n$\n3,206\n \nPrescription Technology Solutions\n875\n \n835\n \n566\n \nMedical-Surgical Solutions\n773\n \n952\n \n1,117\n \nInternational\n(\n213\n)\n319\n \n136\n \nSubtotal\n5,437\n \n4,892\n \n5,025\n \nCorporate expenses, net \n(7)\n(\n813\n)\n(\n851\n)\n(\n147\n)\nInterest expense\n(\n265\n)\n(\n252\n)\n(\n248\n)\nIncome from continuing operations before income taxes\n$\n4,359\n \n$\n3,789\n \n$\n4,630\n \nSegment depreciation and amortization \n(8) \nU.S. Pharmaceutical\n$\n231\n \n$\n229\n \n$\n212\n \nPrescription Technology Solutions\n86\n \n84\n \n77\n \nMedical-Surgical Solutions \n93\n \n84\n \n80\n \nInternational\n86\n \n117\n \n115\n \nCorporate\n140\n \n121\n \n124\n \nTotal depreciation and amortization\n$\n636\n \n$\n635\n \n$\n608\n \nSegment expenditures for long-lived assets \n(9) \nU.S. Pharmaceutical\n$\n241\n \n$\n193\n \n$\n154\n \nPrescription Technology Solutions\n11\n \n31\n \n35\n \nMedical-Surgical Solutions\n163\n \n159\n \n117\n \nInternational\n107\n \n75\n \n79\n \nCorporate\n337\n \n229\n \n173\n \nTotal expenditures for long-lived assets\n$\n859\n \n$\n687\n \n$\n558\n \n(1)\nRevenues from services on a disaggregated basis represent approximately \n1\n% of the U.S. Pharmaceutical segment’s total revenues, less than \n39\n% of the RxTS segment’s total revenues, less than \n1\n% of the Medical-Surgical Solutions segment’s total revenues, and less than \n1\n% of the International segment’s total revenues. The International segment reflects foreign revenues. Revenues for the remaining three reportable segments are domestic.\n(2)\nOther segment expense, net includes cost of sales, total operating expenses, as well as other income, net, for the Company’s reportable segments.\n121\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Continued)\n(3)\nThe Company’s U.S. Pharmaceutical other segment expense, net includes the following:\n•\na credit of $\n206\n million and a provision for bad debts of $\n725\n million for the years ended March 31, 2025 and 2024, respectively, related to the bankruptcy of the Company’s customer Rite Aid Corporation (including certain of its subsidiaries, “Rite Aid”). Rite Aid filed a voluntary petition for reorganization under Chapter 11 of the Bankruptcy Code in October 2023. The Company recognized a provision for bad debts of $\n725\n million for the year ended March 31, 2024, which represented the uncollected trade accounts receivable from sales to Rite Aid prior to its bankruptcy petition filing. The credit in fiscal 2025 is due to the Company’s reassessment of its initial fiscal 2024 estimates of the previously reserved prepetition balance owed by Rite Aid. The amounts described above were recorded within “Selling, distribution, general, and administrative expenses” in the Company’s Consolidated Statements of Operations. Rite Aid's restructuring plan was approved by the court and the company successfully emerged from bankruptcy in August, 2024;\n•\ncash receipts for the Company’s share of antitrust legal settlements were $\n444\n million, $\n244\n million, and $\n129\n million for the years ended March 31, 2025, 2024, and 2023, respectively. These gains were recorded within “Cost of sales” in the Company’s Consolidated Statements of Operations;\n•\na charge of $\n82\n million, a credit of $\n157\n million, and a charge of $\n1\n million for the years ended March 31, 2025, 2024, and 2023, respectively, related to the LIFO method of accounting for inventories. These amounts were recorded within “Cost of sales” in the Company’s Consolidated Statements of Operations;\n•\nrestructuring charges of $\n59\n million for the year ended March 31, 2025 for restructuring initiatives, as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net;”\n•\ncharges of $\n57\n million and $\n74\n million for the years ended March 31, 2025 and 2024, respectively, related to the estimated liability for opioid-related claims, as discussed in \nFinancial Note 17, “Commitments and Contingent Liabilities;\"\n•\na loss of $\n43\n million for the year ended March 31, 2025 related to one of the Company’s equity method investments, which was recorded within “Other income, net” in the Company’s Consolidated Statement of Operations; and\n•\na gain of $\n142\n million for the year ended March 31, 2023 related to the exit of one of the Company’s investments in equity securities in July 2022 for proceeds of $\n179\n million, which is reflected within “Other income, net” in the Company’s Consolidated Statement of Operations.\n(4)\nThe Company’s RxTS other segment expense, net includes the following:\n•\ngains of $\n78\n million in fiscal 2024 resulting from fair value adjustments of the Company’s contingent consideration liability related to the RxSS acquisition, as discussed in \nFinancial \nNote 2\n, “\nBusiness Acquisitions and Divestitures\n;”\n and\n•\nrestructuring charges of $\n43\n million in fiscal 2023 primarily for severance and employee-related costs, as well as asset impairments and accelerated depreciation. Refer to \nFinancial \nNote 3\n, “\nRestructuring, Impairment, and Related Charges, Net\n” for further information. \n(5)\nThe Company’s Medical-Surgical Solutions other segment expense, net for the year ended March 31, 2025 includes restructuring charges of $\n204\n million for restructuring initiatives, as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net\n.\n”\n(6)\nThe Company’s International other segment expense, net includes the following:\n•\na charge of $\n605\n million for the year ended March 31, 2025 to remeasure the assets and liabilities of the Canadian retail disposal group to fair value less costs to sell, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures;”\n and\n•\na charge of $\n240\n million for the year ended March 31, 2023 to remeasure the assets and liabilities of the E.U. disposal group to fair value less costs to sell, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures\n.\n”\n(7)\nCorporate expenses, net, includes the following:\n•\ncharges of $\n87\n million related to the termination of the U.K. pension plan;\n•\na charge of $\n62\n million for the year ended March 31, 2025 related to the effect of accumulated other comprehensive loss components from the Canadian retail disposal group, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures;”\n•\na net gain of $\n101\n million for the year ended March 31, 2025, and net losses of $\n24\n million and $\n36\n million for the years ended March 31, 2024, and 2023, respectively, related to the Company’s investments in equity securities of certain U.S. growth stage companies in the healthcare industry, as discussed in \nFinancial Note 15, “Fair Value Measurements;”\n•\nnet charges of $\n51\n million and $\n73\n million for the years ended March 31, 2025 and 2024, respectively, and a credit of $\n8\n million for the year ended March 31, 2023, related to the estimated liability for opioid-related claims, as discussed in \nFinancial Note 17, “Commitments and Contingent Liabilities;”\n•\nrestructuring charges of $\n68\n million, $\n55\n million, and $\n83\n million for the years ended March 31, 2025, 2024, and 2023, respectively, for restructuring initiatives, as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net;”\n•\ncharges of $\n14\n million, $\n35\n million, and $\n36\n million for the years ended March 31, 2025, 2024, and 2023, respectively, for opioid-related costs, primarily litigation expenses; \n122\nTable of Contents\nItem 8 Index\nMcKESSON CORPORATION\nFINANCIAL NOTES (Concluded)\n•\na gain of $\n306\n million in fiscal 2023 primarily related to the effect of accumulated other comprehensive loss components from the E.U. disposal group, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures;”\n•\na gain of $\n126\n million in fiscal 2023 related to a cash payment received for the early termination of a TRA exercised by Change in October 2022 and was recorded within “Other income, net” in the Consolidated Statement of Operations, as discussed in \nFinancial \nNote 5\n, “\nOther Income, Net\n;”\n and\n•\na gain of $\n97\n million in fiscal 2023 from the termination of certain forward-starting fixed interest rate swaps, as discussed in \nFinancial \nNote 14\n, “\nHedging Activities\n.\n”\n(8)\nAmounts primarily consist of amortization of acquired intangible assets purchased in connection with business acquisitions and capitalized software for internal use as well as depreciation and amortization of property, plant, and equipment, net. \n(9)\nLong-lived assets consist of property, plant, and equipment, net and capitalized software.\nLong-lived assets by geographic areas were as follows:\n \nMarch 31,\n(In millions)\n2025\n2024\nLong-lived assets \n(1)\nUnited States\n$\n2,877\n \n$\n2,477\n \nForeign\n306\n \n334\n \nTotal long-lived assets\n$\n3,183\n \n$\n2,811\n \n(1)\nLong-lived assets consist of property, plant, and equipment, net and capitalized software.\n123\nTable of Contents\nMcKESSON CORPORATION\nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone.\nItem 9A.\n    \nControls and Procedures.\nDisclosure Controls and Procedures\nOur Chief Executive Officer and our Chief Financial Officer, with the participation of other members of the Company’s management, have evaluated the effectiveness of the Company’s “disclosure controls and procedures” (as such term is defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) as of the end of the period covered by this report and have concluded that our disclosure controls and procedures are effective based on their evaluation of these controls and procedures as required by paragraph (b) of Exchange Act Rules 13a-15 or 15d-15.\nInternal Control over Financial Reporting\nManagement’s report on the Company’s internal control over financial reporting (as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f)) and the related report of our independent registered public accounting firm are included in this Annual Report, under the headings, “Management’s Annual Report on Internal Control Over Financial Reporting” and “Report of Independent Registered Public Accounting Firm,” and are incorporated herein by reference.\nChanges in Internal Controls\nThere was no change in our internal control over financial reporting identified in connection with the evaluation required by paragraph (d) of Exchange Act Rules 13a-15 or 15d-15 that occurred during our fourth quarter of fiscal 2025 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B.\n    \nOther Information. \n(a) Entry into a Material Definitive Agreement\n364 Day Facility\nOn May 8, 2025, the Company entered into a Credit Agreement among the Company, as borrower, the lenders party thereto, the letter of credit issuers party thereto, Bank of America, N.A., as an administrative agent, and the other parties thereto.\nUnder the 364 Day Credit Facility, which is scheduled to mature in May 2026, the Company has a revolving line of credit available of up to $1.0 billion. On or prior to the maturity date of the 364 Day Credit Facility, the Company has the option, subject to certain customary conditions, to convert the outstanding revolving loans into a term loan that is repayable in May 2027. The terms and conditions of the 364 Day Credit Facility are substantially similar to those in place under the Credit Agreement, dated November 7, 2022 (as amended by that certain First Amendment to the Credit Agreement, dated as of November 7, 2024 and that certain Second Amendment to the Credit Agreement, dated as of May 8, 2025), among the Company, as borrower, the lenders party thereto, the letter of credit issuers party thereto, Bank of America, N.A., as administrative agent.\nBorrowings under the 364 Day Credit Facility bear interest based upon the SOFR for credit extensions denominated in U.S. Dollars and other relevant underlying benchmarks plus agreed margins. In the case of an event of default under the 364 Day Credit Facility, the lenders may elect, among other things, to declare any unpaid amounts obtained under the 364 Day Credit Facility to be immediately due and payable.\nCapitalized terms used but not otherwise defined herein have the meanings ascribed thereto in the 364 Day Credit Facility. A copy of the 364 Day Credit Facility is attached as Exhibit 10.24 to this report and is incorporated herein by reference.\n124\nTable of Contents\nMcKESSON CORPORATION\n(b) Pre-arranged \nTrading Plans\n \nOn \nFebruary 7, 2025\n, \nNapoleon B. Rutledge Jr\n, our \nSenior Vice President and Controller\n, \nadopted\n a Rule 10b5-1 trading arrangement for the sale of up to \n2,984\n shares of the Company’s common stock. The duration of the trading arrangement is until February 12, 2026 or earlier if all transactions under the trading arrangement are completed or if the trading arrangement is otherwise terminated according to its terms. The trading arrangement was entered into during an open trading window period and Mr. Rutledge represented to us that he intended for it to satisfy the requirements for the affirmative defense of Rule 10b5-1(c) of the Exchange Act. The number of shares subject to the arrangement includes shares that may be withheld by the Company to satisfy income tax withholding and remittance obligations in connection with the net settlement of equity awards.\n \nItem 9C.\n    \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III\nItem 10.\n    \nDirectors, Executive Officers, and Corporate Governance. \nInformation about our directors is incorporated by reference from the discussion under the heading “Election of Directors” under Item 1 of our Proxy Statement for the calendar year 2025 Annual Meeting of Shareholders, which will be filed with the SEC within 120 days of the Company’s fiscal year end covered by this Annual Report (the “Proxy Statement”). Information about our executive officers is incorporated by reference from the discussion in Part I of this Annual Report under the heading “Information about our Executive Officers.” Information about our Audit Committee, including the members of the committee and our Audit Committee Financial Experts, is incorporated by reference from the discussion in Item 1 of the Proxy Statement under the heading “The Board, Committees and Meetings,” and in"
  }
}