{
  "ticker": "MCO",
  "cik": "0001059556",
  "company_name": "MOODYS CORP /DE/",
  "filing_date": "2025-02-14",
  "accession": "0001059556-25-000025",
  "primary_doc": "mco-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nBackground\nAs used in this report, except where the context indicates otherwise, the terms “Moody’s” or the “Company” refer to Moody’s Corporation, a Delaware corporation, and its subsidiaries. The Company’s executive offices are located at 7 World Trade Center at 250 Greenwich Street, New York, NY 10007 and its telephone number is (212) 553-0300.\nTHE COMPANY\nCompany Overview\nIn a world shaped by increasingly interconnected risks, Moody's data, insights, and innovative technologies help customers develop a holistic view of their world and unlock opportunities. With a rich history of experience in global markets and a diverse workforce of approximately 16,000 across more than 40 countries, Moody's gives customers the comprehensive perspective needed to act with confidence and thrive.\nMoody's is helping customers accelerate value creation in an era of exponential risk.\nMoody's\nWe provide tools that enable Banks, Insurers, Investors, Corporations and Governments to...\nWhat do \nwe do?\nIssue, Originate, Select, Underwrite\nIdentify, Measure, \nMonitor & Manage Risk\nVerify, Comply, Plan \n& Report\nLeveraging an unrivaled set of data, analytics, & domain expertise across...\nHow do we \ndo this?\nCredit\nCompanies\nProperties\nSecurities\nPeople\nEconomies\nESG\nClimate\nMoody’s has two reportable segments: MA and MIS. \nMoody's Analytics\nMoody's Investors Service\nMA provides data, intelligence and analytical tools to help business and financial leaders make confident decisions.\nFor more than 115 years, MIS has been a leading provider of credit ratings, research, and risk analysis helping businesses, governments, and other entities around the globe.\nFinancial information and operating results of these segments, including revenue, expenses and Adjusted Operating Income, are included in Part II, Item 8. Financial Statements of this annual report and are herein incorporated by reference.\n10\n     MOODY'S\n 2024 10-K\nTable of Contents\nMoody's Analytics Overview\nMA empowers financial services, corporate and public sector customers to anticipate risks, adapt and thrive in a new era of exponential risk. MA's combined data, analytics and cloud-based software tools deliver integrated solutions that help customers to start business relationships, monitor and manage risk, and comply and report based on global laws, rules and regulations. \nMA is comprised of: i) a premier fixed income and economic research business (Research & Insights); ii) a data business powered by the world’s largest database on companies and credit (Data & Information); and iii) three cloud-based subscription businesses serving banking, insurance and KYC workflows (Decision Solutions).\nMA creates a holistic view on risk provided by our vast set of proprietary data, analytics, and domain expertise across a range of areas, including credit, companies, properties, securities, people, economies, ESG, climate and more. MA's integrated and technology-enabled solutions provide unique capabilities and insights that are embedded in customer workflows.\nMOODY'S\n 2024 10-K     11\nTable of Contents\nMA by the Numbers\n14,800+\n6,700+\n800+\nMA Customers\nCorporates and Professional Services\nReal Estate Entities\n165+\n2,600+\n600+\nCountries where MA customers operate\nCommercial Banks\nEducational Institutions\n1,900+\n200+\nAsset Managers\nSecurities Dealers and Investment Banks\n900+\n200+\nGovernment Entities\nOthers\n900+\nInsurance Companies\n12\n     MOODY'S\n 2024 10-K\nTable of Contents\nMoody's Investors Service Overview\nMIS is a leading global provider of credit ratings, research, and risk analysis. A rating from Moody’s enables issuers to create timely, go-to-market debt strategies with the ability to capture wider investor focus and provides investors with a comprehensive view of global debt markets through our credit ratings and research. Moody’s trusted insights can help decision-makers navigate the safest path through market turmoil and volatility.\nMIS publishes credit ratings and provides assessment services on a wide range of debt obligations, programs and facilities, and the entities that issue such obligations in markets worldwide, including various corporate, financial institution and governmental obligations, and structured finance securities.\nThe Benefits of a Moody's Rating \nInvestors seek Moody's opinions and particularly value the knowledge of its analysts and the depth of Moody's research\nAccess to capital\nTransparency, credit comparison and market stability\nPlanning and budgeting\nAnalytical capabilities\n•\nMoody’s opinions on credit are used by institutional investors throughout the world, making an issuer’s debt potentially more attractive to a wide range of buyers.\n•\nSignals a willingness by issuers to be transparent and provides issuers with an independent assessment against which to compare creditworthiness.\n•\nMay help issuers when formulating internal capital plans and funding strategies.\n•\nAmong ratings advisors, Moody’s has a strong position and is well-recognized for the depth and breadth of its analytical capabilities.\n•\nA Moody’s rating may facilitate access to both domestic and international debt capital.\n•\nMoody’s ratings and research reports may help maintain investor confidence, especially during periods of market stress.\nMIS by the Numbers\n$75.8+ trillion\n4,800+\n3,300+\nTotal Rated Debt Outstanding\nNon-Financial Corporates\nFinancial Institutions\n33,300+\n14,400+\n8,900+\nRated Organizations and Structured Deals\nU.S. Public Finance Issuers\nStructured Finance Deals\n190+\n1,000+\n380+\nRating Methodologies\nInfrastructure & Project Finance Issuers\nSub-Sovereigns\n140+\n50\nSovereigns\nSupranational Institutions\nMIS also generates revenue from certain non-ratings-related operations, which primarily consist of financial instruments pricing services in the Asia-Pacific region, revenue from Second Party Opinions and Net Zero Assessments and revenue from ICRA's non-ratings operations. The revenue from these operations is included in the MIS Other LOB and is not material to the results of the MIS segment.\nMOODY'S\n 2024 10-K     13\nTable of Contents\nSustainability\nMoody's aims to deliver value to all stakeholders, including customers, employees, partners, communities, and stockholders. We consider sustainability in our operations, products, and services. We use our expertise to make a positive impact, helping others understand the link between sustainability and global markets. In 2024, Moody's received multiple awards for its sustainability efforts, including:\n•\nRecognized among America’s 100 Most JUST Companies by JUST Capital and CNBC for its commitment to serving its workforce, customers, communities, the environment, and stockholders for its sustainability-related efforts;\n•\nMade CDP's 2023 Climate Change 'A' List, in recognition of Moody's leadership in corporate transparency and actions taken in response to climate change;\n•\nNamed to the 2023 Dow Jones Sustainability Indices - World and North America, an annual listing of publicly traded companies, recognizing Moody's for its strong corporate sustainability practices; and\n•\nRecognized as a 2023 CDP Supplier Engagement leader for the fourth consecutive year, ranking among the top 4% of companies assessed for supplier engagement on climate change.\nThe Board oversees sustainability matters via the Audit, Governance & Nominating, and Compensation & Human Resources Committees, as part of its oversight of management and the Company’s overall strategy. The Audit Committee oversees financial, risk and other disclosures made in the Company’s annual and quarterly reports related to sustainability. The Governance & Nominating Committee oversees sustainability matters, including significant issues of corporate social and environmental responsibility, as they pertain to the Company’s business and to long-term value creation for the Company and its stockholders, and makes recommendations to the Board regarding these issues. Finally, the Compensation & Human Resources Committee oversees inclusion of sustainability-related performance goals for determining compensation of all senior executives. The Board also oversees Moody’s policies for assessing and managing the Company's exposure to risk, including climate-related risks such as business continuity disruption and reputational or credibility concerns stemming from incorporation of climate-related risks into our credit rating methodologies, or analysis of such risks within our products and services. The Board maintains its collective knowledge of sustainability topics through ongoing education, such as regular presentations from management.\nThree Pillars of Moody's Sustainability Strategy \nOur Actions\nOur Influence\nOur Support\nthe decisions and actions we can take related to impacts under our direct control\nthe actions that we can request from entities providing us with products and services\nthe steps we take to support or enable direct action by other organizations or communities\n14\n     MOODY'S\n 2024 10-K\nTable of Contents\nHUMAN CAPITAL\nOur employees are vital to Moody’s continued success, and we seek to create an environment that attracts, develops and sustains a highly skilled, performance-oriented and engaged workforce. Our approach is oriented around the following pillars: \n–\nproviding market-competitive compensation, benefits and wellness programs as part of our Total Rewards program; \n–\nimplementing a robust talent management, employee engagement and retention strategy; and\n–\nfostering an inclusive environment where all employees have a sense of belonging and are given the opportunity to perform their best.\nTotal Rewards\nMoody's Total Rewards programs are designed to attract and maintain a high-performing, engaged and motivated global workforce. The Company's compensation packages include market-competitive salaries, performance-based annual bonuses, and equity grants aligned to our long-term performance for certain employees.\nThe Company's industry leading benefits programs offer comprehensive resources to support physical, mental and financial well-being. We invest in AI powered technologies in order to provide our employees with a world-class experience accessing and managing their benefits. We continuously evaluate our market benchmarks and employee feedback so that our benefits are competitive and support the attraction of the best talent. For example, in recent years we implemented a global paid parental leave policy to give parents time off to care for and bond with a new child and updated our tuition reimbursement program.\nThe Company also promotes flexible work arrangements, which support the Company's efforts to create a work atmosphere in which people feel valued and inspired to give their best. The Company has implemented a \"PurposeFirst\" framework, which fosters purpose-driven decisions relating to how and where Moody's teams work.\nTalent Management, Employee Engagement and Retention\nMoody’s believes that our long-term success depends on our ability to attract, develop and retain a high-performing workforce. Our goal is to create an environment where colleagues can thrive personally and professionally and can maximize their potential. Our culture is one of continuous learning, which we believe is crucial for colleagues to thrive as part of our organization and to feel a sense of accomplishment and purpose, and our leaders are key in reinforcing this at Moody’s.\nMoody's talent strategy helps us create integrated, cohesive talent activities that support the growth and success of our employees and the business. This strategy informs all of our talent programs, guiding our efforts to attract, develop and retain top talent. It also helps us remain aligned with Moody’s overall business objectives and values while designing programs to meet the evolving needs of our organization.\nMoody’s offers various talent development programs and resources through Moody’s University that are focused on building professional, technical and leadership skills to support employees' goals and objectives. Moody’s also places significant emphasis on our high-potential and high-performance programs, which are designed to identify and nurture emerging leaders within the organization. These programs provide tailored development opportunities, mentorship and the chance to work on strategic projects that drive our business forward.\nMoody's Employee Experience function conducts listening sessions with our employees and creates targeted plans to act on the feedback provided. We measure employee engagement via multiple channels, including the BES for employees to provide anonymous and candid feedback to management. This periodic survey helps Moody's management understand our employees' level of engagement in critical areas, which include, but are not limited to, purpose, leadership, managerial effectiveness, connection, enablement and empowerment and well-being. Managers are accountable for identifying opportunity areas and taking targeted actions based on survey results. The feedback received through the BES is used as a vital input into making decisions to improve employee experience and retention. As we strive to make Moody’s a place people want to come and stay, management also carefully monitors global employee turnover rates.\nInclusion and Belonging\nMoody's believes that a workforce comprised of individuals with varied thoughts, backgrounds and experiences fosters an environment that makes our opinions stronger, our products more innovative, our workplace more welcoming and improves how we relate and respond to our customers. We are committed to cultivating a culture where every individual feels a sense of belonging and has an equal opportunity to succeed.\nOur Inclusion Operating and Governance Model turns our inclusion strategy into reality by providing a functional framework to guide how our People team, councils, sponsors, BRGs and committees work together. The Global Inclusion Council, chaired by our CEO and composed of senior leaders, is charged with oversight of our global inclusion strategy and its progress. The members of the council meet quarterly.\nOur governance model also includes three Regional Inclusion Councils tasked with overseeing the inclusion strategy within their respective regions. Each council meets on a quarterly basis.\nOur operating model includes 11 active BRGs which represent 48 chapters. These groups are open to all Moody's employees, with more than 4,800 employees participating globally as of December 31, 2024.\nMOODY'S\n 2024 10-K     15\nTable of Contents\nWorkforce Overview\nAs of December 31, 2024 and 2023, the number of Moody’s employees was as follows: \nDecember 31,\nChange\n2024\n2023\n(1)\n%\nMA\nU.S.\n2,989\n \n2,992 \n— \n%\nNon-U.S.\n5,156\n \n4,872 \n6 \n%\nTotal\n8,145\n \n7,864 \n4 \n%\nMIS\nU.S. \n1,571\n \n1,490 \n5 \n%\nNon-U.S. \n4,186\n \n3,870 \n8 \n%\nTotal \n5,757\n \n5,360 \n7 \n%\nMSS\nU.S.\n696\n \n749 \n(7)\n%\nNon-U.S.\n1,240\n \n1,187 \n4 \n%\nTotal\n1,936\n \n1,936 \n— \n%\nTotal MCO\nU.S.\n5,256\n \n5,231 \n— \n%\nNon-U.S.\n10,582\n \n9,929 \n7 \n%\nTotal\n15,838\n \n15,160 \n4 \n%\n(1)\n Certain reclassifications have been made to 2023 amounts to reflect certain departmental reorganizations and M&A integrations\n–\nMA’s employee population primarily consists of software engineers, product managers and strategists, data and operations analysts, advisory and implementation teams and economists, as well as sales, business development, and sales support professionals. \n–\nThe MIS employee population primarily consists of credit analysts, data and operations analysts, credit strategy and methodology professionals, software engineers, sales and sales operations, and international strategy teams. \n–\nThe MSS employee population primarily consists of information technology professionals and other professional staff such as finance, human resources, compliance, and legal that support both MA and MIS.\nCLIMATE CHANGE\nClimate change is a major challenge that demands action from all of us. While Moody’s has a limited direct environmental impact, we do have an important role to play in demonstrating proactive corporate responsibility and best practices when it comes to climate change mitigation. As such, the Company is taking steps to reduce emissions across its operations and value chain in accordance with its decarbonization strategy.\nOur decarbonization plan outlines tangible strategies for realizing our climate ambitions, including the procurement of 100% of renewable electricity in the Company’s office spaces and optimizing efficiencies in its operations through its hybrid work program. The costs associated with the implementation of the decarbonization plan are not expected to be material. \nThe acquisition of RMS allowed us to expand our climate data and analysis capabilities. The Company continues to take steps to integrate these capabilities into existing offerings to provide its analysts and researchers with streamlined access to consistent and high-quality climate insights. Additionally, we have launched a Net Zero Assessment framework to provide an independent and comparable evaluation of the strength of an entity’s carbon transition plan.\n16\n     MOODY'S\n 2024 10-K\nTable of Contents\nMOODY’S STRATEGY\nMoody’s is a global integrated risk assessment firm that empowers organizations to anticipate, adapt and thrive in a new era of exponential risk. Our data, analytical solutions and insights help decision-makers identify opportunities and manage the risks of doing business with others.    \nMission\nOur mission is to be the leading source of relevant insights on exponential risk\nGrowth Strategy\nInvest with intent to grow and scale\nInvest with intent\n \nto grow and strengthen our core business\n \nwith a foundation of credibility, transparency, technology, data and analytics\nInvest in \nintegrated solutions\n to allow customers to manage multiple risks, bringing the best of Moody's capabilities\nInvest to successfully \nscale in priority growth markets\n with highly differentiated products and services\nInvestment in high growth markets\nExecution Priorities\nHow we will get it done\nCustomer first\nDevelop our people and culture\nCollaborate, modernize and innovate\nMoody’s invests in initiatives to implement the Company’s strategy, including internally-led organic development and targeted acquisitions. Illustrative examples include:\nEnhancements to ratings quality and product extensions\nExpansion in emerging markets \nNew products, services, content and technology capabilities, including Gen AI, to meet customer demands\nInvestments that extend ownership and participation in joint ventures as well as acquisitions and strategic partnerships that accelerate the ability to scale and grow Moody’s businesses\nIn this era of exponential risk, we know that risks are interconnected, and organizations want a complete view of risk. This includes having a greater breadth and depth of understanding around how risks connect.\nOur integrated approach provides stakeholders with a more comprehensive view of risk, helping them to make better decisions and unlock opportunities. Moody’s brings together multiple data sets and develops risk analysis solutions to assess multiple risk factors (e.g., supply chain failures; cyberattacks; geopolitical tensions; sanctions and security issues; and extreme weather events).\nMOODY'S\n 2024 10-K     17\nTable of Contents\nPROSPECTS FOR GROWTH\nMoody’s believes that the overall long-term outlook remains favorable for continued growth from the offerings of both of our reportable segments.\nMoody’s growth is influenced by a number of trends that impact the market for our products, including:\nEnablement of Gen AI\nHealth of the world’s major economies\nDebt capital markets activity\nDisintermediation of credit markets\nFiscal and monetary policy of governments\nExpansion of market for integrated data and analytics solutions\nBusiness investment spending, including mergers and acquisitions\nIn an environment of increasing financial complexity and exponential risk, Moody’s expects to be well positioned to benefit from continued growth in global fixed-income market activity and more widespread use of credit ratings and integrated risk solutions. Moreover, pricing opportunities aligned with customer value creation and advances in technology present growth opportunities for Moody’s.\nOver the last decade, Moody’s has leveraged the power of AI and ML to better serve our customer base. As an early adopter of Gen AI, Moody's expects to be well positioned to benefit from the capabilities of this technology, which will help our customers make better decisions by unlocking deeper, more integrated perspectives on risk. Through enablement of Gen AI, both internally and through certain strategic partnerships, we are in the process of evolving how we deliver insights on exponential risk to our customers. \nMoody’s operations are subject to various risks, as more fully described in Part I,",
    "item1a": "Item 1A of Part I, “Risk Factors,” under the heading “Technology Risks,” which should be read in conjunction with the foregoing information.",
    "item1b": "ITEM 1B.     UNRESOLVED STAFF COMMENTS\nNone.\nMOODY'S\n 2024 10-K     33\nTable of Contents",
    "item1c": "ITEM 1C.     \nCYBERSECURITY AND RISK MANAGEMENT\nGovernance\nManagement\nThe Company maintains a dedicated internal cybersecurity team that interacts with executive management and its business units to identify, assess, manage, and respond to cybersecurity risks and incidents relating to the Company’s information systems and operations. In addition, this internal cybersecurity team is responsible for managing detection, mitigation and remediation of cybersecurity incidents. The internal cybersecurity team is managed by the CISO, who reports to the CAO, who is a member of the executive leadership team. At December 31, 2024, the Company’s internal cybersecurity team consisted of members located in various countries and time zones across the world. The team has members with experience in governance, risk management and compliance, threat monitoring, threat emulation, penetration testing and cyber incident management. Team members have both individual responsibilities and a team focus, covering areas such as network, endpoint device, and e-mail security engineering as well as operations and threat management, monitoring, and response.\nThe Cyber Committee, chaired by the CISO, and whose members include the CTSO, CAO and Chief Risk & Resiliency Officer, as well as other members of senior management and the legal team, is responsible for identifying cybersecurity risks and threats, recommending mitigating actions to strengthen cybersecurity resilience, and meeting risk tolerance thresholds established by senior management. The Cyber Committee also validates that the Company has appropriate people, process and technology capabilities to identify, mitigate and report on cybersecurity risks to the executive leadership team and the Board of Directors.\n The Cyber Committee meets regularly to allow members of the internal cybersecurity team to present concerns and recommendations for decisions on preventing, identifying, mitigating, and remediating risks and threats. To the extent warranted, the Cyber Committee may additionally be convened on an ad hoc basis. The Cyber Committee makes decisions regarding the reporting of cybersecurity concerns to the executive leadership team, who escalate issues to the Board and/or the Audit Committee as necessary. In the case of incidents that arise, the Cyber Committee, under the direction of the Board and/or executive leadership team when appropriate, works to involve all appropriate personnel with the aim of resolving the incident, performing any required remediation/reporting, and taking appropriate steps to comply with applicable laws and regulations. The process that the Cyber Committee follows upon emergence of incidents is documented in the Company’s Incident Response Plan. Additionally, cybersecurity risks and the adequacy of associated mitigations are analyzed by senior leadership as part of the enterprise risk assessments that are reported to and discussed by the Board.\nThe CISO has extensive cybersecurity knowledge and skills, gained from over 20 years’ experience working in regulated industries. The CISO holds a number of cybersecurity related certifications, including the Certified Information Systems Security Professional and Certified Information Security Manager. In addition to the CISO, the CTSO has been a close partner and advocate for cybersecurity at the Company, and is consulted or informed on all decisions or risks that affect the Company's technology systems and/or implicate cybersecurity\n. \nThe CAO is responsible for overseeing the cybersecurity team at the executive leadership level\n. \nBoard of Directors and Audit Committee\nThe Board provides oversight of management’s efforts to assess and manage cybersecurity risks and respond to cybersecurity incidents and threats. In addition, the Audit Committee of the Board of Directors regularly receives reports from management regarding the Company’s financial and compliance risks, including, but not limited to, risks relating to internal controls and cybersecurity risks.\nThe Board receives regular updates from the CISO, CTSO, and CAO regarding matters related to technology and cybersecurity. The Company has protocols, as discussed below, by which certain cybersecurity concerns, incidents and threats are escalated within the Company and, where appropriate, reported in a timely manner to the Board.\nRisk Management and Strategy\nThe objective of the Company's comprehensive cybersecurity program is to assess, identify, and manage risks from cybersecurity incidents and threats. The Company's cybersecurity program leverages the NIST Framework and it incorporates training and awareness coupled with ongoing monitoring and assessment. \nThe cybersecurity program is an important part of the Company’s enterprise risk management (ERM), with the head of the Company’s ERM program (the Chief Risk & Resiliency Officer) sitting on the Cyber Committee, and sets forth a process for escalating certain incidents to the Company’s ERM group integrated into the Company’s Incident Response Plan\n. \nAs part of the cybersecurity program, the Company’s cybersecurity environment is monitored by automated tools on an ongoing basis and an internal cybersecurity team that reviews threats, alerts, and incidents. The Company’s Incident Response Plan provides governance and guidance in responding to information security incidents and is tested regularly for calibration against existing and emerging threats. The Incident Response Plan describes the process to be followed by the Cyber Committee in connection with the oversight of the cybersecurity environment and specific events that occur from time to time. The cybersecurity program undergoes periodic internal and external reviews. In addition, the Company's Internal Controls Department performs an independent assessment of the design and operating effectiveness of the Company’s network of cybersecurity controls in accordance with the NIST Framework. The results of the assessment are periodically shared with the Cyber Committee.\nThe Company’s cybersecurity environment is also subject to routine vulnerability assessment processes. Internal and external teams, including the Cyber Committee, conduct activities such as penetration testing, red teaming, tabletop exercises and phishing drills. Results are measured and assessed for possible improvements. In addition to these ongoing efforts, the Company has a set \n34\n     MOODY'S\n 2024 10-K\nTable of Contents\nof third-party risk management tools through which it monitors for cybersecurity risks and threats associated with its third-party service providers. The Incident Response Plan includes processes that define how the Company manages and responds to such risks or threats associated with its third-party service providers.\nThe Company contracts with reputable third parties to conduct annual external assessments of its cybersecurity program and its components\n. Government agencies and their contracted agents also conduct periodic reviews in certain jurisdictions where the Company operates. Insurance agents, customers and other market participants routinely assess the Company’s security posture relative to their own standards.\nSecurity Policy and Requirements\nThe Company has an Information Security Policy and Information Security Standards, which, taken together, describe the standards and minimum requirements that are expected of all business and information security personnel to protect the Company’s information and technology assets. The policy provides a framework guided by security principles designed to address the confidentiality, integrity and availability of the Company’s information assets in the context of internal, external, deliberate and accidental threats, while supporting the Company’s information creation and sharing needs.\nThe Company is subject to various privacy laws in the jurisdictions where it operates including CCPA and GDPR, as well as U.S. Federal regulation by the FTC, for certain privacy-related aspects of its business, and the Sarbanes-Oxley Act of 2002. The Company is audited in connection with requirements set forth in the Sarbanes-Oxley Act of 2002, and Moody’s Analytics obtains third-party audits in connection with the ISO 27001 certification and SOC 1 and SOC 2 attestation reports, respectively, for certain products. As previously mentioned, the Company also aligns with NIST standards in connection with information security, which it uses to evaluate its cybersecurity readiness and resilience, and is required to make various filings and comply with requirements in certain jurisdictions in which it operates.\nThe Company’s cybersecurity program also includes an information security training and awareness program called InfoSafe for all employees. The program includes annual certification to having read and understood the Company's IT Use Policy, continuing education on phishing awareness, regular communications about cybersecurity best practices, and participation in annual events like Cybersecurity Awareness Month. Employees are expected to complete annual cybersecurity training, and compliance is monitored. The Company uses general and targeted phishing simulations to help employees better recognize and respond to potential threats. The training program is further enhanced by cybersecurity experts speaking at educational events. The Company also offers specialized training modules on emerging cybersecurity threats for its software development teams. The Company’s IT Use Policy outlines a detailed escalation process under which employees are to immediately report any suspected cybersecurity incident.\nThe cybersecurity threat landscape is dynamic and volatile, and requires significant investment on the part of the Company in terms of talent recruitment and retention, as well as procuring and deploying the correct tools to address threats. Additional information on cybersecurity risks is discussed in"
  }
}