{
  "ticker": "MGM",
  "cik": "0000789570",
  "company_name": "MGM Resorts International",
  "filing_date": "2025-02-18",
  "accession": "0000789570-25-000008",
  "primary_doc": "mgm-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n103\n \nSignatures\n104\n \nPART I \nITEM 1.    BUSINESS\nMGM Resorts International is referred to as the “Company,” “MGM Resorts,” or the “Registrant,” and together with its subsidiaries may also be referred to as “we,” “us” or “our.” MGM China Holdings Limited together with its subsidiaries is referred to as “MGM China.”\nOverview\nMGM Resorts International is a Delaware corporation incorporated in 1986 that acts largely as a holding company and, through subsidiaries, is a global gaming and entertainment company with domestic and international locations featuring best-in-class hotels and casinos, state-of-the-art meeting and conference spaces, incredible live and theatrical entertainment experiences, and an extensive array of restaurant, nightlife and retail offerings, as well as sports betting and online gaming operations. \nWe believe we operate several of the finest casino properties in the world and we continually reinvest in our properties to maintain our competitive advantage. We make significant investments in our properties through newly remodeled hotel rooms, restaurants, entertainment and nightlife offerings, as well as other new features and amenities. We believe we operate the highest quality resorts in each of the markets in which we operate. Ensuring our properties are the premier resorts in their respective markets requires capital investments to maintain the best possible experiences for our guests. We also believe that through our online gaming operations, we can create a scaled global online gaming business.\nAs of December 31, 2024, we operate 16 domestic casino properties and, through our approximate 56% controlling interest in MGM China Holdings Limited (together with its subsidiaries, “MGM China”), which owns MGM Grand Paradise, S.A. (“MGM Grand Paradise”), operate two casino properties in Macau. Additionally, through our 50% ownership interest in Osaka IR KK, an unconsolidated affiliate, we are developing an integrated resort in Osaka, Japan. We also have global online gaming operations primarily through our consolidated subsidiary LV Lion Holding Limited (together with its subsidiaries, “LeoVegas”) and through our 50% ownership interest in BetMGM, LLC (“BetMGM North America Venture”), an unconsolidated affiliate. \nWe lease the real estate assets of our domestic properties pursuant to triple net lease agreements, as further discussed in Note 11. \nIn recent years, in furtherance of our vision to become the world’s premier gaming entertainment company, we have implemented an asset-light business model, which has involved a comprehensive review of our owned real estate assets to find opportunities to monetize those assets efficiently and allow unlocked capital to be redeployed towards balance sheet improvements, new growth opportunities, and to return value to our shareholders. At the same time, we have continued to focus on key growth opportunities that align with our vision, particularly by investing in U.S. online sports betting and iGaming through BetMGM North America Venture, acquiring LeoVegas to expand our global online presence, expanding our digital capabilities, and seeking to diversify our Asia operations with development efforts in Japan.\nAs part of that business strategy, we have sought and executed on opportunities to invest in our growth areas, divest our real estate assets, and acquire, or enter into venture transactions, with respect to online gaming and the operations of integrated casino, hotel, and entertainment properties. For additional information relating to our acquisitions, divestitures, venture transactions, and other arrangements made in furtherance of our business strategy, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations,” as well as the notes to our consolidated financial statements.\nGeneral \nMost of our revenue is cash-based, through customers wagering with cash or paying for non-gaming services with cash or credit cards. We rely on the ability of our operations to generate operating cash flow to fund capital expenditures, provide excess cash flow for future development, acquisitions or investments, and repay debt financings.\nOur results of operations do not tend to be seasonal in nature as our digital operations and all of our casino properties typically operate 24 hours a day, every day of the year, with the exception of Empire City, which operates 20 hours a day, every day of the year. However, a variety of factors may affect the results of any interim period, including the timing of major conventions, Far East baccarat volumes, the timing of entertainment and sports events, the amount and timing of marketing and special events for our high-end gaming customers, and the level of play during major holidays, \n1\nincluding New Year and Lunar New Year. Our primary casino and hotel operations are owned and managed by us. Other amenities may be owned and operated by us, owned by us but managed by third parties for a fee, or leased to third parties. We also lease space to third-party retail and food and beverage operators, particularly for branding opportunities.\nAs of December 31, 2024, we have four reportable segments: Las Vegas Strip Resorts, Regional Operations, MGM China, and MGM Digital, as generally described below. See Note 17 for detailed financial information about our reportable segments.\nLas Vegas Strip Resorts and Regional Operations\nLas Vegas Strip Resorts.\n Las Vegas Strip Resorts consists of the following casino resorts:\n \nAria (including Vdara), Bellagio, The Cosmopolitan of Las Vegas (“The Cosmopolitan”) (upon its acquisition in May 2022), MGM Grand Las Vegas (including The Signature), Mandalay Bay (including W Las Vegas and Four Seasons), The Mirage (until its disposition in December 2022), Luxor, New York-New York (including The Park), Excalibur, and Park MGM (including NoMad Las Vegas).\nRegional Operations.\n Regional Operations consists of the following casino properties: MGM Grand Detroit in Detroit, Michigan; Beau Rivage in Biloxi, Mississippi; Gold Strike Tunica in Tunica, Mississippi (until its disposition in February 2023); Borgata in Atlantic City, New Jersey; MGM National Harbor in Prince George’s County, Maryland; MGM Springfield in Springfield, Massachusetts; Empire City in Yonkers, New York; and MGM Northfield Park in Northfield Park, Ohio.\nOver half of the net revenue from our Las Vegas Strip Resorts is typically derived from non-gaming operations, including hotel, food and beverage, entertainment and other non-gaming amenities and the majority of the net revenue from our Regional Operations is typically derived from gaming operations. Our long-term strategy continues to be to market to different customers and utilize our significant convention and meeting facilities to allow us to maximize hotel occupancy and customer volumes, which also leads to better labor utilization. Our operating results are highly dependent on the volume of customers at our properties, which in turn affects the price we can charge for our hotel rooms and other amenities.\nOur casino operations feature a variety of slots and table games. In addition, we provide our premium players access to high-limit rooms and lounge experiences where players may enjoy an upscale atmosphere. \nMGM China\nWe own approximately 56% of MGM China, which owns MGM Grand Paradise, the Macau company that owns and operates the MGM Macau and MGM Cotai casino resorts and holds the related gaming concession and land concessions. We believe our ownership interest in MGM China plays an important role in extending our reach internationally and will foster future growth and profitability. Although visitation during 2022 was significantly reduced by the novel 2019 coronavirus (“COVID-19”) pandemic, visitation during 2023 and 2024 rebounded, and we expect the long-term future growth of the Asian gaming market to drive additional visitation at MGM Macau and MGM Cotai.\nOur current MGM China operations relate to MGM Macau and MGM Cotai, discussed further below. MGM China’s revenues are generated primarily from gaming operations, which are conducted under a gaming concession held by MGM Grand Paradise, a subsidiary of MGM China. Gaming in Macau is currently administered by the Macau Government through concessions awarded to six different concessionaires. \nMGM Digital\nMGM Digital is our online gaming portfolio which is primarily comprised of LeoVegas, which is headquartered in Sweden and Malta and operates internationally, primarily in Europe, as well as our other consolidated subsidiaries that offer interactive gaming. Revenues are derived from its online gaming product offerings, which include iGaming, digital slots and table games, as well as live dealer and online sports betting.\nCorporate and Other \nWe have additional business activities including our investments in unconsolidated affiliates and certain other corporate and management operations. Our investments in unconsolidated affiliates are primarily comprised of our ventures, such as BetMGM North America Venture and Osaka IR KK.\n2\nCustomers and Competition \nWe operate in highly competitive environments. We compete against gaming companies, as well as other hospitality companies in the markets in which we operate, neighboring markets, and in other parts of the world, including non-gaming resort destinations such as Hawaii. Our gaming operations compete to a lesser extent with state-sponsored lotteries, off-track wagering, card parlors, and other forms of legalized gaming in the United States and internationally. For further discussion of the potential impact of competitive conditions on our business, see “",
    "item1a": "Item 1A. Risk Factors - The failure to maintain the integrity of our information and other systems or customer information can result in damage to our reputation, subject us to fines, payment of damages, lawsuits and restrictions on our use of data, and have a material adverse effect on our business, financial condition, and results of operations.” Additional risks and uncertainties not currently known or that may currently be deemed to be immaterial also may materially adversely affect the Company’s business, financial condition, or results of operations.\nThe Board’s Oversight of Cybersecurity Risk\nTo ensure thorough oversight of the Company’s cybersecurity policies and processes, the \nAudit Committee\n is responsible for overseeing our cybersecurity risk and, pursuant to its charter, establishes and oversees procedures for the Company’s plans to mitigate cybersecurity risks and respond to data breaches. The Audit Committee receives regular reports from the CISO on the Company’s cybersecurity risks and enterprise cybersecurity program. The Audit Committee also receives prompt information and periodic updates by the CISO regarding material cybersecurity incidents that meet reporting thresholds. The Audit Committee reports out to the \nBoard\n as necessary to keep the Board informed of issues or risks relating to the Company’s cybersecurity.\nManagement’s Involvement in Cybersecurity Risk Oversight\nOur CISO continues to enhance our cybersecurity program and leads our efforts to mitigate technology risks in partnership with business leaders. Our CISO conducts regular reviews of the control environment and identifies those risks within the Enterprise Risk Management process to assess, monitor and control current and future potential risks facing the Company. \nOur CISO has over 20 years of expertise in technology, cybersecurity, information security risk management, incident management and response and privacy and has held various roles in information security throughout his career. The CISO holds various professional certifications, including Certified Information Security Manager certification from the \n30\nInformation Systems Audit and Control Association and Certified Incident Handler from the International Council of E-Commerce Consultants. The CISO holds a Bachelor of Science Degree in Cyber Security & Information Assurance.\n \nOur CISO reports directly to our Chief Legal and Administrative Officer and Secretary. The CISO closely monitors our cybersecurity program, including our strategy and cybersecurity policies and practices, against the cybersecurity threat landscape. As described above, our cybersecurity incident response plan provides a framework for a multidisciplinary team to prevent, detect, mitigate, and remediate cybersecurity-related risks and incidents. This framework also sets forth parameters for the escalation and reporting of cybersecurity risks and incidents to broader groups at the Company, and the CISO reports information about significant cybersecurity risks and incidents to the Audit Committee on a regular basis and more frequently if warranted under the circumstances.\n31",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS \nNone. \n29",
    "item1c": "ITEM 1C.    CYBERSECURITY \nWe recognize the importance cybersecurity has to the success of our business. We also recognize the need to continually assess cybersecurity risk and evolve our response in the face of a rapidly and ever-changing environment. Accordingly, we aim to protect our business operations, including customer records and information, against known and evolving cybersecurity threats. \nRisk Management and Strategy\nThe Company’s Internal Audit function conducts an annual Enterprise Risk Management process to identify, assess, monitor and control current and future potential risks facing the Company, which includes cybersecurity risks that are communicated by the Chief Information Security Officer (“CISO”). Significant risks identified during this process are then presented to the Audit Committee. In addition, we have a cybersecurity incident response plan in place that provides a documented framework for handling high and low severity security incidents and facilitates coordination across multiple parts of the business. We also routinely perform attack and response simulations at the technical level, and annually execute tabletop response exercises. Each year, special focus is given to maintaining and improving our alignment with the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework and Privacy and Payment Card Industry (“PCI”) controls in support of protecting our technology and customer data. We further engage in the periodic assessment and testing of our cybersecurity program.\nWe also utilize external expertise to perform annual assessments of our entire cybersecurity program, including the cybersecurity program maturity. The results of these annual assessments are reported to the Audit Committee, and we adjust our cybersecurity policies, standards, processes and practices as necessary based on the information provided by these assessments. In addition, we have a \nThird Party Risk Management Program\n designed to assess risks associated with third party providers based on the services they provide and the data they have access to.\nCybersecurity risk mitigation processes are integrated into the Company’s Code of Conduct that all employees are required to review. Additionally, all employees with network access receive cybersecurity awareness training.\n \nThe Company’s information and data systems have been subject to cybersecurity incidents in the past, including the publicly disclosed September 2023 Cybersecurity Issue. \nWe do not believe that risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect the Company, including our business strategy, results of operations, or financial condition.\n However, there is no guaranty that the Cybersecurity Issue and any further incidents will not have a material impact in the future. See “Cybersecurity litigation, claims, and investigations” in Part II, Item 8, Note 12 to the accompanying consolidated financial statements. Further, policies and procedures designed to manage cyber risks, including those described herein, may not be effective. To learn more about risks from cybersecurity threats, see “"
  }
}