{
  "ticker": "MKC",
  "cik": "0000063754",
  "company_name": "MCCORMICK & CO INC",
  "filing_date": "2025-01-23",
  "accession": "0000063754-25-000005",
  "primary_doc": "mkc-20241130.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nMcCormick is a global leader in flavor. We manufacture, market, and distribute spices, seasoning mixes, condiments, and other flavorful products to the entire food industry: retailers, food manufacturers, and foodservice businesses. We also are partners in a number of joint ventures that are involved in the manufacture and sale of flavorful products, the most significant of which is McCormick de Mexico. Our major sales, distribution, and production facilities are located in North America, Europe, and China. Additional facilities are based in Australia, Central America, Thailand, and South Africa.\nBusiness Segments \nWe operate in two business segments: consumer and flavor solutions. Demand for flavor is growing globally, and across both segments, we have the customer base and product breadth to participate in all types of eating occasions. Our products deliver flavor when cooking at home, dining out, purchasing a quick service meal, or enjoying a snack. We offer our customers and consumers a range of products, extending from premium to value-priced, to meet the increasing demand for certain product attributes such as clean-label, organic, natural, reduced sodium, gluten-free, and non-GMO (genetically modified organisms). \nConsistent with market conditions in each segment, our consumer segment has a higher overall profit margin than our flavor solutions segment. In 2024, the consumer segment contributed approximately 57% of consolidated net sales and 69% of consolidated operating income, and the flavor solutions segment contributed approximately 43% of consolidated net sales and 31% of consolidated operating income.\nConsumer Segment.\n \nFrom locations around the world, our brands reach consumers in approximately 150 countries and territories. Our leading brands in the Americas include McCormick\n®\n, French’s\n®\n, Frank’s RedHot\n®\n, Lawry’s\n®\n, Cholula Hot Sauce\n®\n, and Club House\n®\n, as well as brands such as Gourmet Garden\n® \nand OLD BAY\n®\n. We also market authentic regional and ethnic brands such as Zatarain’s\n®\n, Stubb's\n®\n, Thai Kitchen\n®\n, \nand Simply Asia\n®\n. In the Europe, Middle East, and Africa (EMEA) region, our major brands include the Ducros\n®\n, Schwartz\n®\n, \nKamis\n®\n, and La Drogheria\n®\n brands of spices, herbs, and seasonings and an extensive line of Vahiné\n®\n brand dessert items. In the Asia/Pacific (APAC) region, we market our spices and seasonings under the McCormick brand, DaQiao\n®\n, as well as other brands, our dessert products under the Aeroplane\n®\n brand, and packaged chilled herbs under the Gourmet Garden\n®\n brand.\nApproximately two-thirds of our consumer segment sales are spices and seasonings and condiments and sauces.\n \nWithin the spices and seasoning category, we are the brand leader globally and a category leader in our key markets. In the condiments and sauces category, we are one of the brand leaders globally and in the U.S. There are numerous competitive brands of spices and seasonings and condiments and sauces in the U.S., as well as additional brands in international markets. Some are owned by large food manufacturers, while others are supplied by small privately-owned companies. In this competitive environment, we are leading with innovation and brand marketing, applying our analytical tools to help customers optimize the profitability of their sales of these categories, while simultaneously working to increase our own sales and profit.\nOur customers span a variety of retailers that include grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers, served directly and indirectly through distributors or wholesalers. In addition to marketing our branded products to these customers, we are a leading supplier of private label items, also known as store brands. In our businesses in China, foodservice sales are managed by and reported in our consumer segment.\nFlavor Solutions Segment.\n \nIn our flavor solutions segment, we provide a wide range of products to multinational food manufacturers and foodservice customers. The foodservice customers are supplied with branded, packaged products both directly by us and indirectly through distributors, with the exception of our businesses in China, where foodservice sales are managed by and reported in our consumer segment. We supply food manufacturers and foodservice customers with customized flavor solutions, and many of these customer relationships have been active for decades. Our range of flavor solutions remains one of the broadest in the industry and includes seasoning blends, spices and herbs, condiments, coating systems, and compound flavors. In addition to a broad range of flavor solutions, our long-standing customer relationships are evidence of our effectiveness in building customer \n2\nintimacy. Our customers benefit from our expertise in many areas, including sensory testing, culinary research, food safety, and flavor application.\nOur flavor solutions segment has a number of competitors. Some tend to specialize in a particular range of products and have a limited geographic reach. Other competitors include large publicly held flavor companies that are more global in nature and tend to focus on providing integrated solutions extending beyond flavor through the use of other functional and nutritional ingredients.\nRaw Materials\nThe most significant raw materials used in our business are dairy products, pepper, onion, garlic, capsicums (red peppers and paprika), tomato products, sugar and salts. Pepper and other spices and herbs are generally sourced from countries other than the U.S. Other raw materials, like dairy products and onion, are primarily sourced locally, either within the U.S. or from our international locations. Because these raw materials are agricultural products, they are subject to fluctuations in market price and availability caused by weather, growing and harvesting conditions, market conditions, including inflationary cost increases, and other factors beyond our control. \nWe respond to this volatility in a number of ways, including strategic raw material purchases, purchases of raw material for future delivery, customer price adjustments, and cost savings from our Comprehensive Continuous Improvement (CCI) program. There has been, and there could continue to be, a difference between the timing of when these customer price adjustments and cost savings impact our results of operations and when the impact of cost inflation occurs. Additionally, in some instances, the pricing actions we take have been impacted by price elasticity which unfavorably impacts our sales volume and mix.\nIn addition, we rely on third-party transportation providers to deliver raw materials and our products to our customers. There has been, and could continue to be, reduced availability of transportation capacity due to labor shortages and higher fuel costs, which have caused and may continue to cause an increase in transportation costs for us and our suppliers.\nCustomers\nOur products are sold directly to customers as well as through brokers, wholesalers, and distributors. In the consumer segment, products are then sold to consumers under a number of brands through a variety of retail channels, including grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce. In the flavor solutions segment, products are used by food and beverage manufacturers as ingredients in their finished goods and by foodservice customers for menu items, as well as provided to their own customers for dine-in and take-out occasions, all to enhance the flavor of their foods. Customers in the flavor solutions segment include food manufacturers and the foodservice industry, supplied through a variety of channels, including directly and indirectly through distributors, wholesale foodservice suppliers, and e-commerce.\nWe have a large number of customers for our products. Sales to one of our consumer segment customers, Wal-Mart Stores, Inc., accounted for consolidated sales of approximately 12% in 2024, 2023 and 2022. Sales to one of our flavor solutions segment customers, PepsiCo, Inc., accounted for consolidated sales of approximately 13% in 2024, 13% in 2023, and 11% in 2022. In 2024, 2023, and 2022, the top three customers in our flavor solutions segment represented between 47% and 49% of our global flavor solutions sales. \nTrademarks, Licenses and Patents\nWe own a number of trademark registrations. Although in the aggregate these trademarks are material to our business, the loss of any one of those trademarks, with the exception of our “McCormick,” “French’s,” “Frank’s RedHot,” “Lawry’s,” “Zatarain’s,” “Cholula,” “Stubb's,” “Club House,” “Ducros,” “Schwartz,” “Vahiné,” \"OLD BAY,\" \"Simply Asia,\" \"Thai Kitchen,\" “Kamis,” “La Drogheria,” \"DaQiao,\" and \"Gourmet Garden\" trademarks, would not have a material adverse effect on our business. The “Mc – McCormick” trademark is extensively used in connection with the sale of our food products in the U.S. and certain non-U.S. markets. The terms of the trademark registrations are prescribed by law, and the registrations will be renewed as long as we deem them useful.\nWe have entered into a number of license agreements authorizing the use of our trademarks by affiliated and non-affiliated entities. The loss of these license agreements would not have a material adverse effect on our business. The term of the license agreements is generally two-to-three years or until such time as either party terminates the agreement. Those agreements with specific terms may be renewable upon agreement of the parties.\nWe also own various patents, none of which are individually material to our business.\n3\nSeasonality\nDue to seasonal factors inherent in the business, our sales, operating income, and cash from operations are generally higher in the fourth quarter because of the holiday season. This seasonality reflects customer and consumer buying patterns, primarily in the consumer segment.\nWorking Capital\nIn order to meet increased demand for our consumer products during our fourth quarter, we usually build our inventories during the third quarter of the fiscal year. We generally finance working capital items (inventory and receivables) through short-term borrowings, which include the use of lines of credit and the issuance of commercial paper. For a description of our liquidity and capital resources, see Note 5 of the notes to our consolidated financial statements and the “Liquidity and Financial Condition” section of “Management’s Discussion and Analysis.”\nCompetition\nEach segment operates in highly competitive markets around the world. In this environment, our growth strategies include customer engagement and product innovation based on consumer insights. In the consumer segment, we are building brand recognition and loyalty through advertising and promotions. In our flavor solutions segment, we differentiate ourselves through culinary and consumer-inspired flavor development, as well as the breadth of our product offering and customer engagement.\nGovernmental Regulation\nWe are subject to numerous laws and regulations around the world that apply to our global businesses. In the U.S., the safety, production, transportation, distribution, advertising, labeling, and sale of many of our products and their ingredients are subject to the Federal Food, Drug, and Cosmetic Act; the Food Safety Modernization Act; the Federal Trade Commission Act; state consumer protection laws; competition laws; anti-corruption laws; customs and trade laws; federal, state and local workplace health and safety laws; privacy laws; federal, state, and local environmental protection laws; and other federal, state, and local statutes and regulations. Outside the U.S., our business is subject to numerous similar statutes, laws, and regulatory requirements.\nHuman Capital\nWe believe in the power of people—fostering a culture for our employees that embodies respect and collaboration across the organization. Our high-performance culture is rooted in shared values and respect for all contributions of every employee. Our key human capital objectives are to attract, retain, and develop the highest quality talent. We employ various human resource programs in support of these objectives. We believe diversity, equity, and inclusion are at the core of our values and strategic business priorities. Throughout our business, we champion equality, supporting parity for women and under-represented groups, as we work to create ethical, safe, and supportive workplaces where our employees thrive. We believe a diverse and inclusive workplace results in business growth and encourages increased innovation, retention of talent, and a more engaged workforce. We have various employee ambassador groups that provide a supportive and collaborative space for employees to come together and promote inclusion. We prioritize the mental health and wellness of our employees by offering and encouraging participation in various programs and initiatives. Respect for human rights is fundamental to our business and its commitment to ethical conduct.\nWe had approximately 14,100 full-time employees worldwide as of November 30, 2024. Our operations have not been affected significantly by work stoppages, and, in the opinion of management, employee relations are good. We have approximately 400 employees in the U.S. who are covered by a collective bargaining contract. At our subsidiaries outside the U.S., approximately 2,500 employees are covered by collective bargaining agreements or similar arrangements. \nThrough our continuous listening strategy, we measure employee engagement on an ongoing basis to solicit feedback and understand the views of our employees, work environment, and culture. The results from these surveys are used to implement programs and processes designed to enhance employee engagement and improve the overall employee experience.\nWe are committed to the safety, health, and security of our employees. We believe a hazard-free environment is a critical enabler for the success of our business. Throughout our operations, we strive to ensure that all of our employees have access to safe workplaces that allow them to succeed in their jobs.\nInformation about our Executive Officers\nIn addition to the executive officers indicated in the 2025 Proxy Statement incorporated by reference in Part III, Item 10 of this Report, the other executive officers of McCormick are Marcos M. Gabriel, Katherine A. Jenkins, and Ana G. Sanchez.\n4\nMr. Gabriel is 53 years old and, during the last five years has held the following positions within McCormick:  December 2024 to present - Executive Vice President and Chief Financial Officer; March 2024 to November 2024 - Senior Vice President Global Finance and Capital Markets; June 2023 to February 2024 - Senior Vice President, Finance and Global Business Services; August 2022 to May 2023 - Chief Transformation Officer; and August 2017 to July 2020 - Chief Financial Officer Americas. \nMs. Jenkins is 56 years old and, during the last five years, has held the following positions with McCormick: June 2023 to present - Chief Growth Officer; June 2022 to May 2023 – Chief Strategy Officer & Senior Vice President, Investor Relations; and January 2017 to June 2022, Vice President, Investor Relations.\nMs. Sanchez is 49 years old and, during the last five years, has held the following positions with McCormick:  February 2022 to present - President, EMEA; February 2020 to January 2022 – Vice President Consumer, EMEA, and November 2018 to January 2020 – Vice President Marketing, EMEA. \nOperations Outside of the U.S.\nWe are subject in varying degrees to certain risks typically associated with a global business, such as local economic and market conditions, exchange rate fluctuations, and restrictions on investments, royalties, and dividends. In fiscal year 2024, approximately 39% of sales were from non-U.S. operations. For information on how we manage some of these risks, see the “Market Risk Sensitivity” section of “Management’s Discussion and Analysis.”\nForward-Looking Information\nCertain statements contained in this report, including statements concerning expected performance such as those relating to net sales, gross margin, earnings, cost savings, special charges, acquisitions, brand marketing support, volume and product mix, income tax expense, and the impact of foreign currency rates are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. These statements may be identified by the use of words such as “may,” “will,” “expect,” \"should,\" \"anticipate,\" \"intend,\" “believe,” “plan,” and similar expressions. These statements may relate to: general economic and industry conditions, including consumer spending rates, recessions, interest rates, and availability of capital; expectations regarding sales growth potential in various geographies and markets, including the impact of brand marketing support, product innovation, and customer, channel, category, heat platform, and e-commerce expansion; expected trends in net sales, earnings performance, and other financial measures; the expected impact of pricing actions on the Company's results of operations, including our sales volume and mix as well as gross margins;  the expected impact of the inflationary cost environment on our business; the anticipated effects of factors affecting our supply chain, including the availability and prices of commodities and other supply chain resources such as raw materials, packaging, labor, and transportation; the expected impact of productivity improvements, including those associated with our CCI program and the Global Business Services operating model initiative; the ability to identify, attract, hire, retain, and develop qualified personnel and the next generation of leaders; the impact of ongoing conflicts, including those between Russia and Ukraine and the war in the Middle East, particularly regarding the potential for broader economic disruption; expected working capital improvements; the anticipated timing and costs of implementing our business transformation initiative, which includes the implementation of a global enterprise resource planning (ERP) system; the expected impact of accounting pronouncements; expectations regarding pension and postretirement plan contributions and anticipated charges associated with those plans; the holding period and market risks associated with financial instruments; the impact of foreign exchange fluctuations; the adequacy of internally generated funds and existing sources of liquidity, such as the availability of bank financing; the anticipated sufficiency of future cash flows to enable payments of interest, repayment of short- and long-term debt, working capital needs, planned capital expenditures, quarterly dividends, and our ability to obtain additional short- and long-term financing or issue additional debt securities; and expectations regarding purchasing shares of McCormick's common stock under the existing repurchase authorization.\nThese and other forward-looking statements are based on management’s current views and assumptions and involve risks and uncertainties that could significantly affect expected results. Results may be materially affected by factors such as: the Company's ability to drive revenue growth; the Company's ability to increase pricing to offset, or partially offset, inflationary pressures on the cost of our products; damage to the Company's reputation or brand name; loss of brand relevance; increased private label use; the Company's ability to drive productivity improvements, including those related to our CCI program and other streamlining actions; product quality, labeling, or safety concerns; negative publicity about our products; actions by, and the financial condition of, competitors and customers; the longevity of mutually beneficial relationships with our large customers; the ability to identify, interpret and react to changes in consumer preference and demand; business interruptions due to natural disasters, unexpected events or public health crises; issues affecting the Company's supply chain and procurement of raw \n5\nmaterials, including fluctuations in the cost and availability of raw and packaging materials; labor shortage, turnover and labor cost increases; the impact of the ongoing conflicts between Russia and Ukraine and the war in the Middle East, including the potential for broader economic disruption; government regulation, and changes in legal and regulatory requirements and enforcement practices; the lack of successful acquisition and integration of new businesses; global economic and financial conditions generally, availability of financing, interest and inflation rates, and the imposition of tariffs, quotas, trade barriers and other similar restrictions; foreign currency fluctuations; the effects of our amount of outstanding indebtedness and related level of debt service as well as the effects that such debt service may have on the Company's ability to borrow or the cost of any such additional borrowing, our credit rating, and our ability to react to certain economic and industry conditions; impairments of indefinite-lived intangible assets; assumptions we have made regarding the investment return on retirement plan assets, and the costs associated with pension obligations; the stability of credit and capital markets; risks associated with the Company's information technology systems, including the threat of data breaches and cyber-attacks; the Company's inability to successfully implement our business transformation initiative; fundamental changes in tax laws; including interpretations and assumptions we have made, and guidance that may be issued, and volatility in our effective tax rate; climate change; Environmental, Social and Governance (ESG) matters; infringement of intellectual property rights, and those of customers; litigation, legal and administrative proceedings; the Company's inability to achieve expected and/or needed cost savings or margin improvements; negative employee relations; and other risks described herein under Part I,",
    "item1a": "Item 1A, Risk Factors, which should be read in conjunction with the foregoing information.\nGovernance and Oversight\nOur Board and the Audit Committee are actively engaged in the oversight of our cybersecurity and data privacy program. The Board, at least annually, and the Audit Committee, periodically throughout the year, receive regular reports from our Chief Information Security Officer (“CISO”) and members of the information security team on, among other things, recent developments, the state of the information security program, assessments of risks and threats to our information security systems, \ninformation security considerations arising with respect to our peers and third parties, \nthird-party and independent reviews, and processes to maintain and strengthen information security systems. Under the oversight of the Audit Committee, we engage third-party experts to assess the state of our cybersecurity and data privacy program. The Audit Committee also provides regular updates to the Board, and the Board would be notified between such updates regarding significant new cybersecurity threats or incidents.\nWe have protocols by which certain cybersecurity incidents that meet established reporting thresholds are escalated internally and, where appropriate, reported to the Management Committee, the Audit Committee or the Board in a timely manner.\nWe have an Executive Cybersecurity Steering Committee that is facilitated by our CISO, which is designed to engage business leadership and employ best practices, including ongoing enhancements to governance, risk and compliance. Our internal audit function also performs independent testing on aspects of the operations of our cybersecurity program and the supporting controls based upon its risk-based internal audit plan and reports the results of these audits in its periodic reports to the Audit Committee. Our CISO currently reports to our Chief Information and Digital Officer and is responsible for training and leading a dedicated information security team tasked with protecting data and preventing, identifying, and appropriately addressing cybersecurity threats. The CISO is a Certified Information Systems Security Professional with over 20 years of experience developing and maturing information security programs, including experience with leading privacy, enterprise risk, records management, business continuity and operational risk programs, among others.\n19",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nCybersecurity risk management is overseen both as a critical component of our overall Enterprise Risk Management program and as a standalone program. We have implemented a risk-based, multilayered approach to assessing, identifying, and managing cybersecurity threats and incidents, while also implementing controls and procedures that provide for the prompt escalation of certain cybersecurity incidents.\nThe team devotes significant resources to our cybersecurity risk management, which focuses on developing and implementing strategies and processes to protect the confidentiality, integrity, and availability of our assets and those of our consumers, customers and employees and seeks to continually improve our policies and practices to protect our platforms, adapt to changes in regulations, identify potential and emerging security risks and develop mitigation strategies for those risks. As part of this effort, the team periodically benchmarks our practices against the NIST Cyber Security and Privacy Frameworks, and other good practice control methods, which include updating technology, developing data privacy and security policies and procedures, implementing and assessing the effectiveness of controls, monitoring and routine testing of our information systems, conducting risk assessments of third-party service providers, providing data privacy and cybersecurity awareness training to employees and designing business processes to protect private data and mitigate the risk of cybersecurity incidents. We periodically conduct tests on our systems to help discover potential vulnerabilities, which enable improved decision-making and prioritization and promote monitoring and reporting across compliance functions. We believe that these \n18\nactions provide adequate measures of protection against security breaches and generally reduce our cybersecurity risks, and we have not had a material cybersecurity threat or attack to date.\nOur processes also address cybersecurity risks associated with our use of third-party service providers including suppliers, and software and cloud-based service providers. We proactively evaluate the cybersecurity risk of our third-party service providers by utilizing a repository of risk assessments, external monitoring sources, threat intelligence and predictive analytics to better inform ourselves during contracting and vendor selection processes. Third-party service providers security issues are documented, tracked, and monitored in order to mitigate risk.\nOur employees, including part-time and temporary employees, undertake an annual cybersecurity training program, which is augmented by additional training and communications on information security and data privacy matters throughout the year. \nWe have adopted an incident response plan that applies in the event of a cybersecurity threat or incident to provide a standardized framework for responding to such cybersecurity threats or incidents. The plan sets out a coordinated approach to investigating, containing, documenting, and mitigating incidents, including reporting findings and keeping our Management Committee, the Audit Committee, the Board, and other key stakeholders informed and involved as appropriate. The plan is aligned to NIST guidance. It also includes the involvement of any personnel who may detect incidents, respond to incidents, resolve incidents, and manage communications and responsibilities with authorities about those incidents. The plan applies to all personnel (including third-party contractors, vendors, and partners) that perform functions or services requiring access to secure Company information, and to all devices and network services that are owned or managed by us.\nFurther, we currently maintain a cybersecurity insurance that provides coverage for certain types of incidents; however, such insurance may not be sufficient in type or amount to cover claims related to all cyber threats or risks.\nWhile we have not experienced any material cybersecurity threats or incidents that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition, as of the date of this Annual Report on Form 10-K, there can be no guarantee that we will not be the subject of future threats or incidents. Additional information on cybersecurity risks we face can be found in"
  }
}