{
  "ticker": "MLM",
  "cik": "0000916076",
  "company_name": "MARTIN MARIETTA MATERIALS INC",
  "filing_date": "2025-02-21",
  "accession": "0000950170-25-024770",
  "primary_doc": "mlm-20241231.htm",
  "item_sections": {
    "item1": "Item 1, Business – Competition\n,",
    "item1a": "Item 1A, Risk Factors\n, and \nNote A: Accounting Policies\n and \nNote N: Commitments and Contingencies\n of the \nNotes to Financial Statements\n of the audited consolidated financial statements included in this Form 10-K.\n \n\n\nYou should consider these forward-looking statements in light of risk factors discussed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 and other filings made with the SEC. All of the Company’s forward-looking statements should be considered in light of these factors. In addition, other risks and uncertainties not presently known to the Company or that the Company considers immaterial could affect the accuracy of its forward-looking statements, or adversely affect or be material to the Company. All forward-looking statements are made as of the date of filing or publication and we assume no obligation to update any such forward-looking statements.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n61\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7A – Quantitative and Qualitative Disclosures About Market Risk\n\n\nITEM 7A – QUANTITATIVE AND QUALITAT\nIVE DISCLOSURES ABOUT MARKET RISK\n \n\n\nAs discussed earlier, the Company’s operations are highly dependent upon the interest rate-sensitive construction and steelmaking industries. Consequently, these marketplaces could experience lower levels of economic activity in an environment of rising interest rates or escalating costs (see \nBusiness Environment\n section included under Item 7 – MD&A of this Form 10-K).\n \n\n\nManagement has considered the current economic environment and its potential impact to the Company’s business. Demand for aggregates products, particularly in the infrastructure construction market, is affected by federal, state and local budget and deficit issues. Further, delays or cancellations of capital projects in the nonresidential and residential construction markets could occur if companies and consumers are unable to obtain affordable financing for construction projects or if consumer confidence is eroded by economic uncertainty.\n\n\nDemand in the nonresidential and residential construction markets, which combined accounted for 58% of the Company's 2024 aggregates shipments, is affected by interest rates. While the Federal Reserve lowered the target federal funds rate several times during 2024, it remains above historical levels.\n\n\nAside from these inherent risks from within its operations, the Company’s earnings are also affected by changes in short-term interest rates and changes in enacted tax laws.\n \n\n\nVariable-Rate Borrowing Facilities\n\n\nAt December 31, 2024, the Company had an $800 million Revolving Facility and a $400 million Trade Receivable Facility.  Borrowings under these facilities bear interest at a variable interest rate. As of December 31, 2024, the Company did not have any outstanding variable-rate borrowings. However, any future borrowings under the credit facilities or outstanding variable-rate debt are exposed to interest rate risk.\n \n\n\nPension Expense\n\n\nThe Company’s results of operations are affected by its pension expense. Assumptions that affect pension expense include the discount rate and, for the qualified defined benefit pension plan only, the expected long-term rate of return on pension assets. Therefore, the Company has interest rate risk associated with these factors. The impact of hypothetical changes in these assumptions on the Company’s annual pension expense and accrued pension obligation is discussed in the \nCritical Accounting Policies and Estimates – Pension Benefit Obligation and Pension Expense – Selection of Assumptions\n section included under Item 7 – MD&A of this Form 10-K.\n\n\nIncome Tax\n\n\nAny changes in enacted tax laws, rules or regulatory or judicial interpretation, or any change in the pronouncements relating to accounting for income taxes, could materially impact the Company's effective tax rate, tax payments, cash flow, financial condition and results of operations.\n\n\nEnergy Costs\n \n\n\nEnergy costs, including diesel fuel, natural gas, electricity, coal and petroleum coke, represent significant production costs of the Company. The cement product line and Magnesia Specialties business each have varying fixed-price agreements for a portion of their future energy requirements. The Company may be unable to pass along increases in the costs of energy to customers in the form of price increases for the Company’s products. A hypothetical 10% change in the Company’s energy prices in 2025 as compared with 2024, assuming constant volumes, would change 2025 energy expense by $32 million.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n62\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nITEM 8 – FINANCIAL STATEMEN\nTS AND SUPPLEMENTARY DATA\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIndex to Consolidated Financial Statements\n\n\n \n\n\nPage\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nStatement of Responsibility and Management’s Report on\nInternal Control over Financial Reporting\n\n\n63\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nReport of Independent Registered Public Accounting Firm\n\n\n65\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Statements of Earnings –\nfor years ended December 31, 2024, 2023 and 2022\n\n\n67\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Statements of Comprehensive Earnings –\nfor years ended December 31, 2024, 2023 and 2022\n\n\n68\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Balance Sheets –\nat December 31, 2024 and 2023\n\n\n69\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Statements of Cash Flows –\nfor years ended December 31, 2024, 2023 and 2022\n\n\n70\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nConsolidated Statements of Total Equity –\nfor years ended December 31, 2024, 2023 and 2022\n\n\n71\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nNotes to Financial Statements\n\n\n72\n\n\n\n\n\n\nStatement of Responsibility and Management’s\n Report on Internal Control over Financial Reporting\n \n\n\nManagement’s Statement of Responsibility\n\n\nThe management of Martin Marietta Materials, Inc. (the Company or Martin Marietta) is responsible for the consolidated financial statements, the related financial information contained in this Form 10-K and the establishment and maintenance of adequate internal control over financial reporting. The consolidated balance sheets for Martin Marietta, at December 31, 2024 and 2023, and the related consolidated statements of earnings, comprehensive earnings, total equity and cash flows for each of the three years in the period ended December 31, 2024, include amounts based on estimates and judgments and have been prepared in accordance with accounting principles generally accepted in the United States applied on a consistent basis.\n \n\n\nA system of internal control over financial reporting is designed to provide reasonable assurance, in a cost-effective manner, that assets are safeguarded, transactions are executed and recorded in accordance with management’s authorization, accountability for assets is maintained and financial statements are prepared and presented fairly in accordance with accounting principles generally accepted in the United States. Internal control systems over financial reporting have inherent limitations and may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\n \n\n\nThe Company operates in an environment that establishes an appropriate system of internal control over financial reporting and ensures that the system is maintained, assessed and monitored on a periodic basis. This internal control system includes examinations by internal audit staff and oversight by the Audit Committee of the Board of Directors.\n \n\n\nThe Company’s management recognizes its responsibility to foster a strong ethical climate. Management has issued written policy statements that document the Company’s business code of ethics. The importance of ethical behavior is regularly communicated to all employees through the distribution of the \nCode of Ethical Business Conduct\n and through ongoing education and review programs designed to create a strong commitment to ethical business practices.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n63\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe Audit Committee of the Board of Directors, which consists of four independent, nonemployee directors, meets periodically and separately with management, the independent auditors and the internal auditors to review the activities of each. The Audit Committee meets standards established by the Securities and Exchange Commission (SEC) and the New York Stock Exchange as they relate to the composition and practices of audit committees.\n\n\nManagement’s Report on Internal Control over Financial Reporting\n \n\n\nThe management of Martin Marietta is responsible for establishing and maintaining adequate internal control over financial reporting. Management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In making this assessment, management used the criteria set forth in \nInternal Control—Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on management’s assessment under the 2013 framework, management concluded that the Company’s internal control over financial reporting was effective as of December 31, 2024.\n \n\n\nThe consolidated financial statements of the Company as of December 31, 2024 and 2023, and for each of the three years in the period ended December 31, 2024, and the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, have been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, whose report appears on the following pages.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC. Howard Nye,\n \nChair, President and Chief Executive Officer\n\n\nJames A. J. Nickolas\n,\n \nExecutive Vice President and Chief Financial Officer\n\n\n\n\n\n\n \n\n\nFebruary 21, 2025\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n64\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nReport of Independent Registe\nred Public Accounting Firm\n \n\n\nTo the Board of Directors and Shareholders of Martin Marietta Materials, Inc.\n \n\n\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Martin Marietta Materials, Inc. and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of earnings, of comprehensive earnings, of total equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended December 31, 2024 appearing under Item 15(a)(2) (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\n\n\nBasis for Opinions\n\n\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n\n\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\n\n\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n\n\nDefinition and Limitations of Internal Control over Financial Reporting\n\n\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n65\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\ncompany; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\n\nCritical Audit Matters\n \n\n\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n\n\nAcquisition of BWI Southeast – Valuation of Mineral Reserves\n\n\nAs described in Note B to the consolidated financial statements, on April 5, 2024, the Company completed the acquisition of 20 active aggregates operations in Alabama, South Carolina, South Florida, Tennessee, and Virginia from affiliates of Blue Water Industries LLC (BWI Southeast) for $2.05 billion in cash, which resulted in the Company recording mineral reserves of $1.9 billion . As disclosed by management, the fair value of mineral reserves is determined using an excess earnings approach, which requires significant judgment to estimate future cash flows based on available historical information and future expectations, as well as significant assumptions, which include forecasted revenues based on sales price and shipment volumes, EBITDA margin, forecasted expenses inclusive of production costs and capital needs, and the discount rate.\n\n\nThe principal considerations for our determination that performing procedures relating to the valuation of mineral reserves acquired in the acquisition of BWI Southeast is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of the mineral reserves acquired; (ii) a high degree of auditor judgment, subjectivity and effort in performing procedures and evaluating management’s significant assumptions related to forecasted revenues, EBITDA margin and the discount rate; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.\n\n\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the acquisition accounting, including controls over management’s valuation of the mineral reserves acquired. These procedures also included, among others, (i) reading the purchase agreement; (ii) testing management’s process for developing the fair value estimate of the mineral reserves acquired; (iii) evaluating the appropriateness of the excess earnings approach; (iv) testing the completeness and accuracy of the underlying data used in the excess earnings approach; and (v) evaluating the reasonableness of the significant assumptions used by management related to forecasted revenues, EBITDA margin and the discount rate. Evaluating management's assumptions related to forecasted revenues and EBITDA margin involved considering (i) the current and past performance of the BWI Southeast business; (ii) the current and past performance of peer companies; (iii) the consistency with external market and industry data; and (iv) whether the assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the excess earnings approach and (ii) the reasonableness of the discount rate assumption.\n\n\n \n\n\n \n\n\n/s/ PricewaterhouseCoopers LLP\n\n\nRaleigh, North Carolina\n\n\nFebruary 21, 2025\n\n\n \n\n\nWe have served as the Company’s auditor since 2016.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n66\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nFinancial Statements\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMartin Marietta Materials, Inc. and Consolidated Subsidiaries\nConsolidated Statements of Earnings\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nyears ended December 31\n(in millions, except per share data)\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n \n\n\n$\n\n\n6,536\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n6,777\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n6,161\n\n\n \n\n\n\n\n\n\nCost of revenues\n\n\n \n\n\n \n\n\n \n\n\n4,658\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4,754\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4,738\n\n\n \n\n\n\n\n\n\nGross Profit\n\n\n \n\n\n \n\n\n \n\n\n1,878\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2,023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,423\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n \n\n\n447\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n443\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n397\n\n\n \n\n\n\n\n\n\nAcquisition, divestiture and integration expenses\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n\n\n\n\nOther operating income, net\n\n\n \n\n\n \n\n\n \n\n\n(\n1,326\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n28\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n190\n\n\n)\n\n\n\n\n\n\nEarnings from Operations\n\n\n \n\n\n \n\n\n \n\n\n2,707\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,596\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,207\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n \n\n\n169\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n165\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n169\n\n\n \n\n\n\n\n\n\nOther nonoperating income, net\n\n\n \n\n\n \n\n\n \n\n\n(\n58\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n62\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n53\n\n\n)\n\n\n\n\n\n\nEarnings from continuing operations before income tax expense\n\n\n \n\n\n \n\n\n \n\n\n2,596\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,493\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,091\n\n\n \n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n \n\n\n600\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n293\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n235\n\n\n \n\n\n\n\n\n\nEarnings from continuing operations\n\n\n \n\n\n \n\n\n \n\n\n1,996\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,200\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n856\n\n\n \n\n\n\n\n\n\n(Loss) Earnings from discontinued operations, net of income tax \n   (benefit) expense\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n30\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n\n\n\n\nConsolidated net earnings\n\n\n \n\n\n \n\n\n \n\n\n1,996\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,170\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n867\n\n\n \n\n\n\n\n\n\nLess: Net earnings attributable to noncontrolling interests\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nNet Earnings Attributable to Martin Marietta\n\n\n \n\n\n \n\n\n$\n\n\n1,995\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,169\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n867\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet Earnings (Loss) Attributable to Martin Marietta Per Common \n   Share (see Note A)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic earnings per share from continuing operations attributable to \n   common shareholders\n\n\n \n\n\n \n\n\n$\n\n\n32.50\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n19.38\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n13.74\n\n\n \n\n\n\n\n\n\nBasic (loss) earnings per share from discontinued operations\n   attributable to common shareholders\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n0.50\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n0.17\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n32.50\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n18.88\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n13.91\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiluted earnings per share from continuing operations attributable \n   to common shareholders\n\n\n \n\n\n \n\n\n$\n\n\n32.41\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n19.32\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n13.70\n\n\n \n\n\n\n\n\n\nDiluted (loss) earnings per share from discontinued operations \n   attributable to common shareholders\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n0.50\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n0.17\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n32.41\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n18.82\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n13.87\n\n\n \n\n\n\n\n\n\nWeighted-Average Common Shares Outstanding\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n \n\n\n \n\n\n61.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n61.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n62.3\n\n\n \n\n\n\n\n\n\nDiluted\n\n\n \n\n\n \n\n\n \n\n\n61.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n62.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n62.5\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying Notes to the Financial Statements are an integral part of these statements.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n67\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMartin Marietta Materials, Inc. and Consolidated Subsidiaries\nConsolidated Statements of Comprehensive Earnings\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nConsolidated Net Earnings\n\n\n \n\n\n \n\n\n$\n\n\n1,996\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,170\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n867\n\n\n \n\n\n\n\n\n\nOther comprehensive earnings (loss), net of tax:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDefined benefit pension and postretirement plans:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet gain (loss) arising during period, net of tax of $\n11\n, $(\n5\n) and\n   $\n29\n, respectively\n\n\n \n\n\n \n\n\n \n\n\n33\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n16\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n88\n\n\n \n\n\n\n\n\n\nPrior service cost arising during period, net of tax of $\n0\n, $\n0\n and \n   $(\n12\n), respectively\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n36\n\n\n)\n\n\n\n\n\n\nAmortization of prior service cost, net of tax of $\n1\n, $\n2\n and \n   $\n1\n, respectively\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n\n\n\n\nAmortization of actuarial loss, net of tax of $\n0\n, $\n0\n and\n   $\n1\n, respectively\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n\n\n\n\nAmount recognized in net periodic pension cost due to settlement,\n   net of tax of $\n0\n, $\n0\n and $\n1\n, respectively\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n39\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n62\n\n\n \n\n\n\n\n\n\nForeign currency translation (loss) gain\n\n\n \n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n\n\n\n\nComprehensive Earnings Attributable to Martin Marietta\n\n\n \n\n\n \n\n\n$\n\n\n2,032\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,159\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n927\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying Notes to the Financial Statements are an integral part of these statements.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n68\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMartin Marietta Materials, Inc. and Consolidated Subsidiaries\nConsolidated Balance Sheets\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31\n(in millions, except share and par value data)\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAssets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent Assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n \n\n\n$\n\n\n670\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,272\n\n\n \n\n\n\n\n\n\nRestricted cash\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n\n\n\n\nAccounts receivable, net\n\n\n \n\n\n \n\n\n \n\n\n678\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n753\n\n\n \n\n\n\n\n\n\nInventories, net\n\n\n \n\n\n \n\n\n \n\n\n1,115\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n989\n\n\n \n\n\n\n\n\n\nCurrent assets held for sale\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n807\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n \n\n\n71\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n88\n\n\n \n\n\n\n\n\n\nTotal Current Assets\n\n\n \n\n\n \n\n\n \n\n\n2,542\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,919\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment, net\n\n\n \n\n\n \n\n\n \n\n\n10,109\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6,186\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n \n\n\n3,767\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,389\n\n\n \n\n\n\n\n\n\nOther intangibles, net\n\n\n \n\n\n \n\n\n \n\n\n730\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n698\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets, net\n\n\n \n\n\n \n\n\n \n\n\n376\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n372\n\n\n \n\n\n\n\n\n\nOther noncurrent assets\n\n\n \n\n\n \n\n\n \n\n\n646\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n561\n\n\n \n\n\n\n\n\n\nTotal Assets\n\n\n \n\n\n \n\n\n$\n\n\n18,170\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n15,125\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLiabilities and Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent Liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n$\n\n\n375\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n343\n\n\n \n\n\n\n\n\n\nAccrued salaries, benefits and payroll taxes\n\n\n \n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n102\n\n\n \n\n\n\n\n\n\nAccrued income taxes\n\n\n \n\n\n \n\n\n \n\n\n102\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nAccrued other taxes\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n\n\n\n\nAccrued interest\n\n\n \n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n41\n\n\n \n\n\n\n\n\n\nCurrent maturities of long-term debt\n\n\n \n\n\n \n\n\n \n\n\n125\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n400\n\n\n \n\n\n\n\n\n\nCurrent operating lease liabilities\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n53\n\n\n \n\n\n\n\n\n\nOther current liabilities\n\n\n \n\n\n \n\n\n \n\n\n190\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n178\n\n\n \n\n\n\n\n\n\nTotal Current Liabilities\n\n\n \n\n\n \n\n\n \n\n\n1,016\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,170\n\n\n \n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n \n\n\n \n\n\n5,288\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,946\n\n\n \n\n\n\n\n\n\nDeferred income taxes, net\n\n\n \n\n\n \n\n\n \n\n\n1,169\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n874\n\n\n \n\n\n\n\n\n\nNoncurrent operating lease liabilities\n\n\n \n\n\n \n\n\n \n\n\n335\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n327\n\n\n \n\n\n\n\n\n\nNoncurrent asset retirement obligations\n\n\n \n\n\n \n\n\n \n\n\n423\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n383\n\n\n \n\n\n\n\n\n\nOther noncurrent liabilities\n\n\n \n\n\n \n\n\n \n\n\n483\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n389\n\n\n \n\n\n\n\n\n\nTotal Liabilities\n\n\n \n\n\n \n\n\n \n\n\n8,714\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n7,089\n\n\n \n\n\n\n\n\n\nCommitments and Contingent Liabilities - Note N\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEquity:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCommon stock ($\n0.01\n par value; \n100,000,000\n shares authorized; \n61,126,646\n shares \n   and \n61,821,421\n shares outstanding at December 31, 2024 and 2023, respectively)\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nPreferred stock ($\n0.01\n par value; \n10,000,000\n shares authorized; \nno\n shares outstanding)\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAdditional paid-in capital\n\n\n \n\n\n \n\n\n \n\n\n3,550\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,519\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss\n\n\n \n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n49\n\n\n)\n\n\n\n\n\n\nRetained earnings\n\n\n \n\n\n \n\n\n \n\n\n5,915\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4,563\n\n\n \n\n\n\n\n\n\nTotal Shareholders’ Equity\n\n\n \n\n\n \n\n\n \n\n\n9,453\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,034\n\n\n \n\n\n\n\n\n\nNoncontrolling interests\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal Equity\n\n\n \n\n\n \n\n\n \n\n\n9,456\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,036\n\n\n \n\n\n\n\n\n\nTotal Liabilities and Equity\n\n\n \n\n\n \n\n\n$\n\n\n18,170\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n15,125\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying Notes to the Financial Statements are an integral part of these statements.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n69\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMartin Marietta Materials, Inc. and Consolidated Subsidiaries\nConsolidated Statements of Cash Flows\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash Flows from Operating Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated net earnings\n\n\n \n\n\n \n\n\n$\n\n\n1,996\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,170\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n867\n\n\n \n\n\n\n\n\n\nAdjustments to reconcile consolidated net earnings to net cash \n   provided by operating activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation, depletion and amortization\n\n\n \n\n\n \n\n\n \n\n\n573\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n513\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n506\n\n\n \n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n \n\n\n58\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n\n\n\n\nNet gains on divestitures, sales of assets and extinguishment of debt\n\n\n \n\n\n \n\n\n \n\n\n(\n1,369\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n196\n\n\n)\n\n\n\n\n\n\nDeferred income taxes, net\n\n\n \n\n\n \n\n\n \n\n\n(\n45\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n36\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n\n\n\n\nNoncash portion of asset and portfolio rationalization charge\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther items, net\n\n\n \n\n\n \n\n\n \n\n\n(\n15\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n16\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n\n\n\n\nChanges in operating assets and liabilities, net of effects of acquisitions\n   and divestitures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts receivable, net\n\n\n \n\n\n \n\n\n \n\n\n81\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n\n\n\n\nInventories, net\n\n\n \n\n\n \n\n\n \n\n\n(\n52\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n189\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n132\n\n\n)\n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n \n\n\n17\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n17\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n31\n\n\n)\n\n\n\n\n\n\nOther assets and liabilities, net\n\n\n \n\n\n \n\n\n \n\n\n165\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n24\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n41\n\n\n)\n\n\n\n\n\n\nNet Cash Provided by Operating Activities\n\n\n \n\n\n \n\n\n \n\n\n1,459\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,528\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n991\n\n\n \n\n\n\n\n\n\nCash Flows from Investing Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdditions to property, plant and equipment\n\n\n \n\n\n \n\n\n \n\n\n(\n855\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n650\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n482\n\n\n)\n\n\n\n\n\n\nAcquisitions, net of cash acquired\n\n\n \n\n\n \n\n\n \n\n\n(\n3,642\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n\n\n\n\nProceeds from divestitures and sales of assets\n\n\n \n\n\n \n\n\n \n\n\n2,160\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n427\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n687\n\n\n \n\n\n\n\n\n\nProceeds from sale of restricted investments to discharge \n   long-term debt\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n700\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPurchase of restricted investments to discharge long-term debt\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n704\n\n\n)\n\n\n\n\n\n\nInvestments in limited liability company\n\n\n \n\n\n \n\n\n \n\n\n(\n117\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n27\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther investing activities, net\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nNet Cash (Used for) Provided by Investing Activities\n\n\n \n\n\n \n\n\n \n\n\n(\n2,444\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n459\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n484\n\n\n)\n\n\n\n\n\n\nCash Flows from Financing Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBorrowings of long-term debt\n\n\n \n\n\n \n\n\n \n\n\n2,758\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nRepayments of long-term debt\n\n\n \n\n\n \n\n\n \n\n\n(\n1,690\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n700\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n54\n\n\n)\n\n\n\n\n\n\nPayments on finance lease obligations\n\n\n \n\n\n \n\n\n \n\n\n(\n20\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n17\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n15\n\n\n)\n\n\n\n\n\n\nDividends paid\n\n\n \n\n\n \n\n\n \n\n\n(\n189\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n174\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n160\n\n\n)\n\n\n\n\n\n\nRepurchases of common stock\n\n\n \n\n\n \n\n\n \n\n\n(\n450\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n150\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n150\n\n\n)\n\n\n\n\n\n\nShares withheld for employees’ income tax obligations\n\n\n \n\n\n \n\n\n \n\n\n(\n32\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n22\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n29\n\n\n)\n\n\n\n\n\n\nOther financing activities, net\n\n\n \n\n\n \n\n\n \n\n\n(\n4\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nNet Cash Provided by (Used for) Financing Activities\n\n\n \n\n\n \n\n\n \n\n\n373\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n1,064\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n(\n407\n\n\n)\n\n\n\n\n\n\nNet (Decrease) Increase in Cash, Cash Equivalents and Restricted Cash\n\n\n \n\n\n \n\n\n \n\n\n(\n612\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n923\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n \n\n\n\n\n\n\nCash, Cash Equivalents and Restricted Cash,\n \nbeginning of year\n\n\n \n\n\n \n\n\n \n\n\n1,282\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n359\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n259\n\n\n \n\n\n\n\n\n\nCash, Cash Equivalents and Restricted Cash, end of year\n\n\n \n\n\n \n\n\n$\n\n\n670\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,282\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n359\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying Notes to the Financial Statements are an integral part of these statements.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n70\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMartin Marietta Materials, Inc. and Consolidated Subsidiaries\nConsolidated Statements of Total Equity\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions, except share and per share data)\n\n\n \n\n\nShares of \nCommon \nStock\n\n\n \n\n\n \n\n\nCommon \nStock\n\n\n \n\n\n \n\n\nAdditional \nPaid-In \nCapital\n\n\n \n\n\n \n\n\nAccumulated Other \nComprehensive\nLoss\n\n\n \n\n\n \n\n\nRetained \nEarnings\n\n\n \n\n\n \n\n\nTotal \nShareholders’\nEquity\n\n\n \n\n\n \n\n\nNoncontrolling \nInterests\n\n\n \n\n\n \n\n\nTotal Equity\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2021\n\n\n \n\n\n \n\n\n62,393,990\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n3,470\n\n\n \n\n\n \n\n\n$\n\n\n(\n98\n\n\n)\n\n\n \n\n\n$\n\n\n3,162\n\n\n \n\n\n \n\n\n$\n\n\n6,535\n\n\n \n\n\n \n\n\n$\n\n\n2\n\n\n \n\n\n \n\n\n$\n\n\n6,537\n\n\n \n\n\n\n\n\n\nConsolidated net earnings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n867\n\n\n \n\n\n \n\n\n \n\n\n867\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n867\n\n\n \n\n\n\n\n\n\nOther comprehensive earnings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n\n\n\n\nDividends declared ($\n2.54\n per common share)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n160\n\n\n)\n\n\n \n\n\n \n\n\n(\n160\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n160\n\n\n)\n\n\n\n\n\n\nIssuances of common stock for stock award plans\n\n\n \n\n\n \n\n\n126,699\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\nShares withheld for employees’ income tax\n   obligations\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n29\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n29\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n29\n\n\n)\n\n\n\n\n\n\nRepurchases of common stock\n\n\n \n\n\n \n\n\n(\n418,336\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n150\n\n\n)\n\n\n \n\n\n \n\n\n(\n150\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n150\n\n\n)\n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2022\n\n\n \n\n\n \n\n\n62,102,353\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n3,489\n\n\n \n\n\n \n\n\n \n\n\n(\n38\n\n\n)\n\n\n \n\n\n \n\n\n3,719\n\n\n \n\n\n \n\n\n \n\n\n7,171\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n7,173\n\n\n \n\n\n\n\n\n\nConsolidated net earnings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,169\n\n\n \n\n\n \n\n\n \n\n\n1,169\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n1,170\n\n\n \n\n\n\n\n\n\nOther comprehensive loss\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n\n\n\n\nDividends declared ($\n2.80\n per common share)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n174\n\n\n)\n\n\n \n\n\n \n\n\n(\n174\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n174\n\n\n)\n\n\n\n\n\n\nIssuances of common stock for stock award plans\n\n\n \n\n\n \n\n\n100,588\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nShares withheld for employees’ income tax\n   obligations\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n22\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n22\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n22\n\n\n)\n\n\n\n\n\n\nRepurchases of common stock\n\n\n \n\n\n \n\n\n(\n381,520\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n151\n\n\n)\n\n\n \n\n\n \n\n\n(\n151\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n151\n\n\n)\n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n\n\n\n\nDistribution to owners of noncontrolling interest\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n\n\n\n\nBalance at December 31, 2023\n\n\n \n\n\n \n\n\n61,821,421\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n3,519\n\n\n \n\n\n \n\n\n \n\n\n(\n49\n\n\n)\n\n\n \n\n\n \n\n\n4,563\n\n\n \n\n\n \n\n\n \n\n\n8,034\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n8,036\n\n\n \n\n\n\n\n\n\nConsolidated net earnings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,995\n\n\n \n\n\n \n\n\n \n\n\n1,995\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n1,996\n\n\n \n\n\n\n\n\n\nOther comprehensive earnings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n\n\n\n\nDividends declared ($\n3.06\n per common share)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n189\n\n\n)\n\n\n \n\n\n \n\n\n(\n189\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n189\n\n\n)\n\n\n\n\n\n\nIssuances of common stock for stock award plans\n\n\n \n\n\n \n\n\n90,983\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\nShares withheld for employees’ income tax\n   obligations\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n32\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n32\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n32\n\n\n)\n\n\n\n\n\n\nRepurchases of common stock\n\n\n \n\n\n \n\n\n(\n785,758\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n454\n\n\n)\n\n\n \n\n\n \n\n\n(\n454\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n454\n\n\n)\n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n58\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n58\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n58\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2024\n\n\n \n\n\n \n\n\n61,126,646\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n3,550\n\n\n \n\n\n \n\n\n$\n\n\n(\n13\n\n\n)\n\n\n \n\n\n$\n\n\n5,915\n\n\n \n\n\n \n\n\n$\n\n\n9,453\n\n\n \n\n\n \n\n\n$\n\n\n3\n\n\n \n\n\n \n\n\n$\n\n\n9,456\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying Notes to the Financial Statements are an integral part of these statements.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n71\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNotes to Financial Statements\n \n\n\nNote A: Accou\nnting Policies\n \nOrganization. \nMartin Marietta is a natural resource-based building materials company. The Company supplies aggregates (crushed stone, sand and gravel) through its network of approximately \n390\n quarries, mines and distribution yards in \n28\n states, Canada and The Bahamas. Martin Marietta also provides cement and downstream products and services, namely, ready mixed concrete, asphalt and paving, in vertically-integrated structured markets where the Company also has a leading aggregates position. \nSpecifically, the Company has one cement plant and two cement distribution facilities in Texas; ready mixed concrete plants in Arizona and Texas; and asphalt plants in Arizona, California, Colorado and Minnesota. Paving services are located in California and Colorado. The Company’s heavy-side building materials are used in infrastructure, nonresidential and residential construction projects. Aggregates are also used in agricultural, utility and environmental applications and as railroad ballast. The aggregates, cement and ready mixed concrete and asphalt and paving product lines are reported collectively as the Building Materials business.\n \nAs of December 31, 2024\n, the Building Materials business includes \ntwo\n reportable segments: East Group and West Group. The East Group consists of the East and Central divisions and operates in Alabama, Florida, Georgia, Indiana, Iowa, Kansas, Kentucky, Maryland, Minnesota, Missouri, Nebraska, North Carolina, Ohio, Pennsylvania, South Carolina, Tennessee, Virginia, West Virginia, Nova Scotia and The Bahamas. The West Group is comprised of the Southwest and West divisions and operates in Arizona, Arkansas, California, Colorado, Louisiana, Oklahoma, Texa\ns, Utah, Washington and Wyoming. The following ten states accounted for \n81\n%\n of the Building Materials business’ 2024 revenues: Texas, North Carolina, Colorado, California, Georgia, Florida, Minnesota, Arizona, South Carolina, and Iowa.\nThe Company also operates a Magnesia Specialties business\n, which represents a separate reportable segment. The Magnesia Specialties business produces magnesia-based chemical products used in industrial, agricultural and environmental applications, and dolomitic lime sold primarily to customers for steel production and soil stabilization. Magnesia Specialties’ production facilities are located in Ohio and Michigan, and products are shipped to customers domestically and worldwide.\nBasis of Presentation and Use of Estimates.\n The Company’s consolidated financial statements are presented in conformity with accounting principles generally accepted in the United States, which require management to make certain estimates and assumptions about future events. These estimates and the underlying assumptions affect the amounts of assets and liabilities reported, disclosures about contingent assets and liabilities and reported amounts of revenues and expenses. Such estimates include the valuation of investments, accounts receivable, inventories, goodwill, other intangible assets and other long-lived assets, as well as assumptions used in the calculation of income tax expense, retirement and postemployment benefits, stock-based compensation, the allocation of the purchase price to the fair values of assets acquired and liabilities assumed as part of business combinations and revenue recognition for service contracts. These estimates and assumptions are based on management’s judgment. Management evaluates estimates and assumptions on an ongoing basis using historical experience and other factors, including the current economic environment, and adjusts such estimates and assumptions when facts and circumstances dictate. Changes in interest rates, credit, equity and energy markets and changes in construction activity increase the uncertainty inherent in certain estimates and assumptions. Because future events and their effects cannot be determined with precision, actual results could differ significantly from estimates. Changes in estimates, including those resulting from changes in the economic environment, are reflected in the consolidated financial statements for the period in which the change in estimate occurs.\n \nBasis of Consolidation\n.\n \nThe consolidated financial statements include the accounts of the Company and its wholly-owned and majority-owned subsidiaries. Partially-owned affiliates are either consolidated or accounted for using the cost method or the equity method, depending on the level of ownership interest or the Company’s ability to exercise control over the affiliates’ operations. Intercompany balances and transactions between subsidiaries have been eliminated in consolidation.\n \nRevenue Recognition\n.\n \nRevenues include sales of products and services provided to customers, net of discounts or allowances, if any, and freight and delivery costs billed to customers. Product revenues are recognized when control of the promised good is transferred to unaffiliated customers, typically when finished products are shipped. Intersegment and interproduct revenues are eliminated in consolidation. Service revenues are derived from the paving business and are recognized using the percentage-of-completion method under the cost-to-cost approach. Under the cost-to-cost approach, recognized contract revenue is determined by multiplying the total estimated contract revenue by the estimated percentage of completion. Contract costs are recognized as incurred. The percentage of completion is determined on a contract-by-contract basis using project costs incurred to date as a percentage of total estimated project costs. The Company believes the cost-to-cost approach is appropriate, as the use of asphalt in a paving contract is relatively consistent with the performance of the related paving services. When the Company arranges\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n72\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nthird-party freight to deliver products to customers, the Company has elected the delivery to be a fulfillment activity rather than a separate performance obligation. Further, the Company acts as a principal in the delivery arrangements and, as required by Accounting Standards Codification 606,\n Revenues from Contracts with Customers \n(ASC 606)\n, \nthe related revenues and costs are presented gross in the consolidated statements of earnings and are recognized consistently with the timing of the product revenues.\nCash, Cash Equivalents and Restricted Cash\n.\n \nCash equivalents are comprised of highly-liquid instruments with original maturities of three months or less from the date of purchase.\n \nAs of December 31, 2023, the Company had \n$\n10\n million of restricted cash, which was invested in an account designated for the purchase of like-kind exchange replacement assets under Section 1031 of the Internal Revenue Code and related IRS procedures (Section 1031). The Company was restricted from utilizing the cash for purposes other than the purchase of qualified assets for \n180\n days from receipt of the proceeds from the sale of the exchanged property. Any unused restricted cash at the end of the \n180\n days was transferred to unrestricted accounts of the Company and used for general corporate purposes. As of \nDecember 31, 2024\n, the Company had \nno\n restricted cash.\n \nThe statements of cash flows reflect cash flow changes and balances for cash, cash equivalents and restricted cash on an aggregated basis. \nThe following table reconciles cash, cash equivalents and restricted cash as reported on the consolidated balance sheets to the aggregated amounts presented on the consolidated statements of cash flows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n670\n\n\n \n\n\n \n\n\n$\n\n\n1,272\n\n\n \n\n\n \n\n\n$\n\n\n358\n\n\n \n\n\n\n\n\n\nRestricted cash\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nTotal cash, cash equivalents and restricted cash \n   presented in the consolidated statements of cash flows\n\n\n \n\n\n$\n\n\n670\n\n\n \n\n\n \n\n\n$\n\n\n1,282\n\n\n \n\n\n \n\n\n$\n\n\n359\n\n\n \n\n\n\n\nAccounts Receivable. \nAccounts receivable are stated at cost. The Company does not typically charge interest on customer accounts receivable. The Company records an allowance for credit losses, which includes a provision for probable losses based on historical write-offs, adjusted for current conditions as deemed necessary, and a specific reserve for accounts deemed at risk. The allowance is the Company’s estimate for receivables as of the balance sheet date that ultimately will not be collected. Any changes in the allowance are reflected in earnings in the period in which the change occurs. The Company writes off accounts receivable when it becomes probable, based upon customer facts and circumstances, that such amounts will not be collected.\n \nInventories Valuation\n. \nFinished products and in-process inventories are stated at the lower of cost or net realizable value using standard costs, which approximate the first-in, first-out method. Carrying value for parts and supplies are determined by the weighted-average cost method. The Company records an allowance for finished product inventories based on an analysis of future demand and inventory on hand in excess of \none year\n's sales using an average of the last \ntwo years\n of sales. The Company also establishes an allowance for parts over \nfive years\n old and supplies over a year old.\n \nPost-production stripping costs, which represent costs of removing overburden and waste materials to access mineral deposits, are a component of inventory production costs and recognized as incurred.\n \nProperty, Plant and Equipment\n.\n \nProperty, plant and equipment are stated at cost.\n \nThe estimated service lives for property, plant and equipment are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClass of Assets\n\n\n \n\n\nRange of Service Lives\n\n\n\n\n\n\nBuildings\n\n\n \n\n\n5 \nto \n30\n years\n\n\n\n\n\n\nMachinery & Equipment\n\n\n \n\n\n2 \nto \n20\n years\n\n\n\n\n\n\nLand Improvements\n\n\n \n\n\n5\n to \n60\n years\n\n\n\n\nThe Company begins capitalizing quarry development costs at a point when reserves are determined to be proven or probable, economically mineable and when demand supports investment in the market. Capitalization of these costs ceases when production commences. Capitalized quarry development costs are classified as land improvements and depreciated over the life of the reserves.\n \nThe Company reviews relevant facts and circumstances to determine whether to capitalize or expense pre-production stripping costs when additional pits are developed at an existing quarry. If the additional pit operates in a separate and distinct area of the quarry, these costs are capitalized as quarry development costs and depreciated over the life of the uncovered reserves.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n73\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nAdditionally, a separate asset retirement obligation is created for additional pits when the liability is incurred. Once a pit enters the production phase, all post-production stripping costs are charged to inventory production costs as incurred.\n \nMineral reserves and mineral interests acquired in connection with a business combination are valued using an income approach for the estimated life of the reserves.\n \nDepreciation is computed based on estimated service lives using the straight-line method. Depletion of mineral reserves is calculated based on proven and probable reserves using the units-of-production method on a quarry-by-quarry basis. For the years ended December 31, 2024, 2023, and 2022, depletion expense w\nas $\n78\n million, $\n53\n million, and $\n60\n million, respectively.\nProperty, plant and equipment are reviewed for impairment whenever facts and circumstances indicate that the carrying amount of an asset group may not be recoverable. An impairment loss is recognized if expected future undiscounted cash flows over the estimated remaining service life of the related asset group are less than the asset group’s carrying value.\n \nRepair and Maintenance Costs.\n \nRepair and maintenance costs that do not substantially extend the life of the Company’s plant and equipment are expensed as incurred.\n \nLeases.\n Pursuant to Accounting Standards Codification 842, \nLeases\n (ASC 842), if the Company determines a contract is or contains a lease at the inception of an agreement, the Company records a right-of-use (ROU) asset, which represents the Company’s right to use an underlying leased asset, and a lease liability, which represents the Company’s obligation to make lease payments. The ROU asset and lease liability are recorded on the consolidated balance sheets at the present value of the future lease payments over the lease term at commencement date. The Company determines the present value of lease payments based on the implicit interest rate, which may be explicitly stated in the lease, if available, or may be the Company’s estimated collateralized incremental borrowing rate based on the term of the lease. Initial ROU assets also include any lease payments made at or before commencement date and any initial direct costs incurred and are reduced by lease incentives. Certain of the Company’s leases contain renewal and/or termination options. The Company recognizes renewal or termination options as part of its ROU assets and lease liabilities when the Company has the unilateral right to renew or terminate and it is reasonably certain these options will be exercised.\n \nSome leases require the Company to pay non-lease components, which may include taxes, maintenance, insurance and certain other expenses applicable to the leased property and, are primarily, variable costs. The Company accounts for lease and non-lease components as a single amount, except railcar, fleet vehicle and pipeline leases, for which the Company separately accounts for the lease and non-lease components.\nLeases are evaluated and determined to be either finance leases or operating leases. The lease is a finance lease if it transfers ownership to the underlying asset by the end of the lease term; includes a purchase option that is reasonably certain to be exercised; has a lease term for the major part of the underlying asset's remaining economic life; has a present value of the sum of the lease payments (including renewal options) that equals or exceeds substantially all of the fair value of the underlying asset; or is for an underlying asset that is of a specialized nature and is expected to have no alternative use to the lessor at the end of the lease term. If none of these terms exist, the lease is an operating lease.\nLeases with an initial lease term of one year or less are not recorded on the consolidated balance sheets. Costs for these leases are expensed as incurred.\nIn the consolidated statements of earnings, operating lease expense, which is recognized on a straight-line basis over the lease term, and the amortization of finance lease ROU assets are included in the \nTotal cost of revenues\n or \nSelling, general and administrative expenses \nline items in the consolidated statements of earnings\n. Accretion on the liabilities for finance leases is included in interest expense.\n \nGoodwill and Other Intangible Assets.\n \nGoodwill represents the excess purchase price paid for acquired businesses over the estimated fair value of identifiable assets and liabilities. Other intangible assets represent amounts assigned principally to contractual agreements and are either amortized ratably over the useful lives to the Company or not amortized if deemed to have an indefinite useful life. The Company intends, and believes it has the ability, to renew royalty agreements and extend permits that support the value of certain intangible assets.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n74\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe Company’s reporting units, which represent the level at which goodwill is tested for impairment, are based on the operating segments of the Building Materials business. Goodwill is assigned to the respective reporting unit(s) based on the location of acquisitions at the time of consummation. If subsequent organizational changes result in operations being transferred to a different reporting unit, a proportionate amount of goodwill is transferred from the former to the new reporting unit. For divestitures, goodwill is allocated on a proportional basis based on the relative fair values of the portion of the reporting unit being disposed of and the portion of the reporting unit remaining. \nThere is \nno\n goodwill related to the Magnesia Specialties business.\nGoodwill is tested for impairment by comparing each reporting unit’s fair value to its carrying value, which represents a Step-1 approach. However, prior to Step 1, the Company may perform a qualitative assessment and evaluate macroeconomic conditions, industry and market conditions, cost factors, overall financial performance and other business or reporting unit-specific events that contribute to the fair value of a reporting unit. If the Company concludes, based on its qualitative assessment, it is more-likely-than-not (\ni.e\n., a likelihood of more than 50%) that a reporting unit’s fair value is higher than its carrying value, the Company is not required to perform any further goodwill impairment testing for that reporting unit. Otherwise, the Company proceeds to Step 1, and if a reporting unit’s fair value exceeds its carrying value, there is no impairment. A reporting unit with a carrying value in excess of its fair value results in an impairment charge equal to the difference. When the Company validates its conclusion by measuring fair value, it may resume performing a qualitative assessment for a reporting unit in any subsequent period. The Company may bypass the qualitative assessment for any reporting unit in any period and proceed directly with the quantitative calculation in Step 1. The Company performs a Step 1 analysis for all its reporting units every three years.\nThe Company reviews the carrying values of goodwill and other indefinite-lived intangible assets for impairment as of October 1, which represents the annual evaluation date. An interim review is performed between annual tests if facts and circumstances indicate potential impairment. The carrying value of other amortizable intangible assets is reviewed if facts and circumstances indicate potential impairment. If a review indicates the carrying value is impaired, a charge is recorded equal to the amount by which the carrying value exceeds the fair value.\n \nRetirement Plans and Postretirement Benefits. \nThe Company sponsors defined benefit retirement plans and provides other postretirement benefits. The Company recognizes the funded status, defined as the difference between the fair value of plan assets and the benefit obligation, of its pension plans and other postretirement benefits as an asset or liability on the consolidated balance sheets. The measurement date for the Company’s defined benefit plans and postretirement benefit plans is December 31. Actuarial gai\nns or losses that arise during the year are recognized as a component of accumulated other comprehensive earnings or loss. Those amounts are amortized over the participants’ average remaining service period and recognized as a component of net periodic benefit cost. The amount amortized is determined on a plan-by-plan basis using a corridor approach and represents the excess over \n10\n% of the greater of the projected benefit obligation or pension plan assets.\n \nInsurance Reserves. \nThe Company has insurance coverage with large deductibles for workers’ compensation, automobile liability, marine liability and general liability claims, and is also self-insured for health claims. The Company records insurance reserves based on an actuarially-determined analysis, which calculates development factors that are applied to total case reserves within the insurance programs. While the Company believes the assumptions used to calculate these liabilities are appropriate, significant differences in actual experience and/or significant changes in these assumptions may materially affect insurance costs.\nStock-Based Compensation. \nThe Company has stock-based compensation plans for employees and its Board of Directors. The Company recognizes all forms of stock-based awards that vest as compensation expense. The compensation expense is the fair value of the awards at the measurement date and is recognized over the requisite service period. Forfeitures are recognized as they occur.\nThe fair value of restricted stock awards, incentive compensation stock awards and Board of Directors’ fees paid in the form of common stock are based on the closing price of the Company’s common stock on the grant dates. The fair value of performance stock awards as of the grant dates is determined using a Monte Carlo simulation methodology.\nEnvironmental Matters. \nThe Company records a liability for an asset retirement obligation at fair value in the period in which it is incurred. The asset retirement obligation is recorded at the acquisition date of a long-lived tangible asset if the fair value can be reasonably estimated. A corresponding amount is capitalized as part of the asset’s carrying amount. The fair value is affected by management’s assumptions regarding the scope of the work, inflation rates and asset retirement dates.\n \nFurther, the Company records an accrual for other environmental remediation liabilities in the period in which it is probable that a liability has been incurred and the appropriate amounts can be estimated reasonably. Such accruals are adjusted as further information develops or circumstances change. Generally, these costs are not discounted to their present value or offset for potential insurance or other claims or potential gains from future alternative uses for a site.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n75\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nIncome Taxes\n.\n \nThe Company uses the liability method to determine its current and deferred incomes taxes. Deferred income taxes, net, on the consolidated balance sheets reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The effect of changes in enacted tax rates on deferred income tax assets and liabilities is charged or credited to income tax expense in the period of enactment.\nThe Company applies the proportional amortization method to equity investments in renewable energy tax credit (RETC) programs that meet the following specified criteria: it is probable that the income tax credits allocable to the Company will be available; the Company does not have the ability to exercise significant influence over the operating and financial policies of the underlying project; substantially all of the projected benefits are from income tax credits and other income tax benefits, as determined on a discounted basis; the Company's projected yield based solely on the cash flows from the income tax credits and other income tax benefits is positive; and the Company is a limited liability investor in the limited liability entity for both legal and tax purposes and its liability is limited to its capital investment. Under the proportional amortization method, the equity investment is amortized in proportion to the income tax credits and other income tax benefits received, with the amortization expense and the income tax benefits presented on a net basis in the line item \nIncome tax expense\n in the consolidated statements of earnings. The RETC investments are included in the line item \nOther noncurrent assets\n on the consolidated balance sheets and the line item \nInvestments in limited liability company\n on the consolidated statements of cash flow.\nUncertain Tax Positions. \nThe Company recognizes a tax benefit when it is more-likely-than-not, based on the technical merits, that a tax position would be sustained upon examination by a taxing authority. The amount to be recognized is measured as the largest amount of tax benefit that is greater than \n50\n% likely of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. The Company’s unrecognized tax benefits are recorded in other liabilities on the consolidated balance sheets or as an offset to the deferred tax asset for tax carryforwards where available.\n \nThe Company records interest accrued in relation to unrecognized tax benefits as income tax expense. Penalties, if incurred, are recorded as operating expenses in the consolidated statements of earnings.\n \nSales Taxes. \nThe Company is deemed to be an agent when collecting sales taxes from customers. Sales taxes collected from customers are recorded as liabilities until remitted to taxing authorities and therefore are not reflected in the consolidated statements of earnings as revenues and expenses.\n \nStart-Up Costs.\n \nNoncapital start-up costs for new facilities and products are charged to operations as incurred.\n \nConsolidated Comprehensive Earnings and Accumulated Other Comprehensive Loss\n. \nConsolidated comprehensive earnings consist of consolidated net earnings, adjustments for the funded status of pension and postretirement benefit plans and foreign currency translation adjustments and are presented in the Company’s consolidated statements of comprehensive earnings.\n \nAccumulated other comprehensive loss consists of unrecognized gains and losses related to the funded status of the pension and postretirement benefit plans and foreign currency translation and is presented on the Company’s consolidated balance sheets.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n76\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe components of the changes in accumulated other comprehensive loss and related cumulative noncurrent deferred tax assets are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\nPension and \nPostretirement \nBenefit Plans\n\n\n \n\n\n \n\n\nForeign \nCurrency\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss at beginning of period\n\n\n \n\n\n$\n\n\n(\n48\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n49\n\n\n)\n\n\n\n\n\n\nOther comprehensive earnings (loss) before\n   reclassifications, net of tax\n\n\n \n\n\n \n\n\n33\n\n\n \n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n\n\n\n\nAmounts reclassified from accumulated other \n   comprehensive loss, net of tax\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nOther comprehensive earnings (loss), net of tax\n\n\n \n\n\n \n\n\n39\n\n\n \n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss at end of period\n\n\n \n\n\n$\n\n\n(\n9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n13\n\n\n)\n\n\n\n\n\n\nCumulative noncurrent deferred tax assets at end of period\n\n\n \n\n\n$\n\n\n41\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n41\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss at beginning of period\n\n\n \n\n\n$\n\n\n(\n36\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n38\n\n\n)\n\n\n\n\n\n\nOther comprehensive (loss) earnings before\n   reclassifications, net of tax\n\n\n \n\n\n \n\n\n(\n16\n\n\n)\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n(\n15\n\n\n)\n\n\n\n\n\n\nAmounts reclassified from accumulated other \n   comprehensive loss, net of tax\n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nOther comprehensive (loss) earnings, net of tax\n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n\n\n\n\nAccumulated other comprehensive loss at end of period\n\n\n \n\n\n$\n\n\n(\n48\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n49\n\n\n)\n\n\n\n\n\n\nCumulative noncurrent deferred tax assets at end of period\n\n\n \n\n\n$\n\n\n54\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n54\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss at beginning of period\n\n\n \n\n\n$\n\n\n(\n98\n\n\n)\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n(\n98\n\n\n)\n\n\n\n\n\n\nOther comprehensive earnings (loss) before reclassifications,\n   net of tax\n\n\n \n\n\n \n\n\n52\n\n\n \n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n\n\n\n\nAmounts reclassified from accumulated other \n   comprehensive loss, net of tax\n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n\n\n\n\nOther comprehensive earnings (loss), net of tax\n\n\n \n\n\n \n\n\n62\n\n\n \n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss at end of period\n\n\n \n\n\n$\n\n\n(\n36\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n38\n\n\n)\n\n\n\n\n\n\nCumulative noncurrent deferred tax assets at end of period\n\n\n \n\n\n$\n\n\n50\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n50\n\n\n \n\n\n\n\nReclassifications out of accumulated other comprehensive loss are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\nAffected line items in the\nconsolidated statements of earnings\n\n\n\n\n\n\nPension and postretirement benefit plans:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSettlement charge\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nActuarial loss\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\nOther nonoperating income, net\n\n\n\n\n\n\nTax effect\n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\nIncome tax expense\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n6\n\n\n \n\n\n \n\n\n$\n\n\n4\n\n\n \n\n\n \n\n\n$\n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n77\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nEarnings Per Common Share\n. \nThe numerator for basic and diluted earnings per common share is net earnings attributable to Martin Marietta. The denominator for basic earnings per common share is the weighted-average number of common shares outstanding during the period. Diluted earnings per common share is computed assuming that the weighted-average number of common shares is increased by the conversion, using the treasury stock method, of awards issued to employees and nonemployee members of the Company’s Board of Directors under certain stock-based compensation arrangements if the conversion is dilutive.\n \nThe following table reconciles the denominator for basic and diluted earnings from continuing operations per common share:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nBasic weighted-average common shares outstanding\n\n\n \n\n\n \n\n\n61.4\n\n\n \n\n\n \n\n\n \n\n\n61.9\n\n\n \n\n\n \n\n\n \n\n\n62.3\n\n\n \n\n\n\n\n\n\nEffect of dilutive employee and director awards\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n\n\n\n\nDiluted weighted-average common shares outstanding\n\n\n \n\n\n \n\n\n61.6\n\n\n \n\n\n \n\n\n \n\n\n62.1\n\n\n \n\n\n \n\n\n \n\n\n62.5\n\n\n \n\n\n\n\nReclassifications. \nCertain reclassifications have been made in the Company's financial statements of the prior years to conform to the current-year presentation. The reclassifications had no impact on the Company's previously reported results of operations, financial condition or cash flows.\nNew Accounting Pronouncements. \nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires a public entity to disclose significant segment expenses and other segment items on an annual and interim basis and provide in interim periods all disclosures about a reportable segment’s profit or loss and assets that are currently required annually. Additionally, the ASU requires a public entity to disclose the title and position of the Chief Operating Decision Maker. The ASU does not change how a public entity identifies its operating segments, aggregates them, or applies the quantitative thresholds to determine its reportable segments. The Company adopted ASU 2023-07 as of December 31, 2024 and applied the disclosure requirements retrospectively to all prior periods presented in the financial statements included in the 2024 Annual Report on Form 10-K (see Note O). The adoption had no impact on its results of operations, cash flows or financial condition.\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which focuses on the rate reconciliation and income taxes paid. ASU 2023-09 requires public entities to disclose, on an annual basis, a tabular tax rate reconciliation using both percentages and currency amounts, broken out into specified categories. Certain reconciling items are further broken out by nature and jurisdiction to the extent those items exceed a specified threshold. Additionally, all entities are required to disclose income taxes paid, net of refunds received, disaggregated by federal, state/local, and foreign taxes and by individual jurisdiction if the amount is at least \n5\n% of total income tax payments, net of refunds received. The ASU also requires additional qualitative disclosures. ASU 2023-09 is effective prospectively for annual periods beginning after December 15, 2024, and early adoption and retrospective application are permitted. The ASU will impact the Company's income tax disclosures beginning with the financial statements included in the 2025 Annual Report on Form 10-K, but will have no impact on its results of operations, cash flows or financial condition.\n \nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n (DISE), which requires public entities to disaggregate any relevant expense caption presented on the face of the income statement within continuing operations into the following required natural expense categories, as applicable: (1) purchases of inventory, (2) employee compensation, (3) depreciation, (4) intangible asset amortization, and (5) depreciation, depletion and amortization recognized as part of oil- and gas-producing activities or other depletion expenses. These disclosures must be made in a tabular format in the footnotes to the financial statements. The new standard does not change the requirements for the presentation of expenses on the face of the statement of earnings. The ASU is effective prospectively for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027, and early adoption and retrospective application are permitted. The ASU will impact the Company's expense disclosures beginning with the financial statements included in the 2027 Annual Report on Form 10-K, but will have no impact on its results of operations, cash flows or financial condition.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n78\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNote B: Business Combinations, Divestitures, Discontinued Operations and Assets and Liabilities Held for Sale\n \nBusiness Combinations\nRevenues and pretax earnings attributable to operations acquired in 2024 (as subsequently described) included in the Company's consolidated statement of earnings were $\n261\n million and $\n38\n million, respectively, for the year ended December 31, 2024. Pretax earnings attributable to acquired operations for 2024 reflect the impact of selling acquired inventory after its markup to fair value as part of acquisition accounting, including \n$\n20\n million related to the Blue Water Industries LLC transaction.\nBlue Water Industries LLC.\n On April 5, 2024, the Company completed the acquisition of \n20\n active aggregates operations in Alabama, South Carolina, South Florida, Tennessee, and Virginia from affiliates of Blue Water Industries LLC (BWI Southeast) for $\n2.05\n billion in cash. The BWI Southeast acquisition complements Martin Marietta’s existing geographic footprint in the southeast region by allowing the Company to expand into new growth platforms in target markets, including Tennessee and South Florida. The results from the acquired operations are reported in the Company's East Group.\nThe Company determined the acquisition-date fair values of assets acquired and liabilities assumed. The Company has recorded preliminary fair values of the assets acquired and liabilities assumed, which are subject to additional reviews that are not yet complete. As such, these amounts are subject to change during the measurement period, which extends no longer than one year from the consummation date, and remains open as of December 31, 2024. Notably, during the measurement period, the Company increased the acquisition-date fair value of property, plant and equipment by $\n91\n million and reduced goodwill by $\n82\n million.\n \nSpecific accounts subject to ongoing purchase accounting adjustments include, but are not limited to, property, plant and equipment; goodwill; other assets; other liabilities; and deferred income taxes. The goodwill generated by the transaction is not deductible for income tax purposes.\nThe following is a summary of the preliminary estimated fair values of the assets acquired and liabilities assumed as of April 5, 2024:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAssets:\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n$\n\n\n47\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n1\n\n\n \n\n\n \n\n\n2,052\n\n\n \n\n\n\n\n\n\nIntangible assets, other than goodwill\n\n\n \n\n\n \n\n\n19\n\n\n \n\n\n\n\n\n\nOther assets\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal assets\n\n\n \n\n\n \n\n\n2,120\n\n\n \n\n\n\n\n\n\nLiabilities:\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n \n\n\n234\n\n\n \n\n\n\n\n\n\nAsset retirement obligations\n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n\n\n\n\nOther liabilities\n\n\n \n\n\n \n\n\n96\n\n\n \n\n\n\n\n\n\nTotal liabilities\n\n\n \n\n\n \n\n\n333\n\n\n \n\n\n\n\n\n\nNet identifiable assets acquired\n\n\n \n\n\n \n\n\n1,787\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n\n\n\n\nTotal consideration\n\n\n \n\n\n$\n\n\n2,050\n\n\n \n\n\n\n\n1 \nIncludes mineral reserves of \n$\n1.9\n billion\n.\nThe following unaudited pro forma financial information summarizes the combined results of operations for the Company and BWI Southeast as though the companies were combined as of January 1, 2023. The unaudited pro forma financial information does not purport to project the future financial position or operating results of the combined company. Consistent with the assumed acquisition date of January 1, 2023, the pro forma financial results include acquisition and integration expenses of \n$\n23\n \nmillion and a \n$\n20\n million charge for selling inventory after its markup to fair value for the year ended December 31, 2023.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n79\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe following pro forma financial information is for informational purposes only and is not indicative of the results of operations that would have been achieved if the acquisition had taken place as of January 1, 2023:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n$\n\n\n6,588\n\n\n \n\n\n \n\n\n$\n\n\n7,003\n\n\n \n\n\n\n\n\n\nNet earnings from continuing operations attributable to Martin Marietta\n\n\n \n\n\n$\n\n\n2,028\n\n\n \n\n\n \n\n\n$\n\n\n1,117\n\n\n \n\n\n\n\nOther Business Combinations.\n \nOn January 12, 2024, the Company acquired Albert Frei & Sons, Inc. (AFS), a leading aggregates producer in Colorado. This acquisition provides more than \n60 years\n (at current production levels) of high-quality, hard rock reserves to better serve new and existing customers and enhances the Company's aggregates platform in the Denver metropolitan area. The Company determined the acquisition-date fair values of the assets acquired and liabilities assumed. As of December 31, 2024, the measurement period is closed. The goodwill generated by the transaction is not deductible for income tax purposes. The acquisition is reported in the Company's West Group and is immaterial for pro-forma financial statement disclosures.\nOn October 25, 2024, the Company completed the acquisition of Youngquist Brothers Rock, LLC (YBR), a leading aggregates supplier in the Fort Myers, Florida area. This acquisition allows the Company to serve new and existing customers and enhances the Company's aggregates platform in South Florida. The acquisition was financed through short-term borrowings, which were repaid upon a public debt offering completed on November 4, 2024 (see Note G). The Company has recorded preliminary fair values of the assets acquired and liabilities assumed, which are subject to additional reviews that are not yet complete. Thus, these amounts are subject to change during the measurement period, which extends no longer than one year from the consummation date, and remains open as of December 31, 2024. Specific accounts subject to ongoing purchase accounting adjustments, include, but are not limited to, property, plant and equipment; goodwill; other assets; and other liabilities. The goodwill generated by the transaction is deductible for income tax purposes. The acquisition is reported in the Company's East Group and is immaterial for pro-forma financial statement disclosures.\n \nOn December 13, 2024, the Company acquired R.E. Janes Gravel Co. (RE Janes), an aggregates bolt-on in Texas. The Company has recorded preliminary fair values of the assets acquired and liabilities assumed, which are subject to additional reviews that are not yet complete. Thus, these amounts are subject to change during the measurement period, which extends no longer than one year from the consummation date, and remains open as of December 31, 2024. Specific accounts subject to ongoing purchase accounting adjustments, include, but are not limited to, property, plant and equipment; goodwill; other assets; and other liabilities. The goodwill generated by the transaction is deductible for income tax purposes. The acquisition is reported in the Company's West Group and is immaterial for pro-forma financial statement disclosures.\n \nIn 2024, the Company completed acquisitions for total consideration of $\n1.6\n billion, excluding the BWI Southeast transaction. On a combined preliminary basis, these acquisitions (excluding BWI Southeast) included $\n1.5\n billion of property, plant and equipment (including $\n1.3\n billion in mineral reserves), $\n115\n million of goodwill, $\n27\n million of other intangibles and $\n92\n million of deferred income taxes. Individually and on a combined basis, these acquisitions are immaterial for pro-forma financial statement disclosures.\n \nDivestitures\nOn February 9, 2024, the Company completed the sale of its South Texas cement business and certain of its related ready mixed concrete operations to CRH Americas Materials, Inc., a subsidiary of CRH plc, for $\n2.1\n billion in cash plus normal customary closing adjustments. Specifically, the divested facilities included the Hunter cement plant in New Braunfels, Texas, related cement distribution terminals and \n20\n ready mixed concrete plants that served the Austin and San Antonio region, all of which were classified as assets held for sale as of December 31, 2023. The divestiture provided proceeds the Company used to consummate the BWI Southeast acquisition. The transaction resulted in a pretax gain of \n$\n1.3\n billion\n, which is included in \nOther operating income, net\n, in the Company's consolidated statement of earnings for the year ended December 31, 2024 and is exclusive of transaction expenses incurred due to the divestiture. The divested operations and the gain on divestiture are reported in the West Group.\nOn October 31, 2023, the Company completed the sale of its Tehachapi, California cement plant to UNACEM Corp S.A.A. for $\n315\n million in cash. In connection with the divestiture, the Company recorded a\n $\n26\n million pretax loss\n in discontinued operations.\n \nIn May 2023, the Company divested its Stockton cement import terminal in California.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n80\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nDiscontinued Operations\nThe associated financial results for the Company's California cement and ready mixed concrete operations, which were part of the Company's West Group, were reported as discontinued operations on the consolidated statements of earnings through their respective divestiture dates. As of December 31, 2024 and 2023, \nno\n operations were classified as discontinued operations.\n \nFinancial results for the Company's discontinued operations are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n$\n\n\n94\n\n\n \n\n\n \n\n\n$\n\n\n309\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPretax (loss) earnings from operations\n\n\n \n\n\n$\n\n\n(\n16\n\n\n)\n\n\n \n\n\n$\n\n\n16\n\n\n \n\n\n\n\n\n\nPretax loss on divestitures and sales of assets\n\n\n \n\n\n \n\n\n(\n24\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPretax (loss) earnings\n\n\n \n\n\n \n\n\n(\n40\n\n\n)\n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n\n\n\n\nIncome tax (benefit) expense\n\n\n \n\n\n \n\n\n(\n10\n\n\n)\n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\n(Loss) Earnings from discontinued operations, net of income tax\n   (benefit) expense\n\n\n \n\n\n$\n\n\n(\n30\n\n\n)\n\n\n \n\n\n$\n\n\n11\n\n\n \n\n\n\n\nCash flow information for the Company's discontinued operations is as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet cash provided by (used for) operating activities\n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n(\n32\n\n\n)\n\n\n\n\n\n\nAdditions to property, plant and equipment\n\n\n \n\n\n$\n\n\n(\n3\n\n\n)\n\n\n \n\n\n$\n\n\n(\n16\n\n\n)\n\n\n\n\n\n\nProceeds from divestitures and sales of assets\n\n\n \n\n\n \n\n\n372\n\n\n \n\n\n \n\n\n \n\n\n250\n\n\n \n\n\n\n\n\n\nNet cash provided by investing activities\n\n\n \n\n\n$\n\n\n369\n\n\n \n\n\n \n\n\n$\n\n\n234\n\n\n \n\n\n\n\nAssets and Liabilities Held for Sale\nAssets and liabilities held for sale at December 31, 2024 included certain nonoperating land. At December 31, 2023\n, assets and liabilities held for sale also included the South Texas cement plant, related cement distribution terminals, and \n20\n ready mixed concrete plants which were sold in February 2024.\n \nAssets and liabilities held for sale are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nInventories, net\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n61\n\n\n \n\n\n\n\n\n\nInvestment land\n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n\n\n\n\nOther assets\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n327\n\n\n \n\n\n\n\n\n\nIntangible assets, excluding goodwill\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n122\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n260\n\n\n \n\n\n\n\n\n\nTotal current assets held for sale\n\n\n \n\n\n$\n\n\n8\n\n\n \n\n\n \n\n\n$\n\n\n807\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLease obligations\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n(\n16\n\n\n)\n\n\n\n\n\n\nAsset retirement obligations\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n\n\n\n\nTotal current liabilities held for sale\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n(\n18\n\n\n)\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n81\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNote C: Goodwill and Other Intangible Assets\n \nThe following table shows the changes in goodwill by reportable segment and in total:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\nEast \nGroup\n\n\n \n\n\n \n\n\nWest \nGroup\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nBalance at beginning of period\n\n\n \n\n\n$\n\n\n764\n\n\n \n\n\n \n\n\n$\n\n\n2,625\n\n\n \n\n\n \n\n\n$\n\n\n3,389\n\n\n \n\n\n\n\n\n\nAcquisitions\n\n\n \n\n\n \n\n\n267\n\n\n \n\n\n \n\n\n \n\n\n111\n\n\n \n\n\n \n\n\n \n\n\n378\n\n\n \n\n\n\n\n\n\nBalance at end of period\n\n\n \n\n\n$\n\n\n1,031\n\n\n \n\n\n \n\n\n$\n\n\n2,736\n\n\n \n\n\n \n\n\n$\n\n\n3,767\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nBalance at beginning of period\n\n\n \n\n\n$\n\n\n764\n\n\n \n\n\n \n\n\n$\n\n\n2,885\n\n\n \n\n\n \n\n\n$\n\n\n3,649\n\n\n \n\n\n\n\n\n\nGoodwill allocated to assets held for sale\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n260\n\n\n)\n\n\n \n\n\n \n\n\n(\n260\n\n\n)\n\n\n\n\n\n\nBalance at end of period\n\n\n \n\n\n$\n\n\n764\n\n\n \n\n\n \n\n\n$\n\n\n2,625\n\n\n \n\n\n \n\n\n$\n\n\n3,389\n\n\n \n\n\n\n\nIntangible assets subject to amortization consist of the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\nGross \nAmount\n\n\n \n\n\n \n\n\nAccumulated \nAmortization\n\n\n \n\n\n \n\n\nNet \nBalance\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNoncompetition agreements\n\n\n \n\n\n$\n\n\n4\n\n\n \n\n\n \n\n\n$\n\n\n(\n4\n\n\n)\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nCustomer relationships\n\n\n \n\n\n \n\n\n462\n\n\n \n\n\n \n\n\n \n\n\n(\n101\n\n\n)\n\n\n \n\n\n \n\n\n361\n\n\n \n\n\n\n\n\n\nOperating permits\n\n\n \n\n\n \n\n\n370\n\n\n \n\n\n \n\n\n \n\n\n(\n62\n\n\n)\n\n\n \n\n\n \n\n\n308\n\n\n \n\n\n\n\n\n\nUse rights and other\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n17\n\n\n \n\n\n\n\n\n\nTrade names\n\n\n \n\n\n \n\n\n23\n\n\n \n\n\n \n\n\n \n\n\n(\n17\n\n\n)\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n889\n\n\n \n\n\n \n\n\n$\n\n\n(\n197\n\n\n)\n\n\n \n\n\n$\n\n\n692\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNoncompetition agreements\n\n\n \n\n\n$\n\n\n4\n\n\n \n\n\n \n\n\n$\n\n\n(\n4\n\n\n)\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nCustomer relationships\n\n\n \n\n\n \n\n\n421\n\n\n \n\n\n \n\n\n \n\n\n(\n80\n\n\n)\n\n\n \n\n\n \n\n\n341\n\n\n \n\n\n\n\n\n\nOperating permits\n\n\n \n\n\n \n\n\n369\n\n\n \n\n\n \n\n\n \n\n\n(\n56\n\n\n)\n\n\n \n\n\n \n\n\n313\n\n\n \n\n\n\n\n\n\nUse rights and other\n\n\n \n\n\n \n\n\n14\n\n\n \n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTrade names\n\n\n \n\n\n \n\n\n24\n\n\n \n\n\n \n\n\n \n\n\n(\n16\n\n\n)\n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n832\n\n\n \n\n\n \n\n\n$\n\n\n(\n168\n\n\n)\n\n\n \n\n\n$\n\n\n664\n\n\n \n\n\n\n\nIntangible assets deemed to have an indefinite life that are therefore not amortized consist of the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\nBuilding\nMaterials\nBusiness\n\n\n \n\n\n \n\n\nMagnesia\nSpecialties\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nOperating permits\n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n\n\n\n\nUse rights\n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nTrade names\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n36\n\n\n \n\n\n \n\n\n$\n\n\n2\n\n\n \n\n\n \n\n\n$\n\n\n38\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nOperating permits\n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n\n\n\n\nUse rights\n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n\n\n\n\nTrade names\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n32\n\n\n \n\n\n \n\n\n$\n\n\n2\n\n\n \n\n\n \n\n\n$\n\n\n34\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n82\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nIntangible assets acquired during 2024, of which $\n46\n million were from business combinations, are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions, except year data)\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nWeighted-average \namortization period\n\n\n\n\n\n\nSubject to amortization:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCustomer relationships\n\n\n \n\n\n$\n\n\n40\n\n\n \n\n\n \n\n\n11 years\n\n\n\n\n\n\nUse rights and other\n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n10 years\n\n\n\n\n\n\nPermits\n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n40 years\n\n\n\n\n\n\nTotal subject to amortization\n\n\n \n\n\n$\n\n\n57\n\n\n \n\n\n \n\n\n11 years\n\n\n\n\n\n\nNot subject to amortization:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUse rights and other\n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\nN/A\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n62\n\n\n \n\n\n \n\n\n \n\n\n\n\nAmortization expense for intangible assets for the years ended December 31, 2024, 2023 and 2022 was\n $\n29\n million, $\n28\n million and $\n27\n million\n, respectively.\nThe estimated amortization expense for intangible assets for each of the next five years and thereafter is as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n33\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n539\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n692\n\n\n \n\n\n\n\n\n\n \n\n\nNote D: Accounts Receivable, Net\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nCustomer receivables\n\n\n \n\n\n$\n\n\n678\n\n\n \n\n\n \n\n\n$\n\n\n747\n\n\n \n\n\n\n\n\n\nOther current receivables\n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n\n\n\n\nTotal accounts receivable\n\n\n \n\n\n \n\n\n686\n\n\n \n\n\n \n\n\n \n\n\n765\n\n\n \n\n\n\n\n\n\nLess: allowance for estimated credit losses\n\n\n \n\n\n \n\n\n(\n8\n\n\n)\n\n\n \n\n\n \n\n\n(\n12\n\n\n)\n\n\n\n\n\n\nAccounts receivable, net\n\n\n \n\n\n$\n\n\n678\n\n\n \n\n\n \n\n\n$\n\n\n753\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nNote E: Inventories, Net\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nFinished products\n\n\n \n\n\n$\n\n\n1,327\n\n\n \n\n\n \n\n\n$\n\n\n1,152\n\n\n \n\n\n\n\n\n\nProducts in process\n\n\n \n\n\n \n\n\n24\n\n\n \n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n\n\n\n\nRaw materials\n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n\n\n\n\nSupplies and expendable parts\n\n\n \n\n\n \n\n\n162\n\n\n \n\n\n \n\n\n \n\n\n155\n\n\n \n\n\n\n\n\n\nTotal inventories\n\n\n \n\n\n \n\n\n1,578\n\n\n \n\n\n \n\n\n \n\n\n1,392\n\n\n \n\n\n\n\n\n\nLess: allowances\n\n\n \n\n\n \n\n\n(\n463\n\n\n)\n\n\n \n\n\n \n\n\n(\n403\n\n\n)\n\n\n\n\n\n\nInventories, net\n\n\n \n\n\n$\n\n\n1,115\n\n\n \n\n\n \n\n\n$\n\n\n989\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n83\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNote F: Property, Plant and Equipment, Net\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nLand and land improvements\n\n\n \n\n\n$\n\n\n1,858\n\n\n \n\n\n \n\n\n$\n\n\n1,599\n\n\n \n\n\n\n\n\n\nMineral reserves and interests\n\n\n \n\n\n \n\n\n6,328\n\n\n \n\n\n \n\n\n \n\n\n2,982\n\n\n \n\n\n\n\n\n\nBuildings\n\n\n \n\n\n \n\n\n175\n\n\n \n\n\n \n\n\n \n\n\n160\n\n\n \n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n \n\n\n6,117\n\n\n \n\n\n \n\n\n \n\n\n5,380\n\n\n \n\n\n\n\n\n\nConstruction in progress\n\n\n \n\n\n \n\n\n313\n\n\n \n\n\n \n\n\n \n\n\n333\n\n\n \n\n\n\n\n\n\nFinance lease right-of-use assets\n\n\n \n\n\n \n\n\n295\n\n\n \n\n\n \n\n\n \n\n\n254\n\n\n \n\n\n\n\n\n\nTotal property, plant and equipment\n\n\n \n\n\n \n\n\n15,086\n\n\n \n\n\n \n\n\n \n\n\n10,708\n\n\n \n\n\n\n\n\n\nLess: accumulated depreciation, depletion and amortization\n\n\n \n\n\n \n\n\n(\n4,977\n\n\n)\n\n\n \n\n\n \n\n\n(\n4,522\n\n\n)\n\n\n\n\n\n\nProperty, plant and equipment, net\n\n\n \n\n\n$\n\n\n10,109\n\n\n \n\n\n \n\n\n$\n\n\n6,186\n\n\n \n\n\n\n\nDepreciation, depletion and amortization expense related to property, plant and equipment w\nas $\n540\n million, $\n480\n m\nillion and \n$\n473\n million \nfor the years ended December 31, 2024, 2023 and 2022, respectively. Depreciation, depletion and amortization expense includes amortization of right-of-use assets from finance leases.\n \n\n\nAt both December 31, 2024 and 2023,\n $\n40\n million\n of the Building Materials business’ property, plant and equipment, net, were located in The Bahamas and Canada.\n \n\n\nNote G: Debt\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n4.250\n% Senior Notes, due \n2024\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n400\n\n\n \n\n\n\n\n\n\n7\n% Debentures, due \n2025\n\n\n \n\n\n \n\n\n125\n\n\n \n\n\n \n\n\n \n\n\n125\n\n\n \n\n\n\n\n\n\n3.450\n% Senior Notes, due \n2027\n\n\n \n\n\n \n\n\n299\n\n\n \n\n\n \n\n\n \n\n\n299\n\n\n \n\n\n\n\n\n\n3.500\n% Senior Notes, due \n2027\n\n\n \n\n\n \n\n\n493\n\n\n \n\n\n \n\n\n \n\n\n492\n\n\n \n\n\n\n\n\n\n2.500\n% Senior Notes, due \n2030\n\n\n \n\n\n \n\n\n472\n\n\n \n\n\n \n\n\n \n\n\n472\n\n\n \n\n\n\n\n\n\n2.400\n% Senior Notes, due \n2031\n\n\n \n\n\n \n\n\n890\n\n\n \n\n\n \n\n\n \n\n\n890\n\n\n \n\n\n\n\n\n\n5.150\n% Senior Notes, due \n2034\n\n\n \n\n\n \n\n\n738\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n6.25\n% Senior Notes, due \n2037\n\n\n \n\n\n \n\n\n228\n\n\n \n\n\n \n\n\n \n\n\n228\n\n\n \n\n\n\n\n\n\n4.250\n% Senior Notes, due \n2047\n\n\n \n\n\n \n\n\n591\n\n\n \n\n\n \n\n\n \n\n\n590\n\n\n \n\n\n\n\n\n\n3.200\n% Senior Notes, due \n2051\n\n\n \n\n\n \n\n\n851\n\n\n \n\n\n \n\n\n \n\n\n850\n\n\n \n\n\n\n\n\n\n5.500\n% Senior Notes, due \n2054\n\n\n \n\n\n \n\n\n726\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n \n\n\n5,413\n\n\n \n\n\n \n\n\n \n\n\n4,346\n\n\n \n\n\n\n\n\n\nLess: current maturities\n\n\n \n\n\n \n\n\n(\n125\n\n\n)\n\n\n \n\n\n \n\n\n(\n400\n\n\n)\n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n$\n\n\n5,288\n\n\n \n\n\n \n\n\n$\n\n\n3,946\n\n\n \n\n\n\n\nOn July 2, 2024, the Company used available liquidity to repay the $\n400\n million of \n4.250\n% Senior Notes at maturity.\nOn November 4, 2024, the Company issued $\n750\n million aggregate principal amount of \n5.150\n% Senior Notes due \n2034\n (the 5.150% Senior Notes due 2034) and $\n750\n million aggregate principal amount of \n5.500\n% Senior Notes due \n2054 \n(the 5.500% Senior Notes due 2054) pursuant to a base indenture, dated as of May 22, 2017 (the Base Indenture), as amended and supplemented from time to time, including by the Fifth Supplemental Indenture, dated as of November 4, 2024, and, together with the Base Indenture (the Indenture) between the Company and Regions Bank, as trustee, governing these\n notes. On the consolidated balance sheets, the \n5.150\n% Senior Notes due \n2034 \nand \n5.500\n% Senior Notes due \n2054\n are carried net of original issue discount, which will be amortized using the effective interest method over the terms of the issues. \nA portion of the net proceeds of the 5.150% Senior Notes due 2034 and 5.500% Senior Notes due 2054 were used for the repayment of all borrowings outstanding under the Company’s short-term borrowing facilities. The remaining net proceeds were used for general corporate purposes, including acquisitions, land purchases and other capital needs.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n84\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nPrior to September 1, 2034, with respect to the \n5.150\n% Senior Notes due \n2034\n, and prior to June 1, 2054, with respect to the \n5.500\n% Senior Notes due \n2054\n (each, a Par Call Date), the Company may redeem the notes of a series, at its option, in whole or in part, at any time or from time to time, at a redemption price equal to the greater of: (i) (a) the sum of the present values of the remaining scheduled payments of principal and interest thereon discounted to the redemption date (assuming the notes of such series are scheduled to mature on the applicable Par Call Date) on a semi-annual basis at the applicable Treasury Rate (as defined in the Indenture) plus \n15\n basis points, in the case of the 5.150% Senior Notes due 2034, and \n20\n basis points, in the case of the 5.500% Senior Notes due 2054, less (b) interest accrued to, but excluding, the redemption date, and (ii) \n100\n% of the principal amount of the notes of the applicable series to be redeemed, plus, in either case, accrued and unpaid interest thereon to, but excluding, the redemption date. On or after the applicable Par Call Date and prior to maturity, the Company may redeem the note of a series, in whole or in part, at any time and from time to time, at a redemption price equal to \n100\n% of the principal amount of the notes of such series being redeemed plus accrued and unpaid interest thereon to, but excluding, the redemption date.\nThe Company’s \n7\n% Debentures due \n2025\n, \n3.450\n% Senior Notes due \n2027\n, \n3.500\n% Senior Notes due \n2027\n, \n2.500\n% Senior Notes due \n2030\n, \n2.400\n% Senior Notes due \n2031\n, \n5.150\n% Senior Notes due \n2034\n, \n6.25\n% Senior Notes due \n2037\n, \n4.250\n% Senior Notes due \n2047\n, \n3.200\n% Senior Notes due \n2051\n and \n5.500\n% Senior Notes due \n2054\n (collectively, the Senior Notes) are senior unsecured obligations of the Company, ranking equal in right of payment with the Company’s existing and future unsubordinated indebtedness. The Senior Notes, with the exception of the \n7\n% Debentures due \n2025\n and the \n6.25\n% Senior Notes due \n2037\n, are redeemable prior to their respective par call dates, as defined, at a make-whole redemption price, and at a price equal to \n100\n% of the principal amount after their respective par call dates and prior to their respective maturity dates. The \n6.25\n% Senior Notes due \n2037\n are redeemable in whole at any time or in part from time to time at a make-whole redemption price. Upon a change-of-control repurchase event and a resulting below-investment-grade credit rating, the Company would be required to make an offer to repurchase all outstanding Senior Notes, with the exception of the \n7\n% Debentures due \n2025\n, at a price in cash equal to \n101\n% of the principal amount of the Senior Notes, plus any accrued and unpaid interest.\nThe Senior Notes are carried net of original issue discount, which is being amortized by the effective interest method over the life of the issue. The principal amount as of December 31, 2024, effective interest rate and maturity date for the Senior Notes are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPrincipal\nAmount\n(in millions)\n\n\n \n\n\n \n\n\nEffective\nInterest\nRate\n\n\n \n\n\nMaturity Date\n\n\n\n\n\n\n7% Debentures\n\n\n \n\n\n$\n\n\n125\n\n\n \n\n\n \n\n\n7.05\n%\n\n\n \n\n\nDecember 1, 2025\n\n\n\n\n\n\n3.450% Senior Notes\n\n\n \n\n\n$\n\n\n300\n\n\n \n\n\n \n\n\n3.55\n%\n\n\n \n\n\nJune 1, 2027\n\n\n\n\n\n\n3.500% Senior Notes\n\n\n \n\n\n$\n\n\n495\n\n\n \n\n\n \n\n\n3.61\n%\n\n\n \n\n\nDecember 15, 2027\n\n\n\n\n\n\n2.500% Senior Notes\n\n\n \n\n\n$\n\n\n478\n\n\n \n\n\n \n\n\n2.71\n%\n\n\n \n\n\nMarch 15, 2030\n\n\n\n\n\n\n2.400% Senior Notes\n\n\n \n\n\n$\n\n\n896\n\n\n \n\n\n \n\n\n2.48\n%\n\n\n \n\n\nJuly 15, 2031\n\n\n\n\n\n\n5.150% Senior Notes\n\n\n \n\n\n$\n\n\n750\n\n\n \n\n\n \n\n\n5.33\n%\n\n\n \n\n\nDecember 1, 2034\n\n\n\n\n\n\n6.25% Senior Notes\n\n\n \n\n\n$\n\n\n230\n\n\n \n\n\n \n\n\n6.32\n%\n\n\n \n\n\nMay 1, 2037\n\n\n\n\n\n\n4.250% Senior Notes\n\n\n \n\n\n$\n\n\n598\n\n\n \n\n\n \n\n\n4.32\n%\n\n\n \n\n\nDecember 15, 2047\n\n\n\n\n\n\n3.200% Senior Notes\n\n\n \n\n\n$\n\n\n866\n\n\n \n\n\n \n\n\n3.29\n%\n\n\n \n\n\nJuly 15, 2051\n\n\n\n\n\n\n5.500% Senior Notes\n\n\n \n\n\n$\n\n\n750\n\n\n \n\n\n \n\n\n5.70\n%\n\n\n \n\n\nDecember 1, 2054\n\n\n\n\nThe Company has a credit agreement with JPMorgan Chase Bank, N.A., as Administrative Agent, Deutsche Bank Securities, Inc., PNC Bank, N.A., Truist Bank and Wells Fargo Bank, N.A., as Syndication Agents, and the lenders party thereto (the Credit Agreement), which provides for a $\n800\n million \nfive-year\n senior unsecured revolving facility (the Revolving Facility) with a maturity date of \nDecember 21, 2029\n. Borrowings under the Revolving Facility bear interest, at the Company’s option, at rates based upon the Secured Overnight Financing Rate (SOFR) or a base rate, plus, for each rate, a margin determined in accordance with a ratings-based pricing grid.\n Any outstanding principal amounts, together with interest accrued thereon, are due in full on that maturity date. There wer\ne \nno\n borrowings \noutstanding under the Revolving Facility as of December 31, 2024 and 2023. Available borrowings under the Revolving Facility are reduced by any outstanding letters of credit issued by the Company under the Revolving Facility. At December 31, 2024 and 2023, the Company had \n$\n3\n million of outstanding letters of credit issued and \n$\n797\n million available for borrowing under the Revolving Facility. The Company paid the bank group an upfront loan commitment fee that is being amortized over the life of the Revolving Facility. The Revolving Facility includes an annual facility fee.\nThe Credit Agreement requires the Company’s ratio of consolidated net debt-to-consolidated earnings before interest, taxes, depreciation, depletion and amortization, as defined, for the trailing-twelve months (the Ratio) to not exceed \n3.50\nx \nas of the end\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n85\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nof \nany fiscal quarter, provided that the Company may exclude from the Ratio any debt incurred in connection with certain acquisitions during the quarter or three preceding quarters so long as the Ratio calculated without such exclusion does not exceed \n4.00\nx. Additionally, if no amounts are outstanding un\nder the Revolving Facility or the Company's trade receivable securitization facility (discussed later), \nconsolidated debt, as defined, which includes debt for which the Company is a guarantor, shall be reduced in an amount equal to the lesser of $\n500\n million or the sum of the Company’s unrestricted cash and temporary investments, for purposes of the covenant calculation. The Company was in compliance with the Ratio at \nDecember 31, 2024.\nThe Company, through a wholly-owned special-purpose subsidiary, has a $\n400\n million trade receivable securitization facility (the Trade Receivable Facility). On September 18, 2024, the Company extended the maturity to\n September 17, 2025\n. The Trade Receivable Facility, with Truist Bank, Regions Bank, First-Citizens Bank & Trust Company, and certain other lenders that may become a party to the facility from time to time, is backed by eligible trade receivables, as defined. Borrowings are limited to the lesser of the facility limit or the borrowing base, as defined. These receivables are originated by the Company and then sold or contributed to the wholly-owned special-purpose subsidiary. The Company continues to be responsible for the servicing and administration of the receivables purchased by the wholly-owned special-purpose subsidiary. Borrowings under the Trade Receivable Facility bear interest at a rate equal to Adjusted Term Secured Overnight Financing Rate (Adjusted Term SOFR), as defined, plus \n0.8\n%. The Trade Receivable Facility contains a cross-default provision to the Company’s other debt agreements. Subject to certain conditions, including lenders providing the requisite commitments, the Trade Receivable Facility may be increased to a borrowing base not to exceed $\n500\n million. At \nDecember 31, 2024 and 2023\n, there were \nno\n borrowings outstanding under the Trade Receivable Facility.\nThe Company’s long-term debt maturities for each of the next five \nyears and thereafter are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n125\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n792\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n4,496\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n5,413\n\n\n \n\n\n\n\n\n\n\n\n \n\n\nNote H: Financial Instruments\n \nThe Company’s financial instruments include temporary cash investments, restricted cash, accounts receivable, accounts payable, publicly-registered long-term notes, debentures and other long-term debt.\n \nTemporary cash investments are placed primarily in money market funds, money market demand deposit accounts and Eurodollar time deposit accounts with financial institutions. The Company’s cash equivalents have maturities of less than three months. Due to the short maturity of these investments, they are carried on the consolidated balance sheets at cost, which approximates fair value.\n \nRestricted cash at December 31, 2023 was held in a trust account with a third-party intermediary. Due to the short-term nature of this account, the carrying value of restricted cash approximated its fair value.\nAccounts receivable are due from a large number of customers, primarily in the construction industry, and are dispersed across wide geographic and economic regions. However, accounts receivable are more heavily concentrated in certain states, namely Texas, North Carolina, Colorado, California, Georgia, Florida, Minnesota, Arizona, South Carolina and Iowa. The carrying values of accounts receivable approximate their fair values.\n \nAccounts payable represent amounts owed to suppliers and vendors. The estimated carrying value of accounts payable approximates its fair value due to the short-term nature of the payables.\n \n\n\nThe carrying value and fair value of the Company’s long-term debt were \n$\n5.4\n billion\n and $\n4.8\n billion, respectively, at \nDecember 31, 2024 and \n$\n4.3\n billion\n and $\n3.9\n billion, respectively, at \nDecember 31, 2023. The estimated fair value of the Company’s publicly-registered long-term debt was estimated based on Level 1 of the fair value hierarchy\n using quoted market prices.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n86\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNote I: Income Taxes\n \nThe components of the Company’s income tax expense from continuing operations are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nFederal income taxes:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent\n\n\n \n\n\n$\n\n\n565\n\n\n \n\n\n \n\n\n$\n\n\n264\n\n\n \n\n\n \n\n\n$\n\n\n175\n\n\n \n\n\n\n\n\n\nDeferred\n\n\n \n\n\n \n\n\n(\n41\n\n\n)\n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n\n\n\n\nTotal federal income taxes\n\n\n \n\n\n \n\n\n524\n\n\n \n\n\n \n\n\n \n\n\n253\n\n\n \n\n\n \n\n\n \n\n\n193\n\n\n \n\n\n\n\n\n\nState income taxes:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent\n\n\n \n\n\n \n\n\n80\n\n\n \n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n35\n\n\n \n\n\n\n\n\n\nDeferred\n\n\n \n\n\n \n\n\n(\n4\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nTotal state income taxes\n\n\n \n\n\n \n\n\n76\n\n\n \n\n\n \n\n\n \n\n\n40\n\n\n \n\n\n \n\n\n \n\n\n41\n\n\n \n\n\n\n\n\n\nTotal current foreign income taxes\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n$\n\n\n600\n\n\n \n\n\n \n\n\n$\n\n\n293\n\n\n \n\n\n \n\n\n$\n\n\n235\n\n\n \n\n\n\n\nThe Company generated foreign pretax earnings of \n$\n13\n million, earnings of \n$\n8\n million and a loss of \n$\n2\n million for the years ended December 31, 2024, 2023 and 2022, respectively.  Deferred foreign income tax expense is not material.\nThe Company’s effective income tax rate on continuing operations varied from the statutory United States income tax rate due to the following tax differences:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nStatutory income tax rate\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n\n\n\n\n(Reduction) increase resulting from:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEffect of statutory depletion\n\n\n \n\n\n \n\n\n(\n1.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.4\n\n\n)\n\n\n\n\n\n\nState income taxes, net of federal tax benefit\n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n\n\n\n\nGoodwill write-off for divestiture\n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n\n\n\n\nFederal tax credits\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n\n\n\n\nEquity investments in renewable energy tax credits, net\n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther items\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n \n\n\n23.1\n\n\n%\n\n\n \n\n\n \n\n\n19.6\n\n\n%\n\n\n \n\n\n \n\n\n21.5\n\n\n%\n\n\n\n\nThe higher 2024 effective income tax rate versus 2023 was driven by the impact of the February 2024 divestiture of the South Texas cement business and certain related ready mixed concrete operations, which included the write-off of certain nondeductible goodwill. The higher 2022 effective tax rate versus 2023 was primarily driven by the impact of the divestiture of the Colorado and Central Texas ready mixed concrete businesses.\nThe statutory depletion deduction for all years is calculated as a percentage of revenues, subject to certain limitations. Due to these limitations, changes in the sales volumes and pretax earnings may not proportionately affect the Company’s statutory depletion deduction and the corresponding impact on the effective income tax rate. However, the impact of the depletion deduction on the estimated effective tax rate is inversely affected by increases or decreases in pretax earnings.\nThe Company invests in renewable energy investment entities which qualify for tax credits and other tax benefits and are accounted for under the proportional amortization method. For the year ended December 31, 2024\n, amortization of these investments plus income recapture, which are included in the line item \nIncome tax expense\n \nin the consolidated statements of earnings, were $\n148\n million and $\n16\n million, respectively, and offset by $\n153\n million of tax credits and $\n17\n million of other tax benefits. For the year ended \nDecember 31, 2023\n, amortization plus income recapture of similar investments were $\n26\n million and $\n1\n million, respectively, offset by $\n24\n million of tax credits and $\n2\n million of other tax benefits. There was \nno\n investment amortization for the year ended December 31, 2022. As of \nDecember 31, 2024\n, the Company has committed to additional equity contributions of $\n44\n million for tax equity investments related to RETC projects. These amounts, which are expected to be paid in 2025, are recorded in the line item \nOther current liabilities\n on the consolidated balance sheet.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n87\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe Internal Revenue Service has provided certain disaster tax relief for North Carolina businesses affected by Hurricanes Debby and Helene, which allows the Company to defer estimated federal and certain state income, payroll and excise tax payments for the period from August 2024 through April 2025. The deferred obligation will be due May 1, 2025. The Company deferred income tax payments of $\n102\n million under this provision as of December 31, 2024.\nThe principal components of the Company’s deferred tax assets and liabilities are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\nDeferred Assets (Liabilities)\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nDeferred tax assets related to:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n$\n\n\n147\n\n\n \n\n\n \n\n\n$\n\n\n121\n\n\n \n\n\n\n\n\n\nValuation and other reserves\n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n34\n\n\n \n\n\n\n\n\n\nNet operating loss carryforwards\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss\n\n\n \n\n\n \n\n\n41\n\n\n \n\n\n \n\n\n \n\n\n54\n\n\n \n\n\n\n\n\n\nLease liabilities\n\n\n \n\n\n \n\n\n147\n\n\n \n\n\n \n\n\n \n\n\n142\n\n\n \n\n\n\n\n\n\nOther items, net\n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nGross deferred tax assets\n\n\n \n\n\n \n\n\n415\n\n\n \n\n\n \n\n\n \n\n\n358\n\n\n \n\n\n\n\n\n\nValuation allowance on deferred tax assets\n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n\n\n\n\nTotal net deferred tax assets\n\n\n \n\n\n \n\n\n413\n\n\n \n\n\n \n\n\n \n\n\n355\n\n\n \n\n\n\n\n\n\nDeferred tax liabilities related to:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n(\n1,158\n\n\n)\n\n\n \n\n\n \n\n\n(\n828\n\n\n)\n\n\n\n\n\n\nGoodwill and other intangibles\n\n\n \n\n\n \n\n\n(\n171\n\n\n)\n\n\n \n\n\n \n\n\n(\n168\n\n\n)\n\n\n\n\n\n\nRight-of-use assets\n\n\n \n\n\n \n\n\n(\n144\n\n\n)\n\n\n \n\n\n \n\n\n(\n142\n\n\n)\n\n\n\n\n\n\nPartnerships and joint ventures\n\n\n \n\n\n \n\n\n(\n47\n\n\n)\n\n\n \n\n\n \n\n\n(\n34\n\n\n)\n\n\n\n\n\n\nEmployee benefits\n\n\n \n\n\n \n\n\n(\n62\n\n\n)\n\n\n \n\n\n \n\n\n(\n57\n\n\n)\n\n\n\n\n\n\nTotal deferred tax liabilities\n\n\n \n\n\n \n\n\n(\n1,582\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,229\n\n\n)\n\n\n\n\n\n\nDeferred income taxes, net\n\n\n \n\n\n$\n\n\n(\n1,169\n\n\n)\n\n\n \n\n\n$\n\n\n(\n874\n\n\n)\n\n\n\n\nThe Company had immaterial gross domestic federal net operating loss (NOL) carryforwards at both December 31, 2024 and 2023. The Company had gross domestic state NOL carryforwards of \n$\n24\n million and \n$\n43\n million at December 31, 2024 and 2023\n, respectively. The domestic federal and state carryforwards have various expiration dates through \n2044\n.\n The Company also had immaterial domestic state tax credit carryforwards at December 31, 2024 and 2023\n, which have various expiration dates through \n2044\n.\nThe Company expects to reinvest the earnings from its wholly-owned Canadian and Bahamian subsidiaries indefinitely, and accordingly, has not provided deferred taxes on the subsidiaries’ undistributed net earnings or basis differences. The Company believes that the tax liability that would be incurred upon repatriation of the foreign earnings was immaterial at December 31, 2024 and 2023.\nThe Company’s unrecognized tax benefits are immaterial for the years ended December 31, 2024, 2023 and 2022. Unrecognized tax benefits are reversed as a discrete event if an examination of applicable tax returns is not initiated by a federal or state tax authority within the statute of limitations or upon effective settlement with federal or state tax authorities. Management believes its accrual for unrecognized tax benefits is sufficient to cover uncertain tax positions reviewed during audits by taxing authorities. The Company anticipates an immaterial decrease in its unrecognized tax benefits during the twelve months ending December 31, 2025, due to the expiration of the statutes of limitations for the 2021 tax year.\nThe Company’s tax years subject to federal, state or foreign examinations are \n2020\n through \n2024\n.\n\n\nNote J: Retirement and Other Benefit Plans\n \nDefined Benefit Retirement Plans.\n \nThe Company sponsors defined benefit retirement plans that cover substantially all employees. Defined retirement benefits for salaried employees are based on each employee’s years of service and average compensation for a specified period of time before retirement. Defined retirement benefits for hourly employees are generally stated amounts for specified periods of service.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n88\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe Company sponsors a Supplemental Excess Retirement Plan (SERP) that generally provides for the payment of retirement benefits in excess of allowable Internal Revenue Code limits. The SERP generally provides for a lump-sum payment of vested benefits. When these benefit payments exceed the sum of the service and interest costs for the SERP during a year, the Company recognizes a pro rata portion of the SERP’s unrecognized actuarial loss as settlement expense.\n \nThe net periodic benefit cost of defined benefit plans includes the following components:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nService cost\n\n\n \n\n\n$\n\n\n38\n\n\n \n\n\n \n\n\n$\n\n\n33\n\n\n \n\n\n \n\n\n$\n\n\n48\n\n\n \n\n\n\n\n\n\nInterest cost\n\n\n \n\n\n \n\n\n55\n\n\n \n\n\n \n\n\n \n\n\n51\n\n\n \n\n\n \n\n\n \n\n\n41\n\n\n \n\n\n\n\n\n\nExpected return on assets\n\n\n \n\n\n \n\n\n(\n79\n\n\n)\n\n\n \n\n\n \n\n\n(\n71\n\n\n)\n\n\n \n\n\n \n\n\n(\n77\n\n\n)\n\n\n\n\n\n\nAmortization of:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nActuarial loss\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nSettlement charge\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\nNet periodic benefit cost\n\n\n \n\n\n$\n\n\n22\n\n\n \n\n\n \n\n\n$\n\n\n20\n\n\n \n\n\n \n\n\n$\n\n\n25\n\n\n \n\n\n\n\nThe components of net periodic benefit cost, other than service cost, are included in the line item \nOther nonoperating income, net\n, in the consolidated statements of earnings. Based on the roles of the employees, service cost is included in \nCost of revenues \nor \nSelling\n, \ngeneral and administrative expenses\n line items in the consolidated statements of earnings.\nThe expected return on assets is calculated by applying an annually selected expected long-term rate of return assumption to the estimated fair value of the plan assets during the year, giving consideration to contributions and benefits paid.\nThe Company recognized the following pretax amounts in consolidated comprehensive earnings:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nActuarial (gain) loss\n\n\n \n\n\n$\n\n\n(\n44\n\n\n)\n\n\n \n\n\n$\n\n\n21\n\n\n \n\n\n \n\n\n$\n\n\n(\n115\n\n\n)\n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n48\n\n\n \n\n\n\n\n\n\nAmortization of:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n \n\n\n(\n6\n\n\n)\n\n\n \n\n\n \n\n\n(\n6\n\n\n)\n\n\n \n\n\n \n\n\n(\n4\n\n\n)\n\n\n\n\n\n\nActuarial loss\n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n \n\n\n \n\n\n(\n4\n\n\n)\n\n\n\n\n\n\nSettlement charge\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n5\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n(\n52\n\n\n)\n\n\n \n\n\n$\n\n\n14\n\n\n \n\n\n \n\n\n$\n\n\n(\n80\n\n\n)\n\n\n\n\nDuring 2022, the Company amended its qualified pension plan to provide an enhanced benefit for eligible hourly active participants who retire subsequent to April 30, 2022, which resulted in a remeasurement of the qualified pension plan as of February 28, 2022. The remeasurement increased the defined benefit plans’ unrecognized prior service cost by $\n48\n million.\nAccumulated other comprehensive loss includes the following amounts that have not yet been recognized in net periodic benefit cost:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\nGross\n\n\n \n\n\n \n\n\nNet of tax\n\n\n \n\n\n \n\n\nGross\n\n\n \n\n\n \n\n\nNet of tax\n\n\n \n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n$\n\n\n37\n\n\n \n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n \n\n\n$\n\n\n42\n\n\n \n\n\n \n\n\n$\n\n\n20\n\n\n \n\n\n\n\n\n\nActuarial loss\n\n\n \n\n\n \n\n\n17\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n64\n\n\n \n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n54\n\n\n \n\n\n \n\n\n$\n\n\n10\n\n\n \n\n\n \n\n\n$\n\n\n106\n\n\n \n\n\n \n\n\n$\n\n\n50\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n89\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe defined benefit plans’ change in projected benefit obligation is as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNet projected benefit obligation at beginning of year\n\n\n \n\n\n$\n\n\n970\n\n\n \n\n\n \n\n\n$\n\n\n858\n\n\n \n\n\n\n\n\n\nService cost\n\n\n \n\n\n \n\n\n38\n\n\n \n\n\n \n\n\n \n\n\n33\n\n\n \n\n\n\n\n\n\nInterest cost\n\n\n \n\n\n \n\n\n55\n\n\n \n\n\n \n\n\n \n\n\n51\n\n\n \n\n\n\n\n\n\nActuarial (gain) loss\n\n\n \n\n\n \n\n\n(\n46\n\n\n)\n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n\n\n\n\nGross benefits paid\n\n\n \n\n\n \n\n\n(\n50\n\n\n)\n\n\n \n\n\n \n\n\n(\n45\n\n\n)\n\n\n\n\n\n\nNet projected benefit obligation at end of year\n\n\n \n\n\n$\n\n\n967\n\n\n \n\n\n \n\n\n$\n\n\n970\n\n\n \n\n\n\n\nThe largest component of the actuarial gain in 2024 was the impact of the higher discount rate compared with 2023. The actuarial loss in 2023 was primarily attributable to a lower discount rate compared with 2022.\n \nThe Company’s change in plan assets, funded status and amounts recognized on the Company’s consolidated balance sheets are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nFair value of plan assets at beginning of year\n\n\n \n\n\n$\n\n\n1,177\n\n\n \n\n\n \n\n\n$\n\n\n1,067\n\n\n \n\n\n\n\n\n\nActual return on plan assets, net\n\n\n \n\n\n \n\n\n77\n\n\n \n\n\n \n\n\n \n\n\n123\n\n\n \n\n\n\n\n\n\nEmployer contributions\n\n\n \n\n\n \n\n\n34\n\n\n \n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n\n\n\n\nGross benefits paid\n\n\n \n\n\n \n\n\n(\n50\n\n\n)\n\n\n \n\n\n \n\n\n(\n45\n\n\n)\n\n\n\n\n\n\nFair value of plan assets at end of year\n\n\n \n\n\n$\n\n\n1,238\n\n\n \n\n\n \n\n\n$\n\n\n1,177\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nFunded status of the plan at end of year\n\n\n \n\n\n$\n\n\n271\n\n\n \n\n\n \n\n\n$\n\n\n207\n\n\n \n\n\n\n\n\n\nAccrued benefit credit\n\n\n \n\n\n$\n\n\n271\n\n\n \n\n\n \n\n\n$\n\n\n207\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAmounts recognized on consolidated balance sheets consist of:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNoncurrent asset\n\n\n \n\n\n$\n\n\n371\n\n\n \n\n\n \n\n\n$\n\n\n308\n\n\n \n\n\n\n\n\n\nCurrent liability\n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n(\n8\n\n\n)\n\n\n\n\n\n\nNoncurrent liability\n\n\n \n\n\n \n\n\n(\n87\n\n\n)\n\n\n \n\n\n \n\n\n(\n93\n\n\n)\n\n\n\n\n\n\nNet amount recognized at end of year\n\n\n \n\n\n$\n\n\n271\n\n\n \n\n\n \n\n\n$\n\n\n207\n\n\n \n\n\n\n\nThe accumulated benefit obligation for all defined benefit pension plans was \n$\n879\n million and \n$\n882\n million at December 31, 2024 and 2023, respectively.\n \nBenefit obligations and fair value of plan assets for pension plans with accumulated benefit obligations in excess of plan assets are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nProjected benefit obligation\n\n\n \n\n\n$\n\n\n100\n\n\n \n\n\n \n\n\n$\n\n\n101\n\n\n \n\n\n\n\n\n\nAccumulated benefit obligation\n\n\n \n\n\n$\n\n\n90\n\n\n \n\n\n \n\n\n$\n\n\n91\n\n\n \n\n\n\n\n\n\nFair value of plan assets\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n\n\nWeighted-average assumptions used to determine benefit obligations as of December 31 are:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n6.00\n%\n\n\n \n\n\n5.58\n%\n\n\n\n\n\n\nRate of increase in future compensation levels\n\n\n \n\n\n4.50\n%\n\n\n \n\n\n4.50\n%\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n90\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nWeighted-average assumptions used to determine net periodic benefit cost for the years ended December 31 are:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n5.58\n%\n\n\n \n\n\n5.88\n%\n\n\n \n\n\n3.44\n%\n\n\n\n\n\n\nRate of increase in future compensation levels\n\n\n \n\n\n4.50\n%\n\n\n \n\n\n4.50\n%\n\n\n \n\n\n4.50\n%\n\n\n\n\n\n\nExpected long-term rate of return on assets\n\n\n \n\n\n6.75\n%\n\n\n \n\n\n6.75\n%\n\n\n \n\n\n6.75\n%\n\n\n\n\nThe expected long-term rate of return on pension fund assets is based on the current asset class mix of the Company's pension plan assets, current capital market conditions and a stochastic forecast of future conditions.\nAs of December 31, 2024 and 2023, the Company estimated the remaining lives of participants in the pension plans using the Pri-2012 Base tables. The no-collar table was used for salaried participants and the blue-collar table was used for hourly participants; the tables were adjusted to reflect both the mortality experience of the Company’s participants and a geospatial mortality analysis. The Company used the MP-2020 mortality improvement scale for 2024 and 2023.\nRetirement plan assets are invested in listed stocks, bonds, real estate, private infrastructure and cash equivalents. \nThe target allocation for \n2024 and the actual pension plan asset allocation by asset class are as follows: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nPercentage of Plan Assets\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nTarget\n\n\n \n\n\nDecember 31\n\n\n\n\n\n\nAsset Class\n\n\n \n\n\nAllocation\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n\n\n\n\nEquity securities\n\n\n \n\n\n56\n%\n\n\n \n\n\n58\n%\n\n\n \n\n\n53\n%\n\n\n\n\n\n\nDebt securities\n\n\n \n\n\n28\n%\n\n\n \n\n\n22\n%\n\n\n \n\n\n27\n%\n\n\n\n\n\n\nReal estate\n\n\n \n\n\n10\n%\n\n\n \n\n\n10\n%\n\n\n \n\n\n12\n%\n\n\n\n\n\n\nPrivate infrastructure\n\n\n \n\n\n6\n%\n\n\n \n\n\n8\n%\n\n\n \n\n\n8\n%\n\n\n\n\n\n\nCash\n\n\n \n\n\n0\n%\n\n\n \n\n\n2\n%\n\n\n \n\n\n0\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n100\n%\n\n\n \n\n\n100\n%\n\n\n \n\n\n100\n%\n\n\n\n\nThe Company’s investment strategy is for equity securities to be invested in mid-sized to large capitalization U.S. funds, and small capitalization, international and emerging growth funds. Debt securities, or fixed income investments, are invested in funds benchmarked to the Barclays U.S. Aggregate Bond Index.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n91\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe fair values of pension plan assets by asset class and fair value hierarchy level are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nFair Value Measurements\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31\n\n\n \n\n\nQuoted Prices \nin Active \nMarkets \nfor Identical \nAssets \n(Level 1)\n\n\n \n\n\n \n\n\nSignificant \nObservable \nInputs \n(Level 2)\n\n\n \n\n\n \n\n\nSignificant \nUnobservable \nInputs \n(Level 3)\n\n\n \n\n\n \n\n\nNet Asset\nValue\n\n\n \n\n\n \n\n\nTotal Fair \nValue\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nEquity securities\n1\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nMid-sized to large cap\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n359\n\n\n \n\n\n \n\n\n$\n\n\n359\n\n\n \n\n\n\n\n\n\nSmall cap, international and emerging growth funds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n361\n\n\n \n\n\n \n\n\n \n\n\n361\n\n\n \n\n\n\n\n\n\nDebt securities\n1\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCore fixed income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n271\n\n\n \n\n\n \n\n\n \n\n\n271\n\n\n \n\n\n\n\n\n\nReal estate\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n130\n\n\n \n\n\n \n\n\n \n\n\n130\n\n\n \n\n\n\n\n\n\nPrivate infrastructure\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n96\n\n\n \n\n\n \n\n\n \n\n\n96\n\n\n \n\n\n\n\n\n\nCash equivalents\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n1,238\n\n\n \n\n\n \n\n\n$\n\n\n1,238\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nEquity securities\n1\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nMid-sized to large cap\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n307\n\n\n \n\n\n \n\n\n$\n\n\n307\n\n\n \n\n\n\n\n\n\nSmall cap, international and emerging growth funds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n320\n\n\n \n\n\n \n\n\n \n\n\n320\n\n\n \n\n\n\n\n\n\nDebt securities\n1\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCore fixed income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n319\n\n\n \n\n\n \n\n\n \n\n\n319\n\n\n \n\n\n\n\n\n\nReal estate\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n137\n\n\n \n\n\n \n\n\n \n\n\n137\n\n\n \n\n\n\n\n\n\nPrivate infrastructure\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n90\n\n\n \n\n\n \n\n\n \n\n\n90\n\n\n \n\n\n\n\n\n\nCash equivalents\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n1,177\n\n\n \n\n\n \n\n\n$\n\n\n1,177\n\n\n \n\n\n\n\n \n1.\nThese investments are common collective investment trusts valued using the net asset value (NAV) unit price provided by the fund administrator. The NAV is based on the value of the underlying assets owned by the fund. \nReal estate investments are stated at estimated fair value, which is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Real estate investments are valued at NAV based on the plan’s proportionate shares of the real estate funds’ fair value as recorded by the trustees/general partner of the funds. The funds are real estate investment trust based funds that offer participation in an actively managed, primarily core portfolio of equity real estate. The funds allocate gains, losses and expenses to investors based on the ownership percentage to determine the NAV. Private infrastructure assets represent investments in a fund that is stated at fair value. For financial assets in the fund that are actively traded in organized financial markets, fair value is based on exchange-quoted market prices. For investments in the fund for which there is no quoted market price, fair value is determined by the trustees/general partner of the fund based on discounted expected future cash flows prepared by third-party professionals.\n \nIn 2024 and 2023, the Company made combined pension plan and SERP contributions of \n$\n34\n million and \n$\n32\n million, respectively. The Company currently estimates that it will contribute \n$\n40\n million to its pension plans in 2025.\n \nThe expected benefit payments to be paid from plan assets for each of the next five years and the five-year period thereafter are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n59\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n$\n\n\n60\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n$\n\n\n63\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n$\n\n\n66\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n$\n\n\n65\n\n\n \n\n\n\n\n\n\nYears 2030 - 2034\n\n\n \n\n\n$\n\n\n353\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n92\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nPostretirement and Postemployment Benefits\n.\n The Company provides other postretirement benefits for certain employees, including medical benefits for retirees and their spouses and retiree life insurance. Employees starting on or after January 1, 2002 are not eligible for postretirement welfare plans. Postretirement medical benefits are paid from the Company's assets. The obligation, if any, for retiree medical payments is subject to the terms of the plan. At December 31, 2024 and 2023, the Company's recorded benefit obligation related to these benefits totaled \n$\n7\n million and \n$\n8\n million, respectively.\n \nThe Company also provides certain benefits, such as disability benefits, to former or inactive employees after employment but before retirement.\n \nDefined Contribution Plan\n.\n \nThe Company maintains a defined contribution plan that covers substantially all employees. This plan, qualified under Section \n401(a)\n of the Internal Revenue Code, is a retirement savings and investment plan for the Company’s salaried and hourly employees\n.\n Under certain provisions of the plan, the Company matches employees’ eligible contributions at established rates. The Company’s matching obligations were \n$\n22\n million in both 2024 and 2023, and \n$\n23\n million in \n2022\n.\n\n\nNote K: Stock-Based Compensation\n \nOn May 19, 2016, the Company’s shareholders approved the Martin Marietta Amended and Restated Stock-Based Award Plan. The Martin Marietta Materials, Inc. Stock-Based Award Plan, as amended from time to time, along with the Amended Omnibus Securities Award Plan, originally approved in 1994 (collectively, the Plans), are still effective for awards made prior to 2017. The Company has been authorized by the Board of Directors to repurchase shares of the Company’s common stock for issuance under the stock-based award plans (see Note M).\n \nThe Company grants restricted stock awards under the Plans to a group of executive officers, key personnel and nonemployee members of the Board of Directors. The vesting of certain restricted stock awards is based on certain performance criteria over a specified period of time. The number of shares may be increased to the maximum or reduced to the minimum threshold based on the results of those criteria. In addition, certain awards are granted to individuals to encourage retention and motivate key employees. These awards generally vest if the employee is continuously employed over a specified period of time and require no payment from the employee. Awards granted to nonemployee members of the Board of Directors vest immediately.\n \nThe fair value of stock-based award grants is expensed over the vesting period. Awards to employees eligible for retirement prior to the award becoming fully vested are expensed over the period through the date that the employee first becomes eligible to retire and is no longer required to provide service to earn the award. Awards granted to nonemployee members of the Board of Directors are expensed immediately.\nAdditionally, an incentive compensation stock plan has been adopted under the Plans whereby certain participants may elect to use up to \n50\n% of their annual incentive compensation to acquire units representing shares of the Company’s common stock at a \n20\n% discount to the market value on the date of the incentive compensation award. Participants receive unrestricted shares of common stock in an amount equal to their respective units generally at the end of a 34-month period of additional employment from the date of award or at retirement beginning at age 62. All rights of ownership of the common stock convey to the participants upon the issuance of their respective shares at the end of the ownership-vesting period.\n \nThe following table summarizes information for restricted stock awards and incentive compensation stock awards for \n2024:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nRestricted Stock - \nService Based\n\n\n \n\n\n \n\n\nRestricted Stock - \nPerformance Based\n\n\n \n\n\n \n\n\nIncentive Compensation Stock\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nNumber of \nAwards\n\n\n \n\n\n \n\n\nWeighted-\nAverage \nGrant-Date \nFair Value\n\n\n \n\n\n \n\n\nNumber of \nAwards\n\n\n \n\n\n \n\n\nWeighted-\nAverage \nGrant-Date \nFair Value\n\n\n \n\n\n \n\n\nNumber of \nAwards\n\n\n \n\n\n \n\n\nWeighted-\nAverage \nGrant-Date \nFair Value\n\n\n \n\n\n\n\n\n\nJanuary 1, 2024\n\n\n \n\n\n \n\n\n210,643\n\n\n \n\n\n \n\n\n$\n\n\n289.26\n\n\n \n\n\n \n\n\n \n\n\n98,150\n\n\n \n\n\n \n\n\n$\n\n\n384.02\n\n\n \n\n\n \n\n\n \n\n\n17,326\n\n\n \n\n\n \n\n\n$\n\n\n364.09\n\n\n \n\n\n\n\n\n\nAwarded\n\n\n \n\n\n \n\n\n46,323\n\n\n \n\n\n \n\n\n$\n\n\n553.17\n\n\n \n\n\n \n\n\n \n\n\n29,746\n\n\n \n\n\n \n\n\n$\n\n\n595.00\n\n\n \n\n\n \n\n\n \n\n\n11,543\n\n\n \n\n\n \n\n\n$\n\n\n548.68\n\n\n \n\n\n\n\n\n\nDistributed\n\n\n \n\n\n \n\n\n(\n60,143\n\n\n)\n\n\n \n\n\n$\n\n\n307.63\n\n\n \n\n\n \n\n\n \n\n\n(\n81,439\n\n\n)\n\n\n \n\n\n$\n\n\n352.52\n\n\n \n\n\n \n\n\n \n\n\n(\n12,760\n\n\n)\n\n\n \n\n\n$\n\n\n389.15\n\n\n \n\n\n\n\n\n\nForfeited\n\n\n \n\n\n \n\n\n(\n5,289\n\n\n)\n\n\n \n\n\n$\n\n\n389.70\n\n\n \n\n\n \n\n\n \n\n\n(\n5,490\n\n\n)\n\n\n \n\n\n$\n\n\n443.71\n\n\n \n\n\n \n\n\n \n\n\n(\n566\n\n\n)\n\n\n \n\n\n$\n\n\n400.15\n\n\n \n\n\n\n\n\n\nAdjustment for performance\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n47,537\n\n\n \n\n\n \n\n\n$\n\n\n362.60\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n191,534\n\n\n \n\n\n \n\n\n$\n\n\n370.27\n\n\n \n\n\n \n\n\n \n\n\n88,504\n\n\n \n\n\n \n\n\n$\n\n\n468.71\n\n\n \n\n\n \n\n\n \n\n\n15,543\n\n\n \n\n\n \n\n\n$\n\n\n497.76\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n93\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe weighted-average grant-date fair value per share of service-based restricted stock awards granted during 2024, 2023 and 2022 was \n$\n553.17\n, \n$\n369.18\n and \n$\n362.77\n, respectively. The weighted-average grant-date fair value per share of performance-based restricted stock awards granted during 2024, 2023 and 2022 was \n$\n595.00\n, \n$\n392.73\n and \n$\n406.99\n, respectively. The weighted-average grant-date fair value per share of incentive compensation stock awards granted during 2024, 2023 and 2022 was \n$\n548.68\n, \n$\n362.08\n and \n$\n369.05\n, respectively.\nThe aggregate intrinsic values for unvested service-based and performance-based restricted stock awards of \n$\n145\n million and unvested incentive compensation stock awards of \n$\n2\n million at December 31, 2024 were based on the closing price of the Company’s common stock at December 31, 2024, which was \n$\n516.50\n. The aggregate intrinsic values of service-based and performance-based restricted stock awards distributed during the years ended December 31, 2024, 2023 and 2022 were \n$\n76\n million, \n$\n48\n million and \n$\n65\n million, respectively. The aggregate intrinsic values of incentive compensation stock awards distributed during the years ended December 31, 2024, 2023 and 2022 were \n$\n4\n million, \n$\n4\n million and \n$\n3\n million, respectively. The aggregate intrinsic values for distributed awards were based on the closing prices of the Company’s common stock on the dates of distribution.\n \nPrior to 2016, under the Plans, the Company granted options to employees to purchase its common stock at a price equal to the closing market value at the date of grant. Options become exercisable in four annual installments beginning one year after date of grant. Outstanding options expire \nten years\n after the grant date.\nThe following table includes summary information for stock options as of \nDecember 31, 2024:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNumber of\nOptions\n\n\n \n\n\n \n\n\nWeighted-\nAverage \nExercise \nPrice\n\n\n \n\n\n \n\n\nWeighted-\nAverage\nRemaining\nContractual Life\n(years)\n\n\n \n\n\n\n\n\n\nOutstanding at January 1, 2024\n\n\n \n\n\n \n\n\n6,103\n\n\n \n\n\n \n\n\n$\n\n\n144.14\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nExercised\n\n\n \n\n\n \n\n\n(\n2,480\n\n\n)\n\n\n \n\n\n$\n\n\n128.89\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding at December 31, 2024\n\n\n \n\n\n \n\n\n3,623\n\n\n \n\n\n \n\n\n$\n\n\n154.58\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nExercisable at December 31, 2024\n\n\n \n\n\n \n\n\n3,623\n\n\n \n\n\n \n\n\n$\n\n\n154.58\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\nThe aggregate intrinsic values of options exercised during each of the three years ended December 31, 2024, 2023 and 2022 were immaterial. The aggregate intrinsic values for options outstanding and exercisable at December 31, 2024 were immaterial and were based on the closing price of the Company’s common stock at December 31, 2024, which was \n$\n516.50\n.\nAt December 31, 2024, there were approximately\n \n0.3\n million\n awards available for grant under the Plans. In 2016, the Company’s shareholders approved the issuance of an additional \n0.8\n million shares of common stock under the Plans.\nIn 1996, the Company adopted the Shareholder Value Achievement Plan to award shares of the Company’s common stock to key senior employees based on certain common stock performance criteria over a long-term period. As of December 31, 2024,\n \n0.2\n million shares of common stock remain reserved for issuance. \nNo\n awards have been granted under this plan since 2000.\n \nThe Company adopted and the shareholders approved the Common Stock Purchase Plan for Directors in 1996, which provides nonemployee members of the Board of Directors the election to receive all or a portion of their total fees in the form of the Company’s common stock. Beginning in 2016, members of the Board of Directors were not required to defer any of their fees in the form of the Company’s common stock. Under the terms of this plan, \n0.3\n million shares of common stock were reserved for issuance. Nonemployee members of the Board of Directors elected to defer portions of their fees representing \n834\n,\n \n1,333\n and \n1,767\n shares of the Company’s common stock under this plan during \n2024, 2023 and 2022, respectively.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n94\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe following table summarizes stock-based compensation expense for the years ended \nDecember 31, 2024, 2023 and 2022, unrecognized compensation cost for nonvested awards at December 31, 2024 and the weighted-average period over which unrecognized compensation cost will be recognized:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions, except year data)\n\n\n \n\n\nRestricted \nStock\n(Service- and Performance-Based)\n\n\n \n\n\n \n\n\nIncentive\nCompensation\nStock\n\n\n \n\n\n \n\n\nDirectors’\nFees Paid in Stock\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nStock-based compensation expense recognized for \n   years ended December 31:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n$\n\n\n56\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n58\n\n\n \n\n\n\n\n\n\n2023\n\n\n \n\n\n$\n\n\n49\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n50\n\n\n \n\n\n\n\n\n\n2022\n\n\n \n\n\n$\n\n\n41\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n43\n\n\n \n\n\n\n\n\n\nUnrecognized compensation cost at \n   December 31, 2024\n\n\n \n\n\n$\n\n\n28\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n29\n\n\n \n\n\n\n\n\n\nWeighted-average period over which unrecognized \n   compensation cost will be recognized\n\n\n \n\n\n1.9\n years\n\n\n \n\n\n \n\n\n1.8\n years\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\nTotal tax benefits related to stock-based compensation expense were \n$\n9\n million, \n$\n9\n million and \n$\n8\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe following presents expected stock-based compensation expense in future periods for outstanding awards as of \nDecember 31, 2024:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n19\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n$\n\n\n8\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n29\n\n\n \n\n\n\n\nStock-based compensation expense is primarily included in \nSelling, general and administrative expenses\n in the Company’s consolidated statements of earnings.\n \n\n\nNote L: Leases\n \nThe Company has leases, primarily for equipment, railcars, fleet vehicles, office space, land, information technology equipment and software. The Company’s leases have remaining lease term\ns, inclusive of options to renew that the Company is reasonably certain to exercise, ranging from less than \none year\n to \n46 years\n. Some of the Company's leases include \noptions to terminate the leases within one year\n.\n \nCertain of the Company’s lease agreements include payments based upon variable rates, including, but not limited to, hours used, tonnage processed and factors related to indices. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\n \nThe components of lease cost are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nOperating lease cost\n\n\n \n\n\n$\n\n\n76\n\n\n \n\n\n \n\n\n$\n\n\n77\n\n\n \n\n\n \n\n\n$\n\n\n73\n\n\n \n\n\n\n\n\n\nFinance lease cost:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of right-of-use assets\n\n\n \n\n\n \n\n\n26\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n\n\n\n\nInterest on lease liabilities\n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n\n\n\n\nVariable lease cost\n\n\n \n\n\n \n\n\n14\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n17\n\n\n \n\n\n\n\n\n\nShort-term lease cost\n\n\n \n\n\n \n\n\n46\n\n\n \n\n\n \n\n\n \n\n\n46\n\n\n \n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n\n\n\n\nTotal lease cost\n\n\n \n\n\n$\n\n\n168\n\n\n \n\n\n \n\n\n$\n\n\n167\n\n\n \n\n\n \n\n\n$\n\n\n157\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n95\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe Company has royalty agreements that are prescriptively excluded from the scope of ASC 842 and generally require royalty payments based on tons produced, tons sold or total sales dollars and also contain minimum payments. Royalty expense was \n$\n92\n million, \n$\n86\n million and \n$\n78\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe balance sheet classifications of operating and finance leases are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31 \n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nOperating leases:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n \n\n\n$\n\n\n376\n\n\n \n\n\n \n\n\n$\n\n\n372\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent operating lease liabilities\n\n\n \n\n\n$\n\n\n56\n\n\n \n\n\n \n\n\n$\n\n\n53\n\n\n \n\n\n\n\n\n\nNoncurrent operating lease liabilities\n\n\n \n\n\n \n\n\n335\n\n\n \n\n\n \n\n\n \n\n\n327\n\n\n \n\n\n\n\n\n\nTotal operating lease liabilities\n\n\n \n\n\n$\n\n\n391\n\n\n \n\n\n \n\n\n$\n\n\n380\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFinance leases:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n$\n\n\n295\n\n\n \n\n\n \n\n\n$\n\n\n254\n\n\n \n\n\n\n\n\n\nAccumulated depreciation\n\n\n \n\n\n \n\n\n(\n83\n\n\n)\n\n\n \n\n\n \n\n\n(\n59\n\n\n)\n\n\n\n\n\n\nProperty, plant and equipment, net\n\n\n \n\n\n$\n\n\n212\n\n\n \n\n\n \n\n\n$\n\n\n195\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther current liabilities\n\n\n \n\n\n$\n\n\n19\n\n\n \n\n\n \n\n\n$\n\n\n20\n\n\n \n\n\n\n\n\n\nOther noncurrent liabilities\n\n\n \n\n\n \n\n\n202\n\n\n \n\n\n \n\n\n \n\n\n180\n\n\n \n\n\n\n\n\n\nTotal finance lease liabilities\n\n\n \n\n\n$\n\n\n221\n\n\n \n\n\n \n\n\n$\n\n\n200\n\n\n \n\n\n\n\nThe incremental borrowing rate ranged fro\nm \n0.4\n% to \n6.0\n% \nfor the years ended December 31, 2024 and 2023.\n \nWeighted-average remaining lease terms and discount rates are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n\n\n\n\nWeighted-average remaining lease terms (years):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Operating leases\n\n\n11.0\n\n\n11.7\n\n\n\n\n\n\n   Finance leases\n\n\n18.1\n\n\n18.3\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted-average discount rates:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Operating leases\n\n\n4.6\n%\n\n\n4.3\n%\n\n\n\n\n\n\n   Finance leases\n\n\n3.3\n%\n\n\n2.6\n%\n\n\n\n\nFuture lease payments as of \nDecember 31, 2024 are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nOperating\n\n\n \n\n\n \n\n\nFinance\n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\nLeases\n\n\n \n\n\n \n\n\nLeases\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n72\n\n\n \n\n\n \n\n\n$\n\n\n26\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n19\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n53\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n38\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n234\n\n\n \n\n\n \n\n\n \n\n\n202\n\n\n \n\n\n\n\n\n\nTotal lease payments\n\n\n \n\n\n \n\n\n505\n\n\n \n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n\n\n\n\nLess: imputed interest\n\n\n \n\n\n \n\n\n(\n114\n\n\n)\n\n\n \n\n\n \n\n\n(\n75\n\n\n)\n\n\n\n\n\n\nPresent value of lease payments\n\n\n \n\n\n \n\n\n391\n\n\n \n\n\n \n\n\n \n\n\n221\n\n\n \n\n\n\n\n\n\nLess: current lease obligations\n\n\n \n\n\n \n\n\n(\n56\n\n\n)\n\n\n \n\n\n \n\n\n(\n19\n\n\n)\n\n\n\n\n\n\nTotal long-term lease obligations\n\n\n \n\n\n$\n\n\n335\n\n\n \n\n\n \n\n\n$\n\n\n202\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n96\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nNote M: Shareholders’ Equity\n \nThe authorized capital structure of the Company includes \n100\n million shares of common stock, with a par value of $\n0.01\n per share. At \nDecember 31, 2024\n, approximately \n1.0\n million common shares were reserved for issuance under stock-based award plans.\nPursuant to authority granted by its Board of Directors, the Company can repurchase up to \n20\n million shares of common stock. During \n2024, the Company repurchased \n0.8\n million\n shares of common stock. During each of 2023 and 2022, the Company repurchased \n0.4\n million\n shares of common stock. Future share repurchases are at the discretion of management. At December 31, 2024, \n11.9\n million\n shares of common stock were remaining under the Company’s repurchase authorization.\n\n\nNote N: Commitments and Contingencies\n \nLegal and Administrative Proceedings. \nThe Company is engaged in certain legal and administrative proceedings incidental to its normal business activities. In the opinion of management and counsel, based upon currently available facts, the likelihood is remote that the ultimate outcome of any litigation and other proceedings, including those pertaining to environmental matters (see Note A), relating to the Company and its subsidiaries, will have a material adverse effect on the overall results of the Company’s operations, its cash flows or its financial position.\n \nAsset Retirement Obligations. \nThe Company incurs reclamation and teardown costs as part of its mining and production processes. Estimated future obligations are discounted to their present value and accreted to their projected future obligations via charges to operating expenses. Additionally, the fixed assets recorded concurrently with the liabilities are depreciated over the period until retirement activities are expected to occur. Total accretion and depreciation expenses for 2024, 2023 and 2022 were \n$\n28\n million, \n$\n17\n million and \n$\n16\n million, respectively, and are included in \nOther\n \noperating income, net\n, in the consolidated statements of earnings.\n \nThe following shows the changes in asset retirement obligations:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nBalance at beginning of year\n\n\n \n\n\n$\n\n\n400\n\n\n \n\n\n \n\n\n$\n\n\n380\n\n\n \n\n\n \n\n\n$\n\n\n307\n\n\n \n\n\n\n\n\n\nAccretion expense\n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n\n\n\n\nLiabilities incurred and liabilities assumed in business combinations\n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n \n\n\n \n\n\n34\n\n\n \n\n\n \n\n\n \n\n\n79\n\n\n \n\n\n\n\n\n\nLiabilities settled\n\n\n \n\n\n \n\n\n(\n2\n\n\n)\n\n\n \n\n\n \n\n\n(\n28\n\n\n)\n\n\n \n\n\n \n\n\n(\n14\n\n\n)\n\n\n\n\n\n\nRevisions in estimated cash flows\n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n\n\n\n\nLiabilities reclassified from assets held for sale\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nBalance at end of year\n\n\n \n\n\n$\n\n\n432\n\n\n \n\n\n \n\n\n$\n\n\n400\n\n\n \n\n\n \n\n\n$\n\n\n380\n\n\n \n\n\n\n\nOther Environmental Matters\n. \nThe Company’s operations are subject to and affected by federal, state and local laws and regulations relating to the environment, health and safety, and other regulatory matters. Certain of the Company’s operations may, from time to time, involve the use of substances that are classified as toxic or hazardous within the meaning of these laws and regulations. Environmental operating permits are, or may be, required for certain of the Company’s operations, and such permits are subject to modification, renewal and revocation. The Company regularly monitors and reviews its operations, procedures and policies for compliance with these laws and regulations. Despite these compliance efforts, risk of environmental remediation liability is inherent in the operation of the Company’s businesses, as it is with other companies engaged in similar businesses. The Company has no material provisions for environmental remediation liabilities and does not believe such liabilities will have a material adverse effect on the Company in the future.\n \nInsurance Reserves.\n \nAt December 31, 2024 and 2023, reserves of \n$\n53\n million and \n$\n47\n million, respectively, were recorded for insurance claims.\nLetters of Credit.\n \nIn the normal course of business, the Company provides certain third parties with standby letter of credit agreements guaranteeing its payment for certain insurance claims, contract performance and permit requirements. At December 31, 2024, the Company was contingently liable for \n$\n37\n million in letters of credit.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n97\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nSurety Bonds.\n \nAt December 31, 2024, the Company was contingently liable for \n$\n818\n million in surety bonds required by certain states and municipalities and their related agencies. The bonds are provided in the normal course of business and are principally for certain insurance claims, construction contracts, reclamation obligations and mining permits guaranteeing the Company’s own performance. The Company has indemnified the underwriting insurance company against any exposure under the surety bonds. In the Company’s past experience, no material claims have been made against these financial instruments.\nPurchase Commitments. \nThe Company had purchase commitments for property, plant and equipment of \n$\n162\n million as of December 31, 2024. The Company also had other purchase obligations related to energy and service contracts of \n$\n158\n million as of December 31, 2024\n. \nThe Company’s contractual purchase commitments as of \nDecember 31, 2024 are as follows: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n215\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n15\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n320\n\n\n \n\n\n\n\nCapital expenditures in 2024, 2023 and 2022 that were purchase commitments as of the prior year end were \n$\n139\n million, \n$\n111\n million and \n$\n90\n million, respectively.\nContracts of Affreightment and Royalty Commitments. \nFuture minimum contracts of affreightment and royalty commitments for all noncancelable agreements that are not accounted for as leases on the Company’s consolidated balance sheet as of \nDecember 31, 2024 are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in millions)\n\n\n \n\n\nContracts of Affreightment\n\n\n \n\n\n \n\n\nRoyalty\nCommitments\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n17\n\n\n \n\n\n \n\n\n$\n\n\n27\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n17\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n86\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n52\n\n\n \n\n\n \n\n\n$\n\n\n165\n\n\n \n\n\n\n\n\n\nEmployees.\n Approximately \n13\n%\n \nof the Company’s employees are represented by a labor union. All such employees are hourly employees. The Company maintains collective bargaining agreements relating to the union employees within the Building Materials business and Magnesia Specialties segment. All of the hourly employees of the Magnesia Specialties segment, located in Manistee, Michigan, and Woodville, Ohio, are represented by labor unions. The Woodville collective bargaining agreement expires in\n June 2026\n. The Manistee collective bargaining agreement expires in \nAugust 2027\n.\n \n\n\nNote O: Segments\n \nAs of December 31, 2024\n, the Building Materials business is comprised of \nfour\n divisions that represent individual operating segments. These operating segments are consolidated into \ntwo\n reportable segments, the East Group and the West Group, for financial reporting purposes, as they meet the aggregation criteria. The Magnesia Specialties business represents an individual operating and reportable segment. The accounting policies used for segment reporting are the same as those described in Note A.\nThe Company’s Chief Operating Decision Maker (CODM) is the \nChair, President and Chief Executive Officer\n. The CODM reviews results by reportable segment on a quarterly basis and allocates resources to achieve the Company’s strategic objectives based on an evaluation of each reportable segment’s performance. This evaluation is largely based on segment earnings from operations, as management believes this is the best metric of segment profitability and operating performance. Segment earnings from operations is also a measure in the determination of incentive compensation targets and awards\n.\n Segment \nearnings from operations include revenues less cost of revenues; selling, general and administrative expenses; other operating income and expenses, net; and exclude interest income and expense; other nonoperating income and expenses, net; and income tax expense. \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n98\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nThe \nsignificant expense categories shown below align with the segment-level information regularly provided to the CODM.\n Other costs of revenues for each reportable segment include mainly repairs and maintenance, contract services, supplies and royalties.\n \nCorporate loss from operations primarily includes depreciation and amortization; expenses for corporate administrative functions; acquisition, divestiture and integration expenses; and other nonrecurring income and expenses not attributable to operations of the Company's other operating segments.\n \nThe following tables display selected financial data for the Company’s reportable segments. Revenues, as presented on the consolidated statements of earnings, reflect the elimination of intersegment revenues, which represent sales from one segment to another segment and are immaterial. Revenues and earnings (loss) from operations reflect continuing operations only\n. Income tax expense is not allocated to the Company's reportable segments.\nEarnings from operations for the West Group included \na $\n1.3\n billion gain and $\n16\n million of transaction expenses in 2024 and $\n6\n million of transaction expenses in 2023 on the divestiture of the South Texas cement business and certain of its related ready mixed concrete operations (see Note B); a noncash asset and portfolio rationalization charge of $\n50\n million (see Note R) in 2024; and a \nnonrecurring gain on divestiture of $\n152\n million in 2022.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyear ended December 31, 2024\n(in millions)\n\n\n \n\n\nEast Group\n\n\n \n\n\n \n\n\nWest Group\n\n\n \n\n\n \n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\nTotal Reportable Segments\n\n\n \n\n\n \n\n\nCorporate\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nSegment Revenues\n\n\n \n\n\n$\n\n\n2,941\n\n\n \n\n\n \n\n\n$\n\n\n3,275\n\n\n \n\n\n \n\n\n$\n\n\n320\n\n\n \n\n\n \n\n\n$\n\n\n6,536\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n6,536\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLabor and benefits expense\n\n\n \n\n\n \n\n\n391\n\n\n \n\n\n \n\n\n \n\n\n402\n\n\n \n\n\n \n\n\n \n\n\n39\n\n\n \n\n\n \n\n\n \n\n\n832\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n833\n\n\n \n\n\n\n\n\n\nRaw materials expense\n\n\n \n\n\n \n\n\n96\n\n\n \n\n\n \n\n\n \n\n\n466\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n580\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n580\n\n\n \n\n\n\n\n\n\nDepreciation, depletion and amortization expense\n\n\n \n\n\n \n\n\n259\n\n\n \n\n\n \n\n\n \n\n\n254\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n \n\n\n \n\n\n \n\n\n528\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n531\n\n\n \n\n\n\n\n\n\nEnergy expense\n\n\n \n\n\n \n\n\n145\n\n\n \n\n\n \n\n\n \n\n\n147\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n323\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n323\n\n\n \n\n\n\n\n\n\nExternal freight expense\n\n\n \n\n\n \n\n\n108\n\n\n \n\n\n \n\n\n \n\n\n220\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n359\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n359\n\n\n \n\n\n\n\n\n\nOther costs of revenues\n\n\n \n\n\n \n\n\n905\n\n\n \n\n\n \n\n\n \n\n\n1,013\n\n\n \n\n\n \n\n\n \n\n\n79\n\n\n \n\n\n \n\n\n \n\n\n1,997\n\n\n \n\n\n \n\n\n \n\n\n35\n\n\n \n\n\n \n\n\n \n\n\n2,032\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n139\n\n\n \n\n\n \n\n\n \n\n\n187\n\n\n \n\n\n \n\n\n \n\n\n20\n\n\n \n\n\n \n\n\n \n\n\n346\n\n\n \n\n\n \n\n\n \n\n\n101\n\n\n \n\n\n \n\n\n \n\n\n447\n\n\n \n\n\n\n\n\n\nAcquisition, divestiture and integration expenses\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n34\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n\n\n\n\nOther operating expense (income), net\n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n \n\n\n \n\n\n(\n1,307\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,303\n\n\n)\n\n\n \n\n\n \n\n\n(\n23\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,326\n\n\n)\n\n\n\n\n\n\nSegment Earnings (Loss) from Operations\n\n\n \n\n\n$\n\n\n891\n\n\n \n\n\n \n\n\n$\n\n\n1,877\n\n\n \n\n\n \n\n\n$\n\n\n90\n\n\n \n\n\n \n\n\n$\n\n\n2,858\n\n\n \n\n\n \n\n\n$\n\n\n(\n151\n\n\n)\n\n\n \n\n\n$\n\n\n2,707\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n169\n\n\n \n\n\n\n\n\n\nOther nonoperating income, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n58\n\n\n)\n\n\n\n\n\n\nConsolidated earnings from continuing operations\n    before income tax expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,596\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyear ended December 31, 2023\n(in millions)\n\n\n \n\n\nEast Group\n\n\n \n\n\n \n\n\nWest Group\n\n\n \n\n\n \n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\nTotal Reportable Segments\n\n\n \n\n\n \n\n\nCorporate\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nSegment Revenues\n\n\n \n\n\n$\n\n\n2,763\n\n\n \n\n\n \n\n\n$\n\n\n3,699\n\n\n \n\n\n \n\n\n$\n\n\n315\n\n\n \n\n\n \n\n\n$\n\n\n6,777\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n6,777\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLabor and benefits expense\n\n\n \n\n\n \n\n\n362\n\n\n \n\n\n \n\n\n \n\n\n433\n\n\n \n\n\n \n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n \n\n\n831\n\n\n \n\n\n \n\n\n \n\n\n(\n7\n\n\n)\n\n\n \n\n\n \n\n\n824\n\n\n \n\n\n\n\n\n\nRaw materials expense\n\n\n \n\n\n \n\n\n104\n\n\n \n\n\n \n\n\n \n\n\n556\n\n\n \n\n\n \n\n\n \n\n\n22\n\n\n \n\n\n \n\n\n \n\n\n682\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n682\n\n\n \n\n\n\n\n\n\nDepreciation, depletion and amortization expense\n\n\n \n\n\n \n\n\n205\n\n\n \n\n\n \n\n\n \n\n\n261\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n479\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n482\n\n\n \n\n\n\n\n\n\nEnergy expense\n\n\n \n\n\n \n\n\n152\n\n\n \n\n\n \n\n\n \n\n\n216\n\n\n \n\n\n \n\n\n \n\n\n37\n\n\n \n\n\n \n\n\n \n\n\n405\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n405\n\n\n \n\n\n\n\n\n\nExternal freight expense\n\n\n \n\n\n \n\n\n113\n\n\n \n\n\n \n\n\n \n\n\n233\n\n\n \n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n \n\n\n \n\n\n376\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n376\n\n\n \n\n\n\n\n\n\nOther costs of revenues\n\n\n \n\n\n \n\n\n854\n\n\n \n\n\n \n\n\n \n\n\n1,050\n\n\n \n\n\n \n\n\n \n\n\n80\n\n\n \n\n\n \n\n\n \n\n\n1,984\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n1,985\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n124\n\n\n \n\n\n \n\n\n \n\n\n177\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n319\n\n\n \n\n\n \n\n\n \n\n\n124\n\n\n \n\n\n \n\n\n \n\n\n443\n\n\n \n\n\n\n\n\n\nAcquisition, divestiture and integration expenses\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n\n\n\n\nOther operating (income) expense, net\n\n\n \n\n\n \n\n\n(\n8\n\n\n)\n\n\n \n\n\n \n\n\n(\n10\n\n\n)\n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n(\n15\n\n\n)\n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n(\n28\n\n\n)\n\n\n\n\n\n\nSegment Earnings (Loss) from Operations\n\n\n \n\n\n$\n\n\n857\n\n\n \n\n\n \n\n\n$\n\n\n777\n\n\n \n\n\n \n\n\n$\n\n\n76\n\n\n \n\n\n \n\n\n$\n\n\n1,710\n\n\n \n\n\n \n\n\n$\n\n\n(\n114\n\n\n)\n\n\n \n\n\n$\n\n\n1,596\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n165\n\n\n \n\n\n\n\n\n\nOther nonoperating income, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n62\n\n\n)\n\n\n\n\n\n\nConsolidated earnings from continuing operations\n    before income tax expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,493\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n99\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyear ended December 31, 2022\n(in millions)\n\n\n \n\n\nEast Group\n\n\n \n\n\n \n\n\nWest Group\n\n\n \n\n\n \n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\nTotal Reportable Segments\n\n\n \n\n\n \n\n\nCorporate\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nSegment Revenues\n\n\n \n\n\n$\n\n\n2,468\n\n\n \n\n\n \n\n\n$\n\n\n3,389\n\n\n \n\n\n \n\n\n$\n\n\n304\n\n\n \n\n\n \n\n\n$\n\n\n6,161\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n6,161\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLabor and benefits expense\n\n\n \n\n\n \n\n\n340\n\n\n \n\n\n \n\n\n \n\n\n428\n\n\n \n\n\n \n\n\n \n\n\n35\n\n\n \n\n\n \n\n\n \n\n\n803\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n803\n\n\n \n\n\n\n\n\n\nRaw materials expense\n\n\n \n\n\n \n\n\n118\n\n\n \n\n\n \n\n\n \n\n\n568\n\n\n \n\n\n \n\n\n \n\n\n27\n\n\n \n\n\n \n\n\n \n\n\n713\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n713\n\n\n \n\n\n\n\n\n\nDepreciation, depletion and amortization expense\n\n\n \n\n\n \n\n\n205\n\n\n \n\n\n \n\n\n \n\n\n255\n\n\n \n\n\n \n\n\n \n\n\n12\n\n\n \n\n\n \n\n\n \n\n\n472\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n475\n\n\n \n\n\n\n\n\n\nEnergy expense\n\n\n \n\n\n \n\n\n175\n\n\n \n\n\n \n\n\n \n\n\n280\n\n\n \n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n \n\n\n \n\n\n500\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n500\n\n\n \n\n\n\n\n\n\nExternal freight expense\n\n\n \n\n\n \n\n\n143\n\n\n \n\n\n \n\n\n \n\n\n259\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n433\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n433\n\n\n \n\n\n\n\n\n\nOther costs of revenues\n\n\n \n\n\n \n\n\n740\n\n\n \n\n\n \n\n\n \n\n\n1,008\n\n\n \n\n\n \n\n\n \n\n\n63\n\n\n \n\n\n \n\n\n \n\n\n1,811\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n1,814\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n115\n\n\n \n\n\n \n\n\n \n\n\n166\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n297\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n \n\n\n \n\n\n \n\n\n397\n\n\n \n\n\n\n\n\n\nAcquisition, divestiture and integration expenses\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n\n\n\n\nOther operating income, net\n\n\n \n\n\n \n\n\n(\n8\n\n\n)\n\n\n \n\n\n \n\n\n(\n164\n\n\n)\n\n\n \n\n\n \n\n\n(\n1\n\n\n)\n\n\n \n\n\n \n\n\n(\n173\n\n\n)\n\n\n \n\n\n \n\n\n(\n17\n\n\n)\n\n\n \n\n\n \n\n\n(\n190\n\n\n)\n\n\n\n\n\n\nSegment Earnings (Loss) from Operations\n\n\n \n\n\n$\n\n\n640\n\n\n \n\n\n \n\n\n$\n\n\n589\n\n\n \n\n\n \n\n\n$\n\n\n76\n\n\n \n\n\n \n\n\n$\n\n\n1,305\n\n\n \n\n\n \n\n\n$\n\n\n(\n98\n\n\n)\n\n\n \n\n\n$\n\n\n1,207\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n169\n\n\n \n\n\n\n\n\n\nOther nonoperating income, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n53\n\n\n)\n\n\n\n\n\n\nConsolidated earnings from continuing operations\n    before income tax expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,091\n\n\n \n\n\n\n\nAssets employed by segment include assets directly identified with those operations. Corporate assets consist primarily of cash, cash equivalents and restricted cash; property, plant and equipment for corporate operations; and other assets not directly identifiable with a reportable segment.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31\n(in millions)\nAssets employed\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nEast Group\n\n\n \n\n\n$\n\n\n8,452\n\n\n \n\n\n \n\n\n$\n\n\n5,131\n\n\n \n\n\n\n\n\n\nWest Group\n\n\n \n\n\n \n\n\n7,941\n\n\n \n\n\n \n\n\n \n\n\n7,697\n\n\n \n\n\n\n\n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\n269\n\n\n \n\n\n \n\n\n \n\n\n250\n\n\n \n\n\n\n\n\n\nTotal reportable segments\n\n\n \n\n\n \n\n\n16,662\n\n\n \n\n\n \n\n\n \n\n\n13,078\n\n\n \n\n\n\n\n\n\nCorporate\n\n\n \n\n\n \n\n\n1,508\n\n\n \n\n\n \n\n\n \n\n\n2,047\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n18,170\n\n\n \n\n\n \n\n\n$\n\n\n15,125\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\nTotal property additions, including the impact of acquisitions\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nEast Group\n\n\n \n\n\n$\n\n\n3,185\n\n\n \n\n\n \n\n\n$\n\n\n231\n\n\n \n\n\n \n\n\n$\n\n\n189\n\n\n \n\n\n\n\n\n\nWest Group\n\n\n \n\n\n \n\n\n1,216\n\n\n \n\n\n \n\n\n \n\n\n342\n\n\n \n\n\n \n\n\n \n\n\n302\n\n\n \n\n\n\n\n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n39\n\n\n \n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n\n\n\n\nTotal reportable segments\n\n\n \n\n\n \n\n\n4,433\n\n\n \n\n\n \n\n\n \n\n\n612\n\n\n \n\n\n \n\n\n \n\n\n523\n\n\n \n\n\n\n\n\n\nCorporate\n\n\n \n\n\n \n\n\n22\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n4,455\n\n\n \n\n\n \n\n\n$\n\n\n626\n\n\n \n\n\n \n\n\n$\n\n\n544\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\nProperty additions through acquisitions\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nEast Group\n\n\n \n\n\n$\n\n\n2,853\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nWest Group\n\n\n \n\n\n \n\n\n732\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n3,585\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n3\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n100\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\n \n\n\nNote P: Revenues and Gross Profit\n \nThe following tables, which are reconciled to consolidated amounts, provide revenues and gross profit (loss) by line of business: Building Materials (further divided by product line) and Magnesia Specialties. Interproduct revenues represent sales from the aggregates product line to the cement and ready mixed concrete and asphalt and paving product lines and sales from the cement product line to the ready mixed concrete product line. \nEffective January 1, 2024, the Company combined the cement and ready mixed concrete product lines. This change was driven by the reduced significance of each of these product lines relative to the Building Materials business and consolidated operating results from recent divestitures. Additionally, there is a significant relationship between these product lines, as the ready mixed concrete product line is a significant customer of the cement product line. Revenues and gross profit (loss) reflect continuing operations only.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\nRevenues\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nBuilding Materials business:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAggregates\n\n\n \n\n\n$\n\n\n4,514\n\n\n \n\n\n \n\n\n$\n\n\n4,302\n\n\n \n\n\n \n\n\n$\n\n\n3,879\n\n\n \n\n\n\n\n\n\nCement and ready mixed concrete\n\n\n \n\n\n \n\n\n1,083\n\n\n \n\n\n \n\n\n \n\n\n1,518\n\n\n \n\n\n \n\n\n \n\n\n1,395\n\n\n \n\n\n\n\n\n\nAsphalt and paving\n\n\n \n\n\n \n\n\n869\n\n\n \n\n\n \n\n\n \n\n\n887\n\n\n \n\n\n \n\n\n \n\n\n788\n\n\n \n\n\n\n\n\n\nLess:  interproduct revenues\n\n\n \n\n\n \n\n\n(\n250\n\n\n)\n\n\n \n\n\n \n\n\n(\n245\n\n\n)\n\n\n \n\n\n \n\n\n(\n205\n\n\n)\n\n\n\n\n\n\nTotal Building Materials business\n\n\n \n\n\n \n\n\n6,216\n\n\n \n\n\n \n\n\n \n\n\n6,462\n\n\n \n\n\n \n\n\n \n\n\n5,857\n\n\n \n\n\n\n\n\n\nMagnesia Specialties\n\n\n \n\n\n \n\n\n320\n\n\n \n\n\n \n\n\n \n\n\n315\n\n\n \n\n\n \n\n\n \n\n\n304\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n6,536\n\n\n \n\n\n \n\n\n$\n\n\n6,777\n\n\n \n\n\n \n\n\n$\n\n\n6,161\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nyears ended December 31\n(in millions)\nGross profit (loss)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nBuilding Materials business:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAggregates\n\n\n \n\n\n$\n\n\n1,449\n\n\n \n\n\n \n\n\n$\n\n\n1,378\n\n\n \n\n\n \n\n\n$\n\n\n984\n\n\n \n\n\n\n\n\n\nCement and ready mixed concrete\n\n\n \n\n\n \n\n\n260\n\n\n \n\n\n \n\n\n \n\n\n436\n\n\n \n\n\n \n\n\n \n\n\n273\n\n\n \n\n\n\n\n\n\nAsphalt and paving\n\n\n \n\n\n \n\n\n101\n\n\n \n\n\n \n\n\n \n\n\n109\n\n\n \n\n\n \n\n\n \n\n\n81\n\n\n \n\n\n\n\n\n\nTotal Building Materials business\n\n\n \n\n\n \n\n\n1,810\n\n\n \n\n\n \n\n\n \n\n\n1,923\n\n\n \n\n\n \n\n\n \n\n\n1,338\n\n\n \n\n\n\n\n\n\nMagnesia Specialties:\n\n\n \n\n\n \n\n\n107\n\n\n \n\n\n \n\n\n \n\n\n97\n\n\n \n\n\n \n\n\n \n\n\n91\n\n\n \n\n\n\n\n\n\nCorporate\n\n\n \n\n\n \n\n\n(\n39\n\n\n)\n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n(\n6\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n1,878\n\n\n \n\n\n \n\n\n$\n\n\n2,023\n\n\n \n\n\n \n\n\n$\n\n\n1,423\n\n\n \n\n\n\n\nThe above information for 2023 and 2022 has been reclassified to conform to current-year presentation. For the year ended December 31, 2023, the cement product line reported revenues of $\n726\n million, inclusive of $\n217\n million to the ready mixed concrete product line, and gross profit of $\n334\n million. For the year ended December 31, 2023, the ready mixed concrete product line reported revenues of $\n1.0\n billion and gross profit of $\n102\n million. For the year ended December 31, 2022, the cement product line reported revenues of $\n620\n million, inclusive of $\n178\n million to the ready mixed concrete product line, and gross profit of $\n203\n million. For the year ended December 31, 2022, the ready mixed concrete product line reported revenues of $\n953\n million and gross profit of $\n70\n million. Revenues from sales of cement to the ready mixed concrete product line were previously eliminated in the interproduct revenues line.\nDomestic and foreign revenues are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nDomestic\n\n\n \n\n\n$\n\n\n6,487\n\n\n \n\n\n \n\n\n$\n\n\n6,707\n\n\n \n\n\n \n\n\n$\n\n\n6,078\n\n\n \n\n\n\n\n\n\nForeign\n\n\n \n\n\n \n\n\n49\n\n\n \n\n\n \n\n\n \n\n\n70\n\n\n \n\n\n \n\n\n \n\n\n83\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n6,536\n\n\n \n\n\n \n\n\n$\n\n\n6,777\n\n\n \n\n\n \n\n\n$\n\n\n6,161\n\n\n \n\n\n\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n101\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nPerformance Obligations.\n \nPerformance obligations are contractual promises to transfer or provide a distinct good or service for a stated price. The Company’s product sales agreements are single-performance obligations that are satisfied at a point in time. \nPerformance obligations within paving service agreements are satisfied over time, primarily ranging from \none day\n to \ntwo years\n. Customer payment terms are generally \n30\n days from invoice date. Customer payments for the paving operations are based on a contractual billing schedule and are typically \"paid-when-paid\", meaning the Company is paid once the customer is paid.\nFuture revenues from unsatisfied performance obligations at December 31, 2024, 2023 and 2022 were \n$\n255\n million, \n$\n251\n million and \n$\n239\n million, respectively, where the remaining periods to complete these obligations rang\ned from \none month\n to \n36 months\n at \nDecember 31, 2024\n, \none month\n to \n22 months\n at \nDecember 31, 2023\n and \ntwo months\n to \n34 months\n at December 31, \n2022.\n \n\n\nService Revenues.\n \nService revenues, which include paving operations located in California and Colorado, were \n$\n411\n million, \n$\n411\n million and \n$\n354\n million for the years ended December 31, 2024, 2023 and 2022\n, respectively.\n \n\n\nNote Q: Supplemental Cash Flow Information\n \nNoncash investing and financing activities are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nAccrued liabilities for purchases of property, plant and equipment\n\n\n \n\n\n$\n\n\n143\n\n\n \n\n\n \n\n\n$\n\n\n128\n\n\n \n\n\n \n\n\n$\n\n\n152\n\n\n \n\n\n\n\n\n\nRight-of-use assets obtained in exchange for new operating lease\n   liabilities\n\n\n \n\n\n$\n\n\n68\n\n\n \n\n\n \n\n\n$\n\n\n63\n\n\n \n\n\n \n\n\n$\n\n\n27\n\n\n \n\n\n\n\n\n\nRight-of-use assets obtained in exchange for new finance lease\n   liabilities\n\n\n \n\n\n$\n\n\n17\n\n\n \n\n\n \n\n\n$\n\n\n22\n\n\n \n\n\n \n\n\n$\n\n\n12\n\n\n \n\n\n\n\n\n\nRemeasurement of operating lease right-of-use assets\n\n\n \n\n\n$\n\n\n7\n\n\n \n\n\n \n\n\n$\n\n\n10\n\n\n \n\n\n \n\n\n$\n\n\n(\n3\n\n\n)\n\n\n\n\n\n\nRemeasurement of finance lease right-of-use assets\n\n\n \n\n\n$\n\n\n27\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n(\n13\n\n\n)\n\n\n\n\n\n\nAcquisition of assets through asset exchange\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n5\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\nSupplemental disclosures of cash flow information are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nyears ended December 31\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash paid for interest, net of amount capitalized\n\n\n \n\n\n$\n\n\n158\n\n\n \n\n\n \n\n\n$\n\n\n159\n\n\n \n\n\n \n\n\n$\n\n\n165\n\n\n \n\n\n\n\n\n\nCash paid for income taxes\n\n\n \n\n\n$\n\n\n382\n\n\n \n\n\n \n\n\n$\n\n\n292\n\n\n \n\n\n \n\n\n$\n\n\n201\n\n\n \n\n\n\n\n\n\nCash paid for amounts included in the measurement of \n   lease liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating cash flows used for operating leases\n\n\n \n\n\n$\n\n\n77\n\n\n \n\n\n \n\n\n$\n\n\n77\n\n\n \n\n\n \n\n\n$\n\n\n79\n\n\n \n\n\n\n\n\n\nOperating cash flows used for finance leases\n\n\n \n\n\n$\n\n\n6\n\n\n \n\n\n \n\n\n$\n\n\n5\n\n\n \n\n\n \n\n\n$\n\n\n5\n\n\n \n\n\n\n\n\n\nFinancing cash flows used for finance leases\n\n\n \n\n\n$\n\n\n20\n\n\n \n\n\n \n\n\n$\n\n\n17\n\n\n \n\n\n \n\n\n$\n\n\n15\n\n\n \n\n\n\n\n\n\n \n\n\nNote R: Other Operating Income, Net\n \nOther operating income, net, is comprised generally of gains and losses on divestitures and the sale of assets; asset and portfolio rationalization charges; recoveries and losses related to certain customer accounts receivable; recoveries and losses on the resolution of contingency accruals; rental, royalty and services income; and accretion expense, depreciation expense, and gains and losses related to asset retirement obligations. These net amounts represented income of \n$\n1.3\n billion\n, \n$\n28\n million and \n$\n190\n million in 2024, 2023 and 2022, respectively.\n \nIn 2024, other operating income, net, included a \n$\n1.3\n billion\n pretax gain on the divestiture of the South Texas cement business and certain of its related ready mixed concrete operations and $\n28\n million of gains on land sales, which were partially offset by a $\n50\n million pretax, noncash asset and portfolio rationalization charge. The 2024 noncash asset and portfolio rationalization charge relates to the Company's decision to discontinue usage of certain long-haul distribution facilities to transport aggregates products into Colorado because the AFS acquisition completed in January 2024 provides more economical, local aggregates supply. This charge, which is reported in the West Group, reflects the Company's evaluation of the recoverability of certain long-lived assets, including property, plant and equipment and operating lease right-of-use assets, for the cessation of these railroad operations.\nIn 2023, other operating income, net, included $\n20\n million of gains on land sales.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n102\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 8 – Financial Statements and Supplementary Data\n\n\nIn 2022, other operating income, net, included a $\n152\n million pretax gain on the divestiture of the Colorado and Central Texas ready mixed concrete operations.\n \n\n\nNote S: Other Nonoperating Income, Net\n \nOther nonoperating income, net, is comprised generally of interest income; foreign currency transaction gains and losses; pension and postretirement benefit cost (excluding service cost); net equity earnings from nonconsolidated investments and other miscellaneous income and expenses. Other nonoperating income, net, was $\n58\n million, $\n62\n million and $\n53\n million\n in 2024, 2023 and 2022\n, respectively. In 2024, other nonoperating income, net, included $\n40\n million of interest income and $\n10\n million of third-party railroad track maintenance expense. In 2023, other nonoperating income, net, included $\n47\n million of interest income and $\n9\n million of third-party railroad track maintenance expense. In 2022, other nonoperating income, net, included $\n14\n million of interest income, a $\n12\n million pretax gain related to the repurchase of the Company's debt and $\n8\n million of third-party railroad track maintenance expense.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n103\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 9A – Controls and Procedures\n\n\nITEM 9 – CHANGES IN AND DISAGREEMENTS WITH ACCO\nUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n\n\nNone.\n\n\nITEM 9A – CONTROL\nS AND PROCEDURES\n\n\nEvaluation of Disclosure Controls and Procedures\n\n\nAs of December 31, 2024, an evaluation was performed under the supervision and with the participation of the Company’s management, including the Chief Executive Officer (CEO) and Chief Financial Officer (CFO), of the effectiveness of the design and operation of the Company’s disclosure controls and procedures. Based on that evaluation, the Company’s CEO and CFO concluded that the Company’s disclosure controls and procedures were effective at the reasonable assurance level.\n\n\nThe foregoing evaluation of the Company’s disclosure controls and procedures was based on the definition in Exchange Act Rule 13a-15(e), which requires that disclosure controls and procedures are effectively designed to provide reasonable assurance that information required to be disclosed by an issuer in the reports that it files or submits with the SEC under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms, and is accumulated and communicated to the issuer’s management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\n\n\nManagement’s Report on Internal Control over Financial Reporting\n\n\nOur management’s report on internal control over financial reporting is included as the \nStatement of Financial Responsibility and Management’s Report on Internal Controls over Financial Reporting\n in \nItem 8, Financial Statements and Supplemental Data\n of this Form 10-K. The Company’s management concluded that the Company’s internal control over financial reporting was effective in providing reasonable assurance regarding the reliability of financial reporting and the preparation of the Company’s financial statements for external purposes in accordance with U.S. generally accepted accounting principles as of December 31, 2024. PricewaterhouseCoopers LLP, the independent registered public accounting firm that audited the Company’s consolidated financial statements contained herein, also audited the Company’s internal control over financial reporting as of December 31, 2024. The audit report is included in \nItem 8, Financial Statements and Supplementary Data\n of this Form 10-K.\n \n\n\nChanges in Internal Control over Financial Reporting\n\n\nThere were no changes in the Company’s internal control over financial reporting during the most recently completed fiscal quarter ended December 31, 2024 that materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\n\n\nLimitations on the Effectiveness of Controls\n\n\nThe Company's management, including the CEO and CFO, does not expect that the Company’s control system will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision making can be faulty and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n104\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 9A – Controls and Procedures\n\n\nCEO and CFO Certifications\n\n\nIncluded among the exhibits to this Form 10-K are forms of “Certifications” of the Company’s CEO and CFO as required in accordance with Section 302 of the Sarbanes-Oxley Act of 2002 (the “Section 302 Certification”). The Section 302 Certifications refer to this evaluation of the Company’s disclosure policies and procedures and internal control over financial reporting. The information in this section should be read in conjunction with the Section 302 Certifications for a more complete understanding of the topics presented.\n\n\nITEM 9B – OTHE\nR INFORMATION\n\n\nDuring the three months ended December 31, 2024,\n no director or officer of the Company \nadopted\n or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or adopted or terminated a \"non-Rule 10b5-1 trading arrangement,\" as each term is defined in Item 408(a) of Regulation S-K.\n \n\n\nITEM 9C – DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\n\n\nNot Applicable.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦ \nPage \n105\n\n\n \n\n\n \n\n\n\n\n \n\n\n\n\nPart III  \n♦\n  Item 10 – Directors, Executive Officers and Corporate Governance\n\n\nPART \nIII\n \n\n\nITEM 10 – DIRECTORS, EXECUTIVE O\nFFICERS AND CORPORATE GOVERNANCE\n\n\nThe information concerning directors of the Company, the Audit Committee of the Board of Directors, and the Audit Committee financial expert serving on the Audit Committee, all as required in response to this Item 10, is included under the captions \"The Board of Directors,\" \"Proposal 1: Election of Directors\" and “Corporate Governance Matters” in the Company’s definitive proxy statement to be filed with the SEC pursuant to Regulation 14A within 120 days after the close of the Company’s fiscal year ended December 31, 2024 (the “2025 Proxy Statement”), and that information is hereby incorporated by reference in this Form 10-K. Information concerning Section 16(a) reporting compliance is incorporated by reference to the information appearing under the caption “Section 16(a) Reports” in the 2025 Proxy Statement. Information concerning executive officers of the Company required in response to this Item 10 is included in Part I, under the heading \nInformation about our Executive Officers\n of this Form 10-K. The information concerning the Company’s code of ethics required in response to this Item 10 is included in Part I, under the heading \nAvailable Information\n of this Form 10‑K.\n\n\nThe Company has \nadopted\n an insider trading policy governing the purchase, sale and other dispositions of the Company’s securities that applies to all Company personnel, including directors, officers, employees, and other covered persons. The Company also follows procedures for the repurchase of its securities. The Company believes that its insider trading policy and repurchase procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations, and listing standards applicable to the Company. A copy of the Company’s insider trading policy is filed as \nExhibit 19.01\n to this Form 10-K.\n \n\n\nITEM 11 – EXECUT\nIVE COMPENSATION\n\n\nThe information required in response to this Item 11 is included under the captions “Executive Compensation,” “Compensation Discussion and Analysis,” “Required Pay Disclosures,” “Corporate Governance Matters,” “Management Development and Compensation Committee Report,” and “Compensation Committee Interlocks and Insider Participation” in the Company’s 2025 Proxy Statement, and that information is hereby incorporated by reference in this Form 10-K.\n\n\nITEM 12 – SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n\n\nThe information required in response to this Item 12 is included under the captions “General Information,” “Security Ownership of Certain Beneficial Owners and Management,” and “Securities Authorized for Issuance Under Equity Compensation Plans” in the Company’s 2025 Proxy Statement, and that information is hereby incorporated by reference in this Form 10-K.\n\n\nITEM 13 – CERTAIN RELATIONSHIPS AND RELATE\nD TRANSACTIONS, AND DIRECTOR INDEPENDENCE\n\n\nThe information required in response to this Item 13 is included under the captions “Compensation Committee Interlocks and Insider Participation in Compensation Decisions” and “Corporate Governance Matters” in the Company’s 2025 Proxy Statement, and that information is hereby incorporated by reference in this Form 10-K.\n \n\n\nITEM 14 – PRINCIPAL ACCOU\nNTANT FEES AND SERVICES\n\n\nThe information required in response to this Item 14 is included under the caption “Independent Auditors” in the Company’s 2025 Proxy Statement, and that information is hereby incorporated by reference in this Form 10-K.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n106\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\nPART\n IV\n\n\nITEM 15 – EXHIBITS AND FINA\nNCIAL STATEMENT SCHEDULES\n\n\n(a) (1) List of financial statements filed as part of this Form 10-K\n\n\nThe consolidated financial statements of Martin Marietta and consolidated subsidiaries, and related notes, appear in \nItem 8, Financial Statements and Supplemental Data\n of this Form 10-K.\n\n\n(a) (2) List of financial statement schedules filed as part of this Form 10-K\n\n\nThe following financial statement schedule of Martin Marietta and consolidated subsidiaries is included in Item 15(c) of this Form 10-K.\n\n\nSchedule II - Valuation and Qualifying Accounts\n\n\nAll other schedules have been omitted because they are not applicable, not required, or the information has been otherwise supplied in the financial statements or notes to the financial statements.\n\n\nThe report of the Company’s independent registered public accounting firm with respect to the above-referenced financial statements is included in \nItem 8, Financial Statements and Supplemental Data\n of this Form 10-K. The consent of the Company’s independent registered public accounting firm is attached as\n \nExhibit 23.01\n to this Form 10-K.\n\n\n(a) (3) Exhibits\n\n\nThe list of Exhibits on the accompanying Index of Exhibits included in Item 15(b) of this Form 10-K is hereby incorporated by reference.  Each management contract or compensatory plan or arrangement required to be filed as an exhibit is indicated by asterisks.\n\n\n(b) Index of Exhibits\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n2.01\n\n\nEquity and Asset Purchase Agreement, dated as of November 20, 2023, among Martin Marietta Materials, Inc., CRH Americas Materials, Inc. and CRH plc (incorporated by reference to Exhibit 2.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on November 24, 2023) (Commission File No. 1-12744)\n\n\n\n\n\n\n3.01\n\n\nRestated Articles of Incorporation of the Company, as amended (incorporated by reference to Exhibit 3.01 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2016, filed on February 24, 2017) (Commission File No. 1-12744)\n\n\n\n\n\n\n3.02\n\n\nRestated Bylaws of the Company (incorporated by reference to Exhibit 3.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on November 14, 2022) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.01\n\n\nSpecimen Common Stock Certificate (incorporated by reference to Exhibit 4.01 to the Martin Marietta Materials, Inc. registration statement on Form S-1, filed on December 8, 1993 (SEC Registration No. 33-72648) (P)\n\n\n\n\n\n\n4.02\n\n\nArticle 5 of the Company’s Restated Articles of Incorporation, as amended (incorporated by reference to Exhibit 3.01 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2016, filed on February 24, 2017) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.03\n\n\nArticle 1 of the Company’s Restated Bylaws, as amended (incorporated by reference to Exhibit 3.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on November 14, 2022) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.04\n\n\nIndenture dated as of December 1, 1995 between Martin Marietta Materials, Inc. and First Union National Bank of North Carolina (incorporated by reference to Exhibit 4(a) to the Martin Marietta Materials, Inc. registration statement on Form S-3 (SEC Registration No. 33-99082)) (P)\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n107\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n4.05\n\n\nForm of Martin Marietta Materials, Inc. 7% Debenture due 2025 (incorporated by reference to Exhibit 4(a)(i) to the Martin Marietta Materials, Inc. registration statement on Form S-3 (SEC Registration No. 33-99082)) (P)\n\n\n\n\n\n\n4.06\n\n\nIndenture dated as of April 30, 2007 between Martin Marietta Materials, Inc. and Truist Bank (as successor by merger to SunTrust Bank and formerly known as Branch Banking and Trust Company, Inc.), as trustee (incorporated by reference to Exhibit 4.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on April 30, 2007 (Commission File No. 1-12744))\n\n\n\n\n\n\n4.07\n\n\nSecond Supplemental Indenture, dated as of April 30, 2007, between Martin Marietta Materials, Inc. and Truist Bank, as trustee, to that certain Indenture dated as of April 30, 2007 between Martin Marietta Materials, Inc. and Truist Bank, as trustee, pursuant to which were issued $250,000,000 aggregate principal amount of 6\n¼%\n Senior Notes due 2037 of Martin Marietta Materials, Inc. (incorporated by reference to Exhibit 4.3 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on April 30, 2007 (Commission File No. 1-12744))\n\n\n\n\n\n\n4.08\n\n\nPurchase Agreement dated as of June 23, 2014 among Martin Marietta Materials, Inc. and Deutsche Bank Securities Inc. and J.P. Morgan Securities LLC, as representatives of the several initial purchasers named in Schedule 1 thereto (incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K, filed on June 24, 2014) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.09\n\n\nIndenture, dated as of July 2, 2014, between Martin Marietta Materials, Inc. and Regions Bank, as trustee (incorporated by reference to Exhibit 4.1 of the Company’s Current Report on Form 8-K, filed on July 2, 2014) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.10\n\n\nForm of 4.250% Senior Notes due 2024 (included in Exhibit 4.09)\n\n\n\n\n\n\n4.11\n\n\nIndenture, dated as of May 22, 2017, between Martin Marietta Materials, Inc. and Regions Bank, as trustee (incorporated by reference to Exhibit 4.1 of the Company’s Current Report on Form 8-K, filed on May 22, 2017) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.12\n\n\nFirst Supplemental Indenture, dated as of May 22, 2017, between Martin Marietta Materials, Inc. and Regions Bank, as trustee, governing the Senior Notes issued by the Company on May 22, 2017, in the form of the $300 million aggregate principal amount of Floating Rate Senior Notes due 2020 and $300 million aggregate principal amount of 3.450% Senior Notes due 2027 (incorporated by reference to Exhibit 4.2 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on May 22, 2017 (Commission File No. 1-12744))\n\n\n\n\n\n\n4.13\n\n\nForm of 3.450% Senior Notes due 2027 (included in Exhibit 4.12)\n\n\n\n\n\n\n4.14\n\n\nSecond Supplemental Indenture, dated as of December 20, 2017, between Martin Marietta Materials, Inc. and Regions Bank, as trustee, governing the Senior Notes issued by the Company on December 20, 2017, in the form of the $300 million aggregate principal amount of Floating Rate Senior Notes due 2019, $500 million aggregate principal amount of 3.500% Senior Notes due 2027, and $600 million aggregate principal amount of 4.250% Senior Notes due 2047 (incorporated by reference to Exhibit 4.2 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on December 20, 2017 (Commission File No. 1-12744))\n\n\n\n\n\n\n4.15\n\n\nForm of 3.500% Senior Notes due 2027 (included in Exhibit 4.14)\n\n\n\n\n\n\n4.16\n\n\nForm of 4.250% Senior Notes due 2047 (included in Exhibit 4.14)\n\n\n\n\n\n\n4.17\n\n\nThird Supplemental Indenture, dated as of March 16, 2020, between Martin Marietta Materials, Inc. and Regions Bank, as trustee, governing the Senior Notes issued by the Company on March 16, 2020, in the form of $500 million aggregate principal amount of 2.500% Senior Notes due 2030 (incorporated by reference to Exhibit 4.2 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on March 16, 2020 (Commission File No. 1-12744))\n\n\n\n\n\n\n4.18\n\n\nForm of 2.500% Senior Notes due 2030 (contained in Exhibit 4.17)\n\n\n\n\n\n\n4.19\n\n\nFourth Supplemental Indenture, dated as of July 2, 2021, between Martin Marietta Materials, Inc. and Regions Bank, as trustee (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K, filed on July 2, 2021) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.20\n\n\nForm of 2.400% Senior Notes due 2031 (contained in Exhibit 4.19)\n\n\n\n\n\n\n4.21\n\n\nForm of 3.200% Senior Notes due 2051 (contained in Exhibit 4.19)\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n108\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n4.22\n\n\nFifth Supplemental Indenture, dated as of November 4, 2024, between Martin Marietta Materials, Inc. and Regions Bank, as trustee, (incorporated by reference to Exhibit 4.2 of the Company’s Current Report on Form 8-K, filed on November 4, 2024) (Commission File No. 1-12744)\n\n\n\n\n\n\n4.23\n\n\nForm of 5.150% Senior Notes due 2034 (contained in Exhibit 4.22)\n\n\n\n\n\n\n4.24\n\n\nForm of 5.500% Senior Notes due 2054 (contained in Exhibit 4.22)\n\n\n\n\n\n\n4.25\n\n\nDescription of the Company’s Capital Stock (incorporated by reference to Exhibit 4.17 to the Martin Marietta Materials, Inc. Current Report on Form 10-K for the fiscal year ended December 31, 2019 (Commission File No. 1-12744))\n\n\n\n\n\n\n10.01\n\n\n$800,000,000 Credit Agreement dated as of December 21, 2021 among Martin Marietta Materials, Inc., JPMorgan Chase Bank, N.A., as Administrative Agent, and Deutsche Bank AG New York Branch, PNC Bank, National Association, Truist Bank, and Wells Fargo Bank, National Association, as Co-Syndication Agents (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on December 27, 2021) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.02\n\n\nLoan Modification No. 1 and Extension Agreement dated as of December 22, 2022, among Martin Marietta Materials, Inc., the Lenders party thereto and JPMorgan Chase Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on December 22, 2022) (Commission File No. 1-12744)\n \n \n\n\n\n\n\n\n10.03\n\n\nLoan Modification No. 2 and Extension Agreement dated as of December 21, 2023 among the Corporation, the Lenders party thereto and JPMorgan Chase Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on December 21, 2023) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.04\n\n\nLoan Modification No. 3 and Extension Agreement dated as of December 20, 2024 among the Corporation, the Lenders party thereto and JPMorgan Chase Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on December 20, 2024) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.05\n\n\nCredit and Security Agreement dated as of April 19, 2013, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on April 24, 2013) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.06\n\n\nCommitment Letter dated as of June 20, 2014 to the Credit and Security Agreement, dated as of April 19, 2013 (as last amended April 18, 2014), among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on June 25, 2014) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.07\n\n\nSecond Amendment to Credit and Security Agreement, dated as of April 18, 2014, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on April 24, 2014) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.08\n\n\nFifth Amendment to Credit and Security Agreement, dated as of September 30, 2014, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on October 3, 2014) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.09\n\n\nSeventh Amendment to Credit and Security Agreement, dated as of September 28, 2016, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n109\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n \n\n\nadministrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 30, 2016) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.10\n\n\nNinth Amendment to Credit and Security Agreement, dated as of April 17, 2018, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on April 17, 2018) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.11\n\n\nTenth Amendment to Credit and Security Agreement, dated as of September 28, 2018, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 25, 2018) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.12\n\n\nEleventh Amendment to Credit and Security Agreement, dated as of September 24, 2019, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, as lender, together with the other lenders from time to time party thereto, and Truist Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 24, 2019) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.13\n\n\nTwelfth Amendment to Credit and Security Agreement, dated as of September 23, 2020, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, successor by merger to SunTrust Bank, as lender together with the other lenders from time to time party thereto, and Truist Bank, successor by merger to Sun Trust Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 23, 2020) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.14\n\n\nThirteenth Amendment to Credit and Security Agreement, dated as of September 22, 2021, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, successor by merger to SunTrust Bank, as lender together with the other lenders from time to time party thereto, and Truist Bank, successor by merger to Sun Trust Bank, as administrative agent for the lenders (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 23, 2021) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.15\n\n\nFourteenth Amendment to Credit Agreement, dated as of September 21, 2022, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, successor by merger to SunTrust Bank, as lender together with the other lenders from time to time party thereto, and Truist Bank, successor by merger to Sun Trust Bank, as administrative agent for the lenders (including a conformed copy of the Credit Agreement attached as Exhibit A thereto) (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on September 21, 2022) (Commission File No. 1-12744)\n \n\n\n\n\n\n\n10.16\n\n\nFifteenth Amendment to Credit Agreement, dated as of September 20, 2023, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, successor by merger to SunTrust Bank, as lender together with the other lenders from time to time party thereto, and Truist Bank, successor by merger to Sun Trust Bank, as administrative agent for the lenders (including a conformed copy of the Credit Agreement attached as Exhibit A thereto) (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on September 20, 2023) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.17\n\n\nSixteenth Amendment to Credit Agreement, dated as of September 18, 2024, among Martin Marietta Funding LLC, as borrower, Martin Marietta Materials, Inc., as servicer, and Truist Bank, successor by merger to SunTrust Bank, as lender together with the other lenders from time to time party thereto, and Truist Bank, successor by merger to Sun Trust Bank, as administrative agent for the lenders (including a conformed copy of the Credit Agreement attached as Exhibit A thereto) (incorporated by\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n110\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n \n\n\nreference to Exhibit 10.1 to the Martin Marietta Materials, Inc., Current Report on Form 8-K filed on September 19, 2024) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.18\n\n\nPurchase and Contribution Agreement dated as of April 19, 2013, between Martin Marietta Materials, Inc., as seller and as servicer, and Martin Marietta Funding LLC, as buyer (incorporated by reference to Exhibit 10.02 to the Martin Marietta Materials, Inc. Current Report on Form 8-K filed on April 24, 2013) (Commission File No. 1-12744)\n\n\n\n\n\n\n10.19\n\n\nForm of Martin Marietta Materials, Inc. Third Amended and Restated Employment Protection Agreement (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Current Report on Form 8‑K, filed on August 19, 2008) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.20\n\n\nAmended and Restated Martin Marietta Materials, Inc. Common Stock Purchase Plan for Directors (incorporated by reference to Exhibit 10.05 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2013) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.21\n\n\nMartin Marietta Materials, Inc. Amended and Restated Executive Incentive Plan (incorporated by reference to Exhibit 10.05 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2008) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.22\n\n\nMartin Marietta Materials, Inc. Incentive Stock Plan, as Amended (incorporated by reference to Exhibit 10.06 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2008) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.23\n\n\nMartin Marietta Amended and Restated Stock-Based Award Plan last amended and restated February 18, 2016 (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10‑Q for the quarter ended June 30, 2016) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.24\n\n\nMartin Marietta Executive Cash Incentive Plan adopted February 18, 2016 (incorporated by reference to Exhibit 10.02 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10‑Q for the quarter ended June 30, 2016) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.25\n\n\nMartin Marietta Materials, Inc. Amended Omnibus Securities Award Plan (incorporated by reference to Exhibit 10.16 to the Martin Marietta Materials, Inc. Annual Report on Form 10‑K for the fiscal year ended December 31, 2000) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.26\n\n\nMartin Marietta Materials, Inc. Third Amended and Restated Supplemental Excess Retirement Plan (incorporated by reference to Exhibit 10 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10-Q for the quarter ended June 30, 2012) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.27\n\n\nForm of Option Award Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.11 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2008) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.28\n\n\nForm of Amendment to the Stock Unit Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.13 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2008) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.29\n\n\nForm of Restricted Stock Unit Agreement for Directors under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.14 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2013) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.30\n\n\nForm of Special Restricted Stock Unit Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.19 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2014) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.31\n\n\nForm of Performance-Based Restricted Stock Unit Award Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.02 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10-Q for the quarter ended March 31, 2017) (Commission File No. 1-12744)**\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n111\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExhibit No.\n\n\n \n\n\n\n\n\n\n10.32\n\n\nOffer Letter, dated as of June 9, 2017, by and between Martin Marietta Materials, Inc. and James A. J. Nickolas (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10‑Q for the quarter ended June 30, 2018) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.33\n\n\nForm of First Amendment to the Martin Marietta Materials, Inc. Third Amended and Restated Employment Protection Agreement (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc. Current Report on Form 8‑K, filed on December 18, 2018) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.34\n\n\nForm of Restricted Stock Unit Award Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.2 to the Martin Marietta Materials, Inc. Current Report on Form 8‑K, filed on December 18, 2018) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.35\n\n\nForm of Performance Share Unit Award Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.3 to the Martin Marietta Materials, Inc. Current Report on Form 8‑K, filed on December 18, 2018) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.36\n\n\nForm of Directors’ Restricted Stock Unit Award Agreement under the Martin Marietta Materials, Inc. Amended and Restated Stock-Based Award Plan (incorporated by reference to Exhibit 10.27 to the Martin Marietta Materials, Inc. Annual Report on Form 10-K for the fiscal year ended December 31, 2018) (Commission File No. 1-12744)**\n\n\n\n\n\n\n10.37\n\n\nMartin Marietta Nonqualified Deferred Cash Compensation Plan (incorporated by reference to Exhibit 10.1 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on June 29, 2020 (Commission File No. 1-12744))**\n\n\n\n\n\n\n10.38\n\n\nMartin Marietta Nonqualified Deferred Cash Compensation Plan Adoption Agreement (incorporated by reference to Exhibit 10.2 to the Martin Marietta Materials, Inc. Current Report on Form 8-K, filed on June 29, 2020 (Commission File No. 1-12744))**\n\n\n\n\n\n\n10.39\n\n\nOffer Letter, dated as of January 11, 2019, by and between Martin Marietta Materials, Inc. and Robert J. Cardin (incorporated by reference to Exhibit 10.01 to the Martin Marietta Materials, Inc. Quarterly Report on Form 10‑Q for the quarter ended June 30, 2019) (Commission File No. 1-12744)**\n\n\n\n\n\n\n*19.01\n\n\nMartin Marietta Insider Trading Policy\n\n\n\n\n\n\n*21.01\n\n\nList of subsidiaries of Martin Marietta Materials, Inc.\n\n\n\n\n\n\n*23.01\n\n\nConsent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm for Martin Marietta Materials, Inc. and consolidated subsidiaries\n\n\n\n\n\n\n*24.01\n\n\nPowers of Attorney (included in this Form 10-K immediately following Signatures)\n\n\n\n\n\n\n*31.01\n\n\nCertification dated February 21, 2025 of Chief Executive Officer pursuant to Securities and Exchange Act of 1934, rule 13a‑14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n\n\n\n\n\n\n*31.02\n\n\nCertification dated February 21, 2025 of Chief Financial Officer pursuant to Securities and Exchange Act of 1934, rule 13a‑14, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n\n\n\n\n\n\n*32.01\n\n\nCertification dated February 21, 2025 of Chief Executive Officer required by 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n\n\n\n\n\n\n*32.02\n\n\nCertification dated February 21, 2025 of Chief Financial Officer required by 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n\n\n\n\n\n\n*95\n\n\nMine Safety Disclosure Exhibit\n\n\n\n\n\n\n97\n\n\nExecutive Clawback Policy (incorporated by reference to Exhibit 97 to the Martin Marietta Materials, Inc. Annual Report on Form 10‑K for the fiscal year ended December 31, 2023) (Commission File No. 1-12744)**\n\n\n\n\n\n\n*101\n\n\nThe following financial information formatted in Inline XBRL:\n\n\n\n\n\n\n*101.INS\n\n\nInline XBRL Instance Document – The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n\n\n\n\n\n\n*101.SCH\n\n\nInline XBRL Taxonomy Extension Schema With Embedded Linkbase Documents\n\n\n\n\n\n\n*104\n\n\nThe cover page financial information formatted in Inline XBRL (included as Exhibit 101).\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n112\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart IV  \n♦\n  Item 15 – Exhibits and Financial Statement Schedules\n\n\nOther material incorporated by reference:\n\n\nMartin Marietta Materials, Inc.’s 2025 Proxy Statement to be filed pursuant to Regulation 14A, portions of which are incorporated by reference in this Form 10-K. Those portions of the 2025 Proxy Statement which are not incorporated by reference shall not be deemed to be “filed” as part of this report.\n\n\n*     Filed herewith\n\n\n**  Management contract or compensatory plan or arrangement required to be filed as an exhibit pursuant to Item 14(c) of Form 10-K\n\n\n(c)    Financial Statement Schedule\n \n\n\nSCHEDULE II – VALUATION AND QUALIFYING ACCOUNTS\n \n\n\nMARTIN MARIETTA MATERIALS, INC. AND CONSOLIDATED SUBSIDIARIES\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCol A\n\n\n \n\n\nCol B\n\n\n \n\n\n \n\n\nCol C\n\n\n \n\n\n \n\n\n \n\n\nCol D\n\n\n \n\n\n \n\n\n \n\n\nCol E\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAdditions\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDescription\n\n\n \n\n\nBalance\nat\nbeginning\nof period\n\n\n \n\n\n \n\n\n(1)\nCharged\nto costs\nand\nexpenses\n\n\n \n\n\n \n\n\n(2)\nCharged\nto other\naccounts-\ndescribe\n\n\n \n\n\n \n\n\n \n\n\nDeductions-\ndescribe\n\n\n \n\n\n \n\n\n \n\n\nBalance\nat end of\nperiod\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Amounts in Millions)\n\n\n \n\n\n\n\n\n\nYear ended December 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAllowance for estimated credit losses\n\n\n \n\n\n$\n\n\n12\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n4\n\n\n \n\n\n (a)\n\n\n \n\n\n$\n\n\n8\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nYear ended December 31, 2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAllowance for estimated credit losses\n\n\n \n\n\n$\n\n\n11\n\n\n \n\n\n \n\n\n$\n\n\n1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n12\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nYear ended December 31, 2022\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAllowance for estimated credit losses\n\n\n \n\n\n$\n\n\n6\n\n\n \n\n\n \n\n\n$\n\n\n5\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n11\n\n\n \n\n\n\n\n\n\na.\nChange in estimates\n\n\n \n\n\nITEM 16 – FORM\n 10-K SUMMARY\n \n\n\nThe Company has chosen not to include an optional summary of the information required by this Form 10-K. For a reference to the information in this Form 10-K, investors should refer to the Table of Contents to this Form 10-K.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n113\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n♦\n  Signatures\n\n\nSIGNA\nTURES\n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMARTIN MARIETTA MATERIALS, INC.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBy:\n\n\n \n\n\n/s/ Bradley D. Kohn\n\n\n\n\n\n\n \n\n\n \n\n\nBradley D. Kohn\n\n\n\n\n\n\n \n\n\n \n\n\nSenior Vice President, General Counsel and Corporate Secretary\n\n\n\n\n\n\n \n\n\nDated:  February 21, 2025\n\n\nPOWER OF ATTORNEY\n\n\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below appoints each of Bradley D. Kohn and Sara W. Brown as his or her true and lawful attorney-in-fact, each with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorney-in-fact, full power and authority to do and perform each in connection therewith, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorney-in-fact, or her substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\n\n\nPursuant to the requirements of the Securities and Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n114\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n♦\n  Signatures\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSignature\n\n\n \n\n\nTitle\n\n\n \n\n\nDate\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ C. Howard Nye\n\n\n \n\n\nChair of the Board,\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nC. Howard Nye\n\n\n \n\n\n   President and Chief Executive Officer\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ James A. J. Nickolas\n\n\n \n\n\nExecutive Vice President\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nJames A. J. Nickolas\n\n\n \n\n\n   and Chief Financial Officer\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Robert J. Cardin\n\n\n \n\n\nSenior Vice President,\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nRobert J. Cardin\n\n\n \n\n\n   Controller and Chief Accounting Officer\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Dorothy M. Ables\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nDorothy M. Ables\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Sue W. Cole\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nSue W. Cole\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Anthony R. Foxx\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nAnthony R. Foxx\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ John J. Koraleski\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nJohn J. Koraleski\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Mary T. Mack\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nMary T. Mack\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Laree E. Perez\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nLaree E. Perez\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Thomas H. Pike\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nThomas H. Pike\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Donald W. Slager\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nDonald W. Slager\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ David C. Wajsgras\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 21, 2025\n\n\n\n\n\n\nDavid C. Wajsgras\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \n \n115"
  }
}