{
  "ticker": "MOH",
  "cik": "0001179929",
  "company_name": "MOLINA HEALTHCARE, INC.",
  "filing_date": "2025-02-11",
  "accession": "0001179929-25-000023",
  "primary_doc": "moh-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business,” for further description of our segments.\nHOW WE ASSESS PERFORMANCE\nWe derive our revenues primarily from health insurance premiums. Our primary customers are state Medicaid agencies and the federal government.\nThe key metrics used to assess the performance of our Medicaid, Medicare, and Marketplace segments are premium revenue, medical margin and medical care ratio (“MCR”). MCR represents the amount of medical care costs as a percentage of premium revenue. Therefore, the underlying medical margin, or the amount earned by the Medicaid, Medicare, and Marketplace segments after medical costs are deducted from premium revenue, represents the most important measure of earnings reviewed by management, and is used by our chief executive officer, who is our chief operating decision maker, to review results, assess performance, and allocate resources. The key metric used to assess the performance of our Other segment is service margin. The service margin is equal to service revenue minus cost of service revenue. \nManagement’s discussion and analysis of the change in medical margin is discussed below under “Segment Financial Performance.” For more information, see Notes to Consolidated Financial Statements, Note 16, “Segments.”\nTRENDS AND UNCERTAINTIES\nFor a discussion of the trends, uncertainties and other developments that affected our reportable segments, refer to “Item 1. Business—Our Business,” “—Trends and Uncertainties,” “—Legislative and Political Environment,” “—Operations—Medical Management,” and “—Regulation.”\nSEGMENT FINANCIAL PERFORMANCE\nThe following table summarizes our membership by segment as of the dates indicated:\nAs of December 31,\n2024\n2023\nMedicaid\n4,890,000 \n4,542,000 \nMedicare\n242,000 \n172,000 \nMarketplace\n403,000 \n281,000 \nTotal\n5,535,000 \n4,995,000 \nThe tables below summarize premium revenue, medical margin, and MCR by segment for the periods indicated (dollars in millions):\nYear Ended December 31,\n2024\n2023\nPremium Revenue\nMedical Margin\nMCR\nPremium Revenue\nMedical Margin\nMCR\nMedicaid \n$\n30,579 \n$\n2,979 \n90.3 \n%\n$\n26,327 \n$\n2,973 \n88.7 \n%\nMedicare \n5,542 \n603 \n89.1 \n4,179 \n388 \n90.7 \nMarketplace\n2,506 \n617 \n75.4 \n2,023 \n499 \n75.3 \nTotal\n$\n38,627 \n$\n4,199 \n89.1 \n%\n$\n32,529 \n$\n3,860 \n88.1 \n%\nMolina Healthcare, Inc. 2024 Form 10-K | 42\nMedicaid\nKey factors affecting results for this segment include:\n•\nOur growth initiatives, including acquisitions and expansion into new states, drove an increase in member months during the year, despite the impact of redeterminations, and changes in membership mix; \n•\nImpact of redetermination, including the loss of approximately 675,000 members, and a moderate impact from the effect of acuity shifts, net of the beneficial impact of risk corridors; and\n•\nContinued focus on managing medical costs amid higher-than-expected utilization, particularly in LTSS, pharmacy and behavioral health services. \nMedicaid premium revenue increased $4.3 billion, or 16% in 2024, when compared with 2023. The higher premium revenue reflects new contract wins in Iowa (commenced in July 2023), Nebraska (commenced in January 2024), and New Mexico (commenced in July 2024), expansions in California and Texas that commenced in January 2024, and September 2024, respectively, and the My Choice acquisition that closed in September 2023. These increases were partially offset by the impact of Medicaid redetermination. \nThe medical margin of our Medicaid program increased $6 million in 2024, when compared with 2023. The change was driven by the impact of increased premium revenues associated with the membership growth discussed above, partially offset by an increase in the MCR, as discussed below. \nThe Medicaid MCR increased 160 basis points to 90.3% in 2024, from 88.7% in 2023. The increase was mainly attributable to the continued impact of redetermination-related acuity shifts, higher utilization among our continuing population, particularly in the second half of the year, and a temporal dislocation between premium rates and medical trend. Also, approximately 30 basis points of the increase is driven by the higher initial MCR associated with the start of new contracts and the My Choice acquisition, and approximately 20 basis points was due to a prior year retroactive premium rate reduction in our California business. The increase was partially offset by minimum MLR and medical cost corridors, and medical cost management. Excluding new contracts and the My Choice acquisition, our legacy Medicaid MCR for the year ended December 31, 2024 is above our long-term target range. \nMedicare\nKey factors affecting results for this segment include:\n•\nPricing and benefit design changes implemented in 2024;\n•\nIncreased utilization of LTSS benefits, high-cost drugs, and outpatient services; and \n•\nThe impact of risk-adjusted premiums that are more commensurate with the acuity of our membership.\nMedicare premium revenue increased $1.4 billion, or 33%, in 2024 compared to 2023. The increase was primarily due to the Bright Health Medicare acquisition that closed on January 1, 2024, the impact of MAPD and D-SNP membership expansion and organic membership growth in existing states, and increased premiums that are more commensurate with the acuity of our population. \nThe medical margin for Medicare increased $215 million in 2024 compared to 2023. The increase was mainly due to the year-over-year growth in membership and premium revenues combined with the decrease in MCR discussed below. \nThe Medicare MCR decreased to 89.1% in 2024, from 90.7% in 2023, or 160 basis points, primarily driven by higher risk adjustment premiums that are commensurate with the acuity of our membership, pricing and benefit design changes implemented in 2024 and operational improvements, partially offset by elevated LTSS and pharmacy costs and higher outpatient utilization within our D-SNP population. The Medicare MCR for the year ended December 31, 2024 is above our long-term target range. \nMarketplace\nKey factors affecting results for this segment include:\n•\nExecution of our product and pricing strategy, to achieve growth and repositioning in the metallic tier membership mix, while maintaining target margins; and\n•\nAchievement of member risk scores and associated risk-adjusted premium that are commensurate with the health status, or acuity, of our Marketplace members.\nMarketplace premium revenue increased $483 million in 2024 compared to 2023. The increase was mainly due to an increase in membership. Our Marketplace membership as of December 31, 2024, amounted to 403,000 members, representing an increase of 122,000 members compared to December 31, 2023, which is in line with our \nMolina Healthcare, Inc. 2024 Form 10-K | 43\nproduct and pricing strategy to achieve growth, while maintaining target margins in this segment, and membership gained from redeterminations this year. \nThe Marketplace medical margin increased $118 million in 2024, primarily due to the growth in premiums and margin associated with the higher membership and the impact of MCR changes discussed below. \nThe Marketplace MCR was 75.4% in 2024 and 75.3% in 2023. The MCR in each year reflects our product and pricing strategy to achieve growth and maintain target margins, changes in membership mix, risk adjustment premiums that are more commensurate with the acuity of our membership, and continued operational improvements. Our 2024 Marketplace MCR was well below our long-term target range.\nOther\nThe Other segment includes service revenues and costs associated with the long-term services and supports consultative services we provide in Wisconsin, and also includes certain corporate amounts not allocated to the Medicaid, Medicare, or Marketplace segments. Such amounts were immaterial to our consolidated results of operations for 2024 and 2023.\nLIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nLIQUIDITY\nWe manage our cash, investments, and capital structure to meet the short- and long-term obligations of our business while maintaining liquidity and financial flexibility. We forecast, analyze, and monitor our cash flows to enable prudent investment management and financing within the confines of our financial strategy.\nWe maintain liquidity at two levels: 1) the regulated health plan subsidiaries; and 2) the parent company. \nOur regulated health plan subsidiaries’ primary liquidity requirements include payment of medical claims and other health care services; payment of certain settlements with our state and federal customers, such as minimum medical loss ratio and risk corridors and Marketplace risk transfers on behalf of CMS; general and administrative costs directly incurred or paid through an administrative services agreement to the parent company; and federal tax payments to the parent company under an intercompany tax sharing agreement. Our regulated health plan subsidiaries meet their liquidity needs by generating cash flows from operating activities, primarily from premium revenue; cash flows from investing activities, including investment income and sales of investments; and capital contributions received from our parent company.\nOur regulated health plan subsidiaries are each subject to applicable state regulations that, among other things, require the maintenance of minimum levels of capital and surplus. We continue to maintain levels of aggregate excess statutory capital and surplus in our regulated health plan subsidiaries that we believe are appropriate. See further discussion under “Regulatory Capital and Dividend Restrictions” below. When available and as permitted by applicable regulations, cash in excess of the capital needs of our regulated health plan subsidiaries is generally paid in the form of dividends to our parent company to be used for general corporate purposes. The regulated health plan subsidiaries paid dividends to the parent company amounting to $997 million in 2024 and $705 million in 2023. \nParent company liquidity requirements generally consist of payment of administrative costs not directly incurred by our regulated operations, including, but not limited to, staffing costs, lease payments, branding and certain information technology services; capital contributions paid to our regulated health plan subsidiaries, including funding for newer health plans; capital expenditures; debt service; funding for common stock purchases, acquisitions and other growth-related activities; and federal tax payments. The parent company contributed capital of $490 million and $221 million in 2024 and 2023, respectively, to our regulated health plan subsidiaries to satisfy statutory capital and surplus requirements. The higher contributions in 2024 were mainly attributed to fund our California, Iowa, Nebraska, and Wisconsin health plans. Our parent company normally meets its liquidity requirements from administrative services fees earned under administrative services agreements; dividends received from our regulated subsidiaries; federal tax payments collected from the regulated subsidiaries; proceeds received from the issuance of debt and equity securities; and cash flows from investing activities, including investment income and sales of investments. \nCash, cash equivalents and investments at the parent company amounted to $445 million and $742 million as of December 31, 2024, and 2023, respectively. The decrease in 2024 was primarily due to funding of our Bright Health Medicare acquisition for $441 million and the purchase of approximately 3.1 million shares of our stock for $1.0 billion in the third and fourth quarter of 2024, partially offset by the $740 million net proceeds from issuing the new 6.250% Notes, net inflows from dividends received from and capital contributions made to our regulated health plan subsidiaries, and the timing of corporate payments. \nMolina Healthcare, Inc. 2024 Form 10-K | 44\nInvestments\nAfter considering expected cash flows from operating activities, we generally invest cash of regulated subsidiaries that exceeds our expected short-term obligations in longer term, investment-grade, and marketable debt securities to improve our overall investment return. These investments are made pursuant to board-approved investment policies which conform to applicable state laws and regulations. \nOur investment policies are designed to provide liquidity, preserve capital, and maximize total return on invested assets, all in a manner consistent with state requirements that prescribe the types of instruments in which our subsidiaries may invest. These investment policies require that our investments have final maturities of less than 15 years, or less than 15 years average life for structured securities. Professional portfolio managers operating under documented guidelines manage our investments and a portion of our cash equivalents. Our portfolio managers must obtain our prior approval before selling investments where the loss position of those investments exceeds certain levels. \nThe overall rating of our portfolio is AA-. Our investment policy has directives in conjunction with state guidelines to minimize risks and exposures in volatile markets. Additionally, our portfolio managers assist us in navigating the current volatility in the capital markets. \nOur restricted investments are invested principally in cash, cash equivalents, U.S. Treasury securities, and corporate debt securities; we have the ability to hold such restricted investments until maturity. All of our unrestricted investments are classified as current assets. \nCash Flow Activities\nOur cash flows are summarized as follows:\nYear Ended December 31,\n2024\n2023\nChange\n(In millions)\nNet cash provided by operating activities\n$\n644 \n$\n1,662 \n$\n(1,018)\nNet cash used in investing activities\n(464)\n(744)\n280 \nNet cash used in financing activities\n(347)\n(58)\n(289)\nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(167)\n$\n860 \n$\n(1,027)\nOperating Activities\nWe typically receive capitation payments monthly, in advance of payments for medical claims; however, government payors may adjust their payment schedules, positively or negatively impacting our reported cash flows from operating activities in any given period. For example, government payors may delay our premium payments, or they may prepay the following month’s premium payment. \nNet cash provided by operations was $644 million in 2024, compared with $1,662 million in 2023. The $1,018 million decrease in 2024 cash flow was due to timing differences in government receivables and payables, including the receipt of Medicare and Medicaid 2024 premium prepayments in the 2023 period, and increased risk corridor settlement activity in 2024. \nInvesting Activities\n \nNet cash used in investing activities was $464 million in 2024, compared with $744 million in 2023. The change in cash flow was primarily due to a $295 million net cash outflow related to the Bright Health Medicare acquisition in January 2024, and $49 million for final purchase consideration paid for the My Choice Wisconsin acquisition, offset by the net activity of proceeds and purchases of investments, which were net purchases of $21 million in 2024 and net purchases of $661 million in 2023. \nFinancing Activities\nNet cash used in financing activities was $347 million in 2024, compared with $58 million in 2023, a decrease in year-over-year cash flow of $289 million. In 2024, financing activity included $740 million of net proceeds from the issuance of the $750 million 6.250% Notes due 2033, offset by common stock purchases of $1,000 million and $300 million in gross borrowings and payments under the Credit Facility. In 2024 and 2023, cash outflows included $57 million and $60 million, respectively, for common stock withheld to settle employee tax obligations. \nMolina Healthcare, Inc. 2024 Form 10-K | 45\nFINANCIAL CONDITION\nWe believe that our cash resources, borrowing capacity available under our Credit Agreement as discussed further below in “Future Sources and Uses of Liquidity—Future Sources,” and internally generated funds will be sufficient to support our operations, regulatory requirements, debt repayment obligations and capital expenditures for at least the next 12 months.\nOn a consolidated basis, as of December 31, 2024, our working capital was $4.9 billion compared with $4.4 billion as of December 31, 2023. At December 31, 2024, our cash and investments amounted to $9.3 billion, compared with $9.4 billion of cash and investments at December 31, 2023. A significant portion of our portfolio is held in cash and cash equivalents and we do not anticipate the fluctuations in the aggregate fair value of our financial assets to have a material impact on our liquidity or capital position since we intend to hold our securities to maturity. Net unrealized losses on our investments classified as current and available for sale decreased to $75 million at December 31, 2024 compared to $108 million at December 31, 2023. We have determined that the unrealized losses primarily resulted from fluctuating interest rates, rather than a deterioration of the creditworthiness of the issuers. \nBecause of the statutory restrictions that inhibit the ability of our health plan subsidiaries to transfer net assets to us, the amount of retained earnings readily available to pay dividends to our stockholders is generally limited to cash, cash equivalents and investments held by our unregulated parent. For more information, see the “Liquidity”\n \ndiscussion presented above.\nRegulatory Capital and Dividend Restrictions \nEach of our regulated, wholly owned subsidiaries must maintain a minimum amount of statutory capital determined by statute or regulations. Such statutes, regulations and capital requirements also restrict the timing, payment and amount of dividends and other distributions, loans or advances that may be paid to us as the sole stockholder. To the extent our subsidiaries must comply with these regulations, they may not have the financial flexibility to transfer funds to us. Based upon current statutes and regulations, the minimum capital and surplus requirement for these subsidiaries was estimated to be approximately $2.6 billion at  December 31, 2024 and $2.3 billion at December 31, 2023. The aggregate capital and surplus of our wholly owned subsidiaries was in excess of these minimum capital requirements as of both dates. \nUnder applicable regulatory requirements, the amount of dividends that may be paid by our wholly owned subsidiaries without prior approval by regulatory authorities as of December 31, 2024, was approximately $400 million in the aggregate. The subsidiaries may pay dividends over this amount, but only after approval is granted by the regulatory authorities. \nBased on our cash and investments balances as of December 31, 2024, management believes that our regulated wholly owned subsidiaries remain well capitalized and exceed their regulatory minimum requirements. We have the ability, and have committed to provide, additional capital to each of our health plans as necessary to ensure compliance with minimum statutory capital and surplus requirements.\nCapital Structure\nIn October 2024, our board of directors authorized the purchase of up to $1 billion of our common stock. This new program supersedes the stock purchase program previously approved by our board of directors in September 2023 and extends through December 31, 2025. \nAs debt held by the parent company comes due, we typically engage in a new private offering of debt to retire and replace the prior issuance. In addition, on November 18, 2024 (the “Settlement Date”), we completed a private offering of $750 million aggregate principal amount of our 6.250% Senior Notes due 2033 (the “6.250% Notes”) pursuant to an indenture, dated as of the Settlement Date with U.S. Bank Trust Company and National Association, as trustee. The 6.250% Notes bear interest at a rate of 6.250% per year. Interest on the 6.250% Notes is payable semi-annually in arrears on January 15 and July 15 of each year, commencing July 15, 2025. Interest accrues from the Settlement Date. The 6.250% Notes will mature on January 15, 2033. \nFor several years we saw a continued decline in interest rates, which benefited our overall cost of capital during that time. However, interest rates have increased since we issued our 3.875% Notes due 2032 in 2021, as we experienced with our most recent issuance of our 6.250% Notes in 2024. Accordingly, future refinancing may occur at a higher rate than those we have achieved historically. This would increase our cost of capital in the future or may cause us to pursue alternative financing sources, should the need arise.\nWe are not a party to any off-balance sheet financing arrangements.\nMolina Healthcare, Inc. 2024 Form 10-K | 46\nDebt Ratings\nEach of our senior notes is rated “BB” by Standard & Poor’s, and “Ba2” by Moody’s Investor Service, Inc. A downgrade in our ratings could adversely affect our borrowing capacity and increase our borrowing costs. \nFinancial Covenants\nOur Credit Agreement contains customary non-financial and financial covenants, including a net leverage ratio and an interest coverage ratio. Such ratios are computed as defined by the terms of the Credit Agreement. \nIn addition, the indentures governing each of our outstanding senior notes contain cross-default provisions that are triggered upon default by us or any of our subsidiaries on any indebtedness in excess of the amount specified in the applicable indenture. As of December 31, 2024, we were in compliance with all financial and non-financial covenants under the Credit Agreement and other long-term debt.\nFUTURE SOURCES AND USES OF LIQUIDITY\nFuture Sources\nOur regulated subsidiaries generate significant cash flows from premium revenue, which is generally received a short time before related healthcare services are paid. Premium revenue is our primary source of liquidity. Thus, any decline in the receipt of premium revenue, and our profitability, could have a negative impact on our liquidity.\nDividends from Subsidiaries. \nWhen available and as permitted by applicable regulations, cash in excess of the capital needs of our regulated health plans is generally paid in the form of dividends to our unregulated parent company to be used for general corporate purposes. For more information on our regulatory capital requirements and dividend restrictions, refer to Notes to Consolidated Financial Statements, Note 15, “Commitments and Contingencies—Regulatory Capital Requirements and Dividend Restrictions,” and Note 17, “Condensed Financial Information of Registrant—Note C - Dividends and Capital Contributions.”\nCredit Agreement Borrowing Capacity.\n On September 20, 2024, we entered into a Second Amendment to our Credit Agreement, which, among other things, increased available commitments under our revolving credit facility (“Credit Facility”) to $1.25 billion, and extended the termination date of lending commitments to September 20, 2029. The Credit Agreement also provides for a $15 million swingline sub-facility and a $100 million letter of credit sub-facility, as well as incremental term loans available to finance certain acquisitions up to $800 million, plus an unlimited amount of such term loans as long as we maintain a minimum consolidated net leverage ratio. As of December 31, 2024, we had available borrowing capacity of $1.25 billion under the Credit Agreement. See further discussion in the Notes to Consolidated Financial Statements, Note 11, “Debt.” \nFuture Uses\nCommon Stock Purchases. \nIn October 2024, our board of directors authorized the purchase of up to $1 billion of our common stock. This new program extends through December 31, 2025 and supersedes the stock purchase program previously approved by our board of directors in September 2023. The exact timing and amount of any repurchase is determined by management based on market conditions and share price, in addition to other factors, and repurchases generally will be made in accordance with the volume, price, and timing parameters under Rule 10b-18 of the Securities Exchange Act of 1934, as amended. As of February 11, 2025, $500 million remained available to purchase our common stock under this program through December 31, 2025. See further information in the Notes to Consolidated Financial Statements, Note 13, “Stockholders' Equity.”\nAcquisitions\n. We have a disciplined and steady approach to growth. Organic growth, which includes leveraging our existing health plan portfolio and winning new territories, is our highest priority. In addition to organic growth, we will consider targeted acquisitions that are a strategic fit that we believe will leverage operational synergies, and lead to incremental earnings accretion. For further information on our acquisitions, refer to the Notes to Consolidated Financial Statements, Note 4, “Business Combinations.”\nConnecticut Acquisition—Marketplace and Medicare. \nEffective February 1, 2025, we closed on our acquisition of 100% of the issued and outstanding capital stock of ConnectiCare Holding Company, Inc. The purchase price for the transaction was $350 million.\nRegulatory Capital Requirements and Dividend Restrictions. \nWe have the ability, and have committed to provide, additional capital to each of our health plans as necessary to ensure compliance with minimum statutory capital requirements.\nThe Molina Healthcare Charitable Foundation.\n In 2020, we announced our formation of The Molina Healthcare Charitable Foundation (the “Foundation”), an independent not-for-profit charitable foundation. We have contributed \nMolina Healthcare, Inc. 2024 Form 10-K | 47\n$20 million to the Foundation on a cumulative basis as of December 31, 2024. Since 2021, the Molina Healthcare Charitable Foundation has funded over 800 grants to local community organizations in 27 states that address social determinants of health, disaster relief, behavioral health, maternal child health, and other health-related concerns that our afflicting our communities in need.\nContractual Obligations. \nWe are party to various contractual obligations that we will be required to satisfy over the short and long term. The majority are discussed in the Notes to Consolidated Financial Statements and primarily include the following: \n•\nMedical claims and benefits payable.\n See Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” and Note 10, “Medical Claims and Benefits Payable,” for further detail. \n•\nAmounts due government agencies.\n See Notes to Consolidated Financial Statements, Notes 2, “Significant Accounting Policies,” for further detail.\n•\nDebt obligations.\n See Notes to Consolidated Financial Statements, Note 11, “Debt,” for further detail of our long-term debt and the timing of expected future payments. Interest payments are paid semi-annually. \n•\nLeases.\n See Notes to Consolidated Financial Statements, Note 8, “Leases,” for further detail of our finance and operating lease obligations and the timing of expected future payments.  \nSome items are based on management’s estimates and assumptions about obligations, including duration, the possibility of renewal, anticipated actions by third parties, and other factors. Because these estimates and assumptions are necessarily subjective, the contractual obligations we will actually pay in future periods may vary. Additionally, we have a variety of other contractual agreements related to acquiring services used in our operations. However, we believe these other agreements do not contain material non-cancelable commitments. \nCRITICAL ACCOUNTING ESTIMATES\nWhen we prepare our consolidated financial statements, we use estimates and assumptions that may affect reported amounts and disclosures. Actual results could differ from these estimates, and some differences could be material. Our most significant accounting estimates, which include a higher degree of judgment and/or complexity, include the following:\n•\nMedical costs, claims and benefits payable. \nSee discussion below, and refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” and Note 10, “Medical Claims and Benefits Payable” for more information.\n•\nPremium Revenue Recognition and Amounts Due Government Agencies: Risk Adjustment.\n For a discussion of this topic, including amounts recorded in our consolidated financial statements, refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies.” \n•\nBusiness Combinations, and Goodwill and intangible assets, net.\n For a comprehensive discussion of this topic, including amounts recorded in our consolidated financial statements, refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” Note 4, “Business Combinations,” and Note 9, “Goodwill and Intangible Assets, Net.”\nMEDICAL CARE COSTS, MEDICAL CLAIMS AND BENEFITS PAYABLE\nMedical care costs are recognized in the period in which services are provided and include fee-for-service claims, pharmacy benefits, capitation payments to providers, and various other medically-related costs. Under fee-for-service claims arrangements with providers, we retain the financial responsibility for medical care provided and incur costs based on actual utilization of hospital and physician services. Such medical care costs include amounts paid by us as well as estimated medical claims and benefits payable for costs that were incurred but not paid as of the reporting date (“IBNP”). Pharmacy benefits represent payments for members' prescription drug costs, net of rebates from drug manufacturers. We estimate pharmacy rebates based on historical and current utilization of prescription drugs and contractual provisions. Capitation payments represent monthly contractual fees paid to providers, who are responsible for providing medical care to members, which could include medical or ancillary costs like dental, vision and other supplemental health benefits. Such capitation costs are fixed in advance of the periods covered and are not subject to significant accounting estimates. Other medical care costs include all medically-related administrative costs, amounts due to providers pursuant to risk-sharing or other incentive arrangements, provider claims, claim overpayment recoveries, and other healthcare expenses. Examples of medically-related administrative costs include expenses relating to health education, quality assurance, case management, care coordination, disease management, and 24-hour on-call nurses. Additionally, we include an estimate for the cost of settling claims incurred through the reporting date in our medical claims and benefits payable liability.\nMolina Healthcare, Inc. 2024 Form 10-K | 48\nThe following table illustrates consolidated medical care costs by type for the periods indicated: \n \nYear Ended December 31,\n \n2024\n2023\nAmount\n% of\nTotal\nAmount\n% of\nTotal\n(In millions)\nFee-for-service\n$\n25,386 \n73.7 \n%\n$\n21,415 \n74.7 \n%\nPharmacy\n4,331 \n12.6 \n3,987 \n13.9 \nCapitation\n3,048 \n8.9 \n1,651 \n5.8 \nOther\n1,663 \n4.8 \n1,616 \n5.6 \nTotal\n$\n34,428 \n100.0 \n%\n$\n28,669 \n100.0 \n%\nMedical claims and benefits payable consist mainly of fee-for-service IBNP, unpaid pharmacy claims, capitation costs, other medical costs, including amounts payable to providers pursuant to risk-sharing or other incentive arrangements, and amounts payable to providers on behalf of certain state agencies for certain state assessments in which we assume no financial risk. IBNP includes the costs of claims incurred as of the balance sheet date which have been reported to us, and our best estimate of the cost of claims incurred but not yet reported to us. When more complete claims payment information and healthcare cost trend data becomes available, we reflect changes in these estimates as an increase or decrease to medical care costs in the consolidated results of operations in the period in which they are determined.\nThe estimation of the IBNP liability requires a significant degree of judgment in applying actuarial methods, determining the appropriate assumptions and considering numerous factors. Of those factors, we consider estimated completion factors (measures the cumulative percentage of claims expense that will ultimately be paid for a given month of service based on historical payment patterns) and the assumed healthcare cost trend (the year-over-year change in per-member per-month medical care costs) to be the most critical assumptions. Other relevant factors also include, but are not limited to, healthcare service utilization trends, claim inventory levels, changes in membership, product mix, seasonality, benefit changes or changes in fee schedules, provider contract changes, prior authorizations and the incidence of catastrophic or pandemic cases.\nFor claims incurred more than three months before the financial statement date, we mainly use estimated completion factors to estimate the ultimate cost of those claims. Completion factors measure the cumulative percentage of claims expense that will ultimately be paid for a given month of service based on historical claims payment patterns. We analyze historical claims payment patterns by comparing claim incurred dates to claim payment dates to estimate completion factors. The estimated completion factors are then applied to claims paid through the financial statement date to estimate the ultimate claims cost for a given month’s incurred claim activity. The difference between the estimated ultimate claims cost and the claims paid through the financial statement date represents our estimate of claims remaining to be paid as of the financial statement date and is included in our IBNP liability\n.\nFor claims incurred within three months before the financial statement date, actual claims paid are a less reliable measure of our ultimate cost since a large portion of medical claims are not submitted to us until several months after services have been provided. Accordingly, we estimate our IBNP liability for claims incurred during these months based on a blend of estimated completion factors and assumed medical care cost trend. The assumed medical care cost trend represents the year-over-year change in per-member per-month medical care costs, which can be affected by many factors including, but not limited to, our ability and practices to manage medical and pharmaceutical costs, changes in level and mix of services utilized, mix of benefits offered, including the impact of co-pays and deductibles, changes in medical practices, changes in member demographics, catastrophes and epidemics\n,\n and other relevant factors.\nActuarial standards of practice generally require a level of confidence such that our overall best estimate of the IBNP liability has a greater probability of being adequate versus being insufficient, where the liability is sufficient to account for moderately adverse conditions. Accordingly, our reserving practice is to consistently recognize the actuarial best estimate including a provision for moderately adverse conditions for each current period. This provision is reported as part of “Components of medical care costs related to: Current year” in the table presented in Note 10, “Medical Claims and Benefits Payable.” Adverse conditions are situations that may cause actual claims to be higher than the otherwise estimated value of such claims at the time of the estimate, such as changes in the magnitude or severity of claims, uncertainties related to our entry into new geographical markets or provision of \nMolina Healthcare, Inc. 2024 Form 10-K | 49\nservices to new populations, changes in state-controlled fee schedules, and modifications or upgrades to our claims processing systems and practices. Therefore, in many situations, the claim amounts ultimately settled will be less than the estimate that satisfies the actuarial standards of practice. \nWhen subsequent actual claims payments are less than we estimated, we recognize a benefit for favorable prior period development that is reported as part of “Components of medical care costs related to: Prior years” in the table presented in Note 10. Assuming stability in the size of our membership, the use of this consistent methodology, during any given period, usually results in the replenishment of reserves at a level that generally offsets the benefit of favorable prior period development in that period. In the case of material growth or decline of membership, replenishment can exceed or fall short of the favorable development, assuming all other factors remain unchanged.\nBecause of the significant degree of judgment involved in estimation of our IBNP liability, there is considerable variability and uncertainty inherent in such estimates. The following table reflects the hypothetical change in our estimate of claims liability as of December 31, 2024 that would result if we change our completion factors for the fourth through the twelfth months preceding December 31, 2024, by the percentages indicated. A reduction in the completion factor results in an increase in medical claims liabilities. Dollar amounts are in millions.\nIncrease (Decrease) in Estimated Completion Factors\nIncrease \n(Decrease) \nin Medical Claims \nand\nBenefits Payable\n(6)%\n$\n1,139 \n(4)%\n759 \n(2)%\n380 \n2%\n(380)\n4%\n(759)\n6%\n(1,139)\nThe following table reflects the hypothetical change in our estimate of claims liability as of December 31, 2024 that would result if we alter our assumed medical care cost trend factors by the percentages indicated. An increase in the PMPM costs results in an increase in medical claims liabilities. Dollar amounts are in millions.\n(Decrease) Increase in Trended Per Member Per Month Cost Estimates\n(Decrease) \nIncrease \nin Medical Claims \nand\nBenefits Payable\n(6)%\n$\n(394)\n(4)%\n(262)\n(2)%\n(131)\n2%\n131 \n4%\n262 \n6%\n394 \nThere are many related factors working in conjunction with one another that determine the accuracy of our estimates, some of which are qualitative in nature rather than quantitative. Therefore, we are seldom able to quantify the impact that any single factor has on a change in estimate. Given the variability inherent in the reserving process, we will only be able to identify specific factors if they represent a significant departure from expectations. As a result, we do not expect to be able to fully quantify the impact of individual factors on changes in estimates.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nRefer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” for a discussion of recent accounting pronouncements that affect us.\nMolina Healthcare, Inc. 2024 Form 10-K | 50\nItem 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nOur earnings and financial position are exposed to financial market risk relating to changes in interest rates, and the resulting impact on investment income and interest expense.\nSubstantially all of our investments and restricted investments are subject to interest rate risk and will decrease in value if market interest rates increase. Assuming a hypothetical and immediate 1% increase in market interest rates at December 31, 2024, the fair value of our fixed income investments would decrease by approximately $112 million. Declines in interest rates over time will reduce our investment income.\nFor further information on fair value measurements and our investment portfolio, please refer to the Notes to Consolidated Financial Statements, Note 5, “Fair Value Measurements,” and Note 6, “Investments.”\nBorrowings under the Credit Agreement bear interest based, at our election, on a base rate or other defined rate, plus, in each case, the applicable margin. Our notes bear interest at specified rates, each payable semiannually in arrears. For further information, see Notes to Consolidated Financial Statements, Note 11, “Debt.”\nMolina Healthcare, Inc. 2024 Form 10-K | 51\nItem 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n \n \nPage\nReport of Independent Registered Public Accounting Firm\n53\nAudited Consolidated Financial Statements:\nConsolidated Statements of Income\n55\nConsolidated Statements of Comprehensive Income\n55\nConsolidated Balance Sheets\n56\nConsolidated Statements of Stockholders’ Equity\n57\nConsolidated Statements of Cash Flows\n58\nNotes to Consolidated Financial Statements\n60\nMolina Healthcare, Inc. 2024 Form 10-K | 52\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Molina Healthcare, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Molina Healthcare, Inc. (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nIncurred but not paid (IBNP) claims reserves\nDescription of the Matter\nAs of December 31, 2024, the Company’s liability for fee-for-service claims incurred but not paid (“IBNP”) comprised $3,085 million of the $4,640 million of Medical Claims and Benefits Payable. As described in Note 10 to the consolidated financial statements, the Company’s IBNP liability is determined using actuarial methods that include a number of factors and assumptions, including completion factors, which seek to measure the cumulative percentage of claims expense that will be paid for a given month of service as of the reporting date, based on historical payment patterns, and assumed health care cost trend factors, which represent an estimate of claims expense based on recent claims expense levels and healthcare cost levels. There is significant uncertainty inherent in determining management’s best estimate of completion and trend factors, which are used to calculate actuarial estimates of incurred but not paid claims.                            \nMolina Healthcare, Inc. 2024 Form 10-K | 53\nAuditing management's estimate of the IBNP liability was complex and required the involvement of our actuarial specialists due to the highly judgmental nature of the completion factors and healthcare cost trend assumptions used in the valuation process. The significant judgment was primarily due to the sensitivity of management's best estimate of completion factors and healthcare cost trend assumptions, which have a significant impact on the valuation of the IBNP liability.\nHow we addressed the matter in our audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of the Company’s controls over the process for estimating the IBNP liability. This included testing management review controls over completion factors and healthcare cost trend assumptions, and management’s review and approval of actuarial methods used to calculate the IBNP liability, including the data inputs and outputs of those models.\nTo test the IBNP liability, our audit procedures included, among others, testing the completeness and accuracy of data used in the calculation by testing reconciliations of underlying claims and membership data recorded in source systems to the actuarial reserving calculations, and comparing a sample of claims to source documentation. With the assistance of actuarial specialists, we (1) analyzed the Company’s completion and trend factor assumptions based on historical claim experience and healthcare cost trends by independently calculating a range of reasonable reserve estimates for comparison to management’s best estimate of the liability for incurred but not paid claims and (2) performed a review of the prior period IBNP liabilities for incurred but not paid claims using subsequent claims development. Additionally, we reviewed and evaluated management’s disclosures surrounding the IBNP liability. \n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 2000. \nLos Angeles, California\nFebruary 11, 2025 \nMolina Healthcare, Inc. 2024 Form 10-K | 54\nCONSOLIDATED STATEMENTS OF INCOME\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions, except per-share data)\nRevenue:\nPremium revenue\n$\n38,627\n \n$\n32,529\n \n$\n30,883\n \nPremium tax revenue\n1,486\n \n1,069\n \n873\n \nInvestment income\n452\n \n394\n \n143\n \nOther revenue\n85\n \n80\n \n75\n \nTotal revenue\n40,650\n \n34,072\n \n31,974\n \nOperating expenses:\nMedical care costs\n34,428\n \n28,669\n \n27,175\n \nGeneral and administrative expenses\n2,743\n \n2,462\n \n2,311\n \nPremium tax expenses\n1,486\n \n1,069\n \n873\n \nDepreciation and amortization\n186\n \n171\n \n176\n \nImpairment\n—\n \n—\n \n208\n \nOther\n100\n \n128\n \n58\n \nTotal operating expenses\n38,943\n \n32,499\n \n30,801\n \nOperating income\n1,707\n \n1,573\n \n1,173\n \nInterest expense\n118\n \n109\n \n110\n \nIncome before income tax expense\n1,589\n \n1,464\n \n1,063\n \nIncome tax expense\n410\n \n373\n \n271\n \nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nNet income per share:\nBasic\n$\n20.52\n \n$\n18.91\n \n$\n13.72\n \nDiluted\n$\n20.42\n \n$\n18.77\n \n$\n13.55\n \nWeighted average shares outstanding:\nBasic\n57.4\n \n57.7\n \n57.8\n \nDiluted\n57.7\n \n58.1\n \n58.5\n \nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nOther comprehensive income (loss):\nUnrealized investment income (loss)\n33\n \n102\n \n(\n204\n)\nLess: effect of income taxes\n8\n \n24\n \n(\n49\n)\nOther comprehensive income (loss), net of tax\n25\n \n78\n \n(\n155\n)\nComprehensive income\n$\n1,204\n \n$\n1,169\n \n$\n637\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 55\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n2024\n2023\n(Dollars in millions,\nexcept per-share amounts)\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n4,662\n \n$\n4,848\n \nInvestments\n4,325\n \n4,259\n \nReceivables\n3,299\n \n3,104\n \nPrepaid expenses and other current assets\n487\n \n331\n \nTotal current assets\n12,773\n \n12,542\n \nProperty, equipment, and capitalized software, net\n288\n \n270\n \nGoodwill and intangible assets, net\n1,938\n \n1,449\n \nRestricted investments\n286\n \n261\n \nDeferred income taxes, net \n207\n \n227\n \nOther assets\n138\n \n143\n \nTotal assets\n$\n15,630\n \n$\n14,892\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nMedical claims and benefits payable\n$\n4,640\n \n$\n4,204\n \nAmounts due government agencies \n1,874\n \n2,294\n \nAccounts payable, accrued liabilities and other\n1,331\n \n1,252\n \nDeferred revenue\n51\n \n418\n \nTotal current liabilities\n7,896\n \n8,168\n \nLong-term debt\n2,923\n \n2,180\n \nFinance lease liabilities\n195\n \n205\n \nOther long-term liabilities\n120\n \n124\n \nTotal liabilities\n11,134\n \n10,677\n \nStockholders’ equity:\nCommon stock, $\n0.001\n par value per share; \n150\n million shares authorized; outstanding: \n56\n million shares at December 31, 2024, and \n58\n million at December 31, 2023\n—\n \n—\n \nPreferred stock, $\n0.001\n par value per share; \n20\n million shares authorized, \nno\n shares issued and outstanding\n—\n \n—\n \nAdditional paid-in capital\n462\n \n410\n \nAccumulated other comprehensive loss\n(\n57\n)\n(\n82\n)\nRetained earnings\n4,091\n \n3,887\n \nTotal stockholders’ equity\n4,496\n \n4,215\n \nTotal liabilities and stockholders’ equity\n$\n15,630\n \n$\n14,892\n \n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 56\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nCommon Stock\nAdditional\nPaid-in\nCapital\nAccumulated\nOther\nComprehensive (Loss) Income\nRetained\nEarnings\nTotal\nOutstanding\nAmount\n(In millions)\nBalance at December 31, 2021\n58\n \n$\n—\n \n$\n236\n \n$\n(\n5\n)\n$\n2,399\n \n$\n2,630\n \nNet income\n— \n— \n— \n— \n792\n \n792\n \nCommon stock purchases\n(\n1\n)\n— \n(\n5\n)\n— \n(\n395\n)\n(\n400\n)\nOther comprehensive loss, net\n— \n— \n— \n(\n155\n)\n— \n(\n155\n)\nShare-based compensation\n1\n \n— \n97\n \n— \n— \n97\n \nBalance at December 31, 2022\n58\n \n—\n \n328\n \n(\n160\n)\n2,796\n \n2,964\n \nNet income\n— \n— \n— \n— \n1,091\n \n1,091\n \nOther comprehensive income, net\n— \n— \n— \n78\n \n— \n78\n \nShare-based compensation\n— \n— \n82\n \n— \n— \n82\n \nBalance at December 31, 2023\n58\n \n—\n \n410\n \n(\n82\n)\n3,887\n \n4,215\n \nNet income\n— \n— \n— \n— \n1,179\n \n1,179\n \nCommon stock purchases \n(\n3\n)\n— \n(\n25\n)\n— \n(\n975\n)\n(\n1,000\n)\nStock purchase excise tax \n— \n— \n(\n8\n)\n— \n— \n(\n8\n)\nOther comprehensive income, net\n— \n— \n— \n25\n \n— \n25\n \nShare-based compensation\n1\n \n— \n85\n \n— \n— \n85\n \nBalance at December 31, 2024\n56\n \n$\n—\n \n$\n462\n \n$\n(\n57\n)\n$\n4,091\n \n$\n4,496\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 57\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nOperating activities:\nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n186\n \n171\n \n176\n \nDeferred income taxes\n53\n \n(\n31\n)\n(\n66\n)\nShare-based compensation\n116\n \n115\n \n103\n \nImpairment \n—\n \n—\n \n208\n \nOther, net\n8\n \n2\n \n8\n \nChanges in operating assets and liabilities, net of the effect of acquisitions:\nReceivables\n(\n78\n)\n(\n778\n)\n(\n95\n)\nPrepaid expenses and other current assets\n(\n57\n)\n(\n69\n)\n(\n124\n)\nMedical claims and benefits payable\n(\n40\n)\n580\n \n153\n \nAmounts due government agencies \n(\n453\n)\n196\n \n(\n428\n)\nAccounts payable, accrued liabilities and other\n115\n \n328\n \n55\n \nDeferred revenue\n(\n367\n)\n59\n \n(\n11\n)\nIncome taxes\n(\n18\n)\n(\n2\n)\n2\n \nNet cash provided by operating activities\n644\n \n1,662\n \n773\n \nInvesting activities:\nPurchases of investments\n(\n1,132\n)\n(\n1,433\n)\n(\n1,913\n)\nProceeds from sales and maturities of investments\n1,111\n \n772\n \n1,398\n \nNet cash paid in business combinations\n(\n344\n)\n(\n3\n)\n(\n134\n)\nPurchases of property, equipment and capitalized software\n(\n100\n)\n(\n84\n)\n(\n91\n)\nOther, net\n1\n \n4\n \n(\n50\n)\nNet cash used in investing activities\n(\n464\n)\n(\n744\n)\n(\n790\n)\nFinancing activities:\nCommon stock purchases\n(\n1,000\n)\n—\n \n(\n400\n)\nProceeds from senior notes offerings, net of issuance costs \n740\n \n—\n \n—\n \nProceeds from borrowings under credit facility\n300\n \n—\n \n—\n \nRepayment of credit facility\n(\n300\n)\n—\n \n—\n \nCommon stock withheld to settle employee tax obligations\n(\n57\n)\n(\n60\n)\n(\n54\n)\nContingent consideration liabilities settled\n—\n \n—\n \n(\n20\n)\nOther, net\n(\n30\n)\n2\n \n33\n \nNet cash used in financing activities\n(\n347\n)\n(\n58\n)\n(\n441\n)\nNet (decrease) increase in cash and cash equivalents, and restricted cash and cash equivalents\n(\n167\n)\n860\n \n(\n458\n)\nCash and cash equivalents, and restricted cash and cash equivalents at beginning of period\n4,908\n \n4,048\n \n4,506\n \nCash and cash equivalents, and restricted cash and cash equivalents at end of period\n$\n4,741\n \n$\n4,908\n \n$\n4,048\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 58\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(continued)\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nSupplemental cash flow information:\nCash paid during the period for:\nIncome taxes, net\n$\n379\n \n$\n405\n \n$\n340\n \nInterest\n$\n121\n \n$\n108\n \n$\n108\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 59\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. \nOrganization and Basis of Presentation \nOrganization and Operations\nMolina Healthcare, Inc. provides managed healthcare services under the Medicaid and Medicare programs, and through the state insurance marketplaces (the “Marketplace”). Molina was founded in 1980 as a provider organization serving low-income families in Southern California and reincorporated in Delaware in 2002. We currently have \nfour\n reportable segments consisting of: 1) Medicaid; 2) Medicare; 3) Marketplace; and 4) Other. Our reportable segments are consistent with how we currently manage the business and view the markets we serve. \nAs of December 31, 2024, we served approximately \n5.5\n million members eligible for government-sponsored healthcare programs, located across \n21\n states. \nOur state Medicaid contracts typically have terms of \nthree\n to \nfive years\n, contain renewal options exercisable by the state Medicaid agency, and allow either the state or the health plan to terminate the contract with or without cause. Such contracts are subject to risk of loss in states that issue requests for proposal (“RFP”) open to competitive bidding by other health plans. If one of our health plans is not a successful responsive bidder to a state RFP, its contract may not be renewed.\nIn addition to contract renewal, our state Medicaid contracts may be periodically amended to include or exclude certain health benefits (such as pharmacy services, behavioral health services, or long-term care services); populations such as the aged, blind or disabled (“ABD”); and regions or service areas.\nIn Medicare, we enter into Medicare Advantage-Part D contracts with the Centers for Medicare and Medicaid Services (“CMS”) annually, and for dual-eligible programs, we enter into contracts with CMS, in partnership with each state’s department of health and human services. Such contracts typically have terms of \none\n to \nthree years\n.\nIn Marketplace, we enter into contracts with CMS, which end on December 31 of each year and must be renewed annually. \nConsolidation and Presentation\nThe consolidated financial statements include the accounts of Molina Healthcare, Inc., and its subsidiaries. All significant inter-company balances and transactions have been eliminated in consolidation. Financial information related to subsidiaries acquired during any year is included only for periods subsequent to their acquisition. In the opinion of management, all adjustments considered necessary for a fair presentation of the results as of the date and for the periods presented have been included; such adjustments consist of normal recurring adjustments.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities. Estimates also affect the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\n \n2. \nSignificant Accounting Policies\n \nCash and Cash Equivalents\nCash and cash equivalents consist of cash and short-term, highly liquid investments that are both readily convertible into known amounts of cash and have a maturity of three months or less on the date of purchase. The following table provides a reconciliation of cash, cash equivalents, and restricted cash and cash equivalents reported within the accompanying consolidated balance sheets that sum to the total of the same such amounts presented in the accompanying consolidated statements of cash flows.\n \nThe restricted cash and cash equivalents presented below are included in “Restricted investments” in the accompanying consolidated balance sheets. \nMolina Healthcare, Inc. 2024 Form 10-K | 60\nDecember 31,\n2024\n2023\n2022\n(In millions)\nCash and cash equivalents\n$\n4,662\n \n$\n4,848\n \n$\n4,006\n \nRestricted cash and cash equivalents\n79\n \n60\n \n42\n \nTotal cash and cash equivalents, and restricted cash and cash equivalents presented in the consolidated statements of cash flows\n$\n4,741\n \n$\n4,908\n \n$\n4,048\n \nInvestments\nOur investments are principally held in debt securities, which are grouped into two separate categories for accounting and reporting purposes: available-for-sale securities and held-to-maturity securities. Available-for-sale (“AFS”) securities are recorded at fair value and unrealized gains and losses, if any, are recorded in stockholders’ equity as other comprehensive income, net of applicable income taxes. Held-to-maturity (“HTM”) securities are recorded at amortized cost, which approximates fair value, and unrealized holding gains or losses are not generally recognized. Realized gains and losses and unrealized losses arising from credit-related factors with respect to AFS and HTM securities are included in the determination of net income. The cost of securities sold is determined using the specific-identification method.\nOur investment policy requires that all of our investments have final maturities of less than \n15\n years, or less than \n15\n years average life for structured securities. Investments and restricted investments are subject to interest rate risk and will decrease in value if market rates increase. Declines in interest rates over time will reduce our investment income.\nIn general, our AFS securities are classified as current assets without regard to the securities’ contractual maturity dates because they may be readily liquidated. We monitor our investments for credit-related impairment.\n For comprehensive discussions of the fair value and classification of our investments, see Note 5, “Fair Value Measurements,” and Note 6, “Investments.”\nAccrued interest receivable relating to our AFS and HTM securities is presented within “Prepaid expenses and other current assets” in the accompanying consolidated balance sheets, and amounted to $\n56\n million and $\n53\n million at December 31, 2024, and 2023, respectively. We do not measure an allowance for credit losses on accrued interest receivable. Instead, we write off accrued interest receivable that has not been collected within 90 days of the interest payment due date. We recognize such write-offs as a reversal of investment income. No accrued interest was written off during the years ended December 31, 2024, 2023, and 2022.\nReceivables\nReceivables consist primarily of premium amounts due from government agencies, which are subject to potential retroactive adjustments, as well as pharmacy rebates and other receivables. Government receivables amounted to $\n2,223\n million and $\n2,354\n million at December 31, 2024 and 2023, respectively. We apply the current expected credit loss model to measure expected credits losses on our receivables based on available information about past events, current conditions and reasonable and supportable forecasts. Because substantially all of our receivable amounts are readily determinable and substantially all of our creditors are governmental authorities, our allowance for credit losses is insignificant. Any amounts determined to be uncollectible are charged to expense when such determination is made.\nBusiness Combinations\nWe account for business combinations using the acquisition method of accounting, which requires us to recognize the assets acquired and the liabilities assumed at their acquisition date fair values. As discussed below, the excess of the purchase consideration transferred over the fair value of the net tangible and intangible assets acquired is recorded as goodwill. While we use our best estimates and assumptions to accurately value assets acquired and liabilities assumed at the acquisition date, our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Measurement period adjustments are recorded in the period in which they are determined, as if they had been completed at the acquisition date. Upon the conclusion of the final determination of the values of assets acquired or liabilities assumed, or one year after the date of acquisition, whichever comes first, any subsequent adjustments are recorded within our consolidated results of operations.\n \nRefer to Note 4, “Business Combinations,” and Note 9, “Goodwill and Intangible Assets, Net,” for further details.\nMolina Healthcare, Inc. 2024 Form 10-K | 61\nLong-Lived Assets, including Intangible Assets\nLong-lived assets consist primarily of property, equipment, capitalized software (see Note 7, “Property, Equipment, and Capitalized Software, Net”), and intangible assets resulting from acquisitions. Long-lived assets are subject to impairment tests when events or circumstances indicate that the asset’s (or asset group’s) carrying value may not be recoverable. Finite-lived, separately-identified intangible assets acquired in business combinations are assets that represent future expected benefits but lack physical substance (such as purchased contract rights and provider contracts). Intangible assets are initially recorded at fair value and are then amortized on a straight-line basis over their expected useful lives, generally between \nfive\n and \n16\n years.\nDetermining the useful life of an intangible asset also requires judgment, as different types of intangible assets will have different useful lives. The most significant intangible asset we typically record in a business combination is contract rights associated with membership acquired. In determining the estimated fair value of the intangible assets, we typically apply the income approach, which discounts the projected future net cash flows using an appropriate discount rate that reflects the risk associated with such projected future cash flows. The most critical assumptions used in determining the fair value of contract rights include forecasted operating margins and the weighted average cost of capital.\nOur intangible assets are subject to impairment tests when events or circumstances indicate that a finite-lived intangible asset’s (or asset group’s) carrying value may not be recoverable. Consideration is given to a number of potential impairment indicators, including the ability of our health plan subsidiaries to obtain the renewal by amendment of their contracts in each state prior to the actual expiration of their contracts. However, there can be no assurance that these contracts will continue to be renewed. Following the identification of any potential impairment indicators, to determine whether an impairment exists, we would compare the carrying amount of a finite-lived intangible asset with the greater of the undiscounted cash flows that are expected to result from the use of the asset or related group of assets, or its value under the asset liquidation method. If it is determined that the carrying amount of the asset is not recoverable, the amount by which the carrying value exceeds the estimated fair value is recorded as an impairment. Determining the fair value of separately identifiable intangible assets requires management to make estimates, which are based on all available information and in some cases assumptions with respect to the timing and amount of future revenues and expenses associated with an asset. Refer to Note 9, “Goodwill and Intangible Assets, Net,” for further details.\nGoodwill\nGoodwill represents the excess of the purchase consideration over the fair value of net assets acquired in business combinations. Goodwill is not amortized but is tested for impairment on an annual basis and more frequently if impairment indicators are present. Impairment indicators may include experienced or expected operating cash-flow deterioration or losses, significant losses of membership, loss of state funding, loss of state contracts, and other factors. Goodwill is impaired if the carrying amount of a reporting unit exceeds its estimated fair value. This excess is recorded as an impairment loss and adjusted if necessary for the impact of tax-deductible goodwill. The loss recognized may not exceed the total goodwill allocated to the reporting unit. \nWhen testing goodwill for impairment, we may first assess qualitative factors, such as industry and market factors, the dynamic economic and political environments in which we operate, cost factors, and changes in overall performance, to determine if it is more likely than not that the carrying value of our reporting units exceed their estimated fair values. If our qualitative assessment indicates that it is more likely than not that the carrying value of a reporting unit exceeds its estimated fair value, we perform the quantitative assessment. We may also elect to bypass the qualitative assessment and proceed directly to the quantitative assessment. We performed a qualitative goodwill assessment of our reporting units in the fourth quarter of 2024, and did not identify any factors indicating that the carrying value of our reporting units exceeded their estimated fair values. \nIf performing a quantitative assessment, we generally estimate the fair values of our reporting units by applying the income approach, using discounted cash flows. The base year in the reporting units’ discounted cash flows is derived from the annual financial planning cycle, which commences in the fourth quarter of the year. As part of a quantitative assessment, we may also apply the asset liquidation method to estimate the fair value of individual reporting units, which is computed as total assets minus total liabilities, excluding intangible assets and deferred taxes. Finally, we apply a market approach to reconcile the value of our reporting units to our consolidated market value. Under the market approach, we consider publicly-traded comparable company information to determine revenue and earnings multiples which are used to estimate our reporting units’ fair values. The assumptions used are consistent with those used in our long-range business plan and annual planning process. However, if these assumptions differ from actual results, the outcome of our goodwill impairment tests could be adversely affected.\nMolina Healthcare, Inc. 2024 Form 10-K | 62\nLeases\nRight-of-use (“ROU”) assets represent our right to use the underlying assets over the lease term, and lease liabilities represent our obligation for lease payments arising from the related leases. ROU assets and lease liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. Lease terms may include options to extend or terminate the lease when we believe it is reasonably certain that we will exercise such options. If applicable, we account for lease and non-lease components within a lease as a single lease component.\nBecause most of our leases do not provide an implicit interest rate, we generally use our incremental borrowing rate to determine the present value of lease payments. Lease expenses for operating lease payments are recognized on a straight-line basis over the lease term, and the related ROU assets and liabilities are reduced to the present value of the remaining lease payments at the end of each period. Finance lease payments reduce finance lease liabilities, the related ROU assets are amortized on a straight-line basis over the lease term, and interest expense is recognized using the effective interest method.\nThe significant majority of our operating leases consist of long-term operating leases for office space. Short-term leases (those with terms of 12 months or less) are not recorded as ROU assets or liabilities in the consolidated balance sheets. For certain leases that represent a portfolio of similar assets, such as a fleet of vehicles, we apply a portfolio approach to account for the related ROU assets and liabilities, rather than account for such assets and the related liabilities individually. A nominal number of our lease agreements include rental payments that adjust periodically for inflation. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\n Refer to Note 8, “Leases,” for further details.\nMedical Claims and Benefits Payable\nMedical care costs are recognized in the period in which services are provided and include fee-for-service claims, pharmacy benefits, capitation payments to providers, and various other medically-related costs. Under fee-for-service claims arrangements with providers, we retain the financial responsibility for medical care provided and incur costs based on actual utilization of hospital and physician services. Such medical care costs include amounts paid by us as well as estimated medical claims and benefits payable for costs that were incurred but not paid as of the reporting date (“IBNP”). Pharmacy benefits represent payments for members' prescription drug costs, net of rebates from drug manufacturers. We estimate pharmacy rebates based on historical and current utilization of prescription drugs and contractual provisions. Capitation payments represent monthly contractual fees paid to providers, who are responsible for providing medical care to members, which could include medical or ancillary costs like dental, vision and other supplemental health benefits. Such capitation costs are fixed in advance of the periods covered and are not subject to significant accounting estimates. Other medical care costs include all medically-related administrative costs, amounts due to providers pursuant to risk-sharing or other incentive arrangements, provider claims, claim overpayment recoveries, and other healthcare expenses. Examples of medically-related administrative costs include expenses relating to health education, quality assurance, case management, care coordination, disease management, and 24-hour on-call nurses. Additionally, we include an estimate for the cost of settling claims incurred through the reporting date in our medical claims and benefits payable liability\n.\n \nMedical claims and benefits payable consist mainly of fee-for-service IBNP, unpaid pharmacy claims, capitation costs, other medical costs, including amounts payable to providers pursuant to risk-sharing or other incentive arrangements, and amounts payable to providers on behalf of certain state agencies for certain state assessments in which we assume no financial risk\n. \nIBNP includes the costs of claims incurred as of the balance sheet date which have been reported to us, and our best estimate of the cost of claims incurred but not yet reported to us. When more complete claims payment information and healthcare cost trend data becomes available, we reflect changes in these estimates as an increase or decrease to medical care costs in the consolidated results of operations in the period in which they are determined. \nThe estimation of the IBNP liability requires a significant degree of judgment in applying actuarial methods, determining the appropriate assumptions and considering numerous factors. Of those factors, we consider estimated completion factors and the assumed healthcare cost trend to be the most critical assumptions. Other relevant factors also include, but are not limited to, healthcare service utilization trends, claim inventory levels, changes in membership, product mix, seasonality, benefit changes or changes in Medicaid fee schedules, provider contract changes, prior authorizations and the incidence of catastrophic or pandemic cases.\nBecause of the significant degree of judgment involved in estimation of our IBNP liability, there is considerable variability and uncertainty inherent in such estimates. Each reporting period, the recognized IBNP liability represents our best estimate of the total amount of unpaid claims incurred as of the balance sheet date using a consistent \nMolina Healthcare, Inc. 2024 Form 10-K | 63\nmethodology in estimating our IBNP liability, including a provision for moderately adverse conditions for each current period. We believe our current estimates are reasonable and adequate; however, the development of our estimate is a continuous process that we monitor and update as more complete claims payment information and healthcare cost trend data becomes available. Actual medical care costs may be less than we previously estimated (favorable development) or more than we previously estimated (unfavorable development), and any differences could be material. Any adjustments to reflect favorable development would be recognized as a decrease to medical care costs, and any adjustments to reflect unfavorable development would be recognized as an increase to medical care costs\n,\n in the period in which the adjustments are determined. \nRefer to Note 10, “Medical Claims and Benefits Payable,” for a table presenting the components of the change in our medical claims and benefits payable, for all periods presented in the accompanying consolidated financial statements.\nPremium Revenue Recognition and Amounts Due Government Agencies\nPremium revenue is generated from our contracts with state and federal agencies, in connection with our participation in the Medicaid, Medicare, and Marketplace programs. Premium revenue is generally received based on per member per month (“PMPM”) rates established in advance of the periods covered. These premium revenues are recognized in the month that members are entitled to receive healthcare services, and premiums collected in advance are deferred. Many of our contracts contain provisions that may adjust or limit revenue or profit. Consequently, we recognize premium revenue as it is earned under such provisions. Liabilities accrued for premiums to be returned under such provisions are reported in the aggregate as “Amounts due government agencies” in the accompanying consolidated balance sheets. State Medicaid programs and the federal Medicare program periodically adjust premium rates, including certain components of premium revenue that are subject to accounting estimates further discussed below.\nMinimum MLR, Medical Cost Corridors and Profit Sharing.\n \nA portion of our Medicaid premium revenue may be returned if certain minimum amounts are not spent on defined medical care costs as a percentage of premium revenue, or minimum medical loss ratio (“Minimum MLR”). Under certain medical cost corridor provisions, the health plans may receive additional premiums if amounts spent on medical care costs exceed a defined maximum threshold. This includes remaining risk corridors that were enacted by various states in 2020 in response to the reduced demand for medical services stemming from COVID-19. Our contracts with certain states contain profit sharing provisions under which we refund amounts to the states if our health plans generate profit above a certain specified percentage. In some cases, we are limited in the amount of administrative costs that we may deduct in calculating the refund, if any. \nWe recorded aggregate liabilities under the terms of such contract provisions of $\n1,006\n million and $\n1,344\n million at December 31, 2024 and 2023, respectively, to amounts due government agencies.\nThe Affordable Care Act (“ACA”) established a Minimum MLR of \n85\n% for Medicare. Federal regulations define what constitutes medical costs and premium revenue. If the Minimum MLR is not met, we may be required to pay rebates to the federal government. Our dual-eligible plans may also be subject to state-specific Minimum MLRs, medical cost corridors, and profit-sharing provisions. We recognize estimated rebates as an adjustment to premium revenue in our consolidated statements of income. We recorded a liability under the terms of such contract provisions of $\n32\n million and $\n64\n million at December 31, 2024 and 2023, respectively, to amounts due government agencies.\nThe ACA established a Minimum MLR of \n80\n% for the Marketplace. If the Minimum MLR is not met, we may be required to pay rebates to our Marketplace policyholders. The Marketplace risk adjustment program discussed below is taken into consideration when computing the Minimum MLR. We recognize estimated rebates under the Minimum MLR as an adjustment to premium revenue in our consolidated statements of income. We recorded a liability under the terms of such contract provisions of $\n30\n million and $\n2\n million at December 31, 2024 and 2023, respectively, to amounts due government agencies.\nRisk Adjustment.\n \nOur Medicare premiums are subject to retroactive increase or decrease based on the health status of our Medicare members (as measured by member risk score). We estimate our members’ risk scores and the related amount of Medicare revenue that will ultimately be realized for the periods presented based on our knowledge of our members’ health status, risk scores and CMS practices. We also estimate amounts owed to CMS for Part D settlements. We recorded a liability under the terms of such contract provisions of $\n115\n million and $\n66\n million at December 31, 2024 and 2023, respectively, to amounts due government agencies. \nUnder this program for our Marketplace business, our health plans’ composite risk scores are compared with the overall average risk score for the relevant state and market pool. Generally, our health plans will make a risk adjustment payment into the pool if their composite risk scores are below the average risk score (risk adjustment payable), and will receive a risk adjustment payment from the pool if their composite risk scores are above the \nMolina Healthcare, Inc. 2024 Form 10-K | 64\naverage risk score (risk adjustment receivable). We estimate our ultimate premium based on insurance policy year-to-date experience, and recognize estimated premiums relating to the risk adjustment program as an adjustment to premium revenue in our consolidated statements of income.\n As of December 31, 2024, Marketplace risk adjustment payables amounted to $\n290\n million and related receivables amounted to $\n192\n million, for a net payable of $\n98\n million. As of December 31, 2023, Marketplace risk adjustment payables amounted to $\n201\n million and related receivables amounted to $\n241\n million, for a net receivable of $\n40\n million. Marketplace risk adjustment receivables at December 31, 2023 are net of a $\n41\n million credit loss allowance recognized in the third quarter of 2023 on 2022 Marketplace risk adjustment receivables due to the insolvency of an issuer in the Texas risk pool. This charge is included in other operating expenses in the accompanying consolidated statements of income. \nOther Premium Adjustments. \nState Medicaid programs periodically adjust premium revenues on a retroactive basis for rate changes and changes in membership and eligibility data. In certain states, adjustments are made based on the health status of our members (as measured through a risk score). In these cases, we adjust our premium revenue in the period in which we determine that the adjustment is probable and reasonably estimable, based on our best estimate of the ultimate premium we expect to realize for the period being adjusted. \nQuality Incentives\nAt many of our health plans, revenue ranging from approximately \n1\n% to \n4\n% of certain health plan premiums is earned only if certain performance measures are met. Such performance measures are generally found in our Medicaid and MMP contracts. Quality incentive premium revenue is recognized when it is earned under such provisions.\n \nReinsurance\nWe bear underwriting and reserving risks associated with our health plan subsidiaries. In certain cases, we limit our risk of significant catastrophic losses by maintaining high deductible reinsurance coverage with a highly-rated, unaffiliated insurance company (the “third-party reinsurer”).\n \nBecause we remain liable for losses in the event the third-party reinsurer is unable to pay its portion of the losses, we continually monitor the third-party reinsurer’s financial condition, including its ability to maintain high credit ratings.\nWe report reinsurance premiums as a reduction to premium revenue, while related reinsurance recoveries are reported as a reduction to medical care costs.\n In certain cases, we participate in state-run reinsurance programs for which no reinsurance premium is paid. Reinsurance premiums amounted to $\n8\n million, $\n11\n million, and $\n2\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Reinsurance recoveries amounted to $\n20\n million, $\n21\n million, and $\n35\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Reinsurance recoverable of $\n21\n million, and $\n28\n million, as of December 31, 2024, and 2023, respectively, is included in “Receivables” in the accompanying consolidated balance sheets.\nPremium Deficiency Reserves on Loss Contracts\nWe assess the profitability of our contracts to determine if it is probable that a loss will be incurred in the future by reviewing current results and forecasts. For purposes of this assessment, contracts are grouped in a manner consistent with our method of acquiring, servicing and measuring the profitability of such contracts. A premium deficiency reserve (“PDR”) is recognized if anticipated future medical care and administrative costs exceed anticipated future premium revenue, investment income and reinsurance recoveries.\nIncome Taxes\nWe account for income taxes under the asset and liability method. Deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities using enacted tax rates expected to be in effect during the year in which the basis differences reverse. Valuation allowances are established when management determines it is more likely than not that some portion, or all, of the deferred tax assets will not be realized.\n For further discussion and disclosure, see Note 12, “Income Taxes.”\nTaxes Based on Premiums\nPremium and Use Tax. \nCertain of our health plans are assessed a tax based on premium revenue collected. The premium revenues we receive from these states include reimbursement for the premium tax assessment. We have reported these taxes on a gross basis, as premium tax revenue and as premium tax expenses in the consolidated statements of income.\n \nMolina Healthcare, Inc. 2024 Form 10-K | 65\nConcentrations of Credit Risk\nFinancial instruments that potentially subject us to concentrations of credit risk consist primarily of cash and cash equivalents, investments, receivables, and restricted investments. Our investments and a portion of our cash equivalents are managed by professional portfolio managers operating under documented investment guidelines. Our portfolio managers must obtain our prior approval before selling investments where the loss position of those investments exceeds certain levels. Our investments consist primarily of investment-grade debt securities with final maturities of less than \n15\n years, or less than \n15\n years average life for structured securities. Restricted investments are invested principally in cash, cash equivalents, U.S. Treasury securities, and corporate debt securities. Concentration of credit risk with respect to accounts receivable is limited because our payors consist principally of the federal government, and governments of each state in which our health plan subsidiaries operate.\n \nRisks and Uncertainties\nOur profitability depends in large part on our ability to accurately predict and effectively manage medical care costs. We continually review our medical costs in light of our underlying claims experience and revised actuarial data. However, several factors could adversely affect medical care costs. These factors, which include changes in healthcare practices, inflation, new technologies, major epidemics, natural disasters, and malpractice litigation, are beyond our control and may have an adverse effect on our ability to accurately predict and effectively control medical care costs. Costs in excess of those anticipated could have a material adverse effect on our financial condition, results of operations, or cash flows.\nWe operate health plans primarily as a direct contractor with the states, and in Los Angeles County, California, as a subcontractor to another health plan holding a direct contract with the state. We are therefore dependent upon a relatively small number of contracts to support our revenue. The loss of any one of those contracts could have a material adverse effect on our financial position, results of operations, or cash flows. In addition, our ability to arrange for the provision of medical services to our members is dependent upon our ability to develop and maintain adequate provider networks. Our inability to develop or maintain such networks might, in certain circumstances, have a material adverse effect on our financial position, results of operations, or cash flows.\nSignificant Customers\nWe receive the majority of our revenues under contracts or subcontracts with state Medicaid managed care programs, which are considered individual external customers. Instances where these contracts were at least 10% of our total premium revenue for the year ended December 31, 2024 were California with \n10.7\n%, Texas with \n10.7\n%, and Washington with \n10.4\n%.\nRecent Accounting Pronouncements \nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-07, \nImprovements to Reportable Segment Disclosures\n, which requires disclosure of incremental segment information on an annual and interim basis for all public entities. The amendments do not change how a public entity identifies its operating segments, aggregates those operating segments, or applies the quantitative thresholds to determine its reportable segments. ASU 2023-07 is effective for annual reporting beginning with the fiscal year ending December 31, 2024, and for interim periods thereafter. We have adopted this ASU, with the incremental disclosures presented in Note 16, “Segments”. \nIn December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures\n, which will require incremental income tax disclosures on an annual basis for all public entities. The amendments require that public business entities disclose specific categories in the rate reconciliation and provide additional information for reconciling items meeting a quantitative threshold. The amendments also require disclosure of income taxes paid to be disaggregated by jurisdiction, and disclosure of income tax expense disaggregated by federal, state, and foreign. ASU 2023-09 is effective for annual reporting beginning with the fiscal year ending December 31, 2025. We are currently evaluating the incremental disclosures that will be required in our consolidated financial statements.\nIn November 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n, which will require disclosure of additional information about specific expense categories in the notes to financial statements for all public business entities. ASU 2024-03 is effective for annual reporting beginning with the fiscal year ending December 31, 2027, and for interim periods thereafter. Early adoption is permitted. We are currently evaluating the incremental disclosures that will be required in the footnotes to our consolidated financial statements.\nOther recent accounting pronouncements issued by the FASB (including its Emerging Issues Task Force), the American Institute of Certified Public Accountants, and the Securities and Exchange Commission (“SEC”) did not \nMolina Healthcare, Inc. 2024 Form 10-K | 66\nhave, nor does management expect such pronouncements to have, a significant impact on our present or future consolidated financial statements.\n3. \nNet Income Per Share \nThe following table sets forth the calculation of basic and diluted net income per share:\nYear Ended December 31,\n2024\n2023\n2022\n(In millions, except net income per share)\nNumerator:\nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nDenominator:\nShares outstanding at the beginning of the period\n57.8\n \n57.4\n \n57.9\n \nWeighted-average number of shares issued:\nStock purchases\n(\n0.6\n)\n—\n \n(\n0.5\n)\nStock-based compensation\n0.2\n \n0.3\n \n0.4\n \nDenominator for basic net income per share\n57.4\n \n57.7\n \n57.8\n \nEffect of dilutive securities: \n(1)\nStock-based compensation\n0.3\n \n0.4\n \n0.7\n \nDenominator for diluted net income per share\n57.7\n \n58.1\n \n58.5\n \nNet income per share - Basic \n(2)\n$\n20.52\n \n$\n18.91\n \n$\n13.72\n \nNet income per share - Diluted \n(2)\n$\n20.42\n \n$\n18.77\n \n$\n13.55\n \n_______________________________ \n(1)    The dilutive effect of all potentially dilutive common shares is calculated using the treasury stock method. Certain potentially dilutive common shares issuable are not included in the computation of diluted net income per share because to do so would have been anti-dilutive. For the year ended December 31, 2024,\n108,000\n shares were excluded from diluted shares outstanding. \n(2)    Source data for calculations in thousands.\n \n4. \nBusiness Combinations \nBright Health Medicare.\n On January 1, 2024, we closed on our acquisition of \n100\n% of the issued and outstanding capital stock of Brand New Day and Central Health Plan of California (“Bright Health Medicare”) for $\n441\n million in cash, consistent with our strategy to grow in our existing markets. For this transaction, we applied the acquisition method of accounting, where the total purchase price was allocated to the tangible and intangible assets acquired and liabilities assumed, based on their fair values as of the acquisition date. The pro forma effects of this acquisition for prior periods were not material to our consolidated results of operations. Acquisition costs amounted to $\n1\n million in the aggregate for the year ended December 31, 2024, and were recorded as “General and administrative expenses” in the accompanying consolidated statements of income.\nThe acquisition-date fair value of the consideration transferred consisted of the following, in millions: \nFair value of consideration transferred:\nCash\n$\n341\n \nContingent consideration\n86\n \nTotal\n$\n427\n \nThe contingent consideration arrangement allowed the seller to earn up to $\n100\n million for the satisfaction of certain conditions within the stock purchase agreement by the fourth quarter of 2024. The fair value of the contingent consideration arrangement at the acquisition date was $\n86\n million. This fair value measurement was based on inputs not observable in the market and thus represented a Level 3 measurement. We estimated the fair value \nMolina Healthcare, Inc. 2024 Form 10-K | 67\nusing a probability-weighted scenario approach focused on existing and expected membership. On the acquisition date, we placed the $\n100\n million into a third-party escrow and recorded a receivable of $\n14\n million in relation to the fair value measurement. As of December 31, 2024, the fair value of the contingent consideration arrangement increased to $\n100\n million due to the conditions being met. The net change in fair value is reported in “Other” operating expenses in our consolidated statements of income.\nGoodwill is calculated as the excess of the consideration transferred over the net assets recognized and represents the estimated future economic benefits arising from other assets acquired that could not be individually identified and separately recognized. Such assets include synergies we expect to achieve as a result of the transaction, such as the use of our existing infrastructure to support the added membership, and future economic benefits arising from the assembled workforce. All of the goodwill was assigned to the Medicare segment and is deductible for income tax purposes. \nThe following table summarizes the fair values assigned to assets acquired and liabilities assumed, in millions. \nAssets acquired: \nCurrent assets\n$\n335\n \nGoodwill\n430\n \nIntangible assets\n141\n \nOther long-term assets\n53\n \nLiabilities assumed: \nMedical claims and benefits payable\n(\n476\n)\nAmounts due government agencies\n(\n33\n)\nAccounts payable, accrued and other long-term liabilities\n(\n23\n)\nFair value of net assets acquired\n$\n427\n \nThe table below presents intangible assets acquired, by major class, for the Bright Health Medicare acquisition. The weighted-average amortization period, in the aggregate, is \n11.1\n years.  \nFair Value\nLife\n \n(In millions)\n(Years)\nContract rights - member list\n$\n104\n \n10\nTrade Name\n32\n \n15\nProvider network\n5\n \n10\n$\n141\n \nMy Choice. \nOn September 1, 2023, we closed on our acquisition of My Choice Wisconsin for preliminary purchase consideration of approximately $\n74\n million. In August 2024, we paid additional purchase consideration of $\n49\n million as a result of final purchase price adjustments as provided in the asset purchase agreement. We recorded various measurement period adjustments that were insignificant. These measurement period adjustments and purchase price adjustments have been finalized.\nSubsequent Events. \nEffective February 1, 2025, we closed on our acquisition of \n100\n% of the issued and outstanding capital stock of ConnectiCare Holding Company, Inc. The purchase price for the transaction was $\n350\n million. Due to the recency of the transaction, the initial accounting is incomplete.\n5. \nFair Value Measurements \nWe consider the carrying amounts of current assets and current liabilities to approximate their fair values because of the relatively short period of time between the origination of these instruments and their expected realization or payment. For our financial instruments measured at fair value on a recurring basis, we prioritize the inputs used in measuring fair value according to a three-tier fair value hierarchy as follows:\nLevel 1 — Observable Inputs.\n \nLevel 1 financial instruments are actively traded and therefore the fair value for these securities is based on quoted market prices for identical securities in active markets.\nMolina Healthcare, Inc. 2024 Form 10-K | 68\nLevel 2 — Directly or Indirectly Observable Inputs. \nFair value for these investments is determined using a market approach based on quoted prices for similar securities in active markets or quoted prices for identical securities in inactive markets. \nLevel 3 — Unobservable Inputs. \nLevel 3 financial instruments are valued using unobservable inputs that represent management’s best estimate of what market participants would use in pricing the financial instrument at the measurement date.\n \nOur financial instruments measured at fair value on a recurring basis at December 31, 2024, were as follows:\nTotal\nLevel 1\nLevel 2\nLevel 3\n \n(In millions)\nCorporate debt securities\n$\n2,744\n \n$\n—\n \n$\n2,744\n \n$\n—\n \nMortgage-backed securities\n914\n \n—\n \n914\n \n—\n \nAsset-backed securities\n431\n \n—\n \n431\n \n—\n \nMunicipal securities\n183\n \n—\n \n183\n \n—\n \nU.S. Treasury notes\n5\n \n—\n \n5\n \n—\n \nOther\n48\n \n—\n \n48\n \n—\n \nTotal assets\n$\n4,325\n \n$\n—\n \n$\n4,325\n \n$\n—\n \nOur financial instruments measured at fair value on a recurring basis at December 31, 2023, were as follows:\nTotal\nLevel 1\nLevel 2\nLevel 3\n \n(In millions)\nCorporate debt securities\n$\n2,732\n \n$\n—\n \n$\n2,732\n \n$\n—\n \nMortgage-backed securities\n911\n \n—\n \n911\n \n—\n \nAsset-backed securities\n365\n \n—\n \n365\n \n—\n \nMunicipal securities\n166\n \n—\n \n166\n \n—\n \nU.S. Treasury notes\n40\n \n—\n \n40\n \n—\n \nOther\n45\n \n—\n \n45\n \n—\n \nTotal assets\n$\n4,259\n \n$\n—\n \n$\n4,259\n \n$\n—\n \nFair Value Measurements – Disclosure Only\nThe carrying amounts and estimated fair values of our notes payable are classified as Level 2 financial instruments. Fair value for these securities is determined using a market approach based on quoted market prices for similar securities in active markets or quoted prices for identical securities in inactive markets.\n \nDecember 31, 2024\nDecember 31, 2023\n \nCarrying\nAmount\nFair Value \nCarrying\nAmount\nFair Value \n \n(In millions)\n4.375\n% Notes due 2028\n$\n795\n \n$\n759\n \n$\n794\n \n$\n757\n \n3.875\n% Notes due 2030\n645\n \n578\n \n644\n \n583\n \n3.875\n% Notes due 2032\n743\n \n648\n \n742\n \n654\n \n6.250\n% Notes due 2033\n740\n \n741\n \n—\n \n—\n \nTotal\n$\n2,923\n \n$\n2,726\n \n$\n2,180\n \n$\n1,994\n \nMolina Healthcare, Inc. 2024 Form 10-K | 69\n6. \nInvestments \nAvailable-for-Sale\nWe consider all of our investments classified as current assets to be available-for-sale. \nThe following tables summarize our current investments as of the dates indicated:\nDecember 31, 2024\nAmortized\nCost\nGross\nUnrealized\nEstimated\nFair Value\nGains\nLosses\n(In millions)\nCorporate debt securities\n$\n2,769\n \n$\n10\n \n$\n35\n \n$\n2,744\n \nMortgage-backed securities\n953\n \n2\n \n41\n \n914\n \nAsset-backed securities\n435\n \n2\n \n6\n \n431\n \nMunicipal securities\n188\n \n—\n \n5\n \n183\n \nU.S. Treasury notes\n5\n \n—\n \n—\n \n5\n \nOther\n50\n \n—\n \n2\n \n48\n \nTotal\n$\n4,400\n \n$\n14\n \n$\n89\n \n$\n4,325\n \nDecember 31, 2023\nAmortized\nCost\nGross\nUnrealized\nEstimated\nFair Value\nGains\nLosses\n(In millions)\nCorporate debt securities\n$\n2,781\n \n$\n16\n \n$\n65\n \n$\n2,732\n \nMortgage-backed securities\n951\n \n4\n \n44\n \n911\n \nAsset-backed securities\n376\n \n1\n \n12\n \n365\n \nMunicipal securities\n172\n \n—\n \n6\n \n166\n \nU.S. Treasury notes\n40\n \n—\n \n—\n \n40\n \nOther\n47\n \n—\n \n2\n \n45\n \nTotal\n$\n4,367\n \n$\n21\n \n$\n129\n \n$\n4,259\n \nExpected maturities may differ from contractual maturities because borrowers may have the right to call or prepay obligations with or without call or prepayment penalties. \nThe contractual maturities of our current investments as of December 31, 2024 are summarized below:\nAmortized\nCost\nEstimated\nFair Value\n(In millions)\nDue in one year or less\n$\n570\n \n$\n567\n \nDue after one year through five years\n2,224\n \n2,202\n \nDue after five years through ten years\n500\n \n494\n \nDue after ten years\n1,106\n \n1,062\n \nTotal\n$\n4,400\n \n$\n4,325\n \nIn the years ended December 31, 2024, 2023, and 2022, maturities and redemptions of available-for-sale securities amounted to $\n1,012\n million, $\n513\n million, and $\n1,069\n million, respectively, and sales amounted to $\n99\n million, $\n259\n million, and $\n329\n million, respectively. Gross realized gains and losses from sales of available-for-sale securities are calculated under the specific identification method and are included in investment income. Gross realized investment gains amounted to $\n2\n million, $\n1\n million and $\n1\n million in the years ended December 31, 2024, 2023 and 2022, respectively, and were reclassified into earnings from other comprehensive income on a net-of-tax basis. Gross realized investment losses amounted to $\n3\n million, $\n11\n million and $\n7\n million in the years ended December 31, 2024, 2023 and 2022, respectively, and were reclassified into earnings from other comprehensive income on a net-of-tax basis.  \nMolina Healthcare, Inc. 2024 Form 10-K | 70\nWe have determined that unrealized losses at December 31, 2024, 2023 and 2022 primarily resulted from fluctuating interest rates, rather than a deterioration of the creditworthiness of the issuers. Further, as of December 31, 2024, we do not intend to sell, and it is not likely that we will be required to sell these investments prior to the recovery of their amortized cost basis. Therefore, we determined that an allowance for credit losses was not necessary.\nThe following table segregates those available-for-sale investments that have been in a continuous loss position for less than 12 months, and those that have been in a continuous loss position for 12 months or more as of December 31, 2024:\nIn a Continuous Loss Position\nfor Less than 12 Months\nIn a Continuous Loss Position\nfor 12 Months or More\nEstimated\nFair\nValue\nUnrealized\nLosses\nTotal Number of Positions\nEstimated\nFair\nValue\nUnrealized\nLosses\nTotal Number of Positions\n \n(Dollars in millions)\nCorporate debt securities\n$\n811\n \n$\n10\n \n541\n \n$\n935\n \n$\n25\n \n449\n \nMortgage-backed securities\n271\n \n5\n \n197\n \n406\n \n36\n \n244\n \nAsset-backed securities\n84\n \n1\n \n48\n \n143\n \n5\n \n73\n \nMunicipal securities\n38\n \n1\n \n27\n \n95\n \n4\n \n89\n \nOther\n—\n \n—\n \n—\n \n15\n \n2\n \n16\n \nTotal\n$\n1,204\n \n$\n17\n \n813\n \n$\n1,594\n \n$\n72\n \n871\n \nThe following table segregates those available-for-sale investments that have been in a continuous loss position for less than 12 months, and those that have been in a continuous loss position for 12 months or more as of December 31, 2023:\nIn a Continuous Loss Position\nfor Less than 12 Months\nIn a Continuous Loss Position\nfor 12 Months or More\nEstimated\nFair\nValue\nUnrealized\nLosses\nTotal Number of Positions\nEstimated\nFair\nValue\nUnrealized\nLosses\nTotal Number of Positions\n \n(Dollars in millions)\nCorporate debt securities\n$\n263\n \n$\n1\n \n160\n \n$\n1,553\n \n$\n64\n \n754\n \nMortgage-backed securities\n123\n \n2\n \n98\n \n549\n \n42\n \n283\n \nAsset-backed securities\n—\n \n—\n \n—\n \n195\n \n12\n \n91\n \nMunicipal securities\n—\n \n—\n \n—\n \n117\n \n6\n \n116\n \nOther\n—\n \n—\n \n—\n \n17\n \n2\n \n17\n \nTotal\n$\n386\n \n$\n3\n \n258\n \n$\n2,431\n \n$\n126\n \n1,261\n \nRestricted Investments Held-to-Maturity\nPursuant to the regulations governing our state health plan subsidiaries, we maintain statutory deposits and deposits required by government authorities primarily in cash, cash equivalents, U.S. Treasury securities, and corporate debt securities. We also maintain restricted investments as protection against the insolvency of certain capitated providers. The use of these funds is limited as required by regulations in the various states in which we operate, or as needed in the event of insolvency of capitated providers. Therefore, such investments are reported as “Restricted investments” in the accompanying consolidated balance sheets. \nWe have the intent and ability to hold these restricted investments until maturity, and as a result, we expect to collect the contractual cash flows associated with these investments and do not recognize interim fluctuations in fair value. Accordingly, our held-to-maturity restricted investments are carried at amortized cost, which approximates fair value, of which $\n139\n million will mature in one year or less, $\n142\n million will mature in one through five years, and $\n5\n million will mature after five years. \nMolina Healthcare, Inc. 2024 Form 10-K | 71\nThe following table presents the balances of restricted investments:\nDecember 31,\n2024\n2023\n(In millions)\nCash and cash equivalents\n$\n79\n \n$\n60\n \nU.S. Treasury notes\n191\n \n167\n \nCorporate debt and other securities\n16\n \n34\n \nTotal restricted investments\n$\n286\n \n$\n261\n \n7. \nProperty, Equipment, and Capitalized Software, Net \nProperty and equipment are stated at historical cost. Replacements and major improvements are capitalized, and repairs and maintenance are charged to expense as incurred. Software developed for internal use is capitalized. Property and equipment are generally depreciated using the straight-line method over estimated useful lives ranging from \nthree\n to \nseven years\n. Software is generally amortized over its estimated useful life of \nthree years\n. Leasehold improvements are amortized over the term of the lease, or over their useful lives from \nfive\n to \n10\n years, whichever is shorter. Buildings are depreciated over their estimated useful lives of \n31.5\n to \n40\n years.\nThe Company recognized an impairment on property and equipment of $\n16\n million associated with our reduction in leased space used in our business operations in the year ended December 31, 2022. \nA summary of property, equipment, and capitalized software is as follows:\n \nDecember 31,\n \n2024\n2023\n \n(In millions)\nCapitalized software\n$\n788\n \n$\n687\n \nProperty and equipment\n205\n \n199\n \nBuilding and improvements\n35\n \n41\n \nLand\n1\n \n5\n \nTotal cost\n1,029\n \n932\n \nLess: accumulated amortization - capitalized software\n(\n612\n)\n(\n537\n)\nLess: accumulated depreciation and amortization - property, equipment, building, and improvements\n(\n194\n)\n(\n192\n)\nTotal accumulated depreciation and amortization\n(\n806\n)\n(\n729\n)\nROU assets - finance leases\n65\n \n67\n \nProperty, equipment, and capitalized software, net\n$\n288\n \n$\n270\n \nThe following table presents all depreciation and amortization recognized in our consolidated statements of income:\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nAmortization of intangible assets\n$\n82\n \n$\n85\n \n$\n77\n \nAmortization of capitalized software\n69\n \n58\n \n54\n \nAmortization of finance leases\n19\n \n18\n \n28\n \nDepreciation and amortization of property, equipment, building, and improvements\n16\n \n10\n \n17\n \nTotal depreciation and amortization\n$\n186\n \n$\n171\n \n$\n176\n \nMolina Healthcare, Inc. 2024 Form 10-K | 72\n8. \nLeases\n \nWe are a party to operating and finance leases primarily for our corporate and health plan offices. Our operating leases have remaining lease terms up to \n11\n years, some of which include options to extend the leases for up to \n10\n years. As of December 31, 2024, the weighted average remaining operating lease term is \n8\n years.\nOur finance leases have remaining lease terms up to \n14\n years, some of which include options to extend the leases for up to \n25\n years. As of December 31, 2024, the weighted average remaining finance lease term is \n11\n years.\nIn the year ended December 31, 2022, the Company recognized $\n192\n million of ROU asset impairments associated with our reduction in leased space used in our business operations to accommodate our move to a remote work environment.\nAs of December 31, 2024, the weighted-average discount rate used to compute the present value of lease payments was \n5.0\n% for operating lease liabilities, and \n6.5\n% for finance lease liabilities. \nThe components of lease expense for the years ended December 31, 2024, 2023, and 2022 are presented in the following table.\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nOperating lease expense\n$\n14\n \n$\n15\n \n$\n31\n \nFinance lease expense: \nAmortization of ROU assets\n$\n19\n \n$\n18\n \n$\n28\n \nInterest on lease liabilities\n15\n \n15\n \n15\n \nTotal finance lease expense\n$\n34\n \n$\n33\n \n$\n43\n \nSupplemental consolidated cash flow information related to leases follows:\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nCash used in operating activities:\nOperating leases\n$\n24\n \n$\n28\n \n$\n31\n \nFinance leases\n15\n \n15\n \n15\n \nCash used in financing activities: \nFinance leases\n24\n \n24\n \n15\n \nROU assets recognized in exchange for lease obligations:\nOperating leases\n5\n \n12\n \n10\n \nFinance leases\n17\n \n13\n \n18\n \nMolina Healthcare, Inc. 2024 Form 10-K | 73\nSupplemental information related to leases, including location of amounts reported in the accompanying consolidated balance sheets, follows:\nDecember 31,\n2024\n2023\n(In millions)\nOperating leases:\nROU assets\nOther assets\n$\n35\n \n$\n43\n \nLease liabilities\nAccounts payable and accrued liabilities (current)\n$\n15\n \n$\n20\n \nOther long-term liabilities (non-current)\n68\n \n85\n \nTotal operating lease liabilities\n$\n83\n \n$\n105\n \nFinance leases:\nROU assets\nProperty, equipment, and capitalized software, net\n$\n65\n \n$\n67\n \nLease liabilities\nAccounts payable and accrued liabilities (current)\n$\n23\n \n$\n21\n \nFinance lease liabilities (non-current)\n195\n \n205\n \nTotal finance lease liabilities\n$\n218\n \n$\n226\n \nMaturities of lease liabilities as of December 31, 2024, were as follows:\nOperating \nFinance\nLeases\nLeases\n(In millions)\n2025\n$\n19\n \n$\n36\n \n2026\n13\n \n32\n \n2027\n11\n \n27\n \n2028\n9\n \n25\n \n2029\n8\n \n25\n \nThereafter\n42\n \n169\n \nSubtotal - undiscounted lease payments\n102\n \n314\n \nLess imputed interest\n(\n19\n)\n(\n96\n)\nTotal\n$\n83\n \n$\n218\n \n9. \nGoodwill and Intangible Assets, Net\n \nGoodwill\nThe following table presents the changes in the carrying amounts of goodwill by segment, for the periods presented.\nMedicaid\nMedicare\nOther\nConsolidated\n(In millions)\nBalance, December 31, 2022\n$\n899\n \n$\n172\n \n$\n44\n \n$\n1,115\n \nAcquisitions and measurement period adjustments\n95\n \n31\n \n—\n \n126\n \nBalance, December 31, 2023\n994\n \n203\n \n44\n \n1,241\n \nAcquisitions and measurement period adjustments\n—\n \n430\n \n—\n \n430\n \nBalance, December 31, 2024\n$\n994\n \n$\n633\n \n$\n44\n \n$\n1,671\n \nThe changes in the carrying amounts of both goodwill and intangible assets, net, in 2024, were due to the \nMolina Healthcare, Inc. 2024 Form 10-K | 74\nacquisitions described in Note 4, “Business Combinations.” \nIntangible Assets, Net\nThe following table provides the details of identified intangible assets, by major class, for the periods presented.\nDecember 31, 2024\nDecember 31, 2023\nCost\nAccumulated\nAmortization\nCarrying Amount \nCost\nAccumulated\nAmortization\nCarrying Amount \n \n(In millions)\nContract rights and licenses\n$\n624\n \n$\n429\n \n$\n195\n \n$\n520\n \n$\n357\n \n$\n163\n \nProvider networks\n64\n \n34\n \n30\n \n59\n \n29\n \n30\n \nTrade names\n54\n \n12\n \n42\n \n22\n \n7\n \n15\n \nTotal\n$\n742\n \n$\n475\n \n$\n267\n \n$\n601\n \n$\n393\n \n$\n208\n \nAs of December 31, 2024, we estimate that our intangible asset amortization will be approximately $\n80\n million in 2025, $\n40\n million in 2026, $\n29\n million in 2027, and $\n21\n million in 2028 and 2029.\n \n10. \nMedical Claims and Benefits Payable \nThe following table provides the details of our medical claims and benefits payable as of the dates indicated.\nDecember 31,\n2024\n2023\n2022\n(In millions)\nFee-for-service claims incurred but not paid (“IBNP”)\n$\n3,085\n \n$\n2,901\n \n$\n2,597\n \nPharmacy payable\n249\n \n202\n \n206\n \nCapitation payable\n182\n \n100\n \n94\n \nOther\n1,124\n \n1,001\n \n631\n \nTotal\n$\n4,640\n \n$\n4,204\n \n$\n3,528\n \n“Other” medical claims and benefits payable mainly includes provider incentives and amounts payable to certain providers for which we act as an intermediary on behalf of various government agencies, including arrangements where we are not assuming financial risk. The receipts and payments related to non-risk arrangements do not impact our consolidated statements of income. \nThe following tables present the components of the change in our medical claims and benefits payable for the periods indicated. \nYear Ended December 31, 2024\nMedicaid \nMedicare \nMarketplace\nConsolidated\n \n(In millions)\nMedical claims and benefits payable, beginning balance\n$\n3,444\n \n$\n532\n \n$\n228\n \n$\n4,204\n \nComponents of medical care costs related to:\nCurrent year\n28,211\n \n5,000\n \n1,892\n \n35,103\n \nPrior years\n(\n611\n)\n(\n61\n)\n(\n3\n)\n(\n675\n)\nTotal medical care costs\n27,600\n \n4,939\n \n1,889\n \n34,428\n \nPayments for medical care costs related to:\nCurrent year\n24,950\n \n4,464\n \n1,646\n \n31,060\n \nPrior years\n2,258\n \n761\n \n220\n \n3,239\n \nTotal paid\n27,208\n \n5,225\n \n1,866\n \n34,299\n \nAcquired balances, net of post-acquisition adjustments\n—\n \n476\n \n—\n \n476\n \nChange in non-risk and other provider payables\n(\n169\n)\n—\n \n—\n \n(\n169\n)\nMedical claims and benefits payable, ending balance\n$\n3,667\n \n$\n722\n \n$\n251\n \n$\n4,640\n \nMolina Healthcare, Inc. 2024 Form 10-K | 75\nYear Ended December 31, 2023\nMedicaid \nMedicare \nMarketplace\nConsolidated\n \n(In millions)\nMedical claims and benefits payable, beginning balance\n$\n2,815\n \n$\n452\n \n$\n261\n \n$\n3,528\n \nComponents of medical care costs related to:\nCurrent year\n23,749\n \n3,802\n \n1,545\n \n29,096\n \nPrior years\n(\n395\n)\n(\n11\n)\n(\n21\n)\n(\n427\n)\nTotal medical care costs\n23,354\n \n3,791\n \n1,524\n \n28,669\n \nPayments for medical care costs related to:\nCurrent year\n20,999\n \n3,293\n \n1,323\n \n25,615\n \nPrior years\n2,069\n \n431\n \n234\n \n2,734\n \nTotal paid\n23,068\n \n3,724\n \n1,557\n \n28,349\n \nAcquired balances, net of post-acquisition adjustments\n82\n \n14\n \n—\n \n96\n \nChange in non-risk and other provider payables\n261\n \n(\n1\n)\n—\n \n260\n \nMedical claims and benefits payable, ending balance\n$\n3,444\n \n$\n532\n \n$\n228\n \n$\n4,204\n \nYear Ended December 31, 2022\nMedicaid \nMedicare \nMarketplace\nConsolidated\n \n(In millions)\nMedical claims and benefits payable, beginning balance\n$\n2,580\n \n$\n404\n \n$\n379\n \n$\n3,363\n \nComponents of medical care costs related to:\nCurrent year\n22,097\n \n3,390\n \n1,972\n \n27,459\n \nPrior years\n(\n251\n)\n(\n32\n)\n(\n1\n)\n(\n284\n)\nTotal medical care costs\n21,846\n \n3,358\n \n1,971\n \n27,175\n \nPayments for medical care costs related to:\nCurrent year\n19,655\n \n2,944\n \n1,746\n \n24,345\n \nPrior years\n1,966\n \n361\n \n343\n \n2,670\n \nTotal paid\n21,621\n \n3,305\n \n2,089\n \n27,015\n \nAcquired balances, net of post-acquisition adjustments\n12\n \n—\n \n—\n \n12\n \nChange in non-risk and other provider payables\n(\n2\n)\n(\n5\n)\n—\n \n(\n7\n)\nMedical claims and benefits payable, ending balance\n$\n2,815\n \n$\n452\n \n$\n261\n \n$\n3,528\n \nThe amounts presented for “Components of medical care costs related to: Prior years” represent the amount by which our original estimate of medical claims and benefits payable at the beginning of the year varied from the actual liabilities, based on information (principally the payment of claims) developed since those liabilities were first reported.\nOur estimates of medical claims and benefits payable recorded at December 31, 2023, 2022 and 2021 developed favorably by approximately $\n675\n million, $\n427\n million and $\n284\n million in 2024, 2023 and 2022, respectively. The favorable prior year development recognized in 2024 was primarily due to lower than expected utilization of medical services by our members and improved operating performance, including claim payment recoveries related to prior year dates of service, mainly in the Medicaid segment. Consequently, the ultimate costs recognized in 2024, as claims payments were processed, were lower than our estimates in 2023. \nThe favorable prior year development recognized in 2023 was primarily due to lower than expected utilization of medical services by our members and improved operating performance, including claim payment recoveries related to prior year dates of service, mainly in the Medicaid segment. Consequently, the ultimate costs recognized in 2023, as claims payments were processed, were lower than our estimates in 2022. \nThe favorable prior year development recognized in 2022 was primarily due to lower than expected utilization of medical services by our members and improved operating performance, including claim payment recoveries related to prior year dates of service, mainly in the Medicaid segment. Consequently, the ultimate costs recognized in 2022, as claims payments were processed, were lower than our estimates in 2021, which was not discernible until additional information was provided, and as claims payments were processed. \nMolina Healthcare, Inc. 2024 Form 10-K | 76\nThe following tables provide information about our consolidated incurred and paid claims development as of December 31, 2024, as well as cumulative claims frequency and the total of incurred but not paid claims liabilities. The pattern of incurred and paid claims development is consistent across each of our segments. The cumulative claim frequency is measured by claim event, and includes claims covered under capitated arrangements.\nIncurred Claims and Allocated Claims Adjustment Expenses\nTotal IBNP\nCumulative number of reported claims\nBenefit Year\n2022\n2023\n2024\n(Unaudited)\n(Unaudited)\n(In millions)\n2022\n$\n27,459\n \n$\n27,128\n \n$\n27,036\n \n$\n13\n \n148\n \n2023\n29,192\n \n28,634\n \n52\n \n157\n \n2024\n35,103\n \n3,018\n \n158\n \n$\n90,773\n \n$\n3,083\n \nCumulative Paid Claims and Allocated Claims Adjustment Expenses\nBenefit Year\n2022\n2023\n2024\n(Unaudited)\n(Unaudited)\n(In millions)\n2022\n$\n24,345\n \n$\n27,051\n \n$\n27,023\n \n2023\n25,615\n \n28,887\n \n2024\n31,060\n \n$\n86,970\n \nThe following table represents a reconciliation of claims development to the aggregate carrying amount of the liability for medical claims and benefits payable.\n2024\n(In millions)\nIncurred claims and allocated claims adjustment expenses\n$\n90,773\n \nLess: cumulative paid claims and allocated claims adjustment expenses\n(\n86,970\n)\nAll outstanding liabilities before 2022\n2\n \nAcquired balances\n476\n \nNon-risk and other provider payables\n359\n \nMedical claims and benefits payable \n$\n4,640\n \n11. \nDebt \nContractual maturities of debt, as of December 31, 2024, are illustrated in the following table. All amounts represent the principal amounts of the debt instruments outstanding.\nTotal\n2025\n2026\n2027\n2028\n2029\nThereafter\n(In millions)\n4.375\n% Notes due 2028\n$\n800\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n800\n \n$\n—\n \n$\n—\n \n3.875\n% Notes due 2030\n650\n \n—\n \n—\n \n—\n \n—\n \n—\n \n650\n \n3.875\n% Notes due 2032\n750\n \n—\n \n—\n \n—\n \n—\n \n—\n \n750\n \n6.250\n% Notes due 2033\n750\n \n—\n \n—\n \n—\n \n—\n \n—\n \n750\n \nTotal\n$\n2,950\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n800\n \n$\n—\n \n$\n2,150\n \nMolina Healthcare, Inc. 2024 Form 10-K | 77\nThe following table summarizes our outstanding debt obligations, all of which are non-current as of the dates reported below:\nDecember 31,\n2024\n2023\n(In millions)\nNon-current long-term debt:\n4.375\n% Notes due 2028\n$\n800\n \n$\n800\n \n3.875\n% Notes due 2030\n650\n \n650\n \n3.875\n% Notes due 2032\n750\n \n750\n \n6.250\n% Notes due 2033\n750\n \n—\n \nDeferred debt issuance costs\n(\n27\n)\n(\n20\n)\nTotal\n$\n2,923\n \n$\n2,180\n \nCredit Agreement\n \nOn September 20, 2024, we entered into a Second Amendment to our credit agreement (as amended, the “Credit Agreement”) which includes an increase in available commitments under the revolving credit facility (“Credit Facility”) to $\n1.25\n billion, among other provisions. The Credit Agreement has a term of \nfive years\n, and all amounts outstanding will be due and payable on September 20, 2029. Borrowings under the Credit Agreement bear interest based, at our election, on a base rate or other defined rate, plus in each case, the applicable margin. In addition to interest payable on the principal amount of indebtedness outstanding from time to time under the Credit Agreement, we are required to pay a quarterly commitment fee. We have other relationships, including financial advisory and banking, with some parties to the Credit Agreement.\nThe Credit Agreement contains customary non-financial and financial covenants. As of December 31, 2024, we were in compliance with all financial and non-financial covenants under the Credit Agreement. As of December 31, 2024, \nno\n amounts were outstanding under the Credit Facility.\nSenior Notes\nOur senior notes are described below. Each of these notes are senior unsecured obligations of the Parent corporation, Molina Healthcare, Inc., and rank equally in right of payment with all existing and future senior debt, and senior to all existing and future subordinated debt of Molina Healthcare, Inc. In addition, each of the indentures governing the senior notes contain customary non-financial covenants and change of control provisions. As of December 31, 2024, we were in compliance with all non-financial covenants in the indentures governing the senior notes. \nThe indentures governing the senior notes contain cross-default provisions that are triggered upon default by us or any of our subsidiaries on any indebtedness in excess of the amount specified in the applicable indenture. \n4.375\n% Notes due 2028. \nWe have $\n800\n million aggregate principal amount of senior notes (the “\n4.375\n% Notes”) outstanding as of December 31, 2024, which are due June 15, 2028, unless earlier redeemed. Interest, at a rate of \n4.375\n% per annum, is payable semiannually in arrears on June 15 and December 15. \n3.875\n% Notes due 2030. \nWe have $\n650\n million aggregate principal amount of senior notes (the “\n3.875\n% Notes due 2030”) outstanding as of December 31, 2024, which are due November 15, 2030, unless earlier redeemed. Interest, at a rate of \n3.875\n% per annum, is payable semiannually in arrears on May 15 and November 15.\n3.875\n% Notes due 2032.\n We have $\n750\n million aggregate principal amount of senior notes (the “\n3.875\n% Notes due 2032”) outstanding as of December 31, 2024, which are due May 15, 2032, unless earlier redeemed. Interest, at a rate of \n3.875\n% per annum, is payable semiannually in arrears on May 15 and November 15. \n6.250\n% Notes due 2033.\n On November 18, 2024, we completed the private offering of $\n750\n million aggregate principal amount of senior notes (the “\n6.250\n% Notes due 2033”), which are due January 15, 2033, unless earlier redeemed. The \n6.250\n% Notes due 2033 contain optional early redemption provisions, with redemption prices in excess of par. Interest, at a rate of \n6.250\n% per annum, is payable semiannually in arrears on January 15 and July 15 of each year, commencing July 15, 2025. Deferred issuance costs amounted to $\n10\n million.\n \nMolina Healthcare, Inc. 2024 Form 10-K | 78\n12. \nIncome Taxes \nIncome tax expense for continuing operations consisted of the following:\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nCurrent:\nFederal\n$\n298\n \n$\n349\n \n$\n297\n \nState\n59\n \n55\n \n40\n \nTotal current\n357\n \n404\n \n337\n \nDeferred:\nFederal\n47\n \n(\n28\n)\n(\n66\n)\nState\n6\n \n(\n3\n)\n—\n \nTotal deferred\n53\n \n(\n31\n)\n(\n66\n)\nIncome tax expense\n$\n410\n \n$\n373\n \n$\n271\n \nA reconciliation of the U.S. federal statutory income tax rate to the combined effective income tax rate for continuing operations is as follows:\nYear Ended December 31,\n2024\n2023\n2022\nStatutory federal tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income provision, net of federal benefit\n3.2\n \n2.8\n \n3.0\n \nNondeductible compensation\n1.1\n \n1.4\n \n1.8\n \nOther\n0.5\n \n0.3\n \n(\n0.3\n)\nEffective tax rate\n25.8\n \n%\n25.5\n \n%\n25.5\n \n%\nDeferred tax assets and liabilities are classified as non-current. \nSignificant components of our deferred tax assets and liabilities as of December 31, 2024 and 2023 were as follows:\nDecember 31,\n2024\n2023\n(In millions)\nAccrued expenses and reserve liabilities\n$\n99\n \n$\n94\n \nOther accrued medical costs\n25\n \n26\n \nNet operating losses\n5\n \n7\n \nUnearned premiums\n2\n \n19\n \nLease liabilities\n79\n \n87\n \nUnrealized losses\n18\n \n26\n \nFixed assets and intangibles\n32\n \n24\n \nTax credit carryover\n5\n \n5\n \nOther\n13\n \n6\n \nValuation allowance\n(\n19\n)\n(\n24\n)\nTotal deferred income tax assets, net of valuation allowance \n259\n \n270\n \nRight-of-use assets\n(\n26\n)\n(\n29\n)\nPrepaid expenses \n(\n26\n)\n(\n14\n)\nTotal deferred income tax liabilities \n(\n52\n)\n(\n43\n)\nNet deferred income tax asset\n$\n207\n \n$\n227\n \nAt December 31, 2024, we had state net operating loss carryforwards of $\n39\n million, which begin expiring in 2037 with some having an indefinite carryforward period, and foreign net operating loss carryforwards of $\n6\n million, which \nMolina Healthcare, Inc. 2024 Form 10-K | 79\nbegin expiring in 2032. Additionally, as of December 31, 2024, we had foreign tax credit carryovers of $\n5\n million, which expire in 2030.\nWe evaluate the need for a valuation allowance taking into consideration the ability to carry back and carry forward tax credits and losses, available tax planning strategies and future income, including reversal of temporary differences. We have determined that as of December 31, 2024, $\n19\n million of deferred tax assets did not satisfy the recognition criteria. Therefore, we decreased our valuation allowance by $\n5\n million, from $\n24\n million at December 31, 2023, to $\n19\n million as of December 31, 2024.\nWe recognize tax benefits only if the tax position is more likely than not to be sustained. We are subject to income taxes in the United States, Puerto Rico, and numerous state jurisdictions. Significant judgment is required in evaluating our tax positions and determining our provision for income taxes. During the ordinary course of business, there are many transactions and calculations for which the ultimate tax determination is uncertain. We establish reserves for tax-related uncertainties based on estimates of whether, and the extent to which, additional taxes will be due. These reserves are established when we believe that certain positions might be challenged despite our belief that our tax return positions are fully supportable. We adjust these reserves in light of changing facts and circumstances, such as the outcome of tax audits. The provision for income taxes includes the impact of reserve provisions and changes to reserves that are considered appropriate.\nThe roll forward of our unrecognized tax benefits is as follows:\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nGross unrecognized tax benefits at beginning of period\n$\n(\n5\n)\n$\n(\n5\n)\n$\n(\n15\n)\nLapse in statute of limitations\n—\n \n—\n \n10\n \nGross unrecognized tax benefits at end of period\n$\n(\n5\n)\n$\n(\n5\n)\n$\n(\n5\n)\nThe total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rates is $\n5\n million at  December 31, 2024, 2023 and 2022. We expect that during the next 12 months it is reasonably possible that unrecognized tax benefit liabilities may decrease by $\n5\n million due to resolution of a state refund claim. The state refund claim will not result in a cash payment for income taxes if our claim is denied. \nOur continuing practice is to recognize interest and/or penalties related to unrecognized tax benefits in income tax expense. Amounts accrued for the payment of interest and penalties as of December 31, 2024, 2023 and 2022 were insignificant.\nWe may be subject to examination by the IRS for calendar years after 2020. With a few exceptions, which are immaterial in the aggregate, we no longer are subject to state, local, and Puerto Rico tax examinations for years before 2019.\n \n13. \nStockholders' Equity\n \nStock Purchase Programs\nIn September 2023, our board of directors authorized the purchase of up to $\n750\n million of our common stock. Under this program, pursuant to a Rule 10b5-1 trading plan, we purchased approximately \n1,465,000\n shares for $\n500\n million in the third quarter of 2024 (average cost of $\n341.25\n per share). \nIn October 2024, our board of directors authorized the purchase of up to $\n1\n billion of our common stock. This new program extends through December 31, 2025 and supersedes the stock purchase program previously approved by our board of directors in September 2023. Under this program, pursuant to a Rule 10b5-1 trading plan, we purchased approximately \n1,666,000\n shares for $\n500\n million in the fourth quarter of 2024 (average cost of $\n300.04\n per share). \nNo\n shares were purchased in 2025 through February 11, 2025. \nWe have accrued a stock repurchase excise tax of $\n8\n million related to the share repurchase programs as of December 31, 2024, located in “Accounts payable, accrued liabilities and other” and “Additional paid-in capital” in the accompanying consolidated balance sheets. \nMolina Healthcare, Inc. 2024 Form 10-K | 80\nShare-Based Compensation\nIn connection with our employee stock plans, approximately \n360,000\n shares and \n442,000\n shares of common stock were issued, net of shares used to settle employees’ income tax obligations, during the years ended December 31, 2024, and 2023, respectively. \nTotal share-based compensation expense is reported in “General and administrative expenses” in the accompanying consolidated statements of income, and summarized below.\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nPretax\nCharges\nNet-of-Tax\nAmount\nPretax\nCharges\nNet-of-Tax\nAmount\nPretax\nCharges\nNet-of-Tax\nAmount\nRSAs and PSUs (defined below)\n$\n109\n \n$\n100\n \n$\n108\n \n$\n102\n \n$\n97\n \n$\n90\n \nEmployee stock purchase plan\n7\n \n7\n \n7\n \n7\n \n6\n \n6\n \nTotal\n$\n116\n \n$\n107\n \n$\n115\n \n$\n109\n \n$\n103\n \n$\n96\n \nEquity Incentive Plan\nAt December 31, 2024, we had employee equity incentives outstanding under our 2019 Equity Incentive Plan (the “2019 EIP”). The 2019 EIP provides for awards, in the form of restricted stock awards (“RSAs”), performance stock units (“PSUs”), stock options, and other stock– or cash–based awards, to eligible persons who perform services for us. The 2019 EIP provides for the issuance of up to \n2.9\n million shares of our common stock.\nStock-based awards\n. RSAs and PSUs are granted with a fair value equal to the market price of our common stock on the date of grant, and generally vest in equal annual installments over periods up to \nfour years\n from the date of grant. PSUs vest in their entirety at the end of \nthree-year\n performance periods, if their performance conditions are met. We generally recognize expense for RSAs and PSUs on a straight-line basis. The weighted-average grant date fair value of our RSAs was $\n382.23\n in 2024, $\n277.37\n in 2023, and $\n312.27\n in 2022. The weighted-average grant date fair value of our PSUs was $\n353.44\n in 2024, $\n233.50\n in 2023, and $\n214.94\n in 2022. \nActivity for stock-based awards in the year ended December 31, 2024, is summarized below.\nRSAs\nWeighted\nAverage\nGrant Date\nFair Value\nPSUs\nWeighted\nAverage\nGrant Date\nFair Value\nUnvested balance, December 31, 2023\n535,447\n \n$\n268.41\n \n410,374\n \n$\n286.77\n \nGranted\n232,162\n \n382.23\n \n307,226\n \n353.44\n \nVested\n(\n224,447\n)\n251.45\n \n(\n175,101\n)\n276.30\n \nForfeited\n(\n55,515\n)\n307.84\n \n(\n13,417\n)\n293.64\n \nUnvested balance, December 31, 2024\n487,647\n \n$\n325.91\n \n529,082\n \n$\n328.77\n \nAs of December 31, 2024, total unrecognized compensation expense related to unvested RSAs and PSUs was $\n96\n million, and $\n98\n million, respectively, which we expect to recognize over a remaining weighted-average period of \n2.0\n years, and \n1.9\n years, respectively. This unrecognized compensation cost assumes an estimated forfeiture rate of \n8\n% for non-executive employees as of December 31, 2024, based on actual forfeitures over the last \n4\n years. \nThe total fair value of awards vested is presented in the following table.\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nRSAs\n$\n86\n \n$\n62\n \n$\n70\n \nPSUs\n68\n \n90\n \n69\n \nTotal vested\n$\n154\n \n$\n152\n \n$\n139\n \n \nMolina Healthcare, Inc. 2024 Form 10-K | 81\nEmployee Stock Purchase Plans (“ESPP”)\nUnder our ESPP, eligible employees may purchase common shares at \n85\n% of the lower of the fair market value of our common stock on either the first or last trading day of each \nsix-month\n offering period. Each participant is limited to a maximum purchase of $\n25,000\n (as measured by the fair value of the stock acquired) per year through payroll deductions. We estimate the fair value of the stock issued using a standard option pricing model. For the years ended December 31, 2024, 2023, and 2022, the inputs to this model were as follows: risk-free interest rates of approximately \n0.2\n% to \n5.4\n%; expected volatility of approximately \n25\n% to \n31\n%, dividend yields of \n0\n%, and an average expected life of \n0.5\n years.\n14. \nEmployee Benefit Plans\nWe sponsor defined contribution 401(k) plans that cover substantially all employees of our company and its subsidiaries. Eligible employees are permitted to contribute up to the maximum amount allowed by law. We match up to the first \n4\n% of compensation contributed by employees. Expense recognized in connection with our contributions to the 401(k) plans amounted to $\n61\n million, $\n54\n million, and $\n45\n million in the years ended December 31, 2024, 2023, and 2022, respectively.\nWe also have a non-qualified deferred compensation plan for certain key employees. Under this plan, eligible participants may defer portions of their base salary and bonus to provide tax-deferred growth. The deferrals are distributable based upon termination of employment or other periods, as elected under the plan and were $\n50\n million and $\n39\n million as of December 31, 2024 and 2023, respectively.\n15. \nCommitments and Contingencies \nRegulatory Capital Requirements and Dividend Restrictions\nOur health plans, which are generally operated by our respective wholly owned subsidiaries in those states in which our health plans operate, are subject to state laws and regulations that, among other things, require the maintenance of minimum levels of statutory capital, as defined by each state. The National Association of Insurance Commissioners (“NAIC”), has adopted model rules which, if implemented by the states, set minimum capitalization requirements for insurance companies, HMOs, and other entities bearing risk for healthcare coverage. The requirements take the form of risk-based capital (“RBC”) rules which may vary from state to state. Regulators in some states may also enforce capital requirements that require the retention of net worth in excess of amounts formally required by statute or regulation. \nAll of our health plans except California, Florida, Massachusetts and New York, are subject to the RBC rules. The minimum statutory capital requirements in these states are based on a percentage of annualized premium revenue, a percentage of annualized health care costs, a percentage of certain liabilities, or other financial ratios. If our California, Florida, Massachusetts or New York health plans became subject to RBC rules, minimum capital required for those states could increase. Our Massachusetts health plan maintains a $\n35\n million performance bond, effective through December 31, 2025, to partially satisfy minimum net worth requirements in that state.\nStatutes, regulations and informal capital requirements also restrict the timing, payment, and amount of dividends and other distributions that may be paid to us as the sole stockholder. To the extent our subsidiaries must comply with these regulations, they may not have the financial flexibility to transfer funds to us. Based on current statutes and regulations, the net assets in these subsidiaries, which may not be transferable to us in the form of loans, advances, or cash dividends was approximately $\n4.2\n billion at December 31, 2024. Because of the statutory restrictions that inhibit the ability of our health plans to transfer net assets to us, the amount of retained earnings readily available to pay dividends to our stockholders is generally limited to cash, cash equivalents and investments held by the parent company—Molina Healthcare, Inc. Such cash, cash equivalents and investments amounted to $\n445\n million and $\n742\n million as of December 31, 2024 and 2023, respectively.\nAs of December 31, 2024, our health plans had aggregate statutory capital and surplus of approximately $\n4.6\n billion, which was in excess of the required minimum aggregate statutory capital and surplus of approximately $\n2.6\n billion. We have the ability and commitment to provide additional capital to each of our health plans when necessary to ensure that statutory capital and surplus continues to meet regulatory requirements. \nMolina Healthcare, Inc. 2024 Form 10-K | 82\nLegal Proceedings\nThe healthcare industry is subject to numerous laws and regulations of federal, state, and local governments, as well as various contractual provisions, governing our operations. Compliance with these laws, regulations, and contractual provisions can be subject to government audit, review, and interpretation, as well as regulatory actions. Penalties associated with violations of these laws, regulations, and contractual provisions can include significant fines and penalties, temporary or permanent exclusion from participating in publicly funded programs, a limitation on our ability to market or sell products, the repayment of previously billed and collected revenues, and reputational damage. \nWe are involved in legal actions in the ordinary course of business including, but not limited to, various employment claims, vendor disputes, and provider claims. Some of these legal actions seek monetary damages, including claims for punitive damages, which may not be covered by insurance. We review legal matters and update our estimates, or range of estimates, of reasonably possible and estimable losses and related disclosures, as necessary. We have accrued liabilities for legal matters for which we deem the loss to be both probable and reasonably estimable. These liability estimates could change as a result of further developments. The outcome of these legal actions are inherently uncertain. An adverse determination in one or more of these pending matters could have a material adverse effect on our consolidated financial position, results of operations, or cash flows.  \nKentucky RFP.\n On September 4, 2020, Anthem Kentucky Managed Care Plan, Inc. (“Anthem”) brought an action in Franklin County Circuit Court against the Kentucky Finance and Administration Cabinet, the Kentucky Cabinet for Health and Family Services, and all of the five winning bidder health plans, including our Kentucky health plan. On September 9, 2022, the Kentucky Court of Appeals ruled that, with regard to the earlier Circuit Court ruling granting Anthem relief, the Circuit Court should not have invalidated the 2020 procurement and thus should not have awarded a contract to Anthem. Anthem sought discretionary review by the Kentucky Supreme Court (“KSC”) of the ruling by the Court of Appeals. On March 14, 2024, the KSC entered an Order affirming the Kentucky Court of Appeals. On April 3, 2024, Anthem filed a motion for reconsideration of the KSC Order, which the KSC denied on October 24, 2024. On November 1, 2024, the trial judge lifted the existing injunction that had allowed Anthem to participate as a sixth managed care organization in the Kentucky Medicaid Program. On November 4, 2024, Anthem sought an evidentiary hearing on other alleged scoring errors in the 2020 RFP. On November 26, 2024, the trial court judge denied Anthem’s motion for evidentiary hearing. Anthem did not appeal, thereby concluding this case.   \nPuerto Rico.\n In August 2021, Molina Healthcare of Puerto Rico, Inc. (“MHPR”) filed a complaint with the Commonwealth of Puerto Rico, Court of First Instance, San Juan (State Court) asserting breach of contract against Puerto Rico Health Insurance Administration (“ASES”). In September 2021, ASES filed a counterclaim and a third-party complaint against MHPR and the Company. In October 2024, the parties finalized a settlement of all outstanding claims, the terms of which are not a material impact on the Company’s business, financial condition, cash flows, or results of operations. \nTexas Qui Tam Litigation. \nOn May 7, 2013, a relator filed under seal a \nqui tam\n action in Texas state court against Molina Healthcare, Inc. and Molina Healthcare of Texas, Inc., asserting claims under the Texas Medicaid Fraud Prevention Act (“TMFPA”) on behalf of the State of Texas. As required by the TMFPA, the original petition was filed in camera and under seal, and without Molina’s awareness, to permit the State to decide whether to intervene. In 2019, the State declined to intervene. In June 2019, as a result of the State’s election to decline intervention, the trial court unsealed the original petition, at which time Molina became aware of the lawsuit. The relator’s third amended petition was filed on January 19, 2024. The petition alleged that, during the periods in question some ten years ago, Molina failed to assess STAR+PLUS members for personal attendant services, failed to provide those members with contractually required health care benefits, and misrepresented to the State Molina’s capacity to perform the assessments and the status of the assessments. Based on these allegations, the relator contended that Molina is liable to the State under the TMFPA for statutorily defined civil remedies, disgorgement of previous capitation payments, and interest. Molina denied the relator’s allegations as well as any liability in the lawsuit. In January 2025, the parties entered into a final settlement agreement in order to avoid the delay and expense of litigation. This matter is therefore concluded, and will not have a material effect on our business, financial condition, cash flows, or results of operations. \nProfessional Liability Insurance\nWe carry medical professional liability insurance for healthcare services rendered in our primary care locations and throughout the communities we serve. In addition, we carry managed care errors and omissions insurance for all managed care services that we provide.\nMolina Healthcare, Inc. 2024 Form 10-K | 83\n16. \nSegments \nWe currently have \nfour\n reportable segments consisting of: 1) Medicaid; 2) Medicare; 3) Marketplace; and 4) Other. Our reportable segments are consistent with how we currently manage the business and view the markets we serve. \nThe Medicaid, Medicare, and Marketplace segments represent the government-funded or sponsored programs under which we offer managed healthcare services. The Other segment, which is insignificant to our consolidated results of operations, includes long-term services and supports consultative services in Wisconsin.\nThe key metrics used to assess the performance of our Medicaid, Medicare, and Marketplace segments are premium revenue, medical margin and medical care ratio (“MCR”). MCR represents the amount of medical care costs as a percentage of premium revenue. Therefore, the underlying medical margin, or the amount earned by the Medicaid, Medicare, and Marketplace segments after medical costs are deducted from premium revenue, represents the most important measure of earnings reviewed by management, and is used by our chief executive officer, who is our chief operating decision maker, to review results, assess performance, and allocate resources. Such oversight and decision making includes, among others, pricing, approving capital expenditures, and identifying growth opportunities. The key metric used to assess the performance of our Other segment is service margin. The service margin is equal to service revenue minus cost of service revenue. We do not report total assets by segment since this is not a metric used to assess segment performance or allocate resources.\nYear Ended December 31, 2024\nMedicaid\nMedicare \nMarketplace\nOther\nTotal\n(In millions)\nRevenue:\nPremium revenue\n$\n30,579\n \n$\n5,542\n \n$\n2,506\n \n$\n—\n \n$\n38,627\n \nService revenue\n—\n \n—\n \n—\n \n81\n \n81\n \nRevenue from external customers\n30,579\n \n5,542\n \n2,506\n \n81\n \n38,708\n \nOther operating revenues \n(1)\n1,942\n \nTotal revenue\n40,650\n \nOperating Expenses:\nMedical care costs\n27,600\n \n4,939\n \n1,889\n \n—\n \n34,428\n \nCost of service revenue\n—\n \n—\n \n—\n \n73\n \n73\n \nSegment expenses\n27,600\n \n4,939\n \n1,889\n \n73\n \n34,501\n \nOther operating expenses \n(2)\n4,442\n \nOperating income\n1,707\n \nLess: interest expense\n118\n \nIncome before income tax expense\n$\n1,589\n \nSegment Margin:\nMedical margin\n$\n2,979\n \n$\n603\n \n$\n617\n \n$\n—\n \n$\n4,199\n \nService margin\n—\n \n—\n \n—\n \n8\n \n8\n \nMolina Healthcare, Inc. 2024 Form 10-K | 84\nYear Ended December 31, 2023\nMedicaid\nMedicare \nMarketplace\nOther\nTotal\n(In millions)\nRevenue:\nPremium revenue\n$\n26,327\n \n$\n4,179\n \n$\n2,023\n \n$\n—\n \n$\n32,529\n \nService revenue\n—\n \n—\n \n—\n \n76\n \n76\n \nRevenue from external customers\n26,327\n \n4,179\n \n2,023\n \n76\n \n32,605\n \nOther operating revenues \n(1)\n1,467\n \nTotal revenue\n34,072\n \nOperating Expenses:\nMedical care costs\n23,354\n \n3,791\n \n1,524\n \n—\n \n28,669\n \nCost of service revenue\n—\n \n—\n \n—\n \n67\n \n67\n \nSegment expenses\n23,354\n \n3,791\n \n1,524\n \n67\n \n28,736\n \nOther operating expenses \n(2)\n3,763\n \nOperating income\n1,573\n \nLess: interest expense\n109\n \nIncome before income tax expense\n$\n1,464\n \nSegment Margin:\nMedical margin\n$\n2,973\n \n$\n388\n \n$\n499\n \n$\n—\n \n$\n3,860\n \nService margin\n—\n \n—\n \n—\n \n9\n \n9\n \nYear Ended December 31, 2022\nMedicaid\nMedicare \nMarketplace\nOther\nTotal\n(In millions)\nRevenue:\nPremium revenue\n$\n24,827\n \n$\n3,795\n \n$\n2,261\n \n$\n—\n \n$\n30,883\n \nService revenue\n—\n \n—\n \n—\n \n71\n \n71\n \nRevenue from external customers\n24,827\n \n3,795\n \n2,261\n \n71\n \n30,954\n \nOther operating revenues \n(1)\n1,020\n \nTotal revenue\n31,974\n \nOperating Expenses:\nMedical care costs\n21,846\n \n3,358\n \n1,971\n \n—\n \n27,175\n \nCost of service revenue\n—\n \n—\n \n—\n \n60\n \n60\n \nSegment expenses\n21,846\n \n3,358\n \n1,971\n \n60\n \n27,235\n \nOther operating expenses \n(2)\n3,566\n \nOperating income\n1,173\n \nLess: interest expense\n110\n \nIncome before income tax expense\n$\n1,063\n \nSegment Margin:\nMedical margin\n$\n2,981\n \n$\n437\n \n$\n290\n \n$\n—\n \n$\n3,708\n \nService margin\n—\n \n—\n \n—\n \n11\n \n11\n \n______________________\n(1)\nOther operating revenues include premium tax revenue, investment income and certain other revenue.\n(2)\nOther operating expenses include general and administrative expenses, premium tax expenses, depreciation and amortization, impairment, and certain other operating expenses.\nMolina Healthcare, Inc. 2024 Form 10-K | 85\n17. \nCondensed Financial Information of Registrant \nThe condensed balance sheets as of December 31, 2024 and 2023, and the related condensed statements of income, comprehensive income and cash flows for each of the three years in the period ended December 31, 2024 for our parent company Molina Healthcare, Inc. (the “Registrant”), are presented below.\nCondensed Balance Sheets\n \nDecember 31,\n \n2024\n2023\n \n(In millions, except per-share data)\nASSETS\nCurrent assets:\n \nCash and cash equivalents\n$\n414\n \n$\n694\n \nInvestments\n31\n \n48\n \nReceivables\n4\n \n—\n \nDue from affiliates\n111\n \n174\n \nPrepaid expenses and other current assets\n218\n \n133\n \nTotal current assets\n778\n \n1,049\n \nProperty, equipment, and capitalized software, net\n250\n \n234\n \nGoodwill and intangible assets, net\n1,348\n \n825\n \nInvestments in subsidiaries\n5,697\n \n4,911\n \nDeferred income taxes, net\n—\n \n57\n \nAdvances to related parties and other assets\n102\n \n94\n \nTotal assets\n$\n8,175\n \n$\n7,170\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\n \n \nAccounts payable, accrued liabilities and other\n$\n473\n \n$\n527\n \nTotal current liabilities\n473\n \n527\n \nLong-term debt\n2,923\n \n2,180\n \nFinance lease liabilities\n195\n \n205\n \nDeferred income taxes, net\n34\n \n—\n \nOther long-term liabilities\n54\n \n43\n \nTotal liabilities\n3,679\n \n2,955\n \nStockholders’ equity:\nCommon stock, $\n0.001\n par value; \n150\n million shares authorized; outstanding: \n56\n million shares at December 31, 2024 and \n58\n million at December 31, 2023\n—\n \n—\n \nPreferred stock, $\n0.001\n par value; \n20\n million shares authorized, \nno\n shares issued and outstanding\n—\n \n—\n \nAdditional paid-in capital\n462\n \n410\n \nAccumulated other comprehensive loss\n(\n57\n)\n(\n82\n)\nRetained earnings\n4,091\n \n3,887\n \nTotal stockholders’ equity\n4,496\n \n4,215\n \nTotal liabilities and stockholders’ equity\n$\n8,175\n \n$\n7,170\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 86\nCondensed Statements of Income\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nRevenue:\n \n \n \nAdministrative services fees\n$\n2,145\n \n$\n2,038\n \n$\n1,826\n \nInvestment income and other revenue\n19\n \n27\n \n8\n \nTotal revenue\n2,164\n \n2,065\n \n1,834\n \nExpenses:\n \nGeneral and administrative expenses\n2,039\n \n1,952\n \n1,721\n \nDepreciation and amortization\n139\n \n131\n \n141\n \nImpairment\n—\n \n—\n \n138\n \nOther\n29\n \n20\n \n—\n \nTotal operating expenses\n2,207\n \n2,103\n \n2,000\n \nOperating loss\n(\n43\n)\n(\n38\n)\n(\n166\n)\nInterest expense\n118\n \n109\n \n110\n \nLoss before income tax benefit and equity in net earnings of subsidiaries\n(\n161\n)\n(\n147\n)\n(\n276\n)\nIncome tax expense (benefit)\n7\n \n(\n7\n)\n(\n42\n)\nNet loss before equity in net earnings of subsidiaries\n(\n168\n)\n(\n140\n)\n(\n234\n)\nEquity in net earnings of subsidiaries\n1,347\n \n1,231\n \n1,026\n \nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nCondensed Statements of Comprehensive Income\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nNet income\n$\n1,179\n \n$\n1,091\n \n$\n792\n \nOther comprehensive income (loss):\nUnrealized investment income (loss)\n33\n \n102\n \n(\n204\n)\nLess: effect of income taxes\n8\n \n24\n \n(\n49\n)\nOther comprehensive income (loss), net of tax\n25\n \n78\n \n(\n155\n)\nComprehensive income\n$\n1,204\n \n$\n1,169\n \n$\n637\n \nSee accompanying notes.\nMolina Healthcare, Inc. 2024 Form 10-K | 87\nCondensed Statements of Cash Flows\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nOperating activities:\n \n \n \nNet cash provided by operating activities\n$\n63\n \n$\n81\n \n$\n119\n \nInvesting activities:\n \nCapital contributions to subsidiaries\n(\n490\n)\n(\n221\n)\n(\n159\n)\nDividends received from subsidiaries\n997\n \n705\n \n668\n \nPurchases of investments\n—\n \n(\n2\n)\n(\n29\n)\nProceeds from sales and maturities of investments\n17\n \n1\n \n49\n \nPurchases of property, equipment and capitalized software\n(\n97\n)\n(\n79\n)\n(\n86\n)\nNet cash paid in business combinations \n(\n489\n)\n(\n74\n)\n—\n \nChange in amounts due to/from affiliates\n60\n \n5\n \n(\n69\n)\nOther, net\n6\n \n7\n \n3\n \nNet cash provided by investing activities\n4\n \n342\n \n377\n \nFinancing activities:\n \nCommon stock purchases\n(\n1,000\n)\n—\n \n(\n400\n)\nProceeds from senior notes offering, net of issuance costs\n740\n \n—\n \n—\n \nProceeds from borrowings under credit facility\n300\n \n—\n \n—\n \nRepayment of credit facility\n(\n300\n)\n—\n \n—\n \nCommon stock withheld to settle employee tax obligations \n(\n57\n)\n(\n60\n)\n(\n54\n)\nContingent consideration liabilities settled\n—\n \n—\n \n(\n20\n)\nOther, net\n(\n30\n)\n2\n \n33\n \nNet cash used in financing activities\n(\n347\n)\n(\n58\n)\n(\n441\n)\nNet (decrease) increase in cash and cash equivalents\n(\n280\n)\n365\n \n55\n \nCash and cash equivalents at beginning of period\n694\n \n329\n \n274\n \nCash and cash equivalents at end of period\n$\n414\n \n$\n694\n \n$\n329\n \nSee accompanying notes.\nNotes to Condensed Financial Information of Registrant \nNote A - Basis of Presentation \nThe Registrant was incorporated in 2002. Prior to that date, Molina Healthcare of California (formerly known as Molina Medical Centers) operated as a California health plan and as the parent company for three other state health plans. In June 2003, the employees and operations of the corporate entity were transferred from Molina Healthcare of California to the Registrant. \nThe Registrant’s investment in subsidiaries is stated at cost plus equity in undistributed earnings of subsidiaries since the date of acquisition. The accompanying condensed financial information of the Registrant should be read in conjunction with the consolidated financial statements and accompanying notes. \nNote B - Transactions with Subsidiaries\nThe Registrant provides certain centralized medical and administrative services to our subsidiaries pursuant to administrative services agreements that include, but are not limited to, information technology, product development and administration, underwriting, claims processing, customer service, certain care management services, human resources, marketing, purchasing, risk management, actuarial, finance, accounting, compliance, legal and public relations. Fees are based on the fair market value of services rendered and are recorded as operating revenue. Payment is subordinated to the subsidiaries’ ability to comply with minimum capital and other restrictive financial requirements of the states in which they operate. Charges in 2024, 2023, and 2022 for these services amounted to $\n2,145\n million, $\n2,038\n million, and $\n1,826\n million, respectively, and are included in operating revenue. \nMolina Healthcare, Inc. 2024 Form 10-K | 88\nThe Registrant and its subsidiaries are included in the consolidated federal and state income tax returns filed by the Registrant. Income taxes are allocated to each subsidiary in accordance with an intercompany tax allocation agreement. The agreement allocates income taxes in an amount generally equivalent to the amount which would be expensed by the subsidiary if it filed a separate tax return. Net operating loss benefits are paid to the subsidiary by the Registrant to the extent such losses are utilized in the consolidated tax returns.\nNote C - Dividends and Capital Contributions \nWhen the Registrant receives dividends from its subsidiaries, such amounts are recorded as a reduction to the investments in the respective subsidiaries.\nFor all periods presented, the Registrant made capital contributions to certain subsidiaries primarily to comply with minimum net worth requirements and to fund business combinations. Such amounts have been recorded as an increase in investment in the respective subsidiaries.\n \nMolina Healthcare, Inc. 2024 Form 10-K | 89\nItem 9A. CONTROLS AND PROCEDURES\nMANAGEMENT’S EVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nWe maintain disclosure controls and procedures, as defined in Rule 13a-15(e) and Rule 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of any possible controls and procedures.\nOur management, with the participation of our chief executive officer and our chief financial officer, evaluated, as of the end of the period covered by this Form 10-K, the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) and Rule 15d-15(e) of the Exchange Act). Based on this evaluation, our chief executive officer and our chief financial officer concluded that our disclosure controls and procedures were effective as of December 31, 2024, at the reasonable assurance level. In addition, management concluded that our consolidated financial statements included in this Annual Report on Form 10-K are fairly stated in all material respects in accordance with U.S. generally accepted accounting principles (“GAAP”) for each of the periods presented herein.\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements.\nInternal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements prepared for external purposes in accordance with GAAP. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness of our internal control over financial reporting to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement concluded that we maintained effective internal control over financial reporting as of December 31, 2024, based on criteria described in \nInternal Control-Integrated Framework \n(2013)\n \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”).\nEffective January 1, 2024, we completed our acquisition of Brand New Day and Central Health Plan of California (“Bright Health Medicare”). We are in the process of evaluating the existing controls and procedures of Bright Health Medicare, and integrating them into our internal controls over financial reporting. In accordance with SEC Staff guidance permitting a company to exclude an acquired business from management’s assessment of effectiveness of internal control over financial reporting for the year in which the acquisition is completed, we have excluded the business that we acquired in the Bright Health Medicare acquisition from our assessment of the effectiveness of internal control over financial reporting as of December 31, 2024. The business that we acquired in the Bright Health Medicare acquisition constituted 3% and 5% of total and net assets, respectively, as of December 31, 2024, and 3% and 1% of revenues and net income, respectively, for the year ended December 31, 2024. The scope of management’s assessment of the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2024, includes all of our consolidated operations except for those disclosure controls and procedures of Bright Health Medicare that are subsumed by internal control over financial reporting.\nErnst & Young, LLP, the independent registered public accounting firm who audited our Consolidated Financial Statements included in this Form 10-K, has issued a report on our internal control over financial reporting, which is included herein.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting (as defined in Rule 13a-15(f) of the Exchange Act) during the quarter ended December 31, 2024, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \nMolina Healthcare, Inc. 2024 Form 10-K | 90\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Molina Healthcare, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Molina Healthcare, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the “COSO criteria”). In our opinion, Molina Healthcare, Inc. (the “Company”) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nAs indicated in the accompanying Management’s Report on Internal Control Over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of Bright Health Medicare, which is included in the 2024 consolidated financial statements of the Company and constituted 3% and 5% of total and net assets, respectively, as of December 31, 2024, and 3% and 1% of revenues and net income, respectively, for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of Bright Health Medicare.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nMolina Healthcare, Inc. 2024 Form 10-K | 91\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/ Ernst & Young LLP\nLos Angeles, California\nFebruary 11, 2025 \nMolina Healthcare, Inc. 2024 Form 10-K | 92\nItem 9B. OTHER INFORMATION\n(a)    None. \n(b)    No director or officer (as defined in 17 CFR § 240.16a-1(f)) of the Company \nadopted\n or \nterminated\n (i) any contract, instruction or written plan for the purchase or sale of securities of the Company intended to satisfy the affirmative defense conditions of Rule 10b5-1(c), or (ii) any “non-Rule 10b5-1 trading arrangement” (as defined in 17 CFR § 229.408(c)) during the three months ended December 31, 2024.\nPART III\nItem 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nInformation required by Item 10 of Part III will be included in our Proxy Statement relating to our 2025 Annual Meeting of Stockholders (the “2025 Proxy Statement”), and is incorporated herein by reference. This information will be included in the following sections of the 2025 Proxy Statement:\n•\nPROPOSAL 1 - Election of Directors\n•\nInformation About Director Nominees\n•\nInformation About Directors Continuing in Office\n•\nAdditional Information About Directors\n•\nCorporate Governance and Board of Directors Matters\n•\nInformation About the Executive Officers of the Company\n•\nSection 16(a) Beneficial Ownership Reporting Compliance\nInformation relating to our Code of Business Conduct and Ethics, our Insider Trading Policy and compliance with Section 16(a) of the Exchange Act will be set forth in the 2025 Proxy Statement and is incorporated herein by reference. We intend to disclose on our website any amendments to or waivers of our Code of Business Conduct and Ethics as required by law or NYSE rules, under the heading “Investor Information—Corporate Governance” at molinahealthcare.com. \nItem 11. EXECUTIVE COMPENSATION\nInformation required by Item 11 of Part III will be included in the 2025 Proxy Statement in the section entitled “Executive Compensation,” and is incorporated herein by reference. \nItem 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nInformation required by Item 12 of Part III will be included in the 2025 Proxy Statement in the section entitled “Security Ownership of Certain Beneficial Owners and Management,” and is incorporated herein by reference. \nItem 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation required by Item 13 of Part III will be included in the 2025 Proxy Statement in the sections entitled “Related Party Transactions,” and “Corporate Governance and Board of Directors Matters—Director Independence,” and is incorporated herein by reference.\nItem 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent registered public accounting firm is Ernst & Young LLP, Los Angeles, CA, Auditor Firm ID: \n42\n. \nInformation required by Item 14 of Part III will be included in the 2025 Proxy Statement in the section entitled “Fees Paid to Independent Registered Public Accounting Firm,” and is incorporated herein by reference.\nMolina Healthcare, Inc. 2024 Form 10-K | 93\nPART IV\nItem 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES \nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \n(1)    The consolidated financial statements are included in this report in the section entitled “Financial Statements and Supplementary Data.”\n(2)    Financial Statement Schedules: \nSchedules for which provision is made in the applicable accounting regulations of the SEC are not required under the related instructions, are inapplicable, or the required information is included in the consolidated financial statements, and therefore have been omitted.\nEXHIBITS\nReference is made to the accompanying “Index to Exhibits.” \nMolina Healthcare, Inc. 2024 Form 10-K | 94\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the undersigned registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 11th day of February, 2025.\n \nMOLINA HEALTHCARE, INC.\nBy:\n/s/ Joseph M. Zubretsky\nJoseph M. Zubretsky\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities as indicated, as of February 11, 2025. \nSignature\nTitle\n/s/ Joseph M. Zubretsky\nChief Executive Officer, President and Director\nJoseph M. Zubretsky\n(Principal Executive Officer)\n/s/ Mark L. Keim\nChief Financial Officer\nMark L. Keim\n(Principal Financial Officer)\n/s/ Maurice S. Hebert\nChief Accounting Officer\nMaurice S. Hebert\n(Principal Accounting Officer)\n/s/ Barbara L. Brasier\nDirector\nBarbara L. Brasier\n/s/ Daniel Cooperman\nDirector\nDaniel Cooperman\n/s/ Stephen H. Lockhart\nDirector\nStephen H. Lockhart\n/s/ Steven J. Orlando\nDirector\nSteven J. Orlando\n/s/ Ronna E. Romney\nDirector\nRonna E. Romney\n/s/ Richard M. Schapiro\nDirector\nRichard M. Schapiro\n/s/ Dale B. Wolf\nChairman of the Board\nDale B. Wolf\n/s/ Richard C. Zoretic\nDirector\nRichard C. Zoretic\n \nMolina Healthcare, Inc. 2024 Form 10-K | 95\nINDEX TO EXHIBITS\nThe following exhibits are filed or furnished, as applicable, with this Annual Report on Form 10-K (this “Form 10-K”) or incorporated herein by reference.\nThe agreements included or incorporated by reference as exhibits to this Form 10-K may contain representations and warranties by each of the parties to the applicable agreement. These representations and warranties were made solely for the benefit of the other parties to the applicable agreement and (i) were not intended to be treated as categorical statements of fact, but rather as a way of allocating the risk to one of the parties if those statements prove to be inaccurate; (ii) may have been qualified in such agreement by disclosures that were made to the other party in connection with the negotiation of the applicable agreement; (iii) may apply contract standards of “materiality” that are different from “materiality” under the applicable securities laws; and (iv) were made only as of the date of the applicable agreement or such other date or dates as may be specified in the agreement. The Company acknowledges that, notwithstanding the inclusion of the foregoing cautionary statements, it is responsible for considering whether additional specific disclosures of material information regarding material contractual provisions are required to make the statements in this Form 10-K not misleading.\nNumber\nDescription\nMethod of Filing\n3.1\nCertificate of Incorporation\nFiled as Exhibit 3.2 to registrant’s Registration Statement on Form S-1 filed December 30, 2002\n3.2\nCertificate of Amendment to Certificate of Incorporation\nFiled as Exhibit 3.2 to registrant’s Form 10-K filed February 13, 2024\n3.3\nCertificate of Amendment to Certificate of Incorporation\nFiled as Exhibit 3.3 to registrant’s Form 10-K filed February 13, 2024\n3.4\nAmended and Restated Bylaws of Molina Healthcare, Inc.\nFiled as Exhibit 3.1 to registrant’s Form 8-K filed December 26, 2023\n4.1\nIndenture, dated as of June 2, 2020, by and between Molina Healthcare, Inc. and U.S. Bank National Association, as Trustee\nFiled as Exhibit 4.1 to registrant’s Form 8-K filed June 2, 2020\n4.2\nForm of 4.375% Notes (included in Exhibit 4.1).\nFiled as Exhibit 4.2 to registrant’s Form 8-K filed June 2, 2020 (Included in Exhibit 4.1 to registrant’s Form 8-K filed June 2, 2020)\n4.3\nIndenture, dated as of November 17, 2020, by and between Molina Healthcare, Inc. and U.S. Bank National Association, as Trustee\nFiled as Exhibit 4.1 to registrant’s Form 8-K filed November 17, 2020\n4.4\nForm of 3.875% Notes due 2030 (included in Exhibit 4.3)\nFiled as Exhibit 4.2 to registrant’s Form 8-K filed November 17, 2020 (Included in Exhibit 4.1 to registrant’s Form 8-K filed November 17, 2020)\n4.5\nIndenture, dated as of November 16, 2021, by and between Molina Healthcare, Inc. and U.S. Bank National Association, as Trustee\nFiled as Exhibit 4.1 to registrant’s Form 8-K filed November 16, 2021\n4.6\nForm of 3.875% Notes due 2032 (included in Exhibit 4.5)\nFiled as Exhibit 4.2 to registrant’s Form 8-K filed November 16, 2021 (Included in Exhibit 4.1 to registrant’s Form 8-K filed November 16, 2021)\n4.7\nDescription of Registrant’s Securities\nFiled herewith\n4.8\nIndenture, dated as of November 18, 2024, by and between Molina Healthcare, Inc. and U.S. Bank Company Trust Company, National Association, as Trustee\nFiled as Exhibit 4.1 to registrant’s Form 8-K filed November 18, 2024\n4.9\nForm of 6.250% Notes due 2033\nFiled as Exhibit 4.2 to registrant’s Form 8-K filed November 18, 2024 (Included in Exhibit 4.1 to registrant’s Form 8-K filed November 18, 2024)\n***10.1\nCredit Agreement, dated as of June 8, 2020, by and among Molina Healthcare, Inc., as the Borrower, Truist Bank, as Administrative Agent, Issuing Bank and Swingline Lender, and the Lenders party thereto\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed June 8, 2020\n10.2\nFirst Amendment to Credit Agreement, dated as of April 26, 2023, by and between Molina Healthcare, Inc. and Truist Bank, in its capacity as Administrative Agent\nFiled as Exhibit 10.1 to registrant’s Form 10-Q filed April 27, 2023\n***10.3\nSecond Amendment to Credit Agreement, dated as of September 20, 2024, by and among the Company, the Lenders party thereto and Truist Bank, as Administrative Agent, Issuing Bank and Swingline Lender\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed September 23, 2024\nMolina Healthcare, Inc. 2024 Form 10-K | 96\nNumber\nDescription\nMethod of Filing\n*10.4\n2019 Employee Stock Purchase Plan\nFiled as Exhibit 10.3 to registrant’s Form 10-K filed February 13, 2024\n*10.5\nMolina Healthcare, Inc. 2019 Equity Incentive Plan\nFiled herewith\n*10.6\n2019 Equity Incentive Plan - Form of Restricted Stock Award Agreement (Employee/Officer with No Employment Agreement)\nFiled as Exhibit 10.1 to registrant’s Form 10-Q filed July 31, 2019\n*10.7\n2019 Equity Incentive Plan - Form of Performance Stock Unit Award Agreement (Employee/Officer with No Employment Agreement)\nFiled as Exhibit 10.2 to registrant’s Form 10-Q filed July 31, 2019\n*10.8\n2019 Equity Incentive Plan - Form of Restricted Stock Award Agreement (Officer with Employment Agreement)\nFiled as Exhibit 10.3 to registrant’s Form 10-Q filed July 31, 2019\n*10.9\n2019 Equity Incentive Plan - Form of Performance Stock Unit Award Agreement (Officer with Employment Agreement)\nFiled as Exhibit 10.4 to registrant’s Form 10-Q filed July 31, 2019\n*10.10\nMolina Healthcare, Inc. Second Amended and Restated Change in Control Severance Plan\nFiled as Exhibit 10.14 to registrant’s Form 10-K filed February 16, 2021\n*10.11\nForm of Indemnification Agreement\nFiled as Exhibit 10.14 to registrant’s Form 10-K filed March 14, 2007\n*10.12\nMolina Healthcare, Inc. Amended and Restated Deferred Compensation Plan (2022)\nFiled as Exhibit 10.10 to registrant’s Form 10-K filed February 14, 2022\n*10.13\nFirst Amendment to Molina Healthcare, Inc. Amended and Restated Deferred Compensation Plan (2022)\nFiled as Exhibit 10.1 to registrant’s Form 10-Q filed October 26, 2023\n*10.14\nEmployment Agreement with Jeff Barlow dated June 14, 2013\nFiled as Exhibit 10.3 to registrant’s Form 8-K filed June 14, 2013\n*10.15\nChange in Control Agreement with Jeff D. Barlow, dated as of September 18, 2012\nFiled as Exhibit 10.16 to registrant’s Form 10-K filed February 28, 2013\n*10.16\nAmended and Restated Employment Agreement, dated September 8, 2021, by and between Molina Healthcare, Inc. and Joseph M. Zubretsky\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed September 9, 2021\n*10.17\nAmendment of Employment Agreement, dated February 16, 2022, by and between Molina Healthcare, Inc. and Joseph M. Zubretsky\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed February 16, 2022\n*10.18\nAmendment of Employment Agreement, dated August 19, 2024, by and between Molina Healthcare, Inc. and Joseph M. Zubretsky\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed August 20, 2024\n*10.19\nPerformance Stock Unit Award Agreement, dated August 19, 2024, by and between Molina Healthcare, Inc. and Joseph M. Zubretsky\nFiled as Exhibit 10.2 to registrant’s Form 8-K filed August 20, 2024\n*10.20\nPerformance Stock Unit Award Agreement, dated October 16, 2024, by and between Molina Healthcare, Inc. and Mark L. Keim\nFiled as Exhibit 10.1 to registrant’s Form 8-K filed October 17, 2024\n+10.21\nMaster Services Agreement for Information Technology Services, dated February 4, 2019, by and between Molina Healthcare, Inc. and Infosys Limited\nFiled as Exhibit 10.36 to registrant’s Form 10-K filed February 19, 2019\n***10.22\nFirst Amendment, dated August 1, 2019, to the Master Services Agreement for Information Technology Services, dated February 4, 2019, by and between Molina Healthcare, Inc. and Infosys Limited\nFiled as Exhibit 10.1 to registrant’s Form 10-Q filed October 30, 2019\n**10.23\nChange Request #7 to the Master Services Agreement dated February 2, 2019, by and between Molina Healthcare, Inc. and Infosys Limited\nFiled as Exhibit 10.1 to registrant’s Form 10-Q filed October 27, 2022\n19.1\nInsider Trading Policy\nFiled herewith\n21.1\nList of Subsidiaries\nFiled herewith\n23.1\nConsent of Independent Registered Public Accounting Firm\nFiled herewith\n31.1\nSection 302 Certification of Chief Executive Officer\nFiled herewith\n31.2\nSection 302 Certification of Chief Financial Officer\nFiled herewith\n32.1\nCertificate of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\nMolina Healthcare, Inc. 2024 Form 10-K | 97\nNumber\nDescription\nMethod of Filing\n32.2\nCertificate of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished herewith\n97\nMolina Healthcare, Inc. Policy for Recovery of Erroneously Awarded Compensation\nFiled as Exhibit 97 to registrant’s Form 10-K filed February 13, 2024\n101.INS\nInline XBRL Taxonomy Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the inline XBRL document.\nFiled herewith\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nFiled herewith\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nFiled herewith\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nFiled herewith\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nFiled herewith\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nFiled herewith\n104\nCover Page Interactive Data file (formatted as Inline XBRL and embedded within Exhibit 101)\nFiled herewith\n*\nManagement contract or compensatory plan or arrangement.\n**\nCertain portions of this agreement have been omitted in accordance with Item 601(b)(10) of Regulation S-K. A copy of any omitted portion will be furnished to the Securities and Exchange Commission upon request. The location of the redacted confidential information is indicated in the exhibit as “[redacted]”. \n***\nCertain schedules (or similar attachments) to this exhibit have been omitted pursuant to Regulation S-K, Item 601(a)(5). The registrant agrees to furnish a copy of any omitted schedule (or similar attachment) to the Securities and Exchange Commission upon request. \n+\nPortions of this exhibit have been omitted pursuant to a request for confidential treatment filed with the Securities and Exchange Commission under Rule 24b-2. The omitted confidential material has been filed separately. The location of the redacted confidential information is indicated in the exhibit as “[redacted]”.\nMolina Healthcare, Inc. 2024 Form 10-K | 98"
  }
}