{
  "ticker": "MOS",
  "cik": "0001285785",
  "company_name": "MOSAIC CO",
  "filing_date": "2025-03-03",
  "accession": "0001618034-25-000003",
  "primary_doc": "mos-20241231.htm",
  "item_sections": {
    "item1": "Item 1. “Business,” in this report is incorporated herein by reference. \nThe information under the heading \"Corporate Governance - Insider Trading Policy\" included in our definitive proxy statement for our 2025 annual meeting of stockholders is incorporated herein by reference.  A copy of our insider trading policy is filed as Exhibit 19 to this Form 10-K.\nWe have a Code of Business Conduct and Ethics within the meaning of Item 406 of Regulation S-K adopted by the SEC under the Exchange Act that applies to our principal executive officer, principal financial officer and principal accounting officer. Our Code of Business Conduct and Ethics is available on Mosaic’s website (www.mosaicco.com) and we intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K regarding any amendment to, or waiver from, a provision of our code of ethics by posting such information on our website. The information contained on Mosaic’s website is not being incorporated herein.\nItem 11.  Executive Compensation.\nThe information under the headings “Director Compensation” and “Executive Compensation” included in our definitive proxy statement for our 2025 annual meeting of stockholders is incorporated herein by reference.\nItem 12.  Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information under the headings “Beneficial Ownership of Securities” and “Certain Relationships and Related Transactions” included in our definitive proxy statement for our 2025 annual meeting of stockholders is incorporated herein by reference. The table containing information related to equity compensation plans set forth in Part II, “Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities” of this report is also incorporated herein by reference.\nItem 13.  Certain Relationships and Related Transactions, and Director Independence.\nThe information under the headings “Corporate Governance\n–\nBoard Independence,” “Corporate Governance\n–\nCommittees of the Board of Directors,” “Corporate Governance\n–\nOther Policies Relating to the Board of Directors\n–\nPolicy and Procedures Regarding Transactions with Related Persons,” and “Certain Relationships and Related Transactions” included in our definitive proxy statement for our 2025 annual meeting of stockholders is incorporated herein by reference.\nItem 14.  Principal Accounting Fees and Services.\nOur independent registered public accounting firm is \nKPMG LLP\n, \nTampa, FL\n, Auditor Firm ID: \n185\n.\nThe information included under “Audit Committee Report and Payment of Fees to Independent Registered Public Accounting Firm\n–\nFees Paid to Independent Registered Public Accounting Firm” and “Audit Committee Report and Payment of Fees to Independent Registered Public Accounting Firm\n–\nPre-approval of Independent Registered Public Accounting Firm Services” is included in our definitive proxy statement for our 2025 annual meeting of stockholders is incorporated herein by reference.\n 91\nPART IV.\nItem 15. Exhibits and Financial Statement Schedules.  \n(a)\n(1)\nConsolidated Financial Statements filed as part of this report are listed in the Financial Table of Contents included in this report and incorporated by reference in this report in Part II, Item 8, “Financial Statements and Supplementary Data”.\n(2)\nAll schedules for which provision is made in the applicable accounting regulations of the SEC are listed in this report in Part II, Item 8, “Financial Statements and Supplementary Data”.\n(3)\nReference is made to the Exhibit Index in (b) below.\n(b)\nExhibits\nExhibit No.\nDescription\nIncorporated Herein by\nReference to\nFiled with\nElectronic\nSubmission\n3.i.\nRestated Certificate of Incorporation of Mosaic, effective May 19, 2016\nExhibit 3.i to Mosaic’s Current Report on Form 8-K dated May 19, 2016 and filed on May 23, 2016\n(2)\n3.ii.\nAmended and Restated Bylaws of Mosaic, effective December 15, 2023\nExhibit 3.1 to Mosaic’s Current Report on Form 8-K dated December 15, 2023 and filed on December 20, 2023\n(2)\n4.i\nCredit Agreement dated as of August 19, 2021, among Mosaic, Bank of America, N.A., as administrative agent, Swing Line Lender and an L/C Issuer, and the lenders and other L/D Issuers party thereto\nExhibit 4.i to Mosaic’s Current Report on Form 8-K dated August 23, 2021 and filed on August 23, 2021\n(2)\n4.ii\nFirst Amendment to Credit Agreement, dated as of May 10, 2023, among The Mosaic Company, as borrower, Bank of America, N.A., as Administrative Agent, Swing Line Lender and an L/C Issuer, and the lenders and other L/C Issuers party thereto\nExhibit 10.1 to Mosaic’s Current Report on Form 8-K dated May 10, 2023, and filed on May 10, 2023\n4.iii\nIndenture dated as of October 24, 2011, between Mosaic and U.S. Bank National Association, as trustee\n.\nRegistrant hereby agrees to furnish to the Commission, upon request, all other instruments defining the rights of holders of each issue of long-term debt of the Registrant and its consolidated subsidiaries\nExhibit 4.1 to Mosaic’s Current Report on Form 8-K dated October 24, 2011 and filed on October 24, 2011\n(2)\n4.iv\nDescription of Registrant\n’\ns Common Stock\nExhibit 4.iii to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019\n10.iii.a.\n(3)\nThe Mosaic Company 2004 Omnibus Stock and Incentive Plan (the “Omnibus Incentive Plan”), as amended October 8, 2009\nAppendix A to Mosaic’s Proxy Statement dated August 25, 2009\n(2)\n10.iii.a.1\n(3)\nForm of Amendment dated May 11, 2011, to the Omnibus Incentive Plan\nExhibit 10.iii.u. to Mosaic’s Annual Report on Form 10-K for the Fiscal Year ended May 31, 2011\n(2)\n10.iii.a.2\n(3)\nForm of Employee Nonqualified Stock Option Award Agreement under the Omnibus Incentive Plan, approved July 20, 2011\nExhibit 10.iii.b. to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended August 31, 2011\n(2)\n 92\n10.iii.c.1\n(3)\nMosaic Nonqualified Deferred Compensation Plan, as amended and restated effective December 15, 2023\nExhibit 10.iii.c.i to Mosaic's Annual Report on Form 10-K for the Fiscal Year ended December 31, 2023\n10.iii.c.2\n(3)\nMosaic LTI Deferral Plan, approved March 5, 2015\nExhibit 10.1 to Mosaic’s Current Report on Form 8-K dated March 5, 2015 and filed on March 11, 2015\n(2)\n10.iii.c.3\n(3)\nAmendment to Mosaic LTI Deferral Plan, approved March 1, 2017\nExhibit 10.iii.c.4 to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended March 31, 2017\n(2)\n10.iii.c.4\n(3)\nMosaic LTI Deferral Plan, approved December 18, 2024\nX\n10.iii.d.1\n(3)\nForm of Senior Management Severance and Change in Control Agreement effective April 1, 2023\nExhibit 10.iii.d to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended March 31, 2023\n10.iii.d.2\nForm of Non-Competition, Non-Solicitation, Non-Defamation and Confidentiality Agreement effective April 1, 2023\nExhibit 10.iii.d.2. to Mosaic’s Quarterly Report on Form 10-Q of Mosaic for the Quarterly Period ended March 31, 2023\n(2)\n10.iii.d.3\n(3)\nForm of expatriate agreement dated November 1, 2019 between Mosaic and an executive officer\nExhibit 10.1 to Mosaic’s Current Report on Form 8-K dated October 31, 2019 and filed on November 4, 2019\n10.iii.d.4\n(3)\nForm of expatriate agreement dated January 8, 2016, between Mosaic and an executive officer\nExhibit 10.iii.d to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended March 31, 2022\n10.iii.e.1\n(3)\nAgreement between Cargill and Mosaic relating to certain former Cargill employees’ participation in the Cargill International Pension Plan\nExhibit 10.iii.b. to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended August 31, 2012\n(2)\n10.iii.e.2\n(3)\nForm of Supplemental Agreement between Mosaic and certain former participants in the Cargill International Pension Plan\nExhibit 10.iii.x. to Mosaic’s Annual Report on Form 10-K of Mosaic for the fiscal year ended May 31, 2013\n(2)\n10.iii.f.\n(3)\nForm of Indemnification Agreement between Mosaic and its directors and executive officers\nExhibit 10.iii. to Mosaic’s Current Report on Form 8-K dated October 8, 2008, and filed on October 14, 2008\n(2)\n10.iii.i.\n(3)\nThe Mosaic Company 2014 Stock and Incentive Plan (the “2014 Incentive Plan”)\nAppendix B to Mosaic’s Proxy Statement dated April 2, 2014\n(2)\n 93\n10.iii.j.\n(3)\nForm of Amendment dated August 14, 2019, to the 2014 Incentive Plan\nExhibit 10.iii.j to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019\n10.iii.k.1\n(3)\nForm of Non-Qualified Stock Option Award Agreement under the 2014 Incentive Plan, approved March 5, 2015\nExhibit 10.iii.a. to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended March 31, 2015\n(2)\n10.iii.k.2\n(3)\nForm of Non-Qualified Stock Option Award Agreement under the 2014 Incentive Plan, approved March 2, 2016\nExhibit 10.iii.a. to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period ended March 31, 2016\n(2)\n10.iii.k.7\n(3)\nForm of Global Restricted Stock Unit Award Agreement (March 2023)\nExhibit 10.iii.k.1 to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2023\n10.iii.k.8\n(3)\nForm of Executive TSR Performance Unit Award Agreement (Stock-Settled - March 2023)\nExhibit 10.iii.k.2 to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2023\n10.iii.k.9\n(3)\nForm of Executive TSR Performance Unit Award Agreement (Cash-Settled - March 2023)\nExhibit 10.iii.k.3 to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2023\n10.iii.k.10\n(3)\nForm of Director Restricted Stock Unit Award Agreement under The Mosaic Company 2014 Stock and Incentive Plan, as amended, approved May 19, 2022\nExhibit 10.iii.k to Mosaic’s quarterly report on Form 10-Q for the Quarterly Period Ended June 30, 2022\n10.iii.l.1\n(3)\nThe Mosaic Company 2023 Stock and Incentive Plan\nAppendix B to Mosaic’s Proxy Statement dated April 12, 2023\n10.iii.l.2\n(3)\nForm of Global Restricted Stock Unit Award Agreement under The Mosaic Company 2023 Stock and Incentive Plan approved May 24, 2023\nExhibit 10.iii.i to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended September 30, 2023\n10.iii.l.3\n(3)\nForm of Director Restricted Stock Unit Award Agreement under The Mosaic Company 2023 Stock and Incentive Plan approved December 15, 2023\nExhibit 10.1 to Mosaic's Current Report on Form 8-K dated December 15, 2023 and filed on December 20, 2023\n10.iii.l.4(3)\nForm of Executive TSR Stock-Settled Performance Unit Award Agreement approved March 5, 2024, under The Mosaic Company 2023 Stock and Incentive Plan\nExhibit 10.iii.i to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2024\n10.iii.l.5(3)\nForm of Executive TSR Cash-Settled Performance Unit Award Agreement approved March 5, 2024, under The Mosaic Company 2023 Stock and Incentive Plan \nExhibit 10.iii.ii to Mosaic's Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2024\n 94\n10.iv.a\nConsent Decree dated September 30, 2015 among the United States of America, the Florida Department of Environmental Protection, Mosaic Fertilizer, LLC and The Mosaic Company\n(4)\nExhibit 10.1. to Mosaic’s Current Report on Form 8-K dated September 30, 2015 and filed on October 6, 2015(2)\n10.iv.b\nDescription of Modifications to Consent Decree dated September 30, 2015 among the United States of America, the Florida Department of Environmental Protection, Mosaic Fertilizer, LLC and The Mosaic Company, filed as Exhibit 10.1 to the Current Report on Form 8-K of Mosaic dated September 30, 2015 and filed on October 6, 2015\nExhibit 10.v.i to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period Ended June 30, 2016(2)\n10.iv.c\nConsent Decree dated September 30, 2015 among the United States of America, the Louisiana Department of Environmental Quality, Mosaic Fertilizer, LLC and The Mosaic Company\n(4)\nExhibit 10.2. to Mosaic’s Current Report on Form 8-K dated September 30, 2015 and filed on October 6, 2015(2)\n10.iv.d\nDescription of Modifications to Consent Decree dated September 30, 2015 among the United States of America, the Louisiana Department of Environmental Quality, Mosaic Fertilizer, LLC and The Mosaic Company, filed as Exhibit 10.2 to the Current Report on Form 8-K of Mosaic dated September 30, 2015 and filed on October 6, 2015\nExhibit 10.v.ii to Mosaic’s Quarterly Report on Form 10-Q for the Quarterly Period Ended June 30, 2016(2)\n19\nThe Mosaic Company Insider Trading and Tipping Policy\nX\n21\nSubsidiaries of the Registrant\nX\n23.1\nConsent of KPMG LLP, independent registered public accounting firm for Mosaic\nX\n23.2\nFlorida Phosphate Mining Consent of Qualified Persons\nExhibit 23.2 to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2022\n23.3\nTapira Consent of Qualified Persons\nExhibit 23.3 to Mosaic's Annual Report on Form 10-K for the fiscal year ended December 31, 2023\n23.4\nBelle Plaine Potash Facility Consent of Qualified Persons\nX\n23.5\nEsterhazy Potash Facility Consent of Qualified Persons\nExhibit 23.4 to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021\n24\nPower of Attorney\nX\n31.1\nCertification of Chief Executive Officer Required by Rule 13a-14(a)\nX\n 95\n31.2\nCertification of Chief Financial Officer Required by Rule 13a-14(a)\nX\n32.1\nCertification of Chief Executive Officer Required by Rule 13a-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code\nX\n32.2\nCertification of Chief Financial Officer Required by Rule 13a-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code\nX\n95\nMine Safety Disclosures\nX\n96.1\nFlorida Phosphate Mining Technical Report Summary\nExhibit 96.1 to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2022\n96.2\nEsterhazy Potash Facility Technical Report Summary\nExhibit 96.2 to Mosaic’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021\n96.3\nBelle Plaine Potash Facility Technical Report Summary\nX\n96.4\nTapira Technical Report Summary\nExhibit 96.4 to Mosaic's Annual Report on Form 10-K for the fiscal year ended December 31, 2023\n97.1\nIncentive Compensation Recovery Policy\nExhibit 97.1 to Mosaic's Annual Report on Form 10-K for the fiscal year ended December 31, 2023\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nX\n(c)\nSummarized financial information of 50% or less owned persons is included in Note 9 of Notes to Consolidated Financial Statements. Financial statements and schedules are omitted as none of such persons are significant under the tests specified in Regulation S-X under Article 3.09 of general instructions to the financial statements.\n 96\n*********************************************\n(1)\nMosaic agrees to furnish supplementally to the SEC a copy of any omitted schedules and exhibits to the extent required by rules of the Commission upon request.\n(2)\nSEC File No. 001-32327.\n(3)\nDenotes management contract or compensatory plan.\n(4)\nConfidential information has been omitted from this Exhibit and filed separately with the SEC pursuant to a confidential treatment request under Rule 24b-2 of the Exchange Act.\n 97\nItem 16. Annual Report on Form 10-K Summary.\nNone.\n 98\n*********************************************\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTHE MOSAIC COMPANY\n(Registrant)\n/s/ Bruce M. Bodine\nBruce M. Bodine\nChief Executive Officer and President\nDate: March 3, 2025\nS-1\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nName\nTitle\nDate\n/s/ Bruce M. Bodine\nChief Executive Officer and President and Director (principal executive officer)\nMarch 3, 2025\nBruce M. Bodine\n/s/ Luciano Siani Pires\nExecutive Vice President and Chief Financial Officer (principal financial officer)\nMarch 3, 2025\nLuciano Siani Pires\n/s/ Russell A. Flugel\nVice President—Controller and Chief Accounting Officer (principal accounting officer)\nMarch 3, 2025\nRussell A. Flugel\n*\nChairman of the Board of Directors\nMarch 3, 2025\nGregory L. Ebel\n*\nDirector\nMarch 3, 2025\nCheryl K. Beebe\n*\nDirector\nMarch 3, 2025\nTimothy S. Gitzel\n*\nDirector\nMarch 3, 2025\nEmery N. Koenig\n*\nDirector\nMarch 3, 2025\nJody L. Kuzenko\n*\nDirector\nMarch 3, 2025\nSonya C. Little\n*\nDirector\nMarch 3, 2025\nDavid T. Seaton\n*\nDirector\nMarch 3, 2025\nKathleen M. Shanahan\n*\nDirector\nMarch 3, 2025\nJoão Roberto Gonçalves Teixeira\n*\nDirector\nMarch 3, 2025\nGretchen H. Watkins\n*\nDirector\nMarch 3, 2025\nKelvin R. Westbrook\n*By:  \n/s/ Philip E. Bauer\nPhilip E. Bauer\nAttorney-in-Fact\nS-2\nFinancial Table of Contents\n \n \nPage\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nF-\n2\nIntroduction\nF-\n2\nKey Factors that can Affect Results of Operations and Financial Condition\nF-\n2\nResults of Operations\nF-\n4\nOverview\nF-\n5\nPhosphates\nF-\n7\nPotash\nF-\n9\nMosaic Fertilizantes\nF-\n10\nCorporate, Elimination and Other\nF-\n11\nOther Income Statement Items\nF-\n11\nSelling, General and Administrative Expenses\nF-\n11\nOther Operating Expenses\nF-\n12\nInterest Expense, Net\nF-\n12\nForeign Currency Transaction (Loss) Gain\nF-\n12\nGain on Sale of Equity Investment\nF-\n12\nOther (Expense) Income\nF-\n12\nEquity in Net Earnings of Nonconsolidated Companies\nF-\n13\nProvision for Income Taxes\nF-\n12\nCritical Accounting Estimates\nF-\n13\nLiquidity and Capital Resources\nF-\n14\nOff-Balance Sheet Arrangements and Obligations\nF-\n17\nMarket Risk\nF-\n19\nEnvironmental, Health, Safety and Security Matters\nF-\n22\nContingencies\nF-\n27\nRelated Parties\nF-\n27\nRecently Issued Accounting Guidance\nF-\n28\nForward-Looking Statements\nF-\n28\nReports of Independent Registered Public Accounting Firm\nF-\n31\nConsolidated Statements of Earnings\nF-\n34\nConsolidated Statements of Comprehensive Income (Loss)\nF-\n35\nConsolidated Balance Sheets\nF-\n36\nConsolidated Statements of Cash Flows\nF-\n37\nConsolidated Statements of Equity\nF-\n39\nNotes to Consolidated Financial Statements\nF-\n40\nManagement’s Report on Internal Control Over Financial Reporting\nF-\n80\nF-1\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction\nThe Mosaic Company (before or after the Cargill Transaction, as defined below, “\nMosaic\n,\n” and with its consolidated subsidiaries, “\nwe\n,\n” “\nus\n,\n” “\nour\n” or the “\nCompany\n”) is the parent company of the business that was formed through the business combination (“\nCombination\n”) of IMC Global Inc. and the Cargill Crop Nutrition fertilizer businesses of Cargill, Incorporated and its subsidiaries (collectively, “\nCargill\n”) on October 22, 2004. In May 2011, Cargill divested its approximately 64% equity interest in us in a split-off to its stockholders and a debt exchange with certain Cargill debt holders.\nWe produce and market concentrated phosphate and potash crop nutrients. We conduct our business through wholly- and majority-owned subsidiaries as well as businesses in which we own less than a majority or a non-controlling interest, including consolidated variable interest entities and investments accounted for by the equity method.\nWe are organized into the following business segments:\n•\nOur \nPhosphates\n business segment owns and operates mines and production facilities in Florida, which produce concentrated phosphate crop nutrients and phosphate-based animal feed ingredients, and processing plants in Louisiana, which produce concentrated phosphate crop nutrients for sale domestically and internationally. We have a 75% economic interest in the Miski Mayo Phosphate Mine (“\nMiski Mayo Mine\n”) in Peru. These results are consolidated in the Phosphates segment. Through December 24, 2024, the Phosphates segment included our \n25\n% interest in the Ma’aden Wa’ad Al Shamal Phosphate Company (“\nMWSPC\n”), a joint venture to develop, own and operate integrated phosphate production facilities in the Kingdom of Saudi Arabia. On December 24, 2024, we exchanged our ownership of MWSPC for shares of Saudi Arabian Mining Company (“\nMa’aden\n”). Our equity in the net earnings or losses relating to MWSPC were recognized on a one-quarter lag in our Consolidated Statements of Earnings.\n•\nOur \nPotash\n business segment owns and operates potash mines and production facilities in Canada and the U.S. which produce potash-based crop nutrients, animal feed ingredients and industrial products. Potash sales include domestic and international sales. We are a member of Canpotex, Limited (“\nCanpotex\n”), an export association of Canadian potash producers through which we sell our Canadian potash outside the U.S. and Canada.\n•\nOur \nMosaic Fertilizantes\n business segment includes five phosphate rock mines, four phosphate chemical plants and a potash mine in Brazil. The segment also includes our distribution business in South America, which consists of sales offices, crop nutrient blending and bagging facilities, port terminals and warehouses in Brazil and Paraguay. We also have a majority interest in Fospar S.A., which owns and operates a single superphosphate granulation plant and a deep-water port and throughput warehouse terminal facility in Brazil.\nIntersegment eliminations, unrealized mark-to-market gains/losses on derivatives, the investment in equity securities of Ma'aden, debt expenses, corporate functional costs and the results of the China and India distribution businesses are included within Corporate, Eliminations and Other. See Note 25 of the Consolidated Financial Statements in this Form 10-K for segment results.\nKey Factors That Can Affect Results of Operations and Financial Condition\nOur primary products, phosphate and potash crop nutrients, are, to a large extent, global commodities that are also available from a number of domestic and international competitors, and are sold by negotiated contracts or by reference to published market prices. The markets for our products are highly competitive, and the most important competitive factor for our products is delivered price. Business and economic conditions and governmental policies affecting the agricultural industry and customer sentiment are the most significant factors affecting worldwide demand for crop nutrients with the impact of demand for biofuels and batteries also playing an increasing role. The profitability of our businesses is heavily influenced by worldwide supply and demand for our products, which affects our sales prices and volumes. Our costs per tonne to produce our products are also heavily influenced by fixed costs associated with owning and operating our major facilities, significant raw material costs in our Phosphates and Mosaic Fertilizantes businesses, water treatment costs in our Phosphates business and fluctuations in currency exchange rates.\nF-  2\nOur products are generally sold based on the market prices prevailing at the time the sales contract is signed or through contracts which are priced at the time of shipment. Additionally, in certain circumstances the final price of our products is determined after shipment based on the current market at the time the price is agreed to with the customer. Forward sales programs at fixed prices increase the lag between prevailing market prices and our average realized selling prices. The mix and parameters of these sales programs vary over time based on our marketing strategy, which considers factors that include, among others, optimizing our production and operating efficiency within warehouse limitations, as well as customer requirements. The use of forward sales programs and the level of customer prepayments may vary from period to period due to changing supply and demand environments, seasonality and market sentiments.\nWorld prices for the key raw material inputs for concentrated phosphate products, including ammonia, sulfur and phosphate rock, have an effect on industry-wide phosphate prices and production costs. The primary feedstock for producing ammonia is natural gas. The product price for ammonia is generally highly dependent on the supply and demand balance for ammonia. In North America, two-thirds of our ammonia is sourced either through ammonia supply agreements or produced internally at our Faustina, Louisiana, location with the remaining one-third purchased from various suppliers in the spot market. We have agreements with various suppliers to ensure we have reliable sources of supply for ammonia to support competitive pricing in various market conditions. In Brazil, we purchase all our ammonia from a single supplier.\nSulfur is a global commodity that is primarily produced as a by-product of oil refining. The market price is based primarily on the supply and demand balance for sulfur. We believe our current and future investments in sulfur transformation and transportation assets will enhance our competitive advantage. \nWe produce and procure most of our phosphate rock requirements through either wholly or partly owned mines. In addition to producing phosphate rock, Mosaic Fertilizantes purchases phosphate, potash and nitrogen products which are either used to produce blended crop nutrients (“\nBlends\n”) or for resale.\nOur per tonne selling prices for potash are affected by shifts in the product mix, geography and customer mix. Our Potash business is significantly affected by Canadian resource taxes that we pay to the Province of Saskatchewan and royalties we pay to mineral holders in order for us to mine and sell our potash products. In addition, cost of goods sold is affected by a number of factors, including: fluctuations in the Canadian dollar; the level of periodic inflationary pressures on resources in western Canada, where we produce most of our potash; and natural gas costs for operating our potash solution mine at Belle Plaine, Saskatchewan. In the past, we have also incurred operating costs to manage salt saturated brine inflows at our Esterhazy, Saskatchewan K1 and K2 mine shafts, which we closed in June 2021, due to an acceleration of brine inflows. We have now transitioned mining to the K3 mine shaft, which has replaced production from the K1 and K2 shafts.\nOur results of operations are also affected by changes in currency exchange rates due to our international footprint. The most significant currency impacts are generally from the Canadian dollar and the Brazilian real.\nA discussion of these and other factors that affected our results of operations and financial condition for the periods covered by this Management’s Discussion and Analysis of Financial Condition and Results of Operations is set forth in further detail below. This Management’s Discussion and Analysis of Financial Condition and Results of Operations should also be read in conjunction with the narrative description of our business in Item 1, and the risk factors described in",
    "item1a": "Item 1A, “Risk Factors,” of our Form 10-K for the year ended December 31, 2024 and incorporated by reference herein as if fully stated herein.\nWe base our forward-looking statements on information currently available to us, and we undertake no obligation to update or revise any of these statements, whether as a result of changes in underlying factors, new information, future events or other developments.\nF-  30\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nThe Mosaic Company:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of The Mosaic Company and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of earnings, comprehensive income (loss), equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated March 3, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of asset retirement obligations for water treatment costs\nAs discussed in Note 14 to the consolidated financial statements, the Company has recorded asset retirement obligations (AROs) of $2,572.2 million as of December 31, 2024. The ARO includes the planned treatment of contaminated water (“water treatment costs”) and other asset retirement activities at the Company’s Florida and Louisiana facilities.  \nWe identified the evaluation of asset retirement obligations for water treatment costs as a critical audit matter. Specialized skills and knowledge were required to evaluate the Company’s selection of planned water treatment activities to satisfy their legal obligation. In addition, there was a high degree of subjective auditor judgment due to the sensitivity of the AROs to minor changes to significant assumptions, such as the volume of contaminated water and the forecasted level of contamination used to estimate the water treatment costs per thousand gallons (“unit costs”).\nThe following are the primary procedures performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s ARO process. This included controls related \nF-  31\nto the knowledge, skill, and ability of third-party specialists and their relationship to the Company, determination of necessary activities required to treat contaminated water, and the development of the significant assumptions utilized in the process. We compared water treatment unit cost estimates to actual spending and water quality measurements. We evaluated the Company’s ability to accurately estimate water treatment costs by comparing the Company’s prior year estimates to the actual water treatment costs incurred. We performed sensitivity analyses over the volume of contaminated water and the unit costs assumptions to assess their impact on the water treatment costs estimate. Due to the specialized skills and knowledge used by the Company to select water treatment activities, we involved an environmental engineering professional with specialized skills and knowledge. This professional assisted in assessing the professional qualifications of the Company’s environmental engineers and engineering firm, including the knowledge, skill, and ability of the engineers, and the relationship of the engineers and engineering firm to the Company. In addition, the environmental engineering professional evaluated the Company’s planned asset retirement activities by analyzing the Company’s specialist’s reports. This professional evaluated significant engineering assumptions listed above and compared the planned activities per the specialist’s reports to other information obtained during the audit, such as:\n- permits obtained which specify the Company’s legal obligations  \n- reports to state regulators on the level of contamination in water balances.\nWe evaluated the Company’s changes in assumptions for the volume of contaminated water and the forecasted level of contamination by comparing them to actual results from the prior year, as well as assessing operational changes that could impact estimated water volumes, contamination levels, or necessary treatment activities.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 2004.\nTampa, Florida\nMarch 3, 2025 \nF-  32\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nThe Mosaic Company:\nOpinion on Internal Control Over Financial Reporting\nWe have audited The Mosaic Company and subsidiaries' (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of earnings, comprehensive income (loss), equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements), and our report dated March 3, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nTampa, Florida\nMarch 3, 2025\nF-  33\nConsolidated Statements of Earnings \nIn millions, except per share amounts\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet sales\n$\n11,122.8\n \n$\n13,696.1\n \n$\n19,125.2\n \nCost of goods sold\n9,610.9\n \n11,485.5\n \n13,369.4\n \nGross margin\n1,511.9\n \n2,210.6\n \n5,755.8\n \nSelling, general and administrative expenses\n496.9\n \n500.5\n \n498.0\n \nOther operating expenses\n393.5\n \n372.0\n \n472.5\n \nOperating earnings\n621.5\n \n1,338.1\n \n4,785.3\n \nInterest expense, net\n(\n182.8\n)\n(\n129.4\n)\n(\n137.8\n)\nForeign currency transaction (loss) gain\n(\n685.8\n)\n194.0\n \n97.5\n \nGain on sale of equity investment\n522.2\n \n—\n \n—\n \nOther income (expense)\n40.3\n \n(\n76.8\n)\n(\n102.5\n)\nEarnings from consolidated companies before income taxes\n315.4\n \n1,325.9\n \n4,642.5\n \nProvision for income taxes\n186.7\n \n177.0\n \n1,224.3\n \nEarnings from consolidated companies\n128.7\n \n1,148.9\n \n3,418.2\n \nEquity in net earnings of nonconsolidated companies\n73.3\n \n60.3\n \n196.0\n \nNet earnings including noncontrolling interests\n202.0\n \n1,209.2\n \n3,614.2\n \nLess: Net earnings attributable to noncontrolling interests\n27.1\n \n44.3\n \n31.4\n \nNet earnings attributable to Mosaic\n$\n174.9\n \n$\n1,164.9\n \n$\n3,582.8\n \nBasic net earnings per share attributable to Mosaic\n$\n0.55\n \n$\n3.52\n \n$\n10.17\n \nBasic weighted average number of shares outstanding\n319.8\n \n331.3\n \n352.4\n \nDiluted net earnings per share attributable to Mosaic\n$\n0.55\n \n$\n3.50\n \n$\n10.06\n \nDiluted weighted average number of shares outstanding\n320.7\n \n333.2\n \n356.0\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  34\nConsolidated Statements of Comprehensive Income (Loss)\nIn millions\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet earnings including noncontrolling interest\n$\n202.0\n \n$\n1,209.2\n \n$\n3,614.2\n \nOther comprehensive income (loss), net of tax\nForeign currency translation gain (loss)\n(\n495.6\n)\n154.1\n \n(\n255.0\n)\nNet actuarial gain and prior service cost\n10.9\n \n20.1\n \n19.7\n \nRealized gain (loss) on interest rate swap\n(\n0.1\n)\n1.4\n \n1.5\n \nNet gain (loss) on marketable securities held in trust fund\n(\n14.8\n)\n23.7\n \n(\n24.8\n)\nOther comprehensive income (loss)\n(\n499.6\n)\n199.3\n \n(\n258.6\n)\nComprehensive income (loss)\n(\n297.6\n)\n1,408.5\n \n3,355.6\n \nLess: Comprehensive income attributable to noncontrolling interest\n21.6\n \n46.3\n \n33.2\n \nComprehensive income (loss) attributable to Mosaic\n$\n(\n319.2\n)\n$\n1,362.2\n \n$\n3,322.4\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  35\nConsolidated Balance Sheets\nIn millions, except per share amounts\n \nDecember 31,\n \n2024\n2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n272.8\n \n$\n348.8\n \nReceivables, net\n1,113.3\n \n1,269.2\n \nInventories\n2,548.4\n \n2,523.2\n \nOther current assets\n563.8\n \n603.8\n \nTotal current assets\n4,498.3\n \n4,745.0\n \nProperty, plant and equipment, net\n13,352.6\n \n13,585.4\n \nEquity securities and investments in nonconsolidated companies\n1,533.4\n \n909.0\n \nGoodwill\n1,061.1\n \n1,138.6\n \nDeferred income taxes\n958.3\n \n1,079.2\n \nOther assets\n1,520.3\n \n1,575.6\n \nTotal assets\n$\n22,924.0\n \n$\n23,032.8\n \nLiabilities and Equity\nCurrent liabilities:\nShort-term debt\n$\n847.1\n \n$\n399.7\n \nCurrent maturities of long-term debt\n45.3\n \n130.1\n \nStructured accounts payable arrangements\n402.3\n \n399.9\n \nAccounts payable\n1,156.5\n \n1,166.9\n \nAccrued liabilities\n1,720.1\n \n1,777.1\n \nTotal current liabilities\n4,171.3\n \n3,873.7\n \nLong-term debt, less current maturities\n3,332.3\n \n3,231.6\n \nDeferred income taxes\n942.8\n \n1,065.5\n \nOther noncurrent liabilities\n2,862.9\n \n2,429.2\n \nEquity:\nPreferred stock, $\n0.01\n par value, \n15,000,000\n shares authorized, none issued and outstanding as of December 31, 2024 and 2023\n—\n \n—\n \nCommon stock, $\n0.01\n par value, \n1,000,000,000\n shares authorized, \n394,648,654\n shares issued and \n316,932,047\n shares outstanding as of December 31, 2024, \n393,875,241\n shares issued and \n324,103,141\n shares outstanding as of December 31, 2023\n3.2\n \n3.2\n \nCapital in excess of par value\n2.1\n \n—\n \nRetained earnings\n13,926.1\n \n14,241.9\n \nAccumulated other comprehensive loss\n(\n2,449.0\n)\n(\n1,954.9\n)\nTotal Mosaic stockholders’ equity\n11,482.4\n \n12,290.2\n \nNon-controlling interests\n132.3\n \n142.6\n \nTotal equity\n11,614.7\n \n12,432.8\n \nTotal liabilities and equity\n$\n22,924.0\n \n$\n23,032.8\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  36\nConsolidated Statements of Cash Flows\nIn millions, except per share amounts\n \nYears Ended December 31,\n \n2024\n2023\n2022\nCash Flows from Operating Activities\nNet earnings including noncontrolling interests\n$\n202.0\n \n$\n1,209.2\n \n$\n3,614.2\n \nAdjustments to reconcile net earnings including noncontrolling interests to net cash provided by operating activities:\nDepreciation, depletion and amortization\n1,025.5\n \n960.6\n \n933.9\n \nDeferred and other income taxes\n(\n142.9\n)\n(\n261.2\n)\n344.4\n \nEquity in net (earnings) of nonconsolidated companies, net of dividends\n(\n55.7\n)\n(\n31.8\n)\n(\n191.5\n)\nAccretion expense for asset retirement obligations\n111.2\n \n96.1\n \n81.6\n \nAmortization of debt financing fees\n36.5\n \n21.4\n \n7.2\n \nShare-based compensation expense\n31.8\n \n33.0\n \n27.9\n \nUnrealized (gain) loss on derivatives\n104.1\n \n(\n29.0\n)\n4.3\n \nForeign currency adjustments\n462.7\n \n(\n94.0\n)\n(\n67.9\n)\n(Gain) loss on sale of securities\n(\n2.4\n)\n19.4\n \n46.6\n \nPension settlement loss \n—\n \n42.4\n \n41.9\n \nGain on sale of business\n—\n \n(\n56.5\n)\n—\n \nGain on sale of equity investment\n(\n538.2\n)\n— \n— \nUnrealized (gain) loss on equity securities\n(\n28.3\n)\n— \n— \nOther\n71.8\n \n95.9\n \n85.7\n \nChanges in assets and liabilities:\nReceivables, net\n59.2\n \n526.3\n \n(\n215.2\n)\nInventories, net\n(\n275.6\n)\n1,061.4\n \n(\n749.6\n)\nOther current assets and noncurrent assets\n(\n79.2\n)\n(\n239.2\n)\n(\n247.4\n)\nAccounts payable and accrued liabilities\n96.4\n \n(\n1,055.1\n)\n219.8\n \nOther noncurrent liabilities\n220.3\n \n108.3\n \n(\n0.1\n)\nNet cash provided by operating activities\n1,299.2\n \n2,407.2\n \n3,935.8\n \nCash Flows from Investing Activities\nCapital expenditures\n(\n1,251.8\n)\n(\n1,402.4\n)\n(\n1,247.3\n)\nPurchases of available-for-sale securities - restricted\n(\n1,529.7\n)\n(\n1,240.8\n)\n(\n762.5\n)\nProceeds from sale of available-for-sale securities - restricted\n1,501.1\n \n1,209.1\n \n743.0\n \nProceeds from sale of business\n—\n \n158.4\n \n—\n \nAcquisition of business\n—\n \n(\n41.0\n)\n—\n \nOther\n19.4\n \n(\n0.5\n)\n7.2\n \nNet cash used in investing activities\n(\n1,261.0\n)\n(\n1,317.2\n)\n(\n1,259.6\n)\nCash Flows from Financing Activities\nPayments of short-term debt\n(\n16,779.6\n)\n(\n9,832.0\n)\n(\n1,761.2\n)\nProceeds from issuance of short-term debt\n17,032.8\n \n10,007.1\n \n1,980.5\n \nPayments from inventory financing arrangement\n(\n1,805.0\n)\n(\n601.4\n)\n(\n1,651.5\n)\nProceeds from inventory financing arrangement\n2,004.5\n \n601.4\n \n1,348.8\n \nPayments of structured accounts payable arrangements\n(\n755.0\n)\n(\n1,432.9\n)\n(\n1,476.6\n)\nProceeds from structured accounts payable arrangements\n737.3\n \n1,048.2\n \n1,460.5\n \nCollections of transferred receivables\n425.5\n \n1,468.6\n \n2,352.1\n \nPayments of transferred receivables\n(\n425.5\n)\n(\n1,468.6\n)\n(\n2,433.2\n)\nPayments of long-term debt\n(\n67.2\n)\n(\n995.3\n)\n(\n610.3\n)\nProceeds from issuance of long-term debt\n70.3\n \n900.0\n \n—\n \nRepurchases of stock\n(\n235.4\n)\n(\n756.0\n)\n(\n1,665.2\n)\nCash dividends paid\n(\n270.7\n)\n(\n351.6\n)\n(\n197.7\n)\nDividends paid to non-controlling interest\n(\n31.9\n)\n(\n41.5\n)\n(\n38.0\n)\nOther\n(\n32.0\n)\n(\n26.5\n)\n13.1\n \nNet cash used in financing activities\n(\n131.9\n)\n(\n1,480.5\n)\n(\n2,678.7\n)\nEffect of exchange rate changes on cash\n37.9\n \n(\n2.8\n)\n(\n29.7\n)\nNet change in cash, cash equivalents and restricted cash\n(\n55.8\n)\n(\n393.3\n)\n(\n32.2\n)\nCash, cash equivalents and restricted cash—beginning of year\n360.8\n \n754.1\n \n786.3\n \nCash, cash equivalents and restricted cash—end of year\n$\n305.0\n \n$\n360.8\n \n$\n754.1\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  37\nConsolidated Statements of Cash Flows (Continued)\nIn millions, except per share amounts\nYears Ended December 31,\n2024\n2023\n2022\nReconciliation of cash, cash equivalents and restricted cash reported within the consolidated balance sheets to the consolidated statements of cash flows:\nCash and cash equivalents\n$\n272.8\n \n$\n348.8\n \n$\n735.4\n \nRestricted cash in other current assets\n14.9\n \n8.6\n \n8.2\n \nRestricted cash in other assets\n17.3\n \n3.4\n \n10.5\n \nTotal cash, cash equivalents and restricted cash shown in the statement of cash flows\n$\n305.0\n \n$\n360.8\n \n$\n754.1\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  38\nConsolidated Statements of Equity\nIn millions, except per share data\n \n \nDollars\n \nShares\nMosaic Stockholders\n \n \nCommon\nStock\nCommon\nStock\nCapital in\nExcess\nof Par Value\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nNon-\nControlling\nInterests\nTotal\nEquity\nBalance as of December 31, 2021\n368.7\n \n$\n3.7\n \n$\n478.0\n \n$\n12,014.2\n \n$\n(\n1,891.8\n)\n$\n144.4\n \n$\n10,748.5\n \nTotal comprehensive income (loss)\n— \n— \n— \n3,582.8\n \n(\n260.4\n)\n33.2\n \n3,355.6\n \nVesting of restricted stock units\n1.2\n \n— \n(\n19.2\n)\n— \n— \n— \n(\n19.2\n)\nStock based compensation\n— \n— \n31.5\n \n— \n— \n— \n31.5\n \nStock option exercises\n— \n— \n16.0\n \n— \n— \n— \n16.0\n \nRepurchases of stock\n(\n30.8\n)\n(\n0.3\n)\n(\n506.3\n)\n(\n1,166.6\n)\n— \n— \n(\n1,673.2\n)\nDividends ($\n0.60\n per share)\n— \n— \n— \n(\n227.0\n)\n— \n— \n(\n227.0\n)\nDividends for noncontrolling interests\n— \n— \n— \n— \n— \n(\n38.0\n)\n(\n38.0\n)\nBalance as of December 31, 2022\n339.1\n \n3.4\n \n—\n \n14,203.4\n \n(\n2,152.2\n)\n139.6\n \n12,194.2\n \nTotal comprehensive income\n— \n— \n— \n1,164.9\n \n197.3\n \n46.3\n \n1,408.5\n \nVesting of restricted stock units\n1.9\n \n— \n(\n0.8\n)\n(\n53.4\n)\n— \n— \n(\n54.2\n)\nStock based compensation\n— \n— \n33.0\n \n— \n— \n— \n33.0\n \nShare repurchases, including tax of $\n6.4\n million\n(\n16.9\n)\n(\n0.2\n)\n(\n32.2\n)\n(\n722.0\n)\n— \n— \n(\n754.4\n)\nDividends ($\n0.85\n per share)\n— \n— \n— \n(\n351.0\n)\n— \n— \n(\n351.0\n)\nEquity to noncontrolling interests\n— \n— \n—\n \n— \n— \n(\n43.3\n)\n(\n43.3\n)\nBalance as of December 31, 2023\n324.1\n \n3.2\n \n—\n \n14,241.9\n \n(\n1,954.9\n)\n142.6\n \n12,432.8\n \nTotal comprehensive income\n— \n— \n— \n174.9\n \n(\n494.1\n)\n21.6\n \n(\n297.6\n)\nVesting of restricted stock units\n0.7\n \n— \n—\n \n(\n10.5\n)\n— \n— \n(\n10.5\n)\nStock based compensation\n— \n— \n31.8\n \n— \n— \n— \n31.8\n \nShare repurchases, including tax of $\n2.1\n million\n(\n7.9\n)\n—\n \n(\n29.7\n)\n(\n207.8\n)\n— \n— \n(\n237.5\n)\nDividends ($\n0.85\n per share)\n— \n— \n— \n(\n272.4\n)\n— \n— \n(\n272.4\n)\nDividends for noncontrolling interests\n— \n— \n— \n— \n— \n(\n31.9\n)\n(\n31.9\n)\nBalance as of December 31, 2024\n316.9\n \n$\n3.2\n \n$\n2.1\n \n$\n13,926.1\n \n$\n(\n2,449.0\n)\n$\n132.3\n \n$\n11,614.7\n \nSee Accompanying Notes to Consolidated Financial Statements\nF-  39\nNotes to Consolidated Financial Statements\nTables in millions, except per share amounts\n1.  \nORGANIZATION AND NATURE OF BUSINESS\nThe Mosaic Company (“\nMosaic\n,” and, with its consolidated subsidiaries, “\nwe\n,” “\nus\n,” “\nour\n,” or the “\nCompany\n”) produces and markets concentrated phosphate and potash crop nutrients. We conduct our business through wholly- and majority-owned subsidiaries and businesses in which we own less than a majority or a noncontrolling interest, including consolidated variable interest entities and investments accounted for by the equity method.\nWe are organized into the following business segments:\n•\nOur \nPhosphates\n business segment owns and operates mines and production facilities in Florida which produce concentrated phosphate crop nutrients and phosphate-based animal feed ingredients, and processing plants in Louisiana which produce concentrated phosphate crop nutrients. We have a \n75\n% economic interest in the Miski Mayo Phosphate Mine in Peru. These results are consolidated in the Phosphates segment. Through December 24, 2024, the Phosphates segment included our prior \n25\n% interest in the Ma’aden Wa’ad Al Shamal Phosphate Company (“\nMWSPC\n”), a joint venture to develop, own and operate integrated phosphate production facilities in the Kingdom of Saudi Arabia. On December 24, 2024, we exchanged our ownership of MWSPC for shares of Ma’aden. Our equity in the net earnings or losses relating to MWSPC were recognized on a one-quarter lag in our Consolidated Statements of Earnings.\n•\nOur \nPotash\n business segment owns and operates potash mines and production facilities in Canada and the U.S. which produce potash-based crop nutrients, animal feed ingredients and industrial products. Potash sales include domestic and international sales. We are a member of Canpotex, Limited (“\nCanpotex\n”), an export association of Canadian potash producers through which we sell our Canadian potash outside the U.S. and Canada.\n•\nOur \nMosaic Fertilizantes\n business segment includes five Brazilian phosphate rock mines, four phosphate chemical plants and a potash mine in Brazil. The segment also includes our distribution business in South America, which consists of sales offices, crop nutrient blending and bagging facilities, port terminals and warehouses in Brazil and Paraguay. We also have a majority interest in Fospar S.A., which owns and operates a single superphosphate granulation plant and a deep-water port and throughput warehouse terminal facility in Brazil.\nIntersegment eliminations, unrealized mark-to-market gains/losses on derivatives and investment in equity securities of Ma'aden, debt expenses and the results of the China and India distribution businesses are included within Corporate, Eliminations and Other.\n2.  \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nStatement Presentation and Basis of Consolidation\nThe accompanying Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“\nU.S. GAAP\n”). Throughout the Notes to Consolidated Financial Statements, amounts in tables are in millions of dollars except for per share data and as otherwise designated.\nThe accompanying Consolidated Financial Statements include the accounts of Mosaic and its majority-owned subsidiaries. Certain investments in companies in which we do not have control but have the ability to exercise significant influence are accounted for by the equity method.\nAccounting Estimates\nPreparation of the Consolidated Financial Statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of net sales and expenses during the reporting periods. The most significant estimates made by management relate to the recoverability of non-current assets including goodwill, the useful lives and net realizable values of long-lived assets, environmental and reclamation liabilities, including asset retirement obligations (“\nARO\n”), and income tax-related accounts, including the valuation allowance against deferred income tax assets. Actual results could differ from these estimates\n.\nF-  40\nRevenue Recognition\nWe generate revenues primarily by producing and marketing phosphate and potash crop nutrients. Revenue is recognized when control of the product is transferred to the customer, which is generally upon transfer of title to the customer based on the contractual terms of each arrangement. Title is typically transferred to the customer upon shipment of the product. In certain circumstances, which are referred to as final price deferred arrangements, we ship product prior to the establishment of a valid sales contract. In such cases, we retain control of the product and do not recognize revenue until a sales contract has been agreed to with the customer.  \nRevenue is measured as the amount of consideration we expect to receive in exchange for the transfer of our goods. Our products are generally sold based on market prices prevailing at the time the sales contract is signed or through contracts which are priced at the time of shipment, except for the final priced deferred arrangements discussed above. Sales incentives are volumetric based annual programs and recorded as a reduction of revenue at the time of sale. We estimate the variable consideration related to our sales incentive programs based on the sales terms with customers and historical experience. Historically, sales incentives have represented 1% or less of total revenue and there have not been significant adjustments to such estimates in the financial statements. \nWe sell Canadian-sourced potash outside Canada and the U.S. exclusively through Canpotex distribution. Canpotex sells potash to buyers in export markets pursuant to term and spot contracts at agreed upon prices. For sales through this channel, our revenue is recognized at the amount received from Canpotex representing proceeds from their sale of potash, less net costs of Canpotex. Sales are recognized when control is transferred to Canpotex, typically upon shipment of the product to Canpotex, and adjusted at the end of each reporting period based upon the updated estimated pricing or final pricing from Canpotex. Prior to final pricing, revenue is recognized only to the extent that it is probable a significant reversal of revenue will not occur. The constraint is estimated each period based on historical experience, market trends and industry data. The estimated constraint is not material to the Company’s financial statements.\nDue to our membership in Canpotex, we eliminate the intra-entity profit with Canpotex at the end of each reporting period and present that profit elimination by reversing revenue and cost of goods sold for the inventory remaining at Canpotex.  For more information regarding our relationship with Canpotex and accounting considerations, see Note 9 of our Notes to Consolidated Financial Statements. For information regarding sales by product type and by geographic area, see Note 25 of our Notes to Consolidated Financial Statements.\nThe timing of recognition of revenue related to our performance obligations may be different than the timing of collection of cash related to those performance obligations. Specifically, we collect prepayments from certain customers in Brazil. In addition, cash collection from Canpotex may occur prior to delivery of product to the end customer. We generally satisfy our contractual liabilities within one quarter of incurring the liability.\nOther key revenue recognition accounting policies include:\n•\nShipping and handling costs are included as a component of cost of goods sold.\n•\nWe generally expense sales commissions when incurred because the amortization period would have been one year or less. These costs are recorded within sales and marketing expenses.\n•\nWe have elected to recognize the cost for freight and shipping as an expense in cost of sales, when control over the product has passed to the customer.\nNon-Income Taxes\nWe pay Canadian resource taxes consisting of the Potash Production Tax and resource surcharge. The Potash Production Tax is a Saskatchewan provincial tax on potash production and consists of a base payment and a profits tax. In addition to the Canadian resource taxes, royalties are payable to the mineral owners with respect to potash reserves or production of potash. These resource taxes and royalties are recorded in our cost of goods sold. Our Canadian resource tax and royalty expenses were $\n272.7\n million, $\n457.0\n million and $\n1.0\n billion during 2024, 2023 and 2022, respectively.\nWe have approximately $\n96.2\n million of assets recorded as of December 31, 2024 related to PIS and Cofins, which is a Brazilian federal value-added tax. This amount was mostly earned in 2008 through 2022; we believe that it will be realized through offsetting income tax payments or other federal taxes or receiving cash refunds. As of December 31, 2023 we had approximately $\n136.5\n million of assets recorded for these matters. Should the Brazilian government determine that these are not valid credits upon audit, this could impact our results in such period. We have recorded the PIS and Cofins credits at \nF-  41\namounts which we believe are probable of collection. Information regarding PIS and Cofins taxes already audited is included in Note 23 of our Notes to Consolidated Financial Statements.\nForeign Currency Translation\nThe Company’s reporting currency is the U.S. dollar; however, for operations located in Canada and Brazil, the functional currency is the local currency. Assets and liabilities of these foreign operations are translated to U.S. dollars at exchange rates in effect at the balance sheet date, while income statement accounts and cash flows are translated to U.S. dollars at the average exchange rates for the period. For these operations, translation gains and losses are recorded as a component of accumulated other comprehensive income in equity until the foreign entity is sold or liquidated. Transaction gains and losses result from transactions that are denominated in a currency other than the functional currency of the operation, primarily accounts receivable and intercompany loans in our Canadian entities denominated in U.S. dollars, intercompany loans receivable in our U.S. entities denominated in Brazilian real, and accounts payable in Brazil denominated in U.S. dollars. These foreign currency transaction gains and losses are presented separately in the Consolidated Statement of Earnings.\nCash and Cash Equivalents\nCash and cash equivalents include short-term, highly liquid investments with original maturities of \n90\n days or less and other highly liquid investments that are payable on demand such as money market accounts, certain certificates of deposit and repurchase agreements. The carrying amount of such cash equivalents approximates their fair value due to the short-term and highly liquid nature of these instruments.\nConcentration of Credit Risk\nIn the U.S., we sell our products to manufacturers, distributors and retailers primarily in the Midwest and Southeast. Internationally, our potash products are sold primarily through Canpotex, an export association. A concentration of credit risk arises from our sales and accounts receivable associated with the international sales of potash product through Canpotex. We consider our concentration risk related to the Canpotex receivable to be mitigated by their credit policy, which requires the underlying receivables to be substantially insured or secured by letters of credit. As of December 31, 2024 and 2023, there were $\n65.1\n million and $\n193.1\n million, respectively, of trade accounts receivable due from Canpotex. During 2024, 2023 and 2022, sales to Canpotex were $\n884.3\n million, $\n1.3\n billion and $\n3.0\n billion, respectively.\nInventories\nInventories of raw materials, work-in-process products, finished goods and operating materials and supplies are stated at the lower of cost or net realizable value. Costs for substantially all inventories are determined using the weighted average cost basis. To determine the cost of inventory, we allocate fixed expense to the costs of production based on the normal capacity, which refers to a range of production levels and is considered the production expected to be achieved over a number of periods or seasons under normal circumstances, taking into account the loss of capacity resulting from planned maintenance. Fixed overhead costs allocated to each unit of production should not increase due to abnormally low production. Those excess costs are recognized as a current period expense. When a production facility is completely shut down temporarily, it is considered “idle”, and all related expenses are charged to cost of goods sold.\nNet realizable value of our inventory is defined as forecasted selling prices less reasonably predictable selling costs. Significant management judgment is involved in estimating forecasted selling prices including various demand and supply variables. Examples of demand variables include grain and oilseed prices, stock-to-use ratios and changes in inventories in the crop nutrients distribution channels. Examples of supply variables include forecasted prices of raw materials, such as phosphate rock, sulfur, ammonia and natural gas, estimated operating rates and industry crop nutrient inventory levels. Results could differ materially if actual selling prices differ materially from forecasted selling prices. Charges for lower of cost or market are recognized in our Consolidated Statements of Earnings in the period when there is evidence of a decline of market value below cost.\nProperty, Plant and Equipment and Recoverability of Long-Lived Assets\nProperty, plant and equipment are stated at cost. Costs of significant assets include capitalized interest incurred during the construction and development period. Repairs and maintenance, including planned major maintenance and plant turnaround costs, are expensed when incurred.\nF-  42\nCurrently, we do not have any material exploration or development stage mining projects. When we transition to new mining areas within our current properties, we incur minimal pre-mining costs related to the permitting process and land preparation activities, such as water management control and construction of roads and access points. These costs are capitalized as part of our mineral properties and rights. Mineral properties and rights at our operations include mineral reserves and mineral resources. Mineral resources have not yet been scheduled in formal mine plans and therefore are not subject to depletion. Depletion expenses for mining operations, including mineral reserves, are generally determined using the units-of-production method based on estimates of proven and probable reserves. Depreciation is computed principally using the straight-line method and units-of-production method over the following useful lives: machinery and equipment: \nthree\n to \n25\n years; and buildings and leasehold improvements: \nthree\n to \n40\n years.\nWe estimate initial useful lives based on experience and current technology. These estimates may be extended through sustaining capital programs. Factors affecting the fair value of our assets or periods of expected use may also affect the estimated useful lives of our assets and these factors can change. Therefore, we periodically review the estimated remaining lives of our facilities and other significant assets and adjust our depreciation rates prospectively where appropriate.\nLong-lived assets, including fixed assets and right-of-use assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. An impairment assessment involves management judgment and estimates of factors such as industry and market conditions, the economic life of the asset, sales volume and prices, inflation, raw materials costs, cost of capital, tax rates and capital spending. The carrying amount of a long-lived asset group is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset group. If it is determined that an impairment loss has occurred, the loss is measured as the amount by which the carrying amount of the long-lived asset group exceeds its fair value.\nLeases\nRight of use (“\nROU\n”) assets represent our right to use an underlying asset for the lease term. Lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at the commencement date of the lease, based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments. The Company’s incremental borrowing rate for a lease is the rate of interest it would have to pay on a collateralized basis to borrow an amount equal to the lease payments under similar terms. For both operating and finance leases, the initial ROU asset equals the lease liability, plus initial direct costs, less lease incentives received. Our lease agreements may include options to extend or terminate the lease, which are included in the lease term at the commencement date when it is reasonably certain that we will exercise that option. In general, we do not consider optional periods included in our lease agreements as reasonably certain of exercise at inception.\nAt inception, we determine whether an arrangement is a lease and the appropriate lease classification. Operating leases with terms greater than twelve months are included as operating lease ROU assets within other assets and the associated lease liabilities within accrued liabilities and other noncurrent liabilities on our consolidated balance sheets. Finance leases with terms greater than twelve months are included as finance ROU assets within property and equipment and the associated finance lease liabilities within current maturities of long-term debt and long-term debt on our consolidated balance sheets.\nLeases with terms of less than twelve months, referred to as short-term leases, do not create a ROU asset or lease liability on the balance sheet.\nWe have lease agreements with lease and non-lease components, which are generally accounted for separately. For full-service railcar leases, we account for the lease and non-lease components as a single lease component. Additionally, for certain equipment leases, we apply assumptions using a portfolio approach, given the generally consistent terms of the agreements. Lease payments based on usage (for example, per-mile or per-hour charges), referred to as variable lease costs, are recorded separately from the determination of the ROU asset and lease liability.\nContingencies\nAccruals for environmental remediation efforts are recorded when costs are probable and can be reasonably estimated. In determining these accruals, we use the most current information available, including similar past experiences, available technology, consultant evaluations, regulations in effect, the timing of remediation and cost-sharing arrangements. Adjustments to accruals, recorded as needed in our Consolidated Statement of Earnings each quarter, are made to reflect changes in and current status of these factors.\nF-  43\nWe are involved from time to time in claims and legal actions incidental to our operations, both as plaintiff and defendant. We have established what we currently believe to be adequate accruals for pending legal matters. These accruals are established as part of an ongoing worldwide assessment of claims and legal actions that takes into consideration such items as advice of legal counsel, individual developments in court proceedings, changes in the law, changes in business focus, changes in the litigation environment, changes in opponent strategy and tactics, new developments as a result of ongoing discovery and our experience in defending and settling similar claims. The litigation accruals at any time reflect updated assessments of the then-existing claims and legal actions. The final outcome or potential settlement of litigation matters could differ materially from the accruals which we have established. Legal costs are expensed as incurred.\nPension and Other Postretirement Benefits\nMosaic offers a number of benefit plans that provide pension and other benefits to qualified employees. These plans include defined benefit pension plans, supplemental pension plans, defined contribution plans and other postretirement benefit plans.\nWe accrue the funded status of our plans, which is representative of our obligations under employee benefit plans and the related costs, net of plan assets measured at fair value. The cost of pensions and other retirement benefits earned by employees is generally determined with the assistance of an actuary using the projected benefit method prorated on service and management’s best estimate of expected plan investment performance, salary escalation, retirement ages of employees and expected healthcare costs.\nAdditional Accounting Policies\nTo facilitate a better understanding of our consolidated financial statements we have disclosed the following significant accounting policies (with the exception of those identified above) throughout the following notes, with the related financial disclosures by major caption:\nNote\nTopic\nPage\n9\nEquity Securities and Investments in Non-Consolidated Companies\nF-\n51\n10\nGoodwill\nF-\n52\n11\nStructured Accounts Payable Arrangements\nF-\n52\n12\nMarketable Securities Held in Trusts\nF-\n55\n13\nIncome Taxes\nF-\n57\n14\nAccounting for Asset Retirement Obligations\nF-\n62\n15\nAccounting for Derivative and Hedging Activities\nF-\n63\n16\nFair Value Measurements\nF-\n64\n3.  \nRECENTLY ISSUED ACCOUNTING GUIDANCE\nIn September 2022, the Financial Accounting Standards Board (“\nFASB\n”) issued guidance which requires that a buyer in a supplier financing program make annual disclosures about the program’s key terms, the balance sheet presentation of related amounts, the confirmed amount outstanding at the end of the period and associated rollforward information. We have historically presented supplier financing programs separately on the face of the balance sheet as structured accounts payable arrangements and disclosed key terms of such programs. Payments and proceeds rollforward information on structured accounts payable arrangements has historically been provided on the face of the statement of cash flows. As such, adoption of this standard did not impact our balance sheet presentation or footnote disclosures. \nIn November 2023, the FASB issued guidance to improve reportable segment disclosure requirements, primarily through additional disclosures about significant segment expenses. The standard is effective for fiscal years beginning after December 15, 2023 (our fiscal 2024), and interim periods within fiscal years beginning after December 15, 2024 (our fiscal 2025), with early adoption permitted. The amendments are to be applied retrospectively to all prior periods presented in the financial statements. We adopted this standard as of December 31, 2024. While this standard required enhanced segment disclosures, adoption of this guidance did not have a material effect on our consolidated financial statements.\nIn December 2023, the FASB issued guidance to provide more disaggregation of income tax disclosures mainly related to the reconciliations of the income tax rate and income taxes paid by jurisdiction. We expect the adoption of the standard to result in additional disaggregation of our income tax footnote disclosure. We will begin providing the enhanced disclosure related to income taxes effective with our quarterly report of Form 10-Q for the quarter ending March 31, 2025. \nF-  44\nIn November 2024, the FASB issued guidance which requires more detailed disclosure about specified categories of expenses (purchases of inventory, employee compensation, depreciation, intangible asset amortization and depletion) included in certain expense captions on the face of the income statement. Additionally, the amendments require disclosure of the total amount of selling expenses and an annual disclosure of the definition of selling expenses. These amendments are effective for fiscal years beginning after December 15, 2026, and for interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted. The disclosures may be applied either prospectively or retrospectively to any or all prior periods presented in the financial statements. We are currently evaluating the impact this new guidance will have on our disclosures.\nF-  45\n4.  \nLEASES\nLeasing Activity\nWe have operating and finance leases for heavy mobile equipment, railcars, fleet vehicles, field and plant equipment, river and cross-gulf vessels, corporate offices, land and computer equipment. \nOur leases have remaining lease terms of one year to \n38\n years, some of which include options to extend the lease for up to \n20\n years and some of which include options to terminate the lease within one year.\nSupplemental balance sheet information related to leases as of December 31, 2024 and December 31, 2023 is as follows:\nDecember 31,\nType of Lease Asset or Liability\n2024\n2023\nBalance Sheet Classification\n(in millions)\nOperating Leases\nRight-of-use assets\n$\n220.0\n \n$\n229.8\n \nOther assets\nLease liabilities:\nShort-term\n43.9\n \n65.3\n \nAccrued liabilities\nLong-term\n181.2\n \n168.1\n \nOther noncurrent liabilities\nTotal\n$\n225.1\n \n$\n233.4\n \nFinance Leases\nRight-of-use assets:\nGross assets\n$\n452.0\n \n$\n459.7\n \nLess: accumulated depreciation\n205.3\n \n171.3\n \nNet assets\n$\n246.7\n \n$\n288.4\n \nProperty, plant and equipment, net\nLease liabilities:\nShort-term\n$\n30.6\n \n$\n112.7\n \nCurrent maturities of long-term debt\nLong-term\n114.2\n \n67.3\n \nLong-term debt, less current maturities\nTotal\n$\n144.8\n \n$\n180.0\n \nLease expense is generally included within cost of goods sold and selling, general and administrative expenses, except for interest on lease liabilities, which is recorded within net interest. \nThe components of lease expense were as follows:\nDecember 31,\n(in millions)\n2024\n2023\n2022\nOperating lease cost\n$\n87.2\n \n$\n86.9\n \n$\n86.6\n \nFinance lease cost:\nAmortization of right-of-use assets\n45.5\n \n45.8\n \n45.9\n \nInterest on lease liabilities\n6.1\n \n7.1\n \n5.3\n \nShort-term lease cost\n0.2\n \n0.1\n \n0.8\n \nVariable lease cost\n19.5\n \n19.8\n \n19.3\n \nTotal lease cost\n$\n158.5\n \n$\n159.7\n \n$\n157.9\n \nRental expense for 2024, 2023 and 2022 was $\n269.4\n million, $\n252.1\n million and $\n237.2\n million, respectively.\nF-  46\nSupplemental cash flow information related to leases was as follows:\nDecember 31,\n(In millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n90.4\n \n$\n89.2\n \n$\n88.1\n \nOperating cash flows from finance leases\n6.1\n \n7.1\n \n5.3\n \nFinancing cash flows from finance leases\n42.9\n \n78.8\n \n46.5\n \n \nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n$\n70.4\n \n$\n54.5\n \n$\n56.7\n \nFinance leases\n9.0\n \n35.8\n \n27.2\n \nOther information related to leases was as follows:\nDecember 31, 2024\nWeighted Average Remaining Lease Term\nOperating leases\n6.4\n years\nFinance leases\n4.3\n years\nWeighted Average Discount Rate\nOperating leases\n6.3\n \n%\nFinance leases\n5.7\n \n%\nFuture lease payments under non-cancellable leases recorded as of December 31, 2024, were as follows:\nOperating Leases\nFinance Leases\n(in millions)\n2025\n$\n70.3\n \n$\n38.8\n \n2026\n51.1\n \n26.5\n \n2027\n38.1\n \n22.1\n \n2028\n30.2\n \n16.9\n \n2029\n26.6\n \n58.1\n \nThereafter\n58.3\n \n9.6\n \nTotal future lease payments\n$\n274.6\n \n$\n172.0\n \nLess imputed interest\n(\n49.5\n)\n(\n27.2\n)\nTotal\n$\n225.1\n \n$\n144.8\n \nF-  47\n5.  \nOTHER FINANCIAL STATEMENT DATA\nThe following provides additional information concerning selected balance sheet accounts:\n \nDecember 31,\n(in millions)\n2024\n2023\nReceivables\nTrade - External\n$\n969.1\n \n$\n940.9\n \nTrade - Affiliate\n67.1\n \n194.6\n \nNon-trade\n78.1\n \n134.4\n \n1,114.3\n \n1,269.9\n \nLess allowance for doubtful accounts\n1.0\n \n0.7\n \n$\n1,113.3\n \n$\n1,269.2\n \nInventories\nRaw materials\n$\n148.6\n \n$\n135.8\n \nWork in process\n941.1\n \n964.8\n \nFinished goods\n1,239.8\n \n1,178.0\n \nFinal price deferred \n(a)\n53.5\n \n61.5\n \nOperating materials and supplies\n165.4\n \n183.1\n \n$\n2,548.4\n \n$\n2,523.2\n \nOther current assets\nIncome and other taxes receivable\n$\n234.9\n \n$\n269.3\n \nPrepaid expenses\n299.8\n \n284.3\n \nOther\n29.1\n \n50.2\n \n$\n563.8\n \n$\n603.8\n \nOther assets\nRestricted cash\n$\n17.3\n \n$\n3.4\n \nMRO inventory\n169.0\n \n166.3\n \nMarketable securities held in trust - restricted\n708.7\n \n708.6\n \nOperating lease right-of-use assets\n220.0\n \n229.8\n \nIndemnification asset\n18.4\n \n20.9\n \nLong-term receivable\n12.9\n \n21.8\n \nCloud computing cost \n(b)\n166.3\n \n138.9\n \nOther\n207.7\n \n285.9\n \n$\n1,520.3\n \n$\n1,575.6\n \nF-  48\n \nDecember 31,\n(in millions)\n2024\n2023\nAccrued liabilities\nAccrued dividends\n$\n74.1\n \n$\n72.3\n \nPayroll and employee benefits\n161.8\n \n182.6\n \nAsset retirement obligations\n352.8\n \n377.4\n \nCustomer prepayments\n270.7\n \n261.8\n \nAccrued income and other taxes\n204.7\n \n190.0\n \nOperating lease obligation\n43.9\n \n65.3\n \nOther\n612.1\n \n627.7\n \n$\n1,720.1\n \n$\n1,777.1\n \nOther noncurrent liabilities\nAsset retirement obligations\n$\n2,219.4\n \n$\n1,836.0\n \nOperating lease obligation \n181.2\n \n168.1\n \nAccrued pension and postretirement benefits\n91.6\n \n119.7\n \nUnrecognized tax benefits\n17.7\n \n30.5\n \nOther\n353.0\n \n274.9\n \n$\n2,862.9\n \n$\n2,429.2\n \n______________________________\n(a)\nFinal price deferred is product that has shipped to customers, but we retain control and do not recognize revenue until a sales contract has been agreed to with the customer.\n(b)\nImplementation costs eligible for capitalization related to cloud computing arrangements that are a service contract are recorded within Prepaid expenses and Other assets in the Consolidated Balance Sheets and amortized over the reasonably certain term of the associated hosting arrangement.\n \nInterest expense, net was comprised of the following in 2024, 2023 and 2022:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nInterest income\n$\n47.2\n \n$\n59.6\n \n$\n31.0\n \nLess interest expense\n230.0\n \n189.0\n \n168.8\n \nInterest expense, net\n$\n(\n182.8\n)\n$\n(\n129.4\n)\n$\n(\n137.8\n)\n6.  \nPROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment consist of the following:\n \nDecember 31,\n(in millions)\n2024\n2023\nLand\n$\n352.5\n \n$\n373.0\n \nMineral properties and rights\n6,831.3\n \n6,477.5\n \nBuildings and leasehold improvements\n3,836.4\n \n3,881.6\n \nMachinery and equipment\n11,684.0\n \n11,407.6\n \nConstruction in-progress\n1,148.1\n \n1,359.8\n \n23,852.3\n \n23,499.5\n \nLess: accumulated depreciation and depletion\n10,499.7\n \n9,914.1\n \n$\n13,352.6\n \n$\n13,585.4\n \nDepreciation and depletion expense was $\n1,012.5\n million, $\n958.9\n million, and $\n932.1\n million for 2024, 2023 and 2022, respectively. Interest capitalized on major construction projects was $\n42.3\n million, $\n35.2\n million, and $\n26.8\n million for 2024, 2023 and 2022, respectively.\nF-  49\nSubsequent to December 31, 2024, we entered into an agreement to sell the closed Patos de Minas mine in Brazil which has minimal assets remaining.\n7.  \nEARNINGS PER SHARE\nThe numerator for basic and diluted earnings per share (“\nEPS\n”) is net earnings attributable to Mosaic. The denominator for basic EPS is the weighted average number of shares outstanding during the period. The denominator for diluted EPS also includes the weighted average number of additional common shares that would have been outstanding if the dilutive potential common shares had been issued, unless the shares are anti-dilutive.\nThe following is a reconciliation of the numerator and denominator for the basic and diluted EPS computations:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet earnings attributable to Mosaic\n$\n174.9\n \n$\n1,164.9\n \n$\n3,582.8\n \nBasic weighted average number of shares outstanding attributable to common stockholders\n319.8\n \n331.3\n \n352.4\n \nDilutive impact of share-based awards\n0.9\n \n1.9\n \n3.6\n \nDiluted weighted average number of shares outstanding\n320.7\n \n333.2\n \n356.0\n \nBasic net earnings per share\n$\n0.55\n \n$\n3.52\n \n$\n10.17\n \nDiluted net earnings per share\n$\n0.55\n \n$\n3.50\n \n$\n10.06\n \nA total of \n1.0\n million shares for 2024, \n0.5\n million shares for 2023 and \n0.1\n million shares for 2022 of common stock subject to issuance related to share-based awards have been excluded from the calculation of diluted EPS because the effect would have been anti-dilutive.\n8.  \nCASH FLOW INFORMATION\nSupplemental disclosures of cash paid for interest and income taxes and non-cash investing and financing information is as follows:\nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash paid during the period for:\nInterest\n$\n228.7\n \n$\n204.7\n \n$\n196.4\n \nLess amount capitalized\n42.3\n \n35.2\n \n26.8\n \nCash interest, net\n$\n186.4\n \n$\n169.5\n \n$\n169.6\n \nIncome taxes\n$\n337.0\n \n$\n385.6\n \n$\n1,114.5\n \nAcquiring or constructing property, plant and equipment by incurring a liability does not result in a cash outflow for us until the liability is paid. In the period the liability is incurred, the change in operating accounts payable on the Consolidated Statements of Cash Flows is adjusted by such amount. In the period the liability is paid, the amount is reflected as a cash outflow from investing activities. The applicable net change in operating accounts payable that was classified to investing activities on the Consolidated Statements of Cash Flows was $(\n20.3\n) million, $(\n19.5\n) million, and $(\n65.2\n) million for 2024, 2023 and 2022, respectively.\nWe accrued $\n74.1\n million related to the dividends declared in 2024 that will be paid in 2025. At December 31, 2023 and 2022, we had accrued dividends of $\n72.3\n million and $\n72.9\n million which were paid in 2024 and 2023, respectively.\nIncluded in proceeds from issuance of short-term debt and payments of short-term debt were $\n16.8\n billion and ($\n16.6\n) billion and $\n9.6\n billion and ($\n9.5\n) billion for 2024 and 2023, respectively, related to our commercial paper arrangement.\nWe had non-cash investing and financing transactions related to right-of-use assets obtained in exchange for lease obligations assets under finance leases in 2024 of $\n9.0\n million. Non-cash investing and financing transactions related to assets acquired under capital leases were $\n35.8\n million and $\n27.2\n million for 2023 and 2022, respectively. \nF-  50\nWe had non-cash transactions related to the exchange of our 25% ownership MWSPC for \n111,012,433\n shares of Ma’aden at a value of approximately $\n1.5\n billion, resulting in a gain before transaction expenses of $\n538.2\n million.\nDepreciation, depletion and amortization includes $\n1,012.5\n million, $\n958.9\n million and $\n932.1\n million related to depreciation and depletion of property, plant and equipment and $\n13.0\n million, $\n1.7\n million and $\n1.8\n million related to the amortization of intangible assets and cloud computing costs for 2024, 2023 and 2022, respectively.\n \n9.  EQUITY SECURITIES AND \nINVESTMENTS IN NON-CONSOLIDATED COMPANIES\nWe have investments in various international and domestic entities and ventures. The equity method of accounting is applied to such investments when the ownership structure prevents us from exercising a controlling influence over operating and financial policies of the businesses but still allow us to have significant influence. Under this method, our equity in the net earnings or losses of the investments is reflected as equity in net earnings of non-consolidated companies on our Consolidated Statements of Earnings. The effects of material intercompany transactions with these equity method investments are eliminated, including the gross profit on sales to and purchases from our equity-method investments which is deferred until the time of sale to the final third-party customer. The cash flow presentation of dividends received from equity method investees is determined by evaluation of the facts, circumstances and nature of the distribution.\nA summary of our equity-method investments, which were in operation as of December 31, 2024, is as follows:\nEntity\nEconomic Interest\nRiver Bend Ag, LLC\n50.0\n \n%\nIFC S.A.\n45.0\n \n%\nCanpotex\n36.2\n \n%\nThe summarized financial information shown below includes all non-consolidated companies carried on the equity method.\nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet sales\n$\n3,601.9\n \n$\n7,055.1\n \n$\n11,852.8\n \nNet earnings\n6.2\n \n317.9\n \n956.9\n \nMosaic’s share of equity in net earnings\n3.1\n \n60.3\n \n196.0\n \nTotal assets\n1,883.8\n \n9,900.6\n \n11,707.8\n \nTotal liabilities\n1,865.1\n \n7,014.1\n \n8,973.7\n \nMosaic’s share of equity in net assets\n9.4\n \n725.9\n \n693.2\n \nMWSPC owns and operates a mine and two chemical complexes that produce phosphate fertilizers and other downstream phosphate products in the Kingdom of Saudi Arabia. As of December 31, 2023, our cash investment was $\n770.0\n million and we marketed approximately \n25\n% of the phosphate production of this joint venture. As of December 31, 2023, MWSPC represented \n77\n% of the total assets and \n68\n% of the total liabilities in the table above. In 2024, 2023 and 2022 our share of equity in net earnings of MWSPC was $\n70.8\n million, $\n57.6\n million, and $\n194.5\n million, respectively. On April 29, 2024, Saudi Arabian Mining Company (“\nMa’aden\n”) and Mosaic entered into a Share Purchase and Subscription Agreement to exchange our \n25\n% ownership of the Ma’aden Wa’ad al Shamal Phosphate Company for \n111,012,433\n shares of Ma’aden. This transaction closed on December 24, 2024, at a value of approximately $\n1.5\n billion, resulting in a gain of $\n522.2\n million, net of transaction costs. The shares received by Mosaic are subject to transfer and sale restrictions, which will be released over a five-year period. The shares are included in equity securities and investments in nonconsolidated companies on our Consolidated Balance Sheets. They are carried at fair value based on the unadjusted quoted price on the Saudi Exchange (Tadawul), with the changes in fair value reported in non-operating income (expense). At December 31, 2024, the unrealized gain on the Ma’aden shares was $\n28.3\n million.\nCanpotex is a Saskatchewan export association used by two Canadian potash producers to market, sell and distribute Canadian potash products outside of Canada and the U.S. It operates as a break-even entity and therefore has insignificant equity earnings or loss. We have concluded that the sales to Canpotex are not at arm’s-length, due to the unique pricing and payment structure and financial obligations of the stockholders. Therefore, the full profit on sales to Canpotex is eliminated until Canpotex no longer has control of the related inventory and has sold it to an unrelated third-party customer. We \nF-  51\neliminate the intra-entity profit with Canpotex at the end of each reporting period and present that profit elimination by reversing revenue and cost of goods sold for the inventory remaining at Canpotex.\n \n10.  \nGOODWILL\nGoodwill is carried at cost, not amortized, and represents the excess of the purchase price and related costs over the fair value assigned to the net identifiable assets of a business acquired. We test goodwill for impairment on a quantitative basis at the reporting unit level on an annual basis or upon the occurrence of events that may indicate possible impairment. Impairment is measured as the excess carrying value over the fair value of goodwill.\nThe changes in the carrying amount of goodwill, by reporting unit, as of December 31, 2024 and 2023, are as follows:\n(in millions)\nPotash\nMosaic Fertilizantes\nCorporate, Eliminations and Other\nTotal\nBalance as of December 31, 2022\n$\n1,006.6\n \n$\n97.6\n \n$\n12.1\n \n$\n1,116.3\n \nForeign currency translation\n20.3\n \n2.0\n \n—\n \n22.3\n \nBalance as of December 31, 2023\n$\n1,026.9\n \n$\n99.6\n \n$\n12.1\n \n$\n1,138.6\n \nForeign currency translation\n(\n71.5\n)\n(\n6.0\n)\n—\n \n(\n77.5\n)\nBalance as of December 31, 2024\n$\n955.4\n \n$\n93.6\n \n$\n12.1\n \n$\n1,061.1\n \nAs of October 31, 2024, we performed our annual quantitative assessment. In performing our assessment, we estimated the fair value of each of our reporting units using the income approach, also known as the discounted cash flow (“\nDCF\n”) method. The income approach utilized the present value of cash flows to estimate fair value. The future cash flows for our reporting units were projected based on our estimates, at that time, for revenue, operating income and other factors (such as working capital and capital expenditures for each reporting unit). To determine if the fair value of each of our reporting units with goodwill exceeded its carrying value, we assumed sales volume growth rates based on our long-term expectations, our internal selling prices and projected raw material prices for years one through five, which were anchored in projections from CRU International Limited (“\nCRU\n”), an independent third party data source. Selling prices and raw material prices for years six and beyond were based on anticipated market growth and long-term CRU outlooks. The discount rates used in our DCF method were based on a weighted-average cost of capital (“\nWACC\n”), determined from relevant market comparisons. A terminal value growth rate of \n2\n% was applied to all years thereafter for the projected period and reflected our estimate of stable growth. We then calculated a present value of the respective cash flows for each reporting unit to arrive at an estimate of fair value under the income approach. Finally, we compared our estimates of fair values for our reporting units, to our October 31, 2024 total public market capitalization, based on our common stock price at that date.\nIn making this assessment, we considered, among other things, expectations of projected net sales and cash flows, assumptions impacting the WACC, changes in our stock price and changes in the carrying values of our reporting units with goodwill. We also considered overall business conditions. \nThe Potash, Mosaic Fertilizantes and Corporate, Eliminations and Other reporting units were evaluated and not considered at risk of goodwill impairment at October 31, 2024.  \nAs of December 31, 2024, $\n18.6\n million of our goodwill was tax deductible.\n11.  \nFINANCING ARRANGEMENTS\nMosaic Credit Facility\nOn August 19, 2021, we entered into a committed, unsecured, five-year revolving credit facility of up to $\n2.5\n billion (the “\nMosaic Credit Facility\n”), with a maturity date of August 19, 2026, which is intended to serve as our primary senior unsecured bank credit facility. The Mosaic Credit Facility has cross-default provisions that, in general, provide that a failure to pay principal or interest under, or any other amount payable under, any indebtedness with an outstanding principal amount of $\n100\n million or more, or breach or default under such indebtedness that permits the holders thereof to accelerate the maturity thereof, will result in a cross-default.\nF-  52\nThe Mosaic Credit Facility requires Mosaic to maintain certain financial ratios, including a ratio of Consolidated Indebtedness, which has been redefined to exclude unrestricted cash and cash equivalents, to Consolidated Capitalization Ratio (as defined) of no greater than \n0.65\n to \n1.0\n, as well as a minimum Interest Coverage Ratio (as defined) of not less than \n3.0\n to \n1.0\n. We were in compliance with these ratios as of December 31, 2024.\nThe Mosaic Credit Facility also contains other events of default and covenants that limit various matters. These provisions include limitations on indebtedness, liens, investments and acquisitions (other than capital expenditures), certain mergers, certain sales of assets and other matters customary for credit facilities of this nature.\nAs of December 31, 2024 and 2023, we had outstanding letters of credit that utilized a portion of the amount available for revolving loans under the Mosaic Credit Facility of $\n0.0\n million and $\n10.5\n million, respectively. The net available borrowings for revolving loans under the Mosaic Credit Facility were approximately $\n2.50\n billion and $\n2.49\n billion as of December 31, 2024 and December 31, 2023, respectively. As of December 31, 2024, 2023 and 2022 unused commitment fees accrued at an average rate of \n0.15\n%, generating expenses of $\n3.8\n million in each period. \nShort-Term Debt\nShort-term debt consists of the revolving credit facility under the Mosaic Credit Facility, under which there were \nno\n borrowings as of December 31, 2024, working capital financing arrangements and various other short-term borrowings related to our international operations in India, China and Brazil. These other short-term borrowings outstanding were $\n847.1\n million and $\n399.7\n million as of December 31, 2024 and 2023, respectively.\nWe have an inventory financing arrangement whereby we can sell up to $\n625\n million of certain inventory for cash and subsequently repurchase the inventory at an agreed upon price and time in the future, not to exceed \n180\n days. Under the terms of the agreement, we may borrow up to \n90\n% of the value of the inventory. It is later repurchased by Mosaic at the original sale price plus interest and any transaction costs. As of December 31, 2024 and 2023, we had financed inventory of $\n199.5\n million and $\n0.0 million\n, respectively, under this arrangement, which is included in short-term debt on the Consolidated Balance Sheet.\nWe have Receivable Purchasing Agreements (“\nRPAs\n”), with banks whereby, from time-to-time, we sell certain receivables. The net face value of the purchased receivables may not exceed $\n600\n million at any point in time. The purchase price of the receivable sold under the RPA is the face value of the receivable less an agreed upon discount. The receivables sold under the RPAs are accounted for as true sales. Upon sale, these receivables are removed from the Consolidated Balance Sheets. Cash received is presented as cash provided by operating activities in the Consolidated Statements of Cash Flows.\nThe Company sold approximately $\n430.7\n million and $\n1.3\n billion during December 31, 2024 and 2023, respectively, of accounts receivable under these arrangements. Discounts on sold receivables were not material for any period presented. Following the sale to the banks, we continue to service the collection of the receivables on behalf of the banks without further consideration. As of December 31, 2024 and 2023, there was \nno\n amount outstanding to be remitted to the bank. Any outstanding amount would be classified in accrued liabilities on the Consolidated Balance Sheets. Cash collected and remitted is presented as cash used in financing activities in the Consolidated Statements of Cash Flows.\nWe have a commercial paper program which allows us to issue unsecured commercial paper notes with maturities that vary, but do not exceed \n397\n days from the date of issue, up to a maximum aggregate face or principal amount outstanding at any time of $\n2.5\n billion. We plan to use the revolving credit facility as a liquidity backstop for borrowings under the commercial paper program. As of December 31, 2024, we had $\n609.2\n million outstanding under this program, with a weighted average interest rate of \n4.74\n% and a remaining average term of \n10\n days. As of December 31, 2023, we had $\n399.5\n million outstanding under this program, with a weighted average interest rate of \n5.62\n% and a remaining average term of \nnine days\n. \nWe had additional outstanding bilateral letters of credit of $\n63.8\n million as of December 31, 2024, which includes $\n50.0\n million as required by the 2015 Consent Decrees as described further in Note 14 of our Consolidated Financial Statements.\nLong-Term Debt, including Current Maturities\nIn May 2023, we entered into a ten year senior unsecured term loan facility pursuant to which we can draw up to $\n700\n million. The term loan matures on May 18, 2033. We may voluntarily prepay the outstanding principal without premium or penalty. As of December 31, 2024 and 2023, $\n570\n million and $\n500\n million, respectively, has been drawn under \nF-  53\nthis facility. Interest rates for the term loan are variable and are based on the Secured Overnight Financing Rate (“\nSOFR\n”) plus credit spread adjustments.\nIn 2023, we paid the outstanding balance of $\n900\n million on our \n4.25\n% senior notes due November 15, 2023.\nOn, December 4, 2023, we issued new senior notes consisting of $\n400\n million aggregate principal amount of \n5.375\n% due 2028 (the “\nSenior Notes of 2023\n”). We have the following additional senior notes outstanding: $\n700\n million aggregate principal amount of \n4.050\n% senior notes due 2027 (the “\nSenior Notes of 2017\n”) $\n500\n million aggregate principal amount of \n5.45\n% senior notes due 2033 and $\n600\n million aggregate principal amount of \n5.625\n% senior notes due 2043 (collectively, the “\nSenior Notes of 2013\n”); and $\n300\n million aggregate principal amount of \n4.875\n% senior notes due 2041 (the “\nSenior Notes of 2011\n”). \nThe Senior Notes of 2011, the Senior Notes of 2013, the Senior Notes of 2017 and the Senior Notes of 2023 are Mosaic’s senior unsecured obligations and rank equally in right of payment with Mosaic’s existing and future senior unsecured indebtedness. The indenture governing these notes contains restrictive covenants limiting debt secured by liens, sale and leaseback transactions and mergers, consolidations and sales of substantially all assets, as well as other events of default.\nA debenture issued by Mosaic Global Holdings, Inc., one of our consolidated subsidiaries, due in 2028 (the “\n2028 Debenture\n”), is outstanding as of December 31, 2024, with a balance of $\n147.1\n million. The indenture governing the 2028 Debenture also contains restrictive covenants limiting debt secured by liens, sale and leaseback transactions and mergers, consolidations and sales of substantially all assets, as well as events of default. The obligations under the 2028 Debenture are guaranteed by the Company and several of its subsidiaries.\nLong-term debt primarily consists of unsecured notes, finance leases, unsecured debentures and secured notes. \nLong-term debt as of December 31, 2024 and 2023, respectively, consisted of the following:\n2024\n2023\n(in millions)\n \nStated Interest Rate\nEffective Interest Rate\nMaturity Date\nStated Value\nCombination Fair \nMarket \nValue Adjustment\nDiscount on Notes Issuance\nCarrying Value\nStated Value\nCombination Fair \nMarket \nValue Adjustment\nDiscount on Notes Issuance\nCarrying Value\nUnsecured notes\n4.05\n% - \n5.63\n%\n5.49\n%\n2027-\n2043\n$\n2,500.0\n \n$\n—\n \n$\n(\n5.1\n)\n$\n2,494.9\n \n$\n2,500.0\n \n$\n—\n \n$\n(\n5.8\n)\n$\n2,494.2\n \nUnsecured debentures\n7.30\n%\n7.19\n%\n2028\n147.1\n \n0.3\n \n—\n \n147.4\n \n147.1\n \n0.4\n \n—\n \n147.5\n \nTerm Loan\n30 Day SOFR\n7.08\n%\n2033\n570.0\n \n—\n \n—\n \n570.0\n \n500.0\n \n—\n \n—\n \n500.0\n \nFinance leases\n0.77\n% - \n13.02\n%\n5.75\n%\n2025-\n2034\n144.8\n \n—\n \n—\n \n144.8\n \n180.0\n \n—\n \n—\n \n180.0\n \nOther\n(a)\n6.53\n% - \n8.00\n%\n5.59\n%\n2025-\n2026\n17.1\n \n3.4\n \n—\n \n20.5\n \n35.0\n \n5.0\n \n—\n \n40.0\n \nTotal long-term debt\n3,379.0\n \n3.7\n \n(\n5.1\n)\n3,377.6\n \n3,362.1\n \n5.4\n \n(\n5.8\n)\n3,361.7\n \nLess current portion\n45.4\n \n0.4\n \n(\n0.5\n)\n45.3\n \n129.2\n \n1.3\n \n(\n0.4\n)\n130.1\n \nTotal long-term debt, less current maturities\n$\n3,333.6\n \n$\n3.3\n \n$\n(\n4.6\n)\n$\n3,332.3\n \n$\n3,232.9\n \n$\n4.1\n \n$\n(\n5.4\n)\n$\n3,231.6\n \n______________________________\n(a) \nIncludes deferred financing fees related to our long-term debt.\nScheduled maturities of long-term debt are as follows for the periods ending December 31:\n(in millions)\n \n2025\n$\n45.3\n \n2026\n33.8\n \n2027\n717.5\n \n2028\n561.0\n \n2029\n57.2\n \nThereafter\n1,962.8\n \nTotal\n$\n3,377.6\n \nF-  54\nStructured Accounts Payable Arrangements\nIn Brazil, we finance some of our potash-based fertilizer, sulfur, ammonia and other raw material product purchases through third-party contractual arrangements. These arrangements provide that the third-party intermediary advance the amount of the scheduled payment to the vendor, less an appropriate discount, at a scheduled payment date and Mosaic makes payment to the third-party intermediary at dates ranging from \n105\n to \n164\n days from date of shipment. At December 31, 2024 and 2023, these structured accounts payable arrangements were $\n402.3\n million and $\n399.9\n million, respectively. Payments and proceeds rollforward information on structured payable arrangements are provided on the Consolidated Statements of Cash Flows. During 2024, the interest expense component of such programs was $\n22.9\n million.\n \n12.  \nMARKETABLE SECURITIES HELD IN TRUSTS\nIn August 2016, Mosaic deposited $\n630\n million into two trust funds (together, the “\nRCRA\n \nTrusts\n”) created to provide additional financial assurance in the form of cash for the estimated costs (“\nGypstack Closure Costs\n”) of closure and long-term care of our Florida and Louisiana phosphogypsum management systems (“\nGypstacks\n”), as described further in Note 14 of our Notes to Consolidated Financial Statements. Our actual Gypstack Closure Costs are generally expected to be paid by us in the normal course of our Phosphates business; however, funds held in each of the RCRA Trusts can be drawn by the applicable governmental authority in the event we cannot perform our closure and long-term care obligations. When our estimated Gypstack Closure Costs with respect to the facilities associated with a RCRA Trust are sufficiently lower than the amount on deposit in that RCRA Trust, we have the right to request that the excess funds be released to us. The same is true for the RCRA Trust balance remaining after the completion of our obligations, which will be performed over a period that may not end until \nthree\n decades or more after a Gypstack has been closed. The investments held by the RCRA Trusts are managed by independent investment managers with discretion to buy, sell and invest pursuant to the objectives and standards set forth in the related trust agreements. Amounts reserved to be held or held in the RCRA Trusts (including losses or reinvested earnings) are included in other assets on our Consolidated Balance Sheets.\nThe RCRA Trusts hold investments, which are restricted from our general use, in marketable debt securities classified as available-for-sale and are carried at fair value. As a result, unrealized gains and losses are included in other comprehensive income until realized, unless it is determined that the entire unamortized cost basis of the investment is not expected to be recovered. A credit loss would then be recognized in operations for the amount of the expected credit loss. As of December 31, 2024, we expect to recover our amortized cost on all available-for-sale securities and have not established an allowance for credit loss.\nWe review the fair value hierarchy classification on a quarterly basis. Changes in the ability to observe valuation inputs may result in a reclassification of levels for certain securities within the fair value hierarchy. We determine the fair market values of our available-for-sale securities and certain other assets based on the fair value hierarchy described below:\nLevel 1: Values based on unadjusted quoted prices in active markets that are accessible at the measurement date for identical assets or liabilities.\nLevel 2: Values based on quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, or model-based valuation techniques for which all significant assumptions are observable in the market.\nLevel 3: Values generated from model-based techniques that use significant assumptions not observable in the market. These unobservable assumptions reflect our own estimates of assumptions that market participants would use in pricing the asset or liability. Valuation techniques include use of option pricing models, discounted cash flow models and similar techniques.\nF-  55\nThe estimated fair value of the investments in the RCRA Trusts as of December 31, 2024 and December 31, 2023 are as follows:\nDecember 31, 2024\n(in millions)\nAmortized \nCost\nGross \nUnrealized \nGains\nGross \nUnrealized \nLosses\nFair \nValue\nLevel 1\n    Cash and cash equivalents  \n$\n3.1\n \n$\n—\n \n$\n—\n \n$\n3.1\n \nLevel 2\n    Corporate debt securities\n203.3\n \n0.8\n \n(\n6.8\n)\n197.3\n \n    Municipal bonds\n210.8\n \n0.7\n \n(\n4.0\n)\n207.5\n \n    U.S. government bonds\n295.1\n \n—\n \n(\n7.8\n)\n287.3\n \nTotal\n$\n712.3\n \n$\n1.5\n \n$\n(\n18.6\n)\n$\n695.2\n \nDecember 31, 2023\n(in millions)\nAmortized \nCost\nGross \nUnrealized \nGains\nGross \nUnrealized \nLosses\nFair \nValue\nLevel 1\n    Cash and cash equivalents  \n$\n1.0\n \n$\n—\n \n$\n—\n \n$\n1.0\n \nLevel 2\n    Corporate debt securities\n204.6\n \n1.9\n \n(\n8.4\n)\n198.1\n \n    Municipal bonds\n206.9\n \n1.9\n \n(\n4.1\n)\n204.7\n \n    U.S. government bonds\n268.6\n \n11.5\n \n(\n0.3\n)\n279.8\n \nTotal\n$\n681.1\n \n$\n15.3\n \n$\n(\n12.8\n)\n$\n683.6\n \nThe following tables show gross unrealized losses and fair values of the RCRA Trusts’ available-for-sale securities that have been in a continuous unrealized loss position for which an allowance for credit losses has not been recorded as of December 31, 2024 and December 31, 2023.\nDecember 31, 2024\nDecember 31, 2023\nSecurities that have been in a continuous loss position for less than 12 months \n(in millions)\n:\nFair \nValue\nGross \nUnrealized \nLosses\nFair \nValue\nGross \nUnrealized \nLosses\nCorporate debt securities\n$\n53.4\n \n$\n(\n0.7\n)\n$\n5.4\n \n$\n(\n0.1\n)\nMunicipal bonds\n102.4\n \n(\n1.7\n)\n42.3\n \n(\n0.2\n)\nU.S. government bonds\n280.9\n \n(\n7.8\n)\n26.4\n \n(\n0.3\n)\nTotal\n$\n436.7\n \n$\n(\n10.2\n)\n$\n74.1\n \n$\n(\n0.6\n)\nDecember 31, 2024\nDecember 31, 2023\nSecurities that have been in a continuous loss position for more than 12 months \n(in millions)\n:\nFair \nValue\nGross \nUnrealized \nLosses\nFair \nValue\nGross \nUnrealized \nLosses\nCorporate debt securities\n$\n81.3\n \n$\n(\n6.1\n)\n$\n121.5\n \n$\n(\n8.3\n)\nMunicipal bonds\n55.6\n \n(\n2.3\n)\n84.1\n \n(\n3.9\n)\nU.S. government bonds\n—\n \n—\n \n—\n \n—\n \nTotal\n$\n136.9\n \n$\n(\n8.4\n)\n$\n205.6\n \n$\n(\n12.2\n)\nF-  56\nThe following table summarizes the balance by contractual maturity of the available-for-sale debt securities invested by the RCRA Trusts as of December 31, 2024. Actual maturities may differ from contractual maturities because the issuers of the securities may have the right to prepay obligations before the underlying contracts mature.\n(in millions)\nDecember 31, 2024\nDue in one year or less\n$\n21.3\n \nDue after one year through five years\n218.9\n \nDue after five years through ten years\n402.1\n \nDue after ten years\n49.8\n \nTotal debt securities\n$\n692.1\n \nFor the year ended December 31, 2024, realized gains and (losses) were \n$\n17.5\n million\n and $(\n15.1\n) million, respectively. For the year ended December 31, 2023, realized gains and (losses) were $\n9.5\n million and $(\n28.9\n) million, respectively and for the year ended December 31, 2022, realized gains and (l\nosses) were $\n0.3\n million and $(\n46.9\n) million, respectivel\ny.\n13.  \nINCOME TAXES\nIn preparing our Consolidated Financial Statements, we utilize the asset and liability approach in accounting for income taxes. We recognize income taxes in each of the jurisdictions in which we have a presence. For each jurisdiction, we estimate the actual amount of income taxes currently payable or receivable, as well as deferred income tax assets and liabilities attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which these temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nThe provision for income taxes for 2024, 2023 and 2022 consisted of the following:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nCurrent:\nFederal\n$\n(\n11.7\n)\n$\n86.4\n \n$\n62.7\n \nState\n10.7\n \n1.5\n \n51.9\n \nNon-U.S.\n339.2\n \n357.4\n \n770.4\n \nTotal current\n338.2\n \n445.3\n \n885.0\n \nNoncurrent:\nFederal\n$\n(\n0.1\n)\n$\n0.3\n \n$\n0.2\n \nState\n— \n— \n— \nNon-U.S.\n(\n10.8\n)\n(\n3.0\n)\n(\n0.7\n)\nTotal noncurrent\n(\n10.9\n)\n(\n2.7\n)\n(\n0.5\n)\nDeferred:\nFederal\n$\n(\n41.7\n)\n$\n(\n35.4\n)\n$\n215.4\n \nState\n(\n29.0\n)\n(\n4.2\n)\n31.0\n \nNon-U.S.\n(\n69.9\n)\n(\n226.0\n)\n93.4\n \nTotal deferred\n(\n140.6\n)\n(\n265.6\n)\n339.8\n \nProvision for income taxes\n$\n186.7\n \n$\n177.0\n \n$\n1,224.3\n \nF-  57\nThe components of earnings from consolidated companies before income taxes, and the effects of significant adjustments to tax computed at the federal statutory rate, were as follows:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nU.S. earnings (loss)\n$\n(\n557.8\n)\n$\n121.6\n \n$\n1,587.8\n \nNon-U.S. earnings\n873.2\n \n1,204.3\n \n3,054.7\n \nEarnings (loss) from consolidated companies before income taxes\n$\n315.4\n \n$\n1,325.9\n \n$\n4,642.5\n \nComputed tax at the U.S. federal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState and local income taxes, net of federal income tax benefit\n(\n5.7\n)\n%\n0.4\n \n%\n1.1\n \n%\nPercentage depletion in excess of basis\n(\n13.8\n)\n%\n(\n4.9\n)\n%\n(\n1.8\n)\n%\nImpact of non-U.S. earnings\n23.8\n \n%\n8.7\n \n%\n5.8\n \n%\nChange in valuation allowance\n13.0\n \n%\n(\n1.7\n)\n%\n—\n \n%\nNon-U.S. incentives\n(\n42.6\n)\n%\n(\n11.5\n)\n%\n(\n2.6\n)\n%\nWithholding tax\n13.6\n \n%\n6.3\n \n%\n1.6\n \n%\nU.S. general basket foreign tax credits\n(\n12.6\n)\n%\n(\n4.0\n)\n%\n—\n \n%\nTax legislation change impacts\n(\n5.7\n)\n%\n(\n1.6\n)\n%\n—\n \n%\nUndistributed earnings\n33.0\n \n%\n2.2\n \n%\n—\n \n%\nTax on dividends, deemed dividends, and GILTI\n16.2\n \n%\n0.7\n \n%\n0.1\n \n%\nNondeductible expenses\n20.0\n \n%\n0.2\n \n%\n0.4\n \n%\nOther items (none in excess of 5% of computed tax)\n(\n1.0\n)\n%\n(\n2.5\n)\n%\n0.8\n \n%\nEffective tax rate\n59.2\n \n%\n13.3\n \n%\n26.4\n \n%\n2024 Effective Tax Rate\nIn the year ended \nDecember 31, 2024\n, there were two items impacting the effective tax rate: 1) items attributable to ordinary business operations during the year, and 2) other items specific to the period. \nThe tax impact of our ordinary business operations is affected by the mix of earnings across jurisdictions in which we operate, by a benefit associated with depletion, changes in valuation allowances and by the impact of certain entities being taxed in both their foreign jurisdiction and the U.S., including foreign tax credits for various taxes incurred.\nFor the year ended \nDecember 31, 2024\n, tax expense specific to the period included a net expense of $\n125.9\n million. The net expense relates to the following: $\n99.9\n million related to the impact of accruing withholding tax expense on expected foreign distributions associated with changes in management’s indefinite reinvestment assertion on select foreign earnings under ASC 740-30 (formerly APB 23), $\n7.1\n million related to true-up of estimates from our U.S. and non-U.S. tax return provisions, $\n24.2\n million related to changes to valuation allowances in Brazil, the Netherlands and the U.S., $\n4.0\n million related to share-based excess benefit, $\n2.5\n million related to changes in tax rates and $\n6.2\n million related to other miscellaneous expenses. The tax expenses are partially offset by a net tax benefit related to changes in U.S. state tax law of $\n18.1\n million.\n2023 Effective Tax Rate\nIn the year ended December 31, 2023, there were two items impacting the effective tax rate: 1) items attributable to ordinary business operations during the year, and 2) other items specific to the period. \nThe tax impact of our ordinary business operations is affected by the mix of earnings across jurisdictions in which we operate, by a benefit associated with depletion, by a benefit associated with non-U.S. incentives, changes in valuation allowances, and by the impact of certain entities being taxed in both their foreign jurisdiction and the U.S., including foreign tax credits for various taxes incurred.\nTax expense specific to the period included a net benefit of $\n43.4\n million. The net benefit relates to the following: $\n38.1\n million related to true-up of estimates primarily related to our U.S. tax return, $\n24.4\n million related to changes to \nF-  58\nvaluation allowances in Brazil, and $\n11.6\n million related to an increase in a U.S. deferred tax asset. The tax benefits are partially offset by a net tax cost of $\n29.3\n million related to income tax expense on undistributed earnings and $\n1.4\n million of other miscellaneous costs.\n2022 Effective Tax Rate\nIn the year ended December 31, 2022, there were two items impacting the effective tax rate: 1) items attributable to ordinary business operations during the year, and 2) other items specific to the period.\nThe tax impact of our ordinary business operations is affected by the mix of earnings across jurisdictions in which we operate, by a benefit associated with depletion, by a benefit associated with non-U.S. incentives, changes in valuation allowances and by the impact of certain entities being taxed in both their foreign jurisdiction and the U.S., including foreign tax credits for various taxes incurred.\nTax expense specific to the period included a net expense of $\n26.2\n million. The net expense relates to the following: $\n29.0\n million related to true-up of estimates primarily related to our U.S. tax return, $\n4.8\n million related to changes to valuation allowances in Brazil, $\n4.0\n million related to interest of effectively settled unrecognized tax benefits and $\n1.2\n million of other miscellaneous costs. The tax expenses are partially offset by a net tax benefit related to $\n12.8\n million of RSUs vested in CY22 above grant price.\nDeferred Tax Liabilities and Assets\nSignificant components of our deferred tax liabilities and assets were as follows as of December 31:\n \nDecember 31,\n(in millions)\n2024\n2023\nDeferred tax liabilities:\nDepreciation and amortization\n$\n614.5\n \n$\n490.2\n \nDepletion\n573.4\n \n623.6\n \nPartnership tax basis differences\n80.6\n \n69.7\n \nUndistributed earnings of non-U.S. subsidiaries\n84.4\n \n29.3\n \nOther liabilities\n78.6\n \n97.0\n \nTotal deferred tax liabilities\n$\n1,431.5\n \n$\n1,309.8\n \nDeferred tax assets:\nCapital loss carryforwards\n15.0\n \n14.9\n \nForeign tax credit carryforwards\n1,431.8\n \n1,266.2\n \nNet operating loss carryforwards\n450.6\n \n514.4\n \nPension plans and other benefits\n13.9\n \n17.8\n \nAsset retirement obligations\n547.4\n \n452.1\n \nDisallowed interest expense under §163(j)\n20.3\n \n11.5\n \nOther assets\n497.3\n \n468.6\n \nSubtotal\n2,976.3\n \n2,745.5\n \nValuation allowance\n1,529.3\n \n1,421.9\n \nNet deferred tax assets\n1,447.0\n \n1,323.6\n \nNet deferred tax assets/(liabilities)\n$\n15.5\n \n$\n13.8\n \nWe have certain non-U.S. entities that are taxed in both their local jurisdiction and the U.S. As a result, we have deferred tax balances for both jurisdictions. As of December 31, 2024 and 2023, these non-U.S. deferred taxes are offset by approximately $\n199.6\n million and $\n220.5\n million, respectively, of anticipated foreign tax credits included within our depreciation and depletion components of deferred tax liabilities above. We have recorded a valuation allowance against the anticipated foreign tax credits of $\n199.6\n million and $\n220.5\n million for December 31, 2024 and 2023, respectively.\nF-  59\nTax Carryforwards\nAs of December 31, 2024, we had estimated carryforwards for tax purposes as follows: net operating losses of $\n1.7\n billion, capital losses of $\n63.4\n million, foreign tax credits of $\n1.4\n billion and $\n3.9\n million of non-U.S. business credits. These carryforward benefits may be subject to limitations imposed by the Internal Revenue Code, and in certain cases, provisions of foreign law. Approximately $\n1.1\n billion of our net operating loss carryforwards relate to Brazil and can be carried forward indefinitely but are limited to \n30\n percent of taxable income each year. The majority of the remaining net operating loss carryforwards relate to U.S. federal and certain U.S. states and can be carried forward indefinitely. Of the $\n1.4\n billion of foreign tax credits, approximately $\n222.1\n million have an expiration date of 2026, approximately $\n18.5\n million have an expiration date of 2029, approximately $\n14.7\n million have an expiration date of 2030 and approximately $\n52.2\n million have an expiration date of 2034. The realization of our foreign tax credit carryforwards is dependent on market conditions, tax law changes and other business outcomes including our ability to generate certain types of taxable income in the future. Due to current business operations and future forecasts, the Company has determined that no valuation allowance is required on its general basket foreign tax credits. As a result of changes in U.S. tax law due to the Tax Cuts and Jobs Act, the Company recorded valuation allowances against its branch basket foreign tax credits of $\n1.1\n billion as of December 31, 2024.\nAs of December 31, 2024, we have not recognized a deferred tax liability for un-remitted earnings of approximately $\n873.7\n million from certain foreign operations because we believe our subsidiaries have invested the undistributed earnings indefinitely, or the earnings will be remitted in a tax-neutral transaction. It is not practicable for us to determine the amount of unrecognized deferred tax liability on these reinvested earnings. As part of the accounting for the Tax Cuts and Jobs Act, we recorded local country withholding taxes related to certain entities from which we began repatriating undistributed earnings and will continue to record local country withholding taxes, including foreign exchange impacts, on all future earnings.\nValuation Allowance\nIn assessing the need for a valuation allowance, we consider whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. We evaluate our ability to realize the tax benefits associated with deferred tax assets by analyzing the relative impact of all the available positive and negative evidence regarding our forecasted taxable income using both historical and projected future operating results, the reversal of existing taxable temporary differences, taxable income in prior carry-back years (if permitted) and the availability of tax planning strategies. The ultimate realization of deferred tax assets is dependent upon the generation of certain types of future taxable income during the periods in which those temporary differences become deductible. In making this assessment, we consider the scheduled reversal of deferred tax liabilities, our ability to carry back the deferred tax asset, projected future taxable income, and tax planning strategies. A valuation allowance will be recorded in each jurisdiction in which a deferred income tax asset is recorded when it is more likely than not that the deferred income tax asset will not be realized. Changes in deferred tax asset valuation allowances typically impact income tax expense.\nFor the year ended December 31, 2024, the valuation allowance increased by $\n107.4\n million, of which a $\n105.4\n million increase related to changes in the valuation allowance to U.S. branch foreign tax credits, $\n11.3 million\n related to changes in the valuation allowance to U.S. state net operating losses and tax credits and a $\n2.8 million\n increase related to changes in valuation allowances in Canada. These increases to the valuation allowance were partially offset by a decrease of $\n9.0\n million related to changes in valuation allowances and currency translation in Brazil and $\n3.1\n million changes in valuation allowances in other foreign jurisdictions.\nFor the year ended December 31, 2023, the valuation allowance increased by $\n512.0\n million, of which a $\n531.0\n million increase related to changes in the valuation allowance to U.S. branch foreign tax credits, and a $\n0.2 million\n increase related to changes in valuation allowances in other foreign jurisdictions. These increases to the valuation allowance were partially offset by a decrease of $\n12.7\n million related to changes in valuation allowances and currency translation in Brazil and $\n6.5\n million changes in valuation allowances in other foreign jurisdictions.\n \n \nFor the year ended December 31, 2022 the valuation allowance increased by $\n135.2\n million, of which a $\n83.6\n million increase related to changes in the valuation allowance to U.S. branch foreign tax credits, a $\n13.2\n million increase related to changes in valuation allowances and currency translation in Brazil and $\n46.8 million\n changes in valuation allowances in other foreign jurisdictions. These increases to the valuation allowance were partially offset by a decrease of $\n1.5\n million to net operating losses for certain U.S. states and $\n7.0\n million changes in valuation allowances in other foreign jurisdictions. \nF-  60\nChanges to our income tax valuation allowance were as follows:\nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nIncome tax valuation allowance, related to deferred income taxes\nBalance at beginning of period\n$\n1,421.9\n \n$\n909.9\n \n$\n774.7\n \nCharges or (reductions) to costs and expenses\n107.4\n \n512.0\n \n135.2\n \nBalance at end of period\n$\n1,529.3\n \n$\n1,421.9\n \n$\n909.9\n \nUncertain Tax Positions\nAccounting for uncertain income tax positions is determined by prescribing a minimum probability threshold that a tax position must meet before a financial statement benefit is recognized. This minimum threshold is that a tax position is more likely than not to be sustained upon examination by the applicable taxing authority, including resolution of any related appeals or litigation processes, based on the technical merits of the position. The tax benefit to be recognized is measured as the largest amount of benefit that is greater than a fifty percent likelihood of being realized upon ultimate settlement.\nAs of December 31, 2024, we had $\n14.2\n million of gross uncertain tax positions. If recognized, the benefit to our effective tax rate in future periods would be approximately $\n11.5\n million of that amount. During 2024 we recorded net decreases in our uncertain tax positions of $\n11.6\n million related to certain U.S. and non-U.S. tax matters, of which $\n11.1\n million impacted the effective tax rate. This decrease was offset by items not included in gross uncertain tax positions.\nBased upon the information available as of December 31, 2024, it is reasonably possible that the amount of unrecognized tax benefits will change in the next twelve months; however, the change cannot reasonably be estimated.\nA summary of gross unrecognized tax benefit activity is as follows:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nGross unrecognized tax benefits, beginning of period\n$\n25.8\n \n$\n25.2\n \n$\n124.6\n \nGross increases:\nPrior period tax positions\n—\n \n0.9\n \n0.7\n \nCurrent period tax positions\n1.6\n \n3.0\n \n3.0\n \nGross decreases:\nPrior period tax positions\n(\n11.5\n)\n(\n3.8\n)\n(\n99.7\n)\nCurrency translation\n(\n1.7\n)\n0.5\n \n(\n3.4\n)\nGross unrecognized tax benefits, end of period\n$\n14.2\n \n$\n25.8\n \n$\n25.2\n \nWe recognize interest and penalties related to unrecognized tax benefits as a component of our income tax expense. Interest and penalties accrued in our Consolidated Balance Sheets as of December 31, 2024 and 2023 were $\n5.4\n million and $\n6.4\n million, respectively, and are included in other noncurrent liabilities in the Consolidated Balance Sheets.\nOpen Tax Periods\nWe operate in multiple tax jurisdictions, both within the U.S. and outside the U.S., and face audits from various tax authorities regarding transfer pricing, deductibility of certain expenses and intercompany transactions, as well as other matters. With few exceptions, we are no longer subject to examination for tax years prior to 2017.\nMosaic is continually under audit by various tax authorities in the normal course of business. Such tax authorities may raise issues contrary to positions taken by the Company. If such positions are ultimately not sustained by the Company, this could result in material assessments to the Company. The costs related to defending, if needed, such positions on appeal or in court may be material. The Company believes that any issues considered are properly accounted for.\nF-  61\nWe are currently under audit by the Internal Revenue Service for the tax years ended December 31, 2018 and December 31, 2020. Based on the information available, we do not anticipate significant changes to our unrecognized tax benefits as a result of these examinations other than the amounts discussed above.\nWe are currently under audit by the Canada Revenue Agency for the tax year ended December 31, 2020. Based on the information available, we do not anticipate significant changes to our unrecognized tax benefits as a result of these examinations other than the amounts discussed above\n.\n14.  \nASSET RETIREMENT OBLIGATIONS\nWe recognize our estimated ARO\n’\ns in the period in which we have an existing legal obligation associated with the retirement of a tangible long-lived asset and the amount of the liability can be reasonably estimated. The ARO is recognized at fair value when the liability is incurred with a corresponding increase in the carrying amount of the related long lived asset. We depreciate the tangible asset over its estimated useful life. The liability is adjusted in subsequent periods through accretion expense which represents the increase in the present value of the liability due to the passage of time. Such depreciation and accretion expenses are included in cost of goods sold for operating facilities and other operating expense for indefinitely closed facilities.\nOur legal obligations related to asset retirement require us to: (i) reclaim lands disturbed by mining as a condition to receive permits to mine phosphate ore reserves; (ii) treat low pH process water in Gypstacks to neutralize acidity; (iii) close and monitor Gypstacks at our Florida and Louisiana facilities at the end of their useful lives; (iv) remediate certain other conditional obligations; (v) remove all surface structures and equipment, plug and abandon mine shafts, contour and revegetate, as necessary, and monitor for five years after closing our Carlsbad, New Mexico facility; (vi) decommission facilities, manage tailings and execute site reclamation at our Saskatchewan potash mines at the end of their useful lives; (vii) decommission mines in Brazil and Peru; and (viii) decommission plant sites and closed Gypstacks in Brazil. The estimated liability for these legal obligations is based on the estimated cost to satisfy the above obligations which is discounted using a credit-adjusted risk-free rate.\nA reconciliation of our AROs is as follows:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\nAROs, beginning of period\n$\n2,213.4\n \n$\n1,905.6\n \nLiabilities incurred\n29.8\n \n22.9\n \nLiabilities settled\n(\n253.8\n)\n(\n198.5\n)\nAccretion expense\n111.2\n \n96.1\n \nRevisions in estimated cash flows\n541.4\n \n365.1\n \nForeign currency translation\n(\n69.8\n)\n22.2\n \nAROs, end of period\n2,572.2\n \n2,213.4\n \nLess current portion\n352.8\n \n377.4\n \nNon-current portion of AROs\n$\n2,219.4\n \n$\n1,836.0\n \nNorth America Gypstack Closure Costs\nA majority of our ARO relates to Gypstack Closure Costs in Florida and Louisiana. For financial reporting purposes, we recognize our estimated Gypstack Closure Costs at their present value. This present value determined for financial reporting purposes is reflected on our Consolidated Balance Sheets in accrued liabilities and other noncurrent liabilities. As of December 31, 2024 and 2023, the present value of our North American Gypstack Closure Costs ARO reflected in our Consolidated Balance Sheet was approximately $\n1.5\n billion and $\n1.2\n billion, respectively.\nAs discussed below, we have arrangements to provide financial assurance for the estimated Gypstack Closure Costs associated with our facilities in Florida and Louisiana.\nEPA RCRA Initiative. \nOn September 30, 2015, we and our subsidiary, Mosaic Fertilizer, LLC (“\nMosaic Fertilizer\n”), reached agreements with the U.S. Environmental Protection Agency (“\nEPA\n”), the U.S. Department of Justice (“\nDOJ\n”), the Florida Department of Environmental Protection (“\nFDEP\n”) and the Louisiana Department of Environmental Quality on the terms of \nF-  62\ntwo consent decrees (collectively, the “\n2015 Consent Decrees\n”) to resolve claims relating to our management of certain waste materials onsite at our Riverview, New Wales, Green Bay, South Pierce and Bartow fertilizer manufacturing facilities in Florida and our Faustina and Uncle Sam facilities in Louisiana. This followed a 2003 announcement by the EPA Office of Enforcement and Compliance Assurance that it would be targeting facilities in mineral processing industries, including phosphoric acid producers, for a thorough review under the U.S. Resource Conservation and Recovery Act (“\nRCRA\n”) and related state laws. As discussed below, a separate consent decree was previously entered into with the EPA and the FDEP with respect to RCRA compliance at the Plant City Facility that we acquired as part of our acquisition of the Florida phosphate assets and assumption of certain related liabilities of CF Industries, Inc. (“\nCF\n”).\nThe remaining monetary obligations under the 2015 Consent Decrees include a provision of additional financial assurance for the estimated Gypstack Closure Costs for Gypstacks at the covered facilities. The RCRA Trusts are discussed in Note 12 to our Consolidated Financial Statements. In addition, we have agreed to guarantee the difference between the amounts held in each RCRA Trust (including any earnings) and the estimated closure and long-term care costs.\nAs of December 31, 2024 the undiscounted amount of our Gypstack Closure Costs\n \nARO associated with the facilities covered by the 2015 Consent Decrees, determined using the assumptions used for financial reporting purposes, was approximately $\n2.3\n billion, and the present value of our Gypstack Closure Costs ARO reflected in our Consolidated Balance Sheet for those facilities was approximately $\n1.1\n billion.\nPlant City and Bonnie Facilities. \nAs part of the CF Phosphate Assets Acquisition, we assumed certain AROs related to Gypstack Closure Costs at both the Plant City Facility and a closed Florida phosphate concentrates facility in Bartow, Florida (the “\nBonnie Facility\n”) that we acquired. Associated with these assets are two related financial assurance arrangements for which we became responsible and that provided sources of funds for the estimated Gypstack Closure Costs for these facilities. Pursuant to federal or state laws, the applicable government entities are permitted to draw against such amounts in the event we cannot perform such closure activities. One of the financial assurance arrangements was initially a trust (the “\nPlant City Trust\n”) established to meet the requirements under a consent decree with the EPA and the FDEP with respect to RCRA compliance at the Plant City Facility. The Plant City Trust also satisfied Florida financial assurance requirements at that site. Beginning in September 2016, as a substitute for the financial assurance provided through the Plant City Trust, we have provided financial assurance for the Plant City Facility in the form of a surety bond (the “\nPlant City Bond\n”). The amount of the Plant City Bond is $\n327.1\n million, which reflects our closure cost estimates as of December 31, 2024. The other financial assurance arrangement was also a trust fund (the “\nBonnie Facility Trust\n”) established to meet the requirements under Florida financial assurance regulations that apply to the Bonnie Facility. In July 2018, we received $\n21.0\n million from the Bonnie Facility Trust by substituting for the trust fund a financial test mechanism (“\nBonnie Financial Test\n”) supported by a corporate guarantee as allowed by state regulations. Both financial assurance funding obligations require estimates of future expenditures that could be impacted by refinements in scope, technological developments, new information, cost inflation, changes in regulations, discount rates and the timing of activities. Under our current approach to satisfying applicable requirements, additional financial assurance would be required in the future if increases in cost estimates exceed the face amount of the Plant City Bond or the amount supported by the Bonnie Financial Test.\nAs of December 31, 2024 and 2023, the aggregate amounts of AROs associated with the combined Plant City Facility and Bonnie Facility Gypstack Closure Costs included in our consolidated balance sheet were $\n368.7\n million and $\n361.8\n million, respectively. The aggregate amount represented by the Plant City Bond exceeds the present value of the aggregate amount of ARO associated with that facility. This is because the amount of financial assurance we are required to provide represents the aggregate undiscounted estimated amount to be paid by us in the normal course of our Phosphates business over a period that may not end until three decades or more after the Gypstack has been closed, whereas the ARO included in our Consolidated Balance Sheet reflects the discounted present value of those estimated amounts.\n15.  \nDERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES\nWe periodically enter into derivatives to mitigate our exposure to foreign currency risks, interest rate movements and the effects of changing commodity prices. We record all derivatives on the Consolidated Balance Sheets at fair value. The fair value of these instruments is determined by using quoted market prices, third-party comparables or internal estimates. We net our derivative asset and liability positions when we have a master netting arrangement in place. Changes in the fair value of the foreign currency, commodity and freight derivatives are immediately recognized in earnings. As of December 31, 2024 and 2023, the gross asset position of our derivative instruments was $\n3.1\n million and $\n36.4\n million, respectively, and the gross liability position of our liability instruments was $\n87.8\n million and $\n17.2\n million, respectively.\nF-  63\nWe do not apply hedge accounting treatments to our foreign currency exchange contracts, commodities contracts or freight contracts. Unrealized gains and (losses) on foreign currency exchange contracts used to hedge cash flows related to the production of our products are included in cost of goods sold in the Consolidated Statements of Earnings. Unrealized gains and (losses) on commodities contracts and certain forward freight agreements are also recorded in cost of goods sold in the Consolidated Statements of Earnings. Unrealized gains or (losses) on foreign currency exchange contracts used to hedge cash flows that are not related to the production of our products are included in the foreign currency transaction gain/(loss) caption in the Consolidated Statements of Earnings.\nFrom time to time, we enter into fixed-to-floating interest rate contracts. We apply fair value hedge accounting treatment to these contracts. Under these arrangements we agree to exchange, at specified intervals, the difference between fixed and floating interest amounts calculated by reference to an agreed-upon notional principal amount. The mark-to-market of these fair value hedges is recorded as gains or (losses) in interest expense. We had \nno\n fixed-to-floating interest rate swap agreements in effect as of December 31, 2024 and 2023.\nThe following is the total absolute notional volume associated with our outstanding derivative instruments:\n(in millions of Units)\nInstrument\nDerivative Category\nUnit of Measure\nDecember 31,\n2024\nDecember 31,\n2023\nForeign currency derivatives\nForeign Currency\nU.S. Dollars\n1,377.3\n \n2,418.7\n \nNatural gas derivatives\nCommodity\nMM BTU\n2.5\n \n17.1\n \nCredit-Risk-Related Contingent Features\nCertain of our derivative instruments contain provisions that are governed by International Swap and Derivatives Association agreements with the counterparties. These agreements contain provisions that allow us to settle for the net amount between payments and receipts, and also state that if our debt were to be rated below investment grade, certain counterparties to the derivative instruments could request full collateralization on derivative instruments in net liability positions. The aggregate fair value of all derivative instruments with credit-risk-related contingent features that were in a liability position as of December 31, 2024 and 2023 was $\n58.1\n million and $\n15.6\n million, respectively. We have no cash collateral posted in association with these contracts. If the credit-risk-related contingent features underlying these agreements were triggered on December 31, 2024 we would have been required to post an additional $\n54.9\n million of collateral assets, which are either cash or U.S. Treasury instruments, to the counterparties.\nCounterparty Credit Risk\nFinancial instruments that may subject us to concentrations of credit risk consist primarily of derivatives, cash and cash equivalents and accounts receivable. We enter into foreign exchange, certain commodity and interest rate derivatives, and place our cash and cash equivalents with a diversified group of highly rated counterparties. We have a diverse base of customers to which we grant credit terms in the normal course of business which are designed to mitigate concentrations of credit risk. We continually monitor our positions and the credit ratings of the counterparties involved and limit the amount of credit exposure to any one party. We manage our exposure to counterparty credit risk through specific minimum credit standards, establishing credit limits, diversification of counterparties, monitoring procedures and utilization of credit insurance or cash collateral in certain circumstances. While we may be exposed to potential losses due to the credit risk of non-performance by these counterparties, material losses are not anticipated. We closely monitor the credit risk associated with our counterparties and customers and to date have not experienced material losses.\n16.  \nFAIR VALUE MEASUREMENTS\nFollowing is a summary of the valuation techniques for assets and liabilities recorded in our Consolidated Balance Sheets at fair value on a recurring basis:\nForeign Currency Derivatives\n–\nThe foreign currency derivative instruments that we currently use are forward contracts and zero-cost collars, which typically expire within \n18\n months. Most of the valuations are adjusted by a forward yield curve or interest rates. In such cases, these derivative contracts are classified within Level 2. Some valuations are based on exchange-quoted prices, which are classified as Level 1. As of December 31, 2024, our foreign currency contracts were Level 2. Changes in the fair market values of these contracts are recognized in the Consolidated Financial Statements as a component \nF-  64\nof cost of goods sold in our Corporate, Eliminations and Other segment or foreign currency transaction gain (loss). As of December 31, 2024 and 2023, the gross asset position of our foreign currency derivative instruments was $\n3.1\n million and $\n36.4\n million, respectively, and the gross liability position of our foreign currency derivative instruments was $\n86.1\n million and $\n8.0\n million, respectively and is included in Accrued Liabilities in the Consolidated Balance Sheets.\nCommodity Derivatives\n–\nThe commodity contracts primarily relate to natural gas. The commodity derivative instruments that we currently use are forward purchase contracts, swaps and three-way collars. The natural gas contracts settle using NYMEX futures or AECO price indexes, which represent fair value at any given time. The contracts’ maturities and settlements are scheduled for future months and settlements are scheduled to coincide with anticipated gas purchases during those future periods. Quoted market prices from NYMEX and AECO are used to determine the fair value of these instruments. These market prices are adjusted by a forward yield curve and are classified within Level 2. Changes in the fair market values of these contracts are recognized in the Consolidated Financial Statements as a component of cost of goods sold in our Corporate, Eliminations and Other segment. As of December 31, 2024 and 2023, the gross asset position of our commodity derivative instruments was \nzero\n, and the gross liability position of our commodity derivative instruments was $\n1.7\n million and $\n9.2\n million, respectively.\nInterest Rate Derivatives\n–\nWe manage interest expense through interest rate contracts to convert a portion of our fixed-rate debt into floating-rate debt. From time to time, we also enter into interest rate swap agreements to hedge our exposure to changes in future interest rates related to anticipated debt issuances. Valuations are based on external pricing sources and are classified as Level 2. Changes in the fair market values of these contracts are recognized in the Consolidated Financial Statements as a component of interest expense. We did not hold any interest rate derivative positions as of December 31, 2024 or 2023.\nFinancial Instruments\nThe carrying amounts and estimated fair values of our financial instruments are as follows:\n \nDecember 31,\n \n2024\n2023\n \nCarrying\nFair\nCarrying\nFair\n(in millions)\nAmount\nValue\nAmount\nValue\nCash and cash equivalents\n$\n272.8\n \n$\n272.8\n \n$\n348.8\n \n$\n348.8\n \nAccounts receivable\n1,113.3\n \n1,113.3\n \n1,269.2\n \n1,269.2\n \nEquity securities\n1,486.8\n \n1,486.8\n \n—\n \n—\n \nAccounts payable\n1,156.5\n \n1,156.5\n \n1,166.9\n \n1,166.9\n \nStructured accounts payable arrangements\n402.3\n \n402.3\n \n399.9\n \n399.9\n \nShort-term debt\n847.1\n \n847.1\n \n399.7\n \n399.7\n \nLong-term debt, including current portion\n3,377.6\n \n3,324.1\n \n3,361.7\n \n3,364.1\n \nFor cash and cash equivalents, accounts receivable, net, accounts payable, structured accounts payable arrangements and short-term debt, the carrying amount approximates fair value because of the short-term maturity of those instruments\n. Equity securities represent our Ma\n’\naden shares and are carried at fair value based on the unadjusted quoted price on the Saudi Exchange (Tadawul), which results in a Level 1 classification. For more information on the Ma\n’\naden shares, see Note \n9\n of our Notes to Consolidated Financial Statements. Included in long-term debt is floating rate debt of $\n570\n million. Our floating rate debt is non-public and bears a variable SOFR based rate and consists of our borrowings under our term loan facility. Th\ne fair value of our floating rate debt approximates the carrying value and is estimated based on market-based inputs including interest rates and credit spreads, which results in a Level 2 classification. The fair value of fixed rate long-term debt, including the current portion, is estimated using quoted market prices for the publicly registered notes and debentures, classified as Level 1 and Level 2, respectively, within the fair value hierarchy, depending on the market liquidity of the debt. For information regarding the fair value of our marketable securities held in trusts, see Note 12 of our Notes to Consolidated Financial Statements.\nF-  65\n17.  \nGUARANTEES AND INDEMNITIES\nWe enter into various contracts that include indemnification and guarantee provisions as a routine part of our business activities. Examples of these contracts include asset purchase and sale agreements, surety bonds, financial assurances to regulatory agencies in connection with reclamation and closure obligations, commodity sale and purchase agreements and other types of contractual agreements with vendors and other third parties. These agreements indemnify counterparties for matters such as reclamation and closure obligations, tax liabilities, environmental liabilities, litigation and other matters, as well as breaches by Mosaic of representations, warranties and covenants set forth in these agreements. In many cases, we are essentially guaranteeing our own performance, in which case the guarantees do not fall within the scope of the accounting and disclosures requirements under U.S. GAAP. Our maximum potential exposure under our indemnification arrangements can range from a specified dollar amount to an unlimited amount, depending on the nature of the transaction. Many of the guarantees and indemnities we issue to third parties do not limit the amount or duration of our obligations to perform under them. For these guarantees and indemnities, we may not be able to estimate what our liability would be until a claim is made for payment or performance due to the contingent nature of these arrangements. Based on our current understanding of the relevant facts, we do not believe that we will be required to make any material payments under these indemnity provisions.\n 18.  \nPENSION PLANS AND OTHER BENEFITS\nWe sponsor pension and postretirement benefits through a variety of plans, including defined benefit plans, defined contribution plans and postretirement benefit plans in North America and certain of our international locations. We reserve the right to amend, modify or terminate the Mosaic sponsored plans at any time, subject to provisions of the Employee Retirement Income Security Act of 1974 (“\nERISA\n”), prior agreements and our collective bargaining agreements.\nDefined Benefit\nDuring fiscal 2022, we terminated the defined benefit pension plan in the U.S, which was frozen at the time of termination. In connection with the plan termination, we settled all future obligations under the terminated plan through a combination of lump-sum payments to eligible participants who elected to receive them through a lump-sum window, and the transfer of any remaining benefit obligations under the terminated plans to a third-party insurance company under a group annuity contract. As a result of these actions, we recognized a non-cash pre-tax pension settlement charge of $\n41.9\n million in our 2022 Consolidated Statements of Earnings in Other income (expense). \nWe sponsor various defined benefit pension plans in Canada, which are closed to new participants. Benefits are based on different combinations of years of service and compensation levels, depending on the plan. Generally, contributions to Canadian plans are made in accordance with the Pension Benefits Act instituted by the province of Saskatchewan. Certain employees in Canada, whose pension benefits exceed Canada Revenue Agency limitations, are covered by supplementary non-qualified, unfunded pension plans. During 2023, we terminated certain defined pension plans in Canada by transferring remaining benefit obligations for participants to a third-party insurance company under a group annuity contract. As a result of these actions, we recognized a non-cash pre-tax settlement charge of $\n42.4\n million in our 2023 Consolidated Statements of Earnings in Other income (expense).\n \nWe sponsor various defined benefit pension plans in Brazil, and we acquired multi-employer pension plans for certain of our Brazil associates. All our pension plans are governed by the Brazilian pension plans regulatory agency, National Superintendence of Supplementary Pensions. Our Brazil plans are not individually significant to the Company’s consolidated financial statements after factoring in the multi-employer pension plan indemnification that we acquired through an acquisition. We made contributions to these plans, net of indemnification, of $\n0.4\n million and $\n0.1\n million for the years ended December 31, 2024 and 2023, respectively.\nF-  66\nAccounting for Pension Plans\nThe year-end status of the North American pension plans was as follows:\n \nPension Plans\n \nYears Ended December 31,\n(in millions)\n2024\n2023\nChange in projected benefit obligation:\nBenefit obligation at beginning of period\n$\n119.6\n \n$\n294.3\n \nService cost\n3.0\n \n2.8\n \nInterest cost\n5.5\n \n11.1\n \nActuarial loss\n0.2\n \n3.3\n \nCurrency fluctuations\n(\n9.4\n)\n2.0\n \nBenefits paid and transfers\n(\n4.3\n)\n(\n190.4\n)\nPlan amendments\n—\n \n5.8\n \nLiability (gain)/loss due to curtailment/settlement\n—\n \n(\n9.3\n)\nProjected benefit obligation at end of period\n$\n114.6\n \n$\n119.6\n \nChange in plan assets:\nFair value at beginning of period\n$\n157.1\n \n$\n329.0\n \nCurrency fluctuations\n(\n12.2\n)\n2.9\n \nActual return\n12.8\n \n11.4\n \nCompany contribution\n(\n7.1\n)\n4.2\n \nBenefits paid and transfers\n(\n4.3\n)\n(\n190.4\n)\nFair value at end of period\n$\n146.3\n \n$\n157.1\n \nFunded status of the plans as of the end of period\n$\n31.7\n \n$\n37.5\n \nAmounts recognized in the consolidated balance sheets:\nNoncurrent assets\n$\n37.4\n \n$\n43.8\n \nCurrent liabilities\n(\n0.4\n)\n(\n0.5\n)\nNoncurrent liabilities\n(\n5.3\n)\n(\n5.8\n)\nAmounts recognized in accumulated other comprehensive (income) loss\nPrior service cost\n$\n11.9\n \n$\n15.1\n \nActuarial loss\n14.8\n \n20.0\n \nThe accumulated benefit obligation for the defined benefit pension plans was $\n114.6\n million and $\n119.6\n million as of December 31, 2024 and 2023, respectively. In 2025, we expect the related plans to pay benefit payments of approximately $\n3.4\n million and to contribute cash of at least $\n0.8\n million to the pension plans to meet minimum funding requirements.\nPlan Assets and Investment Strategies\nThe Company’s overall investment strategy is to obtain sufficient return and provide adequate liquidity to meet the benefit obligations of our pension plans. The primary investment objective is to secure the promised pension benefits through capital preservation and appreciation to better manage the asset/liability gap and interest rate risk. A secondary investment objective is to most effectively manage investment volatility to reduce the variability of the Company’s required contributions. A significant amount of the assets are invested in funds that are managed by Mosaic’s investment advisor and reviewed by Mosaic management. Plan assets are primarily valued based on external pricing sources and are classified as Level 2. We do not have significant concentrations of credit risk or industry sectors within the plan assets. Fair value measurements of plan assets was $\n146.3\n million at December 31, 2024 and was invested approximately \n75\n% in fixed income securities, \n20\n% in equity securities, and \n5\n% in other investment funds and cash.\nF-  67\nDefined Contribution Plans\nEligible salaried and non-union hourly employees in the U.S. participate in a defined contribution investment plan which permits employees to defer a portion of their compensation through payroll deductions and provides matching contributions. We match \n100\n% of the first \n3\n% of the participant’s contributed pay plus \n50\n% of the next \n3\n% of the participant’s contributed pay, subject to Internal Revenue Service limits. Participant contributions, matching contributions and the related earnings immediately vest. Mosaic also provides an annual non-elective employer contribution feature for eligible salaried and non-union hourly employees based on the employee’s age and eligible pay. Participants are generally vested in the non-elective employer contributions after three years of service. In addition, a discretionary feature of the plan allows the Company to make additional contributions to employees. Certain union employees participate in a defined contribution retirement plan based on collective bargaining agreements.\nCanadian salaried and non-union hourly employees participate in an employer funded plan with employer contributions similar to the U.S. plan. The plan provides a profit sharing component which is paid each year. We also sponsor one mandatory union plan in Canada. Benefits in these plans vest after two years of consecutive service.\nThe expense attributable to defined contribution plans in the U.S. and Canada was $\n60.8\n million, $\n61.7\n million and $\n55.7\n million for 2024, 2023 and 2022, respectively.\nPostretirement Medical Benefit Plans\nWe provide certain health care benefit plans for certain retired employees (“\nRetiree Health Plans\n”) which may be either contributory or non-contributory and contain certain other cost-sharing features such as deductibles and coinsurance.\nThe North American Retiree Health Plans are unfunded and the projected benefit obligation was $\n20.6\n million and $\n22.8\n million as of December 31, 2024 and 2023, respectively. This liability should continue to decrease due to our limited exposure. The related income statement effects of the Retiree Health Plans are not material to the Company. We anticipate contributing cash of at least $\n1.9\n million in 2025 to the postretirement medical benefit plans to fund anticipated benefit payments.\nThe year-end status of the Brazil postretirement medical benefit plans with a discount rate of \n9.95\n% and \n10.40\n% on each of December 31, 2024 and 2023, respectively was as follows:\nPostretirement Medical Benefits\nYears Ended December 31,\n(in millions)\n2024\n2023\nChange in accumulated postretirement benefit obligation (“\nAPBO\n”):\nAPBO at beginning of year\n$\n74.4\n \n$\n59.1\n \nService cost\n—\n \n0.1\n \nInterest cost\n7.4\n \n6.2\n \nActuarial (gain) loss\n(\n11.2\n)\n4.8\n \nCurrency fluctuations\n(\n15.2\n)\n5.4\n \nBenefits paid\n(\n1.1\n)\n(\n1.2\n)\nAPBO at end of year\n$\n54.3\n \n$\n74.4\n \nChange in plan assets:\nCompany contribution\n$\n1.1\n \n$\n1.2\n \nBenefits paid\n(\n1.1\n)\n(\n1.2\n)\nUnfunded status of the plans as of the end of the year\n$\n(\n54.3\n)\n$\n(\n74.4\n)\nAmounts recognized in the consolidated balance sheets:\nCurrent liabilities\n$\n(\n1.4\n)\n$\n(\n1.1\n)\nNoncurrent liabilities\n(\n52.9\n)\n(\n73.3\n)\nAmounts recognized in accumulated other comprehensive income\nPrior service credit\n$\n(\n8.8\n)\n$\n(\n13.2\n)\nActuarial (gain) loss\n$\n(\n0.6\n)\n$\n11.9\n \nF-  68\n19.  \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS) (\n“\nAOCI\n”\n)\nThe following table sets forth the changes in AOCI by component during the years ended December 31, 2024, 2023 and 2022:\n(in millions)\nForeign Currency Translation Gain (Loss)\nNet Actuarial Gain and Prior Service Cost\nAmortization of Gain on Interest Rate Swap\nNet Gain (Loss) on Marketable Securities Held in Trust\nTotal\nBalance at December 31, 2021\n$\n(\n1,825.5\n)\n$\n(\n72.8\n)\n$\n5.2\n \n$\n1.3\n \n(\n1,891.8\n)\nOther comprehensive income (loss)\n(\n261.1\n)\n28.6\n \n2.0\n \n(\n32.4\n)\n(\n262.9\n)\nTax (expense) or benefit\n6.1\n \n(\n8.9\n)\n(\n0.5\n)\n7.6\n \n4.3\n \nOther comprehensive income (loss), net of tax\n(\n255.0\n)\n19.7\n \n1.5\n \n(\n24.8\n)\n(\n258.6\n)\nLess: (Gain) Loss attributable to noncontrolling interest\n(\n1.8\n)\n—\n \n—\n \n—\n \n(\n1.8\n)\nBalance at December 31, 2022\n$\n(\n2,082.3\n)\n$\n(\n53.1\n)\n$\n6.7\n \n$\n(\n23.5\n)\n$\n(\n2,152.2\n)\nOther comprehensive income (loss)\n152.0\n \n31.1\n \n1.8\n \n30.6\n \n215.5\n \nTax (expense) or benefit\n2.1\n \n(\n11.0\n)\n(\n0.4\n)\n(\n6.9\n)\n(\n16.2\n)\nOther comprehensive income (loss), net of tax\n154.1\n \n20.1\n \n1.4\n \n23.7\n \n199.3\n \nLess: (Gain) Loss attributable to noncontrolling interest\n(\n2.0\n)\n—\n \n—\n \n—\n \n(\n2.0\n)\nBalance at December 31, 2023\n$\n(\n1,930.2\n)\n$\n(\n33.0\n)\n$\n8.1\n \n$\n0.2\n \n$\n(\n1,954.9\n)\nOther comprehensive income (loss)\n(\n478.6\n)\n16.8\n \n(\n0.1\n)\n(\n19.6\n)\n(\n481.5\n)\nTax (expense) or benefit\n(\n17.0\n)\n(\n5.9\n)\n—\n \n4.8\n \n(\n18.1\n)\nOther comprehensive income (loss), net of tax\n(\n495.6\n)\n10.9\n \n(\n0.1\n)\n(\n14.8\n)\n(\n499.6\n)\nLess: (Gain) Loss attributable to noncontrolling interest\n5.5\n \n—\n \n—\n \n—\n \n5.5\n \nBalance at December 31, 2024\n$\n(\n2,420.3\n)\n$\n(\n22.1\n)\n$\n8.0\n \n$\n(\n14.6\n)\n$\n(\n2,449.0\n)\nF-  69\n20.  \nSHARE REPURCHASES\nIn 2022, our Board of Directors approved two share repurchase programs for a total of $\n3.0\n billion. Our repurchase programs allow the Company to repurchase shares of our Common Stock through open market purchases, accelerated share repurchase arrangements, privately negotiated transactions or otherwise and have no set expiration date. \nDuring the year ended December 31, 2024, we repurchased \n7,944,507\n shares of Common Stock in the open market for approximately $\n235.4\n million at an average purchase price per share of $\n29.63\n.\nOn February 24, 2023, pursuant to existing stock repurchase authorizations, we entered into an accelerated share repurchase agreement (the “\n2023 ASR Agreement\n”) with a third-party financial institution to repurchase $\n300\n million of our Common Stock. At inception, we paid the financial institution $\n300\n million and took initial delivery of \n4,659,290\n shares of our Common Stock, representing an estimated \n80\n% of the total shares expected to be delivered under the 2023 ASR Agreement. In March 2023, the transaction was completed and we received an additional \n965,284\n shares of Common Stock. In total, \n5,624,574\n shares were delivered under the 2023 ASR Agreement, at an average purchase price of $\n53.34\n per share. \nDuring the year ended December 31, 2023, we repurchased \n16,879,059\n shares of Common Stock in the open market for approximately $\n748.0\n million, at an average purchase price per share of $\n44.31\n. This includes the \n5,624,574\n shares purchased under the 2023 ASR Agreement. \nThe extent to which we repurchase our shares and the timing of any such repurchases depend on a number of factors, including market and business conditions, the price of our shares, our ability to access capital resources, our liquidity and corporate, regulatory and other considerations.\n21.  \nSHARE-BASED PAYMENTS\nThe Mosaic Company 2023 Stock and Incentive Plan (the “\n2023 Stock and Incentive Plan\n”) was approved by our stockholders and became effective on May 25, 2023.  It permits up to \n18\n million shares of common stock to be issued under share-based awards granted under this plan. The 2023 Stock and Incentive Plan provides for grants of stock options, restricted stock, restricted stock units, performance units and a variety of other share-based and non-share-based awards. Our employees, officers, directors, consultants, agents, advisors and independent contractors, as well as other designated individuals, are eligible to participate in the 2023 Stock and Incentive Plan.\nThe Mosaic Company 2014 Stock and Incentive Plan (the “\n2014 Stock and Incentive Plan\n”) was approved by our stockholders and became effective on May 15, 2014. It permits up to \n25\n million shares of common stock to be issued under share-based awards granted under this plan. The 2014 Stock and Incentive Plan provides for grants of stock options, restricted stock, restricted stock units, performance units and a variety of other share-based and non-share-based awards. Our employees, officers, directors, consultants, agents, advisors and independent contractors, as well as other designated individuals, are eligible to participate in the 2014 Stock and Incentive Plan.\nThe Mosaic Company 2004 Omnibus Stock and Incentive Plan (the “\nOmnibus Plan\n”), which was approved by our stockholders and became effective in 2004 and subsequently amended, provided for the grant of shares and share options to employees for up to \n25\n million shares of common stock. While awards may no longer be made under the Omnibus Plan, it will remain in effect with respect to the awards that had been granted thereunder prior to its termination.\nMosaic settles stock option exercises, restricted stock units and certain performance units and performance shares with newly issued common shares. The Compensation Committee of the Board of Directors administers these plans subject to their respective provisions and applicable law.\nStock Options\nStock options are granted with an exercise price equal to the market price of our stock at the date of grant and have a ten-year contractual term. The fair value of each option award is estimated on the date of the grant using the Black-Scholes option valuation model. Stock options generally vest in equal annual installments in the first \nthree years\n following the date of grant (graded vesting). Stock options are expensed on a straight-line basis over the required service period, based on the estimated fair value of the award on the date of grant, net of estimated forfeitures.\nF-  70\nValuation Assumptions\nAssumptions used to calculate the fair value of stock options awarded in 2017 are noted in the following table. There were no stock options granted or issued in 2024, 2023 or 2022. Expected volatility is based on the simple average of implied and historical volatility using the daily closing prices of the Company’s stock for a period equal to the expected term of the option. The risk-free interest rate is based on the U.S. Treasury rate at the time of the grant for instruments of comparable life.\n \nYear Ended December 31, 2017\nWeighted average assumptions used in option valuations:\nExpected volatility\n35.35\n \n%\nExpected dividend yield\n1.97\n \n%\nExpected term (in years)\n7\nRisk-free interest rate\n2.34\n \n%\nA summary of the status of our stock options as of December 31, 2024, and activity during 2024, is as follows:\nShares\n(in millions)\nWeighted\nAverage\nExercise\nPrice\nWeighted Average Remaining Contractual Term (Years)\nAggregate\nIntrinsic\nValue\nOutstanding as of December 31, 2023\n0.6\n \n$\n34.46\n \nGranted\n—\n \n—\n \nExercised\n—\n \n$\n—\n \nCancelled or forfeited\n(\n0.1\n)\n$\n49.73\n \nOutstanding as of December 31, 2024\n0.5\n \n$\n32.68\n \n1.44\n$\n—\n \nExercisable as of December 31, 2024\n0.5\n \n$\n32.68\n \n1.44\n$\n—\n \nRestricted Stock Units\nRestricted stock units are issued to various employees, officers and directors at a value equal to the market price of our stock at the date of grant. The fair value of restricted stock units is equal to the market price of our stock at the date of grant. Restricted stock units generally cliff vest after \nthree years\n of continuous service and are expensed on a straight-line basis over the required service period, based on the estimated grant date fair value, net of estimated forfeitures.\nA summary of the status of our restricted stock units as of December 31, 2024, and activity during 2024, is as follows:\nShares\n(in millions)\nWeighted Average\nGrant Date Fair\nValue Per Share\nRestricted stock units as of December 31, 2023\n1.5\n \n$\n42.70\n \nGranted\n0.8\n \n30.99\n \nIssued and cancelled or forfeited\n(\n0.7\n)\n$\n31.63\n \nRestricted stock units as of December 31, 2024\n1.6\n \n$\n41.61\n \nPerformance Units\nDuring the years ended December 31, 2024, 2023 and 2022, \n496,367\n, \n1,206,263\n and \n540,915\n total stockholder return (“\nTSR\n”) performance units were granted, respectively. Final performance units are awarded based on the increase or decrease, subject to certain limitations, in Mosaic’s share price from the grant date to the third anniversary of the award, plus dividends (a measure of total stockholder return or TSR). The beginning and ending stock prices are based on a \n30\n trading-day average stock price. Holders of the awards must be employed at the end of the performance period in order for any units to vest, except in the event of death, disability or retirement at or after age \n60\n, certain changes in control or the exercise of Committee or Board discretion as provided in the related award agreements.\nF-  71\nThe fair value of each TSR performance unit is determined using a Monte Carlo simulation. This valuation methodology utilizes assumptions consistent with those of our other share-based awards and a range of ending stock prices; however, the expected term of the awards is \nthree years\n, which impacts the assumptions used to calculate the fair value of performance units as shown in the table below. \n241,189\n, \n354,500\n and \n195,755\n of the TSR performance awards issued in 2024, 2023 and 2022, respectively, are to be settled in cash, and are therefore accounted for as a liability with changes in value recorded through earnings during the service period. The remaining TSR performance units issued in 2024, 2023 and 2022 are considered equity-classified fixed awards measured at grant-date fair value and not subsequently re-measured. All of the TSR performance units cliff vest after \nthree years\n of continuous service and are expensed on a straight-line basis over the required service period, based on the estimated grant date fair value of the award net of estimated forfeitures.\nA summary of the assumptions used to estimate the fair value of TSR performance units is as follows: \nYears Ended December 31,\n2024\n2023\n2022\nPerformance units granted\n496,367\n \n1,206,283\n \n540,915\n \nAverage fair value of performance units on grant date\n$\n31.02\n \n$\n50.56\n \n$\n55.08\n \nWeighted average assumptions used in performance unit valuations:\nExpected volatility\n40.95\n \n%\n48.33\n \n%\n54.77\n \n%\nExpected dividend yield\n2.59\n \n%\n1.52\n \n%\n0.81\n \n%\nExpected term (in years)\n3\n3\n3\nRisk-free interest rate\n4.48\n \n%\n4.52\n \n%\n1.68\n \n%\nA summary of our performance unit activity during 2024 is as follows:\nShares\n(in millions)\nWeighted Average\nGrant Date Fair\nValue Per Share\nOutstanding as of December 31, 2023\n1.3\n \n$\n39.86\n \nGranted\n0.5\n \n31.02\n \nIssued and cancelled or forfeited\n(\n0.7\n)\n$\n27.35\n \nOutstanding as of December 31, 2024\n1.1\n \n$\n44.15\n \nThe outstanding performance units as of December 31, 2024 and 2023 include \n463,410\n and \n500,393\n cash-settled performance units, respectively.\nShare-Based Compensation Expense\nWe recorded share-based compensation expense of $\n20.2\n million, $\n37.8\n million and $\n61.1\n million for 2024, 2023 and 2022, respectively. The tax benefit related to share exercises and lapses in the year was $\n1.0\n million, $\n9.0\n million and $\n7.5\n million for 2024, 2023 and 2022, respectively.\nAs of December 31, 2024, there was $\n15.8\n million of total unrecognized compensation cost related to options, restricted stock units and performance units and shares granted under the 2014 Stock and Incentive Plan and the Omnibus Plan. The unrecognized compensation cost is expected to be recognized over a weighted-average period of \none year\n. \nNo\n options vested in 2024, 2023 and 2022.\nWe received $\n16.0\n million from exercises of share-based payment arrangements for 2022. There was \nno\n cash received from exercises of share-based payment arrangements for 2024 and 2023. We incurred a tax benefit for tax deductions from options of $\n4.1\n million, $\n7.9\n million and $\n13.4\n million in 2024, 2023 and 2022, respectively.\n22.  \nCOMMITMENTS\nWe lease certain plants, warehouses, terminals, office facilities, railcars and various types of equipment under operating leases, some of which include rent payment escalation clauses, with lease terms ranging from one to 43 years. In addition to minimum lease payments, some of our office facility leases require payment of our proportionate share of real estate taxes \nF-  72\nand building operating expenses. Our future obligations under these leases are included in Note 4 of our Notes to Consolidated Financial Statements.\nWe also have purchase obligations to purchase goods and services, primarily for raw materials used in products sold to customers. In 2013, we entered into an ammonia supply agreement with CF that commenced in 2017, under which Mosaic agreed to purchase approximately \n545,000\n to \n725,000\n tonnes of ammonia per year at a price tied to the prevailing price of U.S. natural gas. This agreement ended effective January 1, 2025. \nWe have long-term agreements for the purchase of sulfur, which is used in the production of phosphoric acid, and natural gas, which is a significant raw material used primarily in the solution mining process in our Potash segment as well as in our phosphate concentrates plants. \nA schedule of future minimum long-term purchase commitments, based on expected market prices as of December 31, 2024 is as follows:\n(in millions)\nPurchase\nCommitments\n2025\n$\n2,842.1\n \n2026\n1,955.6\n \n2027\n1,570.1\n \n2028\n357.9\n \n2029\n167.8\n \nSubsequent years\n37.1\n \n$\n6,930.6\n \nPurchases made under long-term commitments were $\n2.1\n billion in 2024, $\n3.0\n billion in 2023 and $\n4.6\n billion in 2022.\nMost of our export sales of potash crop nutrients are marketed through a North American export association, Canpotex, which may fund its operations in part through third-party financing facilities. As a member, Mosaic or our subsidiaries are contractually obligated to reimburse Canpotex for their pro rata share of any operating expenses or other liabilities incurred. The reimbursements are made through reductions to members’ cash receipts from Canpotex.\nWe incur liabilities for reclamation activities and Gypstack closures in our Florida and Louisiana operations where, in order to obtain necessary permits, we must either pass a test of financial strength or provide credit support, typically in the form of cash deposits, surety bonds or letters of credit. The surety bonds generally expire within one year or less but a substantial portion of these instruments provide financial assurance for continuing obligations and therefore, in most cases, must be renewed on an annual basis. As of December 31, 2024 we had $\n793.7\n million in surety bonds outstanding, of which $\n411.8\n million is for reclamation obligations primarily related to mining in Florida. In addition, included in the total amount is $\n327.1\n million, reflecting our updated closure cost estimates, delivered to the EPA as a substitute for the financial assurance provided through the Plant City Trust. The remaining balance in surety bonds outstanding of $\n54.8\n million is for other matters.\n23.  \nCONTINGENCIES\nWe have described below the material judicial and administrative proceedings to which we are subject.\nEnvironmental Matters\nWe have contingent environmental liabilities that arise principally from three sources: (i) facilities currently or formerly owned by our subsidiaries or their predecessors; (ii) facilities adjacent to currently or formerly owned facilities; and (iii) third-party Superfund or state equivalent sites. At facilities currently or formerly owned by our subsidiaries or their predecessors, the historical use and handling of regulated chemical substances, crop and animal nutrients and additives and by-product or process tailings have resulted in soil, surface water and/or groundwater contamination. Spills or other releases of regulated substances, subsidence from mining operations and other incidents arising out of operations, including accidents, have occurred previously at these facilities and potentially could occur in the future, possibly requiring us to undertake or fund cleanup or result in monetary damage awards, fines, penalties, other liabilities, injunctions or other court or administrative rulings. In some instances, pursuant to consent orders or agreements with governmental agencies, we are \nF-  73\nundertaking certain remedial actions or investigations to determine whether remedial action may be required to address contamination. At other locations, we have entered into consent orders or agreements with appropriate governmental agencies to perform required remedial activities that will address identified site conditions. Taking into consideration established \nreserves of approximately $\n197.5\n million and $\n203.2\n million\n as of December 31, 2024 and 2023, respectively, of which $\n90.8\n million and $\n148.9\n million are included in Accrued Liabilities\n and \n$\n106.7\n million and $\n54.3\n million in Other Non Current Liabilities\n in the Consolidated Balance Sheets as of December 31, 2024 and 2023, respectively, expenditures for these known conditions currently are not expected, individually or in the aggregate, to have a material effect on our business or financial condition. However, material expenditures could be required in the future to remediate the contamination at known sites or at other current or former sites or as a result of other environmental, health and safety matters. Below is a discussion of certain environmental matters.\nNew Wales Phase II East Stack. \nIn April 2022 we confirmed the presence of a cavity in and liner tear beneath the southern part of the active phosphogypsum stack at the Company’s New Wales facility in Florida. This resulted in process water draining beneath the stack. The circumstances were reported to the FDEP and the EPA. Phase I of the repairs, consisting of stabilizing \n \nthe cavity by depositing low pressure grout into it, began in July 2022 and now is complete. Phase II work, which consists of injecting high pressure grout beneath the stack to restore the geological confining layer beneath it, began in early in 2023 and the work is now complete. \nAs of December 31, 2024 we have a reserve of $\n14.7\n million, included in the above amount, for the estimated repairs. We are unable to estimate at this time potential future additional financial impacts or a range of loss, if any, due to the ongoing evaluation.\nNew Wales Phase II West Stack. \nIn October 2023 we observed a series of seismic acoustic emissions and changes to piezometric water levels in a part of the Phase II West phosphogypsum stack at the New Wales, Florida facility. These observations may be an indication of a breach in the stack liner system and were reported to the FDEP and EPA. We have begun repairs: stabilization grouting is now complete and high-pressure grouting began in October 2024. The area of the stack is not in use for either process water storage or additional gypsum placement. It lies within a zone of capture of a recovery groundwater well which is operating as intended. No offsite impacts are known or expected. \nAs of December 31, 2024 we have a reserve of $\n81.5\n million, included in the above established reserves, for estimated repairs. We are unable to estimate at this time potential future additional financial impacts or a range of loss, if any, due to the ongoing evaluation.  \nEPA RCRA Initiative. \nWe have certain financial assurance and other obligations under consent decrees and a separate financial assurance arrangement relating to our facilities in Florida and Louisiana. These obligations are discussed in Note 14 of our Notes to Consolidated Financial Statements.\nOther Environmental Matters. \nSuperfund and equivalent state statutes impose liability without regard to fault or to the legality of a party’s conduct on certain categories of persons who are considered to have contributed to the release of “hazardous substances” into the environment. Under Superfund, or its various state analogues, one party may, under certain circumstances, be required to bear more than its proportionate share of cleanup costs at a site where it has liability if payments cannot be obtained from other responsible parties. Currently, certain of our subsidiaries are involved or concluding involvement at several Superfund or equivalent state sites. Our remedial liability from these sites, alone or in the aggregate, currently is not expected to have a material effect on our business or financial condition. As more information is obtained regarding these sites and the potentially responsible parties involved, this expectation could change.\nWe believe that, pursuant to several indemnification agreements, our subsidiaries are entitled to at least partial, and in many instances complete, indemnification for the costs that may be expended by us or our subsidiaries to remedy environmental issues at certain facilities. These agreements address issues that resulted from activities occurring prior to our acquisition of facilities or businesses from parties including, but not limited to: ARCO (BP); Beatrice Fund for Environmental Liabilities; Conoco; Conserv; Estech, Inc.; Kaiser Aluminum & Chemical Corporation; Kerr-McGee Inc.; PPG Industries, Inc.; The Williams Companies; CF; and certain other private parties. Our subsidiaries have already received and anticipate receiving amounts pursuant to the indemnification agreements for certain of their expenses incurred to date as well as future anticipated expenditures. We record potential indemnifications as an offset to the established accruals when they are realizable or realized. The failure of an indemnitor to fulfill its obligations could result in future costs that could be material.\nF-  74\nBrazil Legal Contingencies\nOur Brazilian subsidiaries are engaged in a number of judicial and administrative proceedings regarding labor, environmental, mining and civil claims that allege aggregate damages and/or fines of approximately $\n559.2\n million. We estimate that our probable aggregate loss with respect to these claims is approximately $\n79.3\n million, which is included in our accrued liabilities in our Consolidated Balance Sheets at December 31, 2024. Approximately $\n377.1\n million of the maximum potential loss above relates to labor claims, of which approximately $\n62.0\n million is included in accrued liabilities in our Consolidated Balance Sheets at December 31, 2024.\nBased on Brazil legislation and the current status of similar labor cases involving unrelated companies, we believe we have recorded adequate loss contingency reserves sufficient to cover our estimate of probable losses. If the status of similar cases involving unrelated companies were to adversely change in the future, our maximum exposure could increase and additional accruals could be required.\nBrazil Tax Contingencies\nOur Brazilian subsidiaries are engaged in a number of judicial and administrative proceedings relating to various non-income tax matters. We estimate that our maximum potential liability with respect to these matters is approximately $\n601.8\n million, of which $\n204.0\n million is subject to an indemnification agreement entered into with Vale S.A in connection with an acquisition.\nApproximately $\n311.9\n million of the maximum potential liability relates to a Brazilian federal value added tax, PIS and COFINS, and tax credit cases, while the majority of the remaining amount relates to various other non-income tax cases. The maximum potential liability can increase with new audits from Brazilian tax authorities. Based on Brazil tax legislation and the current status of similar tax cases involving unrelated taxpayers, we believe we have recorded adequate loss contingency reserves sufficient to cover our estimate of probable losses, which are immaterial. If the status of similar tax cases involving unrelated taxpayer changes in the future, additional accruals could be required.\nOther Claims\nWe also have certain other contingent liabilities with respect to judicial, administrative and arbitration proceedings and claims of third parties, including tax matters, arising in the ordinary course of business. We do not believe that any of these contingent liabilities will have a material adverse impact on our business or financial condition, results of operations, and cash flows.\n24.  \nRELATED PARTY TRANSACTIONS\nWe enter into transactions and agreements with certain of our non-consolidated companies and other related parties from time to time. As of December 31, 2024 and 2023, we had amounts included in Accounts Receivable and Accounts Payable on our Consolidated Balances due to our non-consolidated companies of which the net amount totaled $\n46.5\n million and $\n0.8\n million, respectively. \nThe Consolidated Statements of Earnings included the following transactions with our non-consolidated companies:\n \nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nTransactions with non-consolidated companies included in net sales\n$\n931.0\n \n$\n1,321.0\n \n$\n3,015.3\n \nTransactions with non-consolidated companies included in cost of goods sold\n$\n1,082.7\n \n$\n1,465.2\n \n$\n3,245.2\n \nAs part of the MWSPC joint venture which was in place through December 24, 2024, we marketed approximately \n25\n% of the MWSPC production for which approximately $\n18.4\n million, $\n17.5\n million and $\n23.1\n million is included in revenue for the years ended December 31, 2024, 2023 and 2022, respectively.\n25.  \nBUSINESS SEGMENTS\nThe reportable segments are determined by management based upon factors such as products and services, production processes, technologies, market dynamics and for which segment financial information is available for our chief operating decision maker.  Our chief operating decision maker is our chief executive officer.\nF-  75\nFor a description of our business segments, see Note 1 of our Notes to Consolidated Financial Statements. The accounting policies of the segments are the same as those described in the summary of significant accounting policies.  We evaluate performance based on the gross margin and operating earnings of the respective business segments, which includes certain allocations of corporate selling, general and administrative expenses. The segment results may not represent the actual results that would be expected if they were independent, stand-alone businesses. Intersegment eliminations, including profit on intersegment sales, mark-to-market gains/losses on derivatives, debt expenses and the results of the China and India distribution business are included within Corporate, Eliminations and Other. Certain selling, general and administrative costs that are not controllable by the business segments are included within Corporate, Eliminations and Other.\nFor the Phosphates, Potash and Mosaic Fertilizantes segments, the chief operating decision maker uses both segment gross margin and operating earnings to allocate resources to each segment, predominantly in the annual budget and forecasting process. The chief operating decision maker considers forecast-to-actual variances on a monthly basis for both profit measures when making decisions about allocating capital and personnel to the segments. The chief operating decision maker also uses segment gross margin for evaluating product pricing and segment profit or loss from operations to assess the performance for each segment by comparing the results and return on assets of each segment with one another. \nSegment information for the years 2024, 2023 and 2022 is as follows:\n(in millions)\nPhosphates\nPotash\nMosaic Fertilizantes\nCorporate,\nEliminations\nand Other\n (a)\nTotal\nYear Ended December 31, 2024\nNet sales to external customers\n$\n3,793.3\n \n$\n2,371.0\n \n$\n4,422.3\n \n$\n536.2\n \n$\n11,122.8\n \nIntersegment net sales\n725.5\n \n17.7\n \n—\n \n(\n743.2\n)\n—\n \nNet sales\n4,518.8\n \n2,388.7\n \n4,422.3\n \n(\n207.0\n)\n11,122.8\n \nCost of goods sold\n(b)\n3,924.8\n \n1,745.5\n \n4,015.7\n \n(\n75.1\n)\n9,610.9\n \nGross margin\n594.0\n \n643.2\n \n406.6\n \n(\n131.9\n)\n1,511.9\n \nCanadian resource taxes\n—\n \n232.2\n \n—\n \n—\n \n232.2\n \nGross margin (excluding Canadian resource taxes)\n594.0\n \n875.4\n \n406.6\n \n(\n131.9\n)\n1,744.1\n \nSelling, general and administrative\n(c)\n45.3\n \n31.1\n \n134.7\n \n285.8\n \n496.9\n \nOther operating expenses\n(d)\n323.7\n \n7.7\n \n34.2\n \n27.9\n \n393.5\n \nOperating earnings \n225.1\n \n604.5\n \n237.6\n \n(\n445.7\n)\n621.5\n \nGain on sale of equity method investment\n522.2\n \n—\n \n—\n \n—\n \n522.2\n \nCapital expenditures\n660.7\n \n297.5\n \n242.8\n \n50.8\n \n1,251.8\n \nDepreciation, depletion and amortization expense\n505.6\n \n336.5\n \n159.3\n \n24.1\n \n1,025.5\n \nEquity in net earnings of nonconsolidated companies\n70.9\n \n—\n \n—\n \n2.4\n \n73.3\n \nYear Ended December 31, 2023\nNet sales to external customers\n$\n3,894.5\n \n$\n3,203.1\n \n$\n5,684.7\n \n$\n913.8\n \n$\n13,696.1\n \nIntersegment net sales\n829.8\n \n30.5\n \n—\n \n(\n860.3\n)\n—\n \nNet sales\n4,724.3\n \n3,233.6\n \n5,684.7\n \n53.5\n \n13,696.1\n \nCost of goods sold\n(b)\n4,022.2\n \n2,018.6\n \n5,473.1\n \n(\n28.4\n)\n11,485.5\n \nGross margin\n702.1\n \n1,215.0\n \n211.6\n \n81.9\n \n2,210.6\n \nCanadian resource taxes\n—\n \n403.4\n \n—\n \n—\n \n403.4\n \nGross margin (excluding Canadian resource taxes)\n702.1\n \n1,618.4\n \n211.6\n \n81.9\n \n2,614.0\n \nSelling, general and administrative\n(c)\n42.0\n \n30.0\n \n110.1\n \n318.4\n \n500.5\n \nOther operating expenses\n(d)\n284.3\n \n33.5\n \n27.0\n \n27.2\n \n372.0\n \nOperating earnings\n375.7\n \n1,151.5\n \n74.5\n \n(\n263.6\n)\n1,338.1\n \nCapital expenditures\n625.9\n \n357.4\n \n336.3\n \n82.8\n \n1,402.4\n \nDepreciation, depletion and amortization expense\n485.7\n \n299.0\n \n165.5\n \n10.4\n \n960.6\n \nEquity in net earnings of nonconsolidated companies\n56.4\n \n—\n \n—\n \n3.9\n \n60.3\n \nYear Ended December 31, 2022\nF-  76\nNet sales to external customers\n$\n4,546.4\n \n$\n5,122.8\n \n$\n8,287.2\n \n$\n1,168.8\n \n$\n19,125.2\n \nIntersegment net sales\n1,637.8\n \n85.7\n \n—\n \n(\n1,723.5\n)\n—\n \nNet sales\n6,184.2\n \n5,208.5\n \n8,287.2\n \n(\n554.7\n)\n19,125.2\n \nCost of goods sold\n(b)\n4,425.2\n \n2,365.5\n \n7,241.6\n \n(\n662.9\n)\n13,369.4\n \nGross margin\n1,759.0\n \n2,843.0\n \n1,045.6\n \n108.2\n \n5,755.8\n \nCanadian resource taxes\n—\n \n927.9\n \n—\n \n—\n \n927.9\n \nGross margin (excluding Canadian resource taxes)\n1,759.0\n \n3,770.9\n \n1,045.6\n \n108.2\n \n6,683.7\n \nSelling, general and administrative\n(c)\n40.7\n \n30.3\n \n101.9\n \n325.1\n \n498.0\n \nOther operating expenses\n(d)\n371.1\n \n45.1\n \n33.3\n \n23.0\n \n472.5\n \nOperating earnings\n1,347.2\n \n2,767.7\n \n910.4\n \n(\n240.0\n)\n4,785.3\n \nCapital expenditures\n631.8\n \n281.6\n \n306.4\n \n27.5\n \n1,247.3\n \nDepreciation, depletion and amortization expense\n485.1\n \n307.3\n \n125.5\n \n16.0\n \n933.9\n \nEquity in net earnings of nonconsolidated companies\n192.4\n \n—\n \n—\n \n3.6\n \n196.0\n \nTotal assets as of December 31, 2024\n$\n12,806.2\n \n$\n7,762.8\n \n$\n4,266.9\n \n$\n(\n1,911.9\n)\n$\n22,924.0\n \nTotal assets as of December 31, 2023\n10,295.9\n \n8,971.9\n \n5,256.3\n \n(\n1,491.3\n)\n23,032.8\n \nTotal assets as of December 31, 2022\n9,570.5\n \n9,582.2\n \n5,562.7\n \n(\n1,329.4\n)\n23,386.0\n \n______________________________\n(a)\nThe “Corporate, Eliminations and Other” category includes the results of our ancillary distribution operations in India and China. For the years ended December 31, 2024, 2023 and 2022, distribution operations in India and China had revenues of $\n519.6\n million, $\n898.9\n million and $\n1.1\n billion, respectively, and gross margins of $\n39.7\n million, $(\n16.8\n) million and $\n130.9\n million, respectively.  These operations do not meet the quantitative thresholds for determining reportable segments.\n(b)\nThe primary components of cost of goods sold are raw material purchases, including sulfur and ammonia, conversion costs and transportation costs. \n(c)\nSelling, general and administrative expenses include nonmanufacturing payroll expense and professional services expense.\n(d)\nOther operating expenses typically relate to five major categories: (1) AROs, (2) environmental and legal reserves, (3) idle facility costs, (4) insurance reimbursements, and (5) gain/loss on sale or disposal of fixed assets\n.\n \nF-  77\nFinancial information relating to our operations by geographic area is as follows:\nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet sales\n(a)\n:\nBrazil\n$\n4,296.2\n \n$\n5,480.9\n \n$\n8,045.5\n \nCanpotex\n(b)\n884.3\n \n1,275.7\n \n2,961.6\n \nChina\n536.9\n \n556.1\n \n648.2\n \nCanada\n520.1\n \n411.6\n \n966.0\n \nParaguay\n178.5\n \n222.8\n \n227.1\n \nArgentina\n141.8\n \n75.2\n \n224.6\n \nJapan\n130.8\n \n157.7\n \n162.0\n \nColombia\n118.7\n \n103.2\n \n125.9\n \nIndia\n72.8\n \n350.8\n \n512.5\n \nAustralia\n57.9\n \n69.0\n \n101.6\n \nPeru\n49.2\n \n77.5\n \n70.2\n \nMexico\n42.2\n \n125.5\n \n165.5\n \nHonduras\n25.7\n \n30.0\n \n31.2\n \nDominican Republic\n14.7\n \n16.7\n \n34.1\n \nThailand\n6.0\n \n8.4\n \n6.3\n \nOther\n76.3\n \n55.9\n \n100.8\n \nTotal international countries\n7,152.1\n \n9,017.0\n \n14,383.1\n \nUnited States\n3,970.7\n \n4,679.1\n \n4,742.1\n \nConsolidated\n$\n11,122.8\n \n$\n13,696.1\n \n$\n19,125.2\n \n______________________________\n(a)\nRevenues are attributed to countries based on location of customer.\n(b)\nCanpotex sales to the ultimate third-party customers are made to customers in various countries. The countries with the largest portion of third-party customer sales are Brazil, China, India, and Indonesia.\nDecember 31,\n(in millions)\n2024\n2023\nLong-lived assets:\nCanada\n$\n5,390.5\n \n$\n4,876.1\n \nBrazil\n2,012.8\n \n2,467.8\n \nOther\n545.8\n \n1,521.3\n \nTotal international countries\n7,949.1\n \n8,865.2\n \nUnited States\n8,457.2\n \n7,204.8\n \nConsolidated\n$\n16,406.3\n \n$\n16,070.0\n \nExcluded from the table above as of December 31, 2024 and 2023, are goodwill of $\n1,061.1\n million and $\n1,138.6\n million and deferred income tax assets of $\n958.3\n million and $\n1,079.2\n million, respectively.\nF-  78\nNet sales by product type for the years 2024, 2023 and 2022 are as follows:\nYears Ended December 31,\n(in millions)\n2024\n2023\n2022\nSales by product type:\nPhosphate Crop Nutrients\n$\n2,978.7\n \n$\n3,277.5\n \n$\n4,465.0\n \nPotash Crop Nutrients\n2,808.6\n \n4,107.7\n \n6,484.1\n \nCrop Nutrient Blends\n1,253.4\n \n2,107.4\n \n2,970.0\n \nPerformance Products\n(a)\n2,264.2\n \n2,453.3\n \n3,025.8\n \nPhosphate Rock\n217.2\n \n125.9\n \n125.9\n \nOther\n(b) \n1,600.7\n \n1,624.3\n \n2,054.4\n \n$\n11,122.8\n \n$\n13,696.1\n \n$\n19,125.2\n \n______________________________\n(a)\nIncludes sales of MicroEssentials\n®\n, K-Mag\n®\n and Aspire\n®\n.\n(b)\nIncludes sales of industrial potash, feed products, nitrogen and other products.\nF-  79\nManagement’s Report on Internal Control Over Financial Reporting\nThe Company’s management is responsible for establishing and maintaining effective internal control over financial reporting, as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934. The Company’s internal control system is a process designed to provide reasonable assurance to our management, Board of Directors and stockholders regarding the reliability of financial reporting and the preparation and fair presentation of our consolidated financial statements for external reporting purposes in accordance with U.S. GAAP and includes those policies and procedures that:\n•\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n•\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in conformity with U.S. GAAP, and that receipts and expenditures are being made only in accordance with authorizations from our management and Board of Directors; and\n•\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In assessing the effectiveness of our internal control over financial reporting as of December 31, 2024 management used the control criteria framework of the Committee of Sponsoring Organizations (COSO) of the Treadway Commission published in its report entitled \nInternal Control—Integrated Framework (2013). \nBased on their evaluation, management concluded that the Company’s internal control over financial reporting was effective as of December 31, 2024. KPMG LLP, the independent registered public accounting firm that audited the financial statements included in this Form 10-K, has issued an auditors' report on the Company’s internal control over financial reporting as of December 31, 2024.\nF-  80"
  }
}