{
  "ticker": "MPC",
  "cik": "0001510295",
  "company_name": "Marathon Petroleum Corp",
  "filing_date": "2025-02-27",
  "accession": "0001510295-25-000012",
  "primary_doc": "mpc-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business,",
    "item1a": "Item 1A. Risk Factors.\n67\nT\nable\n of Contents\nCRITICAL ACCOUNTING ESTIMATES \nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the respective reporting periods. Accounting estimates are considered to be critical if (1) the nature of the estimates and assumptions is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change; and (2) the impact of the estimates and assumptions on financial condition or operating performance is material. Actual results could differ from the estimates and assumptions used. See Item 8. Financial Statements and Supplementary Data – Note 2 for additional information on these policies and estimates, as well as a discussion of additional accounting policies and estimates.\nFair Value Estimates\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. There are three approaches for measuring the fair value of assets and liabilities: the market approach, the income approach and the cost approach, each of which includes multiple valuation techniques. The market approach uses prices and other relevant information generated by market transactions involving identical or comparable assets or liabilities. The income approach uses valuation techniques to measure fair value by converting future amounts, such as cash flows or earnings, into a single present value amount using current market expectations about those future amounts. The cost approach is based on the amount that would currently be required to replace the service capacity of an asset. This is often referred to as current replacement cost. The cost approach assumes that the fair value would not exceed what it would cost a market participant to acquire or construct a substitute asset of comparable utility, adjusted for obsolescence.\nThe fair value accounting standards do not prescribe which valuation technique should be used when measuring fair value and do not prioritize among the techniques. These standards establish a fair value hierarchy that prioritizes the inputs used in applying the various valuation techniques. Inputs broadly refer to the assumptions that market participants use to make pricing decisions, including assumptions about risk. Level 1 inputs are given the highest priority in the fair value hierarchy while Level 3 inputs are given the lowest priority. The three levels of the fair value hierarchy are as follows:\n•\nLevel 1 – Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities in active markets as of the measurement date. Active markets are those in which transactions for the asset or liability occur in sufficient frequency and volume to provide pricing information on an ongoing basis.\n•\nLevel 2 – Observable market-based inputs or unobservable inputs that are corroborated by market data. These are inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the measurement date.\n•\nLevel 3 – Unobservable inputs that are not corroborated by market data and may be used with internally developed methodologies that result in management’s best estimate of fair value.\nValuation techniques that maximize the use of observable inputs are favored. Assets and liabilities are classified in their entirety based on the lowest priority level of input that is significant to the fair value measurement. The assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the placement of assets and liabilities within the levels of the fair value hierarchy. We use an income or market approach for recurring fair value measurements and endeavor to use the best information available. See Item 8. Financial Statements and Supplementary Data – Note 17 for disclosures regarding our fair value measurements.\nSignificant uses of fair value measurements include:\n•\nassessment of impairment of long-lived assets, intangible assets, goodwill and equity method investments;\n•\nrecorded values for assets acquired and liabilities assumed in connection with acquisitions; and\n•\nrecorded values of derivative instruments.\nImpairment Assessments of Long-Lived Assets, Intangible Assets, Goodwill and Equity Method Investments\nFair value calculated for the purpose of testing our long-lived assets, intangible assets, goodwill and equity method investments for impairment is estimated using the expected present value of future cash flows method and comparative market prices when appropriate. Significant judgment is involved in performing these fair value estimates since the results are based on forecasted financial information prepared using significant assumptions including:\n•\nFuture operating performance\n. Our estimates of future operating performance are based on our analysis of various supply and demand factors, which include, among other things, industry-wide capacity, our planned utilization rate, end-user demand, capital expenditures and economic conditions, as well as commodity prices. Such estimates are consistent with those used in our planning and capital investment reviews.\n•\nFuture volumes.\n Our estimates of future refinery, pipeline throughput and natural gas and natural gas liquid processing volumes are based on internal forecasts prepared by our Refining & Marketing and Midstream segments operations personnel. Assumptions about our customers’ drilling activity are inherently subjective and contingent upon a number of variable factors (including future or expected crude oil and natural gas pricing considerations), many of which are \n68\nT\nable\n of Contents\ndifficult to forecast. Management considers these volume forecasts and other factors when developing our forecasted cash flows. \n•\nDiscount rate commensurate with the risks involved\n. We apply a discount rate to our cash flows based on a variety of factors, including market and economic conditions, operational risk, regulatory risk and political risk. This discount rate is also compared to recent observable market transactions, if possible. A higher discount rate decreases the net present value of cash flows.\n•\nFuture capital requirements\n. These are based on authorized spending and internal forecasts.\nAssumptions about the macroeconomic environment are inherently subjective and difficult to forecast. We base our fair value estimates on projected financial information which we believe to be reasonable. However, actual results may differ from these projections.\nThe need to test for impairment can be based on several indicators, including a significant reduction in prices of or demand for products produced, a weakened outlook for profitability, a significant reduction in pipeline throughput volumes, a significant reduction in natural gas or natural gas liquids processed, a significant reduction in refining margins, other changes to contracts or changes in the regulatory environment. The following sections detail our critical accounting estimates related to impairment assessments for long-lived assets, goodwill and equity method investments.\nLong-lived Asset Impairment Assessments\nLong-lived assets used in operations are assessed for impairment whenever changes in facts and circumstances indicate that the carrying value of the assets may not be recoverable based on the expected undiscounted future cash flow of an asset group. For purposes of impairment evaluation, long-lived assets must be grouped at the lowest level for which independent cash flows can be identified, which generally is the refinery and associated distribution system level for Refining & Marketing segment assets, and the plant level or pipeline system level for Midstream segment assets. If the sum of the undiscounted estimated pretax cash flows is less than the carrying value of an asset group, fair value is calculated, and the carrying value is written down to the calculated fair value. \nGoodwill Impairment Assessments\nUnlike long-lived assets, goodwill is subject to annual, or more frequent if necessary, impairment testing at the reporting unit level. A goodwill impairment loss is measured as the amount by which a reporting unit's carrying value exceeds its fair value, without exceeding the recorded amount of goodwill.\nAt December 31, 2024, MPC had four reporting units with goodwill totaling approximately $8.24 billion. The majority of this balance is comprised of the Midstream reporting units, including $1.1 billion for the MPLX Crude Gathering reporting unit and $6.6 billion for the MPLX Transportation & Storage reporting unit. For the annual impairment assessment as of November 30, 2024, management performed only a qualitative assessment for three reporting units as we determined it was more likely than not that the fair value of the reporting units exceeded the carrying value. Significant assumptions used to estimate the reporting units’ fair value under a qualitative approach included estimates of future cash flows and market information for comparable assets. A quantitative assessment was performed for the MPLX Crude Gathering reporting unit, which resulted in the fair value of the reporting unit exceeding its carrying value by greater than 10 percent. The fair value of the reporting unit was determined based on applying both a discounted cash flow method (i.e., income approach) as well as a market approach. An increase of one percentage point to the discount rate used to estimate the fair value of the reporting unit would not have resulted in a goodwill impairment charge as of November 30, 2024. Significant assumptions that were used to estimate the Crude Gathering reporting unit’s fair values under the discounted cash flow method included management’s best estimates of the discount rate, as well as estimates of future cash flows, which are impacted primarily by producers’ development plans, which impact the reporting unit’s future volumes and capital requirements. If estimates for future cash flows were to decline, the overall reporting units’ fair values would decrease, resulting in potential goodwill impairment charges. \nFair value determinations require considerable judgment and are sensitive to changes in underlying assumptions and factors. As a result, there can be no assurance that the estimates and assumptions made for purposes of the impairment tests will prove to be an accurate prediction of the future.\nEquity Method Investment Impairment Assessment\nEquity method investments are assessed for impairment whenever factors indicate an other than temporary loss in value. Factors providing evidence of such a loss include the fair value of an investment that is less than its carrying value, absence of an ability to recover the carrying value or the investee’s inability to generate income sufficient to justify our carrying value. At December 31, 2024, we had $6.86 billion of investments in equity method investments recorded on our consolidated balance sheet. \nSee Item 8. Financial Statements and Supplementary Data – Note 14 for additional information on our equity method investments. See Item 8. Financial Statements and Supplementary Data – Note 16 for additional information on our goodwill and intangibles, including a table summarizing our recorded goodwill by segment. \n69\nT\nable\n of Contents\nDerivatives\nWe record all derivative instruments at fair value. Substantially all of our commodity derivatives are cleared through exchanges which provide active trading information for identical derivatives and do not require any assumptions in arriving at fair value. Fair value estimation for all our derivative instruments is discussed in Item 8. Financial Statements and Supplementary Data – Note 17. Additional information about derivatives and their valuation may be found in Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nVariable Interest Entities\nWe evaluate all legal entities in which we hold an ownership or other pecuniary interest to determine if the entity is a VIE. Our interests in a VIE are referred to as variable interests. Variable interests can be contractual, ownership or other pecuniary interests in an entity that change with changes in the fair value of the VIE’s assets. When we conclude that we hold an interest in a VIE we must determine if we are the entity’s primary beneficiary. A primary beneficiary is deemed to have a controlling financial interest in a VIE. This controlling financial interest is evidenced by both (a) the power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and (b) the obligation to absorb losses that could potentially be significant to the VIE or the right to receive benefits that could potentially be significant to the VIE. We consolidate any VIE when we determine that we are the primary beneficiary. We must disclose the nature of any interests in a VIE that is not consolidated. \nSignificant judgment is exercised in determining that a legal entity is a VIE and in evaluating our interest in a VIE. We use primarily a qualitative analysis to determine if an entity is a VIE. We evaluate the entity’s need for continuing financial support; the equity holder’s lack of a controlling financial interest; and/or if an equity holder’s voting interests are disproportionate to its obligation to absorb expected losses or receive residual returns. We evaluate our interests in a VIE to determine whether we are the primary beneficiary. We use a primarily qualitative analysis to determine if we are deemed to have a controlling financial interest in the VIE, either on a standalone basis or as part of a related party group. We continually monitor our interests in legal entities for changes in the design or activities of an entity and changes in our interests, including our status as the primary beneficiary to determine if the changes require us to revise our previous conclusions. \nChanges in the design or nature of the activities of a VIE, or our involvement with a VIE, may require us to reconsider our conclusions on the entity’s status as a VIE and/or our status as the primary beneficiary. Such reconsideration requires significant judgment and understanding of the organization. This could result in the deconsolidation or consolidation of the affected subsidiary, which would have a significant impact on our financial statements. \nVariable Interest Entities are discussed in Item 8. Financial Statements and Supplementary Data – Note 6.\nPension and Other Postretirement Benefit Obligations\nAccounting for pension and other postretirement benefit obligations involves numerous assumptions, the most significant of which relate to the following:\n•\nthe discount rate for measuring the present value of future plan obligations;\n•\nthe expected long-term return on plan assets;\n•\nthe rate of future increases in compensation levels; \n•\nhealth care cost projections; and\n•\nthe mortality table used in determining future plan obligations.\nWe utilize the work of third-party actuaries to assist in the measurement of these obligations. We have selected different discount rates for each of our pension plans and retiree health and welfare based on the projected benefit payment patterns of each individual plan. The selected rates are compared to various similar bond indexes for reasonableness. In determining the assumed discount rates, we use our third-party actuaries’ discount rate models. These models calculate an equivalent single discount rate for the projected benefit plan cash flows using yield curves derived from Aa or higher corporate bond yields. The yield curves represent a series of annualized individual spot discount rates from 0.5 to 99 years. The bonds used have an average rating of Aa or higher from a recognized rating agency and generally only non-callable bonds are included. Outlier bonds that have a yield to maturity that deviate significantly from the average yield within each maturity grouping are not included. Each issue is required to have at least $300 million par value outstanding.\nOf the assumptions used to measure the year-end obligations and estimated annual net periodic benefit cost, the discount rate has the most significant effect on the periodic benefit cost reported for the plans. Decreasing the discount rates of 5.65 percent for our pension plans and 5.50 percent for our other postretirement benefit plans by 0.25 percent would increase pension obligations and other postretirement benefit plan obligations by $73 million and $16 million, respectively, and would increase defined benefit pension expense and other postretirement benefit plan expense by $10 million and less than $1 million, respectively.\nThe long-term asset rate of return assumption considers the asset mix of the plans (currently targeted at approximately 50 percent equity securities and 50 percent fixed income securities for the primary funded pension plan), past performance and other factors. Certain components of the asset mix are modeled with various assumptions regarding inflation and returns. In addition, our long-term asset rate of return assumption is compared to those of other companies and to historical returns for \n70\nT\nable\n of Contents\nreasonableness. We used the 6.80 percent long-term rate of return to determine our 2024 defined benefit pension expense. After evaluating activity in the capital markets, along with the current and projected plan investments, we increased the asset rate of return for our primary plan to 7.10 percent effective for 2025. Decreasing the 7.10 percent asset rate of return assumption by 0.25 percentage points would increase our defined benefit pension expense by $5 million.\nCompensation change assumptions are based on historical experience, anticipated future management actions and demographics of the benefit plans.\nHealth care cost trend assumptions are developed based on historical cost data, the near-term outlook and an assessment of likely long-term trends.\nWe utilized the 2021 mortality tables from the U.S. Society of Actuaries.\nItem 8. Financial Statements and Supplementary Data – Note 24 includes detailed information about the assumptions used to calculate the components of our annual defined benefit pension and other postretirement plan expense, as well as the obligations and accumulated other comprehensive loss reported on the year-end balance sheets.\nACCOUNTING STANDARDS NOT YET ADOPTED\nRefer to Item 8. Financial Statements and Supplementary Data – Note 3 to our audited consolidated financial statements for recently issued financial accounting pronouncements.\nItem 7A. Quantitative and Qualitative Disclosures about Market Risk\nGENERAL\nWe are exposed to market risks related to the volatility of crude oil and refined petroleum products, ethanol, renewable feedstock, renewable products, NGLs, and natural gas prices. We employ various strategies, including the use of commodity derivative instruments, to hedge the risks related to these price fluctuations. We are also exposed to market risks related to changes in interest rates and foreign currency exchange rates. As of December 31, 2024, we did not have any financial derivative instruments to hedge the risks related to interest rate or foreign currency exchange rate fluctuations; however, we have used them in the past, and we continually monitor the market and our exposure and may enter into these agreements again in the future. We are at risk for changes in fair value of all of our derivative instruments; however, such risk should be mitigated by price or rate changes related to the underlying commodity or financial transaction.\nWe believe that our use of derivative instruments, along with our risk assessment procedures and internal controls, does not expose us to material adverse consequences. While the use of derivative instruments could materially affect our results of operations in particular quarterly or annual periods, we believe that the use of these instruments will not have a material adverse effect on our financial position or liquidity.\nSee Item 8. Financial Statements and Supplementary Data – Notes 17 and 18 for more information about the fair value measurement of our derivatives, as well as the amounts recorded in our consolidated balance sheets and statements of income. We do not designate any of our commodity derivative instruments as hedges for accounting purposes.\nCommodity Price Risk\nRefining & Marketing\nOur strategy is to obtain competitive prices for our products and allow operating results to reflect market price movements dictated by supply and demand. We use a variety of commodity derivative instruments, including futures, swaps and options, as part of an overall program to hedge commodity price risk. We also do a limited amount of trading not directly related to our physical transactions. \nWe use derivative instruments related to the acquisition of crude oil and ethanol blended with refined petroleum products to hedge price risk associated with market volatility between the time we purchase the product and when we use it in the refinery production process or it is blended. In addition, we may use commodity derivative instruments on fixed price contracts for the sale of refined products to hedge risk by converting the refined product sales to market-based prices. The majority of these derivatives are exchange-traded contracts, but we may also enter into over-the-counter swaps, options and over-the-counter options. We closely monitor and hedge our exposure to market risk on a daily basis in accordance with policies approved by our board of directors. Our positions are monitored daily by a risk control group to ensure compliance with our stated risk management policy.\n71\nT\nable\n of Contents\nMidstream\nNGL and natural gas prices are volatile and are impacted by changes in fundamental supply and demand, as well as market uncertainty, availability of NGL transportation and fractionation capacity and a variety of additional factors that are beyond MPLX’s control. MPLX may at times use a variety of commodity derivative instruments, including futures and options, as part of an overall program to economically hedge commodity price risk. A portion of MPLX’s profitability is directly affected by prevailing commodity prices primarily as a result of purchasing and selling NGLs and natural gas at index-related prices. To the extent that commodity prices influence the level of drilling by MPLX producer customers, such prices also indirectly affect profitability. MPLX may enter into derivative contracts, which are primarily swaps traded on the OTC market as well as fixed price forward contracts. MPLX’s risk management policy does not allow it to enter into speculative positions with its derivative contracts. Execution of MPLX’s hedge strategy and the continuous monitoring of commodity markets and its open derivative positions are carried out by its hedge committee, comprised of members of senior management.\nTo mitigate MPLX’s cash flow exposure to fluctuations in the price of NGLs, it may use NGL derivative swap contracts. A small portion of its NGL price exposure may be managed by using crude oil contracts. To mitigate MPLX’s cash flow exposure to fluctuations in the price of natural gas, it may use natural gas derivative swap contracts, taking into account the partial offset of its long and short natural gas positions resulting from normal operating activities.\nMPLX would be exposed to additional commodity risk in certain situations such as if producers under‑deliver or over‑deliver products or if processing facilities are operated in different recovery modes. In the event that MPLX has derivative positions in excess of the product delivered or expected to be delivered, the excess derivative positions may be terminated. \nMPLX management conducts a standard credit review on counterparties to derivative contracts, and it has provided the counterparties with a guaranty as credit support for its obligations if requested. MPLX uses standardized agreements that allow for offset of certain positive and negative exposures in the event of default or other terminating events, including bankruptcy.\nRenewable Diesel\nMPC is exposed to commodity price risk related to the acquisition of renewable feedstocks and the sale of renewable diesel. To manage these risks, we employ hedging strategies in accordance with our objectives and company policies. We are subject to price volatility mainly in agricultural commodities markets in relation to renewable feedstock used in the production of renewable diesel. To mitigate this risk, we use futures contracts traded on commodity exchanges as hedging instruments. We are also exposed to market volatility between the time the renewable product is produced and when it is sold. We employ hedging strategies with exchange traded instruments in commodity markets to minimize the impact of price volatility during this time.\nWhile these hedging activities are intended to reduce price volatility, they do not completely eliminate commodity price risk. We continually monitor commodity price exposures and adjust our hedging as necessary to align with market conditions, regulatory requirements, internal price risk management policies, and overall business objectives.\nOpen Derivative Positions and Sensitivity Analysis\nThe following table includes the composition of net losses/gains on our commodity derivative positions for the years ended December 31, 2024 and 2023, respectively.\n(Millions of dollars)\n2024\n2023\nRealized gain (loss) on settled derivative positions\n$\n(94)\n$\n8 \nUnrealized gain (loss) on open net derivative positions\n3 \n(14)\nNet loss\n$\n(91)\n$\n(6)\nSee Item 8. Financial Statements and Supplementary Data – Note 18 for additional information on our open derivative positions at December 31, 2024.\nSensitivity analysis of the incremental effects on income from operations (“IFO”) of hypothetical 10 percent and 25 percent increases and decreases in commodity prices for open commodity derivative instruments as of December 31, 2024 is provided in the following table.\n72\nT\nable\n of Contents\n \nChange in IFO from a\nHypothetical Price\nIncrease of\nChange in IFO from a\nHypothetical Price\nDecrease of\n(Millions of dollars)\n10%\n25%\n10%\n25%\nAs of December 31, 2024\nCrude\n$\n22 \n$\n54 \n$\n(22)\n$\n(54)\nRefined products\n(29)\n(72)\n29 \n72 \nBlending products\n(2)\n(5)\n2 \n5 \nSoybean oil\n(8)\n(19)\n8 \n19 \nWe remain at risk for possible changes in the market value of commodity derivative instruments; however, such risk should be mitigated by price changes in the underlying physical commodity. Effects of these offsets are not reflected in the above sensitivity analysis.\nWe evaluate our portfolio of commodity derivative instruments on an ongoing basis and add or revise strategies in anticipation of changes in market conditions and in risk profiles. Changes to the portfolio after December 31, 2024 would cause future IFO effects to differ from those presented above.\nInterest Rate Risk\nOur use of fixed or variable-rate debt directly exposes us to interest rate risk. Fixed rate debt, such as our senior notes, exposes us to changes in the fair value of our debt due to changes in market interest rates. Fixed rate debt also exposes us to the risk that we may need to refinance maturing debt with new debt at higher rates or that our current fixed rate debt may be higher than the current market. Variable-rate debt, such as borrowings under our revolving credit facilities, exposes us to short-term changes in market rates that impact our interest expense. See Item 8. Financial Statements and Supplementary Data – Note 19 for additional information on our debt.\nSensitivity analysis of the effect of a hypothetical 100-basis-point change in interest rates on long-term debt, including the portion classified as current and excluding finance leases, as of December 31, 2024 is provided in the following table. The fair value of cash and cash equivalents, receivables, accounts payable and accrued interest approximate carrying value and, in addition to short-term investments which are recorded at fair value, are relatively insensitive to changes in interest rates due to the short-term maturity of the instruments. Accordingly, these instruments are excluded from the table.\n(Millions of dollars)\nFair\nValue\n(a)\nChange in\nFair Value\n(b)\nChange in Net Income for the Year ended December 31, 2024\n(c)\nLong-term debt\nFixed-rate\n$\n25,133 \n$\n1,885 \nn/a\nVariable-rate\n$\n— \n$\n— \n$\n— \n(a)    \nFair value was based on market prices, where available, or current borrowing rates for financings with similar terms and maturities.\n(b)    \nAssumes a 100-basis point decrease in the weighted average yield-to-maturity at December 31, 2024.\n(c)    \nAssumes a 100-basis-point change in interest rates. The change in net income was based on the weighted average balance of debt outstanding for the year ended December 31, 2024.\nSee Item 8. Financial Statements and Supplementary Data – Note 17 for additional information on the fair value of our debt.\nForeign Currency Exchange Rate Risk\n \nWe are exposed to exchange rate fluctuations related to our foreign operations in Canada and Mexico. We did not use derivatives to hedge our market risk exposure to these foreign exchange rate fluctuations in 2024. \nCounterparty Risk \nMPLX is subject to risk of loss resulting from nonpayment by its customers to whom it provides services, leases assets, or sells natural gas or NGLs. MPLX believes that certain contracts where it sells NGLs and acts as its producer customers’ agent would allow it to pass those losses through to its customers, thus reducing its risk, when it is selling NGLs and acting as its producer customers’ agent. Its credit exposure related to these customers is represented by the value of its trade receivables or lease receivables. Where exposed to credit risk, MPLX analyzes the customer’s financial condition prior to entering into a transaction or agreement, establishes credit terms and monitors the appropriateness of these terms on an ongoing basis. In the event of a customer default, MPLX may sustain a loss and its cash receipts could be negatively impacted.\nWe are subject to risk of loss resulting from nonpayment or nonperformance by counterparties to our derivative contracts. Our credit exposure related to commodity derivative instruments is represented by the fair value of contracts with a net positive fair \n73\nT\nable\n of Contents\nvalue at the reporting date. Outstanding instruments expose us to credit loss in the event of nonperformance by the counterparties to the agreements. Should the creditworthiness of one or more of our counterparties decline, our ability to mitigate nonperformance risk is limited to a counterparty agreeing to either a voluntary termination and subsequent cash settlement or a novation of the derivative contract to a third party. In the event of a counterparty default, we may sustain a loss and our cash receipts could be negatively impacted. \n74\nT\nable\n of Contents\nItem 8. Financial Statements and Supplementary Data\nINDEX\n \nPage\nManagement’s Responsibilities for Financial Statements\n76\nManagement’s Report on Internal Control over Financial Reporting\n76\nReport of Independent Registered Public Accounting Firm\n(PCAOB ID \n238\n)\n77\nAudited Consolidated Financial Statements:\nConsolidated Statements of Income\n79\nConsolidated Statements of Comprehensive Income\n80\nConsolidated Balance Sheets\n81\nConsolidated Statements of Cash Flows\n82\nConsolidated Statements of Equity and Redeemable Noncontrolling Interest\n84\nNotes to Consolidated Financial Statements\n85\n  1. Description of Business and Basis of Presentation\n85\n  2. Summary of Principal Accounting Policies\n85\n  3. Accounting Standards and Disclosure Rules\n90\n  4. Short-Term Investments\n91\n  5. Master Limited Partnership\n91\n  6. Variable Interest Entities\n92\n  7. Related Party Transactions\n93\n  8. Earnings Per Share\n93\n  9. Equity\n94\n10. Segment Information\n95\n11. Net Interest and Other Financial Costs\n98\n12. Income Taxes\n99\n13. Inventories\n101\n14. Equity Method Investments\n101\n15. Property, Plant and Equipment (PP&E)\n105\n16. Goodwill and Intangibles\n105\n17. Fair Value Measurements\n106\n18. Derivatives\n108\n19. Debt\n109\n20. Revenue\n113\n21. Supplemental Cash Flow Information\n114\n22. Other Current Liabilities\n114\n23. Accumulated Other Comprehensive Income (Loss)\n115\n24. Pension and Other Postretirement Benefits\n115\n25. Share-Based Compensation\n121\n26. Leases\n123\n27. Commitments and Contingencies\n126\n28. Subsequent Event\n128\nUnless otherwise stated or the context otherwise indicates, all references in this Annual Report on Form 10-K to “MPC,” “us,” “our,” “we” or the “Company” mean Marathon Petroleum Corporation and its consolidated subsidiaries.\n75\nT\nable\n of Contents\nManagement’s Responsibilities for Financial Statements\nThe accompanying consolidated financial statements of Marathon Petroleum Corporation and its subsidiaries (“MPC”) are the responsibility of management and have been prepared in conformity with accounting principles generally accepted in the United States of America. They necessarily include some amounts that are based on best judgments and estimates. The financial information displayed in other sections of this Annual Report on Form 10-K is consistent with these consolidated financial statements.\nMPC seeks to assure the objectivity and integrity of its financial records by careful selection of its managers, by organizational arrangements that provide an appropriate division of responsibility and by communications programs aimed at assuring that its policies and methods are understood throughout the organization.\nThe board of directors pursues its oversight role in the area of financial reporting and internal control over financial reporting through its Audit Committee. This committee, composed solely of independent directors, regularly meets (jointly and separately) with the independent registered public accounting firm, management and internal auditors to monitor the proper discharge by each of their responsibilities relative to internal accounting controls and the consolidated financial statements.\n \n/s/ Maryann T. Mannen\n/s/ John J. Quaid\n/s/ Erin M. Brzezinski\nMaryann T. Mannen\nPresident and Chief Executive Officer\nJohn J. Quaid\nExecutive Vice President and \nChief Financial Officer\nErin M. Brzezinski\nVice President and Controller\nManagement’s Report on Internal Control over Financial Reporting\nMPC’s management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934, as amended). An evaluation of the design and effectiveness of our internal control over financial reporting, based on the framework in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, was conducted under the supervision and with the participation of management, including our chief executive officer and chief financial officer. Based on the results of this evaluation, MPC’s management concluded that its internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of MPC’s internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which is included herein.\n/s/ Maryann T. Mannen\n/s/ John J. Quaid\nMaryann T. Mannen\nPresident and Chief Executive Officer\nJohn J. Quaid\nExecutive Vice President and \nChief Financial Officer\n76\nT\nable\n of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Marathon Petroleum Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Marathon Petroleum Corporation and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of equity and redeemable noncontrolling interest and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the COSO\n.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n77\nT\nable\n of Contents\nGoodwill Impairment Test - Crude Gathering Reporting Unit\nAs described in Note 16 to the consolidated financial statements and as disclosed by management, the Company’s consolidated goodwill balance was $8.2 billion as of December 31, 2024, which includes, within the Midstream segment, the goodwill associated with MPLX’s Crude Gathering reporting unit of $1.1 billion. Management annually evaluates goodwill for impairment as of November 30, as well as whenever events or changes in circumstances indicate it is more likely than not that the fair value of a reporting unit with goodwill is less than its carrying amount. The fair value of the MPLX Crude Gathering reporting unit was determined based on applying both a discounted cash flow method (i.e. income approach) as well as a market approach. Significant assumptions that were used to estimate the reporting unit’s fair value under the discounted cash flow method included management’s best estimates of the discount rate, as well as estimates of future cash flows, which are impacted primarily by producer development plans, which impact the reporting unit’s future volumes and capital requirements.\nThe principal considerations for our determination that performing procedures relating to the goodwill impairment test of the Crude Gathering reporting unit of the Midstream segment is a critical audit matter are (i) the significant judgment by management when determining the fair value of the reporting unit; and (ii) the high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence relating to management’s significant assumption related to future volumes.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s goodwill impairment test, including controls over the determination of the fair value of the Crude Gathering reporting unit. These procedures also included, among others (i) testing management’s process for determining the fair value of the reporting unit; (ii) evaluating the appropriateness of the income and market approaches used; (iii) testing the completeness and accuracy of underlying data used by management in the approaches; and (iv) evaluating the reasonableness of the significant assumption related to future volumes. Evaluating the assumption related to future volumes involved (i) considering whether the assumption used was reasonable considering past performance of the reporting unit, producers’ historical and future production volumes, and industry outlook reports; and (ii) considering whether the assumption was consistent with evidence obtained in other areas of the audit.\n/s/ \nPricewaterhouseCoopers LLP\nToledo, Ohio\n \nFebruary 27, 2025\nWe have served as the Company’s auditor since 2010.\n78\nT\nable\n of Contents\nMarathon Petroleum Corporation\nConsolidated Statements of Income\n \n(In millions, except per share data)\n2024\n2023\n2022\nRevenues and other income:\nSales and other operating revenues\n$\n138,864\n \n$\n148,379\n \n$\n177,453\n \nIncome from equity method investments\n1,048\n \n742\n \n655\n \nNet gain on disposal of assets\n28\n \n217\n \n1,061\n \nOther income\n472\n \n969\n \n783\n \nTotal revenues and other income\n140,412\n \n150,307\n \n179,952\n \nCosts and expenses:\nCost of revenues (excludes items below)\n126,240\n \n128,566\n \n151,671\n \nDepreciation and amortization\n3,337\n \n3,307\n \n3,215\n \nSelling, general and administrative expenses\n3,221\n \n3,039\n \n2,772\n \nOther taxes\n818\n \n881\n \n825\n \nTotal costs and expenses\n133,616\n \n135,793\n \n158,483\n \nIncome from continuing operations\n6,796\n \n14,514\n \n21,469\n \nNet interest and other financial costs\n839\n \n525\n \n1,000\n \nIncome from continuing operations before income taxes\n5,957\n \n13,989\n \n20,469\n \nProvision for income taxes on continuing operations\n890\n \n2,817\n \n4,491\n \nIncome from continuing operations, net of tax\n5,067\n \n11,172\n \n15,978\n \nIncome from discontinued operations, net of tax\n—\n \n—\n \n72\n \nNet income\n5,067\n \n11,172\n \n16,050\n \nLess net income attributable to:\nRedeemable noncontrolling interest\n27\n \n94\n \n88\n \nNoncontrolling interests\n1,595\n \n1,397\n \n1,446\n \nNet income attributable to MPC\n$\n3,445\n \n$\n9,681\n \n$\n14,516\n \nPer share data (See Note 8)\nBasic:\nContinuing operations\n$\n10.11\n \n$\n23.73\n \n$\n28.17\n \nDiscontinued operations\n—\n \n—\n \n0.14\n \nNet income per share\n$\n10.11\n \n$\n23.73\n \n$\n28.31\n \nWeighted average shares outstanding\n340\n \n407\n \n512\n \nDiluted:\nContinuing operations\n$\n10.08\n \n$\n23.63\n \n$\n27.98\n \nDiscontinued operations\n—\n \n—\n \n0.14\n \nNet income per share\n$\n10.08\n \n$\n23.63\n \n$\n28.12\n \nWeighted average shares outstanding\n341\n \n409\n \n516\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n79\nT\nable\n of Contents\nMarathon Petroleum Corporation\nConsolidated Statements of Comprehensive Income\n \n(Millions of dollars)\n2024\n2023\n2022\nNet income\n$\n5,067\n \n$\n11,172\n \n$\n16,050\n \nDefined benefit plans:\nActuarial changes, net of tax of $\n20\n, $(\n24\n) and $\n36\n, respectively\n60\n \n(\n85\n)\n122\n \nPrior service, net of tax of $(\n14\n), $(\n18\n) and $(\n15\n), respectively\n(\n41\n)\n(\n49\n)\n(\n52\n)\nOther, net of tax of $\n1\n, $\n—\n and $\n—\n, respectively\n(\n2\n)\n1\n \n(\n1\n)\nOther comprehensive income (loss)\n17\n \n(\n133\n)\n69\n \nComprehensive income\n5,084\n \n11,039\n \n16,119\n \nLess comprehensive income attributable to:\nRedeemable noncontrolling interest\n27\n \n94\n \n88\n \nNoncontrolling interests\n1,595\n \n1,397\n \n1,446\n \nComprehensive income attributable to MPC\n$\n3,462\n \n$\n9,548\n \n$\n14,585\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n80\nT\nable\n of Contents\nMarathon Petroleum Corporation\nConsolidated Balance Sheets\n \n \nDecember 31,\n(Millions of dollars, except share data)\n2024\n2023\nAssets\nCash and cash equivalents\n$\n3,210\n \n$\n5,443\n \nShort-term investments\n—\n \n4,781\n \nReceivables, less allowance for doubtful accounts of $\n73\n and $\n44\n, respectively\n11,145\n \n12,187\n \nInventories\n9,568\n \n9,317\n \nOther current assets\n524\n \n403\n \nTotal current assets\n24,447\n \n32,131\n \nEquity method investments\n6,857\n \n6,260\n \nProperty, plant and equipment, net\n35,028\n \n35,112\n \nGoodwill\n8,244\n \n8,244\n \nRight of use assets\n1,300\n \n1,233\n \nOther noncurrent assets\n2,982\n \n3,007\n \nTotal assets\n$\n78,858\n \n$\n85,987\n \nLiabilities\nAccounts payable\n$\n13,906\n \n$\n13,761\n \nPayroll and benefits payable\n1,096\n \n1,115\n \nAccrued taxes\n1,204\n \n1,221\n \nDebt due within one year\n3,049\n \n1,954\n \nOperating lease liabilities\n417\n \n454\n \nOther current liabilities\n1,155\n \n1,645\n \nTotal current liabilities\n20,827\n \n20,150\n \nLong-term debt\n24,432\n \n25,329\n \nDeferred income taxes\n5,771\n \n5,834\n \nDefined benefit postretirement plan obligations\n1,157\n \n1,102\n \nLong-term operating lease liabilities\n860\n \n764\n \nDeferred credits and other liabilities\n1,305\n \n1,409\n \nTotal liabilities\n54,352\n \n54,588\n \nCommitments and contingencies (see Note 27)\nRedeemable noncontrolling interest\n203\n \n895\n \nEquity\nPreferred stock, \nno\n shares issued and outstanding (par value $\n0.01\n per share, \n30\n million shares authorized)\n—\n \n—\n \nCommon stock:\nIssued – \n994\n million and \n993\n million shares (par value $\n0.01\n per share, \n2\n billion shares authorized)\n10\n \n10\n \nHeld in treasury, at cost – \n678\n million and \n625\n million shares\n(\n52,623\n)\n(\n43,502\n)\nAdditional paid-in capital\n33,624\n \n33,465\n \nRetained earnings\n36,848\n \n34,562\n \nAccumulated other comprehensive loss\n(\n114\n)\n(\n131\n)\nTotal MPC stockholders’ equity\n17,745\n \n24,404\n \nNoncontrolling interests\n6,558\n \n6,100\n \nTotal equity\n24,303\n \n30,504\n \nTotal liabilities, redeemable noncontrolling interest and equity\n$\n78,858\n \n$\n85,987\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n81\nT\nable\n of Contents\nMarathon Petroleum Corporation\nConsolidated Statements of Cash Flows\n(Millions of dollars)\n2024\n2023\n2022\nOperating activities:\nNet income\n$\n5,067\n \n$\n11,172\n \n$\n16,050\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nAmortization of deferred financing costs and debt discount\n(\n31\n)\n(\n78\n)\n50\n \nDepreciation and amortization\n3,337\n \n3,307\n \n3,215\n \nPension and other postretirement benefits, net\n59\n \n(\n191\n)\n172\n \nDeferred income taxes\n(\n124\n)\n(\n28\n)\n290\n \nNet gain on disposal of assets\n(\n28\n)\n(\n217\n)\n(\n1,061\n)\nIncome from equity method investments\n(\n1,048\n)\n(\n742\n)\n(\n655\n)\nDistributions from equity method investments\n1,215\n \n941\n \n772\n \nIncome from discontinued operations\n—\n \n—\n \n(\n72\n)\nChanges in the fair value of derivative instruments\n71\n \n70\n \n(\n147\n)\nChanges in:\nCurrent receivables\n1,117\n \n2,109\n \n(\n2,858\n)\nInventories\n(\n270\n)\n(\n489\n)\n(\n787\n)\nCurrent liabilities and other current assets\n(\n438\n)\n(\n1,318\n)\n1,972\n \nRight of use assets and operating lease liabilities, net\n(\n10\n)\n(\n7\n)\n—\n \nAll other, net\n(\n252\n)\n(\n412\n)\n(\n622\n)\nCash provided by operating activities - continuing operations\n8,665\n \n14,117\n \n16,319\n \nCash provided by operating activities - discontinued operations\n—\n \n—\n \n42\n \nNet cash provided by operating activities\n8,665\n \n14,117\n \n16,361\n \nInvesting activities:\nAdditions to property, plant and equipment\n(\n2,533\n)\n(\n1,890\n)\n(\n2,420\n)\nAcquisitions, net of cash acquired\n(\n688\n)\n(\n246\n)\n(\n413\n)\nDisposal of assets\n35\n \n36\n \n90\n \nInvestments – acquisitions and contributions\n(\n509\n)\n(\n480\n)\n(\n405\n)\n – redemptions, repayments, return of capital and sales proceeds\n161\n \n275\n \n515\n \nPurchases of short-term investments\n(\n2,949\n)\n(\n8,622\n)\n(\n6,023\n)\nSales of short-term investments\n3,295\n \n2,082\n \n1,296\n \nMaturities of short-term investments\n4,526\n \n5,048\n \n7,159\n \nAll other, net\n196\n \n702\n \n824\n \nNet cash provided by (used in) investing activities\n1,534\n \n(\n3,095\n)\n623\n \nFinancing activities:\nLong-term debt – borrowings\n1,631\n \n1,589\n \n3,379\n \n                          – repayments\n(\n1,984\n)\n(\n1,079\n)\n(\n2,280\n)\nDebt issuance costs\n(\n15\n)\n(\n15\n)\n(\n39\n)\nIssuance of common stock\n25\n \n62\n \n243\n \nCommon stock repurchased\n(\n9,189\n)\n(\n11,572\n)\n(\n11,922\n)\nDividends paid\n(\n1,154\n)\n(\n1,261\n)\n(\n1,279\n)\nDistributions to noncontrolling interests\n(\n1,377\n)\n(\n1,281\n)\n(\n1,214\n)\nRepurchases of noncontrolling interests\n(\n326\n)\n—\n \n(\n491\n)\n82\nT\nable\n of Contents\n(Millions of dollars)\n2024\n2023\n2022\nRedemption of noncontrolling interests - preferred units\n—\n \n(\n600\n)\n—\n \nAll other, net\n(\n45\n)\n(\n50\n)\n(\n44\n)\nNet cash used in financing activities\n(\n12,434\n)\n(\n14,207\n)\n(\n13,647\n)\nNet change in cash, cash equivalents and restricted cash\n$\n(\n2,235\n)\n$\n(\n3,185\n)\n$\n3,337\n \nCash, cash equivalents and restricted cash at beginning of period\n(a)\n5,446\n \n8,631\n \n5,294\n \nCash, cash equivalents and restricted cash at end of period\n(a)\n$\n3,211\n \n$\n5,446\n \n$\n8,631\n \n(a)\n    \nRestricted cash is included in other current assets on our consolidated balance sheets.\nThe accompanying notes are an integral part of these consolidated financial statements.\n83\nT\nable\n of Contents\nMarathon Petroleum Corporation\nConsolidated Statements of Equity and Redeemable Noncontrolling Interest\n \nMPC Stockholders’ Equity\n \n \nCommon Stock\nTreasury Stock\nAdditional Paid-in Capital\nRetained Earnings\nAccumulated Other Comprehensive Income (Loss)\nNon-controlling Interests\nTotal Equity\nRedeemable Non-controlling Interest\n(Shares in millions; \namounts in millions of dollars)\nShares\nAmount\nShares\nAmount\nBalance as of December 31, 2021\n984\n \n$\n10\n \n(\n405\n)\n$\n(\n19,904\n)\n$\n33,262\n \n$\n12,905\n \n$\n(\n67\n)\n$\n6,410\n \n$\n32,616\n \n$\n965\n \nNet income\n— \n— \n— \n— \n— \n14,516\n \n— \n1,446\n \n15,962\n \n88\n \nDividends declared on common stock ($\n2.49\n per share)\n— \n— \n— \n— \n— \n(\n1,279\n)\n— \n— \n(\n1,279\n)\n— \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n1,129\n)\n(\n1,129\n)\n(\n85\n)\nOther comprehensive income\n— \n— \n— \n— \n— \n— \n69\n \n— \n69\n \n— \nShares repurchased\n— \n— \n(\n131\n)\n(\n11,933\n)\n— \n— \n— \n— \n(\n11,933\n)\n— \nShare-based compensation\n6\n \n— \n— \n(\n4\n)\n260\n \n— \n— \n4\n \n260\n \n— \nEquity transactions of MPLX\n— \n— \n— \n— \n(\n120\n)\n— \n— \n(\n327\n)\n(\n447\n)\n—\n \nBalance as of December 31, 2022\n990\n \n$\n10\n \n(\n536\n)\n$\n(\n31,841\n)\n$\n33,402\n \n$\n26,142\n \n$\n2\n \n$\n6,404\n \n$\n34,119\n \n$\n968\n \nNet income\n— \n— \n— \n— \n— \n9,681\n \n— \n1,397\n \n11,078\n \n94\n \nDividends declared on common stock ($\n3.075\n per share)\n— \n— \n— \n— \n— \n(\n1,261\n)\n— \n— \n(\n1,261\n)\n— \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n1,187\n)\n(\n1,187\n)\n(\n94\n)\nOther comprehensive loss\n— \n— \n— \n— \n— \n— \n(\n133\n)\n— \n(\n133\n)\n— \nShares repurchased\n— \n— \n(\n89\n)\n(\n11,661\n)\n— \n— \n— \n— \n(\n11,661\n)\n— \nShare-based compensation\n3\n \n— \n— \n—\n \n67\n \n2\n \n— \n6\n \n75\n \n— \nEquity transactions of MPLX\n— \n— \n— \n— \n(\n4\n)\n(\n2\n)\n— \n(\n520\n)\n(\n526\n)\n(\n73\n)\nBalance as of December 31, 2023\n993\n \n$\n10\n \n(\n625\n)\n$\n(\n43,502\n)\n$\n33,465\n \n$\n34,562\n \n$\n(\n131\n)\n$\n6,100\n \n$\n30,504\n \n$\n895\n \nNet income\n— \n— \n— \n— \n— \n3,445\n \n— \n1,595\n \n5,040\n \n27\n \nDividends declared on common stock ($\n3.385\n per share)\n— \n— \n— \n— \n— \n(\n1,154\n)\n— \n— \n(\n1,154\n)\n— \nDistributions to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n(\n1,333\n)\n(\n1,333\n)\n(\n44\n)\nOther comprehensive income\n— \n— \n— \n— \n— \n— \n17\n \n— \n17\n \n— \nShares repurchased\n— \n— \n(\n53\n)\n(\n9,121\n)\n— \n— \n— \n— \n(\n9,121\n)\n— \nShare-based compensation\n1\n \n— \n— \n—\n \n55\n \n(\n5\n)\n— \n7\n \n57\n \n— \nEquity transactions of MPLX\n— \n— \n— \n— \n104\n \n—\n \n— \n189\n \n293\n \n(\n675\n)\nBalance as of December 31, 2024\n994\n \n$\n10\n \n(\n678\n)\n$\n(\n52,623\n)\n$\n33,624\n \n$\n36,848\n \n$\n(\n114\n)\n$\n6,558\n \n$\n24,303\n \n$\n203\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n84\nT\nable\n of Contents\nNotes to Consolidated Financial Statements\n1. \nDescription of the Business and Basis of Presentation \nDescription of the Business \nWe are a leading, integrated, downstream energy company headquartered in Findlay, Ohio. We operate one of the nation's largest refining systems. We sell refined products to wholesale marketing customers domestically and internationally, to buyers on the spot market and to independent entrepreneurs who operate branded outlets. We also sell transportation fuel to consumers through direct dealer locations under long-term supply contracts. MPC’s midstream operations are primarily conducted through MPLX, which owns and operates crude oil and light product transportation and logistics infrastructure as well as gathering, processing and fractionation assets. We own the general partner and a majority limited partner interest in MPLX. In addition, we produce and market renewable diesel in the United States. \nOn May 14, 2021, we completed the sale of Speedway, our company-owned and operated retail transportation fuel and convenience store business, to 7-Eleven, Inc. (“7-Eleven”). The transaction provided for adjustments to working capital and miscellaneous items, which were finalized with 7-Eleven in the fourth quarter of 2022. These adjustments are reported separately as discontinued operations, net of tax, in our consolidated statements of income and within our consolidated statements of cash flow. \nRefer to Notes 5 and 10 for additional information about our operations.\nBasis of Presentation\n \nAll significant intercompany transactions and accounts have been eliminated.\nCertain prior period financial statement amounts have been reclassified to conform to current period presentation. \nIn the fourth quarter of 2024, we established a Renewable Diesel segment, which includes renewable diesel activities and assets historically reported in the Refining & Marketing segment. Prior period segment information has been recast for comparability. See Notes 10, 14, 15 and 20 for additional information and for prior period recast information.\n \n2. \nSummary of Principal Accounting Policies\n \nPrinciples Applied in Consolidation\nThese consolidated financial statements include the accounts of our majority-owned, controlled subsidiaries and MPLX. As of December 31, 2024, we owned the general partner and approximately \n64\n percent of the outstanding MPLX common units. Due to our ownership of the general partner interest, we have determined that we control MPLX and therefore we consolidate MPLX and record a noncontrolling interest for the interest owned by the public. Changes in ownership interest in consolidated subsidiaries that do not result in a change in control are recorded as equity transactions. \nInvestments in entities over which we have significant influence, but not control, are accounted for using the equity method of accounting. This includes entities in which we hold majority ownership but the minority shareholders have substantive participating rights. Income from equity method investments represents our proportionate share of net income generated by the equity method investees.\nDifferences in the basis of the investments and the separate net asset values of the investees, if any, are amortized into net income over the remaining useful lives of the underlying assets and liabilities, except for any excess related to goodwill. Equity method investments are evaluated for impairment whenever changes in the facts and circumstances indicate an other than temporary loss in value has occurred. When the loss is deemed to be other than temporary, the carrying value of the equity method investment is written down to fair value.\nUse of Estimates \nThe preparation of financial statements in accordance with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the respective reporting periods. Actual results could differ from those estimates.\nRevenue Recognition\nWe recognize revenue based on consideration specified in contracts or agreements with customers when we satisfy our performance obligations by transferring control over products or services to a customer. We made an accounting policy election that all taxes assessed by a governmental authority that are both imposed on and concurrent with a revenue-producing transaction and collected from our customers will be recognized on a net basis within sales and other operating revenues. \n85\nT\nable\n of Contents\nOur revenue recognition patterns are described below by reportable segment:\n•\nRefining & Marketing and Renewable Diesel  - The vast majority of our Refining & Marketing and Renewable Diesel contracts contain pricing that is based on the market price for the product at the time of delivery. Our obligations to deliver product volumes are typically satisfied and revenue is recognized when control of the product transfers to our customers. Concurrent with the transfer of control, we typically receive the right to payment for the delivered product, the customer accepts the product and the customer has significant risks and rewards of ownership of the product. Payment terms require customers to pay shortly after delivery and do not contain significant financing components. \n•\nMidstream - Midstream revenue transactions typically are defined by contracts under which we sell a product or provide a service. Revenues from sales of product are recognized when control of the product transfers to the customer. Revenues from services are recognized over time when the performance obligation is satisfied as services are provided in a series. We have elected to use the output measure of progress to recognize revenue based on the units delivered, processed or transported. The transaction prices in our Midstream contracts often have both fixed components, related to minimum volume commitments, and variable components, which are primarily dependent on volumes. Variable consideration will generally not be estimated at contract inception as the transaction price is specifically allocable to the services provided at each period end. \nRefer to Note 20 for disclosure of our revenue disaggregated by segment and product line and to Note 10 for a description of our reportable segment operations.\nCrude Oil and Refined Product Exchanges and Matching Buy/Sell Transactions \nWe enter into exchange contracts and matching buy/sell arrangements whereby we agree to deliver a particular quantity and quality of crude oil or refined products at a specified location and date to a particular counterparty and to receive from the same counterparty the same commodity at a specified location on the same or another specified date. The exchange receipts and deliveries are nonmonetary transactions, with the exception of associated grade or location differentials that are settled in cash. The matching buy/sell purchase and sale transactions are settled in cash. No revenues are recorded for exchange and matching buy/sell transactions as they are accounted for as exchanges of inventory. The exchange transactions are recognized at the carrying amount of the inventory transferred.\nCash and Cash Equivalents \nCash and cash equivalents include cash on hand and on deposit and investments in highly liquid debt instruments with original maturities of three months or less.\nShort-Term Investments\nInvestments with a maturity date greater than three months that we intend to convert to cash or cash equivalents within a year or less are classified as short-term investments in our consolidated balance sheets. Additionally, in accordance with ASC 320,\n Investments - Debt Securities\n, we have classified all short-term investments as available-for-sale securities and changes in fair market value are reported in other comprehensive income.\nAccounts Receivable and Allowance for Doubtful Accounts\n \nOur receivables primarily consist of customer accounts receivable. Customer receivables are recorded at the invoiced amounts and generally do not bear interest. Allowances for doubtful accounts are generally recorded when it becomes probable the receivable will not be collected and are booked to bad debt expense. The allowance for doubtful accounts is the best estimate of the amount of probable credit losses in customer accounts receivable.\n \nWe review the allowance quarterly and past-due balances over 150 days are reviewed individually for collectability. \nWe mitigate credit risk with master netting agreements with companies engaged in the crude oil or refinery feedstock trading and supply business or the petroleum refining industry. A master netting agreement generally provides for a once per month net cash settlement of the accounts receivable from and the accounts payable to a particular counterparty.\nLeases \nContracts with a term greater than one year that convey the right to direct the use of and obtain substantially all of the economic benefit of an asset are accounted for as right of use assets.\nRight of use asset and lease liability balances are recorded at the commencement date at present value of the fixed lease payments using a secured incremental borrowing rate with a maturity similar to the lease term because our leases do not provide implicit rates. We have elected to include both lease and non-lease components in the present value of the lease payments for all lessee asset classes with the exception of our marine and third-party contractor service equipment leases. The lease component of the payment for the marine and equipment asset classes is determined using a relative standalone selling price. See Note 26 for additional disclosures about our lease contracts.\n86\nT\nable\n of Contents\nAs a lessor under ASU No. 2016-02, \nLeases\n (“ASC 842”), MPLX may be required to reclassify existing operating leases to sales-type leases upon modification and related reassessment of the leases. See Note 26 for further information regarding our ongoing evaluation of the impacts of lease reassessments as modifications occur. The net investment in sales-type leases is recorded within receivables, net and other noncurrent assets on the consolidated balance sheets. These amounts are comprised of the present value of the sum of the future minimum lease payments representing the value of the lease receivable and the unguaranteed residual value of the lease assets. Management assesses the net investment in sales-type leases for recoverability quarterly.\nInventories\nInventories are carried at the lower of cost or market value. Cost of inventories is determined primarily under the LIFO method. Costs for crude oil and other feedstocks and refined product inventories are aggregated on a consolidated basis for purposes of assessing if the LIFO cost basis of these inventories may have to be written down to market value.\nFair Value\nWe account for certain assets and liabilities at fair value. The hierarchy below lists three levels of fair value based on the extent to which inputs used in measuring fair value are observable in the market. We categorize each of our fair value measurements in one of these three levels based on the lowest level input that is significant to the fair value measurement in its entirety. These levels are:\n•\nLevel 1 – inputs are based upon unadjusted quoted prices for identical instruments in active markets. Our Level 1 derivative assets and liabilities include exchange-traded contracts for crude oil and refined products measured at fair value with a market approach using the close-of-day settlement prices for the market. Commodity derivatives are covered under master netting agreements with an unconditional right to offset. Collateral deposits in futures commission merchant accounts covered by master netting agreements related to Level 1 commodity derivatives are classified as Level 1.\n•\nLevel 2 – inputs are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, credit spreads, and forward and spot prices for currencies. Our Level 2 investments include commercial paper, certificates of deposit, time deposits and corporate notes and bonds. Our Level 2 derivative assets and liabilities primarily include certain OTC contracts.\n•\nLevel 3 – inputs are generally unobservable and typically reflect management’s estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques, including option pricing models and discounted cash flow models. Our Level 3 assets and liabilities include goodwill, long-lived assets and intangible assets, when they are recorded at fair value due to an impairment charge and an embedded derivative liability relates to a natural gas purchase agreement embedded in a keep‑whole processing agreement. Unobservable inputs used in the models are significant to the fair values of the assets and liabilities.\nDerivative Instruments \nWe use derivatives to economically hedge a portion of our exposure to commodity price risk and, historically, to interest rate risk. Our use of selective derivative instruments that assume market risk is limited. All derivative instruments (including derivative instruments embedded in other contracts) are recorded at fair value. Certain commodity derivatives are reflected on the consolidated balance sheets on a net basis by counterparty as they are governed by master netting agreements. Cash flows related to derivatives used to hedge commodity price risk and interest rate risk are classified in operating activities with the underlying transactions.\nDerivatives not designated as accounting hedges\n \nDerivatives that are not designated as accounting hedges may include commodity derivatives used to hedge price risk on (1) inventories, (2) fixed price sales of refined products, (3) the acquisition of foreign-sourced crude oil, (4) the acquisition of ethanol for blending with refined products, (5) the sale of NGLs, (6) the purchase of natural gas, (7) the purchase of soybean oil and (8) the sale of propane. Changes in the fair value of derivatives not designated as accounting hedges are recognized immediately in net income.\nConcentrations of credit risk\n \nAll of our financial instruments, including derivatives, involve elements of credit and market risk. The most significant portion of our credit risk relates to nonperformance by counterparties. The counterparties to our financial instruments consist primarily of major financial institutions and companies within the energy industry. To manage counterparty risk associated with financial instruments, we select and monitor counterparties based on an assessment of their financial strength and on credit ratings, if available. Additionally, we limit the level of exposure with any single counterparty.\n87\nT\nable\n of Contents\nProperty, Plant and Equipment \nProperty, plant and equipment are recorded at cost and depreciated on a straight-line basis over the estimated useful lives of the assets, generally \n10\n to \n40\n years for refining and midstream assets, \n25\n years for office buildings and \n4\n to \n7\n years for other miscellaneous fixed assets. Such assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. If the sum of the expected undiscounted future cash flows from the use of the asset group and its eventual disposition is less than the carrying amount of the asset group, an impairment assessment is performed and the excess of the book value over the fair value of the asset group is recorded as an impairment loss.\nWhen items of property, plant and equipment are sold or otherwise disposed of, any gains or losses are reported in net income. Gains on the disposal of property, plant and equipment are recognized when earned, which is generally at the time of closing. If a loss on disposal is expected, such losses are recognized when the assets are classified as held for sale.\nInterest expense is capitalized for qualifying assets under construction. Capitalized interest costs are included in property, plant and equipment and are depreciated over the useful life of the related asset.\nGoodwill and Intangible Assets\nGoodwill represents the excess of the purchase price over the estimated fair value of the net assets acquired in the acquisition of a business. Goodwill is not amortized, but rather is tested for impairment at the reporting unit level annually and when events or changes in circumstances indicate that the fair value of a reporting unit with goodwill has been reduced below carrying value. If we determine, based on a qualitative assessment, that it is not more likely than not that a reporting unit’s fair value is less than its carrying amount, no further impairment testing is required. If we do not perform a qualitative assessment or if that assessment indicates that further impairment testing is required, the fair value of each reporting unit is determined using an income and/or market approach which is compared to the carrying value of the reporting unit. If the carrying amount of the reporting unit exceeds its fair value, an impairment loss would be recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit. The fair value under the income approach is calculated using the expected present value of future cash flows method. Significant assumptions used in the cash flow forecasts include future volumes, discount rates, and future capital requirements.\nAmortization of intangibles with definite lives is calculated using the straight-line method, which is reflective of the benefit pattern in which the estimated economic benefit is expected to be received over the estimated useful life of the intangible asset. Intangibles subject to amortization are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the intangible may not be recoverable. If the sum of the expected undiscounted future cash flows related to the asset is less than the carrying amount of the asset, an impairment loss is recognized based on the fair value of the asset. Intangibles not subject to amortization are tested for impairment annually and when circumstances indicate that the fair value is less than the carrying amount of the intangible. If the fair value is less than the carrying value, an impairment is recorded for the difference.\nMajor Maintenance Activities\n \nCosts for planned turnaround and other major maintenance activities are expensed in the period incurred. These types of costs include contractor repair services, materials and supplies, equipment rentals and our labor costs.\nEnvironmental Costs \nEnvironmental expenditures for additional equipment that mitigates or prevents future contamination or improves environmental safety or efficiency of the existing assets are capitalized. We recognize remediation costs and penalties when the responsibility to remediate is probable and the amount of associated costs can be reasonably estimated. The timing of remediation accruals coincides with the completion of a feasibility study or the commitment to a formal plan of action. Remediation liabilities are accrued based on estimates of known environmental exposure and are discounted when the estimated amounts are reasonably fixed and determinable. If recoveries of remediation costs from third parties are probable, a receivable is recorded and is discounted when the estimated amount is reasonably fixed and determinable.\nAsset Retirement Obligations\n \nThe fair value of asset retirement obligations is recognized in the period in which the obligations are incurred if a reasonable estimate of fair value can be made. The majority of our recognized asset retirement liability relates to conditional asset retirement obligations for removal and disposal of fire-retardant material from certain refining facilities. The remaining recognized asset retirement liability relates to other refining assets, certain pipelines and processing facilities and other related pipeline assets. The fair values recorded for such obligations are based on the most probable current cost projections.\nAsset retirement obligations have not been recognized for some assets because the fair value cannot be reasonably estimated since the settlement dates of the obligations are indeterminate. Such obligations will be recognized in the period when sufficient information becomes available to estimate a range of potential settlement dates. The asset retirement obligations principally include the hazardous material disposal and removal or dismantlement requirements associated with the closure of certain refining, terminal, pipeline and processing assets.\n88\nT\nable\n of Contents\nOur practice is to keep our assets in good operating condition through routine repair and maintenance of component parts in the ordinary course of business and by continuing to make improvements based on technological advances. As a result, we believe that generally these assets have no expected settlement date for purposes of estimating asset retirement obligations since the dates or ranges of dates upon which we would retire these assets cannot be reasonably estimated at this time.\nIncome Taxes \nDeferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of assets and liabilities and their tax bases. Deferred tax assets are recorded when it is more likely than not that they will be realized. The realization of deferred tax assets is assessed periodically based on several factors, primarily our expectation to generate sufficient future taxable income.\nShare-Based Compensation Arrangements \nThe fair value of stock options granted to our employees is estimated on the date of grant using the Black-Scholes option pricing model. The model employs various assumptions based on management’s estimates at the time of grant, which impact the calculation of fair value and ultimately, the amount of expense that is recognized over the vesting period of the stock option award. Of the required assumptions, the expected life of the stock option award and the expected volatility of our stock price have the most significant impact on the fair value calculation. The average expected life is based on our historical employee exercise behavior. The assumption for expected volatility of our stock price reflects a weighting of 50 percent of our common stock implied volatility and 50 percent of our common stock historical volatility.\nThe fair value of restricted stock awards granted to our employees is determined based on the fair market value of our common stock on the date of grant. The fair value of performance awards granted to our employees is determined using a Monte Carlo valuation model, which is updated quarterly, with appropriate mark-to-market adjustments made.\nOur share-based compensation expense is recognized based on management’s estimate of the awards that are expected to vest, using the straight-line attribution method for all service-based awards with a graded vesting feature. Awards expected to vest are estimated using the historical data of our own employees. If actual forfeiture results are different than expected, adjustments to recognized compensation expense may be required in future periods. Unearned share-based compensation is charged to equity when restricted stock awards are granted. Compensation expense is recognized over the requisite service period and is adjusted if conditions of the restricted stock award are not met.\n \nBusiness Combinations \nWe recognize and measure the assets acquired and liabilities assumed in a business combination based on their estimated fair values at the acquisition date. Any excess or deficiency of the purchase consideration when compared to the fair value of the net tangible assets acquired, if any, is recorded as goodwill or gain from a bargain purchase. For material acquisitions, management engages an independent valuation specialist to assist with the determination of fair value of the assets acquired, liabilities assumed, noncontrolling interest, if any, and goodwill, based on recognized business valuation methodologies. An income, market or cost valuation method may be utilized to estimate the fair value of the assets acquired, liabilities assumed, and noncontrolling interest, if any, in a business combination. The income valuation method represents the present value of future cash flows over the life of the asset using: (i) discrete financial forecasts, which rely on management’s estimates of revenue and operating expenses; (ii) long-term growth rates; and (iii) appropriate discount rates. The market valuation method uses prices paid for a reasonably similar asset by other purchasers in the market, with adjustments relating to any differences between the assets. The cost valuation method is based on the replacement cost of a comparable asset at prices at the time of the acquisition reduced for depreciation of the asset. If the initial accounting for the business combination is incomplete by the end of the reporting period in which the acquisition occurs, an estimate will be recorded. Subsequent to the acquisition date, and not later than one year from the acquisition date, we will record any material adjustments to the initial estimate based on new information obtained that would have existed as of the date of the acquisition. Any adjustment that arises from information obtained that did not exist as of the date of the acquisition will be recorded in the period of the adjustment. Acquisition-related costs are expensed as incurred in connection with each business combination.\n \nEnvironmental Credits and Obligations \nIn order to comply with certain regulations, specifically the RFS2 requirements implemented by EPA and the cap-and-trade emission reduction program and low carbon fuel standard implemented by state programs, we are required to reduce our emissions, blend certain levels of biofuels or obtain allowances or credits to offset the obligations created by our operations. In regard to each program, we record an asset, included in other current assets or other noncurrent assets on the consolidated balance sheets, for allowances or credits owned in excess of our anticipated current period compliance requirements. The asset value is based on the product of the excess allowances or credits as of the balance sheet date, if any, and the weighted average cost of those allowances or credits. We record a liability, included in other current liabilities or deferred credits and other liabilities on the consolidated balance sheets, when we are deficient allowances or credits based on the product of the deficient amount as of the balance sheet date, if any, and either the fixed contract price or the market price of the allowances or credits at the balance sheet date. The cost of allowances or credits used for compliance is reflected in cost of revenues on the consolidated statements of income.\n \nAny gains or losses on the sale or expiration of allowances or credits are classified as other income on the consolidated statements of income. Proceeds from the sale of allowances or credits are reported in investing activities - all other, net on the consolidated statements of cash flows.\n89\nT\nable\n of Contents\n \n3. \nAccounting Standards and Disclosure Rules \nRecently Adopted\nASU 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\nThe FASB issued this ASU to update reportable segment disclosure requirements primarily by requiring enhanced disclosures about significant segment expenses. During the fourth quarter of 2024, we applied the amendments in this ASU retrospectively to all periods presented in the financial statements. The enhanced disclosures for significant segment expenses are presented in Note 10 - Segment Information.\nASU 2023-01, Leases (Topic 842): Common Control Arrangements\nThe FASB issued this ASU to amend certain provisions of ASC 842 that apply to arrangements between related parties under common control. The ASU amends the accounting for the amortization period of leasehold improvements in common-control leases for all entities and requires certain disclosures when the lease term is shorter than the useful life of the asset. During the first quarter of 2024, we adopted this ASU and it did not have a material impact on our financial statements or disclosures.\nNot Yet Adopted\nASU 2024-03, Income Statement – Reporting Comprehensive Income – Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\nIn November 2024, the FASB issued an ASU to require more detailed information about specified categories of expenses (purchases of inventory, employee compensation, depreciation, amortization, and depletion) included in certain expense captions presented on the income statement. This ASU is effective for fiscal years beginning after December 15, 2026, and for interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted. The amendments may be applied either (1) prospectively to financial statements issued for reporting periods after the effective date of this ASU or (2) retrospectively to all prior periods presented in the financial statements. We are currently evaluating the impact this ASU will have on our disclosures.\nSEC Release No. 33-11275, The Enhancement and Standardization of Climate-Related Disclosures for Investors\nIn March 2024, the SEC adopted rules under SEC Release No. 33-11275, The Enhancement and Standardization of Climate-Related Disclosures for Investors, which requires registrants to provide certain climate-related information in their annual reports. As part of the disclosures, material impacts from severe weather events and other natural conditions will be required in the audited financial statements. In April 2024, the SEC voluntarily stayed the rules pending judicial review. Pending the results of the judicial review, the disclosure requirements are effective for the Company’s Annual Report on Form 10-K for the fiscal year ending December 31, 2025. We are evaluating the impact these rules, if effective, will have on our disclosures and monitoring the status of the judicial review.\nASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures\nIn December 2023, the FASB issued an ASU to update income tax disclosure requirements to provide consistent categories and greater disaggregation of information in the rate reconciliation and to disaggregate income taxes paid by jurisdiction. This ASU is effective for fiscal years beginning after December 15, 2024. Early adoption is permitted. The amendments should be applied on a prospective basis, but retrospective application is permitted. This standard will result in additional disclosure.\n90\nT\nable\n of Contents\n4. \nShort-Term Investments\nInvestments Components\nInvestments as of December 31, 2024 had maturity dates of less than 90 days and therefore, are included in cash and cash equivalents. Below reflects the components of investments at December 31, 2023.\nDecember 31, 2023\n(Millions of dollars)\nFair Value Level\nAmortized Cost\nUnrealized Gains\nUnrealized Losses\nFair Value\nCash and Cash Equivalents\nShort-term Investments\nAvailable-for-sale debt securities\nCommercial paper\nLevel 2\n$\n3,154\n \n$\n2\n \n$\n—\n \n$\n3,156\n \n$\n281\n \n$\n2,875\n \nCertificates of deposit and time deposits\nLevel 2\n1,836\n \n1\n \n—\n \n1,837\n \n800\n \n1,037\n \nU.S. government securities\nLevel 1\n785\n \n—\n \n(\n1\n)\n784\n \n—\n \n784\n \nCorporate notes and bonds\nLevel 2\n85\n \n—\n \n—\n \n85\n \n—\n \n85\n \nTotal available-for-sale debt securities\n$\n5,860\n \n$\n3\n \n$\n(\n1\n)\n$\n5,862\n \n$\n1,081\n \n$\n4,781\n \nCash\n4,362\n \n4,362\n \n—\n \nTotal\n$\n10,224\n \n$\n5,443\n \n$\n4,781\n \nOur investment policy includes concentration limits and credit rating requirements, which limits our investments to high quality, short term and highly liquid securities.\nRealized gains/losses were not material.\n \n5. \nMaster Limited Partnership\n    \nWe own the general partner and a majority limited partner interest in MPLX, which owns and operates crude oil and light product transportation and logistics infrastructure as well as gathering, processing and fractionation assets. We control MPLX through our ownership of the general partner interest and, as of December 31, 2024, we owned approximately \n64\n percent of the outstanding MPLX common units compared to \n65\n percent as of December 31, 2023. Our ownership was impacted by changes in the redeemable non-controlling interest and unit repurchases. \nUnit Repurchase Program\nOn August 2, 2022\n, MPLX announced its board of directors approved a $\n1.0\n billion unit repurchase authorization. This unit repurchase authorization has no expiration date. \nMPLX may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, accelerated unit repurchases, tender offers or open market solicitations for units, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended, discontinued or restarted at any time.\nTotal unit repurchases were as follows for the respective periods:\n(In millions, except per unit data)\n2024\n2023\n2022\nNumber of common units repurchased\n8\n \n—\n \n15\n \nCash paid for common units repurchased\n$\n326\n \n$\n—\n \n$\n491\n \nAverage cost per unit\n$\n43.04\n \n$\n—\n \n$\n31.96\n \nAs of December 31, 2024, MPLX had approximately $\n520\n million remaining under its unit repurchase authorization.\nPreferred Units Outstanding\nThe Series A preferred units are considered redeemable securities under GAAP due to the existence of redemption provisions upon a deemed liquidation event, which is outside MPLX’s control. Therefore, they are presented as temporary equity in the mezzanine section of our consolidated balance sheets. \nDuring the years ended December 31, 2024 and December 31, 2023, certain Series A preferred unitholders exercised their rights to convert their Series A preferred units into \n21\n million common units and \n2\n million common units, respectively. Approximately \n6\n million Series A preferred units were outstanding as of December 31, 2024. On February 11, 2025, MPLX exercised its right to convert the remaining outstanding Series A preferred units into common units.\nFor a summary of changes in the redeemable preferred balance, see the accompanying consolidated statements of equity and redeemable noncontrollable interest.\n91\nT\nable\n of Contents\nRedemption of the Series B Preferred Units\nOn February 15, 2023, MPLX exercised its right to redeem all of its \n600,000\n outstanding preferred units (the “Series B preferred units”). MPLX paid unitholders the Series B preferred unit redemption price of $\n1,000\n per unit. The final semi-annual distribution on the Series B preferred units was paid on February 15, 2023 in the usual manner.\nThe excess of the total redemption price of $\n600\n million paid to Series B preferred unitholders over the carrying value of the Series B preferred units on the redemption date resulted in a $\n2\n million net reduction to retained earnings.\nAgreements\nWe have various long-term, fee-based commercial agreements with MPLX. Under these agreements, MPLX provides transportation, storage, distribution and marketing services to us. With certain exceptions, these agreements generally contain minimum volume commitments. These transactions are eliminated in consolidation but are reflected as intersegment transactions between our Refining & Marketing, Renewable Diesel and Midstream segments. We also have agreements with MPLX that establish fees for operational and management services provided between us and MPLX and for executive management services and certain general and administrative services provided by us to MPLX. These transactions are eliminated in consolidation but are reflected as intersegment transactions between corporate and our Midstream segment.\nNoncontrolling Interest\nAs a result of equity transactions of MPLX, we are required to adjust non-controlling interest and additional paid-in capital. Changes in MPC’s additional paid-in capital resulting from changes in its ownership interest in MPLX were as follows:\n(Millions of dollars)\n2024\n2023\n2022\nIncrease (decrease) due to change in ownership\n$\n159\n \n$\n(\n4\n)\n$\n(\n164\n)\nTax impact\n(\n55\n)\n—\n \n44\n \nIncrease (decrease) in MPC's additional paid-in capital, net of tax\n$\n104\n \n$\n(\n4\n)\n$\n(\n120\n)\n6. \nVariable Interest Entities\n \nConsolidated VIE\nWe control MPLX through our ownership of its general partner. MPLX is a VIE because the limited partners do not have substantive kick-out or participating rights over the general partner. We are the primary beneficiary of MPLX because in addition to our significant economic interest, we also have the ability, through our ownership of the general partner, to control the decisions that most significantly impact MPLX. We therefore consolidate MPLX and record a noncontrolling interest for the interest owned by the public. We also record a redeemable noncontrolling interest related to MPLX’s Series A preferred units.\nThe creditors of MPLX do not have recourse to MPC’s general credit or assets through guarantees or other financial arrangements, except as otherwise noted. MPC has effectively guaranteed certain indebtedness of LOOP LLC (“LOOP”) and LOCAP LLC (“LOCAP”), in which MPLX holds an interest. See Note 27 for more information. The assets of MPLX can only be used to settle its own obligations and any rights of MPC’s creditors to participate in the assets of MPLX are subject to prior claims of MPLX’s creditors. \nThe following table presents balance sheet information for the assets and liabilities of MPLX, which are included in our consolidated balance sheets.\n(Millions of dollars)\nDecember 31,\n2024\nDecember 31,\n2023\nAssets\nCash and cash equivalents\n$\n1,519\n \n$\n1,048\n \nReceivables, less allowance for doubtful accounts\n731\n \n836\n \nInventories\n180\n \n159\n \nOther current assets\n29\n \n33\n \nEquity method investments\n4,531\n \n3,743\n \nProperty, plant and equipment, net\n19,154\n \n19,264\n \nGoodwill\n7,645\n \n7,645\n \nRight of use assets\n273\n \n264\n \nOther noncurrent assets\n1,513\n \n1,644\n \n92\nT\nable\n of Contents\n(Millions of dollars)\nDecember 31,\n2024\nDecember 31,\n2023\nLiabilities\nAccounts payable\n$\n719\n \n$\n723\n \nAccrued taxes\n82\n \n79\n \nDebt due within one year\n1,693\n \n1,135\n \nOperating lease liabilities\n45\n \n45\n \nOther current liabilities\n370\n \n336\n \nLong-term debt\n19,255\n \n19,296\n \nDeferred income taxes\n18\n \n16\n \nLong-term operating lease liabilities\n217\n \n211\n \nDeferred credits and other liabilities\n445\n \n476\n \nNon-Consolidated VIEs\nMartinez Renewables LLC\nOn September 21, 2022, MPC closed on the formation of the Martinez Renewables LLC joint venture. We determined that Martinez Renewables LLC is a VIE because, upon formation, the entity did not have sufficient equity to operate without additional financial support from its owners. We are not the primary beneficiary of this VIE because we do not have the ability to control the activities that significantly influence the economic outcomes of the entity and, therefore, do not consolidate the entity. \nMPLX VIEs\nFor those entities that have been deemed to be VIEs, neither MPLX nor any of its subsidiaries have been deemed to be the primary beneficiary due to voting rights on significant matters. While we have the ability to exercise influence through participation in the management committees which make all significant decisions, we have equal influence over each committee as a joint interest partner and all significant decisions require the consent of the other investors without regard to economic interest and as such we have determined that these entities should not be consolidated and apply the equity method of accounting with respect to our investments in each entity.\nSherwood Midstream LLC (“Sherwood Midstream”) has been deemed the primary beneficiary of Sherwood Midstream Holdings LLC (“Sherwood Midstream Holdings”) due to its controlling financial interest through its authority to manage the joint venture. As a result, Sherwood Midstream consolidates Sherwood Midstream Holdings. \nMPLX’s maximum exposure to loss as a result of its involvement with equity method investments includes its equity investment, any additional capital contribution commitments and any operating expenses incurred by the subsidiary operator in excess of its compensation received for the performance of the operating services. \nWe account for our ownership interest in each of these investments as an equity method investment. See Note 14 for ownership percentages and investment balances\n.\n7. \nRelated Party Transactions\n \nTransactions with related parties were as follows:\n(Millions of dollars)\n2024\n2023\n2022\nSales to related parties\n$\n1,053\n \n$\n915\n \n$\n144\n \nPurchases from related parties\n2,437\n \n1,818\n \n1,175\n \nSales to related parties, which are included in sales and other operating revenues, consist primarily of refined product sales and renewable feedstock sales to certain of our equity affiliates.\nPurchases from related parties are included in cost of revenues. We obtain utilities, transportation services and purchase ethanol and renewable diesel from certain of our equity affiliates.\n \n8. \nEarnings Per Share\n \nWe compute basic earnings per share by dividing net income attributable to MPC less income allocated to participating securities by the weighted average number of shares of common stock outstanding. Since MPC grants certain incentive compensation awards to employees and non-employee directors that are considered to be participating securities, we have calculated our \n93\nT\nable\n of Contents\nearnings per share using the two-class method. Diluted income per share assumes exercise of certain share-based compensation awards, provided the effect is not anti-dilutive.\n(In millions, except per share data)\n2024\n2023\n2022\nIncome from continuing operations, net of tax\n$\n5,067\n \n$\n11,172\n \n$\n15,978\n \nNet income attributable to noncontrolling interest\n(\n1,622\n)\n(\n1,491\n)\n(\n1,534\n)\nNet income allocated to participating securities\n(\n3\n)\n(\n7\n)\n(\n8\n)\nRedemption of preferred units\n—\n \n(\n2\n)\n—\n \nIncome from continuing operations available to common stockholders\n3,442\n \n9,672\n \n14,436\n \nIncome from discontinued operations, net of tax\n—\n \n—\n \n72\n \nIncome available to common stockholders\n$\n3,442\n \n$\n9,672\n \n$\n14,508\n \nWeighted average common shares outstanding:\nBasic\n340\n \n407\n \n512\n \nEffect of dilutive securities\n1\n \n2\n \n4\n \nDiluted\n341\n \n409\n \n516\n \nIncome available to common stockholders per share:\nBasic:\nContinuing operations\n$\n10.11\n \n$\n23.73\n \n$\n28.17\n \nDiscontinued operations\n—\n \n—\n \n0.14\n \nNet income per share\n$\n10.11\n \n$\n23.73\n \n$\n28.31\n \nDiluted:\nContinuing operations\n$\n10.08\n \n$\n23.63\n \n$\n27.98\n \nDiscontinued operations\n—\n \n—\n \n0.14\n \nNet income per share\n$\n10.08\n \n$\n23.63\n \n$\n28.12\n \nPotential common shares which were anti-dilutive and, therefore, omitted from the diluted share calculation, were immaterial for all periods.\n9. Equity \nOn November 5, 2024, MPC announced that our board of directors approved a $\n5.0\n billion share repurchase authorization in addition to the $\n5.0\n billion share repurchase authorization announced on April 30, 2024. Share repurchase authorizations since 2012 totaled $\n60.05\n billion. As of December 31, 2024, $\n7.75\n billion remained available for repurchase under the share repurchase authorizations. These share repurchase authorizations have no expiration date.\nWe may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, tender offers, accelerated share repurchases or open market solicitations for shares, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended, discontinued or restarted at any time.\nTotal share repurchases were as follows for the respective periods:\n(In millions, except per share data)\n2024\n2023\n2022\nNumber of shares repurchased\n53\n \n89\n \n131\n \nCash paid for shares repurchased\n(a)\n$\n9,077\n \n$\n11,572\n \n$\n11,922\n \nAverage cost per share\n(b)\n$\n171.68\n \n$\n131.27\n \n$\n91.20\n \n(a)    \n2024 excludes $\n112\n million paid for excise tax on 2023 share purchases.\n(b)    \nThe average cost per share includes excise tax on share repurchases resulting from the Inflation Reduction Act of 2022, but the excise tax does not reduce the remaining share repurchase authorization.\nThe number of shares repurchased shown above and the amount remaining available under the share repurchase authorizations reflect the repurchase of \n203,173\n common shares for $\n28\n million that were transacted in the fourth quarter of 2024 and settled in the first quarter of 2025.\n \n94\nT\nable\n of Contents\n10. \nSegment Information \nIn the fourth quarter of 2024, we changed the internal financial information regularly provided to our chief operating decision maker (“CODM”) to evaluate the performance of and allocate resources to our reportable segments. We established a Renewable Diesel segment, which includes renewable diesel activities historically reported in the Refining & Marketing segment. This change in reportable segments will enhance comparability of MPC’s reporting with direct peers who report both a refining and renewable diesel segment. \nAll prior periods have been recast for comparability.\nWe have \nthree\n reportable segments: Refining & Marketing, Midstream and Renewable Diesel. Each of these segments is organized and managed based upon the nature of the products and services it offers.\n•\nRefining & Marketing – refines crude oil and other feedstocks at our refineries in the Gulf Coast, Mid-Continent and West Coast regions of the United States, purchases refined products and ethanol for resale and distributes refined products through transportation, storage, distribution and marketing services provided largely by our Midstream segment. We sell refined products to wholesale marketing customers domestically and internationally, to buyers on the spot market, to independent entrepreneurs who operate primarily Marathon\n®\n branded outlets and through long-term supply contracts with direct dealers who operate locations mainly under the ARCO\n®\n brand. \n•\nMidstream – gathers, transports, stores and distributes crude oil, refined products, including renewable diesel, and other hydrocarbon-based products principally for the Refining & Marketing segment via refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes and transports natural gas; and transports, fractionates, stores and markets NGLs. The Midstream segment primarily reflects the results of MPLX.\n•\nRenewable Diesel - processes renewable feedstocks into renewable diesel, markets renewable diesel and distributes renewable products through our Midstream segment and third parties. We sell renewable diesel to wholesale marketing customers, to buyers on the spot market and through long-term supply contracts with direct dealers who operate locations mainly under the ARCO\n®\n brand.\nOur CODM evaluates the performance of our segments using segment adjusted EBITDA. Our CODM is our chief executive officer. The CODM uses adjusted EBITDA by segment results when making decisions about allocating capital and personnel as part of the annual business plan process and ongoing monitoring of performance. Amounts included in income from continuing operations before income taxes and excluded from adjusted EBITDA include: (i) depreciation and amortization; (ii) net interest and other financial costs; (iii) turnaround expenses; and (iv) other adjustments as deemed necessary. These items are either: (i) believed to be non-recurring in nature; (ii) not believed to be allocable or controlled by the segment; or (iii) not tied to the operational performance of the segment. Assets by segment are not a measure used to assess the performance of the company by the CODM and thus are not reported in our disclosures.\n(Millions of dollars)\n2024\n2023\n2022\nSegment adjusted EBITDA for reportable segments\nRefining & Marketing\n5,703\n \n$\n13,705\n \n$\n19,259\n \nMidstream\n6,544\n \n6,171\n \n5,772\n \nRenewable Diesel\n(\n150\n)\n(\n64\n)\n3\n \nTotal reportable segments\n$\n12,097\n \n$\n19,812\n \n$\n25,034\n \n95\nT\nable\n of Contents\n(Millions of dollars)\n2024\n2023\n2022\nReconciliation of segment adjusted EBITDA for reportable segments to income from continuing operations before income taxes\nTotal reportable segments\n$\n12,097\n \n$\n19,812\n \n$\n25,034\n \nCorporate\n(\n774\n)\n(\n737\n)\n(\n698\n)\nRefining & Renewable Diesel planned turnaround costs\n(\n1,404\n)\n(\n1,201\n)\n(\n1,122\n)\nRenewable Diesel JV planned turnaround costs\n(a)\n(\n9\n)\n(\n25\n)\n—\n \nGaryville incident response costs\n—\n \n(\n16\n)\n—\n \nLIFO inventory (charge) credit\n161\n \n(\n145\n)\n148\n \nGain on sale of assets\n(b)\n151\n \n198\n \n1,058\n \nRenewable volume obligation requirements\n(c)\n—\n \n—\n \n238\n \nLitigation\n—\n \n—\n \n27\n \nDepreciation and amortization\n(\n3,337\n)\n(\n3,307\n)\n(\n3,215\n)\nRenewable Diesel JV depreciation and amortization\n(a) \n(\n89\n)\n(\n65\n)\n(\n1\n)\nNet interest and other financial costs\n(\n839\n)\n(\n525\n)\n(\n1,000\n)\nIncome from continuing operations before income taxes\n$\n5,957\n \n$\n13,989\n \n$\n20,469\n \n(a)    \nRepresents MPC’s pro-rata share of expenses from joint ventures included within the Renewable Diesel segment.\n \n(b)    \n2024 includes the gain from the Whistler Joint Venture Transaction (as defined in Note 14). 2023 includes the gain associated with the remeasurement of MPLX’s existing equity investment in MarkWest Torñado GP, L.L.C., arising from the acquisition of the remaining 40 percent interest and the gain on the sale of our interest in South Texas Gateway Terminal LLC. 2022 includes the $\n549\n million gain related to the contribution of assets by MPC on the formation of the Martinez Renewables LLC joint venture and the $\n509\n million gain on lease reclassification. See Notes 14 and 26 for additional information.\n(c)    \nRepresents retroactive changes in renewable volume obligation requirements published by EPA in June 2022 for the 2020 and 2021 annual obligations.\n(Millions of dollars)\n2024\n2023\n2022\nSales and other operating revenues\nRefining & Marketing\nRevenues from external customers\n(a)\n$\n131,588\n \n$\n141,835\n \n$\n171,461\n \nIntersegment revenues\n175\n \n139\n \n135\n \nRefining & Marketing segment revenues\n131,763\n \n141,974\n \n171,596\n \nMidstream\nRevenues from external customers\n(a)\n5,197\n \n4,911\n \n5,366\n \nIntersegment revenues\n5,797\n \n5,597\n \n5,224\n \nMidstream segment revenues\n10,994\n \n10,508\n \n10,590\n \nRenewable Diesel\nRevenues from external customers\n(a)\n2,079\n \n1,633\n \n626\n \nIntersegment revenues\n25\n \n31\n \n126\n \nRenewable Diesel segment revenues\n2,104\n \n1,664\n \n752\n \nTotal segment revenues\n144,861\n \n154,146\n \n182,938\n \nLess: intersegment revenues\n5,997\n \n5,767\n \n5,485\n \nConsolidated sales and other operating revenues\n$\n138,864\n \n$\n148,379\n \n$\n177,453\n \n(a)    \nIncludes sales to related parties. See Note 7 for additional information.\n96\nT\nable\n of Contents\n(Millions of dollars)\n2024\n2023\n2022\nIncome from equity method investments\nRefining & Marketing\n$\n57\n \n$\n66\n \n$\n51\n \nMidstream\n770\n \n735\n \n624\n \nRenewable Diesel\n70\n \n(\n59\n)\n(\n20\n)\nTotal segment income from equity method investments\n897\n \n742\n \n655\n \nCorporate\n(a)\n151\n \n—\n \n—\n \nConsolidated income from equity method investments\n$\n1,048\n \n$\n742\n \n$\n655\n \n(a)    \nRepresents the gain from the Whistler Joint Venture Transaction. See Note 14 for additional information.\n(Millions of dollars)\n2024\n2023\n2022\nSegment expenses\nRefining & Marketing\nCost of purchases\n$\n112,938\n \n$\n115,973\n \n$\n139,660\n \nRefining operating costs\n5,712\n \n5,625\n \n5,726\n \nDistribution costs\n5,857\n \n5,645\n \n5,211\n \nOther segment items\n(a)\n1,610\n \n1,092\n \n1,791\n \nRefining & Marketing segment expenses\n$\n126,117\n \n$\n128,335\n \n$\n152,388\n \nMidstream\nOther segment items\n(b)\n5,220\n \n5,072\n \n5,442\n \nMidstream segment expenses\n$\n5,220\n \n$\n5,072\n \n$\n5,442\n \nRenewable Diesel\nOperating costs\n269\n \n242\n \n106\n \nDistribution costs\n95\n \n82\n \n61\n \nOther segment items\n(c)\n1,960\n \n1,345\n \n562\n \nRenewable Diesel segment expenses\n$\n2,324\n \n$\n1,669\n \n$\n729\n \n(a)    \nOther segment items for the Refining & Marketing segment include costs that are reimbursed by customers through commercial arrangements, as well as LIFO inventory adjustments.\n(b)    \nOther segment items for the Midstream segment include operating expenses and purchased product costs. For purposes of managing Midstream segment of MPC, the CODM is only provided consolidated Midstream expense information.\n(c)    \nOther segment items for the Renewable Diesel segment includes purchased product costs. \n(Millions of dollars)\n2024\n2023\n2022\nDepreciation and amortization\nRefining & Marketing\n$\n1,767\n \n$\n1,822\n \n$\n1,783\n \nMidstream\n1,405\n \n1,320\n \n1,310\n \nRenewable Diesel\n(a)\n75\n \n65\n \n67\n \nTotal segment depreciation and amortization\n3,247\n \n3,207\n \n3,160\n \nCorporate\n90\n \n100\n \n55\n \nConsolidated depreciation and amortization\n$\n3,337\n \n$\n3,307\n \n$\n3,215\n \n(a)    \nExcludes our pro-rata share of Renewable Diesel JV depreciation and amortization of $\n89\n million, $\n65\n million and $\n1\n million in 2024, 2023 and 2022, respectively, which was adjusted for purposes of arriving at Renewable Diesel segment adjusted EBITDA. \n97\nT\nable\n of Contents\n(Millions of dollars)\n2024\n2023\n2022\nCapital expenditures\nRefining & Marketing\n$\n1,445\n \n$\n998\n \n$\n1,275\n \nMidstream\n1,504\n \n1,105\n \n1,069\n \nRenewable Diesel\n8\n \n313\n \n233\n \nTotal segment capital expenditures and investments\n2,957\n \n2,416\n \n2,577\n \nLess investments in equity method investees\n509\n \n480\n \n405\n \nPlus:\nCorporate\n63\n \n83\n \n108\n \nCapitalized interest\n56\n \n55\n \n103\n \nConsolidated capital expenditures\n(a)\n$\n2,567\n \n$\n2,074\n \n$\n2,383\n \n(a)    \nIncludes changes in capital expenditure accruals. See Note 21 for a reconciliation of total capital expenditures to additions to property, plant and equipment as reported in the consolidated statements of cash flows\n.\nNo single customer accounted for more than 10 percent of annual revenues for the years ended December 31, 2024 and December 31, 2023. Sales to Speedway/7-Eleven from the Refining & Marketing segment represented \n10\n percent of our total annual revenues for the year ended December 31, 2022.\n See Note 20 for the disaggregation of our revenue by segment and product line.\nWe do not have significant operations in foreign countries. Therefore, revenues in foreign countries and long-lived assets located in foreign countries, including property, plant and equipment and investments, are not material to our operations.\n11. \nNet Interest and Other Financial Costs \nNet interest and other financial costs were as follows:\n(Millions of dollars)\n2024\n2023\n2022\nInterest income\n$\n(\n376\n)\n$\n(\n530\n)\n$\n(\n191\n)\nInterest expense\n1,365\n \n1,325\n \n1,299\n \nInterest capitalized\n(\n57\n)\n(\n60\n)\n(\n104\n)\nPension and other postretirement non-service costs\n(a)\n(\n38\n)\n(\n89\n)\n3\n \nLoss on extinguishment of debt\n—\n \n9\n \n2\n \nInvestments - net premium (discount) amortization\n(\n91\n)\n(\n142\n)\n(\n30\n)\nOther financial costs\n36\n \n12\n \n21\n \nNet interest and other financial costs\n$\n839\n \n$\n525\n \n$\n1,000\n \n(a)    \nSee Note 24.\n \n98\nT\nable\n of Contents\n12. \nIncome Taxes\nThe provision for income taxes from continuing operations consisted of:\n(Millions of dollars)\n2024\n2023\n2022\nCurrent:\nFederal\n$\n862\n \n$\n2,359\n \n$\n3,565\n \nState and local\n144\n \n475\n \n629\n \nForeign\n8\n \n11\n \n7\n \nTotal current\n1,014\n \n2,845\n \n4,201\n \nDeferred:\nFederal\n(\n90\n)\n18\n \n191\n \nState and local\n(\n33\n)\n(\n46\n)\n98\n \nForeign\n(\n1\n)\n—\n \n1\n \nTotal deferred\n(\n124\n)\n(\n28\n)\n290\n \nIncome tax provision\n$\n890\n \n$\n2,817\n \n$\n4,491\n \nOur effective tax rate for the year ended December 31, 2024 was lower than the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests.\nOur effective tax rate for the year ended December 31, 2023 was lower than the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests, partially offset by state taxes.\nOur effective tax rate for the year ended December 31, 2022 was higher than the U.S. statutory rate primarily due to state taxes, partially offset by permanent tax benefits related to net income attributable to noncontrolling interests.\nA reconciliation of the federal statutory income tax rate to the effective tax rate applied to income from continuing operations before income taxes follows:\n2024\n2023\n2022\nFederal statutory rate \n21\n \n%\n21\n \n%\n21\n \n%\nState and local income taxes, net of federal income tax effects\n2\n \n2\n \n3\n \nNoncontrolling interests\n(\n6\n)\n(\n2\n)\n(\n2\n)\nOther\n(\n2\n)\n(\n1\n)\n—\n \nEffective tax rate applied to income from continuing operations before income taxes\n15\n \n%\n20\n \n%\n22\n \n%\n99\nT\nable\n of Contents\nDeferred tax assets and liabilities resulted from the following:\nDecember 31,\n(Millions of dollars)\n2024\n2023\nDeferred tax assets:\nEmployee benefits\n$\n558\n \n$\n549\n \nEnvironmental remediation\n81\n \n89\n \nFinance lease obligations\n433\n \n365\n \nOperating lease liabilities\n243\n \n229\n \nNet operating loss carryforwards\n39\n \n44\n \nTax credit carryforwards\n22\n \n10\n \nGoodwill and other intangibles\n75\n \n71\n \nOther\n95\n \n96\n \nTotal deferred tax assets\n1,546\n \n1,453\n \nValuation allowance\n(\n51\n)\n(\n28\n)\nTotal net deferred tax assets\n1,495\n \n1,425\n \nDeferred tax liabilities:\nProperty, plant and equipment\n2,584\n \n2,684\n \nInventories\n672\n \n627\n \nInvestments in subsidiaries and affiliates\n3,742\n \n3,706\n \nRight of use assets\n246\n \n230\n \nOther\n20\n \n11\n \nTotal deferred tax liabilities\n7,264\n \n7,258\n \nNet deferred tax liabilities\n$\n5,769\n \n$\n5,833\n \nNet deferred tax liabilities were classified in the consolidated balance sheets as follows:\nDecember 31,\n(Millions of dollars)\n2024\n2023\nAssets:\nOther noncurrent assets\n$\n2\n \n$\n1\n \nLiabilities:\nDeferred income taxes\n5,771\n \n5,834\n \nNet deferred tax liabilities\n$\n5,769\n \n$\n5,833\n \nAt both December 31, 2024 and 2023, federal operating loss carryforwards were $\n3\n million, which includes a mix of indefinite carryforward ability and expiration periods ranging from 2032 through 2034. As of December 31, 2024 and 2023, state and local operating loss and tax credit carryforwards were $\n42\n million and $\n31\n million, respectively, which includes a mix of indefinite carryforward ability and expiration periods ranging from 2029 through 2044. At December 31, 2024 and 2023, foreign operating loss carryforwards were $\n16\n million and $\n20\n million, respectively, which includes expiration periods ranging from 2028 through 2043.\nAs of December 31, 2024 and 2023, $\n51\n million and $\n28\n million of valuation allowances have been recorded related to income taxes, related to realizability of foreign tax operating losses, state tax net operating losses and credits, and related deferred tax assets. \nMPC is continuously undergoing examination of its U.S. federal income tax returns by the Internal Revenue Service (“IRS”). Since 2012, we have continued to participate in the Compliance Assurance Process (“CAP”). CAP is a real-time audit of the U.S. federal income tax return that allows the IRS, working in conjunction with MPC, to determine tax return compliance with the U.S. federal tax law prior to filing the return. This program provides us with greater certainty about our tax liability for years under examination by the IRS. MPLX and its subsidiaries are undergoing examination of its U.S. federal income tax returns by the IRS for the tax years 2019 through 2022. We do not believe the eventual outcome of such audits will have a material impact on our financial statements as of December 31, 2024.\n100\nT\nable\n of Contents\nFurther, we are routinely involved in U.S. state income tax audits. We believe all other audits will be resolved with the amounts provided for these liabilities. As of December 31, 2024, we have various state and local income tax returns subject to examination for years 2016 through 2023, depending on jurisdiction. \nThe following table summarizes the activity in unrecognized tax benefits:\n(Millions of dollars)\n2024\n2023\n2022\nJanuary 1 balance\n$\n38\n \n$\n57\n \n$\n37\n \nAdditions for tax positions of prior years\n—\n \n8\n \n38\n \nReductions for tax positions of prior years\n(\n5\n)\n(\n6\n)\n(\n2\n)\nSettlements\n(\n6\n)\n(\n20\n)\n(\n15\n)\nStatute of limitations\n—\n \n(\n1\n)\n(\n1\n)\nDecember 31 balance\n$\n27\n \n$\n38\n \n$\n57\n \nIf the unrecognized tax benefits as of December 31, 2024 were recognized, $\n27\n million would affect our effective income tax rate. There were $\n7\n million of uncertain tax positions as of December 31, 2024 for which it is reasonably possible that the amount of unrecognized tax benefits would significantly decrease during the next twelve months.\nInterest and penalties related to income taxes are recorded as part of the provision for income taxes. Such interest and penalties were net expenses (benefits) of $(\n2\n) million, less than $(\n1\n) million and $\n1\n million in 2024, 2023 and 2022, respectively. At December 31, 2024 and 2023, $\n2\n million and $\n4\n million of interest and penalties were accrued related to income taxes, respectively.\n13. \nInventories \nDecember 31,\n(Millions of dollars)\n2024\n2023\nCrude oil and other feedstocks\n$\n3,185\n \n$\n3,211\n \nRefined products\n5,137\n \n4,940\n \nMaterials and supplies\n1,246\n \n1,166\n \nTotal\n$\n9,568\n \n$\n9,317\n \nThe cost of inventories of crude oil and other feedstocks and refined products is determined under the LIFO method. The LIFO method accounted for \n87\n percent of total inventory value at both December 31, 2024 and 2023. Current acquisition costs were estimated to exceed the LIFO inventory value at December 31, 2024 and 2023 by $\n2.53\n billion and $\n2.77\n billion, respectively.\n14. \nEquity Method Investments\nRefining & Marketing Segment\nLF Bioenergy Acquisition\nOn March 8, 2023, MPC announced the acquisition of a \n49.9\n percent interest in LF Bioenergy, an emerging producer of renewable natural gas (“RNG”) in the U.S., for approximately $\n56\n million, which included funding for on-going operations and project development. LF Bioenergy has been focused on developing and growing a portfolio of dairy farm-based, low carbon intensity RNG projects. MPC accounts for our ownership interest in LF Bioenergy as an equity method investment.\nWatson Cogeneration Company\nOn June 1, 2022, MPC purchased the remaining \n49\n percent interest in Watson Cogeneration Company from NRG Energy, Inc. for approximately $\n59\n million. This entity is now consolidated and included in our consolidated results. It was previously accounted for as an equity method investment.\nThe excess of the $\n62\n million fair value over the $\n25\n million book value of our \n51\n percent ownership interest in Watson Cogeneration Company resulted in a $\n37\n million gain, which is included in the net gain on disposal of assets line of the accompanying consolidated statements of income.\n \n101\nT\nable\n of Contents\nMidstream Segment - MPLX\nBANGL, LLC Acquisition\nOn July 31, 2024, MPLX exercised its right of first offer under the BANGL, LLC joint venture agreement to purchase an additional \n20\n percent ownership interest in BANGL, LLC for $\n210\n million cash, increasing total ownership interest to \n45\n percent (the “BANGL Transaction”). BANGL is a natural gas liquids pipeline system connecting the Delaware and Midland basins to the fractionation market in the Gulf Coast and export markets. The purchase price of the additional \n20\n percent ownership interest in BANGL, LLC exceeded our portion of the underlying net assets of the joint venture by approximately $\n156\n million. This basis difference is being amortized into net income over the remaining estimated useful lives of the underlying net assets. Following the BANGL Transaction, our investment in BANGL, LLC continues to be accounted for as an equity method investment.\nWhistler Joint Venture Transaction\nOn May 29, 2024, MPLX and its joint venture partner contributed their respective membership interest in Whistler Pipeline, LLC to a newly formed joint venture, WPC Parent, LLC, and issued a \n19\n percent voting interest in WPC Parent, LLC to an affiliate of Enbridge Inc. in exchange for the contribution of cash and the Rio Bravo Pipeline project (collectively the “Whistler Joint Venture Transaction”). As a result of the transaction, MPLX’s voting interest in the joint venture was reduced from \n37.5\n percent to \n30.4\n percent. MPLX recognized a gain of $\n151\n million at closing and received a cash distribution of $\n134\n million, recorded as a return of capital, related to the dilution of the ownership interest. The gain is included in income from equity method investments on the accompanying consolidated statements of income and the return of capital is included in investments - redemptions, repayments, return of capital and sales proceeds within the investing section of the accompanying consolidated statements of cash flows.\nMidstream Acquisition\nOn March 22, 2024, MPLX used $\n625\n million of cash on hand to purchase additional ownership interest in existing joint ventures and gathering assets, which will enhance MPLX’s position in the Utica basin. Prior to the acquisition, MPLX owned an indirect interest in Ohio Gathering Company, L.L.C. (“OGC”) and a direct interest in Ohio Condensate Company, L.L.C. (“OCC”) and now owns a combined \n73\n percent interest in OGC and a \n100\n percent interest in OCC, and a dry gas gathering system in the Utica basin. OGC continues to be accounted for as an equity method investment as MPLX did not obtain control of OGC as a result of the transaction. OGC is considered a VIE and MPLX is not deemed to be the primary beneficiary due to voting rights on significant matters. The acquisition date fair value of our investment in OGC exceeded our portion of the underlying net assets of the joint venture by approximately $\n75\n million. This basis difference is being amortized into net income over the remaining estimated useful lives of the underlying net assets. OCC was previously accounted for as an equity method investment, and it is now consolidated and included in our consolidated financial results. \nThe acquisition was accounted for as a business combination requiring all the acquired assets and liabilities to be remeasured to fair value resulting in a consolidated fair value of net assets and liabilities of $\n625\n million. The fair value includes $\n507\n million related to acquired interests in the joint ventures and the remaining balance related to other acquired assets and liabilities. The revaluation of MPLX’s existing \n62\n percent equity method investment in OCC resulted in a $\n20\n million gain, which is included in net gain on disposal of assets on the accompanying consolidated statements of income. The fair value of equity method investments was based on a discounted cash flow model.\nMarkWest Torñado GP, L.L.C.\nOn December 15, 2023, MPLX used $\n303\n million of cash on hand to purchase the remaining \n40\n percent interest in MarkWest Torñado GP, L.L.C. (“Torñado”) for approximately $\n270\n million, including cash paid for working capital, and to extend the term of a gathering and processing agreement for approximately $\n33\n million. As a result of this transaction, this entity is now consolidated and included in our consolidated financial results. It was previously accounted for as an equity method investment. Torñado provides natural gas gathering and processing related services in the Permian basin. The results for this business are reported within our Midstream segment.\nAt December 15, 2023, the carrying value of MPLX’s \n60\n percent equity investment in Torñado was $\n311\n million. Upon acquisition of the remaining \n40\n percent member interest, the existing equity investment was remeasured to fair value resulting in the recognition of a $\n92\n million gain, which was presented in the net gain on disposal of assets line on the accompanying consolidated statements of income. The fair value of the previously held equity method investment was primarily based on the price negotiated for the \n40\n percent interest in Torñado.\nThe acquisition was accounted for as a business combination. While the purchase price for the \n40\n percent interest was $\n270\n million, all of the Torñado assets and liabilities were remeasured to fair value resulting in a consolidated fair value of net assets and liabilities of $\n673\n million, consisting primarily of property, plant and equipment and identifiable intangible assets. The fair value of property, plant and equipment was based primarily on the cost approach. The fair value of the identifiable intangible assets, consisting of various customer contracts, was primarily based on the multi-period excess earnings method, which is an income approach.\n102\nT\nable\n of Contents\nMidstream Segment - MPC-Retained\nJones Act Blue Water Vessels\nMarathon Coastal Holdings LLC (formerly known as Crowley Coastal Partners LLC, “Coastal Holdings”) was formed in May 2016 as a joint venture to own, through its subsidiaries, four Jones Act mid-range product tankers and three Jones Act series 750 ATB vessels. Prior to October 1, 2024, MPC accounted for our \n50\n percent ownership in Coastal Holdings as an equity method investment.\nOn December 1, 2022, MPC purchased all of Coastal Holdings’ interest in Marathon Tanker Holdings LLC (formerly known as Crowley Ocean Partners LLC, “Tankers Holdings”) and its four subsidiaries, which own the four mid-range product tankers, for approximately $\n485\n million, which included $\n196\n million to pay off the debt associated with the four tankers. Subsequent to the acquisition date, Tankers Holdings is wholly owned by MPC and is included in our consolidated results. \nThe excess of the $\n144\n million fair value over the $\n125\n million book value of our \n50\n percent indirect interest in Tankers Holdings resulted in a $\n19\n million gain, which is included in income from equity method investments on the accompanying consolidated statements of income.\nOn October 1, 2024, MPC paid approximately $\n66\n million in cash to purchase the remaining \n50\n percent interest in Coastal Holdings and its subsidiary, Marathon Blue Water Holdings LLC (formerly known as Crowley Blue Water Partners, LLC, “Blue Water Holdings”), which owns the three ATB vessels, from our joint venture partner. As part of the transaction, MPC assumed Blue Water Holdings’ United States Maritime Administration guaranteed obligations (the “MARAD Debt”) with an aggregate outstanding principal amount and accrued interest value of $\n175\n million as of October 1, 2024. See Note 19 for additional information. Subsequent to the acquisition date, Coastal Holdings is wholly owned by MPC and is included in our consolidated results. \nThe excess of the $\n66\n million fair value over the $\n50\n million book value of our \n50\n percent indirect interest in Coastal Holdings resulted in a $\n16\n million gain, which is included in income from equity method investments on the accompanying consolidated statements of income.\nSouth Texas Gateway Terminal LLC\nOn August 1, 2023, MPC sold its \n25\n percent interest in South Texas Gateway Terminal LLC (“South Texas Gateway”) to an affiliate of Gibson Energy Inc. (“Gibson Energy”). Gibson Energy paid $\n1.1\n billion in cash to acquire 100 percent of the membership interests of South Texas Gateway from MPC and its other members. South Texas Gateway owns an oil export facility in the U.S. Gulf Coast. MPC’s proceeds were $\n270\n million, resulting in a gain of $\n106\n million, which is included in net gain on disposal of assets on the accompanying consolidated statements of income.\nRenewable Diesel Segment\nMartinez Renewables LLC\nOn September 21, 2022, MPC closed on the formation of the Martinez Renewables LLC joint venture. MPC contributed property, plant and equipment, inventory, and working capital with an estimated fair value of $\n1.471\n billion and Neste contributed $\n728\n million in cash. MPC recorded a gain of $\n549\n million resulting from the difference between the carrying value and fair value of the contributed property, plant and equipment and inventory. Subsequent to the closing, the joint venture paid a special distribution to MPC of $\n500\n million, which is reflected as a return of capital in MPC’s consolidated statements of cash flows. After the special distribution, MPC’s investment value in the entity was approximately $\n971\n million. We apply the equity method of accounting with respect to our investment in the entity.\n103\nT\nable\n of Contents\nOwnership as of\nCarrying value at\nDecember 31,\nDecember 31,\n(In millions of dollars, except ownership percentages)\nVIE\n2024\n2024\n2023\nRefining & Marketing\nThe Andersons Marathon Holdings LLC\n50\n%\n$\n190\n \n$\n227\n \nOther\n(a)\nX\n92\n \n75\n \nRefining & Marketing Total\n$\n282\n \n$\n302\n \nMidstream\nMPLX\nBANGL\n45\n%\n$\n281\n \n$\n63\n \nIllinois Extension Pipeline Company, L.L.C.\n35\n%\n218\n \n228\n \nLOOP LLC\n41\n%\n310\n \n314\n \nMarEn Bakken Company LLC\n25\n%\n526\n \n449\n \nMarkWest EMG Jefferson Dry Gas Gathering Company, L.L.C.\nX\n67\n%\n329\n \n336\n \nMarkWest Utica EMG, L.L.C.\nX\n59\n%\n742\n \n676\n \nOhio Gathering Co, LLC\nX\n35\n%\n470\n \n—\n \nSherwood Midstream LLC\nX\n50\n%\n488\n \n500\n \nWPC Parent, LLC\n30\n%\n208\n \n214\n \nOther\n(a)\nX\n959\n \n963\n \nMPLX Total\n$\n4,531\n \n$\n3,743\n \nMPC-Retained\nCapline Pipeline Company LLC\n33\n%\n$\n382\n \n$\n402\n \nGray Oak Pipeline, LLC\n25\n%\n274\n \n284\n \nOther\n(a)\nX\n114\n \n170\n \nMPC-Retained Total\n$\n770\n \n$\n856\n \nMidstream Total\n$\n5,301\n \n$\n4,599\n \nRenewable Diesel\nMartinez Renewables LLC\nX\n50\n%\n$\n1,184\n \n$\n1,266\n \nOther\n(a)\nX\n90\n \n93\n \nRenewable Diesel Total\n$\n1,274\n \n$\n1,359\n \nTotal\n$\n6,857\n \n$\n6,260\n \n(a)    \nSome investments included within “Other” have been deemed to be VIEs.\n    \n104\nT\nable\n of Contents\nSummarized financial information for all equity method investments in affiliated companies, combined, was as follows:\n(Millions of dollars)\n2024\n2023\n2022\nIncome statement data:\nRevenues and other income\n$\n9,259\n \n$\n6,544\n \n$\n5,069\n \nIncome from operations\n2,698\n \n2,428\n \n1,907\n \nNet income\n2,211\n \n2,089\n \n1,740\n \nBalance sheet data – December 31:\nCurrent assets\n$\n2,687\n \n$\n2,610\n \nNoncurrent assets\n24,656\n \n21,098\n \nCurrent liabilities\n1,927\n \n1,569\n \nNoncurrent liabilities\n7,837\n \n6,719\n \nAs of December 31, 2024, the carrying value of our equity method investments was $\n521\n million higher than the underlying net assets of investees. This basis difference is being amortized into net income over the remaining estimated useful lives of the underlying net assets, except for $\n208\n million of excess related to goodwill and other non-depreciable assets. \nDividends and partnership distributions received from equity method investees (excluding distributions that represented a return of capital previously contributed) were $\n1.215\n billion, $\n941\n million and $\n772\n million in 2024, 2023 and 2022, respectively.\n15. \nProperty, Plant and Equipment (PP&E)\n \nDecember 31, 2024\nDecember 31, 2023\n(Millions of dollars)\nGross \nPP&E\nAccumulated Depreciation\nNet \nPP&E\nGross \nPP&E\nAccumulated Depreciation\nNet \nPP&E\nRefining & Marketing\n$\n32,965\n \n$\n19,015\n \n$\n13,950\n \n$\n31,536\n \n$\n17,721\n \n$\n13,815\n \nMidstream\n30,697\n \n10,798\n \n19,899\n \n29,620\n \n9,589\n \n20,031\n \nRenewable Diesel\n976\n \n338\n \n638\n \n960\n \n271\n \n689\n \nCorporate\n1,679\n \n1,138\n \n541\n \n1,632\n \n1,055\n \n577\n \nTotal\n(a)\n$\n66,317\n \n$\n31,289\n \n$\n35,028\n \n$\n63,748\n \n$\n28,636\n \n$\n35,112\n \n(a)    \nIncludes finance leases. See Note 26.\nProperty, plant and equipment includes construction in progress of $\n1.78\n billion and $\n1.40\n billion at December 31, 2024 and 2023, respectively, which primarily relates to capital projects at our refineries and midstream facilities.\n16. \nGoodwill and Intangibles\n \nGoodwill\nMPC annually evaluates goodwill for impairment as of November 30, as well as whenever events or changes in circumstances indicate it is more likely than not that the fair value of a reporting unit with goodwill is less than its carrying amount. There were no impairments of goodwill required based on our annual test of goodwill in 2024 and 2023.\nAt December 31, 2024, MPC had four reporting units with goodwill totaling approximately $\n8.24\n billion. For the annual impairment assessment as of November 30, 2024, management performed only a qualitative assessment for three reporting units as we determined it was more likely than not that the fair value of the reporting units exceeded the carrying value. A quantitative assessment was performed for the remaining reporting unit, which resulted in the fair value of the reporting unit exceeding its carrying value by greater than 10 percent.\n105\nT\nable\n of Contents\nThe changes in the carrying amount of goodwill for 2024 were as follows:\n(Millions of dollars)\nRefining & Marketing\nMidstream\nTotal\nBalance as of December 31, 2022\n$\n561\n \n$\n7,683\n \n$\n8,244\n \nImpairment losses\n—\n \n—\n \n—\n \nBalance as of December 31, 2023\n561\n \n7,683\n \n8,244\n \nImpairment losses\n—\n \n—\n \n—\n \nBalance as of December 31, 2024\n$\n561\n \n$\n7,683\n \n$\n8,244\n \nGross goodwill as of December 31, 2024\n$\n6,141\n \n$\n10,824\n \n$\n16,965\n \nAccumulated impairment losses\n(\n5,580\n)\n(\n3,141\n)\n(\n8,721\n)\nBalance as of December 31, 2024\n$\n561\n \n$\n7,683\n \n$\n8,244\n \nIntangible Assets\nOur definite lived intangible assets as of December 31, 2024 and 2023 are as shown below.\nDecember 31, 2024\nDecember 31, 2023\n(Millions of dollars)\nGross\nAccumulated Amortization\nNet\nGross\nAccumulated Amortization\nNet\nCustomer contracts and relationships\n$\n4,111\n \n$\n2,446\n \n$\n1,665\n \n$\n3,838\n \n$\n2,132\n \n$\n1,706\n \nBrand rights and tradenames\n101\n \n89\n \n12\n \n101\n \n79\n \n22\n \nRoyalty agreements\n141\n \n120\n \n21\n \n173\n \n142\n \n31\n \nOther\n36\n \n31\n \n5\n \n41\n \n35\n \n6\n \nTotal\n$\n4,389\n \n$\n2,686\n \n$\n1,703\n \n$\n4,153\n \n$\n2,388\n \n$\n1,765\n \nAt both December 31, 2024 and 2023, we had indefinite lived intangible assets of $\n71\n million, which are emission allowance credits.\nAmortization expense was $\n266\n million in 2024 and $\n316\n million in 2023. \nEstimated future amortization expense for the next five years related to the intangible assets at December 31, 2024 is as follows:\n(Millions of dollars)\n2025\n$\n250\n \n2026\n230\n \n2027\n202\n \n2028\n180\n \n2029\n16\n \n \n17. \nFair Value Measurements \nFair Values – Recurring\nThe following tables present assets and liabilities accounted for at fair value on a recurring basis as of December 31, 2024 and 2023 by fair value hierarchy level. We have elected to offset the fair value amounts recognized for multiple derivative contracts executed with the same counterparty, including any related cash collateral as shown below; however, fair value amounts by hierarchy level are presented on a gross basis in the following tables.\n106\nT\nable\n of Contents\nDecember 31, 2024\nFair Value Hierarchy\n(Millions of dollars)\nLevel 1\nLevel 2\nLevel 3\nNetting and Collateral\n(a)\nNet Carrying Value on Balance Sheet\n(b)\nCollateral Pledged Not Offset\nAssets:\nCommodity contracts\n$\n139\n \n$\n—\n \n$\n—\n \n$\n(\n132\n)\n$\n7\n \n$\n16\n \nLiabilities:\nCommodity contracts\n$\n144\n \n$\n—\n \n$\n—\n \n$\n(\n144\n)\n$\n—\n \n$\n—\n \nEmbedded derivatives in commodity contracts\n—\n \n—\n \n58\n \n—\n \n58\n \n—\n \nDecember 31, 2023\nFair Value Hierarchy\n(Millions of dollars)\nLevel 1\nLevel 2\nLevel 3\nNetting and Collateral\n(a)\nNet Carrying Value on Balance Sheet\n(b)\nCollateral Pledged Not Offset\nAssets:\nCommodity contracts\n$\n244\n \n$\n—\n \n$\n—\n \n$\n(\n220\n)\n$\n24\n \n$\n73\n \nLiabilities:\nCommodity contracts\n$\n249\n \n$\n—\n \n$\n—\n \n$\n(\n249\n)\n$\n—\n \n$\n—\n \nEmbedded derivatives in commodity contracts\n—\n \n—\n \n61\n \n—\n \n61\n \n—\n \n(a)    \nRepresents the impact of netting assets, liabilities and cash collateral when a legal right of offset exists. As of December 31, 2024, cash collateral of $\n12\n million was netted with mark-to-market derivative liabilities. As of December 31, 2023, cash collateral of $\n29\n million was netted with mark-to-market derivative liabilities.\n(b)    \nWe have no derivative contracts which are subject to master netting arrangements reflected gross on the balance sheet.\nLevel 3 instruments relate to an embedded derivative liability for a natural gas purchase commitment embedded in a keep‑whole processing agreement. The fair value calculation for these Level 3 instruments at December 31, 2024 used significant unobservable inputs including: (1) NGL prices interpolated and extrapolated due to inactive markets ranging from $\n0.65\n to $\n1.54\n per gallon with a weighted average of $\n0.81\n per gallon and (2) a \n100\n percent probability of renewable for the five-year term of the natural gas purchase agreement and related keep-whole processing agreement. Increases or decreases in the fractionation spread result in an increase or decrease in the fair value of the embedded derivative liability. \nThe following is a reconciliation of the beginning and ending balances recorded for net liabilities classified as Level 3 in the fair value hierarchy.\n(Millions of dollars)\n2024\n2023\nBeginning balance\n$\n61\n \n$\n61\n \nUnrealized and realized loss included in net income\n(a)\n10\n \n11\n \nSettlements of derivative instruments\n(\n13\n)\n(\n11\n)\nEnding balance\n$\n58\n \n$\n61\n \nThe amount of total loss for the period included in earnings attributable to the change in unrealized loss relating to liabilities still held at the end of period\n(a)\n:\n$\n7\n \n$\n9\n \n(a)    \nThe gain/loss is included in \ncost of revenues\n on the consolidated statements of income.\nSee Note 18 for the income statement impacts of our derivative instruments.\nFair Values – Non-recurring\nNon-recurring fair value measurements and disclosures in 2024 relate to acquisitions and other transactions as discussed in Note 14.\nNon-recurring fair value measurements and disclosures in 2023 relate primarily to the acquisition of the remaining interest in Torñado as discussed in Note 14. \nNon-recurring fair value measurements and disclosures in 2022 relate primarily to sales-type leases discussed in Note 26 and the Martinez Renewables LLC equity method investment discussed in Note 14. The net investment in sales-type leases was recorded at the estimated fair value of the underlying leased assets at contract modification date. The leased assets were valued \n107\nT\nable\n of Contents\nusing a cost method valuation approach which utilizes Level 3 inputs. The fair value of the Martinez Renewables LLC equity method investment was primarily based on the cash consideration received from Neste for their 50 percent ownership.\nFair Values – Reported\nWe believe the carrying value of our other financial instruments, including cash and cash equivalents, receivables, accounts payable and certain accrued liabilities, approximate fair value. Our fair value assessment incorporates a variety of considerations, including the short-term duration of the instruments and the expected insignificance of bad debt expense, which includes an evaluation of counterparty credit risk. The borrowings under our revolving credit facilities, which include variable interest rates, approximate fair value. The fair value of our long-term debt is based on prices from recent trade activity and is categorized in level 3 of the fair value hierarchy. The carrying and fair values of our debt were approximately $\n26.9\n billion and $\n25.0\n billion at December 31, 2024, respectively, and approximately $\n27.0\n billion and $\n25.5\n billion at December 31, 2023, respectively. These carrying and fair values of our debt exclude the unamortized issuance costs, which are netted against our total debt.\n18. \nDerivatives \nFor further information regarding the fair value measurement of derivative instruments, including any effect of master netting agreements or collateral, see Note 17. See Note 2 for a discussion of the types of derivatives we use and the reasons for them. We do not designate any of our commodity derivative instruments as hedges for accounting purposes.\nThe following table presents the fair value of derivative instruments as of December 31, 2024 and 2023 and the line items in the consolidated balance sheets in which the fair values are reflected. The fair value amounts below are presented on a gross basis and do not reflect the netting of asset and liability positions permitted under the terms of our master netting arrangements including cash collateral on deposit with, or received from, brokers. We offset the recognized fair value amounts for multiple derivative instruments executed with the same counterparty in our financial statements when a legal right of offset exists. As a result, the asset and liability amounts below will not agree with the amounts presented in our consolidated balance sheets.\n(Millions of dollars)\nDecember 31, 2024\nDecember 31, 2023\nBalance Sheet Location\nAsset\nLiability\nAsset\nLiability\nCommodity derivatives\nOther current assets\n$\n139\n \n$\n144\n \n$\n244\n \n$\n249\n \nOther current liabilities\n(a)\n—\n \n10\n \n—\n \n11\n \nDeferred credits and other liabilities\n(a)\n—\n \n48\n \n—\n \n50\n \n(a)    \nIncludes embedded derivatives.\nThe table below summarizes open commodity derivative contracts for crude oil, refined products, blending products and soybean oil as of December 31, 2024. \nPercentage of contracts that expire next quarter\nPosition\n(Units in thousands of barrels)\nLong\nShort\nExchange-traded\n(a)\nCrude oil\n54.5\n%\n47,351\n \n43,785\n \nRefined products\n82.3\n%\n18,086\n \n21,973\n \nBlending products\n93.5\n%\n6,061\n \n6,121\n \nSoybean oil\n97.9\n%\n2,295\n \n2,888\n \n(a)    \nIncluded in exchange-traded are spread contracts in thousands of barrels: Crude oil - \n15,975\n long and \n15,455\n short; Refined products - \n545\n long and \n325\n short and Blending products - 158 long. There are no spread contracts for soybean oil.\nThe following table summarizes the effect of all commodity derivative instruments in our consolidated statements of income:\n(Millions of dollars)\nGain (Loss)\nIncome Statement Location\n2024\n2023\n2022\nSales and other operating revenues\n$\n1\n \n$\n7\n \n$\n—\n \nCost of revenues\n(\n94\n)\n(\n15\n)\n(\n58\n)\nOther income\n2\n \n2\n \n—\n \nTotal\n$\n(\n91\n)\n$\n(\n6\n)\n$\n(\n58\n)\n108\nT\nable\n of Contents\n19. \nDebt \nOur outstanding borrowings at December 31, 2024 and 2023 consisted of the following:\n(Millions of dollars)\nDecember 31,\n2024\nDecember 31,\n2023\nMarathon Petroleum Corporation:\nSenior notes\n$\n5,699\n \n$\n6,449\n \nNotes payable\n—\n \n1\n \nMARAD debt\n174\n \n—\n \nFinance lease obligations\n718\n \n464\n \nTotal\n6,591\n \n6,914\n \nMPLX LP:\nSenior notes\n21,200\n \n20,700\n \nFinance lease obligations\n6\n \n6\n \nTotal\n21,206\n \n20,706\n \nTotal debt\n27,797\n \n27,620\n \nUnamortized debt issuance costs\n(\n142\n)\n(\n141\n)\nUnamortized discount, net of unamortized premium\n(\n174\n)\n(\n196\n)\nAmounts due within one year\n(\n3,049\n)\n(\n1,954\n)\nTotal long-term debt due after one year\n$\n24,432\n \n$\n25,329\n \nCommercial Paper\nWe have in place a commercial paper program that allows us to have a maximum of $\n2.0\n billion in commercial paper outstanding, with maturities up to \n397\n days from the date of issuance. We do not intend to have outstanding commercial paper borrowings in excess of available capacity under the MPC Credit Agreement.\nMPC Senior Notes\n \nDecember 31,\n(Millions of dollars)\n2024\n2023\nSenior notes, 3.625% due September 2024\n—\n \n750\n \nSenior notes, 4.700% due May 2025\n1,250\n \n1,250\n \nSenior notes, 5.125% due December 2026\n719\n \n719\n \nSenior notes, 3.800% due April 2028\n496\n \n496\n \nSenior notes, 6.500% due March 2041\n1,250\n \n1,250\n \nSenior notes, 4.750% due September 2044\n800\n \n800\n \nSenior notes, 5.850% due December 2045\n250\n \n250\n \nSenior notes, 4.500% due April 2048\n498\n \n498\n \nAndeavor senior notes, 3.800% - 5.125% due 2026 – 2048\n36\n \n36\n \nSenior notes, 5.000%, due September 2054\n400\n \n400\n \nTotal\n$\n5,699\n \n$\n6,449\n \n2024 Activity\nOn September 16, 2024, we repaid the $\n750\n million outstanding principal amount of 3.625 percent senior notes due September 2024 at maturity using cash on hand. \nInterest on each series of senior notes is payable semi-annually in arrears. The MPC senior notes are unsecured and unsubordinated obligations of MPC and rank equally with all of MPC’s other existing and future unsecured and unsubordinated indebtedness. The MPC senior notes are non-recourse to our subsidiaries and structurally subordinated to the indebtedness of our subsidiaries, including the outstanding indebtedness of Andeavor and MPLX. The Andeavor senior notes are unsecured, unsubordinated obligations of Andeavor and are non-recourse to MPC and any of MPC’s subsidiaries other than Andeavor.\n109\nT\nable\n of Contents\nMARAD Debt\nDuring the fourth quarter of 2024, MPC purchased the remaining \n50\n percent interest in Coastal Holdings from our joint venture partner and assumed $\n174\n million in aggregate principal amount of MARAD Debt obligations issued by Blue Water Holdings, a subsidiary of Marathon Coastal Holdings LLC, that owns three 750 series ATB Vessels. Blue Water Holdings remains the primary obligor under the MARAD Debt. The U.S. Department of Transportation Maritime Administration (“MARAD”) has guaranteed certain of Blue Water Holdings’ obligations under the MARAD Debt and Blue Water Holdings has agreed to reimburse MARAD for any payments it makes with respect to the MARAD Debt pursuant to the guaranty. Blue Water Holdings’ reimbursement obligations to MARAD with respect to the MARAD Debt are secured by a mortgage on the three ATB Vessels and certain related rights and assets and are guaranteed by MPC. \nThe MARAD Debt is comprised of $\n55\n million aggregate principal amount of 3.432% bonds due 2036, $\n57\n million aggregate principal amount of 3.477% bonds due 2037 and $\n62\n million aggregate principal amount of 3.609% bonds due 2038. The agreements that govern the MARAD Debt, including the indenture, security agreement and guarantee contain customary representations and warranties as well as affirmative and negative covenants, events of defaults and other provisions, we believe are typical for U.S. government guaranteed obligations of this type. As of December 31, 2024, we were in compliance with the covenants contained in the MARAD Debt documents.\nMPLX Senior Notes\n \nDecember 31,\n(Millions of dollars)\n2024\n2023\nSenior notes, 4.875% due December 2024\n$\n—\n \n$\n1,149\n \nSenior notes, 4.000% due February 2025\n500\n \n500\n \nSenior notes, 4.875% due June 2025\n1,189\n \n1,189\n \nMarkWest senior notes, 4.875% due 2024 – 2025\n11\n \n12\n \nSenior notes, 1.750% due March 2026\n1,500\n \n1,500\n \nSenior notes, 4.125% due March 2027\n1,250\n \n1,250\n \nSenior notes, 4.250% due December 2027\n732\n \n732\n \nSenior notes, 4.000% due March 2028\n1,250\n \n1,250\n \nSenior notes, 4.800% due February 2029\n750\n \n750\n \nSenior notes, 2.650% due August 2030\n1,500\n \n1,500\n \nSenior notes, 4.950% due September 2032\n1,000\n \n1,000\n \nSenior notes, 5.000% due March 2033\n1,100\n \n1,100\n \nSenior notes, 5.500% due June 2034\n1,650\n \n—\n \nSenior notes, 4.500% due April 2038\n1,750\n \n1,750\n \nSenior notes, 5.200% due March 2047\n1,000\n \n1,000\n \nSenior notes, 5.200% due December 2047\n487\n \n487\n \nANDX senior notes, 4.250% - 5.200% due 2027 – 2047\n31\n \n31\n \nSenior notes, 4.700% due April 2048\n1,500\n \n1,500\n \nSenior notes, 5.500% due February 2049\n1,500\n \n1,500\n \nSenior notes, 4.950% due March 2052\n1,500\n \n1,500\n \nSenior notes, 5.650% due March 2053\n500\n \n500\n \nSenior notes, 4.900% due April 2058\n500\n \n500\n \nTotal\n$\n21,200\n \n$\n20,700\n \n2024 Activity\nOn May 20, 2024, MPLX issued $\n1.65\n billion aggregate principal amount of 5.50 percent senior notes due June 2034 (the “2034 Senior Notes”) in an underwritten public offering. On December 1, 2024, MPLX used $\n1,150\n million of the net proceeds from the issuance of the 2034 Senior Notes to repay all of (i) MPLX's outstanding $\n1,149\n million aggregate principal amount of 4.875 percent senior notes due December 2024 and (ii) MarkWest's outstanding $\n1\n million aggregate principal amount of 4.875 percent senior notes due December 2024. On February 18, 2025, MPLX used the remaining net proceeds from the issuance of the 2034 Senior Notes to repay all of MPLX's outstanding $\n500\n million aggregate principal amount of 4.000 percent senior notes due February 2025.\n110\nT\nable\n of Contents\n2023 Activity\nOn February 9, 2023, MPLX issued $\n1.6\n billion aggregate principal amount of senior notes in a public offering, consisting of $\n1.1\n billion aggregate principal amount of 5.00 percent senior notes due March 2033 and $\n500\n million aggregate principal amount of 5.65 percent senior notes due March 2053. On February 15, 2023, MPLX used $\n600\n million of the net proceeds to redeem all of the outstanding Series B preferred units. On March 13, 2023, MPLX used the remaining proceeds to redeem all of MPLX’s and MarkWest’s $\n1.0\n billion aggregate principal amount of 4.50 percent senior notes due July 2023.The redemption resulted in a loss on extinguishment of debt of $\n9\n million due to the immediate expense recognition of unamortized debt discount and issuance costs.\nInterest on each series of MPLX fixed rate senior notes is payable semi-annually in arrears. The MPLX senior notes are unsecured, unsubordinated obligations of MPLX and are non-recourse to MPC and its subsidiaries other than MPLX and MPLX GP LLC, as the general partner of MPLX. The MPLX senior notes are non-recourse to MPLX’s subsidiaries and structurally subordinated to the indebtedness of MPLX’s subsidiaries.\nSchedule of Maturities\nPrincipal maturities of long-term debt, excluding finance lease obligations, as of December 31, 2024 for the next five years are as follows:\n(Millions of dollars)\n2025\n$\n2,964\n \n2026\n2,263\n \n2027\n2,014\n \n2028\n1,764\n \n2029\n764\n \nAvailable Capacity under our Facilities as of December 31, 2024 \n(Millions of dollars)\nTotal\nCapacity\nOutstanding\nBorrowings\nOutstanding\nLetters\nof Credit\nAvailable\nCapacity\nWeighted\nAverage\nInterest \nRate\nExpiration\nMPC, excluding MPLX\nMPC bank revolving credit facility\n$\n5,000\n \n$\n—\n \n$\n1\n \n$\n4,999\n \n—\n \nJuly 2027\nMPC trade receivables securitization facility\n(a)\n100\n \n—\n \n—\n \n100\n \n—\n \nSeptember 2027\nMPLX\nMPLX bank revolving credit facility\n2,000\n \n—\n \n—\n \n2,000\n \n—\n \nJuly 2027\n(a)    \nThe committed borrowing and letter of credit issuance capacity under the trade receivables securitization facility is $\n100\n million. In addition, the facility allows for the issuance of letters of credit in excess of the committed capacity at the discretion of the issuing banks.\nMPC Bank Revolving Credit Facility\nMPC’s credit agreement (the “MPC Credit Agreement”) matures in July 2027 and, provides for a $\n5.0\n billion unsecured revolving credit facility and letter of credit issuing capacity under the facility of up to $\n2.2\n billion. Letters of credit issuing capacity is included in, not in addition to, the $\n5.0\n billion borrowing capacity.\nMPC has an option under the MPC Credit Agreement to increase the aggregate commitments by up to an additional $\n1.0\n billion, subject to, among other conditions, the consent of the lenders whose commitments would be increased. In addition, the maturity date may be extended, for up to \ntwo\n additional one year periods, subject to, among other conditions, the approval of lenders holding the majority of the commitments then outstanding, provided that the commitments of any non-consenting lenders will terminate on the then-effective maturity date. The MPC Credit Agreement includes sub-facilities for swing-line loans of up to $\n250\n million and letters of credit of up to $\n2.2\n billion (which may be increased to up to $\n3.0\n billion upon receipt of additional letter of credit issuing commitments).\nBorrowings under the MPC Credit Agreement bear interest, at our election, \nat either the Adjusted Term SOFR or the Alternate Base Rate, both as defined in the MPC Credit Agreement, plus an applicable margin\n. We are charged various fees and expenses in connection with the agreement, including administrative agent fees, commitment fees on the unused portion of the commitments and fees with respect to issued and outstanding letters of credit. The applicable margins to the benchmark interest rates and the commitment fees payable under the MPC Credit Agreement fluctuate based on changes, if any, to our credit ratings.\n111\nT\nable\n of Contents\nThe MPC Credit Agreement contains certain representations and warranties, affirmative and restrictive covenants and events of default that we consider to be usual and customary for arrangements of this type, including a financial covenant that requires us to maintain a ratio of Consolidated Net Debt to Total Capitalization, each as defined in the MPC Credit Agreement, of no greater than \n0.65\n to 1.00 as of the last day of each fiscal quarter. The covenants also restrict, among other things, our ability and/or the ability of certain of our subsidiaries to incur debt, create liens on assets or enter into transactions with affiliates. As of December 31, 2024, we were in compliance with the covenants contained in the MPC Credit Agreement. \nTrade Receivables Securitization Facility\n \nOn September 30, 2021, we entered into a Loan and Security Agreement and related documentation with a group of lenders providing for a new trade receivables securitization facility having $\n100\n million of committed borrowing and letter of credit issuance capacity and uncommitted borrowing and letter of credit issuance capacity that can be extended at the discretion of the lenders, provided that at no time may outstanding borrowings and letters of credit issued under the facility exceed the balance of eligible trade receivables (as calculated in accordance with the Loan and Security Agreement) that are pledged as collateral under the facility. In September 2024, the trade receivables securitization facility was amended to, among other things, extend its term until September 30, 2027.\nThe trade receivables facility consists of certain of our wholly owned subsidiaries (“Originators”) selling or contributing on an on-going basis all of the trade receivables generated by them (the “Pool Receivables”), together with all related security and interests in the proceeds thereof, without recourse, to another wholly owned, bankruptcy-remote special purpose subsidiary, MPC Trade Receivables Company I LLC (“TRC”), in exchange for a combination of cash, equity and/or borrowings under a subordinated note issued by TRC to one or more of the Originators. TRC may request borrowings and extensions of credit under the Loan and Security Agreement for up to the lesser of the maximum capacity under the facility or the eligible trade receivables balance of the Pool Receivables. TRC and each of the Originators have granted a security interest in all of their rights, title and interests in and to the Pool Receivables, together with all related security and interests in the proceeds thereof, to the lenders to secure the performance of TRC’s and the Originators’ payment and other obligations under the facility. In addition, MPC has issued a performance guaranty in favor of the lenders guaranteeing the performance by TRC and the Originators of their obligations under the facility.\nTo the extent that TRC retains an ownership interest in the Pool Receivables, such interest will be included in our consolidated financial statements solely as a result of the consolidation of the financial statements of TRC with those of MPC. The receivables sold or contributed to TRC are available first and foremost to satisfy claims of the creditors of TRC and are not available to satisfy the claims of creditors of MPC. TRC has granted a security interest in all of its assets to the lenders to secure its obligations under the Loan and Security Agreement.\nTRC pays floating-rate interest charges and usage fees on amounts outstanding under the trade receivables facility, if any, unused fees on the portion of unused commitments and certain other fees related to the administration of the facility and letters of credit that are issued and outstanding under the trade receivables facility. \nThe Loan and Security Agreement and other documents comprising the facility contain representations and covenants that we consider usual and customary for arrangements of this type. Trade receivables are subject to customary criteria, limits and reserves before being deemed to be eligible receivables that count towards the borrowing base under the trade receivables facility. In addition, the lender’s commitments to extend loans and credits under the facility are subject to termination, and TRC may be subject to default fees, upon the occurrence of certain events of default that are included in the Loan and Security Agreement and other facility documentation, all of which we consider to be usual and customary for arrangements of this type. As of December 31, 2024, we were in compliance with the covenants contained in the Loan and Security Agreement and other facility documentation.\nMPLX Bank Revolving Credit Facility \nMPLX’s credit agreement (the “MPLX Credit Agreement”) matures in July 2027 and, among other things, provides for a $\n2.0\n billion unsecured revolving credit facility and letter of credit issuing capacity under the facility of up to $\n150\n million. Letters of credit issuing capacity is included in, not in addition to, the $\n2.0\n billion borrowing capacity. \nThe borrowing capacity under the MPLX Credit Agreement may be increased by up to an additional $\n1.0\n billion, subject to certain conditions, including the consent of the lenders whose commitments would increase. In addition, the maturity date may be extended, for up to \ntwo\n additional one year periods, subject to, among other conditions, the approval of lenders holding the majority of the commitments then outstanding, provided that the commitments of any non-consenting lenders will terminate on the then-effective maturity date.\nBorrowings under the MPLX Credit Agreement bear interest, \nat MPLX’s election, at either the Adjusted Term SOFR or the Alternate Base Rate, both as defined in the MPLX Credit Agreement, plus an applicable margin\n. MPLX is charged various fees and expenses in connection with the agreement, including administrative agent fees, commitment fees on the unused portion of the commitments and fees with respect to issued and outstanding letters of credit. The applicable margins to the benchmark interest rates and the commitment fees payable under the MPLX Credit Agreement fluctuate based on changes, if any, to MPLX’s credit ratings. \n112\nT\nable\n of Contents\nThe MPLX Credit Agreement contains certain representations and warranties, affirmative and restrictive covenants and events of default that we consider to be usual and customary for an agreement of this type, including a financial covenant that requires MPLX to maintain a ratio of Consolidated Total Debt as of the end of each fiscal quarter to Consolidated EBITDA, both as defined in the MPLX Credit Agreement, for the prior \nfour\n fiscal quarters of no greater than \n5.0\n to 1.0 (or \n5.5\n to 1.0 for up to two fiscal quarters following certain acquisitions). Consolidated EBITDA is subject to adjustments for certain acquisitions completed and capital projects undertaken during the relevant period. The covenants also restrict, among other things, MPLX’s ability and/or the ability of certain of its subsidiaries to incur debt, create liens on assets and enter into transactions with affiliates. As of December 31, 2024, MPLX was in compliance with the covenants contained in the MPLX Credit Agreement.\n20. Revenue\nThe following table presents our revenues from external customers disaggregated by segment and product line:\n(Millions of dollars)\n2024\n2023\n2022\nRefining & Marketing\nRefined products\n$\n122,429\n \n$\n132,675\n \n$\n160,737\n \nCrude oil\n7,298\n \n7,423\n \n8,962\n \nServices and other\n1,861\n \n1,737\n \n1,762\n \nTotal revenues from external customers\n131,588\n \n141,835\n \n171,461\n \nMidstream\nRefined products\n1,668\n \n1,675\n \n2,219\n \nServices and other\n(a)\n3,529\n \n3,236\n \n3,147\n \nTotal revenues from external customers\n5,197\n \n4,911\n \n5,366\n \nRenewable Diesel\nRefined products\n2,073\n \n1,628\n \n625\n \nServices and other\n6\n \n5\n \n1\n \nTotal revenues from external customers\n2,079\n \n1,633\n \n626\n \nSales and other operating revenues\n$\n138,864\n \n$\n148,379\n \n$\n177,453\n \n(a)    \nIncludes sales-type lease revenue. See Note 26.\nWe do not disclose information on the future performance obligations for any contract with expected duration of one year or less at inception. As of December 31, 2024, we do not have future performance obligations that are material to future periods. \nReceivables\nOn the accompanying consolidated balance sheets, receivables, less allowance for doubtful accounts primarily consists of customer receivables. Significant, non-customer balances included in our receivables at December 31, 2024 include matching buy/sell receivables of $\n4.3\n billion.\n \n113\nT\nable\n of Contents\n21. \nSupplemental Cash Flow Information\n(Millions of dollars)\n2024\n2023\n2022\nNet cash provided by operating activities included:\nInterest paid (net of amounts capitalized)\n$\n1,247\n \n$\n1,200\n \n$\n1,060\n \nIncome taxes paid to taxing authorities\n(a)\n732\n \n2,751\n \n4,869\n \nCash paid for amounts included in the measurement of lease liabilities\nPayments on operating leases\n532\n \n493\n \n498\n \nInterest payments under finance lease obligations\n25\n \n25\n \n24\n \nNet cash provided by financing activities included:\nPrincipal payments under finance lease obligations\n82\n \n79\n \n79\n \nNon-cash investing and financing activities:\nRight of use assets obtained in exchange for new operating lease obligations\n637\n \n465\n \n367\n \nRight of use assets obtained in exchange for new finance lease obligations\n302\n \n21\n \n60\n \nContribution of assets\n(b)\n—\n \n—\n \n818\n \nBook value of equity method investment\n(c)\n50\n \n311\n \n150\n \n(a)    \n2024 includes $\n565\n million paid to third parties for transferable tax credits.\n(b)    \nRepresents the book value of property, plant and equipment, inventory and working capital contributed by MPC to Martinez Renewables LLC. See Note 14 for additional information.\n(c)\n    \n2024 represents the book value of Coastal Holdings prior to MPC buying out the remaining \n50\n percent interest from our joint venture partner. 2023 represents the book value of MPLX’s equity method investment in Torñado, prior to MPLX buying out the remaining interest in this entity. 2022 represents the book value of MPC’s equity method investment in Watson Cogeneration Company and Tanker Holdings of $\n25\n million and $\n125\n million, respectively, prior to MPC buying out the remaining interest in these entities. See Note 14 for additional information.\nThe consolidated statements of cash flows exclude changes to the consolidated balance sheets that did not affect cash. The following is a reconciliation of additions to property, plant and equipment to total capital expenditures:\n(Millions of dollars)\n2024\n2023\n2022\nAdditions to property, plant and equipment per the consolidated statements of cash flows\n$\n2,533\n \n$\n1,890\n \n$\n2,420\n \nIncrease (decrease) in capital accruals\n34\n \n184\n \n(\n37\n)\nTotal capital expenditures\n$\n2,567\n \n$\n2,074\n \n$\n2,383\n \n22. Other Current Liabilities\nThe following summarizes the components of other current liabilities:\nDecember 31,\n(Millions of dollars)\n2024\n2023\nEnvironmental credits liability\n$\n422\n \n$\n778\n \nAccrued interest payable\n314\n \n316\n \nOther current liabilities\n419\n \n551\n \nTotal other current liabilities\n$\n1,155\n \n$\n1,645\n \n114\nT\nable\n of Contents\n23. Accumulated Other Comprehensive Income (Loss) \nThe following table shows the changes in accumulated other comprehensive income (loss) by component. Amounts in parentheses indicate debits.\n(Millions of dollars)\nPension Benefits\nOther Benefits\nOther\nTotal\nBalance as of December 31, 2021\n$\n(\n117\n)\n$\n49\n \n$\n1\n \n$\n(\n67\n)\nOther comprehensive income (loss) before reclassifications, net of tax of $\n11\n(\n70\n)\n129\n \n(\n1\n)\n58\n \nAmounts reclassified from accumulated other comprehensive loss:\nAmortization of prior service credit\n(a)\n(\n45\n)\n(\n22\n)\n— \n(\n67\n)\nAmortization of actuarial loss\n(a)\n4\n \n6\n \n— \n10\n \nSettlement loss\n(a)\n79\n \n—\n \n— \n79\n \nTax effect\n(\n14\n)\n3\n \n—\n \n(\n11\n)\nOther comprehensive income (loss)\n(\n46\n)\n116\n \n(\n1\n)\n69\n \nBalance as of December 31, 2022\n(\n163\n)\n165\n \n—\n \n2\n \nOther comprehensive income (loss) before reclassifications, net of tax of $(\n22\n)\n(\n60\n)\n(\n21\n)\n2\n \n(\n79\n)\nAmounts reclassified from accumulated other comprehensive loss:\nAmortization of prior service credit\n(a)\n(\n45\n)\n(\n22\n)\n— \n(\n67\n)\nAmortization of actuarial gain\n(a)\n(\n5\n)\n—\n \n— \n(\n5\n)\nSettlement gain\n(a)\n(\n1\n)\n—\n \n— \n(\n1\n)\nOther\n— \n— \n(\n1\n)\n(\n1\n)\nTax effect\n13\n \n7\n \n—\n \n20\n \nOther comprehensive income (loss)\n(\n98\n)\n(\n36\n)\n1\n \n(\n133\n)\nBalance as of December 31, 2023\n(\n261\n)\n129\n \n1\n \n(\n131\n)\nOther comprehensive income (loss) before reclassifications, net of tax of $\n16\n44\n \n10\n \n(\n2\n)\n52\n \nAmounts reclassified from accumulated other comprehensive loss:\nAmortization of prior service credit\n(a)\n(\n33\n)\n(\n22\n)\n— \n(\n55\n)\nAmortization of actuarial loss\n(a)\n6\n \n—\n \n— \n6\n \nSettlement loss\n(a)\n3\n \n—\n \n— \n3\n \nTax effect\n6\n \n5\n \n—\n \n11\n \nOther comprehensive income (loss)\n26\n \n(\n7\n)\n(\n2\n)\n17\n \nBalance as of December 31, 2024\n$\n(\n235\n)\n$\n122\n \n$\n(\n1\n)\n$\n(\n114\n)\n(a)    \nThese accumulated other comprehensive loss components are included in the computation of net periodic benefit cost. See Note 24.\n24. \nPension and Other Postretirement Benefits\n \nWe have two noncontributory defined benefit pension plans. One plan is frozen and covered certain employees of our former Speedway LLC subsidiary. The other plan is active and covers substantially all of our employees. Benefits under these plans are based on a now frozen final average pay type of benefit based on age, years of service and final average pensionable earnings, and a cash balance type of benefit. The years of service component for the final average pay type of benefit was frozen as of December 31, 2009, and certain of the pensionable earnings components were frozen as of December 31, 2012. Benefits for the cash balance type of benefit began on January 1, 2010 for our continuing active plan, and began on January 1, 2016 for our frozen plan, and are based on a cash balance formula with an annual percentage of eligible pay credited based upon age and years of service or at a flat rate of eligible pay, depending on covered employee group. Substantially all of our employees also accrue benefits under a defined contribution plan.\n \n(Millions of dollars)\n2024\n2023\n2022\nCash balance weighted average interest crediting rates\n4.56\n \n%\n3.57\n \n%\n3.00\n \n%\n115\nT\nable\n of Contents\nWe also have other postretirement benefits covering most employees. Retiree health care benefits are provided through comprehensive hospital, surgical, major medical benefit, prescription drug and related health benefit provisions subject to various cost sharing features. Retiree life insurance benefits are provided to a closed group of retirees. Other postretirement benefits are not funded in advance. \nIn connection with the Andeavor acquisition, we assumed a number of additional qualified and nonqualified noncontributory benefit pension plans, covering substantially all former Andeavor employees. Benefits under these plans are determined based on final average compensation and years of service through December 31, 2010 and a cash balance formula for service beginning January 1, 2011. These plans were frozen as of December 31, 2018. Further, as of December 31, 2019, the qualified plans were merged with our existing qualified plans in which the actuarial assumptions were materially the same between the plans. We also assumed a number of additional postretirement benefits covering eligible employees. These benefits were merged with our existing benefits beginning January 1, 2019. \nObligations and Funded Status\n \nThe accumulated benefit obligation for all defined benefit pension plans was $\n2,579\n million and $\n2,441\n million as of December 31, 2024 and 2023.\nThe following summarizes the projected benefit obligations and funded status for our defined benefit pension and other postretirement plans:\n \nPension Benefits\nOther Benefits\n(Millions of dollars)\n2024\n2023\n2024\n2023\nBenefit obligations at January 1\n$\n2,563\n \n$\n2,359\n \n$\n679\n \n$\n650\n \nService cost\n219\n \n195\n \n21\n \n18\n \nInterest cost\n122\n \n116\n \n32\n \n31\n \nActuarial (gain) loss\n(\n32\n)\n184\n \n(\n14\n)\n31\n \nBenefits paid\n(\n187\n)\n(\n291\n)\n(\n49\n)\n(\n51\n)\nBenefit obligations at December 31\n2,685\n \n2,563\n \n669\n \n679\n \nFair value of plan assets at January 1\n2,082\n \n1,838\n \n—\n \n—\n \nActual return on plan assets\n161\n \n266\n \n—\n \n—\n \nEmployer contributions\n102\n \n269\n \n49\n \n51\n \nBenefits paid from plan assets\n(\n187\n)\n(\n291\n)\n(\n49\n)\n(\n51\n)\nFair value of plan assets at December 31\n2,158\n \n2,082\n \n—\n \n—\n \nFunded status at December 31\n$\n(\n527\n)\n$\n(\n481\n)\n$\n(\n669\n)\n$\n(\n679\n)\nAmounts recognized in the consolidated balance sheet for our pension and other postretirement benefit plans at December 31 include:\n \nPension Benefits\nOther Benefits\n(Millions of dollars)\n2024\n2023\n2024\n2023\nNoncurrent assets\n$\n22\n \n$\n—\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n11\n)\n(\n8\n)\n(\n50\n)\n(\n50\n)\nNoncurrent liabilities\n(\n538\n)\n(\n473\n)\n(\n619\n)\n(\n629\n)\nAccrued benefit cost\n$\n(\n527\n)\n$\n(\n481\n)\n$\n(\n669\n)\n$\n(\n679\n)\nIncluded in accumulated other comprehensive loss at December 31 were the following before-tax amounts that had not been recognized in net periodic benefit cost:\n \nPension Benefits\nOther Benefits\n(Millions of dollars)\n2024\n2023\n2024\n2023\nNet actuarial loss\n$\n404\n \n$\n467\n \n$\n36\n \n$\n50\n \nPrior service credit\n(\n36\n)\n(\n69\n)\n(\n181\n)\n(\n202\n)\n116\nT\nable\n of Contents\nAmounts exclude those related to LOOP and Explorer, equity method investees with defined benefit pension and postretirement plans for which net losses (gains) of $(\n7\n) million and $\n4\n million were recorded in accumulated other comprehensive income (loss) in 2024, reflecting our ownership share.\nComponents of Net Periodic Benefit Cost and Other Comprehensive (Income) Loss\n \nThe following summarizes the net periodic benefit costs and the amounts recognized as other comprehensive loss (pretax) for our defined benefit pension and other postretirement plans.\n \nPension Benefits\nOther Benefits\n(Millions of dollars)\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n227\n \n$\n201\n \n$\n230\n \n$\n21\n \n$\n18\n \n$\n26\n \nInterest cost\n122\n \n116\n \n102\n \n32\n \n31\n \n21\n \nExpected return on plan assets\n(\n146\n)\n(\n163\n)\n(\n142\n)\n—\n \n—\n \n—\n \nAmortization of prior service credit\n(\n33\n)\n(\n45\n)\n(\n45\n)\n(\n22\n)\n(\n22\n)\n(\n22\n)\nAmortization of actuarial (gain) loss\n6\n \n(\n5\n)\n4\n \n—\n \n—\n \n6\n \nSettlement (gain) loss\n3\n \n(\n1\n)\n79\n \n—\n \n—\n \n—\n \nNet periodic benefit cost\n(a)\n$\n179\n \n$\n103\n \n$\n228\n \n$\n31\n \n$\n27\n \n$\n31\n \nActuarial (gain) loss\n$\n(\n54\n)\n$\n75\n \n$\n109\n \n$\n(\n15\n)\n$\n31\n \n$\n(\n167\n)\nAmortization of actuarial (gain) loss\n(\n9\n)\n6\n \n(\n83\n)\n—\n \n—\n \n(\n6\n)\nAmortization of prior service credit\n33\n \n45\n \n45\n \n22\n \n22\n \n22\n \nTotal recognized in other comprehensive (income) loss\n$\n(\n30\n)\n$\n126\n \n$\n71\n \n$\n7\n \n$\n53\n \n$\n(\n151\n)\nTotal recognized in net periodic benefit cost and other comprehensive (income) loss\n$\n149\n \n$\n229\n \n$\n299\n \n$\n38\n \n$\n80\n \n$\n(\n120\n)\n(a)    \nNet periodic benefit cost reflects a calculated market-related value of plan assets which recognizes changes in fair value over three years.\nThe components of net periodic benefit cost, other than the service cost component, are included in net interest and other financial costs on the consolidated statements of income.\nFor certain of our pension plans, lump sum payments to employees retiring in 2024, 2023 and 2022 exceeded the plan’s total service and interest costs expected for those years. Settlement losses are required to be recorded when lump sum payments exceed total service and interest costs. As a result, pension settlement expenses were recorded in 2024, 2023 and 2022.\nPlan Assumptions\nThe following summarizes the assumptions used to determine the benefit obligations at December 31, and net periodic benefit cost for the defined benefit pension and other postretirement plans for 2024, 2023 and 2022.\nPension Benefits\nOther Benefits\n \n2024\n2023\n2022\n2024\n2023\n2022\nBenefit obligation:\nDiscount rate\n5.55\n \n%\n4.85\n \n%\n5.04\n \n%\n5.58\n \n%\n4.88\n \n%\n5.08\n \n%\nRate of compensation increase\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\nNet periodic benefit cost:\nDiscount rate\n4.85\n \n%\n5.10\n \n%\n3.33\n \n%\n4.88\n \n%\n5.08\n \n%\n2.93\n \n%\nExpected long-term return on plan assets\n6.80\n \n%\n7.00\n \n%\n5.75\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\nRate of compensation increase\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\n4.18\n \n%\nExpected Long-term Return on Plan Assets\nThe overall expected long-term return on plan assets assumption is determined based on an asset rate-of-return modeling tool developed by a third-party investment group. The tool utilizes underlying assumptions based on actual returns by asset category and inflation and takes into account our asset allocation to derive an expected long-term rate of return on those assets. Capital \n117\nT\nable\n of Contents\nmarket assumptions reflect the long-term capital market outlook. The assumptions for equity and fixed income investments are developed using a building-block approach, reflecting observable inflation information and interest rate information available in the fixed income markets. Long-term assumptions for other asset categories are based on historical results, current market characteristics and the professional judgment of our internal and external investment teams\n. \nAssumed Health Care Cost Trend\nThe following summarizes the assumed health care cost trend rates.\n \nDecember 31,\n \n2024\n2023\n2022\nHealth care cost trend rate assumed for the following year:\nMedical: Pre-65\n7.90\n \n%\n7.70\n \n%\n6.60\n \n%\nPrescription drugs\n12.50\n \n%\n10.80\n \n%\n8.90\n \n%\nRate to which the cost trend rate is assumed to decline (the ultimate trend rate):\nMedical: Pre-65\n4.50\n \n%\n4.50\n \n%\n4.50\n \n%\nPrescription drugs\n4.50\n \n%\n4.50\n \n%\n4.50\n \n%\nYear that the rate reaches the ultimate trend rate:\nMedical: Pre-65\n2034\n2032\n2031\nPrescription drugs\n2034\n2032\n2031\nIncreases in the post-65 medical plan premium for the Marathon Petroleum Health Plan and the Marathon Petroleum Retiree Health Plan have been permanently eliminated.\nPlan Investment Policies and Strategies\nThe investment policies for our pension plan assets reflect the funded status of the plans and expectations regarding our future ability to make further contributions. Long-term investment goals are to: (1) manage the assets in accordance with the legal requirements of all applicable laws; (2) diversify plan investments across asset classes to achieve an optimal balance between risk and return and between income and growth of assets through capital appreciation; and (3) source benefit payments primarily through existing plan assets and anticipated future returns.\nThe investment goals are implemented to manage the plans’ funded status volatility and minimize future cash contributions. The asset allocation strategy will change over time in response to changes primarily in funded status, which is dictated by current and anticipated market conditions, the independent actions of our investment committee, required cash flows to and from the plans and other factors deemed appropriate. Such changes in asset allocation are intended to allocate additional assets to the fixed income asset class should the funded status improve. The fixed income asset class shall be invested in such a manner that its interest rate sensitivity correlates highly with that of the plans’ liabilities. Other asset classes are intended to provide additional return with associated higher levels of risk. Investment performance and risk is measured and monitored on an ongoing basis through quarterly investment meetings and periodic asset and liability studies\n. At December 31, 2024, the primary plan’s targeted asset allocation was \n50\n percent equity, private equity, real estate, and timber securities and \n50\n percent fixed income securities.\nFair Value Measurements \nPlan assets are measured at fair value. The following provides a description of the valuation techniques employed for each major plan asset category at December 31, 2024 and 2023.\nCash and cash equivalents \nCash and cash equivalents include a collective fund serving as the investment vehicle for the cash reserves and cash held by third-party investment managers. The collective fund is valued at net asset value (“NAV”) on a scheduled basis using a cost approach and is considered a Level 2 asset. Cash and cash equivalents held by third-party investment managers are valued using a cost approach and are considered Level 2.\nEquity\nEquity investments include common stock, mutual and pooled funds. Common stock investments are valued using a market approach, which are priced daily in active markets and are considered Level 1. Mutual and pooled equity funds are well diversified portfolios, representing a mix of strategies in domestic, international and emerging market strategies. Mutual funds are publicly registered, valued at NAV on a daily basis using a market approach and are considered Level 1 assets. Pooled funds are valued at NAV using a market approach and are considered Level 2.\n118\nT\nable\n of Contents\nFixed Income \nFixed income investments include corporate bonds, U.S. dollar treasury bonds and municipal bonds. These securities are priced on observable inputs using a combination of market, income and cost approaches. These securities are considered Level 2 assets. Fixed income also includes a well-diversified bond portfolio structured as a pooled fund. This fund is valued at NAV on a daily basis using a market approach and is considered Level 2.\nPrivate Equity \nPrivate equity investments include interests in limited partnerships which are valued using information provided by external managers for each individual investment held in the fund. These holdings are considered Level 3.\nReal Estate\n \nReal estate investments consist of interests in limited partnerships. These holdings are either appraised or valued using the investment manager’s assessment of assets held. These holdings are considered Level 3.\nOther \nOther investments include two limited liability companies (“LLCs”) with no public market. The LLCs were formed to acquire timberland in the northwest U.S. These holdings are either appraised or valued using the investment manager’s assessment of assets held. These holdings are considered Level 3. Other investments classified as Level 2 include derivative transactions.\nThe following tables present the fair values of our defined benefit pension plans’ assets, by level within the fair value hierarchy, as of December 31, 2024 and 2023.\n \nDecember 31, 2024\nDecember 31, 2023\n(Millions of dollars)\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n—\n \n$\n62\n \n$\n—\n \n$\n62\n \n$\n—\n \n$\n63\n \n$\n—\n \n$\n63\n \nEquity:\nCommon stocks\n52\n \n—\n \n—\n \n52\n \n50\n \n—\n \n—\n \n50\n \nMutual funds\n125\n \n—\n \n—\n \n125\n \n115\n \n—\n \n—\n \n115\n \nPooled funds\n—\n \n871\n \n—\n \n871\n \n—\n \n791\n \n—\n \n791\n \nFixed income:\nCorporate\n—\n \n637\n \n—\n \n637\n \n—\n \n588\n \n—\n \n588\n \nGovernment\n—\n \n267\n \n—\n \n267\n \n—\n \n330\n \n—\n \n330\n \nPooled funds\n—\n \n117\n \n—\n \n117\n \n—\n \n118\n \n—\n \n118\n \nPrivate equity\n—\n \n—\n \n9\n \n9\n \n—\n \n—\n \n10\n \n10\n \nReal estate\n—\n \n—\n \n11\n \n11\n \n—\n \n—\n \n12\n \n12\n \nOther\n—\n \n7\n \n—\n \n7\n \n—\n \n2\n \n3\n \n5\n \nTotal investments, at fair value\n$\n177\n \n$\n1,961\n \n$\n20\n \n$\n2,158\n \n$\n165\n \n$\n1,892\n \n$\n25\n \n$\n2,082\n \nCash Flows\nContributions to defined benefit plans\n \nOur funding policy with respect to the funded pension plans is to contribute amounts necessary to satisfy minimum pension funding requirements, including requirements of the Pension Protection Act of 2006, plus such additional, discretionary, amounts from time to time as determined appropriate by management. In 2024, we made contributions totaling $\n92\n million to our funded pension plans. \nFor 2025, we do not project any required funding, but we may make voluntary contributions to our funded pension plans at our discretion.\n Cash contributions to be paid from our general assets for the unfunded pension and postretirement plans are estimated to be approximately $\n11\n million and $\n51\n million, respectively, in 2025.\n119\nT\nable\n of Contents\nEstimated future benefit payments\n \nThe following gross benefit payments, which reflect expected future service, as appropriate, are expected to be paid in the years indicated.\n(Millions of dollars)\nPension Benefits\nOther Benefits\n2025\n$\n177\n \n$\n51\n \n2026\n180\n \n52\n \n2027\n188\n \n52\n \n2028\n203\n \n53\n \n2029\n206\n \n54\n \n2030 through 2034\n1,219\n \n280\n \nContributions to defined contribution plan \nWe also contribute to a defined contribution plan for eligible employees. Contributions to this plan totaled $\n181\n million, $\n176\n million and $\n167\n million in 2024, 2023 and 2022, respectively.\nMultiemployer Pension Plan\nWe contribute to one multiemployer defined benefit pension plan under the terms of a collective-bargaining agreement that covers some of our union-represented employees. The risks of participating in this multiemployer plan are different from single-employer plans in the following aspects:\n•\nAssets contributed to the multiemployer plan by one employer may be used to provide benefits to employees of other participating employers.\n•\nIf a participating employer stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers.\n•\nIf we choose to stop participating in the multiemployer plan, we may be required to pay that plan an amount based on the underfunded status of the plan, referred to as a withdrawal liability.\nOur participation in this plan for 2024, 2023 and 2022 is outlined in the table below. The “EIN” column provides the Employee Identification Number for the plan. The most recent Pension Protection Act zone status available in 2024 and 2023 is for the plan years ending on December 31, 2023 and December 31, 2022, respectively. The zone status is based on information that we received from the plan and is certified by the plan’s actuary. Among other factors, plans in the red zone are generally less than 65 percent funded. The “FIP/RP Status Pending/Implemented” column indicates a financial improvement plan or a rehabilitation plan has been implemented. The last column lists the expiration date of the collective-bargaining agreement to which the plan is subject. There have been no significant changes that affect the comparability of 2024, 2023 and 2022 contributions. Our portion of the contributions does not make up more than five percent of total contributions to the plan.\n \n \nPension \nProtection\nAct Zone \nStatus\nFIP/RP Status\nPending/Implemented\nMPC Contributions \n(\nMillions of dollars\n)\nSurcharge\nImposed\nExpiration Date of\nCollective – Bargaining\nAgreement\nPension Fund\nEIN\n2024\n2023\n2024\n2023\n2022\nCentral States, Southeast and Southwest Areas Pension Plan\n(a)(b)\n366044243\nRed\nRed\nImplemented\n$\n3\n \n$\n5\n \n$\n5\n \nNo\nJanuary 31, 2031\n(a)    \nThis agreement has a minimum contribution requirement of $338 per week per employee for 2025.\n A total of \n252\n employees participated in the plan as of December 31, 2024.\n(b)    \nThe parties to the expired agreement continue operating under the relevant terms of the expired agreement while negotiating a successor agreement.\nMultiemployer Health and Welfare Plan\nWe contribute to one multiemployer health and welfare plan that covers both active employees and retirees. Through the health and welfare plan, employees receive medical, dental, vision, prescription and disability coverage. Our contributions to this plan totaled $\n5\n million, $\n7\n million and $\n7\n million for 2024, 2023 and 2022, respectively.\n120\nT\nable\n of Contents\n25. \nShare-Based Compensation \nDescription of the Incentive Plans\nOur employees and non-employee directors are eligible to receive share, share-based and other types of awards under the Marathon Petroleum Corporation 2021 Incentive Compensation Plan (“MPC 2021 Plan”). The MPC 2021 Plan authorizes the Compensation and Organization Development Committee of our board of directors (“Committee”) to grant nonqualified or incentive stock options, stock appreciation rights, share and share-based awards (including restricted stock and restricted stock unit awards), cash awards and performance awards to our employees and non-employee directors. The maximum number of shares of our common stock available for awards under the MPC 2021 Plan is \n20.5\n million shares. The MPC 2021 Plan became effective upon shareholder approval on April 28, 2021. Prior to that date, our employees and non-employee directors were eligible to receive share, share-based and other types of awards under the Amended and Restated Marathon Petroleum Corporation 2012 Incentive Compensation Plan (“MPC 2012 Plan”), effective April 26, 2012, and prior to that date, the Marathon Petroleum Corporation 2011 Second Amended and Restated Incentive Compensation Plan (“MPC 2011 Plan”). Shares issued as a result of awards granted under these plans are funded through the issuance of new MPC common shares.\nShare-Based Awards under the Plans\nStock Options \nPrior to 2021, we granted stock options to certain officer and non-officer employees under the MPC 2011 Plan and the MPC 2012 Plan. Stock options represent the right to purchase shares of our common stock at an exercise price equal to the closing price of our common stock on the date of grant. Stock options generally vest over a service period of \nthree years\n and expire \nten years\n after the grant date. We expensed stock options based on the grant date fair value of the awards over the requisite service period, adjusted for estimated forfeitures. We used the Black Scholes option-pricing model to estimate the fair value of stock options granted, which requires the input of subjective assumptions\n.\nRestricted Stock and Restricted Stock Units \nWe grant restricted stock units to certain employees and to our non-employee directors. Prior to 2021, we granted restricted stock to certain employees and to our non-employee directors. In general, restricted stock and restricted stock units granted to employees vest over a requisite service period of \nthree years\n. Restricted stock awards and restricted stock unit awards granted to officers prior to 2022 are subject to an additional \none\n-year holding period after the three-year vesting period. Restricted stock recipients have the right to vote such stock; however, dividends are accrued and when vested are payable at the dates specified in the awards. The non-vested shares are not transferable and are held by our transfer agent. Restricted stock units granted to non-employee directors are considered to vest immediately at the time of the grant for accounting purposes, as they are non-forfeitable, but are not issued until the director’s departure from the board of directors. Restricted stock unit recipients do not have the right to vote any shares of stock and accrue dividend equivalents which when vested are payable at the dates specified in the awards. We expense restricted stock and restricted stock units based on the grant date fair value of the awards over the requisite service period, adjusted for estimated forfeitures. The fair values of restricted stock and restricted stock units are equal to the market price of our common stock on the grant date.\nPerformance Share Units\n \nWe grant performance share unit awards to certain officer and non-officer employees. At grant, a performance share unit has a target value equal to the MPC common stock average 30-day closing price prior to the grant date. The actual payout value of a performance share unit is based on company performance (which can range from 0 percent to 200 percent) for the three-year performance period beginning January 1 of the year of grant, multiplied by, for the awards granted in 2021 and 2022, MPC’s closing share price on the date the Committee certifies performance; and for the awards granted in 2023 and 2024, MPC’s average closing share price for the final thirty calendar days at the end of the performance period. Company performance for purposes of payout will be determined by the relative ranking of the total shareholder return (“TSR”) of MPC common stock over the three-year performance period compared to the TSR of a select group of peer companies, the Standard & Poor’s 500 Index, the Alerian MLP Index, as well as the median of MPC’s compensation reference group applicable for the year the award is granted. These awards settle 100 percent in cash and are accounted for as liability awards. We expense liability-classified performance share unit awards at fair value over the requisite service period, with mark-to-market adjustments made each quarter until payout occurs. The fair value is determined using a Monte Carlo valuation model. \nSignificant assumptions used in our Monte Carlo valuation models include: 1) risk free interest rate, for which we utilize the treasury rate for the time period closest to the remaining performance period of the award being valued; 2) look-back period (in years), for which we utilize the remaining performance period of the award being valued; and 3) expected volatility, for which we utilize the historical volatility of our own stock and the stock of our peer group for the look-back period previously discussed. \nIn general, performance share units granted to officers have a vesting service period beginning on the grant date and ending on the last day of the three-year performance period, and performance share units granted to employees outside of our senior management vest in one-third increments at the end of each calendar year of the performance period. However, certain employees are eligible to vest in some awards earlier, subject to reaching certain age and employment milestones, with payout still occurring at the end of the original performance period.\n121\nT\nable\n of Contents\nTotal Share-Based Compensation Expense\nThe following table reflects activity related to our share-based compensation arrangements:\n(Millions of dollars)\n2024\n2023\n2022\nShare-based compensation expense\n$\n137\n \n$\n211\n \n$\n153\n \nTax benefit recognized on share-based compensation expense\n33\n \n51\n \n37\n \nCash received by MPC upon exercise of stock option awards\n25\n \n62\n \n243\n \nTax benefit received for tax deductions for stock awards exercised\n28\n \n49\n \n53\n \nStock Option Awards\nThe following is a summary of our common stock option activity in 2024: \nNumber of Shares\nWeighted Average Exercise Price\nWeighted Average Remaining Contractual Terms \n(in years)\nAggregate Intrinsic Value \n(Millions of dollars)\nOutstanding at December 31, 2023\n1,044,011\n \n$\n52.07\n \nExercised\n(\n537,951\n)\n46.97\n \nOutstanding at December 31, 2024\n(a)\n506,060\n \n57.50\n \n3.9\n$\n41\n \n(a)    \nAll options outstanding at December 31, 2024 are fully vested and exercisable\n.\nThe intrinsic value of options exercised by MPC employees during 2024, 2023 and 2022 was $\n75\n million, $\n136\n million and $\n247\n million, respectively.\nAs of December 31, 2024, there was \nno\n unrecognized compensation cost related to stock option awards.\nRestricted Stock and Restricted Stock Unit Awards\nThe following is a summary of restricted stock unit award activity of our common stock in 2024:\n \nRestricted Stock Units\n \nNumber of \nUnits\nWeighted \nAverage \nGrant Date \nFair Value\nUnvested at December 31, 2023\n1,192,704\n \n$\n98.16\n \nGranted\n496,894\n \n171.55\n \nVested\n(\n606,774\n)\n80.86\n \nForfeited\n(\n49,555\n)\n130.29\n \nUnvested at December 31, 2024\n1,033,269\n \n142.08\n \nThe following is a summary of the values related to restricted stock and restricted stock unit awards held by MPC employees and non-employee directors:\nRestricted Stock\nRestricted Stock Units\nIntrinsic Value of Awards Vested During the Period \n(Millions of dollars)\nWeighted Average Grant Date Fair Value of Awards Granted During the Period\nIntrinsic Value of Awards Vested During the Period \n(Millions of dollars)\nWeighted Average Grant Date Fair Value of Awards Granted During the Period\n2024\n$\n—\n \n$\n—\n \n$\n102\n \n$\n171.55\n \n2023\n—\n \n—\n \n144\n \n133.94\n \n2022\n17\n \n—\n \n99\n \n75.81\n \n122\nT\nable\n of Contents\nAs of December 31, 2024, there was \nno\n unrecognized compensation cost related to restricted stock awards. Unrecognized compensation cost related to restricted stock unit awards was $\n90\n million, which is expected to be recognized over a weighted average period of \n2.0\n years.\nPerformance Awards\nThe following is a summary of performance share unit awards activity in 2024:\nNumber of Performance Share Units\nUnvested at December 31, 2023\n580,666\n \nGranted\n255,290\n \nVested\n(\n393,862\n)\nForfeited\n(\n14,746\n)\nUnvested at December 31, 2024\n427,348\n \nWe paid $\n169\n million, $\n14\n million and $\n26\n million during the years ended 2024, 2023 and 2022, respectively, to settle performance awards.\nAs of December 31, 2024, unrecognized compensation cost related to performance awards was $\n22\n million, which is expected to be recognized over a weighted average period of \n1.3\n years. As of December 31, 2024, the total liability associated with performance awards was $\n184\n million.\nMPLX Awards\nCompensation expense for awards of MPLX units are not material to our consolidated financial statements for 2024.\n26. Leases \nLessee\nWe lease a wide variety of facilities and equipment including land and building space, office and field equipment, storage facilities and transportation equipment. Our remaining lease terms range from less than \none year\n to \n94\n years. Most long-term leases include renewal options ranging from \none year\n to \n40\n years and, in certain leases, also include purchase options. The lease term included in the measurement of right of use assets and lease liabilities includes options to extend or terminate our leases that we are reasonably certain to exercise.\nUnder ASC 842, the components of lease cost are shown below. Lease costs for operating leases are recognized on a straight-line basis and are reflected in the income statement based on the leased asset’s use. Lease costs for finance leases are reflected in depreciation and amortization and in net interest and other financial costs. \n(Millions of dollars)\n2024\n2023\n2022\nFinance lease cost:\nAmortization of right of use assets\n$\n80\n \n$\n73\n \n$\n81\n \nInterest on lease liabilities\n26\n \n25\n \n29\n \nOperating lease cost\n534\n \n489\n \n490\n \nVariable lease cost\n60\n \n54\n \n59\n \nShort-term lease cost\n952\n \n881\n \n772\n \nTotal lease cost\n$\n1,652\n \n$\n1,522\n \n$\n1,431\n \n123\nT\nable\n of Contents\nSupplemental consolidated balance sheet data related to leases were as follows:\nDecember 31,\n(Millions of dollars)\n2024\n2023\nOperating leases\nAssets\nRight of use assets\n$\n1,300\n \n$\n1,233\n \nLiabilities\nOperating lease liabilities\n$\n417\n \n$\n454\n \nLong-term operating lease liabilities\n860\n \n764\n \nTotal operating lease liabilities\n$\n1,277\n \n$\n1,218\n \nWeighted average remaining lease term (in years)\n4\n4\nWeighted average discount rate\n4.4\n \n%\n4.1\n \n%\nFinance leases\nAssets\nProperty, plant and equipment, gross\n$\n1,118\n \n$\n765\n \nLess accumulated depreciation\n510\n \n413\n \nProperty, plant and equipment, net\n$\n608\n \n$\n352\n \nLiabilities\nDebt due within one year\n$\n94\n \n$\n69\n \nLong-term debt\n630\n \n401\n \nTotal finance lease liabilities\n$\n724\n \n$\n470\n \nWeighted average remaining lease term (in years)\n9\n9\nWeighted average discount rate\n4.8\n \n%\n5.1\n \n%\nAs of December 31, 2024, maturities of lease liabilities for operating lease obligations and finance lease obligations having initial or remaining non-cancellable lease terms in excess of one year are as follows:\n(Millions of dollars)\nOperating\nFinance\n2025\n$\n464\n \n$\n126\n \n2026\n334\n \n123\n \n2027\n242\n \n111\n \n2028\n173\n \n97\n \n2029\n76\n \n79\n \n2030 and thereafter\n111\n \n360\n \nGross lease payments\n1,400\n \n896\n \nLess: imputed interest\n123\n \n172\n \nTotal lease liabilities\n$\n1,277\n \n$\n724\n \nLessor\nMPLX is considered to be the lessor under several operating lease agreements in accordance with GAAP related to certain fee-based natural gas transportation and processing agreements in the Marcellus and Southern Appalachia region. The primary terms of these agreements expire between 2026 and 2036, however, these contracts either have renewal options or will continue thereafter on a year-to-year basis until terminated by either party.\nMPLX did not elect to use the practical expedient to combine lease and non-lease components for lessor arrangements. The tables below represent the portion of the contract allocated to the lease component based on relative standalone selling price. MPLX elected the practical expedient to carry forward historical classification conclusions until a modification of an existing agreement occurs. Once a modification occurs, the amended agreement is required to be assessed under ASC 842 to determine whether a reclassification of the lease is required. \n124\nT\nable\n of Contents\nDuring the third quarter of 2022, the approved expansion of a gathering and compression system triggered the first assessment of a third party agreement under ASC 842. As a result of the assessment during the period, the lease was reclassified from an operating lease to a sales-type lease. Accordingly, the underlying property, plant and equipment of $\n745\n million and associated deferred revenue of $\n277\n million were derecognized. The present value of the future lease payments of $\n914\n million and the unguaranteed residual value of $\n63\n million were recorded as the net investment in the lease within receivables and other noncurrent assets. This resulted in a gain of approximately $\n509\n million, which was recorded as a net gain on disposal of assets in the consolidated statements of income. This transaction was a non-cash transaction.\nLease revenues are included in sales and other operating revenues on the consolidated statements of income. Lease revenues were as follows:\n(Millions of dollars)\n2024\n2023\n2022\nOperating leases:\nRental income\n$\n260\n \n$\n243\n \n$\n327\n \nSales-type leases:\nInterest income (Sales-type rental revenue-fixed minimum)\n114\n \n114\n \n46\n \nInterest income (Revenue from variable lease payments)\n22\n \n22\n \n16\n \nSales-type lease revenue\n$\n136\n \n$\n136\n \n$\n62\n \nThe following is a schedule of minimum future rentals on the non-cancelable operating leases as of December 31, 2024:\n(Millions of dollars)\n2025\n$\n109\n \n2026\n88\n \n2027\n66\n \n2028\n59\n \n2029\n57\n \n2030 and thereafter\n248\n \nTotal minimum future rentals\n$\n627\n \nAnnual minimum undiscounted lease payment receipts under our sales-type leases were as follows as of December 31, 2024:\n(Millions of dollars)\n2025\n$\n172\n \n2026\n157\n \n2027\n147\n \n2028\n138\n \n2029\n130\n \n2030 and thereafter\n896\n \nTotal minimum future rentals\n1,640\n \nLess: imputed interest\n707\n \nLease receivables\n(a)\n$\n933\n \nCurrent lease receivables\n(b)\n$\n102\n \nLong-term lease receivables\n(c)\n831\n \nUnguaranteed residual assets\n95\n \nTotal sales-type lease assets\n$\n1,028\n \n(a)\n    \nThis amount does not include the unguaranteed residual assets. \n(b)\n    \nPresented in receivables, net on the consolidated balance sheets.\n \n(c)\n    \nPresented in other noncurrent assets on the consolidated balance sheets.\nCapital expenditures related to assets subject to sales-type lease arrangements were $\n69\n million for the year ended December 31, 2024. These amounts are reflected as additions to property, plant and equipment in the consolidated statements of cash flows.\n125\nT\nable\n of Contents\nThe following schedule summarizes our investment in assets held under operating lease by major classes as of December 31, 2024 and 2023:\nDecember 31,\n(Millions of dollars)\n2024\n2023\nGathering and transportation\n$\n86\n \n$\n86\n \nProcessing and fractionation\n1,039\n \n1,000\n \nPipelines\n18\n \n12\n \nTerminals\n129\n \n129\n \nLand, building and other\n11\n \n10\n \nProperty, plant and equipment\n1,283\n \n1,237\n \nLess accumulated depreciation\n458\n \n396\n \nTotal property, plant and equipment, net\n$\n825\n \n$\n841\n \n27. \nCommitments and Contingencies\n \nWe are the subject of, or a party to, a number of pending or threatened legal actions, contingencies and commitments involving a variety of matters, including laws and regulations relating to the environment. Some of these matters are discussed below. For matters for which we have not recorded a liability, we are unable to estimate a range of possible loss because the issues involved have not been fully developed through pleadings, discovery or court proceedings. However, the ultimate resolution of some of these contingencies could, individually or in the aggregate, be material.\nEnvironmental Matters\n \nWe are subject to federal, state, local and foreign laws and regulations relating to the environment. These laws generally provide for control of pollutants released into the environment and require responsible parties to undertake remediation of hazardous waste disposal sites and certain other locations including presently or formerly owned or operated retail marketing sites. Penalties may be imposed for noncompliance.\nAt December 31, 2024 and 2023, accrued liabilities for remediation totaled $\n364\n million\n and $\n387\n million\n, respectively. It is not presently possible to estimate the ultimate amount of all remediation costs that might be incurred or the penalties, if any, that may be imposed. Receivables for recoverable costs from certain states, under programs to assist companies in clean-up efforts related to underground storage tanks at presently or formerly owned or operated retail marketing sites, were $\n6\n million and $\n5\n million at December 31, 2024 and 2023, respectively.\nGovernmental and other entities in various states have filed climate-related lawsuits against a number of energy companies, including MPC. Although each suit is separate and unique, the lawsuits generally allege defendants made knowing misrepresentations about knowingly concealing, or failing to warn of the impacts of their petroleum products, which led to increased demand and worsened climate change. Plaintiffs are seeking unspecified damages and abatement under various tort theories, as well as breaches of consumer protection and unfair trade statutes. We are currently subject to such proceedings in federal or state courts in California, Delaware, Maryland, Hawaii, Rhode Island, South Carolina and Oregon. Similar lawsuits may be filed in other jurisdictions. At this early stage, the ultimate outcome of these matters remains uncertain, and neither the likelihood of an unfavorable outcome nor the ultimate liability, if any, can be determined.\nWe are involved in a number of environmental enforcement matters arising in the ordinary course of business. While the outcome and impact on us cannot be predicted with certainty, management believes the resolution of these environmental matters will not, individually or collectively, have a material adverse effect on our consolidated results of operations, financial position or cash flows.\nAsset Retirement Obligations\n \nOur short-term asset retirement obligations were $\n36\n million and $\n24\n million at December 31, 2024 and 2023, respectively, and are included in other current liabilities in our consolidated balance sheets. Our long-term asset retirement obligations were $\n210\n million and $\n218\n million at December 31, 2024 and 2023, respectively, which are included in deferred credits and other liabilities in our consolidated balance sheets. \nOther Legal Proceedings\nIn July 2020, Tesoro High Plains Pipeline Company, LLC (“THPP”), a subsidiary of MPLX, received a Notification of Trespass Determination from the Bureau of Indian Affairs (“BIA”) relating to a portion of the Tesoro High Plains Pipeline that crosses the Fort Berthold Reservation in North Dakota. The notification demanded the immediate cessation of pipeline operations and assessed trespass damages of approximately $\n187\n million. After subsequent appeal proceedings and in compliance with a new order issued by the BIA, in December 2020, THPP paid approximately $\n4\n million in assessed trespass damages and ceased use \n126\nT\nable\n of Contents\nof the portion of the pipeline that crosses the property at issue. In March 2021, the BIA issued an order purporting to vacate the BIA's prior orders related to THPP’s alleged trespass and direct the Regional Director of the BIA to reconsider the issue of THPP’s alleged trespass and issue a new order. In April 2021, THPP filed a lawsuit in the District of North Dakota against the United States of America, the U.S. Department of the Interior and the BIA (collectively, the “U.S. Government Parties”) challenging the March 2021 order purporting to vacate all previous orders related to THPP’s alleged trespass. On February 8, 2022, the U.S. Government Parties filed their answer and counterclaims to THPP’s suit claiming THPP is in continued trespass with respect to the pipeline and seek disgorgement of pipeline profits from June 1, 2013 to present, removal of the pipeline and remediation. On November 8, 2023, the District Court of North Dakota granted THPP’s motion to sever and stay the U.S. Government Parties’ counterclaims. The case will proceed on the merits of THPP’s challenge to the March 2021 order purporting to vacate all previous orders related to THPP’s alleged trespass. THPP continues not to operate that portion of the pipeline that crosses the property at issue.\nWe are also a party to a number of other lawsuits and other proceedings arising in the ordinary course of business. While the ultimate outcome and impact to us cannot be predicted with certainty, we believe that the resolution of these other lawsuits and proceedings will not, individually or collectively, have a material adverse effect on our consolidated financial position, results of operations or cash flows.\nGuarantees \nWe have provided certain guarantees, direct and indirect, of the indebtedness of other companies. Under the terms of most of these guarantee arrangements, we would be required to perform should the guaranteed party fail to fulfill its obligations under the specified arrangements. In addition to these financial guarantees, we also have various performance guarantees related to specific agreements.\nGuarantees related to indebtedness of equity method investees\n \nLOOP and LOCAP\nMPC and MPLX hold interests in an offshore oil port, LOOP, and MPLX holds an interest in a crude oil pipeline system, LOCAP. Both LOOP and LOCAP have secured various project financings with throughput and deficiency agreements. Under the agreements, MPC, as a shipper, is required to advance funds if the investees are unable to service their debt. Any such advances are considered prepayments of future transportation charges. The duration of the agreements varies but tends to follow the terms of the underlying debt, which extend through 2040. Our maximum potential undiscounted payments under these agreements for the debt principal totaled $\n212\n million as of December 31, 2024.\nDakota Access Pipeline\nMPLX holds a \n9.19\n percent indirect interest in a joint venture (“Dakota Access”), which owns and operates the Dakota Access Pipeline and Energy Transfer Crude Oil Pipeline projects (collectively, the “Bakken Pipeline system”). In 2020, the U.S. District Court for the District of Columbia (the “D.D.C.”) ordered the U.S. Army Corps of Engineers (“Army Corps”), which granted permits and an easement for the Bakken Pipeline system, to prepare an environmental impact statement (“EIS”) relating to an easement under Lake Oahe in North Dakota. The D.D.C. later vacated the easement. The Army Corps issued a draft EIS in September 2023 detailing various options for the easement going forward, including denying the easement, approving the easement with additional measures, rerouting the easement, or approving the easement with no changes. The Army Corps has not selected a preferred alternative, but will make a decision in its final review, after considering input from the public and other agencies. The pipeline remains operational while the Army Corps finalizes its decision which will follow the issuance of the final EIS. According to public statements from Army Corps officials, the EIS is now expected to be issued in 2025.\nMPLX has entered into a Contingent Equity Contribution Agreement whereby it, along with the other joint venture owners in the Bakken Pipeline system, has agreed to make equity contributions to the joint venture upon certain events occurring to allow the entities that own and operate the Bakken Pipeline system to satisfy their senior note payment obligations. The senior notes were issued to repay amounts owed by the pipeline companies to fund the cost of construction of the Bakken Pipeline system. If the vacatur of the easement results in a temporary shutdown of the pipeline, MPLX would have to contribute its 9.19 percent pro rata share of funds required to pay interest accruing on the notes and any portion of the principal that matures while the pipeline is shut down. MPLX also expects to contribute its 9.19 percent pro rata share of any costs to remediate any deficiencies to reinstate the easement and/or return the pipeline into operation. If the vacatur of the easement results in a permanent shutdown of the pipeline, MPLX would have to contribute its 9.19 percent pro rata share of the cost to redeem the bonds (including the 1 percent redemption premium required pursuant to the indenture governing the notes) and any accrued and unpaid interest. As of December 31, 2024, our maximum potential undiscounted payments under the Contingent Equity Contribution Agreement were approximately $\n78\n million.\nMarathon Oil indemnifications\n \nThe separation and distribution agreement and other agreements with Marathon Oil to effect our spinoff provide for cross-indemnities between Marathon Oil and us. In general, Marathon Oil and its successor, ConocoPhillips, is required to indemnify us for any liabilities relating to Marathon Oil’s historical oil and gas exploration and production operations, oil sands mining operations and integrated gas operations, and we are required to indemnify Marathon Oil and its successor, ConocoPhillips, for \n127\nT\nable\n of Contents\nany liabilities relating to Marathon Oil’s historical refining, marketing and transportation operations. The terms of these indemnifications are indefinite and the amounts are not capped.\nOther guarantees \nWe have entered into other guarantees with maximum potential undiscounted payments totaling $\n191\n million as of December 31, 2024, which primarily consist of a commitment to indemnify a joint venture member for our pro rata share of any payments made under a performance guarantee for construction of a pipeline by an equity method investee, a commitment to contribute cash to an equity method investee for certain catastrophic events in lieu of procuring insurance coverage, a commitment to pay a termination fee on a supply agreement if terminated during the initial term, a commitment to fund a share of the bonds issued by a government entity for construction of public utilities in the event that other industrial users of the facility default on their utility payments and leases of assets containing general lease indemnities and guaranteed residual values.\nGeneral guarantees associated with dispositions\n \nOver the years, we have sold various assets in the normal course of our business. Certain of the related agreements contain performance and general guarantees, including guarantees regarding inaccuracies in representations, warranties, covenants and agreements, and environmental and general indemnifications that require us to perform upon the occurrence of a triggering event or condition. These guarantees and indemnifications are part of the normal course of selling assets. We are typically not able to calculate the maximum potential amount of future payments that could be made under such contractual provisions because of the variability inherent in the guarantees and indemnities. Most often, the nature of the guarantees and indemnities is such that there is no appropriate method for quantifying the exposure because the underlying triggering event has little or no past experience upon which a reasonable prediction of the outcome can be based.\nContractual Commitments and Contingencies\nAt December 31, 2024, our contractual commitments to acquire property, plant and equipment totaled $\n260\n million. Our contractual commitments to acquire property, plant and equipment totaled $\n281\n million at December 31, 2023.\nCertain natural gas processing and gathering arrangements require us to construct natural gas processing plants, natural gas gathering pipelines and NGL pipelines and contain certain fees and charges if specified construction milestones are not achieved for reasons other than force majeure. In certain cases, certain producer customers may have the right to cancel the processing arrangements if there are significant delays that are not due to force majeure.\n28. \nSubsequent Event\nOn February 10, 2025, MPC issued $\n2.0\n billion aggregate principal amount of senior notes in an underwritten public offering consisting of $\n1.1\n billion aggregate principal amount of 5.150 percent senior notes due March 2030 and $\n900\n million aggregate principal amount of 5.700 percent senior notes due March 2035. We intend to use the net proceeds from this offering to repay, redeem or otherwise retire our outstanding $\n1.250\n billion aggregate principal amount of 4.700 percent senior notes due May 2025 and for general corporate purposes.\n128\nT\nable\n of Contents\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone\nItem 9A. Controls and Procedures \nDisclosure Controls and Procedures\nAn evaluation of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)), was carried out under the supervision and with the participation of our management, including our chief executive officer and chief financial officer. Based upon that evaluation, the chief executive officer and chief financial officer concluded that the design and operation of these disclosure controls and procedures were effective as of December 31, 2024, the end of the period covered by this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nOur “Management’s Report on Internal Control over Financial Reporting” and the “Report of Independent Registered Public Accounting Firm” are set forth in Item 8.\nDuring the quarter ended December 31, 2024, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information\nDuring the quarter ended December 31, 2024, no director or officer (as defined in Rule 16a-1(f) promulgated under the Exchange Act) of MPC \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement” (as each term is defined in Item 408 of Regulation S-K).\nItem 9C. Disclosures Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable\n129\nT\nable\n of Contents\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nInformation concerning our executive officers is included in Part I, Item 1 of this Annual Report on Form 10-K. Information concerning our directors is incorporated by reference to “Corporate Governance—Proposal 1. Election of Directors” in our Proxy Statement for the 2025 Annual Meeting of Shareholders, to be filed with the SEC within 120 days of December 31, 2024 (the “Proxy Statement”). \nOur Code of Business Conduct, which applies to all of our directors, officers and employees, defines our expectations for ethical decision-making, accountability and responsibility. Our Code of Ethics for Senior Financial Officers, which is specifically applicable to our Chief Executive Officer, Chief Financial Officer, Controller and Treasurer, and other leaders performing similar functions, affirms the principle that the honesty, integrity and sound judgment of our senior executives with responsibility for preparation and certification of our financial statements is essential to the proper functioning and success of our company. These codes are available on our website at \nwww.marathonpetroleum.com/Investors/Corporate-Governance/\n. We would post on our website any amendments to, or waivers from, either of these codes requiring disclosure under applicable rules within four business days following any such amendment or waiver. Information contained on our website is not incorporated into this Annual Report on Form 10-K or other securities filings.\nThe other information required by this Item is incorporated by reference to “Corporate Governance—Board Function and Leadership—Board Committees” and “Other Information—Insider Trading Policies and Procedures” in our Proxy Statement. \nItem 11. Executive Compensation\nInformation required by this Item is incorporated by reference to “Executive Compensation,” “Executive Compensation—Executive Compensation Tables” (excluding the information under the subheading “Pay Versus Performance”) and “Corporate Governance—Non-Employee Director Compensation” in our Proxy Statement.\n130\nT\nable\n of Contents\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation concerning security ownership of certain beneficial owners and management required by this Item is incorporated by reference to “Other Information—Stock Ownership Information” in our Proxy Statement.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table provides information as of December 31, 2024 with respect to shares of our common stock that may be issued under the MPC 2021 Plan, the MPC 2012 Plan and the MPC 2011 Plan:\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\n(a)\n \nWeighted-average exercise price of outstanding options, warrants and rights\n(b)\nNumber of securities remaining available for future issuance under equity compensation \nplans (excluding securities reflected in the first column)\n(c)\nEquity compensation plans approved by stockholders\n1,803,526 \n$\n57.50 \n19,422,757 \nEquity compensation plan not approved by stockholders\n— \n— \n— \nTotal\n1,803,526 \nN/A  \n19,422,757 \n \n(a)\n     Includes the following:\n1)\n    \n506,060 stock options granted pursuant to the MPC 2012 Plan \nand \nnot forfeited, cancelled or expired as of December 31, 2024; and\n2)    1,297,466 restricted stock units granted pursuant to the MPC 2021 Plan, the MPC 2012 Plan and the MPC 2011 Plan for shares unissued and not forfeited, cancelled or expired as of December 31, 2024.\n(b)    \nRestricted stock, restricted stock units and performance units are not taken into account in the weighted-average exercise price as such awards have no exercise price.\n(c)    \nReflects the shares available for issuance pursuant to the MPC 2021 Plan. All granting authority under the MPC 2012 Plan was revoked following the approval of the MPC 2021 Plan by shareholders on April 28, 2021. All granting authority under the MPC 2011 Plan was revoked following the approval of the MPC 201\n2 Plan by shareholders on April 25, 2012. Shares that (i) relate to grants made pursuant to the MPC 2012 Plan that are forfeited, cancelled or expire unexercised or (ii) are withheld or tendered to satisfy taxes related to vestings of restricted stock units under the MPC 2012 Plan, in each case, become immediately available for issuance under the MPC 2021 Plan.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nInformation required by this Item is incorporated by reference to “Other Information—Related Party Transactions” and “Corporate Governance—Board Composition and Director Selection—Director Independence” in our Proxy Statement.\nItem 14. Principal Accountant Fees and Services\nInformation required by this Item is incorporated by reference to “Audit Matters—Auditor Fees and Services” in our Proxy Statement.\n131\nT\nable\n of Contents\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\nA. Documents Filed as Part of the Report\n1.    Financial Statements (see Part II, Item 8. of this Annual Report on Form 10-K regarding financial statements)\n2.    Financial Statement Schedules\nFinancial statement schedules required under SEC rules but not included in this Annual Report on Form 10-K are omitted because they are not applicable or the required information is contained in the consolidated financial statements or notes thereto.\n3.    Exhibits: \nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\nFurnished\nHerewith\nForm\nExhibit\nFiling\nDate\nSEC\nFile No.\n2\nPlan of Acquisition, Reorganization, Arrangement, Liquidation or Succession\n2.1 †\nPurchase and Sale Agreement, dated as of August 2, 2020, by and between MPC, the MPC subsidiaries party thereto and 7-Eleven, Inc.\n8-K\n2.1\n8/3/2020\n001-35054\n2.2\nAmendment to Purchase and Sale Agreement, dated as of October 16, 2020, by and among MPC, the MPC subsidiaries party thereto and 7-Eleven, Inc.\n10-K\n2.7\n2/26/2021\n001-35054\n2.3 †\nAmendment No. 2 to Purchase and Sale Agreement, dated as of May 14, 2021, by and among the Company, Sellers and Purchaser\n8-K\n2.3\n5/14/2021\n001-35054\n3\nArticles of Incorporation and Bylaws\n3.1\nRestated Certificate of Incorporation of Marathon Petroleum Corporation, dated April 24, 2024\n8-K\n3.2\n4/26/2024\n001-35054\n3.2\nAmended and Restated Bylaws of Marathon Petroleum Corporation, dated October 27, 2021\n10-Q\n3.2\n11/2/2021\n001-35054\n4\nInstruments Defining the Rights of Security Holders, Including Indentures, and Description of Registrant’s Securities\nPursuant to Item 601(b)(4) of Regulation S-K, certain instruments with respect to long-term debt issues have been omitted where the amount of securities authorized under such instruments does not exceed 10 percent of the total consolidated assets of the Registrant. The Registrant hereby agrees to furnish a copy of any such instrument to the Securities and Exchange Commission upon its request. \n4.1\nIndenture, dated as of February 1, 2011,  between Marathon Petroleum Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee\n10\n4.1\n3/29/2011\n001-35054\n4.2\nIndenture, dated February 12, 2015, between MPLX LP and The Bank of New York Mellon Trust Company, N.A., as Trustee\n8-K\n4.1\n2/12/2015\n001-35714\n4.3\nDescription of Securities\n10-K\n4.3\n2/23/2023\n001-35054\n10\nMaterial Contracts\n10.1\nOmnibus Agreement, dated as of October 31, 2012, among Marathon Petroleum Corporation, Marathon Petroleum Company LP, MPL Investment LLC, MPLX Operations LLC, MPLX Terminal and Storage LLC, MPLX Pipe Line Holdings LP, Marathon Pipe Line LLC, Ohio River Pipe Line LLC, MPLX LP and MPLX GP LLC\n8-K\n10.2\n11/6/2012\n001-35054\n10.2 *\nMarathon Petroleum Corporation Second Amended and Restated 2011 Incentive Compensation Plan\nS-3\n4.3\n12/7/2011\n333-175286\n132\nT\nable\n of Contents\nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\nFurnished\nHerewith\nForm\nExhibit\nFiling\nDate\nSEC\nFile No.\n10.3 *\nFirst Amendment to the Marathon Petroleum Corporation Amended and Restated 2011 Incentive Compensation Plan\n10-Q\n10.1\n8/3/2015\n001-35054\n10.4 *\nAmended and Restated Marathon Petroleum Corporation 2012 Incentive Compensation Plan\n10-K\n10.87\n2/28/2019\n001-35054\n10.5 *\nFirst Amendment to the Amended and Restated Marathon Petroleum Corporation 2012 Incentive Compensation Plan\n10-K\n10.84\n2/28/2020\n001-35054\n10.6 *\nMarathon Petroleum Corporation 2021 Incentive Compensation Plan\n8-K\n10.1\n5/4/2021\n001-35054\n10.7 *\nMPLX LP 2012 Incentive Compensation Plan\nS-1/A\n10.3\n10/9/2012\n333-182500\n10.8 *\nMPLX LP 2012 Incentive Compensation Plan MPC Non-Employee Director Phantom Unit Award Policy\n10-K\n10.32\n2/28/2013\n001-35054\n10.9 *\nMPLX LP 2018 Incentive Compensation Plan\n8-K\n10.1\n3/5/2018\n001-35714\n10.10*\nFirst Amendment to the MPLX 2018 Incentive Compensation Plan\n10-K\n10.75\n2/28/2020\n001-35714\n10.11*\nMPLX LP 2018 Incentive Compensation Plan MPC Non-Employee Director Phantom Unit Award Policy\n10-K\n10.86\n2/28/2019\n001-35054\n10.12*\nMPLX LP 2018 Incentive Compensation Plan MPC Non-Employee Director Phantom Unit Award Policy, as amended and restated October 1, 2024\n10-Q\n10.4\n11/05/2024\n001-35054\n10.13 *\nMarathon Petroleum Executive Deferred Compensation Plan, effective January 1, 2021 \n10-K\n10.73\n2/26/2021\n001-35054\n10.14 *\nMarathon Petroleum Executive Deferred Compensation Plan Adoption Agreement, effective January 1, 2021\n10-K\n10.74\n2/26/2021\n001-35054\n10.15 *\nMarathon Petroleum Deferred Compensation Plan (as amended and restated effective December 31, 2023)\n10-K\n10.44\n2/28/2024\n001-35054\n10.16 *\nForm of Marathon Petroleum Corporation 2011 Incentive Compensation Plan Supplemental Restricted Stock Unit Award Agreement – Non-Employee Director\n10-K\n10.22\n2/29/2012\n001-35054\n10.17 *\nNonqualified Stock Option Award Agreement - Officer\n10-Q\n10.2\n5/9/2019\n001-35054\n10.18 *\nForm of 2020 Officer Stock Option Award Agreement \n10-Q\n10.3\n5/7/2020\n001-35054\n10.19 *\nForm of 2022 MPC Officer Performance Unit Award Agreement – 2022-2024 Performance Cycle \n10-K\n10.64\n2/24/2022\n001-35054\n10.20 *\nForm of 2022 MPC Officer RSU Award Agreement – 3-year Pro Rata Vesting \n10-Q\n10.5\n5/3/2022\n001-35054\n10.21 *\nForm of 2022 MPLX Phantom Unit Award Agreement\n10-Q\n10.1\n5/3/2022\n001-35714\n10.22 *\nForm of 2023 MPC Officer Performance Share Unit Award Agreement – 2023-2025 Performance Period\n10-K\n10.48\n2/23/2023\n001-35054\n10.23 *\nForm of 2023 MPC Officer RSU Award Agreement - 2021 Plan\n10-K\n10.49\n2/23/2023\n001-35054\n10.24 *\nForm of 2023 MPLX Phantom Unit Award Agreement\n10-K\n10.52\n2/23/2023\n001-35054\n10.25 *\nForm of MPC Officer Performance Unit Award Agreement – 2024-2026 Performance Cycle\n10-K\n10.41\n2/28/2024\n001-35054\n10.26 *\nForm of 2024 MPC Officer RSU Award Agreement\n10-K\n10.42\n2/28/2024\n001-35054\n10.27 *\nForm of 2024 MPLX Phantom Unit Award Agreement\n10-Q\n10.1\n4/30/2024\n001-35054\n10.28 *\nMarathon Petroleum Thrift Plan, as amended and restated effective January 1, 2023\n10-K\n10.50\n2/23/2023\n001-35054\n133\nT\nable\n of Contents\nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\nFurnished\nHerewith\nForm\nExhibit\nFiling\nDate\nSEC\nFile No.\n10.29 *\nFirst Amendment to the Marathon Petroleum Thrift Plan\n10-Q\n10.3\n5/2/2023\n001-35054\n10.30 *\nSecond Amendment to the Marathon Petroleum Thrift Plan\n10-Q\n10.1\n8/1/2023\n001-35054\n10.31 *\nThird Amendment to the Marathon Petroleum Thrift Plan \n10-K\n10.36\n2/28/2024\n001-35054\n10.32 *\nFourth Amendment to the Marathon Petroleum Thrift Plan\n10-K\n10.37\n2/28/2024\n001-35054\n10.33 *\nFifth Amendment to the Marathon Petroleum Thrift Plan\n10-Q\n10.2\n4/30/2024\n001-35054\n10.34*\nSixth Amendment to the Marathon Petroleum Thrift Plan\n10-Q\n10.5\n11/05/2024\n001-35054\n10.35 *\n2024 Marathon Petroleum Annual Cash Bonus Program\n10-K\n10.43\n2/28/2024\n001-35054\n10.36 *\nMarathon Petroleum Excess Benefit Plan (as amended and restated effective December 31, 2023)\n10-K\n10.45\n2/28/2024\n001-35054\n10.37*\nAmendment to the Marathon Petroleum Excess Benefit Plan, dated April 10, 2024\n10-Q\n10.1\n8/06/2024\n001-35054\n10.38*\nAmended and Restated Aircraft Time Sharing Agreement, dated as of August 14, 2024, by and between Marathon Petroleum Company LP and Michael J. Hennigan\n10-Q\n10.1\n11/05/2024\n001-35054\n10.39*\nAircraft Time Sharing Agreement, dated as of August 14, 2024, by and between Marathon Petroleum Company LP and Maryann T. Mannen\n10-Q\n10.2\n11/05/2024\n001-35054\n10.40\nRevolving Credit Agreement, dated as of July 7, 2022, by and among Marathon Petroleum Corporation, as borrower, JPMorgan Chase Bank, N.A., as administrative agent, each of JPMorgan Chase Bank, N.A., Wells Fargo Securities, LLC, Barclays Bank PLC, BofA Securities, Inc., Citibank, N.A., Mizuho Bank, Ltd., MUFG Bank, Ltd., RBC Capital Markets, and TD Securities (USA) LLC, as joint lead arrangers and joint bookrunners, Wells Fargo Bank, National Association, as syndication agent, each of Bank of America, N.A., Barclays Bank PLC, Citibank, N.A., Mizuho Bank, Ltd., MUFG Bank, Ltd., Royal Bank of Canada and The Toronto-Dominion Bank, New York Branch, as documentation agents, and the other lenders and issuing banks that are parties thereto\n8-K\n10.1\n7/12/2022\n001-35054\n10.41\nRevolving Credit Agreement, dated as of July 7, 2022, by and among MPLX LP, as borrower, Wells Fargo Bank, National Association, as administrative agent, each of Wells Fargo Securities, LLC, JPMorgan Chase Bank, N.A., Barclays Bank PLC, BofA Securities, Inc., Citibank, N.A., Mizuho Bank, Ltd., MUFG Bank, Ltd., RBC Capital Markets and TD Securities (USA) LLC, as joint lead arrangers and joint bookrunners, JPMorgan Chase Bank, N.A., as syndication agent, each of Bank of America, N.A., Barclays Bank PLC, Citibank, N.A., Mizuho Bank, Ltd., MUFG Bank, Ltd., Royal Bank of Canada and The Toronto-Dominion Bank, New York Branch, as documentation agents, and the other lenders and issuing banks that are parties thereto\n8-K\n10.2\n7/12/2022\n001-35054\n10.42*\nMarathon Petroleum Corporation Deferred Compensation Plan for Non-Employee Directors, as amended and restated effective November 15, 2024\nX\n10.43*\nMPLX LP 2018 Incentive Compensation Plan MPC Non-Employee Director Phantom Unit Award Policy, as amended and restated effective November 15, 2024\nX\n134\nT\nable\n of Contents\nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\nFurnished\nHerewith\nForm\nExhibit\nFiling\nDate\nSEC\nFile No.\n10.44*\nFirst Amendment to Amended and Restated Aircraft Time Sharing Agreement dated as of October 16, 2024, by and between Marathon Petroleum Company LP and Michael J. Hennigan\nX\n10.45*\nSecond Amendment to Amended and Restated Aircraft Time Sharing Agreement dated as of November 30, 2024, 2024, by and between Marathon Petroleum Company LP and Michael J. Hennigan\nX\n10.46*\nFirst Amendment to Aircraft Time Sharing Agreement dated as of October 16, 2024, by and between Marathon Petroleum Company LP and Maryann T. Mannen\nX\n10.47*\nSecond Amendment to Aircraft Time Sharing Agreement dated as of November 30, 2024, by and between Marathon Petroleum Company LP and Maryann T. Mannen\nX\n10.48*\nMarathon Petroleum Corporation Senior Leader Change in Control Severance Benefits Plan, as amended and restated effective December 1, 2024\nX\n10.49*\nMPLX LP Senior Leader Change in Control Severance Benefits Plan, as amended and restated effective December 1, 2024 \nX\n10.50*\nSeventh Amendment to the Marathon Petroleum Thrift Plan\nX\n19.1\nTrading of Securities Policy\nX\n21.1\nList of Subsidiaries\nX\n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n24.1\nPower of Attorney of Directors and Officers of Marathon Petroleum Corporation\nX\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13(a)-14 and 15(d)-14 under the Securities Exchange Act of 1934.\nX\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13(a)-14 and 15(d)-14 under the Securities Exchange Act of 1934.\nX\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350.\nX\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350.\nX\n97.1\nMarathon Petroleum Corporation Officer Compensation Clawback Policy\n10-K\n97.1\n2/28/2024\n001-35054\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded with the Inline XBRL document.\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\nX\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n135\nT\nable\n of Contents\n†    The exhibits and schedules have been omitted pursuant to Item 601(b)(2) of Regulation S-K and will be provided to the Securities and Exchange Commission upon request.\n*    Indicates management contract or compensatory plan, contract or arrangement in which one or more directors or executive officers of the Registrant may be participants.\n136\nT\nable\n of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nDate: February 27, 2025\nMARATHON PETROLEUM CORPORATION\nBy:\n/s/ Erin M. Brzezinski\nErin M. Brzezinski\nVice President and Controller\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on February 27, 2025 on behalf of the registrant and in the capacities indicated.\nSignature\nTitle\n/s/ Maryann T. Mannen\nDirector, President and Chief Executive Officer\n(principal executive officer)\nMaryann T. Mannen\n/s/ John J. Quaid\nExecutive Vice President and Chief Financial Officer\n(principal financial officer)\nJohn J. Quaid\n/s/ Erin M. Brzezinski\nVice President and Controller\n(principal accounting officer)\nErin M. Brzezinski\n*\nExecutive Chairman of the Board of Directors\nMichael J. Hennigan\n*\nDirector\nAbdulaziz F. Alkhayyal\n*\nDirector\nEvan Bayh\n*\nDirector\nCharles E. Bunch\n*\nDirector\nJeffrey C. Campbell\n*\nDirector\nJonathan Z. Cohen\n*\nDirector\nKimberly N. Ellison-Taylor\n137\nT\nable\n of Contents\nSignature\nTitle\n*\nDirector\nEdward G. Galante\n*\nDirector\nEileen P. Paterson\n*\nDirector\nKim K.W. Rucker\n*\nDirector\nFrank M. Semple\n*\nDirector\nJ. Michael Stice\n*\nDirector\nJohn P. Surma\n*\nDirector\nSusan Tomasky\n* The undersigned, by signing her name hereto, does sign and execute this report pursuant to the Power of Attorney executed by the above-named directors and officers of the registrant, which is being filed herewith on behalf of such directors and officers.\n \nBy:\n/s/ Maryann T. Mannen\nFebruary 27, 2025\nMaryann T. Mannen\nAttorney-in-Fact\n138"
  }
}