{
  "ticker": "MSI",
  "cik": "0000068505",
  "company_name": "Motorola Solutions, Inc.",
  "filing_date": "2025-02-14",
  "accession": "0000068505-25-000012",
  "primary_doc": "msi-20241231.htm",
  "item_sections": {
    "item1": "Item 1: Business\nOverview | Solving for safer\nMotorola Solutions' business is safety and security. Every day we work to deliver on our commitment of helping to create safer communities, safer schools, safer hospitals and safer businesses. Our work as a global leader in public safety and enterprise security is grounded in nearly 100 years of close customer and community collaboration. We design and advance technology for more than 100,000 public safety and enterprise customers in over 100 countries, driven by our commitment to help make everywhere safer for all.\nWe are building and connecting an ecosystem of safety and security technologies to help protect people, property and places, which includes Land Mobile Radio Communications (\"LMR\" or \"LMR Communications\"), Video Security and Access Control (\"Video\") and Command Center. Across all three technologies, we offer on-premises, cloud-based and hybrid software solutions, and services such as cybersecurity subscription services and managed and support services.\nWe support police, fire and other emergency responders to help protect communities, while our base of enterprise customers, including schools, hospitals, businesses and stadiums, continues to grow as the criticality of safety and security becomes increasingly important. As a provider to both public safety and enterprises, our technologies can connect those in need with those who can help, enabling the collaboration that is critical for a more proactive approach to safety and security. \nWe are incorporated under the laws of the State of Delaware as the successor to an Illinois corporation, Motorola, Inc., organized in 1928. We changed our name from Motorola, Inc. to Motorola Solutions, Inc. on January 4, 2011. Our principal executive offices are located at 500 W. Monroe St., Chicago, Illinois 60661.\nBusiness Organization\nWe manage our business organizationally through two segments: “Products and Systems Integration” and “Software and Services.” Within these segments, we have three principal product lines in which we report net sales:\n•\nLMR Communications: Infrastructure, devices (two-way radio and broadband, including both for public safety and professional and commercial radio (\"PCR\")) and software that enable communications, inclusive of installation and integration, backed by services, to assure availability, security and resiliency; \n•\nVideo: Cameras (fixed, body-worn, in-vehicle), access control, sensors, infrastructure, video management, software and artificial intelligence (\"AI\")-powered analytics that help enable visibility and bring attention to what’s important; and\n•\nCommand Center: Command center solutions and software applications that unify voice, video, data and analytics from public safety agencies, enterprises and the community to create a broad informational view to help simplify workflows and improve the accuracy and speed of decisions. \nThe Company has invested across these three technologies organically and through acquisitions to evolve its LMR focus and expand its safety and security products and services.\nOur strategy is to generate value through our technologies that help meet the changing needs of our customers around the world in protecting people, property and places. While each technology individually strives to make users safer and more productive, we believe we can enable better outcomes for our customers when we unite these technologies to work together. Our goal is to help remove silos and barriers between people and technologies, so that data unifies, information flows, operations run and collaboration improves to help strengthen safety and security everywhere. One example of this collaboration is highlighted by a school setting. When a teacher presses a panic button on a phone, this can automatically notify local law enforcement of an emergency, trigger a lockdown to secure all entries, share live video feeds with first responders and send mass notifications to key stakeholders inside and outside the school, helping schools to detect, respond and resolve safety and security threats.\nThe principal products within each segment, by technology, are described below:\nProducts and Systems Integration Segment\n \nIn 2024, the segment’s net sales were $6.9 billion, representing 64% of our consolidated net sales.    \nLMR Communications\nOur LMR Communications technology includes infrastructure and devices for LMR, as well as devices for public safety Long Term Evolution (“LTE”) and public carrier LTE. Our technology enables voice and multimedia collaborations across two-way radio, WiFi and public and private broadband networks. We are a global leader in the two-way radio category, including Project 25 (P25), Terrestrial Trunked Radio (“TETRA”) and Digital Mobile Radio (DMR), as well as other PCR solutions. We also deliver LTE solutions for public safety, government and commercial users, including devices operating in both low-band and mid-band frequencies, including Citizens’ Broadband Radio Service (CBRS) frequencies. We also offer High Frequency (HF) and Very High Frequency (VHF) communications technology to military, government and relief agency customers who require dynamic and mobile point-to-point voice communications in remote environments without the need for fixed infrastructure.\n We believe that public safety agencies and enterprises continue to trust LMR communications systems and devices because they are purpose-built and designed for reliability, availability, security and resiliency to help keep people connected even during the most challenging conditions. \n4\nBy extending our two-way radios with broadband data capabilities, we strive to provide our customers with greater functionality and multimedia access to the information and data they need in their workflows. Examples include application services such as GPS location to better protect lone workers, job dispatch to assign tasks and work orders and over-the-air programming to optimize device uptime. Our view is that complementary data applications such as these enable government, public safety and enterprise customers to work more efficiently and safely, while maintaining their mission-critical voice communications to remain connected and working in collaboration with others.\nPrimary sources of revenue for this technology come from selling devices and building communications systems, including the installation and integration of our infrastructure equipment within our customers’ technology environments. The LMR technology within the Products and Systems Integration segment represented 83% of the net sales of the total segment in 2024.\nVideo\nOur Video technology includes video management infrastructure, AI-powered security cameras including fixed and certain mobile video equipment, as well as on-premises and cloud-based access control solutions. We deploy video security and access control solutions to thousands of government and enterprise customers around the world, including schools, transportation systems, healthcare centers, public venues, commercial real estate, utilities, prisons, factories, casinos, airports, financial institutions, government facilities, state and local law enforcement agencies and retailers. Organizations such as these utilize video security and access control to verify critical events or incidents in real-time and to provide data to investigate an event or incident after it happens.\nOur view is that government and public safety customers are increasingly turning to video security technologies, including fixed and mobile cameras, to increase visibility, accountability and safety for communities and first responders alike. \nThe Video technology within the Products and Systems Integration segment represented 17% of the net sales of the total segment in 2024.\nSoftware and Services Segment\nIn 2024, the segment’s net sales were $3.9 billion, representing 36% of our consolidated net sales.\nLMR Communications\nLMR Communications services include support and managed services, which offer a broad continuum of support for our customers. Support services include repair and replacement, technical support and preventative maintenance, and more advanced offerings such as system monitoring, software updates and cybersecurity services. Managed services range from partial to full operational support of customer-owned or Motorola Solutions-owned communications systems. Our customers’ systems often have multi-year or multi-decade lifespans that help drive demand for software upgrades, device and infrastructure refresh opportunities, as well as additional services to monitor, manage, maintain and secure these complex networks and solutions. We strive to deliver services to our customers that help improve performance across their systems, devices and applications for greater safety and productivity.\nGiven the mission-critical nature of our customers’ operational environments, we aim to design the LMR networks they rely on for availability, security and resiliency. We have a comprehensive approach to system upgrades that addresses hardware, software and implementation services. As new system releases become available, we work with our customers to upgrade software, hardware, or both, with respect to site controllers, comparators, routers, LAN switches, servers, dispatch consoles, logging equipment, network management terminals, network security devices such as firewalls and intrusion detection sensors, on-site or remotely.\nThe LMR technology within the Software and Services segment represented 60% of the net sales of the total segment in 2024.\nVideo\nVideo software includes video network management software, decision management and digital evidence management software, certain mobile video equipment and advanced vehicle location data analysis software, including license plate recognition. Our software is designed to complement video hardware systems, providing end-to-end video security to help keep people, property and places safe. \nOur video network management software is embedded with AI-powered analytics to deliver operational insights to our customers by bringing attention to important events within their video footage. Given the growing volume of video content, we believe that analytics are critical to delivering meaningful, action-oriented insights. Our view is that these insights can help to proactively detect an important event in real time as well as reactively search video content to detect an important event that occurred in the past. For example, AI-powered analytics can highlight a person at a facility out of hours (unusual activity), locate a missing child at a theme park (appearance search), flag a vehicle of interest at a school (license plate recognition), send an alert if doors to a restricted area are propped open at a hospital (access control), or trigger a school's customized lockdown plan while simultaneously alerting first responders and sharing video footage from inside the school.\n5\nOur cloud technologies can offer organizations the ability to access, search and manage their video security, intrusion and access control system from a centralized dashboard, accessible on remote devices such as smartphones and laptops. Additionally, our on-premises fixed video systems can be connected to the cloud, providing our customers with the ability to securely access and manage video across their sites from a remote or central monitoring location. We believe that governments, public safety agencies and enterprises are increasingly turning to scalable, cloud-based multi-factor authentication access control to make their facilities more secure. \nOur Video services include our \"video-as-a-service\" subscription-based offerings for law enforcement, simplifying procurement by bundling hardware and software into a single subscription. For example, body cameras and in-car video systems can be paired with either on-premises or cloud-based digital evidence management software and complementary command center products. Our cloud solutions are also sold as-a-service, available as single-year to multi-year hosted services, supporting our customers with upgrades and software enhancements to help ensure system performance and technological advancement.\nThe Video technology within the Software and Services segment represented 20% of the net sales of the total segment in 2024.\nCommand Center\nOur Command Center portfolio consists of cloud-native, on-premises and hybrid software solutions that support the complex process of the public safety workflow from \"911 call to case closure.\" From the moment a person contacts 911, an array of individuals engage to gather information, coordinate a response and manage the incident to resolution. These individuals include call takers who answer and triage 911 calls; dispatchers who route calls to police, fire and emergency medical services to manage the response; first responders who support on scene; intelligence analysts who support the incident; records and evidence specialists who preserve information and evidence; detectives who manage cases; crime analysts who identify patterns and accelerate investigations; and corrections officers who oversee jail and inmate management. \nTo help ensure that individuals within the public safety workflow can work as efficiently, effectively and safely as possible, we believe it’s important that individuals within enterprises and communities can communicate and collaborate directly with public safety agencies, particularly during emergencies. Our Command Center portfolio offers solutions that are designed to help community members, enterprises and public safety agencies work together and share information in an effort to help prevent critical events from escalating and better inform an emergency response when an incident unfolds.\nOur Command Center software is designed to support an emergency response. In the 911 communications center, we offer call-taking and management software (including multimedia communication capabilities and AI-powered call transcription and language translation), and voice and computer-aided dispatch software to assign first responders to incidents. For emergency management teams, we offer mass notification and alerting (including panic button mobile applications), and incident collaboration software that aids in coordinating a multi-disciplinary response. In the field, we offer mobile applications that help first responders to collaborate with each other, remain connected to the information they need, manage an incident, capture critical information to support investigations, and remotely file reports. For information and support services teams, we offer integrated records and evidence management software, as well as solutions for managing tips and publishing crime maps to aid community engagement. For intelligence and investigations teams, we offer software that can unify voice, video and data in order to increase situational awareness from a single map-based view during a real-time incident response, and investigative tools to help uncover connections across records to generate leads and help close cases. For enterprises, we provide incident management and business resilience solutions that help secure people and facilities, as well as share information with public safety when an incident necessitates it.\nAnother area of public safety evolution is the increasing adoption of Next Generation 911 Core Services (“NGCS”), a group of products and services needed to create infrastructure connectivity in order to process a 911 call using Next Generation (“NG”) technology. The NG infrastructure is an Emergency Service IP Network (\"ESInet\"), which can carry voice, data and multimedia. ESInet enables 911 call takers at public safety answering points to respond to text, video and data. Our NGCS can be offered as a managed service and includes call routing, ESInet, location services, geographic information services, cybersecurity and our continuous communications network and security operations center dedicated to public safety. \nCommand Center also includes interoperability solutions that provide connectivity across LMR and broadband networks to help ensure that communication is not limited by coverage area, network technology or device type. Additionally, Command Center includes push-to-talk (\"PTT\") devices that deliver voice communications over LTE and Wi-Fi, and advanced back-end systems that enable and manage interoperable communications, capable of scaling from small enterprises to nationwide cellular networks. For example, a two-way radio network can connect with an LTE network, assisting individuals in communicating securely and more easily across technologies. These solutions can provide our public safety customers with the critical interoperability between multiple agencies' networks, facilitating a coordinated response.\nFinally, as the Command Center market continues to evolve from on-premises to hybrid and cloud technologies to improve their operations, we offer both cloud-native applications and cloud features that enhance on-premises applications. We believe this flexibility helps our customers to optimize their investments and enhance their systems with the technologies of their choice. \n The Command Center technology within the Software and Services segment represented 20% of the net sales of the total segment in 2024.\n6\nOur Customers and Contracts\nWe serve government agencies, state and local public safety agencies, as well as commercial and industrial customers. Our customer base is fragmented and widespread when considering the many levels of government, public safety agency and private sector decision-makers that procure and use our products and services. Serving this global customer base spanning federal, state, county, province, territory, municipal, and departmental independent bodies, along with our enterprise and industrial customers, requires a significant go-to-market investment.\nOur sales model includes both direct sales by our in-house sales force, which tends to focus on our largest accounts, and sales through our channel partner program. Our trained channel partners include independent dealers, distributors and software vendors around the world. The dealers and distributors each have their own sales organizations that complement and extend the reach of our sales force. The independent software vendors offer customized applications that meet the specific needs of the customers we serve.\nOur largest customer is the U.S. government (through multiple contracts with its various branches and agencies, including the armed services) representing approximately 9% of our consolidated net sales in 2024. The loss of this customer could have a material adverse effect on our revenue and earnings over several quarters as many of our contracts with the U.S. government are long-term in nature. All contracts with the U.S. government, and certain other government agencies within the U.S., are subject to cancellation at the customer’s convenience. For a discussion of risks related to these contracts and customer relationships, please refer to “Part I.",
    "item1a": "Item 1A. Risk Factors” of this Form 10-K for further information.\nCorporate Governance\nOur Board has delegated to the Audit Committee the responsibility to oversee risks related to cybersecurity threats. Specifically, subject to oversight by the full Board, the Vice President of Cybersecurity & Information Technology Infrastructure provides the Audit Committee with periodic cybersecurity and information security reports, including recent cybersecurity incidents and cybersecurity products and operations. \nAnnually, the Vice President of Audit Services reviews the results of the ERM assessment with the Audit Committee as well. In addition, a subset or the full group of certain individuals, such as our Chief Information Officer, Vice President of Cybersecurity & Information Technology Infrastructure, and Data Protection Officer, present at least once per year to the Audit Committee regarding cybersecurity and data privacy risk topics. The full Board is regularly informed about such risks through Audit Committee reports and presentations.\nOur Vice President of Cybersecurity & Information Technology Infrastructure, along with this individual's teams, are in charge of assessing and managing our risks related to cybersecurity, including by setting our strategy, policies, standards and processes in these areas, as further described above under “Risk Management & Strategy.” Utilizing the processes noted above, these teams remain informed about and monitor the prevention, detection, mitigation and remediation of cybersecurity incidents.\n \nOur Vice President of Cybersecurity & Information Technology Infrastructure has over thirty years of work experience in the information technology field, specifically information security. This individual began their career as a security engineer, progressing to a security architect, and then to overall leader of the Cybersecurity and Information Technology Infrastructure functions at the Company. This individual holds a Master of Computer Science degree. This individual also maintains a Certified Information Security Manager (CISM) certification from ISACA, an international professional organization focused on IT governance, as well as a Certified Information Systems Security Professional (CISSP) certification from the International Information System Security Certification Consortium (ISC2), a leading member association for cybersecurity professionals.\n27",
    "item1b": "Item 1B: Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C: Cybersecurity\nRisk Management & Strategy\nWe assess, identify and manage material risks from cybersecurity threats through various protective policies, procedures and processes, including through: (1) the monitoring responsibilities of our cybersecurity program; (2) our information security policies and standards, including our global incident response procedure; (3) our audit services department’s annual enterprise risk management (“ERM”) assessment; (4) our third-party cybersecurity risk assessment program; and (5) cybersecurity insurance.\nDesigned to maintain the confidentiality, integrity and availability of customer and internal company information, our cybersecurity program focuses on protecting our enterprise information systems and the secure development and deployment of our products. We monitor for critical vulnerabilities and threat actor activity, and work to create a unified view to prioritize protecting our critical infrastructure (including potential impacts to key third-party service providers to the Company). The cybersecurity program, which is led by our Vice President of Cybersecurity & Information Technology Infrastructure, holds regular meetings to review ongoing internal information security investigations. \nWe assess the effectiveness of our cybersecurity program using self-assessments and independent third-party analyses, and evaluate our program using frameworks such as the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework.\n \nIn addition to these independent third-party analyses, third-parties also provide services to support our cybersecurity in several ways, such as through penetration testing and commercial information security threat sharing networks, and by assisting with tabletop exercises and certain monitoring activities.\nWe have designed and implemented a global incident response procedure, which helps enable us to quickly detect, respond to, and recover from third-party malicious attacks and potential security incidents. This procedure includes formal steps to review incidents and implement improvements, including steps to involve the Vice President of Cybersecurity & Information Technology Infrastructure, as appropriate. In addition, we have other specific information security policies and standards, organized to align with various NIST frameworks, which we use to manage our cybersecurity risks.\nAssessing, identifying and managing cybersecurity risks are integrated into our audit services department’s annual ERM assessment, which is designed to identify, assess, prioritize, mitigate and monitor our principal risks.\n The ERM assessment considers the probability, impact and velocity of potential risks, providing management and the Audit Committee with an overarching and objective view of the Company's risk management activities. Audit services identifies and conducts engagements utilizing inputs from the ERM assessment. The engagements span financial, operational, strategic and compliance risks, with a view to assessing risks over a two-year time horizon. The engagement results assist management in maintaining acceptable risk levels. \nThe Vice President of Audit Services reports directly to the Audit Committee as well as to the Chief Financial Officer and meets regularly with the Audit Committee and its chairperson, including in executive sessions.\n Separately, the Vice President of Audit Services and Vice President of Ethics & Compliance head an internal cross-functional team (including members from our cybersecurity and data privacy programs, among others) that holds regular meetings to discuss the key risks facing the Company and related mitigation efforts, including cybersecurity risks. Cybersecurity risk is tracked as a principal risk within the context of the ERM assessment.\nIn addition, we have processes designed to oversee and identify risks from cybersecurity threats associated with our use of third-party service providers. Pursuant to our third-party cybersecurity risk assessment program, any outsource partners and suppliers that have access to the Company’s data or customer data complete a risk assessment prior to the Company engaging with such parties. Using the assessments, our cybersecurity program looks to determine any gaps and identified risks, and then appropriate teams within the Company work to track and remediate such risks. These third-party risk assessments are foundational for how we manage and monitor our supply chain.\nTo further complement the processes described above, we maintain insurance related to cybersecurity risks. We maintain a broad portfolio of insurance coverage, leveraging the products of multiple companies to help ensure appropriate protection.\n26\nWe are subject to attempts to compromise our information technology systems from both internal and external sources. Like all information technology systems, our systems have been in the past, and could be in the future, vulnerable to damage, unauthorized access or interruption from a variety of sources. \nAs of the filing of this Form 10-K, we are not aware of any such attacks that have occurred since the beginning of 2024 that have materially affected, or are reasonably likely to materially affect, us, including our business strategy, results of operations or financial condition.\n However, if as a result of any future attacks our information technology systems are significantly damaged, cease to function properly or are subject to a significant cybersecurity breach, we may suffer an interruption in our ability to manage and operate our business, and our business strategy, results of operations or financial condition could be adversely affected. Such attacks, whether or not successful, could damage our reputation and result in significant costs related to, for example, repairing or replacing our IT systems; the loss of critical data; interruptions or delays in our ability, or that of our customers, to perform critical functions; defending against claims for breach of contracts, tort and other civil claims without adequate indemnification from our suppliers; providing time-sensitive notification requirements; and providing modifications or replacements to our products and services. In addition, the volume, frequency and sophistication of these threats (including through the use of AI) continues to grow and the complexity and scale of the systems to be protected continues to increase. See “Risks Related to Information Technology and Intellectual Property” in “Part I."
  }
}