{
  "ticker": "MTCH",
  "cik": "0000891103",
  "company_name": "Match Group, Inc.",
  "filing_date": "2025-02-27",
  "accession": "0000891103-25-000027",
  "primary_doc": "mtch-20241231.htm",
  "item_sections": {
    "item1": "Item 1 Business—Dependencies on services provided by others—App Stores.”\nImplementing new technologies that enhance our user experience.\n We expect new technologies, including those utilizing generative AI, will be needed to continue to drive user engagement. As new technologies develop, we evaluate whether those technologies can be incorporated into our apps to enhance the user experience. In particular, we are working to further integrate AI technologies into our services, such as the recent launch of several AI integration initiatives, including the introduction of AI photo selection features to the Tinder and Hinge services, and an enhanced recommendation system, as well as integrated dating support, to the Hinge service. These integrations, and others that may be launched in the future, may become important to our operations over time. The rapid evolution of AI will require the dedication of significant resources to develop, test, and maintain these technologies. We expect other technologies to evolve and be tested in our services and incorporated into our apps in the future.\nIn addition to the trends affecting our overall portfolio, some of our individual brands are affected by certain other trends, including the following:\nTinder.\n When Tinder was first developed, the smart phone provided a unique way of offering connections that traditional desktop-based services did not offer. Tinder was able to capitalize on the rise in the use of smart phones and with its younger audience was able to achieve considerable scale through word-of-mouth and viral moments on social media without the need to supplement with significant marketing. As the availability of services catering to human connections has increased, we have begun to supplement Tinder’s viral growth with marketing to build out Tinder’s brand narrative and grow the size of its user base, which has resulted in an increase in selling and marketing expenses at Tinder. In the past two years, Tinder has experienced a decline in user growth, with plans to return to growth through product initiatives that focus on the female experience and younger users.\nHinge.\n Hinge has developed a strong user base in English speaking markets and began expanding into European markets in the latter half of 2022. Its strong user growth in English speaking and other European markets has helped to contribute to a high level of revenue growth. As Hinge continues to expand its footprint globally, we intend to continue to focus on adding new features to its service to continue to drive user satisfaction for its target audience of intentioned daters, and to drive additional opportunities for monetization. In the near term, we expect to continue to make investments in the business to support Hinge’s growth, including investments in product development as well as marketing.\nEvergreen & Emerging.\n Our collections of brands within E&E include well-known pioneers in online relationships (which we refer to as Evergreen brands) and newer brands which target specific demographics (which we refer to as Emerging brands). Revenues from the Evergreen brands have declined in recent years, while Emerging brands are in the early stages of growth and in many cases are relying on marketing to increase the size of their user base. We are in the middle of our multi-year process of consolidating technology platforms across various Evergreen and Emerging brands to enable faster new feature releases and to reduce the cost to maintain those platforms.\nMG Asia.\n Our Azar app, which provides one to one video chat, has a strong presence in the Middle East, growth in Europe, and expanded into the U.S. in 2024. Azar leverages AI capabilities to drive user growth and monetization globally. Our Pairs brand is a leader in dating in Japan. Pairs began advertising on television in 2024. We expect the advertising to continue to increase Pairs’ brand recognition while we work to grow users through various product initiatives and by partnering with local governments to improve declining marriage rates in the country. Pairs also has plans to expand into other Asian countries in 2025.\n37\nTable of Contents\nOther trends or factors affecting the comparability of our results\nCost of Acquisition.\n  Our cost of acquisition has consistently been one of our larger operating expenses. How we deploy our advertising spend varies among brands, with the majority of our advertising spend taking place online, including social media sites, streaming services, search engines, and influencers. Additionally, some brands utilize offline and out-of-home marketing campaigns, such as on television and outdoor billboards. For established brands, we seek to optimize for total return on advertising spend by frequently analyzing and adjusting spend to focus on marketing channels and markets that generate returns above our thresholds. Our data-driven approach provides us the flexibility to scale and optimize our advertising spend. We spend advertising dollars against an expected lifetime value of a Payer that is realized over a multi-year period. While this advertising spend is intended to be profitable on that basis, it is nearly always negative during the period in which the expense is incurred. For newer brands that are gaining scale, or existing brands that are expanding into new geographies, we may make incremental advertising investments to establish the brand before optimizing monetization of the brand. Our advertising spend may be incurred unevenly throughout the year.\nInternational markets.\n  Our services are available across the world. Our international revenue represented 54% of our total revenue for both years ended December 31, 2024 and 2023. We vary our pricing to align with local market conditions and our international businesses typically earn revenue in local currencies. As foreign currency exchange rates fluctuate, translation of the statement of operations of our international businesses into U.S. dollars affects year-over-year comparability of operating results.\n2024 Consolidated Results\nIn 2024, total revenue grew 3%, operating income decreased 10%, and Adjusted Operating Income was flat year-over-year. Revenue growth was primarily due to growth at Hinge, and to a lesser extent Tinder, offset by declines at E&E and MG Asia. Operating income and Adjusted Operating Income were positively affected by the increase in revenue. Operating income declined due to increases in non-cash compensation, impairments of certain intangible assets, and depreciation.\n38\nTable of Contents\nResults of Operations for the years ended December 31, 2024, 2023 and 2022\nThe following discussion should be read in conjunction with “Item 8. Consolidated Financial Statements and Supplementary Data.” \nRevenue\nYears Ended December 31,\n2024\nChange\n% Change\n2023\nChange\n% Change\n2022\n(Amounts in thousands, except RPP)\nDirect Revenue\nTinder\n$\n1,940,619 \n$\n22,990 \n1%\n$\n1,917,629 \n$\n123,162 \n7%\n$\n1,794,467 \nHinge\n550,435 \n153,950 \n39%\n396,485 \n112,817 \n40%\n283,668 \nEvergreen & Emerging\n642,988 \n(48,438)\n(7)%\n691,426 \n(38,946)\n(5)%\n730,372 \nMG Asia\n283,936 \n(18,655)\n(6)%\n302,591 \n(19,123)\n(6)%\n321,714 \nTotal Direct Revenue\n$\n3,417,978 \n$\n109,847 \n3%\n$\n3,308,131 \n$\n177,910 \n6%\n$\n3,130,221 \nIndirect Revenue\n61,395 \n5,022 \n9%\n56,373 \n(2,249)\n(4)%\n58,622 \nTotal Revenue\n$\n3,479,373 \n$\n114,869 \n3%\n$\n3,364,504 \n$\n175,661 \n6%\n$\n3,188,843 \nPayers:\nTinder\n9,696 \n(679)\n(7)%\n10,375 \n(502)\n(5)%\n10,877 \nHinge\n1,532 \n290 \n23%\n1,242 \n262 \n27%\n980 \nEvergreen & Emerging\n2,666 \n(400)\n(13)%\n3,066 \n(421)\n(12)%\n3,487 \nMG Asia\n1,004 \n85 \n9%\n919 \n(73)\n(7)%\n992 \nTotal\n14,898 \n(704)\n(5)%\n15,602 \n(734)\n(4)%\n16,336 \n(Change calculated using non-rounded numbers)\nRPP:\nTinder\n$\n16.68 \n$\n1.28 \n8%\n$\n15.40 \n$\n1.65 \n12%\n$\n13.75 \nHinge\n$\n29.94 \n$\n3.33 \n13%\n$\n26.61 \n$\n2.50 \n10%\n$\n24.11 \nEvergreen & Emerging\n$\n20.10 \n$\n1.31 \n7%\n$\n18.79 \n$\n1.33 \n8%\n$\n17.46 \nMG Asia\n$\n23.56 \n$\n(3.94)\n(14)%\n$\n27.50 \n$\n0.46 \n2%\n$\n27.04 \nTotal\n$\n19.12 \n$\n1.45 \n8%\n$\n17.67 \n$\n1.70 \n11%\n$\n15.97 \nFor the year ended December 31, 2024 compared to the year ended December 31, 2023 \nTinder Direct Revenue grew $23.0 million, or 1%, in 2024 versus 2023. Revenue growth was negatively impacted by the strength of the U.S. dollar compared to the Argentine Peso, Turkish Lira, and Japanese Yen, primarily. On a consistent foreign exchange rate basis, the growth was $68.6 million or 4%. Increased Direct Revenue was driven by an increase in RPP of 8% due to subscription pricing optimization, partially offset by decreases in á la carte revenue. The increase in RPP was partially offset by a 7% decrease in Payers.\nHinge Direct Revenue grew $154.0 million, or 39%, in 2024 versus 2023. Revenue growth was driven by both growth in the U.S. market as well as continued expansion efforts in certain European markets. Payers increased 23% compared to 2023. Additionally, RPP increased 13% over 2023 primarily due to pricing optimizations and increased spend on á la carte features.\nE&E Direct Revenue declined 7% in 2024 versus 2023. Within E&E, Evergreen brands declined 12%, while Emerging brands grew 17%. The overall decline at E&E was driven by a decline in Payers of 13% compared to 2023, partially offset by increased RPP of 7%. Our decision to terminate certain live streaming services in the second half of 2024 also contributed to the revenue decline compared to 2023.\nMG Asia Direct Revenue declined $18.7 million, or 6%, in 2024 versus 2023. Excluding revenue from Hakuna, which was shut down in the third quarter of 2024, MG Asia revenue declined $7.7 million or 3%. Revenue growth was also negatively impacted by the strength of the U.S. dollar compared to the Turkish Lira and Japanese Yen, primarily. On a consistent foreign exchange basis, Direct Revenue grew $7.5 million, or 2%, year-over-year as a result of Payer growth at Azar partially offset by modest Payer declines at Pairs.\n39\nTable of Contents\nIndirect Revenue increased $5.0 million primarily due to higher ad impressions as well as higher rates per ad impression compared to 2023.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nTinder Direct Revenue grew 7% in 2023 versus 2022, driven by growth in RPP due to pricing optimizations in the U.S. market and new weekly subscription offerings, partially offset by a decrease in Payers partially attributable to the pricing optimizations.\nHinge Direct Revenue grew 40% in 2023 versus 2022, driven by 27% growth in Payers and 10% growth in RPP. The Payer growth at Hinge was across geographies, but in particular in the Americas and Europe, which was a focus of international expansion in 2023 for Hinge. RPP increased as a result of pricing optimizations in the U.S.\nE&E Direct Revenue declined 5% in 2023 versus 2022, as we continued to moderate marketing spend at our Evergreen brands. The decline at our Evergreen brands was partially offset by growth at our Emerging brands.\nMG Asia Direct Revenue declined 6% in 2023 versus 2022, driven by declines at Hakuna and Pairs, partially offset by growth at Azar.\nIndirect Revenue decreased $2.2 million primarily due to a lower rate per ad impression compared to the prior year, partially offset by higher ad impressions.\nCost of revenue (exclusive of depreciation)\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nCost of revenue\n$\n991,273 \n$\n37,259 \n4%\n$\n954,014 \n$\n(5,949)\n(1)%\n$\n959,963 \nPercentage of revenue\n28%\n28%\n30%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nCost of revenue increased 4% primarily due to an increase in in-app purchase fees of $49.9 million primarily at Hinge as revenue increased and as a result of escrow payments returned in the prior year associated with the Google litigation, which are included in Corporate and Unallocated costs. The increase in in-app purchase fees was partially offset by a decrease in Variable Expenses of $13.9 million primarily at E&E and MG Asia as a result of the termination of certain of our live streaming services and the Hakuna app in 2024. Total in-app purchase fees were $696.6 million in 2024.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nCost of revenue decreased 1% primarily due to a decrease in Variable Expenses of $20.9 million, primarily related to costs associated with our live streaming services within MG Asia, and a decrease in employee compensation expense of $6.4 million, primarily within Corporate and Unallocated costs and Tinder. The decreases in Variable Expenses and employee compensation expense were partially offset by an increase in in-app purchase fees of $24.2 million, primarily at Tinder and Hinge, partially offset by the benefit from the escrow payments returned in 2023 associated with the Google litigation, which are included in Corporate and Unallocated costs. Total in-app purchase fees were $646.7 million and $622.5 million in 2023 and 2022, respectively.\n40\nTable of Contents\nSelling and marketing expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nSelling and marketing expense\n$\n622,100 \n$\n35,838 \n6%\n$\n586,262 \n$\n51,745 \n10%\n$\n534,517 \nPercentage of revenue\n18%\n17%\n17%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nSelling and marketing expense increased primarily due to higher cost of acquisition expense of $27.2 million primarily at Hinge and Tinder, partially offset by decreases at E&E and MG Asia.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nSelling and marketing expense increased primarily due to higher cost of acquisition expense of $44.7 million primarily at Tinder and Hinge, partially offset by decreases at E&E and MG Asia.\nGeneral and administrative expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nGeneral and administrative expense\n$\n438,839 \n$\n25,230 \n6%\n$\n413,609 \n$\n(22,259)\n(5)%\n$\n435,868 \nPercentage of revenue\n13%\n12%\n14%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nGeneral and administrative expense increased primarily due to an increase in digital sales taxes of $11.1 million, the majority of which relates to Canada’s implementation of a digital sales tax in June 2024 retroactive to 2022. Additionally, employee compensation expense increased $8.3 million and stock-based compensation expense increased $5.0 million across all segments and within Corporate and Unallocated costs.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nGeneral and administrative expense declined primarily due to a decrease in legal and other professional fees of $25.5 million within Corporate and Unallocated costs and a decrease in stock-based compensation expense of $7.6 million due to forfeitures of equity awards and modification of certain stock-based awards in the prior year, partially offset by an increase in employee compensation expense of $15.7 million, primarily within Corporate and Unallocated costs.\nProduct development expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nProduct development expense\n$\n442,175 \n$\n57,990 \n15%\n$\n384,185 \n$\n50,546 \n15%\n$\n333,639 \nPercentage of revenue\n13%\n11%\n10%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nProduct development expense increased primarily due to increases in employee compensation expense of $24.5 million and stock-based compensation expense of $26.3 million, both due to increased headcount at Hinge and Tinder, partially offset by a decrease at E&E.\n41\nTable of Contents\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nProduct development expense increased primarily due to increases in employee compensation expense of $18.3 million and stock-based compensation expense of $33.7 million, both due to increased headcount at both Hinge and Tinder.\nDepreciation\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nDepreciation \n$\n87,499 \n$\n25,692 \n42%\n$\n61,807 \n$\n18,213 \n42%\n$\n43,594 \nPercentage of revenue\n3%\n2%\n1%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nDepreciation was higher in 2024 as compared to 2023 primarily due to internally developed software at Tinder, MG Asia, and E&E.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nDepreciation was higher in 2023 as compared to 2022 primarily due to an increase in internally developed software placed in service at Tinder and MG Asia.\nImpairments and amortization of intangibles\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nImpairments and amortization of intangibles\n$\n74,175 \n$\n26,444 \n55%\n$\n47,731 \n$\n(318,526)\n(87)%\n$\n366,257 \nPercentage of revenue\n2%\n1%\n11%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nImpairments and amortization of intangibles increased primarily due to impairments of intangible assets of $30.6 million at E&E and MG Asia as a result of the termination of certain of our live streaming services and our Hakuna app in 2024.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nImpairments and amortization of intangibles decreased primarily due to impairments of both indefinite-lived intangible assets and definite-lived intangible assets in the prior period primarily at MG Asia.\n42\nTable of Contents\nOperating Income and Adjusted Operating Income\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nOperating income (loss):\nTinder\n$\n889,222 \n$\n(66,297)\n(7)%\n$\n955,519 \n$\n(951)\n—%\n$\n956,470 \nHinge\n121,482 \n47,221 \n64%\n74,261 \n(4,462)\n(6)%\n78,723 \nEvergreen & Emerging\n66,088 \n(16,372)\n(20)%\n82,460 \n46,581 \n130%\n35,879 \nMG Asia\n(32,345)\n(23,670)\n273%\n(8,675)\n303,352 \n(97)%\n(312,027)\nCorporate and unallocated costs\n(221,135)\n(34,466)\n18%\n(186,669)\n57,371 \n(24)%\n(244,040)\nOperating income\n$\n823,312 \n$\n(93,584)\n(10)%\n$\n916,896 \n$\n401,891 \n78%\n$\n515,005 \nAdjusted Operating Income (Loss):\nTinder\n$\n1,017,023 \n$\n(32,337)\n(3)%\n$\n1,049,360 \n$\n21,477 \n2%\n$\n1,027,883 \nHinge\n166,478 \n58,832 \n55%\n107,646 \n16,498 \n18%\n91,148 \nEvergreen & Emerging\n170,418 \n6,622 \n4%\n163,796 \n4,079 \n3%\n159,717 \nMG Asia\n60,806 \n(984)\n(2)%\n61,790 \n27,358 \n79%\n34,432 \nCorporate and unallocated costs\n(162,358)\n(38,299)\n31%\n(124,059)\n60,385 \n(33)%\n(184,444)\nAdjusted Operating Income\n$\n1,252,367 \n$\n(6,166)\n—%\n$\n1,258,533 \n$\n129,797 \n11%\n$\n1,128,736 \nFor a reconciliation of operating income to Adjusted Operating Income, see “Non-GAAP Financial Measures.”\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nOperating income decreased 10% or $93.6 million, and Adjusted Operating Income was relatively flat compared to 2023. Operating income and Adjusted Operated Income each benefited from the increase in revenue of $114.9 million, which was driven by growth at Hinge, offset by increased (i) cost of revenue, primarily due to increased in-app purchase fees as revenue at Hinge increased and as a result of returned escrow payments associated with the Google litigation in the prior year, (ii) selling and marketing expense, primarily due to increased cost of acquisition expense, (iii) general and administrative expense, primarily due to increased digital sales taxes, and (iv) product development expense, primarily due to increased employee compensation expense. Operating income was further impacted by increased (i) stock-based compensation expense of $35.3 million, primarily due to increased headcount within product development at Tinder and Hinge, (ii) impairments and amortization of intangible assets of $26.4 million, primarily related to impairments at MG Asia and E&E in 2024, and (iii) depreciation of $25.7 million, primarily related to internally developed software at Tinder, MG Asia, and E&E.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nOperating income increased 78% or $401.9 million, and Adjusted Operating Income increased 11% or $129.8 million. Operating income and Adjusted Operated Income each benefited from the increase in revenue of $175.7 million which was driven by growth at Tinder and Hinge, and lower general and administrative expense primarily related to decreases in legal and other professional fees. That benefit was partially offset by increases in selling and marketing spend and an increase in product development expense primarily due to increased compensation expense. Operating income further benefited from decreases in impairments of intangible assets of $316.1 million, partially offset by increased stock-based compensation expense primarily due to new stock-based awards granted during the year.\n43\nTable of Contents\nAt December 31, 2024, there was $359.8 million of unrecognized compensation cost, net of estimated forfeitures, related to all stock-based awards, which is expected to be recognized over a weighted average period of approximately 1.8 years.\nInterest expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nInterest expense\n$\n160,071 \n$\n184 \n—%\n$\n159,887 \n$\n14,340 \n10%\n$\n145,547 \nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nInterest expense remained relatively flat as compared to the prior year.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\n Interest expense increased primarily due to a higher interest rate on the Term Loan in 2023 as compared to the prior year.\nOther income, net \nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nInterest income\n$\n41,105 \n$\n14,333 \n54%\n$\n26,772 \n$\n22,404 \n513%\n$\n4,368 \nForeign currency losses\n(579)\n7,340 \n(93)%\n(7,919)\n(5,947)\n302%\n(1,972)\nOther\n289 \n(630)\n(69)%\n919 \n(4,718)\n(84)%\n5,637 \nOther income, net\n$\n40,815 \n$\n21,043 \n106%\n$\n19,772 \n$\n11,739 \n146%\n$\n8,033 \nIncome tax provision\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nIncome tax provision\n$\n152,743 \n$\n27,434 \n22%\n$\n125,309 \n$\n109,948 \nNM\n$\n15,361 \nEffective income tax rate\n22%\n16%\n4%\n______________________\nNM = Not Meaningful\nFor discussion of income taxes, see “Note 3—Income Taxes” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.”\nFor the year ended December 31, 2024, the Company recorded an income tax provision from continuing operations of $152.7 million at an effective tax rate of 22%, which is higher than the statutory rate primarily due to state income taxes and nondeductible stock-based compensation, partially offset by a lower tax rate on U.S. income derived from foreign sources and research credits.\nFor the year ended December 31, 2023, the Company recorded an income tax provision from continuing operations of $125.3 million at an effective tax rate of 16%, which is lower than the statutory rate primarily due to (i) a release of a valuation allowance associated with U.S. foreign tax credits that we now expect to utilize, (ii) a lower tax rate on U.S. income derived from foreign sources, and (iii) the generation of federal and state research credits. These benefits were partially offset by state income taxes and nondeductible stock-based compensation.\n44\nTable of Contents\nFor the year ended December 31, 2022, the Company recorded an income tax provision from continuing operations of $15.4 million at an effective tax rate of 4%, which is lower than the statutory rate primarily due to (i) excess tax benefits generated by the exercise and vesting of stock-based awards, (ii) a release of a valuation allowance on certain foreign deferred tax assets that we expect to utilize, (iii) favorable outcomes of tax audits and (iv) a lower tax rate on U.S. income derived from foreign sources. The benefits were partially offset by higher state income taxes due to higher taxable income in the U.S.\nA number of countries have enacted or are actively drafting legislation to implement the Organization for Economic Cooperation and Development's (\"OECD\") international tax framework, including the Pillar II minimum tax regime. The Company analyzed the impact of enacted legislation and determined it does not have a material impact to the income tax provision. The Company is continuing to monitor future developments.\n45\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nMatch Group reports Adjusted Operating Income and Revenue excluding foreign exchange effects, both of which are supplemental measures to U.S. generally accepted accounting principles (“GAAP”). Adjusted Operating Income is among the primary metrics by which we evaluate the performance of our business, on which our internal budget is based, and by which management is compensated. Revenue excluding foreign exchange effects provides a comparable framework for assessing how our business performed without the effect of exchange rate differences when compared to prior periods. We believe that investors should have access to the same set of tools that we use in analyzing our results. These non-GAAP measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for or superior to GAAP results. Match Group endeavors to compensate for the limitations of the non-GAAP measures presented by providing the comparable GAAP measures with equal or greater prominence and descriptions of the reconciling items, including quantifying such items, to derive the non-GAAP measures. We encourage investors to examine the reconciling adjustments between the GAAP and non-GAAP measures, which we discuss below.\nAdjusted Operating Income\nAdjusted Operating Income \nis defined as operating income excluding: (1) stock-based compensation expense; (2) depreciation; and (3) acquisition-related items consisting of (i) amortization of intangible assets and impairments of goodwill and intangible assets, if applicable, and (ii) gains and losses recognized on changes in the fair value of contingent consideration arrangements, as applicable. We believe this measure is useful to analysts and investors as this measure allows a more meaningful comparison between our performance and that of our competitors. The above items are excluded from our Adjusted Operating Income measure because they are non-cash in nature. Adjusted Operating Income has certain limitations because it excludes the impact of certain expenses.\nNon-Cash Expenses That Are Excluded From Adjusted Operating Income\nStock-based compensation expense\n consists principally of expense associated with the grants of restricted stock units (“RSUs”), performance-based RSUs, and market-based awards. These expenses are not paid in cash, and we include the related shares in our fully diluted shares outstanding using the treasury stock method; however, performance-based RSUs and market-based awards are included only to the extent the applicable performance or market condition(s) have been met (assuming the end of the reporting period is the end of the contingency period). To the extent stock-based awards are settled on a net basis, we remit the required tax-withholding amounts from current funds.\nDepreciation \nis a non-cash expense relating to our property and equipment and is computed using the straight-line method to allocate the cost of depreciable assets to operations over their estimated useful lives, or, in the case of leasehold improvements, the lease term, if shorter.\nAmortization of intangible assets and impairments of goodwill and intangible assets \nare non-cash expenses related primarily to acquisitions. At the time of an acquisition, the identifiable definite-lived intangible assets of the acquired company, such as customer lists, trade names, and technology, are valued and amortized over their estimated lives. Value is also assigned to (i) acquired indefinite-lived intangible assets, which consist of trade names and trademarks, and (ii) goodwill, which are not subject to amortization. An impairment is recorded when the carrying value of an intangible asset or goodwill exceeds its fair value. We believe that intangible assets represent costs incurred by the acquired company to build value prior to acquisition and the related amortization and impairment charges of intangible assets or goodwill, if applicable, are not ongoing costs of doing business.\n46\nTable of Contents\nThe following table reconciles operating income (loss) to Adjusted Operating Income (Loss) for the Company’s reportable segments and at a consolidated level:\nYear Ended December 31, 2024\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nImpairments and Amortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n889,222 \n$\n90,141 \n$\n37,660 \n$\n— \n$\n1,017,023 \nHinge\n121,482 \n42,673 \n2,323 \n— \n166,478 \nEvergreen & Emerging\n66,088 \n54,922 \n21,732 \n27,676 \n170,418 \nMG Asia\n(32,345)\n25,818 \n20,834 \n46,499 \n60,806 \nCorporate and unallocated costs\n(221,135)\n53,827 \n4,950 \n— \n(162,358)\nTotal\n$\n823,312 \n$\n267,381 \n$\n87,499 \n$\n74,175 \n$\n1,252,367 \nYear Ended December 31, 2023\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nAmortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n955,519 \n$\n68,644 \n$\n25,197 \n$\n— \n$\n1,049,360 \nHinge\n74,261 \n31,459 \n1,926 \n— \n107,646 \nEvergreen & Emerging\n82,460 \n50,268 \n18,732 \n12,336 \n163,796 \nMG Asia\n(8,675)\n23,399 \n11,671 \n35,395 \n61,790 \nCorporate and unallocated costs\n(186,669)\n58,329 \n4,281 \n— \n(124,059)\nTotal\n$\n916,896 \n$\n232,099 \n$\n61,807 \n$\n47,731 \n$\n1,258,533 \nYear Ended December 31, 2022\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nImpairments and Amortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n956,470 \n$\n56,085 \n$\n15,328 \n$\n— \n$\n1,027,883 \nHinge\n78,723 \n10,794 \n1,631 \n— \n91,148 \nEvergreen & Emerging\n35,879 \n52,498 \n17,971 \n53,369 \n159,717 \nMG Asia\n(312,027)\n28,294 \n5,277 \n312,888 \n34,432 \nCorporate and unallocated costs\n(244,040)\n56,209 \n3,387 \n— \n(184,444)\nTotal\n$\n515,005 \n$\n203,880 \n$\n43,594 \n$\n366,257 \n$\n1,128,736 \n47\nTable of Contents\nEffects of Changes in Foreign Exchange Rates on Revenue\nThe impact of foreign exchange rates on the Company, due to its global reach, may be an important factor in understanding period over period comparisons if movement in exchange rates is significant. Since our results are reported in U.S. dollars, international revenue is favorably impacted as the U.S. dollar weakens relative to other currencies, and unfavorably impacted as the U.S. dollar strengthens relative to other currencies. We believe the presentation of revenue excluding the effects from foreign exchange, in addition to reported revenue, helps improve investors’ ability to understand the Company’s performance because it excludes the impact of foreign currency volatility that is not indicative of Match Group’s core operating results.\nRevenue excluding foreign exchange effects compares results between periods as if exchange rates had remained constant period over period. Revenue excluding foreign exchange effects is calculated by translating current period revenue using prior period exchange rates. The percentage change in revenue excluding foreign exchange effects is calculated by determining the change in current period revenue over prior period revenue where current period revenue is translated using prior period exchange rates.\nThe following tables present the impact of foreign exchange effects on total revenue and Direct Revenue by segment for the year ended December 31, 2024 compared to the year ended December 31, 2023:\n \nYears ended December 31,\n \n2024\n$ Change\n% Change\n2023\n \n(Dollars in thousands)\nTotal Revenue, as reported\n$\n3,479,373 \n$\n114,869 \n3%\n$\n3,364,504 \nForeign exchange effects\n73,769 \nTotal Revenue excluding foreign exchange effects\n$\n3,553,142 \n$\n188,638 \n6%\n$\n3,364,504 \nTinder Direct Revenue, as reported\n$\n1,940,619 \n$\n22,990 \n1%\n$\n1,917,629 \nForeign exchange effects\n45,564 \nTinder Direct Revenue, excluding foreign exchange effects\n$\n1,986,183 \n$\n68,554 \n4%\n$\n1,917,629 \nHinge Direct Revenue, as reported\n$\n550,435 \n$\n153,950 \n39%\n$\n396,485 \nForeign exchange effects\n(371)\nHinge Direct Revenue, excluding foreign exchange effects\n$\n550,064 \n$\n153,579 \n39%\n$\n396,485 \nE&E Direct Revenue, as reported\n$\n642,988 \n$\n(48,438)\n(7)%\n$\n691,426 \nForeign exchange effects\n1,462 \nE&E Direct Revenue, excluding foreign exchange effects\n$\n644,450 \n$\n(46,976)\n(7)%\n$\n691,426 \nMG Asia Direct Revenue, as reported\n$\n283,936 \n$\n(18,655)\n(6)%\n$\n302,591 \nForeign exchange effects\n26,163 \nMG Asia Direct Revenue, excluding foreign exchange effects\n$\n310,099 \n$\n7,508 \n2%\n$\n302,591 \n48\nTable of Contents\nFINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES\nFinancial Position\nDecember 31, 2024\nDecember 31, 2023\n(In thousands)\nCash and cash equivalents:\nUnited States\n$\n705,967 \n$\n647,177 \nAll other countries\n260,026 \n215,263 \nTotal cash and cash equivalents\n965,993 \n862,440 \nShort-term investments\n4,734 \n6,200 \nTotal cash and cash equivalents and short-term investments\n$\n970,727 \n$\n868,640 \nLong-term debt, net:\nCredit Facility due March 20, 2029\n(a)\n$\n— \n$\n— \nTerm Loan due February 13, 2027\n425,000 \n425,000 \n5.00% Senior Notes due December 15, 2027\n450,000 \n450,000 \n4.625% Senior Notes due June 1, 2028\n500,000 \n500,000 \n5.625% Senior Notes due February 15, 2029\n350,000 \n350,000 \n4.125% Senior Notes due August 1, 2030\n500,000 \n500,000 \n3.625% Senior Notes due October 1, 2031\n500,000 \n500,000 \n2026 Exchangeable Notes due June 15, 2026\n575,000 \n575,000 \n2030 Exchangeable Notes due January 15, 2030\n575,000 \n575,000 \n     Total long-term debt\n3,875,000 \n3,875,000 \n     Less: Unamortized original issue discount\n2,554 \n3,479 \n     Less: Unamortized debt issuance costs\n23,463 \n29,279 \nTotal long-term debt, net\n$\n3,848,983 \n$\n3,842,242 \n______________________\n(a)\nThe maturity date of the Credit Facility is the earlier of (x) March 20, 2029 and (y) the date that is 91 days prior to the maturity date of the Term Loan or the existing senior notes due 2027, 2028, or 2029, or any new indebtedness used to refinance the Term Loan or such senior notes that matures prior to the date that is 91 days after March 20, 2029, in each case if and only if at least $250 million in aggregate principal amount of such debt is outstanding on such date.\nLong-term Debt\nFor a detailed description of long-term debt, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8. Consolidated Financial Statements and Supplementary Data.”\n49\nTable of Contents\nCash Flow Information\nIn summary, the Company’s cash flows from continuing operations are as follows:\nYears ended December 31,\n2024\n2023\n2022\n(In thousands)\nNet cash provided by operating activities attributable to continuing operations\n$\n932,719 \n$\n896,791 \n$\n525,688 \nNet cash used in investing activities attributable to continuing operations\n(58,538)\n(76,581)\n(71,702)\nNet cash used in financing activities attributable to continuing operations\n(758,304)\n(534,068)\n(689,173)\n2024\nNet cash provided by operating activities attributable to continuing operations in 2024 includes adjustments to earnings consisting primarily of $267.4 million of stock-based compensation expense; $87.5 million of depreciation; $74.2 million of impairments and amortization of intangibles; deferred income taxes of $15.0 million; and other adjustments of $2.0 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of a decrease in deferred revenue of $43.1 million as weekly subscriptions have increased and an increase in accounts receivable of $29.8 million primarily related to the timing of receipts and an increase in revenue from app stores. These decreases in cash were partially offset by an increase from other assets of $25.3 million, primarily related to amortization of certain assets, and an increase in income taxes payable of $22.2 million due to the timing of tax payments.\nNet cash used in investing activities attributable to continuing operations in 2024 consists primarily of capital expenditures of $50.6 million that are primarily related to internal development of software and purchases of computer hardware.\nNet cash used in financing activities attributable to continuing operations in 2024 is primarily due to purchases of treasury stock of $752.7 million and payments of $11.4 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $13.6 million of proceeds from the issuance of common stock pursuant to stock-based awards.\n2023\nNet cash provided by operating activities attributable to continuing operations in 2023 includes adjustments to earnings consisting primarily of $232.1 million of stock-based compensation expense; $61.8 million of depreciation; $47.7 million of impairments and amortization of intangibles; deferred income taxes of $26.6 million; and other adjustments of $9.9 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of an increase in accounts receivable of $107.4 million primarily related to the timing of receipts and an increase in revenue from app stores, and a decrease in deferred revenue of $41.2 million as weekly subscriptions have increased. These decreases in cash were partially offset by an increase from other assets of $25.1 million.\nNet cash used in investing activities attributable to continuing operations in 2023 consists primarily of capital expenditures of $67.4 million that are primarily related to internal development of software and computer hardware to support our services.\nNet cash used in financing activities attributable to continuing operations in 2023 is primarily due to purchases of treasury stock of $546.2 million and payments of $5.9 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $19.9 million of proceeds from the issuance of common stock pursuant to stock-based awards.\n2022\nNet cash provided by operating activities attributable to continuing operations in 2022 includes adjustments to earnings consisting primarily of $366.3 million of impairments and amortization of intangibles; $203.9 million of stock-based compensation expense; $43.6 million of depreciation; and other adjustments of $7.0 million, which includes amortization of deferred financing costs of $6.7 million. Partially offsetting these \n50\nTable of Contents\nadjustments was a deferred income tax benefit of $30.0 million. The decrease in cash from changes in working capital primarily consists of a decrease in accounts payable and other liabilities of $472.6 million due mainly to the settlement payment for \nRad, et al. v. IAC/InterActiveCorp, et al. \nand related arbitrations, and timing of other payments; an increase in accounts receivable of $6.7 million primarily related to increased revenue from mobile applications; and a decrease in deferred revenue of $6.5 million. These uses of cash were partially offset by an increase from other assets of $59.6 million primarily due to the amortization of prepaid hosting services.\nNet cash used in investing activities attributable to continuing operations in 2022 consists primarily of capital expenditures of $49.1 million that are primarily related to internal development of software and computer hardware to support our services, and cash used in an acquisition, net of cash acquired, of $25.7 million.\nNet cash used in financing activities attributable to continuing operations in 2022 is primarily due to purchases of treasury stock of $482.0 million, payments of $176.3 million to settle the outstanding 2022 Exchangeable Notes, payments of $109.3 million of withholding taxes paid on behalf of employees for net-settled stock-based awards, purchases of non-controlling interests for $10.6 million, and payments of $7.5 million to settle outstanding warrants associated with the 2022 Exchangeable Notes. These uses of cash were partially offset by proceeds of $75.9 million related to the settlement of certain note hedges associated with the 2022 Exchangeable Notes, and $20.5 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nLiquidity and Capital Resources\nThe Company’s principal sources of liquidity are its cash and cash equivalents as well as cash flows generated from operations. At December 31, 2024, $499.4 million was available under the Credit Facility.\nThe Company has various obligations related to long-term debt instruments and operating leases. For additional information on long-term debt, including maturity dates and interest rates, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” For additional information on the operating leases, including a schedule of obligations by year, see “Note 13—Leases” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” The Company believes it has sufficient cash flows from operations to satisfy these future obligations.\nOn January 21, 2025, the Company repaid the Term Loan in full utilizing cash on hand.\nThe Company anticipates that it will need to make capital and other expenditures in connection with the development and expansion of its operations. The Company expects that 2025 cash capital expenditures will be between $45 million and $50 million, flat to 2024 cash capital expenditures.\nWe have entered into various purchase commitments, primarily consisting of web hosting services that are currently committed through January 2028. Our obligations under these various purchase commitments, which were impacted by usage rates in 2024, are $68.6 million for 2025, $8.7 million for 2026, $9.8 million for 2027, and $9.0 million for 2028.\nThe Company does not have any off-balance sheet arrangements at December 31, 2024, other than those described above.\nIn January 2024, the Board of Directors of the Company approved a share repurchase program of up to $1.0 billion in aggregate value of shares of Match Group stock (the “January Share Repurchase Program”). On December 10, 2024, the Board of Directors authorized a new repurchase program of up to $1.5 billion in aggregate value of shares of Match Group common stock (the “December Share Repurchase Program”). The December Share Repurchase Program will take effect when the January Share Repurchase Program, of which $247 million in aggregate value of shares of Match Group common stock remains available as of December 31, 2024, is exhausted. Under both the January and December Share Repurchase Programs, shares of our common stock may be purchased on a discretionary basis from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases, privately negotiated transactions or other means, including through Rule 10b5-1 trading plans. Both the January and December Share Repurchase Programs may be commenced, suspended or discontinued at any time. During the year ended \n51\nTable of Contents\nDecember 31, 2024, we repurchased 22.2 million shares for $752.7 million under the January Share Repurchase Program.\nBeginning mid-January 2025, the Company settles substantially all equity awards on a net basis. Assuming all equity awards outstanding on January 31, 2025 were net settled at the closing price on that date, we would issue 8.5 million shares of common stock (of which 0.6 million are related to vested awards and 7.9 million are related to unvested awards) and, assuming a 50% withholding rate, would remit $302.5 million in cash for withholding taxes (of which $20.7 million is related to vested awards and $281.8 million is related to unvested awards). If we did not settle awards on a net basis and instead issued a sufficient number of shares to cover the $302.5 million employee withholding tax obligation, 8.5 million additional shares would be issued by the Company.\nAt December 31, 2024, most of the Company’s international cash can be repatriated without significant tax consequences.\nOur indebtedness could limit our ability to: (i) obtain additional financing to fund working capital needs, acquisitions, capital expenditures, debt service, or other requirements; and (ii) use operating cash flow to pursue acquisitions or invest in other areas, such as developing properties and exploiting business opportunities. The Company may need to raise additional capital through future debt or equity financing to make additional acquisitions and investments or to provide for greater financial flexibility. Additional financing may not be available on terms favorable to the Company or at all.\n52\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe following disclosure is provided to supplement the descriptions of Match Group’s accounting policies contained in “Note 2—Summary of Significant Accounting Policies” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data” in regard to significant areas of judgment. Management of the Company is required to make certain estimates, judgments and assumptions during the preparation of its consolidated financial statements in accordance with GAAP. These estimates, judgments and assumptions impact the reported amount of assets, liabilities, revenue and expenses and the related disclosure of contingent assets and liabilities. Actual results could differ from these estimates. Because of the size of the financial statement elements to which they relate, some of our accounting policies and estimates have a more significant impact on our consolidated financial statements than others. What follows is a discussion of some of our more significant accounting policies and estimates.\nBusiness Combinations\nAcquisitions have historically been an important part of our growth strategy. The purchase price of each acquisition is attributed to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets that either arise from a contractual or legal right or are separable from goodwill. The fair value of these intangible assets is based on valuations that use information and assumptions provided by management. The excess purchase price over the net tangible and identifiable intangible assets is recorded as goodwill and is assigned to the reporting unit that is expected to benefit from the combination as of the acquisition date.\nRecoverability of Goodwill and Indefinite-Lived Intangible Assets\nGoodwill is the Company’s largest asset with a carrying value of $2.3 billion at each of December 31, 2024 and 2023, representing 52% of the Company’s total assets on both dates. Indefinite-lived intangible assets, which consist of certain of the Company’s acquired trade names and trademarks, have a carrying value of $96.9 million and $183.1 million at December 31, 2024 and 2023, respectively.\nThe Company assesses goodwill on its four reporting units and indefinite-lived intangible assets for impairment annually as of October 1, or more frequently if an event occurs or circumstances indicate that it is more likely than not the fair value of a reporting unit or the fair value of an indefinite-lived intangible asset is below its carrying value.\nGoodwill\nWhen the Company elects to perform a qualitative assessment and concludes it is not more likely than not that the fair value of the reporting unit is less than its carrying value, no further assessment of that reporting unit’s goodwill is necessary; otherwise, a quantitative assessment is performed to further assess if any goodwill impairment exists.\nIf the Company concludes that it is more likely than not that there may be an impairment, the fair value of each reporting unit will be determined and compared to its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, goodwill of the reporting unit is not impaired. If the carrying value of a reporting unit exceeds its estimated fair value, an impairment loss equal to the excess is recorded.\nAs a result of the change to our operating segments in the third quarter of 2024, we reassessed our reporting units and determined that the four operating segments are also our reporting units for the purpose of evaluating goodwill for impairment. The Company re-allocated goodwill to each of the four reporting units based on their relative fair values as of September 30, 2024. This change in reporting units is considered a triggering event that requires a goodwill impairment assessment to be performed immediately before and after the change. There was no goodwill impairment identified in either the before or after impairment tests. In measuring the estimated fair value of each operating unit, the Company used a combination of an income approach and a market approach. Under the income approach, a discounted cash flow analysis is performed with assumptions and estimates of forecast operating cash flows, including revenue growth rates, profitability margins, and discount rates, which all vary among reporting units. The market approach utilizes the guideline public companies method and is based on revenue and earnings multiple data derived from publicly traded peer group companies.\n53\nTable of Contents\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its reporting units are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of each reporting unit exceeded their carrying values. Additionally, the 2023 annual assessment did not identify any goodwill impairments.\nIndefinite-Lived Intangible Assets\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its indefinite-lived intangible assets are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of our indefinite-lived intangible assets exceeded the carrying values.\nFor assets in which a quantitative assessment is performed, the Company determines the fair value of its indefinite-lived intangible assets using an avoided royalty discounted cash flow (“DCF”) valuation analysis. Significant judgments inherent in this analysis include the selection of appropriate royalty and discount rates and estimating the amount and timing of expected future cash flows. The discount rates used in the DCF analyses are intended to reflect the risks inherent in the expected future cash flows generated by the respective intangible assets. The royalty rates used in the DCF analyses are based upon an estimate of the royalty rates that a market participant would pay to license the specific trade names and trademarks. The future cash flows are based on the Company’s most recent forecast and budget and, for years beyond the budget, the Company’s estimates are based, in part, on forecasted growth rates. Assumptions used in the avoided royalty DCF analyses, including the discount rate and royalty rate, are assessed when a quantitative assessment is performed based on the actual and projected cash flows related to the asset, as well as macroeconomic and industry specific factors. The discount rates used in the Company’s 2023 quantitative assessments as part of the annual indefinite-lived impairment assessment ranged from 15% to 18%, and the royalty rates used ranged from 3% to 8%.\nIf the carrying value of an indefinite-lived intangible asset exceeds its estimated fair value, an impairment equal to the excess is recorded.\nDuring the third quarter ended September 30, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $28.7 million related to indefinite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. For certain assets with no remaining cash flows, the Company fully impaired the asset. For assets with remaining cash flows, the Company conducted discounted cash flow valuations. During the year ended December 31, 2022, the Company recognized impairment charges of $244.3 million in the Match Group Asia segment related to the Azar and Hakuna brands at Hyperconnect, $43.9 million in the Evergreen & Emerging segment related to the Meetic and Match brands in Europe, and $5.5 million in the Evergreen & Emerging segment related to certain Affinity brands in the U.S., all of which are included within “Impairment and amortization of intangibles” in the consolidated statement of operations.\nAt December 31, 2023, the aggregate indefinite-lived intangible asset balance for which the estimate of fair value was less than 110% of carrying values was approximately $76.5 million. These assets identified at December 31, 2023 had additional impairments taken during the year ended December 31, 2024 and the assets were either fully impaired as no additional cash flows were identified or impaired and moved to definite-lived intangible assets during the year ended December 31, 2024. At December 31, 2024, based on our qualitative analysis performed, none of the Company’s remaining indefinite-lived intangible assets fair values were identified as being near their carrying value.\nIn connection with the annual impairment assessment, the Company reviews the useful lives for intangible assets and whether events or changes in circumstances indicate that an indefinite life may no longer be appropriate. During the year ended December 31, 2024, the Company reclassified certain indefinite-lived intangible assets with a carrying value of $47.2 million to the definite-lived intangible asset category because these assets were no longer considered to have an indefinite life.\nRecoverability and Estimated Useful Lives of Definite-lived Intangible Assets\nWe review the carrying value of all definite-lived intangible assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. The carrying value \n54\nTable of Contents\nof a definite-lived intangible asset is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If the carrying value is deemed not to be recoverable, an impairment loss is recorded equal to the amount by which the carrying value of the definite-lived intangible asset exceeds its fair value. In addition, the Company reviews the useful lives of its definite-lived intangible assets whenever events or changes in circumstances indicate that these lives may be changed. During the year ended December 31, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $1.9 million related to definite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. The carrying value of definite-lived intangible assets was $118.5 million and $122.7 million, at December 31, 2024 and 2023, respectively.\nIncome Taxes\nMatch Group is subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws.\nWe record a provision for income taxes for the anticipated tax consequences of our reported results of operations using the asset and liability method. Under this method, we recognize deferred income tax assets and liabilities for the future tax consequences of temporary differences between the financial reporting and tax bases of asset and liabilities, as well as for net operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be realized or settled. We recognize the deferred income tax effects of a change in tax rates in the period of enactment.\nA valuation allowance is provided on deferred tax assets if it is determined that it is more likely than not that the deferred tax asset will not be realized. We consider all available evidence, both positive and negative, including historical levels of income, expectations and risks associated with estimates of future taxable income, and tax planning strategies in assessing the need for a valuation allowance.\nWe recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained based on the technical merits of the position. Such tax benefits are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement. This measurement step is inherently difficult and requires subjective estimations of such amounts to determine the probability of various possible outcomes. We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustment. We make adjustments to our unrecognized tax benefits when facts and circumstances change, such as the closing of a tax audit or the refinement of an estimate. Although we believe that we have adequately reserved for our uncertain tax positions, the final outcome of these matters may vary significantly from our estimates. To the extent that the final outcome of these matters is different from the amounts recorded, such differences will affect the income tax provision in the period in which such determination is made, and could have a material impact on our financial condition and operating results.\nStock-Based Compensation\nThe Company recorded stock-based compensation expense of $267.4 million and $232.1 million for the years ended December 31, 2024 and 2023, respectively.\nAccounting for stock-based compensation at the Company is often complex due to the variety of instruments we use to attract, retain, and reward employees at many of our brands by allowing them to benefit from the value they help to create. We also utilize stock-based awards as part of our acquisition strategy. We accomplish these objectives, in part, by issuing awards denominated in the equity of our non-public subsidiaries as well as in Match Group, Inc. We further refine this approach by tailoring the terms of awards as appropriate. For example, we issue certain awards with vesting conditioned on the achievement of specified performance targets such as revenue or profits; these awards are referred to as performance awards. In other cases, we condition the vesting of awards to the achievement of value targets for a specific subsidiary or the Company’s stock price; these awards are referred to as market-based awards.\nThe Company issues RSUs and performance-based RSUs (“PSUs”). The value of RSUs with vesting subject only to continued service is based on the fair value of Match Group common stock on the grant date. The value \n55\nTable of Contents\nof RSUs that include a market condition is based on fair value estimated using a lattice model. The value of RSUs is expensed as stock-based compensation expense over the applicable vesting term. For PSU awards, the expense is measured at the grant date as the fair value of Match Group common stock and expensed as stock-based compensation over the vesting term if the performance targets are considered probable of being achieved.\nRecent Accounting Pronouncements \nFor a discussion of recent accounting pronouncements, see “Note 2—Summary of Significant Accounting Policies” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.”\n56\nTable of Contents\nItem 7A.    Quantitative and Qualitative Disclosures About Market Risk\nInterest Rate Risk\nThe Company’s exposure to market risk for changes in interest rates relates primarily to the Company’s long-term debt.\nAt December 31, 2024, the Company’s outstanding long-term debt was $3.9 billion, of which $3.5 billion consists of Senior Notes and Exchangeable Senior Notes that bear interest at fixed rates. If market rates decline, the Company runs the risk that the required payments on the fixed-rate debt will exceed those on debt based on market rates. A 100 basis point increase or decrease in the level of interest rates would, respectively, decrease or increase the fair value of the fixed-rate debt by $118.0 million. Such potential increase or decrease in fair value is based on certain simplifying assumptions, including a constant level and rate of fixed-rate debt for all maturities and an immediate across-the-board increase or decrease in the level of interest rates with no other subsequent changes for the remainder of the period. At December 31, 2024, the $425 million Term Loan bore interest at a variable rate, Adjusted Term SOFR plus 1.75%.\nOn January 21, 2025, the Company repaid the Term Loan in full utilizing cash on hand.\nForeign Currency Exchange Risk\nThe Company conducts business in certain foreign markets, primarily in various jurisdictions in Europe and Asia. As a result, we are exposed to foreign exchange risk related to certain currencies, primarily the Euro, British Pound (“GBP”), Japanese Yen (“JPY”), Turkish Lira (“TRY”), and Argentine Peso (“ARS”).\nFor the years ended December 31, 2024, 2023 and 2022, international revenue accounted for 54%, 54% and 55%, respectively, of our consolidated revenue. We have exposure to foreign currency exchange risk related to transactions carried out in a currency other than the U.S. dollar, and investments in foreign subsidiaries with a functional currency other than the U.S. dollar. As foreign currency exchange rates change, translation of the statement of operations of our international businesses into U.S. dollars affects year-over-year comparability of operating results. The average GBP exchange rate strengthened against the U.S. Dollar by 3% in 2024 compared to 2023. The average JPY, TRY, and ARS exchange rates weakened against the U.S. Dollar by 7%, 28%, and 68%, respectively, in 2024 compared to 2023. Foreign currency exchange rate changes during the years ended December 31, 2024 and 2023 negatively impacted revenue by $73.8 million and $48.5 million, respectively, or 2% and 1% of total revenue for each respective year. See “Non-GAAP Financial Measures” in “Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations” for the definition of Revenue excluding foreign exchange effects and a reconciliation of Revenue to Revenue excluding foreign exchange effects.\nForeign currency exchange losses included in the Company’s earnings for the years ended December 31, 2024, 2023 and 2022 are $0.6 million, $7.9 million and $2.0 million, respectively.\nForeign currency exchange gains or losses historically have not been material to the Company. As a result, we have not historically hedged any foreign currency exposures, although we may hedge foreign currencies in the future to limit the impact of foreign currency exchange gains and losses. The continued growth and expansion of our international operations into new countries increases our exposure to foreign exchange rate fluctuations. Significant foreign exchange rate fluctuations, in the case of one currency or collectively with other currencies, could adversely affect our future results of operations.\n57\nTable of Contents\nItem 8.    Consolidated Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Match Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Match Group, Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive operations, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control–Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nCompany’s disclosure of an additional measure of segment profit or loss\nIn Note 12 to the consolidated financial statements, the Company has elected to disclose Adjusted Operating Income as an additional segment profit or loss measure as permitted pursuant to ASC 280 and that the U.S. Securities and Exchange Commission (SEC) defines as a non-GAAP measure. Accordingly, we express no opinion on whether the additional segment profit or loss measure complies with SEC Regulation S-K, Item 10(e) and Regulation G, Item 101.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n58\nTable of Contents\nRevenue Recorded in a Highly Automated Environment\nDescription of the Matter\nAs more fully described in Note 2 to the consolidated financial statements, the Company’s revenue is primarily derived directly from users for recurring subscriptions to branded services. Revenue is also earned from the purchase of à la carte features by users, which is recognized based on usage. Direct Revenue, which includes revenue from subscriptions and à la carte features, was $3.4 billion for the year ended December 31, 2024. The Company’s Direct Revenue is based on contractual terms with the Company’s customers and is comprised of a significant volume of low-dollar transactions. The Company’s process to record Direct Revenue, including the determination and calculation of the revenue to be recognized each period, is highly automated within the Company’s information technology (“IT”) systems that are principally proprietary. \nGiven the complexity of the IT systems involved, auditing Direct Revenue for certain brands required a significant extent of effort and increased involvement of professionals with expertise in IT to identify, test, and evaluate the Company’s relevant systems and automated controls to record Direct Revenue.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of the Company’s controls related to the recording and accounting for Direct Revenue for certain brands. With the involvement of IT professionals, we identified the relevant systems used by the Company to calculate and record Direct Revenue and the related deferred revenue. Where applicable, we tested the IT general controls over those systems, including testing of user access controls, change management controls, and IT operations controls as well as certain automated application controls related to the recording of Direct Revenue and the related deferred revenue at period end. We also tested the Company’s controls to address the completeness and accuracy of transaction data.\nOur audit procedures related to the Company’s Direct Revenue also included, among other procedures, recalculating the amount of revenue recognized during the period for a sample of transactions based on the terms of the arrangement and the satisfaction of the underlying performance obligation, testing the accuracy of key transaction data for a sample of transactions to contractual terms, reconciling gross transactions to cash collected, testing the calculation of Direct Revenue and the related deferred revenue performed within the Company’s IT systems to the amount recorded in the general ledger, and performing procedures related to revenue cut-off.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1996.\nNew York, New York\nFebruary 27, 2025\n59\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEET\n \nDecember 31,\n \n2024\n2023\n(In thousands, except share data)\nASSETS\n \n \nCash and cash equivalents\n$\n965,993\n \n$\n862,440\n \nShort-term investments\n4,734\n \n6,200\n \nAccounts receivable, net of allowance of $\n379\n and $\n603\n, respectively\n324,963\n \n298,648\n \nOther current assets\n102,072\n \n104,023\n \nTotal current assets\n1,397,762\n \n1,271,311\n \nProperty and equipment, net\n158,189\n \n194,525\n \nGoodwill\n2,310,730\n \n2,342,612\n \nIntangible assets, net\n215,448\n \n305,746\n \nDeferred income taxes\n262,557\n \n259,803\n \nOther non-current assets\n121,085\n \n133,889\n \nTOTAL ASSETS\n$\n4,465,771\n \n$\n4,507,886\n \nLIABILITIES AND SHAREHOLDERS’ EQUITY\n \n \nLIABILITIES\n \n \nAccounts payable\n$\n18,262\n \n$\n13,187\n \nDeferred revenue\n166,142\n \n211,282\n \nAccrued expenses and other current liabilities\n365,057\n \n307,299\n \nTotal current liabilities\n549,461\n \n531,768\n \nLong-term debt, net\n3,848,983\n \n3,842,242\n \nIncome taxes payable\n33,332\n \n24,860\n \nDeferred income taxes\n11,770\n \n26,302\n \nOther long-term liabilities\n85,882\n \n101,787\n \nCommitments and contingencies \nSHAREHOLDERS’ EQUITY\n \n \nCommon stock; $\n0.001\n par value; authorized \n1,600,000,000\n shares; \n294,432,137\n and \n289,631,352\n shares issued; and \n251,460,397\n and \n268,890,470\n outstanding at December 31, 2024 and December 31, 2023, respectively\n294\n \n290\n \nAdditional paid-in capital\n8,756,482\n \n8,529,200\n \nRetained deficit\n(\n6,579,753\n)\n(\n7,131,029\n)\nAccumulated other comprehensive loss\n(\n449,611\n)\n(\n385,471\n)\nTreasury stock; \n42,971,740\n and \n20,740,882\n shares, respectively\n(\n1,791,071\n)\n(\n1,032,538\n)\nTotal Match Group, Inc. shareholders’ equity\n(\n63,659\n)\n(\n19,548\n)\nNoncontrolling interests\n2\n \n475\n \nTotal shareholders’ equity\n(\n63,657\n)\n(\n19,073\n)\nTOTAL LIABILITIES AND SHAREHOLDERS’ EQUITY \n$\n4,465,771\n \n$\n4,507,886\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\n60\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF OPERATIONS\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands, except per share data)\nRevenue\n$\n3,479,373\n \n$\n3,364,504\n \n$\n3,188,843\n \nOperating costs and expenses:\n \n \n \nCost of revenue (exclusive of depreciation shown separately below)\n991,273\n \n954,014\n \n959,963\n \nSelling and marketing expense\n622,100\n \n586,262\n \n534,517\n \nGeneral and administrative expense\n438,839\n \n413,609\n \n435,868\n \nProduct development expense\n442,175\n \n384,185\n \n333,639\n \nDepreciation\n87,499\n \n61,807\n \n43,594\n \nImpairments and amortization of intangibles\n74,175\n \n47,731\n \n366,257\n \nTotal operating costs and expenses\n2,656,061\n \n2,447,608\n \n2,673,838\n \nOperating income\n823,312\n \n916,896\n \n515,005\n \nInterest expense\n(\n160,071\n)\n(\n159,887\n)\n(\n145,547\n)\nOther income, net\n40,815\n \n19,772\n \n8,033\n \nEarnings from continuing operations, before tax\n704,056\n \n776,781\n \n377,491\n \nIncome tax provision\n(\n152,743\n)\n(\n125,309\n)\n(\n15,361\n)\nNet earnings from continuing operations\n551,313\n \n651,472\n \n362,130\n \nLoss from discontinued operations, net of tax\n—\n \n—\n \n(\n2,211\n)\nNet earnings\n551,313\n \n651,472\n \n359,919\n \nNet (earnings) loss attributable to noncontrolling interests\n(\n37\n)\n67\n \n2,027\n \nNet earnings attributable to Match Group, Inc. shareholders\n$\n551,276\n \n$\n651,539\n \n$\n361,946\n \nNet earnings per share from continuing operations:\n     Basic\n$\n2.12\n \n$\n2.36\n \n$\n1.29\n \n     Diluted\n$\n2.02\n \n$\n2.26\n \n$\n1.25\n \nNet earnings per share attributable to Match Group, Inc. shareholders:\n     Basic\n$\n2.12\n \n$\n2.36\n \n$\n1.28\n \n     Diluted\n$\n2.02\n \n$\n2.26\n \n$\n1.24\n \nStock-based compensation expense by function:\nCost of revenue\n$\n7,015\n \n$\n5,934\n \n$\n5,903\n \nSelling and marketing expense\n12,620\n \n9,730\n \n7,608\n \nGeneral and administrative expense\n103,554\n \n98,510\n \n106,133\n \nProduct development expense\n144,192\n \n117,925\n \n84,236\n \nTotal stock-based compensation expense\n$\n267,381\n \n$\n232,099\n \n$\n203,880\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\n61\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF COMPREHENSIVE OPERATIONS\nYears Ended December 31,\n2024\n2023\n2022\n(In thousands)\nNet earnings\n$\n551,313\n \n$\n651,472\n \n$\n359,919\n \nOther comprehensive loss, net of tax\nChange in foreign currency translation adjustment\n(\n64,172\n)\n(\n16,279\n)\n(\n146,361\n)\nTotal other comprehensive loss\n(\n64,172\n)\n(\n16,279\n)\n(\n146,361\n)\nComprehensive income\n487,141\n \n635,193\n \n213,558\n \nComprehensive (income) loss attributable to noncontrolling interests:\nNet (earnings) loss attributable to noncontrolling interests\n(\n37\n)\n67\n \n2,027\n \nChange in foreign currency translation adjustment attributable to noncontrolling interests\n32\n \n(\n10\n)\n933\n \nComprehensive (income) loss attributable to noncontrolling interests\n(\n5\n)\n57\n \n2,960\n \nComprehensive income attributable to Match Group, Inc. shareholders\n$\n487,136\n \n$\n635,250\n \n$\n216,518\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\n62\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF SHAREHOLDERS’ EQUITY\nYears Ended December 31, 2024, 2023, and 2022\nMatch Group, Inc. Shareholders’ Equity\n \nCommon Stock $\n0.001\n Par Value\n \n \nRedeemable\nNoncontrolling\nInterests\n$\nShares\nAdditional Paid-in Capital\nRetained (Deficit) Earnings\nAccumulated\nOther\nComprehensive\nLoss\nTreasury Stock\nTotal \nMatch Group, Inc. \nShareholders’\nEquity  \nNoncontrolling\nInterests\nTotal\nShareholders’\nEquity  \n \n(In thousands)\nBalance as of December 31, 2021\n$\n1,260\n \n$\n283\n \n283,470\n \n$\n8,164,216\n \n$\n(\n8,144,514\n)\n$\n(\n223,754\n)\n$\n— \n$\n(\n203,769\n)\n$\n7,927\n \n$\n(\n195,842\n)\nNet (loss) earnings for the year ended December 31, 2022\n(\n2,661\n)\n— \n— \n— \n361,946\n \n— \n— \n361,946\n \n634\n \n362,580\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n— \n(\n145,428\n)\n— \n(\n145,428\n)\n(\n933\n)\n(\n146,361\n)\nStock-based compensation expense\n— \n— \n— \n214,437\n \n— \n— \n— \n214,437\n \n— \n214,437\n \nIssuance of Match Group common stock pursuant to stock-based awards, net of withholding taxes\n— \n4\n \n3,347\n \n(\n88,774\n)\n— \n— \n— \n(\n88,770\n)\n— \n(\n88,770\n)\nPurchase of treasury stock\n— \n— \n— \n— \n(\n482,049\n)\n(\n482,049\n)\n— \n(\n482,049\n)\nAdjustment of redeemable noncontrolling interests to fair value\n1,401\n \n— \n— \n(\n1,401\n)\n— \n— \n— \n(\n1,401\n)\n— \n(\n1,401\n)\nAdjustment to noncontrolling interests to fair value\n— \n— \n— \n(\n16,215\n)\n— \n— \n— \n(\n16,215\n)\n16,215\n \n—\n \nPurchase of noncontrolling interest\n— \n— \n— \n6,791\n \n— \n— \n— \n6,791\n \n(\n23,693\n)\n(\n16,902\n)\nNoncontrolling interests created by the exercise of subsidiary denominated equity award\n— \n— \n— \n(\n844\n)\n— \n— \n— \n(\n844\n)\n844\n \n—\n \nSettlement and exercises of note hedges and warrants\n— \n— \n— \n(\n7,116\n)\n— \n— \n— \n(\n7,116\n)\n— \n(\n7,116\n)\nOther\n— \n— \n— \n2,543\n \n— \n— \n— \n2,543\n \n—\n \n2,543\n \nBalance as of December 31, 2022\n$\n—\n \n$\n287\n \n286,817\n \n$\n8,273,637\n \n$\n(\n7,782,568\n)\n$\n(\n369,182\n)\n$\n(\n482,049\n)\n$\n(\n359,875\n)\n$\n994\n \n$\n(\n358,881\n)\n63\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF SHAREHOLDERS’ EQUITY\nYears Ended December 31, 2024, 2023, and 2022 (continued)\nMatch Group, Inc. Shareholders’ Equity\n \nCommon Stock $\n0.001\n Par Value\n \n \nRedeemable\nNoncontrolling\nInterests\n$\nShares\nAdditional Paid-in Capital\nRetained (Deficit) Earnings \nAccumulated\nOther\nComprehensive\nLoss\nTreasury Stock\nTotal \nMatch Group, Inc. \nShareholders’\nEquity  \nNoncontrolling\nInterests\nTotal\nShareholders’\nEquity  \n \n(In thousands)\nBalance as of December 31, 2022\n$\n—\n \n$\n287\n \n286,817\n \n$\n8,273,637\n \n$\n(\n7,782,568\n)\n$\n(\n369,182\n)\n$\n(\n482,049\n)\n$\n(\n359,875\n)\n$\n994\n \n$\n(\n358,881\n)\nNet (loss) earnings for the year ended December 31, 2023\n(\n184\n)\n— \n— \n— \n651,539\n \n— \n— \n651,539\n \n117\n \n651,656\n \nOther comprehensive (loss) income, net of tax\n— \n— \n— \n— \n— \n(\n16,289\n)\n— \n(\n16,289\n)\n10\n \n(\n16,279\n)\nStock-based compensation expense\n— \n— \n— \n243,826\n \n— \n— \n— \n243,826\n \n— \n243,826\n \nIssuance of Match Group common stock pursuant to stock-based awards, net of withholding taxes\n— \n3\n \n2,814\n \n13,980\n \n— \n— \n— \n13,983\n \n— \n13,983\n \nPurchase of treasury stock\n— \n— \n— \n— \n— \n— \n(\n550,489\n)\n(\n550,489\n)\n— \n(\n550,489\n)\nPurchase of redeemable noncontrolling interests\n(\n295\n)\n— \n— \n— \n— \n— \n— \n— \n— \n— \nAdjustment of redeemable noncontrolling interests to fair value\n479\n \n— \n— \n(\n479\n)\n— \n— \n— \n(\n479\n)\n— \n(\n479\n)\nAdjustment of noncontrolling interests to fair value\n— \n— \n— \n(\n2,100\n)\n— \n— \n— \n(\n2,100\n)\n2,100\n \n—\n \nPurchase of noncontrolling interest\n— \n— \n— \n753\n \n— \n— \n— \n753\n \n(\n3,157\n)\n(\n2,404\n)\nNoncontrolling interest created by the exercise of subsidiary denominated equity award\n— \n— \n— \n(\n411\n)\n— \n— \n— \n(\n411\n)\n411\n \n—\n \nOther\n— \n— \n— \n(\n6\n)\n— \n— \n— \n(\n6\n)\n— \n(\n6\n)\nBalance as of December 31, 2023\n$\n—\n \n$\n290\n \n289,631\n \n$\n8,529,200\n \n$\n(\n7,131,029\n)\n$\n(\n385,471\n)\n$\n(\n1,032,538\n)\n$\n(\n19,548\n)\n$\n475\n \n$\n(\n19,073\n)\nNet earnings for the year ended December 31, 2024\n—\n \n— \n— \n— \n551,276\n \n— \n— \n551,276\n \n37\n \n551,313\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n— \n(\n64,140\n)\n— \n(\n64,140\n)\n(\n32\n)\n(\n64,172\n)\nStock-based compensation expense\n— \n— \n— \n273,942\n \n— \n— \n— \n273,942\n \n— \n273,942\n \nIssuance of Match Group common stock pursuant to stock-based awards, net of withholding taxes\n— \n4\n \n4,801\n \n2,138\n \n— \n— \n— \n2,142\n \n— \n2,142\n \nDividends and dividend equivalents declared ($\n0.19\n per share of Common Stock and Restricted Stock Units)\n— \n— \n— \n(\n48,892\n)\n— \n— \n— \n(\n48,892\n)\n— \n(\n48,892\n)\nDividend equivalents payable\n— \n— \n— \n1,116\n \n— \n— \n— \n1,116\n \n— \n1,116\n \nPurchase of treasury stock\n— \n— \n— \n— \n— \n— \n(\n758,533\n)\n(\n758,533\n)\n— \n(\n758,533\n)\nAdjustment of noncontrolling interests to fair value\n— \n— \n— \n(\n1,418\n)\n— \n— \n— \n(\n1,418\n)\n1,418\n \n—\n \nPurchase of noncontrolling interest\n— \n— \n— \n397\n \n— \n— \n— \n397\n \n(\n2,019\n)\n(\n1,622\n)\nNoncontrolling interest created by the exercise of subsidiary denominated equity award\n— \n— \n— \n— \n— \n— \n— \n— \n150\n \n150\n \nOther\n— \n— \n— \n(\n1\n)\n— \n— \n— \n(\n1\n)\n(\n27\n)\n(\n28\n)\nBalance as of December 31, 2024\n$\n—\n \n$\n294\n \n294,432\n \n$\n8,756,482\n \n$\n(\n6,579,753\n)\n$\n(\n449,611\n)\n$\n(\n1,791,071\n)\n$\n(\n63,659\n)\n$\n2\n \n$\n(\n63,657\n)\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\n64\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF CASH FLOWS\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nCash flows from operating activities attributable to continuing operations:\nNet earnings\n$\n551,313\n \n$\n651,472\n \n$\n359,919\n \nAdd back: loss from discontinued operations, net of tax\n—\n \n—\n \n2,211\n \nNet earnings from continuing operations\n551,313\n \n651,472\n \n362,130\n \nAdjustments to reconcile net earnings from continuing operations to net cash provided by operating activities attributable to continuing operations:\n \n \nStock-based compensation expense\n267,381\n \n232,099\n \n203,880\n \nDepreciation\n87,499\n \n61,807\n \n43,594\n \nImpairments and amortization of intangibles\n74,175\n \n47,731\n \n366,257\n \nDeferred income taxes\n(\n14,952\n)\n26,612\n \n(\n29,953\n)\nOther adjustments, net\n2,019\n \n9,932\n \n6,998\n \nChanges in assets and liabilities\n \n \nAccounts receivable\n(\n29,788\n)\n(\n107,412\n)\n(\n6,669\n)\nOther assets\n25,337\n \n25,055\n \n59,584\n \nAccounts payable and other liabilities\n(\n9,395\n)\n(\n5,961\n)\n(\n472,610\n)\nIncome taxes payable and receivable\n22,213\n \n(\n3,337\n)\n(\n1,054\n)\nDeferred revenue\n(\n43,083\n)\n(\n41,207\n)\n(\n6,469\n)\nNet cash provided by operating activities attributable to continuing operations\n932,719\n \n896,791\n \n525,688\n \nCash flows from investing activities attributable to continuing operations:\n \n \nCapital expenditures\n(\n50,578\n)\n(\n67,412\n)\n(\n49,125\n)\nOther, net\n(\n7,960\n)\n(\n9,169\n)\n(\n22,577\n)\nNet cash used in investing activities attributable to continuing operations\n(\n58,538\n)\n(\n76,581\n)\n(\n71,702\n)\nCash flows from financing activities attributable to continuing operations:\n \n \nPayments to settle exchangeable notes\n—\n \n—\n \n(\n176,310\n)\nProceeds from the settlement of exchangeable note hedges\n—\n \n—\n \n75,864\n \nPayments to settle warrants related to exchangeable notes\n—\n \n—\n \n(\n7,482\n)\nProceeds from issuance of common stock pursuant to stock-based awards\n13,584\n \n19,916\n \n20,485\n \nWithholding taxes paid on behalf of employees on net settled stock-based awards\n(\n11,441\n)\n(\n5,933\n)\n(\n109,256\n)\nPurchase of treasury stock\n(\n752,674\n)\n(\n546,198\n)\n(\n482,049\n)\nPurchase of noncontrolling interests\n(\n1,291\n)\n(\n1,872\n)\n(\n10,554\n)\nOther, net\n(\n6,482\n)\n19\n \n129\n \nNet cash used in financing activities attributable to continuing operations\n(\n758,304\n)\n(\n534,068\n)\n(\n689,173\n)\nTotal cash provided by (used in) continuing operations\n115,877\n \n286,142\n \n(\n235,187\n)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(\n12,324\n)\n3,782\n \n(\n7,809\n)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n103,553\n \n289,924\n \n(\n242,996\n)\nCash, cash equivalents, and restricted cash at beginning of period\n862,440\n \n572,516\n \n815,512\n \nCash, cash equivalents, and restricted cash at end of period\n$\n965,993\n \n$\n862,440\n \n$\n572,516\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\n65\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1—ORGANIZATION \nMatch Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n®\n, Hinge\n®\n, Match\n®\n, Meetic\n®\n, OkCupid\n®\n, Pairs™, Plenty Of Fish\n®\n, Azar\n®\n, BLK®, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over \n40\n languages to our users all over the world. Match Group has \nfour\n operating segments, Tinder, Hinge, Evergreen and Emerging, and Match Group Asia (“MG Asia”).\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nNOTE 2—SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation and Consolidation \nThe Company prepares its consolidated financial statements in accordance with U.S. generally accepted accounting principles (“GAAP”). The consolidated financial statements include the accounts of the Company, all entities that are wholly-owned by the Company, and all entities in which the Company has a controlling financial interest. Intercompany transactions and accounts have been eliminated.\nAccounting for Investments in Equity Securities\nInvestments in equity securities, other than those of our consolidated subsidiaries, are accounted for at fair value or under the measurement alternative of the Financial Accounting Standards Board’s (“FASB”) equity securities guidance, with any changes to fair value recognized within other income, net each reporting period. Under the measurement alternative, equity investments without readily determinable fair values are carried at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for identical or similar securities of the same issuer, the value of which is generally determined based on a market approach as of the transaction date. A security will be considered identical or similar if it has identical or similar rights to the equity securities held by the Company. The Company reviews its investments in equity securities without readily determinable fair values for impairment each reporting period when there are qualitative factors or events that indicate possible impairment. Factors we consider in making this determination include negative changes in industry and market conditions, financial performance, business prospects, and other relevant events and factors. When indicators of impairment exist, the Company prepares quantitative assessments of the fair value of our investments in equity securities, which require judgment and the use of estimates. When our assessment indicates that the fair value of the investment is below its carrying value, the Company writes down the investment to its fair value and records the corresponding charge within other income, net.\nAccounting Estimates\nManagement of the Company is required to make certain estimates, judgments, and assumptions during the preparation of its consolidated financial statements in accordance with GAAP. These estimates, judgments, and assumptions impact the reported amounts of assets, liabilities, revenue, and expenses and the related disclosure of contingent assets and liabilities. Actual results could differ from these estimates.\nOn an ongoing basis, the Company evaluates its estimates and judgments including those related to: the fair values of cash equivalents; the carrying value of accounts receivable, including the determination of the allowance for credit losses; the determination of revenue reserves; the carrying value of right-of-use assets (“ROU assets”); the useful lives and recoverability of definite-lived intangible assets and property and equipment; the recoverability of goodwill and indefinite-lived intangible assets; the fair value of equity securities without readily determinable fair values; contingencies; unrecognized tax benefits; the valuation allowance for deferred income tax assets; and the fair value of and forfeiture rates for stock-based awards, among others. The Company bases its estimates and judgments on historical experience, its forecasts and budgets, and other factors that the Company considers relevant.\n66\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nRevenue Recognition\nThe Company accounts for a contract with a customer when it has approval and commitment from all parties, the rights of the parties and payment terms are identified, the contract has commercial substance, and collectability of consideration is probable. Revenue is recognized when control of the promised services is transferred to our customers and in an amount that reflects the consideration the Company expects to be entitled to in exchange for those services.\nThe Company’s revenue is primarily derived directly from users in the form of recurring subscriptions. Subscription revenue is presented net of credits and credit card chargebacks. Subscribers pay in advance, primarily by credit card or through mobile app stores, and, subject to certain conditions identified in our terms and conditions, generally all purchases are final and nonrefundable. Revenue is initially deferred and is recognized using the straight-line method over the term of the applicable subscription period, which generally ranges from one week to \nsix months\n. Revenue is also earned from online advertising and the purchase of à la carte features. Online advertising revenue is recognized when an advertisement is displayed. Revenue from the purchase of à la carte features is recognized based on usage. Revenue associated with offline events is recognized when each event occurs.\nThe Company does not disclose the value of unsatisfied performance obligations for (i) contracts with an original expected length of one year or less, (ii) contracts with variable consideration that is allocated entirely to unsatisfied performance obligations or to a wholly unsatisfied promise accounted for under the series guidance, and (iii) contracts for which the Company recognizes revenue at the amount which we have the right to invoice for services performed.\nTransaction Price\nThe objective of determining the transaction price is to estimate the amount of consideration the Company is due in exchange for its services, including amounts that are variable. The Company determines the total transaction price, including an estimate of any variable consideration, at contract inception and reassesses this estimate each reporting period.\nThe Company excludes from the \nmeasurement\n of transaction price all taxes \nassessed by governmental authorities that are both (i) imposed on and concurrent with a specific revenue-producing transaction and (ii) collected from customers. Accordingly, such tax amounts are not included \nas a component of revenue or cost of revenue.\nFor contracts that have an original duration of one year or less, the Company does not consider the time value of money.\nAssets Recognized from the Costs to Obtain a Contract with a Customer\nThe Company has determined that certain costs, primarily mobile app store fees, meet the requirements to be capitalized as a cost of obtaining a contract. The Company recognizes an asset for these costs if we expect to recover those costs. Mobile app store fees are amortized over the period of contract performance. Specifically, the Company capitalizes and amortizes mobile app store fees as revenue is recognized for both subscription and à la carte features.\nDuring the years ended December 31, 2024 and 2023, the Company recognized expense of $\n696.6\n million and $\n646.7\n million, respectively, related to the amortization of these costs. The contract asset balances at December 31, 2024, 2023, and 2022 related to costs to obtain a contract are $\n28.6\n million, $\n33.1\n million, and $\n38.2\n million, respectively, included in “Other current assets” in the accompanying consolidated balance sheet.\nAccounts Receivables, Net of Allowance for Credit Losses and Revenue Reserves\nThe majority of our users purchase our services through mobile app stores. At December 31, 2024, \ntwo\n mobile app stores accounted for approximately \n78\n% and \n16\n%, respectively, of our gross accounts receivables. The comparable amounts at December 31, 2023 were \n79\n% and \n8\n%, respectively. We evaluate the credit worthiness of these \ntwo\n mobile app stores on an ongoing basis and do not require collateral from these entities. We generally collect these balances between \n30\n and \n45\n days following the purchase. Payments made directly \n67\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nthrough our applications are processed by third-party payment processors. We generally collect these balances within \n3\n to \n5\n days following the purchase. The Company also maintains allowances to reserve for potential credits issued to users or other revenue adjustments. The amounts of these reserves are based primarily upon historical experience.\nAccounts receivable related to indirect revenue include amounts billed and currently due from customers. The Company maintains an allowance for credit losses to provide for the estimated amount of accounts receivable that will not be collected. The allowance for credit losses is based upon historical collection trends adjusted for economic conditions using reasonable and supportable forecasts. The time between the Company issuance of an invoice and payment due date is not significant; customer payments that are not collected in advance of the transfer of promised services are generally due no later than \n30\n days from invoice date.\nDeferred Revenue\nDeferred revenue consists of advance payments that are received or are contractually due in advance of the Company’s performance. The Company’s deferred revenue is reported on a contract by contract basis at the end of each reporting period. The Company classifies deferred revenue as current when the term of the applicable subscription period or expected completion of our performance obligation is one year or less. The deferred revenue balances are $\n166.1\n million, $\n211.3\n million, and $\n252.7\n million at December 31, 2024, 2023, and 2022, respectively. During the years ended December 31, 2024 and 2023, the Company recognized $\n211.3\n million and $\n252.7\n million of revenue that was included in the deferred revenue balance as of December 31, 2023 and 2022, respectively. At December 31, 2024 and 2023, there is \nno\n non-current portion of deferred revenue.\nDisaggregation of Revenue\nThe following table presents disaggregated revenue:\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nRevenue:\nDirect Revenue\n$\n3,417,978\n \n$\n3,308,131\n \n$\n3,130,221\n \nIndirect Revenue (principally advertising revenue)\n61,395\n \n56,373\n \n58,622\n \nTotal Revenue\n$\n3,479,373\n \n$\n3,364,504\n \n$\n3,188,843\n \nDirect Revenue\nTinder\n$\n1,940,619\n \n$\n1,917,629\n \n$\n1,794,467\n \nHinge\n550,435\n \n396,485\n \n283,668\n \nEvergreen & Emerging\n(a)\n642,988\n \n691,426\n \n730,372\n \nMatch Group Asia\n(b)\n283,936\n \n302,591\n \n321,714\n \nTotal Direct Revenue\n$\n3,417,978\n \n$\n3,308,131\n \n$\n3,130,221\n \n______________________\n(a)\nPrimarily consists of the brands Match®, Meetic®, OkCupid®, Plenty Of Fish®, and a number of demographically focused brands.\n(b)\nPrimarily consists of the brands Pairs™ and Azar®.\nCash and Cash Equivalents\nCash and cash equivalents include cash and short-term investments, with maturities of less than \n91\n days from the date of purchase. Domestically, cash equivalents primarily consist of (i) AAA rated government money market funds and (ii) time deposits. Internationally, cash equivalents primarily consist of (i) time deposits and (ii) money market funds.\n68\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nProperty and Equipment\nProperty and equipment, including significant improvements, are recorded at cost. Repairs and maintenance costs are expensed as incurred. Depreciation is computed using the straight-line method over the estimated useful lives of the assets or, in the case of leasehold improvements, the lease term, if shorter.\nAsset Category\nEstimated\nUseful Lives\nBuildings and building improvements\n10\n to \n39\n years\nComputer equipment and capitalized software\n2\n to \n3\n years\nFurniture and other equipment\n5\n years\nLeasehold improvements\n6\n to \n10\n years\nThe Company capitalizes certain internal use software costs including external direct costs utilized in developing or obtaining the software and compensation for personnel directly associated with the development of the software. Capitalization of such costs begins when the preliminary project stage is complete and ceases when the project is substantially complete and ready for its intended purpose.\n The net book value of capitalized internal use software is $\n60.2\n million and $\n85.5\n million at December 31, 2024 and 2023, respectively.\nBusiness Combinations\nThe purchase price of each acquisition is attributed to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets that either arise from a contractual or legal right or are separable from goodwill. The Company typically engages outside valuation experts to assist in the allocation of purchase price to the identifiable intangible assets acquired, but management has ultimate responsibility for the valuation methods, models, and inputs used and the resulting purchase price allocation. The excess purchase price over the net tangible and identifiable intangible assets is recorded as goodwill and assigned to the reporting unit that is expected to benefit from the combination as of the acquisition date.\nGoodwill and Indefinite-Lived Intangible Assets\nThe Company assesses goodwill on its \nfour\n reporting units and indefinite-lived intangible assets for impairment annually as of October 1, or more frequently if an event occurs or circumstances indicate that it is more likely than not the fair value of a reporting unit or the fair value of an indefinite-lived intangible asset is below its carrying value.\nGoodwill\nWhen the Company elects to perform a qualitative assessment and concludes it is not more likely than not that the fair value of the reporting unit is less than its carrying value, no further assessment of that reporting unit’s goodwill is necessary; otherwise, a quantitative assessment is performed to further assess if any goodwill impairment exists.\nIf the Company concludes that it is more likely than not that there may be an impairment, the fair value of each reporting unit will be determined and compared to its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, goodwill of the reporting unit is not impaired. If the carrying value of a reporting unit exceeds its estimated fair value, an impairment loss equal to the excess is recorded.\nAs a result of the change to our operating segments in the third quarter of 2024, we reassessed our reporting units and determined that the \nfour\n operating segments are also our reporting units for the purpose of evaluating goodwill for impairment. The Company re-allocated goodwill to each of the \nfour\n reporting units based on their relative fair values as of September 30, 2024. This change in reporting units is considered a triggering event that requires a goodwill impairment assessment to be performed immediately before and after the change. There was no goodwill impairment identified in either the before or after impairment tests. In measuring the estimated fair value of each operating unit, the Company used a combination of an income approach and a market approach. Under the income approach, a discounted cash flow analysis is performed with assumptions and estimates of forecast operating cash flows including, revenue growth rates, profitability \n69\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nmargins, and discount rates, which all vary among reporting units. The market approach utilizes the guideline public companies method and is based on revenue and earnings multiple data derived from publicly traded peer group companies. There are significant judgements inherent in each analysis, including estimating the amount and timing of expected future cash flows, the selection of appropriate discount rates, and the peer group companies used.\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its reporting units are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of each reporting unit exceeded their carrying values. Additionally, the 2023 annual assessment did not identify any goodwill impairments.\nIndefinite-Lived Intangible Assets\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its indefinite-lived intangible assets are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of our indefinite-lived intangible assets exceeded the carrying values.\nFor assets in which a quantitative assessment is performed, the Company determines the fair value of its indefinite-lived intangible assets using an avoided royalty discounted cash flow (“DCF”) valuation analysis. Significant judgments inherent in this analysis include the selection of appropriate royalty and discount rates and estimating the amount and timing of expected future cash flows. The discount rates used in the DCF analyses are intended to reflect the risks inherent in the expected future cash flows generated by the respective intangible assets. The royalty rates used in the DCF analyses are based upon an estimate of the royalty rates that a market participant would pay to license the specific trade names and trademarks. The future cash flows are based on the Company’s most recent forecast and budget and, for years beyond the budget, the Company’s estimates are based, in part, on forecasted growth rates. Assumptions used in the avoided royalty DCF analyses, including the discount rate and royalty rate, are assessed when a quantitative assessment is performed based on the actual and projected cash flows related to the asset, as well as macroeconomic and industry specific factors.\n The discount rates used in the Company’s 2023 quantitative assessments as part of the annual indefinite-lived impairment assessment ranged from \n15\n% to \n18\n%, and the royalty rates used ranged from \n3\n% to \n8\n%.\nIf the carrying value of an indefinite-lived intangible asset exceeds its estimated fair value, an impairment equal to the excess is recorded.\nDuring the third quarter ended September 30, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $\n28.7\n million related to indefinite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. For certain assets with no remaining cash flows, the Company fully impaired the asset. For assets with remaining cash flows, the Company conducted discounted cash flow valuations. During the year ended December 31, 2022, the Company recognized impairment charges of $\n244.3\n million in the Match Group Asia segment related to the Azar and Hakuna brands at Hyperconnect, $\n43.9\n million in the Evergreen & Emerging segment related to the Meetic and Match brands in Europe, and $\n5.5\n million in the Evergreen & Emerging segment related to certain Affinity brands in the U.S., all of which are included within “\nImpairment and amortization of intangibles\n” in the consolidated statement of operations.\nAt December 31, 2023, the aggregate indefinite-lived intangible asset balance for which the estimate of fair value was less than \n110\n% of carrying values was approximately $\n76.5\n million. These assets identified at December 31, 2023 had additional impairments taken during the year ended December 31, 2024 and the assets were either fully impaired as no additional cash flows were identified or impaired and moved to definite-lived intangible assets during the year ended December 31, 2024. At December 31, 2024, based on our qualitative analysis performed, none of the Company’s remaining indefinite-lived intangible assets fair values were identified as being near their carrying value.\nIn connection with the annual impairment assessment, the Company reviews the useful lives for intangible assets and whether events or changes in circumstances indicate that an indefinite life may no longer be appropriate. During the year ended December 31, 2024, the Company reclassified certain indefinite-lived \n70\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nintangible assets with a carrying value of $\n47.2\n million to the definite-lived intangible asset category because these assets were no longer considered to have an indefinite life.\nLong-Lived Assets and Intangible Assets with Definite Lives\nLong-lived assets, which consist of ROU assets, property and equipment, and intangible assets with definite lives, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. The carrying value of a long-lived asset or asset group is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If the carrying value is deemed not to be recoverable, an impairment loss is recorded equal to the amount by which the carrying value of the long-lived asset exceeds its fair value. Amortization of definite-lived intangible assets is computed either on a straight-line basis or based on the pattern in which the economic benefits of the asset will be realized. During the year ended December 31, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $\n1.9\n million related to definite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. During the year ended December 31, 2022, the Company recognized an impairment charge related to Hyperconnect intangible assets with definite lives of $\n25.8\n million in the Match Group Asia segment, which is included within “\nimpairment and amortization of intangibles\n” in the consolidated statement of operations.\nFair Value Measurements\nThe Company categorizes its financial instruments measured at fair value into a fair value hierarchy that prioritizes the inputs used in pricing the asset or liability. The three levels of the fair value hierarchy are:\n•\nLevel 1: Observable inputs obtained from independent sources, such as quoted market prices for identical assets and liabilities in active markets.\n•\nLevel 2: Other inputs, which are observable directly or indirectly, such as quoted market prices for similar assets or liabilities in active markets, quoted market prices for identical or similar assets or liabilities in markets that are not active, and inputs that are derived principally from or corroborated by observable market data. The fair values of the Company’s Level 2 financial assets are primarily obtained from observable market prices for identical underlying securities that may not be actively traded. Certain of these securities may have different market prices from multiple market data sources, in which case an average market price is used.\n•\nLevel 3: Unobservable inputs for which there is little or no market data and require the Company to develop its own assumptions, based on the best information available in the circumstances, about the assumptions market participants would use in pricing the assets or liabilities.\nThe Company’s non-financial assets, such as goodwill, intangible assets, ROU assets, and property and equipment, are adjusted to fair value only when an impairment is recognized. The Company’s financial assets, comprising of equity securities without readily determinable fair values, are adjusted to fair value when observable price changes are identified or an impairment is recognized. Such fair value measurements are based predominantly on Level 3 inputs.\nAdvertising Costs \nAdvertising costs are expensed in the period incurred (when the advertisement first runs for production costs that are initially capitalized) and represent online marketing, including fees paid to search engines and social media sites, and offline marketing.\n Advertising expense is $\n546.8\n million, $\n519.6\n million and $\n474.9\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nLegal Costs\nLegal costs are expensed as incurred.\n71\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIncome Taxes\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws.\nThe Company accounts for income taxes under the liability method, and deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial reporting amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be realized or settled. A valuation allowance is provided if it is determined that it is more likely than not that the deferred tax asset will not be realized.\nWe recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained based on the technical merits of the position. Such tax benefits are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement. The Company records interest and penalties related to uncertain tax positions as a component of income tax expense.\nEarnings Per Share\nBasic earnings per share is computed by dividing net earnings attributable to Match Group shareholders by the weighted average number of common shares outstanding during the period. Diluted earnings per share reflects the potential dilution that could occur from stock options and other commitments to issue common stock using the treasury stock or the as if converted methods, as applicable.\n See “Note 10—Earnings per Share” for additional information on dilutive securities.\nForeign Currency Translation and Transaction Gains and Losses\nThe financial position and operating results of foreign entities whose primary economic environment is based on their local currency are consolidated using the local currency as the functional currency. These local currency assets and liabilities are translated at the rates of exchange as of the balance sheet date, and local currency revenue and expenses of these operations are translated at average rates of exchange during the period. Translation gains and losses are included in accumulated other comprehensive income as a component of shareholders’ equity. Transaction gains and losses resulting from assets and liabilities denominated in a currency other than the functional currency are included in the consolidated statement of operations as a component of “other (expense) income, net.” See “Note 16—Consolidated Financial Statement Details” for additional information regarding foreign currency exchange gains and losses.\nTranslation gains and losses relating to foreign entities that are liquidated or substantially liquidated are reclassified out of accumulated other comprehensive loss into earnings.\n A gain of less than $\n0.1\n million during the year ended December 31, 2024 is included in “other income, net” in the accompanying consolidated statement of operations. There were \nno\n such gains or losses for the years ended December 31, 2023 and 2022.\nStock-Based Compensation\nStock-based compensation is measured at the grant date based on the fair value of the award and is generally expensed over the requisite service period.\n See “Note 11—Stock-based Compensation” for a discussion of the Company’s stock-based compensation plans.\nRedeemable Noncontrolling Interests\nNoncontrolling interests in the consolidated subsidiaries of the Company are ordinarily reported on the consolidated balance sheet within shareholders’ equity, separately from the Company’s equity. However, securities that are redeemable at the option of the holder and not solely within the control of the issuer must be classified outside of shareholders’ equity. Accordingly, all noncontrolling interests that are redeemable at the option of the holder are presented outside of shareholders’ equity in the accompanying consolidated balance sheet. At December 31, 2024 and 2023, there are no redeemable noncontrolling interest outstanding.\n72\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIn connection with the acquisition of certain subsidiaries, management of these businesses has retained an ownership interest. The Company is party to fair value put and call arrangements with respect to these interests. These put and call arrangements allow management of these businesses to require the Company to purchase their interests, or allow the Company to acquire such interests, at fair value. These put and call arrangements do not meet the definition of a derivative instrument as the put agreements do not provide for net settlement. These put and call arrangements become exercisable by the Company and the counterparty at various future dates. One of these arrangements was exercised during the year ended December 31, 2023. These put arrangements are exercisable by the counterparty outside the control of the Company. Accordingly, to the extent that the fair value of these interests exceeds the value determined by normal noncontrolling interest accounting, the value of such interests is adjusted to fair value with a corresponding adjustment to additional paid-in capital.\n During the years ended December 31, 2023 and 2022, the Company recorded adjustments of $\n0.5\n million, and $\n1.4\n million, respectively, to increase these interests to fair value. There was \nno\n such adjustment for the year ended December 31, 2024. Fair value determinations, which are level 3 assessments, require high levels of judgment and are based on various valuation techniques, including market comparables and discounted cash flow projections.\nCertain Risks and Concentrations\nThe Company’s business is subject to certain risks and concentrations, including dependence on third-party technology providers, exposure to risks associated with online commerce security, and credit card fraud.\nFinancial instruments, which potentially subject the Company to concentration of credit risk, consist primarily of cash and cash equivalents. Cash and cash equivalents are principally maintained with financial institutions and are not covered by deposit insurance.\nRecent Accounting Pronouncements\nAccounting pronouncements adopted by the Company\nIn November 2023, the FASB issued Accounting Standard Update (“ASU”) No. 2023-07, which requires disclosure of significant segment expenses and other segment items on an annual and interim basis and provide in interim periods all disclosures about a reportable segment’s profit or loss and assets that are currently required annually. Additionally, ASU No. 2023-07 requires the disclosure of the title and position of the Chief Operating Decision Maker. ASU No. 2023-07 does not change how a public entity identifies its operating segments, aggregates them, or applies the quantitative thresholds to determine its reportable segments. The new standard is effective on a retrospective basis in our Form 10-K for the year ended December 31, 2024, and our interim periods beginning with our Form 10-Q for the quarter ended March 31, 2025. We adopted the new standard, which did not impact our results of operations, cash flows, or financial condition, but did expand our disclosures on our reportable segments. See “Note 12—Segment and Geographic Information” for the expanded disclosures.\nAccounting pronouncements not yet adopted by the Company\nIn December 2023, the FASB issued ASU No. 2023-09, which focuses on the income tax rate reconciliation and income taxes paid. ASU No. 2023-09 requires a tabular rate reconciliation using both percentages and currency amounts, broken out into specified categories with certain reconciling items further broken out by nature and jurisdiction to the extent those items exceed a specified threshold on an annual basis. In addition, entities are required to disclose income taxes paid, net of refunds received disaggregated by federal, state/local, and foreign and by jurisdiction if the amount is at least 5% of total income tax payments, net of refunds received. The new standard is effective for our reporting on Form 10-K for the year ended December 31, 2025. Early adoption is permitted. An entity may apply the amendments in this ASU prospectively by providing the revised disclosures for the period ending December 31, 2025 and continuing to provide the pre-ASU No. 2023-09 disclosures for the prior periods, or may apply the amendments retrospectively by providing the revised disclosures for all periods presented. We expect ASU No. 2023-09 to only impact our disclosures with no impacts to our results of operations, cash flows, and financial condition. We plan to adopt the ASU for our reporting on Form 10-K for the year ended December 31, 2025 and we are evaluating adopting prospectively or retrospectively.\n73\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIn November 2024, the FASB issued ASU No. 2024-03, which requires more detailed disclosures about specified categories of expenses, including employee compensation, within certain expense captions presented on the face of the income statement and to disclose selling expenses. ASU No. 2024-03 is effective for our annual reporting on Form 10-K for the year ended December 31, 2027 and within interim periods beginning on our Form 10-Q for the quarter ended March 31, 2028. The new standard may be applied prospectively or retrospectively, and early adoption is permitted. We expect ASU No. 2024-03 to only impact our disclosures with no impacts to our results of operations, cash flows, and financial condition. We are currently evaluating when we will adopt the ASU.\nIn November 2024, the FASB issued ASU No. 2024-04, which clarifies the requirements for determining whether certain settlements of convertible debt instruments should be accounted for as induced conversions or extinguishment of convertible debt. ASU No. 2024-04 is effective for our annual reporting on Form 10-K for the year ended December 31, 2026. The new standard may be applied prospectively or retrospectively, and early adoption is permitted. After the standard is adopted, accounting for future induced conversions would be impacted. We are currently evaluating ASU No. 2024-04 and its impact on our results of operations, cash flows, and financial condition and evaluating when we will adopt the ASU.\nReclassifications\nCertain prior year amounts have been reclassified to conform to the current year presentation.\nNOTE 3—INCOME TAXES\nU.S. and foreign earnings (loss) from continuing operations before income taxes are as follows:\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nU.S. \n$\n677,842\n \n$\n708,333\n \n$\n651,406\n \nForeign\n26,214\n \n68,448\n \n(\n273,915\n)\n        Total\n$\n704,056\n \n$\n776,781\n \n$\n377,491\n \nThe components of the provision (benefit) for income taxes are as follows:\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nCurrent income tax provision:\n \n \nFederal\n$\n106,510\n \n$\n54,523\n \n$\n5,703\n \nState\n18,039\n \n16,136\n \n4,069\n \nForeign\n43,146\n \n28,038\n \n35,542\n \n      Current income tax provision\n167,695\n \n98,697\n \n45,314\n \nDeferred income tax (benefit) provision:\n \n \n \nFederal\n(\n2,672\n)\n33,267\n \n76,185\n \nState\n(\n5,916\n)\n(\n669\n)\n6,076\n \nForeign\n(\n6,364\n)\n(\n5,986\n)\n(\n112,214\n)\n      Deferred income tax (benefit) provision \n(\n14,952\n)\n26,612\n \n(\n29,953\n)\n      Income tax provision\n$\n152,743\n \n$\n125,309\n \n$\n15,361\n \nOn December 15, 2022, the European Union (“EU”) Member State formally adopted the EU’s Pillar Two Directive, which generally provides for a minimum effective tax rate of 15% as established by the Organization for Economic Cooperation and Development Pillar Two Framework (“OECD Pillar Two Framework”). The EU effective dates are January 1, 2024 and January 1, 2025, for different aspects of the directive. A significant number of other countries have enacted or are currently drafting legislation to implement the OECD Pillar Two \n74\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFramework. The Company analyzed the impact of enacted legislation and determined it does not have a material impact to the tax provision.\n \nThe tax effects of cumulative temporary differences that give rise to significant portions of the deferred tax assets and deferred tax liabilities are presented below. The valuation allowance is primarily related to deferred tax assets for foreign net operating losses.\n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nDeferred tax assets:\n \n \nNet operating loss carryforwards\n$\n165,959\n \n$\n177,740\n \nTax credit carryforwards\n71,222\n \n89,737\n \nCapitalized research expenses\n127,428\n \n89,979\n \nDisallowed interest carryforwards\n6,837\n \n31,531\n \nStock-based compensation\n30,671\n \n27,448\n \nAccrued expenses\n19,963\n \n21,382\n \nExchangeable notes\n28,821\n \n36,891\n \nOther\n30,295\n \n34,822\n \nTotal deferred tax assets\n481,196\n \n509,530\n \nLess valuation allowance\n(\n156,710\n)\n(\n159,675\n)\nDeferred tax assets, net of valuation allowance\n324,486\n \n349,855\n \nDeferred tax liabilities:\n \n \nIntangible assets\n(\n45,769\n)\n(\n65,349\n)\nRight-of-use assets\n(\n19,981\n)\n(\n22,657\n)\nProperty and equipment\n(\n4,403\n)\n(\n22,738\n)\nOther\n(\n3,546\n)\n(\n5,610\n)\nTotal deferred tax liabilities\n(\n73,699\n)\n(\n116,354\n)\nNet deferred tax assets\n$\n250,787\n \n$\n233,501\n \nDeferred income tax balances reflect the effects of temporary differences between the carrying amounts of assets and liabilities and their tax bases and are stated at enacted tax rates expected to be in effect when the taxes are paid or recovered.\nAt December 31, 2024, the Company has federal and state net operating losses (“NOLs”) of $\n5.9\n million and $\n117.5\n million, respectively. While subject to limitation under Section 382 of the Internal Revenue code and other separate return limitations, federal NOLs of $\n5.5\n million are expected to be used through 2037. Of the state NOLs, $\n1.3\n million can be carried forward indefinitely and $\n116.2\n million will expire at various times between 2025 and 2044. State NOLs of $\n104.1\n million can be used against future taxable income without restriction and the remaining NOLs are subject to separate return limitations under applicable state law. At December 31, 2024, the Company has foreign NOLs of $\n662.8\n million available to offset future income. Of these foreign NOLs, $\n133.2\n million can be carried forward indefinitely and $\n529.6\n million will expire at various times between 2025 and 2041. Foreign NOLs of $\n558.4\n million can be used against future taxable income without restriction and the remaining NOLs are subject to limitation under each respective taxing jurisdiction’s law. During 2024, the Company recognized tax benefits related to NOLs of $\n2.8\n million. At December 31, 2024, the Company has foreign disallowed interest carryforwards of $\n24.2\n million that can be carried forward indefinitely and can be used against future taxable income.\nAt December 31, 2024, the Company has tax credit carryforwards of $\n84.7\n million. Of this amount, $\n59.9\n million relates to state and foreign tax credits for research activities, of which $\n7.6\n million will expire at various times between 2030 and 2044. Our credit carryforwards also include $\n22.7\n million of domestic foreign tax \n75\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ncredits, which will expire at various times between 2027 and 2033. Additionally, the Company has $\n2.1\n million of other credits, primarily consisting of foreign employment tax credits which expire at various times between 2030 and 2032.\nThe Company regularly assesses the realizability of deferred tax assets considering all available evidence, including, to the extent applicable, the nature, frequency, and severity of prior cumulative losses, forecasts of future taxable income, tax filing status, the duration of statutory carryforward periods, available tax planning and historical experience.\nDuring the year ended December 31, 2024, we recorded a $\n3.0\n million net decrease to the valuation allowance, primarily related to a reduction in the deferred tax rate applied in certain jurisdictions, which was partially offset by an increase related to foreign disallowed interest carryforwards, net operating losses, and other deferred tax assets for which we do not believe a tax benefit is more likely than not to be realized. At December 31, 2024, the Company had a valuation allowance of $\n156.7\n million related to the portion of NOLs, credits, and other deferred tax assets for which it is more likely than not that the tax benefit will not be realized.\nA reconciliation of the income tax provision to the amounts computed by applying the statutory federal income tax rate to earnings before income taxes is shown as follows:\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nIncome tax provision at the federal statutory rate of 21%\n$\n147,852\n \n$\n163,124\n \n$\n79,273\n \nState income taxes, net of effect of federal tax benefit\n16,466\n \n15,689\n \n14,454\n \nStock-based compensation\n29,248\n \n32,270\n \n(\n27,941\n)\nResearch credits\n(\n17,194\n)\n(\n10,373\n)\n(\n12,611\n)\nForeign-derived intangible income deduction\n(\n41,730\n)\n(\n40,296\n)\n(\n12,646\n)\nChange in valuation allowance\n8,860\n \n(\n39,015\n)\n(\n22,621\n)\nForeign income taxed at a different statutory rate\n4,637\n \n6,680\n \n(\n4,104\n)\nWithholding taxes\n302\n \n891\n \n8,922\n \nChange in uncertain tax positions\n(\n1,376\n)\n(\n5,804\n)\n(\n10,694\n)\nOther, net\n5,678\n \n2,143\n \n3,329\n \nIncome tax provision\n$\n152,743\n \n$\n125,309\n \n$\n15,361\n \nThe 2024 income tax provision was impacted by nondeductible stock-based compensation and state income taxes partially offset by benefits from a lower tax rate on U.S. income derived from foreign sources and research credits.\nThe 2023 income tax provision benefited primarily from (i) the release of a valuation allowance associated with U.S. foreign tax credits that we now expect to utilize, (ii) a lower tax rate on U.S. income derived from foreign sources, and (iii) the generation of federal and state research credits. These benefits were partially offset by state income taxes and nondeductible stock-based compensation.\nThe 2022 income tax provision benefited primarily from (i) excess tax benefits generated by the exercise and vesting of stock-based awards, (ii) the release of a valuation allowance on certain foreign deferred tax assets that we now expect to utilize, (iii) favorable outcomes of tax audits, and (iv) a lower tax rate on U.S. income derived from foreign sources.\n \nThe benefits were partially offset by higher state income taxes due to higher taxable income in the U.S.\n76\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nA reconciliation of the beginning and ending amount of unrecognized tax benefits, including penalties but excluding interest, is as follows:\n \nDecember 31,\n \n2024\n2023\n2022\n \n(In thousands)\nBalance at January 1\n$\n45,047\n \n$\n43,340\n \n$\n50,830\n \nAdditions based on tax positions related to the current year\n13,166\n \n7,397\n \n5,781\n \nAdditions for tax positions of prior years\n921\n \n4,532\n \n1,938\n \nReductions for tax positions of prior years\n(\n58\n)\n(\n615\n)\n(\n12,287\n)\nSettlements\n(\n9,615\n)\n(\n852\n)\n(\n2,139\n)\nExpiration of applicable statute of limitations\n(\n797\n)\n(\n8,755\n)\n(\n783\n)\nBalance at December 31\n$\n48,664\n \n$\n45,047\n \n$\n43,340\n \nThe Company recognizes interest and, if applicable, penalties related to unrecognized tax benefits in the income tax provision. Our income tax provision for each of the years ended December 31, 2024, 2023, and 2022, includes an increase (decrease) of interest and penalties of $\n0.7\n million, $(\n0.3\n) million, and $(\n0.3\n) million, respectively. At December 31, 2024 and 2023, noncurrent income taxes payable include accrued interest and penalties of $\n1.6\n million and $\n0.9\n million, respectively.\nMatch Group is routinely under audit by federal, state, local, and foreign authorities in the area of income tax. These audits include questioning the timing and the amount of income and deductions and the allocation of income and deductions among various tax jurisdictions. The Internal Revenue Service (“IRS”) has substantially completed its audit of the Company’s federal income tax returns for years through December 31, 2019. Although the 2020 tax year is closed to assessment, adjustments to taxable income may still be made if it impacts net operating loss or credit carryforwards coming out of that year. Returns filed in various other jurisdictions are open to examination for tax years beginning with 2013. Although we believe that we have adequately reserved for our uncertain tax positions, the final tax outcome of these matters may vary significantly from our estimates.\nAt December 31, 2024 and 2023, unrecognized tax benefits, including interest, were $\n50.3\n million and $\n45.8\n million, respectively. If unrecognized tax benefits at December 31, 2024 are subsequently recognized, $\n46.6\n million, net of related deferred tax assets and interest, would reduce income tax expense. The comparable amount as of December 31, 2023 was $\n41.0\n million. The Company believes that it is reasonably possible that its unrecognized tax benefits could decrease by approximately $\n0.1\n million by December 31, 2025, primarily due to settlements and expirations of statutes of limitations.\nGenerally, our ability to distribute the $\n260.0\n million cash and cash equivalents held by our foreign subsidiaries at December 31, 2024 is limited to that subsidiary’s distributable reserves and after considering other corporate legal restrictions. The remaining excess of the amount for financial reporting over the tax basis of investments in foreign subsidiaries is indefinitely reinvested, and the determination of any deferred tax liability on this amount is not practicable.\nNOTE 4—DISCONTINUED OPERATIONS\nSeparation of Match Group and IAC\nOn June 30, 2020, the companies formerly known as Match Group, Inc. (referred to as “Former Match Group”) and IAC/InterActiveCorp (referred to as “Former IAC”) completed the separation of the Company from IAC through a series of transactions that resulted in two, separate public companies—(1) Match Group, which consists of the businesses of Former Match Group and certain financing subsidiaries previously owned by Former IAC, and (2) IAC/InterActiveCorp, formerly known as IAC Holdings, Inc. (“IAC”), consisting of Former IAC’s businesses other than Match Group (the “Separation”).\nAs a result of the Separation, the operations of Former IAC businesses other than Match Group, and the related income tax effects in subsequent years, are presented as discontinued operations.\n77\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe key components of loss from discontinued operations for the year ended December 31, 2022 consist of the following:\nYear Ended December 31, 2022\n(In thousands)\nIncome tax provision\n$\n(\n2,211\n)\nLoss from discontinued operations\n$\n(\n2,211\n)\nNOTE 5—GOODWILL AND INTANGIBLE ASSETS\nGoodwill and intangible assets, net, are as follows:\n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nGoodwill\n$\n2,310,730\n \n$\n2,342,612\n \nIntangible assets with indefinite lives\n96,931\n \n183,053\n \nIntangible assets with definite lives, net\n118,517\n \n122,693\n \nTotal goodwill and intangible assets, net\n$\n2,526,178\n \n$\n2,648,358\n \nThe following table presents the balance of goodwill, including the changes in the carrying value of goodwill, for the years ended December 31, 2024 and 2023:\nTinder\nHinge\nEvergreen & Emerging\nMG Asia\nTotal\n(In thousands)\nBalance at December 31, 2022\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n2,348,366\n \nAdditions\n—\n \n—\n \n—\n \n—\n \n12,525\n \nForeign Exchange Translation\n—\n \n—\n \n—\n \n—\n \n(\n18,279\n)\nBalance at December 31, 2023\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n2,342,612\n \nForeign Exchange Translation\n—\n \n—\n \n—\n \n—\n \n(\n19,883\n)\nOther Adjustments\n—\n \n—\n \n—\n \n—\n \n(\n2,997\n)\nReallocation to segments in the third quarter of 2024\n(a)\n1,532,968\n \n512,846\n \n182,517\n \n91,401\n \n—\n \nForeign Exchange Translation\n—\n \n—\n \n—\n \n(\n9,002\n)\n(\n9,002\n)\nBalance at December 31, 2024\n$\n1,532,968\n \n$\n512,846\n \n$\n182,517\n \n$\n82,399\n \n$\n2,310,730\n \n______________________\n(a)\nRepresents the reallocation of goodwill to \nfour\n new reporting units. See “Note 12—Segment and Geographic Information” for additional information.\nDuring the year ended December 31, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $\n30.6\n million related to indefinite- and definite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. For certain assets with no remaining cash flow, the Company fully impaired the asset. For assets with remaining cash flows, the Company conducted discounted cash flow valuations. The Company also reclassified an indefinite-lived intangible asset with a carrying value of $\n47.2\n million to the definite-lived intangible asset category during the year ended December 31, 2024 because the asset is no longer considered to have an indefinite life.\n78\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDuring the year ended December 31, 2022, the Company recognized impairment charges of $\n270.1\n million in the Match Group Asia segment related to Hyperconnect indefinite- and definite-lived intangible assets related to a decline in long-term projections for the business since the acquisition in June 2021, including adverse foreign currency impacts in certain of Hyperconnect’s key markets, and the use of higher discount rates to value the assets. Additionally, the Company recognized $\n49.4\n million of impairment in the Evergreen & Emerging segment during the year ended December 31, 2022 related to certain trade names including the Meetic and Match brands in Europe and certain affinity brands in the U.S., primarily due to declining projections at such brands. These charges are included within \nimpairment and amortization of intangibles\n in the consolidated statement of operations.\nIntangible assets with indefinite lives are trade names and trademarks acquired in various acquisitions. \nAt December 31, 2024 and 2023, intangible assets with definite lives are as follows:\nDecember 31, 2024\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nWeighted-Average\nUseful Life\n (Years)\n \n(In thousands)\nCustomer lists\n$\n100,218\n \n$\n(\n71,659\n)\n$\n28,559\n \n5.0\nPatent and technology\n43,988\n \n(\n38,547\n)\n5,441\n \n5.9\nTrade names\n104,463\n \n(\n19,946\n)\n84,517\n \n7.9\nOther \n18\n \n(\n18\n)\n—\n \n—\nTotal\n$\n248,687\n \n$\n(\n130,170\n)\n$\n118,517\n \n7.1\nDecember 31, 2023\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet\nWeighted-Average\nUseful Life\n (Years)\n \n(In thousands)\n \nCustomer lists\n$\n120,764\n \n$\n(\n65,596\n)\n$\n55,168\n \n5.0\nPatent and technology\n65,443\n \n(\n45,863\n)\n19,580\n \n4.7\nTrade names\n57,955\n \n(\n10,010\n)\n47,945\n \n7.8\nOther\n20\n \n(\n20\n)\n—\n \n—\nTotal\n$\n244,182\n \n$\n(\n121,489\n)\n$\n122,693\n \n6.0\nAt December 31, 2024, amortization of intangible assets with definite lives is estimated to be as follows:\n(In thousands)\n2025\n$\n36,991\n \n2026\n22,705\n \n2027\n13,729\n \n2028\n13,283\n \n2029 and thereafter\n31,809\n \nTotal\n$\n118,517\n \n79\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 6—FINANCIAL INSTRUMENTS\nEquity securities without readily determinable fair values\nAt December 31, 2024 and 2023, the carrying value of the Company’s investments in equity securities without readily determinable fair values totaled $\n19.3\n million and $\n14.3\n million, respectively, and is included in “Other non-current assets” in the accompanying consolidated balance sheet. The cumulative downward adjustments (including impairments) to the carrying value of equity securities without readily determinable fair values held as of December 31, 2024 were $\n2.1\n million. For both the years ended December 31, 2024 and 2023, there were \nno\n adjustments, either downward or upward, to the carrying value of equity securities without readily determinable fair values.\nFair Value Measurements\nThe following tables present the Company’s financial instruments that are measured at fair value on a recurring basis:\n \nDecember 31, 2024\n \nQuoted Market\nPrices in Active\nMarkets for\nIdentical Assets\n(Level 1)\nSignificant Other Observable Inputs\n(Level 2)\nTotal\nFair Value\nMeasurements\n \n(In thousands)\nAssets:\n \n \nCash equivalents:\n \n \nMoney market funds\n$\n264,008\n \n$\n—\n \n$\n264,008\n \nTime deposits\n—\n \n121,000\n \n121,000\n \nShort-term investments:\nTime deposits\n—\n \n4,734\n \n4,734\n \nTotal\n$\n264,008\n \n$\n125,734\n \n$\n389,742\n \n \nDecember 31, 2023\n \nQuoted Market\nPrices in Active\nMarkets for\nIdentical Assets\n(Level 1)\nSignificant Other Observable Inputs\n(Level 2)\nTotal\nFair Value\nMeasurements\n \n(In thousands)\nAssets:\n \n \nCash equivalents:\n \n \nMoney market funds\n$\n125,659\n \n$\n—\n \n$\n125,659\n \nTime deposits\n—\n \n75,000\n \n75,000\n \nShort-term investments:\n \n \nTime deposits\n—\n \n6,200\n \n6,200\n \nTotal\n$\n125,659\n \n$\n81,200\n \n$\n206,859\n \n80\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFinancial instruments measured at fair value only for disclosure purposes\nThe following table presents the carrying value and the fair value of financial instruments measured at fair value only for disclosure purposes.\nDecember 31, 2024\nDecember 31, 2023\nCarrying Value\nFair Value\nCarrying Value\nFair Value\n(In thousands)\nLong-term debt, net \n(a)(b)\n$\n(\n3,848,983\n)\n$\n(\n3,578,976\n)\n$\n(\n3,842,242\n)\n$\n(\n3,586,177\n)\n______________________\n(a)\nAt December 31, 2024 and 2023, the carrying value of long-term debt, net includes unamortized original issue discount and debt issuance costs of $\n26.0\n million and $\n32.8\n million, respectively.\n(b)\nAt December 31, 2024, the fair value of the outstanding 2026 Exchangeable Notes and 2030 Exchangeable Notes is $\n541.2\n million and $\n498.0\n million, respectively. At December 31, 2023, the fair value of the outstanding 2026 Exchangeable Notes and 2030 Exchangeable Notes is $\n517.2\n million, and $\n500.3\n million, respectively.\nAt December 31, 2024 and 2023, the fair value of long-term debt, net is estimated using observable market prices or indices for similar liabilities, which are Level 2 inputs.\nNOTE 7—LONG-TERM DEBT, NET \nLong-term debt, net consists of:\nDecember 31,\n2024\n2023\n(In thousands)\nCredit Facility due March 20, 2029\n(a)\n$\n—\n \n$\n—\n \nTerm Loan due February 13, 2027\n425,000\n \n425,000\n \n5.00\n% Senior Notes due December 15, 2027 (the “\n5.00\n% Senior Notes”); interest payable each June 15 and December 15\n450,000\n \n450,000\n \n4.625\n% Senior Notes due June 1, 2028 (the “\n4.625\n% Senior Notes”); interest payable each June 1 and December 1\n500,000\n \n500,000\n \n5.625\n% Senior Notes due February 15, 2029 (the “\n5.625\n% Senior Notes”); interest payable each February 15 and August 15\n350,000\n \n350,000\n \n4.125\n% Senior Notes due August 1, 2030 (the “\n4.125\n% Senior Notes”); interest payable each February 1 and August 1\n500,000\n \n500,000\n \n3.625\n% Senior Notes due October 1, 2031 (the “\n3.625\n% Senior Notes”); interest payable each April 1 and October 1\n500,000\n \n500,000\n \n0.875\n% Exchangeable Senior Notes due June 15, 2026 (the “2026 Exchangeable Notes”); interest payable each June 15 and December 15\n575,000\n \n575,000\n \n2.00\n% Exchangeable Senior Notes due January 15, 2030 (the “2030 Exchangeable Notes”); interest payable each January 15 and July 15\n575,000\n \n575,000\n \nTotal long-term debt\n3,875,000\n \n3,875,000\n \nLess: Unamortized original issue discount\n2,554\n \n3,479\n \nLess: Unamortized debt issuance costs\n23,463\n \n29,279\n \nTotal long-term debt, net\n$\n3,848,983\n \n$\n3,842,242\n \n______________________\n(a)\nSubject to springing maturity, described below.\n81\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following diagram illustrates where debt is held in our corporate structure as of December 31, 2024.\nCredit Facility and Term Loan\nMG Holdings II is the borrower under a credit agreement (as amended, the “Credit Agreement”) that provides for the Credit Facility and the Term Loan. On March 20, 2024, we entered into an amendment to reduce the borrowing availability under the Credit Facility from $\n750\n million to $\n500\n million and extend the maturity date of the Credit Facility. The maturity date of the Credit Facility is the earlier of (x) March 20, 2029 and (y) the date that is \n91\n days prior to the maturity date of the Term Loan or the existing senior notes due 2027, 2028, or 2029, or any new indebtedness used to refinance the Term Loan or such senior notes that matures prior to the date that is \n91\n days after March 20, 2029, in each case if and only if at least $\n250\n million in aggregate principal amount of such debt is outstanding on such date.\nAt December 31, 2024 and 2023, the Credit Facility has a borrowing capacity of $\n500\n million and $\n750\n million, respectively. At both December 31, 2024 and 2023, there were \nno\n outstanding borrowings under the credit facility. At December 31, 2024 and 2023, there were letters of credit of $\n0.6\n million and $\n0.4\n million, respectively. At December 31, 2024 and 2023, there was $\n499.4\n million and $\n749.6\n million, respectively, of availability under the Credit Facility. The annual commitment fee on undrawn funds, which is based on MG Holdings II’s consolidated net leverage ratio, was \n25\n basis points as of December 31, 2024. Borrowings under the Credit Facility bear interest, at MG Holdings II’s option, at a base rate or a term secured overnight financing rate plus an applicable adjustment (“Adjusted Term SOFR”), plus an applicable margin based on MG Holdings II’s consolidated net leverage ratio. If MG Holdings II borrows under the Credit Facility, it will be required to maintain a consolidated net leverage ratio of not more than \n5.0\n to 1.0.\nAt both December 31, 2024 and 2023, the outstanding balance on the Term Loan was $\n425\n million. The Term Loan bears interest at Adjusted Term SOFR plus \n1.75\n% and the applicable rate was \n6.22\n% and \n7.27\n% at December 31, 2024 and 2023, respectively. The Term Loan matures on February 13, 2027. Interest payments are due at least quarterly through the term of the loan. The Term Loan provides for annual principal payments as part of an excess cash flow sweep provision, the amount of which, if any, is governed by the secured net leverage ratio set forth in the Credit Agreement.\nThe Credit Agreement includes covenants that would limit the ability of MG Holdings II to pay dividends, make distributions, or repurchase MG Holdings II’s stock in the event MG Holdings II’s secured net leverage ratio exceeds \n4.25\n to 1.0, or if an event of default has occurred. The Credit Agreement includes additional covenants that limit the ability of MG Holdings II and its subsidiaries to, among other things, incur indebtedness, pay dividends, or make distributions. Obligations under the Credit Facility and Term Loan are unconditionally guaranteed by certain MG Holdings II wholly-owned domestic subsidiaries and are also secured by the stock of certain MG Holdings II domestic and foreign subsidiaries. The Term Loan and outstanding borrowings, if any, \n82\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nunder the Credit Facility rank equally with each other, and have priority over the Senior Notes to the extent of the value of the assets securing the borrowings under the Credit Agreement.\nSenior Notes\nThe \n3.625\n% Senior Notes were issued on October 4, 2021. The proceeds from these notes were used to redeem a portion of the then outstanding \n0.875\n% Exchangeable Senior Notes due October 1, 2022 (the “2022 Exchangeable Notes”) and for general corporate purposes. At any time prior to October 1, 2026, these notes may be redeemed at a redemption price equal to the sum of the principal amount, plus accrued and unpaid interest and a make-whole premium set forth in the indenture governing the notes. Thereafter, these notes may be redeemed at the redemption prices set forth below, together with accrued and unpaid interest to the applicable redemption date:\nBeginning October 1,\nPercentage\n2026\n101.813\n%\n2027\n101.208\n%\n2028\n100.604\n%\n2029 and thereafter\n100.000\n%\nThe \n4.625\n% Senior Notes were issued on May 19, 2020, and are currently redeemable. The proceeds from these notes were used to redeem then outstanding senior notes, to pay expenses associated with the offering, and for general corporate purposes. These notes may be redeemed at the redemption prices set forth below, together with accrued and unpaid interest to the applicable redemption date:\nBeginning June 1,\nPercentage\n2024\n101.156\n%\n2025 and thereafter\n100.000\n%\nThe \n4.125\n% Senior Notes were issued on February 11, 2020. The proceeds from these notes were used to fund a portion of the distribution by Former Match Group that was payable in connection with the Separation. At any time prior to May 1, 2025, these notes may be redeemed at a redemption price equal to the sum of the principal amount, plus accrued and unpaid interest and a make-whole premium set forth in the indenture governing the notes. Thereafter, these notes may be redeemed at the redemption prices set forth below, together with accrued and unpaid interest to the applicable redemption date:\nBeginning May 1,\nPercentage\n2025\n102.063\n%\n2026\n101.375\n%\n2027\n100.688\n%\n2028 and thereafter\n100.000\n%\nThe \n5.625\n% Senior Notes were issued on February 15, 2019, and are currently redeemable. The proceeds from these notes were used to repay outstanding borrowings under the Credit Facility, to pay expenses associated with the offering, and for general corporate purposes. These notes may be redeemed at the redemption prices set forth below, together with accrued and unpaid interest to the applicable redemption date:\nBeginning February 15,\nPercentage\n2024\n102.813\n%\n2025\n101.875\n%\n2026\n100.938\n%\n2027 and thereafter\n100.000\n%\n83\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe \n5.00\n% Senior Notes were issued on December 4, 2017, and are currently redeemable. The proceeds, along with cash on hand, were used to redeem then outstanding senior notes and pay the related call premium. These notes may be redeemed at the redemption prices set forth below, together with accrued and unpaid interest thereon to the applicable redemption date:\nBeginning December 15,\nPercentage\n2024\n100.833\n%\n2025 and thereafter\n100.000\n%\nThe indenture governing the \n5.00\n% Senior Notes contains covenants that would limit MG Holdings II’s ability to pay dividends or to make distributions and repurchase or redeem MG Holdings II’s stock in the event a default has occurred or MG Holdings II’s consolidated leverage ratio (as defined in the indenture) exceeds \n5.0\n to 1.0. At December 31, 2024, there were no limitations pursuant thereto. There are additional covenants in the \n5.00\n% Senior Notes indenture that limit the ability of MG Holdings II and its subsidiaries to, among other things, (i) incur indebtedness, make investments, or sell assets in the event MG Holdings II is not in compliance with specified financial ratios, and (ii) incur liens, enter into agreements restricting their ability to pay dividends, enter into transactions with affiliates, or consolidate, merge, or sell substantially all of their assets. The indentures governing the \n3.625\n%, \n4.125\n%, \n4.625\n%, and \n5.625\n% Senior Notes are less restrictive than the indentures governing the \n5.00\n% Senior Notes and generally only limit MG Holdings II’s and its subsidiaries’ ability to, among other things, create liens on assets, or consolidate, merge, sell, or otherwise dispose of all or substantially all of their assets.\nThe Senior Notes all rank equally in right of payment.\nExchangeable Notes\nDuring 2019, Match Group FinanceCo 2, Inc. and Match Group FinanceCo 3, Inc., direct, wholly-owned subsidiaries of the Company, issued $\n575.0\n million aggregate principal amount of 2026 Exchangeable Notes and $\n575.0\n million aggregate principal amount of 2030 Exchangeable Notes, respectively.\nThe 2026 and 2030 Exchangeable Notes (collectively the “Exchangeable Notes”) are guaranteed by the Company but are not guaranteed by MG Holdings II or any of its subsidiaries.\nThe following table presents details of the outstanding exchangeable features:\nNumber of shares of the Company’s Common Stock into which each $1,000 of Principal of the Exchangeable Notes is Exchangeable\n(a)\nApproximate Equivalent Exchange Price per Share\n(a)\nExchangeable Date\n2026 Exchangeable Notes\n11.4259\n$\n87.52\n \nMarch 15, 2026\n2030 Exchangeable Notes\n11.8739\n$\n84.22\n \nOctober 15, 2029\n______________________\n(a)\nSubject to adjustment upon the occurrence of specified events.\nAs more specifically set forth in the applicable indentures, the Exchangeable Notes are exchangeable under the following circumstances:\n(1) during any calendar quarter (and only during such calendar quarter), if the last reported sale price of the Company's common stock for at least \n20\n trading days (whether or not consecutive) during the period of \n30\n consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter is greater than or equal to \n130\n% of the exchange price on each applicable trading day;\n(2) during the \nfive\n-business day period after any \nfive\n-consecutive trading day period in which the trading price per $1,000 principal amount of notes for each trading day of the measurement period was less than \n98\n% of the product of the last reported sale price of the Company's common stock and the exchange rate on each such trading day;\n84\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n(3) if the issuer calls the notes for redemption, at any time prior to the close of business on the scheduled trading day immediately preceding the redemption date; or\n(4) upon the occurrence of specified corporate events as further described in the indentures governing the respective Exchangeable Notes.\nOn or after the respective exchangeable dates noted in the table above, until the close of business on the second scheduled trading day immediately preceding the maturity date, holders may exchange all or any portion of their Exchangeable Notes regardless of the foregoing conditions. Upon exchange, the issuer, in its sole discretion, has the option to settle the Exchangeable Notes with any of the three following alternatives: (1) shares of the Company’s common stock, (2) cash, or (3) a combination of cash and shares of the Company's common stock. It is the Company’s intention to settle the Exchangeable Notes with cash equal to the face amount of the notes upon exchange. Any dilution arising from the 2026 and 2030 Exchangeable Notes would be mitigated by the 2026 and 2030 Exchangeable Notes Hedges (defined below), respectively.\nThere were not any 2026 or 2030 Exchangeable Notes presented for exchange during the years ended December 31, 2024 and 2023. Neither of the 2026 and 2030 Exchangeable Notes were exchangeable as of December 31, 2024.\nAt both December 31, 2024 and December 31, 2023, there was no value in excess of the principal of each\nof the 2026 and 2030 Exchangeable Notes outstanding on an if-converted basis using the Company’s stock price on December 31, 2024 and December 31, 2023, respectively.\nAdditionally, all or any portion of the 2026 Exchangeable Notes may be redeemed for cash at the respective issuer’s option, at any time and, for the 2030 Exchangeable Notes, on or after July 20, 2026, if the last reported sale price of the Company’s common stock has been at least \n130\n% of the exchange price then in effect for at least \n20\n trading days (whether or not consecutive), including at least \none\n of the \nfive\n trading days immediately preceding the date on which the notice of redemption is provided, during any \n30\n consecutive trading day period ending on, and including, the trading day immediately preceding the date on which the applicable issuer provides notice of redemption, at a redemption price equal to \n100\n% of the principal amount to be redeemed, plus accrued and unpaid interest to, but excluding, the redemption date.\nThe following table sets forth the components of the outstanding Exchangeable Notes as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\n2026 Exchangeable Notes\n2030 Exchangeable Notes\n2026 Exchangeable Notes\n2030 Exchangeable Notes\n(In thousands)\nPrincipal\n$\n575,000\n \n$\n575,000\n \n$\n575,000\n \n$\n575,000\n \nLess: unamortized debt issuance costs\n2,371\n \n5,592\n \n3,976\n \n6,630\n \nNet carrying value included in long-term debt, net\n$\n572,629\n \n$\n569,408\n \n$\n571,024\n \n$\n568,370\n \n85\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table sets forth interest expense recognized related to the Exchangeable Notes for the years ended December 31, 2024, 2023, and 2022:\nYear Ended December 31, 2024\n2026 Exchangeable Notes\n2030 Exchangeable Notes\n(In thousands)\nContractual interest expense\n$\n5,031\n \n$\n11,500\n \nAmortization of debt issuance costs\n1,605\n \n1,038\n \nTotal interest expense recognized\n$\n6,636\n \n$\n12,538\n \nYear Ended December 31, 2023\n2026 Exchangeable Notes\n2030 Exchangeable Notes\n(In thousands)\nContractual interest expense\n$\n5,031\n \n$\n11,500\n \nAmortization of debt issuance costs\n1,586\n \n1,015\n \nTotal interest expense recognized\n$\n6,617\n \n$\n12,515\n \nYear Ended December 31, 2022\n2022 Exchangeable Notes\n(a)\n2026 Exchangeable Notes\n2030 Exchangeable Notes\n(In thousands)\nContractual interest expense\n$\n366\n \n$\n5,031\n \n$\n11,500\n \nAmortization of debt issuance costs\n401\n \n1,568\n \n993\n \nTotal interest expense recognized\n$\n767\n \n$\n6,599\n \n$\n12,493\n \n______________________\n(a)\nThe outstanding balance of the 2022 Exchangeable Notes was fully redeemed during the year ended December 31, 2022.\nThe effective interest rates for the 2026 and 2030 Exchangeable Notes are \n1.2\n% and \n2.2\n%, respectively.\nExchangeable Notes Hedges and Warrants\nIn connection with the Exchangeable Notes offerings, the Company purchased call options allowing the Company to purchase initially (subject to adjustment upon the occurrence of specified events) the same number of shares that would be issuable upon the exchange of the applicable Exchangeable Notes at the price per share set forth below (the “Exchangeable Notes Hedges”), and sold warrants allowing the counterparty to purchase (subject to adjustment upon the occurrence of specified events) shares at the per share price set forth below (the “Exchangeable Notes Warrants”).\nThe Exchangeable Notes Hedges are expected to reduce the potential dilutive effect on the Company’s common stock upon any exchange of notes and/or offset any cash payment Match Group FinanceCo 2, Inc. or Match Group FinanceCo 3, Inc. is required to make in excess of the principal amount of the exchanged notes. The Exchangeable Notes Warrants have a dilutive effect on the Company’s common stock to the extent that the market price per share of the Company’s common stock exceeds their respective strike prices.\n86\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following tables present details of the Exchangeable Notes Hedges and Warrants outstanding at December 31, 2024:\nNumber of Shares\n(a)\nApproximate Equivalent Exchange Price per Share\n(a)\n(Shares in millions)\n2026 Exchangeable Notes Hedges\n6.6\n$\n87.52\n \n2030 Exchangeable Notes Hedges\n6.8\n$\n84.22\n \nNumber of Shares\n(a)\nWeighted Average Strike Price per Share\n(a)\n(Shares in millions)\n2026 Exchangeable Notes Warrants\n6.6\n$\n134.76\n \n2030 Exchangeable Notes Warrants\n6.8\n$\n134.82\n \n______________________\n(a)\nSubject to adjustment upon the occurrence of specified events.\nLong-term debt maturities\nYears Ending December 31,\n(In thousands)\n2026\n$\n575,000\n \n2027\n875,000\n \n2028\n500,000\n \n2029\n350,000\n \n2030\n1,075,000\n \n2031\n500,000\n \nTotal\n3,875,000\n \nLess: Unamortized original issue discount\n2,554\n \nLess: Unamortized debt issuance costs\n23,463\n \nTotal long-term debt, net\n$\n3,848,983\n \nNOTE 8—SHAREHOLDERS’ EQUITY \nDescription of Common Stock \nHolders of Match Group common stock are entitled to \none\n vote per share on all matters to be voted upon by the stockholders. Holders of Match Group common stock are entitled to receive, share for share, such dividends as may be declared by Match Group’s Board of Directors out of funds legally available therefor. In the event of a liquidation, dissolution, or winding up, holders of the Company’s common stock are entitled to receive, ratably, the assets available for distribution to stockholders after payment of all liabilities.\nReserved Common Shares\nIn connection with equity compensation plans, the Exchangeable Notes, and Exchangeable Notes Warrants, \n65.7\n million shares of Match Group common stock are reserved at December 31, 2024.\nCommon Stock Repurchases\nIn May 2022, our Board of Directors approved a share repurchase program (the “2022 Share Repurchase Program”) to repurchase up to \n12.5\n million shares of our common stock. In April 2023, our Board of Directors approved a share repurchase program (the “2023 Share Repurchase Program”) for the repurchase of up to $\n1.0\n billion in aggregate value of shares of Match Group stock, which replaced the 2022 Share Repurchase \n87\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nProgram. In January 2024, the Board of Directors approved a share repurchase program of up to $\n1.0\n billion in aggregate value of shares of Match Group stock (the “January 2024 Share Repurchase Program”), which replaced the 2023 Share Repurchase Program. On December 10, 2024, the Board of Directors authorized a new repurchase program of up to $\n1.5\n billion in aggregate value of shares of Match Group common stock (the “December 2024 Share Repurchase Program”). The December 2024 Share Repurchase Program will take effect when the January 2024 Share Repurchase Program, of which $\n247\n million in aggregate value of shares of Match Group common stock remains available as of December 31, 2024, is exhausted. Under both the January and December 2024 Share Repurchase Programs, shares of our common stock may be purchased on a discretionary basis from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases, privately negotiated transactions or other means, including through Rule 10b5-1 trading plans. Both the January and December 2024 Share Repurchase Programs may be commenced, suspended or discontinued at any time.\nDuring the years ended December 31, 2024, 2023, and 2022, we repurchased \n22.2\n million, \n13.5\n million and \n7.2\n million shares of our common stock, respectively, for aggregate consideration, on a trade date basis, of $\n752.7\n million, $\n546.2\n million and $\n482.0\n million, respectively.\nPreferred Stock\nThe Company has authorized \n100,000,000\n shares, $\n0.01\n par value per share, of preferred stock. \nNo\n shares have been issued under this authorization.\nDividend\nOn December 10, 2024, the Company’s Board of Directors declared a cash dividend of $\n0.19\n per share of outstanding common stock, to stockholders of record as of the close of business on January 6, 2025, in the aggregate amount equal to $\n47.8\n million, payable on January 21, 2025. Additionally, restricted stock units (“RSUs”) granted on or after February 1, 2024 receive dividend equivalents that vest proportionally to the underlying award’s vesting schedule.\nNOTE 9—ACCUMULATED OTHER COMPREHENSIVE LOSS \nThe following tables present the components of accumulated other comprehensive loss. For the years ended December 31, 2024, 2023, and 2022, the Company’s accumulated other comprehensive loss relates to foreign currency translation adjustments.\nYears Ended December 31,\n2024\n2023\n2022\n \n(In thousands)\nBalance at January 1\n$\n(\n385,471\n)\n$\n(\n369,182\n)\n$\n(\n223,754\n)\nOther comprehensive loss\n(\n64,144\n)\n(\n16,289\n)\n(\n145,428\n)\nAmounts reclassified into earnings\n4\n \n—\n \n—\n \nNet current period other comprehensive loss\n(\n64,140\n)\n(\n16,289\n)\n(\n145,428\n)\nBalance at December 31\n$\n(\n449,611\n)\n$\n(\n385,471\n)\n$\n(\n369,182\n)\nAt December 31, 2024, 2023, and 2022, there was \nno\n tax benefit or provision on the accumulated other comprehensive loss.\n88\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNOTE 10—EARNINGS PER SHARE\nThe following table sets forth the computation of the basic and diluted earnings per share attributable to Match Group shareholders:\nYears Ended December 31,\n2024\n2023\n2022\nBasic\nDiluted\nBasic\nDiluted\nBasic\nDiluted\n(In thousands, except per share data)\nNumerator\nNet earnings from continuing operations\n$\n551,313\n \n$\n551,313\n \n$\n651,472\n \n$\n651,472\n \n$\n362,130\n \n$\n362,130\n \nNet (earnings) loss attributable to noncontrolling interests\n(\n37\n)\n(\n37\n)\n67\n \n67\n \n2,027\n \n2,027\n \nImpact from subsidiaries' dilutive securities of continuing operations\n— \n(\n24\n)\n— \n(\n81\n)\n— \n(\n222\n)\nInterest on dilutive Exchangeable Notes, net of income tax\n(a)\n— \n12,691\n \n— \n12,684\n \n— \n4,151\n \nNet earnings from continuing operations attributable to Match Group, Inc. shareholders\n$\n551,276\n \n$\n563,943\n \n$\n651,539\n \n$\n664,142\n \n$\n364,157\n \n$\n368,086\n \nNet loss from discontinued operations attributable to shareholders\n—\n \n—\n \n—\n \n—\n \n(\n2,211\n)\n(\n2,211\n)\nNet earnings attributable to Match Group, Inc. shareholders\n$\n551,276\n \n$\n563,943\n \n$\n651,539\n \n$\n664,142\n \n$\n361,946\n \n$\n365,875\n \nDenominator\nWeighted average basic shares outstanding\n260,299\n \n260,299\n \n275,773\n \n275,773\n \n282,564\n \n282,564\n \nDilutive securities\n(b)(c)\n— \n5,367\n \n— \n4,114\n \n— \n5,020\n \nDilutive shares from Exchangeable Notes, if-converted\n(a)\n— \n13,397\n \n— \n13,397\n \n— \n7,631\n \nDenominator for earnings per share—weighted average shares\n(b)(c)\n260,299\n \n279,063\n \n275,773\n \n293,284\n \n282,564\n \n295,215\n \nEarnings (loss) per share:\nEarnings per share from continuing operations\n$\n2.12\n \n$\n2.02\n \n$\n2.36\n \n$\n2.26\n \n$\n1.29\n \n$\n1.25\n \nLoss per share from discontinued operations, net of tax\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n(\n0.01\n)\n$\n(\n0.01\n)\nEarnings per share attributable to Match Group, Inc. shareholders\n$\n2.12\n \n$\n2.02\n \n$\n2.36\n \n$\n2.26\n \n$\n1.28\n \n$\n1.24\n \n______________________\n(a)\nThe Company uses the if-converted method for calculating the dilutive impact of the outstanding Exchangeable Notes. For the years ended December 31, 2024 and 2023, the Company adjusted net earnings attributable to Match Group, Inc. shareholders for the cash interest expense, net of income taxes, incurred on the 2026 and 2030 Exchangeable Notes. Dilutive shares were also included for the same series of Exchangeable Notes. For the year ended December 31, 2022, the Company adjusted net earnings from continuing operations attributable to Match Group, Inc. shareholders for the cash interest expense, net of income taxes, incurred on the 2022 and 2026 Exchangeable Notes and dilutive \n89\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nshares were included for the same set of notes. For the year ended December 31, 2022, the 2030 Exchangeable Notes were not more dilutive under the if-converted method and therefore no adjustment to net earnings attributable to Match Group, Inc. for cash interest expense related to the 2030 Exchangeable Notes was made for the year, and the weighted average \n6.8\n million shares related to the 2030 Exchangeable Notes are excluded from dilutive securities.\n(b)\nIf the effect is dilutive, weighted average common shares outstanding include the incremental shares that would be issued upon the assumed exercise of stock options, warrants, and subsidiary denominated equity and vesting of restricted stock units. For the years ended December 31, 2024, 2023, and 2022, \n17.3\n million, \n15.9\n million, and \n16.0\n million potentially dilutive securities, respectively, are excluded from the calculation of diluted earnings per share because their inclusion would have been anti-dilutive.\n(c)\nMarket-based awards and performance-based stock units (“PSUs”) are considered contingently issuable shares. Shares issuable upon exercise or vesting of market-based awards and PSUs are included in the denominator for earnings per share if (i) the applicable market or performance condition(s) has been met and (ii) the inclusion of the market-based awards and PSUs is dilutive for the respective reporting periods. For the years ended December 31, 2024, 2023, and 2022, \n3.0\n million, \n3.2\n million, and \n1.6\n million market-based awards and PSUs, respectively, were excluded from the calculation of diluted earnings per share because the market or performance conditions had not been met.\nNOTE 11—STOCK-BASED COMPENSATION\nThe Company currently has \nfour\n active stock and annual incentive plans: \ntwo\n Former Match Group plans that were assumed as part of the Separation (the 2015 and 2017 plans), a plan that was approved by shareholders on June 25, 2020 (the 2020 plan), and a plan that was approved by shareholders on June 21, 2024 (the 2024 plan). The 2015, 2017, and 2024 plans cover stock options to acquire shares of Match Group common stock, RSUs, PSUs, and stock settled stock appreciation rights denominated in the equity of certain of our subsidiaries, in each case with respect to awards granted by the Company, and in the case of the 2015 and 2017 plans, awards previously granted by Former Match Group prior to the Separation. The 2015 and 2024 plans authorize the Company to grant awards to its employees, officers, directors and consultants. At December 31, 2024, there were \n20.7\n million shares available for the future grant of equity awards under the 2015 and 2024 plans collectively. The 2020 plan covers options previously granted by Former IAC that converted into Match Group options as a result of the Separation. No additional grants can be made from the 2017 and 2020 plans.\nThe 2015, 2017, and 2024 plans have a stated term of \nten years\n and provide that the exercise price of stock options granted will not be less than the market price of the Company’s common stock on the grant date. No plan specifies grant dates or vesting schedules of awards as those determinations have been delegated to the Compensation and Human Resources Committee of Match Group’s Board of Directors (the “Committee”). Each grant agreement reflects the vesting schedule for that particular grant as determined by the Committee. RSUs, PSUs, and market-based awards outstanding generally vest over a \nthree\n- or \nfour-year\n period.\nStock-based compensation expense recognized in the consolidated statement of operations includes expense related to the Company’s stock options, RSUs, market-based awards, PSUs for which vesting is considered probable, and equity instruments denominated in shares of subsidiaries. The amount of stock-based compensation expense recognized is net of estimated forfeitures, as the expense recorded is based on awards that are ultimately expected to vest. The forfeiture rate is estimated at the grant date based on historical experience and revised, if necessary, in subsequent periods if actual forfeitures differ from the estimated rate. At December 31, 2024, there is $\n358.0\n million of unrecognized compensation cost, net of estimated forfeitures, related to all outstanding equity-based awards, which is expected to be recognized over a weighted average period of approximately \n1.9\n years.\nThe total income tax benefit recognized in the accompanying consolidated statement of operations for the years ended December 31, 2024, 2023, and 2022 related to all stock-based compensation is $\n28.7\n million, $\n16.3\n million and $\n72.5\n million, respectively.\nThe aggregate income tax benefit recognized related to the exercise of stock options for the years ended December 31, 2024, 2023, and 2022 is $\n5.8\n million, $\n3.2\n million, and $\n53.5\n million, respectively.\n90\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nStock Options\nStock options outstanding at December 31, 2024 and changes during the year ended December 31, 2024 are as follows:\n \nDecember 31, 2024\n \nShares\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nTerm (In Years)\nAggregate\nIntrinsic\nValue\n \n(Shares and intrinsic value in thousands)\nOutstanding at January 1, 2024\n3,116\n \n$\n20.80\n \n \n \nExercised\n(\n385\n)\n16.39\n \n \n \nExpired\n(\n19\n)\n25.58\n \nOutstanding and exercisable at December 31, 2024\n2,712\n \n$\n21.39\n \n2.0\n$\n34,738\n \nThe aggregate intrinsic value in the table above represents the difference between Match Group’s closing stock price on the last trading day of 2024 and the exercise price, multiplied by the number of in-the-money options that would have been exercised had option holders exercised their options on December 31, 2024. The total intrinsic value of stock options exercised during the years ended December 31, 2024 and 2023 is $\n6.9\n million and $\n13.7\n million, respectively. Cash received from Match Group stock option exercises for the years ended December 31, 2024, 2023, and 2022 was $\n13.6\n million, $\n19.9\n million, and $\n20.5\n million, respectively.\nRestricted Stock Units, Performance-Based Stock Units, and Market-Based Awards\nRSUs, PSUs, and market-based awards are awards in the form of phantom shares or units denominated in a hypothetical equivalent number of shares of Match Group common stock. For market-based awards, the grant date fair value was estimated using a lattice model that incorporates a Monte Carlo simulation of the Company’s total shareholder return relative to companies within the Nasdaq 100 Index or Nasdaq composite index over various performance periods. Each RSU, PSU, and market-based award is subject to service-based vesting, where a specific period of continued employment must pass before an award vests. PSUs also include performance-based vesting conditions where certain performance targets set at the time of grant must be achieved before an award vests. The number of market-based awards that ultimately vest is based on the Company’s market performance relative to certain other publicly-traded companies. For RSU awards, the expense is measured at the grant date as the fair value of Match Group common stock and expensed as stock-based compensation over the vesting term. For PSU awards, the expense is measured at the grant date as the fair value of Match Group common stock and expensed as stock-based compensation over the vesting term if the performance targets are considered probable of being achieved.\n91\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUnvested RSUs, PSUs, and market-based awards outstanding at December 31, 2024 and changes during the year ended December 31, 2024 are as follows:\n \nRSUs\nPSUs\nMarket-based awards\n \nNumber of shares\nWeighted Average Grant Date Fair Value\nNumber of shares\n(a)\nWeighted Average Grant Date Fair Value\nNumber of shares\n(a)\nWeighted Average Grant Date Fair Value\n \n(Shares in thousands)\nUnvested at January 1, 2024\n7,332\n \n$\n61.79\n \n2,147\n \n$\n45.58\n \n2,352\n \n$\n94.67\n \nGranted\n6,487\n \n35.74\n \n118\n \n38.13\n \n1,276\n \n44.69\n \nVested\n(\n3,670\n)\n65.36\n \n(\n241\n)\n41.49\n \n—\n \n—\n \nForfeited\n(\n1,372\n)\n48.47\n \n(\n570\n)\n56.64\n \n(\n284\n)\n96.45\n \nExpired\n—\n \n—\n \n—\n \n—\n \n(\n368\n)\n123.01\n \nUnvested at December 31, 2024\n8,777\n \n$\n43.12\n \n1,454\n \n$\n41.31\n \n2,976\n \n$\n69.58\n \n______________________\n(a)\nRepresents the maximum shares issuable.\nThe weighted average fair value of RSUs and PSUs granted during the years ended December 31, 2024 and 2023, based on market prices of Match Group’s common stock on the grant date, was $\n35.78\n and $\n41.25\n, respectively. The total fair value of RSUs that vested during the years ended December 31, 2024 and 2023 was $\n239.9\n million and $\n185.0\n million, respectively. The total fair value of PSUs that vested during the year ended December 31, 2024 was $\n10.0\n million. \nNo\n PSUs vested during the year ended December 31, 2023.\nThere were \n1.3\n million market-based awards granted during both the years ended December 31, 2024 and 2023. The vesting of the awards granted in 2024 and 2023 are dependent upon the Company’s total shareholder return relative to companies within the Nasdaq 100 Index or Nasdaq composite index over various performance periods. \nNo\n market-based awards vested during the years ended December 31, 2024 and 2023.\nEquity Instruments Denominated in Shares of Certain Subsidiaries\nThe Company has granted stock settled stock appreciation rights and restricted stock units, both denominated in the equity of a certain non-publicly traded subsidiary to employees of the subsidiary. These equity awards vest over a specified period of time. The value of the stock settled stock appreciation rights and restricted stock units are based on the equity value of the subsidiary. The stock settled stock appreciation rights awards only have value to the extent the relevant business appreciates in value above the initial value utilized to determine the exercise price. The fair value of the common stock of the subsidiary is generally determined through a third-party valuation pursuant to the terms of the respective subsidiary equity plan. The stock appreciation rights and restricted stock units are both settled on a net basis, with the award holder entitled to receive a payment in shares of Match Group common stock with a total value equal to the intrinsic value of the award at exercise, less applicable withholding taxes. The number of shares of Match Group common stock ultimately needed to settle these awards may vary significantly from the estimated number below as a result of movements in our stock price and/or a determination of fair value of the relevant subsidiary that differs from our estimate. The expense associated with these equity awards is initially measured at fair value at the grant date and is expensed as stock-based compensation over the vesting term. At December 31, 2024, the number of shares of Match Group common stock that would be required to settle these awards at estimated fair values, including vested and unvested awards, net of an assumed \n50\n% withholding tax, is \n2.9\n million shares. The withholding taxes, which would be paid by the Company on behalf of the employees at exercise or vesting, required to settle the vested and unvested awards at estimated fair values on December 31, 2024 is $\n95.3\n million assuming a \n50\n% withholding tax rate. The corresponding number of shares and withholding tax amount as of December 31, 2023 were \n0.9\n million shares and $\n34.6\n million.\nEmployee Stock Purchase Plan\n The Match Group, Inc. 2021 Global Employee Stock Purchase Plan (the \"ESPP\") was approved by the Company’s shareholders on June 15, 2021. Under the ESPP, eligible employees may purchase the Company’s \n92\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ncommon stock at a \n15\n% discount of the lower of the market price of our common stock on the date of commencement of the applicable offering period or on the last day of the applicable \nsix-month\n purchase period, subject to certain purchase limits.\nUnder the ESPP, employees purchased \n0.3\n million shares at a weighted average price per share of $\n26.38\n during the year ended December 31, 2024. At December 31, 2024, there were \n2.0\n million shares available for future issuance under the ESPP.\n \nAt December 31, 2024, there is $\n1.8\n million of unrecognized compensation cost, net of estimated forfeitures, related to the ESPP, which is expected to be recognized over a weighted average period of approximately \n0.7\n years.\nCapitalization of Stock-Based Compensation\nFor the years ended December 31, 2024, 2023 and 2022, $\n6.6\n million, $\n11.7\n million, and $\n10.6\n million, respectively, of stock-based compensation was capitalized related to the development of internal use software.\nModifications of awards\nDuring the years ended December 31, 2023 and 2022, the Company modified certain equity awards and recognized modification charges in continuing operations of $\n1.8\n million and $\n14.6\n million, respectively, impacting fewer than \n30\n employees in any given year.\nNOTE 12—SEGMENT AND GEOGRAPHIC INFORMATION\nDue to recent business developments in the third quarter of 2024 and continual assessment of the requirements under ASC 280, \nSegment Reporting\n, the Company reassessed its segment conclusions and determined that effective September 30, 2024, we are presenting \nfour\n operating and reportable segments.\nOur chief operating decision maker (“CODM”), who is our Chief Executive Officer, analyzes the results of our business through \nfour\n operating segments consisting of brands or groups of brands within our portfolio: Tinder, Hinge, Evergreen & Emerging, and MG Asia. These \nfour\n operating segments are also our reportable segments. Our CODM primarily evaluates the operating results and performance of our segments through revenue, operating income, and Adjusted Operating Income. These financial metrics are used to view operating trends, perform analytical comparisons, compare performance between periods, and evaluate variances to forecast on a monthly basis.\nAs a result of the change to our operating segments in the third quarter of 2024, we reassessed our reporting units and determined that the \nfour\n operating segments are also our reporting units for the purpose of evaluating goodwill for impairment. The Company re-allocated goodwill to each of the \nfour\n reporting units based on their relative fair values as of September 30, 2024. This change in reporting units is considered a triggering event that requires a goodwill impairment assessment to be performed immediately before and after the change. There was no goodwill impairment identified in either the before or after impairment tests. Goodwill was allocated to each of the \nfour\n reporting units as follows: Tinder, $\n1.5\n billion; Hinge, $\n0.5\n billion; Evergreen & Emerging, $\n0.2\n billion; and MG Asia, $\n0.1\n billion.\n93\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents revenue by segment, which includes revenue from customers in the form of direct revenue, indirect revenue, which is primarily advertising revenue, and intersegment revenue, which is eliminated in consolidated results:\nYears Ended December 31,\n2024\n2023\n2022\n(In thousands)\nRevenue:\nTinder\n$\n1,991,137\n \n$\n1,963,610\n \n$\n1,841,629\n \nHinge\n550,435\n \n396,485\n \n283,668\n \nEvergreen & Emerging\n654,168\n \n700,925\n \n741,256\n \nMG Asia\n284,522\n \n303,484\n \n322,290\n \nEliminations\n(\n889\n)\n—\n \n—\n \nTotal\n$\n3,479,373\n \n$\n3,364,504\n \n$\n3,188,843\n \nThe following tables present the segment profitability measures, operating income (loss) and Adjusted Operating Income, and a reconciliation of the total segment profitability measures to earnings before income taxes:\nYears Ended December 31,\n2024\n2023\n2022\n(In thousands)\nOperating income (loss):\nTinder\n$\n889,222\n \n$\n955,519\n \n$\n956,470\n \nHinge\n121,482\n \n74,261\n \n78,723\n \nEvergreen & Emerging\n66,088\n \n82,460\n \n35,879\n \nMG Asia\n(\n32,345\n)\n(\n8,675\n)\n(\n312,027\n)\nTotal segment operating income\n1,044,447\n \n1,103,565\n \n759,045\n \nCorporate and unallocated costs\n(a)\n(\n221,135\n)\n(\n186,669\n)\n(\n244,040\n)\nInterest expense\n(\n160,071\n)\n(\n159,887\n)\n(\n145,547\n)\nOther income, net\n40,815\n \n19,772\n \n8,033\n \nEarnings before income taxes\n$\n704,056\n \n$\n776,781\n \n$\n377,491\n \n______________________\n(a)\nIncludes stock-based compensation and depreciation.\n94\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYears Ended December 31,\n2024\n2023\n2022\n(In thousands)\nAdjusted Operating Income:\nTinder\n$\n1,017,023\n \n$\n1,049,360\n \n$\n1,027,883\n \nHinge\n166,478\n \n107,646\n \n91,148\n \nEvergreen & Emerging\n170,418\n \n163,796\n \n159,717\n \nMG Asia\n60,806\n \n61,790\n \n34,432\n \nTotal segment Adjusted Operating Income\n1,414,725\n \n1,382,592\n \n1,313,180\n \nCorporate and unallocated costs\n(\n162,358\n)\n(\n124,059\n)\n(\n184,444\n)\nStock-based compensation\n(\n267,381\n)\n(\n232,099\n)\n(\n203,880\n)\nDepreciation\n(\n87,499\n)\n(\n61,807\n)\n(\n43,594\n)\nImpairments and amortization of intangibles\n(\n74,175\n)\n(\n47,731\n)\n(\n366,257\n)\nInterest expense\n(\n160,071\n)\n(\n159,887\n)\n(\n145,547\n)\nOther income, net\n40,815\n \n19,772\n \n8,033\n \nEarnings before income taxes\n$\n704,056\n \n$\n776,781\n \n$\n377,491\n \nCorporate and unallocated costs includes 1) corporate expenses (such as executive management, investor relations, corporate development, and board of director and public company listing fees), 2) portions of corporate services (such as legal, human resources, accounting, and tax), and 3) certain centrally managed services and technology that have not been allocated to the individual business segments (such as central trust and safety operations and certain shared software).\nOur CODM does not review disaggregated assets on a segment basis; therefore, such information is not presented. Interest income and other income, net are not allocated to individual segments as these are managed on a consolidated basis. The accounting policies for segment reporting are the same as for our consolidated financial statements.\nThe following tables present the significant segment expenses regularly reviewed by our CODM:\nYear Ended December 31, 2024\nTinder\nHinge\nEvergreen & Emerging\nMG Asia\n(In thousands)\nIn-app purchase fees\n$\n414,908\n \n$\n151,467\n \n$\n70,735\n \n$\n63,292\n \nCost of acquisition\n183,220\n \n98,808\n \n195,738\n \n73,407\n \nVariable expense\n122,053\n \n17,100\n \n41,592\n \n28,321\n \nEmployee compensation expense, excluding stock-based compensation expense\n197,157\n \n95,445\n \n131,039\n \n40,632\n \nOther operating expenses\n(a)\n56,776\n \n21,137\n \n44,646\n \n18,064\n \nStock-based compensation\n(b)\n90,141\n \n42,673\n \n54,922\n \n25,818\n \nDepreciation\n(b)\n37,660\n \n2,323\n \n21,732\n \n20,834\n \nImpairment and amortization of intangible assets\n(b)\n—\n \n—\n \n27,676\n \n46,499\n \n95\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYear Ended December 31, 2023\nTinder\nHinge\nEvergreen & Emerging\nMG Asia\n(In thousands)\nIn-app purchase fees\n$\n417,571\n \n$\n110,093\n \n$\n70,012\n \n$\n70,251\n \nCost of acquisition\n167,566\n \n67,758\n \n202,831\n \n77,456\n \nVariable expense\n119,333\n \n15,004\n \n63,779\n \n29,296\n \nEmployee compensation expense, excluding stock-based compensation expense\n167,019\n \n79,084\n \n148,285\n \n42,338\n \nOther operating expenses\n(a)\n42,761\n \n16,900\n \n52,222\n \n22,353\n \nStock-based compensation\n(b)\n68,644\n \n31,459\n \n50,268\n \n23,399\n \nDepreciation\n(b)\n25,197\n \n1,926\n \n18,732\n \n11,671\n \nImpairment and amortization of intangible assets\n(b)\n—\n \n—\n \n12,336\n \n35,395\n \nYear Ended December 31, 2022\nTinder\nHinge\nEvergreen & Emerging\nMG Asia\n(In thousands)\nIn-app purchase fees\n$\n384,995\n \n$\n79,098\n \n$\n64,044\n \n$\n73,154\n \nCost of acquisition\n110,625\n \n37,147\n \n234,872\n \n91,607\n \nVariable expense\n110,106\n \n10,613\n \n71,205\n \n50,873\n \nEmployee compensation expense, excluding stock-based compensation expense\n160,816\n \n51,645\n \n155,347\n \n43,410\n \nOther operating expenses\n(a)\n47,204\n \n14,017\n \n56,071\n \n28,814\n \nStock-based compensation\n(b)\n56,085\n \n10,794\n \n52,498\n \n28,294\n \nDepreciation\n(b)\n15,328\n \n1,631\n \n17,971\n \n5,277\n \nImpairment and amortization of intangible assets\n(b)\n—\n \n—\n \n53,369\n \n312,888\n \n______________________\n(a)\nOther operating expenses primarily consists of office rent, business software, travel, indirect taxes, and professional fees.\n(b)\nExpense is a non-cash item and excluded from the profitability measure of Adjusted Operating Income (Loss).\n96\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nGeographic Information\nRevenue by geography is based on where the customer is located. The United States is the only country from which revenue is greater than 10 percent of total revenue. Geographic information about revenue and long-lived assets is presented below:\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nRevenue\n \n \nUnited States\n$\n1,593,611\n \n$\n1,541,012\n \n$\n1,450,702\n \nAll other countries\n1,885,762\n \n1,823,492\n \n1,738,141\n \nTotal\n$\n3,479,373\n \n$\n3,364,504\n \n$\n3,188,843\n \n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nLong-lived assets (excluding goodwill and intangible assets)\n \n \nUnited States\n$\n119,638\n \n$\n143,502\n \nSouth Korea\n16,608\n \n23,708\n \nAll other countries\n21,943\n \n27,315\n \nTotal\n$\n158,189\n \n$\n194,525\n \nNOTE 13—LEASES\nThe Company leases office space, data center facilities, and equipment used in connection with its operations under various operating leases, many of which contain escalation clauses.\nROU assets represent the Company’s right to use the underlying assets for the lease term and lease liabilities represent the present value of the Company’s obligation to make payments arising from leases. ROU assets and related lease liabilities are based on the present value of fixed lease payments over the lease term using the Company’s incremental borrowing rates on the lease commencement date or January 1, 2019 for leases that commenced prior to that date. The Company combines the lease and non-lease components of lease payments in determining ROU assets and related lease liabilities. If the lease includes one or more options to extend the term of the lease, the renewal option is considered in the lease term if it is reasonably certain the Company will exercise the options. Lease expense is recognized on a straight-line basis over the term of the lease. Leases with an initial term of twelve months or less (“short-term leases”) are not recorded on the accompanying consolidated balance sheet.\n97\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nVariable lease payments consist primarily of common area maintenance, utilities, and taxes, which are not included in the recognition of ROU assets and related lease liabilities. The Company’s lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nLeases\nBalance Sheet Classification\nDecember 31, 2024\nDecember 31, 2023\n(In thousands)\nAssets:\nRight-of-use assets\nOther non-current assets\n$\n86,417\n \n$\n95,660\n \nLiabilities:\nCurrent lease liabilities\nAccrued expenses and other current liabilities\n$\n19,213\n \n$\n16,389\n \nLong-term lease liabilities\nOther long-term liabilities\n84,583\n \n98,475\n \nTotal lease liabilities\n$\n103,796\n \n$\n114,864\n \nLease Cost\nIncome Statement Classification\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(In thousands)\nFixed lease cost\nCost of revenue\n$\n1,875\n \n$\n1,567\n \nFixed lease cost\nGeneral and administrative expense\n22,032\n \n20,960\n \nTotal fixed lease cost\n(a)\n23,907\n \n22,527\n \nVariable lease cost\nCost of revenue\n441\n \n880\n \nVariable lease cost\nGeneral and administrative expense\n3,368\n \n3,175\n \nTotal variable lease cost\n3,809\n \n4,055\n \nNet lease cost\n$\n27,716\n \n$\n26,582\n \n______________________\n(a)\nIncludes approximately $\n0.6\n million and $\n1.5\n million of short-term lease cost for the years ended December 31, 2024 and December 31, 2023, respectively.\nMaturities of lease liabilities as of December 31, 2024\n(a)\n:\n(In thousands)\n2025\n$\n22,709\n \n2026\n19,423\n \n2027\n13,655\n \n2028\n12,799\n \n2029\n12,427\n \nAfter 2029\n38,594\n \nTotal\n119,607\n \nLess: Interest\n(\n15,811\n)\nPresent value of lease liabilities\n$\n103,796\n \n______________________\n(a)\nOperating lease payments exclude $\n28.1\n million of legally binding minimum lease payments for leases signed but not yet commenced.\n98\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following are the weighted average assumptions used for lease term and discount rate:\nDecember 31, 2024\nDecember 31, 2023\nRemaining lease term\n7.2\n years\n8.1\n years\nDiscount rate\n3.86\n \n%\n3.76\n \n%\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(In thousands)\nOther information:\nRight-of-use assets obtained in exchange for lease liabilities\n$\n11,420\n \n$\n19,258\n \nCash paid for amounts included in the measurement of lease liabilities\n$\n26,082\n \n$\n21,188\n \nNOTE 14—COMMITMENTS AND CONTINGENCIES\nCommitments\nThe Company has funding commitments in the form of purchase obligations and surety bonds. The purchase obligations are $\n68.6\n million for 2025, $\n8.7\n million for 2026, $\n9.8\n million for 2027, and $\n9.0\n million for 2028, for a total of $\n96.1\n million in purchase obligations. The purchase obligations primarily relate to web hosting service commitments.\nContingencies\nIn the ordinary course of business, the Company is a party to various lawsuits. The Company establishes reserves for specific legal matters when it determines that the likelihood of an unfavorable outcome is probable and the loss is reasonably estimable. Management has also identified certain other legal matters where we believe an unfavorable outcome is not probable and, therefore, \nno\n reserve is established. Although management currently believes that resolving claims against us, including claims where an unfavorable outcome is reasonably possible, will not have a material impact on the liquidity, results of operations, or financial condition of the Company, these matters are subject to inherent uncertainties and management’s view of these matters may change in the future. The Company also evaluates other contingent matters, including income and non-income tax contingencies, to assess the likelihood of an unfavorable outcome and estimated extent of potential loss. It is possible that an unfavorable outcome of \none\n or more of these lawsuits or other contingencies could have a material impact on the liquidity, results of operations, or financial condition of the Company. See “Note 3—Income Taxes” for additional information related to income tax contingencies.\nPursuant to the Transaction Agreement entered into in connection with the Separation, we have agreed to indemnify IAC for matters relating to any business of Former Match Group, including indemnifying IAC for costs related to the matters described below.\nThe official names of legal proceedings in the descriptions below (shown in italics) reflect the original names of the parties when the proceedings were filed as opposed to the current names of the parties following the separation of Match Group and IAC.\nFTC Lawsuit Against Former Match Group\nOn September 25, 2019, the United States Federal Trade Commission (the “FTC”) filed a lawsuit in federal district court in Texas against the company formerly known as Match Group, Inc. See \nFTC v. Match Group, Inc.\n, No. 3:19:cv-02281-K (Northern District of Texas). The complaint alleges that, prior to mid-2018, for marketing purposes Match.com notified non-paying users that other users were attempting to communicate with them, even though Match.com had identified those subscriber accounts as potentially fraudulent, thereby inducing non-paying users to subscribe and exposing them to the risk of fraud should they subscribe. The complaint also challenges the adequacy of Match.com’s disclosure of the terms of its \nsix-month\n guarantee, the efficacy of its cancellation process, and its handling of chargeback disputes. The complaint seeks among other things permanent injunctive relief, civil penalties, restitution, disgorgement, and costs of suit. On March 24, 2022, the court granted our motion to dismiss with prejudice on Claims I and II of the complaint relating to communication \n99\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nnotifications and granted our motion to dismiss with respect to all requests for monetary damages on Claims III and IV relating to the guarantee offer and chargeback policy. On July 19, 2022, the FTC filed an amended complaint adding Match Group, LLC as a defendant. On September 11, 2023, both parties filed motions for summary judgment. The case is set for trial in June 2025. Our consolidated financial statements do not reflect any provision for a loss with respect to this matter, as we do not believe there is a probable likelihood of an unfavorable outcome. Further, we do not believe that there is a reasonable possibility of an exposure to loss that would be material to our business. We believe we have strong defenses to the FTC’s claims regarding Match.com’s practices, policies, and procedures and will continue to defend vigorously against them.\nIrish Data Protection Commission Inquiry Regarding Tinder’s Practices\nOn February 3, 2020, we received a letter from the Irish Data Protection Commission (the “DPC”) notifying us that the DPC had commenced an inquiry examining Tinder’s compliance with the EU’s General Data Protection Regulation (“GDPR”), focusing on Tinder’s processes for handling access and deletion requests and Tinder’s user data retention policies. On January 8, 2024, the DPC provided us with a preliminary draft decision alleging that certain of Tinder’s access and retention policies, largely relating to protecting the safety and privacy of Tinder’s users, violate GDPR requirements. We filed our response to the preliminary draft decision on March 15, 2024. Our consolidated financial statements do not reflect any provision for a loss with respect to this matter, as we do not believe there is a probable likelihood of an unfavorable outcome. However, based on the preliminary draft decision and giving due consideration to the uncertainties inherent in this process, there is at least a reasonable possibility of an exposure to loss, which could be anywhere between a \nno\nminal amount and $\n60\n million, which we do not believe would be material to our business. We believe we have strong defenses to these claims and will defend vigorously against them.\nConsumer Class Action Litigation Challenging Tinder’s Age-Tiered Pricing\nOn May 28, 2015, a putative state-wide class action was filed against Tinder in state court in California. See \nAllan Candelore v. Tinder, Inc.\n, No. BC583162 (Superior Court of California, County of Los Angeles). The complaint principally alleges that Tinder violated California’s Unruh Civil Rights Act by offering and charging users over a certain age a higher price than younger users for subscriptions to its premium Tinder Plus service. Plaintiff seeks damages in an unspecified amount. On July 15, 2024, the court granted Plaintiff’s motion to certify a class of approximately \n270,000\n individuals based upon California Tinder Plus and Tinder Gold subscribers age 29 and over. On January 17, 2025, the court denied our motion to compel the class and the Plaintiff to arbitration. We filed a Notice of Appeal on January 24, 2025. Our consolidated financial statements do not reflect any provision for a loss with respect to this matter. While there is at least a reasonable possibility of an exposure to loss, the amount is difficult to predict. If the court were to order restitution to all members of the class, we estimate the amount would be approximately $\n14\n million, which we do not believe would be material to our business. California’s Unruh Civil Rights Act provides for statutory damages of the higher of three times the amount of actual damages or $4,000. Plaintiff has argued that the $4,000 in statutory damages should be incurred for each time a class member was charged a higher price; however we contend that an exposure to that amount would not be permitted for various reasons, including the Due Process Clause of the U.S. Constitution. We believe that we have strong defenses and will continue to defend vigorously against the lawsuit.\nNOTE 15—BENEFIT PLANS\nPursuant to the Match Group Retirement Savings Plan (the “Match Group Plan”), employees are eligible to participate in a retirement savings plan sponsored by the Company in the United States, which is qualified under Section 401(k) of the Internal Revenue Code. Participating employees may contribute up to \n75\n% of their pre-tax earnings, but not more than statutory limits. The employer match under the Match Group Plan is \n100\n% of the first \n10\n% of a participant’s eligible earnings up to $\n10,000\n, subject to IRS limits on the Company’s matching contribution that a participant contributes to the Match Group Plan.\nMatching contributions under the plans for the years ended December 31, 2024, 2023, and 2022 were $\n14.5\n million, $\n14.0\n million and $\n13.5\n million, respectively.\nMatching contributions are invested in the same manner that each participant’s voluntary contributions are invested under the respective plans.\n100\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nInternationally, Match Group also has or participates in various benefit plans, primarily defined contribution plans. The Company’s contributions for these plans for the years ended December 31, 2024, 2023 and 2022 were $\n5.2\n million, $\n6.4\n million, and $\n6.2\n million, respectively.\nNOTE 16—CONSOLIDATED FINANCIAL STATEMENT DETAILS\n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nOther current assets:\nPrepaid expenses\n$\n40,936\n \n$\n46,433\n \nCapitalized mobile app fees\n28,629\n \n33,122\n \nOther\n32,507\n \n24,468\n \nOther current assets\n$\n102,072\n \n$\n104,023\n \n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nProperty and equipment, net:\nComputer equipment and capitalized software\n$\n294,359\n \n$\n275,398\n \nBuildings and building improvements\n68,493\n \n67,019\n \nLeasehold improvements\n60,536\n \n53,163\n \nLand\n11,565\n \n11,565\n \nFurniture and other equipment\n17,060\n \n17,148\n \nProjects in progress\n13,354\n \n19,455\n \n465,367\n \n443,748\n \nAccumulated depreciation and amortization\n(\n307,178\n)\n(\n249,223\n)\nProperty and equipment, net\n$\n158,189\n \n$\n194,525\n \n \nDecember 31,\n \n2024\n2023\n \n(In thousands)\nAccrued expenses and other current liabilities:\nAccrued employee compensation and benefits\n$\n112,802\n \n$\n103,336\n \nAccrued advertising expense\n50,284\n \n59,639\n \nAccrued non-income taxes\n41,133\n \n34,216\n \nAccrued interest expense\n29,899\n \n30,184\n \nDividend payable\n47,776\n \n—\n \nOther\n83,163\n \n79,924\n \nAccrued expenses and other current liabilities\n$\n365,057\n \n$\n307,299\n \n101\nTable of Contents\nMATCH GROUP, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYears Ended December 31,\n2024\n2023\n2022\n(In thousands)\nOther income, net:\nInterest income\n$\n41,105\n \n$\n26,772\n \n$\n4,368\n \nForeign currency losses\n(\n579\n)\n(\n7,919\n)\n(\n1,972\n)\nOther\n289\n \n919\n \n5,637\n \nOther income, net\n$\n40,815\n \n$\n19,772\n \n$\n8,033\n \nCash and Cash Equivalents and Restricted Cash\nThe following table provides a reconciliation of cash and cash equivalents and restricted cash reported within the consolidated balance sheet to the total amounts shown in the consolidated statement of cash flows:\nDecember 31,\n2024\n2023\n2022\n2021\n(In thousands)\nCash and cash equivalents\n$\n965,993\n \n$\n862,440\n \n$\n572,395\n \n$\n815,384\n \nRestricted cash included in other current assets\n—\n \n—\n \n121\n \n128\n \nTotal cash, cash equivalents, and restricted cash as shown on the consolidated statement of cash flow\n$\n965,993\n \n$\n862,440\n \n$\n572,516\n \n$\n815,512\n \nSupplemental Disclosures of Cash Flow Information\n \nYears Ended December 31,\n \n2024\n2023\n2022\n \n(In thousands)\nCash paid (received) during the year for:\n \n \nInterest\n$\n152,890\n \n$\n152,481\n \n$\n138,045\n \nIncome tax payments\n$\n149,236\n \n$\n110,428\n \n$\n60,026\n \nIncome tax refunds\n$\n(\n3,754\n)\n$\n(\n8,394\n)\n$\n(\n13,658\n)\nNOTE 17—SUBSEQUENT EVENT\nOn January 21, 2025, the Company repaid the $\n425\n million outstanding balance on the Term Loan utilizing cash on hand.\n102\nTable of Contents\nItem 9.    Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.\nItem 9A.    Controls and Procedures\nConclusion Regarding the Effectiveness of the Company’s Disclosure Controls and Procedures\nThe Company monitors and evaluates on an ongoing basis its disclosure controls and procedures in order to improve their overall effectiveness. In the course of these evaluations, the Company modifies and refines its internal processes as conditions warrant.\nAs required by Rule 13a-15(b) of the Exchange Act, Match Group management, including the Chief Executive Officer (“CEO”) and the Chief Financial Officer (“CFO”), conducted an evaluation, as of the end of the period covered by this report, of the effectiveness of the Company’s disclosure controls and procedures as defined in Exchange Act Rule 13a-15(e). Based on this evaluation, the CEO and the CFO concluded that the Company’s disclosure controls and procedures were effective as of the end of the period covered by this report.\nManagement’s Report on Internal Control Over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) for the Company. The Company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States. Management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In making this assessment, our management used the criteria for effective internal control over financial reporting described in “Internal Control—Integrated Framework” issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on this assessment, management has determined that, as of December 31, 2024, the Company’s internal control over financial reporting is effective. The effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their attestation report, included herein.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control Over Financial Reporting\nThe Company monitors and evaluates on an ongoing basis its internal control over financial reporting in order to improve its overall effectiveness. In the course of these evaluations, the Company modifies and refines its internal processes as conditions warrant. As required by Rule 13a-15(d), Match Group management, including the CEO and the CFO, also conducted an evaluation of the Company’s internal control over financial reporting to determine whether any changes occurred during the quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting. Based on that evaluation, there has been no such change during the quarter ended December 31, 2024.\n103\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Match Group, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Match Group, Inc. and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Match Group, Inc. and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive operations, shareholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a), and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nNew York, New York\nFebruary 27, 2025\n104\nTable of Contents\nItem 9B.    Other Information\nInsider Trading Arrangements\nDuring the three months ended December 31, 2024, no director or officer (as defined in Rule 16a-1(f) under the Securities Exchange Act of 1934, as amended) of the Company \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408(a) of Regulation S-K.\nItem 9C.    Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n105\nTable of Contents\nPART III\nThe information required by Part III (Items 10, 11, 12, 13 and 14) has been incorporated by reference to Match Group’s definitive Proxy Statement to be used in connection with its 2025 Annual Meeting of Stockholders (the “2025 Proxy Statement”), as set forth below in accordance with General Instruction G(3) of Form 10-K.\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information required by Item 401 of Regulation S-K relating to directors and executive officers of Match Group is set forth in the sections entitled “Information Concerning Director Nominees and Other Board Members” and “Information Concerning Match Group Executive Officers Who Are Not Directors,” respectively, in the 2025 Proxy Statement. The information required by Item 406 of Regulation S-K relating to Match Group’s Code of Ethics is set forth under the caption “Item 1—Business–Additional information—Code of ethics” of this annual report and is incorporated herein by reference. The information required by subsections (c)(3), (d)(4) and (d)(5) of Item 407 of Regulation S-K is set forth in the sections entitled “Corporate Governance” and “The Board and Board Committees” in the 2025 Proxy Statement and is incorporated herein by reference.\nThe Company has insider trading policies and procedures that govern the purchase, sale and other dispositions of its securities by directors, officers, employees, contractors and the Company. We believe these policies and procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations and applicable listing standards. A copy of our insider trading policies and procedures are filed with this Annual Report on Form 10-K as Exhibits 19.1 and 19.2.\nItem 11. Executive Compensation\nThe information required by Item 402 of Regulation S-K relating to executive and director compensation is set forth in the sections entitled “Executive Compensation” and “Director Compensation” in the 2025 Proxy Statement and is incorporated herein by reference. The information required by subsections (e)(4) and (e)(5) of Item 407 of Regulation S-K relating to certain compensation committee matters is set forth in the sections entitled “The Board and Board Committees,” “Compensation Committee Report” and “Compensation Committee Interlocks and Insider Participation” in the 2025 Proxy Statement and is incorporated herein by reference; provided, that the information set forth in the section entitled “Compensation Committee Report” shall be deemed furnished herein and shall not be deemed incorporated by reference into any filing under the Securities Act or the Exchange Act.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information regarding ownership of Match Group common stock required by Item 403 of Regulation S-K and securities authorized for issuance under Match Group’s various equity compensation plans required by"
  }
}