{
  "ticker": "MU",
  "cik": "0000723125",
  "company_name": "MICRON TECHNOLOGY INC",
  "filing_date": "2025-10-03",
  "accession": "0000723125-25-000028",
  "primary_doc": "mu-20250828.htm",
  "item_sections": {
    "item1": "Item 1. Business, Overview.\nIndustry Conditions\nAI-driven demand is accelerating and is outpacing industry supply. In 2025, we benefited from substantial improvements in DRAM pricing, volumes and margins as compared to 2024, reflecting strong demand growth, driven in part by the continued advancement of AI. During 2025, we shifted a portion of our DRAM supply to the data center and hyperscale cloud markets to meet the strong demand fueled by AI, with emphasis on HBM products, resulting in a revenue mix weighted more prominently toward segments experiencing higher growth. The pivot to higher-growth segments, together with our strong execution, robust overall industry DRAM demand, and constrained supply, has led to improved profitability across our DRAM portfolio. In 2025, NAND revenue increased from 2024 on higher bit shipments due to demand growth. The 2025 NAND gross margin percentage increased from 2024 due to cost reductions. We continue to prudently manage our NAND business to ensure we align our supply growth and technology node cadence with our projections of the demand environment.\nThroughout 2024, we experienced substantial improvements in pricing and margins due to improving market conditions as compared to 2023. Increasing demand growth, driven in part by deployment of AI and mostly normal customer inventories, combined with industry-wide supply discipline, resulted in an industry supply and demand balance that substantially improved from downturn conditions in memory and storage markets during 2023. In connection with improved market conditions in 2024, we reinstated our bonuses and phased out certain other temporary cost-saving measures that were implemented in 2023. \nIn 2023, China’s Cyberspace Administration (the “CAC”) conducted a cybersecurity review of our products sold in China and decided that our products presented a cybersecurity risk. The CAC determined that critical information infrastructure operators in China may not purchase Micron products. The CAC decision has impacted our business, particularly in the domestic data center and networking markets in China, and we have been working to mitigate that impact.\n51 |\n \n2025 10-K\nTable of Contents\nResults of Operations\nConsolidated Results\nFor the year ended\n2025\n2024\n2023\nRevenue\n$\n37,378 \n100 \n%\n$\n25,111 \n100 \n%\n$\n15,540 \n100 \n%\nCost of goods sold\n22,505 \n60 \n%\n19,498 \n78 \n%\n16,956 \n109 \n%\nGross margin\n14,873 \n40 \n%\n5,613 \n22 \n%\n(1,416)\n(9)\n%\nResearch and development\n3,798 \n10 \n%\n3,430 \n14 \n%\n3,114 \n20 \n%\nSelling, general, and administrative\n1,205 \n3 \n%\n1,129 \n4 \n%\n920 \n6 \n%\nRestructure and asset impairments\n39 \n— \n%\n1 \n— \n%\n171 \n1 \n%\nOther operating (income) expense, net\n61 \n— \n%\n(251)\n(1)\n%\n124 \n1 \n%\nOperating income (loss)\n9,770 \n26 \n%\n1,304 \n5 \n%\n(5,745)\n(37)\n%\nInterest income (expense), net\n19 \n— \n%\n(33)\n— \n%\n80 \n1 \n%\nOther non-operating income (expense), net\n(135)\n— \n%\n(31)\n— \n%\n7 \n— \n%\nIncome tax (provision) benefit\n(1,124)\n(3)\n%\n(451)\n(2)\n%\n(177)\n(1)\n%\nEquity in net income (loss) of equity method investees\n9 \n— \n%\n(11)\n— \n%\n2 \n— \n%\nNet income (loss)\n$\n8,539 \n23 \n%\n$\n778 \n3 \n%\n$\n(5,833)\n(38)\n%\nTotal Revenue:\n Total revenue was impacted by the factors described in the section titled “Industry Conditions” above. These conditions drove substantial improvements in average selling prices throughout 2025 and 2024.\nTotal revenue for 2025 increased 49% as compared to 2024 primarily due to increases in sales of both DRAM and NAND products.\n•\nSales of DRAM products increased 62% primarily due to a low-40% range increase in average selling prices and a mid-teen percentage increase in bit shipments.\n•\nSales of NAND products increased 18% primarily due to a high-teen percentage increase in bit shipments.\nTotal revenue for 2024 increased 62% as compared to 2023 primarily due to increases in sales of both DRAM and NAND products.\n•\nSales of DRAM products increased 60% primarily due to a mid-40% range increase in bit shipments and a low-teen percentage range increase in average selling prices.\n•\nSales of NAND products increased 72% primarily due to a low-30% range increase in bit shipments and a low-30% percentage range increase in average selling prices.\nConsolidated Gross Margin: \nOur consolidated gross margin has been impacted by the factors described in the section titled “Industry Conditions” above and the effects of 2023 inventory write-downs on our 2024 and 2023 gross margin, as detailed in the table below. Our consolidated gross margin percentage improved to 40% for 2025 from 22% for 2024 as a result of improvements in margins for both DRAM and NAND products. DRAM margins improved primarily due to increases in average selling prices, an increased mix of higher-margin products, including HBM, and manufacturing cost reductions driven by improvements in product and process technology. NAND margins improved primarily due to manufacturing cost reductions. Our consolidated gross margin for 2024 reflected $987 million of benefit due to lower costs from the sale of inventories written down to their net realizable value in 2023 (as detailed in “Inventory NRV Write-Downs” below).\nOur consolidated gross margin percentage improved to 22% for 2024 from negative 9% for 2023 as a result of improvements in margins for both DRAM and NAND products, primarily due to increases in average selling prices, manufacturing cost reductions, the effects of charges to write down inventories to their NRV in 2023, and lower costs in 2024 from the sale of inventories written down in 2023 (as detailed in “Inventory NRV Write-Downs” below).\n \n52\nTable of Contents\nInventory NRV Write-Downs\n: \nOur consolidated gross margin was impacted by charges in 2023 to write down inventories to their estimated NRV as a result of declines in average selling prices for both DRAM and NAND. As charges to write down inventories are recorded in advance of when inventories are sold, costs of goods sold in subsequent periods were lower than they otherwise would be. The impact of inventory NRV write-downs for each period reflects (1) inventory write-downs in that period, offset by (2) lower costs in that period on the sale of inventory written down in prior periods. The impacts of inventory NRV write-downs are summarized below:\nFor the year ended\n2025\n2024\n2023\nProvision to write down inventory to NRV\n$\n— \n$\n— \n$\n(1,831)\nLower costs from sale of inventory written down in prior periods\n— \n987 \n844 \n$\n— \n$\n987 \n$\n(987)\nRevenue by Business Unit\nFor the year ended\n2025\n2024\n2023\nCMBU\n$\n13,524 \n36 \n%\n$\n3,792 \n15 \n%\n$\n1,872 \n12 \n%\nCDBU\n7,229 \n19 \n%\n4,984 \n20 \n%\n2,124 \n14 \n%\nMCBU\n11,859 \n32 \n%\n11,667 \n46 \n%\n7,394 \n48 \n%\nAEBU\n4,753 \n13 \n%\n4,631 \n18 \n%\n4,139 \n27 \n%\nAll other\n13 \n— \n%\n37 \n— \n%\n11 \n— \n%\n \n$\n37,378 \n$\n25,111 \n$\n15,540 \nPercentages of total revenue may not total 100% due to rounding.\nChanges in revenue for each business unit for 2025 as compared to 2024 were as follows:\n•\nCMBU revenue increased 257% primarily due to increases in DRAM bit shipments and average selling prices driven by accelerating AI demand in cloud server markets for HBM, high-capacity dual in-line memory modules (“DIMMS”), and low-power server DRAM. During 2025, CMBU revenue benefited from a shift of our DRAM supply to meet the strong demand in high-value data center markets.\n•\nCDBU revenue increased 45% primarily due to increases in average selling prices for both data center DRAM and NAND and NAND bit shipments due to increased demand for data center SSDs.\n•\nMCBU revenue increased 2% primarily due to increases in DRAM and NAND revenue. Increases in MCBU DRAM sales due to higher average selling prices were partially offset by decreases in bit shipments as MCBU product supply was constrained to meet demand from higher-value segments. Increases in NAND sales due to higher bit shipments were partially offset by decreases in NAND average selling prices.\n•\nAEBU revenue increased 3% primarily due to increases in DRAM and NAND bit shipments, partially offset by declines in average selling prices for both DRAM and NAND as a result of pricing pressure for certain legacy products.\nChanges in revenue for each business unit for 2024 as compared to 2023 were as follows:\n•\nCMBU revenue increased 103% driven by increases in DRAM bit shipments and average selling prices.\n•\nCDBU revenue increased 135% primarily due to increases in NAND and DRAM bit shipments and average selling prices.\n•\nMCBU revenue increased 58% primarily due to increases in DRAM and NAND bit shipments and average selling prices for both mobile and client markets.\n•\nAEBU revenue increased 12% primarily due to increases in DRAM bit shipments, partially offset by declines in average selling prices.\n53 |\n \n2025 10-K\nTable of Contents\nOperating Income (Loss) by Business Unit\nFor the year ended\n2025\n2024\n2023\nCMBU\n$\n6,129 \n45 \n%\n$\n244 \n6 \n%\n$\n(768)\n(41)\n%\nCDBU\n2,180 \n30 \n%\n255 \n5 \n%\n(563)\n(27)\n%\nMCBU\n1,981 \n17 \n%\n(1)\n— \n%\n(3,189)\n(43)\n%\nAEBU\n557 \n12 \n%\n432 \n9 \n%\n680 \n16 \n%\nAll other\n(1)\n(8)\n%\n18 \n49 \n%\n8 \n73 \n%\n \n$\n10,846 \n$\n948 \n$\n(3,832)\nPercentages reflect operating income (loss) as a percentage of revenue for each business unit.\nChanges in operating income or loss for each business unit for 2025 as compared to 2024 were as follows:\n•\nCMBU operating income increased primarily due to higher bit shipments and increases in average selling prices driven by robust AI demand in cloud server markets, particularly for HBM, DIMMs, and low-power server DRAM products. CMBU operating income benefited from a shift of our DRAM supply to meet the strong demand in high-value data center markets. These improvements were partially offset by higher R&D expenses.\n•\nCDBU operating income increased primarily due to increases in data center average selling prices, higher bit shipments, and manufacturing cost reductions.\n•\nMCBU operating income (loss) improved primarily due to increases in DRAM average selling prices, manufacturing cost reductions, and higher NAND bit shipments, partially offset by decreases in NAND average selling prices. MCBU operating income (loss) was also adversely impacted by decreases in DRAM bit shipments as MCBU product supply was constrained to meet demand from higher-value segments.\n•\nAEBU operating income increased primarily due to manufacturing cost reductions and higher bit shipments, partially offset by declines in average selling prices.\nChanges in operating income or loss for each business unit for 2024 as compared to 2023 were as follows:\n•\nCMBU operating income (loss) improved primarily due to higher bit shipments, increases in average selling prices, and manufacturing cost reductions.\n•\nCDBU operating income (loss) improved primarily due to higher NAND and DRAM bit shipments, increases in average selling prices, and manufacturing cost reductions, partially offset by higher R&D expenses.\n•\nMCBU operating income (loss) improved primarily due to increases in average selling prices, higher bit shipments, and manufacturing cost reductions.\n•\nAEBU operating income decreased primarily due to declines in average selling prices, partially offset by manufacturing cost reductions and higher bit shipments.\nOperating Expenses and Other\nResearch and Development: \nR&D expenses vary primarily with the number of development and pre-qualification wafers processed and end-product solutions developed, personnel costs, and the cost of advanced equipment dedicated to new product and process development. Because of the lead times necessary to manufacture our products, we typically begin to process wafers before completion of performance and reliability testing. Development of a product is deemed complete when it is qualified through internal reviews and tests for performance, functionality, and reliability. R&D expenses can vary significantly depending on the timing of product qualification and product specifications. \nR&D expenses for 2025 increased 11% as compared to 2024 primarily due to increases in employee compensation, depreciation expense, and higher volumes of development and pre-qualification wafers. R&D expenses for 2024 increased 10% as compared to 2023 primarily due to an increase in employee compensation and higher volumes of development and pre-qualification wafers, partially offset by an increase in government incentives.\nSelling, General, and Administrative: \nSG&A expenses for 2025 increased 7% as compared to 2024 primarily due to an increase in employee compensation and professional services. SG&A expenses for 2024 increased 23% as compared to 2023 primarily due to an increase in employee compensation. \n \n54\nTable of Contents\nInterest Income (Expense), Net:\n \nInterest income (expense) improved in 2025 as compared to 2024 primarily due to decreases in interest expense as a result of increased capitalized interest driven by higher levels of building construction, partially offset by decreases in interest income due to lower interest rates on our cash and investments. Interest income (expense) deteriorated for 2024 as compared to 2023 primarily due to increases in interest expense as a result of higher interest rates on our debt, partially offset by increases in interest income due to higher interest rates on our cash and investments.\nIncome Taxes: \nOur income tax (provision) benefit consisted of the following:\nFor the year ended\n2025\n2024\n2023\nIncome (loss) before taxes\n$\n9,654 \n$\n1,240 \n$\n(5,658)\nIncome tax (provision) benefit\n(1,124)\n(451)\n(177)\nEffective tax rate\n11.6 \n%\n36.4 \n%\n(3.1)\n%\nThe change in our effective tax rate for 2025 as compared to 2024, and for 2024 as compared to 2023, were primarily due to changes in profitability. Despite a consolidated pre-tax loss on a worldwide basis in 2023, we had taxes payable in certain geographies due to minimum taxable income reportable in those geographies. \nWe operate in a number of jurisdictions outside the United States, including Singapore, where we have tax incentive arrangements. These incentives expire, in whole or in part, at various dates through 2034 and are conditional, in part, upon meeting certain business operations and employment thresholds. The effect of tax incentive arrangements reduced our tax provision by $1.05 billion (benefiting our diluted earnings per share by $0.93) for 2025. As a result of the low level of profitability and the jurisdictional mix of income, the benefit from tax incentive arrangements was not material for 2024 or 2023.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted, introducing broad changes to the U.S. tax code, including modifications to corporate and international tax provisions, which primarily are effective for us beginning in 2026 and 2027. The aggregate impact of the OBBBA remains uncertain. We will continue to monitor future developments, including regulatory guidance and interpretations, which could have a material impact. Further changes in the tax laws of foreign jurisdictions could arise as a result of the base erosion and profit-shifting project, including Pillar Two Model Rules (“Pillar Two”), undertaken by the Organisation for Economic Co-operation and Development. On November 27, 2024, Singapore enacted legislation to implement Pillar Two, which will apply to us starting in 2026. We continue to monitor for additional guidance and legislative changes related to Pillar Two in the jurisdictions where we operate.\nVarious tax reforms are being considered in multiple jurisdictions that, if enacted, contain provisions that could materially impact our tax expense. We continue to monitor the potential impact of these various tax reform proposals to our overall global effective tax rate and financial statements.\nOther:\n \nFurther information can be found in the following notes contained in Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements:\n•\nNote 12. Debt\n•\nNote 18. Equity Compensation Plans\n•\nNote 22. Restructure and Asset Impairments\n•\nNote 23. Other Operating (Income) Expense, Net \n•\nNote 24. Other Non-Operating Income (Expense), Net\n•\nNote 25. Income Taxes\n55 |\n \n2025 10-K\nTable of Contents\nLiquidity and Capital Resources\nOur primary sources of liquidity are cash generated from operations and financing obtained from capital markets and financial institutions. Cash generated from operations is highly dependent on selling prices for our products, which can vary significantly from period to period. Cash and marketable investments totaled $11.94 billion as of August 28, 2025, and $9.15 billion as of August 29, 2024. Our cash and investments consist primarily of bank deposits, money market funds, and liquid investment-grade, fixed-income securities, which are diversified among industries and individual issuers. To mitigate credit risk, we invest through high-credit-quality financial institutions and by policy generally limit the concentration of credit exposure by restricting the amount of investments with any single obligor. As of August 28, 2025, $5.20 billion of our cash and marketable investments was held by our foreign subsidiaries.\nWe continuously evaluate alternatives for efficiently funding our capital expenditures and ongoing operations. We expect to engage in a variety of financing transactions, from time to time, for such purposes, as well as to refinance our existing indebtedness, including the issuance of securities. As of August 28, 2025, $3.50 billion was available to draw under our Revolving Credit Facility. Funding of certain significant capital projects is also dependent on the receipt of government incentives. Our incentives are conditioned upon achieving or maintaining certain outcomes and satisfying compliance requirements and are subject to reduction, termination, or clawback.\nTo develop new product and process technology, support future growth, achieve operating efficiencies, and maintain product quality, we must continue to invest in manufacturing technologies, facilities and equipment, and R&D. We estimate capital expenditures for property, plant, and equipment, net of proceeds from government incentives, to be approximately $4.5 billion in first quarter of 2026. While quarterly expenditures may fluctuate, this level serves as a reasonable quarterly baseline for the planned capital expenditures for 2026. Actual amounts for 2026 will vary depending on market conditions and may vary from quarter to quarter due to the timing of expenditures and proceeds from government incentives. As of August 28, 2025, we had purchase obligations of approximately $1.77 billion for the acquisition of property, plant, and equipment, substantially all of which is expected to be paid within one year. For a description of other contractual obligations, such as leases, debt, and commitments, see Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 9. Leases, as well as Note 12. Debt and Note 13. Commitments. \nIn addition to the supply capacity we generate through our proprietary product and process technology that increases bit density per wafer, we will need to add new DRAM wafer capacity to support projected memory demand in the second half of the decade. Following the enactment of the CHIPS Act, we announced plans to invest in leading-edge memory manufacturing sites in Idaho and New York, based on CHIPS Act support through grants and investment tax credits. \nAs part of this plan, in September 2022, we broke ground on a leading-edge memory manufacturing fab in Boise, Idaho. Construction of the fab began in October 2023, with first DRAM wafer output projected in the second half of calendar 2027. In June 2025, in connection with certain amendments to our CHIPS Act agreements, we announced plans for a second leading-edge memory manufacturing fab in Idaho to serve growing market demand fueled by AI. \nOur announced plan for New York includes construction of a leading-edge DRAM memory manufacturing site, consisting of up to four fabs to be built over the next 20-plus years, in Clay, New York. We continue to work with state and federal authorities for approval to start ground preparation, and anticipate production to ramp after the completion of the second Idaho fab. We expect these new fabs to be key to meeting our requirements for additional wafer capacity, in line with industry demand trends and our objective of maintaining stable bit share.\nOn December 9, 2024, we entered into direct funding agreements with the U.S. Department of Commerce for up to $6.1 billion in direct funding pursuant to the CHIPS Act for a planned fab in Boise, Idaho, and two planned fabs in Clay, New York. On June 11, 2025, we entered into amendments to the direct funding agreements to add a second planned fab in Boise, Idaho, and allocate certain award funding from the $6.1 billion grants previously awarded to the second planned Idaho fab. The direct funding for up to $6.1 billion remains unchanged. On June 11, 2025, we also entered into a direct funding agreement with the U.S. Department of Commerce for up to $275 million in direct funding to expand and modernize our fab in Manassas, Virginia. The grants under the funding agreements represent total CHIPS Act grants of up to $6.4 billion in connection with our U.S. manufacturing expansion and modernization projects. In addition, we announced plans to bring advanced HBM packaging capabilities to the U.S.\n \n56\nTable of Contents\nIn addition to the CHIPS Act direct funding, we receive a 35% investment tax credit on qualified investments in U.S. semiconductor manufacturing under the CHIPS Act. We have also signed a non-binding term sheet with the State of New York that provides for up to $5.5 billion in funding for the planned four-fab facility over the next 20-plus years through a combination of tax credits for qualified capital investments and incentives for eligible new job wages.\nOutside the U.S., we are investing in manufacturing technologies, facilities and equipment, and R&D, and advancing our global back-end assembly and test network. These investments support our product portfolio and extend our ability to meet global market demand in the future. Planned investments and those underway include the following:\n•\nIndia: \nour construction is progressing for the assembly and test facility in Gujarat to address demand in the latter half of this decade;\n•\nJapan: \nwe are modernizing our Hiroshima manufacturing facility to support the production of DRAM using EUV lithography;\n•\nSingapore:\n we broke ground on an HBM advanced packaging facility to meaningfully expand our total advanced packaging capacity beginning in calendar 2027; and\n•\nTaiwan:\n we are modernizing our production capacity for DRAM and HBM products to meet rising market demand.\nSee Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 20. Government Incentives.\nOur Board of Directors has authorized the discretionary repurchase of up to $10 billion of our outstanding common stock through open-market purchases, block trades, privately-negotiated transactions, derivative transactions, and/or pursuant to Rule 10b5-1 trading plans. The repurchase authorization has no expiration date, does not obligate us to acquire any common stock, and is subject to market conditions, restrictions applicable under our CHIPS Act direct funding agreements, and our ongoing determination of the best use of available cash. Through August 28, 2025, we had repurchased an aggregate of $7.19 billion under the authorization. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 15. Equity, as well as Note 20. Government Incentives.\nOn September 23, 2025, our Board of Directors declared a quarterly dividend of $0.115 per share, payable in cash on October 21, 2025, to shareholders of record as of the close of business on October 3, 2025. The declaration and payment of any future cash dividends are at the discretion and subject to the approval of our Board of Directors. Our Board of Directors’ decisions regarding the amount and payment of dividends will depend on many factors, including, but not limited to, our financial condition, results of operations, capital requirements, business conditions, debt service obligations, contractual restrictions, industry practice, legal requirements, regulatory constraints, and other factors that our Board of Directors may deem relevant.\nWe expect that our cash and investments, cash flows from operations, funding from government incentives, and available financing will be sufficient to meet our requirements at least through the next 12 months and thereafter for the foreseeable future.\nCash Flows\nFor the year ended\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n17,525 \n$\n8,507 \n$\n1,559 \nNet cash used for investing activities\n(14,087)\n(8,309)\n(6,191)\nNet cash provided by (used for) financing activities\n(850)\n(1,842)\n4,983 \nEffect of changes in currency exchange rates on cash, cash equivalents, and restricted cash\n6 \n40 \n(34)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n2,594 \n$\n(1,604)\n$\n317 \nOperating Activities:\n Cash provided by operating activities reflects net income (loss) adjusted for certain non-cash items, including depreciation expense, amortization of intangible assets, stock-based compensation, inventory write-downs, and asset impairments, and the effects of changes in operating assets and liabilities\n. \n57 |\n \n2025 10-K\nTable of Contents\nThe increase in cash provided by operating activities for 2025 as compared to 2024 was primarily due to higher net income in 2025 adjusted for non-cash items, the effect of changes in receivables and accounts payable and accrued expenses, and a decrease in inventory, partially offset by a decrease in other current liabilities.\nThe increase in cash provided by operating activities for 2024 as compared to 2023 was primarily due to net income in 2024 adjusted for non-cash items, the effect of an increase in accounts payable and accrued expenses, and an increase in other current liabilities largely due to customer prepayments to secur\ne p\nroduct supply, partially offset by an increase in receivables.\n \nInvesting Activities:\n For 2025, net cash used for investing activities consisted primarily of $15.86 billion of expenditures for property, plant, and equipment and $192 million of net outflows from purchases, maturities, and sales of available-for-sale securities, partially offset by $2.01 billion of proceeds from government incentives to offset capital expenditures.\nFor 2024, net cash used for investing activi\nties consisted primarily of $8.39 billion of expenditures for property, plant, and equipment, and $205 million of net outflows from purchases, maturities, and sales of available-for-sale securities, partially offse\nt by $315 million of proceeds from government incentives to offset capital expenditures.\nFor 2023, net cash used for investing activities consisted primarily of $7.68 billion of expenditures for property, plant, and equipment, partially offset by $710 million of proceeds from government incentives to offset capital expenditures, and $868 million of net inflows from maturities, sales, and purchases of available-for-sale securities.\nFinancing Activities:\n For 2025, net cash used for financing activities consisted primarily of $4.62 billion of repayments of debt, which included the prepayment of the 2026 Notes, 2026 Term Loan A, 2027 Notes, 2027 Term Loan A, and a portion of the 2029 Term Loan A borrowings; and $522 million for payments of dividends to shareholders; partially offset by approximately $4.43 billion of proceeds from the issuance of the 2029 Term Loan A, 2032 Notes, 2035 A Notes, and 2035 B Notes. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 12. Debt.\nFor 2024, net cash used for financing activi\nties consisted primarily of $1.90 billion of repayments of debt, which included the prepayment of the 2024 Term Loan A and the 2025 Term Loan A borrowings, $513 million for paym\nents of dividends to shareholders, \n$300 million\n for the acquisition of 3.2 million shares of our common stock under our share repurchase authorization, an\nd $149 million of\n payments on equipment purchase contracts, partially offset by approximately $1.00 billion of proceeds from the issuance of the 2031 Notes.\nFor 2023, net cash provided by financing activities consisted primarily of $3.20 billion of proceeds from our 2025, 2026, and 2027 Term Loan A borrowings, $1.27 billion from the issuance of the 2029 B Notes, $896 million from the issuance of the 2033 B Notes, $749 million from the issuance of the 2033 A Notes, and $599 million from the issuance of the 2028 Notes. Cash used for financing activities included $761 million for repayments of debt, $504 million for payments of dividends to shareholders, $425 million for the acquisition of 8.6 million shares of our common stock under our share repurchase authorization, and $138 million of payments on equipment purchase contracts.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures. Estimates and judgments are based on historical experience, forecasted events, and various other assumptions that we believe to be reasonable under the circumstances. Estimates and judgments may vary under different assumptions or conditions and involve a significant level of uncertainty. We evaluate our estimates and judgments on an ongoing basis. Our management believes the accounting policies below are critical in the portrayal of our financial condition and results of operations and require management’s most difficult, subjective, or complex judgments.\n \n58\nTable of Contents\nContingencies:\n \nWe are subject to the possibility of losses from various contingencies. Significant judgment is necessary to estimate the probability and amount of potential losses. An accrual is made when a potential loss is both probable and reasonably estimable. When accounting for the resolution of contingencies, significant judgment may be necessary to determine whether losses pertain to previous, current, or future periods impacting the recognition timing to results of operations.\nGoodwill:\n We test goodwill for impairment in our fourth quarter each year, or more frequently if indicators of an impairment exist, to determine whether it is more likely than not that the fair value of the reporting unit with goodwill is less than its carrying value. For reporting units for which this assessment concludes that it is more likely than not that the fair value is more than its carrying value, goodwill is considered not impaired, and we are not required to perform the quantitative goodwill impairment test. Qualitative factors considered in this assessment include industry and market considerations, overall financial performance, and other relevant events and factors affecting the fair value of the reporting unit. For reporting units for which this assessment concludes that it is more likely than not that the fair value is below the carrying value, goodwill is tested for impairment by determining the fair value of each reporting unit and comparing it to the carrying value of the net assets assigned to the reporting unit. If the fair value of the reporting unit exceeds its carrying value, goodwill is considered not impaired. If the carrying value of the reporting unit exceeds its fair value, we recognize an impairment loss up to the difference between the carrying value and implied fair value. We recognized a charge of $101 million in 2023 to impair all of the goodwill assigned to our former Storage Business Unit reporting unit based on our quantitative assessment for impairment. As a result of reorganizing our segments in the fourth quarter of 2025, we performed a quantitative goodwill impairment assessment for each of our reporting units immediately before and after our business unit reorganization. We concluded based on both our pre- and post-reorganization impairment tests that goodwill was not impaired. \nDetermining when to test for impairment, the reporting units, the assets and liabilities of the reporting unit, and the fair value of the reporting unit requires significant judgment and involves the use of significant estimates and assumptions. These estimates and assumptions include revenue growth rates, forecasted manufacturing costs, and other expenses and are developed as part of our long-range planning process. The same estimates are used in business planning, forecasting, and capital budgeting as part of our long-term manufacturing capacity analysis. These estimates and assumptions are used to calculate projected future cash flows for the reporting unit, which are discounted using a risk-adjusted rate to estimate a fair value. The discount rate requires determination of appropriate market comparables. We base fair value estimates on assumptions we believe to be reasonable but that are unpredictable and inherently uncertain. Actual future results may differ from those estimates. We assess the reasonableness of our methodology, forecasts, and assumptions by comparing the aggregate calculated fair value of our reporting units to our market capitalization.\nGovernment incentives:\n We receive incentives from governmental entities related to capital expenditures, expenses, and other activities. The government incentives we receive may require that we meet or maintain specified spending levels and other operational metrics and may be subject to reimbursement if such conditions are not met or maintained. Failure to comply with these terms and conditions could result in termination of incentive programs or clawbacks of incentive amounts received. \nGovernment incentives are recognized in the financial statements based on the underlying principal criteria for earning the incentives when there is reasonable assurance that the conditions of the government incentives are met and the incentive will be received. Incentives related to the acquisition or construction of property, plant and equipment are recognized as a reduction in the carrying amounts of the related assets and as a reduction of subsequent depreciation expense over the useful lives of the assets. Incentives related to specific operating activities are offset against the related expense in the period the expense is incurred. For each project, we estimate the total expected project costs and recognize a proportionate benefit as qualified project costs are incurred. As the estimated total expected qualified project cost changes, we adjust our estimate of the recognized proportionate benefit.\n59 |\n \n2025 10-K\nTable of Contents\nIncome taxes:\n We are required to estimate our provision for income taxes and amounts ultimately payable or recoverable in numerous tax jurisdictions around the world. These estimates involve significant judgment and interpretations of regulations and are inherently complex. Resolution of income tax treatments in individual jurisdictions may not be known for many years after completion of the applicable year. We are also required to evaluate the realizability of our deferred tax assets on an ongoing basis in accordance with U.S. GAAP, which requires an assessment of our performance and other relevant factors. Realization of deferred tax assets is dependent on our ability to generate future taxable income. Our income tax provision or benefit is dependent, in part, on our ability to forecast future taxable income in Japan, Malaysia, the United States, and other jurisdictions. Such forecasts are inherently difficult and involve significant judgments including, among others, projecting future average selling prices and sales volumes, manufacturing and overhead costs, levels of capital spending, and other factors that significantly impact our analyses of the amount of net deferred tax assets that are more likely than not to be realized.\nInventories:\n \nInventories are stated at the lower of cost or net realizable value, with cost being determined on a first-in, first-out (“FIFO”) basis. Cost includes depreciation, labor, material, and overhead costs, including product and process technology costs. Determining net realizable value of finished goods and work in process inventories involves significant judgments, including projecting future average selling prices, future sales volumes, and future cost per part. To project average selling prices and sales volumes, we review recent sales volumes, existing customer orders, current contract prices, industry analyses of supply and demand, and general economic trends. To project cost per part, we review trends and historical results and consider known changes in our cost structure as applicable. Actual selling prices may vary significantly from projected prices due to the volatile nature of the semiconductor memory and storage markets. When these analyses reflect estimated net realizable values below our manufacturing costs, we record a charge to cost of goods sold in advance of when inventories are actually sold. As a result, the timing of when product costs are charged to costs of goods sold can vary significantly. Differences in future average selling prices used in calculating lower of cost or net realizable value adjustments can result in significant changes in the estimated net realizable value of finished goods and work in process inventories and accordingly the amount of write-down recorded. For example, a 5% decrease in future average selling prices would have changed the estimated net realizable value of our finished goods and work in process inventories by approximately $750 million as of August 28, 2025.\nU.S. GAAP provides for products to be grouped into categories in order to compare costs to net realizable values. The amount of any inventory write-down can vary significantly depending on the determination of inventory categories. We review the major characteristics of product type and markets in determining the unit of account for which we perform the lower of cost or net realizable value analysis and categorize all inventories (including DRAM, NAND, and other memory) as a single group.\nProperty, plant, and equipment:\n \nWe periodically assess the estimated useful lives of our property, plant, and equipment based on technology node transitions, capital spending, and equipment re-use rates. We also review the carrying value of property, plant, and equipment for impairment when events and circumstances indicate that the carrying value of an asset or group of assets may not be recoverable from the estimated future cash flows expected to result from its use and/or disposition. In cases where undiscounted expected future cash flows are less than the carrying value, an impairment loss is recognized equal to the amount by which the carrying value exceeds the estimated fair value of the assets. The estimate of future cash flows involves numerous assumptions which require significant judgment by us, including, but not limited to, future use of the assets for our operations versus sale or disposal of the assets, future selling prices for our products, and future production and sales volumes. \nRevenue recognition:\n Revenue is primarily recognized at a point in time when control of the promised goods is transferred to our customers in an amount that reflects the consideration we expect to be entitled to in exchange for those goods. Contracts with our customers are generally short-term in duration at fixed, negotiated prices with payment generally due shortly after delivery. We estimate a liability for returns using the expected value method based on historical returns. In addition, we generally offer price protection to our distributors, which is a form of variable consideration that decreases the transaction price. We use the expected value method, based on historical price adjustments and current pricing trends, to estimate the amount of revenue recognized from sales to distributors. Differences between the estimated and actual amounts are recognized as adjustments to revenue.\n \n60\nTable of Contents\nRecently Adopted Accounting Standards\nSee Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 2. Recently Adopted Accounting Standards.\nRecently Issued Accounting Standards\nSee Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 3. Recently Issued Accounting Standards.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk\nWe are exposed to interest rate risk related to our indebtedness and our investment portfolio, and as a result, the fair value of our debt fluctuates with changes in market interest rates. As of August 28, 2025 and August 29, 2024, we had fixed-rate debt with an aggregate carrying value of $10.55 billion and $8.52 billion, respectively. We estimate that, as of August 28, 2025 and August 29, 2024, a hypothetical 1% decrease in market interest rates would increase the fair value of our fixed-rate debt by approximately $660 million and $520 million, respectively. \nInterest rate risk related to our investment portfolio is managed by primarily investing in shorter term securities. We estimate that, as of August 28, 2025 and August 29, 2024, a hypothetical 1% increase in interest rates would decrease the fair value of our portfolio by approximately $20 million. Such impact would only be realized if investments were sold prior to maturity.\nAs of August 28, 2025, we had floating rate debt with an aggregate principal amount of $984 million, and as of August 29, 2024, we had floating-rate debt and fixed-rate debt that was swapped to floating-rate debt with an aggregate principal amount of $2.89 billion. A hypothetical 1% increase in the interest rates of this debt would result in an increase in annual interest expense of $10 million and $29 million as of August 28, 2025 and August 29, 2024, respectively.\nForeign Currency Exchange Rate Risk\nThe information in this section should be read in conjunction with the information related to changes in the currency exchange rates in Part I,",
    "item1a": "Item 1A. Risk Factors, “Risks Related to Capitalization and Financial Markets—Changes in foreign currency exchange rates could materially adversely affect our business, results of operations, or financial condition.”\nThe functional currency for all of our operations is the U.S. dollar. The substantial majority of our sales are transacted in the U.S. dollar; however, significant amounts of our operating expenses and capital expenditures, and certain assets and liabilities, are incurred in or exposed to other currencies, primarily the Canadian dollar, Chinese yuan, euro, Indian rupee, Japanese yen, Malaysian ringgit, New Taiwan dollar, and Singapore dollar. We have established currency risk management programs for our monetary assets and liabilities, investments in debt instruments, and forecasted future cash flows denominated in foreign currencies to hedge against fluctuations in the fair value and volatility of future cash flows caused by changes in currency exchange rates. We generally utilize currency forward contracts in these hedging programs, which reduce, but do not always entirely eliminate, the impact of currency exchange rate movements. We do not use derivative financial instruments for trading or speculative purposes.\n61 |\n \n2025 10-K\nTable of Contents\nBased on monetary assets and liabilities and investments in debt instruments denominated in foreign currencies, we estimate that a hypothetical 10% adverse change in exchange rates versus the U.S. dollar would result in losses of approximately $572 million as of August 28, 2025, and $480 million as of August 29, 2024. We hedge our exposure to changes in currency exchange rates by utilizing a rolling hedge strategy for our primary currency exposures with currency forward contracts that generally mature within three months. The effectiveness of our hedges is dependent, among other factors, upon our ability to accurately measure exposures on a timely basis. We may also hedge currency risk arising from foreign currency-denominated investments in debt instruments with currency forward contracts that generally mature within one year. To hedge the exposure of changes in cash flows from changes in currency exchange rates for certain capital expenditures and manufacturing costs, we may utilize currency forward contracts that generally mature within two years. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 17. Derivative Instruments.\n \n62\nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nConsolidated Statements of Operations\n64\nConsolidated Statements of Comprehensive Income\n (Loss)\n65\nConsolidated Balance Sheets\n66\nConsolidated Statements of Changes in Equity\n67\nConsolidated Statements of Cash Flows\n68\nNotes to Consolidated Financial Statements\n69\nReport of Independent Registered Public Accounting Firm (PCAOB ID\n \n238\n)\n99\n63 |\n \n2025 10-K\nTable of Contents\nMicron Technology, Inc.\nConsolidated Statements of Operations\n(In millions, except per share amounts)\nFor the year ended\nAugust 28,\n2025\nAugust 29,\n2024\nAugust 31,\n2023\nRevenue\n$\n37,378\n \n$\n25,111\n \n$\n15,540\n \nCost of goods sold\n22,505\n \n19,498\n \n16,956\n \nGross margin\n14,873\n \n5,613\n \n(\n1,416\n)\nResearch and development\n3,798\n \n3,430\n \n3,114\n \nSelling, general, and administrative\n1,205\n \n1,129\n \n920\n \nRestructure and asset impairments\n39\n \n1\n \n171\n \nOther operating (income) expense, net\n61\n \n(\n251\n)\n124\n \nOperating income (loss)\n9,770\n \n1,304\n \n(\n5,745\n)\nInterest income\n496\n \n529\n \n468\n \nInterest expense\n(\n477\n)\n(\n562\n)\n(\n388\n)\nOther non-operating income (expense), net\n(\n135\n)\n(\n31\n)\n7\n \n9,654\n \n1,240\n \n(\n5,658\n)\nIncome tax (provision) benefit\n(\n1,124\n)\n(\n451\n)\n(\n177\n)\nEquity in net income (loss) of equity method investees\n9\n \n(\n11\n)\n2\n \nNet income (loss)\n$\n8,539\n \n$\n778\n \n$\n(\n5,833\n)\nEarnings (loss) per share\nBasic\n$\n7.65\n \n$\n0.70\n \n$\n(\n5.34\n)\nDiluted\n7.59\n \n0.70\n \n(\n5.34\n)\nNumber of shares used in per share calculations\nBasic\n1,116\n \n1,105\n \n1,093\n \nDiluted\n1,125\n \n1,118\n \n1,093\n \nSee accompanying notes to consolidated financial statements.\n \n64\nTable of Contents\nMicron Technology, Inc.\nConsolidated Statements of Comprehensive Income (Loss)\n(In millions)\nFor the year ended\nAugust 28,\n2025\nAugust 29,\n2024\nAugust 31,\n2023\nNet income (loss)\n$\n8,539\n \n$\n778\n \n$\n(\n5,833\n)\nOther comprehensive income (loss), net of tax\nGains (losses) on derivative instruments\n92\n \n142\n \n234\n \nPension liability adjustments\n6\n \n3\n \n11\n \nUnrealized gains (losses) on investments\n4\n \n33\n \n6\n \nForeign currency translation adjustments\n—\n \n—\n \n(\n3\n)\nOther comprehensive income (loss)\n102\n \n178\n \n248\n \nTotal comprehensive income (loss)\n$\n8,641\n \n$\n956\n \n$\n(\n5,585\n)\nSee accompanying notes to consolidated financial statements.\n65 |\n \n2025 10-K\nTable of Contents\nMicron Technology, Inc.\nConsolidated Balance Sheets\n(In millions, except par value amounts)\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nAssets\nCash and cash equivalents\n$\n9,642\n \n$\n7,041\n \nShort-term investments\n665\n \n1,065\n \nReceivables\n9,265\n \n6,615\n \nInventories\n8,355\n \n8,875\n \nOther current assets\n914\n \n776\n \nTotal current assets\n28,841\n \n24,372\n \nLong-term marketable investments\n1,629\n \n1,046\n \nProperty, plant, and equipment\n46,590\n \n39,749\n \nOperating lease right-of-use assets\n736\n \n645\n \nIntangible assets\n453\n \n416\n \nDeferred tax assets\n616\n \n520\n \nGoodwill\n1,150\n \n1,150\n \nOther noncurrent assets\n2,783\n \n1,518\n \nTotal assets\n$\n82,798\n \n$\n69,416\n \nLiabilities and equity\nAccounts payable and accrued expenses\n$\n9,649\n \n$\n7,299\n \nCurrent debt\n560\n \n431\n \nOther current liabilities\n1,245\n \n1,518\n \nTotal current liabilities\n11,454\n \n9,248\n \nLong-term debt\n14,017\n \n12,966\n \nNoncurrent operating lease liabilities\n701\n \n610\n \nNoncurrent unearned government incentives\n1,018\n \n550\n \nOther noncurrent liabilities\n1,443\n \n911\n \nTotal liabilities\n28,633\n \n24,285\n \nCommitments and contingencies\nShareholders’ equity\nCommon stock, $\n0.10\n par value, \n3,000\n \nshares authorized, \n1,266\n \nshares issued and \n1,122\n \noutstanding (\n1,253\n \nshares issued and \n1,109\n \noutstanding as of August 29, 2024)\n127\n \n125\n \nAdditional capital\n13,339\n \n12,115\n \nRetained earnings\n48,583\n \n40,877\n \nTreasury stock, \n144\n shares held (\n144\n shares as of August 29, 2024)\n(\n7,852\n)\n(\n7,852\n)\nAccumulated other comprehensive income (loss)\n(\n32\n)\n(\n134\n)\nTotal equity\n54,165\n \n45,131\n \nTotal liabilities and equity\n$\n82,798\n \n$\n69,416\n \nSee accompanying notes to consolidated financial statements.\n \n66\nTable of Contents\nMicron Technology, Inc.\nConsolidated Statements of Changes in Equity\n(In millions, except per share amounts)\nCommon Stock\nAdditional Capital\nRetained Earnings\nTreasury Stock\nAccumulated Other Comprehensive\nIncome (Loss)\nTotal Shareholders’ Equity\nNumber\nof Shares\nAmount\nBalance as of September 1, 2022\n1,226\n$\n123\n \n$\n10,197\n \n$\n47,274\n \n$\n(\n7,127\n)\n$\n(\n560\n)\n$\n49,907\n \nNet income (loss)\n— \n— \n— \n(\n5,833\n)\n— \n— \n(\n5,833\n)\nOther comprehensive income (loss), net\n— \n— \n— \n— \n— \n248\n \n248\n \nStock issued under equity compensation plans\n15\n1\n \n262\n \n— \n— \n— \n263\n \nStock-based compensation expense\n— \n— \n596\n \n— \n— \n— \n596\n \nRepurchase of stock – repurchase program\n— \n— \n— \n— \n(\n425\n)\n— \n(\n425\n)\nRepurchase of stock – withholdings on employee equity awards\n(\n2\n)\n—\n \n(\n19\n)\n(\n108\n)\n— \n— \n(\n127\n)\nDividends and dividend equivalents declared ($\n0.460\n per share)\n— \n— \n— \n(\n509\n)\n— \n— \n(\n509\n)\nBalance as of August 31, 2023\n1,239\n$\n124\n \n$\n11,036\n \n$\n40,824\n \n$\n(\n7,552\n)\n$\n(\n312\n)\n$\n44,120\n \nNet income (loss)\n— \n— \n— \n778\n \n— \n— \n778\n \nOther comprehensive income (loss), net\n— \n— \n— \n— \n— \n178\n \n178\n \nStock issued under equity compensation plans\n17\n1\n \n271\n \n— \n— \n— \n272\n \nStock-based compensation expense\n— \n— \n833\n \n— \n— \n— \n833\n \nRepurchase of stock – repurchase program\n— \n— \n— \n— \n(\n300\n)\n— \n(\n300\n)\nRepurchase of stock – withholdings on employee equity awards\n(\n3\n)\n—\n \n(\n25\n)\n(\n207\n)\n— \n— \n(\n232\n)\nDividends and dividend equivalents declared ($\n0.460\n per share)\n— \n— \n— \n(\n518\n)\n— \n— \n(\n518\n)\nBalance as of August 29, 2024\n1,253\n$\n125\n \n$\n12,115\n \n$\n40,877\n \n$\n(\n7,852\n)\n$\n(\n134\n)\n$\n45,131\n \nNet income (loss)\n— \n— \n— \n8,539\n \n— \n— \n8,539\n \nOther comprehensive income (loss), net\n— \n— \n— \n— \n— \n102\n \n102\n \nStock issued under equity compensation plans\n16\n2\n \n285\n \n— \n— \n— \n287\n \nStock-based compensation expense\n— \n— \n972\n \n— \n— \n— \n972\n \nRepurchase of stock – withholdings on employee equity awards\n(\n3\n)\n—\n \n(\n33\n)\n(\n306\n)\n— \n— \n(\n339\n)\nDividends and dividend equivalents declared ($\n0.460\n per share)\n— \n— \n— \n(\n527\n)\n— \n— \n(\n527\n)\nBalance as of August 28, 2025\n1,266\n$\n127\n \n$\n13,339\n \n$\n48,583\n \n$\n(\n7,852\n)\n$\n(\n32\n)\n$\n54,165\n \nSee accompanying notes to consolidated financial statements.\n67 |\n \n2025 10-K\nTable of Contents\nMicron Technology, Inc.\nConsolidated Statements of Cash Flows\n(In millions)\nFor the year ended\nAugust 28,\n2025\nAugust 29,\n2024\nAugust 31,\n2023\nCash flows from operating activities\nNet income (loss)\n$\n8,539\n \n$\n778\n \n$\n(\n5,833\n)\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\n \n \nDepreciation expense and amortization of intangible assets\n8,352\n \n7,780\n \n7,756\n \nStock-based compensation\n972\n \n833\n \n596\n \nProvision to write down inventories to net realizable value\n—\n \n—\n \n1,831\n \nGoodwill impairment\n—\n \n—\n \n101\n \nChange in operating assets and liabilities:\n \n \nReceivables\n(\n1,776\n)\n(\n3,581\n)\n2,763\n \nInventories\n520\n \n(\n488\n)\n(\n3,555\n)\nAccounts payable and accrued expenses\n862\n \n1,915\n \n(\n1,302\n)\nOther current liabilities\n(\n272\n)\n989\n \n(\n817\n)\nOther\n328\n \n281\n \n19\n \nNet cash provided by operating activities\n17,525\n \n8,507\n \n1,559\n \nCash flows from investing activities\n \n \nExpenditures for property, plant, and equipment\n(\n15,857\n)\n(\n8,386\n)\n(\n7,676\n)\nPurchases of available-for-sale securities\n(\n1,890\n)\n(\n1,999\n)\n(\n723\n)\nProceeds from government incentives\n2,005\n \n315\n \n710\n \nProceeds from maturities and sales of available-for-sale securities\n1,698\n \n1,794\n \n1,591\n \nOther\n(\n43\n)\n(\n33\n)\n(\n93\n)\nNet cash used for investing activities\n(\n14,087\n)\n(\n8,309\n)\n(\n6,191\n)\nCash flows from financing activities\n \n \nRepayments of debt\n(\n4,619\n)\n(\n1,897\n)\n(\n761\n)\nPayments of dividends to shareholders\n(\n522\n)\n(\n513\n)\n(\n504\n)\nRepurchases of common stock - repurchase program\n—\n \n(\n300\n)\n(\n425\n)\nPayments on equipment purchase contracts\n—\n \n(\n149\n)\n(\n138\n)\nProceeds from issuance of debt\n4,430\n \n999\n \n6,716\n \nOther\n(\n139\n)\n18\n \n95\n \nNet cash provided by (used for) financing activities\n(\n850\n)\n(\n1,842\n)\n4,983\n \nEffect of changes in currency exchange rates on cash, cash equivalents, and restricted cash\n6\n \n40\n \n(\n34\n)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n2,594\n \n(\n1,604\n)\n317\n \nCash, cash equivalents, and restricted cash at beginning of period\n7,052\n \n8,656\n \n8,339\n \nCash, cash equivalents, and restricted cash at end of period\n$\n9,646\n \n$\n7,052\n \n$\n8,656\n \nSupplemental disclosures\n \n \nIncome taxes paid, net\n$\n(\n583\n)\n$\n(\n338\n)\n$\n(\n532\n)\nInterest paid, net of amounts capitalized\n(\n418\n)\n(\n503\n)\n(\n323\n)\nNon-cash equipment acquisitions on contracts payable\n321\n \n118\n \n165\n \nSee accompanying notes to consolidated financial statements.\n \n68\nTable of Contents\nMicron Technology, Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(All tabular amounts in millions, except per share amounts)\nNote 1. \nSignificant Accounting Policies\nBasis of Presentation\nWe are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life \nfor all\n. With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron® and Crucial® brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence (AI) and compute-intensive applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience.\nThe accompanying consolidated financial statements include the accounts of Micron Technology, Inc. and our consolidated subsidiaries and have been prepared in accordance with accounting principles generally accepted in the United States of America.\n \nIntercompany balances and transactions have been eliminated in consolidation.\n \nCertain reclassifications have been made to prior-period amounts to conform to current-period presentation.\nOur fiscal year is the 52- or 53-week period ending on the Thursday closest to August 31. Fiscal 2025, 2024, and 2023 each contained 52 weeks. All period references are to our fiscal periods unless otherwise indicated.\nDerivative and Hedging Instruments\nWe use derivative instruments to manage our exposure to changes in currency exchange rates from (1) our monetary assets and liabilities denominated in currencies other than the U.S. dollar, (2) non-U.S.-dollar-denominated investments in debt instruments, and (3) forecasted cash flows for certain capital expenditures and manufacturing costs. We also use derivative instruments to manage our exposure to changes in commodity prices for manufacturing supplies. Derivative instruments are measured at their fair values and recognized as either assets or liabilities.\nThe accounting for changes in the fair value of derivative instruments is based on the intended use of the derivative and the resulting designation. For derivative instruments that are not designated for hedge accounting, gains or losses from changes in fair values are recognized in other non-operating income (expense) and cash flows are classified as investing activities in the statement of cash flows. For derivative instruments designated as cash flow hedges, gains or losses are included as a component of accumulated other comprehensive income and reclassified into earnings in the same line items and in the same periods in which the underlying transactions affect earnings. For derivative instruments designated as fair value hedges, changes in the fair values of the derivative instruments and the offsetting changes in the fair values of the underlying hedged items are both recognized in earnings. For foreign currency and commodity derivative instruments designated as cash flow hedges or fair value hedges, time value is excluded from the assessment of effectiveness and the gains and losses attributable to time value are recognized in earnings through an amortization approach. Cash flows from derivative instruments designated as cash flow hedges or fair value hedges are classified in the same category as the items being hedged.\nWe enter into master netting arrangements with our counterparties to mitigate credit risk in derivative hedge transactions. These master netting arrangements allow us and our counterparties to net settle amounts owed to each other. Derivative assets and liabilities that can be net settled with each counterparty have been presented in our consolidated balance sheet on a net basis.\n69 |\n \n2025 10-K\nTable of Contents\nFinancial Instruments\nCash equivalents include highly liquid short-term investments with original maturities at the time of purchase of three months or less that are readily convertible to known amounts of cash.\n Other investments with remaining maturities of less than one year are included in short-term investments. Investments with remaining maturities greater than one year are included in long-term marketable investments. The carrying value of investment securities sold is determined using the specific identification method.\nFunctional Currency\nThe U.S. dollar is the functional currency for us and all of our consolidated subsidiaries.\nGoodwill\nWe perform an annual impairment assessment for goodwill in our fourth quarter each year.\nGovernment Incentives\nWe receive incentives from governmental entities related to capital expenditures, expenses, and other activities. The government incentives we receive may require that we meet or maintain specified spending levels and other operational metrics and may be subject to reimbursement if such conditions are not met or maintained. Government incentives are recognized in the financial statements based on the underlying principal criteria for earning the incentives when there is reasonable assurance that the conditions of the government incentives are met and the incentive will be received. Incentives related to the acquisition or construction of property, plant, and equipment are recognized as a reduction in the carrying amounts of the related assets and as a reduction of subsequent depreciation expense over the useful lives of the assets. Incentives related to specific operating activities are offset against the related expense in the period the expense is incurred. Government incentives received prior to being earned are recognized in current or noncurrent deferred income, whereas government incentives earned prior to being received are recognized in current or noncurrent receivables. Cash received from government incentives related to operating expenses is included as an operating activity in the statement of cash flows, whereas cash received, including by constructive receipt, from incentives related to the acquisition of property, plant, and equipment is included as an investing activity. For each project, we estimate the total expected project costs and recognize a proportionate benefit as qualified project costs are incurred. As the estimated total expected qualified project cost changes, we adjust our estimate of the recognized proportionate benefit.\nInventories\nInventories are stated at the lower of cost or net realizable value, with cost being determined on a FIFO basis. Cost includes depreciation, labor, material, and overhead costs, including product and process technology costs. Determining net realizable value of finished goods and work in process inventories requires projecting future average selling prices, sales volumes, and costs per part. When net realizable value is below cost, we record a charge to cost of goods sold to write down inventories to their estimated net realizable value in advance of when inventories are actually sold. We review the major characteristics of product type and markets in determining the unit of account for which we perform the lower of cost or net realizable value analysis and categorize all inventories (including DRAM, NAND, and other memory) as a single group.\nLeases\nWe determine if an arrangement is a lease, or contains a lease, at the inception of the arrangement and evaluate whether the lease is an operating lease or a finance lease at the commencement date. We recognize right-of-use assets and lease liabilities for operating and finance leases with terms greater than 12 months. Right-of-use assets represent our right to use an asset for the lease term, while lease liabilities represent our obligation to make lease payments. We do not separate lease and non-lease components for real-estate and gas plant leases. Sublease income is included within lease expense.\n \n70\nTable of Contents\nProduct and Process Technology\nCosts incurred to (1) acquire product and process technology, (2) patent technology, and (3) keep patents in force, are capitalized and amortized on a straight-line basis over periods ranging up to \n12.5\n years. We capitalize a portion of costs incurred to patent technology based on historical data of patents issued as a percent of patents we file. Product and process technology costs are amortized over the shorter of (1) the estimated useful life of the technology, (2) the patent term, or (3) the term of the technology agreement. Fully-amortized assets are removed from product and process technology and accumulated amortization.\nProduct Warranty\nWe generally provide a limited warranty that our products are in compliance with applicable specifications existing at the time of delivery. Under our standard terms and conditions of sale, liability for certain failures of product during a stated warranty period is usually limited to repair or replacement of defective items or return of, or a credit with respect to, amounts paid for such items. Under certain circumstances, we provide more extensive limited warranty coverage than that provided under our standard terms and conditions. Our warranty obligations are not material.\nProperty, Plant, and Equipment\nProperty, plant, and equipment is stated at cost and depreciated using the straight-line method over estimated useful lives of generally \n10\n to \n30\n years for buildings, \n7\n years for production equipment, up to \n7\n years for other equipment, and \n3\n to \n5\n years for software. Assets held for sale are carried at the lower of estimated fair value or carrying value and are included in current assets. When property, plant, or equipment is retired or otherwise disposed, the net book value is removed and we recognize any gain or loss in results of operations.\nWe capitalize interest on borrowings during the period of time we carry out the activities necessary to bring assets to the condition of their intended use and location. We utilize a weighted-average capitalization rate that is based on our consolidated debt portfolio. Capitalized interest becomes part of the cost of assets.\nResearch and Development\nCosts related to the conceptual formulation and design of products and processes are charged to R&D expense as incurred. Development of a product is deemed complete when it is qualified through reviews and tests for performance and reliability. Subsequent to product qualification, product costs are included in cost of goods sold.\nRevenue Recognition\nRevenue is primarily recognized at a point in time when control of the promised goods is transferred to our customers in an amount that reflects the consideration we expect to be entitled to in exchange for those goods. Contracts with our customers are generally short-term in duration at fixed, negotiated prices with payment generally due shortly after delivery. We estimate a liability for returns using the expected value method based on historical returns. In addition, we generally offer price protection to our distributors, which is a form of variable consideration that decreases the transaction price. We use the expected value method, based on historical price adjustments and current pricing trends, to estimate the amount of revenue recognized from sales to distributors. Differences between the estimated and actual amounts are recognized as adjustments to revenue.\nStock-based Compensation\nStock-based compensation is measured at the grant date, based on the fair value of the award, and recognized as expense under the straight-line attribution method over the requisite service period. We account for forfeitures as they occur. We issue new shares upon the exercise of stock options, conversion of share units, or issuance of shares under our ESPP.\nTreasury Stock\nTreasury stock is carried at cost. When we retire our treasury stock, any excess of the repurchase price paid over par value is allocated between additional capital and retained earnings.\n71 |\n \n2025 10-K\nTable of Contents\nUse of Estimates\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States of America requires our management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures. Estimates and judgments are based on historical experience, forecasted events, and various other assumptions that we believe to be reasonable under the circumstances. Estimates and judgments may differ under different assumptions or conditions. We evaluate our estimates and judgments on an ongoing basis. Actual results could differ from estimates.\nNote 2. \nRecently Adopted Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-07 (ASC Topic 280), \nImprovements to Reportable Segment Disclosures\n. This ASU expands on existing reportable segment disclosure requirements primarily through enhanced disclosures about significant segment expenses. We adopted this ASU in the fourth quarter of 2025 on a retrospective basis. Adoption of this ASU resulted in increased disclosures in the Notes to Consolidated Financial Statements. See Note 27. Segment and Other Information.\nNote 3. \nRecently Issued Accounting Standards\nIn December 2023, the FASB issued ASU 2023-09 (ASC Topic 740), \nImprovements to Income Tax Disclosures\n. This ASU requires disaggregated income tax disclosures on the rate reconciliation and income taxes paid. This ASU will be effective for our annual reporting for 2026 on a prospective basis, with retrospective application permitted. Adoption of this new guidance will result in increased disclosures in the Notes to Consolidated Financial Statements.\nIn November 2024, the FASB issued ASU 2024-03 (ASC Topic 220), \nDisaggregation of Income Statement Expenses\n. This ASU requires disclosure of certain expenses in the notes to the financial statements. This ASU will be effective for our annual reporting for 2028 on a prospective basis, with retrospective application permitted. Adoption of this new guidance will result in increased disclosures in the Notes to Consolidated Financial Statements.\nIn September 2025, the FASB issued ASU 2025-06 (ASC Topic 350), \nTargeted Improvements to the Accounting for Internal-Use Software\n. This ASU makes targeted improvements to the accounting for internal-use software and ASU will be effective for the first quarter of 2029, with early adoption permitted. This ASU provides for adoption on a prospective basis, with retrospective or modified retrospective application permitted. We are evaluating the timing and effects of our adoption of this new guidance on our financial statements.\nNote 4. \nVariable Interest Entities\nCertain third-party special purpose entities (the “Lease SPEs”) facilitate equipment lease financing transactions between us and various financial institutions. Neither we nor the financial institutions have an equity interest in the Lease SPEs, which are variable interest entities. The arrangements are financing vehicles and we do not bear any significant risks from variable interests with the Lease SPEs. We do not have the power to direct the activities of the Lease SPEs that most significantly impact their economic performance and, as such, we do not consolidate them. As of August 28, 2025, we had approximately $\n1.58\n billion of financial lease liabilities and right-of-use assets under these arrangements.\n \n72\nTable of Contents\nNote 5. \nCash and Investments\nAll of our short-term investments and long-term marketable investments were classified as available for sale as of the dates noted below. Cash and cash equivalents and the fair values of our available-for-sale securities, which approximated amortized costs, were as follows:\nAs of August 28, 2025\nAs of August 29, 2024\nCash and Cash Equivalents\nShort-term Investments\nLong-term Marketable Investments\n(1)\nTotal Fair Value\nCash and Cash Equivalents\nShort-term Investments\nLong-term Marketable Investments\n(1)\nTotal Fair Value\nCash\n$\n7,875\n \n$\n—\n \n$\n—\n \n$\n7,875\n \n$\n6,654\n \n$\n—\n \n$\n—\n \n$\n6,654\n \nLevel 1\n(2)\nMoney market funds\n410\n \n—\n \n—\n \n410\n \n20\n \n—\n \n—\n \n20\n \nLevel 2\n(3)\nCertificates of deposit\n1,292\n \n6\n \n—\n \n1,298\n \n316\n \n6\n \n—\n \n322\n \nCorporate bonds\n23\n \n559\n \n1,047\n \n1,629\n \n—\n \n771\n \n571\n \n1,342\n \nAsset-backed securities\n—\n \n31\n \n521\n \n552\n \n—\n \n46\n \n433\n \n479\n \nGovernment securities\n9\n \n43\n \n61\n \n113\n \n35\n \n82\n \n42\n \n159\n \nCommercial paper\n33\n \n26\n \n—\n \n59\n \n16\n \n160\n \n—\n \n176\n \n9,642\n \n$\n665\n \n$\n1,629\n \n$\n11,936\n \n7,041\n \n$\n1,065\n \n$\n1,046\n \n$\n9,152\n \nRestricted cash\n(4)\n4\n \n11\n \nCash, cash equivalents, and restricted cash\n$\n9,646\n \n$\n7,052\n \n(1)\nThe maturities of long-term marketable investments primarily range from\n \none\n to\n \nfive years\n, except for asset-backed securities which are not due at a single maturity date.\n(2)\nThe fair value of Level 1 securities is measured based on quoted prices in active markets for identical assets.\n(3)\nThe fair value of Level 2 securities is measured using information obtained from pricing services, which obtain quoted market prices for similar instruments, non-binding market consensus prices that are corroborated by observable market data, or various other methodologies, to determine the appropriate value at the measurement date. We perform supplemental analysis to validate information obtained from these pricing services. No adjustments were made to the fair values indicated by such pricing information as of August 28, 2025 or August 29, 2024.\n(4)\nRestricted cash is included in other current assets.\n \nGross realized gains and losses from sales of available-for-sale securities were not material for any period presented. \nNon-marketable Equity Investments \nIn addition to the amounts included in the table above, we had $\n194\n million and $\n190\n million of non-marketable equity investments without a readily determinable fair value that were included in other noncurrent assets as of August 28, 2025 and August 29, 2024, respectively. For non-marketable investments, we recognized net losses in other non-operating income (expense) of $\n10\n million, $\n32\n million, and $\n7\n million in 2025, 2024, and 2023, respectively. Our non-marketable equity investments are recorded at fair value on a non-recurring basis and classified as Level 3.\n \n73 |\n \n2025 10-K\nTable of Contents\nNote 6. \nReceivables\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nTrade receivables\n$\n7,163\n \n$\n5,419\n \nGovernment incentives\n1,572\n \n834\n \nIncome and other taxes\n436\n \n268\n \nOther\n94\n \n94\n \n$\n9,265\n \n$\n6,615\n \nNote 7. \nInventories\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nFinished goods\n$\n1,094\n \n$\n1,308\n \nWork in process\n6,401\n \n6,774\n \nRaw materials and supplies\n860\n \n793\n \n$\n8,355\n \n$\n8,875\n \nIn 2023, we recorded charges of $\n1.83\n billion to cost of goods sold to write down the carrying value of work in process and finished goods inventories to their estimated net realizable value.\n \nNote 8. \nProperty, Plant, and Equipment\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nLand\n$\n420\n \n$\n284\n \nBuildings\n22,173\n \n20,141\n \nEquipment\n(1)\n79,934\n \n70,813\n \nConstruction in progress\n(2)\n5,518\n \n3,444\n \nSoftware\n1,651\n \n1,365\n \n \n109,696\n \n96,047\n \nAccumulated depreciation\n(\n63,106\n)\n(\n56,298\n)\n \n$\n46,590\n \n$\n39,749\n \n(1)\nIncludes costs related to equipment not placed into service of $\n4.05\n billion as of August 28, 2025 and $\n3.10\n billion as of August 29, 2024.\n(2)\nPrimarily includes building-related construction and tool installation.\nDepreciation expense was $\n8.28\n billion, $\n7.70\n billion, and $\n7.67\n billion for 2025, 2024, and 2023, respectively. Interest capitalized as part of the cost of property, plant, and equipment was $\n321\n million, $\n225\n million, and $\n208\n million for 2025, 2024, and 2023, respectively.\nNote 9. \nLeases\nWe have finance and operating leases through which we obtain the right to use facilities, land, and equipment that support our business operations. Our finance leas\nes consist primarily of (1) equipment leases and (2) gas and other supply agreements that are deemed to contain embedded leases. Ou\nr operating leases consist primarily of offices, laboratories, other facilities, and land. Certain of our operating leases include one or more options to extend the lease term for periods from \none year\n to \n10\n years for real estate and \none year\n to \n99\n years for land. In determining the lease term, we assess whether we are reasonably certain to exercise any options to renew or terminate a lease or to purchase the right-of-use asset. \n \n74\nTable of Contents\nCertain supply or service agreements require us to exercise significant judgment to determine whether the agreement contains a lease. Our assessment includes determining whether we or the supplier control the assets used to fulfill the agreements by identifying whether we or the supplier have the right to change the type, quantity, timing, or location of the output of the assets. Our gas supply arrangements generally are deemed to contain a lease because we have the right to substantially all of the output of the assets used to produce the supply and we have the right to change the quantity and timing of the output of those assets.\nThe components of lease cost are presented below:\nFor the year ended\n2025\n2024\n2023\nFinance lease cost\nAmortization of right-of-use asset\n$\n335\n \n$\n176\n \n$\n105\n \nInterest on lease liability\n127\n \n70\n \n24\n \nOperating lease cost\n(1)\n153\n \n140\n \n137\n \n$\n615\n \n$\n386\n \n$\n266\n \n(1)\nI\nncludes short-term and variable lease costs.\nSupplemental cash flow information related to leases was as follows:\nFor the year ended\n2025\n2024\n2023\nCash flows used for operating activities\nFinance leases\n$\n120\n \n$\n61\n \n$\n24\n \nOperating leases\n149\n \n132\n \n139\n \nCash flows used for financing activities – Finance leases\n323\n \n155\n \n109\n \nNon-cash acquisitions of right-of-use assets\nFinance leases\n1,298\n \n905\n \n508\n \nOperating leases\n166\n \n54\n \n57\n \nSupplemental balance sheet information related to leases was as follows:\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nFinance lease right-of-use assets (included in property, plant, and equipment)\n$\n3,004\n \n$\n2,038\n \nCurrent operating lease liabilities (included in accounts payable and accrued expenses)\n74\n \n71\n \nWeighted-average remaining lease term (in years)\nFinance leases\n7\n8\nOperating leases\n12\n10\nWeighted-average discount rate\nFinance leases\n5.19\n \n%\n4.91\n \n%\nOperating leases\n4.26\n \n%\n3.42\n \n%\n75 |\n \n2025 10-K\nTable of Contents\nAs of August 28, 2025, maturities of lease liabilities by fiscal year were as follows:\nFinance Leases\nOperating Leases\n2026\n$\n675\n \n$\n92\n \n2027\n660\n \n97\n \n2028\n640\n \n89\n \n2029\n548\n \n83\n \n2030\n336\n \n85\n \n2031 and thereafter\n647\n \n628\n \nLess imputed interest\n(\n462\n)\n(\n299\n)\n$\n3,044\n \n$\n775\n \nThe table above excludes obligations for leases that have been executed but have not yet commenced. As of August 28, 2025, excluded obligations consisted of $\n1.16\n billion of finance lease obligations over a weighted-average period of \n15\n years for gas supply arrangements deemed to contain embedded leases and equipment leases. We will recognize right-of-use assets and associated lease liabilities at the time such assets become available for our use.\nNote 10. \nIntangible Assets\nAs of August 28, 2025\nAs of August 29, 2024\nGross\nAmount\nAccumulated\nAmortization\nNet Carrying Amount\nGross\nAmount\nAccumulated\nAmortization\nNet Carrying Amount\nProduct and process technology\n$\n662\n \n$\n(\n217\n)\n$\n445\n \n$\n683\n \n$\n(\n278\n)\n$\n405\n \nOther\n8\n \n—\n \n8\n \n11\n \n—\n \n11\n \n$\n670\n \n$\n(\n217\n)\n$\n453\n \n$\n694\n \n$\n(\n278\n)\n$\n416\n \nIn 2025, 2024, and 2023, we capitalized $\n112\n million, $\n84\n million, and $\n87\n million, respectively, for product and process technology with weighted-average useful lives of \n9\n years, \n10\n years, and \n9\n years, respectively. Amortization expense was $\n71\n million, $\n82\n million, and $\n86\n million for 2025, 2024, and 2023, respectively. Expected amortization expense is $\n73\n million for 2026, $\n65\n million for 2027, $\n62\n million for 2028, $\n55\n million for 2029, $\n57\n million for 2030, and $\n141\n million for 2031 and thereafter.\nNote 11. \nAccounts Payable and Accrued Expenses\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nAccounts payable\n$\n3,132\n \n$\n2,726\n \nProperty, plant, and equipment\n4,391\n \n2,925\n \nSalaries, wages, and benefits\n1,116\n \n1,117\n \nIncome and other taxes\n628\n \n218\n \nOther\n382\n \n313\n \n$\n9,649\n \n$\n7,299\n \n \n76\nTable of Contents\nNote 12. \nDebt\nAs of August 28, 2025\nAs of August 29, 2024\nNet Carrying Amount\nNet Carrying Amount\nStated Rate\nEffective Rate\nPrincipal\nCurrent\nLong-Term\nTotal\nPrincipal\nCurrent\nLong-Term\nTotal\n2028 Notes\n5.375\n \n%\n5.52\n \n%\n$\n542\n \n$\n—\n \n$\n540\n \n$\n540\n \n$\n600\n \n$\n—\n \n$\n597\n \n$\n597\n \n2029 Term Loan A\n5.455\n \n%\n5.49\n \n%\n984\n \n—\n \n982\n \n982\n \n—\n \n—\n \n—\n \n—\n \n2029 A Notes\n5.327\n \n%\n5.40\n \n%\n700\n \n—\n \n698\n \n698\n \n700\n \n—\n \n698\n \n698\n \n2029 B Notes\n6.750\n \n%\n6.54\n \n%\n1,159\n \n—\n \n1,168\n \n1,168\n \n1,250\n \n—\n \n1,261\n \n1,261\n \n2030 Notes\n4.663\n \n%\n4.73\n \n%\n796\n \n—\n \n794\n \n794\n \n850\n \n—\n \n847\n \n847\n \n2031 Notes\n5.300\n \n%\n5.41\n \n%\n1,000\n \n—\n \n995\n \n995\n \n1,000\n \n—\n \n994\n \n994\n \n2032 Green Bonds\n2.703\n \n%\n2.77\n \n%\n1,000\n \n—\n \n996\n \n996\n \n1,000\n \n—\n \n996\n \n996\n \n2032 Notes\n5.650\n \n%\n5.79\n \n%\n500\n \n—\n \n496\n \n496\n \n—\n \n—\n \n—\n \n—\n \n2033 A Notes\n5.875\n \n%\n5.96\n \n%\n750\n \n—\n \n746\n \n746\n \n750\n \n—\n \n745\n \n745\n \n2033 B Notes\n5.875\n \n%\n6.01\n \n%\n900\n \n—\n \n892\n \n892\n \n900\n \n—\n \n891\n \n891\n \n2035 A Notes\n5.800\n \n%\n5.90\n \n%\n1,000\n \n—\n \n992\n \n992\n \n—\n \n—\n \n—\n \n—\n \n2035 B Notes\n6.050\n \n%\n6.14\n \n%\n1,250\n \n—\n \n1,241\n \n1,241\n \n—\n \n—\n \n—\n \n—\n \n2041 Notes\n3.366\n \n%\n3.41\n \n%\n500\n \n—\n \n497\n \n497\n \n500\n \n—\n \n497\n \n497\n \n2051 Notes\n3.477\n \n%\n3.52\n \n%\n500\n \n—\n \n496\n \n496\n \n500\n \n—\n \n496\n \n496\n \n2026 Term Loan A\nN/A\nN/A\n—\n \n—\n \n—\n \n—\n \n922\n \n49\n \n872\n \n921\n \n2026 Notes\nN/A\nN/A\n—\n \n—\n \n—\n \n—\n \n500\n \n—\n \n499\n \n499\n \n2027 Term Loan A\nN/A\nN/A\n—\n \n—\n \n—\n \n—\n \n1,065\n \n57\n \n1,006\n \n1,063\n \n2027 Notes\nN/A\nN/A\n—\n \n—\n \n—\n \n—\n \n900\n \n—\n \n838\n \n838\n \nFinance lease obligations\nN/A\n5.19\n \n%\n3,044\n \n560\n \n2,484\n \n3,044\n \n2,054\n \n325\n \n1,729\n \n2,054\n \n \n$\n14,625\n \n$\n560\n \n$\n14,017\n \n$\n14,577\n \n$\n13,491\n \n$\n431\n \n$\n12,966\n \n$\n13,397\n \nAs of August 28, 2025, all of our debt, other than finance lease obligations, were unsecured obligations that rank equally in right of payment with all of our other existing and future unsecured indebtedness and were effectively subordinated to all future secured indebtedness, to the extent of the value of the assets securing such indebtedness. All our unsecured debt were obligations of our parent company, Micron, and were structurally subordinated to all liabilities of its subsidiaries, including trade payables. The terms of our indebtedness generally contain cross payment default and cross acceleration provisions. Micron’s guarantees of certain liabilities of its subsidiaries are unsecured obligations ranking equally in right of payment with all of Micron’s other existing and future unsecured indebtedness.\n77 |\n \n2025 10-K\nTable of Contents\nDebt Activity\nThe table below presents the effects of debt issuances and prepayment activities in 2025:\nTransaction Date\nIncrease (Decrease) in Principal\nIncrease (Decrease) in Carrying Value\nIncrease (Decrease) in Cash\nIssuances\n2035 A Notes\nJanuary 16, 2025\n$\n1,000\n \n$\n992\n \n$\n992\n \n2029 Term Loan A\nJanuary 17, 2025\n1,684\n \n1,681\n \n1,681\n \n2032 Notes\nApril 29, 2025\n500\n \n496\n \n496\n \n2035 B Notes\nApril 29, 2025\n1,250\n \n1,241\n \n1,241\n \nPrepayments\n2026 Term Loan A\nJanuary 17, 2025\n(\n897\n)\n(\n896\n)\n(\n897\n)\n2027 Term Loan A\nJanuary 17, 2025\n(\n1,037\n)\n(\n1,035\n)\n(\n1,037\n)\n2026 Notes\nFebruary 12, 2025\n(\n500\n)\n(\n499\n)\n(\n501\n)\n2027 Notes\nMay 27, 2025\n(\n900\n)\n(\n854\n)\n(\n900\n)\n2028 Notes\nVarious dates\n(\n58\n)\n(\n57\n)\n(\n59\n)\n2029 B Notes\nVarious dates\n(\n91\n)\n(\n91\n)\n(\n98\n)\n2030 Notes\nVarious dates\n(\n54\n)\n(\n53\n)\n(\n54\n)\n2029 Term Loan A\nAugust 18, 2025\n(\n700\n)\n(\n699\n)\n(\n700\n)\n$\n197\n \n$\n226\n \n$\n164\n \nIn 2021, we entered into fixed-to-floating interest rate swaps on the 2027 Notes with an aggregate $\n900\n million notional amount equal to the principal amount of the 2027 Notes. The fixed-to-floating interest rate swaps were accounted for as fair value hedges, and as a result, the carrying value of our 2027 Notes reflected adjustments in fair value. In the third quarter of 2025, we settled these fixed-to-floating interest rate swaps in connection with the prepayment of the 2027 Notes. In the third quarter of 2025, we recognized a $\n46\n million loss in other non-operating income (expense) on prepayment of the 2027 Notes.\nSenior Unsecured Notes\nWe may redeem our 2028 Notes, 2029 A Notes, 2029 B Notes, 2030 Notes, 2031 Notes, 2032 Green Bonds, 2032 Notes, 2033 A Notes, 2033 B Notes, 2035 A Notes, 2035 B Notes, 2041 Notes, and 2051 Notes (the “Senior Unsecured Notes”), in whole or in part, at a redemption price equal to the greater of (i) \n100\n% of the principal amount of the notes to be redeemed and (ii) the present value of the remaining scheduled payments of principal and interest, plus, in each case, accrued interest. We may also redeem any series of the Senior Unsecured Notes, in whole or in part, at a redemption price equal to \n100\n% of the principal amount of the notes to be redeemed plus accrued interest between one and six months prior to the applicable maturity date, in accordance with the respective terms of such series.\nThe Senior Unsecured Notes contain covenants that, among other things, limit, in certain circumstances, our ability and/or the ability of our restricted subsidiaries (which are generally domestic subsidiaries in which we own at least \n80\n% of the voting stock and which own principal property, as defined in the indenture governing the Senior Unsecured Notes) to (1) create or incur certain liens; (2) enter into certain sale and lease-back transactions with respect to any principal property; and (3) consolidate with or merge with or into, or convey, transfer, or lease all or substantially all of our properties and assets, to another entity. These covenants are subject to a number of limitations and exceptions. Additionally, if a change of control triggering event occurs, as defined in the indenture governing each series of the Senior Unsecured Notes, we will be required to offer to repurchase the Senior Unsecured Notes of such series at a price equal to \n101\n% of the principal amount plus accrued interest up to the repurchase date.\n \n78\nTable of Contents\n2029 Term Loan A\nOn January 17, 2025, we entered into a term loan agreement and borrowed $\n1.68\n billion in principal amount due January 17, 2029 (the “Term Loan Agreement”). Borrowings under the Term Loan Agreement will generally bear interest at adjusted term \nSOFR\n plus an applicable interest rate margin ranging from \n0.875\n% to \n1.50\n%, depending on our corporate credit ratings. On August 18, 2025, we prepaid $\n700\n million of the principal amount.\nThe Term Loan Agreement requires us to maintain, on a consolidated basis, a net leverage ratio of total net indebtedness to adjusted EBITDA, as defined in the Term Loan Agreement and calculated as of the last day of each fiscal quarter, not to exceed \n3.25\n to 1.00, subject to a temporary four fiscal quarter increase in such maximum ratio to \n3.75\n to 1.00 following certain material acquisitions. Our obligations under the Term Loan Agreement are unsecured.\nRevolving Credit Facility\nAs of August 28, 2025, \nno\n amounts were outstanding under the Revolving Credit Facility and $\n3.50\n billion was available to us. Under the Revolving Credit Facility, borrowing would generally bear interest at a rate equal to adjusted term \nSOFR\n plus \n0.875\n% to \n1.50\n%, depending on our corporate credit ratings. Any amounts outstanding under the Revolving Credit Facility would mature on March 12, 2030 and amounts borrowed may be prepaid without penalty. Any obligations under the Revolving Credit Facility would be unsecured.\nThe Revolving Credit Facility contains the same net leverage ratio and substantially the same other covenants as the Term Loan Agreement.\nMaturities of Notes Payable\nAs of August 28, 2025, maturities of notes payable and the term loan by fiscal year were as follows:\n2026\n$\n—\n \n2027\n—\n \n2028\n542\n \n2029\n1,684\n \n2030\n1,955\n \n2031 and thereafter\n7,400\n \nUnamortized issuance costs, discounts, and premium, net\n(\n48\n)\n$\n11,533\n \nNote 13. \nCommitments\nAs of August 28, 2025, we had noncancelable commitments with remaining contractual terms in excess of one year of approximately $\n5.5\n billion for purchase obligations, of which approximately $\n1.2\n billion will be due in 2026, $\n1.2\n billion due in 2027, $\n1.0\n billion due in 2028, $\n400\n million due in 2029, $\n400\n million due in 2030, and $\n1.3\n billion due in 2031 and thereafter. Purchase obligations primarily include payments for goods or services with either a fixed or minimum quantity and price, which includes payments for the acquisition of property, plant, and equipment. Payments for leases that have been executed but have not yet commenced are excluded.\n79 |\n \n2025 10-K\nTable of Contents\nNote 14. \nContingencies\nWe are currently a party to legal actions other than those described below arising from the normal course of business, none of which are expected to have a material adverse effect on our business, results of operations, or financial condition.\nPatent Matters\nAs is typical in the semiconductor and other high-tech industries, from time to time, others have asserted, and may in the future assert, that our products or manufacturing processes infringe upon their intellectual property rights. A description of certain claims is below.\nOn April 28, 2021, Netlist, Inc. (“Netlist”) filed two patent infringement actions against Micron, Micron Semiconductor Products, Inc. (“MSP”), and Micron Technology Texas, LLC (“MTEC”) in the U.S. District Court for the Western District of Texas (“W.D. Tex.”). The first complaint alleges that \none\n U.S. patent is infringed by certain of our non-volatile dual in-line memory modules. The second complaint alleges that \nthree\n U.S. patents are infringed by certain of our load-reduced dual in-line memory modules (“LRDIMMs”). Each complaint seeks injunctive relief, damages, attorneys’ fees, and costs. On March 31, 2022, Netlist filed a patent infringement complaint against Micron and Micron Semiconductor Germany, GmbH in Düsseldorf Regional Court alleging that \ntwo\n German patents are infringed by certain of our LRDIMMs. The complaint seeks damages, costs, and injunctive relief. In rulings issued on March 7, 2024 and November 7, 2024, the Federal Patent Court in Germany declared both patents invalid. Netlist has appealed those rulings.\nOn June 10, 2022, Netlist filed a patent infringement complaint against Micron, MSP, and MTEC in the U.S. District Court for the Eastern District of Texas (“E.D. Tex.”) alleging that \nsix\n U.S. patents are infringed by certain of our memory modules and HBM products. On August 1, 2022, Netlist filed a second patent infringement complaint against the same defendants in E.D. Tex. alleging that \none\n U.S. patent is infringed by certain of our LRDIMMs. On August 15, 2022, Netlist amended the second complaint to assert that \ntwo\n additional U.S. patents are infringed by certain of our LRDIMMs. The complaints in E.D. Tex. seek injunctive relief, damages, and attorneys’ fees. On May 23, 2024, following a four-day trial regarding the second complaint filed by Netlist in the E.D. Tex., a jury rendered a verdict that Micron’s memory modules infringe \ntwo\n asserted patents\n—\nU.S. Patent No. 7,619,912 (“the ‘912 patent”) and U.S. Patent No. 11,093,417 (“the ‘417 patent”)\n—\nand found that Micron should pay $\n425\n million for infringement of the ‘912 patent and $\n20\n million for infringement of the ‘417 patent. On July 9, 2025, Micron filed a notice that it will appeal the judgment. On April 17, 2024, the Patent Trial and Appeal Board (“PTAB”) of the United States Patent and Trademark Office (“USPTO”) issued a final written decision (“FWD”) finding unpatentable the sole asserted claim of the ‘912 patent. On September 10, 2024, Netlist filed a notice that it will appeal the ruling that the ‘912 patent is unpatentable to the U.S. Court of Appeals for the Federal Circuit (“Federal Circuit”). On July 30, 2024, the USPTO issued a FWD finding unpatentable all asserted claims of the ‘417 patent. On December 10, 2024, Netlist filed a notice that it will appeal the ruling that the ‘417 patent is unpatentable to the Federal Circuit. In the case of each of the ‘912 and ‘417 patents, if the United States Court of Appeals for the Federal Circuit affirms the FWD, then the affirmed FWD will preclude any pending actions asserting infringement of such patent (including any infringement verdict that is subject to an ongoing appeal). \nOn May 19, 2025, Netlist filed a complaint against Micron, MSP, and MTEC in E.D. Tex. alleging that \none\n U.S. patent is infringed by our HBM products. On July 8, 2025, Netlist amended the complaint to allege that \none\n additional U.S. patent is infringed by certain of our DIMMs. On July 28, 2025, Netlist filed an additional complaint against Micron, MSP, and MTEC in E.D. Tex. alleging that \none\n U.S. patent is infringed by certain of our DIMMs. These complaints seek damages, attorneys’ fees, and other equitable relief.\nOn January 23, 2023, Besang Inc. filed a patent infringement complaint against Micron in E.D. Tex. The complaint alleges that \none\n U.S. patent is infringed by certain of our 3D NAND and SSD products. The complaint seeks an injunction, damages, attorneys’ fees, and costs. On September 17, 2025, the District Court issued a judgment that the accused products do not infringe the asserted patent.\nOn November 9, 2023, Yangtze Memory Technologies Company, Ltd. (“YMTC”) filed a patent infringement complaint against Micron and one of its subsidiaries in the U.S. District Court for the Northern District of California (“N.D. Cal.”). The complaint alleges that \neight\n U.S. patents are infringed by certain of our 3D NAND products. The \n \n80\nTable of Contents\ncomplaint seeks an injunction, damages, attorneys’ fees, and costs. On January 22, 2024, Micron Semiconductor (Shanghai) Co., Ltd. (“MSS”) was served with three patent infringement complaints filed by YMTC in Beijing Intellectual Property Court and on February 27, 2024, Micron was served with the same complaints. The complaints assert that Micron and MSS infringed \nthree\n Chinese patents owned by YMTC by importing, selling, offering for sale, and assisting others to sell certain 3D NAND products and SSDs in China. The complaint seeks an injunction, damages, attorneys’ fees, and costs. On July 12, 2024, YMTC filed a second complaint against Micron and its subsidiary in N.D. Cal. The second complaint alleges that \neleven\n U.S. patents are infringed by certain of our 3D NAND and DDR5 DRAM products. The complaint seeks an injunction, damages, attorneys’ fees, and costs. On September 11, 2024, MSS was served with five patent infringement complaints filed by YMTC in Shanghai Intellectual Property Court. The complaints assert that Micron and MSS infringed \nfive\n Chinese patents owned by YMTC by importing, selling, offering for sale, and assisting others to sell certain 3D NAND products and SSDs in China. The complaint seeks an injunction, damages, attorneys’ fees, and costs.\nOn October 16, 2024, Palisade Technologies, LLP filed a patent infringement lawsuit against Micron and MSP in W.D. Tex. The complaint alleges that \nfive\n U.S. patents are infringed by certain of our DRAM, NAND, 3D NAND, and SSD products. The complaint seeks an injunction, damages, attorneys’ fees, and costs.\nOn June 30, 2025, Advanced Memory Technologies, LLC filed a patent infringement lawsuit against Micron in W.D. Tex. alleging that \nfour\n U.S. Patents are infringed by certain of our DRAM and NAND products. The complaint seeks an injunction, damages, attorneys’ fees, and costs.\nThe above lawsuits pertain to substantially all of our DRAM, NAND, and other memory and storage products we manufacture, which account for substantially all of our revenue.\nSecurities Class Action Matters\nOn January 9, 2025, a putative class action complaint was filed against Micron and certain individual officers in the U.S. District Court for the Southern District of Florida for alleged violations of the Securities Exchange Act of 1934. On April 3, 2025, the case was transferred to the United States District Court for the District of Idaho (“D. Idaho”), and on May 23, 2025, an amended complaint was filed in D. Idaho. The amended complaint alleges defendants made materially false or misleading statements during a putative class period from March 29, 2023 to December 18, 2024, regarding industry supply and demand dynamics and the demand for Micron's products, including NAND and DRAM products. The amended complaint seeks unspecified compensatory damages, attorneys’ fees and costs.\nShareholder Derivative Matters\nOn February 20, 2025, a shareholder derivative complaint was filed by a purported shareholder against certain individual directors and officers of Micron, allegedly on behalf of and for the benefit of Micron, in D. Idaho. On February 21, 2025, a similar related derivative complaint was filed by another purported shareholder in the same court against certain individual directors and officers of Micron. The complaints allege violations of the Securities Exchange Act of 1934, breach of fiduciary duty, unjust enrichment, insider trading, abuse of control, and waste of corporate assets. The complaints are based on substantially the same allegedly false or misleading statements asserted in the securities putative class action matter. The complaints seek various unspecified damages allegedly suffered by Micron, restitution, attorneys’ fees and costs and other relief, including reforms and improvements to our corporate governance and internal procedures. On April 28, 2025, the complaints were consolidated and on May 14, 2025, the consolidated complaints were stayed until the issuance of a final decision on all motions to dismiss the securities putative class action matter or a final resolution of the putative class action matter.\nOn September 8, 2025, a shareholder derivative complaint was filed by a purported shareholder against certain individual directors and officers of Micron, allegedly on behalf of and for the benefit of Micron, in the United States District Court for the District of Delaware (“D. Del.”). The complaint alleges violations of the Securities and Exchange Act of 1934, breaches of fiduciary duty, unjust enrichment, insider trading and misappropriation of information, abuse of control, gross mismanagement, and waste of corporate assets. The complaint is based on substantially the same allegations of false and misleading statements and/or omissions of material information as were asserted in the putative securities class action and similar shareholder derivative suits pending in D. Idaho. \n81 |\n \n2025 10-K\nTable of Contents\nOther Matters\nOn June 7, 2025, YMTC filed a complaint against Micron and DCI Group AZ, LLC in the U.S. District Court for the District of Columbia. The complaint alleges that the defendants engaged in false advertising, product disparagement, and unfair competition regarding YMTC’s 3D NAND flash products in violation of the Lanham Act. The complaint seeks injunctive relief, damages, disgorgement of profits, attorneys’ fees, and costs.\nIn the normal course of business, we are a party to a variety of agreements pursuant to which we may be obligated to indemnify another party. It is not possible to predict the maximum potential amount of future payments under these types of agreements due to the conditional nature of our obligations and the unique facts and circumstances involved in each particular agreement. Historically, our payments under these types of agreements have not had a material adverse effect on our business, results of operations, or financial condition.\nContingency Assessment\nWe ar\ne unable to predict the outcome of any of the matters noted above and cannot make a reasonable estimate of the potential loss or range of possible losses. A determination that our products or manufacturing processes infringe the intellectual property rights of others or entering into a license agreement covering such intellectual property could result in significant liability and/or require us to make material changes to our products and/or manufacturing processes. Any of the foregoing, as well as the resolution of any other legal matter noted above, could have a material adverse effect on our business, results of operations, or financial condition.\nNote 15. \nEquity\nCommon Stock Repurchases\nOur Board of Directors has authorized the discretionary repurchase of up to $\n10\n billion of our outstanding common stock through open-market purchases, block trades, privately-negotiated transactions, derivative transactions, and/or pursuant to Rule 10b5-1 trading plans. The repurchase authorization has no expiration date, does not obligate us to acquire any common stock, and is subject to market conditions, restrictions applicable under our CHIPS Act direct funding agreements, and our ongoing determination of the best use of available cash. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 20. Government Incentives. \nNo\n shares were repurchased in 2025. We repurchased \n3.2\n million shares of our common stock for $\n300\n million in 2024. Through August 28, 2025, we had repurchased an aggregate of $\n7.19\n billion under the authorization. Amounts repurchased are included in treasury stock.\nDividends\nIn each quarter of 2025, we declared and paid dividends of $\n0.115\n per share. On September 23, 2025, our Board of Directors declared a quarterly dividend of $\n0.115\n per share, payable in cash on \nOctober 21, 2025\n, to shareholders of record as of the close of business on \nOctober 3, 2025\n.\n \n82\nTable of Contents\nAccumulated Other Comprehensive Income (Loss)\nChanges in accumulated other comprehensive income (loss) by component for the year ended August 28, 2025 were as follows:\nGains (Losses) on Derivative Instruments\nUnrealized Gains (Losses) on Investments\nPension Liability Adjustments\nCumulative Foreign Currency Translation Adjustment\nTotal\nAs of August 29, 2024\n$\n(\n162\n)\n$\n(\n8\n)\n$\n39\n \n$\n(\n3\n)\n$\n(\n134\n)\nOther comprehensive income (loss) before reclassifications\n(\n7\n)\n6\n \n13\n \n—\n \n12\n \nAmount reclassified out of accumulated other comprehensive income (loss)\n140\n \n(\n1\n)\n(\n3\n)\n—\n \n136\n \nTax effects\n(\n41\n)\n(\n1\n)\n(\n4\n)\n—\n \n(\n46\n)\nOther comprehensive income (loss)\n92\n \n4\n \n6\n \n—\n \n102\n \nAs of August 28, 2025\n$\n(\n70\n)\n$\n(\n4\n)\n$\n45\n \n$\n(\n3\n)\n$\n(\n32\n)\nNote 16. \nFair Value Measurements\nThe estimated fair values and carrying values of our outstanding debt instruments were as follows:\nAs of August 28, 2025\nAs of August 29, 2024\nFair\nValue\nCarrying\nValue\nFair\nValue\nCarrying\nValue\nNotes payable and term loans\n$\n11,570\n \n$\n11,533\n \n$\n11,316\n \n$\n11,343\n \nThe fair values of our debt instruments were estimated based on Level 2 inputs, including the trading price of our notes when available, discounted cash flows, and interest rates based on similar debt issued by parties with credit ratings similar to ours.\n83 |\n \n2025 10-K\nTable of Contents\nNote 17. \nDerivative Instruments\nNotional or Contractual Amount\nFair Value\n(1)\n of\nAssets\n(2)\nLiabilities\n(3)\nAs of August 28, 2025\nDerivative instruments with hedge accounting designation\nCash flow currency hedges\n$\n3,271\n \n$\n41\n \n$\n(\n64\n)\nCash flow commodity hedges\n393\n \n19\n \n(\n20\n)\nFair value currency hedges\n3,049\n \n1\n \n(\n10\n)\nDerivative instruments without hedge accounting designation\nNon-designated currency hedges\n3,477\n \n3\n \n(\n18\n)\n$\n64\n \n$\n(\n112\n)\nAs of August 29, 2024\nDerivative instruments with hedge accounting designation\nCash flow currency hedges\n$\n3,724\n \n$\n57\n \n$\n(\n71\n)\nCash flow commodity hedges\n471\n \n20\n \n(\n7\n)\nFair value currency hedges\n2,511\n \n—\n \n(\n41\n)\nFair value interest rate hedges\n900\n \n—\n \n(\n60\n)\nDerivative instruments without hedge accounting designation\nNon-designated currency hedges\n2,393\n \n18\n \n(\n3\n)\n$\n95\n \n$\n(\n182\n)\n(1)\nForward and swap contracts are measured at fair value based on market-based observable inputs including market spot and forward rates, interest rates, and credit-risk spreads (Level 2).\n \n(2)\nIncluded in receivables and other noncurrent assets.\n(3)\nIncluded in accounts payable and accrued expenses and other noncurrent liabilities.\nDerivative Instruments with Hedge Accounting Designation\nCash Flow Hedges:\n We utilize forward and swap contracts that generally mature within \ntwo years\n designated as cash flow hedges to minimize our exposure to changes in currency exchange rates or commodity prices for certain capital expenditures and manufacturing costs.\nThe effects of cash flow hedging activities were as follows:\nFor the year ended\n2025\n2024\n2023\nGain (loss) from cash flow hedges in accumulated other comprehensive income (loss)\n$\n—\n \n$\n33\n \n$\n30\n \nGain (loss) excluded from effectiveness testing in cost of goods sold\n(\n107\n)\n(\n135\n)\n(\n101\n)\nGain (loss) reclassified from accumulated other comprehensive income (loss) to earnings, primarily to cost of goods sold\n(\n140\n)\n(\n172\n)\n(\n261\n)\nAs of August 28, 2025, we expect to reclassify $\n43\n million of pre-tax gains related to cash flow hedges from accumulated other comprehensive income (loss) into earnings in the next 12 months.\n \n84\nTable of Contents\nFair Value Hedges:\n \nWe utilize currency forward contracts that generally mature within \none year\n designated as fair value hedges to minimize our exposure to changes in currency exchange rates for non-U.S.-dollar-denominated cash and investments in debt securities. The fair value of our hedged cash and investments in debt securities was $\n3.05\n billion as of August 28, 2025. The changes in the fair values of derivatives designated as fair value hedges and the offsetting changes in the underlying fair values of the hedged items are both recognized in earnings. The effects of fair value currency hedges on our consolidated statements of operations, recognized in other non-operating income (expense), net, were not material for the periods presented.\nWe also utilized fixed-to-floating interest rate swaps designated as fair value hedges to minimize certain exposures to changes in the fair value of fixed-rate debt that result from fluctuations in benchmark interest rates. The effects of fair value hedges on our consolidated statements of operations, recognized in interest expense, were not material for the periods presented. In the third quarter of 2025, we prepaid the 2027 Notes and settled the related fixed-to-floating interest rate swaps. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 12. Debt.\nDerivative Instruments without Hedge Accounting Designation\nCurrency Derivatives:\n \nWe generally utilize a rolling hedge strategy with currency forward contracts that mature within \nthree months\n to hedge our exposures of monetary assets and liabilities from changes in currency exchange rates. At the end of each reporting period, monetary assets and liabilities denominated in currencies other than the U.S. dollar are remeasured into U.S. dollars and the associated outstanding forward contracts are marked to market. Realized and unrealized gains and losses on derivative instruments without hedge accounting designation as well as the changes in the underlying monetary assets and liabilities from changes in currency exchange rates are included in other non-operating income (expense), net. The amounts recognized for derivative instruments without hedge accounting designation were not material for the periods presented. We do not use derivative instruments for speculative purposes.\nDerivative Counterparty Credit Risk and Master Netting Arrangements\nOur derivative instruments expose us to credit risk to the extent counterparties may be unable to meet the terms of the contracts. Our maximum exposure to loss due to credit risk if counterparties fail completely to perform according to the terms of the contracts would generally equal the fair value of assets for these contracts as listed in the tables above. We seek to mitigate such risk by limiting our counterparties to major financial institutions and by spreading risk across multiple financial institutions. As of August 28, 2025 and August 29, 2024, amounts netted under our master netting arrangements were not material.\nNote 18. \nEquity Compensation Plans\nAs of August 28, 2025, \n55\n million shares of our common stock were available for future awards under our equity compensation plans, including \n7\n million shares approved for issuance under our employee stock purchase plan (“ESPP”).\nRestricted Stock and Restricted Stock Units (“Restricted Stock Awards”)\nAs of August 28, 2025, there were \n25\n million shares of Restricted Stock Awards outstanding, \n21\n million of which are only subject to service-based vesting conditions. Service-based Restricted Stock Awards generally vest on \n25\n% of the units granted after the first year and on \n6.25\n% each quarter thereafter over the remaining three years of employment. Restricted Stock Awards with performance or market-based vesting conditions vest over a \nthree\n-year period as conditions are met. At the end of the performance period, the number of actual shares to be awarded will vary between \n0\n% and \n200\n% of target amounts, depending upon the achievement level. Our unvested restricted stock awards generally include dividend equivalent rights.\n85 |\n \n2025 10-K\nTable of Contents\nRestricted Stock Awards activity for 2025 is summarized as follows:\nNumber of Shares\nWeighted-Average Grant Date Fair Value Per Share\nOutstanding as of August 29, 2024\n28\n \n$\n65.82\n \nGranted\n11\n \n101.15\n \nVested\n(\n13\n)\n64.10\n \nForfeited\n(\n1\n)\n75.31\n \nOutstanding as of August 28, 2025\n25\n \n82.12\n \nFor the year ended\n2025\n2024\n2023\nRestricted stock award shares granted\n11\n13\n17\nWeighted-average grant-date fair value per share\n$\n101.15\n \n$\n72.72\n \n$\n55.99\n \nAggregate vesting-date fair value of shares vested\n$\n1,322\n \n$\n1,008\n \n$\n514\n \nEmployee Stock Purchase Plan (“ESPP”)\nOur ESPP is offered to substantially all employees and permitted eligible employees to purchase shares of our common stock through payroll deductions of up to \n15\n% of their eligible compensation, subject to certain limitations. The purchase price of the shares under the ESPP equals \n85\n% of the lower of the fair market value of our common stock on either the first or last day of each \nsix\n-month offering period. Compensation expense is calculated as of the beginning of the offering period as the fair value of the employees’ purchase rights utilizing the \nBlack-Scholes\n option valuation model and is recognized over the offering period. \nGrant-date fair value and assumptions used in the Black-Scholes option valuation model were as follows:\nFor the year ended\n2025\n2024\n2023\nWeighted-average grant-date fair value per share\n$\n28.99\n \n$\n26.82\n \n$\n17.06\n \nAverage expected life in years\n0.5\n0.5\n0.5\nWeighted-average expected volatility (based on implied volatility)\n47\n \n%\n41\n \n%\n37\n \n%\nWeighted-average risk-free interest rate\n4.3\n \n%\n5.2\n \n%\n5.1\n \n%\nExpected dividend yield\n0.5\n \n%\n0.5\n \n%\n0.7\n \n%\nUnder the ESPP, employees purchased \n4\n million shares of common stock in each of 2025 and 2024, and \n5\n million shares of common stock in 2023, at a per share weighted-average price of $\n78.12\n, $\n65.72\n, and $\n51.93\n in 2025, 2024, and 2023, respectively.\nStock Options\nAs of August 28, 2025, our outstanding stock options were not material. The total intrinsic value for options exercised was $\n23\n million, $\n92\n million, and $\n30\n million in 2025, 2024, and 2023, respectively.\n \n86\nTable of Contents\nStock-based Compensation Expense\nFor the year ended\n2025\n2024\n2023\nStock-based compensation expense by caption\nCost of goods sold\n$\n409\n \n$\n312\n \n$\n201\n \nResearch and development\n347\n \n296\n \n226\n \nSelling, general, and administrative\n219\n \n213\n \n137\n \nRestructure\n—\n \n—\n \n(\n7\n)\n$\n975\n \n$\n821\n \n$\n557\n \nStock-based compensation expense by type of award\nRestricted stock awards\n$\n877\n \n$\n749\n \n$\n488\n \nESPP\n98\n \n72\n \n69\n \n$\n975\n \n$\n821\n \n$\n557\n \nIncome tax benefits related to the tax deductions for share-based awards are recognized only upon the settlement of the related share-based awards. Income tax benefits for share-based awards were $\n163\n million, $\n140\n million, and $\n68\n million for 2025, 2024, and 2023, respectively. Stock-based compensation expense of $\n96\n million and $\n99\n million was capitalized and remained in inventory as of August 28, 2025 and August 29, 2024, respectively. As of August 28, 2025, $\n1.59\n billion of total unrecognized compensation costs for unvested awards, before the effect of any future forfeitures, was expected to be recognized through the fourth quarter of 2029, resulting in a weighted-average period of \n1.2\n years.\nNote 19. \nEmployee Benefit Plans\nWe have employee retirement plans at our U.S. and international sites. Details of significant plans are as follows:\nEmployee Savings Plan for U.S. Employees\nWe have a 401(k) retirement plan under which U.S. employees may contribute up to \n75\n% of their eligible pay, subject to Internal Revenue Service annual contribution limits, to various savings alternatives, none of which include direct investment in our stock. We match in cash eligible contributions from employees up to \n5\n% of the employee’s annual eligible earnings. Contribution expense for the 401(k) plan was $\n78\n million, $\n66\n million, and $\n59\n million in 2025, 2024, and 2023, respectively.\nRetirement Plans\nWe have pension plans available to employees at various foreign sites. As of August 28, 2025, the projected benefit obligations of our plans were $\n197\n million and plan assets were $\n276\n million. As of August 29, 2024, the projected benefit obligations of our plans were $\n191\n million and plan assets were $\n261\n million. Pension expense was not material for 2025, 2024, or 2023.\nNote 20. \nGovernment Incentives\nWe receive incentives from governmental entities primarily in India, Japan, Singapore, and the United States principally in the form of cash grants and tax credits. These incentives primarily relate to capital expenditures and may be subject to reimbursement if certain conditions are not met or maintained. The conditions attached to these incentives require us to incur expenditures related to the construction of new manufacturing facilities, the purchase and installation of specialized tools and equipment, R&D expenditures, meet and/or maintain operational metrics, and/or maintain certain levels of fixed asset investment or employee headcount during the incentive terms. \n87 |\n \n2025 10-K\nTable of Contents\nGovernment incentives related to capital expenditures have reduced \nproperty, plant and equipment\n by $\n5.04\n billion as of August 28, 2025, of which $\n3.11\n billion pertained to 2025 expenditures. \nIn 2025, operating income (loss) benefited by $\n588\n million (\napproximately \n87\n% in COGS and \n13\n% in R&D\n) from government incentives that reduced depreciation expense and operating incentives, which offset against the related expense in the period the expense was incurred.\nThe line items on the balance sheet affected by government incentives were as follows:\nAs of\nAugust 28,\n2025\nReceivables\n$\n1,572\n \nOther noncurrent assets\n914\n \nNoncurrent unearned government incentives\n1,018\n \nIn addition to the receivables and other noncurrent assets in the table above and cash incentives already received, we had the following commitments from various governmental entities, subject to achievement of certain performance conditions:\nAs of\nAugust 28,\n2025\nU.S.\n$\n5,206\n \nIndia\n1,491\n \nJapan\n929\n \nSingapore\n269\n \nOther\n10\n \n$\n7,905\n \nU.S. CHIPS Act Funding Agreements\nOn December 9, 2024, we entered into direct funding agreements with the U.S. Department of Commerce for up to $\n6.1\n billion in direct funding pursuant to the CHIPS Act for a planned fab in Boise, Idaho and two planned fabs in Clay, New York. On June 11, 2025, we entered into amendments to the direct funding agreements to add a second planned fab in Boise, Idaho and allocated certain award funding from the $\n6.1\n billion grants previously awarded to the second planned Idaho fab. The direct funding for up to $\n6.1\n billion remains unchanged. On June 11, 2025, we also entered into a direct funding agreement with the U.S. Department of Commerce for up to $\n275\n million in direct funding for our fab in Manassas, Virginia. The direct funding agreement for our fab in Virginia is substantially similar to those for our fabs in Idaho and New York. The grants under the funding agreements represent total CHIPS Act grants of up to $\n6.4\n billion in connection with our U.S. manufacturing expansion and modernization projects.\nFunding will be based on the achievement of construction, tool installation, and wafer production milestones. We retain discretion with respect to capacity and production volume ramp of each project. The agreements contain representations, warranties, and covenants that relate to compliance with requirements for awards provided for in the CHIPS Act. In addition, the agreements include certain events of default and related rights and remedies, including clawbacks related to the failure to complete a project by an agreed upon completion date, violation of CHIPS Act restrictions on certain activities involving foreign countries and entities of concern, and impermissible use or disposition of a project.\nWe are permitted to make customary and ordinary course recurring dividends (and reasonable ordinary course increases thereof) consistent with our past practice. There are restrictions on our payment of special and one-time dividends during the five-year period following the Idaho and New York award date of December 9, 2024. Share repurchases are permitted during the first two years of such five-year period up to amounts specified in the funding agreements to help offset the dilutive effects of employee stock compensation or as otherwise permitted by the U.S. Department of Commerce. Share repurchases are not restricted during the final three years of such five-year period if certain financial and other conditions are satisfied.\n \n88\nTable of Contents\nWe may be required to pay upside sharing amounts for a period of up to ten years following the first year in which the cumulative cash flow from a project is positive, if cumulative cash flows from the project exceed a threshold level that is at a significant premium to the baseline projection. The upside sharing amount would equal a modest sharing percentage of the excess cash flows above the threshold level, but not to exceed 75% of award disbursements for a project, after considering any clawbacks or other repayments.\nIn addition to the U.S. commitment amount in the table above, we receive an investment tax credit on qualified investments in U.S. semiconductor manufacturing under the CHIPS Act. On July 4, 2025, the One Big Beautiful Bill Act was enacted, which increased the investment tax credit from \n25\n% to \n35\n% on qualified investments placed into service after December 31, 2025. As qualified investments are made, we recognize investment tax credits in receivables or other noncurrent assets.\nWe have also signed a non-binding term sheet with the state of New York that provides up to $\n5.5\n billion in funding for the planned four-fab facility over the next 20-plus years through a combination of tax credits for qualified capital investments and incentives for eligible new job wages.\nOther Government Incentive Commitments\nWe receive incentives for the construction of a new assembly and test facility in Gujarat, India, representing \n50\n% of the total project cost from the Indian central government and \n20\n% of the total project cost from the state of Gujarat. We also receive incentives from the Japanese Ministry of Economy, Trade and Industry to support the production of DRAM using EUV lithography in Hiroshima, Japan. Subsequent to August 28, 2025, we finalized a new incentive arrangement with the Japanese Ministry of Economy, Trade and Industry to modernize our Hiroshima, Japan manufacturing facility for an additional commitment amount of up to \n500\n billion Japanese yen (approximately $\n3.4\n billion).\nNote 21. \nRevenue and Customer Contract Liabilities\nRevenue by Technology\nFor the year ended\n2025\n2024\n2023\nDRAM\n$\n28,578\n \n$\n17,603\n \n$\n10,978\n \nNAND\n8,503\n \n7,227\n \n4,206\n \nOther (primarily NOR)\n297\n \n281\n \n356\n \n$\n37,378\n \n$\n25,111\n \n$\n15,540\n \nSee Note 27. Segment and Other Information for disclosure of disaggregated revenue by market segment. \nRevenue is primarily recognized at a point in time when control of the promised goods is transferred to our customers in an amount that reflects the consideration we expect to be entitled to in exchange for those goods. Substantially all contracts with our customers are short-term in duration at fixed, negotiated prices with payment generally due shortly after delivery. From time to time, we have contracts with initial terms that include performance obligations that extend beyond one year. As of August 28, 2025, our future performance obligations beyond one year were\n $\n143\n million, which included customer prepayments and other contract liabilities.\nAs of August 28, 2025 and August 29, 2024, customer prepayments made to secure product supply in future periods and other contract liabilities were $\n169\n million and $\n907\n million, respectively, of which $\n26\n million and $\n766\n million were reported in other current liabilities, respectively. The remainder of the customer prepayments and other contract liabilities were in other noncurrent liabilities. Revenue recognized during 2025 from the beginning balance as of August 29, 2024 included $\n778\n million from shipments against customer prepayments and other contract liabilities.\nAs of August 28, 2025 and August 29, 2024, other current liabilities included $\n1.19\n billion and $\n718\n million, respectively, for estimates of consideration payable to customers including estimates for pricing adjustments and returns.\n89 |\n \n2025 10-K\nTable of Contents\nIn 2023, we received an aggregate of $\n228\n million from settlements of insurance claims involving a power disruption in 2022 and an operational disruption in 2017, of which $\n186\n million was for business interruption and recognized in revenue.\nNote 22. \nRestructure and Asset Impairments\nFor the year ended\n2025\n2024\n2023\nEmployee severance\n$\n30\n \n$\n1\n \n$\n163\n \nAsset impairments and other asset-related costs\n9\n \n—\n \n14\n \nOther\n—\n \n—\n \n(\n6\n)\n$\n39\n \n$\n1\n \n$\n171\n \nIn 2023, we initiated a restructure plan in response to challenging industry conditions. Under the plan, we reduced our headcount by approximately \n15\n% by the end of calendar 2023, through a combination of voluntary attrition and personnel reductions. The plan was substantially completed in 2023.\nNote 23. \nOther Operating (Income) Expense, Net\nFor the year ended\n2025\n2024\n2023\nPatent license charges\n$\n57\n \n$\n—\n \n$\n—\n \nGoodwill impairment\n—\n \n—\n \n101\n \nLitigation settlement\n—\n \n—\n \n68\n \nPatent cross-license agreement gain\n—\n \n(\n200\n)\n—\n \nOther\n4\n \n(\n51\n)\n(\n45\n)\n$\n61\n \n$\n(\n251\n)\n$\n124\n \nNote 24. \nOther Non-Operating Income (Expense), Net\nFor the year ended\n2025\n2024\n2023\nGain (loss) from changes in currency exchange rates\n$\n(\n72\n)\n$\n(\n13\n)\n$\n10\n \nLoss on debt prepayments\n(\n59\n)\n(\n1\n)\n—\n \nOther\n(\n4\n)\n(\n17\n)\n(\n3\n)\n$\n(\n135\n)\n$\n(\n31\n)\n$\n7\n \n \n90\nTable of Contents\nNote 25. \nIncome Taxes\nOur income tax (provision) benefit consisted of the following:\nFor the year ended\n2025\n2024\n2023\nIncome (loss) before income taxes and equity in net income (loss) of equity method investees\nU.S.\n$\n686\n \n$\n544\n \n$\n235\n \nForeign\n8,968\n \n696\n \n(\n5,893\n)\n \n$\n9,654\n \n$\n1,240\n \n$\n(\n5,658\n)\nIncome tax (provision) benefit\nCurrent\nU.S. federal\n$\n(\n275\n)\n$\n(\n82\n)\n$\n(\n5\n)\nState\n(\n15\n)\n(\n1\n)\n(\n1\n)\nForeign\n(\n670\n)\n(\n333\n)\n(\n178\n)\n \n(\n960\n)\n(\n416\n)\n(\n184\n)\nDeferred\nU.S. federal\n(\n118\n)\n18\n \n(\n84\n)\nState\n—\n \n—\n \n—\n \nForeign\n(\n46\n)\n(\n53\n)\n91\n \n(\n164\n)\n(\n35\n)\n7\n \nIncome tax (provision) benefit\n$\n(\n1,124\n)\n$\n(\n451\n)\n$\n(\n177\n)\nThe table below reconciles our tax (provision) benefit based on the U.S. federal statutory rate to our effective rate:\nFor the year ended\n2025\n2024\n2023\nU.S. federal income tax (provision) benefit at statutory rate\n$\n(\n2,027\n)\n21.0\n \n%\n$\n(\n260\n)\n21.0\n \n%\n$\n1,188\n \n21.0\n \n%\nU.S. tax on foreign operations\n(\n476\n)\n4.9\n \n(\n7\n)\n0.6\n \n6\n \n0.1\n \nChange in valuation allowance\n36\n \n(\n0.4\n)\n(\n59\n)\n4.8\n \n(\n50\n)\n(\n0.9\n)\nChange in unrecognized tax benefits\n(\n23\n)\n0.2\n \n(\n41\n)\n3.3\n \n(\n30\n)\n(\n0.5\n)\nForeign tax rate differential\n1,132\n \n(\n11.7\n)\n(\n214\n)\n17.2\n \n(\n1,285\n)\n(\n22.8\n)\nResearch and development tax credits\n208\n \n(\n2.2\n)\n76\n \n(\n6.1\n)\n43\n \n0.8\n \nState taxes, net of federal benefit\n(\n7\n)\n0.1\n \n12\n \n(\n1.0\n)\n37\n \n0.7\n \nOther\n33\n \n(\n0.3\n)\n42\n \n(\n3.4\n)\n(\n86\n)\n(\n1.5\n)\nIncome tax (provision) benefit\n$\n(\n1,124\n)\n11.6\n \n%\n$\n(\n451\n)\n36.4\n \n%\n$\n(\n177\n)\n(\n3.1\n)\n%\nWe operate in a number of jurisdictions outside the United States, including Singapore, where we have tax incentive arrangements. These incentives expire, in whole or in part, at various dates through 2034 and are conditional, in part, upon meeting certain business operations and employment thresholds. The effect of tax incentive arrangements reduced our tax provision by $\n1.05\n billion (benefiting our diluted earnings per share by $\n0.93\n) for 2025. As a result of low level of profitability and geographic mix of income, the benefit from tax incentive arrangements was not material for 2024 or 2023.\nAs of August 28, 2025, certain non-U.S. subsidiaries had cumulative undistributed earnings of $\n4.31\n billion that were deemed to be indefinitely reinvested. A provision has not been recognized to the extent that distributions from such subsidiaries are subject to additional foreign withholding or state income tax. Determination of the amount of unrecognized deferred tax liabilities related to investments in these foreign subsidiaries is not practicable.\n91 |\n \n2025 10-K\nTable of Contents\nDeferred income taxes reflect the net tax effects of temporary differences between the bases of assets and liabilities for financial reporting and income tax purposes as well as carryforwards. \nDeferred tax assets and liabilities consist of the following:\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nDeferred tax assets\nNet operating loss and tax credit carryforwards\n$\n1,016\n \n$\n1,050\n \nAccrued salaries, wages, and benefits\n203\n \n182\n \nOperating lease liabilities\n192\n \n175\n \nInventories\n25\n \n4\n \nOther\n37\n \n59\n \nGross deferred tax assets\n1,473\n \n1,470\n \nLess valuation allowance\n(\n634\n)\n(\n593\n)\nDeferred tax assets, net of valuation allowance\n839\n \n877\n \nDeferred tax liabilities\nRight-of-use assets\n(\n163\n)\n(\n152\n)\nProperty, plant, and equipment\n(\n6\n)\n(\n194\n)\nOther\n(\n106\n)\n(\n70\n)\nDeferred tax liabilities\n(\n275\n)\n(\n416\n)\nNet deferred tax assets\n$\n564\n \n$\n461\n \nReported as\nDeferred tax assets\n$\n616\n \n$\n520\n \nDeferred tax liabilities (included in other noncurrent liabilities)\n(\n52\n)\n(\n59\n)\nNet deferred tax assets\n$\n564\n \n$\n461\n \nWe assess positive and negative evidence for each jurisdiction to determine whether it is more likely than not that existing deferred tax assets will be realized. As of August 28, 2025, and August 29, 2024, we had a valuation allowance of $\n634\n million and $\n593\n million, respectively, against our net deferred tax assets, primarily related to carryforwards in U.S. states and Malaysia. Changes in 2025 in the valuation allowance were due to adjustments based on management's assessment of the realizability of tax credits, allowances and net operating losses based on a level that is more likely than not to be realized.\nAs of August 28, 2025, our net operating loss carryforward amounts and expiration periods, as reported to tax authorities, were as follows:\nYear of Expiration\nSingapore\nMalaysia\nState\nJapan\nTotal\n2026 - 2030\n$\n—\n \n$\n—\n \n$\n29\n \n$\n—\n \n$\n29\n \n2031 - 2035\n—\n \n—\n \n139\n \n308\n \n447\n \n2036 - 2040\n—\n \n—\n \n192\n \n—\n \n192\n \n2041 - 2045\n—\n \n—\n \n71\n \n—\n \n71\n \nIndefinite\n2,511\n \n1,437\n \n—\n \n—\n \n3,948\n \n$\n2,511\n \n$\n1,437\n \n$\n431\n \n$\n308\n \n$\n4,687\n \n \n92\nTable of Contents\nAs of August 28, 2025, our tax credit carryforward amounts and expiration periods, as reported to tax authorities, were as follows:\nYear of Tax Credit Expiration\nU.S. Federal\nState\nOther\nTotal\n2026 - 2030\n$\n—\n \n$\n72\n \n$\n—\n \n$\n72\n \n2031 - 2035\n36\n \n145\n \n—\n \n181\n \n2036 - 2040\n—\n \n141\n \n40\n \n181\n \n2041 - 2046\n—\n \n6\n \n—\n \n6\n \nIndefinite\n—\n \n159\n \n—\n \n159\n \n$\n36\n \n$\n523\n \n$\n40\n \n$\n599\n \nBelow is a reconciliation of the beginning and ending amount of our unrecognized tax benefits:\nFor the year ended\n2025\n2024\n2023\nBeginning unrecognized tax benefits\n$\n716\n \n$\n744\n \n$\n731\n \nIncreases related to tax positions from prior years\n11\n \n2\n \n2\n \nIncreases related to prior year tax positions taken in current year\n—\n \n20\n \n27\n \nIncreases related to tax positions taken in current year\n55\n \n54\n \n17\n \nDecreases related to tax positions from prior years\n(\n8\n)\n(\n89\n)\n(\n33\n)\nDecreases related to settlement with tax authorities\n—\n \n(\n15\n)\n—\n \nReductions due to lapsed statutes of limitations\n(\n39\n)\n—\n \n—\n \nEnding unrecognized tax benefits\n$\n735\n \n$\n716\n \n$\n744\n \nAs of August 28, 2025, gross unrecognized tax benefits were $\n735\n million, which would have an impact of approximately $\n611\n million on our effective tax rate in the future, if recognized. Amounts accrued for interest and penalties related to uncertain tax positions were not material for any period presented. The resolution of tax audits or expiration of statute of limitations could also reduce our unrecognized tax benefits. Although the timing of final resolution is uncertain, the estimated potential reduction in our unrecognized tax benefits in the next 12 months would not be significant.\nWe and our subsidiaries file income tax returns with the U.S. federal government, various U.S. states, and various foreign jurisdictions throughout the world. We regularly engage in discussions and negotiations with tax authorities regarding tax matters, including transfer pricing, and we continue to defend any and all such claims presented. Our U.S. federal and state tax returns remain open to examination for 2018 through 2025. We are currently under audit by the Internal Revenue Service for our 2018 and 2019 tax years. In addition, tax returns that remain open to examination in Singapore, Taiwan and Japan range from the years 2017 to 2025. We believe that adequate amounts of taxes and related interest and penalties have been provided, and any adjustments as a result of examinations are not expected to materially adversely affect our business, results of operations, or financial condition.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted, introducing broad changes to the U.S. tax code, including modifications to corporate and international tax provisions, which primarily are effective for us beginning in 2026 and 2027. The aggregate impact of the OBBBA remains uncertain. We will continue to monitor future developments, including regulatory guidance and interpretations, which could have a material impact.\n93 |\n \n2025 10-K\nTable of Contents\nNote 26. \nEarnings Per Share\nFor the year ended\n2025\n2024\n2023\nNet income (loss) – Basic and Diluted\n$\n8,539\n \n$\n778\n \n$\n(\n5,833\n)\nWeighted-average common shares outstanding – Basic\n1,116\n \n1,105\n \n1,093\n \nDilutive effect of equity compensation plans\n9\n \n13\n \n—\n \nWeighted-average common shares outstanding – Diluted\n1,125\n \n1,118\n \n1,093\n \nEarnings (loss) per share\nBasic\n$\n7.65\n \n$\n0.70\n \n$\n(\n5.34\n)\nDiluted\n7.59\n \n0.70\n \n(\n5.34\n)\nAntidilutive potential common shares excluded from the computation of diluted earnings per share, that could dilute basic earnings per share in the future, were as follows at the end of the periods shown:\nFor the year ended\n2025\n2024\n2023\nEquity compensation plans\n6\n \n3\n \n33\n \nNote 27. \nSegment and Other Information\nWe initiated a strategic reorganization of our business units to a market segment-focused business unit structure, with AI growth opportunities in every business unit. We completed the reorganization of our operations and organizational structure and began to manage operations under our new segment structure effective in the fourth quarter of 2025. As high-performance memory and storage become increasingly vital to drive the growth of AI, this business unit reorganization allows us to stay at the forefront of innovation in each market segment through deeper customer engagement and to address the dynamic needs of the industry. \nAll prior-period segment amounts have been retrospectively adjusted to reflect the way our Chief Executive Officer, who is our Chief Operating Decision Maker (“CODM”), assesses the performance of our segments based on segment revenue, cost of goods sold, operating expenses, and operating income (loss). The segment information reported herein is regularly provided to and reviewed and evaluated by our CODM to budget, forecast, and decide how to allocate resources for capital investments, human capital, and other strategic investments across our segments. There are no changes to our Consolidated Financial Statements for any prior periods.\nWe have the following \nfour\n business units, which are our reportable segments:\n•\nCloud Memory Business Unit (“CMBU”): \nFocused on memory solutions for large hyperscale cloud customers, and HBM for all data center customers. \n•\nCore Data Center Business Unit (“CDBU”): \nFocused on memory solutions for mid-tier cloud, enterprise, and OEM data center customers and storage solutions for all data center customers.\n•\nMobile and Client Business Unit (“MCBU”): \nFocused on memory and storage solutions for the mobile and client segments.\n•\nAutomotive and Embedded Business Unit (“AEBU”): \nFocused on memory and storage solutions for the automotive, industrial, and consumer segments.\nOur other operations do not meet the thresholds of a reportable segment and are reported under All Other. Certain operating expenses directly associated with the activities of a specific segment are charged to that segment. Other indirect operating income and expenses are generally allocated to segments based on their respective percentage of cost of goods sold or forecasted wafer production. Certain income and expenses are not allocated to segments because our CODM does not consider these amounts in the assessment of the performance of our segments. The unallocated amounts primarily include stock-based compensation, the impact of inventory NRV write-downs, gains and losses from settlements, restructure and asset impairment, and goodwill impairment.\n \n94\nTable of Contents\nFor the year ended 2025\nCMBU\nCDBU\nMCBU\nAEBU\nAll Other\nUnallocated\nTotal\nRevenue\n$\n13,524\n \n$\n7,229\n \n$\n11,859\n \n$\n4,753\n \n$\n13\n \n$\n—\n \n$\n37,378\n \nCost of goods sold\n5,867\n \n3,995\n \n8,650\n \n3,566\n \n14\n \n413\n \n22,505\n \nGross margin\n7,657\n \n3,234\n \n3,209\n \n1,187\n \n(\n1\n)\n(\n413\n)\n14,873\n \nResearch and development\n1,315\n \n864\n \n836\n \n435\n \n—\n \n348\n \n3,798\n \nSelling, general, and administrative\n213\n \n188\n \n390\n \n195\n \n—\n \n219\n \n1,205\n \nRestructure and asset impairment\n—\n \n—\n \n—\n \n—\n \n—\n \n39\n \n39\n \nOther operating (income) expense, net\n—\n \n2\n \n2\n \n—\n \n—\n \n57\n \n61\n \nOperating income (loss)\n$\n6,129\n \n$\n2,180\n \n$\n1,981\n \n$\n557\n \n$\n(\n1\n)\n$\n(\n1,076\n)\n$\n9,770\n \nFor the year ended 2024\nCMBU\nCDBU\nMCBU\nAEBU\nAll Other\nUnallocated\nTotal\nRevenue\n$\n3,792\n \n$\n4,984\n \n$\n11,667\n \n$\n4,631\n \n$\n37\n \n$\n—\n \n$\n25,111\n \nCost of goods sold\n2,677\n \n3,638\n \n10,222\n \n3,598\n \n20\n \n(\n657\n)\n19,498\n \nGross margin\n1,115\n \n1,346\n \n1,445\n \n1,033\n \n17\n \n657\n \n5,613\n \nResearch and development\n769\n \n960\n \n994\n \n425\n \n—\n \n282\n \n3,430\n \nSelling, general, and administrative\n107\n \n139\n \n485\n \n186\n \n(\n1\n)\n213\n \n1,129\n \nRestructure and asset impairment\n—\n \n—\n \n—\n \n—\n \n—\n \n1\n \n1\n \nOther operating (income) expense, net\n(\n5\n)\n(\n8\n)\n(\n33\n)\n(\n10\n)\n—\n \n(\n195\n)\n(\n251\n)\nOperating income (loss)\n$\n244\n \n$\n255\n \n$\n(\n1\n)\n$\n432\n \n$\n18\n \n$\n356\n \n$\n1,304\n \nFor the year ended 2023\nCMBU\nCDBU\nMCBU\nAEBU\nAll Other\nUnallocated\nTotal\nRevenue\n$\n1,872\n \n$\n2,124\n \n$\n7,394\n \n$\n4,139\n \n$\n11\n \n$\n—\n \n$\n15,540\n \nCost of goods sold\n1,801\n \n1,967\n \n9,072\n \n2,905\n \n4\n \n1,207\n \n16,956\n \nGross margin\n71\n \n157\n \n(\n1,678\n)\n1,234\n \n7\n \n(\n1,207\n)\n(\n1,416\n)\nResearch and development\n755\n \n622\n \n1,122\n \n389\n \n—\n \n226\n \n3,114\n \nSelling, general, and administrative\n90\n \n104\n \n414\n \n176\n \n(\n1\n)\n137\n \n920\n \nRestructure and asset impairment\n—\n \n—\n \n—\n \n—\n \n—\n \n171\n \n171\n \nOther operating (income) expense, net\n(\n6\n)\n(\n6\n)\n(\n25\n)\n(\n11\n)\n—\n \n172\n \n124\n \nOperating income (loss)\n$\n(\n768\n)\n$\n(\n563\n)\n$\n(\n3,189\n)\n$\n680\n \n$\n8\n \n$\n(\n1,913\n)\n$\n(\n5,745\n)\n95 |\n \n2025 10-K\nTable of Contents\nThe table below presents the unallocated amounts:\nFor the year ended\n2025\n2024\n2023\nUnallocated\nCost of goods sold:\nStock-based compensation\n$\n409\n \n$\n312\n \n$\n201\n \nProvision to write down inventories to net realizable value\n—\n \n—\n \n1,831\n \nLower costs from sale of inventory written down in prior periods\n—\n \n(\n987\n)\n(\n844\n)\nOther\n4\n \n18\n \n19\n \n413\n \n(\n657\n)\n1,207\n \nResearch and development:\nStock-based compensation\n347\n \n296\n \n226\n \nOther\n1\n \n(\n14\n)\n—\n \n348\n \n282\n \n226\n \nSelling, general, and administrative:\nStock-based compensation\n219\n213\n137\nRestructure and asset impairment:\n39\n \n1\n \n171\n \nOther operating (income) expense, net:\nPatent license charges\n57\n \n—\n \n—\n \nGoodwill impairment\n—\n \n—\n \n101\n \nLitigation settlement\n—\n \n—\n \n68\n \nPatent cross-license agreement gain\n—\n \n(\n200\n)\n—\n \nOther\n—\n \n5\n \n3\n \n57\n \n(\n195\n)\n172\n \nTotal unallocated amounts\n$\n1,076\n \n$\n(\n356\n)\n$\n1,913\n \nDepreciation and amortization expense included in operating income (loss) was as follows:\nFor the year ended\n2025\n2024\n2023\nCMBU\n$\n2,260\n \n$\n1,112\n \n$\n909\n \nCDBU\n1,530\n \n1,434\n \n1,020\n \nMCBU\n3,177\n \n3,762\n \n4,319\n \nAEBU\n1,375\n \n1,447\n \n1,486\n \nAll Other\n5\n \n7\n \n3\n \nUnallocated\n5\n \n18\n \n19\n \n$\n8,352\n \n$\n7,780\n \n$\n7,756\n \nWe do not identify or report internally our assets (other than goodwill) or capital expenditures by segment, nor do we allocate gains and losses from equity method investments, interest, other non-operating income or expense items, or taxes to segments.\nAs a result of reorganizing our segments in the fourth quarter of 2025, we reallocated goodwill among our reporting units on a relative fair value basis. We performed a quantitative goodwill impairment assessment for each of our reporting units immediately before and after our business unit reorganization. We concluded based on both our pre- and post-reorganization impairment assessments that goodwill was not impaired. As of August 28, 2025, CMBU, CDBU, MCBU, and AEBU had goodwill of $\n654\n million, $\n109\n million, $\n284\n million, and $\n103\n million, respectively.\n \n96\nTable of Contents\nWe performed a qualitative assessment for goodwill impairment in 2024 and did not identify any impairment indicators for our reporting units. Due to global and macroeconomic challenges, as well as lower expected demand resulting from customer actions to reduce elevated inventory levels, in 2023, we performed a quantitative assessment for goodwill impairment for each of our reporting units. We evaluated the fair value of our reporting units based on an income approach, using a discounted cash flow methodology. We recognized a $\n101\n million charge in 2023, included in other operating income (loss) to impair all of the goodwill assigned to our former Storage Business Unit based on our best estimates of projected future cash flows at that time.\nNote 28. \nCertain Concentrations\nOur business units are based on market segments. See Note 27. Segment and Other Information for disclosure of disaggregated revenue by market segment. Revenue from one customer was \n17\n% (primarily included in the CMBU segment) of total revenue for 2025. Revenue from one customer was \n10\n% (primarily included in the MCBU, AEBU, and CMBU segments) of total revenue for 2024. No customer accounted for 10% or more of total revenue in 2023.\nWe generally have multiple sources of supply for our raw materials and production equipment; however, only a limited number of suppliers are capable of delivering certain raw materials and production equipment that meet our standards and, in some cases, materials or production equipment are provided by a single supplier.\nFinancial instruments that potentially subject us to concentrations of credit risk consist principally of cash, money market accounts, certificates of deposit, fixed-income securities, trade receivables, share repurchase, and derivative contracts. We invest through high-credit-quality financial institutions and, by policy, generally limit the concentration of credit exposure by restricting investments with any single obligor and monitor credit risk of bank counterparties on an ongoing basis. A concentration of credit risk may exist with respect to receivables of certain customers. We perform ongoing credit evaluations of customers worldwide and generally do not require collateral from our customers. Historically, we have not experienced material losses on receivables. A concentration of risk may also exist with respect to our derivative hedging programs as the number of counterparties to our hedges is limited and the notional amounts are relatively large. We seek to mitigate such risk by limiting our counterparties to major financial institutions and through entering into master netting arrangements.\n97 |\n \n2025 10-K\nTable of Contents\nNote 29. \nGeographic Information\nRevenue based on the geographic location of our customers’ headquarters was as follows:\nFor the year ended\n2025\n2024\n2023\nU.S.\n$\n24,113\n \n$\n13,168\n \n$\n7,805\n \nTaiwan\n5,672\n \n4,708\n \n2,697\n \nMainland China (excluding Hong Kong)\n2,639\n \n3,045\n \n2,181\n \nOther Asia Pacific\n1,913\n \n1,330\n \n752\n \nHong Kong\n1,138\n \n1,071\n \n340\n \nJapan\n895\n \n840\n \n987\n \nEurope\n625\n \n818\n \n682\n \nOther\n383\n \n131\n \n96\n \n$\n37,378\n \n$\n25,111\n \n$\n15,540\n \nLong-lived assets by geographic area consisted of property, plant, and equipment and operating lease right-of-use assets and were as follows:\nAs of\nAugust 28,\n2025\nAugust 29,\n2024\nTaiwan\n$\n18,965\n \n$\n14,156\n \nSingapore\n10,669\n \n10,588\n \nU.S.\n8,445\n \n6,508\n \nJapan\n7,038\n \n7,085\n \nMalaysia\n1,124\n \n1,153\n \nChina\n544\n \n486\n \nIndia\n449\n \n338\n \nOther\n92\n \n80\n \n$\n47,326\n \n$\n40,394\n \n \n98\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Board of Directors and Shareholders of Micron Technology, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Micron Technology, Inc. and its subsidiaries (the “Company”) as of August 28, 2025\n \nand August 29, 2024,\n \nand the related consolidated\n \nstatements of operations, of comprehensive income (loss), of changes in equity and of cash flows for each of the three years in the period ended August 28, 2025, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended August 28, 2025 appearing under Item 15 (collectively referred to as the “consolidated financial statements”).\n \nWe also have audited the Company’s internal control over financial reporting as of August 28, 2025, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of August 28, 2025\n \nand August 29, 2024\n, \nand the results of its operations and its cash flows for each of the three years in the period ended August 28, 2025\n \nin conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of August 28, 2025, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the COSO.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n99 |\n \n2025 10-K\nTable of Contents\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAccounting for the U.S. CHIPS Act Funding Agreements\nAs described in Notes 1 and 20 to the consolidated financial statements, the Company has entered into direct funding agreements with the U.S. Department of Commerce for up to $6.4 billion in direct funding pursuant to the U.S. CHIPS Act for the Company’s U.S. manufacturing expansion and modernization projects in Idaho, New York, and Virginia. Funding will be based on the achievement of construction, tool installation, and wafer production milestones. The agreements contain representations, warranties, and covenants that relate to compliance with requirements for awards provided for in the U.S. CHIPS Act. In addition, the agreements include certain events of default and related rights and remedies, including clawbacks related to the failure to complete a project by an agreed upon completion date, violation of U.S. CHIPS Act restrictions on certain activities involving foreign countries and entities of concern, and impermissible use or disposition of a project. Government incentives are recognized in the financial statements based on the underlying principal criteria for earning the incentives when there is reasonable assurance that the conditions of the government incentives are met and the incentive will be received. Incentives related to the acquisition or construction of property, plant and equipment are recognized as a reduction in the carrying amounts of the related assets and as a reduction of subsequent depreciation expense over the useful lives of the assets. For each project, the Company estimates the total expected project costs and recognizes a proportionate benefit as qualified project costs are incurred. As the estimated total expected qualified project cost changes, the Company adjusts the estimate of the recognized proportionate benefit.\nThe principal considerations for our determination that performing procedures relating to accounting for the U.S. CHIPS Act funding agreements is a critical audit matter are (i) the significant judgment by management in assessing the accounting for the funding agreements, including the recognition of the proportionate benefit and the impacts of potential outcomes associated with compliance with covenants related to events of default and (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence related to management’s assessment of the accounting for the funding agreements, including the assessment of the proportionate benefit and the compliance with covenants.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s assessment of the accounting for the U.S. CHIPS Act funding agreements, including controls over the recognition of the proportionate benefit and compliance with covenants related to events of default and the related disclosures. These procedures also included, among others (i) evaluating the completeness and accuracy of management’s identification of key terms and conditions by obtaining and inspecting \n \n100\nTable of Contents\nthe U.S. CHIPS Act funding agreements; (ii) evaluating whether the principal criteria, including milestone attainment and capital expenditures, for recognizing government incentives are probable, that the terms of the incentives are met, and that the incentives will be received; (iii) evaluating the reasonableness of management’s estimate of the total expected project costs and recognition of a proportionate benefit; (iv) tracing cash payments received from the U.S. Department of Commerce to supporting documentation, such as bank statements; and (v) evaluating the sufficiency of the Company’s disclosures related to the U.S. CHIPS Act funding agreements.\n/s/ \nPricewaterhouseCoopers LLP\nSan Jose, California\nOctober 3, 2025\nWe have served as the Company’s auditor since 1984.\n101 |\n \n2025 10-K\nTable of Contents\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nAn evaluation was carried out under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) as of the end of the period covered by this report. Based upon that evaluation, the principal executive officer and principal financial officer concluded that those disclosure controls and procedures were effective to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act are recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms and that such information is accumulated and communicated to our management, including the principal executive officer and principal financial officer, to allow timely decisions regarding disclosure.\nDuring the fourth quarter of 2025, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that our internal control over financial reporting was effective as of August 28, 2025. The effectiveness of our internal control over financial reporting as of August 28, 2025 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report, which is included in Part II, Item 8, of this Annual Report on Form 10-K.\n \n102\nTable of Contents\nITEM 9B. OTHER INFORMATION\nSecurities Trading Plans of Directors and Executive Officers\nThe following officers, as defined in Rule 16a-1(f) of the Exchange Act, adopted and/or terminated a “Rule 10b5-1 trading arrangement” or a “non-Rule 10b5-1 trading arrangement,” as defined in Item 408 of Regulation S-K, during the last fiscal quarter. \nOn \nJuly 24, 2025\n, \nScott DeBoer\n our \nExecutive Vice President, Chief Technology and Products Officer\n, \nadopted\n a Rule 10b5-1 trading arrangement providing for the sale of an aggregate of up to \n82,000\n shares of our common stock. The trading arrangement is intended to satisfy the affirmative defense in Rule 10b5-1(c). The first date that sales of any shares are permitted to be sold under the trading arrangement is October 25, 2025, and subsequent sales under the trading arrangement may occur on a regular basis for the duration of the trading arrangement. \nThe trading arrangement will terminate no less than one year from the date the plan is entered into, or earlier if all transactions under the trading arrangement are completed.\nOn \nJuly 31, 2025\n, \nMark Murphy\n, our \nExecutive Vice President and Chief Financial Officer\n, \nmodified\n an existing Rule 10b5-1 trading arrangement that was originally entered into on April 22, 2025. The modified trading arrangement provides for the sale of up to \n126,000\n shares of common stock. The first date that sales of any shares are permitted to be sold under the modified trading arrangement, is October 30, 2025, and subsequent sales may occur from time to time for the duration of the trading arrangement until \nJuly 31, 2026\n, or earlier if all transactions under the trading arrangement are completed. The modified trading arrangement is intended to satisfy the affirmative defense in Rule 10b5-1(c).\nNo other directors or officers, as defined in Rule 16a-1(f), \nadopted\n and/or \nterminated\n a “Rule 10b5-1 trading arrangement” or a “non-Rule 10b5-1 trading arrangement,” as defined in Item 408 of Regulation S-K, during the last fiscal quarter.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nCertain information concerning our executive officers is included under the caption, “Information About Our Executive Officers” in Part I, Item 1 of this report. Other information required by Items 10, 11, 12, 13, and 14 will be contained in our 2025 Proxy Statement which will be filed with the SEC within 120 days after August 28, 2025 and is incorporated herein by reference.\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nITEM 11. EXECUTIVE COMPENSATION\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\n103 |\n \n2025 10-K\nTable of Contents\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n(a)  The following documents are filed as part of this report:\n1\nFinancial Statements: See our consolidated financial statements under Item 8.\n2\nFinancial Statement Schedule:\nSee “Schedule II – Valuation and Qualifying Accounts” within Item 15 below.\nCertain Financial Statement Schedules have been omitted since they are either not required, not applicable, or the information is otherwise included.\n3\nExhibits. See “Index to Exhibits” within Item 15 below.\n \n104\nTable of Contents\nSCHEDULE II\nVALUATION AND QUALIFYING ACCOUNTS\n(In millions)\n \nBalance at\nBeginning of\nYear\nCharged\n(Credited) to\nIncome Tax\nProvision\nCurrency \nTranslation \nand Charges\nto Other\nAccounts\nBalance at\nEnd of\nYear\nDeferred Tax Asset Valuation Allowance\n \n \n \n \nYear ended August 28, 2025\n$\n593\n \n$\n35\n \n$\n6\n \n$\n634\n \nYear ended August 29, 2024\n528\n \n57\n \n8\n \n593\n \nYear ended August 31, 2023\n471\n \n58\n \n(\n1\n)\n528\n \n105 |\n \n2025 10-K\nTable of Contents\nIndex to Exhibits\nExhibit Number\nDescription of Exhibit\nFiled Herewith\nForm\nPeriod Ending\nExhibit/ Appendix\nFiling Date\n3.1\nRestated Certificate of Incorporation of the Registrant\n8-K\n99.2\n1/26/15\n3.2\nAmended and Restated Bylaws of Registrant as of July\n \n17\n, 202\n5\n8-K\n3.1\n7/18/25\n4.1\nIndenture, dated as of February\n \n6, 2019, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association (as successor in interest to U.S. Bank National Association), as Trustee\n8-K\n4.1\n2/6/19\n4.2\nFirst Supplemental Indenture, dated as of February 6, 2019, by and between Micron Technology, Inc. and U.S. Bank National Association, as Trustee\n8-K\n4.2\n2/6/19\n4.3\nForm of Note for Micron Technology, Inc.’s 5.327% Senior Notes due 2029 (included in Exhibit\n \n4.2)\n8-K\n4.5\n2/6/19\n4.4\nSecond Supplemental Indenture, dated as of July\n \n12, 2019, by and between Micron Technology,\n \nInc. and U.S. Bank National Association, as Trustee\n8-K\n4.2\n7/12/19\n4.5\nForm of Note for Micron Technology,\n \nInc.’s 4.663% Senior Notes due 2030 (included in Exhibit\n \n4.\n4\n)\n8-K\n4.4\n7/12/19\n4.6\nFourth Supplemental Indenture, dated as of November\n \n1, 2021, by and between Micron Technology,\n \nInc. and U.S. Bank National Association, as Trustee\n8-K\n4.2\n11/1/21\n4.7\nForm of Note for Micron Technology,\n \nInc.’s 2.703% Senior Notes due 2032 (included in Exhibit\n \n4.\n6\n)\n8-K\n4.3\n11/1/21\n4.8\nForm of Note for Micron Technology,\n \nInc.’s 3.366% Senior Notes due 2041 (included in Exhibit\n \n4.\n6\n)\n8-K\n4.4\n11/1/21\n4.9\nForm of Note for Micron Technology,\n \nInc.’s 3.477% Senior Notes due 2051 (included in Exhibit\n \n4.\n6\n)\n8-K\n4.5\n11/1/21\n4.10\nDescription of Registrant’s Securities\n10-K\n9/1/22\n4.12\n10/7/22\n4.11\nFifth Supplemental Indenture, dated as of October\n \n31, 2022, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.2\n10/31/22\n4.12\nForm of Note for Micron Technology,\n \nInc.’s 6.750% Senior Notes due 2029 (included in Exhibit\n \n4.1\n1\n)\n8-K\n4.3\n10/31/22\n4.13\nSixth Supplemental Indenture, dated as of February\n \n9, 2023, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.3\n2/9/23\n4.14\nForm of Note for Micron Technology,\n \nInc.’s 5.875% Senior Notes due 2033 (included in Exhibit\n \n4.1\n3\n)\n8-K\n4.5\n2/9/23\n4.15\nSeventh Supplemental Indenture, dated as of April\n \n11, 2023, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.2\n4/11/23\n4.16\nForm of Note for Micron Technology,\n \nInc.’s 5.375% Senior Notes due 2028 (included in Exhibit\n \n4.1\n5\n)\n8-K\n4.3\n4/11/23\n4.17\nForm of Note for Micron Technology,\n \nInc.’s 5.875% Senior Notes due 2033 (included in Exhibit\n \n4.1\n5\n)\n8-K\n4.4\n4/11/23\n4.18\nEighth Supplemental Indenture, dated as of January\n \n12, 2024, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.2\n1/12/24\n4.19\nForm of Note for Micron Technology,\n \nInc.’s 5.30% Senior Notes due 2031 (incorporated by reference from Exhibit\n \n4.\n1\n8\n hereto)\n8-K\n4.3\n1/12/24\n4.20\nN\ninth Supplemental Indenture, dated as of January\n \n16, 202\n5, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.2\n1/16/25\n4.21\nF\norm of Note for Micron Technology,\n \nInc.\n’\ns 5.\n80% Senior N\notes due 20\n35 (included in Exhibit\n \n4.\n2\n0\n)\n8-K\n4.3\n1/16/25\n \n106\nTable of Contents\nExhibit Number\nDescription of Exhibit\nFiled Herewith\nForm\nPeriod Ending\nExhibit/ Appendix\nFiling Date\n4.22\nTenth Supplemental Indenture, dated as of April\n \n29, 2025, by and between Micron Technology,\n \nInc. and U.S. Bank Trust Company, National Association, as Trustee\n8-K\n4.2\n4/29/25\n4.23\nForm of Note for Micron Technology,\n \nInc.’s 5.65% Senior Notes due 2032 (included in Exhibit\n \n4.\n2\n2\n)\n8-K\n4.3\n4/29/25\n4.24\nForm of Note for Micron Technology,\n \nInc.’s 6.05% Senior Notes due 2035 (included in Exhibit\n \n4.\n2\n2\n)\n8-K\n4.4\n4/29/25\n10.1*\nMicron Technology,\n \nInc. Executive Officer Performance Incentive Plan\nDEF 14A\nB\n12/7/17\n10.2*\nAmended and Restated 2004 Equity Incentive Plan\n10-Q\n12/1/22\n10.1\n12/22/22\n10.3*\n2004 Equity Incentive Plan Forms of Agreement and Terms and Conditions\n10-Q\n12/1/22\n10.2\n12/22/22\n10.4*\nAmended and Restated 2007 Equity Incentive Plan\nDEF 14A\nA\n12/1/20\n10.5*\n2007 Equity Incentive Plan Forms of Agreement and Terms and Conditions\n10-Q\n12/1/22\n10.3\n12/22/22\n10.6*\nNonstatutory Stock Option Plan, as \na\nmended\n10-K\n9/1/16\n10.10\n10/28/16\n10.7*\nNonstatutory Stock Option Plan Form of Agreement and Terms and Conditions\n10-K\n9/1/16\n10.11\n10/28/16\n10.8*\nForm of Indemnification Agreement between the Registrant and its officers and directors\n10-Q\n2/27/25\n10.5\n3/21/25\n10.9*\nForm of Severance Agreement\n8-K\n99.2\n11/1/07\n10.10*\nDeferred Compensation Plan, as amended\n10-K\n8/31/23\n10.10\n10/6/23\n10.11*\nAmended and Restated Executive Agreement by and between Micron Technology,\n \nInc. and Sanjay Mehrotra\n10-K\n9/1/22\n10.11\n10/7/22\n10.12*\nSeverance Benefits for Sumit Sadana\n10-Q\n11/30/17\n10.70\n12/20/17\n10.13*\nForm of Amendment to Executive/Severance Agreement\n8-K\n99.1\n11/13/17\n10.14*\nSeverance Benefits for Manish Bhatia\n10-Q\n11/30/17\n10.74\n12/20/17\n10.15*\nMicron Technology, Inc. Employee Stock Purchase Plan, as amended and restated\n10-Q\n6/2/22\n10.1\n7/1/22\n10.16*\nSeverance Benefits for Mark Murphy\n10-Q\n6/2/22\n10.3\n7/1/22\n10.17*\nForm of Consent for Named Executive Officers\n10-Q\n3/2/23\n10.5\n3/29/23\n10.18*\nExecutive Officer Cash Severance Policy\n10-Q\n11/30/23\n10.1\n12/21/23\n10.19*\nSeverance Policy Acknowledgement Letter for Sanjay Mehrotra\n10-Q\n11/30/23\n10.2\n12/21/23\n10.20*\nAmended and Restated Severance Agreement by and between Micron Technology,\n \nInc. and Scott\n \nJ. DeBoer\n10-Q\n11/30/23\n10.3\n12/21/23\n10.21\nTerm Loan Credit Agreement, dated as of January\n \n17, 2025, by and among Micron Technology,\n \nInc., as borrower, PNC Bank, National Association, as administrative agent, the other agents party thereto, and each financial institution party from time to time thereto\n10-Q\n2/27/25\n10.1\n3/21/25\n10.22*\nAmended and Restated 2007 Equity Incentive Plan Forms of Agreement and Terms and Conditions\n10-Q\n2/27/25\n10.4\n3/21/25\n10.23*\n2025 Equity Incentive Plan\n10-Q\n2/27/25\n10.2\n3/21/25\n10.24*\n2025 Equity Incentive Plan Forms of Agreement and Terms and Conditions\nS-8\n99.2\n1/21/25\n10.25*\n2\n025 Director Compensation Plan\n10-Q\n2/27/25\n10.6\n3/21/25\n10.26^\nD\nirect Funding Agreement, dated December\n \n9, 2024, by and between Micron Idaho Semiconductor Manuf\nacturing (Triton)\n \nLLC and U.S. Department of Commerce\n10-Q\n2/27/25\n10.7\n3/21/25\n107 |\n \n2025 10-K\nTable of Contents\nExhibit Number\nDescription of Exhibit\nFiled Herewith\nForm\nPeriod Ending\nExhibit/ Appendix\nFiling Date\n10.27^\nDirect Funding Agreement, dated December\n \n9, 2024, by and between Micron New York Semiconductor Manufacturing\n \nLLC and U.S. Department of Commerce\n10-Q\n2/27/25\n10.8\n3/21/25\n10.28\nGuarantee and Equity Contribution Agreement, by and between Micron Technology,\n \nInc. and U.S. Department of Commerce\n10-Q\n2/27/25\n10.9\n3/21/25\n10.29\nCredit Agreement, dated as of March\n \n12, 2025, by and among Micron Technology,\n \nInc., as borrower, HSBC Bank USA, National Association, as administrative agent, the other agents party thereto, and each financial institution party from time to time thereto\n10-Q\n2/27/25\n10.10\n3/21/25\n10.30^\nAmendment No.\n \n1 to Direct Funding Agreement, dated \nJanuary\n \n17\n, 202\n5\n, by and between Micron Idaho Semiconductor Manufacturing (Triton)\n \nLLC and U.S. Department of Commerce\n10-Q\n2/27/25\n10.11\n3/21/25\n10.31^\nAmendment No.\n \n1 to Direct Funding Agreement, dated \nJanuary\n \n1\n7\n, 202\n5\n, by and between Micron New York Semiconductor Manufacturing\n \nLLC and U.S. Department of Commerce\n10-Q\n2/27/25\n10.12\n3/21/25\n10.32^\nA\nmendment No\n.\n \n2 \nto Direct Funding Agreement, dated \nJu\nne\n \n11\n, 2025, by and between Micron Idaho Semiconductor Manufacturing (Triton)\n \nLLC and U.S. Department of Commerce\nX\n10.33^\nAmendment No.\n \n2 to Direct Funding Agreement, dated \nJune\n \n11\n, 2025, by and between Micron \nNew York\n Semiconductor Manufacturing\n \nLLC and U.S. Department of Commerce\nX\n10.34\nA\nmendment\n \nand Restated\n Guarantee and Equity \nCont\nribution Agreement\n, dated June\n \n11, 2025, by and between Micron T\nechnology,\n \nInc. and the U.\nS. Department of Commerce\nX\n19.1\nInsider Trading Policy of the Registrant\nX\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n31.1\nRule 13a-14(a) Certification of Chief Executive Officer\nX\n31.2\nRule 13a-14(a) Certification of Chief Financial Officer\nX\n32.1\nCertification of Chief Executive Officer Pursuant to 18\n \nU.S.C.\n \n1350\nX\n32.2\nCertification of Chief Financial Officer Pursuant to 18\n \nU.S.C.\n \n1350\nX\n97.1\nCompensation Recoupment (Clawback) Policy, as amended and restated\n10-K\n8/31/23\n97.1\n10/6/23\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nX\n* Indicates management contract or compensatory plan or arrangement.\n^ Certain portions of this exhibit have been redacted because they are both not material and is the type that the Registrant treats as private or confidential. The Registrant hereby agrees to furnish supplementally to the Securities and Exchange Commission, upon its request, an unredacted copy of this exhibit.\nITEM 16. FORM 10-K SUMMARY\nNone.\n \n108\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nMicron Technology, Inc.\nDate\nOctober 3, 2025\nBy:\n/s/ Mark Murphy\n \nMark Murphy\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\n109 |\n \n2025 10-K\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Sanjay Mehrotra\nChairman, President and\nOctober 3, 2025\n(Sanjay Mehrotra)\nChief Executive Officer \n \n(Principal Executive Officer)\n/s/ Mark Murphy\nExecutive Vice President and\nOctober 3, 2025\n(Mark Murphy)\nChief Financial Officer\n \n \n(Principal Financial Officer)\n \n/s/ Scott Allen\nCorporate Vice President and\nOctober 3, 2025\n(Scott Allen)\nChief Accounting Officer\n \n \n(Principal Accounting Officer)\n \n/s/ Richard M. Beyer\nDirector\nOctober 3, 2025\n(Richard M. Beyer)\n \n/s/ Lynn A. Dugle\nLead Independent Director\nOctober 3, 2025\n(Lynn A. Dugle)\n/s/ Steven J. Gomo\nDirector\nOctober 3, 2025\n(Steven J. Gomo)\n \n \n/s/ Linnie M. Haynesworth\nDirector\nOctober 3, 2025\n(Linnie M. Haynesworth)\n/s/ T. Mark Liu\nDirector\nOctober 3, 2025\n(T. Mark Liu)\n/s/ Mary Pat McCarthy\nDirector\nOctober 3, 2025\n(Mary Pat McCarthy)\n \n \n/s/ A. Christine Simons\nDirector\nOctober 3, 2025\n(A. Christine Simons)\n/s/ Robert H. Swan\nDirector\nOctober 3, 2025\n(Robert H. Swan)\n/s/ MaryAnn Wright\nDirector\nOctober 3, 2025\n(MaryAnn Wright)\n \n \n \n110"
  }
}