{
  "ticker": "NCLH",
  "cik": "0001513761",
  "company_name": "Norwegian Cruise Line Holdings Ltd.",
  "filing_date": "2025-02-27",
  "accession": "0001558370-25-001743",
  "primary_doc": "nclh-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 1—Business—Our Fleet” and “Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources.”\nNCLH’s principal executive offices are located in Miami, Florida where we lease approximately 393,571 square feet of facilities. \nWe lease a number of domestic and international offices throughout Europe, Asia, South America and Australia to administer our brand operations globally. Norwegian owns a private island in The Bahamas, Great Stirrup Cay, which we utilize as a port-of-call on some of our itineraries. We operate a private cruise destination in Belize, Harvest Caye.\nWe believe that our facilities are adequate for our current needs, and that we are capable of obtaining additional facilities as necessary.\n​\nItem 3. Legal Proceedings\nOur threshold for disclosing material environmental legal proceedings involving a governmental authority where potential monetary sanctions are involved is $1 million.\n​\nSee “\nItem 8—Financial Statements and Supplementary Data—Notes to Consolidated Financial Statements—Note 13 Commitments and Contingencies\n” in Part II of this Annual Report for information about material legal proceedings.\n​\n​\nItem 4. Mine Safety Disclosures\nNone.\n​\n45\n\n\nTable of Contents\nPART II\n​\nItem 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity\n Securities\nMarket Information\nNCLH’s ordinary shares are listed on the NYSE under the symbol “NCLH.”\nHolders\nAs of February 17, 2025, there were 282 record holders of NCLH’s ordinary shares. Since certain of NCLH’s ordinary shares are held by brokers and other institutions on behalf of shareholders, the foregoing number is not representative of the number of beneficial owners.\nDividends\nNCLH does not currently pay dividends to its shareholders. Any determination to pay dividends in the future will be at the discretion of our Board of Directors and will depend upon our results of operations, financial condition, restrictions imposed by applicable law and our financing agreements and other factors that our Board of Directors deems relevant.\n​\n46\n\n\nTable of Contents\nStock Performance Graph\nThis performance graph shall not be deemed “soliciting material” or to be “filed” with the SEC for purposes of Section 18 of the Exchange Act, or otherwise subject to the liabilities under that Section, and shall not be deemed to be incorporated by reference into any filing of NCLH under the Securities Act of 1933, as amended, or the Exchange Act\n.\nThe following graph shows a comparison of the cumulative total return for our ordinary shares, the Standard & Poor’s 500 Composite Stock Index and the Dow Jones United States Travel and Leisure index. The Stock Performance Graph assumes that $100 was invested at the closing price of our ordinary shares on the NYSE and in each index on the last trading day of fiscal 2019. Past performance is not necessarily an indicator of future results. The stock prices used were as of the close of business on the respective dates.\nItem 6. [Reserved]\n​\n47\n\n\nTable of Contents\n Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFinancial Presentation\nThe following discussion and analysis contains forward-looking statements within the meaning of the federal securities laws, and should be read in conjunction with the disclosures we make concerning risks and other factors that may affect our business and operating results. You should read this information in conjunction with the consolidated financial statements and the notes thereto included in this Annual Report. See also “Cautionary Statement Concerning Forward-Looking Statements” immediately prior to Part I, Item 1 in this Annual Report.\nWe categorize revenue from our cruise and cruise-related activities as either “passenger ticket” revenue or “onboard and other” revenue. Passenger ticket revenue and onboard and other revenue vary according to product offering, the size of the ship in operation, the length of cruises operated and the markets in which the ship operates. Our revenue is seasonal based on demand for cruises, which has historically been strongest during the Northern Hemisphere’s summer months. Passenger ticket revenue primarily consists of revenue for accommodations, meals in certain restaurants on the ship, certain onboard entertainment, government taxes, fees and port expenses and includes revenue for service charges and air and land transportation to and from the ship to the extent guests purchase these items from us. Onboard and other revenue primarily consists of revenue from casino, beverage sales, shore excursions, specialty dining, retail sales, spa services and Wi-Fi services. Our onboard revenue is derived from onboard activities we perform directly or that are performed by independent concessionaires, from which we receive a share of their revenue.\nOur cruise operating expense is classified as follows:\n●\nCommissions, transportation and other primarily consists of direct costs associated with passenger ticket revenue. These costs include travel advisor commissions, air and land transportation expenses, related credit card fees, certain government taxes, fees and port expenses and the costs associated with shore excursions and hotel accommodations included as part of the overall cruise purchase price.\n●\nOnboard and other primarily consists of direct costs incurred in connection with onboard and other revenue, including casino, beverage sales and shore excursions.\n●\nPayroll and related consists of the cost of wages, benefits and logistics for shipboard employees and costs of certain inventory items, including food, for a third party that provides crew and other hotel services for certain ships. \n●\nFuel includes fuel costs, the impact of certain fuel hedges and fuel delivery costs.\n●\nFood consists of food costs for passengers and crew on certain ships.\n●\nOther consists of repairs and maintenance (including Dry-dock costs), ship insurance and other ship expenses.\nCritical Accounting Policies\nOur consolidated financial statements have been prepared in accordance with U.S. GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of our consolidated financial statements and the reported amounts of revenue and expenses during the periods presented. We rely on historical experience and on various other assumptions that we believe to be reasonable under the circumstances to make these estimates and judgments. Actual results could differ materially from these estimates. We believe that the following critical accounting policies reflect the significant estimates and assumptions used in the preparation of our consolidated financial statements. These critical accounting policies, which are presented in detail in our notes to our audited consolidated financial statements, relate to ship accounting and asset impairment.\n48\n\n\nTable of Contents\nShip Accounting\nShips represent our most significant assets, and we record them at cost less accumulated depreciation. Depreciation of ships is computed on a straight-line basis over the weighted average useful lives of primarily 30 years after a 15% reduction for the estimated residual value of the ship. Our residual value is established based on our long-term estimates of the expected remaining future benefit at the end of the ships’ weighted average useful lives. In 2022 and 2023, the Company took delivery of Norwegian’s first Prima Class Ship and Oceania Cruises’ first Allura Class Ship, respectively. Based on the design, structure and technological advancements made to these new classes of ships and the analyses of their major components, which is generally performed upon the introduction of a new class of ship, we have assigned the Prima Class Ships and Allura Class Ships a weighted-average useful life of 35 years with a residual value of 10%. Ship improvement costs that we believe add value to our ships are capitalized to the ship and depreciated over the shorter of the improvements’ estimated useful lives or the remaining useful life of the ship. When we record the retirement of a ship component included within the ship’s cost basis, we estimate the net book value of the component being retired and remove it from the ship’s cost basis. Repairs and maintenance activities are charged to expense as incurred. We account for Dry-dock costs under the direct expense method which requires us to expense all Dry-dock costs as incurred.\nWe determine the weighted average useful lives of our ships based primarily on our estimates of the costs and useful lives of the ships’ major component systems on the date of acquisition, such as cabins, main diesels, main electric, superstructure and hull, and their related proportional weighting to the ship as a whole. The useful lives of components of new ships and ship improvements are estimated based on the economic lives of the new components. In addition, to determine the useful lives of the major components of new ships and ship improvements, we consider the impact of the historical useful lives of similar assets, manufacturer recommended lives, planned maintenance programs and anticipated changes in technological conditions. Given the large and complex nature of our ships, our accounting estimates related to ships and determinations of ship improvement costs to be capitalized require judgment and are uncertain. Should certain factors or circumstances cause us to revise our estimate of ship service lives or projected residual values, depreciation expense could be materially lower or higher. \nIf circumstances cause us to change our assumptions in making determinations as to whether ship improvements should be capitalized, the amounts we expense each year as repairs and maintenance costs could increase, partially offset by a decrease in depreciation expense. If we reduced our estimated weighted average ship service life by one year, depreciation expense for the year ended December 31, 2024 would have increased by $20.5 million. In addition, if our ships were estimated to have no residual value, depreciation expense for the same period would have increased by $89.7 million. We believe our estimates for ship accounting are reasonable and our methods are consistently applied. We believe that depreciation expense is based on a rational and systematic method to allocate our ships’ costs to the periods that benefit from the ships’ usage.\nAsset Impairment\nWe review our long-lived assets, principally ships, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Assets are grouped and evaluated at the lowest level for which there are identifiable cash flows that are largely independent of the cash flows of other groups of assets. For ship impairment analyses, the lowest level for which identifiable cash flows are largely independent of other assets and liabilities is each individual ship. We consider historical performance and future estimated results in our evaluation of potential impairment and then compare the carrying amount of the asset to the estimated undiscounted future cash flows expected to result from the use of the asset. If the carrying amount of the asset exceeds the estimated expected undiscounted future cash flows, we measure the amount of the impairment by comparing the carrying amount of the asset to its estimated fair value. We estimate fair value based on the best information available utilizing estimates, judgments and projections as necessary. Our estimate of fair value is generally measured by discounting expected future cash flows at discount rates commensurate with the associated risk.\nWe evaluate goodwill and trade names for impairment annually or more frequently when an event occurs or circumstances change that indicates the carrying value of a reporting unit may not be recoverable. For our evaluation of goodwill, we use a qualitative assessment which allows us to first assess qualitative factors to determine whether it is \n49\n\n\nTable of Contents\nmore likely than not (i.e., more than 50%) that the estimated fair value of a reporting unit is less than its carrying value. For trade names we also provide a qualitative assessment to determine if there is any indication of impairment.\nIn order to make this evaluation, we consider whether any of the following factors or conditions exist:\n●\nChanges in general macroeconomic conditions, such as a deterioration in general economic conditions; limitations on accessing capital; fluctuations in foreign exchange rates; or other developments in equity and credit markets;\n●\nChanges in industry and market conditions such as a deterioration in the environment in which an entity operates; an increased competitive environment; a decline in market-dependent multiples or metrics (in both absolute terms and relative to peers); a change in the market for an entity’s products or services; or a regulatory or political development;\n●\nChanges in cost factors that have a negative effect on earnings and cash flows;\n●\nDecline in overall financial performance (for both actual and expected performance);\n●\nEntity and reporting unit specific negative events such as changes in management, key personnel, strategy, or customers; litigation; or a change in the composition or carrying amount of net assets; and\n●\nDecline in share price (in both absolute terms and relative to peers).\nIt is at our discretion whether to perform the qualitative test and we may bypass the qualitative test in any period and proceed directly to the quantitative impairment test. We may also, at our discretion, resume performing the qualitative assessment in any subsequent period.\nWe believe our estimates and judgments with respect to our long-lived assets, principally ships, goodwill, trade names and other indefinite-lived intangible assets are reasonable. Nonetheless, if there was a material change in assumptions used in the determination of such fair values or if there is a material change in the conditions or circumstances that influence such assets, we could be required to record an impairment charge. If a material change occurred or the result of the qualitative assessment indicated it is more likely than not that the estimated fair value of the asset is less than its carrying value, we would conduct a quantitative assessment comparing the fair value to its carrying value. \nWe have concluded that our business has three reporting units. Each brand, Oceania Cruises, Regent and Norwegian, constitutes a business for which discrete financial information is available and management regularly reviews the operating results and, therefore, each brand is considered an operating segment. \nFor our annual impairment evaluation, we performed a qualitative assessment for the Norwegian and Regent reporting units and for each brand’s trade names. As of December 31, 2024, there was $135.8 million of goodwill for the Regent and Norwegian reporting units. Trade names were $500.5 million as of December 31, 2024. As of October 1, 2024, our annual impairment reviews support the carrying values of these assets. See Note 2 – “Summary of Significant Accounting Policies” for more information.\nNon-GAAP Financial Measures\nWe use certain non-GAAP financial measures, such as Adjusted Gross Margin, Net Yield, Net Cruise Cost, Adjusted Net Cruise Cost Excluding Fuel, Adjusted EBITDA, Adjusted Net Income and Adjusted EPS, to enable us to analyze our performance. See “Terms Used in this Annual Report” for the definitions of these and other non-GAAP financial measures. We utilize Adjusted Gross Margin and Net Yield to manage our business on a day-to-day basis because it reflects revenue earned net of certain direct variable costs. We also utilize Net Cruise Cost and Adjusted Net Cruise Cost Excluding Fuel to manage our business on a day-to-day basis. In measuring our ability to control costs in a manner that \n50\n\n\nTable of Contents\npositively impacts our net income, we believe changes in Adjusted Gross Margin, Net Yield, Net Cruise Cost and Adjusted Net Cruise Cost Excluding Fuel to be the most relevant indicators of our performance. \nWe believe that Adjusted EBITDA is appropriate as a supplemental financial measure as it is used by management to assess operating performance. We also believe that Adjusted EBITDA is a useful measure in determining our performance as it reflects certain operating drivers of our business, such as sales growth, operating costs, marketing, general and administrative expense and other operating income and expense. In addition, management uses Adjusted EBITDA as a performance measure for our incentive compensation. Adjusted EBITDA is not a defined term under GAAP nor is it intended to be a measure of liquidity or cash flows from operations or a measure comparable to net income, as it does not take into account certain requirements such as capital expenditures and related depreciation, principal and interest payments and tax payments and it includes other supplemental adjustments.\nIn addition, Adjusted Net Income and Adjusted EPS are non-GAAP financial measures that exclude certain amounts and are used to supplement GAAP net income and EPS. We use Adjusted Net Income and Adjusted EPS as key performance measures of our earnings performance. We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance and when planning, forecasting and analyzing future periods. These non-GAAP financial measures also facilitate management’s internal comparison to our historical performance. In addition, management uses Adjusted EPS as a performance measure for our incentive compensation. The amounts excluded in the presentation of these non-GAAP financial measures may vary from period to period; accordingly, our presentation of Adjusted Net Income and Adjusted EPS may not be indicative of future adjustments or results. For example, for the year ended December 31, 2024, we had a benefit of $161.9 million related to the reversal of the majority of our U.S. deferred tax asset valuation allowance. We included this as an adjustment in the reconciliation of Adjusted Net Income since the benefit is not representative of our day-to-day operations, and this adjustment did not occur and is not included in the comparative period presented within this Annual Report.\nYou are encouraged to evaluate each adjustment used in calculating our non-GAAP financial measures and the reasons we consider our non-GAAP financial measures appropriate for supplemental analysis. In evaluating our non-GAAP financial measures, you should be aware that in the future we may incur expenses similar to the adjustments in our presentation. Our non-GAAP financial measures have limitations as analytical tools, and you should not consider these measures in isolation or as a substitute for analysis of our results as reported under GAAP. Our presentation of our non-GAAP financial measures should not be construed as an inference that our future results will be unaffected by unusual or non-recurring items. Our non-GAAP financial measures may not be comparable to other companies. Please see a historical reconciliation of these measures to the most comparable GAAP measure presented in our consolidated financial statements below in the “Results of Operations” section.\nFinancing Transactions and Newbuild Orders\nIn February 2024, NCLC and the Commitment Parties entered into the third amended commitment letter, which became effective in March 2024. Pursuant to the third amended commitment letter, the Commitment Parties have agreed to purchase from NCLC an aggregate principal amount of $650 million of senior unsecured notes due five years after the issue date at NCLC’s option, which option is available through March 2025 and we do not expect to extend. In connection with the execution of the third amended commitment letter, NCLC agreed to repurchase all of the outstanding $250 million aggregate principal amount of 9.75% senior secured notes due 2028 at a negotiated premium plus accrued and unpaid interest thereon. See Note 9 – “Long-Term Debt” for more information.\n​\nIn April 2024, we obtained export credit financing for 80% of the contract price of two new Regent Seven Seas Cruises ship orders and two new Oceania Cruises ship orders as well as related premiums. Contemporaneously, the ship orders became effective. The Norwegian brand also placed a four-ship order, for which the shipbuilding contracts were finalized in February 2025 and financing is still being finalized. We refer you to “—Liquidity and Capital Resources— Future Capital Commitments” and “—Liquidity and Capital Resources— Material Cash Requirements” for details regarding our newbuild orders.\n​\nAdditionally, in April 2024, a €200 million commitment became available that can be used for future newbuild payments.  See Note 9 – “Long-Term Debt” for more information.\n51\n\n\nTable of Contents\n​\nIn September 2024, NCLC issued $315.0 million aggregate principal amount of 6.250% senior unsecured notes due 2030.  The net proceeds, together with cash on hand, were used to redeem $315.0 million aggregate principal amount of the 3.625% senior unsecured notes due 2024, including to pay any accrued and unpaid interest thereon. See Note 9 – “Long-Term Debt” for more information.\n​\nIn January 2025, the full amount of outstanding borrowings under the Breakaway one loan, Breakaway two loan, Marina newbuild loan and Riviera newbuild loan, plus any accrued and unpaid interest thereon, was repaid with funds drawn from the Revolving Loan Facility. NCLC also issued $1.8 billion aggregate principal amount of 6.750% senior unsecured notes due 2032. The net proceeds, together with cash on hand, were used to redeem $600.0 million aggregate principal amount of 8.375% senior secured notes due 2028 and $1.2 billion aggregate principal amount of 5.875% senior unsecured notes due 2026, together with any accrued and unpaid interest thereon, and to pay any related transaction premiums, fees and expenses. Concurrently, the Revolving Loan Facility was increased from $1.2 billion to $1.7 billion with the maturity date extended to 2030 and the collateral of the Revolving Loan Facility and the 8.125% senior secured notes due 2029 were modified. See Note 9 – “Long-Term Debt” for more information.\n​\nUpdate on Bookings \n​\nThe Company continues to experience strong consumer demand for its offerings across itineraries and brands throughout 2025 and into 2026. As a result, the Company remains at the upper range of its optimal booked position on a 12-month forward basis.\n​\nMargin Enhancement Initiative \nDuring 2024, we continued to see improvements in operating costs from our ongoing margin enhancement initiative. The Company continues to prioritize identifying and evaluating a variety of initiatives to improve its cost structure and margin profile, while preserving its brand equity and optimal guest satisfaction levels. However, global macroeconomic events have created volatility and disruptions in the past that have adversely impacted our costs and they may do so again in the future. Furthermore, we are exposed to fluctuations in the euro exchange rate for certain portions of ship construction contracts and various exchange rates for customer deposits that have not been hedged. See “",
    "item1a": "Item 1A—Risk Factors” for further details regarding risks and uncertainties that may cause our results to differ from our expectations.\nAt December 31, 2024, we were in compliance with all of our debt covenants. If we do not continue to remain in compliance with our covenants, we would have to seek additional amendments to or waivers of the covenants. However, no assurances can be made that such amendments or waivers would be approved by our lenders.  Generally, if an event of default under any debt agreement occurs, then pursuant to cross default and/or cross acceleration clauses, substantially all of our outstanding debt and derivative contract payables could become due, and all debt and derivative contracts could be terminated, which would have a material adverse impact to our operations and liquidity. \n​\nOur Moody’s long-term issuer rating is B1, our senior secured rating is Ba3 and our senior unsecured rating is B3. Our S&P Global issuer credit rating is B+, our issue-level rating on our $1.7 billion Revolving Loan Facility and $790 million 8.125% senior secured notes due 2029 is BB, our issue-level rating on our other senior secured notes is BB- and our senior unsecured rating is B+. If our credit ratings were to be downgraded as has occurred in the past, or general market conditions were to ascribe higher risk to our rating levels, our industry, or us, our access to capital and the cost of any debt or equity financing will be negatively impacted. We also have capacity to incur additional indebtedness under our debt agreements and may issue additional ordinary shares from time to time, subject to our authorized number of ordinary shares. However, there is no guarantee that debt or equity financings will be available in the future to fund our obligations, or that they will be available on terms consistent with our expectations.\n​\nAs of December 31, 2024, we had advance ticket sales of $3.2 billion, including the long-term portion. We also have agreements with our credit card processors that, as of December 31, 2024, governed approximately $2.8 billion in advance ticket sales that had been received by the Company relating to future voyages. These agreements allow the credit card processors to require under certain circumstances, including the existence of a material adverse change, excessive chargebacks and other triggering events, that the Company maintain a reserve which would be satisfied by posting collateral. Although the agreements vary, these requirements may generally be satisfied either through a percentage of customer payments withheld or providing cash funds directly to the card processor. Any cash reserve or collateral requested could be increased or decreased. As of December 31, 2024, we had cash collateral reserves of approximately $0.8 million with credit card processors recognized in accounts receivable, net.  The $31.5 million previously recognized in other long-term assets was returned to the Company during the year ended December 31, 2024. \n58\n\n\nTable of Contents\nWe may be required to pledge additional collateral and/or post additional cash reserves or take other actions in the future that may adversely affect our liquidity.\nSources and Uses of Cash\nIn this section, references to 2024 refer to the year ended December 31, 2024, references to 2023 refer to the year ended December 31, 2023.\nNet cash provided by operating activities was $2.0 billion in 2024 and 2023. Net cash provided by operating activities included net income and the timing differences in cash receipts and payments relating to operating assets and liabilities. The net cash provided by operating activities in 2024 included net income of $910.3 million and an increase in advance ticket sales of $35.7 million. The net cash provided by operating activities in 2023 included net income of $166.2 million, the return of $500 million cash collateral from one credit card processor and an increase in advance ticket sales of $503.7 million. \nNet cash used in investing activities was $1.2 billion in 2024, primarily related to newbuild payments and ship improvements. Net cash used in investing activities was $2.9 billion in 2023, primarily related to three new ship deliveries and newbuild payments. \nNet cash used in financing activities was $1.0 billion in 2024, primarily due to repayments of newbuild loans, our 2028 Secured Notes and the 3.625% senior notes due 2024 partially offset by the proceeds from newbuild loan facilities and the 2030 Notes. Net cash provided by financing activities was $346.9 million in 2023, primarily due to newbuild loans and $1.6 billion from our various note offerings, partially offset by debt repayments and a net decrease in our Revolving Loan Facility balance.\nFor the Company’s cash flow activities for the fiscal year ended December 31, 2022, see “Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s annual report on Form 10-K for the year ended December 31, 2023, which was filed with the U.S. Securities and Exchange Commission on February 28, 2024.\nFuture Capital Commitments\nFuture capital commitments consist of contracted commitments, including ship construction contracts. Anticipated expenditures related to ship construction contracts and growth are $2.5 billion, $2.4 billion and $2.4 billion for the years ending December 31, 2025, 2026 and 2027, respectively. We have export-credit backed financing in place for the anticipated expenditures related to ship construction contracts of $1.5 billion, $1.5 billion and $1.8 billion for the years ending December 31, 2025, 2026 and 2027, respectively. Anticipated other non-newbuild capital expenditures are $0.6 billion for the year ending December 31, 2025. Future expected capital expenditures will significantly increase our depreciation and amortization expense.\nNewbuilds\nThe following chart discloses details about our newbuild program. The impacts of initiatives to improve environmental sustainability and modifications the Company plans to make to its newbuilds and/or other macroeconomic conditions and events have resulted in delays in expected ship deliveries. These and other impacts could result in additional delays in ship deliveries in the future, which may be prolonged. Expected delivery dates for our most recently announced newbuilds are preliminary and subject to change.\n​\n​\n​\n​\n​\n​\n​\nYear\nBrand\nClass\nShip Name\nGross Tons\n(1)\nBerths\n(1)\nStatus\n2025\nNorwegian Cruise Line\nPrima Class\nNorwegian Aqua\n~156,000\n~3,550\nContract effective / financed\n(4)\n59\n\n\nTable of Contents\n2025\nOceania Cruises\nAllura Class\nAllura\n~68,000\n~1,200\nContract effective / financed\n(4)\n2026\nNorwegian Cruise Line\nPrima Class\nNorwegian Luna\n~156,000\n~3,550\nContract effective / financed\n(4)\n2026\nRegent Seven Seas\nPrestige Class\nSeven Seas Prestige\n~77,000\n~850\nContract effective / financed\n(4)\n2027\nNorwegian Cruise Line\nNext Gen \"Methanol-Ready\n(2)\n\"\n \nPrima Class\nTo come\n~169,000\n~3,850\nContract effective / financed\n(4)\n2027\nOceania Cruises\nNew Class\nTo come\n~86,000\n~1,450\nContract effective / financed\n(4)\n2028\nNorwegian Cruise Line\nNext Gen \"Methanol-Ready\n(2)\n\"\n \nPrima Class\nTo come\n~169,000\n~3,850\nContract effective / financed\n(4)\nExpected 2029\n(3)\n \nOceania Cruises\nNew Class\nTo come\n~86,000\n~1,450\nContract effective / financed\n(4)\n2029\n(6)\nRegent Seven Seas\nPrestige Class\nTo come\n~77,000\n~850\nContract effective / financed\n(4)\n2030\nNorwegian Cruise Line\nNew Class\nTo come\n~225,000\n~5,150\nContract effective / financing is being negotiated.\n2030\n(6)\nOceania Cruises\nNew Class\n—\n~86,000\n~1,450\nContract effective, but not financed. Option to cancel.\n(5)\n2031\n(6)\nOceania Cruises\nNew Class\n—\n~86,000\n~1,450\nContract effective, but not financed. Option to cancel.\n(5)\n2032\nNorwegian Cruise Line\nNew Class\nTo come\n~225,000\n~5,150\nContract effective / financing is being negotiated.\n2034\nNorwegian Cruise Line\nNew Class\nTo come\n~225,000\n~5,150\nContract effective / financing is being negotiated.\n2036\nNorwegian Cruise Line\nNew Class\nTo come\n~225,000\n~5,150\nContract effective / financing is being negotiated.\n(1)\nBerths and Gross Tons are preliminary and subject to change as we approach delivery.\n(2)\nDesigns for the final two Prima Class ships have been lengthened and reconfigured to accommodate the use of green methanol as a future fuel source. Additional modifications will be needed to fully enable the use of green methanol.\n(3)\nDelivery for the second Oceania Cruises ship is contractually scheduled for the fourth quarter of 2028, but may be delayed to 2029, which would result in additional fees.\n(4)\nWe have obtained export-credit backed financing which is expected to fund approximately 80% of the contract price of each ship as well as related financing premiums, subject to certain conditions.\n(5)\nWe have the option to cancel the effective two-ship order for Oceania Cruises. \n(6)\nDelivery dates may be delayed at the option of the builder, which would result in additional fees.\n​\nAs of December 31, 2024, the combined contract prices, including amendments and change orders, of the 13 ships on order for delivery (which excludes the two ships on order for Oceania Cruises, which are currently scheduled for delivery in 2030 and 2031, that we have the option to cancel) was approximately €17.5 billion, or $18.1 billion based on the euro/U.S. dollar exchange rate as of December 31, 2024. If the two ships on order for Oceania Cruises are cancelled, there will be incremental corresponding adjustments to the purchase price of other applicable newbuilds not to exceed €51 million. We do not anticipate any contractual breaches or cancellations to occur, except as noted above. However, if any such events were to occur, it could result in, among other things, the forfeiture of prior deposits or payments made by us and potential claims and impairment losses which may materially impact our business, financial condition and results of operations.\n60\n\n\nTable of Contents\nCapitalized interest for the year ended December 31, 2024 and 2023 was $59.9 million and $56.4 million, respectively, primarily associated with the construction of our newbuild ships.\nMaterial Cash Requirements\nAs of December 31, 2024, our material cash requirements for debt and ship construction were as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2025\n    \n2026\n    \n2027\n    \n2028\n    \n2029\n    \nThereafter\n    \nTotal\nLong-term debt (1)\n​\n$\n 1,918,880\n​\n$\n 2,982,925\n​\n$\n 3,692,748\n​\n$\n 1,999,528\n​\n$\n 2,099,075\n​\n$\n 2,865,499\n​\n$\n 15,558,655\nShip construction contracts (2)\n​\n \n 2,110,819\n​\n​\n 2,135,541\n​\n​\n 2,174,827\n​\n​\n 2,011,679\n​\n​\n 938,839\n​\n​\n 7,916,565\n​\n \n 17,288,270\nTotal\n​\n$\n 4,029,699\n​\n$\n 5,118,466\n​\n$\n 5,867,575\n​\n$\n 4,011,207\n​\n$\n 3,037,914\n​\n$\n 10,782,064\n​\n$\n 32,846,925\n(1)\nIncludes principal as well as estimated interest payments with Term Secured Overnight Financing Rate (“SOFR”) held constant as of December 31, 2024. Includes exchangeable notes which can be settled in NCLH ordinary shares. Excludes the impact of any future possible refinancings and undrawn export-credit backed facilities. Subsequent to December 31, 2024, we completed various financing transactions, including the repayment of outstanding borrowings under the Breakaway one loan, Breakaway two loan, Marina newbuild loan and Riviera newbuild loan, plus any accrued and unpaid interest thereon using funds from our Revolving Loan Facility and NCLC redeemed $600.0 million aggregate principal amount of 8.375% senior secured notes due 2028 and $1.2 billion aggregate principal amount of 5.875% senior unsecured notes due 2026, together with any accrued and unpaid interest thereon from the net proceeds of $1.8 billion aggregate principal amount of 6.750% senior unsecured notes due 2032, together with cash on hand. See Note 9 – “Long-Term Debt” for further information. \n(2)\nShip construction contracts are for our 13 \nnon-cancelable\n newbuild ships based on the euro/U.S. dollar exchange rate as of December 31, 2024. As of December 31, 2024, we have committed undrawn export-credit backed facilities of $8.6 billion which funds approximately 80% of our ship construction contracts, with the exception of the two ships on order for Oceania Cruises that we have the option to cancel and the four additional ships on order for Norwegian Cruise Line with currently scheduled delivery from 2030 to 2036. The above presentation reflects the current delivery dates; however, certain delivery dates may be delayed at the option of the builder. \n​\nFor other operational commitments for lease and port obligations we refer you to Note 6 – “Leases” and Note 13 – “Commitments and Contingencies,” respectively, for further information.\nFunding Sources\nCertain of our debt agreements contain covenants that, among other things, require us to maintain a minimum level of liquidity, as well as limit our net funded debt-to-capital ratio and maintain certain other ratios. Approximately $15.6 billion of our assets were pledged as collateral for certain of our debt as of December 31, 2024. We believe we were in compliance with our covenants as of December 31, 2024.\nIn addition, our existing debt agreements restrict, and any of our future debt arrangements may restrict, among other things, the ability of our subsidiaries, including NCLC, to make distributions and/or pay dividends to NCLH and NCLH’s ability to pay cash dividends to its shareholders. NCLH is a holding company and depends upon its subsidiaries for their ability to pay distributions to it to finance any dividend or pay any other obligations of NCLH. However, we do not believe that these restrictions have had or are expected to have an impact on our ability to meet any cash obligations.\n​\nWe believe our cash on hand, borrowings available under our Revolving Loan Facility, expected future operating cash inflows and our ability to issue debt securities or additional equity securities, will be sufficient to fund operations, debt payment requirements, capital expenditures and maintain compliance with covenants under our debt agreements over the next 12-month period. Refer to “—Liquidity and Capital Resources—General” for further information regarding liquidity.\n​\n61\n\n\nTable of Contents\nOther\nCertain service providers may require collateral in the normal course of our business. The amount of collateral may change based on certain terms and conditions. We refer you to “—Liquidity and Capital Resources—General” for information regarding collateral provided to our credit card processors.\nAs a routine part of our business, depending on market conditions, exchange rates, pricing and our strategy for growth, we regularly consider opportunities to enter into contracts for the building of additional ships, acquisitions and strategic alliances. If any of these transactions were to occur, they may be financed through the incurrence of additional permitted indebtedness, through cash flows from operations, or through the issuance of debt, equity or equity-related securities. \nAdditionally, we similarly consider opportunities for the sale of ships and long-term charters with purchase options. For example, we are currently contemplating a long-term charter for residences at sea with a purchase option for a nominal value at the end of the lease period. These types of agreements are being pursued as part of our ship disposal strategy for certain older vessels in our fleet.\nItem 7A. Quantitative and Qualitative Disclosures about Market Risk\nGeneral\nWe are exposed to market risk attributable to changes in interest rates, foreign currency exchange rates and fuel prices. We attempt to minimize these risks through a combination of our normal operating and financing activities and through the use of derivatives. The financial impacts of these derivative instruments are primarily offset by corresponding changes in the underlying exposures being hedged. We achieve this by closely matching the notional, term and conditions of the derivatives with the underlying risk being hedged. We do not hold or issue derivatives for trading or other speculative purposes. Derivative positions are monitored using techniques including market valuations and sensitivity analyses.\nInterest Rate Risk\nAs of December 31, 2024, 94% of our debt was fixed and 6% was variable. As of December 31, 2023, 95% of our debt was fixed and 5% was variable. The change in our fixed rate percentage from December 31, 2023 to December 31, 2024 was primarily due to the addition of variable rate debt and the extinguishment of certain fixed rate debt with variable rate debt. Based on our December 31, 2024 outstanding variable rate debt balance, a one percentage point increase in annual Term SOFR interest rates would increase our annual interest expense by approximately $7.8 million excluding the effects of capitalization of interest.\nForeign Currency Exchange Rate Risk\nAs of December 31, 2024, we had foreign currency derivatives to hedge the exposure to volatility in foreign currency exchange rates related to our ship construction contracts denominated in euros. These derivatives hedge the foreign currency exchange rate risk on a portion of the payments on our ship construction contracts. As of December 31, 2024, the payments not hedged aggregated €16.0 billion, or $16.6 billion based on the euro/U.S. dollar exchange rate as of December 31, 2024. As of December 31, 2023, the payments not hedged aggregated €5.4 billion, or $6.0 billion, based on the euro/U.S. dollar exchange rate as of December 31, 2023. The change from December 31, 2023 to December 31, 2024 was primarily due to the eight new effective newbuild agreements, which excludes the two ships on order for Oceania Cruises, which are currently scheduled for delivery in 2030 and 2031, that we have the option to cancel. We estimate that a 10% change in the euro as of December 31, 2024 would result in a $1.7 billion change in the U.S. dollar value of the foreign currency denominated remaining payments.\nFuel Price Risk\nOur exposure to market risk for changes in fuel prices relates to the forecasted purchases of fuel on our ships. Fuel expense, as a percentage of our total cruise operating expense, was 12.3% for the year ended December 31, 2024 and \n62\n\n\nTable of Contents\n13.1% for the year ended December 31, 2023. We use fuel derivative agreements to mitigate the financial impact of fluctuations in fuel prices and as of December 31, 2024, we had hedged approximately 56% and 21% of our 2025 and 2026 projected metric tons of fuel purchases, respectively. As of December 31, 2023, we had hedged approximately 21% of our 2025 projected metric tons of fuel purchases. Additional fuel swaps were executed between December 31, 2023 to December 31, 2024 to lower our fuel price risk.\nWe estimate that a 10% increase in our weighted-average fuel price would increase our anticipated 2025 fuel expense by $65.1 million. This increase would be partially offset by an increase in the fair value of our fuel swap agreements of $34.7 million. Fair value of our derivative contracts is derived using valuation models that utilize the income valuation approach. These valuation models take into account the contract terms such as maturity, as well as other inputs such as fuel types, fuel curves, creditworthiness of the counterparty and the Company, as well as other data points.\n​\nItem 8. Financial Statements and Supplementary Data\nOur Consolidated Financial Statements are included beginning on page F-1 of this report.\n​\nItem 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\n​\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management has evaluated, with the participation of our Chief Executive Officer and Chief Financial Officer, the effectiveness of our disclosure controls and procedures, as such term is defined in Exchange Act Rule 13a-15(e), as of December 31, 2024. There are inherent limitations to the effectiveness of any system of disclosure controls and procedures, including the possibility of human error and the circumvention or overriding of the controls and procedures. Accordingly, even effective disclosure controls and procedures can only provide reasonable assurance of achieving their control objectives. Based upon management’s evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2024, to provide reasonable assurance that the information required to be disclosed by us in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that it is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the 2013 \nInternal Control-Integrated Framework \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO Framework”). Based on this evaluation under the COSO Framework, management concluded that our internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, the independent registered public accounting firm that audited the financial statements included in this Annual Report, as stated in their report, which is included on page F-1.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n63\n\n\nTable of Contents\nLimitations on the Effectiveness of Controls\nIt should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events. Because of these and other inherent limitations of control systems, there is only the reasonable assurance that our controls will succeed in achieving their goals under all potential future conditions.\n​\nItem 9B. Other Information\n10b5-1 Trading Arrangements\nDuring the three months ended December 31, 2024, \nn\no\nn\ne\n of our directors or officers subject to Section 16 of the Securities Exchange Act of 1934 adopted or terminated any “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement” (in each case, as defined in Item 408(a) of Regulation S-K).\n​\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\n​\nNot applicable.\n​\n​\n64\n\n\nTable of Contents\nPART III\n​\nItem 10. Directors, Executive Officers and Corporate Governance\nExcept for information concerning executive officers (called for by Item 401(b) of Regulation S-K), which is included in Part I of this Annual Report, and except as disclosed below with respect to our Code of Ethical Business Conduct, the information required under Item 10 is incorporated herein by reference to our definitive proxy statement to be filed with the SEC within 120 days after the end of our fiscal year ended December 31, 2024 in connection with our 2025 Annual General Meeting of Shareholders. \nCode of Ethical Business Conduct\nWe have adopted a Code of Ethical Business Conduct that applies to all of our employees, including our principal executive officer, principal financial officer, principal accounting officer or controller and persons performing similar functions, and our directors. This document is posted on our website at \nhttps://www.nclhltd.com/investors\n. We intend to disclose waivers from, and amendments to, our Code of Ethical Business Conduct that apply to our directors and executive officers, including our principal executive officer, principal financial officer, principal accounting officers or controller and persons performing similar functions, by posting such information on our website \nhttps://www.nclhltd.com/investors\n to the extent required by applicable rules of the SEC and the NYSE. None of the websites referenced in this Annual Report or the information contained therein is incorporated herein by reference.\n​\nItem 11. Executive Compensation\nThe information required under Item 11 is incorporated herein by reference to our definitive proxy statement to be filed with the SEC within 120 days after the end of our fiscal year ended December 31, 2024 in connection with our 2025 Annual General Meeting of Shareholders.\n​\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required under Item 12 is incorporated herein by reference to our definitive proxy statement to be filed with the SEC within 120 days after the end of our fiscal year ended December 31, 2024 in connection with our 2025 Annual General Meeting of Shareholders.\n​\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required under Item 13 is incorporated herein by reference to our definitive proxy statement to be filed with the SEC within 120 days after the end of our fiscal year ended December 31, 2024 in connection with our 2025 Annual General Meeting of Shareholders.\n​\nItem 14. Principal Accounting Fees and Services\nThe information required under Item 14 is incorporated herein by reference to our definitive proxy statement to be filed with the SEC within 120 days after the end of our fiscal year ended December 31, 2024 in connection with our 2025 Annual General Meeting of Shareholders.\n​\n65\n\n\nTable of Contents\nPART IV\n​\nItem 15. Exhibits, Financial Statement Schedules\n(1) Financial Statements\nOur Consolidated Financial Statements have been prepared in accordance with Item 8. Financial Statements and Supplementary Data and are included beginning on page F-1 of this report.\n(2) Financial Statement Schedule\nSchedule II: Valuation and Qualifying Accounts for the three years ended December 31, 2024 are included on page 81.\n(3) Exhibits\nThe exhibits listed below are filed or incorporated by reference as part of this Annual Report.\nINDEX TO EXHIBITS\nExhibit\nNumber\n    \nDescription of Exhibit\n \n \n3.1\nMemorandum of Association of Norwegian Cruise Line Holdings Ltd. (incorporated herein by reference to Exhibit 3.1 to amendment no. 5 to Norwegian Cruise Line Holdings Ltd.’s registration statement on Form S-1 filed on January 8, 2013 (File No. 333-175579))\n​\n​\n​\n3.2\n​\nMemorandum of Increase of Share Capital of Norwegian Cruise Line Holdings Ltd. (incorporated herein by reference to Exhibit 3.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 21, 2021 (File No. 001-35784))\n \n3.3\nAmended and Restated Bye-Laws of Norwegian Cruise Line Holdings Ltd., effective as of June 13, 2019 (incorporated herein by reference to Exhibit 3.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on June 14, 2019 (File No. 001-35784))\n \n4.1\n​\nIndenture, dated July 21, 2020, by and among NCL Corporation Ltd., as issuer, Norwegian Cruise Line Holdings Ltd., as guarantor, and U.S. Bank National Association, as trustee, with respect to the 5.375% exchangeable senior notes due 2025 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on July 21, 2020 (File No. 001-35784))\n​\n​\n​\n4.2\n​\nIndenture, dated December 18, 2020, by and among NCL Corporation Ltd., as issuer, the guarantors named therein and U.S. Bank National Association, as trustee, principal paying agent, transfer agent and registrar, with respect to the 5.875% senior notes due 2026 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on December 18, 2020 (File No. 001-35784))\n​\n​\n​\n4.3\n​\nIndenture, dated March 3, 2021, by and among NCL Finance, Ltd., as issuer, NCL Corporation Ltd., as guarantor, the other guarantors named therein and U.S. Bank National Association, as trustee, principal paying agent, transfer agent and registrar, with respect to the 6.125% senior notes due 2028 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on March 3, 2021 (File No. 001-35784))\n​\n​\n​\n4.4\n​\nIndenture, dated November 19, 2021, by and among NCL Corporation Ltd., as issuer, Norwegian Cruise Line Holdings Ltd., as guarantor, and U.S. Bank National Association, as trustee, with respect to 1.125% exchangeable senior notes due 2027 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on November 19, 2021 (File No. 001-35784))\n66\n\n\nTable of Contents\n​\n​\n​\n4.5\n​\nIndenture, dated February 18, 2022, by and among NCL Corporation Ltd., as issuer, the guarantors party thereto and U.S. Bank Trust Company, National Association, as trustee, principal paying agent, transfer agent, registrar and security agent, with respect to 5.875% senior secured notes due 2027 (incorporated herein by reference to Exhibit 4.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on February 22, 2022 (File No. 001-35784))\n \n \n4.6\n​\nIndenture, dated February 18, 2022, by and between NCL Corporation Ltd., as issuer, and U.S. Bank Trust Company, National Association, as trustee, principal paying agent, transfer agent and registrar, with respect to 7.750% senior unsecured notes due 2029 (incorporated herein by reference to Exhibit 4.3 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on February 22, 2022 (File No. 001-35784))\n​\n​\n​\n4.7\n​\nIndenture, dated February 15, 2022, by and among NCL Corporation Ltd., as issuer, Norwegian Cruise Line Holdings Ltd., as guarantor, and U.S. Bank Trust Company, National Association, as trustee, with respect to 2.50% exchangeable senior notes due 2027 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on February 22, 2022 (File No. 001-35784))\n​\n​\n​\n4.8\n​\nIndenture, dated October 18, 2023, by and among NCL Corporation Ltd., as issuer, the guarantors party thereto, U.S. Bank Trust Company, National Association, as trustee, principal paying agent, transfer agent and registrar, and JPMorgan Chase Bank, N.A., as security agent, with respect to 8.125% Senior Secured Notes Due 2029 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on October 19, 2023 (File No. 001-35784))\n​\n​\n​\n4.9\n​\nSupplemental Indenture, dated January 22, 2025, by and among NCL Corporation Ltd., as issuer, the guarantors party thereto, U.S. Bank Trust Company, National Association, as trustee, principal paying agent, transfer agent and registrar, and JPMorgan Chase Bank, N.A., as security agent (incorporated herein by reference to Exhibit 4.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on January 22, 2025 (File No. 001-35784))\n​\n​\n​\n4.10\n​\nIndenture, dated September 17, 2024, between NCL Corporation Ltd., as issuer, and U.S. Bank Trust Company, National Association, as trustee, with respect to 6.250% Senior Notes due 2030 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on September 17, 2024 (File No. 001-35784))\n \n \n4.11\n​\nIndenture, dated January 22, 2025, between NCL Corporation Ltd., as issuer, and U.S. Bank Trust Company, National Association, as trustee, with respect to 6.750% Senior Notes Due 2032 (incorporated herein by reference to Exhibit 4.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on January 22, 2025 (File No. 001-35784))\n​\n​\n​\n4.12\nForm of Certificate of Ordinary Shares (incorporated herein by reference to Exhibit 4.7 to amendment no. 5 to Norwegian Cruise Line Holdings Ltd.’s registration statement on Form S-1 filed on January 8, 2013 (File No. 333-175579))\n​\n​\n​\n4.13\n​\nDescription of Securities of Norwegian Cruise Line Holdings Ltd. (incorporated herein by reference to Exhibit 4.16 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024) (File No. 001-35784))\n \n9.1\nDeed of Trust, dated January 24, 2013, by and between Norwegian Cruise Line Holdings Ltd. and State House Trust Company Limited (incorporated herein by reference to Exhibit 9.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on January 30, 2013 (File No. 001-35784))\n​\n​\n​\n10.1\n \nFourth Supplemental Agreement, dated June 15, 2023, to Breakaway Three Credit Agreement, dated October 12, 2012, by and among Breakaway Three, Ltd., as borrower, NCL Corporation Ltd., as \n67\n\n\nTable of Contents\nguarantor, NCL International, Ltd., as shareholder, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.7 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#†\n​\n​\n​\n10.2\n​\nFifth Supplemental Agreement, dated October 23, 2023, to Breakaway Three Credit Agreement, dated October 12, 2012, by and among Breakaway Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.8 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.3\n​\nSixth Supplemental Agreement, dated November 30, 2023, to Breakaway Three Credit Agreement, dated October 12, 2012, by and among Breakaway Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.9 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.4**\n​\nSeventh Supplemental Agreement, dated January 31, 2025, to Breakaway Three Credit Agreement, dated October 12, 2012, by and among Breakaway Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent#\n​\n​\n​\n10.5\n \nFifth Supplemental Agreement, dated June 15, 2023, to Breakaway Four Credit Agreement, dated October 12, 2012, by and among Breakaway Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.10 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#†\n \n \n10.6\n \nSixth Supplemental Agreement, dated October 23, 2023, to Breakaway Four Credit Agreement, dated October 12, 2012, by and among Breakaway Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.11 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.7\n​\nSeventh Supplemental Agreement, dated November 30, 2023, to Breakaway Four Credit Agreement, dated October 12, 2012, by and among Breakaway Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent (incorporated herein by reference to Exhibit 10.12 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.8**\n​\nEighth Supplemental Agreement, dated January 31, 2025, to Breakaway Four Credit Agreement, dated October 12, 2012, by and among Breakaway Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR agent#\n68\n\n\nTable of Contents\n​\n​\n​\n10.9\n​\nSeventh Amended and Restated Credit Agreement, dated January 22, 2025, by and among NCL Corporation Ltd., as borrower, the subsidiary guarantors party thereto, the lenders party thereto, JPMorgan Chase Bank, N.A., as administrative agent and as collateral agent, and the joint bookrunners and arrangers and co-documentation agents named thereto (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on January 22, 2025 (File No. 001-35784))#†\n​\n​\n​\n10.10\n​\nFifth Supplemental Agreement, dated June 15, 2023, to Seahawk One Credit Agreement, dated July 14, 2014, by and among Seahawk One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.14 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#†\n​\n​\n​\n10.11\n​\nSixth Supplemental Agreement, dated October 23, 2023, to Seahawk One Credit Agreement, dated July 14, 2014, by and among Seahawk One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.15 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.12\n \nSeventh Supplemental Agreement, dated November 30, 2023, to Seahawk One Credit Agreement, dated July 14, 2014, by and among Seahawk One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.16 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.13**\n​\nEighth Supplemental Agreement, dated January 31, 2025, to Seahawk One Credit Agreement, dated July 14, 2014, by and among Seahawk One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent#\n \n \n10.14\n​\nSixth Supplemental Agreement, dated June 15, 2023, to Seahawk Two Credit Agreement, dated July 14, 2014, by and among Seahawk Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.17 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#†\n​\n​\n​\n10.15\n​\nSeventh Supplemental Agreement, dated October 23, 2023, to Seahawk Two Credit Agreement, dated July 14, 2014, by and among Seahawk Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.18 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.16\n \nEighth Supplemental Agreement, dated November 30, 2023, to Seahawk Two Credit Agreement, dated July 14, 2014, by and among Seahawk Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders \n69\n\n\nTable of Contents\nparty thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent (incorporated herein by reference to Exhibit 10.19 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.17**\n​\nNinth Supplemental Agreement, dated January 31, 2025, to Seahawk Two Credit Agreement, dated July 14, 2014, by and among Seahawk Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, NCL (Bahamas) Ltd., as charterer, the lenders party thereto and KfW IPEX-Bank GmbH, as facility agent, Hermes agent, bookrunner, initial mandated lead arranger, collateral agent and CIRR Agent#\n \n \n10.18\n​\nAmendment and Restatement Agreement, dated as of May 19, 2023, among Explorer New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale, and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of July 31, 2013 (incorporated herein by reference to Exhibit 10.8 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 8, 2023 (File No. 001-35784)) #†\n​\n​\n​\n10.19\n​\nAmendment Agreement, dated October 24, 2023 and effective as of November 9, 2023, among Explorer New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale, and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.27 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n \n \n10.20\n \nSupplemental Agreement, dated November 30, 2023, among Explorer New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.28 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.21**\n​\nSupplemental Agreement, dated January 31, 2025, among Explorer New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as shareholder and charterer, Norwegian Cruise Line Holdings Ltd., as the holding, and Crédit Agricole Corporate and Investment Bank, as agent\n​\n​\n​\n10.22\n​\nAmendment and Restatement Agreement, dated as of May 19, 2023, among Explorer II New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale, HSBC Bank PLC, and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of March 30, 2016 (incorporated herein by reference to Exhibit 10.14 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 8, 2023 (File No. 001-35784)) #†\n \n \n10.23\n​\nAmendment Agreement, dated October 24, 2023 and effective as of November 9, 2023, among Explorer II New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale, HSBC Bank PLC, and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment \n70\n\n\nTable of Contents\nBank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.30 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.24\n \nSupplemental Agreement, dated November 30, 2023, among Explorer II New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as charterer and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, Société Générale, HSBC Bank PLC, and KfW IPEX-Bank GmbH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.31 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.25**\n​\nSupplemental Agreement, dated January 31, 2025, among Explorer II New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as shareholder and charterer, Norwegian Cruise Line Holdings Ltd., as the holding, and Crédit Agricole Corporate and Investment Bank, as agent\n​\n​\n​\n10.26\n​\nAmendment and Restatement Agreement, dated as of May 19, 2023, among Leonardo One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of April 12, 2017 (incorporated herein by reference to Exhibit 10.9 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 8, 2023 (File No. 001-35784)) #†\n \n \n10.27\n​\nSupplemental Agreement, dated October 23, 2023, among Leonardo One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., NCL (Bahamas) Ltd., as charterer, the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, and Cassa Depositi e Prestiti S.P.A., as mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.33 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.28\n \nSupplemental Agreement, dated November 30, 2023, among Leonardo One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., NCL (Bahamas) Ltd., as charterer, the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH and Cassa Depositi e Prestiti S.P.A., as mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.34 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.29**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo One, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, NCL (Bahamas) Ltd., as charterer, and Crédit Agricole Corporate and Investment Bank, as agent\n \n \n10.30\n​\nAmendment and Restatement Agreement, dated as of May 19, 2023, among Leonardo Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of April 12, \n71\n\n\nTable of Contents\n2017 (incorporated herein by reference to Exhibit 10.10 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 8, 2023 (File No. 001-35784)) #†\n​\n​\n​\n10.31\n​\nSupplemental Agreement, dated October 23, 2023, among Leonardo Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., NCL (Bahamas) Ltd., as charterer, the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC and Cassa Depositi e Prestiti S.P.A., as mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.36 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.32\n \nSupplemental Agreement, dated November 30, 2023, among Leonardo Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., NCL (Bahamas) Ltd., as charterer, the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC and Cassa Depositi e Prestiti S.P.A., as mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as agent, SACE agent and  security trustee (incorporated herein by reference to Exhibit 10.37 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n \n \n10.33**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo Two, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, NCL (Bahamas) Ltd., as charterer, and Crédit Agricole Corporate and Investment Bank, as agent\n​\n​\n​\n10.34\n​\nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among Leonardo Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, HSBC Bank PLC, BNP Paribas Fortis S.A./N.V., KfW IPEX-Bank GmbH and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and BNP Paribas S.A. as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of April 12, 2017 (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n​\n​\n​\n10.35\n​\nSupplemental Agreement, dated November 30, 2023, among Leonardo Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, HSBC Bank PLC, BNP Paribas Fortis S.A./N.V., KfW IPEX-Bank GmbH and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and BNP Paribas S.A., as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.39 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.36**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo Three, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent#\n​\n​\n​\n10.37\n​\nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among Leonardo Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, KfW IPEX-Bank GmbH, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and BNP Paribas S.A. as agent, SACE agent and security trustee, which amends and restates the Loan Agreement, originally dated as of April 12, 2017 (incorporated herein by reference to Exhibit 10.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n​\n​\n​\n72\n\n\nTable of Contents\n10.38\n​\nSupplemental Agreement, dated November 30, 2023, among Leonardo Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, HSBC Bank PLC, BNP Paribas Fortis S.A./N.V., KfW IPEX-Bank GmbH and Cassa Depositi e Prestiti S.P.A., as joint mandated lead arrangers, and BNP Paribas S.A., as agent, SACE agent and security trustee (incorporated herein by reference to Exhibit 10.41 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.39**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo Four, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent#\n​\n​\n​\n10.40\n​\nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among Leonardo Five, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas, as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee, which amends and restates the Loan Agreement, originally dated as of December 19, 2018 (incorporated herein by reference to Exhibit 10.3 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n​\n​\n​\n10.41\n \nSupplemental Agreement, dated November 30, 2023, among Leonardo Five, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.43 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.42**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo Five, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd, as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent#\n​\n​\n​\n10.43\n​\nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among Leonardo Six, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas, as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee, which amends and restates the Loan Agreement, originally dated as of December 19, 2018 (incorporated herein by reference to Exhibit 10.4 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n \n \n10.44\n​\nSupplemental Agreement, dated November 30, 2023, among Leonardo Six, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to \n73\n\n\nTable of Contents\nExhibit 10.45 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.45**\n​\nSupplemental Agreement, dated January 31, 2025, among Leonardo Six, Ltd., as borrower, NCL Corporation Ltd., as guarantor, NCL International, Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent#\n​\n​\n​\n10.46\n \nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among Explorer III New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale., as joint mandated lead arrangers, BNP Paribas, as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee, which amends and restates the Loan Agreement, originally dated as of December 19, 2018 (incorporated herein by reference to Exhibit 10.5 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n​\n​\n​\n10.47\n​\nAmendment Agreement, dated October 24, 2023 (as modified by a side letter dated November 9, 2023 and a side letter dated November 13, 2023, and as partially effective as of November 9, 2023 and fully effective as of November 16, 2023), among Explorer III New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises S. de R.L., as member and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.47 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n \n \n10.48\n​\nSide Letter, dated November 9, 2023, by and between BNP Paribas S.A., as facility agent, and Explorer III New Build, LLC, as borrower (incorporated herein by reference to Exhibit 10.48 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.49\n​\nSecond Side Letter, dated November 13, 2023, by and between BNP Paribas S.A., as facility agent, and Explorer III New Build, LLC, as borrower (incorporated herein by reference to Exhibit 10.49 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.50\n​\nSupplemental Agreement, dated November 30, 2023, among Explorer III New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.50 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.51**\n​\nSupplemental Agreement, dated January 31, 2025, among Explorer III New Build, LLC, as borrower, NCL Corporation Ltd., as guarantor, Seven Seas Cruises Ltd., as shareholder and charterer, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent\n​\n​\n​\n10.52\n \nAmendment and Restatement Agreement, dated as of May 19, 2023, among O Class Plus One, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises S. de R.L., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and \n74\n\n\nTable of Contents\nInvestment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale., as joint mandated lead arrangers, BNP Paribas, as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee, which amends and restates the Loan Agreement, originally dated as of December 19, 2018 (incorporated herein by reference to Exhibit 10.12 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 8, 2023 (File No. 001-35784)) #†\n \n \n10.53\n \nAmendment Agreement, dated October 25, 2023 and effective as of November 9, 2023, among O Class Plus One, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises S. de R.L., as member and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.52 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n10.54\n​\nSupplemental Agreement, dated November 30, 2023, among O Class Plus One, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises Ltd., as shareholder and charterer, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.53 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n \n \n \n10.55**\n​\nSupplemental Agreement, dated January 31, 2025, among O Class Plus One, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises Ltd., as shareholder and charterer, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent\n​\n​\n​\n10.56\n \nAmendment and Restatement Agreement, dated as of April 6, 2023 and effective as of April 28, 2023, among O Class Plus Two, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises S. de R.L., as shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale., as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee, which amends and restates the Loan Agreement, originally dated as of December 19, 2018 (incorporated herein by reference to Exhibit 10.6 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on May 2, 2023 (File No. 001-35784)) #†\n \n \n10.57\n​\nAmendment Agreement, dated October 24, 2023 and effective as of November 9, 2023, among O Class Plus Two, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises S. de R.L., as member and shareholder, Norwegian Cruise Line Holdings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.55 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.58\n​\nSupplemental Agreement, dated November 30, 2023, among O Class Plus Two, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises Ltd., as shareholder, Norwegian Cruise Line \n75\n\n\nTable of Contents\nHoldings Ltd., the lenders party thereto, Crédit Agricole Corporate and Investment Bank, BNP Paribas Fortis S.A./N.V., HSBC Bank PLC, KfW IPEX-Bank GmbH, Cassa Depositi e Prestiti S.P.A., Banco Santander, S.A. and Société Générale, as joint mandated lead arrangers, BNP Paribas S.A., as facility agent, Crédit Agricole Corporate and Investment Bank, as SACE agent, and HSBC Corporate Trustee Company (UK) Limited, as security trustee (incorporated herein by reference to Exhibit 10.56 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))#\n​\n​\n​\n10.59**\n​\nSupplemental Agreement, dated January 31, 2025, among O Class Plus Two, LLC, as borrower, NCL Corporation Ltd., as guarantor, Oceania Cruises Ltd., as shareholder, Norwegian Cruise Line Holdings Ltd., as the holding, and BNP Paribas S.A., as facility agent#\n​\n​\n​\n10.60\n \nThird Amended and Restated Commitment Letter, dated as of February 23, 2024 and effective as of March 11, 2024, among NCL Corporation Ltd. and the purchasers named therein (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on March 12, 2024 (File No. 001-35784))†\n​\n​\n​\n10.61\n​\nSACE Facility Agreement, dated April 4, 2024, among Oceania Next I, LLC, as borrower, NCL Corporation Ltd., as guarantor, the lenders party thereto, Banco Santander, S.A., BNP Paribas, Caixabank S.A., Cassa Depositi e Prestiti S.P.A., Crédit Agricole Corporate and Investment Bank, KFW Ipex-Bank GMBH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as facility agent, ECA agent and security agent (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on April 8, 2024 (File No. 001-35784))#\n​\n​\n​\n10.62\n​\nSACE Facility Agreement, dated April 4, 2024, among Oceania Next II, LLC, as borrower, NCL Corporation Ltd., as guarantor, the lenders party thereto, Banco Santander, S.A., BNP Paribas, Caixabank S.A., Cassa Depositi e Prestiti S.P.A., Crédit Agricole Corporate and Investment Bank, HSBC Bank PLC, JPMorgan Chase Bank, N.A., London Branch, KFW Ipex-Bank GMBH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as facility agent, ECA agent and security agent (incorporated herein by reference to Exhibit 10.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on April 8, 2024 (File No. 001-35784))#\n​\n​\n​\n10.63\n​\nSACE Facility Agreement, dated April 4, 2024, among DaVinci One, LLC, as borrower, NCL Corporation Ltd., as guarantor, the lenders party thereto, Banco Santander, S.A., BNP Paribas, Caixabank S.A., Cassa Depositi e Prestiti S.P.A., Citibank, N.A. London Branch, Crédit Agricole Corporate and Investment Bank, KFW Ipex-Bank GMBH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as facility agent, ECA agent and security agent (incorporated herein by reference to Exhibit 10.3 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on April 8, 2024 (File No. 001-35784))#\n​\n​\n​\n10.64\n​\nSACE Facility Agreement, dated April 4, 2024, among DaVinci Two, LLC, as borrower, NCL Corporation Ltd., as guarantor, the lenders party thereto, Banco Santander, S.A., BNP Paribas, Caixabank S.A., Cassa Depositi e Prestiti S.P.A., Crédit Agricole Corporate and Investment Bank, HSBC Bank PLC, JPMorgan Chase Bank, N.A., London Branch, KFW Ipex-Bank GMBH, as joint mandated lead arrangers, and Crédit Agricole Corporate and Investment Bank, as facility agent, ECA agent and security agent (incorporated herein by reference to Exhibit 10.4 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on April 8, 2024 (File No. 001-35784))#\n​\n​\n​\n10.65\n \nAmended and Restated Regent Trademark License Agreement, dated February 21, 2011, by and between Regent Hospitality Worldwide, LLC and Seven Seas Cruises, S. DE R.L. (incorporated herein by reference to Exhibit 10.17 to Prestige Cruises International, Inc.’s Amendment No. 1 to Form S-1 filed on March 24, 2014 (File No. 333-193479))\n \n \n​\n​\n​\n76\n\n\nTable of Contents\n10.66\n​\nEmployment Agreement by and between NCL (Bahamas) Ltd. and Mark Kempa, entered into on July 17, 2023 (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on July 21, 2023 (File No. 001-35784))*\n​\n​\n​\n \n \n10.67\n \nTransition, Release and Consulting Agreement by and between NCL (Bahamas) Ltd. and Frank J. Del Rio, entered into on March 15, 2023 (incorporated herein by reference to Exhibit 10.3 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on March 20, 2023 (File No. 001-35784))*\n \n \n10.68\n \nEmployment Agreement by and between NCL (Bahamas) Ltd. and Harry Sommer, entered into on March 15, 2023 (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on March 20, 2023 (File No. 001-35784))*\n \n \n10.69\n \nEmployment Agreement by and between NCL (Bahamas) Ltd. and David Herrera, entered into on March 15, 2023 (incorporated herein by reference to Exhibit 10.2 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on March 20, 2023 (File No. 001-35784))*\n \n \n10.70\n \nEmployment Agreement by and between NCL (Bahamas) Ltd. and Daniel S. Farkas, effective as of July 17, 2023 (incorporated herein by reference to Exhibit 10.68 to Norwegian Cruise Line Holdings Ltd.’s annual report on Form 10-K filed on February 28, 2024 (File No. 001-35784))*\n \n \n10.71\n \nEmployment Agreement by and between NCL (Bahamas) Ltd. and Patrik Dahlgren, effective as of June 12, 2023 (incorporated herein by reference to Exhibit 10.69 to Norwegian Cruise Line Holdings Ltd.’s annual report on Form 10-K filed on February 28, 2024 (File No. 001-35784))*\n \n \n \n10.72**\n​\nEmployment Agreement by and between Prestige Cruise Services LLC and Jason Montague, effective as of December 31, 2024\n​\n​\n​\n10.73\n \nForm of Indemnification Agreement by and between Norwegian Cruise Line Holdings Ltd. and each of its directors, executive officers and certain other officers (effective July 14, 2020) (incorporated herein by reference to Exhibit 10.2 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on August 10, 2020 (File No. 001-35784))*\n \n \n10.74\n \nNorwegian Cruise Line Holdings Ltd. Amended and Restated 2013 Performance Incentive Plan (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 8-K filed on June 14, 2024 (File No. 001-35784))*†\n \n \n10.75\n \nForm of Notice of Grant of Option and Terms and Conditions of Option (incorporated herein by reference to Exhibit 10.1 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on May 8, 2013 (File No. 001-35784))*\n \n \n10.76**\n \nDirectors’ Compensation Policy (effective January 1, 2025)*†\n \n \n10.77\n​\nForm of Director Restricted Share Unit Award Agreement (incorporated herein by reference to Exhibit 10.62 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 29, 2016 (File No. 001-35784))*\n​\n​\n​\n10.78\n​\nForm of Norwegian Cruise Line Holdings Ltd. Performance-based Restricted Share Unit Award Agreement (2022) (incorporated herein by reference to Exhibit 10.59 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on March 1, 2022 (File No. 001-35784))*\n​\n​\n​\n10.79\n​\nForm of Restricted Cash Retention Agreement (2022) (incorporated herein by reference to Exhibit 10.60 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on March 1, 2022 (File No. 001-35784))*\n​\n​\n​\n10.80\n​\nForm of Norwegian Cruise Line Holdings Ltd. Performance-based Restricted Share Unit Award Agreement (2023) (incorporated herein by reference to Exhibit 10.87 to Norwegian Cruise Line Holdings Ltd.’s annual report on Form 10-K filed on February 28, 2024 (File No. 001-35784))*\n77\n\n\nTable of Contents\n​\n​\n​\n10.81\n​\nForm of Norwegian Cruise Line Holdings Ltd. Time-based Restricted Share Unit Award Agreement (2024) (incorporated herein by reference to Exhibit 10.6 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on May 7, 2024 (File No. 001-35784))*†\n​\n​\n​\n10.82\n​\nForm of Norwegian Cruise Line Holdings Ltd. Performance-based Restricted Share Unit Award Agreement (2024) (incorporated herein by reference to Exhibit 10.7 to Norwegian Cruise Line Holdings Ltd.’s Form 10-Q filed on May 7, 2024 (File No. 001-35784))*†\n​\n​\n​\n19\n**\n​\nNorwegian Cruise Line Holdings Ltd. Insider Trading Policy\n​\n​\n​\n21.1**\n \nList of Subsidiaries of Norwegian Cruise Line Holdings Ltd.\n \n \n23.1**\n \nConsent of PricewaterhouseCoopers LLP, independent registered public accounting firm\n \n \n24.1**\n \nPower of Attorney (included on Signatures page of this Annual Report on Form 10-K)\n \n \n31.1**\n \nCertification of the Annual Report Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 by the President and Chief Executive Officer\n \n \n31.2**\n \nCertification of the Annual Report Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 by the Executive Vice President and Chief Financial Officer\n \n \n32.1***\n \nCertification of the Annual Report Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 by the Chief Executive Officer and Chief Financial Officer\n​\n​\n​\n97.1\n​\nPolicy Regarding the Recovery of Certain Compensation Payments (incorporated herein by reference to Exhibit 97.1 to Norwegian Cruise Line Holdings Ltd.’s Form 10-K filed on February 28, 2024 (File No. 001-35784))\n​\n​\n​\n​\n​\n101**\n​\nThe following materials from Norwegian Cruise Line Holdings Ltd.’s Annual Report on Form 10‑K formatted in Inline XBRL:\n​\n​\n​\n​\n​\n(i)    the Consolidated Statements of Operations of NCLH for the years ended December 31, 2024, 2023 and 2022;\n​\n​\n​\n​\n​\n(ii)   the Consolidated Statements of Comprehensive Income (Loss) of NCLH for the years ended December 31, 2024, 2023 and 2022;\n​\n​\n​\n​\n​\n(iii)  the Consolidated Balance Sheets of NCLH as of December 31, 2024 and 2023;\n​\n​\n​\n​\n​\n(iv)  the Consolidated Statements of Cash Flows of NCLH for the years ended December 31, 2024, 2023 and 2022;\n​\n​\n​\n​\n​\n(v)   the Consolidated Statements of Changes in Shareholders’ Equity of NCLH for the years ended December 31, 2024, 2023 and 2022;\n​\n​\n​\n​\n​\n(vi)  the Notes to the Consolidated Financial Statements; and \n​\n​\n​\n​\n​\n(vii)  Schedule II Valuation and Qualifying Accounts.\n​\n​\n​\n104**\n​\nThe cover page from Norwegian Cruise Line Holdings Ltd.’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL and included in the interactive data files submitted as Exhibit 101.\n#     Certain portions of this document that constitute confidential information have been redacted in accordance with Regulation S-K Item 601(b)(10).\n78\n\n\nTable of Contents\n†\nAgreement restates previous versions of agreement.\n*     Management contract or compensatory plan.\n**   Filed herewith.\n*** Furnished herewith.\n​\nItem 16. Form 10-K Summary\nNone.\n​\n79\n\n\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized, in Miami, Florida, on February 27, 2025.\n \nNORWEGIAN CRUISE LINE HOLDINGS LTD.\n \n \n \n \nBy:\n/s/ Harry Sommer\n \nName:\nHarry Sommer\n \nTitle:\nPresident and Chief Executive Officer\n​\nPOWER OF ATTORNEY\nEach person whose signature appears below constitutes and appoints Harry Sommer, Mark A. Kempa, Daniel S. Farkas and Faye L. Ashby, and each of them, his or her true and lawful attorneys-in-fact and agents, each with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with exhibits thereto and other documents in connection therewith, with the SEC, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that each of said attorneys-in-fact and agents or their substitute or substitutes may lawfully so or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Annual Report on Form 10-K has been signed below by the following persons in the capacities and on the date indicated.\nSignature\n    \nTitle\n    \nDate\n \n \n \n \n \n/s/ Harry Sommer\n \nDirector, President and Chief Executive Officer\n \nFebruary 27, 2025\nHarry Sommer\n \n(Principal Executive Officer)\n \n \n \n \n \n \n \n/s/ Mark A. Kempa\n \nExecutive Vice President and Chief Financial Officer\n \nFebruary 27, 2025\nMark A. Kempa\n \n(Principal Financial Officer)\n \n \n \n \n \n \n \n/s/ Faye L. Ashby\n \nSenior Vice President and Chief Accounting Officer\n \nFebruary 27, 2025\nFaye L. Ashby\n \n(Principal Accounting Officer)\n \n \n \n \n \n \n \n/s/ José E. Cil\n \nDirector\n \nFebruary 27, 2025\nJosé E. Cil\n \n \n \n \n \n \n \n \n \n/s/ Harry C. Curtis\n \nDirector\n \nFebruary 27, 2025\nHarry C. Curtis\n \n \n \n \n \n \n \n \n \n/s/ David M. Abrams\n \nDirector\n \nFebruary 27, 2025\nDavid M. Abrams\n \n \n \n \n \n \n \n \n \n/s/ Stella David\n \nDirector and Chairperson\n \nFebruary 27, 2025\nStella David\n \n \n \n \n \n \n \n \n \n/s/ John Chidsey\n \nDirector\n \nFebruary 27, 2025\nJohn Chidsey\n \n \n \n \n \n \n \n \n \n/s/ Mary E. Landry\n \nDirector\n \nFebruary 27, 2025\nMary E. Landry\n \n \n \n \n​\n​\n​\n​\n​\n/s/ Zillah Byng-Thorne\n \nDirector\n \nFebruary 27, 2025\nZillah Byng-Thorne\n \n \n \n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n80\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nSchedule II Valuation and Qualifying Accounts (in thousands)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdditions\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n    \nCharged to\n    \nCharged to \n    \n​\n​\n    \n​\n​\n​\n \nBalance\n​\ncosts and\n​\nother\n​\n​\n​\n​\nBalance\nDescription\n​\nDecember 31, 2021\n \nexpenses (a)\n \naccounts\n​\nDeductions (b)\n \nDecember 31, 2022\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nValuation allowance on deferred tax assets\n​\n$\n \n87,849\n​\n$\n \n52,219\n​\n$\n —\n​\n$\n (\n335\n)\n​\n$\n \n139,733\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n    \nCharged to\n \n    \nCharged to \n    \n​\n​\n    \n​\n​\n​\n \nBalance\n​\ncosts and\n​\nother\n​\n​\n​\n​\nBalance\nDescription\n​\nDecember 31, 2022\n \nexpenses (a)\n \naccounts\n​\nDeductions (b)\n \nDecember 31, 2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nValuation allowance on deferred tax assets\n​\n$\n \n139,733\n​\n$\n \n561,693\n​\n$\n —\n​\n$\n (\n6,661\n)\n​\n$\n \n694,765\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n    \nCharged to\n \n    \nCharged to \n    \n​\n​\n    \n​\n​\n​\n​\nBalance\n​\ncosts and\n​\nother\n​\n​\n​\n​\nBalance\nDescription\n \nDecember 31, 2023\n \nexpenses (a)\n \naccounts\n​\nDeductions (b)\n \nDecember 31, 2024\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nValuation allowance on deferred tax assets\n​\n$\n \n694,765\n​\n$\n \n28,421\n​\n$\n —\n​\n$\n (\n164,496\n)\n​\n$\n \n558,690\n(a)\nAmount relates to recognition of valuation allowances on net U.S. and Bermuda deferred tax assets.\n(b)\nAmount relates to (i) utilization of deferred tax assets and (ii) reversal of valuation allowances.\n​\n81\n\n\nTable of Contents\nIndex to Consolidated Financial Statements\n \nPage\n \n \nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\nF-1\n \nConsolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022\nF-3\n \nConsolidated Statements of Comprehensive Income (Loss) for the years ended December 31, 2024, 2023 and 2022\nF-4\n \nConsolidated Balance Sheets as of December 31, 2024 and 2023\nF-5\n \n \nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\nF-6\n \n \nConsolidated Statements of Changes in Shareholders’ Equity for the years ended December 31, 2024, 2023 and 2022\nF-7\n \n \nNotes to the Consolidated Financial Statements\nF-8\n​\n​\n​\n82\n\n\nTable of Contents\nReport of Independent Registered Public Accounting Firm\n​\nTo the Board of Directors and Shareholders of Norwegian Cruise Line Holdings Ltd.\n​\nOpinions on the Financial Statements and Internal Control over Financial Reporting\n​\nWe have audited the accompanying consolidated balance sheets of Norwegian Cruise Line Holdings Ltd. and its subsidiaries\n \n(the “Company”) as of December 31, 2024\n \nand 2023,\n \nand the related consolidated statements of operations, of comprehensive income (loss), of changes in shareholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and financial statement schedule listed in the\n \nindex appearing under Item 15(2) (collectively referred to as the “consolidated financial statements”).\n \nWe also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  \n​\nIn our opinion, the consolidated\n \nfinancial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024\n \nand 2023\n, \nand the results of its\n \noperations and its\n \ncash flows for each of the three years in the period ended December 31, 2024\n \nin conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the COSO.\n​\nBasis for Opinions\n​\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management's Annual Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated\n \nfinancial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n​\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated\n \nfinancial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.  \n​\nOur audits of the consolidated\n \nfinancial statements included performing procedures to assess the risks of material misstatement of the consolidated\n \nfinancial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated\n \nfinancial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated\n \nfinancial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n​\nDefinition and Limitations of Internal Control over Financial Reporting\n​\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the \nF-1\n\n\nTable of Contents\ntransactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \n​\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n​\nCritical Audit Matters\n​\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates. \n​\nShip Accounting – Ship Improvements \n​\nAs described in Notes 2 and 8 to the consolidated financial statements, the Company’s consolidated ship improvements balance was $3.3 billion as of December 31, 2024. The Company capitalized approximately $398.6 million of costs associated with ship improvements during the year ended December 31, 2024. Ship improvement costs that management believes add value to the ships are capitalized. The useful lives of ship improvements are estimated based on their economic lives. To determine the useful lives of ship improvements, management considers the historical useful lives of similar assets, manufacturer recommended lives, planned maintenance programs, and anticipated changes in technological conditions.\n​\nThe principal considerations for our determination that performing procedures relating to ship accounting for ship improvements is a critical audit matter are the significant judgments by management when determining (i) the useful lives of ship improvements and (ii) whether ship improvement costs add value to the ships and are capitalizable. This in turn led to a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence relating to (i) the appropriateness of the useful lives of ship improvements and (ii) whether ship improvement costs add value to the Company’s ships and are capitalized appropriately. In addition, the audit effort involved the use of professionals with specialized skill and knowledge.\n​\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s assessment of the useful lives of ship improvements and whether ship improvements add value and are capitalized appropriately. These procedures also included, among others, (i) evaluating the reasonableness of the useful lives assigned to ship improvements, considering the historical useful lives of similar assets, manufacturer recommended lives, planned maintenance programs, and anticipated changes in technological conditions and (ii) evaluating whether costs capitalized extend the useful life or increase the functionality of the ship, including testing the accuracy, existence and valuation of capitalized ship improvement costs. Professionals with specialized skill and knowledge were used to assist in evaluating the appropriateness of the assigned useful lives of ship improvements.\n​\n/s/ \nPricewaterhouseCoopers LLP\n \nMiami, Florida\nFebruary 27, 2025\nWe have served as the Company’s auditor since at least 1988. We have not been able to determine the specific year we began serving as auditor of the Company.\nF-2\n\n\nTable of Contents\n​\nNorwegian Cruise Line Holdings Ltd.\nConsolidated Statements of Operations\n(in thousands, except share and per share data)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nRevenue\n \n​\n  \n \n​\n  \n \n​\n  \nPassenger ticket\n​\n$\n \n6,415,545\n​\n$\n \n5,753,966\n​\n$\n \n3,253,799\nOnboard and other\n​\n \n \n3,064,106\n​\n \n \n2,795,958\n​\n \n \n1,589,961\nTotal revenue\n​\n \n \n9,479,651\n​\n \n \n8,549,924\n​\n \n \n4,843,760\nCruise operating expense\n​\n \n  \n​\n \n  \n​\n \n  \nCommissions, transportation and other\n​\n \n \n1,917,443\n​\n \n \n1,883,279\n​\n \n \n1,034,629\nOnboard and other\n​\n \n \n661,553\n​\n \n \n599,904\n​\n \n \n357,932\nPayroll and related\n​\n \n \n1,344,718\n​\n \n \n1,262,119\n​\n \n \n1,088,639\nFuel\n​\n \n \n698,050\n​\n \n \n716,833\n​\n \n \n686,825\nFood\n​\n \n \n312,992\n​\n \n \n358,310\n​\n \n \n263,807\nOther\n​\n \n \n753,940\n​\n \n \n648,142\n​\n \n \n835,254\nTotal cruise operating expense\n​\n \n \n5,688,696\n​\n \n \n5,468,587\n​\n \n \n4,267,086\nOther operating expense\n​\n \n  \n​\n \n  \n​\n \n  \nMarketing, general and administrative\n​\n \n \n1,434,807\n​\n \n \n1,341,858\n​\n \n \n1,379,105\nDepreciation and amortization\n​\n \n \n890,242\n​\n \n \n808,568\n​\n \n \n749,326\nTotal other operating expense\n​\n \n \n2,325,049\n​\n \n \n2,150,426\n​\n \n \n2,128,431\nOperating income (loss)\n​\n \n \n1,465,906\n​\n \n \n930,911\n​\n \n (\n1,551,757\n)\nNon-operating income (expense)\n​\n \n  \n​\n \n  \n​\n \n  \nInterest expense, net\n​\n \n (\n747,223\n)\n​\n \n (\n727,531\n)\n​\n \n (\n801,512\n)\nOther income (expense), net\n​\n \n \n54,224\n​\n \n (\n40,204\n)\n​\n \n \n76,566\nTotal non-operating income (expense)\n​\n \n (\n692,999\n)\n​\n \n (\n767,735\n)\n​\n \n (\n724,946\n)\nNet income (loss) before income taxes\n​\n \n \n772,907\n​\n \n \n163,176\n​\n \n (\n2,276,703\n)\nIncome tax benefit\n​\n \n \n137,350\n​\n \n \n3,002\n​\n \n \n6,794\nNet income (loss)\n​\n$\n \n910,257\n​\n$\n \n166,178\n​\n$\n (\n2,269,909\n)\nWeighted-average shares outstanding\n​\n \n  \n​\n \n  \n​\n \n  \nBasic\n​\n \n \n435,278,605\n​\n \n \n424,424,962\n​\n \n \n419,773,195\nDiluted\n​\n \n \n515,030,548\n​\n \n \n427,400,849\n​\n \n \n419,773,195\nEarnings (loss) per share\n​\n \n  \n​\n \n  \n​\n \n  \nBasic\n​\n$\n \n2.09\n​\n$\n \n0.39\n​\n$\n (\n5.41\n)\nDiluted\n​\n$\n \n1.89\n​\n$\n \n0.39\n​\n$\n (\n5.41\n)\n​\nThe accompanying notes are an integral part of these consolidated financial statements.\n​\nF-3\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nConsolidated Statements of Comprehensive Income (Loss)\n(in thousands)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nNet income (loss)\n​\n$\n \n910,257\n​\n$\n \n166,178\n​\n$\n (\n2,269,909\n)\nOther comprehensive income (loss):\n​\n \n  \n​\n \n  \n​\n \n  \nShipboard Retirement Plan\n​\n \n \n7,118\n​\n \n (\n3,413\n)\n​\n \n \n8,889\nCash flow hedges:\n​\n \n​\n​\n \n​\n​\n \n​\nNet unrealized loss\n​\n \n (\n10,642\n)\n​\n \n (\n1,773\n)\n​\n \n (\n104,017\n)\nAmount realized and reclassified into earnings\n​\n \n \n4,923\n​\n \n (\n26,173\n)\n​\n \n (\n96,865\n)\nTotal other comprehensive income (loss)\n​\n \n \n1,399\n​\n \n (\n31,359\n)\n​\n \n (\n191,993\n)\nTotal comprehensive income (loss)\n​\n$\n \n911,656\n​\n$\n \n134,819\n​\n$\n (\n2,461,902\n)\n​\nThe accompanying notes are an integral part of these consolidated financial statements.\n​\nF-4\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nConsolidated Balance Sheets\n(in thousands, except share data)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n    \n2024\n    \n2023\nAssets\n \n​\n  \n \n​\n  \nCurrent assets:\n \n​\n  \n \n​\n  \nCash and cash equivalents\n​\n$\n \n190,765\n​\n$\n \n402,415\nAccounts receivable, net\n​\n \n \n221,412\n​\n \n \n280,271\nInventories\n​\n \n \n149,718\n​\n \n \n157,646\nPrepaid expenses and other assets\n​\n \n \n448,209\n​\n \n \n472,816\nTotal current assets\n​\n \n \n1,010,104\n​\n \n \n1,313,148\nProperty and equipment, net\n​\n \n \n16,810,650\n​\n \n \n16,433,292\nGoodwill\n​\n \n \n135,764\n​\n \n \n98,134\nTrade names\n​\n \n \n500,525\n​\n \n \n500,525\nOther long-term assets\n​\n \n \n1,512,768\n​\n \n \n1,147,891\nTotal assets\n​\n$\n \n19,969,811\n​\n$\n \n19,492,990\nLiabilities and shareholders’ equity\n​\n \n  \n​\n \n  \nCurrent liabilities:\n​\n \n  \n​\n \n  \nCurrent portion of long-term debt\n​\n$\n \n1,323,769\n​\n$\n \n1,744,778\nAccounts payable\n​\n \n \n171,106\n​\n \n \n174,338\nAccrued expenses and other liabilities\n​\n \n \n1,180,026\n​\n \n \n1,058,919\nAdvance ticket sales\n​\n \n \n3,105,964\n​\n \n \n3,060,666\nTotal current liabilities\n​\n \n \n5,780,865\n​\n \n \n6,038,701\nLong-term debt\n​\n \n \n11,776,721\n​\n \n \n12,314,147\nOther long-term liabilities\n​\n \n \n986,786\n​\n \n \n839,335\nTotal liabilities\n​\n \n \n18,544,372\n​\n \n \n19,192,183\nCommitments and contingencies (Note 13)\n​\n \n  \n​\n \n  \nShareholders’ equity:\n​\n \n  \n​\n \n  \nOrdinary shares, $\n0.001\n par value; \n980,000,000\n shares authorized; and \n439,861,281\n shares issued and \noutstanding\n at December 31, 2024 and \n425,546,570\n shares issued and \noutstanding\n at December 31, 2023\n​\n \n \n440\n​\n \n \n425\nAdditional paid-in capital\n​\n \n \n7,921,918\n​\n \n \n7,708,957\nAccumulated other comprehensive income (loss)\n​\n \n (\n507,039\n)\n​\n \n (\n508,438\n)\nAccumulated deficit\n​\n \n (\n5,989,880\n)\n​\n \n (\n6,900,137\n)\nTotal shareholders’ equity\n​\n \n \n1,425,439\n​\n \n \n300,807\nTotal liabilities and shareholders’ equity\n​\n$\n \n19,969,811\n​\n$\n \n19,492,990\n​\nThe accompanying notes are an integral part of these consolidated financial statements.\n​\nF-5\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nConsolidated Statements of Cash Flows\n(in thousands)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nCash flows from operating activities\n \n​\n  \n \n​\n  \n \n​\n  \nNet income (loss)\n​\n$\n \n910,257\n​\n$\n \n166,178\n​\n$\n (\n2,269,909\n)\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\n​\n \n  \n​\n \n  \n​\n \n  \nDepreciation and amortization expense\n​\n \n \n973,512\n​\n \n \n883,236\n​\n \n \n810,053\nDeferred income taxes, net\n​\n \n (\n155,114\n)\n​\n \n —\n​\n \n —\n(Gain) loss on derivatives\n​\n​\n (\n979\n)\n​\n​\n \n13,760\n​\n​\n \n8,618\nLoss on extinguishment of debt\n​\n \n \n29,175\n​\n \n \n6,701\n​\n \n \n188,799\nProvision for bad debts and inventory obsolescence\n​\n \n \n6,359\n​\n \n \n6,190\n​\n \n \n13,609\nGain on involuntary conversion of assets\n​\n​\n (\n4,771\n)\n​\n​\n (\n6,852\n)\n​\n​\n (\n2,300\n)\nShare-based compensation expense\n​\n \n \n91,781\n​\n \n \n118,940\n​\n \n \n113,563\nNet foreign currency adjustments\n​\n \n (\n25,837\n)\n​\n \n \n8,188\n​\n \n (\n10,795\n)\nChanges in operating assets and liabilities:\n​\n \n​\n​\n \n​\n​\n \n​\nAccounts receivable, net\n​\n \n \n49,304\n​\n \n \n39,649\n​\n \n \n828,661\nInventories\n​\n \n \n6,950\n​\n \n (\n11,042\n)\n​\n \n (\n33,609\n)\nPrepaid expenses and other assets\n​\n \n \n88,366\n​\n \n \n410,266\n​\n \n (\n602,258\n)\nAccounts payable\n​\n \n (\n20,208\n)\n​\n \n (\n50,976\n)\n​\n \n (\n16,196\n)\nAccrued expenses and other liabilities\n​\n \n \n65,348\n​\n \n (\n82,202\n)\n​\n \n \n252,837\nAdvance ticket sales\n​\n \n \n35,680\n​\n \n \n503,678\n​\n \n \n928,947\nNet cash provided by operating activities\n​\n \n \n2,049,823\n​\n \n \n2,005,714\n​\n \n \n210,020\nCash flows from investing activities\n​\n \n  \n​\n \n  \n​\n \n  \nAdditions to property and equipment, net\n​\n \n (\n1,210,952\n)\n​\n \n (\n2,750,362\n)\n​\n \n (\n1,783,857\n)\nProceeds from maturities of short-term investments\n​\n​\n —\n​\n​\n —\n​\n​\n \n240,000\nCash paid on settlement of derivatives\n​\n​\n (\n1,789\n)\n​\n​\n (\n162,942\n)\n​\n​\n (\n224,137\n)\nAcquisition, net of cash acquired\n​\n​\n (\n27,322\n)\n​\n​\n —\n​\n​\n —\nOther, net\n​\n​\n \n10,675\n​\n​\n \n16,161\n​\n​\n \n12,090\n Net cash used in investing activities\n​\n \n (\n1,229,388\n)\n​\n \n (\n2,897,143\n)\n​\n \n (\n1,755,904\n)\nCash flows from financing activities\n​\n \n  \n​\n \n  \n​\n \n  \nRepayments of long-term debt\n​\n \n (\n2,169,045\n)\n​\n \n (\n3,758,234\n)\n​\n \n (\n1,770,172\n)\nProceeds from long-term debt\n​\n \n \n1,298,599\n​\n \n \n4,322,941\n​\n \n \n3,003,003\nProceeds from employee related plans\n​\n \n —\n​\n \n \n5,307\n​\n \n \n5,267\nNet share settlement of restricted share units\n​\n \n (\n25,333\n)\n​\n \n (\n26,860\n)\n​\n \n (\n20,987\n)\nEarly redemption premium\n​\n \n (\n19,166\n)\n​\n \n —\n​\n \n (\n172,012\n)\nDeferred financing fees\n​\n \n (\n117,140\n)\n​\n \n (\n196,297\n)\n​\n \n (\n58,875\n)\nNet cash provided by (used in) financing activities\n​\n \n (\n1,032,085\n)\n​\n \n \n346,857\n​\n \n \n986,224\nNet decrease in cash and cash equivalents\n​\n \n (\n211,650\n)\n​\n \n (\n544,572\n)\n​\n \n (\n559,660\n)\nCash and cash equivalents at beginning of period\n​\n \n \n402,415\n​\n \n \n946,987\n​\n \n \n1,506,647\nCash and cash equivalents at end of period\n​\n$\n \n190,765\n​\n$\n \n402,415\n​\n$\n \n946,987\n​\nThe accompanying notes are an integral part of these consolidated financial statements.\n​\nF-6\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nConsolidated Statements of Changes in Shareholders’ Equity\n(in thousands)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAccumulated \n    \n​\n    \n​\n​\n​\n​\n​\n​\n​\nAdditional\n​\nOther\n​\n​\n​\nTotal\n​\n​\nOrdinary\n \n​\nPaid-in\n \n​\nComprehensive\n​\nAccumulated\n​\nShareholders’\n​\n​\nShares\n    \nCapital\n    \nIncome (Loss)\n    \nDeficit\n    \nEquity\nBalance, December 31, 2021\n​\n$\n \n417\n​\n​\n \n7,513,725\n​\n​\n (\n285,086\n)\n​\n​\n (\n4,796,406\n)\n​\n$\n \n2,432,650\nShare-based compensation\n​\n​\n —\n​\n​\n \n113,563\n​\n​\n —\n​\n​\n —\n​\n​\n \n113,563\nIssuance of shares under employee related plans\n​\n​\n \n4\n​\n​\n \n5,263\n​\n​\n —\n​\n​\n —\n​\n​\n \n5,267\nNet share settlement of restricted share units\n​\n​\n —\n​\n​\n (\n20,987\n)\n​\n​\n —\n​\n​\n —\n​\n​\n (\n20,987\n)\nOther comprehensive loss, net\n​\n​\n —\n​\n​\n —\n​\n​\n (\n191,993\n)\n​\n​\n —\n​\n​\n (\n191,993\n)\nNet loss\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n (\n2,269,909\n)\n​\n​\n (\n2,269,909\n)\nBalance, December 31, 2022\n​\n​\n \n421\n​\n​\n \n7,611,564\n​\n​\n (\n477,079\n)\n​\n​\n (\n7,066,315\n)\n​\n​\n \n68,591\nShare-based compensation\n​\n​\n —\n​\n​\n \n118,940\n​\n​\n —\n​\n​\n —\n​\n​\n \n118,940\nIssuance of shares under employee related plans\n​\n​\n \n4\n​\n​\n \n5,303\n​\n​\n —\n​\n​\n —\n​\n​\n \n5,307\nCommon share issuance for NCLC exchangeable notes\n​\n​\n —\n​\n​\n \n10\n​\n​\n —\n​\n​\n —\n​\n​\n \n10\nNet share settlement of restricted share units\n​\n​\n —\n​\n​\n (\n26,860\n)\n​\n​\n —\n​\n​\n —\n​\n​\n (\n26,860\n)\nOther comprehensive loss, net\n​\n​\n —\n​\n​\n —\n​\n​\n (\n31,359\n)\n​\n​\n —\n​\n​\n (\n31,359\n)\nNet income\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n \n166,178\n​\n​\n \n166,178\nBalance, December 31, 2023\n​\n​\n \n425\n​\n​\n \n7,708,957\n​\n​\n (\n508,438\n)\n​\n​\n (\n6,900,137\n)\n​\n​\n \n300,807\nShare-based compensation\n​\n​\n —\n​\n​\n \n91,781\n​\n​\n —\n​\n​\n —\n​\n​\n \n91,781\nIssuance of shares under employee related plans\n​\n​\n \n4\n​\n​\n (\n4\n)\n​\n​\n —\n​\n​\n —\n​\n​\n —\nCommon share issuance for NCLC exchangeable notes\n​\n​\n \n11\n​\n​\n \n146,517\n​\n​\n —\n​\n​\n —\n​\n​\n \n146,528\nNet share settlement of restricted share units\n​\n​\n —\n​\n​\n (\n25,333\n)\n​\n​\n —\n​\n​\n —\n​\n​\n (\n25,333\n)\nOther comprehensive income, net\n​\n​\n —\n​\n​\n —\n​\n​\n \n1,399\n​\n​\n —\n​\n​\n \n1,399\nNet income\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n \n910,257\n​\n​\n \n910,257\nBalance, December 31, 2024\n​\n$\n \n440\n​\n$\n \n7,921,918\n​\n$\n (\n507,039\n)\n​\n$\n (\n5,989,880\n)\n​\n$\n \n1,425,439\n​\nThe accompanying notes are an integral part of these consolidated financial statements.\n​\nF-7\n\n\nTable of Contents\nNorwegian Cruise Line Holdings Ltd.\nNotes to the Consolidated Financial Statements\n​\n1.\nDescription of Business\nWe are a leading global cruise company which operates the Norwegian Cruise Line, Oceania Cruises and Regent Seven Seas Cruises brands. As of December 31, 2024, we had \n32\n ships with approximately \n66,500\n Berths. The Company expects to add \n13\n additional ships to our fleet from 2025 through 2036. \nWe have \nfour\n Prima Class Ships on order with currently scheduled delivery dates from 2025 through 2028. \nWe have \none\n Allura Class Ship on order for delivery in 2025. We also have orders for three new classes of ships: \nfour\n Oceania Cruises ships with deliveries currently scheduled from 2027 through 2031, \ntwo\n Prestige Class Ships with deliveries currently scheduled in 2026 and 2029 and \nfour\n Norwegian Cruise Line ships with deliveries currently scheduled from 2030 through 2036. We have the option to cancel the last \ntwo\n ships on order for Oceania Cruises currently scheduled for delivery in 2030 and 2031.\nDuring the three months ended December 31, 2023, in response to the OECD’s BEPS 2.0 Pillar 2 global tax reform, the Company restructured its organizational structure by realigning many of its operations across its three different brands into a single jurisdiction, Bermuda.  In connection with the reorganization, among other steps, certain NCLH subsidiaries previously domiciled in the Isle of Man, the Cayman Islands, the Republic of the Marshall Islands, the Republic of Panama and the state of Delaware, were redomiciled to Bermuda.\n​\n2.\nSummary of Significant Accounting Policies\nBasis of Presentation\nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America and contain all normal recurring adjustments necessary for a fair presentation of the results for the periods presented. Estimates are required for the preparation of consolidated financial statements in accordance with generally accepted accounting principles and actual results could differ from these estimates. All significant intercompany accounts and transactions are eliminated in consolidation.\nCash and Cash Equivalents\nCash and cash equivalents are stated at cost and include cash and investments with original maturities of three months or less at acquisition.\nShort-term Investments \nShort-term investments include time deposits with original maturities of greater than three months and up to 12 months, which are stated at cost and present insignificant risk of changes in value.\nAccounts Receivable, Net\nAccounts receivable are shown net of an allowance for credit losses of $\n15.1\n million and $\n13.2\n million as of December 31, 2024 and 2023, respectively. Accounts receivable, net includes $\n0.8\n million and $\n20.1\n million due from credit card processors within 12 months as of December 31, 2024 and 2023, respectively.\nInventories\nInventories mainly consist of provisions, supplies and fuel and are carried at the lower of cost or net realizable value using the first-in, first-out method of accounting.\nF-8\n\n\nTable of Contents\nAdvertising Costs\nAdvertising costs are expensed as incurred. Expenses related to advertising costs totaled $\n513.7\n million, $\n512.7\n million and $\n577.8\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nEarnings Per Share\nBasic EPS is computed by dividing net income by the basic weighted-average number of shares outstanding during each period. Diluted EPS is computed by dividing net income by diluted weighted-average shares outstanding.\nA reconciliation between basic and diluted EPS was as follows (in thousands, except share and per share data):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nNet income (loss)\n​\n$\n \n910,257\n​\n$\n \n166,178\n​\n$\n (\n2,269,909\n)\nEffect of dilutive securities - exchangeable notes\n​\n​\n \n63,308\n​\n​\n —\n​\n​\n —\nNet income (loss) and assumed conversion of exchangeable notes - Diluted EPS\n​\n$\n \n973,565\n​\n$\n \n166,178\n​\n$\n (\n2,269,909\n)\nBasic weighted-average shares outstanding\n​\n \n \n435,278,605\n​\n \n \n424,424,962\n​\n \n \n419,773,195\nDilutive effect of share awards\n​\n \n \n4,039,709\n​\n \n \n2,975,887\n​\n \n —\nDilutive effect of exchangeable notes\n​\n​\n \n75,712,234\n​\n​\n —\n​\n​\n —\nDiluted weighted-average shares outstanding\n​\n \n \n515,030,548\n​\n \n \n427,400,849\n​\n \n \n419,773,195\nBasic EPS\n​\n$\n \n2.09\n​\n$\n \n0.39\n​\n$\n (\n5.41\n)\nDiluted EPS\n​\n$\n \n1.89\n​\n$\n \n0.39\n​\n$\n (\n5.41\n)\n​\nEach exchangeable note (see Note 9 – “Long-Term Debt”) is individually evaluated for its dilutive or anti-dilutive impact on EPS as determined under the if-converted method. Only the interest expense and weighted average shares for exchangeable notes that are dilutive are included in the effect of dilutive securities above. During the year ended December 31, 2023 and 2022 the exchangeable notes have been excluded from diluted weighted-average shares outstanding because the effect of including them would have been anti-dilutive. Share awards are evaluated for a dilutive or anti-dilutive impact on EPS using the treasury stock method. For the years ended December 31, 2024, 2023 and 2022, a total of \n5.1\n million, \n87.6\n million and \n92.6\n million shares, respectively, have been excluded from diluted weighted-average shares outstanding because the effect of including them would have been anti-dilutive.\nProperty and Equipment, Net\nProperty and equipment are recorded at cost. We determine the weighted average useful lives of our ships based primarily on our estimates of the costs and useful lives of the ships’ major component systems on the date of acquisition, such as cabins, main diesels, main electric, superstructure and hull, and their related proportional weighting to the ship as a whole. Ship improvement costs that we believe add value to our ships are capitalized to the ship and depreciated over the shorter of the improvements’ estimated useful lives or the remaining useful life of the ship while costs of repairs and maintenance, including Dry-dock costs, are charged to expense as incurred. During ship construction, certain interest is capitalized as a cost of the ship. Gains or losses on the sale of property and equipment are recorded as a component of operating income (expense) in our consolidated statements of operations. The useful lives of components of new ships and ship improvements are estimated based on the economic lives of the new components. In addition, to determine the useful lives of the major components of new ships and ship improvements, we consider the historical useful lives of similar assets, manufacturer recommended lives, planned maintenance programs and anticipated changes in technological conditions.\nF-9\n\n\nTable of Contents\nDepreciation is computed on a straight-line basis over the estimated useful lives of the assets, after a \n10\n-\n15\n% reduction for the estimated residual values of ships as follows:\n​\n​\n​\n​\n \n​\n    \nUseful Life\nShips\n \n30\n‑\n35 years\nComputer hardware and software\n \n3\n‑\n15 years\nOther property and equipment\n \n3\n‑\n40 years\nLeasehold improvements\n \nShorter of lease term or asset life\nShip improvements\n \nShorter of asset life or life of the ship\n​\nLong-lived assets are reviewed for impairment, based on estimated future undiscounted cash flows, whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Assets are grouped and evaluated at the lowest level for which there are identifiable cash flows that are largely independent of the cash flows of other groups of assets. For ship impairment analyses, the lowest level for which identifiable cash flows are largely independent of other assets and liabilities is each individual ship. We consider historical performance and future estimated results in our evaluation of potential impairment and then compare the carrying amount of the asset to the estimated future cash flows expected to result from the use of the asset. If the carrying amount of the asset exceeds estimated expected undiscounted future cash flows, we measure the amount of the impairment by comparing the carrying amount of the asset to its estimated fair value. We estimate fair value based on the best information available utilizing estimates, judgments and projections as necessary. Our estimate of fair value is generally measured by discounting expected future cash flows at discount rates commensurate with the associated risk.\nGoodwill and Trade Names\nGoodwill represents the excess of cost over the estimated fair value of net assets acquired. Goodwill and other indefinite-lived assets, principally trade names, are reviewed for impairment annually or earlier if there is an event or change in circumstances that would indicate that the carrying value of these assets may not be fully recoverable. We may use a qualitative assessment which allows us to first assess qualitative factors to determine whether it is more likely than not (i.e., more than 50%) that the estimated fair value of a reporting unit is less than its carrying value. For trade names we also may provide a qualitative assessment to determine if there is any indication of impairment.\nIn order to make this evaluation, we consider the following circumstances as well as others:\n●\nChanges in general macroeconomic conditions, such as a deterioration in general economic conditions; limitations on accessing capital; fluctuations in foreign exchange rates; or other developments in equity and credit markets;\n●\nChanges in industry and market conditions such as a deterioration in the environment in which an entity operates; an increased competitive environment; a decline in market-dependent multiples or metrics (in both absolute terms and relative to peers); a change in the market for an entity’s products or services; or a regulatory or political development;\n●\nChanges in cost factors that have a negative effect on earnings and cash flows;\n●\nDecline in overall financial performance (for both actual and expected performance);\n●\nEntity and reporting unit specific events such as changes in management, key personnel, strategy, or customers; litigation; or a change in the composition or carrying amount of net assets; and\n●\nDecline in share price (in both absolute terms and relative to peers).\nIf the result of the qualitative assessment indicated it is more likely than not that the estimated fair value of the asset is less than its carrying value, we would conduct a quantitative assessment comparing the fair value to its carrying value.  \nF-10\n\n\nTable of Contents\nWe have concluded that our business has \nthree\n reporting units. Each brand, Oceania Cruises, Regent and Norwegian, constitutes a business for which discrete financial information is available and management regularly reviews the operating results and, therefore, each brand is considered an operating segment.\nFor our annual impairment evaluation, we performed a qualitative assessment for the Norwegian and Regent reporting units and of each brand’s trade names. As of October 1, 2024, our annual review supports the carrying value of these assets. \nRevenue and Expense Recognition\nDeposits on advance ticket sales are deferred when received and are subsequently recognized as revenue ratably during the voyage sailing days as services are rendered over time on the ship. Cancellation fees are recognized in passenger ticket revenue in the month of the cancellation. Goods and services associated with onboard revenue are generally provided at a point in time and revenue is recognized when the performance obligation is satisfied. A receivable is recognized for onboard goods and services rendered when the voyage is not completed before the end of the period. All associated direct costs of a voyage are recognized as incurred in cruise operating expenses.\nDisaggregation of Revenue\nRevenue and cash flows are affected by economic factors in various geographical regions.\nRevenues by destination consisted of the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n \n2022\nNorth America\n​\n$\n \n5,318,676\n​\n$\n \n5,002,796\n​\n$\n \n3,076,788\nEurope\n​\n \n \n3,035,406\n​\n \n \n2,754,160\n​\n \n \n1,557,308\nAsia-Pacific\n​\n \n \n779,484\n​\n \n \n533,484\n​\n \n \n115,438\nOther\n​\n \n \n346,085\n​\n \n \n259,484\n​\n \n \n94,226\nTotal revenue\n​\n$\n \n9,479,651\n​\n$\n \n8,549,924\n​\n$\n \n4,843,760\n​\nNorth America includes the U.S., the Caribbean, Canada and Mexico. Europe includes the Baltic region, Canary Islands\nand Mediterranean. Asia-Pacific includes Australia, New Zealand and Asia. Other includes all other international\nterritories\n.\n​\nSegment Reporting\n​\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which aims to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 has been applied retrospectively.\nWe have concluded that our business has a single reportable segment. Each brand, Norwegian, Oceania Cruises and Regent, constitutes a business for which discrete financial information is available and management regularly reviews the brand level operating results, and therefore, each brand is considered an operating segment. Our operating segments have similar economic and qualitative characteristics, including similar long-term margins and similar products and services; therefore, we aggregate all of the operating segments into \none\n reportable segment, which is equivalent to our consolidated financial statements.\nOur chief operating decision maker (“CODM”) is the President and Chief Executive Officer who is also a Director on our Board of Directors. Our CODM uses adjusted operating income (loss) in assessing segment performance and deciding how to allocate resources. Resource allocation primarily occurs during the annual budgeting process, where capital is assigned to operations and assessed for availability in investment and financing activities. The CODM \nF-11\n\n\nTable of Contents\nconsiders variances on a monthly and quarterly basis to assess performance against budget, forecast and prior year actual results. Adjusted operating income (loss) is used to assess return on invested capital, which is considered in the non-cash compensation of certain employees based on the reportable segment’s performance.\nThe below table includes our calculation of adjusted operating income (loss), our significant segment expenses therein, and a reconciliation of adjusted operating income (loss) to net income (loss) before income taxes (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nTotal revenue\n​\n$\n \n9,479,651\n​\n$\n \n8,549,924\n​\n$\n \n4,843,760\nCruise operating expense\n​\n \n  \n​\n \n  \n​\n \n  \nCommissions, transportation and other\n​\n \n \n1,917,443\n​\n​\n \n1,883,279\n​\n​\n \n1,034,629\nOnboard and other\n​\n \n \n661,553\n​\n \n \n599,904\n​\n \n \n357,932\nAdjusted payroll and related (1)\n​\n \n \n1,322,465\n​\n \n \n1,241,243\n​\n \n \n1,064,799\nFuel\n​\n \n \n698,050\n​\n \n \n716,833\n​\n \n \n686,825\nFood\n​\n \n \n312,992\n​\n \n \n358,310\n​\n \n \n263,807\nOther\n​\n \n \n753,940\n​\n \n \n648,142\n​\n \n \n835,254\nAdjusted total cruise operating expense\n​\n \n \n5,666,443\n​\n \n \n5,447,711\n​\n \n \n4,243,246\nOther operating expense\n​\n \n  \n​\n \n  \n​\n \n  \nAdjusted marketing, general and administrative (2)\n​\n \n \n1,362,404\n​\n \n \n1,241,482\n​\n \n \n1,286,585\nDepreciation and amortization\n​\n \n \n890,242\n​\n \n \n808,568\n​\n \n \n749,326\nAdjusted total other operating expense\n​\n \n \n2,252,646\n​\n \n \n2,050,050\n​\n \n \n2,035,911\nAdjusted operating income (loss)\n​\n$\n \n1,560,562\n​\n$\n \n1,052,163\n​\n$\n (\n1,435,397\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjusted operating income (loss)\n​\n$\n \n1,560,562\n​\n$\n \n1,052,163\n​\n$\n (\n1,435,397\n)\nNon-cash compensation (3)\n​\n​\n (\n94,656\n)\n​\n​\n (\n121,252\n)\n​\n​\n (\n116,360\n)\nInterest expense, net\n​\n \n (\n747,223\n)\n​\n \n (\n727,531\n)\n​\n \n (\n801,512\n)\nOther income (expense), net\n​\n \n \n54,224\n​\n \n (\n40,204\n)\n​\n \n \n76,566\nNet income (loss) before income taxes\n​\n$\n \n772,907\n​\n$\n \n163,176\n​\n$\n (\n2,276,703\n)\n(1)\nExcludes non-cash deferred compensation expenses related to the crew pension plan and non-cash share-based compensation expenses related to equity awards for shipboard officers. We refer you to Note 11 – “Employee Benefits and Share-Based Compensation.”\n(2)\nExcludes non-cash share-based compensation expenses related to equity awards for corporate employees. We refer you to Note 11 – “Employee Benefits and Share-Based Compensation.”\n(3)\nIncludes non-cash deferred compensation expenses related to the crew pension plan and non-cash share-based compensation expenses related to equity awards, which are included in payroll and related expense and marketing, general and administrative expense.\n​\nAlthough we sell cruises on an international basis, our passenger ticket revenue is primarily attributed to U.S.-sourced guests who make reservations through the U.S. Revenue attributable to U.S.-sourced guests was \n84\n%, \n84\n% and \n85\n% for the years ended December 31, 2024, 2023 and 2022, respectively. \nNo other individual country’s revenues exceeded 10% in any of our last three years.\nSubstantially all of our long-lived assets are located outside of the U.S. and consist primarily of our ships. We had \n21\n ships with Bahamas registry with a carrying value of $\n11.2\n billion as of December 31, 2024 and $\n11.5\n billion as of December 31, 2023. We had \n10\n ships with Marshall Islands registry with a carrying value of $\n3.5\n billion as of December 31, 2024 and $\n3.6\n billion as of December 31, 2023. We also had \none\n ship with U.S. registry with a carrying value of $\n0.3\n billion as of December 31, 2024 and 2023.\nF-12\n\n\nTable of Contents\nDebt Issuance Costs\nDebt issuance costs related to a recognized debt liability are presented in the consolidated balance sheets as a direct deduction from the carrying amount of that debt liability, consistent with debt discounts. For line of credit arrangements and for those debt facilities not fully drawn we defer and present debt issuance costs as an asset. These deferred issuance costs are amortized over the life of the loan. The amortization of deferred financing fees is included in depreciation and amortization expense in the consolidated statements of cash flows; however, for purposes of the consolidated statements of operations it is included in interest expense, net.\nForeign Currency\nThe majority of our transactions are settled in U.S. dollars. We remeasure assets and liabilities denominated in foreign currencies at exchange rates in effect at the balance sheet date. The resulting gains or losses are recognized in our consolidated statements of operations within other income (expense), net. We recognized a gain of $\n53.3\n million, a loss of $\n28.7\n million and a gain of $\n55.8\n million for the years ended December 31, 2024, 2023 and 2022, respectively, related to remeasurement of assets and liabilities denominated in foreign currencies. Remeasurements of foreign currency related to operating activities are recognized within changes in operating assets and liabilities in the consolidated statement of cash flows.\nDerivative Instruments and Hedging Activity\nWe enter into derivative contracts to reduce our exposure to fluctuations in foreign currency exchange rates, interest rates and fuel prices. The criteria used to determine whether a transaction qualifies for hedge accounting treatment includes critical terms match or regression analysis and high effectiveness is achieved when a statistically valid relationship reflects a high degree of offset and correlation between the derivative and the hedged forecasted transaction. As the derivative is marked to fair value, we elected an accounting policy to net the fair value of our derivatives when a master netting arrangement exists with our counterparties.\nA derivative instrument that hedges a forecasted transaction or the variability of cash flows related to a recognized asset or liability may be designated as a cash flow hedge. Changes in fair value of derivative instruments that are designated as cash flow hedges are recorded as a component of accumulated other comprehensive income (loss) until the underlying hedged transactions are recognized in earnings. To the extent that an instrument is not effective as a hedge or is no longer probable of occurring, gains and losses are recognized in other income (expense), net in our consolidated statements of operations. Realized gains and losses related to our effective hedges are recognized in the same line item as the underlying hedged transactions. For presentation in our consolidated statements of cash flows, we have elected to classify the cash flows from our cash flow hedges in the same category as the cash flows from the items being hedged.\nConcentrations of Credit Risk\nWe monitor concentrations of credit risk associated with financial and other institutions with which we conduct significant business. Credit risk, including but not limited to counterparty non-performance under derivative instruments, our undrawn commitment and new ship progress payment guarantees, is not considered significant, as we primarily conduct business with large, well-established financial institutions and insurance companies that we have well-established relationships with and that have credit risks acceptable to us or the credit risk is spread out among a large number of creditors. We do not anticipate non-performance by any of our significant counterparties.\nInsurance\nWe use a combination of insurance and self-insurance for a number of risks including claims related to crew and guests, hull and machinery, war risk, workers’ compensation, property damage, employee healthcare and general liability. Liabilities associated with certain of these risks, including crew and passenger claims, are estimated actuarially based upon known facts, historical trends and a reasonable estimate of future expenses. While we believe these accruals are adequate, the ultimate losses incurred may differ from those recorded.\nF-13\n\n\nTable of Contents\nIncome Taxes\nDeferred tax assets and liabilities are calculated in accordance with the liability method. Deferred taxes are recorded using the currently enacted tax rates that apply in the periods that the differences are expected to reverse. Deferred taxes are not discounted.\nWe provide a valuation allowance on deferred tax assets when it is more likely than not that such assets will not be realized. We regularly assess the need for the valuation allowance on our deferred tax assets, and to the extent that we determine that an adjustment is needed, such adjustment will be recognized in the period that the determination is made. With respect to acquired deferred tax assets, changes within the measurement period that result from new information about facts and circumstances that existed at the acquisition date shall be recognized through a corresponding adjustment to goodwill. Subsequent to the measurement period, all other changes shall be reported as a reduction or increase to income tax expense in our consolidated statements of operations.\nShare-Based Compensation\nWe recognize expense for our share-based compensation awards using a fair-value-based method. Share-based compensation expense is recognized over the requisite service period for awards that are based on a service period and not contingent upon any future performance. We refer you to Note 11 – “Employee Benefits and Share-Based Compensation.”\nRecently Issued Accounting Guidance\nIn December 2023, the FASB issued ASU No. 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which requires improvements to income tax disclosures primarily related to the rate reconciliation and income taxes paid information as well as certain other amendments to improve the effectiveness of income tax disclosures. The amendments in this update are effective for annual periods beginning after December 15, 2024 and should be applied on a prospective basis. We are evaluating the impact of ASU 2023-09 on our notes to the consolidated financial statements. \n​\nIn November 2024, the FASB issued ASU No. 2024-03, \nIncome Statement—Reporting Comprehensive\nIncome—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, which requires disaggregation of certain costs and expenses, including employee compensation, and requires other improvements to disclosures. The amendments in this update are effective for annual periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. The update may be applied on a prospective or retrospective basis. We will evaluate the impact of ASU 2024-03 on our notes to the consolidated financial statements.\n \n​\n3.\nRevenue and Expense from Contracts with Customers\nNature of Goods and Services\nWe offer our guests a multitude of cruise fare options when booking a cruise. Our cruise ticket prices generally include cruise fare and a wide variety of onboard activities and amenities, meals, entertainment and government taxes, fees and port expenses. In some instances, cruise ticket prices include round-trip airfare to and from the port of embarkation, complimentary beverages, unlimited shore excursions, Wi-Fi, pre-cruise hotel packages, and on some of the exotic itineraries, pre- or post-land packages. Prices vary depending on the particular cruise itinerary, stateroom category selected and the time of year that the voyage takes place. Passenger ticket revenue also includes full ship charters as well as government taxes, fees and port expenses.\nDuring the voyage, we generate onboard and other revenue for additional products and services which are not included in the cruise fare, including casino operations, certain food and beverage, gift shop purchases, spa services, Wi-Fi services and other similar items. Food and beverage, casino operations and shore excursions are generally managed directly by us while retail shops, spa services, art auctions and Wi-Fi services may be managed through contracts with \nF-14\n\n\nTable of Contents\nthird-party concessionaires. These contracts generally entitle us to a percentage of the gross sales derived from these concessions, which is recognized on a net basis. While some onboard goods and services may be prepaid prior to the voyage, we utilize point-of-sale systems for discrete purchases made onboard. Certain of our product offerings are bundled and we allocate the value of the bundled goods and services between passenger ticket revenue and onboard and other revenue based upon the relative standalone selling prices of those goods and services.\nTiming of Satisfaction of Performance Obligations and Significant Payment Terms \nThe payment terms and cancellation policies vary by brand, stateroom category, length of voyage, and country of purchase. A deposit for a future booking is required at or soon after the time of booking. Final payment is generally due between \n120 days\n and \n180 days\n before the voyage. Deposits on advance ticket sales are deferred when received and include amounts that are refundable. Deferred amounts are subsequently recognized as revenue ratably during the voyage sailing days as services are rendered over time on the ship. Deposits are generally cancellable and refundable prior to sailing, but may be subject to penalties, depending on the timing of cancellation. The inception of substantive cancellation penalties generally coincides with dates that final payment is due, and penalties generally increase as the voyage sail date approaches. Cancellation fees are recognized in passenger ticket revenue in the month of the cancellation.\nGoods and services associated with onboard revenue are generally provided at a point in time and revenue is recognized when the performance obligation is satisfied. Onboard goods and services rendered may be paid at disembarkation. A receivable is recognized for onboard goods and services rendered when the voyage is not completed before the end of the period.\nCruises that are reserved under full ship charter agreements are subject to the payment terms of the specific agreement and may be either cancelable or non-cancelable. Deposits received on charter voyages are deferred when received and included in advance ticket sales. Deferred amounts are subsequently recognized as revenue ratably over the voyage sailing dates.\nContract Balances\nReceivables from customers are included within accounts receivable, net. As of December 31, 2024 and 2023, our receivables from customers were $\n114.2\n million and $\n126.4\n million, respectively, primarily related to in-transit credit card receivables.\nContract liabilities represent the Company’s obligation to transfer goods and services to a customer. A customer deposit held for a future cruise is generally considered a contract liability only when final payment is both due and paid by the customer and is usually recognized in earnings within \n180 days\n of becoming a contract. Other deposits held and included within advance ticket sales or other long-term liabilities are not considered contract liabilities as they are largely cancelable and refundable. Our contract liabilities are included within advance ticket sales. The future cruise credits are not contracts, and therefore, guests who elected this option are excluded from our contract liability balance; however, the credit for the original amount paid is included in advance ticket sales.\nAs of December 31, 2024, our contract liabilities were $\n2.2\n billion. Of the amounts included within contract liabilities as of December 31, 2024, approximately \n40\n% were refundable in accordance with our cancellation policies. Of the deposits included within advance ticket sales, the majority are refundable in accordance with our cancellation policies and it is uncertain to what extent guests may request refunds. As of December 31, 2023, our contract liabilities were $\n2.2\n billion. Approximately $\n2.1\n billion of the December 31, 2023 contract liability balance has been recognized in revenue for the year ended December 31, 2024. \nThe addition of new ships throughout 2023 increased the contract liability balances in 2024 as the number of sailings available for sale increases after each new ship in delivered. In 2023, \nthree\n new ships were delivered. Additionally, cruises for four ships on order are available for sale.\nF-15\n\n\nTable of Contents\nPractical Expedients and Exemptions\nWe do not disclose information about remaining performance obligations that have original expected durations of one year or less. We recognize revenue in an amount that corresponds directly with the value to the customer of our performance completed to date. Variable consideration, which will be determined based on a future rate and passenger count, is excluded from the disclosure and these amounts are not material. These variable non-disclosed contractual amounts relate to non-cancelable charter agreements and a service concession arrangement with a certain port, both of which are long-term in nature. Amounts that are fixed in nature due to the application of minimum guarantees are also not material and are not disclosed.\nContract Costs\nManagement generally expects that incremental commissions and credit card fees paid as a result of obtaining ticket contracts are recoverable; therefore, we recognize these amounts as assets when they are paid prior to the voyage. Costs of air tickets, port taxes and other fees that fulfill future performance obligations are also considered recoverable and are recorded as assets. Costs incurred to obtain customers were $\n229.6\n million and $\n231.9\n million as of December 31, 2024 and 2023, respectively. Costs to fulfill contracts with customers were $\n120.8\n million and $\n135.5\n million as of December 31, 2024 and 2023, respectively. Both costs to obtain and fulfill contracts with customers are recognized within prepaid expenses and other assets. Incremental commissions, credit card fees, air ticket costs, and port taxes and fees are recognized ratably over the voyage sailing dates, concurrent with associated revenue, and are primarily in commissions, transportation and other expense.\n​\n4\n. Acquisition\n​\nOn April 25, 2024, Norwegian acquired \n100\n% of the voting equity interest of Independent Maritime Advisors Ltd. (“IMA”), a consulting company specializing in project management for newbuilds and vessel conversions for $\n37.5\n million, which consisted primarily of cash and also included deferred consideration and the settlement of a pre-existing relationship.  Norwegian acquired IMA to bring newbuild project management and supervision in-house and optimize the overall capital outflow for newbuild expenditures, which generates synergies that create goodwill.\n​\nThe preliminary purchase price was allocated as follows (in thousands): \n​\n​\n​\n​\n​\nAssets, other than goodwill\n​\n$\n \n4,302\nGoodwill\n​\n \n \n37,630\nLiabilities\n​\n \n (\n9,088\n)\nTotal consideration allocated, net of $\n4.7\n million of cash acquired\n​\n$\n \n32,844\n​\nAs of December 31, 2024, the measurement period pertaining to the acquisition remains open and is subject to further adjustment. The acquisition includes deferred consideration, which is currently considered probable of payment in full; however, if new information arises, a change in consideration could impact our goodwill or liabilities. The acquisition of IMA does not have a material impact on the Company’s consolidated statements of operations.\n​\n5.\nGoodwill and Trade Names\nGoodwill and trade names are not subject to amortization. As of December 31, 2024 and 2023, the carrying values were $\n135.8\n million and $\n98.1\n million, respectively, for goodwill and $\n500.5\n million for trade names. We evaluate goodwill and trade names for impairment annually or more frequently when an event occurs or circumstances change that indicates the carrying value of a reporting unit may not be recoverable.\n​\n​\nF-16\n\n\nTable of Contents\nThe changes in the carrying amount of goodwill are as follows (in thousands): \n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal\n​\n​\nGoodwill\nAccumulated impairment loss\n \n$\n (\n1,290,797\n)\nBalance, December 31, 2023\n​\n​\n \n98,134\nAdditions to goodwill\n​\n​\n \n37,630\nImpairment loss\n​\n​\n —\nBalance, December 31, 2024\n​\n$\n \n135,764\n​\nThe carrying value of our trade names was $\n500.5\n million, which consists of $\n207.5\n million for Norwegian Cruise Line, $\n140.0\n million for Oceania Cruises and $\n153.0\n million for Regent Seven Seas Cruises.\n​\n​\n​\n​\n6.\n   \nLeases\nNature of Leases \nWe have operating leases primarily for port facilities and also corporate offices, warehouses, and certain equipment. Many of our leases include both lease and non-lease components. We have adopted the practical expedient which allows us to combine lease and non-lease components by class of asset. We have applied this expedient for office leases, port facilities, and certain equipment.\nThe components of lease expense were as follows (in thousands): \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended \n    \nYear Ended \n    \nYear Ended \n​\n \nDecember 31, 2024\n \nDecember 31, 2023\n \nDecember 31, 2022\nOperating lease expense\n​\n$\n \n69,836\n​\n$\n \n54,290\n​\n$\n \n47,558\nVariable lease expense\n​\n​\n \n33,246\n​\n​\n \n25,364\n​\n​\n \n29,886\nShort-term lease expense\n​\n​\n \n44,683\n​\n​\n \n36,853\n​\n​\n \n38,476\n​\nLease balances were as follows (in thousands): \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nBalance Sheet location\n    \nDecember 31, 2024\n​\nDecember 31, 2023\nOperating leases\n \n  \n \n​\n  \n​\n​\n  \nRight-of-use assets\n \nOther long-term assets\n​\n$\n \n899,091\n​\n$\n \n753,652\nCurrent operating lease liabilities\n \nAccrued expenses and other liabilities\n​\n​\n \n27,313\n​\n​\n \n23,226\nNon-current operating lease liabilities\n \nOther long-term liabilities\n​\n​\n \n788,669\n​\n​\n \n644,646\n​\nSupplemental cash flow and non-cash information related to leases was as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\nYear Ended \n    \nYear Ended \n    \nYear Ended \n​\n​\nDecember 31, 2024\n \nDecember 31, 2023\n \nDecember 31, 2022\nCash paid for amounts included in the measurement of lease liabilities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOperating cash outflows from operating leases\n​\n$\n \n86,566\n​\n$\n \n122,499\n​\n$\n \n47,828\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRight-of-use assets obtained in exchange for lease obligations:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOperating leases\n​\n​\n \n168,369\n​\n​\n \n77,954\n​\n​\n (\n76,173\n)\n​\nThe right-of-use assets obtained in exchange for lease obligations for the year ended December 31, 2022 decreased primarily related to a modification of a port facility agreement.\nF-17\n\n\nTable of Contents\nOther supplemental information related to leases was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended \n    \nYear Ended \n    \nYear Ended \n    \n​\n​\nDecember 31, 2024\n \nDecember 31, 2023\n \nDecember 31, 2022\n \nWeighted average remaining lease term (years) - operating leases\n​\n \n 26.45\n​\n \n22.68\n​\n \n22.90\n​\nWeighted average discount rate - operating leases\n​\n​\n \n6.87\n%  \n​\n7.92\n%  \n​\n7.33\n%  \n​\nAs of December 31, 2024, maturities of lease liabilities were as follows (in thousands):\n​\n​\n​\n​\n​\n \n​\n​\nOperating\n​\n    \nleases\n2025\n​\n$\n \n81,047\n2026\n​\n \n \n75,425\n2027\n​\n \n \n78,612\n2028\n​\n \n \n71,062\n2029\n​\n \n \n69,463\nThereafter\n​\n \n \n1,490,686\nTotal\n​\n \n \n1,866,295\nLess: Present value discount\n​\n \n (\n1,050,313\n)\nPresent value of lease liabilities\n​\n$\n \n815,982\n​\nSales-Type Lease\nWe have \none\n sales-type lease for constructed land-based transportation equipment and infrastructure. The remaining term of the lease is \n18 years\n. At the end of the lease term, the assets shall be conveyed to the lessee. As of December 31, 2024, the lease receivable is \n$\n38.8\n million and is recognized within accounts receivable, net and other long-term assets. \nThe maturities of the lease receivable as of December 31, 2024 were as follows (in thousands):\n​\n​\n​\n​\n​\n \n​\n​\nSales-type\n​\n    \nlease\n2025\n​\n$\n \n1,839\n2026\n​\n \n \n1,839\n2027\n​\n \n \n1,839\n2028\n​\n \n \n1,839\n2029\n​\n \n \n1,839\nThereafter\n​\n \n \n29,622\nTotal\n​\n$\n \n38,817\n​\nSignificant Assumptions and Judgments in Applying Topic 842 and Practical Expedients Elected\nOur leases contain both fixed and variable payments. Fixed payments and variable lease payments that depend on a rate or index are included in the calculation of the right-of-use asset. Other variable payments are excluded from the calculation unless there is an unavoidable fixed minimum cost related to those payments such as a minimum annual guarantee. Our lease assets are amortized on a straight-line basis except for our rights to use port facilities. The expenses related to port facilities are amortized based on passenger counts as this basis represents the pattern in which the economic benefit is derived from the right to use the underlying asset.\nFor non-consecutive lease terms, which relate to our rights to use certain port facilities, the term of the lease is based on the number of days on which we have the right to use a specified asset. We have adopted the practical expedient to exclude leases with terms of less than one year from being included on the balance sheet. Lease expense for agreements that are short-term are disclosed below and include both fixed and variable payments.\nF-18\n\n\nTable of Contents\nCertain leases include one or more \noptions to extend\n or terminate and are primarily in \nfive-year\n increments. Lease extensions and terminations, including auto-renewing lease terms, were only included in the calculation of the right-of-use asset to the extent that the right to renew or terminate was at the option of the lessor only or where there was a more than insignificant penalty for termination.\nAs our leases do not have a readily determinable implicit rate, we estimated our incremental borrowing rate to determine the net present value of the lease payments at the commencement date. Our incremental borrowing rate was estimated based on the rate we would have obtained if we had borrowed collateralized debt over the lease term to purchase the asset.\nWe have also adopted the practical expedient which allows us, by class of asset, to not separate lease and non-lease components when we are the lessor in the underlying transaction, the transactions would otherwise be accounted for under ASC 606–Revenue Recognition and the non-lease components are the predominant components of the agreements. We have applied this practical expedient to transactions with cruise passengers and concession service providers related to the use of our ships. We refer you to Note 3 – “Revenue and Expense from Contracts with Customers.”\n​\nLeases That Have Not Yet Commenced\n​\nWe have \nthree\n agreements related to our rights to use port facilities which are under construction or certain other port facilities. The lease terms for these agreements have not commenced as of December 31, 2024. Although we have provided or may provide design input or advances related to these assets, we have determined that we do not control these assets during the period of construction. The leases are expected to commence in 2025 and 2028. These port facilities have undiscounted minimum annual guarantees of approximately \n$\n238.5\n million.\n​\n​\n​\n​\n​\nF-19\n\n\nTable of Contents\n7.\nAccumulated Other Comprehensive Income (Loss)\nAccumulated other comprehensive income (loss) was as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2024\n​\n​\n    \n​\n​\n    \n​\n​\n​\nChange\n​\n​\n​\nAccumulated\n​\nChange\n​\nRelated to\n​\n​\n​\nOther\n​\nRelated to\n​\nShipboard\n​\n​\n​\nComprehensive\n​\nCash Flow\n​\nRetirement\n​\n​\n    \nIncome (Loss)\n    \nHedges\n​\n Plan\n​\nAccumulated other comprehensive income (loss) at beginning of period\n​\n$\n (\n508,438\n)\n \n$\n (\n508,524\n)\n​\n$\n \n86\n  \nCurrent period other comprehensive income (loss) before reclassifications\n​\n \n (\n3,902\n)\n​\n \n (\n10,642\n)\n  \n \n \n6,740\n  \nAmounts reclassified into earnings\n​\n \n \n5,301\n​\n \n \n4,923\n(1)\n \n \n378\n(2)\nAccumulated other comprehensive income (loss) at end of period\n​\n$\n (\n507,039\n)\n​\n$\n (\n514,243\n)\n(3)\n$\n \n7,204\n  \n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2023\n​\n​\n    \n​\n​\n    \n​\n​\n​\nChange\n \n​\n​\nAccumulated\n​\nChange\n​\nRelated to\n​\n​\n​\nOther\n​\nRelated to\n​\nShipboard\n​\n​\n​\nComprehensive\n​\nCash Flow\n​\nRetirement\n​\n​\n    \nIncome (Loss)\n    \nHedges\n​\n Plan\n​\nAccumulated other comprehensive income (loss) at beginning of period\n \n$\n (\n477,079\n)\n \n$\n (\n480,578\n)\n​\n$\n \n3,499\n \nCurrent period other comprehensive loss before reclassifications\n \n \n (\n5,441\n)\n \n \n (\n1,773\n)\n \n \n (\n3,668\n)\n \nAmounts reclassified into earnings\n \n \n (\n25,918\n)\n \n \n (\n26,173\n)\n(1)\n \n \n255\n(2)\nAccumulated other comprehensive income (loss) at end of period\n \n$\n (\n508,438\n)\n \n$\n (\n508,524\n)\n​\n$\n \n86\n \n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2022\n​\n​\n    \n​\n​\n    \n​\n​\n​\nChange\n​\n​\n​\nAccumulated\n​\nChange\n​\nRelated to\n​\n​\n​\nOther\n​\nRelated to\n​\nShipboard\n​\n​\n​\nComprehensive\n​\nCash Flow\n​\nRetirement\n​\n​\n    \nIncome (Loss)\n    \nHedges\n​\n Plan\n​\nAccumulated other comprehensive income (loss) at beginning of period\n​\n$\n (\n285,086\n)\n​\n$\n (\n279,696\n)\n​\n$\n (\n5,390\n)\n  \nCurrent period other comprehensive income (loss) before reclassifications\n​\n \n (\n95,506\n)\n​\n \n (\n104,017\n)\n  \n \n \n8,511\n  \nAmounts reclassified into earnings\n​\n \n (\n96,487\n)\n​\n \n (\n96,865\n)\n(1)\n \n \n378\n(2)\nAccumulated other comprehensive income (loss) at end of period\n​\n$\n (\n477,079\n)\n​\n$\n (\n480,578\n)\n  \n$\n \n3,499\n  \n(1)\nWe refer you to Note 10 – “Fair Value Measurements and Derivatives” in these notes to consolidated financial statements for the affected line items in the consolidated statements of operations.\n(2)\nAmortization of prior-service cost and actuarial loss reclassified to other income (expense), net.\n(3)\nIncludes \n$\n30.5\n million of loss expected to be reclassified into earnings in the next 12 months.\n​\nF-20\n\n\nTable of Contents\n8.\nProperty and Equipment, Net\nProperty and equipment, net consisted of the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\n    \n2024\n    \n2023\nShips\n​\n$\n \n18,435,673\n​\n$\n \n18,462,250\nShip improvements\n​\n \n \n3,269,898\n​\n \n \n2,899,114\nShips under construction\n​\n \n \n1,143,711\n​\n \n \n548,182\nLand and land improvements\n​\n \n \n58,370\n​\n \n \n58,370\nOther\n​\n \n \n1,261,404\n​\n \n \n999,471\n​\n​\n \n \n24,169,056\n​\n \n \n22,967,387\nLess: accumulated depreciation\n​\n \n (\n7,358,406\n)\n​\n \n (\n6,534,095\n)\nProperty and equipment, net\n​\n$\n \n16,810,650\n​\n$\n \n16,433,292\n​\nThe Company capitalized approximately $\n398.6\n million of costs associated with ship improvements and $\n140.5\n million associated with other information technology assets during the year ended December 31, 2024. Repairs and maintenance expenses including Dry-dock expenses were $\n205.9\n million, $\n160.8\n million and $\n223.5\n million for the years ended December 31, 2024, 2023 and 2022, respectively, and were recorded within other cruise operating expense.\nShips under construction include progress payments to the shipyard, planning and design fees and other associated costs. Capitalized interest costs which were primarily associated with the construction or revitalization of ships amounted to $\n59.9\n million, $\n56.4\n million and $\n58.4\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n​\n​\nF-21\n\n\nTable of Contents\n9.\nLong-Term Debt\nLong-term debt consisted of the following: \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nInterest Rate\n​\n​\n​\nBalance\n​\n​\nDecember 31, \n​\nMaturities\n​\nDecember 31, \n​\n    \n2024\n    \n2023\n    \nThrough\n    \n2024\n    \n2023\n​\n​\n​\n​\n​\n​\n​\n​\n(in thousands)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRevolving Loan Facility\n​\n \n6.77\n%  \n —\n​\n2026\n​\n$\n \n245,000\n​\n$\n —\n$\n862.5\n million \n6.000\n% exchangeable notes\n​\n —\n​\n \n6.00\n%  \n2024\n​\n​\n —\n​\n​\n \n146,044\n$\n450.0\n million \n5.375\n% exchangeable notes \n​\n \n5.38\n%  \n \n5.38\n%  \n2025\n​\n​\n \n448,527\n​\n​\n \n446,027\n$\n1,150.0\n million \n1.125\n% exchangeable notes\n​\n \n1.13\n%  \n \n1.13\n%  \n2027\n​\n​\n \n1,137,711\n​\n​\n \n1,132,079\n$\n473.2\n million \n2.50\n% exchangeable notes\n​\n \n2.50\n%  \n \n2.50\n%  \n2027\n​\n​\n \n467,764\n​\n​\n \n465,339\n$\n1,000.0\n million \n5.875\n% senior secured notes\n​\n \n5.88\n%  \n \n5.88\n%  \n2027\n​\n​\n \n993,581\n​\n​\n \n990,560\n$\n315.0\n million \n6.25\n% senior unsecured notes\n​\n \n6.25\n%\n —\n​\n2030\n​\n​\n \n310,623\n​\n​\n —\n$\n600.0\n million \n7.75\n% senior unsecured notes\n​\n \n7.75\n%  \n \n7.75\n%  \n2029\n​\n​\n \n594,782\n​\n​\n \n593,521\n$\n790.0\n million \n8.125\n% senior secured notes\n​\n \n8.13\n%  \n \n8.13\n%  \n2029\n​\n​\n \n781,372\n​\n​\n \n779,241\n$\n250.0\n million \n9.75\n% senior secured notes\n​\n —\n​\n \n9.75\n%  \n2028\n​\n​\n —\n​\n​\n \n239,695\n$\n600.0\n million \n8.375\n% senior secured notes\n​\n \n8.38\n%  \n \n8.38\n%  \n2028\n​\n​\n \n593,041\n​\n​\n \n590,796\n$\n525.0\n million \n6.125\n% senior unsecured notes\n​\n \n6.13\n%  \n \n6.13\n%  \n2028\n​\n​\n \n521,495\n​\n​\n \n520,402\n$\n1,425.0\n million \n5.875\n% senior unsecured notes\n​\n \n5.88\n%  \n \n5.88\n%  \n2026\n​\n \n \n1,420,523\n​\n \n \n1,416,779\n$\n565.0\n million \n3.625\n% senior unsecured notes\n​\n —\n​\n \n3.63\n%  \n2024\n​\n​\n —\n​\n​\n \n563,788\n€\n529.8\n million Breakaway one loan (1)\n​\n \n5.88\n%  \n \n6.73\n%  \n2026\n​\n \n \n56,343\n​\n \n \n140,721\n€\n529.8\n million Breakaway two loan (1)\n​\n \n5.12\n%  \n \n5.18\n%  \n2027\n​\n \n \n130,055\n​\n \n \n216,317\n€\n590.5\n million Breakaway three loan (1)\n​\n \n3.47\n%  \n \n3.86\n%  \n2027\n​\n \n \n212,637\n​\n \n \n303,184\n€\n729.9\n million Breakaway four loan (1)\n​\n \n3.32\n%  \n \n3.66\n%  \n2029\n​\n \n \n337,406\n​\n \n \n437,721\n€\n710.8\n million Seahawk 1 term loan (1)\n​\n \n4.10\n%  \n \n4.35\n%  \n2030\n​\n \n \n401,919\n​\n \n \n501,416\n€\n748.7\n million Seahawk 2 term loan (1)\n​\n \n4.06\n%  \n \n4.27\n%  \n2031\n​\n \n \n542,721\n​\n \n \n650,189\nLeonardo newbuild one loan\n​\n \n2.68\n%  \n \n2.68\n%  \n2034\n​\n \n \n878,378\n​\n \n \n960,901\nLeonardo newbuild two loan\n​\n \n2.77\n%  \n \n2.77\n%  \n2035\n​\n \n \n942,721\n​\n \n \n1,022,829\nLeonardo newbuild three loan\n​\n \n1.88\n%  \n \n1.89\n%  \n2037\n​\n \n \n246,738\n​\n \n \n199,689\nLeonardo newbuild four loan\n​\n \n1.97\n%  \n \n1.31\n%  \n2038\n​\n \n \n186,090\n​\n \n \n42,037\nExplorer newbuild loan\n​\n \n3.97\n%  \n \n4.37\n%  \n2028\n​\n \n \n121,395\n​\n \n \n166,239\nSplendor newbuild loan\n​\n \n3.41\n%  \n \n3.62\n%  \n2032\n​\n​\n \n282,809\n​\n​\n \n333,143\nGrandeur newbuild loan\n​\n \n3.70\n%  \n \n3.70\n%  \n2035\n​\n​\n \n462,691\n​\n​\n \n501,987\nMarina newbuild loan\n​\n \n6.78\n%  \n \n7.06\n%  \n2027\n​\n \n \n33,696\n​\n \n \n56,283\nRiviera newbuild loan\n​\n \n6.00\n%  \n \n6.84\n%  \n2026\n​\n \n \n22,536\n​\n \n \n67,683\nVista newbuild loan\n​\n \n3.64\n%  \n \n3.64\n%  \n2035\n​\n​\n \n515,151\n​\n​\n \n560,943\nPrestige newbuild loan\n​\n \n6.38\n%  \n —\n​\n2038\n​\n​\n \n104,269\n​\n​\n —\nPrestige Class 2 newbuild loan\n​\n \n6.38\n%  \n —\n​\n2041\n​\n​\n \n15,105\n​\n​\n —\nNew Oceania Cruises class 1 newbuild loan\n​\n \n6.38\n%  \n —\n​\n2039\n​\n​\n \n65,535\n​\n​\n —\nNew Oceania Cruises class 2 newbuild loan\n​\n \n6.38\n%  \n —\n​\n2040\n​\n​\n \n16,752\n​\n​\n —\nFinance lease and license obligations\n​\nVarious\n \nVarious\n \n2028\n​\n \n \n11,124\n​\n \n \n13,372\nTotal debt\n​\n​\n​\n​\n \n  \n​\n​\n \n13,100,490\n \n​\n \n14,058,925\nLess: current portion of long-term debt\n​\n​\n​\n​\n \n  \n​\n​\n (\n1,323,769\n)\n \n​\n (\n1,744,778\n)\nTotal long-term debt\n​\n​\n​\n​\n \n  \n​\n$\n \n11,776,721\n​\n$\n \n12,314,147\n(1)\nCurrently U.S. dollar-denominated.\n​\n2024 Transactions\nIn February 2024, NCLC and the purchasers named therein (collectively, the “Commitment Parties”) entered into a third amended and restated commitment letter (the “third amended commitment letter”), which became effective in March 2024. The third amended commitment letter amended and restated the commitment letter dated February 22, 2023 and \nF-22\n\n\nTable of Contents\nextended the commitments thereunder through March 2025. Pursuant to the third amended commitment letter, the Commitment Parties have agreed to purchase from NCLC an aggregate principal amount of $\n650\n million of senior unsecured notes due \nfive years\n after the issue date (the “Commitment Notes”) at NCLC’s option. If issued, the Commitment Notes will be subject to an issue fee of \n0.50\n% and will bear interest at a rate per annum equal to (A) the greater of (i) the interest rate of the \n7.75\n% senior notes due 2029 (“2029 Unsecured Notes”) and (ii) the then-current secondary trading yield applicable to the 2029 Unsecured Notes plus (B) \n200\n \nbasis points\n. The Commitment Notes are subject to a one-time structuring fee of \n0.50\n% and a quarterly commitment fee of \n0.75\n% for so long as the commitments with respect to the Commitment Notes are outstanding. \nIn connection with the execution of the third amended commitment letter, NCLC agreed to repurchase all of the outstanding $\n250\n million aggregate principal amount of \n9.75\n% senior secured notes due 2028 (the “2028 Secured Notes”) at a negotiated premium plus accrued and unpaid interest thereon. In March 2024, in connection with the settlement of the repurchase, the aggregate principal amount outstanding under the 2028 Secured Notes was cancelled while also releasing the related collateral. The loss on extinguishment was $\n29.0\n million, recognized in interest expense, net. \nIn November 2023, we executed an agreement for a commitment of €\n200\n million in connection with financial support for our newbuilds, which became available in April 2024. The commitment if drawn will pay interest quarterly at a rate per annum based on an applicable margin plus Euribor 3-months. The commitment may be drawn at any time and is payable within \n364 days\n, but no later than July 15, 2025. Any amount repaid prior to July 15, 2025 may be drawn again. \nIn September 2024, NCLC issued $\n315.0\n million aggregate principal amount of \n6.250\n% senior unsecured notes due March 1, 2030 (the “2030 Notes”). NCLC may, at its option, redeem the 2030 Notes, in whole or in part, (i) prior to March 1, 2027 (the “First Call Date”), at a redemption price equal to \n100\n% of the principal amount of the 2030 Notes to be redeemed plus an applicable “make-whole” amount, plus accrued and unpaid interest and additional amounts, if any, to, but excluding, the redemption date, and (ii) on or after the First Call Date, at the redemption prices set forth in the 2030 Notes indenture, plus accrued and unpaid interest and additional amounts, if any, to, but excluding, the redemption date. In addition, at any time and from time to time prior to the First Call Date, NCLC may redeem up to \n40\n% of the aggregate principal amount of the 2030 Notes with the net proceeds of certain equity offerings at a redemption price equal to \n106.250\n% of the principal amount of the 2030 Notes redeemed, plus accrued and unpaid interest to, but excluding, the redemption date, so long as at least \n60\n% of the aggregate principal amount of the 2030 Notes issued remains outstanding following such redemption. The 2030 Notes pay interest at \n6.250\n% per annum, semiannually in arrears on March 1 and September 1 of each year, to holders of record at the close of business on the immediately preceding February 15 and August 15, respectively. The 2030 Notes indenture contains covenants that limit the ability of NCLC and its restricted subsidiaries to, among other things: (i) grant or assume certain liens; (ii) enter into sale leaseback transactions; and (iii) consolidate, merge, sell or otherwise dispose of all or substantially all of their assets. \nThe net proceeds for the 2030 Notes, after deducting the initial purchasers’ discount but before deducting estimated fees and expenses, together with cash on hand, were used to redeem $\n315.0\n million aggregate principal amount of the \n3.625\n% senior notes due 2024, including to pay any accrued and unpaid interest thereon.\n2025 Transactions\nIn January 2025, the full amount of outstanding borrowings under the Breakaway one loan, Breakaway two loan, Marina newbuild loan and Riviera newbuild loan, plus any accrued and unpaid interest thereon, was repaid with funds drawn from the Revolving Loan Facility and also releasing the related collateral.   \nAlso in January 2025, NCLC issued $\n1.8\n billion aggregate principal amount of \n6.750\n% senior unsecured notes due February 1, 2032 (the “2032 Notes”). NCLC may, at its option, redeem the 2032 Notes, in whole or in part, (i) prior to February 1, 2028 (the “First Call Date”), at a redemption price equal to \n100\n% of the principal amount of the 2032 Notes to be redeemed plus an applicable “make-whole” amount, plus accrued and unpaid interest and additional amounts, if any, to, but excluding, the redemption date, and (ii) on or after the First Call Date, at the redemption prices set forth in the 2032 Notes indenture, plus accrued and unpaid interest and additional amounts, if any, to, but excluding, the redemption date. In addition, at any time and from time to time prior to the First Call Date, NCLC may redeem up to \nF-23\n\n\nTable of Contents\n40\n% of the aggregate principal amount of the 2032 Notes with the net proceeds of certain equity offerings at a redemption price equal to \n106.750\n% of the principal amount of the 2032 Notes redeemed, plus accrued and unpaid interest to, but excluding, the redemption date, so long as at least \n60\n% of the aggregate principal amount of the 2032 Notes issued remains outstanding following such redemption. The 2032 Notes pay interest at \n6.750\n% per annum, semiannually in arrears on February 1 and August 1 of each year, to holders of record at the close of business on the immediately preceding January 15 and July 15, respectively. The 2032 Notes indenture contains covenants that limit the ability of NCLC and its restricted subsidiaries to, among other things: (i) create liens on certain assets to secure debt; (ii) enter into sale leaseback transactions; and (iii) consolidate, merge, sell or otherwise dispose of all or substantially all of their assets. \nThe net proceeds for the 2032 Notes, together with cash on hand, were used to redeem $\n1.2\n billion aggregate principal amount of the \n5.875\n% senior unsecured notes due 2026 and $\n600.0\n million aggregate principal amount of the \n8.375\n% senior secured notes due 2028, together with any accrued and unpaid interest thereon, and to pay any related transaction premiums, fees and expenses. The repayment of the 8.375% senior secured notes due 2028 also released the related collateral. During the three months ended March 31, 2025, the related losses on extinguishment are expected to be approximately $\n50.0\n million, which will be recognized in interest expense, net. \nConcurrently with the above January 2025 transactions, NCLC entered into an amended and restated Revolving Loan Facility (the “Seventh ARCA”). The Seventh ARCA, among other things, increased the aggregate amount of commitments under the Revolving Loan Facility from $\n1.2\n billion to $\n1.7\n billion. The commitments and any loans under the Revolving Loan Facility mature on January 22, 2030, provided that (a) if, on the date that is 91 days prior to the final maturity date of any of NCLC’s outstanding senior notes (other than the exchangeable notes), (i) such senior notes (other than the exchangeable notes) have not been repaid or refinanced with indebtedness maturing after April 23, 2030 and (ii) the aggregate principal amount outstanding under such senior notes exceeds $\n400,000,000\n, the maturity date will be such date if such date is earlier than January 22, 2030, (b) if, on November 17, 2026, the 2027 1.125% Exchangeable Notes have not been repaid or refinanced with indebtedness maturing after April 23, 2030 and a liquidity test is not satisfied, the maturity date will be November 17, 2026 and (c) if, on November 17, 2026, the 2027 2.5% Exchangeable Notes have not been repaid or refinanced with indebtedness maturing after April 23, 2030 and a liquidity test is not satisfied, the maturity date will be November 17, 2026. Loans under the Revolving Loan Facility will accrue interest (x) in the case of alternate base rate loans, at a per annum rate based on an alternate base rate plus a margin of between \n0.00\n% and \n1.00\n% and (y) in the case of term benchmark loans, at a per annum rate based on the adjusted term SOFR plus a margin of between \n1.00\n% and \n2.00\n%. The commitments under the Revolving Loan Facility will accrue an unused commitment fee on the amount of available unused commitments at a rate of between \n0.15\n% and \n0.30\n%. The applicable margin and unused commitment fee will depend on the total leverage ratio as of the applicable date.\nThe Seventh ARCA also modified certain existing negative covenant thresholds and the related collateral. The Seventh ARCA and related guarantees are now secured by first-priority interests in, among other things and subject to certain agreed security principles, \nten\n of our vessels. In January 2025, NCLC also entered into a supplemental indenture that modified the collateral for the \n8.125\n% senior secured notes due 2029 such that collateral is the same as the Seventh ARCA.\nExchangeable Notes \nEach of the 2024 Exchangeable Notes, 2025 Exchangeable Notes, 2027 1.125% Exchangeable Notes and 2027 2.5% Exchangeable Notes (as defined below) contain conversion options that may be settled with NCLH’s ordinary shares. As the options are both indexed to and settled in our ordinary shares, they are not accounted for separately as derivatives.\nAs of December 31, 2024, NCLC had outstanding $\n450.0\n million aggregate principal amount of \n5.375\n% exchangeable senior notes due August 1, 2025 (the “2025 Exchangeable Notes”). The 2025 Exchangeable Notes are guaranteed by NCLH on a senior basis. Holders may exchange their 2025 Exchangeable Notes at their option into redeemable preference shares of NCLC. Upon exchange, the preference shares will be immediately and automatically exchanged, for each $\n1,000\n principal amount of exchanged 2025 Exchangeable Notes, into a number of NCLH’s ordinary shares based on the exchange rate. The exchange rate will initially be \n53.3333\n ordinary shares per $\n1,000\n principal amount of 2025 Exchangeable Notes (equivalent to an initial exchange price of approximately $\n18.75\n per ordinary share). The maximum \nF-24\n\n\nTable of Contents\nexchange rate is \n66.6666\n and reflects potential adjustments to the initial exchange rate, which would only be made in the event of certain make-whole fundamental changes or tax redemption events.  The exchange rate referred to above is also subject to adjustment for any stock split, stock dividend or similar transaction. The 2025 Exchangeable Notes pay interest at \n5.375\n% per annum, semiannually on February 1 and August 1 of each year, to holders of record at the close of business on the immediately preceding January 15 and July 15, respectively.\nAs of December 31, 2024, NCLC had outstanding $\n1,150.0\n million aggregate principal amount of \n1.125\n% exchangeable senior notes due February 15, 2027 (the “2027 1.125% Exchangeable Notes”). The 2027 1.125% Exchangeable Notes are guaranteed by NCLH on a senior basis. Holders may exchange their 2027 1.125% Exchangeable Notes for, at the election of NCLC, cash, ordinary shares of NCLH or a combination of cash and ordinary shares of NCLH, at any time prior to the close of business on the business day immediately preceding August 15, 2026, subject to the satisfaction of certain conditions and during certain periods, and on or after August 15, 2026 until the close of business on the business day immediately preceding the maturity date, regardless of whether such conditions have been met. Upon exchange, the preference shares will be immediately and automatically exchanged, for each $\n1,000\n principal amount of exchanged 2027 1.125% Exchangeable Notes, into a number of NCLH’s ordinary shares based on the exchange rate. The initial exchange rate is \n29.6850\n ordinary shares per $\n1,000\n principal amount of 2027 1.125% Exchangeable Notes (equivalent to an initial exchange price of approximately $\n33.69\n per ordinary share). The maximum exchange rate is \n42.3012\n and reflects potential adjustments to the initial exchange rate, which would only be made in the event of certain make-whole fundamental changes or tax redemption events.  The exchange rate referred to above is also subject to adjustment for any stock split, stock dividend or similar transaction. The 2027 1.125% Exchangeable Notes pay interest at 1.125% per annum, semiannually on February 15 and August 15 of each year, to holders of record at the close of business on the immediately preceding February 1 and August 1, respectively.\nAs of December 31, 2024, NCLC had outstanding $\n473.2\n million in aggregate principal amount of \n2.5\n% exchangeable senior notes due February 15, 2027 (the “2027 2.5% Exchangeable Notes”). The 2027 2.5% Exchangeable Notes are guaranteed by NCLH on a senior basis. At their option, holders may exchange their 2027 2.5% Exchangeable Notes for, at the election of NCLC, cash, ordinary shares of NCLH or a combination of cash and ordinary shares of NCLH, at any time prior to the close of business on the business day immediately preceding August 15, 2026, subject to the satisfaction of certain conditions and during certain periods, and on or after August 15, 2026 until the close of business on the business day immediately preceding the maturity date, regardless of whether such conditions have been met. If NCLC elects to satisfy its exchange obligation solely in ordinary shares or in a combination of ordinary shares and cash, upon exchange, the 2027 2.5% Exchangeable Notes will convert into redeemable preference shares of NCLC, which will be immediately and automatically exchanged, for each $\n1,000\n principal amount of exchanged 2027 2.5% Exchangeable Notes, into a number of NCLH’s ordinary shares based on the exchange rate. The exchange rate initially will be \n28.9765\n ordinary shares per $\n1,000\n principal amount of 2027 2.5% Exchangeable Notes (equivalent to an initial exchange price of approximately $\n34.51\n per ordinary share). The maximum exchange rate is \n44.1891\n and reflects potential adjustments to the initial exchange rate, which would only be made in the event of certain make-whole fundamental changes or tax redemption events.  The exchange rate referred to above is also subject to adjustment for any stock split, stock dividend or similar transaction. The 2027 2.5% Exchangeable Notes pay interest at \n2.5\n% per annum, semiannually on February 15 and August 15 of each year, to holders of record at the close of business on the immediately preceding February 1 and August 1, respectively.\nThe following is a summary of NCLC’s exchangeable notes as of December 31, 2024 (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnamortized \n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\nPrincipal\n​\nDeferred\n​\nNet Carrying\n​\nFair Value\n​\n    \nAmount\n    \nFinancing Fees\n    \nAmount\n    \nAmount\n    \nLeveling\n2025 Exchangeable Notes (1)\n​\n$\n \n449,990\n​\n$\n (\n1,463\n)\n​\n$\n \n448,527\n​\n$\n \n641,560\n​\nLevel 2\n2027 1.125% Exchangeable Notes\n​\n​\n \n1,150,000\n​\n​\n (\n12,289\n)\n​\n​\n \n1,137,711\n​\n​\n \n1,177,347\n​\nLevel 2\n2027 2.5% Exchangeable Notes\n​\n​\n \n473,175\n​\n​\n (\n5,411\n)\n​\n​\n \n467,764\n​\n​\n \n492,395\n​\nLevel 2\n​\n​\nF-25\n\n\nTable of Contents\nThe following is a summary of NCLC’s exchangeable notes as of December 31, 2023 (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnamortized \n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\nPrincipal\n​\nDeferred\n​\nNet Carrying\n​\nFair Value\n​\n    \nAmount\n    \nFinancing Fees\n    \nAmount\n    \nAmount\n    \nLeveling\n2024 Exchangeable Notes (2)\n​\n$\n \n146,601\n​\n$\n (\n557\n)\n​\n$\n \n146,044\n​\n$\n \n217,790\n​\nLevel 2\n2025 Exchangeable Notes\n​\n​\n \n449,990\n​\n​\n (\n3,963\n)\n​\n​\n \n446,027\n​\n​\n \n572,567\n​\nLevel 2\n2027 1.125% Exchangeable Notes\n​\n​\n \n1,150,000\n​\n​\n (\n17,921\n)\n​\n​\n \n1,132,079\n​\n​\n \n1,068,431\n​\nLevel 2\n2027 2.5% Exchangeable Notes\n​\n​\n \n473,175\n​\n​\n (\n7,836\n)\n​\n​\n \n465,339\n​\n​\n \n453,784\n​\nLevel 2\n(1)\nClassified within current portion of long-term debt as of December 31, 2024. We expect that the holders of the 2025 Exchangeable Notes will exchange their 2025 Exchangeable Notes for NCLH ordinary shares if not refinanced prior to maturity.\n(2)\nClassified within current portion of long-term debt as of December 31, 2023. During the year ended December 31, 2024, substantially all the holders of 2024 Exchangeable Notes elected to exchange their 2024 Exchangeable Notes for \n10,658,607\n NCLH ordinary shares and the remaining unexchanged notes were repaid in cash at maturity.\nThe following provides a summary of the interest expense recognized related to the exchangeable notes (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended \n​\nYear Ended \n​\nYear Ended \n​\n    \nDecember 31, 2024\n    \nDecember 31, 2023\n    \nDecember 31, 2022\nCoupon interest\n​\n​\n \n52,222\n​\n​\n \n57,750\n​\n​\n \n55,759\nAmortization of deferred financing fees\n​\n​\n \n11,086\n​\n​\n \n11,669\n​\n​\n \n11,143\nTotal\n​\n$\n \n63,308\n​\n$\n \n69,419\n​\n$\n \n66,902\n​\nThe effective interest rate is \n5.97\n%, \n1.64\n% and \n3.06\n% for the 2025 Exchangeable Notes, 2027 1.125% Exchangeable Notes and 2027 2.5% Exchangeable Notes, respectively.\nInterest Expense\nInterest expense, net for the year ended December 31, 2024 was $\n747.2\n million which included $\n81.6\n million of amortization of deferred financing fees and an approximately $\n29.2\n million loss on extinguishment of debt. Interest expense, net for the year ended December 31, 2023 was $\n727.5\n million which included $\n73.5\n million of amortization of deferred financing fees and a $\n8.8\n million loss on extinguishment and modification of debt. Interest expense, net for the year ended December 31, 2022 was $\n801.5\n million which included $\n59.3\n million of amortization of deferred financing fees and a $\n193.4\n million loss on extinguishment and modification of debt.\nDebt Repayments\nThe following are scheduled principal repayments on our long-term debt including exchangeable notes which can be settled in shares and finance lease obligations as of December 31, 2024 for each of the next five years (in thousands):\n​\n​\n​\n​\nYear\n    \nAmount\n2025\n​\n$\n \n1,323,769\n2026\n​\n \n \n2,486,641\n2027\n​\n \n \n3,309,072\n2028\n​\n \n \n1,720,518\n2029\n​\n \n \n1,935,834\nThereafter\n​\n \n \n2,612,675\nTotal\n​\n$\n \n13,388,509\n​\nWe had an accrued interest liability of $\n202.6\n million and $\n195.2\n million as of December 31, 2024 and 2023, respectively.\n \nF-26\n\n\nTable of Contents\nDebt Covenants\nAs of December 31, 2024, we were in compliance with all of our debt covenants. If we do not continue to remain in compliance with our covenants, we would have to seek additional amendments to or waivers of our covenants. However, no assurances can be made that such amendments or waivers would be approved by our lenders. Generally, if an event of default under any debt agreement occurs, then pursuant to cross default and/or cross acceleration clauses, substantially all of our outstanding debt and derivative contract payables could become due, and all debt and derivative contracts could be terminated, which would have a material adverse impact on our operations and liquidity.\n​\n10.\nFair Value Measurements and Derivatives\nFair value is defined as the price at which an orderly transaction to sell an asset or to transfer a liability would take place between market participants at the measurement date under current market conditions (that is, an exit price at the measurement date from the perspective of a market participant that holds the asset or owes the liability).\nDerivatives are generally recorded at fair value. Contracts that are designated as normal purchases and normal sales are not recorded at fair value. The normal purchases and normal sales exception requires, among other things, physical delivery in quantities expected to be used or sold over a reasonable period in the normal course of business. All of our allowance purchase agreements related to the E.U. ETS meet the criteria specified for this exception.\nFair Value Hierarchy\nThe following hierarchy for inputs used in measuring fair value should maximize the use of observable inputs and minimize the use of unobservable inputs by requiring that the most observable inputs be used when available:\nLevel 1 — Quoted prices in active markets for identical assets or liabilities that are accessible at the measurement dates.\nLevel 2 — Significant other observable inputs that are used by market participants in pricing the asset or liability based on market data obtained from independent sources.\nLevel 3 — Significant unobservable inputs we believe market participants would use in pricing the asset or liability based on the best information available.\nDerivatives\nWe are exposed to market risk attributable to changes in interest rates, foreign currency exchange rates and fuel prices. We attempt to minimize these risks through a combination of our normal operating and financing activities and through the use of derivatives. We assess whether derivatives used in hedging transactions are “highly effective” in offsetting changes in the cash flow of our hedged forecasted transactions. We use critical terms match or regression analysis for hedge relationships and high effectiveness is achieved when a statistically valid relationship reflects a high degree of offset and correlation between the fair values of the derivative and the hedged forecasted transaction. Cash flows from the derivatives are classified in the same category as the cash flows from the underlying hedged transaction. If it is determined that the hedged forecasted transaction is no longer probable of occurring, then the amount recognized in accumulated other comprehensive income (loss) is released to earnings. There are no amounts excluded from the assessment of hedge effectiveness, and there are no credit-risk-related contingent features in our derivative agreements. We monitor concentrations of credit risk associated with financial and other institutions with which we conduct significant business. Credit risk, including but not limited to counterparty non-performance under derivatives, is not considered significant, as we primarily conduct business with large, well-established financial institutions with which we have established relationships, and which have credit risks acceptable to us, or the credit risk is spread out among many creditors. We do not anticipate non-performance by any of our significant counterparties.\nAs of December 31, 2024, we had fuel swaps, which are used to mitigate the financial impact of volatility of fuel prices pertaining to approximately \n741\n thousand metric tons of our projected fuel purchases, maturing through \nDecember 31, 2026\n. \nF-27\n\n\nTable of Contents\nAs of December 31, 2024, we had fuel swaps pertaining to approximately \n27\n thousand metric tons of our projected fuel purchases which were not designated as cash flow hedges maturing through December 31, 2025. \nAs of December 31, 2024, we had foreign currency forwards and collars which were used to mitigate the financial impact of volatility in foreign currency exchange rates related to our ship construction contracts denominated in euros. The notional amount of our foreign currency contracts were €\n709.9\n million, or $\n735.0\n million based on the euro/U.S. dollar exchange rate as of December 31, 2024. \nThe derivatives measured at fair value and the respective location in the consolidated balance sheets includes the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAssets\n​\nLiabilities\n​\n​\n​\n​\nDecember 31, \n​\nDecember 31, \n​\nDecember 31, \n​\nDecember 31, \n​\n    \nBalance Sheet Location\n    \n2024\n    \n2023\n    \n2024\n    \n2023\nDerivative Contracts Designated as Hedging Instruments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPrepaid expenses and other assets\n​\n$\n \n1,576\n​\n$\n —\n​\n$\n \n1,798\n​\n$\n —\n​\n​\nOther long-term assets\n​\n​\n \n650\n​\n​\n —\n​\n​\n \n208\n​\n​\n —\n​\n​\nAccrued expenses and other liabilities\n​\n \n \n488\n​\n \n \n4,309\n​\n \n \n12,955\n​\n \n \n11,247\n​\n​\nOther long-term liabilities\n​\n \n \n648\n​\n \n \n137\n​\n \n \n2,030\n​\n \n \n8,932\nForeign currency contracts\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAccrued expenses and other liabilities\n​\n \n —\n​\n \n —\n​\n \n \n1,567\n​\n \n —\n​\n​\nOther long-term liabilities\n​\n \n —\n​\n \n —\n​\n \n \n17,427\n​\n \n —\nTotal derivatives designated as hedging instruments\n​\n$\n \n3,362\n​\n$\n \n4,446\n​\n$\n \n35,985\n​\n$\n \n20,179\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDerivative Contracts Not Designated as Hedging Instruments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\n​\nPrepaid expenses and other assets\n​\n$\n \n234\n​\n$\n —\n​\n$\n —\n​\n$\n —\n​\n​\nAccrued expenses and other liabilities\n​\n​\n —\n​\n​\n \n141\n​\n​\n \n390\n​\n​\n \n1,031\n​\n​\nOther long-term liabilities\n​\n​\n —\n​\n​\n —\n​\n​\n \n35\n​\n​\n \n280\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal derivatives not designated as hedging instruments\n​\n$\n \n234\n​\n$\n \n141\n​\n$\n \n425\n​\n$\n \n1,311\nTotal derivatives\n​\n​\n​\n$\n \n3,596\n​\n$\n \n4,587\n​\n$\n \n36,410\n​\n$\n \n21,490\n​\nThe fair values of swap and forward contracts are determined based on inputs that are readily available in public markets or can be derived from information available in publicly quoted markets. The Company determines the value of options and collars utilizing an option pricing model based on inputs that are either readily available in public markets or can be derived from information available in publicly quoted markets. The option pricing model used by the Company is an industry standard model for valuing options and is used by the broker/dealer community. The inputs to this option pricing model are the option strike price, underlying price, risk-free rate of interest, time to expiration, and volatility. The fair value of option contracts considers both the intrinsic value and any remaining time value associated with those derivatives that have not yet settled. The Company also considers counterparty credit risk and its own credit risk in its determination of all estimated fair values.\nOur derivatives and financial instruments were categorized as Level 2 in the fair value hierarchy, and we had no derivatives or financial instruments categorized as Level 1 or Level 3. Our derivative contracts include rights of offset with our counterparties. We have elected to net certain assets and liabilities within counterparties when the rights of offset exist. We are not required to post cash collateral related to our derivative instruments.\nF-28\n\n\nTable of Contents\nThe gross and net amounts recognized within assets and liabilities include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross\n \n​\n​\n​\n​\nGross\n​\n​\n​\n​\n​\nGross\n \n​\nAmounts \n​\nTotal Net\n​\nAmounts\n \n​\n​\n​\nDecember 31, 2024\n    \nAmounts\n    \nOffset\n    \nAmounts\n    \nNot Offset\n    \nNet Amounts\nAssets\n​\n$\n \n2,460\n​\n$\n (\n2,006\n)\n​\n$\n \n454\n​\n$\n —\n​\n$\n \n454\nLiabilities\n​\n​\n \n34,404\n​\n​\n (\n1,136\n)\n​\n​\n \n33,268\n​\n​\n (\n18,994\n)\n​\n​\n \n14,274\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross \n​\n​\n​\n​\nGross \n​\n​\n​\n​\n​\nGross \n​\nAmounts \n​\nTotal Net \n​\nAmounts \n​\n​\n​\nDecember 31, 2023\n    \nAmounts\n    \nOffset\n    \nAmounts\n    \nNot Offset\n    \nNet Amounts\nLiabilities\n​\n$\n \n21,490\n​\n$\n (\n4,587\n)\n​\n$\n \n16,903\n​\n$\n —\n​\n$\n \n16,903\n​\nThe effects of cash flow hedge accounting on accumulated other comprehensive income (loss) include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLocation of Gain\n    \n​\n​\n    \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(Loss) Reclassified\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nfrom Accumulated\n​\nAmount of Gain (Loss) Reclassified\n​\n​\nAmount of Gain (Loss)\n​\nOther Comprehensive\n​\nfrom Accumulated Other\n​\n​\nRecognized in Other\n​\nIncome (Loss) into\n​\nComprehensive\nDerivatives\n    \nComprehensive Income (Loss)\n    \nIncome\n    \nIncome (Loss) into Income\n​\n​\nYear Ended December 31, \n​\n​\n​\nYear Ended December 31, \n​\n​\n2024\n​\n2023\n​\n2022\n​\n​\n​\n2024\n​\n2023\n​\n2022\nFuel contracts\n \n$\n \n9,482\n​\n$\n (\n15,144\n)\n​\n$\n \n106,994\n​\nFuel\n \n$\n \n12,321\n​\n$\n \n39,138\n​\n$\n \n104,250\nFuel contracts\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\nOther income (expense), net\n​\n​\n (\n766\n)\n​\n​\n (\n146\n)\n​\n​\n (\n293\n)\nForeign currency contracts\n \n \n (\n20,124\n)\n​\n \n \n13,371\n​\n \n (\n211,011\n)\n​\nDepreciation and amortization\n \n \n (\n16,478\n)\n​\n \n (\n12,819\n)\n​\n \n (\n7,052\n)\nInterest rate contracts\n \n \n —\n​\n \n —\n​\n \n —\n​\nInterest expense, net\n \n \n —\n​\n \n —\n​\n \n (\n40\n)\nTotal gain (loss) recognized in other comprehensive income (loss)\n \n$\n (\n10,642\n)\n​\n$\n (\n1,773\n)\n​\n$\n (\n104,017\n)\n​\n  \n \n$\n (\n4,923\n)\n​\n$\n \n26,173\n​\n$\n \n96,865\n​\nThe effects of cash flow hedge accounting on the consolidated statements of operations include the following (in thousands): \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2024\n​\n​\n​\n​\n​\nDepreciation \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nand \n​\nInterest \n​\nOther Income\n​\n    \nFuel\n    \nAmortization\n    \nExpense, net\n​\n (\nExpense), net\nTotal amounts of income and expense line items presented in the consolidated statements of operations in which the effects of cash flow hedges are recorded\n​\n$\n \n698,050\n​\n$\n \n890,242\n​\n$\n \n747,223\n​\n$\n \n54,224\n​\n​\n​\n  \n​\n​\n  \n​\n​\n  \n​\n​\n​\nAmount of gain (loss) reclassified from accumulated other comprehensive income (loss) into income\n \n​\n  \n \n​\n  \n \n​\n  \n​\n​\n​\nFuel contracts\n \n​\n \n12,321\n \n​\n —\n \n​\n —\n​\n​\n —\nForeign currency contracts\n \n​\n —\n​\n​\n (\n16,478\n)\n \n​\n —\n​\n​\n —\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmount of loss reclassified from accumulated other comprehensive income (loss) into income as a result that a forecasted transaction is no longer probable of occurring\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n (\n766\n)\n​\n​\nF-29\n\n\nTable of Contents\nThe effects of cash flow hedge accounting on the consolidated statements of operations include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2023\n​\n​\n​\n​\n​\nDepreciation \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nand \n​\nInterest \n​\nOther Income\n​\n​\nFuel\n    \nAmortization\n    \nExpense, net\n​\n (\nExpense), net\nTotal amounts of income and expense line items presented in the consolidated statements of operations in which the effects of cash flow hedges are recorded\n​\n$\n \n716,833\n​\n$\n \n808,568\n​\n$\n \n727,531\n​\n$\n (\n40,204\n)\n​\n​\n​\n  \n​\n​\n  \n​\n​\n  \n​\n​\n​\nAmount of gain (loss) reclassified from accumulated other comprehensive income (loss) into income\n​\n​\n  \n \n​\n  \n \n​\n  \n​\n​\n​\nFuel contracts\n​\n​\n \n39,138\n \n​\n —\n \n​\n —\n​\n​\n —\nForeign currency contracts\n​\n​\n —\n \n​\n (\n12,819\n)\n \n​\n —\n​\n​\n —\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmount of loss reclassified from accumulated other comprehensive income (loss) into income as a result that a forecasted transaction is no longer probable of occurring\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n (\n146\n)\n​\nThe effects of cash flow hedge accounting on the consolidated statements of operations include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, 2022\n​\n    \n​\n​\n    \nDepreciation \n    \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nand\n​\nInterest \n​\nOther Income\n​\n    \nFuel\n    \n \nAmortization\n    \nExpense, net\n    \n (\nExpense), net\nTotal amounts of income and expense line items presented in the consolidated statements of operations in which the effects of cash flow hedges are recorded\n​\n$\n \n686,825\n​\n$\n \n749,326\n​\n$\n \n801,512\n​\n$\n \n76,566\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmount of gain (loss) reclassified from accumulated other comprehensive income (loss) into income\n​\n \n  \n​\n \n  \n​\n \n  \n \n​\n​\nFuel contracts\n​\n​\n \n104,250\n​\n​\n —\n​\n​\n —\n \n​\n —\nForeign currency contracts\n​\n​\n —\n​\n​\n (\n7,052\n)\n​\n​\n —\n \n​\n —\nInterest rate contracts\n​\n​\n —\n​\n​\n —\n​\n​\n (\n40\n)\n \n​\n —\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmount of loss reclassified from accumulated other comprehensive income (loss) into income as a result that a forecasted transaction is no longer probable of occurring\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n (\n293\n)\n​\nThe effects of derivatives not designated as hedging instruments on the consolidated statements of operations include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAmount of Gain (Loss) Recognized in Income\n​\n​\n​\nYear Ended December 31, \n​\nLocation of Gain (Loss)\n    \n2024\n    \n2023\n    \n2022\nDerivatives not designated as hedging instruments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFuel contracts\nOther income (expense), net\n​\n$\n \n1,845\n​\n$\n (\n1,663\n)\n​\n$\n \n33,850\nForeign exchange contracts\nOther income (expense), net\n​\n​\n (\n917\n)\n​\n​\n (\n1,554\n)\n​\n​\n (\n15,055\n)\n​\nLong-Term Debt\nAs of December 31, 2024 and 2023, the fair value of our long-term debt, including the current portion, was $\n12.8\n billion and $\n13.5\n billion, respectively, which was $\n0.6\n billion and $\n0.9\n billion lower, respectively, than the carrying values, excluding deferred financing costs. The difference between the fair value and carrying value of our long-term debt is due to our fixed and variable rate debt obligations carrying interest rates that are above or below market rates at the \nF-30\n\n\nTable of Contents\nmeasurement dates. The fair value of our long-term revolving and term loan facilities was calculated based on estimated rates for the same or similar instruments with similar terms and remaining maturities. The fair value of our exchangeable notes considers observable risk-free rates; credit spreads of the same or similar instruments; and share prices, tenors, and historical and implied volatilities which are sourced from observable market data. The inputs are considered to be Level 2 in the fair value hierarchy. Market risk associated with our long-term variable rate debt is the potential increase in interest expense from an increase in interest rates or from an increase in share values.\nNon-Recurring Measurements of Non-Financial Assets\nGoodwill and other indefinite-lived assets, principally trade names, are reviewed for impairment on an annual basis or earlier if there is an event or change in circumstances that would indicate that the carrying value of these assets may not be fully recoverable.\nWe believe our estimates and judgments with respect to our long-lived assets, principally ships, and goodwill and other indefinite-lived intangible assets are reasonable. Nonetheless, if there was a material change in assumptions used in the determination of such fair values or if there is a material change in the conditions or circumstances that influence such assets, we could be required to record an impairment charge. We estimate fair value based on the best information available utilizing estimates, judgments and projections as necessary. As of October 1, 2024, our annual review supports the carrying value of these assets.\nOther\nThe carrying amounts reported in the consolidated balance sheets of all other financial assets and liabilities approximate fair value.\n11.\nEmployee Benefits and Share-Based Compensation\nAmended and Restated 2013 Performance Incentive Plan\nIn January 2013, NCLH adopted the 2013 Performance Incentive Plan, which as amended and restated through 2023 (the “Restated 2013 Plan”), provided for a maximum aggregate limit of \n42,009,006\n NCLH ordinary shares that could have been delivered pursuant to all awards granted under the plan. In June 2024, NCLH’s shareholders approved a further amendment and restatement of the Restated 2013 Plan to increase the number of NCLH ordinary shares that may be delivered by \n3,000,000\n, resulting in an increase in the maximum aggregate limit to \n45,009,006\n NCLH ordinary shares. Additionally, the expiration date of the Restated 2013 Plan was extended to March 7, 2034. Share options under the plan are granted with an exercise price equal to the closing market price of NCLH shares at the date of grant. \nThe vesting period for time-based options is typically set at \nthree\n or \nfour\n years with a contractual life of \n10 years\n. The vesting period for time-based and performance-based restricted share units is generally \nthree years\n. Forfeited awards will be available for subsequent awards under the Restated 2013 Plan.\n​\nF-31\n\n\nTable of Contents\nShare Option Awards\nThere were \nno\n share option awards granted for the years ended December 31, 2024, 2023 and 2022. The following table sets forth a summary of option activity under NCLH’s Restated 2013 Plan for the period presented:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted-\n​\n​\n​\n​\n​\nNumber of Share Option Awards\n​\nWeighted-Average Exercise Price\n​\nAverage\n​\nAggregate\n​\n​\nTime-\n​\nPerformance-\n​\nTime-\n​\nPerformance-\n​\nContractual\n​\nIntrinsic\n​\n​\nBased\n​\nBased\n​\nBased\n​\nBased\n​\nTerm\n​\nValue\n​\n​\nAwards\n​\nAwards\n​\nAwards\n​\nAwards\n​\n(years)\n​\n(in thousands)\nOutstanding as of January 1, 2024\n   \n \n3,524,856\n​\n \n114,583\n​\n$\n \n52.98\n​\n$\n \n59.43\n​\n 1.26\n​\n$\n —\nForfeited and cancelled\n​\n (\n1,351,413\n)\n​\n (\n114,583\n)\n​\n​\n \n49.40\n​\n​\n \n59.43\n​\n  \n​\n​\n  \nOutstanding as of December 31, 2024\n​\n \n2,173,443\n​\n —\n​\n$\n \n55.20\n​\n$\n —\n​\n 0.61\n​\n$\n —\nVested and expected to vest as of December 31, 2024\n​\n \n2,173,443\n​\n —\n​\n$\n \n55.20\n​\n$\n —\n​\n 0.61\n​\n$\n —\nExercisable as of December 31, 2024\n​\n \n2,173,443\n​\n —\n​\n$\n \n55.20\n​\n$\n —\n​\n 0.61\n​\n$\n —\n​\nThere were no share options exercised or cash received by the Company from exercises during 2024, 2023 or 2022. As of December 31, 2024, there was \nno\n unrecognized compensation cost, related to options granted under our share-based incentive plans. \nRestricted Share Unit (“RSU”) Awards\nIn March 2024, NCLH granted \n4.5\n million time-based RSU awards to our employees, which primarily vest in substantially equal installments over \nthree years\n. Also, in March 2024, NCLH granted \n0.9\n million performance-based RSU awards to certain members of our management team, which vest upon the achievement of certain pre-established performance targets established through 2026 and the satisfaction of an additional time-based vesting requirement that generally requires continued employment through March 1, 2027.\nThe fair value of the time-based and performance-based RSUs is equal to the closing market price of NCLH shares at the date of grant. The performance-based RSUs awarded to certain members of our management team are subject to performance conditions such that the number of shares that ultimately vest depends on the Adjusted EPS and adjusted return on invested capital (as defined in the relevant award agreements) achieved by the Company during the performance period compared to targets established at the award date or other non-financial targets. Although the terms of the performance-based RSU awards provide the compensation committee with the discretion to make certain adjustments to the performance calculation, a mutual understanding of the key terms and conditions of these awards has been ascertained. The Company remeasures the probability and the cumulative share-based compensation expense of the awards each reporting period until vesting or forfeiture occurs.\nThe following table sets forth a summary of RSU activity for the period presented:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNumber of\n​\nWeighted-\n​\nNumber of\n​\nWeighted-\n​\n​\nTime-Based\n​\nAverage Grant\n​\nPerformance-\n​\nAverage Grant\n​\n    \nAwards\n    \nDate Fair Value\n    \nBased Awards\n    \nDate Fair Value\nNon-vested as of January 1, 2024\n \n \n9,083,120\n​\n$\n \n17.39\n \n \n2,140,134\n​\n$\n \n19.41\nGranted\n \n \n4,673,132\n​\n​\n \n19.25\n \n \n945,040\n(1)\n​\n \n19.29\nVested\n \n (\n4,358,233\n)\n​\n​\n \n18.81\n \n (\n569,552\n)\n​\n​\n \n25.52\nForfeited or expired\n \n (\n474,301\n)\n​\n​\n \n17.33\n \n (\n250,200\n)\n​\n​\n \n17.42\nNon-vested as of December 31, 2024\n \n \n8,923,718\n​\n$\n \n17.68\n \n \n2,265,422\n​\n$\n \n18.04\nNon-vested and expected to vest as of December 31, 2024\n​\n \n8,923,718\n​\n$\n \n17.68\n \n \n2,265,422\n​\n$\n \n18.04\n(1)\nNumber of performance-based RSU awards included assumes maximum achievement of performance targets.\nAs of December 31, 2024, there were total unrecognized compensation costs related to non-vested time-based and non-vested performance-based RSUs of $\n94.8\n million and $\n19.9\n million, respectively. The costs are expected to be recognized over a weighted-average period of \n1.8\n years for both time-based and performance-based RSUs. Taxes paid pursuant to net share settlements in 2024, 2023 and 2022 were $\n25.3\n million, $\n26.9\n million and $\n21.0\n million, respectively.\nF-32\n\n\nTable of Contents\nThe compensation expense recognized for share-based compensation for the periods presented include the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \nClassification of expense\n    \n2024\n    \n2023\n    \n2022\nPayroll and related (1)\n​\n$\n \n19,378\n​\n$\n \n18,564\n​\n$\n \n21,043\nMarketing, general and administrative (2)\n​\n \n \n72,403\n​\n \n \n100,376\n​\n \n \n92,520\nTotal share-based compensation expense\n​\n$\n \n91,781\n​\n$\n \n118,940\n​\n$\n \n113,563\n(1)\nAmounts relate to equity granted to certain of our shipboard officers.\n(2)\nAmounts relate to equity granted to certain of our corporate employees.\nEmployee Benefit Plans\nWe offer annual incentive bonuses pursuant to our Restated 2013 Plan for our executive officers and other key employees. Bonuses under the plan become earned and payable based on the Company’s performance during the applicable performance period and generally require the individual’s continued employment. Company performance criteria include the attainment of certain financial targets and other strategic objectives.\nCertain employees are employed pursuant to agreements that provide for severance payments. Severance is generally only payable upon an involuntary termination of the employment by us without cause or a termination by the employee for good reason. Severance generally includes a series of cash payments based on the employee’s base salary and our payment of the employee’s continued medical benefits for the applicable severance period.\nWe maintain a 401(k) Plan for our shoreside employees, including our executive officers. Participants may contribute up to \n100\n% of eligible compensation each pay period, subject to certain limitations. In 2022 and 2021, we made matching contributions equal to \n100\n% of the first \n3\n% and \n50\n% of amounts greater than \n3\n% to and including \n10\n% of each participant’s contributions subject to certain limitations. In addition, we may make discretionary supplemental contributions to the 401(k) Plan, which shall be allocated pro rata to each eligible participant based on the compensation of the participant relative to the total compensation of all participants. Our matching contributions are vested according to a \nfive-year\n schedule. In 2023, we temporarily paused our matching contributions under the 401(k) Plan, which we reinstated for 2024. The 401(k) Plan is subject to the provisions of ERISA and is intended to be qualified under section 401(a) of the U.S. Internal Revenue Code (the “Code”). We recorded total expenses related to the above 401(k) Plan of $\n13.3\n million, $\n0.6\n million and $\n11.6\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nEffective January 2009, we implemented the Shipboard Retirement Plan which computes benefits based on years of service, subject to eligibility requirements. The Shipboard Retirement Plan is unfunded with \nno\n plan assets. The current portion of the projected benefit obligation of $\n1.7\n million and $\n1.5\n million was included in accrued expenses and other liabilities as of December 31, 2024 and 2023, respectively, and $\n29.5\n million and $\n32.9\n million was included in other long-term liabilities in our consolidated balance sheets as of December 31, 2024 and 2023, respectively.\n​\n​\nF-33\n\n\nTable of Contents\nThe amounts related to the Shipboard Retirement Plan were as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAs of or for the Year Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nPension expense:\n \n​\n  \n \n​\n  \n \n​\n  \nService cost\n​\n$\n \n2,875\n​\n$\n \n2,312\n​\n$\n \n2,797\nInterest cost\n​\n \n \n1,677\n​\n \n \n1,472\n​\n \n \n873\nAmortization of prior service cost\n​\n \n \n378\n​\n \n \n378\n​\n \n \n378\nAmortization of actuarial gain\n​\n \n —\n​\n \n (\n123\n)\n​\n \n —\nTotal pension expense\n​\n$\n \n4,930\n​\n$\n \n4,039\n​\n$\n \n4,048\nChange in projected benefit obligation:\n​\n \n  \n​\n \n  \n​\n \n  \nProjected benefit obligation at beginning of year\n​\n$\n \n34,404\n​\n$\n \n28,765\n​\n$\n \n34,688\nService cost\n​\n \n \n2,875\n​\n \n \n2,312\n​\n \n \n2,797\nInterest cost\n​\n \n \n1,677\n​\n \n \n1,472\n​\n \n \n873\nActuarial (gain) loss\n​\n \n (\n6,740\n)\n​\n \n \n3,668\n​\n \n (\n8,511\n)\nDirect benefit payments\n​\n \n (\n983\n)\n​\n \n (\n1,813\n)\n​\n \n (\n1,082\n)\nProjected benefit obligation at end of year\n​\n$\n \n31,233\n​\n$\n \n34,404\n​\n$\n \n28,765\nAmounts recognized in the consolidated balance sheets:\n​\n \n  \n​\n \n  \n​\n \n  \nProjected benefit obligation\n​\n$\n \n31,233\n​\n$\n \n34,404\n​\n$\n \n28,765\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the Year Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nAmounts recognized in accumulated other comprehensive income (loss):\n \n​\n  \n \n​\n  \n \n​\n  \nPrior service cost\n​\n$\n (\n1,891\n)\n​\n$\n (\n2,269\n)\n​\n$\n (\n2,647\n)\nAccumulated actuarial gain\n​\n \n \n8,029\n​\n \n \n1,289\n​\n \n \n5,080\nAccumulated other comprehensive income (loss)\n​\n$\n \n6,138\n​\n$\n (\n980\n)\n​\n$\n \n2,433\n​\nThe discount rates used in the net periodic benefit cost calculation for the years ended December 31, 2024, 2023 and 2022 were \n5.0\n%, \n5.3\n% and \n2.8\n%, respectively, and the average future years of service is \n16\n years. The discount rate is used to measure and recognize obligations, including adjustments to other comprehensive income (loss), and to determine expense during the periods. It is determined by using bond indices which reflect yields on a broad maturity and industry universe of high-quality corporate bonds.\nThe pension benefits expected to be paid in each of the next five years and in aggregate for the five years thereafter are as follows (in thousands):\n​\n​\n​\n​\n​\nYear\n    \nAmount\n2025\n​\n$\n \n1,740\n2026\n​\n​\n \n1,866\n2027\n​\n​\n \n2,151\n2028\n​\n​\n \n2,450\n2029\n​\n​\n \n2,891\nNext five years\n​\n​\n \n18,434\n​\n​\n12.\nIncome Taxes\nWe are incorporated in Bermuda. Under prior Bermuda law, we were not subject to tax on income and capital gains. Previously, we received from the Minister of Finance under The Exempted Undertakings Tax Protection Act 1966, as amended, an assurance that, in the event that Bermuda enacts legislation imposing tax computed on profits, income, any capital asset, gain or appreciation, or any tax in the nature of estate duty or inheritance, then the imposition of any such tax shall not be applicable to us or to any of our operations or shares, debentures or other obligations, until March 31, 2035. Such assurances were superseded by the passage of new legislation as described below. \nF-34\n\n\nTable of Contents\nOn December 27, 2023, the Bermuda Act was enacted in Bermuda.  Under the Bermuda Act, the corporate income tax will be determined based on a statutory tax rate of 15% effective for fiscal years beginning on or after January 1, 2025. The corporate income tax will apply only to Bermuda tax resident businesses that are part of multinational enterprise groups with €750 million or more in annual revenues in at least two of the four fiscal years immediately preceding the year in question. Although the Government of Bermuda has released limited guidance with respect to specific provisions of the Bermuda Act, it is anticipated that further administrative guidance as well as regulatory guidance will be released over the course of the 2025 calendar year and beyond.\nAs enacted, the Bermuda Act makes it clear that any corporate income tax liability is due regardless of the above assurances under the Exempted Undertakings Tax Protection Act 1966. Therefore, we will be subject to the Bermuda corporate income tax with effect from January 1, 2025.\nThe Bermuda Act provides for an international shipping income exclusion.  In order for a Bermuda entity’s international shipping income to qualify for the exclusion, the entity must demonstrate that the strategic or commercial management of all ships concerned is effectively carried on from or within Bermuda. We believe we met the necessary requirements to qualify for the international shipping income exclusion during 2024.\nAdditionally, the Bermuda Act provides for companies to be able to offset 80% of their Bermuda taxable income with any available tax loss deductions on an annual basis. The Bermuda Act provides for opening tax loss carryforwards based on the Bermuda taxable income (loss) results of the individual Bermuda entities in the five fiscal years prior to the enactment date, which includes the 2020 through 2024 calendar years for NCLH.\nThe components of net income (loss) before income taxes consist of the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nBermuda\n​\n$\n \n—\n​\n$\n \n—\n​\n$\n \n—\nForeign - Other\n​\n \n \n772,907\n​\n​\n \n163,176\n​\n​\n (\n2,276,703\n)\nNet income (loss) before income taxes\n​\n$\n \n772,907\n​\n$\n \n163,176\n​\n$\n (\n2,276,703\n)\n​\nThe components of the provision for income taxes consisted of the following benefit (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nCurrent:\n \n​\n  \n \n​\n  \n \n​\n  \nBermuda\n​\n$\n \n—\n​\n$\n \n—\n​\n$\n \n—\nUnited States\n​\n \n (\n5,752\n)\n​\n \n \n20\n​\n \n \n12,706\nForeign - Other\n​\n \n (\n13,046\n)\n​\n \n \n2,850\n​\n \n (\n7,183\n)\nTotal current:\n​\n \n (\n18,798\n)\n​\n \n \n2,870\n​\n \n \n5,523\nDeferred:\n​\n \n  \n​\n \n  \n​\n \n  \nBermuda\n​\n \n \n—\n​\n \n \n—\n​\n \n \n—\nUnited States\n​\n \n \n156,495\n​\n \n \n104\n​\n \n —\nForeign - Other\n​\n \n (\n347\n)\n​\n \n \n28\n​\n \n \n1,271\nTotal deferred:\n​\n \n \n156,148\n​\n \n \n132\n​\n \n \n1,271\nIncome tax benefit\n​\n$\n \n137,350\n​\n$\n \n3,002\n​\n$\n \n6,794\n​\nF-35\n\n\nTable of Contents\nOur reconciliation of income tax expense computed by applying our Bermuda statutory rate and reported income tax benefit was as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nTax at Bermuda statutory rate\n​\n$\n \n—\n​\n$\n \n—\n​\n$\n \n—\nForeign income taxes at different rates\n​\n \n (\n29,429\n)\n​\n \n (\n3,610\n)\n​\n \n \n37,434\nTax contingencies\n​\n \n \n320\n​\n \n —\n​\n \n (\n321\n)\nReturn to provision adjustments\n​\n \n \n2,272\n​\n \n \n8,959\n​\n \n \n13,039\nChange in tax laws\n​\n \n \n15,389\n​\n \n \n532,387\n​\n \n —\nValuation allowance\n​\n \n \n148,798\n​\n \n (\n534,734\n)\n​\n \n (\n43,358\n)\nIncome tax benefit\n​\n$\n \n137,350\n​\n$\n \n3,002\n​\n$\n \n6,794\n​\nDeferred tax assets and liabilities were as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAs of December 31, \n​\n    \n2024\n    \n2023\nDeferred tax assets:\n \n​\n  \n \n​\n  \nLoss carryforwards\n​\n$\n \n729,735\n​\n$\n \n714,095\nOther\n​\n \n \n38,451\n​\n \n \n34,596\nValuation allowance\n​\n \n (\n558,690\n)\n​\n \n (\n694,765\n)\nTotal net deferred assets\n​\n \n \n209,496\n​\n \n \n53,926\nDeferred tax liabilities:\n​\n \n  \n​\n \n  \nProperty and equipment\n​\n \n (\n53,605\n)\n​\n \n (\n53,172\n)\nTotal deferred tax liabilities\n​\n \n (\n53,605\n)\n​\n \n (\n53,172\n)\nNet deferred tax asset\n​\n$\n \n155,891\n​\n$\n \n754\n​\nWe have U.S. net operating loss carryforwards of $\n848.4\n million and $\n845.5\n million for the years ended December 31, 2024 and 2023, respectively, which begin to expire in \n2030\n, a portion of which relate to PCI discussed further below. We have state net operating loss carryforwards of $\n30.3\n million and $\n32.1\n million for the years ended December 31, 2024 and 2023, respectively, which expire between \n2028\n through \n2044\n. \nAs described above, as a result of the new corporate income tax legislation enacted in Bermuda on December 27, 2023, we had Bermuda opening tax loss carryforwards of $\n3.7\n billion and $\n3.5\n billion as of December 31, 2024 and 2023, respectively, which can be carried forward indefinitely. We evaluate our deferred tax assets each period to determine if a valuation allowance is required based on whether it is more likely than not that some portion of the deferred tax assets would not be realized. The ultimate realization of these deferred tax assets is dependent upon the generation of sufficient taxable income during future periods. We conduct our evaluation by considering all available positive and negative evidence. This evaluation considers, among other factors, historical operating results, forecasts of future profitability, the duration of statutory carryforward periods, and the outlook for the cruise industry and broader economy. Based on the weight of available evidence, we maintained a full valuation allowance by recognizing  a valuation allowance in the fourth quarters of 2024 and 2023 of \n$\n15.4\n million and $\n532.4\n million, respectively, with respect to our Bermuda net deferred tax assets. \nAdditionally, we previously recorded valuation allowances with respect to the U.S. net deferred tax assets in one of our U.S. and several of our foreign subsidiaries including of $\n13.0\n million, $\n2.3\n million and $\n43.3\n million during the years ended 2024, 2023 and 2022, respectively. During the fourth quarter of 2024, we reassessed the need for a valuation allowance. After weighing all of the evidence, we determined that the positive evidence in favor of releasing a portion of the valuation allowance outweighed the negative evidence against releasing the allowance on certain U.S. net deferred tax assets and concluded that it is more likely than not that the majority of the U.S. deferred tax assets will be realized. As a result, we released $\n161.9\n million of the valuation allowance for the portion of our U.S. deferred tax assets that we expect will ultimately be more likely than not to be realized. The positive evidence considered includes continuous improvement in our operating results and profitability, implementation of certain tax planning actions, our projections showing sufficient utilization of tax attributes within their requisite carryforward periods, and not having a history of \nF-36\n\n\nTable of Contents\nexpiration of tax attributes. The negative evidence considered includes that we are in a three-year cumulative book loss position as of December 31, 2024. We continue to maintain a valuation allowance against the deferred tax assets for which we concluded it is more likely than not they will not be realized.\nIncluded above are deferred tax assets associated with our operations in Norway. We have Norway net operating loss carryforwards of $\n9.5\n million and $\n10.8\n million for the years ended December 31, 2024 and 2023, respectively, which can be carried forward indefinitely.\nIncluded above are deferred tax assets associated with PCI. We have U.S. net operating loss carryforwards of $\n155.0\n million for the years ended December 31, 2024 and 2023, which begin to expire in \n2030\n. Utilization of the PCI net operating loss carryforwards may be subject to a substantial annual limitation due to ownership change limitations that have occurred previously and/or that could occur in the future, as provided by Section 382 of the Internal Revenue Code of 1986 (“Section 382”). Ownership changes may limit the amount of net operating loss carryforwards that can be utilized to offset future taxable income and tax, respectively. In general, an ownership change, as defined by Section 382, results from transactions increasing the ownership of certain shareholders or public groups in the stock of a corporation by more than 50 percentage points over a three-year period. If we have experienced an ownership change, utilization of PCI’s net operating loss carryforwards would be subject to an annual limitation under Section 382. Any limitation may result in expiration of a portion of the net operating loss carryforwards before utilization. Subsequent ownership changes could further impact the limitation in future years. We implemented certain tax restructuring strategies that created our ability to utilize the net operating loss carryforwards of PCI, for which we had previously provided a full valuation allowance. \nWe file income tax returns in the U.S. federal jurisdiction, various U.S. state jurisdictions and foreign jurisdictions. We are generally no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations by authorities for years prior to 2021, except for years in which NOLs generated prior to 2021 are utilized.\nWe derive our income from the international operation of ships. We are engaged in a trade or business in the U.S. and receive income from sources within the U.S. Under Section 883, certain foreign corporations are exempt from U. S. federal income or branch profits tax on U.S.-source income derived from or incidental to the international operation of ships. Applicable U.S. treasury regulations provide that a foreign corporation will qualify for the benefits of Section 883 if, in relevant part: (i) the foreign country in which the corporation is organized grants an equivalent exemption for income from the international operation of ships to corporations organized in the U.S., and (ii) the foreign corporation has one or more classes of stock that are “primarily and regularly traded on an established securities market” in the U.S. or another qualifying country. We believe that we qualify for the benefits of Section 883 because we are incorporated in qualifying countries and our ordinary shares are primarily and regularly traded on an established securities market in the U.S.\n13.\nCommitments and Contingencies\nShip Construction Contracts\nFor the Norwegian brand, we have \nfour\n Prima Class Ships on order, each ranging from approximately \n156,000\n to \n169,000\n Gross Tons with \n3,550\n to \n3,850\n Berths, with currently scheduled delivery dates from 2025 through 2028. For the Norwegian brand, we also have an order for \nfour\n additional ships, each at approximately \n225,000\n Gross Tons and \n5,150\n Berths, with currently scheduled delivery dates from 2030 through 2036. \nFor the Oceania Cruises brand, we have an order for \none\n Allura Class Ship to be delivered in 2025, which will be approximately \n68,000\n Gross Tons and \n1,200\n Berths. \nFor the Oceania Cruises brand, we also have an order for \nfour\n additional ships (which includes \ntwo\n ships on order, which are currently scheduled for delivery in 2030 and 2031, that we have the option to cancel), each at approximately \n86,000\n Gross Tons and \n1,450\n Berths, with currently scheduled delivery dates from 2027 through 2031. For the Regent Seven Seas Cruises brand, we have an order for \ntwo\n Prestige Class Ships, each at approximately \n77,000\n Gross Tons and \n850\n Berths, with currently scheduled delivery dates in 2026 and 2029. The impacts of initiatives to improve environmental sustainability and modifications the Company plans to make to its newbuilds and/or other macroeconomic conditions and events have resulted in delays in expected ship deliveries. These and other impacts could result in additional delays in ship deliveries in the future, which may be prolonged.\nF-37\n\n\nTable of Contents\n​\nAs of December 31, 2024, the combined contract prices, including amendments and change orders, of the \n13\n ships on order for delivery (which excludes \ntwo\n ships on order for Oceania Cruises, which are currently scheduled for delivery in 2030 and 2031, that we have the option to cancel) was approximately €\n17.5\n billion, or $\n18.1\n billion based on the euro/U.S. dollar exchange rate as of December 31, 2024. If the \ntwo\n ships on order for Oceania Cruises are cancelled, there will be incremental corresponding adjustments to the purchase price of other applicable newbuilds not to exceed €\n51\n million. For ships on order, excluding the \ntwo\n ships on order for Oceania Cruises that we have the option to cancel and the \nfour\n additional ships on order for Norwegian Cruise Line with currently scheduled delivery from 2030 to 2036, we have obtained export credit financing which is expected to fund approximately \n80\n% of each contract price, subject to certain conditions. We do not anticipate any contractual breaches or cancellations to occur, except as noted above. However, if any such events were to occur, it could result in, among other things, the forfeiture of prior deposits or payments made by us and potential claims and impairment losses which may materially impact our business, financial condition and results of operations.\nAs of December 31, 2024, minimum annual payments for non-cancelable ship construction contracts, which exclude two contracts with options to cancel, were as follows (in thousands):\n​\n​\n​\n​\n​\nYear\n    \nAmount\n2025\n​\n$\n \n2,110,819\n2026\n​\n \n \n2,135,541\n2027\n​\n \n \n2,174,827\n2028\n​\n \n \n2,011,679\n2029\n​\n \n \n938,839\nThereafter\n​\n \n \n7,916,565\nTotal minimum annual payments\n​\n$\n \n17,288,270\n​\nThe above presentation reflects the current delivery dates; however, certain delivery dates may be delayed at the option of the builder, which would result in additional fees.\n​\nPort Facility Commitments\nAs of December 31, 2024, future commitments to pay for usage of certain port facilities were as follows (in thousands):\n​\n​\n​\n​\n​\nYear\n    \nAmount\n2025\n​\n$\n \n76,009\n2026\n​\n \n \n55,816\n2027\n​\n \n \n53,007\n2028\n​\n \n \n43,881\n2029\n​\n \n \n42,916\nThereafter\n​\n \n \n987,815\nTotal port facility future commitments\n​\n$\n \n1,259,444\n​\nOther Commitments\nThe FMC requires evidence of financial responsibility for those offering transportation on passenger ships operating out of U.S. ports to indemnify passengers in the event of non-performance of the transportation. Accordingly, each of our \nthree\n brands is required to maintain a $\n32.0\n million third-party performance guarantee in respect of liabilities for non-performance of transportation and other obligations to passengers. The guarantee requirements are subject to additional consumer price index-based adjustments. \nIn addition, our brands have a legal requirement to maintain security guarantees based on cruise business originated from the U.K., and we are required to establish financial responsibility by certain jurisdictions to meet liability in the event of non-performance of our obligations to passengers from those jurisdictions. As of December 31, 2024, we have in place approximately £\n65.1\n million of security guarantees for our brands as well as a consumer protection policy covering up to \nF-38\n\n\nTable of Contents\n£\n141.1\n million. The Company has provided approximately $\n1.4\n million in cash to secure all the financial security guarantees required.\nFrom time to time, various other regulatory and legislative changes have been or may in the future be proposed that may have an effect on our operations in the U.S. and the cruise industry in general.\nLitigation\nInvestigations\nIn March 2020, the Florida Attorney General announced an investigation related to the Company’s marketing during the COVID-19 pandemic. Following the announcement of the investigation by the Florida Attorney General, we received notifications from other attorneys general and governmental agencies that they are conducting similar investigations. The Company is cooperating with these ongoing investigations, the outcomes of which cannot be predicted at this time.\nHelms-Burton Act\nOn August 27, 2019, \na\n lawsuit was filed against Norwegian Cruise Line Holdings Ltd. in the United States District Court for the Southern District of Florida under Title III of the Cuban Liberty and Solidarity (Libertad) Act of 1996, also known as the Helms-Burton Act. The complaint, filed by Havana Docks Corporation (the “Havana Docks Matter”), alleges it holds an interest in the Havana Cruise Port Terminal, which was expropriated by the Cuban Government. The complaint further alleges that the Company “trafficked” in the property by embarking and disembarking passengers at the facility, as well as profiting from the Cuban Government’s possession of the property. The plaintiff seeks all available statutory remedies, including the value of the expropriated property, plus interest, treble damages, attorneys’ fees and costs. After various motions challenging the sufficiency of plaintiff’s complaint were resolved and voluminous discovery was completed, both sides filed motions for summary judgment. On March 21, 2022, the court issued an order granting plaintiff’s motion for summary judgment on the issue of liability and denying the Company’s cross-motion for summary judgment. The court scheduled a trial on determination of damages only for November 2022. The plaintiff elected to seek what the court ruled to be its baseline statutory damage amount, which was the amount of the certified claim plus interest, trebled and with attorneys’ fees. Given this, there was no fact issue to be tried, and the matter was removed from the trial calendar. On December 30, 2022, the court entered a final judgment of approximately $\n112.9\n million and, on January 23, 2023, the Company filed a notice of appeal from that judgment. On April 12, 2023, the Company posted a sufficient supersedeas bond with the court to prevent any efforts by the plaintiff to collect on the judgment pending the appeal. On June 30, 2023, the Company filed its opening appellate brief with the United States Court of Appeals for the Eleventh Circuit. On September 29, 2023, the plaintiff filed its answering brief responding to the Company’s opening brief in the Eleventh Circuit. On May 17, 2024, the Eleventh Circuit heard oral argument on the matter. On October 22, 2024, the Eleventh Circuit reversed the trial court in the pending matter and dismissed the claim. We believe that the likelihood of loss related to this matter is reasonably possible but not probable at this time; therefore, no liability has been recorded.\n​\nOther\n​\nIn the normal course of our business, various other claims and lawsuits have been filed or are pending against us. Most of these claims and lawsuits are covered by insurance and, accordingly, the maximum amount of our liability is typically limited to our deductible amount. Nonetheless, the ultimate outcome of these claims and lawsuits that are not covered by insurance cannot be determined at this time. We have evaluated our overall exposure with respect to all of our threatened and pending litigation and, to the extent required, we have accrued amounts for all estimable probable losses associated with our deemed exposure. We are currently unable to estimate any other potential losses beyond those accrued, as discovery is not complete nor is adequate information available to estimate such range of loss or potential recovery. However, based on our current knowledge, we do not believe that the aggregate amount or range of reasonably possible losses with respect to these matters will be material to our consolidated results of operations, financial condition or cash flows. We intend to vigorously defend our legal position on all claims and, to the extent necessary, seek recovery.\n​\nF-39\n\n\nTable of Contents\nOther Contingencies\nThe Company also has agreements with its credit card processors that govern approximately $\n2.8\n billion in advance ticket sales as of December 31, 2024 that have been received by the Company relating to future voyages. These agreements allow the credit card processors to require under certain circumstances, including the existence of a material adverse change, excessive chargebacks and other triggering events, that the Company maintain a reserve which would be satisfied by posting collateral. Although the agreements vary, these requirements may generally be satisfied either through a percentage of customer payments withheld or providing cash funds directly to the card processor. Any cash reserve or collateral requested could be increased or decreased. As of December 31, 2024, we had cash reserves with credit card processors of approximately $\n0.8\n million recognized in accounts receivable. The $\n31.5\n million previously recognized in other long-term assets was returned to the Company during the year ended December 31, 2024. We may be required to pledge additional collateral and/or post additional cash reserves or take other actions in the future that may adversely affect our liquidity.\n14.\nOther Income (Expense), Net\nOther income (expense), net was income of $\n54.2\n million, expense of $\n40.2\n million, and income of $\n76.6\n million for the years ended December 31, 2024, 2023 and 2022, respectively. In 2024 and 2023, the income and expense was primarily due to net gains and losses from foreign currency remeasurements. In 2022, the income was primarily due to gains \non derivatives not designated as hedges and gains from foreign currency remeasurements. \n15.\nConcentration Risk\nWe contract with a single vendor to provide many of our hotel and restaurant services including both food and labor costs. We incurred expenses of $\n223.4\n million, $\n203.7\n million and $\n162.2\n million for the years ended December 31, 2024, 2023 and 2022, respectively, which are recorded in payroll and related in our consolidated statements of operations.\n16.\nSupplemental Cash Flow Information \nFor the year ended December 31, 2024, we had non-cash investing activities related to property and equipment of $\n38.9\n million. For the year ended December 31, 2024, we paid income taxes of $\n4.6\n million and interest and related fees, net of capitalized interest, of $\n772.6\n million including the early redemption premiums.\nFor the year ended December 31, 2023, we had non-cash investing activities related to property and equipment of $\n37.7\n million.  For the year ended December 31, 2023, we received a refund of income taxes of $\n3.1\n million and paid interest and related fees, net of capitalized interest, of $\n822.5\n million.\nFor the year ended December 31, 2022, we had non-cash investing activities related to property and equipment of $\n51.7\n million. For the year ended December 31, 2022, we received a refund of income taxes of $\n9.5\n million and paid interest and related fees, net of capitalized interest, of $\n750.6\n million including the early redemption premiums.\n​\n​\n​\n​\nF-40"
  }
}