{
  "ticker": "NDSN",
  "cik": "0000072331",
  "company_name": "NORDSON CORP",
  "filing_date": "2024-12-18",
  "accession": "0000072331-24-000177",
  "primary_doc": "ndsn-20241031.htm",
  "item_sections": {
    "item1": "Item 1.  Business\nGeneral Description of Business\nNordson is an innovative precision technology company that leverages a scalable growth framework to deliver top tier growth with leading margins and returns. We engineer, manufacture and market differentiated products and systems used for precision dispensing, applying and controlling of adhesives, coatings, polymers, sealants, biomaterials, and other fluids, to test and inspect for quality, and to treat and cure surfaces and various medical products such as: catheters, cannulas, medical balloons and medical tubing. These products are supported with extensive application expertise and direct global sales and service. We serve a wide variety of consumer non-durable, consumer durable and technology end markets including packaging, electronics, medical, appliances, energy, transportation, precision agriculture, building and construction, and general product assembly and finishing.\nOur strategy for long-term growth is based on solving customers’ needs globally. We were incorporated in the State of Ohio in 1954 and are headquartered in Westlake, Ohio. Our products are marketed through a network of direct operations in more than 35 countries. Consistent with this global strategy, approximately 67 percent of our revenues were generated outside the United States in 2024.\nAs of October 31, 2024, we had approximately \n8,000\n employees worldwide. Our principal manufacturing facilities are located in the United States, the People’s Republic of China, Germany, Ireland, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nCorporate Purpose and Goals\nWe strive to be a vital, self-renewing, worldwide organization that, within the framework of ethical behavior and enlightened citizenship, grows and produces wealth for our customers, employees, shareholders and communities.\nWe operate for the purpose of creating balanced, long-term benefits for all of our constituencies.\nWe focus on long-term growth and returns. Each quarter, we may not produce increased sales, net income, or earnings per share, or exceed the comparative prior year's quarter. When short-term swings occur, we do not intend to alter our foundational objectives in efforts to mitigate the impact of these temporary occurrences.\nIn 2021, we launched the Ascend strategy, which is designed to deliver top tier revenue growth with leading margins and returns. Ascend is driven by three interconnected pillars: the NBS (\"Nordson Business System\") Next growth framework; Owner Mindset, our division-led organizational structure; and Winning Teams, our talent strategy. These three pillars are built upon the foundation of what makes Nordson special: our culture and our values. \nThe NBS Next growth framework, the heart of the Ascend strategy, uses data-based segmentation to identify our greatest opportunities for profitable growth and ensure we are investing our resources in those areas. Using data in a consistent and disciplined way, leaders across the Company are defining their strategic business priorities. \nWe drive organic growth by continually introducing new products and technology, providing high levels of customer service and support, capturing rapidly expanding opportunities in emerging geographies and leveraging existing technology into new applications. Additional growth comes through the acquisition of companies that have differentiated precision technology-based product portfolios, serve attractive high-growth end-markets applications and have a customer-centric business model. The primary goals of our acquisition strategy are to complement our current capabilities, diversify our business into new industry sectors with new customers and expand the scope of the solutions we can offer to our customers.\nWe strive to provide genuine customer satisfaction – it is the foundation upon which we continue to build our business.\nComplementing our business strategy is the objective to provide opportunities for employee self-fulfillment, growth, security, recognition and equitable compensation. This goal is met through the Human Resources department’s facilitation of employee training, leadership training and the creation of on-the-job growth opportunities. The result is a highly qualified and \nNordson Corporation 4\nTable of Contents\nprofessional global team capable of meeting corporate objectives. For more information, see \"Human Capital Resources\" below.\nWe recognize the value of employee participation in the planning process. Strategic and operating plans are developed by all divisions, resulting in a sense of ownership and commitment on the part of employees in accomplishing our objectives.\nWe are an equal opportunity employer.\nAt Nordson, we have a long and proud history of investing in the communities where we live and work. We are committed to contributing up to five percent of domestic pretax earnings to education, human welfare services and other charitable activities, particularly in communities where we have significant operations. Through the Nordson Corporation Foundation, we give back by providing grants to nonprofits in communities where we have facilities employing approximately 100 people. In recent years, we have extended our reach internationally through our 2:1 employee Matching Gifts, as well as community giving programs in ten international locations. Since 1989, we have donated more than $173 million to communities where we live and work. In addition, our employees volunteered more than 113,000 hours through our Time ‘N Talent and Dollars for Doers programs. \nPrincipal Products and Uses\nWe are a diversified precision technology company that engineers, manufactures and markets differentiated products and systems used to dispense, apply and control adhesives, coatings, polymers, sealants, biomaterials, medical components, and other fluids, to test and inspect for quality, and to treat and cure surfaces. Our precision technology can be found in manufacturing facilities around the world producing a wide range of goods for consumer durable, consumer non-durable, medical and technology end markets. Equipment ranges from single-use components to manual, stand-alone units for low-volume operations to microprocessor-based automated systems for high-speed, high-volume production lines.\nWe market our products globally, primarily through a direct sales force, and also through qualified distributors and sales representatives. We have built a worldwide reputation for creativity and expertise in the design and engineering of high-technology application equipment that meets the specific needs of our customers. We create value for our customers by developing solutions that increase uptime, enable faster line speeds and reduce consumption of materials. We serve a broad customer base, both in terms of industries and geographic regions. In 2024, no single customer accounted for ten percent or more of our sales.\nThe following is a summary of the product lines and markets served by our operating segments:\nIndustrial Precision Solutions\n    \nThis segment delivers proprietary dispensing and material processing technology, as well as measurement, inspection and control solutions to diverse end markets. Product line specific solutions reduce material consumption, increase line efficiency and enhance product quality and appearance. Technologies are used for processing polymers, inspection and measurement of food, tubing and films and dispensing adhesives, coatings, sealants and other materials. This segment primarily serves the consumer durables, non-durables, agriculture and industrial markets.\n•\nIndustrial Coatings\n – Automated and manual dispensing products and systems for cold materials, container coating, liquid finishing and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. Key strategic markets include beverage containers and food cans, electric battery, appliances, automotive, building and construction, composites, electronics and medical. \n•\nMeasurement and Control Solutions\n – In-line measurement sensors, gauges and analyzers using near-infrared, laser, X-ray, optical and nucleonic technologies, as well as proprietary algorithms and software. These precision applications ensure quality and reliability within the customers’ manufacturing processes. Key strategic markets include consumer non-durable, film extrusion and converting, cable and tubing and energy storage.\n•\nNonwovens\n – Dispensing, coating and laminating systems for applying adhesives, lotions, liquids and fibers to disposable products and continuous roll goods. Key strategic markets include adult incontinence products, baby diapers and child-training pants, hygiene products and surgical drapes, gowns, shoe covers and face masks.\n•\nPackaging\n – Automated adhesive dispensing systems used in the rigid packaged goods industries. Key strategic markets include packaging for food and beverage, pharmaceutical and other consumer goods.\n•\nPolymer Processing\n – Components and systems used in the thermoplastic and biopolymer melt stream in extrusion, injection molding, compounding, polymerization and recycling processes. Key strategic markets include flexible packaging, electronics, medical, building and construction, transportation and aerospace, and general consumer goods.\nNordson Corporation 5\nTable of Contents\n•\nPrecision Agriculture\n – Precision agriculture spraying solutions, including fluid components, such as nozzles, pumps and filters; smart components that measure and control the flow, quantity and location of dispensed fluid; and control systems that provide a greater variety of input and functionality to the customer. This broad product portfolio is supported by differentiated software and data capabilities. \n•\nProduct Assembly\n – Dispensing, coating and laminating systems for the assembly of plastic, metal and wood products, for paper and paperboard converting applications and for the manufacturing of continuous roll goods. Key strategic markets include appliances, automotive components, building and construction materials, electronics, furniture, solar energy, and the manufacturing of bags, sacks, books, envelopes and folding cartons.\nMedical and Fluid Solutions\nThis segment includes components and device solutions for medical, life science, high-tech industrial and other diverse end markets. \n•\nMedical \n–\n \nComponents and devices for minimally invasive interventional surgical procedures, including cannulas, catheters and medical balloons. Products also include proprietary single-use plastic components in medical applications, including biopharmaceutical, patient care/surgical and diagnostic systems.\n•\nFluid Management\n – Precision manual and semi-automated dispensers and highly engineered single-use plastic molded syringes, cartridges, tips and fluid connection components. Products are used within critical medical and industrial production processes and for applying and controlling the flow of adhesives, sealants and lubricants. Key strategic markets include electronics, industrial, medical and animal health.\nAtrion Acquisition\nOn August 21, 2024, Nordson acquired Atrion Corporation, a Delaware corporation (“Atrion”), pursuant to the Agreement and Plan of Merger (the “Merger Agreement”), dated as of May 28, 2024, among Nordson, Alpha Medical Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Nordson (“Merger Sub”) and Atrion. Headquartered in Allen, Texas, Atrion is a manufacturer of proprietary medical products and generated approximately $169 million in annual revenue in 2023. Established in 1944, Atrion supports customers globally through three FDA registered U.S. Food and Drug Administration manufacturing facilities located in the United States. Atrion’s portfolio is included in the Company's Medical and Fluid Solutions segment. It consists of three key businesses that we believe will significantly expand Nordson’s addressable market in infusion and cardiovascular therapies:  \n•\nHalkey Roberts is a leader in infusion fluid delivery solutions, including single-use original equipment manufacturer (\"OEM\") medical components such as swabable needle free and pressure relief valves.  \n•\nAtrion Medical is a leading provider of OEM interventional inflation devices for balloon catheterization, stent deployment and fluid delivery in structural heart, ears, nose and throat and gastrointestinal procedures.   \n•\nQuest Medical’s highly differentiated myocardial protection devices and single-use consumables deliver real-time precise drug administration during cardiovascular surgery.  \nAdvanced Technology Solutions\nThis segment integrates our proprietary product technologies into the progressive stages of a customer’s production processes, such as surface treatment, precisely controlled dispensing of material and pre- and post-dispense test and inspection to ensure quality. This segment predominantly serves customers in the electronics end markets.\n•\nElectronics Systems \n–\n Automated dispensing systems for high-speed, accurate application of a broad range of attachment, protection and coating fluids, and related gas plasma treatment systems for cleaning and conditioning surfaces prior to dispense. Key strategic markets include the breadth of the electronics industry manufacturing supply chain that produces semiconductor, printed circuit board assemblies and electronic components.\n•\nTest and Inspection \n–\n Bond testing and automated optical, acoustic microscopy and x-ray inspection systems used in the semiconductor and printed circuit board industries. Key strategic markets include mobile phones, tablets, personal computers, wearable technology, liquid crystal displays, micro hard drives, microprocessors, printed circuit boards, flexible circuits, micro mechanical systems and semiconductor packaging.\nManufacturing, Raw Materials and Other Resources \nOur production operations include machining, molding and assembly. We manufacture specially designed parts and assemble components into finished equipment. Many components are made in standard modules that can be used in more than one product or in combination with other components for a variety of models. We have principal manufacturing operations and \nNordson Corporation 6\nTable of Contents\nsources of supply in the United States in Ohio, Georgia, California, Colorado, Connecticut, Illinois, Michigan, Minnesota,  Pennsylvania, Rhode Island, Tennessee, Florida, Texas, Alabama and Wisconsin; as well as in the People’s Republic of China, Germany, Ireland, India, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nPrincipal materials used to make our products are metals and plastics, typically in sheets, bar stock, castings, forgings, tubing and pellets. We also purchase many electrical and electronic components, fabricated metal parts, high-pressure fluid hoses, packings, seals and other items integral to our products. Suppliers are competitively selected based on cost, quality and service. Most significant raw materials that we use are available through multiple sources. We purchase most raw materials and other components on the open market and rely on third parties to provide certain finished goods. While these items are generally available from multiple sources, the cost of products sold may be affected by changes in the market price of raw materials and tariffs on certain raw materials, particularly imports from China, as well as disruptions in availability of raw materials, components and sourced finished goods.\nWe monitor and investigate alternative suppliers and materials based on numerous attributes including quality, service, financial stability and price. We currently source raw materials and components from a number of suppliers, but our ongoing efforts to improve service and manage compliance requirements and the cost effectiveness of our products may result in a reduction in the number of our suppliers.\nSenior operating management supervises an extensive quality control program for our equipment, machinery and systems, and manufacturing processes.\nNatural gas, electricity and other fuels are our primary energy sources. However, standby capacity for alternative sources is available if needed.\nWe continue to see a stabilization of the global supply chain, improved lead times and lower inflation risk. We enhanced our risk mitigation and sourcing efforts as a result of the COVID-19 pandemic and geopolitical tensions. Logistics flows have improved, and global forwarding rates have returned closer to pre-pandemic levels, except for Asia-origin shipments, which continue to be more volatile. We continue to see moderate rate increases on parcel and domestic trucking activity. \nIntellectual Property \nWe rely on a combination of intellectual property rights, including patents, trademarks, copyrights, trade secrets and contractual provisions to protect our intellectual property. Our worldwide intellectual property portfolio is strengthened through innovation and brand recognition, and our comprehensive approach for protection and enforcement. We enter into confidentiality and intellectual property agreements with our employees that require them to disclose any inventions created in the scope of employment, convey all rights to those inventions to us and restrict the distribution of proprietary information. Risk factors associated with our intellectual property are discussed in",
    "item1a": "Item 1A. Risk Factors, Increased information technology threats and cybersecurity incidents and threats could pose a risk to our systems, networks, products, solutions and services and those of our business partners.\" above for more information. While we are committed to safeguarding our information and the proprietary and confidential information they contain, we note that no security measures can guarantee complete protection against cybersecurity incidents.\nGovernance\nThe Board of Directors, as a whole, has overarching responsibility for overseeing our strategic and operational risks. The Audit Committee specifically monitors risk management, including cybersecurity threats. Management, led by the Vice President, Information Systems and Technology, regularly reports to the Board of Directors, primarily through the Audit Committee, providing an annual report on specific risks, mitigation efforts, and a review of Nordson's cybersecurity maturity.\nManagement is responsible for day-to-day assessment and management of cybersecurity threats and risks. Nordson's Senior Director of Security and Compliance, primarily leads these efforts. The Vice President, Information Systems and Technology is responsible for oversight of Nordson's entire global IT operations, including the cybersecurity program and brings more than 25 years of experience and leadership across various information technology engineering, business and management roles, including direct oversight of strategic direction, program execution and operational excellence of technology initiatives.\nNordson Corporation 18\nTable of Contents\nThe Senior Director of Security and Compliance assesses cybersecurity readiness using a variety of tools, including internal assessment tools as well as third-party control tests, vulnerability assessments, audits and evaluation against industry standards. Our security and compliance organization elevates issues relating to cybersecurity to our Chief Executive Officer and Board of Directors, such as potential threats or vulnerabilities. We also seek to prevent, detect, mitigate and remediate cybersecurity incidents by employing various defensive and continuous monitoring techniques using recognized industry frameworks and cybersecurity standards.\nOur Vice President, Information Systems and Technology meets regularly with the Audit Committee to review our information technology systems and discuss key cybersecurity risks. Additionally, the Director, Internal Audit and Chief Financial Officer presents an overview of our global enterprise risk management program, including cybersecurity risks, to the Audit Committee, which is subsequently reported to the Board of Directors.",
    "item1b": "Item 1B.  Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.  Cybersecurity \nCybersecurity Risk Management and Strategy\nNordson Corporation manages cybersecurity risks by implementing processes for assessment, identification, and mitigation of cybersecurity threats. Nordson's cybersecurity program is designed to align with the National Institute of Standards and Technology (\"NIST\") Cybersecurity Framework, enabling us to develop policies regarding information access, asset protection and personal data security. However, this does not mean that we meet any particular technical standards, specifications or requirements, but rather that we use the NIST Cybersecurity Framework as a guide to help us identify, assess and manage cybersecurity risks and threats relevant to our business. We strive to protect our information assets through key cybersecurity measures, such as the implementation of multifactor authentication and advanced malware defenses, and we collaborate with internal stakeholders to establish layered cybersecurity defenses and restricted access based on business needs. We conduct regular continuous education sessions for our employees on cybersecurity awareness, including confidential information protection and simulated phishing attacks.\nWe engage with experts to assist with regular third-party penetration testing to evaluate our program against industry standards. We also have standing engagements with incident response experts and external counsel to enhance our cybersecurity resilience. We frequently collaborate with cybersecurity experts to share insights on threats, best practices and emerging trends.\nOur cybersecurity risk management is a critical component of our comprehensive business continuity and enterprise risk management programs. Our information security team regularly collaborates with cross-functional subject matter experts and leaders to assess and enhance our cybersecurity risk posture and preparedness. Management employs the following defense mechanisms throughout the enterprise: employee training program to increase cybersecurity awareness, vulnerability management to identify and address potential weaknesses, multifactor authentication for secure access, tabletop exercises to simulate and prepare for potential incidents, and evaluation of third-party service providers, business partners and cloud suppliers, including through assessments of their cybersecurity practices prior to service utilization.    \nTo date, management has not identified any risks from cybersecurity threats, including as a result of previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect Nordson Corporation, including its business strategy, results of operations or financial condition. See \""
  }
}