{
  "ticker": "NKE",
  "cik": "0000320187",
  "company_name": "NIKE, Inc.",
  "filing_date": "2025-07-17",
  "accession": "0000320187-25-000047",
  "primary_doc": "nke-20250531.htm",
  "item_sections": {
    "item1": "Item 1A Risk Factors, within Part 1, Item 1, Business.\nUSE OF NON-GAAP FINANCIAL MEASURES\nThroughout this Annual Report on Form 10-K, we discuss non-GAAP financial measures, which should be considered in addition to, and not in lieu of, the financial measures calculated and presented in accordance with generally accepted accounting principles in the United States of America (\"U.S. GAAP\"). References to these measures should not be considered in isolation or as a substitute for other financial measures calculated and presented in accordance with U.S. GAAP and may not be comparable to similarly titled measures used by other companies. Management uses these non-GAAP measures when evaluating the Company's performance, including when making financial and operating decisions. Additionally, management believes these non-GAAP financial measures provide investors with additional financial information that should be considered when assessing our underlying business performance and trends. \nEarnings Before Interest and Taxes (\"EBIT\")\n: Calculated as Net income before Interest expense (income), net and Income tax expense in the Consolidated Statements of Income. Total NIKE, Inc. EBIT for fiscal 2025, 2024 and 2023 are as follows:\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nNet income\n$\n3,219\n$\n5,700\n$\n5,070\nAdd: Interest expense (income), net\n(107)\n(161)\n(6)\nAdd: Income tax expense\n666\n1,000\n1,131\nEARNINGS BEFORE INTEREST AND TAXES\n$\n3,778\n$\n6,539\n$\n6,195\nEBIT Margin\n: Calculated as total NIKE, Inc. EBIT divided by total NIKE, Inc. Revenues. Our EBIT Margin calculation for fiscal 2025, 2024 and 2023 are as follows:\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nNumerator\nEarnings before interest and taxes\n$\n3,778\n$\n6,539\n$\n6,195\nDenominator\nTotal NIKE, Inc. Revenues\n$\n46,309\n$\n51,362\n$\n51,217\nEBIT MARGIN\n8.2%\n12.7%\n12.1%\n2025 FORM 10-K       \n30\nTable of Contents\nReturn on Invested Capital (\"ROIC\")\n: Represents a performance measure that management believes is useful information in understanding the Company's ability to effectively manage invested capital. Our ROIC calculation as of May 31, 2025 and 2024 is as follows:\nFOR THE TRAILING FOUR QUARTERS ENDED\n(Dollars in millions)\nMAY 31, 2025\nMAY 31, 2024\nNumerator\nNet income \n$\n3,219\n$\n5,700\nAdd: Interest expense (income), net\n(107)\n(161)\nAdd: Income tax expense\n666\n1,000\nEarnings before interest and taxes\n3,778\n6,539\nIncome tax adjustment\n(1)\n(645)\n(976)\nEarnings before interest and after taxes\n$\n3,133\n$\n5,563\nAVERAGE FOR THE TRAILING FIVE QUARTERS ENDED\nMAY 31, 2025\nMAY 31, 2024\nDenominator\nTotal debt\n(2)\n$\n11,814\n$\n12,110\nAdd: Shareholders' equity\n13,926\n14,155\nLess: Cash and equivalents and Short-term investments\n10,236\n10,309\nTotal invested capital\n$\n15,504\n$\n15,956\nRETURN ON INVESTED CAPITAL\n20.2%\n34.9%\n(1)\nEquals Earnings before interest and taxes multiplied by the effective tax rate as of each of the respective quarter ends.\n(2)\nTotal debt includes the following: 1) Current portion of long-term debt, 2) Notes Payable, 3) Current portion of operating lease liabilities, 4) Long-term debt and 5) Operating lease liabilities.\nCurrency-neutral revenues\n: Currency-neutral revenues enhance visibility to underlying business trends, excluding the impact of translation arising from foreign currency exchange rate fluctuations. Currency-neutral revenues are calculated using actual exchange rates in use during the comparative prior year period in place of the exchange rates in use during the current period.\nCOMPARABLE STORE SALES\nComparable store sales\n: This key metric, which excludes NIKE Brand Digital sales, comprises revenues from NIKE-owned in-line and factory stores for which all three of the following requirements have been met: (1) the store has been open at least one year, (2) square footage has not changed by more than 15% within the past year and (3) the store has not been permanently repositioned within the past year. Comparable store sales represents a performance metric that we believe is useful information for management and investors in understanding the performance of our established NIKE-owned in-line and factory stores. Management considers this metric when making financial and operating decisions. The method of calculating comparable store sales varies across the retail industry. As a result, our calculation of this metric may not be comparable to similarly titled metrics used by other companies.\n2025 FORM 10-K   \n31\n \nTable of Contents\nRESULTS OF OPERATIONS\n(Dollars in millions, except per share data)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nRevenues\n$\n46,309 \n$\n51,362 \n-10 \n%\n$\n51,217 \n0 \n%\nCost of sales\n26,519 \n28,475 \n-7 \n%\n28,925 \n-2 \n%\nGross profit\n19,790 \n22,887 \n-14 \n%\n22,292 \n3 \n%\nGross margin\n42.7 \n%\n44.6 \n%\n43.5 \n%\nDemand creation expense\n4,689 \n4,285 \n9 \n%\n4,060 \n6 \n%\nOperating overhead expense\n11,399 \n12,291 \n-7 \n%\n12,317 \n0 \n%\nTotal selling and administrative expense\n16,088 \n16,576 \n-3 \n%\n16,377 \n1 \n%\n% of revenues\n34.7 \n%\n32.3 \n%\n32.0 \n%\nInterest expense (income), net\n(107)\n(161)\n— \n(6)\n— \nOther (income) expense, net\n(76)\n(228)\n— \n(280)\n— \nIncome before income taxes\n3,885 \n6,700 \n-42 \n%\n6,201 \n8 \n%\nIncome tax expense\n666 \n1,000 \n-33 \n%\n1,131 \n-12 \n%\nEffective tax rate\n17.1 \n%\n14.9 \n%\n18.2 \n%\nNET INCOME\n$\n3,219\n \n$\n5,700\n \n-44\n \n%\n$\n5,070\n \n12\n \n%\nDiluted earnings per common share\n$\n2.16 \n$\n3.73 \n-42 \n%\n$\n3.23 \n15 \n%\n \n2025 FORM 10-K       \n32\nTable of Contents\nCONSOLIDATED OPERATING RESULTS\nREVENUES\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\n(1)\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\n(1)\nNIKE, Inc. Revenues:\nNIKE Brand Revenues by:\nFootwear\n$\n29,510 \n$\n33,427 \n-12 \n%\n-11 \n%\n$\n33,135 \n1 \n%\n1 \n%\nApparel\n12,965 \n13,775 \n-6 \n%\n-5 \n%\n13,843 \n0 \n%\n0 \n%\nEquipment\n2,191 \n2,075 \n6 \n%\n6 \n%\n1,727 \n20 \n%\n20 \n%\nGlobal Brand Divisions\n(2)\n48 \n45 \n7 \n%\n10 \n%\n58 \n-22 \n%\n-25 \n%\nTOTAL NIKE BRAND REVENUES\n$\n44,714\n \n$\n49,322\n \n-9\n \n%\n-9\n \n%\n$\n48,763\n \n1\n \n%\n1\n \n%\nConverse\n1,692 \n2,082 \n-19 \n%\n-18 \n%\n2,427 \n-14 \n%\n-15 \n%\nCorporate\n(3)\n(97)\n(42)\n— \n— \n27 \n— \n— \nTOTAL NIKE, INC. REVENUES\n$\n46,309\n \n$\n51,362\n \n-10\n \n%\n-9\n \n%\n$\n51,217\n \n0\n \n%\n1\n \n%\nSupplemental NIKE Brand Revenues Details:\nNIKE Brand Revenues by:\nSales to Wholesale Customers\n$\n25,883 \n$\n27,758 \n-7 \n%\n-6 \n%\n$\n27,397 \n1 \n%\n2 \n%\nSales through NIKE Direct\n18,783 \n21,519 \n-13 \n%\n-12 \n%\n21,308 \n1 \n%\n1 \n%\nGlobal Brand Divisions\n(2)\n48 \n45 \n7 \n%\n10 \n%\n58 \n-22 \n%\n-25 \n%\nTOTAL NIKE BRAND REVENUES\n$\n44,714\n \n$\n49,322\n \n-9\n \n%\n-9\n \n%\n$\n48,763\n \n1\n \n%\n1\n \n%\nSupplemental NIKE Brand Revenue Details:\nNIKE Brand Revenues by:\n(4)\nMen's\n$\n23,216 \n$\n24,785 \n-6 \n%\n-6 \n%\n$\n24,445 \n1 \n%\n2 \n%\nWomen's\n9,719 \n10,366 \n-6 \n%\n-5 \n%\n10,274 \n1 \n%\n2 \n%\nKids'\n5,695 \n6,019 \n-5 \n%\n-5 \n%\n5,889 \n2 \n%\n2 \n%\nJordan Brand\n7,270 \n8,701 \n-16 \n%\n-16 \n%\n8,460 \n3 \n%\n3 \n%\nOthers\n(5)\n(1,234)\n(594)\n-108 \n%\n-106 \n%\n(363)\n-64 \n%\n-67 \n%\nGlobal Brand Divisions\n(2)\n48 \n45 \n7 \n%\n10 \n%\n58 \n-22 \n%\n-25 \n%\nTOTAL NIKE BRAND REVENUES\n$\n44,714\n \n$\n49,322\n \n-9\n \n%\n-9\n \n%\n$\n48,763\n \n1\n \n%\n1\n \n%\n(1)\nThe percent change excluding currency changes represents a non-GAAP financial measure. For additional information, see \"Use of Non-GAAP Financial Measures\".\n(2)\nGlobal Brand Divisions revenues include NIKE Brand licensing and other miscellaneous revenues that are not part of a geographic operating segment.\n(3)\nCorporate revenues primarily consist of foreign currency hedge gains and losses related to revenues generated by entities within the NIKE Brand geographic operating segments and Converse, but managed through our central foreign exchange risk management program. \n(4)\nBeginning in fiscal 2025, with the continued rollout of a new Enterprise Resource Planning Platform, we have removed the non-GAAP financial measure of wholesale equivalent revenues. There is no change to our reported revenues or gross margin. Prior year amounts have been recast to conform to fiscal 2025 presentation.\n(5)\nOthers include products not allocated to Men's, Women's, Kids' and Jordan Brand, as well as certain adjustments that are not allocated to products designated by consumer.\n2025 FORM 10-K   \n33\n \nTable of Contents\nFISCAL 2025 NIKE BRAND REVENUE HIGHLIGHTS\nThe following tables present NIKE Brand revenues disaggregated by reportable operating segment, distribution channel and major product line:\nFISCAL 2025 COMPARED TO FISCAL 2024\n•\nNIKE, Inc. Revenues were $46.3 billion in fiscal 2025 compared to $51.4 billion for fiscal 2024, which decreased 10% and 9% on a reported and currency-neutral basis, respectively. On a currency-neutral basis, the decrease was primarily due to lower revenues in North America, Europe, Middle East & Africa (\"EMEA\") and Greater China which each decreased NIKE, Inc. Revenues by 4, 3 and 2 percentage points, respectively.\n•\nNIKE Brand revenues, which represented over 90% of NIKE, Inc. Revenues,\n \ndecreased 9% on both a reported and currency-neutral basis. The decrease, on a currency-neutral basis, was due to lower revenues in Men's, the Jordan Brand, Women's and Kids'.\n•\nNIKE Brand footwear revenues decreased 11% on a currency-neutral basis. Unit sales of footwear decreased 8%, while lower average selling price (\"ASP\") per pair reduced footwear revenues by approximately 3 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions.\n•\nNIKE Brand apparel revenues decreased 5% on a currency-neutral basis. Unit sales of apparel decreased 5%, while ASP per unit was flat as strategic pricing actions were offset by changes in channel mix and higher discounts.\n•\nNIKE Brand wholesale revenues decreased 7% on a reported basis and 6% on a currency-neutral basis, compared to fiscal 2024. The decrease, on a currency-neutral basis, was driven by lower revenues across all geographies.\n•\nNIKE Direct revenues were $18.8 billion in fiscal 2025 compared to $21.5 billion in fiscal 2024. On a currency-neutral basis, NIKE Direct revenues decreased 12% due to declines in NIKE Brand Digital sales of 20% from $12.1 billion in fiscal 2024 to $9.6 billion in fiscal 2025, while NIKE store sales were flat. Comparable store sales decreased 1%. For additional information regarding comparable store sales, including the definition, see \"Comparable Store Sales\".\n2025 FORM 10-K       \n34\nTable of Contents\nGROSS MARGIN\nFISCAL 2025 COMPARED TO FISCAL 2024\nFor fiscal 2025, our consolidated gross profit decreased 14% to $19,790 million compared to $22,887 million for fiscal 2024. Gross margin decreased 190 basis points to 42.7% for fiscal 2025 compared to 44.6% for fiscal 2024 due to the following:\n•\nLower NIKE Brand ASP (decreasing gross margin approximately 180 basis points), primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions;\n•\nHigher other costs (decreasing gross margin approximately 90 basis points), including higher inventory obsolescence reserves;\n•\nLower gross margin from Converse (decreasing gross margin approximately 20 basis points); and\n•\nUnfavorable changes in net foreign currency exchange rates, including hedges (decreasing gross margin approximately 10 basis points).\nThis was partially offset by:\n•\nLower NIKE Brand product costs (increasing gross margin approximately 80 basis points);\n•\nLower warehousing and logistics costs (increasing gross margin approximately 20 basis points); and\n•\nRestructuring charges in the prior year (increasing gross margin approximately 10 basis points).\nTOTAL SELLING AND ADMINISTRATIVE EXPENSE\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nDemand creation expense\n(1)\n$\n4,689 \n$\n4,285 \n9 \n%\n$\n4,060 \n6 \n%\nOperating overhead expense\n(2)\n11,399 \n12,291 \n-7 \n%\n12,317 \n0 \n%\nTotal selling and administrative expense\n$\n16,088 \n$\n16,576 \n-3 \n%\n$\n16,377 \n1 \n%\n% of revenues\n34.7 \n%\n32.3 \n%\n240 \nbps\n32.0 \n%\n30 \nbps\n(1)\nDemand creation expense consists of brand marketing expense and sports marketing expense. Brand marketing expense includes advertising and promotion costs such as production and media costs, digital marketing expense, brand events and retail brand presentation costs. Sports marketing expense includes expenses related to endorsement contracts, complimentary product and sports marketing events.\n(2)\nOperating overhead expense consists primarily of wage and benefit-related expenses and other administrative expenses, such as research and development costs, bad debt expense, rent, depreciation and amortization and costs related to professional services, certain technology investments, meetings and travel.\nFISCAL 2025 COMPARED TO FISCAL 2024\nDemand creation expense increased 9%, due to higher brand marketing expense, reflecting investment in key sports events, and higher sports marketing expense. Changes in foreign currency exchange rates did not have a material impact on Demand creation expense.\nOperating overhead expense decreased 7%, due to restructuring charges in the prior year, lower wage-related expenses and lower other administrative costs. Changes in foreign currency exchange rates did not have a material impact on Operating overhead expense.\n2025 FORM 10-K   \n35\n \nTable of Contents\nOTHER (INCOME) EXPENSE, NET\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\nFISCAL 2023\nOther (income) expense, net\n$\n(76)\n$\n(228)\n$\n(280)\nOther (income) expense, net comprises foreign currency conversion gains and losses from the remeasurement of monetary assets and liabilities denominated in non-functional currencies and the impact of certain foreign currency derivative instruments, as well as unusual or non-operating transactions that are outside the normal course of business.\nFISCAL 2025 COMPARED TO FISCAL 2024\n \nOther (income) expense, net decreased from $228 million of other income, net, to $76 million of other income, net, primarily due to a net unfavorable change in foreign currency conversion gains and losses, including hedges.\nINCOME TAXES\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nEffective tax rate\n17.1 \n%\n14.9 \n%\n220 bps\n18.2 \n%\n(330) bps\n \nFISCAL 2025 COMPARED TO FISCAL 2024\n \nOur effective tax rate was 17.1% for fiscal 2025, compared to 14.9% for fiscal 2024, primarily due to changes in earnings mix, decreased benefits from stock-based compensation and non-recurring one-time benefits in fiscal 2024 including the impact of the delay of the effective date of certain U.S. foreign tax credit regulations. These impacts were partially offset by a one-time, non-cash deferred tax benefit in fiscal 2025 provided by US tax regulations related to foreign currency gains and losses.\nOn July 4, 2025, the U.S. government enacted The One Big Beautiful Bill Act of 2025 which includes, among other provisions, changes to the U.S. corporate income tax system including the allowance of immediate expensing of qualifying research and development expenses and permanent extensions of certain provisions within the Tax Cuts and Jobs Act. Certain provisions are effective for NIKE beginning fiscal 2026. We are evaluating the future impact of these tax law changes on our financial statements.\n2025 FORM 10-K       \n36\nTable of Contents\nSEGMENT INFORMATION\nSee Note 15 — Segment Information in the accompanying Notes to the Consolidated Financial Statements for a description of our segments and related information. \nThe breakdown of Revenues is as follows:\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\n(1)\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\n(1)\nNorth America\n$\n19,572 \n$\n21,396 \n-9 \n%\n-8 \n%\n$\n21,608 \n-1 \n%\n-1 \n%\nEurope, Middle East & Africa\n12,257 \n13,607 \n-10 \n%\n-10 \n%\n13,418 \n1 \n%\n0 \n%\nGreater China\n6,586 \n7,545 \n-13 \n%\n-12 \n%\n7,248 \n4 \n%\n8 \n%\nAsia Pacific & Latin America\n6,251 \n6,729 \n-7 \n%\n-3 \n%\n6,431 \n5 \n%\n5 \n%\nGlobal Brand Divisions\n(2)\n48 \n45 \n7 \n%\n10 \n%\n58 \n-22 \n%\n-25 \n%\nTOTAL NIKE BRAND\n$\n44,714\n \n$\n49,322\n \n-9\n \n%\n-9\n \n%\n$\n48,763\n \n1\n \n%\n1\n \n%\nConverse\n1,692 \n2,082 \n-19 \n%\n-18 \n%\n2,427 \n-14 \n%\n-15 \n%\nCorporate\n(3)\n(97)\n(42)\n— \n— \n27 \n— \n— \nTOTAL NIKE, INC. REVENUES\n$\n46,309\n \n$\n51,362\n \n-10\n \n%\n-9\n \n%\n$\n51,217\n \n0\n \n%\n1\n \n%\n(1)    The percent change excluding currency changes represents a non-GAAP financial measure. For additional information, see \"Use of Non-GAAP Financial Measures\".\n(2)    Global Brand Divisions revenues include NIKE Brand licensing and other miscellaneous revenues that are not part of a geographic operating segment.\n(3)    Corporate revenues primarily consist of foreign currency hedge gains and losses related to revenues generated by entities within the NIKE Brand geographic operating segments and Converse, but managed through our central foreign exchange risk management program.\nThe primary financial measure used by the Company to evaluate performance of its segments is EBIT. For additional information on our segments, refer to Note 15 — Segment Information in the accompanying Notes to the Consolidated Financial Statements.\nThe breakdown of EBIT is as follows: \n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nNorth America\n$\n4,735 \n$\n5,822 \n-19 \n%\n$\n5,454 \n7 \n%\nEurope, Middle East & Africa\n2,575 \n3,388 \n-24 \n%\n3,531 \n-4 \n%\nGreater China\n1,602 \n2,309 \n-31 \n%\n2,283 \n1 \n%\nAsia Pacific & Latin America\n1,527 \n1,885 \n-19 \n%\n1,932 \n-2 \n%\nGlobal Brand Divisions\n(4,699)\n(4,720)\n0 \n%\n(4,841)\n2 \n%\nTOTAL NIKE BRAND\n(1)\n$\n5,740\n \n$\n8,684\n \n-34\n \n%\n$\n8,359\n \n4\n \n%\nConverse\n240 \n474 \n-49 \n%\n676 \n-30 \n%\nCorporate\n(2,202)\n(2,619)\n16 \n%\n(2,840)\n8 \n%\nTOTAL NIKE, INC. EARNINGS BEFORE INTEREST AND TAXES\n(1)\n$\n3,778\n \n$\n6,539\n \n-42\n \n%\n$\n6,195\n \n6\n \n%\nEBIT margin\n(1)\n8.2 \n%\n12.7 \n%\n12.1 \n%\nInterest expense (income), net\n(107)\n(161)\n— \n(6)\n— \nTOTAL NIKE, INC. INCOME BEFORE INCOME TAXES\n$\n3,885\n \n$\n6,700\n \n-42\n \n%\n$\n6,201\n \n8\n \n%\n(1)    Total NIKE Brand EBIT, Total NIKE, Inc. EBIT and EBIT Margin represent non-GAAP financial measures. See \"Use of Non-GAAP Financial Measures\" for additional information. \n2025 FORM 10-K   \n37\n \nTable of Contents\nNORTH AMERICA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nRevenues by:\nFootwear\n$\n12,684\n$\n14,537\n-13 \n%\n-13 \n%\n$\n14,897\n-2 \n%\n-2 \n%\nApparel\n5,837\n5,953\n-2 \n%\n-2 \n%\n5,947\n0 \n%\n0 \n%\nEquipment\n1,051\n906\n16 \n%\n16 \n%\n764\n19 \n%\n19 \n%\nTOTAL REVENUES\n$\n19,572\n$\n21,396\n-9\n \n%\n-8\n \n%\n$\n21,608\n-1\n \n%\n-1\n \n%\nRevenues by:\n \n \n \nSales to Wholesale Customers\n$\n10,484\n$\n11,004\n-5 \n%\n-5 \n%\n$\n11,273\n-2 \n%\n-2 \n%\nSales through NIKE Direct\n9,088\n10,392\n-13 \n%\n-12 \n%\n10,335\n1 \n%\n1 \n%\nTOTAL REVENUES\n$\n19,572\n$\n21,396\n-9\n \n%\n-8\n \n%\n$\n21,608\n-1\n \n%\n-1\n \n%\nCost of Sales\n11,056\n11,899\n-7 \n%\n12,497\n-5 \n%\nGross profit\n8,516\n9,497\n-10 \n%\n9,111\n4 \n%\nGross margin\n43.5%\n44.4%\n-90 bps \n42.2%\n220 bps\nDemand creation expense\n1,633\n1,495\n9 \n%\n1,455\n3 \n%\nOperating overhead expense\n2,150\n2,189\n-2 \n%\n2,207\n-1 \n%\nTotal selling and administrative expense\n3,783\n3,684\n3 \n%\n3,662\n1 \n%\nOther segment items\n(2)\n(9)\n— \n(5)\n— \nEARNINGS BEFORE INTEREST AND TAXES\n$\n4,735\n$\n5,822\n-19\n \n%\n$\n5,454\n7\n \n%\nFISCAL 2025 COMPARED TO FISCAL 2024\n•\nNorth America revenues decreased 8% on a currency-neutral basis primarily due to lower revenues in the Jordan Brand, Men's and Women's. Wholesale revenues decreased 5%. NIKE Direct revenues decreased 12% due to declines in digital sales of 19% and store sales of 1%. Comparable store sales decreased 1%.\n•\nFootwear revenues decreased 13% on a currency-neutral basis. Unit sales of footwear decreased 10%, while lower ASP per pair reduced footwear revenues by approximately 3 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by product mix.\n•\nApparel revenues decreased 2% on a currency-neutral basis. Unit sales of apparel decreased 1%, while lower ASP per unit reduced apparel revenues by approximately 1 percentage point. Lower ASP per unit was primarily due to higher discounts and changes in channel mix, partially offset by product mix. \nReported EBIT decreased 19% reflecting lower revenues and the following:\n•\nGross margin contraction of 90 basis points primarily due to lower ASP and higher inventory obsolescence reserves, partially offset by lower product costs. Lower ASP primarily reflects higher discounts and changes in channel mix.\n•\nDemand creation expense increased 9% primarily due to higher brand marketing expense, reflecting investment in key sports events.\n•\nOperating overhead expense decreased 2% due to lower wage-related expenses and lower other administrative costs.\n2025 FORM 10-K       \n38\nTable of Contents\nEUROPE, MIDDLE EAST & AFRICA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nRevenues by:\nFootwear\n$\n7,569\n$\n8,473\n-11 \n%\n-10 \n%\n$\n8,260\n3 \n%\n1 \n%\nApparel\n3,971\n4,380\n-9 \n%\n-9 \n%\n4,566\n-4 \n%\n-6 \n%\nEquipment\n717\n754\n-5 \n%\n-5 \n%\n592\n27 \n%\n24 \n%\nTOTAL REVENUES\n$\n12,257\n$\n13,607\n-10\n \n%\n-10\n \n%\n$\n13,418\n1\n \n%\n0\n \n%\nRevenues by:\n \n \n \nSales to Wholesale Customers\n$\n8,022\n$\n8,562\n-6 \n%\n-6 \n%\n$\n8,522\n0 \n%\n0 \n%\nSales through NIKE Direct\n4,235\n5,045\n-16 \n%\n-16 \n%\n4,896\n3 \n%\n0 \n%\nTOTAL REVENUES\n$\n12,257\n$\n13,607\n-10\n \n%\n-10\n \n%\n$\n13,418\n1\n \n%\n0\n \n%\nCost of Sales\n6,967\n7,589\n-8 \n%\n7,340\n3 \n%\nGross profit\n5,290\n6,018\n-12 \n%\n6,078\n-1 \n%\nGross margin\n43.2%\n44.2%\n-100 bps \n45.3%\n-110 bps\nDemand creation expense\n1,222\n1,114\n10 \n%\n1,050\n6 \n%\nOperating overhead expense\n1,479\n1,517\n-3 \n%\n1,500\n1 \n%\nTotal selling and administrative expense\n2,701\n2,631\n3 \n%\n2,550\n3 \n%\nOther segment items\n14\n(1)\n— \n(3)\n— \nEARNINGS BEFORE INTEREST AND TAXES\n$\n2,575\n$\n3,388\n-24\n \n%\n$\n3,531\n-4\n \n%\n \nFISCAL 2025 COMPARED TO FISCAL 2024\n \n•\nEMEA revenues decreased 10% on a currency-neutral basis due to lower revenues in Men's, the Jordan Brand, Kids' and Women's. Wholesale revenues decreased 6%. NIKE Direct revenues decreased 16% due to a decline in digital sales of 30%, partially offset by an increase in store sales of 5%. Comparable store sales increased 5%.\n•\nFootwear revenues decreased 10% on a currency-neutral basis. Unit sales of footwear decreased 8%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to changes in channel mix and higher discounts, partially offset by strategic pricing actions and product mix.\n•\nApparel revenues decreased 9% on a currency-neutral basis. Unit sales of apparel decreased 6%, while lower ASP per unit reduced apparel revenues by approximately 3 percentage points. Lower ASP per unit was primarily due to changes in channel mix, product mix and higher discounts.\nReported EBIT decreased 24% reflecting lower revenues and the following:\n•\nGross margin contraction of 100 basis points primarily due to lower ASP, partially offset by lower warehousing, logistics and product costs. Lower ASP primarily reflects changes in channel mix and higher discounts, partially offset by strategic pricing actions.\n•\nDemand creation expense increased 10% primarily due to higher brand marketing expense, reflecting investment in key sports events, and higher sports marketing expense.\n•\nOperating overhead expense decreased 3% primarily due to lower wage-related expenses.\n2025 FORM 10-K   \n39\n \nTable of Contents\nGREATER CHINA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nRevenues by:\nFootwear\n$\n4,805\n$\n5,552\n-13 \n%\n-13 \n%\n$\n5,435\n2 \n%\n6 \n%\nApparel\n1,616\n1,828\n-12 \n%\n-12 \n%\n1,666\n10 \n%\n14 \n%\nEquipment\n165\n165\n0 \n%\n1 \n%\n147\n12 \n%\n17 \n%\nTOTAL REVENUES\n$\n6,586\n$\n7,545\n-13\n \n%\n-12\n \n%\n$\n7,248\n4\n \n%\n8\n \n%\nRevenues by:\n \n \n \nSales to Wholesale Customers\n$\n3,699\n$\n4,262\n-13 \n%\n-13 \n%\n$\n3,866\n10 \n%\n15 \n%\nSales through NIKE Direct\n2,887\n3,283\n-12 \n%\n-12 \n%\n3,382\n-3 \n%\n1 \n%\nTOTAL REVENUES\n$\n6,586\n$\n7,545\n-13\n \n%\n-12\n \n%\n$\n7,248\n4\n \n%\n8\n \n%\nCost of Sales\n3,558\n3,761\n-5 \n%\n3,552\n6 \n%\nGross profit\n3,028\n3,784\n-20 \n%\n3,696\n2 \n%\nGross margin\n46.0%\n50.2%\n-420 bps \n51.0%\n-80 bps\nDemand creation expense\n529\n519\n2 \n%\n499\n4 \n%\nOperating overhead expense\n973\n1,019\n-5 \n%\n1,012\n1 \n%\nTotal selling and administrative expense\n1,502\n1,538\n-2 \n%\n1,511\n2 \n%\nOther segment items\n(76)\n(63)\n— \n(98)\n— \nEARNINGS BEFORE INTEREST AND TAXES\n$\n1,602\n$\n2,309\n-31\n \n%\n \n$\n2,283\n1\n \n%\n \nFISCAL 2025 COMPARED TO FISCAL 2024\n \n•\nGreater China revenues decreased 12% on a currency-neutral basis due to lower revenues in Men's, the Jordan Brand, Women's and Kids'. Wholesale revenues decreased 13%. NIKE Direct revenues decreased 12% due to declines in digital sales of 22% and store sales of 6%. Comparable store sales decreased 7%.\n•\nFootwear revenues decreased 13% on a currency-neutral basis. Unit sales of footwear decreased 11%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions.\n•\nApparel revenues decreased 12% on a currency-neutral basis. Unit sales of apparel decreased 17%, while higher ASP per unit contributed approximately 5 percentage points of apparel revenue growth. Higher ASP per unit was primarily due to strategic pricing actions, partially offset by higher discounts.\nReported EBIT decreased 31% reflecting lower revenues and the following:\n•\nGross margin contraction of approximately 420 basis points, primarily due to unfavorable changes in standard foreign currency exchange rates and higher inventory obsolescence reserves, partially offset by higher ASP. Higher ASP primarily reflects strategic pricing actions, partially offset by higher discounts.\n•\nDemand creation expense increased 2% primarily due to higher sports marketing expense and higher brand marketing expense. \n•\nOperating overhead expense decreased 5% primarily due to lower wage-related expenses and lower other administrative costs.\n2025 FORM 10-K       \n40\nTable of Contents\nASIA PACIFIC & LATIN AMERICA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nRevenues by:\nFootwear\n$\n4,452\n$\n4,865\n-8 \n%\n-4 \n%\n$\n4,543\n7 \n%\n7 \n%\nApparel\n1,541\n1,614\n-5 \n%\n-1 \n%\n1,664\n-3 \n%\n-2 \n%\nEquipment\n258\n250\n3 \n%\n7 \n%\n224\n12 \n%\n12 \n%\nTOTAL REVENUES\n$\n6,251\n$\n6,729\n-7\n \n%\n-3\n \n%\n$\n6,431\n5\n \n%\n5\n \n%\nRevenues by:\nSales to Wholesale Customers\n$\n3,678\n$\n3,930\n-6 \n%\n-3 \n%\n$\n3,736\n5 \n%\n6 \n%\nSales through NIKE Direct\n2,573\n2,799\n-8 \n%\n-3 \n%\n2,695\n4 \n%\n4 \n%\nTOTAL REVENUES\n$\n6,251\n$\n6,729\n-7\n \n%\n-3\n \n%\n$\n6,431\n5\n \n%\n5\n \n%\nCost of Sales\n3,502\n3,639\n-4 \n%\n3,337\n9 \n%\nGross profit\n2,749\n3,090\n-11 \n%\n3,094\n0 \n%\nGross margin\n44.0%\n45.9%\n-190 bps \n48.1%\n-220 bps\nDemand creation expense\n421\n407\n3 \n%\n373\n9 \n%\nOperating overhead expense\n804\n801\n0 \n%\n789\n2 \n%\nTotal selling and administrative expense\n1,225\n1,208\n1 \n%\n1,162\n4 \n%\nOther segment items\n(3)\n(3)\n— \n—\n— \nEARNINGS BEFORE INTEREST AND TAXES\n$\n1,527\n$\n1,885\n-19\n \n%\n$\n1,932\n-2\n \n%\nFISCAL 2025 COMPARED TO FISCAL 2024\n•\nAsia Pacific & Latin America (\"APLA\") revenues decreased 3% on a currency-neutral basis primarily due to lower revenues in Southeast Asia & India and Korea, partially offset by higher revenues in Mexico. Revenues decreased primarily due to lower revenues in the Jordan Brand and Men's. Wholesale revenues decreased 3%. NIKE Direct revenues decreased 3% due to a decline in digital sales of 9%, partially offset by an increase in store sales of 4%. Comparable store sales increased 1%.\n•\nFootwear revenues decreased 4% on a currency-neutral basis. Unit sales of footwear decreased 2%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix.\n•\nApparel revenues decreased 1% on a currency-neutral basis. Unit sales of apparel decreased 3%, while higher ASP per unit contributed approximately 2 percentage points of apparel revenue growth. Higher ASP per unit was primarily due to strategic pricing actions, partially offset by higher discounts.\nReported EBIT decreased 19% reflecting lower revenues and the following:\n•\nGross margin contraction of approximately 190 basis points primarily due to unfavorable changes in standard foreign currency exchange rates, lower ASP and higher warehousing and logistics costs. Lower ASP reflects product mix, higher discounts and changes in channel mix, partially offset by strategic pricing actions.\n•\nDemand creation expense increased 3%, due to higher brand marketing expense and higher sports marketing expense, partially offset by favorable changes in foreign currency exchange rates. \n•\nOperating overhead expense was flat due to higher wage-related expenses and higher other administrative costs, offset by favorable changes in foreign currency exchange rates.\n2025 FORM 10-K   \n41\n \nTable of Contents\nGLOBAL BRAND DIVISIONS\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nRevenues\n$\n48\n$\n45\n7 \n%\n$\n58\n-22 \n%\nCost of Sales\n634\n602\n5 \n%\n516\n17 \n%\nGross profit\n(586)\n(557)\n-5 \n%\n(458)\n-22 \n%\nDemand creation expense\n716\n596\n20 \n%\n511\n17 \n%\nOperating overhead expense\n3,401\n3,534\n-4 \n%\n3,881\n-9 \n%\nTotal selling and administrative expense\n4,117\n4,130\n0 \n%\n4,392\n-6 \n%\nOther segment items\n(4)\n33\n— \n(9)\n— \nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n$\n(4,699)\n$\n(4,720)\n0\n \n%\n$\n(4,841)\n2\n \n%\nGlobal Brand Divisions primarily represents costs, including product creation and design expenses, that are centrally managed for the NIKE Brand, as well as costs associated with NIKE Direct global digital operations and enterprise technology. Global Brand Divisions revenues include NIKE Brand licensing and other miscellaneous revenues that are not part of a geographic operating segment.\nFISCAL 2025 COMPARED TO FISCAL 2024 \nGlobal Brand Divisions' loss before interest and taxes was flat primarily due to lower Operating overhead expense, offset by higher Demand creation expense. Lower Operating overhead expense was primarily due to lower wage-related expenses. Higher Demand creation expense was primarily due to higher brand marketing expense and higher sports marketing expense.\nCONVERSE\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nRevenues by:\nFootwear\n$\n1,457\n$\n1,800\n-19 \n%\n-19 \n%\n$\n2,155\n-16 \n%\n-17 \n%\nApparel\n80\n93\n-14 \n%\n-14 \n%\n90\n3 \n%\n4 \n%\nEquipment\n32\n37\n-14 \n%\n-14 \n%\n28\n32 \n%\n34 \n%\nOther\n123\n152\n-19 \n%\n-20 \n%\n154\n-1 \n%\n-2 \n%\nTOTAL REVENUES\n$\n1,692\n$\n2,082\n-19\n \n%\n-18\n \n%\n$\n2,427\n-14\n \n%\n-15\n \n%\nRevenues by:\nSales to Wholesale Customers\n$\n875\n$\n1,098\n-20 \n%\n-20 \n%\n$\n1,299\n-15 \n%\n-16 \n%\nSales through Direct to Consumer\n694\n832\n-17 \n%\n-17 \n%\n974\n-15 \n%\n-14 \n%\nOther\n(1)\n123\n152\n-19 \n%\n-19 \n%\n154\n-1 \n%\n-2 \n%\nTOTAL REVENUES\n$\n1,692\n$\n2,082\n-19\n \n%\n-18\n \n%\n$\n2,427\n-14\n \n%\n-15\n \n%\nCost of sales\n868\n989\n-12 \n%\n1,121\n-12 \n%\nGross profit\n824\n1,093\n-25 \n%\n1,306\n-16 \n%\nGross margin\n48.7%\n52.5%\n-380 bps \n53.8%\n-130 bps\nDemand Creation Expense\n156\n140\n11 \n%\n138\n1 \n%\nOperating overhead expense\n430\n485\n-11 \n%\n499\n-3 \n%\nTotal selling and administrative expense\n586\n625\n-6 \n%\n637\n-2 \n%\nOther segment items\n(2)\n(6)\n— \n(7)\n— \nEARNINGS BEFORE INTEREST AND TAXES\n$\n240\n \n$\n474\n \n-49\n \n%\n$\n676\n \n-30\n \n%\n(1)    Other revenues consist of territories serviced by third-party licensees who pay royalties to Converse for the use of its registered trademarks and other intellectual property rights. We do not own the Converse trademarks in Japan and accordingly do not earn revenues in Japan.\n2025 FORM 10-K       \n42\nTable of Contents\nFISCAL 2025 COMPARED TO FISCAL 2024\n•\nConverse revenues decreased 18% on a currency-neutral basis driven by revenue declines across all territories. Unit sales decreased 12%, while lower ASP reduced revenues by approximately 6 percentage points. Lower ASP per unit primarily reflects higher discounts in direct to consumer.\n•\nWholesale revenues decreased 20% on a currency-neutral basis, as declines in Western Europe and Asia were partially offset by growth in North America.\n•\nDirect to consumer revenues decreased 17% on a currency-neutral basis due to reduced traffic in all territories and lower ASP due to higher discounts.\nReported EBIT decreased 49% reflecting lower revenues and the following:\n•\nGross margin contraction of approximately 380 basis points due to lower ASP and higher warehousing and logistics costs, partially offset by lower product costs. Lower ASP primarily reflects higher discounts.\n•\nDemand creation expense increased 11% primarily due to higher brand marketing expense.\n•\nOperating overhead expense decreased 11% primarily due to lower wage-related expenses and lower other administrative costs.\nCORPORATE\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nRevenues\n$\n(97)\n$\n(42)\n— \n$\n27\n— \nCost of Sales\n(66)\n(4)\n— \n562\n— \nGross profit\n(31)\n(38)\n— \n(535)\n— \nDemand creation expense\n12\n14\n-14 \n%\n34\n-59 \n%\nOperating overhead expense\n2,162\n2,746\n-21 \n%\n2,429\n13 \n%\nTotal selling and administrative expense\n2,174\n2,760\n-21 \n%\n2,463\n12 \n%\nOther segment items\n(3)\n(179)\n— \n(158)\n— \nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n$\n(2,202)\n$\n(2,619)\n16\n \n%\n$\n(2,840)\n8\n \n%\nCorporate primarily consists of unallocated general and administrative expenses, including expenses associated with centrally managed departments; depreciation and amortization related to our corporate headquarters; unallocated insurance, benefit and compensation programs, including stock-based compensation; and certain foreign currency gains and losses. \nCorporate revenues primarily consist of foreign currency hedge gains and losses related to revenues generated by entities within the NIKE Brand geographic operating segments and Converse, but managed through our central foreign exchange risk management program. \nIn addition to the foreign currency gains and losses recognized in Corporate revenues, foreign currency results in Corporate include gains and losses resulting from the difference between actual foreign currency exchange rates and standard rates used to record non-functional currency denominated product purchases within the NIKE Brand geographic operating segments and Converse; related foreign currency hedge results; conversion gains and losses arising from remeasurement of monetary assets and liabilities in non-functional currencies; and certain other foreign currency derivative instruments. \nFISCAL 2025 COMPARED TO FISCAL 2024 \nCorporate's loss before interest and taxes decreased $417 million, primarily due to the following:\n•\na favorable change of $443 million related to restructuring charges in the prior year, $379 million reported as a component of consolidated Operating overhead expense and $64 million reported as a component of consolidated Gross profit;\n•\na favorable change of $205 million primarily related to lower wage-related expenses and lower other administrative costs, reported as a component of consolidated Operating overhead expense; \n•\nan unfavorable change of $92 million related to the remeasurement of monetary assets and liabilities denominated in non-functional currencies and the impact of certain foreign currency derivative instruments, reported as a component of consolidated Other (income) expense, net; and\n•\nan unfavorable change in net foreign currency gains and losses of $88 million related to the difference between actual foreign currency exchange rates and standard foreign currency exchange rates assigned to the NIKE Brand geographic operating segments and Converse, net of hedge gains and losses; these results are reported as a component of consolidated Gross profit.\n2025 FORM 10-K   \n43\n \nTable of Contents\nFOREIGN CURRENCY EXPOSURES AND HEDGING PRACTICES\nOVERVIEW\nAs a global company with significant operations outside the United States, in the normal course of business we are exposed to risk arising from changes in currency exchange rates. Our primary foreign currency exposures arise from the recording of transactions denominated in non-functional currencies and the translation of foreign currency denominated results of operations, financial position and cash flows into U.S. Dollars.\nOur foreign exchange risk management program is intended to lessen both the positive and negative effects of currency fluctuations on our consolidated results of operations, financial position and cash flows. We manage global foreign exchange risk centrally on a portfolio basis to address those risks material to NIKE, Inc. We manage these exposures by taking advantage of natural offsets and currency correlations existing within the portfolio and, where practical and material, by hedging a portion of the remaining exposures using derivative instruments such as forward contracts and options. As described below, the implementation of the NIKE Trading Company (\"NTC\") and our foreign currency adjustment program enhanced our ability to manage our foreign exchange risk by increasing the natural offsets and currency correlation benefits existing within our portfolio of foreign exchange exposures. Our hedging policy is designed to partially or entirely offset the impact of exchange rate changes on the underlying net exposures being hedged. Where exposures are hedged, our program has the effect of delaying the impact of exchange rate movements on our Consolidated Financial Statements; the length of the delay is dependent upon hedge horizons. We do not hold or issue derivative instruments for trading or speculative purposes.\nRefer to Note 4 — Fair Value Measurements and Note 12 — Risk Management and Derivatives in the accompanying Notes to the Consolidated Financial Statements for additional description of outstanding derivatives at each reported period end.\nTRANSACTIONAL EXPOSURES\nWe conduct business in various currencies and have transactions which subject us to foreign currency risk. Our most significant transactional foreign currency exposures are:\n•\nProduct Costs — NIKE's product costs are exposed to fluctuations in foreign currencies in the following ways:\n1.\nProduct purchases denominated in currencies other than the functional currency of the transacting entity:\na.\nCertain NIKE entities purchase product from the NTC, a wholly-owned sourcing hub that buys NIKE branded products from third-party factories, predominantly in U.S. Dollars. The NTC, whose functional currency is the U.S. Dollar, then sells the products to NIKE entities in their respective functional currencies. NTC sales to a NIKE entity with a different functional currency results in a foreign currency exposure for the NTC.\nb.\nOther NIKE entities purchase product directly from third-party factories predominantly in U.S. Dollars. These purchases generate a foreign currency exposure for those NIKE entities with a functional currency other than the U.S. Dollar.\nIn both purchasing scenarios, a weaker U.S. Dollar reduces inventory costs incurred by NIKE whereas a stronger U.S. Dollar increases its cost.\n2.\nFactory input costs: NIKE operates a foreign currency adjustment program with certain factories. The program is designed to more effectively manage foreign currency risk by assuming certain of the factories' foreign currency exposures, some of which are natural offsets to our existing foreign currency exposures. Under this program, our payments to these factories are adjusted for rate fluctuations in the basket of currencies (\"factory currency exposure index\") in which the labor, materials and overhead costs incurred by the factories in the production of NIKE branded products (\"factory input costs\") are denominated.\nAs an offset to the impacts of the fluctuating U.S. Dollar on our non-functional currency denominated product purchases described above, a strengthening U.S. Dollar against the foreign currencies within the factory currency exposure indices reduces NIKE's U.S. Dollar inventory cost. Conversely, a weakening U.S. Dollar against the indexed foreign currencies increases our inventory cost.\n•\nNon-Functional Currency Denominated External Sales — A portion of our NIKE Brand and Converse revenues associated with European operations are earned in currencies other than the Euro (e.g., the British Pound) but are recognized at a subsidiary that uses the Euro as its functional currency. These sales generate a foreign currency exposure.\n•\nOther Costs — Non-functional currency denominated costs, such as endorsement contracts, also generate foreign currency risk, though to a lesser extent. \n2025 FORM 10-K       \n44\nTable of Contents\n•\nNon-Functional Currency Denominated Monetary Assets and Liabilities — Our global subsidiaries have various assets and liabilities, primarily receivables and payables, including intercompany receivables and payables, denominated in currencies other than their functional currencies. These balance sheet items are subject to remeasurement which may create fluctuations in Other (income) expense, net within our Consolidated Statements of Income.\nMANAGING TRANSACTIONAL EXPOSURES\nTransactional exposures are managed on a portfolio basis within our foreign currency risk management program. We manage these exposures by taking advantage of natural offsets and currency correlations that exist within the portfolio and may also elect to use currency forward and option contracts to hedge the remaining effect of exchange rate fluctuations on probable forecasted future cash flows, including certain product cost exposures, non-functional currency denominated external sales and other costs described above. Generally, these are accounted for as cash flow hedges. \nCertain currency forward contracts used to manage the foreign exchange exposure of non-functional currency denominated monetary assets and liabilities subject to remeasurement are not formally designated as hedging instruments. Accordingly, changes in fair value of these instruments are recognized in Other (income) expense, net and are intended to offset the foreign currency impact of the remeasurement of the related non-functional currency denominated asset or liability being hedged. \nTRANSLATIONAL EXPOSURES\nMany of our foreign subsidiaries operate in functional currencies other than the U.S. Dollar. Fluctuations in currency exchange rates create volatility in our reported results as we are required to translate the balance sheets, operational results and cash flows of these subsidiaries into U.S. Dollars for consolidated reporting. The translation of foreign subsidiaries' non-U.S. Dollar denominated balance sheets into U.S. Dollars for consolidated reporting results in a cumulative translation adjustment to Accumulated other comprehensive income (loss) within Shareholders' equity. In the translation of our Consolidated Statements of Income, a weaker U.S. Dollar in relation to foreign functional currencies benefits our consolidated earnings whereas a stronger U.S. Dollar reduces our consolidated earnings. The impact of foreign exchange rate fluctuations on the translation of our consolidated Revenues was a detriment of approximately $419 million for the year ended May 31, 2025. The impact of foreign exchange rate fluctuations on the translation of our Income before income taxes was a detriment of approximately $97 million for the year ended May 31, 2025.\nMANAGING TRANSLATIONAL EXPOSURES\nTo minimize the impact of translating foreign currency denominated revenues and expenses into U.S. Dollars for consolidated reporting, certain foreign subsidiaries use excess cash to purchase U.S. Dollar denominated available-for-sale investments. The variable future cash flows associated with the purchase and subsequent sale of these U.S. Dollar denominated investments at non-U.S. Dollar functional currency subsidiaries creates a foreign currency exposure that qualifies for hedge accounting under U.S. GAAP. We utilize forward contracts and/or options to mitigate the variability of the forecasted future purchases and sales of these U.S. Dollar investments. The combination of the purchase and sale of the U.S. Dollar investment and the hedging instrument has the effect of partially offsetting the year-over-year foreign currency translation impact on net earnings in the period the investments are sold. Hedges of the purchase of U.S. Dollar denominated available-for-sale investments are accounted for as cash flow hedges. \nWe estimate the combination of translation of foreign currency-denominated profits from our international businesses and the year-over-year change in foreign currency related gains and losses included in Other (income) expense, net had an unfavorable impact of approximately $188 million on our Income before income taxes for the year ended May 31, 2025.\nNET INVESTMENTS IN FOREIGN SUBSIDIARIES\nWe are also exposed to the impact of foreign exchange fluctuations on our investments in wholly-owned foreign subsidiaries denominated in a currency other than the U.S. Dollar, which could adversely impact the U.S. Dollar value of these investments and therefore the value of future repatriated earnings. We have, in the past, hedged and may, in the future, hedge net investment positions in certain foreign subsidiaries to mitigate the effects of foreign exchange fluctuations on these net investments. These hedges are accounted for as net investment hedges in accordance with U.S. GAAP. There were no outstanding net investment hedges as of May 31, 2025 and 2024. There were no cash flows from net investment hedge settlements for the years ended May 31, 2025, 2024 and 2023.\n2025 FORM 10-K   \n45\n \nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nCASH FLOW ACTIVITY\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n$ CHANGE\nCash provided (used by):\nOperating activities\n$\n3,698 \n$\n7,429 \n$\n(3,731)\nInvesting activities\n(275)\n894 \n(1,169)\nFinancing activities\n(5,820)\n(5,888)\n68 \nEffect of exchange rate changes on cash and equivalents\n1 \n(16)\n17 \nNET INCREASE (DECREASE) IN CASH AND EQUIVALENTS\n$\n(2,396)\n$\n2,419\n \n$\n(4,815)\nCash provided by operating activities decreased $3,731 million. This was driven by a decrease of $2,228 million in Net income, adjusted for non-cash items, and changes in certain working capital components and other assets and liabilities, which decreased $1,503 million. The change in working capital was impacted by changes to Inventories, primarily due to reduced inventory purchases in the prior year as well as unfavorable changes in standard foreign currency exchange rates in the current year.\nCash used by investing activities increased $1,169 million, from an inflow in fiscal 2024 to an outflow in fiscal 2025, primarily driven by the net change in short-term investments (including sales, maturities and purchases).\nCash used by financing activities decreased $68 million, primarily driven by lower share repurchases, largely offset by a $1.0 billion bond repayment and slightly higher dividend payments.\nIn fiscal 2025, we purchased a total of 37.6 million shares of NIKE's Class B Common Stock for $3.0 billion (an average price of $78.50 per share) under the four-year, $18 billion share repurchase plan authorized by the Board of Directors in June 2022. As of May 31, 2025, we had repurchased 122.6 million shares at a cost of approximately $12.0 billion (an average price of $98.00 per share) under this program. We have moderated, and intend to continue moderating, share repurchases. The timing and the amount of share repurchases will be dictated by our liquidity, capital needs and operating cash flows. We continue to expect funding of share repurchases from operating cash flows and excess cash. \nCAPITAL RESOURCES\nOn July 21, 2022, we filed a shelf registration statement (the \"Shelf\") with the U.S. Securities and Exchange Commission (the \"SEC\") which permits us to issue an unlimited amount of debt securities from time to time. The Shelf expires on July 21, 2025, and we plan to file a new shelf registration with the SEC in July 2025.\nOn March 7, 2025, we entered into a 364-day committed credit facility agreement with a syndicate of banks which provides for up to $1 billion of borrowings, with the option to increase borrowings up to $1.5 billion in total with lender approval. The facility matures on March 6, 2026, with an option to extend the maturity date an additional 364 days. This facility replaces the prior $1 billion 364-day credit facility agreement entered into on March 8, 2024, which matured on March 7, 2025. Refer to Note 5 — Short-Term Borrowings and Credit Lines for additional information.\nOn March 7, 2025, we entered into a five-year committed credit facility agreement with a syndicate of banks which provides for up to $2 billion of borrowings, with the option to increase borrowings up to $3 billion in total with lender approval. The facility matures on March 7, 2030, with options to extend the maturity date up to an additional two years. This facility replaces the prior $2 billion five-year credit facility agreement entered into on March 11, 2022, which would have matured on March 11, 2027. Refer to Note 5 — Short-Term Borrowings and Credit Lines for additional information. \nWe currently have long-term debt ratings of A+ and A1 from Standard and Poor's Corporation and Moody's Investor Services, respectively. As it relates to our committed credit facilities entered into on March 7, 2025, if our long-term debt ratings were to decline, the facility fees and interest rates would increase. Conversely, if our long-term debt ratings were to improve, the facility fees and interest rates would decrease. In July 2025, Standard and Poor's Corporation downgraded our debt rating from AA- to A+, and, as a result, our facility fees and interest rates will increase compared to what they were prior to the downgrade. Refer to Note 5 — Short-Term Borrowings and Credit Lines for additional information. Changes in our long-term debt ratings would not trigger acceleration of maturity of any then-outstanding borrowings or any future borrowings under the committed credit facilities. Under these facilities, we have agreed to various covenants. These covenants include limits on the disposal of assets and the amount of debt secured by liens we may incur. In the event we were to have any borrowings outstanding under these facilities, failed to meet any covenant and were unable to obtain a waiver from a majority of the banks in the applicable syndicate, any borrowings would become immediately due and payable. As of May 31, 2025, we were in full compliance with each of these covenants, and we believe it is unlikely we will fail to meet any of these covenants in the foreseeable future.\n2025 FORM 10-K       \n46\nTable of Contents\nLiquidity is also provided by our $3 billion commercial paper program. As of and for the fiscal years ended May 31, 2025 and 2024, we did not have any borrowings outstanding under our $3 billion program. We may issue commercial paper or other debt securities depending on general corporate needs. \nTo date, we have not experienced difficulty accessing the capital or credit markets; however, future volatility may increase costs associated with issuing commercial paper or other debt instruments or affect our ability to access those markets.\nAs of May 31, 2025, we had Cash and equivalents and Short-term investments totaling $9.2 billion, primarily consisting of commercial paper, corporate notes, deposits held at major banks, money market funds, U.S. Treasury obligations and other investment grade fixed-income securities. Our fixed-income investments are exposed to both credit and interest rate risk. All of our investments are investment grade to minimize our credit risk. While individual securities have varying durations, as of May 31, 2025, the weighted-average days to maturity of our cash equivalents and short-term investments portfolio was 96 days.\nWe believe that existing Cash and equivalents, Short-term investments and cash generated by operations, together with access to external sources of funds as described above, will be sufficient to meet our domestic and foreign capital needs for the next twelve months and beyond.\nOur material cash requirements as of May 31, 2025, were as follows:\n•\nDebt Obligations — Refer to Note 5 — Short-Term Borrowings and Credit Lines and Note 6 — Long-Term Debt in the accompanying Notes to the Consolidated Financial Statements for additional information.\n•\nOperating Leases — Refer to Note 17 — Leases in the accompanying Notes to the Consolidated Financial Statements for additional information.\n•\nEndorsement Contracts — As of May 31, 2025, we had endorsement contract obligations, including associated marketing commitments, of $16.2 billion, with $1.6 billion payable within 12 months, primarily representing approximate amounts of base compensation and minimum guaranteed royalty fees we are obligated to pay athlete, public figure, sport team and league endorsers of our products. Actual payments under some contracts may be higher than these amounts as these contracts provide for bonuses to be paid to the endorsers based upon athletic achievements and/or royalties on product sales in future periods. Actual payments under some contracts may also be lower as these contracts include provisions for reduced payments if athletic performance declines in future periods. In addition to the cash payments, we are obligated to furnish our endorsers with NIKE product for their use. It is not possible to determine how much we will spend on this product on an annual basis as the amount of product provided to the endorsers will depend on many factors and the contracts generally do not stipulate a minimum amount of cash to be spent on the product.\n•\nProduct Purchase Obligations — As of May 31, 2025, we had product purchase obligations of $7.9 billion, all of which are payable within the next 12 months. Product purchase obligations represent agreements (including open purchase orders) to purchase products in the ordinary course of business that are enforceable and legally binding and specify all significant terms. We generally order product at least four to five months in advance of sale based primarily on advanced orders received from external wholesale customers and internal orders from our direct to consumer operations. In some cases, prices are subject to change throughout the production process.\n•\nOther Purchase Obligations — As of May 31, 2025, we had $3.1 billion of other purchase obligations, with $1.9 billion payable within the next 12 months. Other purchase obligations primarily include technology investments, construction, service and marketing commitments made in the ordinary course of business. The amounts represent the minimum payments required by legally binding contracts and agreements that specify all significant terms, and may include open purchase orders for non-product purchases. \nAs of May 31, 2025, we had approximately $260 million in estimated future income tax obligations payable within 12 months related to expected resolution with the Internal Revenue Service of certain U.S. federal income tax matters for fiscal years 2017 through 2019 related to transfer pricing adjustments, research and development credits and other items.\nAs a part of the transition tax related to the Tax Cuts and Jobs Act, as of May 31, 2025, we had $268 million in estimated future cash payments payable within the next 12 months. These amounts represent the transition tax on deemed repatriation of undistributed earnings of foreign subsidiaries, which are reflected net of foreign tax credits we utilized.\nIn addition to the above, we have long-term obligations for uncertain tax positions and various post-retirement benefits for which we are not able to reasonably estimate when cash payments will occur. Refer to Note 7 — Income Taxes and Note 11 — Benefit Plans in the accompanying Notes to the Consolidated Financial Statements for additional information related to uncertain tax positions and post-retirement benefits, respectively. \nRefer to Note 16 — Commitments and Contingencies in the accompanying Notes to the Consolidated Financial Statements for additional information related to our off-balance sheet arrangements, bank guarantees and letters of credit. \n2025 FORM 10-K   \n47\n \nTable of Contents\nOFF-BALANCE SHEET ARRANGEMENTS\nAs of May 31, 2025, we did not have any off-balance sheet arrangements that have, or are reasonably likely to have, a material effect on our current and future financial condition, results of operations, liquidity, capital expenditures or capital resources. In connection with various contracts and agreements, we routinely provide indemnification relating to the enforceability of intellectual property rights, coverage for legal issues that arise and other items where we are acting as the guarantor. Currently, we have several such agreements in place. Based on our historical experience and the estimated probability of future loss, we have determined that the fair value of such indemnification is not material to our financial position or results of operations.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRefer to Note 1 — Summary of Significant Accounting Policies within the accompanying Notes to the Consolidated Financial Statements for recently adopted and issued accounting pronouncements.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Consolidated Financial Statements in accordance with U.S. GAAP requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent assets and liabilities. We believe the assumptions and judgments involved in the accounting estimates described below have the greatest potential impact on our Consolidated Financial Statements, so we consider these to be our critical accounting estimates. Management has reviewed and discussed these critical accounting estimates with the Audit & Finance Committee of the Board of Directors.\nBecause of the uncertainty inherent in these matters, actual results could differ from the estimates we use in the preparation of our Consolidated Financial Statements. Within the context of these critical accounting estimates, we are not currently aware of any reasonably likely events or circumstances that would result in materially different amounts being reported. During fiscal 2025, we have not made any material changes to the accounting methodologies used to develop the estimates discussed below.\nFor a description of our significant accounting policies and methods used in the preparation of our Consolidated Financial Statements, refer to  Note 1 — Summary of Significant Accounting Policies in the accompanying Notes to the Consolidated Financial Statements.\nSALES-RELATED RESERVES\nProvisions for anticipated sales returns consist of both contractual return rights and discretionary authorized returns. Provisions for post-invoice sales discounts consist of both contractual programs and discretionary discounts that are expected to be granted at a later date.\nEstimates of discretionary authorized returns, discounts and claims are based on (1) historical rates, (2) specific identification of outstanding returns not yet received from customers and outstanding discounts and claims and (3) estimated returns, discounts and claims expected but not yet finalized with customers based on current marketplace needs. Actual returns, discounts and claims in any future period are inherently uncertain and may differ from estimates recorded. If actual or expected future returns, discounts or claims were significantly different than reserves established, a reduction or increase to net revenues would be recorded in the period in which such determination was made. For fiscal 2025, any variances between actual and expected sales-related reserves were not material to reported Revenues.\nRefer to Note 14 — Revenues in the accompanying Notes to the Consolidated Financial Statements for additional information. \nINVENTORY RESERVES\nWe make ongoing estimates relating to the net realizable value of inventories based upon our assumptions about future demand, market conditions, existing inventory levels, sales trends and historical experience with similar products. If we estimate the net realizable value of our inventory is less than the cost of the inventory, we record a reserve equal to the difference between the cost of the inventory and the estimated net realizable value. If changes in market conditions result in reductions to the estimated net realizable value of our inventory below our previous estimate, we would increase our reserve in the period in which such a determination is made.\nRefer to Inventory Valuation within Note 1 — Summary of Significant Accounting Policies in the accompanying Notes to the Consolidated Financial Statements for additional information.\n2025 FORM 10-K       \n48\nTable of Contents\nHEDGE ACCOUNTING FOR DERIVATIVES\nWe use derivative contracts to hedge certain anticipated foreign currency and interest rate transactions as well as certain non-functional currency monetary assets and liabilities. When the specific criteria to qualify for hedge accounting has been met, changes in the fair value of contracts hedging probable forecasted future cash flows are recorded in Accumulated other comprehensive income (loss), rather than Net income, until the underlying hedged transaction affects Net income. In most cases, this results in gains and losses on hedge derivatives being released from Accumulated other comprehensive income (loss) into Net income sometime after the maturity of the derivative. One of the criteria for this accounting treatment is that the designated notional value of these derivative contracts should not be in excess of the amount of anticipated transactions. By their very nature, our estimates of anticipated transactions may fluctuate over time and may ultimately vary from actual transactions. When the amount of anticipated or actual transactions decline below designated hedged levels and it is no longer probable the forecasted transaction will occur by the end of the originally specified time period or within an additional two-month period of time thereafter, we reclassify the cumulative change in fair value of the over-hedged portion of the related hedge contract from Accumulated other comprehensive income (loss) to Other (income) expense, net during the quarter in which the decrease occurs. In rare circumstances, the additional period of time may exceed two months due to extenuating circumstances related to the nature of the forecasted transaction that are outside our control or influence.\nRefer to Note 12 — Risk Management and Derivatives in the accompanying Notes to the Consolidated Financial Statements for additional information.\nINCOME TAXES\nWe are subject to taxation in the United States, as well as various state and foreign jurisdictions. The determination of our provision for income taxes requires significant judgment, the use of estimates and the interpretation and application of complex tax laws. On an interim basis, we estimate our effective tax rate for the full fiscal year. This estimated annual effective tax rate is then applied to the year-to-date Income before income taxes excluding infrequently occurring or unusual items, to determine the year-to-date Income tax expense. The income tax effects of infrequent or unusual items are recognized in the interim period in which they occur. As the fiscal year progresses, we continually refine our estimate based upon actual events and earnings by jurisdiction during the year. This continual estimation process periodically results in a change to our expected effective tax rate for the fiscal year. When this occurs, we adjust the income tax provision during the quarter in which the change in estimate occurs.\nOn a quarterly basis, we evaluate the probability a tax position will be effectively sustained and the appropriateness of the amount recognized for uncertain tax positions based on factors including changes in facts or circumstances, changes in tax law, settled audit issues and new audit activity. Changes in our assessment may result in the recognition of a tax benefit or an additional charge to the tax provision in the period our assessment changes. We recognize interest and penalties related to income tax matters in Income tax expense. \nRefer to Note 7 — Income Taxes in the accompanying Notes to the Consolidated Financial Statements for additional information.\nOTHER CONTINGENCIES\nIn the ordinary course of business, we are subject to various legal proceedings, claims and government investigations related to our business, products and actions of our employees and representatives, including contractual and employment relationships, product liability, antitrust, customs, tax, intellectual property and other matters. We record contingent liabilities resulting from claims against us when a loss is assessed to be probable and the amount of the loss is reasonably estimable. Assessing probability of loss and estimating probable losses requires analysis of multiple factors, including in some cases judgments about the potential actions of third-party claimants and courts. Recorded contingent liabilities are based on the best information available and actual losses in any future period are inherently uncertain. If future adjustments to estimated probable future losses or actual losses exceed our recorded liability for such claims, we would record additional charges during the period in which the actual loss or change in estimate occurred. In addition to contingent liabilities recorded for probable losses, we disclose contingent liabilities when there is a reasonable possibility the ultimate loss will materially exceed the recorded liability. \nRefer to Note 16 — Commitments and Contingencies in the accompanying Notes to the Consolidated Financial Statements for additional information. \n2025 FORM 10-K   \n49\n \nTable of Contents\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nIn the normal course of business and consistent with established policies and procedures, we employ a variety of financial instruments to manage exposure to fluctuations in the value of foreign currencies and interest rates. It is our policy to utilize these financial instruments only where necessary to finance our business and manage such exposures; we do not enter into these transactions for trading or speculative purposes.\nWe are exposed to foreign currency fluctuations, primarily as a result of our international sales, product sourcing and funding activities. Our foreign exchange risk management program is intended to lessen both the positive and negative effects of currency fluctuations on our consolidated results of operations, financial position and cash flows. We use forward and option contracts to hedge certain anticipated, but not yet firmly committed, transactions as well as certain firm commitments and the related receivables and payables, including third-party and intercompany transactions. Where exposures are hedged, our program has the effect of delaying the impact of exchange rate movements on our Consolidated Financial Statements.\nThe timing for hedging exposures, as well as the type and duration of the hedge instruments employed, are guided by our hedging policies and determined based upon the nature of the exposure and prevailing market conditions. Typically, the Company may enter into hedge contracts starting 12 to 24 months in advance of the forecasted transaction and may place incremental hedges up to 100% of the exposure by the time the forecasted transaction occurs. The majority of derivatives outstanding as of May 31, 2025, are designated as foreign currency cash flow hedges, primarily for Euro/U.S. Dollar, Chinese Yuan/U.S. Dollar, British Pound/Euro, and Japanese Yen/U.S. Dollar currency pairs. Refer to Note 12 — Risk Management and Derivatives in the accompanying Notes to the Consolidated Financial Statements for additional information.\nOur earnings are also exposed to movements in short- and long-term market interest rates. Our objective in managing this interest rate exposure is to limit the impact of interest rate changes on earnings and cash flows and to reduce overall borrowing costs. To achieve these objectives, we maintain a mix of commercial paper, bank loans, and fixed-rate debt of varying maturities and have entered into receive-fixed, pay-variable interest rate swaps for a portion of our fixed-rate debt.\nMARKET RISK MEASUREMENT\nWe monitor foreign exchange risk, interest rate risk and related derivatives using a variety of techniques including a review of market value, sensitivity analysis and Value-at-Risk (\"VaR\"). Our market-sensitive derivative and other financial instruments are foreign currency forward contracts, foreign currency option contracts, interest rate swaps, intercompany loans denominated in non-functional currencies and fixed interest rate U.S. Dollar denominated debt.\nWe use VaR to monitor the foreign exchange risk of our foreign currency forward and foreign currency option derivative instruments only. The VaR determines the maximum potential one-day loss in the fair value of these foreign exchange rate-sensitive financial instruments. The VaR model estimates assume normal market conditions and a 95% confidence level. There are various modeling techniques that can be used in the VaR computation. Our computations are based on interrelationships between currencies and interest rates (a \"variance/co-variance\" technique). These interrelationships are a function of foreign exchange currency market changes and interest rate changes over the preceding one-year period. The value of foreign currency options does not change on a one-to-one basis with changes in the underlying currency rate. We adjust the potential loss in option value for the estimated sensitivity (the \"delta\" and \"gamma\") to changes in the underlying currency rate. This calculation reflects the impact of foreign currency rate fluctuations on the derivative instruments only and does not include the impact of such rate fluctuations on non-functional currency transactions (such as anticipated transactions, firm commitments, cash balances and accounts and loans receivable and payable), including those which are hedged by these instruments.\nThe VaR model is a risk analysis tool and does not purport to represent actual losses in fair value we will incur nor does it consider the potential effect of favorable changes in market rates. It also does not represent the full extent of the possible loss that may occur. Actual future gains and losses will differ from those estimated because of changes or differences in market rates and interrelationships, hedging instruments and hedge percentages, timing and other factors.\nThe estimated maximum one-day loss in fair value on our foreign currency sensitive derivative financial instruments, derived using the VaR model, was $107 million and $57 million as of May 31, 2025 and 2024, respectively. The VaR increased year-over-year as a result of an increase in foreign currency volatilities as well as increased trade volumes as of May 31, 2025. Such a hypothetical loss in the fair value of our derivatives would be offset by increases in the value of the underlying transactions being hedged. The average monthly change in the fair values of foreign currency forward and foreign currency option derivative instruments was $200 million and $180 million during fiscal 2025 and fiscal 2024, respectively.\n2025 FORM 10-K       \n50\nTable of Contents\nThe instruments not included in the VaR are intercompany loans denominated in non-functional currencies, fixed interest rate U.S. Dollar denominated debt, and interest rate swaps. Intercompany loans and related interest amounts are eliminated in consolidation. Furthermore, our non-functional currency intercompany loans are substantially hedged against foreign exchange risk through the use of forward contracts, which are included in the VaR calculation above. Therefore, we consider the interest rate and foreign currency market risks associated with our non-functional currency intercompany loans to be immaterial to our consolidated financial position, results of operations and cash flows.\nDetails of third-party debt and interest rate swaps are provided in the table below. The table presents principal cash flows and related weighted average interest rates by expected maturity dates. The weighted average variable interest rates for the fixed rate swapped to variable rate swaps reflect the effective interest rates at May 31, 2025.\nEXPECTED MATURITY DATE YEAR ENDING MAY 31,\n(Dollars in millions)\n2026\n2027\n2028\n2029\n2030\nTHEREAFTER\nTOTAL \nFAIR VALUE\nInterest Rate Risk\nLong-term U.S. Dollar debt — Fixed rate\nPrincipal payments\n$\n—\n$\n2,000\n$\n—\n$\n—\n$\n1,500\n$\n4,500\n$\n8,000\n$\n6,673\nAverage interest rate\n0.0 \n%\n2.6 \n%\n0.0 \n%\n0.0 \n%\n2.9 \n%\n3.5 \n%\n3.1 \n%\nInterest Rate Swaps — Fixed rate swapped to variable rate\nNotional amount\n$\n—\n$\n—\n$\n—\n$\n—\n$\n—\n$\n2,400\n$\n2,400\n$\n21\nAverage fixed interest rate\n0.0 \n%\n0.0 \n%\n0.0 \n%\n0.0 \n%\n0.0 \n%\n3.6 \n%\n3.6 \n%\nAverage variable interest rate\n0.0 \n%\n0.0 \n%\n0.0 \n%\n0.0 \n%\n0.0 \n%\n3.8 \n%\n3.8 \n%\n2025 FORM 10-K   \n51\n \nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nManagement of NIKE, Inc. is responsible for the information and representations contained in this Annual Report. The financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (\"U.S. GAAP\") and include certain amounts based on our best estimates and judgments. Other financial information in this Annual Report is consistent with these financial statements.\nOur accounting systems include controls designed to reasonably assure assets are safeguarded from unauthorized use or disposition and provide for the preparation of financial statements in conformity with U.S. GAAP. These systems are supplemented by the selection and training of qualified financial personnel and an organizational structure providing for appropriate segregation of duties.\nAn internal corporate audit department reviews the results of its work with the Audit & Finance Committee of the Board of Directors, presently comprised of three outside, independent directors. The Audit & Finance Committee is responsible for the appointment of the independent registered public accounting firm and reviews, with the independent registered public accounting firm, management and the internal corporate audit staff, the scope and the results of the annual audit, the effectiveness of the accounting control system and other matters relating to the financial affairs of NIKE as the Audit & Finance Committee deems appropriate. The independent registered public accounting firm and the internal corporate auditors have full access to the Audit & Finance Committee, with and without the presence of management, to discuss any appropriate matters.\n2025 FORM 10-K       \n52\nTable of Contents\nMANAGEMENT'S ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13(a) - 15(f) and Rule 15(d) - 15(f) of the Securities Exchange Act of 1934, as amended. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with generally accepted accounting principles in the United States of America. Internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of assets of the Company that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, our management conducted an evaluation of the effectiveness of our internal control over financial reporting based upon the framework in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on the results of our evaluation, our management concluded that our internal control over financial reporting was effective as of May 31, 2025.\nPricewaterhouseCoopers LLP, an independent registered public accounting firm, has audited (1) the Consolidated Financial Statements and (2) the effectiveness of our internal control over financial reporting as of May 31, 2025, as stated in their report herein.\nElliott Hill\nMatthew Friend\nPresident and Chief Executive Officer\nExecutive Vice President and Chief Financial Officer\n2025 FORM 10-K   \n53\n \nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of NIKE, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of NIKE, Inc. and its subsidiaries (the \"Company\") as of May 31, 2025 and 2024, and the related consolidated statements of income, of comprehensive income, of shareholders' equity and of cash flows for each of the three years in the period ended May 31, 2025, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of May 31, 2025, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of May 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended May 31, 2025 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of May 31, 2025, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate\n.\n2025 FORM 10-K       \n54\nTable of Contents\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAccounting for Income Taxes\nAs described in Notes 1 and 7 to the consolidated financial statements, the Company is subject to taxation in the United States, as well as various state and foreign jurisdictions. The Company accounts for income taxes using the asset and liability method. This approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of assets and liabilities. As disclosed by management, the determination of the provision for income taxes by management requires significant judgment, the use of estimates, and the interpretation and application of complex tax laws. Furthermore, as part of determining its provision for income taxes, management evaluates the probability a tax position will be effectively sustained and the appropriateness of the amount recognized for uncertain tax positions based on factors including changes in facts or circumstances, changes in tax law, settled audit issues and new audit activity. The Company recognizes a tax benefit from uncertain tax positions in the consolidated financial statements only when it is more likely than not the position will be sustained upon examination by relevant tax authorities. The majority of the total gross unrecognized tax benefits are long-term in nature and included within deferred income taxes and other liabilities on the consolidated balance sheets. The Company recorded income tax expense of $666 million for the year ended May 31, 2025. As of May 31, 2025, total gross unrecognized tax benefits, excluding related interest and penalties, were $1,026 million, of which $738 million would affect the Company's effective tax rate if recognized in future periods. \nThe principal considerations for our determination that performing procedures relating to the accounting for income taxes is a critical audit matter are (i) the significant judgment by management when determining the provision for income taxes and interpreting and applying complex tax laws as it relates to determining the provision for income taxes and uncertain tax positions; (ii) a high degree of auditor judgment and effort in performing procedures and evaluating audit evidence related to management’s interpretation and application of complex tax laws as it relates to the determination of the provision for income taxes and the assessment of whether tax positions are more likely than not to be sustained; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.                                                                  \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to income taxes. These procedures also included, among others (i) testing the provision for income taxes, which included the effective tax rate reconciliation and assessing management’s interpretation and application of complex tax laws; (ii) evaluating the completeness of management’s identification of uncertain tax positions by considering changes in facts or circumstances, changes in and compliance with tax laws, settled audit issues, new authoritative cases, or new audit activity, where applicable; and (iii) for certain tax positions, evaluating management’s assessment of the technical merits of the tax positions by obtaining and inspecting third party income tax documentation. Professionals with specialized skill and knowledge were used to assist in evaluating (i) changes in and compliance with the tax laws; (ii) management’s interpretation and application of certain complex tax laws as it relates to the determination of the provision for income taxes; and (iii) the reasonableness of management's assessment of whether certain tax positions are more likely than not of being sustained.\n/s/ \nPricewaterhouseCoopers LLP\nPortland, Oregon\nJuly 17, 2025 \nWe have served as the Company's auditor since 1974.\n \n2025 FORM 10-K   \n55\n \nTable of Contents\nNIKE, INC.\nCONSOLIDATED STATEMENTS OF INCOME\nYEAR ENDED MAY 31,\n(In millions, except per share data)\n2025\n2024\n2023\nRevenues\n$\n46,309\n \n$\n51,362\n \n$\n51,217\n \nCost of sales\n26,519\n \n28,475\n \n28,925\n \nGross profit\n19,790\n \n22,887\n \n22,292\n \nDemand creation expense\n4,689\n \n4,285\n \n4,060\n \nOperating overhead expense\n11,399\n \n12,291\n \n12,317\n \nTotal selling and administrative expense\n16,088\n \n16,576\n \n16,377\n \nInterest expense (income), net\n(\n107\n)\n(\n161\n)\n(\n6\n)\nOther (income) expense, net\n(\n76\n)\n(\n228\n)\n(\n280\n)\nIncome before income taxes\n3,885\n \n6,700\n \n6,201\n \nIncome tax expense \n666\n \n1,000\n \n1,131\n \nNET INCOME\n$\n3,219\n \n$\n5,700\n \n$\n5,070\n \nEarnings per common share:\nBasic\n$\n2.17\n \n$\n3.76\n \n$\n3.27\n \nDiluted\n$\n2.16\n \n$\n3.73\n \n$\n3.23\n \nWeighted average common shares outstanding:\nBasic\n1,484.9\n \n1,517.6\n \n1,551.6\n \nDiluted\n1,487.6\n \n1,529.7\n \n1,569.8\n \nThe accompanying Notes to the Consolidated Financial Statements are an integral part of this statement.\n2025 FORM 10-K       \n56\nTable of Contents\nNIKE, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nNet income\n$\n3,219\n \n$\n5,700\n \n$\n5,070\n \nOther comprehensive income (loss), net of tax:\nChange in net foreign currency translation adjustment\n142\n \n(\n3\n)\n267\n \nChange in net gains (losses) on cash flow hedges\n(\n454\n)\n(\n184\n)\n(\n348\n)\nChange in net gains (losses) on other\n1\n \n9\n \n(\n6\n)\nTotal other comprehensive income (loss), net of tax\n(\n311\n)\n(\n178\n)\n(\n87\n)\nTOTAL COMPREHENSIVE INCOME\n$\n2,908\n \n$\n5,522\n \n$\n4,983\n \nThe accompanying Notes to the Consolidated Financial Statements are an integral part of this statement.\n2025 FORM 10-K   \n57\n \nTable of Contents\nNIKE, INC.\nCONSOLIDATED BALANCE SHEETS\nMAY 31,\n(In millions)\n2025\n2024\nASSETS\nCurrent assets:\nCash and equivalents\n$\n7,464\n \n$\n9,860\n \nShort-term investments\n1,687\n \n1,722\n \nAccounts receivable, net\n4,717\n \n4,427\n \nInventories\n7,489\n \n7,519\n \nPrepaid expenses and other current assets\n2,005\n \n1,854\n \nTotal current assets\n23,362\n \n25,382\n \nProperty, plant and equipment, net\n4,828\n \n5,000\n \nOperating lease right-of-use assets, net\n2,712\n \n2,718\n \nIdentifiable intangible assets, net\n259\n \n259\n \nGoodwill\n240\n \n240\n \nDeferred income taxes and other assets\n5,178\n \n4,511\n \nTOTAL ASSETS\n$\n36,579\n \n$\n38,110\n \nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nCurrent portion of long-term debt\n$\n—\n \n$\n1,000\n \nNotes payable\n5\n \n6\n \nAccounts payable\n3,479\n \n2,851\n \nCurrent portion of operating lease liabilities\n502\n \n477\n \nAccrued liabilities\n5,911\n \n5,725\n \nIncome taxes payable\n669\n \n534\n \nTotal current liabilities\n10,566\n \n10,593\n \nLong-term debt\n7,961\n \n7,903\n \nOperating lease liabilities\n2,550\n \n2,566\n \nDeferred income taxes and other liabilities\n2,289\n \n2,618\n \nCommitments and contingencies (Note 16)\nRedeemable preferred stock\n—\n \n—\n \nShareholders' equity:\nCommon stock at stated value:\nClass A convertible — \n290\n and \n298\n shares outstanding\n—\n \n—\n \nClass B — \n1,186\n and \n1,205\n shares outstanding\n3\n \n3\n \nCapital in excess of stated value\n14,195\n \n13,409\n \nAccumulated other comprehensive income (loss)\n(\n258\n)\n53\n \nRetained earnings (deficit)\n(\n727\n)\n965\n \nTotal shareholders' equity\n13,213\n \n14,430\n \nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY\n$\n36,579\n \n$\n38,110\n \nThe accompanying Notes to the Consolidated Financial Statements are an integral part of this statement.\n2025 FORM 10-K       \n58\nTable of Contents\nNIKE, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nCash provided (used) by operations:\nNet income\n$\n3,219\n \n$\n5,700\n \n$\n5,070\n \nAdjustments to reconcile net income to net cash provided (used) by operations:\nDepreciation and amortization\n775\n \n796\n \n703\n \nDeferred income taxes\n(\n288\n)\n(\n497\n)\n(\n117\n)\nStock-based compensation\n709\n \n804\n \n755\n \nImpairment and other\n33\n \n48\n \n156\n \nNet foreign currency adjustments\n37\n \n(\n138\n)\n(\n213\n)\nChanges in certain working capital components and other assets and liabilities:\n(Increase) decrease in accounts receivable\n(\n257\n)\n(\n329\n)\n489\n \n(Increase) decrease in inventories\n120\n \n908\n \n(\n133\n)\n(Increase) decrease in prepaid expenses, operating lease right-of-use assets and other current and non-current assets\n(\n224\n)\n(\n260\n)\n(\n644\n)\nIncrease (decrease) in accounts payable, accrued liabilities, operating lease liabilities and other current and non-current liabilities\n(\n426\n)\n397\n \n(\n225\n)\nCash provided (used) by operations\n3,698\n \n7,429\n \n5,841\n \nCash provided (used) by investing activities:\nPurchases of short-term investments\n(\n3,234\n)\n(\n4,767\n)\n(\n6,059\n)\nMaturities of short-term investments\n319\n \n2,269\n \n3,356\n \nSales of short-term investments\n3,062\n \n4,219\n \n4,184\n \nAdditions to property, plant and equipment\n(\n430\n)\n(\n812\n)\n(\n969\n)\nOther investing activities\n8\n \n(\n15\n)\n52\n \nCash provided (used) by investing activities\n(\n275\n)\n894\n \n564\n \nCash provided (used) by financing activities:\nIncrease (decrease) in notes payable, net\n(\n1\n)\n—\n \n(\n4\n)\nRepayment of borrowings\n(\n1,000\n)\n—\n \n(\n500\n)\nProceeds from exercise of stock options and other stock issuances\n551\n \n667\n \n651\n \nRepurchase of common stock\n(\n2,985\n)\n(\n4,250\n)\n(\n5,480\n)\nDividends — common and preferred\n(\n2,300\n)\n(\n2,169\n)\n(\n2,012\n)\nOther financing activities\n(\n85\n)\n(\n136\n)\n(\n102\n)\nCash provided (used) by financing activities\n(\n5,820\n)\n(\n5,888\n)\n(\n7,447\n)\nEffect of exchange rate changes on cash and equivalents\n1\n \n(\n16\n)\n(\n91\n)\nNet increase (decrease) in cash and equivalents\n(\n2,396\n)\n2,419\n \n(\n1,133\n)\nCash and equivalents, beginning of year\n9,860\n \n7,441\n \n8,574\n \nCASH AND EQUIVALENTS, END OF YEAR\n$\n7,464\n \n$\n9,860\n \n$\n7,441\n \nSupplemental disclosure of cash flow information:\nCash paid during the year for:\nInterest, net of capitalized interest\n$\n389\n \n$\n381\n \n$\n347\n \nIncome taxes\n1,226\n \n1,299\n \n1,517\n \nNon-cash additions to property, plant and equipment\n184\n \n160\n \n211\n \nDividends declared and not paid\n593\n \n558\n \n524\n \nThe accompanying Notes to the Consolidated Financial Statements are an integral part of this statement.\n2025 FORM 10-K   \n59\n \nTable of Contents\nNIKE, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nCOMMON STOCK\nCAPITAL IN EXCESS OF STATED VALUE\nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nRETAINED EARNINGS (DEFICIT)\nTOTAL\nCLASS A\nCLASS B\n(In millions, except per share data)\nSHARES\nAMOUNT\nSHARES\nAMOUNT\nBalance at May 31, 2022\n305\n \n$\n—\n \n1,266\n \n$\n3\n \n$\n11,484\n \n$\n318\n \n$\n3,476\n \n$\n15,281\n \nStock options exercised\n8\n \n421\n \n421\n \nConversion to Class B Common Stock\n— \n— \n— \nRepurchase of Class B Common Stock\n(\n51\n)\n(\n378\n)\n(\n5,131\n)\n(\n5,509\n)\nDividends on common stock ($\n1.325\n per share) and preferred stock ($\n0.10\n per share)\n(\n2,059\n)\n(\n2,059\n)\nIssuance of shares to employees, net of shares withheld for employee taxes\n4\n \n130\n \n2\n \n132\n \nStock-based compensation\n755\n \n755\n \nNet income\n5,070\n \n5,070\n \nOther comprehensive income (loss)\n(\n87\n)\n(\n87\n)\nBalance at May 31, 2023\n305\n \n$\n—\n \n1,227\n \n$\n3\n \n$\n12,412\n \n$\n231\n \n$\n1,358\n \n$\n14,004\n \nStock options exercised\n7\n \n432\n \n432\n \nConversion to Class B Common Stock\n(\n7\n)\n7\n \n— \nRepurchase of Class B Common Stock\n(\n41\n)\n(\n347\n)\n(\n3,907\n)\n(\n4,254\n)\nDividends on common stock ($\n1.450\n per share) and preferred stock ($\n0.10\n per share)\n(\n2,203\n)\n(\n2,203\n)\nIssuance of shares to employees, net of shares withheld for employee taxes\n5\n \n108\n \n17\n \n125\n \nStock-based compensation\n804\n \n804\n \nNet income\n5,700\n \n5,700\n \nOther comprehensive income (loss)\n(\n178\n)\n(\n178\n)\nBalance at May 31, 2024\n298\n \n$\n—\n \n1,205\n \n$\n3\n \n$\n13,409\n \n$\n53\n \n$\n965\n \n$\n14,430\n \nStock options exercised\n6\n \n315\n \n315\n \nConversion to Class B Common Stock\n(\n8\n)\n8\n \n— \nRepurchase of Class B Common Stock\n(\n38\n)\n(\n342\n)\n(\n2,613\n)\n(\n2,955\n)\nDividends on common stock ($\n1.570\n per share) and preferred stock ($\n0.10\n per share)\n(\n2,337\n)\n(\n2,337\n)\nIssuance of shares to employees, net of shares withheld for employee taxes\n5\n \n104\n \n39\n \n143\n \nStock-based compensation\n709\n \n709\n \nNet income\n3,219\n \n3,219\n \nOther comprehensive income (loss)\n(\n311\n)\n(\n311\n)\nBalance at May 31, 2025\n290\n \n$\n—\n \n1,186\n \n$\n3\n \n$\n14,195\n \n$\n(\n258\n)\n$\n(\n727\n)\n$\n13,213\n \nThe accompanying Notes to the Consolidated Financial Statements are an integral part of this statement.\n2025 FORM 10-K       \n60\nTable of Contents\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1\nSummary of Significant Accounting Policies\n62\nNote 2\nProperty, Plant and Equipment\n68\nNote 3\nAccrued Liabilities\n68\nNote 4\nFair Value Measurements\n69\nNote 5\nShort-Term Borrowings and Credit Lines\n70\nNote 6\nLong-Term Debt\n71\nNote 7\nIncome Taxes\n72\nNote 8\nRedeemable Preferred Stock\n75\nNote 9\nCommon Stock and Stock-Based Compensation\n75\nNote 10\nEarnings Per Share\n77\nNote 11\nBenefit Plans\n77\nNote 12\nRisk Management and Derivatives\n78\nNote 13\nAccumulated Other Comprehensive Income (Loss)\n81\nNote 14\nRevenues\n82\nNote 15\nSegment\n Information\n84\nNote 16\nCommitments and Contingencies\n87\nNote 17\nLeases\n87\nNote 18\nRestructuring\n88\nNote 19\nSupplier Finance Pr\nograms\n88\n2025 FORM 10-K   \n61\n \nTable of Contents\nNOTE 1 — SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nDESCRIPTION OF BUSINESS\nNIKE, Inc. is a worldwide leader in the design, development and worldwide marketing and selling of athletic footwear, apparel, equipment, accessories and services. NIKE, Inc. portfolio brands include the NIKE Brand, Jordan Brand and Converse. The NIKE Brand is focused on performance athletic footwear, apparel, equipment, accessories and services across Men's, Women's and Kids', amplified with sport-inspired lifestyle products carrying the Swoosh trademark, as well as other NIKE Brand trademarks. The Jordan Brand is focused on athletic and casual footwear, apparel and accessories using the Jumpman trademark. Sales and operating results of Jordan Brand products are reported within the respective NIKE Brand geographic operating segments. Converse designs, distributes, licenses and sells casual sneakers, apparel and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron and Jack Purcell trademarks. In some markets outside the U.S., these trademarks are licensed to third parties who design, distribute, market and sell similar products. Operating results of the Converse brand are reported on a stand-alone basis.\nBASIS OF CONSOLIDATION\nThe Consolidated Financial Statements include the accounts of NIKE, Inc. and its subsidiaries (the \"Company\" or \"NIKE\"). All significant intercompany transactions and balances have been eliminated.\n \nMANAGEMENT ESTIMATES\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates, including estimates relating to assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nREVENUE RECOGNITION\nRevenue transactions associated with the sale of NIKE Brand footwear, apparel and equipment, as well as Converse products, comprise a single performance obligation, which consists of the sale of products to customers either through wholesale or direct to consumer channels. The Company satisfies the performance obligation and records revenues when transfer of control to the customer has occurred, based on the terms of sale. A customer is considered to have control once they are able to direct the use and receive substantially all of the benefits of the product. \nControl is transferred to wholesale customers upon shipment or upon receipt depending on the country of the sale and the arrangement with the customer. Control transfers to retail store customers at the time of sale and to substantially all digital commerce customers upon shipment. The transaction price is determined based upon the invoiced sales price, less anticipated sales returns, discounts and claims from customers. Payment terms for wholesale transactions depend on the agreement with the customer, which may be governed by the country of sale, and payment is generally required within 90 days or less of shipment to or receipt by the wholesale customer. Payment is due at the time of sale for retail store and digital commerce transactions.\nConsideration for trademark licensing contracts is earned through sales-based or usage-based royalty arrangements, and the associated revenues are recognized over the license period as earned. \nTaxes assessed by governmental authorities that are both imposed on and concurrent with a specific revenue-producing transaction, and are collected by the Company from a customer, are excluded from Revenues and Cost of sales in the Consolidated Statements of Income. Shipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as fulfillment costs and are included in Cost of sales when the related revenues are recognized.\nSALES-RELATED RESERVES\nConsideration promised in the Company's contracts with customers is variable due to anticipated reductions, such as sales returns, discounts and claims from customers. The Company estimates the most likely amount it will be entitled to receive and records an anticipated reduction against Revenues, with an offsetting increase to Accrued liabilities at the time revenues are recognized. The related estimated cost of inventory for product returns is recorded as a reduction to Cost of sales with an offsetting increase to Prepaid expenses and other current assets.\nThe provision for anticipated sales returns consists of both contractual return rights and discretionary authorized returns. Provisions for post-invoice sales discounts consist of both contractual programs and discretionary discounts that are expected to be granted at a later date.\n2025 FORM 10-K       \n62\nTable of Contents\nEstimates of discretionary authorized returns, discounts and claims are based on (1) historical rates, (2) specific identification of outstanding returns not yet received from customers and outstanding discounts and claims and (3) estimated returns, discounts and claims expected but not yet finalized with customers. Actual returns, discounts and claims in any future period are inherently uncertain and thus may differ from estimates recorded. If actual or expected future returns, discounts or claims are significantly greater or lower than the reserves established, a reduction or increase to net Revenues is recorded in the period in which such determination is made.\nCOST OF SALES\nCost of sales consists primarily of inventory costs, as well as warehousing costs (including the cost of warehouse labor), shipping and handling costs, third-party royalties, certain foreign currency hedge gains and losses and product design costs.\nDEMAND CREATION EXPENSE\nDemand creation expense consists of brand marketing expense and sports marketing expense.\nBrand marketing expense includes advertising and promotion costs such as production and media costs, digital marketing expense, brand events and retail brand presentation costs. Advertising production costs are expensed the first time an advertisement is run. Advertising media costs are expensed when the advertisement appears. Costs related to brand events are expensed when the event occurs. Costs related to retail brand presentation are expensed when the presentation is complete and delivered.\nSports marketing expense includes expenses related to endorsement contracts, complimentary product and sports marketing events. A significant amount of the Company's promotional expenses result from payments under endorsement contracts. In general, endorsement payments are expensed on a straight-line basis over the term of the contract. However, certain contracts contain elements that may be accounted for differently based upon the facts and circumstances of each individual contract. Prepayments made under contracts are included in Prepaid expenses and other current assets or Deferred income taxes and other assets depending on the period to which the prepayment applies.\nCertain contracts provide for contingent payments to endorsers based upon specific achievements in their sport (e.g., winning a championship). The Company records Demand creation expense for these amounts when the endorser achieves the specific goal.\nCertain contracts provide for variable payments based upon endorsers maintaining a level of performance in their sport over an extended period of time (e.g., maintaining a specified ranking in a sport for a year). When the Company determines payments are probable, the amounts are reported in\n \nDemand creation expense ratably over the contract period based on the Company's best estimate of the endorser's performance. In these instances, to the extent actual payments to the endorser differ from the Company's estimate due to changes in the endorser's performance, adjustments to Demand creation expense may be recorded in a future period.\nCertain contracts provide for royalty payments to endorsers based upon a predetermined percent of sales of particular products, which the Company records in Cost of sales as the related sales occur. For contracts containing minimum guaranteed royalty payments, the Company records the amount of any guaranteed payment in excess of that earned through sales of product within Demand creation expense.\nThrough cooperative advertising programs, the Company reimburses its wholesale customers for certain costs of advertising the Company's products. To the extent the Company receives a distinct good or service in exchange for consideration paid to the customer that does not exceed the fair value of that good or service, the amounts reimbursed are recorded in Demand creation expense.\nTotal Demand creation expense was $\n4,689\n million, $\n4,285\n million and $\n4,060\n million for the years ended May 31, 2025, 2024 and 2023, respectively. Prepaid demand creation expenses totaled $\n1,333\n million and $\n814\n million at May 31, 2025 and 2024, respectively, of which $\n498\n million and $\n420\n million, respectively, were recorded in Prepaid expenses and other current assets, and $\n835\n million and $\n394\n million, respectively, were recorded in Deferred income taxes and other assets.\nOPERATING OVERHEAD EXPENSE\nOperating overhead expense consists primarily of wage and benefit-related expenses and other administrative expenses, such as research and development costs, bad debt expense, rent, depreciation and amortization and costs related to professional services, certain technology investments, meetings and travel.\n2025 FORM 10-K   \n63\n \nTable of Contents\nCASH AND EQUIVALENTS\nCash and equivalents represent cash and short-term, highly liquid investments, that are both readily convertible to known amounts of cash and so near their maturity they present insignificant risk of changes in value because of changes in interest rates, with maturities three months or less at the date of purchase.\nSHORT-TERM INVESTMENTS\nShort-term investments consist of highly liquid investments with maturities over three months at the date of purchase. At May 31, 2025 and 2024, Short-term investments consisted of available-for-sale debt securities, which are recorded at fair value with unrealized gains and losses reported, net of tax, in Accumulated other comprehensive income (loss), unless unrealized losses are determined to be unrecoverable. Realized gains and losses on the sale of securities are determined by specific identification. The Company considers all available-for-sale debt securities, including those with maturity dates beyond 12 months, as available to support current operational liquidity needs and, therefore, classifies all securities with maturity dates beyond three months at the date of purchase as current assets within Short-term investments on the Consolidated Balance Sheets.\nRefer to Note 4 — Fair Value Measurements for more information on the Company's Short-term investments.\nALLOWANCE FOR UNCOLLECTIBLE ACCOUNTS RECEIVABLE\nAccounts receivable, net\n \nconsist primarily of amounts due from customers. The Company makes ongoing estimates relating to the collectability of its accounts receivable and maintains an allowance for expected losses resulting from the inability of its customers to make required payments. In addition to judgments about the creditworthiness of significant customers based on ongoing credit evaluations, the Company considers historical levels of credit losses, as well as macroeconomic and industry trends to determine the amount of the allowance.\n The allowance for uncollectible accounts receivable was $\n27\n million and $\n35\n million as of May 31, 2025 and 2024, respectively.\nINVENTORY VALUATION\nInventory costs primarily consist of product cost from the Company's suppliers, as well as inbound freight, import duties, taxes, insurance, logistics and other handling fees. Inventories, substantially all of which are finished goods, are stated at lower of cost and net realizable value and valued on either an average or a specific identification cost basis. In some instances, the Company ships products directly from its suppliers to the customer, with the related inventory and cost of sales recognized on a specific identification basis.\nIf the net realizable value of inventory is estimated to be less than the cost of the inventory, a reserve is recorded equal to the difference between the cost of the inventory and the estimated net realizable value. This reserve is recorded as a charge to Cost of sales.\n As of May 31, 2025, the Company's inventory reserve was $\n233\n million compared to $\n155\n million as of May 31, 2024.\nPROPERTY, PLANT AND EQUIPMENT AND DEPRECIATION\nProperty, plant and equipment are recorded at cost. Depreciation is determined on a straight-line basis for land improvements, buildings and leasehold improvements over \n2\n to \n40\n years and for machinery and equipment over \n2\n to \n15\n years.\nDepreciation of assets used in manufacturing, warehousing and product distribution are recorded in Cost of sales. Depreciation of all other assets are recorded in Operating overhead expense.\nSOFTWARE DEVELOPMENT COSTS\nExpenditures for major software purchases and software developed for internal use are capitalized and amortized over \n2\n to \n12\n years on a straight-line basis, once ready for their intended use. The Company's policy provides for the capitalization of external direct costs associated with developing or obtaining internal use computer software. The Company also capitalizes certain payroll and payroll-related costs for employees who are directly associated with internal use computer software projects. The amount of capitalizable payroll costs with respect to these employees is limited to the time directly spent on such projects. Costs associated with preliminary project stage activities, training, maintenance and all other post-implementation stage activities are expensed as incurred.\n2025 FORM 10-K       \n64\nTable of Contents\nIMPAIRMENT OF LONG-LIVED ASSETS\nThe Company reviews the carrying value of long-lived assets or asset groups to be used in operations whenever events or changes in circumstances indicate the carrying amount of the assets might not be recoverable. Factors that would necessitate an impairment assessment include a significant adverse change in the extent or manner in which an asset is used, a significant adverse change in legal factors or the business climate that could affect the value of the asset or a significant decline in the observable market value of an asset, among others. If such facts indicate a potential impairment, the Company would assess the recoverability of an asset group by determining if the carrying value of the asset group exceeds the sum of the projected undiscounted cash flows expected to result from the use and eventual disposition of the assets over the remaining economic life of the primary asset in the asset group. If the recoverability test indicates that the carrying value of the asset group is not recoverable, the Company will estimate the fair value of the asset group using appropriate valuation methodologies, which would typically include an estimate of discounted cash flows. Any impairment would be measured as the difference between the asset group's carrying amount and its estimated fair value.\nGOODWILL AND INDEFINITE-LIVED INTANGIBLE ASSETS\nThe Company performs annual impairment tests on goodwill and intangible assets with indefinite lives in the fourth quarter of each fiscal year or when events occur or circumstances change that would, more likely than not, reduce the fair value of a reporting unit or an intangible asset with an indefinite life below its carrying value. \nFor purposes of testing goodwill for impairment, the Company allocates goodwill across its reporting units, which are considered the Company's operating segments. For both goodwill and indefinite-lived intangible assets, which primarily consist of acquired trade names and trademarks, the Company may first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit or an intangible asset with an indefinite life is less than its carrying amount. If, after assessing the totality of events and circumstances, the Company determines it is more likely than not that the fair value of a reporting unit or indefinite-lived intangible asset is greater than its carrying amount, an impairment test is unnecessary. \nIf an impairment test is necessary, the Company will estimate the fair value of the related reporting unit or indefinite-lived intangible asset. If the carrying value of a reporting unit or indefinite-lived intangible asset exceeds its fair value, the goodwill of that reporting unit or indefinite-lived intangible asset is determined to be impaired and the Company will record an impairment charge equal to the excess of the carrying value over the related fair value.\n \nThere were \nno\n impairment losses for the year ended May 31, 2025, and an \nimmaterial\n amount of accumulated impairment losses as of May 31, 2024. \nOPERATING LEASES\nThe Company primarily leases retail store space, certain distribution and warehouse facilities, office space, equipment and other non-real estate assets. The Company determines if an arrangement is a lease at inception and begins recording lease activity at the commencement date, which is generally the date in which the Company takes possession of or controls the physical use of the asset. Lease components are not separated from non-lease components for real estate leases within the Company's lease portfolio. Right-of-use (\"ROU\") assets and lease liabilities are recognized based on the present value of lease payments over the lease term with lease expense recognized on a straight-line basis. The Company's incremental borrowing rate is used to determine the present value of future lease payments unless the implicit rate is readily determinable. \nLease agreements may contain rent escalation clauses, renewal or termination options, rent holidays or certain landlord incentives, including tenant improvement allowances. ROU assets include amounts for scheduled rent increases and are reduced by the amount of lease incentives. The lease term includes the non-cancelable period of the lease and options to extend or terminate the lease when it is reasonably certain the Company will exercise those options. The Company does not record leases with an initial term of 12 months or less on the Consolidated Balance Sheets and recognizes related lease payments in the Consolidated Statements of Income on a straight-line basis over the lease term. Certain lease agreements include variable lease payments, which are based on a percent of retail sales over specified levels or adjust periodically for inflation as a result of changes in a published index, primarily the Consumer Price Index, and are expensed as incurred.\nFAIR VALUE MEASUREMENTS\nThe Company measures certain financial assets and liabilities at fair value on a recurring basis, including derivatives, equity securities and available-for-sale debt securities. Fair value is the price the Company would receive to sell an asset or pay to transfer a liability in an orderly transaction with a market participant at the measurement date. The Company uses a three-level hierarchy that prioritizes fair value measurements based on the types of inputs used, as follows:\n2025 FORM 10-K   \n65\n \nTable of Contents\n•\nLevel 1: Quoted prices in active markets for identical assets or liabilities.\n•\nLevel 2: Inputs other than quoted prices that are observable for the asset or liability, either directly or indirectly; these include quoted prices for similar assets or liabilities in active markets and quoted prices for identical or similar assets or liabilities in markets that are not active.\n•\nLevel 3: Unobservable inputs with little or no market data available, which require the reporting entity to develop its own assumptions.\nThe Company's assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment and considers factors specific to the asset or liability. Financial assets and liabilities are classified in their entirety based on the most conservative level of input that is significant to the fair value measurement.\nPricing vendors are utilized for a majority of Level 1 and Level 2 investments. These vendors either provide a quoted market price in an active market or use observable inputs without applying significant adjustments in their pricing. Observable inputs include broker quotes, interest rates and yield curves observable at commonly quoted intervals, volatilities and credit risks. The fair value of derivative contracts is determined using observable market inputs such as the daily market foreign currency rates, forward pricing curves, currency volatilities, currency correlations and interest rates and considers nonperformance risk of the Company and its counterparties. \nThe Company's fair value measurement process includes comparing fair values to another independent pricing vendor to ensure appropriate fair values are recorded.\nRefer to Note 4 — Fair Value Measurements for additional information.\nFOREIGN CURRENCY TRANSLATION AND FOREIGN CURRENCY TRANSACTIONS\nAdjustments resulting from translating foreign functional currency financial statements into U.S. Dollars are included in the foreign currency translation adjustment, a component of Accumulated other comprehensive income (loss).\nThe Company's global subsidiaries have various monetary assets and liabilities, primarily receivables and payables, which are denominated in currencies other than their functional currency. These balance sheet items are subject to remeasurement, the impact of which is recorded in Other (income) expense, net, within the Consolidated Statements of Income.\nACCOUNTING FOR DERIVATIVES AND HEDGING ACTIVITIES\nThe Company uses derivative financial instruments to reduce its exposure to changes in foreign currency exchange rates and interest rates. All derivatives are recorded at fair value on the Consolidated Balance Sheets and changes in the fair value of derivative financial instruments are either recognized in Accumulated other comprehensive income (loss), Long-term debt or Net income depending on the nature of the underlying exposure, whether the derivative is formally designated as a hedge and, if designated, the extent to which the hedge is effective. The Company classifies the cash flows at settlement from derivatives in the same category as the cash flows from the related hedged items. For undesignated hedges, designated cash flow hedges and fair value hedges, this is primarily within the Cash provided (used) by operations component of the Consolidated Statements of Cash Flows. For designated net investment hedges, this is within the Cash provided (used) by investing activities component of the Consolidated Statements of Cash Flows.\nRefer to Note 12 — Risk Management and Derivatives for additional information on the Company's risk management program and derivatives.\nSTOCK-BASED COMPENSATION\nThe Company accounts for stock-based compensation by estimating the fair value, net of estimated forfeitures, of equity awards and recognizing the related expense as Cost of sales or Operating overhead expense, as applicable, in the Consolidated Statements of Income on a straight-line basis over the vesting period. Substantially all awards vest ratably over \nfour years\n of continued employment, with stock options expiring \n10\n years from the date of grant. Performance-based restricted stock units vest based on the Company's achievement of certain performance criteria throughout the \nthree-year\n performance period and continued employment through the vesting date. The fair value of options, stock appreciation rights and employees' purchase rights under the employee stock purchase plans (\"ESPPs\") is determined using the Black-Scholes option pricing model. The fair value of restricted stock and time-vesting restricted stock units is established by the market price on the date of grant. The fair value of performance-based restricted stock units is estimated as of the grant date using a Monte Carlo simulation.\nRefer to Note 9 — Common Stock and Stock-Based Compensation for additional information on the Company's stock-based compensation programs.\n2025 FORM 10-K       \n66\nTable of Contents\nINCOME TAXES\nThe Company accounts for income taxes using the asset and liability method. This approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of assets and liabilities. The Company records a valuation allowance to reduce deferred tax assets to the amount management believes is more likely than not to be realized. Realization of deferred tax assets is dependent on future taxable earnings and is therefore uncertain. At least quarterly, the Company assesses taxable income in prior carryback periods, the scheduled reversal of deferred tax liabilities, projected future taxable income and available tax planning strategies. The Company uses forecasts of taxable income and considers foreign tax credit utilization in making this assessment of realization, which are inherently uncertain and can result in variation between estimated and actual results. To the extent the Company believes that recovery is not likely, a valuation allowance is established against the net deferred tax asset, which increases the Company's income tax expense in the period when such determination is made.\nThe Company recognizes a tax benefit from uncertain tax positions in the consolidated financial statements only when it is more likely than not the position will be sustained upon examination by relevant tax authorities. The Company recognizes interest and penalties related to income tax matters in Income tax expense.\nRefer to Note 7 — Income Taxes for further discussion.\nEARNINGS PER SHARE\nBasic earnings per common share is calculated by dividing Net income by the weighted average number of common shares outstanding during the year. Diluted earnings per common share is calculated by adjusting weighted average outstanding shares, assuming conversion of all potentially dilutive stock options and awards.\nRefer to Note 10 — Earnings Per Share for further discussion.\nRECENT ACCOUNTING PRONOUNCEMENTS\nIn November 2023, the Financial Accounting Standards Board (the \"FASB\") issued Accounting Standards Update (\"ASU\") 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant expenses. The amendments will require public entities to disclose significant segment expenses that are regularly provided to the chief operating decision maker and included within segment profit and loss. The Company adopted this ASU for fiscal 2025 and the related disclosures are included in Note 15 — Segment Information. The amendments were effective for the Company's annual periods beginning June 1, 2024, and interim periods beginning June 1, 2025 and have been applied retrospectively to all prior periods presented in the financial statements. \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which includes amendments that further enhance income tax disclosures, primarily through standardization and disaggregation of rate reconciliation categories and income taxes paid by jurisdiction. The amendments are effective for the Company's annual periods beginning June 1, 2025, with early adoption permitted, and should be applied either prospectively or retrospectively. The Company is currently evaluating the ASU to determine its impact on the Company's disclosures.\nIn November 2024, the FASB issued ASU 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, which requires disclosure about the types of costs and expenses included in certain expense captions presented on the income statement. The new disclosure requirements are effective for the Company's annual periods beginning June 1, 2027, and interim periods beginning June 1, 2028, with early adoption permitted, and may be applied either prospectively or retrospectively. The Company is currently evaluating the ASU to determine its impact on the Company's disclosures.\n2025 FORM 10-K   \n67\n \nTable of Contents\nNOTE 2 — PROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment, net included the following:\nMAY 31,\n(Dollars in millions)\n2025\n2024\nLand and improvements\n$\n334\n \n$\n329\n \nBuildings\n3,510\n \n3,439\n \nMachinery and equipment\n2,954\n \n3,123\n \nInternal-use software\n1,693\n \n1,807\n \nLeasehold improvements\n2,037\n \n2,023\n \nConstruction in process\n404\n \n193\n \nTotal property, plant and equipment, gross\n10,932\n \n10,914\n \nLess accumulated depreciation and amortization\n6,104\n \n5,914\n \nTOTAL PROPERTY, PLANT AND EQUIPMENT, NET\n$\n4,828\n \n$\n5,000\n \nCapitalized interest was not material for the fiscal years ended May 31, 2025, 2024 and 2023.\nNOTE 3 — ACCRUED LIABILITIES\nAccrued liabilities included the following:\nMAY 31,\n(Dollars in millions)\n2025\n2024\nSales-related reserves \n$\n1,834\n \n$\n1,282\n \nCompensation and benefits, excluding taxes\n1,245\n \n1,291\n \nDividends payable\n598\n \n563\n \nEndorsement compensation\n481\n \n578\n \nOther\n1,753\n \n2,011\n \nTOTAL ACCRUED LIABILITIES\n$\n5,911\n \n$\n5,725\n \n2025 FORM 10-K       \n68\nTable of Contents\nNOTE 4 — FAIR VALUE MEASUREMENTS\nThe following tables present information about the Company's financial assets measured at fair value on a recurring basis as of May 31, 2025 and 2024, and indicate the level in the fair value hierarchy in which the Company classifies the fair value measurement.\nMAY 31, 2025\n(Dollars in millions)\nASSETS AT FAIR VALUE\nCASH AND EQUIVALENTS\nSHORT-TERM INVESTMENTS\nCash\n$\n1,221\n \n$\n1,221\n \n$\n— \nLevel 1:\nU.S. Treasury securities\n1,046\n \n—\n \n1,046\n \nLevel 2:\nCommercial paper and bonds\n675\n \n45\n \n630\n \nMoney market funds\n5,902\n \n5,902\n \n—\n \nTime deposits\n297\n \n295\n \n2\n \nU.S. Agency securities\n10\n \n1\n \n9\n \nTotal Level 2\n6,884\n \n6,243\n \n641\n \nTOTAL\n$\n9,151\n \n$\n7,464\n \n$\n1,687\n \n \nMAY 31, 2024\n(Dollars in millions)\nASSETS AT FAIR VALUE\nCASH AND EQUIVALENTS\nSHORT-TERM INVESTMENTS\nCash\n$\n1,222\n \n$\n1,222\n \n$\n— \nLevel 1:\nU.S. Treasury securities\n1,175\n \n155\n \n1,020\n \nLevel 2:\nCommercial paper and bonds\n591\n \n17\n \n574\n \nMoney market funds\n8,119\n \n8,119\n \n—\n \nTime deposits\n440\n \n347\n \n93\n \nU.S. Agency securities\n35\n \n—\n \n35\n \nTotal Level 2\n9,185\n \n8,483\n \n702\n \nTOTAL\n$\n11,582\n \n$\n9,860\n \n$\n1,722\n \nAs of May 31, 2025, the Company held $\n776\n million of available-for-sale debt securities with maturity dates within one year and $\n911\n million with maturity dates over one year and less than five years in Short-term investments on the Consolidated Balance Sheets. The fair value of the Company's available-for-sale debt securities approximates their amortized cost.\nIncluded in Interest expense (income), net was interest income related to the Company's investment portfolio of $\n404\n million, $\n430\n million and $\n297\n million for the years ended May 31, 2025, 2024 and 2023, respectively.\nThe Company records the assets and liabilities of its derivative financial instruments on a gross basis on the Consolidated Balance Sheets. The Company's derivative financial instruments are subject to master netting arrangements that allow for the offset of assets and liabilities in the event of default or early termination of the contract. Any amounts of cash collateral received related to these instruments associated with the Company's credit-related contingent features are recorded in Cash and equivalents and Accrued liabilities, the latter of which would further offset against the Company's derivative asset balance. Any amounts of cash collateral posted related to these instruments associated with the Company's credit-related contingent features are recorded in Prepaid expenses and other current assets, which would further offset against the Company's derivative liability balance. Cash collateral received or posted related to the Company's credit-related contingent features is presented in the Cash provided (used) by operations component of the Consolidated Statements of Cash Flows. The Company does not recognize amounts of non-cash collateral received, such as securities, on the Consolidated Balance Sheets. For additional information related to credit risk, refer to Note 12 — Risk Management and Derivatives.\nThe following tables present information about the Company's derivative assets and liabilities measured at fair value on a recurring basis and indicate the level in the fair value hierarchy in which the Company classifies the fair value measurement:\n2025 FORM 10-K   \n69\n \nTable of Contents\nMAY 31, 2025\nDERIVATIVE ASSETS\nDERIVATIVE LIABILITIES\n(Dollars in millions)\nASSETS AT FAIR VALUE\nOTHER CURRENT ASSETS\nOTHER LONG-TERM ASSETS\nLIABILITIES AT FAIR VALUE\nACCRUED LIABILITIES\nOTHER LONG-TERM LIABILITIES\nLevel 2:\nForeign exchange forwards and options\n(1)\n$\n107\n \n$\n85\n \n$\n22\n \n$\n368\n \n$\n226\n \n$\n142\n \nInterest rate swaps\n(1)\n24\n \n—\n \n24\n \n3\n \n—\n \n3\n \nTOTAL\n$\n131\n \n$\n85\n \n$\n46\n \n$\n371\n \n$\n226\n \n$\n145\n \n(1)\nIf the foreign exchange and interest rate swap derivative instruments had been netted on the Consolidated Balance Sheets, the asset and liability positions each would have been reduced by $\n131\n million as of May 31, 2025. As of that date, the Company posted $\n166\n million cash collateral to various counterparties on the derivative liability balance and \nno\n amount of collateral was received from counterparties on the derivative asset balance.\nMAY 31, 2024\nDERIVATIVE ASSETS\nDERIVATIVE LIABILITIES\n(Dollars in millions)\nASSETS AT FAIR VALUE\nOTHER CURRENT ASSETS\nOTHER LONG-TERM ASSETS\nLIABILITIES AT FAIR VALUE\nACCRUED LIABILITIES\nOTHER LONG-TERM LIABILITIES\nLevel 2:\nForeign exchange forwards and options\n(1)\n$\n343\n \n$\n299\n \n$\n44\n \n$\n120\n \n$\n115\n \n$\n5\n \nInterest rate swaps\n(1)\n—\n \n—\n \n—\n \n31\n \n—\n \n31\n \nTOTAL\n$\n343\n \n$\n299\n \n$\n44\n \n$\n151\n \n$\n115\n \n$\n36\n \n(1)\nIf the foreign exchange and interest rate swap derivative instruments had been netted on the Consolidated Balance Sheets, the asset and liability positions each would have been reduced by $\n142\n million as of May 31, 2024. As of that date, the Company received $\n112\n million of cash collateral from various counterparties on the derivative asset balance and posted $\n10\n million cash collateral on the derivative liability balance.\nFor additional information related to the Company's derivative financial instruments, refer to Note 12 — Risk Management and Derivatives. For fair value information regarding Notes payable and Long-term debt, refer to Note 5 — Short-Term Borrowings and Credit Lines and Note 6 — Long-Term Debt, respectively. \nThe carrying amounts of other current financial assets and other current financial liabilities approximate fair value.\nNOTE 5 — SHORT-TERM BORROWINGS AND CREDIT LINES\nThe carrying amounts reflected on the Consolidated Balance Sheets for Notes payable approximate fair value.\nOn March 7, 2025, the Company entered into a \n364-day\n committed credit facility agreement with a syndicate of banks, which provides for up to $\n1\n billion of borrowings, with an option to increase borrowings up to $\n1.5\n billion in total with lender approval. The facility matures on March 6, 2026, with an option to extend the maturity date an additional \n364\n days. This facility replaces the prior $\n1\n billion \n364-day\n credit facility agreement entered into on March 8, 2024, which matured on March 7, 2025. In July 2025, Standard and Poor's Corporation downgraded the Company's senior unsecured debt rating from AA- to A+. Based on the Company's current long-term senior unsecured debt ratings of A+ and A1 from Standard and Poor's Corporation and Moody's Investor Services, respectively, the interest rate charged on any outstanding borrowings would be the prevailing Term Secured Overnight Financing Rate (\"Term SOFR\") for the applicable interest period plus \n0.725\n%. The facility fee is \n0.04\n% of the total undrawn commitment.\nOn March 7, 2025, the Company entered into a \nfive-year\n committed credit facility agreement with a syndicate of banks which provides for up to $\n2\n billion of borrowings, with the option to increase borrowings up to $\n3\n billion in total with lender approval. The facility matures on March 7, 2030, with options to extend the maturity date up to an additional \ntwo years\n. This facility replaces the prior $\n2\n billion \nfive-year\n credit facility agreement entered into on March 11, 2022, which would have matured on March 11, 2027. In July 2025, Standard and Poor's Corporation downgraded the Company's senior unsecured debt rating from AA- to A+. Based on the Company's current long-term senior unsecured debt ratings of A+ and A1 from Standard and Poor's Corporation and Moody's Investor Services, respectively, the interest rate charged on any outstanding borrowings would be the prevailing Term SOFR for the applicable interest period plus \n0.725\n%. The facility fee is \n0.05\n% of the total undrawn commitment.\nAs of and for the periods ended May 31, 2025 and 2024, \nno\n amounts were outstanding under any of the Company's committed credit facilities.\n2025 FORM 10-K       \n70\nTable of Contents\nNOTE 6 — LONG-TERM DEBT\nLong-term debt, net of unamortized premiums, discounts, debt issuance costs, and interest rate swap fair value adjustments comprises the following: \nBOOK VALUE OUTSTANDING \nAS OF MAY 31,\nScheduled Maturity (Dollars in millions)\nORIGINAL PRINCIPAL\nINTEREST RATE\nINTEREST PAYMENTS\n2025\n2024\nCorporate Term Debt:\n(1)(2)\nMarch 27, 2025\n1,000\n \n2.40\n \n%\nSemi-Annually\n$\n—\n \n$\n999\n \nNovember 1, 2026\n1,000\n \n2.38\n \n%\nSemi-Annually\n999\n \n998\n \nMarch 27, 2027\n1,000\n \n2.75\n \n%\nSemi-Annually\n999\n \n998\n \nMarch 27, 2030\n1,500\n \n2.85\n \n%\nSemi-Annually\n1,495\n \n1,494\n \nMarch 27, 2040\n(3)\n1,000\n \n3.25\n \n%\nSemi-Annually\n993\n \n966\n \nMay 1, 2043\n(3)\n500\n \n3.63\n \n%\nSemi-Annually\n502\n \n488\n \nNovember 1, 2045\n(3)\n1,000\n \n3.88\n \n%\nSemi-Annually\n997\n \n986\n \nNovember 1, 2046\n500\n \n3.38\n \n%\nSemi-Annually\n493\n \n492\n \nMarch 27, 2050\n1,500\n \n3.38\n \n%\nSemi-Annually\n1,483\n \n1,482\n \nTotal\n7,961\n \n8,903\n \nLess Current Portion of Long-Term Debt\n—\n \n1,000\n \nTOTAL LONG-TERM DEBT\n$\n7,961\n \n$\n7,903\n \n(1)\nThese senior unsecured obligations rank equally with the Company's other unsecured and unsubordinated indebtedness.\n(2)\nThe bonds are redeemable at the Company's option at a price equal to the greater of (i) \n100\n% of the aggregate principal amount of the notes to be redeemed or (ii) the sum of the present values of the remaining scheduled payments, plus in each case, accrued and unpaid interest. However, the bonds also feature a par call provision, which allows for the bonds to be redeemed at a price equal to \n100\n% of the aggregate principal amount of the notes being redeemed, plus accrued and unpaid interest on or after the Par Call Date, which can range from one to six months prior to the scheduled maturity, as defined in the respective notes.\n(3)\nThe Company entered into interest rate swap agreements pursuant to which the Company receives fixed interest payments at the same rate as the term debt and pays variable interest payments based on SOFR plus a fixed spread. At May 31, 2025, the notional amount outstanding of these swaps was $\n2.4\n billion and had interest rates payable that ranged from \n3.6\n% to \n4.5\n%. These swaps mature during fiscal 2034 and 2035.\nThe scheduled maturity of Long-term debt in each of the years ending May 31, 2026 through 2030, is $\n0\n million, $\n2,000\n million, $\n0\n million, $\n0\n million and $\n1,500\n million, respectively, at face value.\nThe Company's Long-term debt is recorded at adjusted cost, net of unamortized premiums, discounts, debt issuance costs, and interest rate swap fair value adjustments. The fair value of long-term debt is estimated based upon quoted prices for similar instruments or quoted prices for identical instruments in inactive markets (Level 2). The fair value of the Company's Long-term debt, including the current portion but excluding interest rate swap fair value adjustments, was approximately $\n6,673\n million and $\n7,631\n million as of May 31, 2025 and 2024, respectively.\n \n2025 FORM 10-K   \n71\n \nTable of Contents\nNOTE 7 — INCOME TAXES\nIncome before income taxes is as follows:\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nIncome before income taxes:\nUnited States\n$\n3,220\n \n$\n5,588\n \n$\n4,663\n \nForeign\n665\n \n1,112\n \n1,538\n \nTOTAL INCOME BEFORE INCOME TAXES\n$\n3,885\n \n$\n6,700\n \n$\n6,201\n \nThe provision for income taxes is as follows:\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nCurrent:\nUnited States\nFederal\n$\n358\n \n$\n782\n \n$\n430\n \nState\n121\n \n201\n \n184\n \nForeign\n475\n \n514\n \n634\n \nTotal Current\n954\n \n1,497\n \n1,248\n \nDeferred:\nUnited States\nFederal\n(\n135\n)\n(\n422\n)\n(\n162\n)\nState\n(\n12\n)\n(\n61\n)\n(\n25\n)\nForeign\n(\n141\n)\n(\n14\n)\n70\n \nTotal Deferred\n(\n288\n)\n(\n497\n)\n(\n117\n)\nTOTAL INCOME TAX EXPENSE\n$\n666\n \n$\n1,000\n \n$\n1,131\n \nA reconciliation from the U.S. statutory federal income tax rate to the effective income tax rate is as follows:\n \nYEAR ENDED MAY 31,\n2025\n2024\n2023\nFederal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal benefit\n2.0\n \n%\n1.4\n \n%\n1.5\n \n%\nForeign earnings\n1.1\n \n%\n-\n2.5\n \n%\n1.7\n \n%\nU.S. tax regulations - foreign currency losses\n-\n3.4\n \n%\n0.0\n \n%\n0.0\n \n%\nForeign-derived intangible income benefit\n-\n5.3\n \n%\n-\n4.8\n \n%\n-\n6.1\n \n%\nStock-based compensation\n1.5\n \n%\n-\n0.5\n \n%\n-\n1.1\n \n%\nIncome tax audits and contingency reserves\n2.7\n \n%\n1.8\n \n%\n1.0\n \n%\nU.S. research and development tax credit\n-\n2.1\n \n%\n-\n2.1\n \n%\n-\n1.2\n \n%\nOther, net\n-\n0.4\n \n%\n0.6\n \n%\n1.4\n \n%\nEFFECTIVE INCOME TAX RATE\n17.1\n \n%\n14.9\n \n%\n18.2\n \n%\nThe increase in the Company's effective tax rate for the fiscal year ended May 31, 2025 compared to the fiscal year ended May 31, 2024 was primarily due to changes in the Company's earnings mix, decreased benefits from stock-based compensation and one-time benefits recognized in fiscal 2024 including the impact of temporary relief provided by the Internal Revenue Service (\"IRS\") relating to U.S. foreign tax credit regulations. These impacts were partially offset by a one-time, non-cash deferred tax benefit recognized in the third quarter of fiscal 2025 provided by U.S. tax regulations. On December 10, 2024, the U.S. Department of Treasury published final regulations related to Internal Revenue Code (IRC) Section 987 foreign currency gains and losses derived from translation of the operations, assets and liabilities of non-US qualified business units. While these regulations are effective for the Company beginning June 1, 2025, they require computation of a pre-transition foreign currency gain or loss to be included in the determination of future taxable income or loss. Based on the Company’s analysis of the regulations and recognition of temporary differences impacting U.S. taxation of foreign earnings under Subpart F of the Internal \n2025 FORM 10-K       \n72\nTable of Contents\nRevenue Code, the Company recognized a non-cash deferred income tax benefit of $\n133\n million in the third quarter of fiscal 2025 related to pre-transition foreign currency losses.  \nThe decrease in the Company's effective tax rate for the fiscal year ended May 31, 2024 compared to the fiscal year ended May 31, 2023 was primarily due to changes in the Company's earning mix and one-time benefits including the impact of temporary relief provided by the IRS relating to U.S. foreign tax credit regulations. On July 21, 2023, the IRS issued Notice 2023-55 which specifically delayed the application of certain U.S. foreign tax credit regulations that had previously limited the Company's ability to claim credits on certain foreign taxes for the fiscal year ended May 31, 2023. As a result of this new guidance, the Company recognized a one-time tax benefit related to fiscal 2023 tax positions in the first three months of fiscal 2024.\nThe Organization for Economic Co-operation and Development (OECD) and the G20 Inclusive Framework on Base Erosion and Profit Shifting (the \"Inclusive Framework\") have put forth Pillar Two proposals that ensure a minimal level of taxation. Several countries in which the Company operates, including several European Union member states, have adopted domestic legislation to implement the Inclusive Framework's global corporate minimum tax rate of fifteen percent. This legislation became effective for the Company beginning June 1, 2024. Based on the Company's analysis of Pillar Two provisions, these tax law changes did not have a material impact on the Company's financial statements for fiscal 2025.\nDeferred income tax assets and liabilities comprise the following as of: \nMAY 31,\n(Dollars in millions)\n2025\n2024\nDeferred tax assets:\nInventories\n$\n98\n \n$\n69\n \nSales return reserves\n205\n \n125\n \nDeferred compensation\n387\n \n347\n \nStock-based compensation\n285\n \n290\n \nReserves and accrued liabilities\n143\n \n113\n \nOperating lease liabilities\n458\n \n474\n \nIntangibles\n217\n \n236\n \nCapitalized research and development expenditures \n923\n \n878\n \nNet operating loss carry-forwards\n75\n \n21\n \nSubpart F deferred tax\n315\n \n409\n \nOther\n212\n \n214\n \nTotal deferred tax assets\n3,318\n \n3,176\n \nValuation allowance\n(\n51\n)\n(\n29\n)\nTotal deferred tax assets after valuation allowance\n3,267\n \n3,147\n \nDeferred tax liabilities:\nForeign withholding tax on undistributed earnings of foreign subsidiaries\n(\n119\n)\n(\n131\n)\nProperty, plant and equipment\n(\n225\n)\n(\n290\n)\nRight-of-use assets\n(\n377\n)\n(\n397\n)\nOther\n(\n4\n)\n(\n9\n)\nTotal deferred tax liabilities\n(\n725\n)\n(\n827\n)\nNET DEFERRED TAX ASSET \n(1)\n$\n2,542\n \n$\n2,320\n \n(1)\nOf the total $\n2,542\n million net deferred tax asset for the period ended May 31, 2025, $\n2,668\n million was included within Deferred income taxes and other assets and $(\n126\n) million was included within Deferred income taxes and other liabilities on the Consolidated Balance Sheets. Of the total $\n2,320\n million net deferred tax asset for the period ended May 31, 2024, $\n2,465\n million was included within Deferred income taxes and other assets and $(\n145\n) million was included within Deferred income taxes and other liabilities on the Consolidated Balance Sheets.\nDeferred tax assets as of May 31, 2025 and 2024, were reduced by a valuation allowance provided for U.S. capital loss carryforwards and on tax benefits generated by certain entities with operating losses.\nThe Company has available pre-tax effected domestic and foreign loss carry-forwards of $\n261\n million as of May 31, 2025. If not utilized, $\n135\n million of losses will expire in the periods between fiscal 2028 and 2044. Approximately $\n126\n million of losses do not expire.\n2025 FORM 10-K   \n73\n \nTable of Contents\nOn July 4, 2025, the U.S. government enacted The One Big Beautiful Bill Act of 2025 which includes, among other provisions, changes to the U.S. corporate income tax system including the allowance of immediate expensing of qualifying research and development expenses and permanent extensions of certain provisions within the Tax Cuts and Jobs Act. Certain provisions are effective for the Company beginning fiscal 2026. The Company is evaluating the future impact of these tax law changes on its financial statements.\nThe following is a reconciliation of the changes in the gross balance of unrecognized tax benefits as of:\n \nMAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nUnrecognized tax benefits, beginning of the period\n$\n990\n \n$\n936\n \n$\n848\n \nGross increases related to prior period tax positions\n11\n \n35\n \n95\n \nGross decreases related to prior period tax positions\n(\n10\n)\n(\n13\n)\n(\n17\n)\nGross increases related to current period tax positions\n81\n \n77\n \n50\n \nSettlements\n(\n5\n)\n(\n22\n)\n(\n18\n)\nLapse of statute of limitations\n(\n45\n)\n(\n24\n)\n(\n7\n)\nChanges due to currency translation\n4\n \n1\n \n(\n15\n)\nUNRECOGNIZED TAX BENEFITS, END OF THE PERIOD\n$\n1,026\n \n$\n990\n \n$\n936\n \nAs of May 31, 2025, total gross unrecognized tax benefits, excluding related interest and penalties, were $\n1,026\n million, of which $\n738\n million would affect the Company's effective tax rate if recognized in future periods. The majority of the total gross unrecognized tax benefits were long-term in nature and were included within Deferred income taxes and other liabilities on the Consolidated Balance Sheets.\nThe Company recognizes interest and penalties related to income tax matters in Income tax expense. As of May 31, 2025 and 2024, accrued interest and penalties related to uncertain tax positions were $\n376\n million and $\n332\n million, respectively (excluding federal benefit) and were included within Deferred income taxes and other liabilities on the Consolidated Balance Sheets.\nAs of May 31, 2024, long-term income taxes payable unrelated to unrecognized tax benefits were $\n266\n million and were included within Deferred income taxes and other liabilities on the Consolidated Balance Sheets. As of May 31, 2025 these amounts were included within Income taxes payable on the Consolidated Balance Sheets.\nThe Company is subject to taxation in the U.S., as well as various state and foreign jurisdictions. The Company is currently under audit by the U.S. IRS for fiscal years 2017 through 2019. The Company has closed all U.S. federal income tax matters through fiscal 2016, with the exception of certain transfer pricing adjustments. In certain major foreign jurisdictions, tax years after 2011 remain subject to examination. \nAlthough the timing of resolution of audits is not certain, the Company evaluates all domestic and foreign audit issues in the aggregate, along with the expiration of applicable statutes of limitations, and estimates that it is reasonably possible the total gross unrecognized tax benefits could decrease by up to $\n249\n million within the next 12 months primarily as a result of the expected resolution with the IRS of certain U.S. federal income tax matters for fiscal years 2017 through 2019 related to transfer pricing adjustments, research and development credits and other items. \nIn January 2019, the European Commission opened a formal investigation to examine whether the Netherlands has breached State Aid rules when granting certain tax rulings to the Company. The Company believes the investigation is without merit. If this matter is adversely resolved, the Netherlands may be required to assess additional amounts with respect to prior periods, and the Company's income taxes related to prior periods in the Netherlands could increase. \nA portion of the Company's foreign operations benefit from a tax holiday, which is set to expire in 2031. This tax holiday may be extended when certain conditions are met or may be terminated early if certain conditions are not met. The tax benefit attributable to this tax holiday, before taking into consideration other U.S. indirect tax provisions, was $\n271\n million, $\n338\n million and $\n263\n million for the fiscal years ended May 31, 2025, 2024 and 2023, respectively. The benefit of the tax holiday on diluted earnings per common share, before taking into consideration other U.S. indirect tax provisions, was $\n0.18\n, $\n0.22\n and $\n0.17\n for the fiscal years ended May 31, 2025, 2024 and 2023, respectively.\n2025 FORM 10-K       \n74\nTable of Contents\nNOTE 8 — REDEEMABLE PREFERRED STOCK\nSojitz America is the sole owner of the Company's authorized redeemable preferred stock, $\n1\n par value, which is redeemable at the option of Sojitz America or the Company at par value aggregating $\n0.3\n million. A cumulative dividend of $\n0.10\n per share is payable annually on May 31, and no dividends may be declared or paid on the common stock of the Company unless dividends on the redeemable preferred stock have been declared and paid in full. There have been no changes in the redeemable preferred stock in the fiscal years ended May 31, 2025, 2024 and 2023. As the holder of the redeemable preferred stock, Sojitz America does not have general voting rights but does have the right to vote as a separate class on the sale of all or substantially all of the assets of the Company and its subsidiaries; on merger, consolidation, liquidation or dissolution of the Company; or on the sale or assignment of the NIKE trademark for athletic footwear sold in the United States. The redeemable preferred stock has been fully issued to Sojitz America and is not blank check preferred stock. The Company's articles of incorporation do not permit the issuance of additional preferred stock.\nNOTE 9 — COMMON STOCK AND STOCK-BASED COMPENSATION\nCOMMON STOCK\nThe authorized number of shares of Class A Common Stock, \nno\n par value, and Class B Common Stock, \nno\n par value, are \n400\n million and \n2,400\n million, respectively. Each share of Class A Common Stock is convertible into \none\n share of Class B Common Stock. Voting rights of Class B Common Stock are limited in certain circumstances with respect to the election of directors. There are no differences in the dividend and liquidation preferences or participation rights of the holders of Class A and Class B Common Stock.\n From time to time, the Company's Board of Directors authorizes share repurchase programs for the repurchase of Class B Common Stock. The value of repurchased shares is deducted from Total shareholders' equity through allocation to Capital in excess of stated value and Retained earnings (deficit).\nSTOCK-BASED COMPENSATION\nThe NIKE, Inc. Stock Incentive Plan (the \"Stock Incentive Plan\") provides for the issuance of up to \n798\n million previously unissued shares of Class B Common Stock in connection with equity awards granted under the Stock Incentive Plan. The Stock Incentive Plan authorizes the grant of non-statutory stock options, incentive stock options, stock appreciation rights, and stock awards, including restricted stock and restricted stock units. Restricted stock units include both time-vesting restricted stock units (\"RSUs\") as well as performance-based restricted stock units (\"PSUs\"). A committee of the Board of Directors administers the Stock Incentive Plan and has the authority to determine the employees to whom awards will be made, the amount of the awards and the other terms and conditions of the awards. The Company generally grants stock options, restricted stock and restricted stock units on an annual basis. The exercise price for stock options and stock appreciation rights may not be less than the fair market value of the underlying shares on the date of grant. Substantially all awards under the Stock Incentive Plan vest ratably over \n4\n years of continued employment, with stock options expiring \n10\n years from the date of grant. \nThe following table summarizes the Company's total stock-based compensation expense recognized in Cost of sales or Operating overhead expense, as applicable: \n \nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nStock options\n(1)\n$\n292\n \n$\n336\n \n$\n311\n \nESPPs\n69\n \n69\n \n72\n \nRestricted stock and restricted stock units\n(1)(2)\n348\n \n399\n \n372\n \nTOTAL STOCK-BASED COMPENSATION EXPENSE\n$\n709\n \n$\n804\n \n$\n755\n \n(1)\nExpense for stock options includes the expense associated with stock appreciation rights. \n(2)\nFor the fiscal years ended May 31, 2025, 2024 and 2023, expense for restricted stock units includes an immaterial amount of expense for PSUs.\n2025 FORM 10-K   \n75\n \nTable of Contents\nSTOCK OPTIONS\nThe weighted average fair value per share of stock options granted during the fiscal years ended May 31, 2025, 2024 and 2023, computed as of the grant date using the Black-Scholes pricing model, was $\n25.90\n, $\n32.78\n and $\n31.31\n, respectively. \nThe weighted average assumptions used to estimate these fair values were as follows:\n \nYEAR ENDED MAY 31,\n2025\n2024\n2023\nDividend yield\n1.6\n \n%\n1.2\n \n%\n0.9\n \n%\nExpected volatility\n31.1\n \n%\n29.3\n \n%\n27.1\n \n%\nWeighted average expected life (in years)\n6.0\n5.8\n5.8\nRisk-free interest rate\n3.8\n \n%\n4.3\n \n%\n3.3\n \n%\nExpected volatilities are based on an analysis of the historical volatility of the Company's common stock, the implied volatility in market traded options on the Company's common stock with a term greater than \none year\n, as well as other factors. The weighted average expected life of options is based on an analysis of historical and expected future exercise patterns. The interest rate is based on the U.S. Treasury (constant maturity) risk-free rate in effect at the date of grant for periods corresponding with the expected term of the options.\nThe following summarizes the stock option transactions under the plan discussed above: \nSHARES\n(1)\nWEIGHTED AVERAGE OPTION PRICE\n(In millions)\nOptions outstanding as of May 31, 2024\n73.7\n \n$\n98.10\n \nExercised\n(\n5.4\n)\n58.50\n \nForfeited\n(\n6.5\n)\n101.93\n \nGranted\n13.3\n \n83.20\n \nOptions outstanding as of May 31, 2025\n75.1\n \n$\n97.99\n \n(1)\nIncludes stock appreciation rights transactions.\nOptions exercisable as of May 31, 2025 were \n49.8\n million and had a weighted average option price of $\n98.00\n per share. The aggregate intrinsic value for options outstanding and exercisable as of May 31, 2025 was $\n20\n million and $\n20\n million, respectively. The total intrinsic value of the options exercised during the years ended May 31, 2025, 2024 and 2023 was $\n120\n million, $\n305\n million and $\n438\n million, respectively. The intrinsic value is the amount by which the market value of the underlying stock exceeds the exercise price of the options. The weighted average contractual life remaining for options outstanding and options exercisable as of May 31, 2025 was \n5.4\n years and \n3.9\n years, respectively. As of May 31, 2025, the Company had $\n400\n million of unrecognized compensation costs from stock options, net of estimated forfeitures, to be recognized in Cost of sales or Operating overhead expense, as applicable, over a weighted average remaining period of \n2.4\n years.\nEMPLOYEE STOCK PURCHASE PLANS\nIn addition to the Stock Incentive Plan, the Company gives employees the right to purchase shares at a discount from the market price under ESPPs. Subject to the annual statutory limit, employees are eligible to participate through payroll deductions of up to \n10\n% of their compensation. At the end of each \nsix-month\n offering period, shares are purchased by the participants at \n85\n% of the lower of the fair market value at the beginning or the end of the offering period. Employees purchased \n3.6\n million, \n3.1\n million and \n3.0\n million shares during each of the fiscal years ended May 31, 2025, 2024 and 2023, respectively.\nRESTRICTED STOCK AND RESTRICTED STOCK UNITS\nRecipients of restricted stock are entitled to cash dividends and to vote their respective shares throughout the period of restriction. Recipients of restricted stock units, which includes RSUs and PSUs, are entitled to dividend equivalent cash payments upon vesting. The number of shares of restricted stock and restricted stock units vested includes shares of common stock withheld by the Company on behalf of employees to satisfy the minimum statutory tax withholding requirements. \nThe following summarizes the restricted stock and restricted stock units transactions under the plan discussed above: \n2025 FORM 10-K       \n76\nTable of Contents\nSHARES\n(1)\nWEIGHTED AVERAGE GRANT DATE  \nFAIR VALUE\n(In millions)\nNonvested as of May 31, 2024\n9.1\n \n$\n117.52\nVested\n(\n3.3\n)\n116.76\nForfeited\n(\n1.7\n)\n105.68\nGranted\n6.6\n \n82.32\nNonvested as of May 31, 2025\n10.7\n \n$\n94.29\n         (1) Includes an immaterial amount of PSU transactions\nThe weighted average fair value per share of restricted stock and restricted stock units granted for the fiscal years ended May 31, 2025, 2024 and 2023, computed as of the grant date, was $\n82.32\n, $\n103.13\n and $\n115.56\n, respectively. During the fiscal years ended May 31, 2025, 2024 and 2023, the aggregate fair value of vested restricted stock and restricted stock units was $\n221\n million, $\n340\n million and $\n250\n million, respectively, computed as of the date of vesting. \nAs of May 31, 2025, the Company had $\n631\n million of unrecognized compensation costs from restricted stock and restricted stock units, net of estimated forfeitures, to be recognized in Cost of sales or Operating overhead expense, as applicable, over a weighted average remaining period of \n2.5\n years.\nNOTE 10 — EARNINGS PER SHARE\nThe following is a reconciliation from basic earnings per common share to diluted earnings per common share. The computations of diluted earnings per common share exclude restricted stock, restricted stock units and options, including shares under ESPPs, to purchase an estimated additional \n75.5\n million, \n41.0\n million and \n31.7\n million shares of common stock outstanding for the fiscal years ended May 31, 2025, 2024 and 2023, respectively, because the awards were assumed to be anti-dilutive.\n \nYEAR ENDED MAY 31,\n(In millions, except per share data)\n2025\n2024\n2023\nNet income available to common stockholders\n$\n3,219\n \n$\n5,700\n \n$\n5,070\n \nDetermination of shares:\nWeighted average common shares outstanding\n1,484.9\n \n1,517.6\n \n1,551.6\n \nAssumed conversion of dilutive stock options and awards\n2.7\n \n12.1\n \n18.2\n \nDILUTED WEIGHTED AVERAGE COMMON SHARES OUTSTANDING\n1,487.6\n \n1,529.7\n \n1,569.8\n \nEarnings per common share:\nBasic\n$\n2.17\n \n$\n3.76\n \n$\n3.27\n \nDiluted\n$\n2.16\n \n$\n3.73\n \n$\n3.23\n \nNOTE 11 — BENEFIT PLANS\nThe Company has a qualified 401(k) Savings and Profit Sharing Plan, in which all U.S. employees are able to participate. The Company matches a portion of employee contributions to the savings plan. Company contributions to the savings plan were $\n151\n million, $\n153\n million and $\n136\n million and included in Cost of sales or Operating overhead expense, as applicable, for the fiscal years ended May 31, 2025, 2024 and 2023, respectively. \nThe Company allows certain highly compensated employees and non-employee directors of the Company to defer compensation under a nonqualified deferred compensation plan. A rabbi trust was established to fund the Company's nonqualified deferred compensation plan obligation. The assets in the rabbi trust of approximately $\n1,123\n million and $\n1,037\n million as of May 31, 2025 and 2024, respectively, primarily consist of company owned life insurance policies recorded at their cash surrender value and are classified in Deferred income taxes and other assets on the Consolidated Balance Sheets. Deferred compensation plan liabilities were $\n1,102\n million and $\n1,063\n million as of May 31, 2025 and 2024, respectively, and primarily classified in Deferred income taxes and other liabilities on the Consolidated Balance Sheets.\n2025 FORM 10-K   \n77\n \nTable of Contents\nNOTE 12 — RISK MANAGEMENT AND DERIVATIVES\nThe Company is exposed to global market risks, including the effect of changes in foreign currency exchange rates and interest rates, and uses derivatives to manage financial exposures that occur in the normal course of business. The Company does not hold or issue derivatives for trading or speculative purposes.\nThe Company may elect to designate certain derivatives as hedging instruments under U.S. GAAP. The Company formally documents all relationships between designated hedging instruments and hedged items, as well as its risk management objectives and strategies for undertaking hedge transactions. This process includes linking all derivatives designated as hedges to either recognized assets or liabilities or forecasted transactions and assessing, both at inception and on an ongoing basis, the effectiveness of the hedging relationships.\nThe majority of derivatives outstanding as of May 31, 2025, are designated as foreign currency cash flow hedges, primarily for Euro/U.S. Dollar, Chinese Yuan/U.S. Dollar, British Pound/Euro, and Japanese Yen/U.S. Dollar currency pairs. All derivatives are recognized on the Consolidated Balance Sheets at fair value and classified based on the instrument's maturity date.\nThe following tables present the fair values of derivative instruments included within the Consolidated Balance Sheets:\n \nDERIVATIVE ASSETS\nBALANCE SHEET LOCATION\nMAY 31,\n(Dollars in millions)\n2025\n2024\nDerivatives formally designated as hedging instruments:\nForeign exchange forwards and options\nPrepaid expenses and other current assets\n$\n75\n \n$\n269\n \nForeign exchange forwards and options\nDeferred income taxes and other assets\n22\n \n44\n \nInterest rate swaps\nDeferred income taxes and other assets\n24\n \n—\n \nTotal derivatives formally designated as hedging instruments\n121\n \n313\n \nDerivatives not designated as hedging instruments:\nForeign exchange forwards and options\nPrepaid expenses and other current assets\n10\n \n30\n \nTotal derivatives not designated as hedging instruments\n10\n \n30\n \nTOTAL DERIVATIVE ASSETS\n$\n131\n \n$\n343\n \n \nDERIVATIVE LIABILITIES\nBALANCE SHEET LOCATION\nMAY 31,\n(Dollars in millions)\n2025\n2024\nDerivatives formally designated as hedging instruments:\nForeign exchange forwards and options\nAccrued liabilities\n$\n216\n \n$\n110\n \nForeign exchange forwards and options\nDeferred income taxes and other liabilities\n142\n \n5\n \nInterest rate swaps\nDeferred income taxes and other liabilities\n3\n \n31\n \nTotal derivatives formally designated as hedging instruments\n361\n \n146\n \nDerivatives not designated as hedging instruments:\nForeign exchange forwards and options\nAccrued liabilities\n10\n \n5\n \nTotal derivatives not designated as hedging instruments\n10\n \n5\n \nTOTAL DERIVATIVE LIABILITIES\n$\n371\n \n$\n151\n \n2025 FORM 10-K       \n78\nTable of Contents\nThe following tables present the amounts affecting the Consolidated Statements of Income for the years ended May 31, 2025, 2024 and 2023:\n(Dollars in millions)\nAMOUNT OF GAIN (LOSS) \nRECOGNIZED IN OTHER \nCOMPREHENSIVE INCOME (LOSS) ON DERIVATIVES\n(1)\nAMOUNT OF GAIN (LOSS)  \nRECLASSIFIED FROM ACCUMULATED  \nOTHER COMPREHENSIVE  \nINCOME (LOSS) INTO INCOME\n(1)\nYEAR ENDED MAY 31,\nLOCATION OF GAIN (LOSS) \nRECLASSIFIED FROM ACCUMULATED \nOTHER COMPREHENSIVE INCOME \n(LOSS) INTO INCOME\nYEAR ENDED MAY 31,\n2025\n2024\n2023\n2025\n2024\n2023\nDerivatives designated as \ncash flow hedges:\nForeign exchange forwards \nand options\n$\n(\n67\n)\n$\n(\n66\n)\n$\n16\n \nRevenues\n$\n(\n93\n)\n$\n(\n24\n)\n$\n26\n \nForeign exchange forwards  \nand options\n(\n55\n)\n231\n \n305\n \nCost of sales\n295\n \n294\n \n581\n \nForeign exchange forwards \nand options\n1\n \n3\n \n(\n1\n)\nDemand creation expense\n1\n \n2\n \n(\n5\n)\nForeign exchange forwards \nand options\n(\n6\n)\n102\n \n207\n \nOther (income) expense, net\n145\n \n204\n \n338\n \nInterest rate swaps\n(2)\n—\n \n—\n \n—\n \nInterest expense (income), net\n(\n8\n)\n(\n8\n)\n(\n8\n)\nTOTAL DESIGNATED CASH FLOW HEDGES\n$\n(\n127\n)\n$\n270\n \n$\n527\n \n$\n340\n \n$\n468\n \n$\n932\n \n(1)\nFor the fiscal years ended \nMay 31, 2025, 2024, and 2023, \nthe amounts recorded in Other (income) expense, net as a result of the discontinuance of cash flow hedges because the forecasted transactions were no longer probable of occurring were immaterial.\n(2)\nGains and losses associated with terminated interest rate swaps, which were previously designated as cash flow hedges and recorded in Accumulated other comprehensive income (loss), will be released through Interest expense (income), net over the term of the issued debt.\nAMOUNT OF GAIN (LOSS) RECOGNIZED\n \nIN INCOME ON DERIVATIVES\nLOCATION OF GAIN (LOSS) \n \nRECOGNIZED IN INCOME \n \nON DERIVATIVES\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nDerivatives not designated as hedging instruments:\nForeign exchange forwards and options and embedded derivatives\n$\n2\n \n$\n24\n \n$\n28\n \nOther (income) expense, net\nCASH FLOW HEDGES\nAll changes in fair value of derivatives designated as cash flow hedge instruments are recorded in Accumulated other comprehensive income (loss) until Net income is affected by the variability of cash flows of the hedged transaction. Effective hedge results are classified in the Consolidated Statements of Income in the same manner as the underlying exposure. When it is no longer probable the forecasted hedged transaction will occur in the initially identified time period, hedge accounting is discontinued and the Company accounts for the associated derivative as an undesignated instrument as discussed below. Additionally, the gains and losses associated with derivatives no longer designated as cash flow hedge instruments in Accumulated other comprehensive income (loss) are recognized immediately in Other (income) expense, net, if it is probable the forecasted hedged transaction will not occur by the end of the initially identified time period or within an additional \ntwo-month\n period thereafter. In rare circumstances, the additional period of time may exceed two months due to extenuating circumstances related to the nature of the forecasted transaction that are outside the control or influence of the Company. \nThe purpose of the Company's foreign exchange risk management program is to lessen both the positive and negative effects of currency fluctuations on the Company's consolidated results of operations, financial position and cash flows. Foreign currency exposures the Company may elect to hedge in this manner include product costs, non-functional currency denominated revenues, intercompany revenues, demand creation expenses, investments in U.S. Dollar denominated available-for-sale debt securities and certain other intercompany transactions.\nProduct cost foreign currency exposures are primarily generated through non-functional currency denominated product purchases. NIKE entities primarily purchase product in two ways: (1) Certain NIKE entities purchase product from the NIKE Trading Company (\"NTC\"), a wholly-owned sourcing hub that buys NIKE branded products from third-party factories, predominantly in U.S. Dollars. The NTC, whose functional currency is the U.S. Dollar, then sells the product to NIKE entities in their respective functional currencies. NTC sales to a NIKE entity with a different functional currency result in a foreign currency \n2025 FORM 10-K   \n79\n \nTable of Contents\nexposure for the NTC. (2) Other NIKE entities purchase product directly from third-party factories in U.S. Dollars. These purchases generate a foreign currency exposure for those NIKE entities with a functional currency other than the U.S. Dollar.\nThe Company's policy permits the utilization of derivatives to reduce its foreign currency exposures where internal netting or other strategies cannot be effectively employed. Typically, the Company may enter into hedge contracts starting up to \n12\n to \n24\n months in advance of the forecasted transaction and may place incremental hedges up to \n100\n% of the exposure by the time the forecasted transaction occurs.\n The total notional amount of outstanding foreign currency derivatives designated as cash flow hedges was $\n18.4\n billion and $\n16.2\n billion as of May 31, 2025 and 2024, respectively.\nAs of May 31, 2025, approximately $\n24\n million of deferred net losses (net of tax) on both outstanding and matured derivatives in Accumulated other comprehensive income (loss) are expected to be reclassified to Net income during the next 12 months concurrent with the underlying hedged transactions also being recorded in Net income. Actual amounts ultimately reclassified to Net income are dependent on the exchange rates in effect when derivative contracts currently outstanding mature. As of May 31, 2025, the maximum term over which the Company hedges exposures to the variability of cash flows for its forecasted transactions was \n30\n months.\nFAIR VALUE HEDGES\nThe Company is exposed to the risk of changes in the fair value of certain fixed-rate debt attributable to changes in interest rates. Derivatives used by the Company to hedge this risk are receive-fixed, pay-variable interest rate swaps which are designated as fair value hedges of the related long-term debt. Changes in the fair values of the interest rate swaps are recorded in Long-term debt or Current portion of long-term debt.\n The total notional amount of outstanding interest rate swaps designated as fair value hedges was $\n2.4\n billion and $\n1.8\n billion as of May 31, 2025 and 2024, respectively.\nUNDESIGNATED DERIVATIVE INSTRUMENTS\nThe Company may elect to enter into foreign exchange forwards to mitigate the change in fair value of specific assets and liabilities on the Consolidated Balance Sheets. These undesignated instruments are recorded at fair value as a derivative asset or liability on the Consolidated Balance Sheets with their corresponding change in fair value recognized in Other (income) expense, net, together with the remeasurement gain or loss from the hedged balance sheet position.\n The total notional amount of outstanding undesignated derivative instruments was $\n4.0\n billion and $\n4.4\n billion as of May 31, 2025 and 2024, respectively.\nCREDIT RISK\nThe Company is exposed to credit-related losses in the event of nonperformance by counterparties to hedging instruments. The counterparties to all derivative transactions are major financial institutions with investment grade credit ratings; however, this does not eliminate the Company's exposure to credit risk with these institutions. This credit risk is limited to the unrealized gains in such contracts should any of these counterparties fail to perform as contracted. To manage this risk, the Company has established strict counterparty credit guidelines that are continually monitored.\nThe Company's derivative contracts contain credit risk-related contingent features designed to protect against significant deterioration in counterparties' creditworthiness and their ultimate ability to settle outstanding derivative contracts in the normal course of business. The Company's bilateral credit-related contingent features generally require the owing entity, either the Company or the derivative counterparty, to post collateral for the fair value of outstanding derivatives per counterparty. For certain counterparties, collateral would only be posted for the fair value of outstanding derivatives per counterparty greater than $\n50\n million. Additionally, for those counterparties, a certain level of decline in credit rating of either the Company or the counterparty could trigger collateral requirements.\n As of May 31, 2025, the Company was in compliance with all credit risk-related contingent features. The Company considers the impact of the risk of counterparty default to be immaterial.\nFor additional information related to the Company's derivative financial instruments and collateral, refer to Note 4 — Fair Value Measurements.\n2025 FORM 10-K       \n80\nTable of Contents\nNOTE 13 — ACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe changes in Accumulated other comprehensive income (loss), net of tax, were as follows:\n(Dollars in millions)\nFOREIGN CURRENCY TRANSLATION ADJUSTMENT\n(1)\nCASH FLOW HEDGES\nNET INVESTMENT HEDGES\n(1)\nOTHER\nTOTAL\nBalance at May 31, 2024\n$\n(\n256\n)\n$\n247\n \n$\n115\n \n$\n(\n53\n)\n$\n53\n \nOther comprehensive income (loss):\nOther comprehensive gains (losses) before reclassifications\n142\n \n(\n132\n)\n—\n \n(\n5\n)\n5\n \nReclassifications to net income of previously deferred (gains) losses\n(2)\n—\n \n(\n322\n)\n—\n \n6\n(\n316\n)\nTotal other comprehensive income (loss)\n142\n \n(\n454\n)\n—\n \n1\n \n(\n311\n)\nBalance at May 31, 2025\n$\n(\n114\n)\n$\n(\n207\n)\n$\n115\n \n$\n(\n52\n)\n$\n(\n258\n)\n(1)\nThe accumulated foreign currency translation adjustment and net investment hedge gains/losses related to an investment in a foreign subsidiary are reclassified to Net income upon sale or upon complete or substantially complete liquidation of the respective entity.\n(2)\nReclassifications to net income of previously deferred (gains) losses are recorded within Other (income) expense, net for foreign currency translation adjustment, net investment hedges, and other.\n(Dollars in millions)\nFOREIGN CURRENCY TRANSLATION ADJUSTMENT\n(1)\nCASH FLOW HEDGES\nNET INVESTMENT HEDGES\n(1)\nOTHER\nTOTAL\nBalance at May 31, 2023\n$\n(\n253\n)\n$\n431\n \n$\n115\n \n$\n(\n62\n)\n$\n231\n \nOther comprehensive income (loss):\nOther comprehensive gains (losses) before reclassifications\n(\n4\n)\n239\n \n—\n \n15\n \n250\n \nReclassifications to net income of previously deferred (gains) losses\n(2)\n1\n \n(\n423\n)\n—\n \n(\n6\n)\n(\n428\n)\nTotal other comprehensive income (loss)\n(\n3\n)\n(\n184\n)\n—\n \n9\n \n(\n178\n)\nBalance at May 31, 2024\n$\n(\n256\n)\n$\n247\n \n$\n115\n \n$\n(\n53\n)\n$\n53\n \n(1)\nThe accumulated foreign currency translation adjustment and net investment hedge gains/losses related to an investment in a foreign subsidiary are reclassified to Net income upon sale or upon complete or substantially complete liquidation of the respective entity.\n(2)\nReclassifications to net income of previously deferred (gains) losses are recorded within Other (income) expense, net for foreign currency translation adjustment, net investment hedges, and other.\nFor additional information related to the Company's cash flow hedges refer to Note 12 — Risk Management and Derivatives.\n2025 FORM 10-K   \n81\n \nTable of Contents\nNOTE 14 — REVENUES\nDISAGGREGATION OF REVENUES\nThe following tables present the Company's Revenues disaggregated by reportable operating segment, major product line and distribution channel:\nYEAR ENDED MAY 31, 2025\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues by:\nFootwear\n$\n12,684\n \n$\n7,569\n \n$\n4,805\n \n$\n4,452\n \n$\n— \n$\n29,510\n \n$\n1,457\n \n$\n— \n$\n30,967\n \nApparel\n5,837\n \n3,971\n \n1,616\n \n1,541\n \n— \n12,965\n \n80\n \n— \n13,045\n \nEquipment\n1,051\n \n717\n \n165\n \n258\n \n— \n2,191\n \n32\n \n— \n2,223\n \nOther\n—\n \n—\n \n—\n \n—\n \n48\n \n48\n \n123\n \n(\n97\n)\n74\n \nTOTAL REVENUES\n$\n19,572\n \n$\n12,257\n \n$\n6,586\n \n$\n6,251\n \n$\n48\n \n$\n44,714\n \n$\n1,692\n \n$\n(\n97\n)\n$\n46,309\n \nRevenues by:\nSales to Wholesale Customers\n$\n10,484\n \n$\n8,022\n \n$\n3,699\n \n$\n3,678\n \n$\n— \n$\n25,883\n \n$\n875\n \n$\n— \n$\n26,758\n \nSales through Direct to Consumer\n9,088\n \n4,235\n \n2,887\n \n2,573\n \n— \n18,783\n \n694\n \n— \n19,477\n \nOther\n—\n \n—\n \n—\n \n—\n \n48\n \n48\n \n123\n \n(\n97\n)\n74\n \nTOTAL REVENUES\n$\n19,572\n \n$\n12,257\n \n$\n6,586\n \n$\n6,251\n \n$\n48\n \n$\n44,714\n \n$\n1,692\n \n$\n(\n97\n)\n$\n46,309\n \nYEAR ENDED MAY 31, 2024\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues by:\nFootwear\n$\n14,537\n \n$\n8,473\n \n$\n5,552\n \n$\n4,865\n \n$\n— \n$\n33,427\n \n$\n1,800\n \n$\n— \n$\n35,227\n \nApparel\n5,953\n \n4,380\n \n1,828\n \n1,614\n \n— \n13,775\n \n93\n \n— \n13,868\n \nEquipment\n906\n \n754\n \n165\n \n250\n \n— \n2,075\n \n37\n \n— \n2,112\n \nOther\n—\n \n—\n \n—\n \n—\n \n45\n \n45\n \n152\n \n(\n42\n)\n155\n \nTOTAL REVENUES\n$\n21,396\n \n$\n13,607\n \n$\n7,545\n \n$\n6,729\n \n$\n45\n \n$\n49,322\n \n$\n2,082\n \n$\n(\n42\n)\n$\n51,362\n \nRevenues by:\nSales to Wholesale Customers\n$\n11,004\n \n$\n8,562\n \n$\n4,262\n \n$\n3,930\n \n$\n— \n$\n27,758\n \n$\n1,098\n \n$\n— \n$\n28,856\n \nSales through Direct to Consumer\n10,392\n \n5,045\n \n3,283\n \n2,799\n \n— \n21,519\n \n832\n \n— \n22,351\n \nOther\n—\n \n—\n \n—\n \n—\n \n45\n \n45\n \n152\n \n(\n42\n)\n155\n \nTOTAL REVENUES\n$\n21,396\n \n$\n13,607\n \n$\n7,545\n \n$\n6,729\n \n$\n45\n \n$\n49,322\n \n$\n2,082\n \n$\n(\n42\n)\n$\n51,362\n \n2025 FORM 10-K       \n82\nTable of Contents\nYEAR ENDED MAY 31, 2023\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues by:\nFootwear\n$\n14,897\n \n$\n8,260\n \n$\n5,435\n \n$\n4,543\n \n$\n— \n$\n33,135\n \n$\n2,155\n \n$\n— \n$\n35,290\n \nApparel\n5,947\n \n4,566\n \n1,666\n \n1,664\n \n— \n13,843\n \n90\n \n— \n13,933\n \nEquipment\n764\n \n592\n \n147\n \n224\n \n— \n1,727\n \n28\n \n— \n1,755\n \nOther\n—\n \n—\n \n—\n \n—\n \n58\n \n58\n \n154\n \n27\n \n239\n \nTOTAL REVENUES\n$\n21,608\n \n$\n13,418\n \n$\n7,248\n \n$\n6,431\n \n$\n58\n \n$\n48,763\n \n$\n2,427\n \n$\n27\n \n$\n51,217\n \nRevenues by:\nSales to Wholesale Customers\n$\n11,273\n \n$\n8,522\n \n$\n3,866\n \n$\n3,736\n \n$\n— \n$\n27,397\n \n$\n1,299\n \n$\n— \n$\n28,696\n \nSales through Direct to Consumer\n10,335\n \n4,896\n \n3,382\n \n2,695\n \n— \n21,308\n \n974\n \n— \n22,282\n \nOther\n—\n \n—\n \n—\n \n—\n \n58\n \n58\n \n154\n \n27\n \n239\n \nTOTAL REVENUES\n$\n21,608\n \n$\n13,418\n \n$\n7,248\n \n$\n6,431\n \n$\n58\n \n$\n48,763\n \n$\n2,427\n \n$\n27\n \n$\n51,217\n \nGlobal Brand Divisions revenues included NIKE Brand licensing and other miscellaneous revenues that are not part of a geographic operating segment. Converse Other revenues were primarily attributable to licensing businesses. Corporate revenues primarily consisted of foreign currency hedge gains and losses related to revenues generated by entities within the NIKE Brand geographic operating segments and Converse but managed through the Company's central foreign exchange risk management program.\nAs of May 31, 2025 and 2024, the Company did not have any contract assets and had an immaterial amount of contract liabilities recorded in Accrued liabilities on the Consolidated Balance Sheets.\nSALES-RELATED RESERVES\nAs of May 31, 2025 and 2024, the Company's sales-related reserve balance, which includes returns, post-invoice sales discounts and claims, was $\n1,834\n million and $\n1,282\n million, respectively, recorded in Accrued liabilities on the Consolidated Balance Sheets. As of May 31, 2025 and 2024, the Company's sales returns reserve balance, included within sales-related reserves, was $\n1,277\n million and $\n799\n million, respectively. The related estimated cost of inventory for expected product returns was $\n528\n million and $\n331\n million as of May 31, 2025 and 2024, respectively, and was recorded in Prepaid expenses and other current assets on the Consolidated Balance Sheets.\n2025 FORM 10-K   \n83\n \nTable of Contents\nNOTE 15 — SEGMENT INFORMATION\nThe Company's reportable operating segments reflect the structure of the Company's internal organization and the financial information the Chief Operating Decision Maker (\"CODM\"), the Company's Chief Executive Officer, regularly reviews to assess Company performance and allocate resources. The CODM evaluates the performance of the Company's segments and allocates resources based on earnings before interest and taxes (\"EBIT\"), which represents Net income before Interest expense (income), net and Income tax expense in the Consolidated Statements of Income.\nThe Company's segments are defined as follows:\nNIKE BRAND\n \nThe NIKE Brand reportable segments are: North America; Europe, Middle East & Africa (\"EMEA\"); Greater China; and Asia Pacific & Latin America (\"APLA\"), and include results for the NIKE and Jordan brands. Each NIKE Brand segment represents a geographic region operating predominantly in one industry: the design, development, marketing and selling of athletic footwear, apparel and equipment.\nGlobal Brand Divisions is included within the NIKE Brand for presentation purposes to align with the way management views the Company. Global Brand Divisions revenues include NIKE Brand licensing and other miscellaneous revenues that are not part of a geographic operating segment. Global Brand Divisions primarily represents costs, including product creation and design expenses, that are centrally managed for the NIKE Brand, as well as costs associated with NIKE Direct global digital operations and enterprise technology. \nCONVERSE\n \nConverse operates in one industry: the design, marketing, licensing and selling of casual sneakers, apparel and accessories.\nCORPORATE\nCorporate consists primarily of unallocated general and administrative expenses, including expenses associated with centrally managed departments; depreciation and amortization related to the Company's headquarters; unallocated insurance, benefit and compensation programs, including stock-based compensation; and certain foreign currency gains and losses, including certain hedge gains and losses.\nAs part of the Company's centrally managed foreign exchange risk management program, standard foreign currency rates are assigned twice per year to each NIKE Brand entity in the Company's geographic segments and to Converse. Inventories and Cost of sales for geographic segments and Converse reflect the use of these standard rates to recognize non-functional currency product purchases in the entity's functional currency. Differences between these standard rates and actual market rates are included in Corporate, together with foreign currency hedge gains and losses and other conversion gains and losses.\n2025 FORM 10-K       \n84\nTable of Contents\nYEAR ENDED MAY 31, 2025\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues\n$\n19,572\n \n$\n12,257\n \n$\n6,586\n \n$\n6,251\n \n$\n48\n \n$\n44,714\n \n$\n1,692\n \n$\n(\n97\n)\n$\n46,309\n \nCost of Sales\n11,056\n \n6,967\n \n3,558\n \n3,502\n \n634\n \n25,717\n \n868\n \n(\n66\n)\n26,519\n \nGross profit\n8,516\n \n5,290\n \n3,028\n \n2,749\n \n(\n586\n)\n18,997\n \n824\n \n(\n31\n)\n19,790\n \nDemand creation expense\n1,633\n \n1,222\n \n529\n \n421\n \n716\n \n4,521\n \n156\n \n12\n \n4,689\n \nOperating overhead expense\n2,150\n \n1,479\n \n973\n \n804\n \n3,401\n \n8,807\n \n430\n \n2,162\n \n11,399\n \nTotal selling and administrative expense\n3,783\n \n2,701\n \n1,502\n \n1,225\n \n4,117\n \n13,328\n \n586\n \n2,174\n \n16,088\n \nOther segment items\n(1)\n(\n2\n)\n14\n \n(\n76\n)\n(\n3\n)\n(\n4\n)\n(\n71\n)\n(\n2\n)\n(\n3\n)\n(\n76\n)\nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n$\n4,735\n \n$\n2,575\n \n$\n1,602\n \n$\n1,527\n \n$\n(\n4,699\n)\n$\n5,740\n \n$\n240\n \n$\n(\n2,202\n)\nInterest expense (income), net\n(\n107\n)\nTOTAL NIKE, INC. INCOME BEFORE INCOME TAXES \n$\n3,885\n \nSupplemental information: \n  Depreciation and amortization\n(2)\n$\n157\n \n143\n \n49\n \n50\n \n237\n \n636\n \n14\n \n125\n \n$\n775\n \n  Inventories\n$\n3,198\n \n2,042\n \n951\n \n905\n \n148\n \n7,244\n \n272\n \n(\n27\n)\n$\n7,489\n \n(1)\nAt the NIKE Brand segments and Converse, other segment items consist of unusual or non-operating transactions that occur outside the normal course of business. At Corporate, this also includes foreign currency conversion gains and losses from the remeasurement of monetary assets and liabilities denominated in non-functional currencies and the impact of certain foreign currency derivative instruments.\n(2)\nThe amounts of depreciation and amortization disclosed by segment are included within Cost of sales and Operating overhead expense, as applicable.\nYEAR ENDED MAY 31, 2024\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues\n$\n21,396\n \n$\n13,607\n \n$\n7,545\n \n$\n6,729\n \n$\n45\n \n$\n49,322\n \n$\n2,082\n \n$\n(\n42\n)\n$\n51,362\n \nCost of Sales\n11,899\n \n7,589\n \n3,761\n \n3,639\n \n602\n \n27,490\n \n989\n \n(\n4\n)\n28,475\n \nGross profit\n9,497\n \n6,018\n \n3,784\n \n3,090\n \n(\n557\n)\n21,832\n \n1,093\n \n(\n38\n)\n22,887\n \nDemand creation expense\n1,495\n \n1,114\n \n519\n \n407\n \n596\n \n4,131\n \n140\n \n14\n \n4,285\n \nOperating overhead expense\n2,189\n \n1,517\n \n1,019\n \n801\n \n3,534\n \n9,060\n \n485\n \n2,746\n \n12,291\n \nTotal selling and administrative expense\n3,684\n \n2,631\n \n1,538\n \n1,208\n \n4,130\n \n13,191\n \n625\n \n2,760\n \n16,576\n \nOther segment items\n(1)\n(\n9\n)\n(\n1\n)\n(\n63\n)\n(\n3\n)\n33\n \n(\n43\n)\n(\n6\n)\n(\n179\n)\n(\n228\n)\nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n$\n5,822\n \n$\n3,388\n \n$\n2,309\n \n$\n1,885\n \n$\n(\n4,720\n)\n$\n8,684\n \n$\n474\n \n$\n(\n2,619\n)\nInterest expense (income), net\n(\n161\n)\nTOTAL NIKE, INC. INCOME BEFORE INCOME TAXES \n$\n6,700\n \nSupplemental information: \n  Depreciation and amortization\n(2)\n$\n152\n \n146\n \n56\n \n51\n \n236\n \n641\n \n17\n \n138\n \n$\n796\n \n  Inventories\n$\n3,134\n \n2,028\n \n1,070\n \n810\n \n166\n \n7,208\n \n296\n \n15\n \n$\n7,519\n \n(1)\nAt the NIKE Brand segments and Converse, other segment items consist of unusual or non-operating transactions that occur outside the normal course of business. At Corporate, this also includes foreign currency conversion gains and losses from the remeasurement of monetary assets and liabilities denominated in non-functional currencies and the impact of certain foreign currency derivative instruments.\n(2)\nThe amounts of depreciation and amortization disclosed by segment are included within Cost of sales and Operating overhead expense, as applicable.\n2025 FORM 10-K   \n85\n \nTable of Contents\nYEAR ENDED MAY 31, 2023\n(Dollars in millions)\nNORTH AMERICA\nEUROPE, MIDDLE EAST & AFRICA\nGREATER CHINA\nASIA PACIFIC & LATIN AMERICA\nGLOBAL BRAND DIVISIONS\nTOTAL NIKE BRAND\nCONVERSE\nCORPORATE\nTOTAL NIKE, INC.\nRevenues\n$\n21,608\n \n$\n13,418\n \n$\n7,248\n \n$\n6,431\n \n$\n58\n \n$\n48,763\n \n$\n2,427\n \n$\n27\n \n$\n51,217\n \nCost of Sales\n12,497\n \n7,340\n \n3,552\n \n3,337\n \n516\n \n27,242\n \n1,121\n \n562\n \n28,925\n \nGross profit\n9,111\n \n6,078\n \n3,696\n \n3,094\n \n(\n458\n)\n21,521\n \n1,306\n \n(\n535\n)\n22,292\n \nDemand creation expense\n1,455\n \n1,050\n \n499\n \n373\n \n511\n \n3,888\n \n138\n \n34\n \n4,060\n \nOperating overhead expense\n2,207\n \n1,500\n \n1,012\n \n789\n \n3,881\n \n9,389\n \n499\n \n2,429\n \n12,317\n \nTotal selling and administrative expense\n3,662\n \n2,550\n \n1,511\n \n1,162\n \n4,392\n \n13,277\n \n637\n \n2,463\n \n16,377\n \nOther segment items\n(1)\n(\n5\n)\n(\n3\n)\n(\n98\n)\n—\n \n(\n9\n)\n(\n115\n)\n(\n7\n)\n(\n158\n)\n(\n280\n)\nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n$\n5,454\n \n$\n3,531\n \n$\n2,283\n \n$\n1,932\n \n$\n(\n4,841\n)\n$\n8,359\n \n$\n676\n \n$\n(\n2,840\n)\nInterest expense (income), net\n(\n6\n)\nTOTAL NIKE, INC. INCOME BEFORE INCOME TAXES \n$\n6,201\n \nSupplemental information: \n  Depreciation and amortization\n(2)\n$\n128\n \n120\n \n54\n \n42\n \n211\n \n555\n \n17\n \n131\n \n$\n703\n \n  Inventories\n$\n3,806\n \n2,167\n \n973\n \n894\n \n232\n \n8,072\n \n305\n \n77\n \n$\n8,454\n \n(1)\nAt the NIKE Brand segments and Converse, other segment items consist of unusual or non-operating transactions that occur outside the normal course of business. At Corporate, this also includes foreign currency conversion gains and losses from the remeasurement of monetary assets and liabilities denominated in non-functional currencies and the impact of certain foreign currency derivative instruments.\n(2)\nThe amounts of depreciation and amortization by segment are included within Cost of sales and Operating overhead expense, as applicable.\nREVENUES AND LONG-LIVED ASSETS BY GEOGRAPHIC AREA\nAfter allocation of revenues for Global Brand Divisions, Converse and Corporate to geographical areas based on the location where the sales originated, revenues by geographical area are similar to that as reported above for the NIKE Brand operating segments with the exception of the United States. Revenues derived in the United States were $\n19,725\n million, $\n21,551\n million and $\n22,007\n million for the fiscal years ended May 31, 2025, 2024 and 2023, respectively. \nThe Company's largest concentrations of long-lived assets primarily consist of the Company's corporate headquarters, retail locations and distribution facilities in the United States, China and the United Kingdom, as well as distribution facilities in Belgium. \nLong-lived assets attributable to operations in these countries, which consist of property, plant and equipment, net and operating lease ROU assets, net, were as follows:\nMAY 31,\n(Dollars in millions)\n2025\n2024\nUnited States\n$\n4,467\n \n$\n4,837\n \nBelgium\n774\n \n757\n \nChina\n488\n \n501\n \nUnited Kingdom\n422\n \n324\n \nOther\n1,389\n \n1,299\n \nTOTAL LONG-LIVED ASSETS\n$\n7,540\n \n$\n7,718\n \n2025 FORM 10-K       \n86\nTable of Contents\nNOTE 16 — COMMITMENTS AND CONTINGENCIES\nAs of May 31, 2025 and 2024, the Company had bank guarantees and letters of credit outstanding totaling $\n884\n million and $\n768\n million, respectively, issued primarily for real estate agreements, self-insurance programs, other general business obligations and legal matters.\nIn connection with various contracts and agreements, the Company provides routine indemnification relating to the enforceability of intellectual property rights, coverage for legal issues that arise and other items where the Company is acting as the guarantor. Currently, the Company has several such agreements in place. However, based on the Company's historical experience and the estimated probability of future loss, the Company has determined the fair value of such indemnification is not material to the Company's financial position or results of operations.\nIn the ordinary course of business, the Company is subject to various legal proceedings, claims and government investigations relating to its business, products and actions of its employees and representatives, including contractual and employment relationships, product liability, antitrust, customs, tax, intellectual property and other matters. The outcome of these legal matters is inherently uncertain, and the Company cannot predict the eventual outcome of currently pending matters, the timing of their ultimate resolution or the eventual losses, fines, penalties or consequences relating to those matters. When a loss related to a legal proceeding or claim is probable and reasonably estimable, the Company accrues its best estimate for the ultimate resolution of the matter. If one or more legal matters were to be resolved against the Company in a reporting period for amounts above management's expectations, the Company's financial position, operating results and cash flows for that reporting period could be materially adversely affected. In the opinion of management, based on its current knowledge and after consultation with counsel, the Company does not believe any currently pending legal matters will have a material adverse impact on the Company's results of operations, financial position or cash flows, except as described below.\nBELGIAN CUSTOMS CLAIM\nThe Company has received claims for certain years from Belgian Customs for alleged underpaid duties related to products imported beginning in fiscal 2018. The Company disputes these claims and has engaged in the appellate process. The Company has issued bank guarantees in order to appeal the claims. At this time, the Company is unable to estimate the range of loss and cannot predict the final outcome as it could take several years to reach a resolution on this matter. If this matter is ultimately resolved against the Company, the amounts owed, including fines, penalties and other consequences relating to the matter, could have a material adverse effect on the Company's results of operations, financial position and cash flows.\nNOTE 17 — LEASES\nLease expense is recognized in Cost of sales or Operating overhead expense within the Consolidated Statements of Income, based on the underlying nature of the leased asset. For the fiscal years ended May 31, 2025, 2024 and 2023, lease expense primarily consisted of operating lease costs of $\n663\n million, $\n618\n million and $\n585\n million, respectively, as well as $\n432\n million, $\n433\n million and $\n403\n million, respectively, primarily related to variable lease costs. As of and for the fiscal years ended May 31, 2025 and 2024 and 2023, finance leases were not a material component of the Company's lease portfolio.\nThe undiscounted cash flows for future maturities of the Company's operating lease liabilities and the reconciliation to the Operating lease liabilities recognized in the Company's Consolidated Balance Sheets are as follows:\n(Dollars in millions)\nAS OF MAY 31, 2025\n(1)\nFiscal 2026\n$\n565\n \nFiscal 2027\n575\n \nFiscal 2028\n487\n \nFiscal 2029\n437\n \nFiscal 2030\n389\n \nThereafter\n885\n \nTotal undiscounted future cash flows related to lease payments\n$\n3,338\n \nLess interest \n286\n \nPRESENT VALUE OF LEASE LIABILITIES\n$\n3,052\n \n(1)\nExcludes $\n482\n million as of May 31, 2025, of future operating lease payments for lease agreements signed but not yet commenced.\n \n2025 FORM 10-K   \n87\n \nTable of Contents\nThe following table includes supplemental information used to calculate the present value of Operating lease liabilities:\nAS OF MAY 31,\n2025\n2024\nWeighted-average remaining lease term (in years)\n6.6\n6.9\nWeighted-average discount rate\n3.1\n \n%\n2.9\n \n%\nThe following table includes supplemental cash and non-cash information related to operating leases:\nYEAR ENDED MAY 31,\n(Dollars in millions)\n2025\n2024\n2023\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n647\n \n$\n613\n \n$\n575\n \nOperating lease right-of-use assets obtained in exchange for new operating lease liabilities\n$\n607\n \n$\n458\n \n$\n602\n \nNOTE 18 — RESTRUCTURING\nDuring the third quarter of fiscal 2024, management streamlined the organization which resulted in a net reduction in the Company's global workforce. In fiscal 2024, the Company recognized pre-tax restructuring charges of $\n443\n million, primarily associated with $\n392\n million related to employee severance costs and $\n51\n million related to accelerated stock-based compensation expense. Of the $\n443\n million pre-tax restructuring charges, $\n379\n million was classified in \nOperating overhead expense\n and $\n64\n million was classified in \nCost of sales\n. The related cash payments during fiscal 2024 were $\n123\n million. As of May 31, 2024, restructuring charges of $\n267\n million were reflected within Accrued liabilities on the Consolidated Balance Sheets.\nAs of the second quarter of fiscal 2025, the fiscal 2024 restructuring was substantially complete and there was an immaterial amount of restructuring charges recognized in fiscal 2025. The Company made cash payments of $\n247\n million during fiscal 2025, and the remaining immaterial amounts are to be settled in fiscal 2026.\n \nNOTE 19 — SUPPLIER FINANCE PROGRAMS\nCertain financial institutions offer voluntary supplier finance programs facilitated through a third-party platform that provide participating suppliers the option to finance valid payment obligations from the Company. The Company is not a party to agreements negotiated between participating suppliers and third-party financial institutions. The Company's obligations to its suppliers, including amounts due and payment terms, are not affected by a supplier's decision to participate in these programs and the Company does not provide guarantees to third parties in connection with these programs. As of May 31, 2025 and May 31, 2024, the Company had $\n1,101\n million and $\n840\n million, respectively, of outstanding supplier obligations confirmed as valid under these programs. These amounts are included within \nAccounts payable\n on the Consolidated Balance Sheets. \n(Dollars in millions)\nConfirmed obligations outstanding as of May 31, 2024\n$\n840\n \nInvoices confirmed during the year\n11,741\n \nConfirmed invoices paid during the year\n(\n11,480\n)\nConfirmed obligations outstanding as of May 31, 2025\n$\n1,101\n \n2025 FORM 10-K       \n88\nTable of Contents\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere has been no change of accountants nor any disagreements with accountants on any matter of accounting principles or practices or financial statement disclosure required to be reported under this Item.\nITEM 9A. CONTROLS AND PROCEDURES\nWe maintain disclosure controls and procedures that are designed to provide reasonable assurance that information required to be disclosed in our Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), reports is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nWe carry out a variety of ongoing procedures, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, to evaluate the effectiveness of the design and operation of our disclosure controls and procedures. Based on the foregoing, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective at the reasonable assurance level as of May 31, 2025.\n\"Management's Annual Report on Internal Control Over Financial Reporting\" is included in Item 8 of this Annual Report.\nThere have not been any changes in our internal control over financial reporting during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\nRule 10b5-1 Trading Plans\nDuring the fiscal quarter ended May 31, 2025, none of our directors or officers (as defined in Rule 16a-1 under the Exchange Act) \nadopted\n or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or \"non-Rule 10b5-1 trading arrangement\" (as those terms are defined in Item 408 of Regulation S-K). \nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable. \n2025 FORM 10-K   \n89\n \nTable of Contents\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 401 of Regulation S-K regarding directors is included under \"Corporate Governance — NIKE, Inc. Board of Directors\" in the definitive Proxy Statement for our 2025 Annual Meeting of Shareholders and is incorporated herein by reference. The information required by Item 401 of Regulation S-K regarding executive officers is included under \"Information about our Executive Officers\" in Item 1 of this Annual Report. The information required by Item 406 of Regulation S-K is included under \"Corporate Governance — Code of Conduct\" in the definitive Proxy Statement for our 2025 Annual Meeting of Shareholders and is incorporated herein by reference. The information required by Items 407(d)(4) and (d)(5) of Regulation S-K regarding the Audit & Finance Committee of the Board of Directors is included under \"Corporate Governance — Board Structure and Responsibilities — Board Committees\" in the definitive Proxy Statement for our 2025 Annual Meeting of Shareholders and is incorporated herein by reference. The information required by Item 408(b)(1) of Regulation S-K regarding our \ninsider trading policies\n is included under \"Additional Information — Insider Trading Arrangements and Policies\" in the definitive Proxy Statement for our 2025 Annual Meeting of Shareholders and is incorporated herein by reference.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required by Items 402, 407(e)(4) and 407(e)(5) of Regulation S-K regarding executive compensation is included under \"Corporate Governance — Director Compensation for Fiscal 2025,\" \"Executive Compensation — Compensation Discussion and Analysis,\" \"Executive Compensation — Executive Compensation Tables,\" and \"Additional Information — Compensation Committee Interlocks and Insider Participation,\" in the definitive Proxy Statement for our 2025 Annual Meeting of Shareholders and is incorporated herein by reference.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by"
  }
}