{
  "ticker": "NOC",
  "cik": "0001133421",
  "company_name": "NORTHROP GRUMMAN CORP /DE/",
  "filing_date": "2025-01-30",
  "accession": "0001133421-25-000006",
  "primary_doc": "noc-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n100\nSignatures\n101\n \nii\nNORTHROP GRUMMAN CORPORATION\nPART I\nItem 1. Business\nHISTORY AND ORGANIZATION\nHistory\nNorthrop Grumman Corporation (herein referred to as “Northrop Grumman,” the “company,” “we,” “us,” or “our”) is a leading global aerospace and defense technology company. We deliver a broad range of products, services and solutions to U.S. and international customers, and principally to the U.S. Department of Defense (DoD) and intelligence community. Our broad portfolio is aligned to support national security priorities and our solutions equip our customers with capabilities they need to connect, protect and advance humanity.\nThe company is a leading provider of space systems, military aircraft, missile defense, advanced weapons and long-range fires capabilities, mission systems, networking and communications, strategic deterrence systems, and breakthrough technologies, such as advanced computing, microelectronics and cyber. We are focused on competing and winning programs that enable continued growth, performing on our commitments and affordably delivering capability our customers need. With the investments we've made in advanced technologies, combined with our talented workforce and digital transformation capabilities, Northrop Grumman is well positioned to meet our customers' needs today and in the future. For a discussion of risks associated with our operations, see \n“\nRisk Factors.\n”\nThe company originally was formed in 1939 in Hawthorne, California as Northrop Aircraft Incorporated and was reincorporated in Delaware in 1985, as Northrop Corporation. Northrop Corporation was a principal developer of flying wing technology, including the B-2 Spirit stealth aircraft. We developed into one of the largest defense technology companies in the world through a series of acquisitions, as well as organic growth, including the following: \n•\n1994 - Acquired Grumman Corporation, a premier military aircraft systems integrator. The combined company was renamed Northrop Grumman Corporation;\n•\n1996 - Acquired the defense and electronics businesses of Westinghouse Electric Corporation, developer of sophisticated radar and other electronics systems;\n•\n2001 - Acquired Litton Industries, Inc., a global electronics and information technology company and full service shipbuilder; \n•\n2001 - Acquired Newport News Shipbuilding Inc., designer and builder of nuclear-powered aircraft carriers and submarines;\n•\n2002 - Acquired TRW Inc., developer of military and civil space systems and payloads, and integrator of complex, mission-enabling systems and services; \n•\n2011 - Completed the spin-off of Huntington Ingalls Industries, Inc., operator of our former shipbuilding business, comprised largely of a part of Litton Industries and Newport News Shipbuilding; \n•\n2018 - Acquired Orbital ATK, Inc. (OATK), developer and producer of satellites and other space systems, launch vehicles and missile products; and\n•\n2021 - Completed the sale of our IT and mission support services business (the “IT services divestiture”) to Veritas Capital.\nOrganization\nFrom time to time, we acquire or dispose of businesses and realign contracts, programs or businesses among and within our operating segments. Internal realignments are typically designed to leverage existing capabilities more fully and to enhance efficient development and delivery of products and services. At December 31, 2024, the company was aligned in four operating sectors, which also comprise our reportable segments: Aeronautics Systems, Defense Systems, Mission Systems and Space Systems.\nEffective July 1, 2024, the company realigned the Strategic Deterrent Systems (SDS) division, which includes the Ground-Based Strategic Deterrent (“Sentinel”) program, from Space Systems to Defense Systems. This realignment is reflected in the financial information contained in this report.\n-1-\nNORTHROP GRUMMAN CORPORATION\nSubsequent Realignment\n - Effective January 1, 2025, the company realigned the Strike and Surveillance Aircraft Solutions (SSAS) business unit from Defense Systems to Aeronautics Systems. This realignment is not reflected in the financial information contained in this report; it will be reflected in the company’s operating results beginning in the first quarter of 2025.\nAERONAUTICS SYSTEMS\nAeronautics Systems is a leader in the design, development, production, integration, sustainment and modernization of military aircraft systems for the U.S. Air Force, the U.S. Navy, other U.S. government agencies, and international customers. Major products include strategic long-range strike aircraft; tactical fighter and air dominance aircraft; airborne battle management and command and control systems; and unmanned autonomous aircraft systems, including high-altitude long-endurance (HALE) strategic intelligence, surveillance and reconnaissance (ISR) systems. Approximately 45 percent of this business is performed through restricted programs. Key programs include:\n•\nDevelopment and production of the U.S. Air Force B-21 Raider long-range strike aircraft that defines sixth-generation technologies;\n•\nModernization and sustainment services for the B-2 Spirit stealth aircraft;\n•\nFuselage production for the F-35 Lighting II Joint Strike Fighter and F/A-18 Super Hornet for use by U.S. and international forces;\n•\nE-2D Advanced Hawkeye battle management aircraft production for the U.S. Navy, Japan, and France; \n•\nMQ-4C Triton, which provides wide area strategic ISR over vast ocean and coastal regions for maritime domain awareness to the U.S. Navy and Australia;\n•\nRQ-4 Global Hawk, which provides high resolution imagery of land masses for theater awareness and strategic ISR to the U.S. Air Force, Japan, and the Republic of Korea; and \n•\nNorth Atlantic Treaty Organization (NATO) Alliance Ground Surveillance (AGS), a Global Hawk variant, for strategic ISR missions conducted in multinational theater operations.\nDEFENSE SYSTEMS\nDefense Systems is a leader in the design, engineering, development, integration and production of strategic deterrent systems, advanced tactical weapons, and missile defense solutions, and a provider of sustainment, modernization and training services for manned and unmanned aircraft and electronics systems for the U.S. military and a broad range of international customers. Major products and services include strategic missiles; integrated, all-domain command and control (C2) systems; precision strike weapons; advanced propulsion, including tactical solid rocket motors and high speed air-breathing and hypersonic systems; high-performance gun systems, ammunition, precision munitions and advanced fuzes; and aircraft and mission systems logistics support, sustainment, operations and modernization. Less than 5 percent of this business is performed through restricted programs. Key programs include:\n•\nSentinel Engineering & Manufacturing Development (EMD) program, initial phase of the modernization of the intercontinental ballistic missile (ICBM) system that will serve as the ground-based strategic deterrent for the U.S. nuclear triad;\n•\nIntegrated Battle Command System (IBCS) for the U.S. Army and Poland, which is an open architecture system that seamlessly integrates sensors and effectors to deliver among the most advanced C2 systems for joint and coalition forces;\n•\nMedium (30mm and 20mm) and Large (120mm) caliber tactical and training ammunition production;\n•\nGuided Multiple Launch Rocket System (GMLRS) propulsion and warhead subsystems for a surface-to-surface system used to defeat targets using indirect precision fires; \n•\nU.S. Navy’s Advanced Anti-Radiation Guided Missile (AARGM), a medium-range, air-to-surface missile, and its extended range variant, AARGM-ER; \n•\nU.S. Air Force’s Stand-In Attack Weapon (SiAW), an advanced capability air-to-surface tactical missile for the F-35;\n•\nHypersonic Attack Cruise Missile (HACM) air-breathing, scramjet propulsion subsystem for the hypersonic air-launched cruise missile to travel at speeds of Mach 5 or greater; \n-2-\nNORTHROP GRUMMAN CORPORATION\n•\nGlobal system sustainment and operations support for the F-35, B-2, P-3 Orion, E-6B Mercury, KC-30A multi-role tanker, C-27J transport, NATO AGS, Triton and restricted programs;\n•\nPrecision Guidance Kit (PGK), replaces conventional fuzes for artillery and mortar munitions and transforms them into Global Positioning System enabled precision guided weapons;\n•\nForward Area Air Defense Command and Control (FAAD C2), the Army’s long-standing program of record for short range air defense and Counter Rocket, Artillery and Mortar (C-RAM), as well as the interim C2 for Counter Unmanned Aircraft Systems (C-UAS);\n•\nAAQ-24 sensor sustainment and repair for U.S. military customers; and\n•\nSpecial Electronics Mission Aircraft (SEMA) ISR support.\nMISSION SYSTEMS\nMission Systems is a leader in advanced mission solutions and multifunction systems, primarily for the U.S. defense and intelligence community, and international customers. Major products and services include command, control, communications and computers, intelligence, surveillance and reconnaissance (C4ISR) systems; radar, electro-optical/infrared (EO/IR) and acoustic sensors; electronic warfare systems; advanced communications and network systems; advanced microelectronics; navigation and positioning sensors; maritime power, propulsion and payload launch systems; full spectrum cyber solutions; and intelligence processing systems. Approximately 30 percent of this business is performed through restricted programs. Key unrestricted programs include:\n•\nScalable Agile Beam Radar (SABR), an active electronically scanned array fire control radar system for F-16 aircraft; \n•\nF-35 fire control radar and Distributed Aperture System (DAS), which provides 360 degree field of view tracking, identifying, missile warning and night vision capabilities; \n•\nF-35 Communications, Navigation and Identification (CNI) integrated avionics system, which provides secure communications and interoperability capabilities;\n•\nGround/Air Task Oriented Radar (G/ATOR), a mobile multi-mode active electronically scanned array; \n•\nSurface Electronic Warfare Improvement Program (SEWIP) Block III, which protects surface ships from anti-ship missiles, provides early detection, signal analysis and threat warning;\n•\nAirborne Early Warning & Control (AEW&C). The centerpiece of the E-7 AEW&C aircraft is the Multi-role Electronically Scanned Array (MESA) radar which enables 360 degree long range advanced air moving target indicator (AMTI) capabilities for Battle Management, Command and Control, and Maritime Surveillance;\n•\nLarge Aircraft and Common Infrared Countermeasures (LAIRCM, DoN LAIRCM, CIRCM) systems, which protect large aircraft as well as rotary wing and medium fixed wing aircraft from infrared missiles using advanced laser technology; \n•\nBattlefield Airborne Communications Node (BACN), one of the first airborne gateway systems that allows platforms to communicate and securely share data; \n•\nDDG Modernization, which is comprised of several subsystems to support modernization of Arleigh Burke-class guided missile destroyers including Integrated Bridge and Navigation Systems (IBNS) and ship control systems;\n•\nLITENING Advanced Targeting Pod, an electro-optical infrared sensor system for targeting and surveillance that enables aircrews to detect, acquire, identify and track targets at long ranges; \n•\nAPR-39 DV(2) and EV(2) Radar Warning Receiver programs, which provide a digital radar warning receiver for the U.S. Army, Navy and Marines; \n•\nExploitation and cyber programs, which provide cyber and intelligence domain support through unique intelligence and cyber capabilities; \n•\nAC/MC 130J Radio Frequency Countermeasures system, which provides superior situational awareness and better enables aircraft survivability in operationally relevant environments; and \n•\nEmbedded Global Positioning System (GPS) / Inertial Navigation Systems-Modernization (EGI-M) program, which provides state-of-the-art airborne navigation capabilities with an open architecture that enables rapid responses to future threats.\n-3-\nNORTHROP GRUMMAN CORPORATION\nSPACE SYSTEMS\nSpace Systems is a leader in delivering end-to-end mission solutions through the design, development, integration, production and operation of space, missile defense, and launch systems for national security, civil government, commercial and international customers. Major products include satellites and spacecraft systems, subsystems, sensors and payloads; ground systems; missile defense systems and interceptors; and launch vehicles and related propulsion systems. Approximately 40 percent of this business is performed through restricted programs. Key unrestricted programs include: \n•\nEvolved Strategic SATCOM (ESS) satellites and payloads providing assured, no-fail, and survivable Nuclear Command and Control (NC3) communications capabilities;\n•\nNext-Generation Overhead Persistent Infrared (Next-Gen OPIR) program satellites and payloads providing resilient and enhanced missile warning over the critical northern polar region;\n•\nSpace Development Agency Tracking and Transport layers providing missile warning/tracking and resilient, low-latency, high-volume data transport communication systems;\n•\nMissile defense systems, interceptors, targets, mission processing and boosters for the Missile Defense Agency's (MDA) Ground-based Midcourse Defense Weapon Systems (GWS);\n•\nCygnus spacecraft, used in the execution of our Commercial Resupply Services (CRS) contracts with NASA to resupply and re-boost the International Space Station;\n•\nDevelopment and production of solid rocket motors for NASA’s Space Launch System (SLS) heavy lift vehicle;\n•\nHabitation and Logistics Outpost (HALO) module in support of NASA’s Lunar Gateway;\n•\n63-inch diameter Graphite Epoxy Motor (GEM 63) and the extended length variation (GEM 63XL) solid rocket boosters used to provide lift capability for the ATLAS V and Vulcan launch vehicles;\n•\nMedium-class solid rocket motors for the U.S. Navy's Trident II Fleet Ballistic Missile program;\n•\nGlide Phase Interceptor (GPI) Cooperative Development producing interceptor capability to defeat hypersonic threats;\n•\nProtected Tactical SATCOM (PTS) satellites and payloads providing resilient, protected tactical communications to U.S. forces; and\n•\nArctic Satellite Broadband Mission (ASBM) satellites and payloads expanding both commercial as well as military broadband communications for an international partner.\nCUSTOMER CONCENTRATION\nOur largest customer is the U.S. government. Sales to the U.S. government accounted for 87 percent, 86 percent and 86 percent of sales during the years ended December 31, 2024, 2023 and 2022, respectively. For further information on sales by customer type, contract type and geographic region, see Note 15 to the consolidated financial statements. See “Risk Factors” for further discussion regarding risks related to customer concentration.\nCOMPETITIVE CONDITIONS\nWe compete with many companies in the defense, intelligence and federal civil markets. The Boeing Company, General Dynamics, L3Harris Technologies, Lockheed Martin, and RTX are some of our primary competitors. Key characteristics of our industry include long operating cycles and intense competition, which is evident through the number of competitors bidding on program opportunities and the number of competitor protests of U.S. government procurement awards.\nIt is common in the defense industry for work on major programs to be shared among a number of companies. A company competing to be a prime contractor may, upon ultimate award of the contract to another competitor, serve as a subcontractor to the ultimate prime contracting company. It is not unusual to compete for a contract award with a peer company and, simultaneously, perform as a supplier to or a customer of that same competitor on other contracts, or vice versa.\nSEASONALITY\nNo material portion of our business is seasonal.\n-4-\nNORTHROP GRUMMAN CORPORATION\nBACKLOG\nAt December 31, 2024, total backlog, which is equivalent to the company’s remaining performance obligations, was $91.5 billion as compared with $84.2 billion at December 31, 2023. For further information, see “Backlog” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” (MD&A) and Note 1 to the consolidated financial statements.\nINTELLECTUAL PROPERTY\nWe protect our technological innovations using a combination of trade secrets, patents, trademarks, and copyrights. We routinely apply for patents related to the technologies we develop in the U.S. and in certain foreign jurisdictions. We license some intellectual property rights to third parties and we also license or otherwise obtain access to intellectual property from third parties. The U.S. government typically holds licenses to patents developed in the performance of U.S. government contracts and may use or authorize others to use the inventions covered by these patents for certain purposes. See “Risk Factors” for further discussion regarding risks related to intellectual property.\nRAW MATERIALS\nWe have experienced challenges with access to certain raw materials due to macroeconomic factors and several global events such as inflation, geopolitical conflicts and microelectronics shortages. In some cases, these challenges have significantly increased the cost and/or lead time required to obtain certain raw materials. Nonetheless, these challenges have not, to date, materially impacted our ability to perform on our contracts. See “Risk Factors” for further discussion regarding risks related to raw materials.\nHUMAN CAPITAL\nUnderpinned by our values and culture, we hire, promote, and pay based on merit and performance to ensure we have the best team to deliver for our customers. Our focus on technology, innovation and career growth enables us to attract qualified talent, particularly those with security clearances and requisite skills in multiple areas, including science, technology, engineering and math. Our differentiated culture and workforce was a factor in our ability to hire approximately 7,400 new employees in 2024, and as of December 31, 2024, we have approximately 97,000 employees. \nOur Values and Culture\nOur values reflect our priorities and form the bedrock of our culture: \n•\nWe do the right thing – we earn trust, act with ethics, integrity and transparency, treat everyone with respect, value diverse perspectives and foster safe and inclusive environments.\n•\nWe do what we promise – we own the delivery of results, focused on quality.\n•\nWe commit to shared success – we work together to focus on the mission and take accountability for the sustainable success of our people, customers, shareholders, suppliers and communities. \n•\nWe pioneer – with fierce curiosity, dedication and innovation, we seek to solve the world’s most challenging problems.\nAmong other programs through which the company lives its values, the company maintains a Standards of Business Conduct program through which our employees are empowered to raise concerns through multiple channels without fear of reprisal. In addition to full-time ethics professionals, we also have over 150 business conduct advisors who promote values and an ethical culture within the company. Additionally, our annual Employee Experience Survey gives employees a voice and a mechanism to provide feedback on our culture and empower our leaders to enhance the employee experience. This anonymous survey encourages employee candor on key engagement and inclusion drivers, including belonging, respect, a sense of personal work accomplishment and recommending the company to others. In 2024, 80 percent of employees responded to the survey, an indication that our employees believe their feedback matters. Our performance on the annual survey is compared to the Qualtrics Global Benchmark and our survey results exceeded many of their global norms for both engagement and inclusion. Our leaders review the survey responses and work collaboratively with their teams to take meaningful actions based on survey results.\nOur culture and values serve as an enabling force that helps us pioneer, perform and deliver on quality, which results in value for our shareholders, customers, and employees. We actively seek candidates for employment from a wide range of backgrounds and experiences to tap into the full spectrum of talent available now and in the future to create a culture of belonging for everyone. \n-5-\nNORTHROP GRUMMAN CORPORATION\nTalent Management \nNorthrop Grumman’s talent strategy is focused on four key pillars: broadening talent pools; enhancing the employee experience; building leaders of the future; and fostering employee growth. Our strategy addresses the external and internal landscape and ensures that we can attract, retain and develop the workforce necessary to support the continued success of the business.\nWe hold regular talent review discussions to ensure line of sight to talent at various levels of the organization. We refresh and review succession plans to ensure a robust pipeline of talent and business continuity with a tight linkage to development. We focus on accelerating learning and development of our leaders by providing a combination of experiences, exposure and education.\nOur employee development programs strengthen employee skills aligned to our current and future business needs through on-the-job development, knowledge sharing and tools to support career growth. Employees utilize curated, career-specific resources such as My Learning Experience, a machine learning enabled content aggregator that creates a personalized learning experience for each employee. Our Education Assistance Program subsidizes tuition and other educational institution fees to support development through job-related degrees and certificates. Our early-in-career rotation program, Pathways, develops talent pipelines with both depth of critical skills and breadth of experiences. Our technical cohort programs cultivate technical, domain expertise and collaborative thought leadership for early through advanced career levels.\nIn a rapidly changing world, we maintain focus on keeping our team and our company prepared for the evolving future of work. In addition to offering our employees flexible work arrangements, caregiver support and mental health services that help our employees make their careers work within their lives, we also help our employees build the careers that will serve them into the future. We ensure that our employees have the tools and resources to develop their knowledge base and skill sets, so they can continue to thrive at Northrop Grumman even in the midst of change. When our employees succeed and grow at work, our business succeeds and grows. Through a focus on our employees, we remain agile and innovative, adapting to the future as it unfolds before us. \nEmployee Health and Safety\nHealth and safety are foundational to our success. People are our most valuable resource and we prioritize occupational health and safety to position the company for long-term success.\nTraining and risk and hazard identification, mitigation and prevention are key components of Northrop Grumman’s safety program. Everyone has a responsibility to identify workplace hazards, and employees may raise concerns without fear of reprisal. We evaluate the effectiveness of our health and safety programs by conducting trend analyses of our past performance and externally through benchmarking with industry peers and the U.S. Bureau of Labor Statistics.\nCollective Agreements \nApproximately 4,100 employees are covered by 15 collective agreements in the U.S., of which we negotiated five renewals in 2024 and expect to negotiate seven renewals in 2025.\nSee “Risk Factors” for further discussion regarding risks related to our workforce and employee relations.\nREGULATORY MATTERS\nGovernment Contract Security Restrictions\nWe are prohibited by the U.S. government from publicly discussing the details of classified programs. These programs are generally referred to as “restricted” in this Annual Report. The consolidated financial statements and financial information in this Annual Report reflect the operating results of our entire company, including restricted programs.\nContracts\nWe generate the majority of our business from long-term contracts with the U.S. government for development, production and support activities. Unless otherwise specified in a contract, allowable and allocable costs are billed to contracts with the U.S. government pursuant to the Federal Acquisition Regulation (FAR) and U.S. government Cost Accounting Standards (CAS), which are regulations that govern cost accounting requirements for government contracts. Examples of costs incurred by us and not billed to the U.S. government in accordance with applicable FAR and CAS requirements include, but are not limited to, unallowable employee compensation, charitable donations, interest expense, advertising, and certain legal and travel costs.\nWe monitor our contracts on a regular basis for compliance with our policies and procedures and applicable government laws and regulations. In addition, costs incurred and allocated to contracts with the U.S. government are routinely audited by the Defense Contract Audit Agency (DCAA).\n-6-\nNORTHROP GRUMMAN CORPORATION\nOur long-term contracts typically fall into one of two contract types:\nCost-type contracts\n – Cost-type contracts include cost plus fixed fee, cost plus award fee and cost plus incentive fee contracts. Cost-type contracts generally provide for reimbursement of a contractor’s allowable costs incurred plus fee. As a result, cost-type contracts have less financial risk associated with unanticipated cost growth but generally provide lower profit margins than fixed-price contracts. Cost-type contracts typically require that the contractor use its best efforts to accomplish the scope of work within some specified time and stated dollar limitation. Fees on cost-type contracts can be fixed in terms of dollar value or can be variable due to award and incentive fees, which are generally based on performance criteria such as cost, schedule, quality and/or technical performance. Award fees are determined and earned based on customer evaluation of the company’s performance against contractual criteria. Incentive fees are generally based on cost or schedule and provide for an initially negotiated fee to be adjusted later, based on the relationship of total allowable costs to total target costs or as schedule milestones are met. Award and incentive fees are included in total estimated sales to the extent it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is subsequently resolved. We estimate variable consideration as the most likely amount to which we expect to be entitled.\nFixed-price contracts\n – Firm fixed-price contracts include a specified scope of work for a price that is a pre-determined, negotiated amount and not typically subject to adjustment regardless of costs incurred by the contractor, absent changes by the customer. As a result, fixed-price contracts typically have more financial risk associated with unanticipated cost growth, but provide the opportunity for higher profit margins. Certain fixed-price incentive fee contracts provide for reimbursement of the contractor’s allowable costs plus a fee up to a cost ceiling amount, typically through a cost-sharing ratio that affects profitability. These contracts effectively become firm fixed-price contracts once the cost-share ceiling is reached. Time-and-materials contracts are considered fixed-price contracts as they specify a fixed hourly rate for each labor hour charged.\nProfit margins on our contracts may vary materially depending on, among other things, the contract type, contract phase (e.g., development, low-rate production or mature production), negotiated fee arrangements, achievement of performance objectives, unexpected macroeconomic factors or other circumstances, and cost, schedule and technical performance.\nSee Note 1 to the consolidated financial statements and “Risk Factors” for further information regarding our contracts and Note 15 to the consolidated financial statements for sales by contract type.\nThe following table summarizes sales for the year ended December 31, 2024, recognized by contract type and customer category:\n$ in millions\nU.S.\nGovernment\n(1)\nInternational\n(2)\nOther Customers\nTotal\nPercentage\nof Total Sales\nCost-type contracts\n$\n20,256 \n$\n684 \n$\n24 \n$\n20,964 \n51 \n%\nFixed-price contracts\n15,180 \n4,316 \n573 \n20,069 \n49 \n%\nTotal sales\n$\n35,436 \n$\n5,000 \n$\n597 \n$\n41,033 \n100 \n%\n(1)\nSales to the U.S. government include sales from contracts for which we are the prime contractor, as well as those for which we are a subcontractor and the ultimate customer is the U.S. government. Each of the company’s segments derives a substantial percentage of its revenue from the U.S. government.\n \n(2)\n International sales include sales from contracts for which we are the prime contractor, as well as those for which we are a subcontractor and the ultimate customer is an international customer. These sales include foreign military sales contracted through the U.S. government. \nEnvironmental\nOur operations are subject to and affected by federal, state, local and foreign laws, regulations and enforcement actions relating to protection of human health and the environment. We have incurred and expect to continue to incur capital and operating costs to comply with applicable environmental laws and regulations and to achieve our environmental sustainability goals. See “Risk Factors” and Notes 1 and 11 to the consolidated financial statements for further information regarding environmental matters.\nOur environmental sustainability goals focus on Northrop Grumman’s facilities in addition to supply chain partners and customers:\n-7-\nNORTHROP GRUMMAN CORPORATION\n•\nNet zero greenhouse gas emissions (GHG) in operations (Scopes 1 and 2) by 2035. Interim target of 50% GHG emissions reduction by 2030;\n•\nSource 50 percent of total electricity from renewable sources by 2030;\n•\nReduce 10% of absolute water withdrawals, reuse 10% of water withdrawals and replenish 10% of water withdrawals, focusing in water-stressed regions — all by 2030;\n•\nReduce solid waste sent to landfill and incineration by 10% by 2030; \n•\nIn collaboration with key customers, work to develop a pioneering product stewardship program focused on material efficiency, product design and life cycle assessment;\n•\nExpand Technology for Conservation initiatives in proximity to Northrop Grumman's U.S. locations by 2030, in collaboration with external partners.\nAdditional information regarding our environmental sustainability goals is available in our Sustainability Report, which can be found on our company website.\nEXECUTIVE OFFICERS\nSee “Directors, Executive Officers and Corporate Governance” for information about our executive officers.\nAVAILABLE INFORMATION\nOur principal executive offices are located at 2980 Fairview Park Drive, Falls Church, Virginia 22042. Our telephone number is (703) 280-2900 and our home page is www.northropgrumman.com.\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statement for the annual shareholders’ meeting, as well as any amendments to those reports, are available free of charge through our website as soon as reasonably practicable after we file them with the U.S. Securities and Exchange Commission (SEC). You can learn more about us by reviewing our SEC filings on the investor relations page of our website.\nThe SEC also maintains a website at www.sec.gov that contains reports, proxy statements and other information about SEC registrants, including Northrop Grumman Corporation. \nReferences to our website and the SEC’s website in this report are provided as a convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, such websites. Such information should not be considered a part of this report, unless otherwise expressly incorporated by reference in this report.",
    "item1a": "Item 1A. Risk Factors\nOur consolidated financial position, results of operations and cash flows are subject to various risks, many of which are not exclusively within our control, that may cause actual performance to differ materially from historical or projected future performance. We encourage you to consider carefully the risk factors described below in evaluating the information contained in this report as the outcome of one or more of these risks could have a material adverse effect on our financial position, results of operations and/or cash flows.\nIndustry and Economic Risks\n•\nWe depend heavily on a single customer, the U.S. government, for a substantial portion of our business. Changes in this customer’s strategies, priorities and spending could have a material adverse effect on our financial position, results of operations and/or cash flows.\nOur primary customer is the U.S. government, from which we derived 87 percent of our sales in 2024; we have a number of large programs with the U.S. Department of the Air Force, in particular. The U.S. government has the ability to delay, modify or cancel ongoing competitions, procurements and programs, as well as to change its future acquisition strategy. We cannot predict the impact on existing, follow-on, replacement or future programs from potential changes in the threat and global security environment, defense spending levels, government and budgetary priorities, political leadership, procurement practices and strategy, inflation and other macroeconomic trends, military strategy; or broader changes in social, economic, security or political demands and priorities. \nThe U.S. government has the ability to terminate contracts, in whole or in part, for its convenience or for default based on performance. In the event of termination for convenience, contractors are generally protected by provisions covering reimbursement for costs incurred and profit on those costs up to the amount authorized under the contract, \n-8-\nNORTHROP GRUMMAN CORPORATION\nbut not the anticipated profit that would have been earned. However, to the extent insufficient funds have been appropriated by the U.S. government to cover such costs, the U.S. government may assert that it is not required to provide additional funding for such costs. In the event of termination due to default, contractors may be required to pay for re-procurement costs in excess of the original contract price, net of the value of work accepted from the original contract, as well as other damages. Termination due to our default (or that of a teammate) could have a material adverse effect on our reputation, our ability to compete for other contracts and our financial position, results of operations and/or cash flows.\nWhere program cost estimates exceed certain thresholds, our customer has been, and may in the future be, required to provide congressional notification of significant or critical cost increases (or breaches) under the Nunn-McCurdy Act, which, in some circumstances, could result in program restructure or termination. For example, in January 2024 the customer provided congressional notification that the Sentinel program (formerly called the Ground Based Strategic Deterrent program) was under a Nunn-McCurdy breach review, which was completed in July 2024, resulting in the certification for continuance of the program.\nThe U.S. government also has the ability to stop work under a contract for a limited period of time for its convenience. The U.S. government has invoked and could invoke this ability across a limited or broad number of contracts. In the event of a stop work order, contractors are typically protected by provisions covering reimbursement for costs incurred to date and for costs associated with the temporary stoppage of work plus a reasonable fee. However, such temporary stoppages often introduce inefficiencies and result in financial and other damages for which contractors may not be able to negotiate full recovery. In some cases, they have also ultimately resulted and could result in termination of a contract for convenience or reduced future orders.\n•\nSignificant delays or reductions in appropriations for our programs or U.S. government funding more broadly, including a prolonged continuing resolution, government shutdown or breach of the debt ceiling, and future budget and program decisions can negatively impact our business and programs and could have a material adverse effect on our financial position, results of operations and/or cash flows.\nU.S. government programs are subject to annual congressional budget authorization and appropriation processes. For many programs, Congress appropriates funds annually even though the program performance period may extend over several years. Programs are often partially funded initially, with additional funds committed only as Congress makes further appropriations. When we or our subcontractors incur costs in excess of funds obligated on a contract, we are generally at risk for reimbursement unless and until additional funds are obligated to the contract. We cannot predict what funding will ultimately be approved for individual programs. In addition, pressures on, as well as laws and plans relating to the federal budget, potential changes in priorities and defense spending, the timing and substance of the appropriations process, use of continuing resolutions (with restrictions, e.g., on new contract and program starts) and the federal debt limit (including a breach of the federal debt ceiling), have adversely affected and could adversely affect the amount and timing of funding for individual programs and delay purchasing or payments by our customers. In the event government funding for our significant programs is reduced, delayed or unavailable, or orders are reduced, our contracts or subcontracts, or competitions for such programs have at times been, and in the future may be, terminated or changed. \nThe U.S. continues to face a changing geopolitical environment, along with substantial fiscal, economic and security challenges, which affect funding and budgetary priorities. The budget and macroeconomic environment, global security environment, political instability, and uncertainty surrounding the appropriations processes and the debt ceiling, remain significant short and long-term risks. See “Overview” in MD&A. In addition, high deficit levels and high debt servicing costs could drive cuts to federal spending. Considerable uncertainty exists regarding how future budget and program decisions will unfold. If annual appropriations bills are not timely enacted, the U.S. government may continue to operate under a continuing resolution (potentially of extended duration), restricting new contract or program starts, presenting resource allocation challenges and placing limitations on budgets. We also may face a prolonged government shutdown that could lead to program cancellations, disruptions and/or stop work orders and could limit the U.S. government’s ability to progress programs and make timely payments. A prolonged shutdown could limit our ability to perform on our contracts and successfully compete for new work. If the statutory debt limit is not increased adequately, we could be obligated to work without receiving timely payments, and a prolonged breach could have far-reaching adverse consequences. If the macroeconomic environment deteriorates, including due to rising inflation or other causes, we could experience labor and supply chain challenges and increased costs and existing or anticipated appropriated and contracted funds may not be sufficient to cover costs incurred on existing or future programs. \n-9-\nNORTHROP GRUMMAN CORPORATION\nFuture funding for certain programs in which we participate may be reduced, delayed or cancelled. Budget cuts globally could adversely affect the viability of our subcontractors and suppliers. While we believe that our business is well-positioned in areas for future defense spending, changing priorities, budget pressures, defense spending cuts, challenges in the appropriations process, the possibility of a long-term continuing resolution (or series of continuing resolutions) and breach of the debt ceiling, ongoing fiscal debates and the global economic and security environment increase uncertainties and risk.\n•\nWe use estimates when accounting for contracts. Contract cost growth or changes in estimated contract revenues and costs can affect our profitability and could have a material adverse effect on our financial position, results of operations and/or cash flows.\nContract accounting requires judgment, including in assessing risks, estimating contract revenues and costs, and predicting future performance. Given the size and nature of our many contracts, estimating total revenues and costs at completion is complex and subject to many variables. When there is sufficient information to assess expected future performance, we consider performance related incentives, awards and penalties in estimating revenue and profit rates. Suppliers’ expected performance, and the availability and costs of labor, materials and components, are also considered.\nOur operating income can be adversely affected when estimated contract costs increase, especially without comparable increases in revenue. There are many reasons estimated contract costs can increase, including inflation, labor challenges, supply chain challenges, and market and exchange rate volatility; delays or limitations in customer funding; design or other development challenges; production challenges (including from technical or quality issues and other performance concerns); inability to realize learning curves or other cost savings; changes in laws or regulations; actions necessary for long-term customer satisfaction; and natural disasters or environmental matters. \nWe aim to mitigate this risk through contract terms, and we have submitted and may submit requests for equitable adjustment (REAs), engineering change proposals or other claims to seek recovery in whole or in part for our increased costs. We have also sought, and will seek, other avenues, as appropriate, to compensate the company for certain unexpected cost increases. However, our contracts may not enable full recovery, and/or customers may disagree with our requests or may not have funding to cover them. \nOur risk varies with the type of contract. Fixed-price contracts inherently tend to have more financial risk than cost-type contracts, including as a result of inflationary pressures, labor rates and shortages, challenges in estimating contract revenues and costs and supplier challenges. In 2024, approximately half of our sales were derived from fixed-price contracts. We have more often entered into fixed-price contracts where costs can be more reasonably estimated based on actual experience, such as for mature production programs. However, our customers have sought, and may in the future seek, fixed-price contracts for development programs, combined development and production programs, or low-rate initial production programs, where the risks are greater. For example, such contracts can create performance and financial risks, whether due to the estimates of costs required to complete such contracts being subject to potentially significant variability or because of the challenge of starting and stabilizing manufacturing production and test lines while concurrently validating final design and managing changes in requirements or capabilities requested by the customer. In addition, our contracts contain provisions relating to cost controls and audit rights. If we do not achieve our estimates or meet terms in our contracts, our profitability has at times been and may be reduced, and we have incurred and may incur losses. \nCertain of our fixed-price contracts include or may include fixed-price development work. This work is inherently more uncertain, and, as a result, there is typically more variability in estimates of the costs to complete the development stage. As work progresses into production, the risks associated with estimating total costs are typically reduced as compared to fixed-price development work. While management uses its best judgment to estimate costs associated with fixed-price contracts, future events can result in significant adjustments. In addition, from time to time, we may begin performing on a contract prior to completing contract negotiations. Uncertainties in final contract terms, quantity and pricing, or loss of negotiating leverage associated with long delays could negatively affect our profitability. Certain of our contracts also include options exercisable at the customer’s discretion. The customer may decline to exercise an option, or the customer may exercise an option for which we may incur a loss or perform at a low margin, either of which could adversely affect our results of operations. \nUnder cost-type contracts, allowable costs are generally subject to reimbursement plus a fee. We often enter into cost-type contracts for development programs with complex design and technical challenges. These cost-type programs may have award or incentive fees that are uncertain and may be earned over extended periods or towards the end of the contract. In these cases, the financial risks are typically in recognizing profit, which ultimately may not be earned, or program cancellation if cost, schedule, or technical performance issues arise. We also face \n-10-\nNORTHROP GRUMMAN CORPORATION\nadditional financial risk when solicitations require us to bid on cost-type development work and fixed-price production lots and/or options in one submission, where we must estimate the cost of production before a product has been developed and tested, or cost-type development work requiring us to provide certain items at our expense or with little or no fee. Macroeconomic challenges increase these risks. \nBecause of the significance of management’s judgments and the estimation processes, and the difficulties inherent in estimating future costs, particularly in a challenging macroeconomic environment, it is possible that we could see materially different results. Changes in underlying assumptions, circumstances or estimates, and the failure to recover on requests for equitable adjustments, engineering change proposals or other claims could have a material adverse effect on the profitability of one or more of our contracts and on our overall financial position, results of operations and/or cash flows. See “Critical Accounting Policies and Estimates” in MD&A and Note 11 to the consolidated financial statements.\n•\nCompetition within our markets and bid protests, or other attempts to interfere with our ability to obtain and retain awards, may affect our ability to win new contracts and result in reduced revenues, which could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe operate in highly competitive markets and our competitors may have more financial capacity or more extensive or specialized engineering, technical, manufacturing, marketing or servicing capabilities. They may be willing to accept more risk or lower profitability in competing for contracts. We have seen, and anticipate we will continue to see, increased competition in some of our core markets, especially as a result of our customers’ budget pressures, their focus on affordability and competition, and our own success in winning business. We are facing increasing competition in the U.S. and outside the U.S. from U.S., foreign and multinational firms, including new entrants, and anticipate that mergers or acquisitions within our industry could further increase competition or could limit our access to certain suppliers without appropriate remedies to protect our interests. We are also facing increasing competition for, and more limited access to various critical products, services and other supplies. In some instances, foreign companies may receive loans, subsidies and other assistance from their governments that may not be available to U.S. companies and foreign companies may be subject to fewer restrictions on technology transfer. For some products and services, some customers, including the DoD, are turning to commercial contractors, newer entrants to markets and non-traditional defense contractors, which may have lower cost or more agile operating structures and the ability to leverage changes in customer acquisition strategies (e.g., multiple awardees, short lifecycles). In addition, some customers continue to utilize small business contractors or determine to source work internally. Our success in competing depends, in part, on our ability to remain cost-competitive, respond to changes in customer acquisition strategies, accurately anticipate our customers’ needs and successfully effect our digital transformation strategy and adopt and integrate new digital technologies into our manufacturing, operations, and products and services.\nIn addition, U.S. government procurement laws permit certain legal challenges to the terms of a contract solicitation or award, referred to as a bid protest. Bid protests can result in award decisions being reversed and loss of the contract award. Even where a bid protest does not result in such a loss, it can result in significant expenses and delay the start of contract activities and revenue or result in contract modifications. We are also subject to risks associated with our ability to challenge Other Transaction Authority (OTA) agreements, which the U.S. government can award for certain research, prototype and production projects. OTA awards are not subject to all of the procurement requirements that typically apply to DoD contracts and rights to protest such awards may be more limited than for other contracts. \n•\nThe global macroeconomic environment has negatively impacted and could in the future negatively impact our business, and if we are unable to mitigate such challenges, it could have a material adverse effect on our financial position, results of operations and/or cash flows.\nOur business, financial position, results of operations and/or cash flows have been and may in the future be adversely impacted by the global macroeconomic environment, which impacts have included and may in the future include high rates of inflation; increased interest rates; tight credit in financial markets; widespread disruptions in supply chains; workforce challenges, including labor shortages; and market volatility, including exchange rate volatility. These and other macroeconomic challenges have led and can lead to increased costs, labor and supply shortages, and delays and disruption in performance, as well as competing demands for scarce resources, which in turn have adversely impacted and may continue to adversely impact our customers, our industry, our company, our suppliers and others with whom we do business. We continue to work proactively to mitigate the challenges caused by the macroeconomic environment, including, in some cases, seeking the inclusion of economic price adjustment clauses or seeking to recover on requests for equitable adjustments, engineering change proposals or other claims. \n-11-\nNORTHROP GRUMMAN CORPORATION\nLegal and Regulatory Risks\n•\nWe are subject to various investigations, claims, disputes, enforcement actions, litigation, and other legal proceedings that could ultimately be resolved against us and could have a material adverse effect on our financial position, results of operations and/or cash flows.\nThe size, nature and complexity of our business make us particularly susceptible to investigations, claims, disputes, enforcement actions, prosecutions, litigation and other legal proceedings (collectively “legal proceedings”), particularly those involving governments, which may continue to increase. We are or may become subject to legal proceedings globally (including criminal, civil and administrative) and across a broad array of matters, including, but not limited to, government contracts, cost accounting, financial accounting and reporting, false statements or claims, cybersecurity and pension accounting and other employee benefit plan matters. These matters can divert resources; result in administrative, civil or criminal fines, penalties or other sanctions (including judgments, convictions, consent or other voluntary decrees or agreements), compensatory, treble or other damages, non-monetary relief, or other liabilities; and otherwise harm our business and our ability to obtain and retain awards. Certain outcomes may lead to suspension or debarment from government contracts or suspension of export/import privileges for the company or one or more of its components. Suspension or debarment or criminal resolutions in particular could have a material adverse effect on the company because of our reliance on government contracts and export authorizations. Legal proceedings, even if pending or not ultimately resulting in adverse action, or if fully indemnified or insured, can negatively impact our reputation among our customers and the public, and make it substantially more difficult for us to compete effectively for business, obtain and retain awards, ensure adequate funding for our programs or obtain adequate insurance in the future. See Note 10 to the consolidated financial statements for information regarding the company’s investigations, claims and litigation. \n•\nAs a U.S. government contractor, we and our partners are subject to various procurement and other laws, regulations and contract terms applicable to our industry, as well as those more broadly applicable to industry, and changes in such laws, regulations or terms, any negative findings by the U.S. government as to our or our partners’ compliance with them, and changes in our customers’ business practices globally could affect our ability to compete and have a material adverse effect on our financial position, results of operations and/or cash flows.\nU.S. government contractors (including their subcontractors and others with whom they do business) must comply with various specific procurement laws, regulations, rules and other legal requirements, as well as ones more broadly applicable. These various legal requirements, although sometimes customary in government contracting, increase costs and risks. They have been and are evolving at a significant pace. The costs are not always fully recoverable. New laws or other requirements, or changes to existing ones (including, for example, related to cybersecurity, information and data protection, cost accounting, environment, sustainability, securities, competition, compensation costs, taxes, counterfeit parts, pensions, and use of certain non-US equipment) or more expansive interpretations or other changes in how government agencies construe existing ones, can significantly increase our costs and risks and reduce our profitability.\nWe operate in a highly regulated environment and are routinely audited and reviewed by the U.S. government and its agencies, such as the DCAA, Defense Contract Management Agency (DCMA) and the DoD Inspector General. These agencies review performance under our contracts, our cost structure and accounting, our compliance, and the adequacy of our systems in meeting government requirements. Costs ultimately found to be unallowable or improperly allocated are generally not reimbursed or require us to refund the customer. When an audit uncovers improper or illegal activities, we are subject to possible civil and criminal penalties, sanctions, or suspension or debarment. Whether or not illegal activities are alleged, the U.S. government has the ability to decrease or withhold certain payments when it deems systems to be inadequate, with significant financial impact, regardless of the ultimate outcome. In addition, we risk serious reputational harm in situations involving allegations of impropriety made against us or our business partners.\nOur industry has experienced, and we expect it will continue to experience, significant changes to business practices globally, in part as a result of changes in the global security and threat environment and an increased focus on affordability, efficiencies, business systems, recovery of costs and a reprioritization of available defense funds. We have experienced and may continue to experience an increased number of audits and challenges to our claims and our business systems for current and past years, as well as longer periods to close audits, broader requests for information and an increased risk of withholdings of payments. The U.S. government has been pursuing and may continue to pursue policies that could negatively impact our profitability, including those that shift additional responsibility and performance risks to the contractor. Changes in procurement practices, including those favoring \n-12-\nNORTHROP GRUMMAN CORPORATION\nincentive-based fee arrangements; fixed price development or long-term production programs; different award criteria; and non-traditional contract provisions have affected and may in the future affect our profitability and predictability.\nWe (including our subcontractors and others with whom we do business) also are subject to, and expected to perform in compliance with, a vast array of federal, state and local laws, regulations, contract terms and requirements related to our industry, our products and the businesses we operate, as well as those more broadly applicable to industry, such as securities laws and regulations. These requirements, whether specific to our industry or broadly applicable, can limit our ability to achieve our goals. If we are found to have violated any such requirements, or are found not to have acted responsibly, we may be subject to a wide array of actions, including contract modifications or termination; payment withholds; the loss of export/import privileges; administrative, civil or criminal judgments or penalties (including convictions, agreements, fines, damages and non-monetary relief); or suspension or debarment. \n•\nThe improper conduct of employees, agents, subcontractors, suppliers, business partners or joint ventures in which we participate can impact our reputation and our ability to do business, which could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe face potential liability based on misconduct by employees, agents or others working with us or on our behalf that could violate the applicable laws of the jurisdictions in which we operate, including laws governing improper payments to government officials, the protection of export controlled or classified information, false claims, procurement integrity, cost accounting and billing, competition, information security and data privacy, intellectual property and contract terms. Improper actions by our employees, agents or others working with us or on our behalf also subject us to risk of administrative, civil or criminal investigations and enforcement actions; monetary and non-monetary penalties; liabilities; and the loss of privileges and other sanctions, including suspension and debarment. We have in the past experienced and may in the future experience misconduct committed by our employees, agents, suppliers, partners or others working with us or on our behalf. This risk of improper conduct increases as we continue to expand globally, with greater opportunities and demands to do more business with local and new partners, and in new environments. At the same time, law enforcement agencies are continuing to focus collaboratively on combating global corruption and other misconduct. In the ordinary course we form and are members of joint ventures or other business arrangements and/or invest in third parties with whom we do business. We may be unable to prevent misconduct or violations of applicable laws by these joint ventures or our partners, including, in each case, their respective officers, directors and employees.\n•\nEnvironmental matters, including climate change, unforeseen costs associated with compliance and remediation efforts, and government and third-party claims, could have a material adverse effect on our reputation and our financial position, results of operations and/or cash flows.\nOur operations are subject to and affected by a variety of federal, state, local and foreign environmental laws and regulations, including as they may be expanded, otherwise changed or enforced differently over time. Compliance with these existing and evolving environmental laws and regulations requires, and is expected to continue to require, significant operating and capital costs. For example, some of these recently enacted laws and regulations prohibit the use of certain chemicals or other substances that are used in our business, which has, in some cases, required us to identify alternate sources, resulting in additional costs and/or otherwise impacting our business and operations. New and evolving laws, regulations and rule makings globally impose different and at times more restrictive standards and require greater disclosures. For example, certain jurisdictions, including the State of California and the European Union, have enacted legislation which requires or would require more stringent greenhouse gas emissions and climate risk reporting. They could also require capital investments, could adversely impact our ongoing operations, and could require changes on a more accelerated time frame. We expect our suppliers to face similar challenges and incur additional compliance costs that may be passed on to us. These direct and indirect costs can adversely impact our results of operations and financial condition, and, if we are unable to comply with legislative and regulatory requirements or meet our sustainability objectives, our reputation and ability to do business could be negatively impacted. In addition, our customers’ requirements, priorities and ways of doing business with respect to environmental matters, and climate change specifically, also may have an impact on our business, operations and financial success. \nEnvironmental matters may significantly impact our business and operations and present evolving risks and challenges. Environmental impacts, including climate change specifically, create short and long-term financial risks to our business globally. We have significant operations located in regions that have been, and may in the future be, exposed to significant weather events and other natural disasters. Increased worldwide focus on climate change has \n-13-\nNORTHROP GRUMMAN CORPORATION\nled to legislative and regulatory efforts to combat both potential causes and adverse impacts of climate change, including regulation of greenhouse gas emissions. New or more stringent laws and regulations related to greenhouse gas emissions and other climate change related concerns have affected and will likely continue to affect us, our suppliers and our customers. The company has set a goal to achieve net zero greenhouse gas emissions in our operations by 2035 and is committed to working to achieve its climate change and other sustainability goals. We are working to identify opportunities to utilize alternatives to fossil-based energy sources, to decrease our greenhouse gas emissions, to reduce our consumption of water and generation of waste, and to ensure our compliance with environmental regulations where we operate, enhancing our record of environmental sustainability. However, the costs of doing so may be greater than expected, which could affect our ability to achieve our goals.\nWe may be subject to substantial administrative, civil or criminal fines, penalties or other sanctions (including suspension, debarment or disqualification) for violations of environmental laws. If we are found to be in violation of the Federal Clean Air Act or the Clean Water Act, the facility or facilities involved in the violation could be placed by the Environmental Protection Agency on a list of facilities that generally cannot be used in performing on U.S. government contracts until the violation is corrected.\n \nWe incur, and expect to continue to incur, substantial remediation costs related to the cleanup of pollutants previously released into the environment. Stricter or different remediation standards or enforcement of existing laws and regulations; new requirements, including regulation of new substances; discovery of previously unknown or more extensive contamination or new contaminants; imposition of fines, penalties, or damages (including natural resource damages); a determination that certain remediation or other costs are unallowable; rulings on allocation or insurance coverage; and/or the insolvency, inability or unwillingness of other parties to pay their share, could require us to incur material additional costs in excess of those anticipated. \nWe are and may become a party to various legal proceedings and disputes involving government and private parties (including individual and class actions) relating to alleged impacts from pollutants released into the environment, including bodily injury and property damage. For example, please see Note 10 for a discussion of certain disputes and lawsuits related to legacy Bethpage environmental conditions. These matters could result in material compensatory or other damages, remediation costs, penalties, and non-monetary relief, and adverse determinations on allowability or insurance coverage.\nGovernment and private parties also seek to hold us responsible for liabilities or obligations related to former operations that have been divested or spun-off and/or for which we believe other parties have agreed to be responsible and/or to indemnify us. These rights may not be sufficient to protect us.\n•\nUnanticipated changes in our tax provisions or an increase in our tax liabilities, whether due to changes in applicable laws and regulations, the interpretation or application thereof, or a final determination of tax audits or litigation or agreements, could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe are subject to income and other taxes in the U.S. and foreign jurisdictions. Changes in applicable tax laws and regulations, or their interpretation and application, including the possibility of retroactive effect, have affected and could affect our tax expense. In addition, the final determination of any tax audits or related litigation, in particular with regard to our positions on research credits, could be materially different from our historical income tax provisions and accruals. In addition, we may be subject to future tax audits and legal challenges involving OATK, which we acquired in 2018, or the spinoff of its then subsidiary Vista Outdoor, and we may be unable to obtain indemnification or we may be required to indemnify Vista. \n•\nCyber and other security threats or disruptions could have a material adverse effect on our reputation and our financial position, results of operations and/or cash flows.\nAs a defense contractor, we face significant cyber and other security threats. They include, among other things, attempts to gain unauthorized access to sensitive information or otherwise compromise the integrity, confidentiality and/or availability of our systems, hardware and networks, and the information on them; insider threats; ransomware; threats to the safety of our directors, officers and employees; threats to our facilities, infrastructure, products (we produce and use), and subcontractors or other suppliers (referred to inclusively as suppliers); and threats from terrorist acts, espionage, civil unrest and other acts of aggression. We are also subject to increasing government, customer and other cyber and security requirements, including disclosure obligations.\nCyber threats, both on premises and in the cloud, are complex, continuous and evolving and include, but are not limited to: malicious software, destructive malware, ransomware, targeting by more advanced and persistent \n-14-\nNORTHROP GRUMMAN CORPORATION\nadversaries, including nation states and other actors, zero-day attacks, attempts to gain unauthorized access to systems or data, disruption to operations, critical systems or denial of service attacks; unauthorized release of confidential, personal or other protected information (ours or that of our employees, customers or partners); corruption of data, networks or systems; harm to individuals; and loss of assets. We have been and could be impacted by cyber threats or other disruptions or vulnerabilities found in products or services we use or in our internal, partners’ or customers’ systems that are used in connection with our business. Further, the sophistication, availability and use of artificial intelligence by threat actors present an increased level of risk. We have experienced cyber attacks and, due to the evolving threat landscape, expect we will continue to experience additional attacks in the future. The various measures and controls we have implemented to monitor and mitigate risks associated with these threats and to increase the cyber resiliency of our infrastructure and products may not always be sufficient or fully effective, particularly against previously unknown vulnerabilities, including those that could go undetected for an extended period.\nCyber events have caused and could cause us harm and require us to undertake remedial actions. Successful attacks can lead to losses or misuse of sensitive information or capabilities; theft or corruption of data; harm to personnel, infrastructure or products; protracted disruptions in our operations and performance; and the misuse of our products. They can also damage our reputation, impact our ability to obtain adequate insurance coverage, and lead to loss of business, regulatory actions, and costs, liabilities or other financial losses for which we may not have adequate sources of recovery.\nOur customers and partners (including our suppliers and joint ventures) to whom we entrust confidential data, and on whom we rely to provide products and services, face similar threats and growing requirements, including ones for which others may seek to hold us responsible. We depend on our customers, suppliers, and other business partners to implement and verify adequate controls and safeguards to protect against and report cyber incidents. If they fail to deter, detect, remediate or report cyber incidents in a timely manner, we may suffer financial and other harm, including to our information, operations, performance, employees and reputation. Further, the systems, products and services that we provide to customers may not be able to detect or deter threats, or effectively to mitigate resulting losses. These losses could adversely affect our customers and our company.\nWe also face increasing and evolving disclosure obligations related to cyber and other security events and the risk of failing to meet all our existing or future disclosure obligations and/or having our disclosures misinterpreted. National security or public safety considerations may also affect, or in limited instances prevent, our public disclosure of a cybersecurity incident in certain circumstances.\nWe also face threats to our physical security, including to our facilities and the safety and well-being of our people, including senior executives. These threats could involve terrorism, insider threats, targeted threats against senior executives, workplace violence, civil unrest, natural disasters, damaging weather or fires, which could adversely affect our company. Our customers and suppliers face similar risks that, if realized, could also adversely impact our operations. Such acts could cause delays, manufacturing downtime, or other impacts that could detrimentally impact our ability to perform our operations. We could also incur unanticipated costs to remediate impacts and lost business. For further discussion of our cybersecurity risk management, strategy and governance, see “Cybersecurity.” \n•\nOur earnings and profitability depend, in part, on subcontractor and supplier performance, financial viability, and compliance with regulatory requirements globally, as well as highly skilled labor, raw materials, chemicals, parts, and component availability and pricing, and one or more of these factors could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe rely on other companies to provide raw materials, chemicals, parts and components and subsystems for our products, produce hardware elements and sub-assemblies, provide software and intellectual property, provide information about the parts they supply to us, and perform some of the services we need for our operations or provide to our customers, and to do so in compliance with all applicable laws, regulations and contract terms, while maintaining strong values and cultures. Disruptions or performance problems with our subcontractors or other suppliers (referred to inclusively as suppliers), unanticipated cost growth for the products and services they provide, failure to meet regulatory or contractual requirements, unethical or illegal behavior, or a misalignment between our contractual obligations to our customers and our agreements with our suppliers, have had and may continue to have various adverse impacts on the company, including on our ability to meet our commitments to customers and financial expectations. This risk of delays and disruptions in the supply chain, and supply chain challenges more broadly, has been and continues to be heightened globally due to the current macroeconomic environment.\n-15-\nNORTHROP GRUMMAN CORPORATION\nOur ability to perform our obligations on time is adversely affected if one or more of our suppliers is unable to provide the agreed-upon products, materials or information, or perform the agreed-upon services in a timely, compliant and cost-effective manner. We also may experience challenges performing if we are unable to use certain raw materials, chemicals or other substances due to laws or other regulations that restrict or prohibit the use of such items or cause suppliers to be unwilling or unable to supply them and we cannot obtain a reasonable substitute on a cost-effective basis. Changes in political or economic conditions, including changes in demand, changes in the macroeconomic environment (including inflation and labor and supply chain challenges), changes in defense budgets and/or priorities, changes in the global security environment, changes in export/import restrictions, sanctions and other trade restrictive activities, evolving requirements, or changes in access to critical technology and materials (including metals and components), among others, have adversely affected and could in the future adversely affect the financial stability of our suppliers and/or their ability to perform effectively. The inability of our suppliers to perform effectively has required and may require us to provide them additional support and/or to transition to alternate suppliers, if available, with additional costs and delays. We expect we will need to continue to provide additional resources to support certain of our suppliers in performing under our contracts. In addition, if we are unable to do that or if our suppliers are no longer able to perform due to financial difficulties, we may face additional losses and liabilities under our current contracts and adversely impact the prospects for certain new ones.\nIn connection with our U.S. government contracts, we are required to procure certain materials, components and parts from supply sources approved by the customer and/or are restricted from procuring products or services from certain sources. For example, we require assured access to certain microelectronics. Our ability to produce and/or deliver products will be significantly impacted if the microelectronics manufacturing supply chain is cut off or significantly delayed. For some components, there has been or may be only one supplier, or one domestic supplier. If that supplier cannot meet our needs or if we are unable to procure components from certain suppliers due to regulatory restrictions, we may be unable to find a suitable alternative and to meet our obligations.\nWe and our suppliers are also facing increased legal requirements globally. We may be held responsible not only for our compliance, but that of our suppliers. Our procurement practices are intended to reduce the risk we procure counterfeit, unauthorized or otherwise non-compliant parts or materials. We rely on our suppliers also to comply with applicable laws, customer requirements and contract terms, to ensure the quality of their components and effectively to mitigate the risk of cyber and security threats or other disruptions to their performance. \n•\nIf we are unable to attract and retain a qualified workforce necessary for our business, we may be unable to maintain our competitive position, meet the needs of our customers or achieve our results, which could have a material adverse effect on our financial position, results of operations and/or cash flows.\nOur operating results and growth opportunities are heavily dependent upon our ability to attract and retain sufficient qualified personnel who are or can reasonably be cleared (and obtain program access), who have the requisite skills in multiple areas, including science, technology, engineering and math, and who share our values and are able to operate effectively consistent with our culture. Outside the U.S., it is increasingly important that we are also able to attract and retain personnel with relevant local qualifications and experience. We continue to face increased competition for talent with traditional defense companies, new entrants in our markets and commercial companies, globally, with increasing wage rates and, in some cases, greater flexibility around working conditions. Although we have realized benefits from extensive hiring and retention programs in recent years, the risk of insufficient personnel may increase, either broadly or with respect to select critical staffing requirements, including those with security clearances.\n \nIf necessary qualified personnel are more scarce or more difficult to attract or retain under reasonable terms, or if we experience a high level of attrition, generally or in particular areas, or if such personnel are increasingly unable to obtain security clearances or program access on a timely basis or are unable to be timely and effectively trained, we would expect higher labor-related costs and we could face challenges performing on various of our programs and meeting financial expectations. In addition, the macroeconomic environment, including continued challenges in the global labor market, may further affect our ability to hire, develop and retain the necessary workforce, and to maintain performance levels and our corporate culture. \nCertain of our employees are covered by collective agreements. We generally have been able to renegotiate renewals to expiring agreements without significant disruption of operating activities. However, other companies recently have experienced challenges in renewing labor agreements. If, for example, we also experience difficulties with renewals and renegotiations of existing collective agreements, or if our employees pursue new collective representation, we could incur additional expenses and impacts on operating efficiency and may be subject to work stoppages or other labor-related disruptions. Any such expenses or delays could adversely affect our performance and results.\n-16-\nNORTHROP GRUMMAN CORPORATION\n•\nOur international business exposes us to additional risks, including risks related to geopolitical and economic factors, laws and regulations, which could have a material adverse impact on our financial position, results of operations and/or cash flows.\nSales to customers outside the U.S. are an important component of our strategy. Our international business (including our participation in joint ventures and other forms of collaboration, requirements for local content, and our global supply chain) is subject to numerous political and economic factors, legal requirements, cross-cultural considerations and other risks associated with doing business globally. These risks differ in some respects from those associated with our U.S. business and our exposure to such risks is expected to increase if and as our international business continues to grow.\nOur international business is generally subject to both U.S. and foreign laws, regulations and practices. Failure by us, our employees, partners or others with whom we work to comply with applicable laws and regulations could result in administrative, civil, commercial or criminal liabilities, including suspension or debarment from government contracts or suspension of export/import privileges. Failure to comply with local practices can adversely impact our ability to win and perform business. New regulations and requirements, or changes to existing ones in countries in which we operate can significantly increase our costs and risks of doing business internationally. Our customers outside of the U.S. also often have the ability to terminate contracts for convenience as well as for default based on performance. Suspension or debarment, or termination of a contract due to default could have a material adverse effect on our reputation, our ability to compete for other contracts and our financial position, results of operations and/or cash flows. We also face risks related to the unintended or unauthorized use of our products and resources.\nChanges in laws, political leadership and environment, and/or security risks may dramatically affect our ability to conduct or continue to conduct business in international markets. Our international business is impacted by changes in U.S. and non-U.S. national policies and priorities, and geopolitical relationships, any of which may be influenced by changes in the global threat environment, political leadership, geopolitical and economic uncertainties, world events, government budgets, inflationary pressures, sanctions imposed in countries where we do business or seek to do business, and economic and political factors more generally. The U.S. and its allies and security partners continue to face a global security environment of heightened tensions and instability, threats from state and non-state actors, including major global powers, as well as terrorist organizations, emerging nuclear tensions, and diverse regional security concerns. These factors have impacted and may in the future impact demand for our products and services, the competitive position of our products and services, funding for programs, our ability to perform, our supply chain, export authorizations, purchasing decisions or customer payments. Global macroeconomic conditions, as well as fluctuations in foreign currency exchange rates and credit, are also likely to further impact our business.\nOur contracts with non-U.S. customers in some cases include terms and reflect legal requirements that create additional risks. Terms include requirements to hire, invest, manufacture or purchase locally, or specific financial obligations, including offset obligations, and provisions that impose significant penalties if we fail to meet such requirements. We have also been required to enter into letters of credit, performance bonds, bank guarantees or other financial arrangements in certain cases. If we are dependent on certain suppliers, as in the U.S., we face risks related to their failure to perform in accordance with legal requirements, particularly where we rely on a sole source supplier. Our ability to sell products globally could be adversely affected if we are unable to design our products on a cost effective basis or to obtain and retain all necessary export authorizations, which the U.S. government can deny, change or revoke for reasons outside our control. Our business outside of the U.S. also depends on our ability to attract and retain sufficient qualified personnel with the skills and/or security clearances in the markets in which we do business. We also partner with non-U.S. companies, including through joint ventures and other forms of collaboration, which subjects us to risks related to the ability to identify and negotiate appropriate arrangements with qualified and acceptable local partners, potential exposure for their actions, and the ability effectively to terminate these arrangements. Such risks are complicated further when we partner with government-affiliated entities.\nThe products and services we provide, including those provided by suppliers and joint ventures, are sometimes in countries with unstable governments, economic or fiscal challenges, military or political conflicts, different business practices and/or developing legal systems. This may increase the risk to our employees, suppliers or other third parties, including for their safety, and increase our risk to a wide range of financial consequences and other liabilities, as well as loss of property or damage to our products.\n•\nOur business is subject to significant disruptions caused by natural disasters or other events outside of our control, which could have a material adverse effect on our financial position, results of operations and/or cash flows.\n-17-\nNORTHROP GRUMMAN CORPORATION\nWe have significant operations, including centers of excellence, located in regions that have been, and may in the future be, exposed to hurricanes, earthquakes, water levels, wildfires, windstorms, heat waves, other extreme weather conditions, acts of terrorism, power shortages and blackouts, telecommunications failures and other significant disruptions, and epidemics, pandemics, and similar outbreaks, especially of infectious diseases. We expect our facilities, operations, employees and communities in the future, particularly at facilities prone to extreme weather events, such as in Florida and California, to continue to be at risk for future natural disasters or other weather events (which may be exacerbated by climate change). Climate related changes can impact natural disasters, including weather patterns, with the increased frequency and severity of significant weather events (e.g., flooding, hurricanes and tropical storms), natural hazards (e.g., increased wildfire risk), rising mean temperature and sea levels, and long-term changes in precipitation patterns (e.g., drought, desertification, water scarcity and/or poor water quality). \nSuch natural disasters and other significant disruptions can interrupt our operations, impact our employees, and result in significant costs and adversely affect our performance. Our subcontractors and other suppliers have also been, and may in the future be, subject to natural disasters or other significant disruptions that could affect their ability to deliver or perform. Disruptions also impact the availability and cost of materials needed for manufacturing and can increase insurance and other operating costs, or result in a lack of available coverage. Although we take steps to mitigate these risks, including considering them in determining where to put new businesses, the damage and adverse effects of natural disasters and other significant disruptions, which may increase, as well as delays in recovery, may be significant.\n•\nOur future success depends, in part, on our ability to innovate, develop new products and technologies, progress and benefit from digital transformation and maintain technologies, facilities and equipment to win new competitions and meet the needs of our customers. Failure to do so or meet our contractual obligations that require innovative design could adversely affect our profitability, reputation and future prospects and have a material adverse effect on our financial condition, results of operations and/or cash flows.\nWe design, develop and manufacture technologically advanced and innovative products and services, which are applied by our customers in a variety of environments, including highly demanding operating conditions, to accomplish challenging missions. Our success depends upon our ability to develop technologically advanced, innovative and cost-effective products and services and market these products and services to our customers globally. Our ability to develop innovative and technologically advanced products depends on the talent of our workforce, continued funding for, and investment in, research and development projects, continued access to assured suppliers of important technologies and components, our ability to compete (including with commercial companies) and our ability to provide the people, technologies, facilities, equipment and financial capacity needed to develop and deliver those products and services with maximum efficiency. To perform on our contracts and to win new business, we also depend increasingly on our ability to progress successfully on our digital transformation strategy. To meet evolving customer requirements, it is increasingly necessary to differentiate our offerings and to achieve efficiencies in our operations through digital based solutions. If we are unable to continue to develop new products and technologies in a timely fashion, and progress successfully to effect digital solutions and transformation, or if we fail to achieve market acceptance more rapidly than our competitors, we may be unable to maintain our competitive position and our future success could be materially adversely affected.\nWe aim to ensure that our technical solutions are responsibly developed, tested and operated. Problems and delays in the successful development and delivery of our solutions, including as a result of issues with design, technology or operations, digital transformation, inability to achieve learning curve assumptions, artificial intelligence, manufacturing materials or components, or subcontractor (or other supplier) performance can prevent us from meeting requirements and create significant risk and liabilities. Similarly, failures to perform on schedule or otherwise to fulfill our contractual obligations can negatively impact our financial position, reputation and ability to win future business.\nIn addition, our products cannot be tested and proven in all situations and are otherwise subject to unforeseen problems that can negatively affect revenue, schedule and profitability, and result in loss of life or property. They include loss on launch or flight of spacecraft, loss of aviation platforms, premature failure of products that cannot be accessed for repair or replacement, unintended explosions, problems with design, quality and workmanship, country of origin of procured materials, inadequate supplier components and degradation of product performance. Factors that may affect revenue and profitability also include: inaccurate cost estimates, design issues, human factors, unforeseen costs and expenses, diversion of management focus, loss of follow-on work, replacement obligations, and repayment to the government customer of certain contract cost and fee payments previously received.\n-18-\nNORTHROP GRUMMAN CORPORATION\nCertain contracts, primarily involving space satellite systems, contain provisions that entitle the customer to recover payments and/or fees in the event of failure of the system or other performance challenges upon launch or subsequent deployment for less than a specified period of time. Under such terms, we are generally required to forfeit fees previously recognized and/or collected. \n•\nWe provide products and services, including related to hazardous and high risk operations, which subjects us to various environmental, regulatory, financial, reputational and other risks, and if any of these risks were to materialize, it could have a material adverse effect on our reputation and our financial position, results of operations and/or cash flows .\nWe provide products and services related to hazardous and high risk operations. Among other such operations, our products and services are used in nuclear-related activities (including nuclear-powered platforms) and used in support of nuclear-related operations of third parties. In addition, certain of our products are provided with space and missile launches. We use and provide energetic materials, including in propulsion systems, which are highly explosive and flammable. We develop missile systems, and counter systems, including strategic deterrents, as well as subsystems and components. These and other activities subject us to various extraordinary risks, including those associated with (1) nuclear-related or non-nuclear launch activities and operations, including failed launches; (2) unintended release or initiation of energetic materials and explosions, whether in the development, test or use of such energetic materials; and (3) the storage, handling and disposal of radioactive and other hazardous or flammable materials and any changes in related regulations. We may be subject to potential liabilities, including for personal injury and harm to human health, property damage, environmental harm, and reputational harm arising out of such incidents or hazardous activities and operations, whether or not the cause was within our control, and insurance may not be reasonably available. Under some circumstances, the U.S. government and prime contractors may provide for certain indemnification and other protection, including pursuant to, or in connection with, Public Law 85-804, 10 U.S.C. 3861, the Price-Anderson Nuclear Industries Indemnity Act, the NASA Space Act, the Commercial Space Launch Act and the Terrorism Risk Insurance Reauthorization Act, for certain risks, but those protections may not be available or adequate.\nCertain of our products, such as medium and large caliber ammunition and propulsion systems, involve the use, manufacture and/or handling of a variety of explosive and flammable materials or other hazardous substances. These activities have resulted and may result in incidents that cause workplace injuries and fatalities, the temporary shut down or other disruption of manufacturing, production delays, environmental harm and expense, fines and liabilities to third parties. We have safety and loss prevention programs, which provide for pre-construction reviews, along with safety audits of operations involving explosive materials, to attempt to avoid or mitigate some such incidents, as well as potentially insurance coverage and indemnification to address resulting liabilities, but they may not be successful.\nIn addition, our customers may use, handle or test our products and services in ways that can be unusually hazardous or risky, or in ways that are not intended, not authorized or inconsistent with guidance and warnings, which may create potential liabilities for our company, as well as reputational harm. \n•\nWe may not be able to adequately protect and fully exploit our intellectual property rights or obtain necessary rights to intellectual property of others, which could materially and adversely affect our ability to compete and perform on contracts, and have a material adverse effect on our reputation and our financial position, results of operations and/or cash flows.\nTo perform on our contracts and to win new business, we depend on our ability to develop, protect and exploit our intellectual property and use the intellectual property of others. Increasing demands from our customers to access and obtain rights in our intellectual property, and positions taken by our suppliers and competitors challenge our ability to protect and exploit intellectual property.\nWe own many forms of intellectual property, including trade secrets, U.S. and foreign patents, trademarks, and copyrights, and we license or otherwise obtain access to various intellectual property rights of third parties. The U.S. government and certain foreign governments hold licenses or other rights to certain intellectual property that we develop in performance of government contracts, and at times seek to use or authorize others to use such intellectual property, including in competition with us. Governments continue to increase efforts to obtain more extensive rights in contractors’ intellectual property, including where we do not believe they are entitled to do so under current law. This could reduce our ability to develop, protect and exploit certain of our intellectual property rights and to compete. \n-19-\nNORTHROP GRUMMAN CORPORATION\nOur products and services embody valuable trade secrets, proprietary information and know-how. We typically seek to protect this information by entering into confidentiality and intellectual property agreements with our employees and third parties such as consultants, collaborators and suppliers. These agreements and other measures may not provide adequate protection for our trade secrets and other proprietary information. In the event of misuse, theft or misappropriation of such intellectual property rights or breach of confidentiality obligations, we may not have adequate legal remedies. In addition, our trade secrets or other proprietary information may otherwise become known or be independently developed by competitors.\nIn some instances, our ability to win or perform contracts requires us to use third party intellectual property. This may require the government or our customer to provide rights to such third party intellectual property or for us to negotiate directly with third parties to obtain necessary rights on reasonable terms,which may not be practicable. \nOur intellectual property is subject to challenge, invalidation, or circumvention by third parties. Our access to and use of intellectual property licensed or otherwise obtained from third parties is also subject to challenges. Litigation to determine the scope of intellectual property rights, even if ultimately successful, has been and could in the future be costly. Moreover, the legal framework concerning intellectual property rights varies among countries and the protections under foreign laws and courts may not be favorable.\nGeneral and Other Risk Factors \n•\nOur insurance coverage, customer indemnifications or other liability protections may be unavailable or inadequate to cover our significant risks, which could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe endeavor to obtain insurance from financially stable, responsible, highly rated counterparties in established markets to cover significant risks and liabilities (including, for example, natural disasters, space launches and on-orbit operations, cyber security, hazardous operations, energetics and products liability). Not every risk or liability can be insured, and insurance coverage is not always reasonably available. The policy limits and terms of coverage reasonably obtainable may not be sufficient to cover actual losses or liabilities. For example, the space insurance markets are experiencing increased price volatility and capacity constraint. Due to recent increases in the frequency and severity of losses, insurers are decreasing limits, increasing pricing and some have exited the market. Even if insurance coverage is available, we are not always able to obtain it at a price or on terms acceptable to us or without increasing exclusions. Disputes with insurance carriers over the availability of coverage, and the insolvency of one or more of our insurers has affected and may continue to affect the availability or timing of recovery, as well as our ability to obtain insurance coverage at reasonable rates in the future. In some circumstances we may be entitled to certain legal protections or indemnifications from our customers through contractual provisions, laws or otherwise. However, these protections are not always available, are difficult to negotiate and obtain, are typically subject to certain terms or limitations, including the availability of funds, and may not be sufficient to cover our losses or liabilities.\n•\nPension and other postretirement benefit (OPB) obligations and related expenses and funding requirements may fluctuate significantly depending upon investment performance of plan assets, changes in actuarial assumptions, and legislative or other regulatory actions.\nThe company’s pension and OPB obligations and related expenses are dependent upon the investment performance of plan assets and various assumptions, including discount and interest rates, mortality and the estimated long-term rates of return on plan assets. Changes in assumptions associated with our pension and OPB plans, investment performance of plan assets, and gains or losses associated with changes in valuation of marketable securities related to our non-qualified plans and other non-operating assets could have a material adverse effect on our financial position, results of operations and/or cash flows.\nFunding requirements for our pension plans, including Pension Benefit Guaranty Corporation premiums, are subject to legislative and other government regulatory actions. In accordance with government regulations, pension plan cost recoveries under our U.S. government contracts may occur in different periods from when they are recognized for financial statement purposes or when pension funding is made. These timing differences, as well as government challenges to pension and OPB cost recovery, could have a material adverse effect on our financial position, results of operations and/or cash flows. \n•\nBusiness investments and/or recorded goodwill and other long-lived assets may become impaired, which could have a material adverse effect on our financial condition and/or results of operations.\nGoodwill is an intangible asset that we recognize in connection with acquisitions of third-party businesses. Goodwill accounts for approximately 35 percent of our total assets as of December 31, 2024. Other long-lived assets \n-20-\nNORTHROP GRUMMAN CORPORATION\nprincipally comprise property, plant and equipment (PP&E) used in operating our business. The cost of PP&E utilized in support of our commercial business, including approximately $575 million of PP&E in our commercial space business, is not allocable to government contracts and is therefore subject to greater recoverability risk than PP&E utilized in support of our U.S. government contracts. Although the fair value of our reporting units and the net realizable value of our other long-lived assets currently exceed their respective carrying values, changes in business conditions, the market-based inputs used in our goodwill impairment test, or our assumptions related to the recoverability of our long-lived assets, could result in significant write-offs of goodwill or other long-lived assets.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nWe recognize the critical importance of maintaining the safety and security of our systems and data and have a holistic process for overseeing and managing cybersecurity and related risks. This process is supported by both management and our Board of Directors.\nIn 2024, our global cybersecurity function was maintained in our Chief Information Office, led by our Chief Information Officer (CIO), who reported to our CEO. In 2025, we have brought together our chief information and digital transformation offices into a newly formed Chief Information and Digital Office, led by our Chief Information and Digital Officer (CIDO), who reports to the CEO. The \nChief Information Security Officer (CISO)\n, who previously reported to the CIO, now reports to the CIDO and continues to lead our cybersecurity functions.\n \nThe CISO is responsible for the assessment and management of cybersecurity risk and the resiliency, protection and defense of our networks and systems\n. \nThe CISO leads a team of cybersecurity professionals with broad experience and expertise, including in cybersecurity threat assessments and detection, mitigation technologies, cybersecurity training, incident response, cyber forensics, data protection, privacy, insider threats and regulatory compliance. The current CISO is an executive with extensive technical and operational experience in building and leading cybersecurity and resiliency teams in the industry and government.\n \nOur \nBoard of Directors\n is responsible for overseeing our enterprise risk management activities in general, and \neach of our Board committees assists the Board in the role of risk oversight\n. The full Board receives an update on the company’s risk management process and the risk trends related to cybersecurity at least annually.\n \nThe \nAudit and Risk Committee\n specifically assists the Board in its oversight of risks related to cybersecurity\n.\n To help ensure effective oversight, the CISO briefs the Audit and Risk Committee on the company’s information security and cybersecurity risk posture at least four times a year.\nIn addition, the company’s \nEnterprise Risk Management Council (ERMC)\n considers risks relating to cybersecurity, among other significant risks, and applicable mitigation plans to address such risks. The ERMC is comprised of the Executive Leadership Team, as well as the Chief Accounting Officer, Chief Ethics and Compliance Officer, Corporate Secretary, Chief Sustainability Officer, Treasurer and Vice President, Internal Audit. \nThe \nCISO\n and the \nCIDO\n (previously the CIO) attend each ERMC meeting. The ERMC meets during the year and receives periodic updates from the CIDO and CISO on cybersecurity risks. We have an established process governing our response to a cybersecurity incident from detection to mitigation, recovery, assessment, internal and external notifications and functional stakeholder engagements with legal, privacy and risk management, among others. Depending on the nature and severity of an incident, this process provides for escalating notification to our CEO and the Board (including our Lead Independent Director and the Audit and Risk Committee chair), as appropriate.\nOur approach to cybersecurity risk management includes the following key elements:\n•\nMulti-Layered Defense and Continuous Monitoring \n– We work to protect our computing environments and products from cybersecurity threats through multi-layered defenses and apply lessons learned from our defense and monitoring efforts to help prevent future attacks. We utilize data analytics to detect anomalies and search for cyber threats. Our Cybersecurity Operations Center provides comprehensive cyber threat detection and response capabilities and maintains a 24x7 monitoring system which complements the technology, processes and threat detection techniques we use to monitor, manage and mitigate cybersecurity threats or vulnerabilities. From time to time, we engage third-party consultants or other advisors to assist in assessing, identifying and/or managing cybersecurity threats. We also periodically use our Internal Audit function to conduct additional reviews and assessments. \n•\nInsider Threats\n – We maintain an insider threat program, led by our Vice President, Corporate and Enterprise Security, designed to identify, assess, and address potential risks from within our company. Our \n-21-\nNORTHROP GRUMMAN CORPORATION\n                        \nprogram evaluates potential risks consistent with industry practices, customer requirements and applicable law, including privacy and other considerations.\n•\nInformation Sharing and Collaboration\n – We work with government, customer, industry and/or supplier partners, such as the National Defense Information Sharing and Analysis Center and other government-industry partnerships, to gather and develop best practices and share information to address cyber threats. These relationships enable the rapid sharing of threat and vulnerability mitigation information across the defense industrial base and supply chain.\n•\nThird Party Risk Management\n – We conduct cybersecurity assessments before sharing or allowing the hosting or processing of sensitive data in computing environments managed by third parties, and our standard terms and conditions contain contractual provisions requiring certain cybersecurity and data protections and controls. Finally, we require these third parties to notify us promptly of cyber incidents or data breaches so that we can assess potential impact on us.\n•\nTraining and Awareness\n – We provide annual cybersecurity and information security awareness training to our employees with network access to help identify, avoid and mitigate cybersecurity threats and insider risks. This training also includes awareness about the policies and guidance associated with data privacy and protection of personal information, and protection and security of our company, customer and other third-party data. Our employees with network access also participate in annual spear phishing exercises. We also periodically host cybersecurity and ransomware tabletop exercises with management and other company functional stakeholders to practice rapid cyber incident response.\n•\nSupplier Engagement\n – We provide training and other resources to our suppliers to support cybersecurity resiliency and data security principles in our supply chain. We also require our suppliers, subcontractors and third-party service providers to comply with our standard cybersecurity-related terms and conditions, in addition to any requirements from our customers, as a condition of doing business with us, and require them to complete information security questionnaires to review and assess any potential cyber-related risks depending on the nature of the services or products being provided. \n•\nThird Party Cybersecurity Service Providers\n – We engage third party service providers to expand the capabilities and capacity of our cybersecurity program, including for design, monitoring and testing of the program’s risk prevention and protection measures and process execution, including incident detection, investigation, analysis and response, eradication and recovery. Additionally, several external entities evaluate our cybersecurity program, including the \nU.S. Defense Contract Management Agency, the Defense Industrial Base Cybersecurity Assessment Center and a Cybersecurity Maturity Model Certification Third Party Assessment Organization\n, to assess and certify our cybersecurity regulatory compliance. We also engage with external auditors and consultants who conduct audits and assessments of our cybersecurity controls.\n•\nProduct Security\n – We provide cyber threat intelligence to, and collaboration with, our product security teams and share expertise in cyber vulnerability, exploit and resilience technology that can be applied to network infrastructure and company product offerings.\n \nWhile we have experienced cybersecurity incidents in the past, to date none have materially affected the company or our financial position, results of operations and/or cash flows.\n \nWe continue to invest in the cybersecurity and resiliency of our networks and products and to enhance our internal controls and processes, which are designed to help protect our programs, systems and infrastructure, and the information they contain.\n For more information regarding the risks we face from cybersecurity threats, please see “Risk Factors.”\nFORWARD-LOOKING STATEMENTS AND PROJECTIONS\nThis Annual Report on Form 10-K and the information we are incorporating by reference contain statements that constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as “will,” “expect,” “anticipate,” “intend,” “may,” “could,” “should,” “plan,” “project,” “forecast,” “believe,” “estimate,” “guidance,” “outlook,” “trends,” “goals” and similar expressions generally identify these forward-looking statements. Forward-looking statements include, among other things, statements relating to our future financial condition, results of operations and/or cash flows. Forward-looking statements are based upon assumptions, expectations, plans and projections that we believe to be reasonable when made, but which may change over time. These statements are not guarantees of future performance and inherently involve a wide range of risks and uncertainties that are difficult to predict. Specific risks that could cause actual results to differ materially from those expressed or implied in these forward-looking statements include, but are not limited to, those identified \n-22-\nNORTHROP GRUMMAN CORPORATION\n                        \nunder “Risk Factors” and other important factors disclosed in this report and from time to time in our other filings with the SEC. They include:\nIndustry and Economic Risks\n•\nour dependence on the U.S. government for a substantial portion of our business\n•\nsignificant delays or reductions in appropriations and/or for our programs, and U.S. government funding and program support more broadly, including as a result of a prolonged continuing resolution and/or government shutdown, and/or related to the global security environment or other global events\n•\nsignificant delays or reductions in payments as a result of or related to a breach of the debt ceiling\n•\nthe use of estimates when accounting for our contracts and the effect of contract cost growth and our efforts to recover or offset such costs and/or changes in estimated contract costs and revenues, including as a result of inflationary pressures, labor shortages, supply chain challenges and/or other macroeconomic factors, and risks related to management’s judgments and assumptions in estimating and/or projecting contract revenue and performance which may be inaccurate \n•\nincreased competition within our markets and bid protests\n•\ncontinued pressures from macroeconomic trends, including on costs, schedules, performance and ability to meet expectations\nLegal and Regulatory Risks\n•\ninvestigations, claims, disputes, enforcement actions, litigation (including criminal, civil and administrative) and/or other legal proceedings \n•\nchanges in procurement and other laws, SEC, DoD and other rules and regulations, contract terms and practices applicable to our industry, findings by the U.S. government as to our compliance with such requirements, more aggressive enforcement of such requirements and changes in our customers’ business practices globally\n•\nthe improper conduct of employees, agents, subcontractors, suppliers, business partners or joint ventures in which we participate, including the impact on our reputation and our ability to do business\n•\nenvironmental matters, including climate change, unforeseen environmental costs and government and third-party claims\n•\nunanticipated changes in our tax provisions or exposure to additional tax liabilities\nBusiness and Operational Risks\n•\ncyber and other security threats or disruptions faced by us, our customers or our suppliers and other partners, and changes in related regulations \n•\nthe performance and viability of our subcontractors and suppliers and the availability and pricing of raw materials, chemicals, parts and components, particularly with inflationary pressures, increased costs, shortages in labor and financial resources, supply chain disruptions, and extended material lead times\n•\nour ability to attract and retain a qualified and talented workforce with the necessary security clearances to meet our performance obligations \n•\nour exposure to additional risks as a result of our international business, including risks related to global security, geopolitical and economic factors, misconduct, suppliers, laws and regulations\n•\nnatural disasters, epidemics, pandemics and similar outbreaks and other significant disruptions\n•\nour ability to innovate, develop new products and technologies, progress and benefit from digital transformation and maintain technologies to meet the needs of our customers \n•\nproducts and services we provide related to hazardous and high risk operations, including the production and use of such products, which subject us to various environmental, regulatory, financial, reputational and other risks\n•\nour ability appropriately to protect and exploit intellectual property rights \n-23-\nNORTHROP GRUMMAN CORPORATION\n                        \nGeneral and Other Risk Factors\n•\nthe adequacy and availability of, and ability to obtain, insurance coverage, customer indemnifications or other liability protections\n•\nthe future investment performance of plan assets, gains or losses associated with changes in valuation of marketable securities related to our non-qualified benefit plans, changes in actuarial assumptions associated with our pension and other postretirement benefit plans and legislative or other regulatory actions impacting our pension and postretirement benefit obligations\n•\nchanges in business conditions that could impact business investments and/or recorded goodwill or the value of other long-lived assets, and other potential future liabilities\nYou are urged to consider the limitations on, and risks associated with, forward-looking statements and not unduly rely on the accuracy of forward-looking statements. These forward-looking statements speak only as of the date this report is first filed or, in the case of any document incorporated by reference, the date of that document. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law."
  }
}