{
  "ticker": "NTAP",
  "cik": "0001002047",
  "company_name": "NetApp, Inc.",
  "filing_date": "2025-06-09",
  "accession": "0000950170-25-083705",
  "primary_doc": "ntap-20250425.htm",
  "item_sections": {
    "item1": "Item 1.  \nBusiness\nOverview\nNetApp, Inc. (NetApp, we, us, or the Company) helps customers make their data infrastructure more seamless, more dynamic, and higher performing. We were incorporated in 1992, are headquartered in San Jose, California, and provide a full range of enterprise-class software, systems and services that customers use to transform their data infrastructures across data types, workloads, and environments to realize business possibilities.\n \nWe leverage over thirty years of innovation to make data infrastructure intelligent. Our unified data storage solutions deliver flexible, simplified, and silo-free infrastructure. Our active data management capabilities focus on security, compliance, and sustainability, while our adaptive operations enhance performance, efficiency, and productivity. Our extensive portfolio integrates hybrid and multi-cloud environments, addressing key customer priorities such as modernizing legacy systems, enhancing resilience against ransomware, and developing scalable, high-performance data pipelines for artificial intelligence (AI) workloads.\nNetApp empowers customers to harness their data for accelerated innovation, improved operations, and competitive advantage. Our unified data storage solutions provide the flexibility to consistently and easily store any data type and support any workload. As the only enterprise-grade storage service natively embedded in the world’s largest clouds, we power data across Amazon AWS, Microsoft Azure, and Google Cloud. Our integrated data services enable active data management, security, protection, governance, and sustainability. Additionally, our operational services support adaptive operations across infrastructure, applications, and teams. Together with our Hybrid Cloud products, these services enable customers to construct a seamless, intelligent data infrastructure across hybrid multi-cloud environments.\nTogether, these capabilities comprise an intelligent data infrastructure that delivers:\n \n•\nOperational simplicity, so customers can manage complex workloads and eliminate infrastructure silos across apps, data, and clouds.\n•\nCyber resilience and security, so businesses stay up and running with built-in ransomware protection, rapid recovery, and infrastructure observability. \n•\nAI innovation, embedding intelligence into data infrastructure to enable AI workloads that deliver new levels of productivity and innovation.\n•\nInfrastructure savings, so on-premises and cloud infrastructure spend go further with high-efficiency data storage and automated capacity and cloud cost management.\n•\nSustainability, achieved via energy-efficient technologies, tiering, and analytics.\n•\nScalability and agility to maximize infrastructure and application extensibility and team responsiveness.\nOur strategy revolves around serving the world's most critical organizations by addressing their complex data management challenges in the age of data. We emphasize the importance of an intelligent data infrastructure that provides flexibility, security, and simplicity at scale. This infrastructure integrates seamlessly with hybrid cloud environments, modernizes application portfolios, and enhances security while ensuring efficiency and performance. NetApp’s unified storage and data management platform, along with embedded data and operational services, enables customers to unify their data for AI, recover from malicious attacks, and achieve significant productivity gains through autonomous, self-healing capabilities.\nOur unique approach is built on a unified platform that combines intelligent storage and data architecture with software, AI, and APIs, creating an intelligent data fabric. This platform, exemplified by the ONTAP operating system and BlueXP control plane, provides consistent data experiences and optimized storage operations across on-premises, cloud, and edge environments. Our long history of disciplined execution and architectural excellence has positioned us as a market leader, with a strong presence in the world's leading public clouds and the ability to deliver transformative flexibility and simplicity at scale.\nOur market strategy targets large and growing markets, including hybrid cloud, public cloud, flash storage, block storage, and AI. We are expanding our strong position in the unstructured data market and disrupting the mature block storage market with block-optimized flash storage. Our integration with major public cloud providers like Amazon AWS, Microsoft Azure, and Google Cloud positions us to capitalize on cloud migrations and enterprise workloads. In the AI space, we leverage our expertise in unstructured data management to support the entire AI lifecycle, from data foundations to deploying hybrid cloud architectures, ensuring rapid time-to-market and responsible AI deployment.\n \nProduct, Solutions and Services Portfolio\n \n\n\n6\n\n\n\n\n \n\n\nOur operations are organized into two segments: Hybrid Cloud and Public Cloud.\n \nHybrid Cloud\nHybrid Cloud \nprovides a unified data storage portfolio of storage management and infrastructure solutions that helps customers modernize their data centers. By leveraging on-premises, private cloud and public cloud capabilities, we enable customers to modernize applications with a single solution that supports file, block, and object storage. We deliver a versatile data infrastructure solution suitable for all environments and workloads, including the strategic enterprise AI market. Our Hybrid Cloud portfolio accommodates both structured and unstructured data with unified storage optimized for flash, disk, and cloud storage, capable of handling data-intensive workloads and applications. Hybrid Cloud includes software, hardware, and related support, along with professional and other services.\nData management software\nNetApp ONTAP\n software is our foundational technology that underpins NetApp’s critical storage solutions in the on-premises data center and in private and public clouds. ONTAP includes various data management and protection features and capabilities, including automatic ransomware protection against cyber-attacks, built-in data transport features, and storage efficiency capabilities. ONTAP provides the flexibility to design and deploy a storage environment across the broadest range of architectures – from on-premises to hybrid, private, and public clouds. It can be used in NAS, SAN, object, and container environments, as well as software-defined storage (SDS) situations.\nData integrity, security, and business continuity are at the heart of any company’s data center. With the extensive software tools and utilities delivered in \nONTAP One\n, our all-in-one software license, customers can realize their business continuity goals with time, costs, and personnel savings. With \nNetApp Snapshot\n, customers can create and manage point-in-time file system copies with no performance impact and minimal storage consumption. This is important for continuous data protection of information in read-only, static, and immutable form. \nNetApp SnapCenter Backup Management\n software\n \nis designed to deliver high-performance backup and recovery for database and application workloads hosted on ONTAP storage. \nNetApp SnapMirror Data Replication\n software can replicate data at high speeds across environments. SnapMirror delivers robust data management capabilities for virtualization, protecting critical data while providing the flexibility to move data between locations and storage tiers, including cloud service providers. \nNetApp SnapLock Data Compliance \nsoftware delivers high-performance disk-based data permanence for HDD and SSD deployments.\nONTAP also includes industry-leading cyber resilience solutions that are designed to maximize data protection and security and increase data governance and compliance. NetApp keeps data protected and secured by aligning with the National Institute of Standards and Technology cybersecurity framework, working to block cybersecurity threats and mitigate the high cost of downtime. The built-in, AI-powered Autonomous Ransomware Protection operates natively in the storage layer, combating evolving threats with real-time detection for rapid response and recovery.\nStorage infrastructure\n \nNetApp All-Flash FAS (AFF A-Series)\n is a scale-out platform built for virtualized and containerized environments, combining low-latency performance via performance-optimized flash solid state drives with best-in-class data management, built-in efficiencies, integrated data protection, multiprotocol support, and nondisruptive operations. AFF A-Series, powered by ONTAP, allows customers to connect to clouds for more data services, data tiering, caching, and disaster recovery. The AFF A-Series has a portfolio of products designed for multiple markets and price/performance considerations, from smaller channel commercial market offerings to large-scale, global enterprises.\nNetApp All-Flash FAS with capacity flash (AFF C-Series) \nprovides customers with capacity-optimized flash solid state drives which balance performance and affordability. AFF C-Series arrays, powered by ONTAP, are sustainable, scalable, and secure solutions for Tier 1 and Tier 2 applications. The AFF C-Series is ideal for transitioning from hybrid/HDD to all-flash storage; running non-latency sensitive VMware database applications and file environments; and providing a solution for secondary storage targets for disaster recovery, backup, and tiering.\n \nNetApp All-Flash SAN Array (ASA A-Series & C-Series) \nis NetApp’s modern block storage with best-in-class speed, efficiency, security, sustainability, and cloud integration to accelerate virtual machines and databases. ASA arrays are also powered by NetApp ONTAP but optimized and simplified for SAN workloads. The ASA includes a 99.9999% guaranteed uptime and guaranteed 4:1 storage efficiency.\nNetApp Fabric Attached Storage (FAS)\n series\n \nare high-capacity data storage devices powered by NetApp ONTAP. NetApp FAS Storage Arrays provide customers with a balance of performance and capacity running disk drives or hybrid-flash configurations. FAS systems are suitable for secondary storage targets for disaster recovery, backup, and tiering.\n\n\n7\n\n\n\n\n \n\n\nNetApp E/EF series\n is built for dedicated, high-bandwidth applications that need simple, fast SAN storage with enterprise-grade reliability. The E-Series is available as a hybrid-flash platform, while the EF-Series is all-flash. Built on the SANtricity storage operating system, the E/EF-Series storage appliances are designed for performance-sensitive workloads like real-time analytics, high-performance computing, and databases.\n \nNetApp StorageGRID\n is a software-defined object storage solution for large archives, media repositories, and web data stores. Using the industry-standard object APIs like the Amazon Simple Storage Service (S3), StorageGRID is provided as a NetApp-branded storage solution and as a software-defined solution on third-party hardware.\n \n \nPublic Cloud\nPublic Cloud\n offers a portfolio of products delivered primarily as-a-service, including related support. This portfolio includes cloud storage, data services and operational services. As the only provider of enterprise-grade storage services natively embedded in the world’s largest public cloud providers, NetApp helps organizations harness the power of their data and applications. NetApp’s services leverage AI to maximize productivity across infrastructure and applications, boost team productivity, and reduce operations costs. These solutions and services are generally available on the leading public clouds, including Amazon AWS, Microsoft Azure, and Google Cloud.\n \nCloud storage\nFully managed cloud storage offerings are available natively on Microsoft Azure as \nAzure NetApp Files\n, on Amazon AWS as \nAmazon FSx for NetApp ONTAP\n, and on Google Cloud as \nGoogle Cloud NetApp Volumes.\n \nIn addition, NetApp offers \nNetApp Cloud Volumes ONTAP \non Amazon AWS, Google Cloud, and Microsoft Azure, a cloud-based software for customers who wish to manage their own cloud storage infrastructure.\n \nOur cloud storage services are based on the same ONTAP data management software that underpins our on-premises ONTAP storage infrastructure offerings.\n \nManageability\nAt the center of our hybrid multi-cloud storage and data service offerings is \nNetApp BlueXP\n. BlueXP is a unified control plane that enables customers to manage their entire data landscape through one single, web-based Software-as-a-Service (SaaS)-delivered control point. NetApp BlueXP combines storage and data services via its unified control plane to change how hybrid, multicloud environments are managed, optimized, and controlled. An intuitive interface and powerful automation help decrease resource waste, complexity, and the risk of managing diverse environments. It brings customers operational simplicity in a complex world. Within BlueXP are standard and optional capabilities (services) that allow customers to control their data and operations.\nWith \nBlueXP Copy and Sync\n, customers can migrate data to the cloud securely and efficiently. Customers can choose where to deploy primary workloads without re-architecting applications or databases. \nBlueXP Backup and Recovery\n delivers seamless and cost-effective backup and restore capabilities for protecting and archiving cloud and on-premises data managed by ONTAP. \nBlueXP\n \nClassification \nservice provides data discovery, mapping, and classification driven by AI algorithms with automated controls and reporting for data privacy regulations such as the General Data Protection Regulation (GDPR), California Consumer Privacy Act (CCPA), and more. Lastly, \nBlueXP Ransomware Protection \nprovides AI-driven protection of workloads, with integrated real-time detection and ability to respond quickly to threats and recover in minutes.\n \nOperational services\nNetApp Data Infrastructure Insights \n(formally called\n \n“Cloud Insights”) is an infrastructure monitoring tool that gives organizations visibility into their entire infrastructure. It can monitor, troubleshoot, and optimize costs across all resources, including public clouds and private data centers. Working in conjunction with the BlueXP manageability and control plane services, customers can have deep insights into their data operations.\nInstaclustr \nprovides fully managed open-source databases, pipelines, and workflow applications delivered as a service. Instaclustr helps organizations deliver cloud-native applications at scale by operating and supporting the data infrastructure through its SaaS platform for those designing and building around open-source technologies while not wanting to maintain that infrastructure themselves.\n \nProfessional and Support Services\nNetApp and our certified services partners offer a comprehensive portfolio of assessment, design, implementation, migration, and proactive support services to help customers optimize the performance and efficiency of their on-premises and hybrid multicloud\n \n\n\n8\n\n\n\n\n \n\n\nstorage environments. Our offerings include storage-as-a-service (STaaS), strategic consulting, professional, managed, and support services.\n \n•\nNetApp Keystone\n is our pay-as-you-grow, STaaS offering that delivers a seamless hybrid cloud experience for those preferring operating expense consumption models to upfront capital expense or leasing. With a unified management console and monthly bill for both on-premises and cloud data storage services, Keystone lets organizations provision, monitor, and even move storage spending across their hybrid cloud environment for financial and operational flexibility. \n•\nNetApp \nstrategic consulting services\n provide executive-level, high-touch consulting engagements to help organizations facilitate the alignment of their business and technology goals. Our proven expertise can help organizations define long-term data fabric strategies and operations models to drive IT initiatives for digital transformation.\n \n•\nNetApp’s \nProfessional Services\n offer specialized expertise to minimize risks and simplify designing, implementing, migrating, and integrating NetApp hybrid cloud solutions. This enables businesses to reap the benefits of new technology investments more quickly. Our highly skilled service experts help ensure secure and optimized environments, delivering consistent, high-quality outcomes that meet customers' expectations.\n•\nNetApp \nManaged Services\n can optimize the performance and efficiency of your IT infrastructure, whether you have a hybrid cloud or on-premises environment. Our experienced NetApp experts follow a proven methodology and industry best practices to monitor, administer, operate, and optimize your IT environment. This allows your organization's IT staff to focus on driving business initiatives forward, without worrying about the day-to-day management of your IT infrastructure.\n•\nNetApp \nGlobal Support\n offers a wide range of solutions, including systems, processes, and personnel, to support uninterrupted operation in complex and critical environments. Our focus is on providing proactive and preemptive technology support to help ensure operational continuity across the NetApp hybrid cloud. We offer personalized support options that provide actionable intelligence to resolve problems faster, minimize downtime, and optimize the performance of the entire NetApp ecosystem.\nSales, Principal Markets, and Distribution Channels\nWe market and sell our products and services in numerous countries throughout the world. Our sales efforts are organized around the evolving needs of our current and targeted customers, and our marketing initiatives reflect this focus. NetApp uses a multichannel distribution strategy. We sell our products, solutions and services to end-user business customers and service providers through a direct sales force and an ecosystem of partners, including the leading cloud providers. Our marketing is focused on building our brand reputation, creating market awareness, communicating customer advantages and generating demand for our sales force and channel partners.\nOur diversified customer base spans industry segments and vertical markets such as energy, financial services, government, technology, internet, life sciences, healthcare services, manufacturing, media, entertainment, animation, video postproduction and telecommunications. NetApp focuses primarily on the enterprise storage and data management, cloud storage and cloud operations markets. We design our products to meet the evolving requirements of a hybrid, multicloud world, driven by digital transformation and cloud initiatives.\nOur partnerships with the industry’s leading cloud, infrastructure, consulting, application, and reseller partners are created with one goal in mind: the success of our customers. Global enterprises, local businesses, and government agencies look to NetApp and our ecosystem of partners to help maximize the business value of their IT and cloud investments.\nWe work with a wide range of partners for our customers, including technology partners, value-added resellers, system integrators, OEMs, service providers and distributors. During fiscal 2025, sales through our indirect channels represented 78% of our net revenues. Our global partner ecosystem is critical to NetApp’s growth and success. We are continually strengthening existing partnerships and investing in new ones to ensure we are meeting the evolving needs of our customers.\nAs of April 25, 2025, our worldwide sales and marketing functions consisted of approximately 5,100 managers, sales representatives and technical support personnel. We have offices in approximately 26 countries. Sales to customers Arrow Electronics, Inc. and TD Synnex Corporation accounted for 21% and 24% of our net revenues, respectively, in fiscal 2025. Information about sales to and accounts receivables from our major customers, segment disclosures, foreign operations and net sales attributable to our geographic regions is included in Note 15 – Segment, Geographic, and Significant Customer Information of the Notes to Consolidated Financial Statements included in Part II, Item 8.\n\n\n9\n\n\n\n\n \n\n\nSeasonality\nWe have historically experienced a sequential decline in revenues in the first quarter of our fiscal year, as the sales organization spends time developing new business after higher close rates in the fourth quarter, and because sales to European customers are typically weaker during the summer months. We derive a substantial amount of our revenue in any given quarter from customer orders booked in the same quarter. Customer orders and revenues typically follow intra-quarter seasonality patterns weighted toward the end of the quarter. If recurring services and cloud revenue continue to increase as a percentage of our total revenues, historical seasonal patterns may become less pronounced.\nBacklog\nWe manufacture products based on a combination of specific order requirements and forecasts of our customers’ demand. Orders are generally placed by customers on an as-needed basis. A substantial portion of our products is sold on the basis of standard purchase orders that are cancelable prior to shipment without penalty. In certain circumstances, purchase orders are subject to change with respect to quantity of product or timing of delivery resulting from changes in customer requirements. Our business is characterized by seasonal and intra-quarter variability in demand, as well as short lead times and product delivery schedules. Accordingly, backlog at any given time may not be a meaningful indicator of future revenue.\nManufacturing and Supply Chain\nWe have outsourced manufacturing operations to third parties located in Fremont, California; San Jose, California; Guadalajara, Mexico; Schiphol Airport, The Netherlands; Helmond, The Netherlands; Tiszaujvaros, Hungary; Taoyuan City, Taiwan; and Singapore. These operations include materials procurement, commodity management, component engineering, test engineering, manufacturing engineering, product assembly, product assurance, quality control, final test, and global logistics. We rely on a limited number of suppliers for materials, as well as several key subcontractors for the production of certain subassemblies and finished systems. We strive to have multiple suppliers qualified to provide critical components where possible and have our products manufactured in a number of locations to mitigate our supply chain risk. Our strategy has been to develop close relationships with our suppliers, maximizing the exchange of critical information and facilitating the implementation of joint quality programs. We use contract manufacturers for the production of major subassemblies and final system configuration. This manufacturing strategy minimizes capital investments and overhead expenditures while creating flexibility for rapid expansion.\nWe are certified to the International Organization for Standardization (ISO) 9001:2015 and ISO 14001:2015 certification standards. We have been Tier 2 certified under the U.S. Customs and Border Protection’s (CBP) Customs Trade Partnership Against Terrorism (CTPAT) program since January 2015.\nResearch and Development\nOur research and development team delivers innovation to help customers create an evolved cloud experience. Our R&D structure allows us to align and accelerate the execution of our strategies and roadmaps across product groups. We leverage our talent and shared IP for cloud- and hybrid-cloud solutions to remain agile to changing market conditions. Our R&D priorities are defined by how we can help customers realize operational simplicity, cyber resilience and security, AI innovation, infrastructure savings and agility, and sustainability. We design our products and services from the ground up with cloud connectivity in mind, including our capabilities for cyber resiliency, tiering, disaster recovery, replication, bursting, and migration.\nWe conduct research and development activities in various locations throughout the world. Total research and development expenses were $1,012 million in fiscal 2025, $1,029 million in fiscal 2024 and $956 million in fiscal 2023. These costs consist primarily of personnel and related expenses incurred to conduct product development activities. Although we develop many of our products internally, we also acquire technology through business combinations or through third party licensing when appropriate. We believe that technical leadership is essential to our success, and we expect to continue to commit substantial resources to research and development.\nCompetition\nWe operate in an industry with rapid technological advances in hardware, software, and related service offerings. Cloud, digital transformation, and AI initiatives are driving customer and solution requirements changes.\nWe compete with many companies in the storage and data management markets. Our hybrid cloud solutions primarily compete with legacy IT and storage vendors. Some offer a broad spectrum of products, solutions and services and others offer a more limited set of storage and data-management products, solutions or services. In the emerging AI market, we encounter both our traditional competitive set, as well as newer entrants, focused primarily on the AI model training space. Additionally, public cloud providers offer customers storage as an operating expense which competes with more traditional storage offerings that customers acquire\n \n\n\n10\n\n\n\n\n \n\n\nthrough capital expenditures. We both partner with and compete against cloud providers with our public cloud software and services. Legacy vendors are not often encountered as competitors in the cloud storage services market.\nWe compete with many companies in the cloud operations marketplace, including new companies (startups) and larger software companies who target developers, and operations engineering (DevOps). Some companies have single point solutions that compete with one of our services and others are building platforms. Additionally, public cloud providers offer similar services on their own cloud.\nWe face ongoing product and price competition in all areas of our business, including from both branded- and generic-product competitors.\n \nOur current and potential competitors may establish cooperative relationships among themselves or with third-parties, including some of our partners. New competitors or alliances among competitors might emerge and further increase competitive pressures.\nWe consider our hardware, software innovation, cloud integration, and technology partnerships key to our competitive differentiation. We believe our competitive advantage also includes the nature of the relationships we form with our customers and partners worldwide. We strive to deliver an outstanding experience in every interaction we have with our customers and partners through our product, service, and support offerings, which enables us to provide our customers with a full range of expertise before, during and after their purchases.\nProprietary Rights\nWe generally rely on patent, copyright, trademark, trade secret and contract laws to establish and maintain our proprietary rights in our technology, products and services. While our intellectual property rights are important to our success, we believe that our business is not materially dependent on any particular patent, trademark, copyright, license or other individual intellectual property right. We have been granted, or own by assignment\n,\n well over two thousand U.S. patents, hundreds of pending U.S. patent applications, and many corresponding patents and patent applications in other countries. From time to time, we may make certain intellectual property available under an open source license. Our primary trademarks are NetApp and the NetApp design logo, which are registered trademarks in the U.S. and in many other countries.  In addition, we have trademarks and trademark registrations in the U.S. and other countries covering our various product or service names.\nWe generally enter into confidentiality agreements with our employees, resellers, distributors, customers, and suppliers. In addition, through various licensing arrangements, we receive certain rights to the intellectual property of others. We expect to maintain current licensing arrangements and to secure additional licensing arrangements in the future, as needed and to the extent available on reasonable terms and conditions, to support continued development and sales of our products and services. Some of these licensing arrangements require or may require royalty payments and other licensing fees. The amount of these payments and fees may depend on various factors, including but not limited to the structure of royalty payments; offsetting considerations, if any; and the degree of use of the licensed technology.\nThe industry in which we compete is characterized by rapidly changing technology, a large number of patents, and frequent claims and related litigation regarding intellectual property rights, and we may be exposed to various risks related to such claims or legal proceedings. If we are unable to protect our intellectual property, we may be subject to increased competition that could materially and adversely affect our business operations, financial condition, results of operations and/or cash flows.\nEnvironmental Disclosure\nWe believe that our commitment to helping our customers and partners succeed and to positively affecting the communities where our employees work and live supports our efforts to deliver value to our stockholders. We are committed to the reduction of greenhouse gas emissions; the efficient use of resources; and reducing, relative to the growth of the Company, the environmental impacts from our operations, products, and services, as well as complying with laws and regulations related to these areas.\n \nWe voluntarily measure, monitor, and publicly report our scope 1, scope 2, and scope 3 (partial) greenhouse gas emissions and water impacts. We seek to optimize the energy efficiency of our buildings, labs, and data centers; and we have increased our use of renewable energy, especially at our facilities in Bangalore, India (95% of the total energy consumed is renewable); Cork, Ireland (100% of electricity consumed is from renewable energy) and Wichita, Kansas (100% of the electricity consumed is produced by renewable wind energy).\nAt the global, regional and state levels, various laws and regulations have been implemented or are under consideration to mitigate or report on the effects of climate change. Environmental laws are complex and have tended to become more stringent over time. However, it is difficult to anticipate future regulations pertaining to environmental matters and to estimate their impacts on our operations. Additionally, we have implemented disaster recovery and business resiliency measures to mitigate the physical risks our\n \n\n\n11\n\n\n\n\n \n\n\nfacilities, business, and supply chain might face as a consequence of natural disasters, earthquakes, floods, droughts, and other such occurrences or severe weather/climate-related phenomena.\nWe are subject to international, federal, state, and local regulations regarding workplace safety and protection of the environment. Various international, federal, state, and local provisions regulate the use and discharge of certain hazardous materials used in the manufacture of our products. Failure to comply with environmental regulations in the future could cause us to incur substantial costs, subject us to business interruptions or cause customers to cease purchasing from us. We strive to comply with all applicable environmental laws. All of our products meet the applicable requirements of the following European Union (EU) directives: Registration, Evaluation, Authorisation and Restriction of Chemicals (REACH); Energy Related Products (ErP); and Restriction of Hazardous Substances (RoHS). We also comply with the China RoHS directive. We have a global product take-back program and an e-waste scheme to comply with the EU directive on Waste Electrical and Electronic Equipment (WEEE), and Extended Producer Responsibility (EPR) regulations in India, Singapore and California.\nWe have maintained an environmental management system since December 2004 that provides the framework for setting, monitoring, and continuously improving our environmental goals and objectives. As part of ISO 14001 requirements, we set local environmental performance goals, such as reducing energy use per square foot and minimizing waste generated on site, that are aligned with our overall corporate strategy. We also conduct periodic reviews and are subject to third-party audits of our operations, and we monitor environmental legislation and requirements to help make sure we are taking necessary measures to remain in compliance with applicable laws, not only in our operations but also for our products.\nHuman Capital\nWe take pride in, and believe our success depends on, attracting and retaining leading talent in the industry based on a culture-fit approach. From our inception, NetApp has worked to build a model company and has embraced a culture of openness and trust. Our employees are supported and encouraged to be innovative, and we communicate openly and transparently so that employees can focus on critical and impactful work that ties directly to our business strategy. We continue to invest in our global workforce to support inclusion and belonging and our employees’ well-being and development.\n \nBelonging\nWe believe inclusion and belonging lead to more innovation, better access to talent and improved business outcomes. Our strategies are intended to promote a team-based culture, inclusiveness, and to achieve sustained business results.\n \nBenefits, Wellbeing and Engagement\nOur healthcare options offer competitive, comprehensive coverage for our employees and their families, including:\n \n•\nNational medical plans;\n•\nRegional medical plans;\n•\nExpert advice from world-renowned doctors through our medical second opinion program;\n•\nNational dental plans;\n•\nNational vision plans; and\n•\nA robust wellness program.\nInsurance and income protection\n. We provide life, accidental death and dismemberment and disability insurance programs. For additional peace of mind, we also offer supplemental insurance for our employees and their dependents.\nFinancial and savings programs.\n We offer flexible spending accounts, an employee stock purchase plan and competitive retirement plans, including options to maximize retirement savings.\n \nFlexible Work.\n We offer a flexible hybrid work program that allows employees, in consultation with their managers and teams, flexibility around where, when and how work is performed to deliver business outcomes, understanding that certain roles may be tied to specific locations or require an in-office presence due to business needs and job responsibilities, and to collaborate and connect most effectively. We are leaning into digital-first workflows, tools, and resources and programs to continuously promote flexibility, while enabling us to be productive, wherever we are. We also believe in the value of people being together, building relationships, fostering trust, collaboration and innovation. We have evolved into a hybrid model, in which employees who are assigned to an office can divide their work between the office and other locations about half the time. We continue to pilot, test and iterate our approach to support new ways of working and evolving the employee experience.\n\n\n12\n\n\n\n\n \n\n\nEmployee Wellbeing.\n We provide a wide range of wellbeing programs and tools to ensure employees and their families have the resources they need when they need them. We offer emotional wellbeing resources and programs such as back-up child and elder care, student debt repayment, educational assistance, and legal services for employees and their dependents. NetApp also offers a variety of time-off programs to help support our employees who need time-off. Employees also have access to discounts and fitness centers.\nEngagement. \nWe help employees grow, develop and succeed at NetApp by encouraging an open and interactive culture, where individual needs are recognized and met, and Company goals are supported. For employees, growth goals are tied to corporate objectives and key results to ensure that employees are progressing and are supported by management teams.  Managers are encouraged to set aside time at least each quarter to conduct a two-way conversation with each team member to offer feedback, guidance and support on goals, priorities and career development. The Company also conducts surveys that gauge employee sentiment in areas like cross-functional collaboration, manager performance and inclusivity and create action plans to address concerns and amplify opportunities.\n \nGiving Back. \nThe NetApp Cares programs support our employees' efforts to make a positive difference in our communities. In fiscal 2025, NetApp employees donated over 20,900 hours to serve their communities and make an impact around the world. The NetApp Cares programs encourage employees to volunteer through individual, team or company efforts.\nBoard Oversight of Human Capital Management\nOur Board of Directors plays an active role in overseeing the Company's human capital management strategy and programs. Our Talent and Compensation Committee provides oversight of our talent strategy and key programs related to corporate culture, workforce inclusion, talent acquisition, engagement, development and retention.\n \nEmployees\nAs of April 25, 2025, we had approximately 11,700 employees worldwide. None of our employees are represented by a labor union and we consider relations with our employees to be good.\n \nPlease visit our website for more detailed information regarding our human capital programs and initiatives. Nothing on our website shall be deemed incorporated by reference into this Annual Report on Form 10-K.\nInformation About Our Executive Officers\nOur executive officers and their ages as of June 9, 2025, were as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nName\n\n\nAge\n\n\nPosition\n\n\n\n\n\n\nGeorge Kurian\n\n\n58\n\n\nChief Executive Officer\n\n\n\n\n\n\nCésar Cernuda\n\n\n53\n\n\nPresident\n\n\n\n\n\n\nWissam Jabre\n\n\n55\n\n\nExecutive Vice President and Chief Financial Officer\n\n\n\n\n\n\nHarvinder S. Bhela\n\n\n53\n\n\nExecutive Vice President and Chief Product Officer\n\n\n\n\n\n\nElizabeth M. O'Callahan\n\n\n56\n\n\nExecutive Vice President, Chief Administrative Officer, and Secretary\n\n\n\n\nGeorge Kurian \nis the chief executive officer of NetApp, a position he has held since June 1, 2015. He joined our Board of Directors in June 2015. From September 2013 to May 2015, he was executive vice president of product operations, overseeing all aspects of technology strategy, product and solutions development across our portfolio. Mr. Kurian joined NetApp in April 2011 as the senior vice president of the storage solutions group and was appointed to senior vice president of the Data ONTAP group in December 2011. Prior to joining NetApp, Mr. Kurian held several positions with Cisco Systems from 2002 to 2011, including vice president and general manager of the application networking and switching technology group. Additional roles include vice president of product management and strategy at Akamai Technologies from 1999 to 2002, as well as a management consultant at McKinsey and Company and a leader on the software engineering and product management teams at Oracle Corporation. Mr. Kurian is a board member at Cigna Corporation, a global health services company, where he serves on the compliance committee and people resources committee, and holds a BS degree in electrical engineering from Princeton University and an MBA degree from Stanford University.\nCésar Cernuda \ncame to NetApp in July 2020 as president and is responsible for leading the Company’s global go-to-market organization spanning sales, marketing, services, support, and customer success. Mr. Cernuda joined NetApp after a long career at Microsoft that included various leadership roles. Mr. Cernuda is non-executive director and chairman of the ESG committee at Gestamp, an international group dedicated to automotive components. He is also on the advisory boards of Georgetown University’s McDonough School of Business and the IESE Business School – University of Navarra. Mr. Cernuda is a graduate of the Harvard Business School Executive Leadership Program and the Program for Management Development at IESE Business School – University\n \n\n\n13\n\n\n\n\n \n\n\nof Navarra, and he also completed the Leading Sustainable Corporations Programme at Oxford University’s Saïd Business School. He earned his bachelor’s degree in Business Administration from ESIC Business & Marketing School.\nWissam Jabre \njoined NetApp in March 2025 as executive vice president and chief financial officer, overseeing the worldwide finance and investor relations organizations. Mr. Jabre is an accomplished finance executive with over 20 years of experience leading finance organizations and driving value creation through disciplined operational management. Prior to joining NetApp, Mr. Jabre served as the executive vice president and CFO at Western Digital Corporation from February 2022 to February 2025, where he led the global finance organization and oversaw various critical functions. Prior to joining Western Digital, he served as the CFO of Dialog Semiconductor from March 2016 to August 2021. He has also held senior finance positions at prominent technology companies, including Advanced Micro Devices, Freescale Semiconductor (since acquired by NXP Semiconductors), and Motorola. Mr. Jabre's career began at Schlumberger, where he gained valuable experience in both engineering and finance roles. Mr. Jabre holds a B.E. in Electrical Engineering from the American University of Beirut and an MBA from Columbia Business School. He also serves on the board of directors of MKS, Inc. where he serves as a member of the audit committee.\nHarvinder S. Bhela\n joined NetApp in January 2022 as executive vice president and chief product officer. He is responsible for leading NetApp’s product and engineering teams and building our multi-cloud, storage and data services products and solutions. Before joining NetApp, Mr. Bhela spent 25 years at Microsoft where he held multiple executive leadership positions. Most recently he served as corporate vice president of the Microsoft 365 Security, Compliance and Management business. Mr. Bhela holds a Bachelor of Engineering from the University of Mumbai and a Master of Science in Computer Science from the University of Minnesota.\nElizabeth M. O’Callahan \njoined NetApp in 2013 and has served as NetApp’s executive vice president, chief administrative officer, and secretary since March 2025. Prior to her appointment as chief administrative officer, Ms. O’Callahan served as executive vice president, chief legal officer, and secretary from January 2022 to February 2025, senior vice president and general counsel from May 2021 to December 2021, as vice president and deputy general counsel from May 2020 to April 2021, and as vice president, corporate legal from October 2013 to April 2020.  Ms. O’Callahan has over 20 years of experience advising technology companies on a variety of matters, including corporate governance, executive compensation, securities law, employment law, mergers and acquisitions, capital markets transactions, corporate compliance and ethics, data privacy, intellectual property, crisis management, real estate, litigation and government relations. Before joining NetApp, Ms. O’Callahan served in a senior legal role at Xilinx (since acquired by AMD). She began her legal career in private practice in Silicon Valley specializing in corporate law and business litigation. Ms. O’Callahan holds a bachelor’s degree from the University of California at Los Angeles and a J.D. from Santa Clara University.\nAdditional Information\nOur internet address is \nwww.netapp.com.\n We make available through our internet website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, including exhibits, amendments to those reports and other documents filed or furnished pursuant to the Exchange Act of 1934, as soon as reasonably practicable after we electronically file such materials with, or furnish them to, the SEC.\nThe SEC maintains an internet site (\nwww.sec.gov\n) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\n\n\n14\n\n\n\n\n \n\n\nIt\nem 1A.  \nRisk Factors\nThe following discussion and the sections entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” “Quantitative and Qualitative Disclosures About Market Risk” and “Management's Report on Internal Control Over Financial Reporting” reflect our current judgment regarding the most significant risks we face. These risks can and will change in the future.\nRisks Related to Our Business and Industry\nGlobal economic and geopolitical conditions have adversely affected and may in the future continue to adversely affect our industry, business operations, and financial performance, including our revenue growth, profitability, financial condition and cash flows.\nAs a global company, our business is influenced by worldwide economic and market conditions, including, among others, inflation, slower growth, economic downturn or recession, changes in fiscal and monetary policies, higher interest and tax rates, economic uncertainty, political instability, regional conflicts, military warfare, extreme weather events and effects from climate change, natural disasters and pandemics, supply chain interruptions and shortages, changes in laws, reduced consumer confidence and spending, international trade protection measures and disputes (including economic and trade barriers, tariffs, sanctions and export controls), and the threat and potential of retaliatory trade control policies (including retaliatory tariffs). These factors, as well as the fear or anticipation of such conditions, may influence decisions and actions by our key stakeholders and the market generally, and can lead to increased volatility in the IT industry, making it difficult to predict future demand for our products and services. They can also negatively impact the availability of supplies and limit access to capital for our suppliers, customers and partners.\n \nAny of these factors above, as well as other adverse macroeconomic conditions can significantly reduce demand for our products and negatively affect our operating results due to customer concerns about declining demand for their products, reduced asset values, fluctuating energy costs, geopolitical issues, the cost and availability of credit, and the stability of financial institutions, markets, businesses, and governments. These conditions may be widespread, and their resolution could be uncertain. If we are not able to efficiently and effectively resolve such issues in a timely manner, or if our chosen strategies are not successful, then our business, operations and financial condition could be materially adversely impacted. Consequently, these risks and conditions could materially adversely affect our future sales and operating results.\nOur business may be negatively impacted by technological trends in our market or our inability to keep pace with rapid industry, technological, and market changes.\nThe growth in our industry and the markets we compete in is driven by the increasing demand for data, which in turn drives the need for storage and data management solutions. However, our markets could face challenges due to technology transitions, increased storage efficiency, competitive pricing dynamics, changing consumption models, and uncertain macroeconomic conditions. Additionally, the impact of generative artificial intelligence (GenAI) on the storage and data management markets and regulation thereof is still unfolding and could evolve unpredictably.\n \nAs customers undergo their information technology (IT) transformations, leveraging modern architectures and hybrid cloud environments, they seek simpler solutions and new consumption models. This shift is directing spending towards transformational projects and architectures like flash storage, hybrid cloud, cloud storage, and IT as a service. The future impact of these trends on both short- and long-term demand for our products is uncertain, and we may struggle to meet customer demand with the expected level of quality and support for new products or services.\nOur business may suffer if we fail to keep pace with rapid industry, technological, or market changes, or if our products and services are not well-received in the marketplace. These factors, along with other considerations discussed in this Annual Report on Form 10-K, could lead to a decline in customer demand for our products and services, resulting in decreased revenue on a year-over-year basis, as seen in fiscal 2017, 2020, and 2024. If the overall growth rate of industry declines, if specific markets we compete in experience reduced growth, if storage consumption models change, if our new and existing products and services do not gain customer acceptance, or if we do not adapt our sales programs to market changes, our business, operating results, financial condition, and cash flows could be adversely affected.\n \nThe global nature of our business exposes us to risks that could materially harm our operations, revenues, and financial results.\nA significant portion of our operations and revenues are derived from outside of the U.S., and most of our products are sourced and manufactured outside of the U.S. We also have research and development, sales, and service centers internationally. Consequently, our international operations and future financial results could be adversely affected by various economic, business, regulatory, social and political factors in foreign countries. These factors include government controls, local political or economic conditions such as recessions, economic downturns, inflation and political uncertainty, economic sanctions, trade protections and regulations, export and import requirements (including but not limited to government and regulatory authorizations), tariffs, investment restrictions, tax\n \n\n\n15\n\n\n\n\n \n\n\npolicies, treaties or laws, local labor conditions, transportation costs, government spending patterns, geopolitical tensions and uncertainties, acts of terrorism, international conflicts,  natural disasters, and adverse public health developments.\nChanges in laws or policies governing the terms of foreign trade, and in particular increased trade restrictions, tariffs or taxes on imports from countries where we source and/or manufacture products, including the impact on our suppliers and contract manufacturers who may look to pass through additional costs imposed on them, could have a material adverse effect on our business and financial results. The U.S. government has recently enacted changes to U.S. trade policy and has signaled plans for possible additional changes. For example, the U.S. government has imposed sweeping tariffs on certain products and countries and has signaled that further tariffs may be imposed in the future. The U.S. government's tariffs policy remains fluid, with tariffs on certain countries delayed or reduced in scope, and additional tariffs likely to be forthcoming on other countries or specified products. Additional tariffs and restrictive policies, particularly with respect to the tariffs on Mexico, could have a significant impact on our business and results of operations. The exact magnitude of any potential impact remains uncertain given possible further changes in tariffs and increased tensions with U.S. trading partners targeted by tariffs or other restrictive trade policies. Our risk exposure may increase further if any countries levy retaliatory tariffs, taxes, or other trade restrictions or penalties against the United States or U.S. companies.\nAdditionally, ongoing trade tensions between the U.S. and China and recent investment restrictions, such as the U.S. Outbound Investment Security Program, could impact our business and operating results. Any increase in tensions between China and Taiwan, including threats of military actions or escalation of military activities, could adversely affect our or our contract manufacturers’ ability to source key supply chain components included in our products. As a result of Russia’s actions in Ukraine, numerous countries and organizations have imposed sanctions and export controls, while businesses, including the Company, have limited or suspended Russian operations. Russia has likewise imposed currency restrictions and regulations and may further take retaliatory trade or other actions, including the nationalization of foreign businesses. These actions could impact our supply chain, pricing, business and operating results and expose us to cyberattacks. In addition, due to the global nature of our business, we are subject to complex legal and regulatory requirements in the U.S. and the foreign jurisdictions in which we operate and sell our products, including antitrust and anti-competition laws, and regulations related to data privacy, data protection, and cybersecurity. We are also subject to the potential loss of proprietary information due to piracy, misappropriation, or laws that may be less protective of our intellectual property rights than U.S. laws. Such factors have had or could have an adverse impact on our business, operating results, financial condition and cash flows.\n \nWe face exposure to adverse movements in foreign currency exchange rates as a result of our international operations. These exposures may change over time as business practices evolve, and they could have a material adverse impact on our operating results, financial condition and cash flows. We utilize forward and option contracts in an attempt to reduce the adverse impact of exchange rate fluctuations on certain assets and liabilities. Our hedging strategies may not be successful, and currency exchange rate fluctuations could have a material adverse effect on our operating results and cash flows. In addition, our foreign currency exposure on assets, liabilities, and cash flows that we do not hedge could have a material impact on our financial results in periods when the U.S. dollar significantly fluctuates in relation to foreign currencies.\n \nMoreover, in many foreign countries, particularly in those with developing economies, it is a common business practice to engage in activities that are prohibited by NetApp's internal policies and procedures, or laws and regulations applicable to us. There can be no assurance that all our employees, contractors and agents, as well as those companies to which we outsource certain of our business operations, will comply with these policies, procedures, laws and/or regulations. Any such violation could subject us to fines and other penalties, which could have a material adverse effect on our business, operating results, financial condition and cash flows.\nThe dynamic markets in which we operate and our sales and distribution structure make it challenging to forecast revenues, and any disruption could harm our business, operating results, financial condition, and cash flows.\nWe participate in dynamic markets and employ diverse business and sales models, which complicate revenue forecasting. We sell to a wide range of customers across various industries and geographies, both directly and through multiple channels, each with different sales cycles. Most of our sales are made and/or fulfilled indirectly through channel partners, including value-added resellers, systems integrators, distributors, original equipment manufacturers (OEMs), and strategic business partners, including public cloud providers. This structure makes it particularly difficult to predict future revenue, especially within any specific fiscal quarter or year.\n \nOur relationships with our indirect channel partners and strategic business partners are crucial to our success. The loss of one or more of our key indirect channel partners in a particular region, or the failure of our channel or strategic partners, including public cloud providers, to promote our products could negatively impact our operating results. Qualifying and developing new indirect channel partners typically requires significant time and resource investment before achieving acceptable productivity levels.\n \nIf we fail to maintain strong relationships with our indirect channel partners and strategic partners, including public cloud providers, if our partners seek to renegotiate or terminate existing contracts or agreements, or if their financial condition, business, or\n \n\n\n16\n\n\n\n\n \n\n\ncustomer relationships weaken, if they fail to comply with legal or regulatory requirements, or if we cease to do business with them for these or other reasons, our business, operating results, financial condition and cash flows could be adversely affected.\n \nOur business, operating results, financial condition, and cash flows could be adversely affected if we are unable to develop, introduce and gain market acceptance for new products and services while managing the transition from older ones, or if we cannot provide the expected level of quality and support for our new products and services.\nOur future growth relies on the successful development and introduction of new hardware and software products and services. The complexity of storage and data management software, subsystems and appliances, as well as the challenges in estimating the engineering effort required to produce new products and services, pose significant technical and quality control risks for these new products and services. If we encounter technological challenges, customer reluctance, or other obstacles that prevent us from developing, introducing and gaining market acceptance for new products and services, or if we fail to provide the expected level of product and support quality, our business, operating results, financial condition and cash flows could be materially and adversely affected. Introducing new products and features exposes us to additional financial and operational risks. These include the ability to forecast customer preferences and demand, managing production capacity to meet the demand for new products and services and avoid excessive inventories of older products and components, manage the transition from older products and solutions, and handle the impact of customer demand for new offerings versus those being replaced.\n \nAs customers transition from older products to newer ones, delays or decisions to postpone the transition could lead to non-renewal of new offerings, impacting our ability to manage and forecast customer churn and expansion rates. Additionally, uncertainties related to the price-performance of new products compared to competitors, competitors’ responses to our new products, extended evaluation periods by customers, and our partners’ investment in selling our new products add to the inherent risks. If we do not manage these risks effectively, our business, operating results, financial condition, and cash flows could face significant adverse impacts. Furthermore, entering new or emerging markets will likely increase demands on our service and support operations and expose us to additional competition. We may struggle to provide competitive products, services and support for these market opportunities.\n \nOur gross margins may fluctuate.\nOur gross margins are influenced by a variety of factors, including macroeconomic volatility, competitive pricing, component and product design costs, inflation, foreign exchange currency fluctuations, and the volume and relative mix of revenues from product sales, software support, hardware support, and other services offerings. Factors such as increased component and labor costs, pricing and discounting pressures, changes in component costs and product prices, or shifts in revenue mix and volume from different offerings could negatively impact our revenues, gross margins or earnings.\n \nAdditionally, our gross margins are affected by the cost of any substandard materials and our sales and distribution activities, including pricing actions, rebates, sales initiatives, discount levels, and the timing of service contract renewals. Third-party component costs make up a significant portion of our product costs. We may have difficulty managing these costs if supplies of certain components, including NAND, become limited or component prices rise. Such limitations could increase our product costs.\n \nWe have experienced, and may continue to experience, negative impacts on our gross margins due to rising component costs, logistics costs, tariffs and other trade barriers, and inflationary pressures. An increase in component or design costs relative to our product prices could harm our gross margins and earnings. Failure to sustain or improve our gross margins may have a material adverse effect on our business and stock price.\nIssues related to the development and use of artificial intelligence (AI), including GenAI, could lead to legal or regulatory action, damage our reputation, or otherwise materially harm our business.\nAs a technology company at the forefront of AI innovation, our business faces potential risks associated with the rapidly evolving regulatory landscape for AI. Governments and regulatory bodies worldwide are increasingly enacting new laws and guidelines to address the ethical, privacy, and security implications of AI technologies. Non-compliance, even if inadvertent or without our knowledge, with these emerging regulations could result in legal and financial penalties, reputational damage, and operational disruptions. Additionally, the diverse and sometimes conflicting nature of international AI regulations may pose challenges in maintaining consistent compliance across different jurisdictions. The complexity and novelty of these laws may also require investments in compliance infrastructure, including enhanced data governance frameworks, algorithmic transparency, and bias mitigation strategies.\nWe are increasingly building and/or leveraging AI technology in certain products, services, and business operations, and our research and development in this area is ongoing. As with many innovations, AI presents risks, challenges, and potential unintended consequences that could affect our and our customers’ adoption and use of this technology. AI algorithms and training methodologies may be flawed, and AI technologies are complex and rapidly evolving. We face significant competition in the market and from other companies regarding such technologies.\n \n\n\n17\n\n\n\n\n \n\n\nWe may be unsuccessful in identifying or resolving ethical and legal issues presented by the use of AI before they arise. AI-related issues, deficiencies and/or failures could result in (i) legal or regulatory action, including to enforce new legislation regulating AI in various jurisdictions where we operate, and the application of existing data protection, privacy, intellectual property, and other laws; (ii) damage to our reputation; (iii) time-consuming and costly litigation, including related to intellectual property; (iv) inability to protect our intellectual property; (v) disclosure of our confidential information or (vi) other material harm to our business. If regulation significantly delays or impedes the adoption of AI, we may not be able to meet our development goals or our sales forecasts.\nIncreasing competition and industry consolidation could harm our business, operating results, financial condition and cash flows.\nOur markets are highly competitive, fragmented, and characterized by rapidly changing technology. We face competition from many companies, including established public companies, newer public companies with a strong focus on flash storage, and new market entrants targeting opportunities in GenAI and application data management for Kubernetes. Some competitors offer a broad range of IT products and services (full-stack vendors), while others offer a more limited set.\n \nTechnology trends, such as GenAI, hosted or public cloud storage, software as a service (SaaS), IT as a service, and flash storage are driving significant changes in storage architectures and solution requirements. Cloud service providers offer storage on demand without requiring capital expenditure, which meets rapidly evolving business needs and has altered the competitive landscape. Competitors may develop new technologies, products, or services ahead of us or establish new business models, more flexible purchase models, or disruptive technologies. By extending our offerings in flash, cloud storage, converged infrastructure, and block storage, and GenAI, we are entering new segments and facing competition from both traditional competitors and emerging competitors. The long-term potential and competitiveness of emerging vendors remains uncertain.\n \nNew competitors or alliances among existing competitors could emerge and quickly gain significant market share or buying power. Changes in customer requirements or increased industry consolidation could result in stronger competitors better able to compete. Additionally, current and potential competitors may establish cooperative relationships among themselves or with third parties, including some of our partners or suppliers. For additional information regarding our competitors, see the section entitled “Competition” contained in Part I, Item 1 - Business of this Annual Report on Form 10-K.\nTransition to consumption-based business models may adversely affect our revenues and profitability in other areas of our business, potentially harming our business, operating results, financial condition and cash flows.\nWe offer customers a variety of consumption models, including cloud-based storage services and storage as a service (STaaS) delivered on-premises. As these business models continue to evolve, we may face challenges in competing effectively, generating significant revenues, or maintaining the profitability of our consumption-based offerings. Additionally, the growing prevalence of cloud and SaaS delivery models offered by us and our competitors may reduce overall demand for our traditional on-premises offerings sold through a capital expenditure (capex) model, which could negatively impact our revenues and cash flow, at least in the short term. Failure to successfully execute our consumption model strategy or anticipate customer needs could lead to a decline in our revenues and our profitability could decline.\nAs customer demand for our consumption model offerings increases, we will encounter differences in the timing of revenue recognition compared to our traditional purchase arrangements. Revenue from traditional purchases is generally recognized in full at the time of delivery, whereas revenue from consumption model offerings is generally recognized ratably over the term of the arrangement. We incur certain expenses related to the infrastructure and marketing of our consumption model offerings before we can recognize the associated revenues.\nIf we are unable to attract and retain qualified personnel, our business, operating results, financial condition and cash flows could be harmed.\nOur success depends on our ability to hire and retain qualified personnel to advance our corporate strategy and maintain key aspects of our corporate culture. As our future success relies on enhancing and introducing new products and features, we particularly need to attract and retain qualified engineers and technical talent, especially in emerging technology areas like AI and machine learning. To increase revenues, we must also increase the productivity of our sales force, which may require an increase in support infrastructure and personnel, to achieve adequate customer coverage.\nCompetition for qualified employees, particularly in the technology industry, is intense. We have periodically reduced our workforce, including restructuring plans announced in fiscal 2023, fiscal 2024, and fiscal 2025, respectively. These actions may make it more challenging to attract and retain qualified employees. Failure to hire and retain skilled management and personnel, particularly engineers, salespeople, and key executive management, could disrupt our development efforts, sales results, business relationships, and our ability to execute our business plan and strategy, adversely affecting our operating results, financial conditions and cash flows.\n\n\n18\n\n\n\n\n \n\n\nMany of our employees participate in our hybrid work program and work remotely on a full- or part-time basis.  Changes to our office environments, including the adoption of new work models and our requirements and/or expectations about when or how often certain employees work on-site or remotely may not meet the expectations of our employees, and may create challenges in attracting and retaining qualified personnel, adversely affecting our business operations and financial performance.\n \nAdditionally, many of our employees are foreign nationals relying on visas and entry permits to work legally in the U.S. and other countries, and may be dependent on licenses to work with controlled technology. Restrictions or difficulties in obtaining H-1B, L-1 and other business visas, as well as licenses to work with controlled technologies, along with compliance with new immigration and labor laws and unintended impacts from changes in immigration policy or in the enforcement of existing immigration laws and policies, could lead to unexpected labor costs and hinder our ability to retain and attract skilled professionals, negatively impacting our business, results of operations or financial conditions.\nEquity grants are a crucial part of our compensation programs, supporting talent attraction and engagement and aligning employee interests with stockholders. A competitive broad-based equity compensation program is essential to compete for talent in both the hardware and software industries, where competitors offer significant equity compensation. Reducing, modifying, or eliminating our equity programs, or failing to grant equity competitively, may hinder our ability to attract and retain critical employees.\n \nFurthermore, the structure of our sales, cash, and equity incentive compensation plans may increase the risk of losing employees at certain times, such as after the payment of periodic bonuses or the vesting of equity awards.\nOur acquisitions or divestitures may not achieve the expected benefits and could increase our liabilities, disrupt our existing business, and harm our operating results, financial condition and cash flows.\nAs part of our strategy, we may seek to acquire other businesses and technologies to complement our current products and services, expand our market reach, or enhance our technical capabilities. The benefits we have received, and expect to receive, from these and other acquisitions depend on our ability to successfully conduct due diligence, negotiate the terms of the acquisition and integrate the acquired business into our systems, procedures and organizational structure. We may also divest businesses, product lines, or divisions that no longer align with our current offerings. For example, we sold our FinOps business to Flexera in fiscal 2025. Realizing the benefits we would expect to receive from a divestiture would depend on our ability to manage the separation of operations, services, products, and personnel, in addition to other risks.\n \nAny inaccuracy in our assumptions or failures to identify and mitigate liabilities or risks associated with an acquisition or divestiture – such as differing or inadequate cybersecurity and data privacy protection controls or contractual limitations of liability – could reduce or eliminate the expected acquisition or divestiture benefits. If we fail to make acquisitions or divestitures on favorable terms, integrate or divest the subject business or assets as planned, or retain or separate key employees, our costs could increase, our operations could be disrupted, and we could face additional liabilities, investigations and litigation. This could harm our strategy, business, and operating results. Additionally, the failure to achieve expected benefits from acquisitions or divestitures may result in impairment charges for goodwill and intangible assets.\nRisks Related to Our Operations\nWe often incur expenses before receiving related benefits, and it may be difficult to reduce expenses quickly if demand declines.\nWe base our expense levels partly on future revenue expectations, and a significant portion of our expenses are fixed. Reducing these fixed costs quickly can be challenging, and if our revenue falls below expectations, our operating results could be adversely impacted. During periods of uneven growth or decline, we may incur costs before realizing the anticipated benefits, which could also harm our operating results.\n \nWe have made, and will continue to make, significant investments in engineering, sales, service and support, marketing, and other functions to support and grow our business. The costs associated with these investments are likely to be recognized earlier than some of the related anticipated benefits, such as revenue growth. Additionally, the return on these investments may be lower or may develop more slowly than we expect, which could harm our business, operating results, financial condition and cash flows.\nInitiatives to improve our cost structure, business processes, and systems may not achieve the expected benefits and could negatively impact our reputation, business, operating results, financial condition and cash flows.\nWe continuously strive to make our cost structure and business processes more efficient, including by relocating our business activities from higher-cost to lower-cost locations, outsourcing certain business processes and functions, and implementing changes to our business information systems. These efforts require significant investment of financial and human resources and substantial changes to our current operations. For example, in fiscal 2025, we continued our implementation of certain new business information systems, including a new enterprise resource planning (ERP) system to enhance and standardize our processes, improve oversight, and better serve our customers. However, any disruption during this transition could impact our ability to send and track invoices, process\n \n\n\n19\n\n\n\n\n \n\n\nvendor payments, pay employees, fulfill contractual obligations, report financial results, maintain effective internal controls, or operate our business effectively.\n \nWe may also encounter difficulties in implementing new business information systems or maintaining and upgrading existing systems and software. These difficulties could lead to significant expenses or losses due to unexpected additional costs, disruption in business operations, loss of sales or profits, or delays in processing and reporting key financial information. As a result, our business, results of operations, financial condition and prospects could be materially adversely affected.\nAdditionally, as we move operations to lower-cost jurisdictions and outsource certain business processes, we become subject to new regulatory regimes and lose control of certain aspects of our operations, increasing our dependence upon third-party systems and processes. If we fail to move operations, outsource processes, or implement new information in compliance with local laws and maintain adequate standards, controls and procedures, the quality of our products and services may suffer, and we may face increased litigation risk. These issues could adversely affect our business, operating results, and financial condition.\n \nIf we do not achieve the expected benefits of these and other transformational initiatives, our business, operating results, financial condition, and cash flows could be harmed.\nWe are exposed to credit risks, fluctuations in the market value of our investment portfolio, and potential adverse effects on our cash and cash equivalents if the financial institutions holding them fail.\n \nWe maintain an investment portfolio of various holdings, types, and maturities. The credit ratings and pricing of our investments can be negatively affected by factors such as volatile macroeconomic conditions, liquidity issues, credit deterioration, financial results, economic risk, political risk, sovereign risk, or other factors. Consequently, the value and liquidity of our investments and their returns may fluctuate significantly. Unfavorable macroeconomic conditions, rising interest rates, international trade protection measures and disputes (including economic and trade barriers, tariffs, sanctions and export controls), or other circumstances could lead to an economic slowdown or global recession, potentially causing failures of counterparties, including financial institutions, governments, and insurers. This could materially decrease the value of our investment portfolio and substantially reduce our investment returns.\n \nWe regularly maintain cash balances at large third-party financial institutions that exceed the Federal Deposit Insurance Corporation (FDIC) insurance limit of $250,000 and similar regulatory insurance limits outside the United States. If a depository institution where we maintain deposits fails or faces adverse financial or credit markets conditions, we may not be able to recover all of our deposits, which adversely impacts our operating liquidity and financial performance.\n \nAdditionally, if our customers or partners experience liquidity issues due to financial institution defaults or non-performance where they hold cash assets, their ability to pay us may be impaired. This could materially affect our results of operations, including the collection of accounts receivable and cash flows.\nOur initiatives and disclosures related to sustainability and corporate responsibility matters expose us to risks that could adversely affect our reputation and performance.\n \nWe have publicly announced, and may continue to establish and announce, initiatives regarding sustainability and corporate responsibility matters, as well as other related matters in our Impact Report, on our website and elsewhere. These statements, which are included in our Impact Report, on our website, in our SEC filings, and elsewhere, reflect our current plans and aspirations but are not guarantees of achievement. Implementing these initiatives and goals can be challenging and costly, and our current plans and aspirations may not all succeed or be achieved in the way and on the timelines we expect or at all. While these initiatives and goals are not a critical part of our business operations and may not significantly impact our financial performance directly, they are an important part of our business ethos and corporate culture that we believe is valued and appreciated by our investors and key stakeholders.\n \nThere is growing attention from governments, investors, customers, employees, and other stakeholders on sustainability and corporate responsibility matters, and laws and regulations regarding disclosure, reporting and diligence requirements continue to evolve. We may face scrutiny from stakeholders regarding the scope or nature of our sustainability and corporate responsibility initiatives or any changes to these initiatives. In addition, state attorneys general and other governmental authorities may take action against certain sustainability and corporate responsibility policies or practices, and we may become subject to restrictions on sustainability and corporate responsibility initiatives. Incomplete or inaccurate sustainability and corporate responsibility-related data, failure to achieve sustainability and corporate responsibility goals, or government enforcement actions or litigation relating to sustainability and corporate responsibility initiatives could negatively impact our ability to attract or retain employees, our attractiveness as an investment or business partner, and ultimately our business, financial performance, and growth.\nRisks Related to Our Customers and Sales\nA portion of our revenues is generated by large, recurring purchases from various customers, resellers and distributors.\n\n\n20\n\n\n\n\n \n\n\nA significant portion of our net revenues rely on sales to a limited number of customers and distributors. We typically do not enter into binding long-term purchase commitments with our customers, resellers, and distributors, meaning there is no guarantee that we will continue to receive large, recurring orders from them. For instance, our reseller agreements generally do not require minimum purchases, and our customers, resellers, and distributors can stop purchasing and marketing our products at any time. The loss, cancellation, or delay of purchases has previously impacted our revenues and could again in the future.\n \nAny deterioration in the financial stability of our customers, resellers, and distributors, or their ability to obtain credit to finance purchases of our products, could significantly adversely affect our results of operations and cash flow. If any of our key customers, resellers, or distributors changes its pricing practices, reduces the size or frequency of its orders, or stops purchasing our products altogether, our operating results, financial condition, and cash flows could be materially adversely impacted. Additionally, major customers may seek pricing, payment, intellectual property-related, or other commercial terms that are less favorable to us, which could negatively impact our business, cash flow, and operating results.\nIf we are unable to maintain and develop relationships with strategic partners, our revenues may be harmed.\nOur growth strategy relies on developing and maintaining strategic partnerships with major third-party software and hardware vendors to integrate our products into their products and co-market them. Many of our strategic partners are industry leaders that provide us with expanded access to market segments where we do not directly participate. Strategic partnerships with public cloud providers and other cloud service vendors are particularly critical to the success of our cloud-based business.\nHowever, there is intense competition for attractive strategic partners, and these relationships may not be exclusive, may not generate significant revenues, and may be terminated on short notice. Some of our partners also collaborate with our competitors, which can increase the availability of competing solutions and hinder our ability to grow these relationships. Additionally, some partners, especially large and diversified technology companies, including major cloud providers, are also our competitors, complicating our relationships.\nIf we are unable to establish new or maintain current partnerships, if our strategic partners prioritize their relationships with other vendors in the storage industry, if our strategic partners seek to renegotiate or terminate our agreements, or if our strategic partners increasingly compete with us, we could experience lower-than-expected revenues, delays in product development, and other adverse effects on our business, operating results, financial condition and cash flows.\nOur success depends upon our ability to effectively plan and manage our resources and periodically restructure our business, which may adversely affect our business, operating results, financial condition, and cash flows.\nTo successfully offer our products and services in a rapidly evolving market, we need effective planning, forecasting, and management processes that allow us to scale and adjust our business in response to changing market opportunities and conditions.\nIn fiscal 2024 and fiscal 2025, we reorganized our sales resources, including changes and additions to our sales leadership team, to gain operational efficiencies and better align our resources with customer and market opportunities. However, such reorganization and ongoing adjustments to our go-to-market model could disrupt our sales cycles in the short- or long-term, may not yield the desired efficiencies and benefits, and could harm our operating results, financial condition, and cash flows.\nWe have undertaken, and may in the future undertake, initiatives that include reorganizing our workforce, restructuring, discontinuing certain products, acquisitions and dispositions of businesses, reducing facilities, or a combination of these actions, which could result in restructuring charges. Rapid changes in the size, alignment, or organization of our workforce, including our business unit structure, structure of our sales team, and sales account coverage, could impair our ability to develop, sell and deliver products and services as planned, or hinder our ability to achieve our business and financial objectives. Charges associated with these activities could harm our operating results.\nOur ability to achieve the anticipated cost savings and other benefits from these initiatives depends on many estimates and assumptions, which are subject to uncertainties. If our estimates and assumptions are incorrect, if we are unsuccessful at implementing changes, or if other unforeseen events occur, our business, financial condition, and results of operations could be adversely affected.\nReduced U.S. government demand could materially harm our business, operating results, financial condition and cash flows.\nThe U.S. government is an important customer for us, but its demand is uncertain due to political and budgetary fluctuations and constraints. Uncertainty related to the U.S. government budget and debt levels, changes to governmental agency structure, compliance with new initiatives and executive orders, and reductions in force have increased demand uncertainty for our products. Changes in administration may also lead to programs and initiatives moving in or out of favor, which may lead to varied perception of our company in the U.S. government market and may negatively impact our sales to the U.S. government. Additionally, the U.S. government, like other customers, may evaluate competing products and delay purchases during technology transitions in the storage\n \n\n\n21\n\n\n\n\n \n\n\nindustry. If the U.S. government or its agencies reduce or shift their IT spending patterns, our revenues and operating results may be adversely affected.\nSelling our products to the U.S. government, whether directly or through channel partners, subjects us to specific regulatory and contractual requirements, which may change or increase at short notice. Some of these requirements may extend past the specific nature and products of the arrangement and impact our broader corporate policies, initiatives and employee resources. Failure to comply with these requirements by either us or our channel partners could lead to investigations, fines, and other penalties (including the loss of such government contracts), harming our operating results and financial condition. For example, the U.S. Department of Justice (DOJ) has previously pursued claims and settlements with IT vendors, including us and our competitors and channel partners, under the False Claims Act and other statutes related to violations of regulatory and contractual requirements, which may include such areas as pricing and discount practices, cybersecurity, or procurement integrity. These actions, in addition to potential fines and other penalties as well as potential government audits and investigations, could also result in suspension or disbarment from future government contracts. Additionally, government certification requirements may change and, in doing so, restrict our ability to sell into the government sector until we have attained revised certifications (or are able to make the required certifications to the government). We could also be harmed by claims of non-compliance with these requirements by us or our channel partners. Any of these outcomes could materially adversely affect our business, operating results, financial condition and cash flows. In response to evolving and increasing security threats, the U.S. government has imposed additional requirements on IT vendors, including us. These requirements range from software development security (e.g., the Executive Order on Improving the Nation’s Cybersecurity (EO 14028), issued in May 2021, to require attestation to minimum requirements for our software development framework), to supply chain security (e.g., Section 5949 of the FY23 National Defense Authorization Act (NDAA) prohibits us from including in our products or using in our corporate environment certain semiconductor products and services), to cybersecurity (e.g., the U.S. Department of Defense’s Cybersecurity Maturity Model Certification (CMMC) program). Failure to meet these requirements as they apply to us and our products may result in delays or inability to execute contracts with customers, particularly with government entities.\nIf we do not achieve forecasted sales orders in any quarter, our operating results, financial condition and cash flows could be harmed.\nWe derive a significant amount of our revenues in any given quarter from orders booked in the same quarter. These orders typically follow intra-quarter seasonality patterns, with a significant portion occurring toward the end of the quarter. If we fail to achieve the forecasted level, timing, and mix of orders in line with our quarterly targets and historical patterns, or if we experience cancellations of significant orders, our operating results, financial condition and cash flows could be adversely affected.\nWe are exposed to the credit and non-payment risk of our customers, resellers and distributors, especially during times of economic uncertainty and tight credit markets, which could result in material losses.\nMost of our sales to customers are on an open credit basis, with typical payment terms of 30 days. During periods of economic uncertainty, when access to liquidity may be limited, we may experience increased losses as more customers become unable to pay their obligations to us, either in full or in part. Additionally, some customers have entered into recourse and non-recourse financing leasing arrangements using third-party leasing companies. Under recourse leases, which typically last three years or less, we remain liable for the unpaid remaining lease payments to the third-party leasing companies if the end-user customer defaults.\n \nOur exposure to credit risks from our customers increases during economic uncertainty or volatility. This risk may further increase if our customers, their customers, or their lease financing sources are adversely affected by global economic conditions.\nRisks Related to Our Products and Services\nAny disruption to our supply chain could materially harm our business, operating results, financial condition and cash flows.\nWe do not manufacture certain components used in our products. We rely on third parties to manufacture critical components and handle associated logistics. Our lack of direct control over these elements, combined with the diverse international geographic locations of our manufacturing partners and suppliers, creates significant risks for us, including:\n•\nLimited number of suppliers for certain components; \n•\nNo guarantees of supply and limited ability to control the quality, quantity and cost of our products or of their components; \n•\nPotential for binding price or purchase commitments with our suppliers at higher than market rates; \n•\nLimited ability to adjust production volumes in response to our customers’ demand fluctuations; \n•\nLabor and political unrest at facilities we do not operate or own; \n\n\n22\n\n\n\n\n \n\n\n•\nGeopolitical disputes, acts of terrorism, cyber attacks and hacktivism disrupting our supply chain; \n•\nImpacts on our supply chain from adverse public health developments; \n•\nBusiness, regulatory compliance, legal compliance, litigation, trade controls and financial concerns affecting our suppliers or their ability to manufacture and ship components in the quantities, quality and manner as required; and \n•\nDisruptions due to floods, earthquakes, storms, fires and other natural disasters, especially those caused by climate change, and particularly in countries with limited infrastructure and disaster recovery resources.\nThese risks have subjected us, and could in the future subject us, to supply constraints, price increases, and minimum purchase requirements, which could harm our business, operating results, financial condition, and cash flows. The risks associated with our outsourced manufacturing model are particularly acute when we transition products to new facilities or manufacturers, introduce and increase volumes of new products, or qualify new contract manufacturers or suppliers. During these times, our ability to manage relationships among ourselves, our manufacturing partners, and our component suppliers, becomes critical. New manufacturers, products, components, or facilities create increased costs and risk that we will fail to deliver high quality products in the required volumes to our customers. Any failure of a manufacturer or component supplier to meet our quality, quantity or delivery requirements in a cost-effective manner will harm our business, including customer relationships and as a result could harm our operating results, financial condition and cash flows. Additionally, disruption to our manufacturing operations, or those of our contract manufacturers, could significantly impact our ability to supply our customers and could produce a near-term severe impact on the Company.\nWe rely on a limited number of suppliers for critical product components.\nWe depend on a limited number of suppliers for drives and other components used in assembling our products, including some single-source suppliers. This reliance has subjected us, and could in the future subject us, to price rigidity, periodic supply constraints, and challenges in producing our products with the required quality and quantities. Consolidation among suppliers, particularly within the semiconductor and storage media industries, has led to price volatility and supply constraints. When industry supply is constrained or the supply chain is disrupted, our suppliers may allocate volumes away from us and to our competitors, who depend on many of the same suppliers as we do. As a result, our business, operating results, financial condition and cash flows may be adversely affected.\nIf a material cybersecurity or other security breach impacts our services, systems, supply chain, or end-user customer systems, or if stored data is improperly accessed, our business could suffer significant harm.\n \nWe store and transmit, and sell products and services that store and transmit, personal, sensitive and proprietary data related to our products, our employees, customers, clients, partners (including third-party vendors such as data centers and providers of SaaS, cloud computing, and internet infrastructure and bandwidth), and their respective customers. This data includes intellectual property, records, and personal information. It is critical to our business strategy that our infrastructure, products, and services remain secure and are perceived as secure by customers, clients, and partners.\n There are numerous and evolving cybersecurity and privacy risks, including criminal hacking (eCrime), state-sponsored intrusions, industrial espionage, hacktivism, insider threats, inadvertent disclosure, ransomware attacks, social-engineering, exploitation of unpatched or unmanaged vulnerabilities, cyber-attacks to the Company’s service providers, suppliers or vendors, technological vulnerabilities, or destruction or other misuse of data that could harm the Company, operations or our competitive position. In some cases, these types of attacks have been successful. Increasing use of AI in techniques employed by threat actors will continue to increase the risk of successful attacks, while also providing opportunities for improved attack detection and prevention capabilities. Our information systems and data have been specifically targeted by various threat actors, including nation-state affiliated threat actors, and we expect that our information systems and data will continue to be targeted in the future. Cybersecurity incidents or other security breaches have in the past and could in the future result in: (1) unauthorized access to, or loss or unauthorized use, alteration, or disclosure of, personal, sensitive and/or proprietary data; (2) litigation, indemnity obligations, government investigations and proceedings, regulatory fines and penalties, and other possible liabilities; (3) revenue loss; (4) negative publicity and damage to our reputation; and (5) disruptions to our internal and external operations.\n \nThese outcomes could damage our reputation, harm our business, and lead to significant liabilities. Additionally, a cybersecurity incident or loss of personal information has in the past and could in the future result in remediation costs, disruption of internal operations, increased cybersecurity protection costs, significant fines, and/or lost revenues.\nOur clients and their customers use our platforms to transmit and store sensitive data. We do not generally have the ability to review the information or content they upload and store, nor do we control the substance of this information or content. If our employees, clients, partners, or their respective customers use our platforms for the transmission or storage of sensitive information, or our supply-chain cybersecurity is compromised and our security measures are breached as a result of third-party action, employee\n \n\n\n23\n\n\n\n\n \n\n\nerror, malfeasance, stolen or fraudulently obtained log-in credentials or otherwise, our reputation could be damaged, our business may be harmed and we could incur significant liabilities.\nSecurity industry experts and U.S. government officials continue to emphasize risks to our industry. Cyber-attacks and security breaches continue to increase, and of particular concern are supply-chain attacks against software development and breaches of technology service providers. We anticipate that cyberattacks will continue to increase in the future given cyber warfare has become a consistent lever within geopolitical conflicts and increasingly leverages hacktivism. We cannot give assurance that we will always be successful in preventing or repelling unauthorized access to our systems. We also may face delays in our ability to identify or otherwise respond to any cybersecurity incident or any other breach. Future cyber-attacks or incidents could persist undetected in our environments for a period of time. Additionally, we use third-party service providers to provide some services to us that involve the storage or transmission of data, such as SaaS, cloud computing, and internet infrastructure and bandwidth, and they face various cybersecurity threats and also may suffer cybersecurity incidents or other security breaches. While we conduct diligence on these third parties, our ability to monitor these third parties’ information security practices is limited, and these third parties may not have adequate information security measures in place. In addition, supply-chain attacks have increased in frequency and severity, and we cannot guarantee that third parties’ infrastructure in our supply chain or our third-party partners’ supply chains have not been or will not be compromised. Many jurisdictions require companies to notify regulators or individuals of data security incidents involving certain types of personal data. These mandatory disclosures regarding security incidents often lead to widespread negative publicity. The risk of reputational harm may be magnified by the rapid dissemination of information online. Any security incident, loss of data, or other security breach, whether actual or perceived, or whether impacting us or our third-party service providers, could harm our reputation, erode customer confidence in the effectiveness of our data security measures, negatively impact our ability to attract new customers, cause existing customers to elect not to renew their support contracts or their SaaS subscriptions, or subject us to third-party lawsuits, regulatory fines or other action or liability, which could materially and adversely affect our business and operating results.\nThere can be no assurance that the limitations of liability in our contracts would be enforceable or adequate or would otherwise protect us from any such liabilities or damages with respect to any particular claim. Our existing general liability insurance coverage, cybersecurity insurance coverage and coverage for errors and omissions may not continue to be available on acceptable terms or may not be available in sufficient amounts to cover one or more large claims, or our insurers may deny coverage as to any future claim. The successful assertion of one or more large claims against us that exceeds available insurance coverage, or the occurrence of changes in our insurance policies, including premium increases or the imposition of large deductible or co-insurance requirements, could have a material adverse effect on our business, operating results, financial condition and cash flows.\nIf a data center or other third-party who relies on our products experiences a disruption in service or a loss of data, such disruption could be attributed to the quality of our products.\nOur clients, including data centers, SaaS providers, cloud computing services and internet infrastructure and bandwidth providers, rely on our products for their data storage needs. These clients may authorize third-party technology providers to access their data on our systems. Errors or wrongdoing by clients, their customers, or third-party technology providers resulting in actual or perceived security breaches may result in such actual or perceived breaches being attributed to us.\n \nA failure to meet our customers’ and partners’ expectations regarding security and confidentiality, due to disruptions in services provided by third-party vendors or the loss or alteration of data stored by such vendors, could cause financial or reputational harm to our business. This harm could occur if the disruption or data loss is caused by, or perceived to be caused by, defects in our products. The risk of reputational harm may be magnified by the rapid dissemination of information over the internet, including through news articles, blogs, social media, and other online communication forums and services. This could affect our ability to retain clients and attract new business.\nAdditionally, our operations and select cloud services rely on third-party cloud providers. Interruptions due to technical failures such as hardware or software issues or connectivity problems, security incidents, compliance changes, operational challenges and natural disasters could reduce revenue due to the cloud services’ metered billing and could pose reputational risks. Moreover, dependence on key cloud infrastructure providers carries systemic risks, as we could face amplified reputational damage if observability features fail during client outages.\nFailure to comply with new and existing laws and regulations related to privacy, data protection, AI and information security could cause harm to our reputation, result in liability (including regulatory penalties and litigation), and adversely impact our business.\nOur business is increasingly subject to regulation by various federal, state and international governmental agencies responsible for enacting and enforcing laws and regulations relating to privacy, data protection, and information security. For example, since the EU’s General Data Protection Regulation became effective in 2018, the Court of Justice of the EU has issued rulings that have impacted how multinational companies must implement that law and the European Commission (EC) has published new regulatory\n \n\n\n24\n\n\n\n\n \n\n\nrequirements relating to cross-border data transfers. NetApp relies on compliance methods such as Standard Contractual Clauses (SCCs) to transfer personal data of individuals located in the European Economic Area (EEA) to other countries. In June 2021, the EC imposed new SCC requirements which impose certain contractual and operational requirements on NetApp and its contracting parties, including requirements related to government access transparency, enhanced data subject rights, and broader third-party assessments to ensure safeguards necessary to protect personal data transferred from NetApp or its partners to countries outside the EEA, requiring NetApp to revise customer and vendor agreements. Other global governments have adopted new privacy and data protection laws implementing similarly comprehensive regulatory frameworks.\nThe interpretation and application of many privacy, data protection, and information security laws and regulations, along with industry standards, are uncertain. These laws, regulations, or standards may be interpreted and applied in ways that are inconsistent with our data management practices or product features. Additionally, government certification requirements for products like ours may change and, in doing so, restrict our ability to sell into the government sector until we have attained revised certifications. Any failure, or perceived failure, by us or our business partners to comply with relevant laws, regulations, contractual commitments, required certifications, self-regulatory standards, or our policies could subject us to claims, investigations, sanctions, enforcement actions, disgorgement of profits, fines, damages, civil and criminal liability, penalties, or injunctions.\n \nAs a technology provider, our customers expect us to demonstrate compliance with privacy, data protection, and information security laws and regulations. Our inability, or perceived inability, to do so may adversely impact sales of our products and services, especially to customers in highly regulated industries. We have invested resources in complying with new laws and regulations and may need to make additional significant changes to our business operations, which could adversely affect our revenue and overall business. Non-compliance could harm our reputation and brand, incur significant costs, materially affect our financial and operating results, and require modifications to our products or business practices.\nOur business could face stricter obligations, greater fines, and private causes of action under new privacy, data protection, and information security laws and regulations, including the GDPR, which provides for penalties of up to 20 million Euros or four percent of our total worldwide annual turnover of the preceding financial year (whichever is higher), the California Consumer Privacy Act, the California Privacy Rights Act, and other similar U.S. state-based regulations, as well as new and emerging privacy laws globally.\nAs NetApp provides technology services to EU financial institutions, the Digital Operational Resilience Act (DORA) imposes financial and legal risks. These include compliance costs for enhancing cybersecurity, performing resilience testing, requiring comprehensive documentation, increased audits, and detailed reporting. Stricter contractual obligations will be imposed by financial institution clients, necessitating more robust incident reporting and data protection measures. Non-compliance could result in legal liabilities, suspension of services and reputational damage. Additionally, NetApp must ensure that its subcontractors and suppliers also comply with DORA requirements, further increasing the complexity and potential liability.\nIf our products or services are defective, or are perceived to be defective, including as a result of improper use or maintenance, our operating results and customer relationships may be harmed.\nOur products and services are complex. We have experienced in the past, and expect to experience in the future, quality issues impacting certain products, and we could experience reliability issues with services we provide, including security vulnerabilities, software bugs, hardware failure in networked storage appliances, incompatibility issues with customer systems or other applications, performance deficiencies causing slow data retrieval or processing, firmware or software updates causing system instability, compliance with various product certifications, and data breaches due to flaws in the product design. Such quality and reliability issues may be due to, for example, our own designs or processes, the designs or processes of our suppliers, and/or flaws in third-party software used in our products. These types of risks are most acute when we are introducing new products. Quality or reliability issues have and could again in the future cause customers to experience outages or disruptions in service, data loss or data corruption. If we fail to remedy a product defect or flaw, we may experience a failure of a product line, temporary or permanent withdrawal from a product or market, damage to our reputation, loss of revenue, inventory costs or product reengineering expenses and higher ongoing warranty and service costs, and these occurrences could have a material impact on our gross margins, business and operating results. In addition, we exercise little control over how our customers use or maintain our products and services, and in some cases improper usage or maintenance could impair the performance of our products and services, which could lead to a perception of a quality or reliability issue. Customers may experience losses that may result from or are alleged to result from defects or flaws in our products and services, which could subject us to claims for damages, including consequential damages.\nChanges in regulations relating to our products or their components, or the manufacture, sourcing, distribution or use thereof, may harm our business, operating results, financial condition and cash flows.\nThe laws and regulations governing the manufacturing, sourcing, distribution and use of our products have become increasingly complex and stringent. For example, in addition to various environmental laws relating to carbon emissions, the use and discharge of hazardous materials, and the use of certain minerals originating from identified conflict zones, many governments, including the U.S.,\n \n\n\n25\n\n\n\n\n \n\n\nthe United Kingdom, and Australia, have adopted regulations to address the risk of human trafficking in supply chains, which govern how workers are recruited and managed.\n \nWe incur costs to comply with these requirements. Given the complexity of our supply chain, we may face reputational harm if our customers or other stakeholders conclude that we are unable to verify sufficiently the origins of the minerals used in the products we sell or the actions of our suppliers with respect to workers. As the laws and regulations governing our products continue to expand and change, our costs are likely to rise, and the failure to comply with any such laws and regulations could subject us to business interruptions, litigation risks and reputational harm.\nAny violation of U.S. export control laws and other laws affecting the countries in which our products and services may be sold, distributed, or delivered could have a material and adverse effect on our business, operating results, financial condition and cash flows.\nDue to the global nature of our business, we are subject to import and export restrictions and regulations, including the Export Administration Regulations administered by the Commerce Department’s Bureau of Industry and Security (BIS) and the trade and economic sanctions regulations administered by the Treasury Department’s Office of Foreign Assets Control (OFAC). The U.S., through the BIS and OFAC, places restrictions on the sale or export of certain products and services to certain countries, entities, and persons, including most recently to Russia, Belarus and regions of Ukraine. These regulations have caused us to temporarily stop selling or servicing our products temporarily in restricted areas.\n \nViolators of export control and sanctions laws may be subject to significant penalties, which may include significant monetary fines, criminal proceedings against them and their officers and employees, a denial of export privileges, and suspension or debarment from selling products to the federal government. Our products could be diverted by third parties (including potentially our channel partners) to countries or end users under sanctions / embargo orders, despite our precautions.\nIf we were ever found to have violated U.S. export control laws or any trade-related laws or regulations, even if inadvertent or without our knowledge, we may be subject to various penalties available under the laws, any of which could have a material and adverse impact on our business, operating results and financial condition. Even if we were not found to have violated such laws, the political and media scrutiny surrounding any governmental investigation of us could cause us significant expense and reputational harm. Such collateral consequences could have a material adverse impact on our business, operating results, financial condition and cash flows.\nOur failure to protect our intellectual property could harm our business, operating results, financial condition and cash flows.\nOur success depends significantly upon developing, maintaining and protecting our proprietary technology. We rely on a combination of patents, copyrights, trademarks, trade secrets, confidentiality procedures and contractual provisions with employees, resellers, strategic partners and customers, to protect our proprietary rights. We currently have multiple U.S. and international patent applications pending and multiple U.S. and international patents issued. The pending applications may not be approved, and our existing and future patents may be challenged. If such challenges are brought, the patents may be invalidated. We may not be able to develop proprietary products or technologies that are patentable, and patents issued to us may not provide us with any competitive advantages and may be challenged by third parties. Further, the patents of others may materially and adversely affect our ability to do business. In addition, a failure to obtain and defend our trademark registrations may impede our marketing and branding efforts and competitive condition. Litigation may be necessary to protect our proprietary technology. Any such litigation may be time-consuming and costly. Despite our efforts to protect our proprietary rights, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary. In addition, the laws of some foreign countries do not protect proprietary rights to as great an extent as do the laws of the U.S. Our means of protecting our proprietary rights may not be adequate or our competitors may independently develop similar technology, duplicate our products, or design around patents issued to us or other intellectual property rights of ours. There is persistent risk that some individuals will improperly take our intellectual property after terminating their employment or other engagements with us, which could lead to intellectual property leakage to competitors and a loss of our competitive advantages.\nWe may be found to infringe on intellectual property rights of others.\nWe compete in markets in which intellectual property infringement claims arise in the normal course of business. Third parties have, from time to time, asserted intellectual property-related claims against us, including claims for alleged patent infringement brought by non-practicing entities. Such claims may be made against our products and services, our customers’ use of our products and services, or a combination of our products and third-party products. We also may be subject to claims and indemnification obligations from customers and resellers with respect to third-party intellectual property rights pursuant to our agreements with them. If we refuse to indemnify or defend such claims, even in situations in which the third-party’s allegations are meritless, then customers and resellers may refuse to do business with us.\n\n\n26\n\n\n\n\n \n\n\nPatent litigation is particularly common in our industry. We have been, and continue to be, in active patent litigations with non-practicing entities. There is no guarantee that, in patent or other types of intellectual property litigation, we will prevail at trial or be able to settle at a reasonable cost.  If a judge or jury were to find that our products infringe, we could be required to pay significant monetary damages and be subject to an injunction that could cause product shipment delays, require us to redesign our products, affect our ability to supply or service our customers, and/or require us to enter into compulsory royalty or licensing agreements.\n \nWe expect that companies in the enterprise storage and data management, and cloud storage, operational and workload services markets will increasingly be subject to infringement claims as the number of products and competitors in our industry segment grows and the functionality of products in different industry segments overlaps. Any such claims, and any such infringement claims discussed above, could be time consuming, result in costly litigation, cause suspension of product shipments or product shipment delays, require us to redesign our products, or require us to enter into royalty or licensing agreements, any of which could materially and adversely affect our operating results, financial condition and cash flows. Such royalty or licensing agreements, if required, may not be available on terms acceptable to us or at all.\n \nWe rely on software from third parties, and a failure to properly manage our use of third-party software could result in increased costs or loss of revenue.\n \nMany of our products are designed to include software licensed from third parties. Such third-party software includes software licensed from commercial suppliers and software licensed under public or open-source licenses.  We have internal processes to manage our use of such third-party software. However, if we fail to adequately manage our use of third-party software, then we may be subject to copyright infringement or other third-party claims. If we are non-compliant with a license for commercial software, then we may be required to pay penalties or undergo costly audits pursuant to the license agreement. In the case of open-source software licensed under certain “copyleft” licenses, the license itself may require, or a court-imposed remedy for non-compliant use of the open-source software may require, that proprietary portions of our own software be publicly disclosed or licensed. Additionally, contract proposals, negotiations and software proposals are complex and frequently involve lengthy bidding and selection processes. We may not be able to negotiate extensions to our current third-party licenses when due for renewal or continue to secure such licenses under commercially reasonable terms. Each of the foregoing could result in a loss of intellectual property rights, increased costs, damage to our reputation and/or a loss of revenue.\nIn addition, many of our products use open-source software. Such open-source software generally does not provide any warranty or contractual protection and may be susceptible to compromise and supply-chain attacks by threat actors. Further, open-source software or third-party software may contain vulnerabilities, which may or may not be known at the time of our inclusion of the software in a product. If a vulnerability in such software is successfully exploited, we could be subject to damages including remediation costs, reputational damage, and lost revenues.\n \nOur failure to adjust to emerging standards may harm our business.\nEmerging standards may adversely affect the UNIX\n®\n, Windows\n®\n and World Wide Web server markets upon which we depend. For example, we provide our open access data retention solutions to customers within the financial services, healthcare, pharmaceutical and government market segments, industries that are subject to various evolving governmental regulations, certifications and controls with respect to data access, reliability and permanence in the U.S. and in the other countries in which we operate. If our products do not meet and continue to comply with these evolving governmental regulations in this regard, customers in these market and geographical segments will not purchase our products, and we may not be able to expand our product offerings in these market and geographical segments at the rates which we have forecasted.\nRisks Related to Our Securities\nOur stock price is subject to volatility.\nOur stock price is subject to changes in recommendations or earnings estimates by financial analysts, changes in investors' or analysts' valuation measures for our stock, changes in our capital structure, including issuance of additional debt, changes in our credit ratings, our ability to pay dividends and to continue to execute our stock repurchase program as planned and market trends and economic volatility unrelated to our performance.\n \nIf we fail to meet any investor expectations related to dividends and/or stock repurchases, the market price of our stock could decline significantly, and could have a material adverse impact on investor confidence. Additionally, price volatility of our stock over a given period may cause the average price at which we repurchase our own stock to exceed the stock’s market price at a given point in time.\nFurthermore, speculation in the press or investment community about our strategic position, financial condition, results of operations or business can cause changes in our stock price. These factors, as well as general economic and political conditions and the timing of announcements in the public market regarding new products or services, product enhancements or technological\n \n\n\n27\n\n\n\n\n \n\n\nadvances by our competitors or us, and any announcements by us of acquisitions, major transactions, or management changes may adversely affect our stock price.\nOur quarterly operating results may fluctuate materially, which could harm our common stock price.\nOur operating results have fluctuated in the past and will continue to do so, sometimes materially. All of the matters discussed in this Risk Factors section could impact our operating results in any fiscal quarter or year. In addition to those matters, we face the following issues, which could impact our quarterly results:\n \n•\nSeasonality, such as our historical seasonal decline in revenues in the first quarter of our fiscal year and seasonal increase in revenues in the fourth quarter of our fiscal year;\n•\nLinearity, such as our historical intra-quarter customer orders and revenue pattern in which a disproportionate percentage of each quarter’s total orders and related revenue occur in the last month of the quarter; and\n•\nUnpredictability associated with larger scale enterprise software license agreements which generally take longer to negotiate and occur less consistently than other types of contracts, and for which revenue attributable to the software license component is typically recognized in full upon delivery.\nIf our operating results fall below our forecasts and the expectations of public market analysts and investors, the trading price of our common stock may decline.\n \nThere are risks associated with our outstanding and future indebtedness.\nAs of April 25, 2025, we had $3.3 billion aggregate principal amount of outstanding indebtedness for our senior notes that mature at specific dates in calendar years 2025, 2027, 2030, 2032 and 2035. We may incur additional indebtedness in the future under existing credit facilities and/or enter into new financing arrangements. We may fail to pay these or additional future obligations, as and when required. Specifically, if we are unable to generate sufficient cash flows from operations or to borrow sufficient funds in the future to service or refinance our debt, our business, operating results, financial condition and cash flows will be harmed. Any downgrades from credit rating agencies such as Moody’s Investors Service or Standard & Poor’s Rating Services may adversely impact our ability to obtain additional financing or the terms of such financing and reduce the market capacity for our commercial paper. Furthermore, if prevailing interest rates or other factors result in higher interest rates upon any potential future financing, then interest expense related to the refinance indebtedness would increase.\n \nIn addition, all our debt and credit facility arrangements subject us to continued compliance with restrictive and financial covenants. If we do not comply with these covenants or otherwise default under the arrangements, we may be required to repay any outstanding amounts borrowed under these agreements. Moreover, compliance with these covenants may restrict our strategic or operational flexibility in the future, which could harm our business, operating results, financial condition and cash flows.\nGeneral Risks\n \nOur business could be materially and adversely affected as a result of natural disasters, terrorist acts or other catastrophic events.\nWe depend on the ability of our personnel, inventories, equipment and products to move reasonably unimpeded around the world. Any political, military, terrorism, global trade, world health or other issue that hinders this movement or restricts the import or export of materials could lead to significant business disruptions. For example, the COVID-19 pandemic impeded the mobility of our personnel, inventories, equipment and products and disrupted our business operations. Furthermore, any economic failure or other material disruption caused by natural disasters, including fires, floods, droughts, hurricanes, tornadoes, earthquakes, and volcanoes; power or water loss or shortages; environmental disasters; telecommunications or business information systems failures or break-ins and similar events could also adversely affect our ability to conduct business. As a result of climate change, we expect the frequency and impact of such natural disasters or other material disruptions to increase. If such disruptions result in cancellations of customer orders or contribute to a general decrease in economic activity or corporate spending on IT, or directly impact our marketing, manufacturing, financial and logistics functions, or impair our ability to meet our customer demands, our operating results and financial condition could be materially adversely affected. Our headquarters is located in Northern California, an area susceptible to earthquakes and wildfires. If any significant disaster were to occur there, our ability to operate our business and our operating results, financial condition and cash flows could be adversely impacted.\nWe could be subject to additional income tax liabilities.\n \nOur effective tax rate is influenced by a variety of factors, many of which are outside of our control. These factors include among other things, fluctuations in our earnings and financial results in the various countries and states in which we do business, changes to\n \n\n\n28\n\n\n\n\n \n\n\nthe tax laws in such jurisdictions and the outcome of income tax audits. Changes to any of these factors could materially impact our operating results, financial condition and cash flows.\n \nWe receive significant tax benefits from sales to our non-U.S. customers. These benefits are contingent upon existing tax laws and regulations in the U.S. and in the countries in which our international operations are located. Future changes in domestic or international tax laws and regulations or a change in how we manage our international operations could adversely affect our ability to continue realizing these tax benefits.\n \nMany countries around the world are beginning to implement legislation and other guidance to align their international tax rules with the Organization for Economic Co-operation and Development’s Base Erosion and Profit Shifting Project (BEPS) recommendation and related action plans that aim to standardize and modernize global corporate tax policy, including changes to cross-border tax, transfer pricing documentation rules and nexus-based tax incentive practices. As a result, many of these changes, if enacted in whole or in part, could increase our worldwide effective tax rate and harm our operating results, financial condition, and cash flows. Implementation of the BEPS inclusive framework (Inclusive Framework), including potential incremental taxes under a new global minimum tax framework known as Pillar Two, is effective in most jurisdictions for fiscal years beginning on or after January 1, 2024. We are currently subject to Pillar Two rules starting in our fiscal year 2025 and could potentially be subject to additional taxes under the Inclusive Framework. Amount B under Pillar One of the Inclusive Framework is related to standardized returns for baseline marketing and distribution activities. Amount B is applicable to NetApp beginning in fiscal 2026 and we could be subject to higher controlled profit requirements for some of our global distribution entities which could increase our global tax burden.\n \nOur effective tax rate could also be adversely affected by changes in tax laws and regulations and interpretations of such laws and regulations, which in turn would negatively impact our earnings and cash and cash equivalent balances we currently maintain. Additionally, our effective tax rate could also be adversely affected if there is a change in international operations, our tax structure and how our operations are managed and structured, and as a result, we could experience harm to our operating results and financial condition. We continue to evaluate the impacts of changes in tax laws and regulations on our business.\n \nWe are routinely subject to income tax audits in the U.S. and several foreign tax jurisdictions. If the ultimate determination of income taxes or at-source withholding taxes assessed under these audits results in amounts in excess of the tax provision we have recorded or reserved for, our operating results, financial condition and cash flows could be adversely affected.\nWe may not be able to maintain appropriate internal financial reporting controls and procedures.\nWe cannot be assured that significant deficiencies or material weaknesses in our internal control over financial reporting will not exist in the future. Any failure to maintain or implement required new or improved controls, or any difficulties we encounter in their implementation, including in connection with our new ERP system, could result in significant deficiencies or material weaknesses, cause us to fail to timely meet our periodic reporting obligations, or result in material misstatements in our financial statements. Any such failure could also adversely affect the results of periodic management evaluations and annual auditor attestation reports regarding disclosure controls and the effectiveness of our internal control over financial reporting required under the Sarbanes-Oxley Act and the rules promulgated thereunder. The existence of a material weakness could result in errors in our financial statements that could result in a restatement of financial statements, cause us to fail to timely meet our reporting obligations, or cause investors to lose confidence in our reported financial information, which could cause a decline in the market price of our stock and we could be subject to sanctions or investigations by the SEC or other regulatory authorities including equivalent foreign authorities. Further, irrespective of the controls that we adopt, we cannot be assured that we will not experience fraudulent financial reporting in the future, including earnings mismanagement, recording fictitious revenues, improper asset valuation, understating liabilities or expenses, inadequate disclosure, reserve manipulation, misuse of judgments in financial reporting, concealing fraud or illegal activities, information tampering, and insider trading based on non-public information about the Company's financials.\n \n \n\n\n29\n\n\n\n\n \n\n\nIt\nem 1B.  \nUnresolved Staff Comments\nNot applicable.",
    "item1c": "Item 1C.  \nCybersecurity\n \nRisk Management and Strategy\nThe Company regularly assesses risks from cybersecurity threats, monitors its information systems for potential vulnerabilities, and tests those systems pursuant to the Company’s cybersecurity policies, standards, processes and practices, which are \nintegrated\n into the Company’s overall risk management system. \nTo protect the Company’s information systems from cybersecurity threats, the Company uses various security technologies and tools that help the Company identify, escalate, investigate, manage, resolve and recover from security incidents in a timely manner. These efforts include:\n•\nongoing collection of threat intelligence and environment awareness through monitoring,\n•\ndata protection management and vulnerability monitoring through data loss prevention and exfiltration tools,\n•\ncybersecurity risk management processes and practices,\n•\ncontrol assurance,\n•\nsecure development of new products,\n•\nidentity and access management,\n•\nincident response, auditing and monitoring, and \n•\nmaintaining a 24x7 security operations center to allow for always available incident response. \nThe Company takes a risk-based approach to cybersecurity and has implemented cybersecurity policies throughout its operations that are designed to address cybersecurity threats and incidents. In particular, the Company follows an incident escalation process that is incorporated into its incident and risk management processes. In the event the Company identifies a cybersecurity incident, its senior management, consisting of the Chief Financial Officer, Chief Information Security Officer (CISO), Chief Administrative Officer, and Executive Vice President of Business Technology and Operations review the facts and circumstances involved in such cybersecurity incident, or series of related cybersecurity incidents.\nThe Company partners with third parties to assess the effectiveness of its cybersecurity prevention and response systems and processes, including third-party review of the Company’s Information Security Management System for ISO 27001 controls, assessment of the Company’s cloud products and managed services according to the American Institute of CPAs (AICPA) Service Organization Control (SOC) Audit Type II, and new product validation as part of the Company’s secure development lifecycle. \nThe Company additionally \nengage\ns third-party providers in support of endpoint detection and responses, data loss prevention efforts, and incident management efforts.\nTo date, the Company is not aware of cybersecurity threats, including as a result of any previous cybersecurity incidents, that have \nmaterially affected\n or are reasonably likely to materially affect the Company, including its business strategy, results of operations or financial condition. For additional discussion of cybersecurity risks and potential related impacts on the Company, refer to the risk factors in Part I,",
    "item1a": "Item 1A. “Risk Factors,” including “If a material cybersecurity or other security breach impacts our services, systems, supply chain, or end-user customer systems, or if stored data is improperly accessed, our business could suffer significant harm.\n”\n \nGovernance\nNetApp's\n Board of Directors oversees the Company’s risk management process, including cybersecurity risks, directly and through its committees.\n The Audit Committee of the Board of Directors oversees the Company’s risk management program, which focuses on the most significant risks the Company faces in the short-, intermediate-, and long-term timeframes.\n The Company’s CISO regularly updates each of the Board of Directors and the Audit Committee at least twice a year.  Such updates include a review of cybersecurity risks affecting the Company, related metrics, and any incidents or issues that require attention from the Board of Directors.\nThe CISO provides leadership, strategic direction, and oversight\n for NetApp’s Global Security Risk and Compliance functions and security program.\n Global Security executives oversee management of risks and track projects progress, remediations, and any issues related to cybersecurity risks.\nNetApp’s CISO is responsible for leading the assessment and management of cybersecurity risks. The current CISO has over 30 years of experience in IT and information security, including over 16 years with NetApp in roles of increasing seniority, and \nis a\n \n\n\n30\n\n\n\n\n \n\n\nCertified Information Security Auditor, Certified Information Security Manager with ISACA and a Certified Information Systems Security Professional with ISC2\n.\n \nThe CISO stays informed on information security risks through regular meetings on key cybersecurity projects and KPIs. Updates are communicated to the Global Security Steering Committee, which \nprovides quarterly reports to the Board of Directors and to the Audit Committee."
  }
}