{
  "ticker": "NVR",
  "cik": "0000906163",
  "company_name": "NVR INC",
  "filing_date": "2025-02-12",
  "accession": "0000906163-25-000011",
  "primary_doc": "nvr-20241231.htm",
  "item_sections": {
    "item1": "Item 15.\nExhibits and Financial Statement Schedules\n30\nTable of Contents\nPART I\nItem 1.    Business.\nGeneral\nNVR, Inc., a Virginia corporation, was formed in 1980 as NVHomes, Inc. Our primary business is the construction and sale of single-family detached homes, townhomes and condominium buildings, all of which are primarily constructed on a pre-sold basis. To more fully serve customers of our homebuilding operations, we also operate a mortgage banking and title services business. We conduct our homebuilding activities directly. Our mortgage banking operations are operated primarily through a wholly owned subsidiary, NVR Mortgage Finance, Inc. (“NVRM”). Unless the context otherwise requires, references to “NVR”, “we”, “us” or “our” include NVR, Inc. and its consolidated subsidiaries.\nWe are one of the largest homebuilders in the United States. We operate in thirty-six metropolitan areas in sixteen states, and Washington, D.C. Our homebuilding operations include the construction and sale of single-family detached homes, townhomes and condominium buildings under three trade names: Ryan Homes, NVHomes and Heartland Homes. Our Ryan Homes product is marketed primarily to first-time and first-time move-up buyers. Ryan Homes operates in thirty-six metropolitan areas located in Maryland, Virginia, Washington, D.C., Delaware, West Virginia, Pennsylvania, Ohio, New York, New Jersey, Indiana, Illinois, North Carolina, South Carolina, Georgia, Florida, Tennessee and Kentucky. Our NVHomes and Heartland Homes products are marketed primarily to move-up and luxury buyers. NVHomes operates in Delaware, New Jersey, and the Washington, D.C., Baltimore, MD and Philadelphia, PA metropolitan areas. Heartland Homes operates in the Pittsburgh, PA metropolitan area.  \nWe generally do not engage in land development (see discussion below of our land development activities). Instead, we typically acquire finished building lots from various third party land developers pursuant to fixed price finished lot purchase agreements (“LPAs”) that require deposits that may be forfeited if we fail to perform under the LPAs. The deposits required under the LPAs are in the form of cash or letters of credit in varying amounts and typically range up to 10% of the aggregate purchase price of the finished lots.\nWe believe that our lot acquisition strategy avoids the financial requirements and risks associated with direct land ownership and land development. We may, at our option, choose for any reason and at any time not to perform under these LPAs by delivering notice of our intent not to acquire the finished lots under contract. Our sole legal obligation and economic loss for failure to perform under these LPAs is limited to the amount of the deposit pursuant to the liquidated damage provision contained within the LPAs. We do not have any financial guarantees or completion obligations and we typically do not guarantee lot purchases on a specific performance basis under these LPAs. None of the creditors of any of the development entities with which we have entered these LPAs have recourse to our general credit. We generally seek to maintain control over a supply of lots believed to be suitable to meet our five-year business plan.\nIn addition to constructing homes primarily on a pre-sold basis and utilizing what we believe is a conservative lot acquisition strategy, we focus on obtaining and maintaining a leading market position in each market we serve. This strategy allows us to gain valuable efficiencies and competitive advantages in our markets, which we believe contributes to minimizing the adverse effects of regional economic cycles and provides growth opportunities within these markets. Our continued success is contingent upon our ability to control an adequate supply of finished lots on which to build. As a result, in certain specific strategic circumstances we deviate from our historical lot acquisition strategy and engage in joint venture arrangements with land developers or directly acquire raw ground already zoned for its intended use for development. Once we acquire control of raw ground, we determine whether to sell the raw parcel to a developer and enter into an LPA with the developer to purchase the finished lots or hire a developer to develop the land on our behalf. While joint venture arrangements and direct land development activity are not our preferred method of acquiring finished building lots, we may enter into additional transactions in the future on a limited basis where there exists a compelling strategic or prudent financial reason to do so. We expect, however, to continue to acquire substantially all of our finished lot inventory using LPAs with forfeitable deposits. See “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 7 of this Form 10-K for additional discussion of lots controlled. In addition, see Notes 3, 4 and 5 in the accompanying consolidated financial statements included herein for additional information regarding LPAs, joint ventures and land under development, respectively.\nWe provide a number of mortgage and title-related services through our mortgage banking operations. Through operations in each of our homebuilding markets, NVRM originates mortgage loans exclusively for our homebuyers. NVRM generates revenues primarily from origination fees, gains on sales of loans and title fees. NVRM sells the mortgage loans it closes into the secondary markets primarily on a servicing released basis.\nSegment information for our homebuilding and mortgage banking businesses is included in Note 2 in the accompanying consolidated financial statements.\n1\nTable of Contents\nHomebuilding\nProducts\nWe offer single-family detached homes, townhomes and condominiums with many different home designs. These home designs have a variety of elevations and numerous other options. Our homes combine traditional, transitional, cottage or urban exterior designs with contemporary interior designs and amenities, generally include two to four bedrooms and range from approximately 1,000 to 9,000 finished square feet. During 2024, the prices at which we settled homes ranged from approximately $190,000 to $2.3 million. The average price of homes settled was $450,700 in both 2024 and 2023.\nMarkets\nOur four reportable homebuilding segments operate in the following geographic regions:\nMid Atlantic:\n \nMaryland, Virginia, West Virginia, Delaware and Washington, D.C.\nNorth East:\n \nNew Jersey and Eastern Pennsylvania\nMid East:\n \nNew York, Ohio, Western Pennsylvania, Indiana and Illinois\nSouth East:\n \nNorth Carolina, South Carolina, Tennessee, Florida, Georgia and Kentucky\nBacklog\nBacklog, which represents homes sold but not yet settled with the customer, totaled 9,953 units and approximately $4.8 billion as of December 31, 2024 compared to 10,229 units and approximately $4.8 billion as of December 31, 2023. The average price of homes in backlog increased to $481,400 as of December 31, 2024 from $465,000 as of December 31, 2023. Backlog may be impacted by customer cancellations for various reasons that are beyond our control, such as the customer’s failure to obtain mortgage financing, inability to sell an existing home, job loss or a variety of other reasons. In any period, a portion of the cancellations that we experience are related to new sales that occurred during the same period, and a portion are related to sales that occurred in prior periods and therefore appeared in the opening backlog for the current period. Expressed as the total of all cancellations during the period as a percentage of gross sales during the period, our cancellation rate was approximately 14%, 13% and 14% in 2024, 2023, and 2022, respectively. During the four quarters of each of 2024, 2023 and 2022, approximately 5% in 2024, 4% in 2023 and 4% in 2022 of a reporting quarter’s opening backlog cancelled during the quarter. We can provide no assurance that our historical cancellation rates are indicative of the actual cancellation rate that may occur in future periods. Other than those units that are cancelled, we expect to settle substantially all of our December 31, 2024 backlog during 2025. See “Risk Factors” in",
    "item1a": "Item 1A of this Form 10-K \"Risk Factors\", failure to maintain the security of the data we are required to protect could have a material adverse effect on our operations and financial results. \nWe currently do not believe that any current cybersecurity threats have materially affected, or are reasonably likely to materially affect, our business strategy, results of operations or financial condition.\n \nGovernance\nOur Audit Committee is required under its charter to periodically review our data privacy and information security programs.\n  Our Audit Committee assists our Board in oversight and monitoring of our cybersecurity processes, including systems to collect and store confidential information, ongoing initiatives, current threats and our response readiness to cybersecurity attacks.\nOur CIO and CISO communicate directly with members of the Audit Committee and Board of Directors on cybersecurity matters.\n In 2024, our CIO and CISO presented updates on our cybersecurity initiatives quarterly; twice to our Audit Committee and twice to our full Board.",
    "item1b": "Item 1B.    Unresolved Staff Comments.\nNone.",
    "item1c": "Item 1C.    Cybersecurity.\nRisk Management and Strategy\nWe have implemented systems and processes intended to secure our information technology systems and prevent unauthorized access to or loss of sensitive, confidential and personal data. \nThese processes are implemented and overseen primarily by our \nChief Information Officer (CIO) and Chief Information Security Officer (CISO)\n.\n \nOur CIO has over 35 years of experience and in his 20 years at NVR has been responsible for the implementation and modernization of many of our key technologies across the enterprise.  Our CISO has over 25 years of experience in information technology architecture, including over 18 years with NVR in progressively more senior information security roles.\n \nSignificant information technology processes that have been implemented include:\n \n -  vulnerability management to help ensure security updates are effectively applied,\n-  utilization of encryption and multi-factor authentication technologies to protect company data,\n-  regular required training for all employees with systems access regarding matters such as cybersecurity threats and data protection, and utilization of simulated phishing tests to increase security awareness,\n-  regular review of third-party service providers, including review of their system and organization controls (SOC) reports,\n-  enhanced monitoring capabilities for early detection and rapid response to potential security anomalies,\n-  documented incident response readiness process updated annually, \n-  \ncompletion of tabletop exercises on potential cybersecurity breaches with the assistance of a \nthird-party\n cybersecurity consultant, and\n-  regular review of information technology disaster recovery and business continuity processes to help ensure the ability to resume work after an incident. \nReview of these processes has been \nincorporated\n into our annual risk assessment and internal audits of controls performed by our Internal Audit department.\n Results of these audits are reported to the Audit Committee by our Vice President of Internal Audit and Corporate Governance.  \n9\nTable of Contents\nAs previously discussed in"
  }
}