{
  "ticker": "NWSA",
  "cik": "0001564708",
  "company_name": "NEWS CORP",
  "filing_date": "2025-08-06",
  "accession": "0001564708-25-000419",
  "primary_doc": "nws-20250630.htm",
  "item_sections": {
    "item1": "ITEM 16.\nForm 10-K Summary\n119\nSIGNATURES\n120\nTable of Contents\nPART I\nITEM 1. BUSINESS\nOVERVIEW\nThe Company\nNews Corporation (the “Company,” “News Corp,” “we,” “us,” or “our”) is a global, diversified media and information services company focused on creating and distributing authoritative and engaging content and other products and services to consumers and businesses throughout the world. The Company comprises businesses across a range of media, including information services and news, digital real estate services and book publishing, that are distributed under some of the world’s most recognizable and respected brands, including \nThe Wall Street Journal\n, \nBarron’s\n, Dow Jones, \nThe Australian\n, \nHerald Sun\n, \nThe Sun\n, \nThe Times,\n HarperCollins Publishers, realestate.com.au, Realtor.com\n®\n, talkSPORT and many others.\nThe Company’s commitment to premium content makes its properties a premier destination for information, news, real estate and entertainment. The Company distributes its content and other products and services to consumers and customers across an array of digital platforms including websites, mobile apps, social media, e-book devices and streaming audio platforms, as well as traditional platforms such as print and radio. The Company’s focus on quality and product innovation has enabled it to capitalize on the shift to digital consumption to deliver its products and services in a more engaging, timely and personalized manner and create opportunities for more effective monetization, including new licensing and partnership arrangements with large technology companies and AI-focused platforms and digital offerings that leverage the Company’s existing content. The Company is pursuing multiple strategies to further exploit these opportunities, including leveraging global audience scale and valuable data and sharing technologies and practices across geographies and businesses.\nThe Company’s diversified revenue base includes recurring subscriptions, circulation sales, advertising sales, sales of real estate listing products, licensing fees and other consumer product sales. Headquartered in New York, the Company operates primarily in the United States (“U.S.”), Australia and the United Kingdom (“U.K.”), with its content and other products and services distributed and consumed worldwide. The Company’s operations are organized into five reportable segments: (i) Dow Jones; (ii) Digital Real Estate Services; (iii) Book Publishing; (iv) News Media; and (v) Other, which includes the Company’s general corporate overhead expenses, strategy costs and costs related to the U.K. Newspaper Matters (as defined in Note 16—Commitments and Contingencies in the accompanying Consolidated Financial Statements).\nThe Company maintains a 52-53 week fiscal year ending on the Sunday nearest to June 30 in each year. Fiscal 2025, fiscal 2024 and fiscal 2023 each included 52 weeks. Unless otherwise noted, all references to the fiscal years ended June 30, 2025, June 30, 2024 and June 30, 2023 relate to the fiscal years ended June 29, 2025, June 30, 2024 and July 2, 2023, respectively. For convenience purposes, the Company continues to date its financial statements as of June 30.\nCorporate Information\nNews Corporation is a Delaware corporation originally organized on December 11, 2012 in connection with its separation from Twenty-First Century Fox, Inc., which was completed on June 28, 2013. Unless otherwise indicated, references in this Annual Report on Form 10-K for the fiscal year ended June 30, 2025 (the “Annual Report”) to the “Company,” “News Corp,” “we,” “us,” or “our” means News Corporation and its subsidiaries. The Company’s principal executive offices are located at 1211 Avenue of the Americas, New York, New York 10036, and its telephone number is (212) 416-3400. The Company’s Class A and Class B Common Stock are listed on The Nasdaq Global Select Market under the trading symbols “NWSA” and “NWS,” respectively, and CHESS Depositary Interests representing the Company’s Class A and Class B Common Stock are listed on the Australian Securities Exchange (“ASX”) under the trading symbols “NWSLV” and “NWS,” respectively. More information regarding the Company is available on its website at www.newscorp.com, including the Company’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), which are available, free of charge, as soon as reasonably practicable after the material is electronically filed with or furnished to the Securities and Exchange Commission (“SEC”). The information on the Company’s website is not, and shall not be deemed to be, a part of this Annual Report or incorporated into any other filings it makes with the SEC.\n1\nTable of Contents\nSpecial Note Regarding Forward-Looking Statements\nThis document and any documents incorporated by reference into this Annual Report, including “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations,” contain statements that constitute “forward-looking statements” within the meaning of Section 21E of the Exchange Act and Section 27A of the Securities Act of 1933, as amended. All statements that are not statements of historical fact are forward-looking statements. The words “expect,” “will,” “estimate,” “anticipate,” “predict,” “believe,” “should” and similar expressions and variations thereof are intended to identify forward-looking statements. These statements appear in a number of places in this document and include statements regarding the intent, belief or current expectations of the Company, its directors or its officers with respect to, among other things, trends affecting the Company’s business, financial condition or results of operations, the Company’s strategy and strategic initiatives, including the sale of the Foxtel Group (“Foxtel”) and other potential acquisitions, investments and dispositions, the Company’s cost savings initiatives and the outcome of contingencies such as litigation and investigations. Readers are cautioned that any forward-looking statements are not guarantees of future performance and involve risks and uncertainties. More information regarding these risks and uncertainties and other important factors that could cause actual results to differ materially from those in the forward-looking statements is set forth under the heading “",
    "item1a": "Item 1A. Risk Factors” in this Annual Report on Form 10-K, and there can be no assurance that cybersecurity threats or incidents will not have a material adverse effect on the Company in the future. While the Company maintains cyber risk insurance, such insurance may not be sufficient to cover all losses from cybersecurity incidents.\nGovernance\nNews Corp’s Board of Directors oversees the Company’s processes for identifying, assessing and managing significant risks facing the Company, and each of the Board’s standing committees assists the Board within the areas delegated to that committee. \nThe Board of Directors has delegated to the Audit Committee\n \nprimary responsibility for overseeing risks related to cybersecurity, including reviewing with management the Company’s major cyber-related risk exposures and the steps that have been taken to monitor and control such exposures.\n \nThe Audit Committee generally receives reports at least quarterly from the \nCTO and CISO\n on the Company’s cybersecurity program covering various topics, including incident reporting, a review of the global cyber risk-map, updates on the cybersecurity program and initiatives, employee training, technology solutions and other practices designed to minimize the risks associated with cybersecurity threats, and updates the Board of Directors as appropriate.\nManagement is responsible for identifying, assessing and managing material cybersecurity risks on a day-to-day basis. \nThe Company’s Global Cybersecurity Steering Committee, comprised of the CTO, CISO and representatives from internal audit, legal, finance, privacy and human resources, is responsible for overseeing the Company’s cybersecurity controls and generally meets on a quarterly basis.\n The Company’s global cybersecurity organization, led by the CISO, is responsible for developing and implementing cybersecurity policies and procedures and identifying potential risks across the Company and works closely with dedicated cybersecurity personnel at the Company’s business units. \nThe Company’s CTO assumed his position in June 2025 after serving in various leadership and technology roles at the Company’s subsidiary News Corp Australia since 2012, including as CTO from 2020. He has extensive experience in information technology infrastructure and risk management, digital media and the management of digital networks. The Company’s CISO has been in his position since December 2024 after serving in various leadership and information security roles at the Company since 2021. He has over two decades of industry experience in cybersecurity, information governance and risk management at large media and technology companies.\n \nAs part of the Company’s cybersecurity program, described above, the CISO is informed about and monitors the Company’s prevention, detection, response, mitigation and remediation efforts related to cybersecurity threats through regular communication and reporting from the Company’s cybersecurity team. The CISO works closely with representatives from the Company’s legal group, including to oversee compliance with legal, regulatory and contractual security requirements. The CISO provides regular updates to the \nCTO and the Global Cybersecurity Steering Committee and to other members of executive management,\n as appropriate. The Company’s reporting framework also includes its incident response policy and plan and other policies and processes which set forth specific procedures for internal and external reporting in the event of a cybersecurity incident, including notification to the Audit Committee or the Board of Directors, as appropriate.\n28\nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nAs a high-profile global media and information services company with a wide array of digital products and services, the Company is subject to risks associated with cybersecurity threats. \nThe \nCompany has developed and implemented a cybersecurity program designed to manage these threats, including the assessment, identification and management of cybersecurity risks, and related protection, response, mitigation and recovery efforts.\n The program is overseen and monitored by a dedicated internal global cybersecurity organization, led by the Company’s Chief Information Security Officer (“CISO”), who reports directly to the Company’s Chief Technology Officer (“CTO”), and supported by designated business information security officers at the Company’s business units. The Company’s cybersecurity program is informed in part by the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework and leverages a \ndefense-in-depth approach to managing cybersecurity risk\n. The governance, principles and framework for the program are set forth in the Company’s Global Cybersecurity Governance Principles Framework and are complemented by a set of global cybersecurity policies designed to promote secure cyber and data practices among Company personnel. T\nhe Company reinforces a culture of secure behavior through annual cybersecurity \nand privacy\n awareness trainings, quarterly phishing exercises and regular delivery of other security awareness content via an online training system, steering committees, newsletters, departmental meetings and periodic campaigns, as well as specialized secure development training for product development teams.\n In addition, the Company employs various technical measures and processes to address the cybersecurity threats it faces, which may include reporting, monitoring and alert tools, identity and access management, \nmulti-factor authentication, encryption, endpoint detection and response, email, application and cloud security\n tools, vulnerability scanning tools, threat intelligence monitoring and application resilience measures, as well as threat modeling, architecture design reviews and code reviews performed by its product security team.\nThe Company maintains a cybersecurity incident response policy and plan, which in conjunction with the above measures, are designed to facilitate detection, analysis, containment, remediation and recovery from cybersecurity incidents and set forth processes to manage, escalate and, as appropriate, report such incidents based on their potential impact to the Company.\n The Company also undertakes disaster recovery and business continuity planning and maintains certain system redundancies to limit the impact of cybersecurity incidents and other disruptions, but there can be no assurance that these efforts will be successful. The Company conducts periodic testing and assessments of its cybersecurity program, both through internal security personnel and third-party firms. The Company engages consultants and other independent third parties to periodically perform internal and external penetration testing, security audits, incident response readiness exercises and assessments of the Company’s cybersecurity risk management practices, including an evaluation of the Company’s cybersecurity program based on the NIST Cybersecurity Framework approximately every two years. The Company may also consult with external legal counsel, third-party experts and other advisors in connection with incident response and recovery efforts and forensic investigations. \n27\nTable of Contents\nThe Company’s processes for i\ndentifying, assessing and managing cybersecurity risk are integrated into the Company’s overall risk management process. The Company’s internal audit group monitors the Company’s risk profile and conducts regular enterprise-wide integrated risk assessments, with input from corporate and business unit management and personnel, to identify and assist the Board of Directors and senior executives in managing key existing and emerging risks for the Company and its businesses, including cybersecurity risk. The risk assessment process culminates in semi-annual reports to the Audit Committee and the Board of Directors.\nIn addition to its own systems and technology, t\nhe Company relies on \nthird-party service providers\n for certain software, technology and cloud-based systems and services that support a variety of critical business operations. The Company has policies and processes designed to identify, assess and manage cybersecurity risk relating to these third-party service providers. When contracting with these providers, t\nhe procurement function works closely with the compliance, cybersecurity, privacy and legal teams to conduct diligence and help appropriately manage risk, including cybersecurity risk, throughout the life cycle of the contract. The Company and its business units have developed, and seek to incorporate, standard contractual security requirements into their service provider agreements. The Company also\n \nperforms cybersecurity assessments of third-party service providers\n where it deems appropriate given the nature of the engagement and the data and systems expected to be accessed. \nAlthough the Company dedicates significant resources and efforts to protect against cybersecurity risks, the Company has experienced, and expects to continue to be subject to, cybersecurity threats. \nTo date, the Company is not aware of any cybersecurity incidents that have materially affected or are reasonably likely to materially affect the Company, including its business strategy, results of operations or financial condition.\n However, the Company continues to face cybersecurity risks such as those described in “"
  }
}