{
  "ticker": "OMC",
  "cik": "0000029989",
  "company_name": "OMNICOM GROUP INC.",
  "filing_date": "2025-02-05",
  "accession": "0000029989-25-000009",
  "primary_doc": "omc-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business  - \nAgreement to Acquire IPG.\n” \nOur Business\nWe are a strategic holding company providing data-inspired, creative marketing and sales solutions to many of the largest global companies. Our portfolio of companies includes our global networks, BBDO, DDB, TBWA, Omnicom Media Group, the DAS Group of Companies, and the Communications Consultancy Network. All of our global networks integrate their service offerings with the Omnicom branded practice areas, including Omnicom Health Group, Omnicom Precision Marketing Group, Omnicom Commerce Group, Omnicom Advertising Collective, Omnicom Public Relations Group, Omnicom Brand Consulting Group, Flywheel Digital and Omnicom Production, a practice area that brings together Omnicom’s global production capabilities, as well as our Experiential businesses and Execution & Support businesses, which includes Omnicom Specialty Marketing Group.  In August 2024, we announced the formation of Omnicom Advertising Group, or OAG, a new global organization that aligns the world-class creative networks BBDO, DDB and TBWA, as well as leading agencies within the Omnicom Advertising Collective. OAG began operations in January 2025. In\n \nJanuary 2024\n, we acquired Flywheel Digital, the digital commerce business of Ascential plc, for a net cash purchase price of approximately \n$845 million\n.\nOn a global, pan-regional, and local basis, our networks, practice areas and agencies provide a comprehensive range of services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Media & Advertising includes creative services across digital and traditional media, strategic media planning and buying, performance media, data analytics services, and Omnicom Production. Precision Marketing includes digital and direct marketing, digital transformation consulting, e-commerce operations, media execution, market intelligence and data and analytics. Public Relations services include corporate communications, crisis \n13\nmanagement, public affairs and media and media relations services. Healthcare includes corporate communications and advertising and media services to global healthcare and pharmaceutical companies. Branding & Retail Commerce services include brand and product consulting, strategy and research and retail marketing. Experiential marketing services include live and digital events and experience design and execution. Execution & Support includes field marketing, sales support, digital and physical merchandising, point-of-sale and product placement, as well as other specialized marketing and custom communications services. We operate in all major markets and have a large client base. Our geographic markets include the Americas, which includes North America and Latin America, Europe, EMEA, and Asia-Pacific.\nOur business model was built and continues to evolve around our clients. While our networks, practice areas and agencies operate under different names and frame their ideas in different disciplines, we organize our services around our clients. Our fundamental business principle is that our clients’ specific requirements are the central focus of how we structure our service offerings and allocate our resources. This client-centric business model requires that multiple agencies within Omnicom collaborate in formal and informal virtual client networks utilizing our key client matrix organization structure. This collaboration allows us to cut across our internal organizational structures to execute our clients’ marketing requirements in a consistent and comprehensive manner. We use our client-centric approach to grow our business by expanding our service offerings to existing clients, moving into new markets and obtaining new clients. In addition, we pursue selective acquisitions of complementary companies with strong entrepreneurial management teams that could fill gaps in our service delivery to our existing clients.\nWe believe generative AI will have a significant effect on how we provide services to our clients and how we enhance the productivity of our people. As with any new technology, we are working closely with our clients and technology partners to take advantage of the benefits of AI while being mindful of its limitations, risks, and privacy concerns. We are committed to responsible AI practices and collaboration to harness AI's potential, while evaluating related risks, such as ethical considerations, public perception and reputational concerns, intellectual property protection, regulatory compliance, privacy and data security concerns and our ability to effectively adopt this new emerging technology. The rapidly developing nature of AI technology makes it difficult to assess the full impact on our business at this time.     \nWe operate in all major markets and have a large client base. For the year ended December 31, 2024, our largest client represented 2.7% of revenue, and our 100 largest clients, which represent many of the world's major marketers, represented approximately 54% of revenue. Our clients operate in virtually every sector of the global economy, with no one industry representing more than 17% of our revenue in 2024. Although our revenue is generally balanced between the United States and international markets and we have a large and diverse client base, we are not immune to general economic downturns.\nGlobal economic conditions have a direct impact on our business and financial performance. Adverse global economic conditions pose a risk that our clients may reduce, postpone or cancel spending on marketing and communications services, which would reduce the demand for our services. Revenue is typically lower in the first and third quarters and higher in the second and fourth quarters, reflecting client spending patterns during the year and additional project work that usually occurs in the fourth quarter. Certain global events targeted by major marketers for advertising expenditures, such as the FIFA World Cup and the Olympics, and certain national events, such as the U.S. election process, may affect our revenue year-over-year in certain businesses. Typically, these events do not have a significant impact on our revenue in any period.\nGiven our size and breadth, we manage our business by monitoring several financial indicators. The key performance indicators that we focus on are revenue growth and variability of operating expenses. We analyze revenue growth by reviewing the components and mix of the growth, including growth by principal regional market, practice area and marketing discipline, the impact from foreign currency exchange rate changes, growth from acquisitions, net of dispositions, and growth from our largest clients. Operating expenses primarily consist of cost of services, selling, general and administrative expenses, or SG&A, and depreciation and amortization, and are analyzed for each network by the chief operating decision maker, who allocates resources accordingly.\n Financial Performance\nWorldwide revenue in 2024 increased $996.9 million, or 6.8%, to $15.7 billion compared to $14.7 billion in 2023. Worldwide organic growth (defined below) increased revenue $768.7 million, or 5.2%, reflecting increased client spending in our Media & Advertising, Precision Marketing, Experiential and Public Relations disciplines and in all of our major geographic markets compared to the prior year. Our Public Relations discipline was helped by spending on the U.S. elections, and the Experiential discipline benefited from spending on the Summer Olympics. Changes in foreign exchange rates reduced revenue $65.5 million, or 0.4%, and acquisition revenue, net of disposition revenue, increased revenue $293.7 million, or 2.0% (see Note 5 and 14 to the consolidated financial statements).\nIn North America, organic revenue growth in 2024 compared to the prior year was primarily driven by strong performance in the United States, especially in the Media & Advertising discipline, led by our media business, and our Precision Marketing, Experiential, and Public Relations disciplines. Our Public Relations discipline was helped by spending on the U.S. elections, and the Experiential discipline benefited from spending on the Summer Olympics. The organic growth was partially offset by underperformance in our Branding & Retail Commerce, Execution & Support and Healthcare disciplines. Acquisitions, net of dispositions, positively impacted revenue and were primarily related to the purchase of Flywheel Digital in January 2024 and \n14\nacquisitions in the second half of 2023 in our Public Relations discipline, partially offset by dispositions in the Execution & Support discipline in the first half of 2023. \nIn Europe, organic revenue growth in 2024 compared to the prior year was driven by strong performance in our Media & Advertising discipline, led by our media business, and in our Experiential and Execution & Support disciplines, partially offset by underperformance in our Precision Marketing, Branding & Retail Commerce and Public Relations disciplines. Foreign currency exchange rate changes increased revenue year-over-year, primarily as a result of the strengthening of the British Pound, partially offset by the weakening of several currencies against the U.S. Dollar year-over-year. Acquisitions, net of dispositions for 2024, positively impacted revenue and were primarily related to the purchase of Flywheel Digital in January 2024 and acquisition activity in our Media & Advertising discipline in the second half of 2023, partially offset by dispositions in the Execution & Support discipline in the first half of 2023.\nIn Latin America, organic revenue growth in 2024 compared to the prior year, increased in all disciplines, led by Media & Advertising, and in all countries in the region. The weakening of most currencies against the U.S. Dollar decreased revenue in 2024, compared to 2023. Acquisitions positively impacted revenue and were primarily related to acquisition activity in our Media & Advertising discipline in the prior year and the purchase of Flywheel Digital in January 2024.\nIn Asia-Pacific, during 2024, organic revenue increased compared to 2023. Organic growth in our Media & Advertising discipline was partially offset by underperformance in our Precision Marketing and Public Relations disciplines. Substantially all markets in the region, especially China, India, Australia, the Philippines and Thailand, had positive organic revenue growth as compared to the prior year. Foreign currency changes decreased revenue for the year, primarily as a result of the weakening of the Japanese Yen and Chinese Reminbi against the U.S. Dollar. Acquisition activity, including the purchase of Flywheel Digital in January 2024, increased revenue compared to the prior year.\nThe year-over-year changes in worldwide revenue in 2024, compared to 2023, in our fundamental disciplines were: Media & Advertising increased $575.0 million, Precision Marketing increased $347.4 million, Public Relations increased $100.3 million, Healthcare decreased $8.0 million, Branding & Retail Commerce decreased $60.8 million, Experiential increased $80.1 million and Execution & Support decreased $37.1 million.\nThe increases in worldwide revenue across our principal regional markets were: North America $699.2 million, Europe $172.1 million, Asia-Pacific $69.1 million and Latin America $46.9 million.\nA summary of our consolidated results of operations year-over-year:\n2024\n2023\n$ Change\n% Change\nRevenue\n$\n15,689.1\n$\n14,692.2\n$\n996.9 \n6.8 \n%\nOperating Income\n2,3\n$\n2,274.6\n$\n2,104.7\n$\n169.9 \n8.1 \n%\nOperating Margin\n2,3\n14.5\n \n%\n14.3 \n%\n0.2 \n%\nNet Income - Omnicom Group Inc.\n2,3\n$\n1,480.6\n$\n1,391.4\n$\n89.2 \n6.4 \n%\nNet Income per Share - Omnicom Group Inc.: Diluted\n2,3\n$\n7.46\n$\n6.91\n$\n0.55 \n8.0 \n%\nEBITA\n1,2,3\n$\n2,362.1\n$\n2,166.5\n$\n195.6 \n9.0 \n%\nEBITA Margin\n1,2,3\n15.1\n \n%\n14.7 \n%\n0.4 \n%\n1) Reconciliation of Non-GAAP Financial Measures on page \n30\n.\n2) In 2024, operating expenses included $57.8 million ($42.9 million after-tax) of repositioning costs, primarily related to severance, recorded in the second quarter of 2024 (see Note 13 to the consolidated financial statements). Included in selling, general and administrative expenses in the fourth quarter of 2024 are acquisition transaction costs of $14.6 million ($13.1 million after-tax), related to the proposed merger with IPG (see Note 1 to the consolidated financial statements). The net impact of these items reduced operating income for 2024 by $72.4 million ($56.0 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.28. \nIn 2023, operating expenses included real estate operating lease impairment charges, severance and other exit costs of $191.5 million ($145.5 million after-tax) related to repositioning actions we took in the first and second quarters of 2023 to reduce our real estate requirements, rebalance our workforce, and consolidate operations in certain markets. In addition, in the second quarter of 2023, we recorded a gain of $78.8 million ($55.9 million after-tax) on the disposition of certain of our research businesses in the Execution & Support discipline. Included in the fourth quarter of 2023 within selling, general and administrative expenses are acquisition transaction costs of $14.5 million ($13.0 million after-tax), primarily related to the purchase of Flywheel Digital in January 2024 (see Note 5 to the consolidated financial statements). The net impact of these items reduced operating income for 2023 by $127.2 million ($102.6 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.50 (see Notes 13 and 14 to the consolidated financial statements). \n3) \n Beginning in 2024, EBITA is defined as earnings before interest, income taxes and amortization of acquired intangible assets and internally developed strategic platform assets. As a result, we reclassified the prior year to be consistent with the revised definition, which reduced EBITA from previously reported amounts. We believe EBITA is useful in evaluating the impact of amortization of acquired intangible assets and internally developed strategic platform assets on operating performance and allows for comparability between reporting periods, the after-tax impact on diluted net income per share- Omnicom Group Inc. for 2024 and 2023 was $0.32 and $0.23, respectively.\n15\nCRITICAL ACCOUNTING ESTIMATES\nThe following summary of our critical accounting policies provides a better understanding of our financial statements and the related discussion in this MD&A. We believe that the following policies may involve a higher degree of judgment and complexity in their application than most of our accounting policies and represent the critical accounting policies used in the preparation of our financial statements. Readers are encouraged to consider this summary together with our consolidated financial statements and the related notes, including Note 2, for a more complete understanding of the critical accounting policies discussed below.\nEstimates\nWe prepare our financial statements in conformity with U.S. GAAP and are required to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. We use a fair value approach in testing our intangible assets, which primarily consist of goodwill, for impairment. Actual results could differ from those estimates and assumptions.\nAcquisitions and Goodwill\nWe have made and expect to continue to make selective acquisitions. The evaluation of potential acquisitions is based on various factors, including specialized know-how, reputation, geographic coverage, competitive position and service offerings of the target businesses, as well as our experience and judgment.\nOur acquisition strategy is focused on acquiring the expertise of an assembled workforce in order to continue to build upon the core capabilities of our various strategic business platforms and agency brands through the expansion of their geographic reach or their service capabilities to better serve our clients. Additional key factors we consider include the competitive position and specialized know-how of the acquisition targets. Accordingly, as is typical in most service businesses, a substantial portion of the assets we acquire are intangible assets primarily consisting of the know-how of the personnel, which is treated as part of goodwill and is not required to be valued separately under U.S. GAAP. For each acquisition, we undertake a detailed review to identify other intangible assets that are required to be valued separately. A significant portion of the identifiable intangible assets acquired is derived from customer relationships, including the related customer contracts, as well as trade names. In valuing these identified intangible assets, we typically use an income approach and consider comparable market participant measurements.\n We evaluate goodwill for impairment at least annually at May 1 and whenever events or circumstances indicate the carrying value may not be recoverable. Under FASB ASC Topic 350, \nIntangibles - Goodwill and Other\n, we have the option of either assessing qualitative factors to determine whether it is more-likely-than-not that the carrying value of our reporting units exceeds their respective fair value (Step 0) or proceeding directly to the quantitative goodwill impairment test. While there were no trigger events that required us to perform a quantitative test, we performed the annual quantitative impairment test and compared the fair value of each of our reporting units to its respective carrying value, including goodwill. We identified our regional reporting units as components of our operating segments, which are our six global agency networks. The regional reporting units and practice areas monitor performance and are responsible for the agencies in their region. The regional reporting units report to the segment managers and facilitate the administrative and logistical requirements of our key client matrix organization structure for delivering services to clients in their regions. We have concluded that for each of our operating segments, their regional reporting units have similar economic characteristics and should be aggregated for purposes of testing goodwill for impairment at the operating segment level. Our conclusion was based on a detailed analysis of the aggregation criteria set forth in FASB ASC Topic 280, \nSegment Reporting\n, and in FASB ASC Topic 350. Consistent with our fundamental business strategy, the agencies within our regional reporting units serve similar clients in similar industries, and in many cases the same clients. In addition, the agencies within our regional reporting units have similar economic characteristics, and the employees share similar skill sets. The main economic components of each agency are employee compensation and related costs, and direct service costs and occupancy and other costs, which include rent and occupancy costs, technology costs that are generally limited to personal computers, servers and off-the-shelf software and other overhead expenses. Finally, the expected benefits of our acquisitions are typically shared by multiple agencies in various regions as they work together to integrate the acquired business into our virtual client network strategy.\nGoodwill Impairment Review - Estimates and Assumptions\nWe use the following valuation methodologies to determine the fair value of our reporting units: (1) the income approach, which utilizes discounted expected future cash flows, (2) comparative market participant multiples for EBITDA (earnings before interest, taxes, depreciation and amortization) and (3) when available, consideration of recent and similar acquisition transactions.\nIn applying the income approach, we use estimates to derive the discounted expected cash flows (“DCF”) for each reporting unit that serves as the basis of our valuation. These estimates and assumptions include revenue growth and operating margin, EBITDA, tax rates, capital expenditures, weighted average cost of capital and related discount rates and expected long-term cash flow growth rates. All of these estimates and assumptions are affected by conditions specific to our businesses, economic conditions related to the industry we operate in, as well as conditions in the global economy. The assumptions that have the most significant effect on our valuations derived using a DCF methodology are: (1) the expected long-term growth rate of our reporting units' cash flows and (2) the weighted average cost of capital (“WACC”) for each reporting unit.\n16\nThe long-term growth rate and WACC assumptions used in our evaluations:\nMay 1, 2024\nMay 1, 2023\nLong-Term Growth Rate\n3.5%\n3.5%\nWACC\n10.8% - 11.8%\n11.0% - 11.4%\nLong\n-term growth rate represents our estimate of the long-term growth rate for our industry and the geographic markets we operate in. For the past ten years, the average historical revenue growth rate of our reporting units and the Average Nominal GDP, or NGDP, growth of the countries comprising the major markets that account for substantially all of our revenue, was approximately 3.6% and 4.7%\n, respectively. We considered this history when determining the long-term growth rates used in our annual impairment test at May 1, 2024. Included in the 10-year history is the full year 2020, which included the negative impact of the COVID-19 pandemic on the global economy and our revenue. We believe marketing expenditures over the long term have a high correlation to NGDP, notwithstanding the volatility of inflationary environments. Based on our past performance, we also believe that our growth rate can exceed NGDP growth in the short-term in the markets we operate in, which are similar across our reporting units. Accordingly, for our annual test as of  May 1, 2024, we used an estimated long-term growth rate of 3.5%.\nWhen performing the annual impairment test as of May 1, 2024 and estimating the future cash flows of our reporting units, we considered the current macroeconomic environment, as well as industry and market specific conditions in 2024. In the first half of 2024, our organic revenue increase was 4.6%, which excluded our net disposition activity and the impact from changes in foreign exchange rates.\nThe WACC is comprised of: (1) a risk-free rate of return, (2) a business risk index ascribed to us and to companies in our industry comparable to our reporting units based on a market derived variable that measures the volatility of the share price of equity securities relative to the volatility of the overall equity market, (3) an equity risk premium that is based on the rate of return on equity of publicly traded companies with business characteristics comparable to our reporting units, and (4) a current after-tax market rate of return on debt of companies with business characteristics similar to our reporting units, each weighted by the relative market value percentages of our equity and debt.\nOur six reporting units vary in size with respect to revenue and the amount of debt allocated to them. These differences drive variations in fair value among our reporting units. In addition, these differences as well as differences in book value, including goodwill, cause variations in the amount by which fair value exceeds book value among the reporting units. The goodwill balances and debt vary by reporting unit primarily because our three legacy agency networks were acquired at the formation of Omnicom and were accounted for as a pooling of interests that did not result in any additional debt or goodwill being recorded. The remaining three agency networks were built through a combination of internal growth and acquisitions that were accounted for using the acquisition method and as a result, they have a relatively higher amount of goodwill and debt. Finally, the allocation of goodwill when components are transferred between reporting units is based on relative fair value at the time of transfer.\nGoodwill Impairment Review - Conclusion\nBased on the results of our impairment test, we concluded that our goodwill as of May 1, 2024 was not impaired, because the fair value of each of our reporting units was in excess of its respective net book value. For our reporting units with negative book value, we concluded that the fair value of their total assets was in excess of book value. The minimum decline in fair value that one of our reporting units would need to experience in order to fail the goodwill impairment test was approximately 48%. Notwithstanding our belief that the assumptions we used for WACC and long-term growth rate in our impairment testing were reasonable, we performed a sensitivity analysis for each reporting unit. The results of this sensitivity analysis on our impairment test as of May 1, 2024 revealed that if the WACC increased by 1% and/or the long-term growth rate decreased by 1%, the fair value of each of our reporting units would continue to be in excess of its respective net book value and would pass the impairment test.\nWe will continue to perform our impairment test each year at May 1, unless events or circumstances trigger the need for an interim impairment test. There were no events through December 31, 2024 that would change our impairment assessment. The estimates used in our goodwill impairment test do not constitute forecasts or projections of future results of operations, but rather are estimates and assumptions based on historical results and assessments of macroeconomic factors affecting our reporting units as of the valuation date. We believe that our estimates and assumptions are reasonable, but they are subject to change from year-over-year. Actual results of operations and other factors will likely differ from the estimates used in our discounted cash flow valuation, and it is possible that differences could be significant. A change in the estimates we use could result in a decline in the estimated fair value of one or more of our reporting units from the amounts derived as of our latest valuation and could cause us to fail our goodwill impairment test if the estimated fair value for the reporting unit is less than the carrying value of the net assets of the reporting unit, including its goodwill. A large decline in estimated fair value of a reporting unit could result in a non-cash impairment charge and may have an adverse effect on our results of operations and financial  position. Additional information about acquisitions and goodwill appears in Notes 2, 5 and 6 to the consolidated financial statements.\n17\nRevenue Recognition\nRevenue is recognized when a customer obtains control and receives the benefit of the promised goods or services (the performance obligation) in an amount that reflects the consideration we expect to receive in exchange for those goods or services (the transaction price). We measure revenue by estimating the transaction price based on the consideration specified in the client arrangement. Revenue is recognized as the performance obligations are satisfied. Our revenue is primarily derived from the planning and execution of advertising, marketing, and communications services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Our client contracts are primarily fees for service on a rate per hour or per project basis. Revenue is recorded net of sales, use and value added taxes.\nPerformance Obligations. \nIn substantially all our disciplines, the performance obligation is to provide advisory and consulting services at an agreed-upon level of effort to accomplish the specified engagement. Our client contracts are comprised of diverse arrangements involving fees based on any one or a combination of the following: an agreed fee or rate per hour for the level of effort expended by our employees; commissions based on the client’s spending for media purchased from third parties; qualitative or quantitative incentive provisions specified in the contract; and reimbursement for third-party costs that we are required to include in revenue when we control the vendor services related to such costs and we act as principal. The transaction price of a contract is allocated to each distinct performance obligation based on its relative stand-alone selling price and is recognized as revenue when, or as, the customer receives the benefit of the performance obligation. Clients typically receive and consume the benefit of our services as they are performed. Substantially all our client contracts provide that we are compensated for services performed to date and allow for cancellation by either party on short notice, typically 90 days, without penalty.\nGenerally, our short-term contracts, which normally take 30 to 90 days to complete, are performed by a single agency and consist of a single performance obligation. As a result, we do not consider the underlying services as separate or distinct performance obligations because our services are highly interrelated, occur in close proximity, and the integration of the various components of a marketing message is essential to overall service. In certain of our long-term client contracts, which have a term of up to one year, the performance obligation is a stand-ready obligation, because we provide a constant level of similar services over the term of the contract. In other long-term contracts, when our services are not a stand-ready obligation, we consider our services distinct performance obligations and allocate the transaction price to each separate performance obligation based on its stand-alone selling price, including contracts for strategic media planning and buying services, which are considered to be multiple performance obligations, and we allocate the transaction price to each distinct service based on the staffing plan and the stand-alone selling price. In substantially all of our creative services contracts, we have distinct performance obligations for our services, including certain creative services contracts where we act as an agent and arrange, at the client’s direction, for third parties to perform studio production efforts.\nRevenue Recognition Methods.\n A substantial portion of our revenue is recognized over time, as the services are performed, because the client receives and consumes the benefit of our performance throughout the contract period, or we create an asset with no alternative use and are contractually entitled to payment for our performance to date in the event the client terminates the contract for convenience. For these client contracts, other than when we have a stand-ready obligation to perform services, revenue is recognized over time using input measures that correspond to the level of staff effort expended to satisfy the performance obligation on a rate per hour or equivalent basis. For client contracts when we have a stand-ready obligation to perform services on an ongoing basis over the life of the contract, typically for periods up to one year, where the scope of these arrangements is broad and there are no significant gaps in performing the services, we recognize revenue using a time-based measure resulting in a straight-line revenue recognition. From time to time, there may be changes in the client service requirements during the term of a contract and the changes could be significant. These changes are typically negotiated as new contracts covering the additional requirements and the associated costs, as well as additional fees for the incremental work to be performed.\nTo a lesser extent, for certain other contracts where our performance obligations are satisfied in phases, we recognize revenue over time using certain output measures based on the measurement of the value transferred to the customer, including milestones achieved. Where the transaction price or a portion of the transaction price is derived from commissions based on a percentage of purchased media from third parties, the performance obligation is not satisfied until the media is run and we have an enforceable contract providing a right to payment. Accordingly, revenue for commissions is recognized at a point in time, typically when the media is run, including when it is not subject to cancellation by the client or media vendor.\nPrincipal vs. Agent. \nIn substantially all our businesses, we incur third-party costs on behalf of clients, including direct costs and incidental, or out-of-pocket costs. Third-party direct costs incurred in connection with the creation and delivery of advertising, marketing, and communications services include, among others: purchased media, studio production services, specialized talent, including artists and other freelance labor, event marketing supplies, materials and services, promotional items, market research and third-party data and other related expenditures. Out-of-pocket costs include, among others: transportation, hotel, meals, shipping and telecommunication charges incurred by us in the course of providing our services. Billings related to out-of-pocket costs are included in revenue since we control the goods or services prior to delivery to the client.\n18\nHowever, the inclusion of billings related to third-party direct costs in revenue depends on whether we act as a principal or as an agent in the client arrangement. In most of our businesses, including advertising, which also includes studio production efforts and media planning and buying services, precision marketing, public relations, healthcare, and branding and retail commerce, we act as an agent and arrange, at the client’s direction, for third parties to perform certain services. In these cases, we do not control the goods or services prior to the transfer to the client. As a result, revenue is recorded net of these costs, equal to the amount retained for our fee or commission.\nIn certain businesses, we may act as principal when contracting for third-party services on behalf of our clients. In our experiential business and most of our execution and support businesses, including field marketing and certain specialty marketing businesses, we act as principal because we control the specified goods or services before they are transferred to the client and we are responsible for providing the specified goods or services, or we are responsible for directing and integrating third-party vendors to fulfill our performance obligation at the agreed upon contractual price. In such arrangements, we also take pricing risk under the terms of the client contract. In certain media buying businesses, we act as principal when we control the buying process for the purchase of the media and contract directly with the media vendor. In these arrangements, we assume the pricing risk under the terms of the client contract. When we act as principal, we include billable amounts related to third-party costs in the transaction price and record revenue over time at the gross amount billed, including out-of-pocket costs, consistent with the manner that we recognize revenue for the underlying services contract. However, in media buying contracts where we act as principal, we recognize revenue at a point in time, typically when the media is run, including when it is not subject to cancellation by the client or media vendor.\nVariable Consideration. \nSome\n \nof our client arrangements include variable consideration provisions, which include performance incentives, tiered commission structures and vendor rebates in certain markets outside of the United States. Variable consideration is estimated and included in total consideration at contract inception based on either the expected value method or the most likely outcome method. These estimates are based on historical award experience, anticipated performance and other factors known at the time. Performance incentives are typically recognized in revenue over time. Variable consideration for our media businesses in certain international markets includes rebate revenue and is recognized when it is probable that the media will be run, including when it is not subject to cancellation by the client. In addition, when we receive rebates or credits from vendors for transactions entered into on behalf of clients, they are remitted to the clients in accordance with contractual requirements or retained by us based on the terms of the client contract or local law. Amounts passed on to clients are recorded as a liability and amounts retained by us are recorded as revenue when earned, typically when the media is run.\nNEW ACCOUNTING STANDARDS\nSee Notes 1 and 24 to the consolidated financial statements for information on the adoption of new accounting standards and accounting standards not yet adopted.\n19\nCONSOLIDATED RESULTS OF OPERATIONS\nThe year-over-year change in results of operations:\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\n2024\n2023\n2022\n$ Change\n$ Change\nRevenue\n$\n15,689.1\n$\n14,692.2\n$\n14,289.1\n$\n996.9\n$\n403.1 \nOperating Expenses:\nSalary and service costs\n11,432.5\n10,701.2\n10,325.9\n731.3\n375.3\nOccupancy and other costs\n1,274.4\n1,168.8\n1,168.6\n105.6\n0.2\nReal estate and other repositioning costs\n2\n57.8\n191.5\n—\n(133.7)\n191.5\nCharges arising from the effects of the war in Ukraine\n3\n—\n—\n113.4\n—\n(113.4)\nGain on disposition of subsidiary\n2\n—\n(78.8)\n—\n78.8\n(78.8)\nCost of services\n12,764.7\n11,982.7\n11,607.9\n782.0\n374.8\nSelling, general and administrative expenses\n2\n408.1\n393.7\n378.5\n14.4\n15.2\nDepreciation and amortization\n241.7\n211.1\n219.4\n30.6\n(8.3)\nTotal operating expenses\n13,414.5\n12,587.5\n12,205.8\n827.0\n381.7\nOperating Income\n2,274.6\n2,104.7\n2,083.3\n169.9\n21.4\nInterest Expense\n247.9\n218.5\n208.6\n29.4\n9.9\nInterest Income\n100.9\n106.7\n70.7\n(5.8)\n36.0\nIncome Before Income Taxes and Income From Equity\n   Method Investments\n2,127.6\n1,992.9\n1,945.4\n134.7\n47.5\nIncome Tax Expense\n560.5\n524.9\n546.8\n35.6\n(21.9)\nIncome From Equity Method Investments\n6.9\n5.2\n5.2\n1.7\n—\nNet Income\n1,574.0\n1,473.2\n1,403.8\n100.8\n69.4\nNet Income Attributed To Noncontrolling Interests\n93.4\n81.8\n87.3\n11.6\n(5.5)\nNet Income - Omnicom Group Inc.\n2,3\n$\n1,480.6\n$\n1,391.4\n$\n1,316.5\n$\n89.2\n$\n74.9\nNet Income Per Share - Omnicom Group Inc.:\nBasic\n$\n7.54\n$\n6.98\n$\n6.40\n$\n0.56\n$\n0.58\nDiluted\n2,3\n$\n7.46\n$\n6.91\n$\n6.36\n$\n0.55\n$\n0.55\nRevenue\n$\n15,689.1\n$\n14,692.2\n$\n14,289.1\n$\n996.9\n$\n403.1\nOperating Margin %\n14.5\n \n%\n14.3 \n%\n14.6 \n%\n0.2 \n%\n(0.3)\n%\nEBITA\n1,4\n$\n2,362.1\n$\n2,166.5\n$\n2,142.1\n$\n195.6\n$\n24.4\nEBITA Margin %\n15.1\n \n%\n14.7 \n%\n15.0 \n%\n0.4 \n%\n(0.3)\n%\n1) Reconciliation of Non-GAAP Financial Measures on page \n30\n.\n2) In 2024, operating expenses included $57.8 million ($42.9 million after-tax) of repositioning costs, primarily related to severance, recorded in the second quarter of 2024 (see Note 13 to the consolidated financial statements). Included in selling, general and administrative expenses in the fourth quarter of 2024 are acquisition transaction costs of $14.6 million ($13.1 million after-tax), related to the proposed merger with IPG (see Note 1 to the consolidated financial statements). The net impact of these items reduced operating income for 2024 by $72.4 million ($56.0 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.28. \nIn 2023, operating expenses included real estate operating lease impairment charges, severance and other exit costs of $191.5 million ($145.5 million after-tax) related to repositioning actions we took in the first and second quarters of 2023 to reduce our real estate requirements, rebalance our workforce, and consolidate operations in certain markets. In addition, in the second quarter of 2023, we recorded a gain of $78.8 million ($55.9 million after-tax) on the disposition of certain of our research businesses in the Execution & Support discipline. Included in the fourth quarter of 2023 within selling, general and administrative expenses are acquisition transaction costs of $14.5 million ($13.0 million after-tax), primarily related to the purchase of Flywheel Digital in January 2024 (see Note 5 to the consolidated financial statements). The net impact of these items reduced operating income for 2023 by $127.2 million ($102.6 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.50 (see Notes 13 and 14 to the consolidated financial statements). \n 3) For the year ended December 31, 2022, operating expenses included $113.4 million of charges recorded in the first quarter of 2022, as well as an additional net income tax charge of $4.8 million, related to the disposition of our businesses in Russia, which reduced net income - Omnicom Group Inc. by $118.2 million and diluted net income per share - Omnicom Group Inc. by $0.57 (see Note 15 to the consolidated financial statements).\n4) \n Beginning in 2024, EBITA is defined as earnings before interest, income taxes and amortization of acquired intangible assets and internally developed strategic platform assets. As a result, we reclassified the prior year to be consistent with the revised definition, which reduced EBITA from previously reported amounts. We believe EBITA is useful in evaluating the impact of amortization of acquired intangible assets \n20\nand internally developed strategic platform assets on operating performance and allows for comparability between reporting periods. The after-tax impact on diluted net income per share- Omnicom Group Inc. for 2024, 2023 and 2022 was $0.32, $0.23 and $0.21, respectively.\nRevenue\nThe components of year-over-year revenue change in the United States (“Domestic”) and the remainder of the world (“International”):\nTotal\nDomestic\nInternational\n$\n%\n$\n%\n$\n%\nYear Ended December 31, 2023\n$\n14,692.2 \n$\n7,471.6 \n$\n7,220.6 \nComponents of revenue change:\nForeign exchange rate impact\n(65.5)\n(0.4)\n%\n— \n— \n%\n(65.5)\n(0.9)\n%\nAcquisition revenue, net of disposition revenue\n293.7 \n2.0 \n%\n205.3 \n2.7 \n%\n88.4 \n1.2 \n%\nOrganic growth\n768.7 \n5.2 \n%\n509.6 \n6.8 \n%\n259.1 \n3.6 \n%\nYear Ended December 31, 2024\n$\n15,689.1\n \n6.8\n \n%\n$\n8,186.5\n \n9.6\n \n%\n$\n7,502.6\n \n3.9\n \n%\nTotal\nDomestic\nInternational\n$\n%\n$\n%\n$\n%\n Year Ended December 31, 2022\n$\n14,289.1 \n$\n7,367.3 \n$\n6,921.8 \nComponents of revenue change:\nForeign exchange rate impact\n(28.3)\n(0.2)\n%\n— \n— \n%\n(28.3)\n(0.4)\n%\nAcquisition revenue, net of disposition revenue\n(153.1)\n(1.1)\n%\n(87.2)\n(1.2)\n%\n(65.9)\n(1.0)\n%\nOrganic growth\n584.5 \n4.1 \n%\n191.5 \n2.6 \n%\n393.0 \n5.7 \n%\nYear Ended December 31, 2023\n$\n14,692.2 \n2.8 \n%\n$\n7,471.6 \n1.4 \n%\n$\n7,220.6 \n4.3 \n%\nThe components and percentages are calculated as follows:\n•\nForeign exchange rate impact is calculated by translating the current period’s local currency revenue using the prior period average exchange rates to derive current period constant currency revenue (in this case $15,754.6 million and $14,720.5 million for the Total column for December 31, 2024 and December 31, 2023, respectively). The foreign exchange impact is the difference between the current period revenue in U.S. Dollars and the current period constant currency revenue ($15,689.1 million less $15,754.6 million and $14,692.2 million less $14,720.5 million for the Total column for December 31, 2024 and December 31, 2023, respectively).\n•\nAcquisition revenue is calculated as if the acquisition occurred twelve months prior to the acquisition date by aggregating the comparable prior period revenue of acquisitions through the acquisition date. As a result, acquisition revenue excludes the positive or negative difference between our current period revenue subsequent to the acquisition date and the comparable prior period revenue and the positive or negative growth after the acquisition is attributed to organic growth. Disposition revenue is calculated as if the disposition occurred twelve months prior to the disposition date by aggregating the comparable prior period revenue of dispositions through the disposition date. The acquisition revenue and disposition revenue amounts are netted in the table.\n•\nOrganic growth is calculated by subtracting the foreign exchange rate impact, and the acquisition revenue, net of disposition revenue components from total revenue growth.\n•\nThe percentage change is calculated by dividing the individual component amount by the prior period revenue base of that component ($14,692.2 million and $14,289.1 million for the Total column for December 31, 2024, and December 31, 2023, respectively).\nChanges in the value of foreign currencies against the U.S. Dollar affect our results of operations and financial condition. For the most part, because the revenue and expense of our foreign operations are both denominated in the same local currency, the economic impact on operating margin is minimized. Assuming exchange rates at January 30, 2025, remain unchanged, we expect the impact of changes in foreign exchange rates to reduce revenue between 2.0% to 2.5% for the first quarter of 2025 and by 2.0% for the full year. Based on our acquisition and disposition activity to date, excluding the proposed merger with IPG, we expect that the net impact will be flat for the first quarter and for the full year of 2025.\nIn the normal course of business, our agencies both gain and lose business from clients each year due to a variety of factors. Under our client-centric approach, we seek to broaden our relationships with all of our clients. Our largest client represented approximately 2.7% and 3.0% of revenue for 2024 and 2023, respectively. Our ten largest and 100 largest clients represented approximately 19.1% and 54.4% of revenue for 2024, respectively, and 20.2% and 54.5% of revenue for 2023, respectively.\n21\nRevenue by Discipline\nTo monitor the changing needs of our clients and to further expand the scope of our services to key clients, we monitor revenue across a broad range of disciplines and group them into the following categories: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential and Execution & Support,\nThe  year-over-year change in revenue and organic growth by discipline:\nYear Ended December 31,\n2024\n2023\n2024 vs. 2023\n$\n% of\nRevenue\n$\n% of\nRevenue\n$ Change\n% Organic Growth\nMedia & Advertising\n$\n8,466.2\n \n54.0\n \n%\n$\n7,891.2 \n53.7 \n%\n$\n575.0 \n7.8 \n%\nPrecision Marketing\n1,820.9\n \n11.6\n \n%\n1,473.5 \n10.0 \n%\n347.4 \n3.8 \n%\nPublic Relations\n1,679.2\n \n10.7\n \n%\n1,578.9 \n10.7 \n%\n100.3 \n3.7 \n%\nHealthcare\n1,354.7\n \n8.5\n \n%\n1,362.7 \n9.4 \n%\n(8.0)\n(0.4)\n%\nBranding & Retail Commerce\n792.9\n \n5.1\n \n%\n853.7 \n5.8 \n%\n(60.8)\n(6.2)\n%\nExperiential\n731.5\n \n4.7\n \n%\n651.4 \n4.4 \n%\n80.1 \n15.4 \n%\nExecution & Support\n843.7\n \n5.4\n \n%\n880.8 \n6.0 \n%\n(37.1)\n(0.5)\n%\nRevenue\n$\n15,689.1\n \n$\n14,692.2 \n$\n996.9 \n5.2 \n%\nYear Ended December 31,\n2023\n2022\n2023 vs. 2022\n$\n% of\nRevenue\n$\n% of\nRevenue\n$ Change\n% Organic Growth\nMedia & Advertising\n$\n7,891.2 \n53.7 \n%\n$\n7,433.9 \n52.0 \n%\n$\n457.3 \n6.5 \n%\nPrecision Marketing\n1,473.5 \n10.0 \n%\n1,426.6 \n10.0 \n%\n46.9 \n3.1 \n%\nPublic Relations\n1,578.9 \n10.7 \n%\n1,552.7 \n10.9 \n%\n26.2 \n(0.8)\n%\nHealthcare\n1,362.7 \n9.4 \n%\n1,322.3 \n9.3 \n%\n40.4 \n3.8 \n%\nBranding & Retail Commerce\n853.7 \n5.8 \n%\n848.1 \n5.9 \n%\n5.6 \n1.2 \n%\nExperiential\n651.4 \n4.4 \n%\n635.6 \n4.4 \n%\n15.8 \n3.0 \n%\nExecution & Support\n880.8 \n6.0 \n%\n1,069.9 \n7.5 \n%\n(189.1)\n(1.0)\n%\nRevenue\n$\n14,692.2 \n$\n14,289.1 \n$\n403.1 \n4.1 \n%\nEffective January 1, 2023, we realigned the classification of certain services primarily within our Commerce & Branding, Execution & Support, and Experiential disciplines, and prior year amounts have been reclassified.\n2024 v. 2023\nThe year-over-year changes in worldwide revenue in 2024, compared to 2023, in our fundamental disciplines were: Media & Advertising increased $575.0 million, Precision Marketing increased $347.4 million, Public Relations increased $100.3 million, Healthcare decreased $8.0 million, Branding & Retail Commerce decreased $60.8 million, Experiential increased $80.1 million, and Execution & Support decreased $37.1 million. Worldwide organic revenue growth increased revenue $768.7 million, or 5.2%, primarily reflecting increased client spending in Media & Advertising, led by Media, as well as Precision Marketing, Public Relations and Experiential disciplines compared to the prior year. Our Public Relations discipline was helped by spending on the U.S. elections, and the Experiential discipline benefited from spending on the Summer Olympics. Organic growth was partially offset by underperformance in our Branding & Retail Commerce discipline. Changes in foreign exchange rates reduced revenue slightly. The decrease in revenue from foreign exchange translation was primarily related to the weakening of some currencies, including the Japanese Yen and Brazilian Real against the U.S. Dollar, partially offset by the strengthening of the British Pound, Colombian Peso and Euro against the U.S. Dollar. Acquisition revenue, net of dispositions, increased revenue $293.7 million, or 2.0% (see Notes 5 and 14 to the consolidated financial statements).\n2023 v. 2022\nThe year-over-year changes in worldwide revenue in 2023, compared to 2022, in our fundamental disciplines were: Media & Advertising increased $457.3 million, Precision Marketing increased $46.9 million, Public Relations increased $26.2 million, Healthcare increased $40.4 million, Branding & Retail Commerce increased $5.6 million, Experiential increased $15.8 million, and Execution & Support decreased $189.1 million. Organic revenue increased across substantially all disciplines, except for Public Relations, which faced a difficult comparison to the prior year, and Execution & Support. The impact of foreign exchange translation slightly reduced our revenue. The decrease in revenue from foreign exchange translation was primarily related to the weakening of several currencies against the U.S. Dollar, including the Australian Dollar, Canadian Dollar, Japanese Yen, and \n22\nChinese Renminbi, partially offset by the Euro and British Pound, which strengthened against the U.S. Dollar compared to the  prior year. The negative impact on revenue from acquisitions, net of dispositions, year-over-year was primarily due to dispositions in the Execution & Support discipline in the first and second quarters of 2023, including the sale of our research businesses, as well as the disposition of our businesses in Russia in the first quarter of 2022, partially offset by acquisitions in our Media & Advertising and Public Relations disciplines in 2023.\n Revenue by Geography\nThe year-over-year change in revenue and organic growth in our geographic markets:\nYear Ended December 31,\n2024\n2023\n2024 vs. 2023\n$\n% of\nRevenue\n$\n% of\nRevenue\n$ Change\n% Organic Growth\nAmericas:\nNorth America\n$\n8,650.2\n \n55.2\n \n%\n$\n7,951.0 \n54.2 \n%\n$\n699.2 \n6.3 \n%\nLatin America\n433.7\n \n2.8\n \n%\n386.8 \n2.6 \n%\n46.9 \n17.2 \n%\nEMEA:\nEurope\n4,439.0\n \n28.2\n \n%\n4,266.9 \n29.0 \n%\n172.1 \n2.7 \n%\nMiddle East and Africa\n319.2\n \n2.0\n \n%\n309.6 \n2.1 \n%\n9.6 \n5.2 \n%\nAsia-Pacific\n1,847.0\n \n11.8\n \n%\n1,777.9 \n12.1 \n%\n69.1 \n3.8 \n%\nRevenue\n$\n15,689.1\n \n$\n14,692.2 \n$\n996.9 \n5.2 \n%\nYear Ended December 31,\n2023\n2022\n2023 vs. 2022\n$\n% of\nRevenue\n$\n% of\nRevenue\n$ Change\n% Organic Growth\nAmericas:\nNorth America\n$\n7,951.0 \n54.2 \n%\n$\n7,856.0 \n55.0 \n%\n$\n95.0 \n2.6 \n%\nLatin America\n386.8 \n2.6 \n%\n329.0 \n2.3 \n%\n57.8 \n13.0 \n%\nEMEA:\nEurope\n4,266.9 \n29.0 \n%\n4,010.5 \n28.1 \n%\n256.4 \n6.2 \n%\nMiddle East and Africa\n309.6 \n2.1 \n%\n346.7 \n2.4 \n%\n(37.1)\n(5.8)\n%\nAsia-Pacific\n1,777.9 \n12.1 \n%\n1,746.9 \n12.2 \n%\n31.0 \n6.0 \n%\nRevenue\n$\n14,692.2 \n$\n14,289.1 \n$\n403.1 \n4.1 \n%\nThe year-over-year increase in worldwide revenue across our geographic markets for 2024 were: North America $699.2 million, or 8.8%, Latin America $46.9 million, or 12.1%, Europe $172.1 million, or 4.0%, the Middle East and Africa $9.6 million, or 3.1%, and Asia-Pacific $69.1 million, or 3.9%.\nThe year-over-year change in worldwide revenue across our geographic markets for 2023 was: North America increased $95.0 million, or 1.2%, Latin America increased $57.8 million, or 17.6%, Europe increased $256.4 million, or 6.4%, the Middle East and Africa decreased $37.1 million, or 10.7%, and Asia-Pacific increased $31.0 million, or 1.8%.\nNorth America\n2024 vs. 2023\nIn North America, organic revenue growth in 2024 compared to the prior year was primarily driven by strong performance in the United States, especially in the Media & Advertising discipline, led by our media business, and our Precision Marketing, Experiential, and Public Relations disciplines. Our Public Relations discipline was helped by spending on the U.S. elections, and the Experiential discipline benefited from spending on the Summer Olympics. The organic growth was partially offset by underperformance in our Branding & Retail Commerce, Execution & Support and Healthcare disciplines. Acquisitions, net of dispositions, positively impacted revenue and were primarily related to the purchase of Flywheel Digital in January 2024 and acquisitions in the second half of 2023 in our Public Relations discipline, partially offset by dispositions in the Execution & Support discipline in the first half of 2023. \n23\n2023 vs. 2022\nIn 2023, North America’s organic revenue growth was driven primarily by the performance in the United States, especially in the Media & Advertising discipline, led by our media business, and our Precision Marketing, and Healthcare disciplines, partially offset by negative performance in our Experiential and Branding & Retail Commerce disciplines, which faced difficult comparisons to the prior year, and our Execution & Support discipline. Acquisitions, net of dispositions, negatively impacted revenue, primarily as a result of dispositions in the Execution & Support discipline in the first and second quarters of 2023, including the sale of our research businesses, partially offset by acquisitions during the year in the Media & Advertising, Precision Marketing, and Public Relations disciplines. \nLatin America\n2024 vs. 2023\nIn Latin America, organic revenue growth in 2024 compared to the prior year, increased in all disciplines, led by Media & Advertising, and in all countries in the region. The weakening of most currencies against the U.S. Dollar decreased revenue in 2024, compared to 2023. Acquisitions positively impacted revenue and were primarily related to acquisition activity in our Media & Advertising discipline in the prior year and the purchase of Flywheel Digital in January 2024.\n2033 vs. 2022\nIn Latin America, organic revenue growth in 2023 increased in all our disciplines, led by our Media & Advertising discipline, and in substantially all countries in the region. The strengthening of most currencies, especially the Mexican Peso and Brazilian Real, partially offset by the weakening of the Argentine Peso against the U.S. Dollar, increased revenue in 2023 compared to 2022.\nEMEA\nEurope\n2024 vs. 2023\nIn Europe, organic revenue growth in 2024 compared to the prior year was driven by strong performance in our Media & Advertising discipline, led by our media business, and in our Experiential and Execution & Support disciplines, partially offset by underperformance in our Precision Marketing, Branding & Retail Commerce and Public Relations disciplines. Foreign currency exchange rate changes increased revenue year-over-year, primarily as a result of the strengthening of the British Pound, partially offset by the weakening of several currencies against the U.S. Dollar year-over-year. Acquisitions, net of dispositions for 2024, positively impacted revenue and were primarily related to the purchase of Flywheel Digital in January 2024 and acquisition activity in our Media & Advertising discipline in the second half of 2023, partially offset by dispositions in the Execution & Support discipline in the first half of 2023. In 2024, total revenue in the U.K. increased 7.1% to $1,700.5 million. Organic revenue growth year-over-year in the U.K. was 2.7%, with growth led by our media business in our Media & Advertising discipline and our Experiential and Execution & Support disciples, partially offset by negative performance in our Precision Marketing, Branding & Retail Commerce, and Public Relations disciplines. In Continental Europe, which includes the Euro Zone and the other European countries, organic growth year-over-year of 2.8% was across substantially all disciplines, led by Turkey, Spain, Germany and Netherlands, and was partially offset by weakness in France and Italy.\n2023 vs. 2022\nIn Europe for 2023 compared to 2022, organic revenue increased across most countries in our major markets and in substantially all disciplines, especially our Media & Advertising discipline, led by our media business, and our Experiential discipline, partially offset by a decrease in our Public Relations discipline. Foreign currency changes increased revenue in 2023, primarily as a result of the strengthening of the Euro and British Pound against the U.S. Dollar year-over-year. Acquisition revenue, net of disposition revenue, reduced revenue compared to the prior year, primarily due to the disposition of our businesses in Russia in the first quarter of 2022 and the disposition of certain businesses, primarily our research businesses in the Execution & Support discipline in the second quarter of 2023. In 2023, total revenue in the U.K. increased 4.0% to $1,587.3 million. Organic revenue growth year-over-year in the U.K. was 4.7%, with growth across most disciplines, led by our media business in our Media & Advertising discipline, partially offset by negative performance in our Precision Marketing and Public Relations disciplines. In Continental Europe, which includes the Euro Zone and the other European countries, organic growth year-over-year of 7.2% was led by Italy, France, and Germany across substantially all disciplines.\nMiddle East and Africa 2024 vs. 2023 vs. 2022\nIn the Middle East and Africa for 2024, organic revenue increased compared to 2023, primarily as a result of our Media & Advertising and Experiential disciplines. For 2024, the strengthening of certain currencies in the region against the U.S. Dollar decreased revenue year-over-year. For 2023, organic revenue decreased compared to 2022, primarily as a result of our Experiential discipline, which faced difficult comparisons in the region, partially offset by our Media & Advertising discipline. In 2023 as compared to 2022, the weakening of certain currencies in the region against the U.S. Dollar also decreased revenue year-over-year.\n24\nAsia-Pacific\n2024 vs. 2023\nIn Asia-Pacific, during 2024, organic revenue increased compared to 2023. Organic growth in our Media & Advertising discipline was partially offset by underperformance in our Precision Marketing and Public Relations disciplines. Substantially all markets in the region, especially China, India, Australia, the Philippines and Thailand, had positive organic revenue growth as compared to the prior year. Foreign currency changes decreased revenue for the year, primarily as a result of the weakening of the Japanese Yen and Chinese Reminbi against the U.S. Dollar. Acquisition activity, including the purchase of Flywheel Digital in January 2024, increased revenue compared to the prior year.\n2023 vs 2022\nOrganic revenue for Asia-Pacific in 2023 increased compared to 2022 across most major markets in the region, especially China, India, Australia, and Japan, and was led by our media business in our Media & Advertising discipline and our Experiential discipline. The organic revenue growth was partially offset by the weakening of certain currencies in the region against the U.S. Dollar, especially the Australian Dollar, Japanese Yen and Chinese Renminbi.\nRevenue by Industry\nRevenue by industry sector:\nYear Ended December 31,\n2024\n2023\n2022\nPharmaceuticals and Healthcare\n16\n \n%\n16 \n%\n16 \n%\nFood and Beverage\n15\n \n%\n15 \n%\n15 \n%\nAuto\n12\n \n%\n12 \n%\n12 \n%\nConsumer Products\n10\n \n%\n8 \n%\n8 \n%\nTechnology\n8\n \n%\n8 \n%\n8 \n%\nFinancial Services\n7\n \n%\n8 \n%\n8 \n%\nTravel and Entertainment\n7\n \n%\n7 \n%\n6 \n%\nRetail\n6\n \n%\n6 \n%\n6 \n%\nTelecommunications\n3\n \n%\n4 \n%\n4 \n%\nGovernment\n4\n \n%\n4 \n%\n4 \n%\nServices\n3\n \n%\n2 \n%\n3 \n%\nOil, Gas and Utilities\n2\n \n%\n2 \n%\n2 \n%\nNot-for-Profit\n1\n \n%\n1 \n%\n1 \n%\nEducation\n1\n \n%\n1 \n%\n1 \n%\nOther\n5\n \n%\n6 \n%\n6 \n%\nTotal\n100\n \n%\n100 \n%\n100 \n%\n25\nOperating Expenses\nThe year-over-year change in operating expenses:\nYear Ended December 31,\n2024\n2023\n2024 vs. 2023\n$\n% of\nRevenue\n$\n% of\nRevenue\n$\nChange\n%\nChange\nRevenue\n$\n15,689.1\n \n$\n14,692.2 \n$\n996.9 \n6.8 \n%\nOperating Expenses:\nSalary and service costs:\nSalary and related costs\n7,441.4\n \n47.4\n \n%\n7,212.8 \n49.1 \n%\n228.6 \n3.2 \n%\nThird-party service costs\n3,348.6\n \n21.3\n \n%\n2,917.9 \n19.9 \n%\n430.7 \n14.8 \n%\nThird-party incidental costs\n642.5\n \n4.1\n \n%\n570.5 \n3.9 \n%\n72.0 \n12.6 \n%\nTotal salary and service costs\n11,432.5\n \n72.9\n \n%\n10,701.2 \n72.8 \n%\n731.3 \n6.8 \n%\nOccupancy and other costs\n1,274.4\n \n8.1\n \n%\n1,168.8 \n8.0 \n%\n105.6 \n9.0 \n%\nReal estate and other repositioning costs\n57.8\n \n0.4\n \n%\n191.5 \n1.3 \n%\n(133.7)\nGain on disposition of subsidiary\n—\n \n—\n \n%\n(78.8)\n(0.5)\n%\n78.8 \n    Cost of services\n12,764.7\n \n11,982.7 \n782.0 \n6.5 \n%\nSelling, general and administrative expenses\n408.1\n \n2.6\n \n%\n393.7 \n2.7 \n%\n14.4 \n3.7 \n%\nDepreciation and amortization\n241.7\n \n1.5\n \n%\n211.1 \n1.4 \n%\n30.6 \n14.5 \n%\nTotal operating expenses\n13,414.5\n \n85.5\n \n%\n12,587.5 \n85.7 \n%\n827.0 \n6.6 \n%\nOperating Income\n$\n2,274.6\n \n14.5\n \n%\n$\n2,104.7 \n14.3 \n%\n$\n169.9 \n8.1 \n%\nYear Ended December 31,\n2023\n2022\n2023 vs. 2022\n$\n% of\nRevenue\n$\n% of\nRevenue\n$\nChange\n%\nChange\nRevenue\n$\n14,692.2 \n$\n14,289.1 \n$\n403.1 \n2.8 \n%\nOperating Expenses:\nSalary and service costs:\nSalary and related costs\n7,212.8 \n49.1 \n%\n7,197.9 \n50.4 \n%\n14.9 \n0.2 \n%\nThird-party service costs\n2,917.9 \n19.9 \n%\n2,585.5 \n18.1 \n%\n332.4 \n12.9 \n%\nThird-party incidental costs\n570.5 \n3.9 \n%\n542.5 \n3.8 \n%\n28.0 \n5.2 \n%\nTotal salary and service costs\n10,701.2 \n72.8 \n%\n10,325.9 \n72.3 \n%\n375.3 \n3.6 \n%\nOccupancy and other costs\n1,168.8 \n8.0 \n%\n1,168.6 \n8.2 \n%\n0.2 \n— \n%\nReal estate and other repositioning costs\n191.5 \n1.3 \n%\n— \n— \n%\n191.5 \n— \n%\nCharges arising from the effects of the war in Ukraine\n— \n— \n%\n113.4 \n0.8 \n%\n(113.4)\nGain on disposition of subsidiary\n(78.8)\n(0.5)\n%\n— \n— \n%\n(78.8)\n    Cost of services\n11,982.7 \n11,607.9 \n374.8 \n3.2 \n%\nSelling, general and administrative expenses\n393.7 \n2.7 \n%\n378.5 \n2.6 \n%\n15.2 \n4.0 \n%\nDepreciation and amortization\n211.1 \n1.4 \n%\n219.4 \n1.5 \n%\n(8.3)\n(3.8)\n%\nTotal operating expenses\n12,587.5 \n85.7 \n%\n12,205.8 \n85.4 \n%\n381.7 \n3.1 \n%\nOperating Income\n$\n2,104.7 \n14.3 \n%\n$\n2,083.3 \n14.6 \n%\n$\n21.4 \n1.0 \n%\nWe measure cost of services in two distinct categories: salary and service costs and occupancy and other costs. As a service business, salary and service costs make up the significant portion of our operating expenses and substantially all these costs comprise the essential components directly linked to the delivery of our services. Salary and service costs include employee compensation and benefits, freelance labor, third-party service costs, and third-party incidental costs. Third-party service costs include vendor costs when we act as principal in providing services to our clients. Third-party incidental costs that are required to be included in revenue primarily consist of client-related travel and incidental out-of-pocket costs that are billed back to the client directly at our cost. Occupancy and other costs consist of the indirect costs related to the delivery of our services, including office rent and other occupancy costs, equipment rent, technology costs, general office expenses and other expenses. Adverse and beneficial fluctuations in foreign currencies from year-over-year impact our results of operations and financial condition when we translate our financial statements from local foreign currencies to the U.S. Dollar. However, substantially all of our foreign operations transact business in their local currency, mitigating the impact of changes in foreign currency exchange rates on our \n26\noperating margin percentage. As a result, the changes in our operating expenses year-over-year from foreign currency translation were in line with the percentage impact from changes in foreign currencies on revenue for the year ended December 31, 2024.\n2024 vs. 2023\nOperating expenses in 2024 increased $827.0 million, or 6.6%, to $13,414.5 million from $12,587.5 million, compared to the prior year, primarily as a result of organic growth and the acquisition of Flywheel in the first quarter of 2024 (see Note 5 to the consolidated financial statements). Operating expenses for 2024 include the impact of repositioning costs, primarily related to severance, recorded in the second quarter of 2024 for $57.8 million in connection with our strategic initiatives to increase efficiencies in our international operations and the start of the consolidation of our production services (see Note 13 to the consolidated financial statements).  Included in selling, general and administrative expenses in the fourth quarter of 2024 are acquisition transaction costs of $14.6 million ($13.1 million after-tax) related to the proposed merger with IPG (see Note 1 to the consolidated financial statements).\n2023 vs. 2022\nOperating expenses in 2023 increased $381.7 million, or 3.1%, to $12,587.5 million from $12,205.8 million. Operating expenses for 2023 reflect the net impact of the gain on disposition of certain research businesses in our Execution & Support discipline of $78.8 million, repositioning costs related to real estate and other exit charges and severance costs of $191.5 million (see Notes 13 and 14 to the consolidated financial statements) and acquisition transaction costs of $14.5 million, primarily related to the Flywheel Digital acquisition that closed in January 2024.\nOperating Expenses - Salary and Service Costs\nSalary and service costs, which tend to fluctuate with changes in revenue, are comprised of salary and related costs, third-party service costs, and third-party incidental costs.\n2024 vs. 2023\nSalary and service costs for 2024 increased $731.3 million, or 6.8%, to $11,432.5 million, compared to the prior year. Salary and related costs for 2024 increased $228.6 million, or 3.2%, to $7,441.4 million, primarily as a result of our acquisition of Flywheel Digital. These costs decreased as a percentage of revenue, primarily due to the reduction in headcount arising from our ongoing repositioning actions and changes in our global employee mix. Third-party service costs for 2024 increased $430.7 million, or 14.8%, to $3,348.6 million, primarily as a result of organic growth in our Media & Advertising and Experiential disciplines. Third-party incidental costs for 2024 increased $72.0 million, or 12.6%, to $642.5 million.\n2023 vs. 2022\nSalary and service costs in 2023 compared to the prior year period increased $375.3 million, or 3.6% to $10,701.2 million. Salary and related costs for 2023 increased $14.9 million, or 0.2%, to $7,212.8 million, primarily due to an increase in headcount. Headcount increased in 2023 as a result of organic growth and our acquisition activity; the increase was partially offset by the dispositions in our Execution & Support discipline in the first and second quarters of 2023. Third-party service costs for 2023 increased $332.4 million, or 12.9%, to $2,917.9 million due to changes in the mix of our businesses year-over-year, and were less impacted by the effects of our disposition activity during the year. Third-party incidental costs for 2023 increased $28.0 million, or 5.2%, to $570.5 million. \nOperating Expenses - Occupancy and Other Costs\nOccupancy and other costs are less directly linked to changes in revenue than salary and service costs. \n2024 vs. 2023\nOccupancy and other costs for 2024, increased by $105.6 million, or 9.0%, year-over-year to $1,274.4 million, primarily resulting from acquisition activity. Increased office and other related costs were partially offset by lower rent expense in the year.\n2023 vs. 2022\nOccupancy and other costs for 2023, increased slightly by $0.2 million year-over-year. Lower rent expense was partially offset by an increase in office and other related costs in the year. In connection with the transition to a flexible working environment, a hybrid model which allows for partial remote work, we took certain actions in the first quarter of 2023 to reduce and reposition our office lease portfolio and recorded a charge of $119.2 million, which included an $80.4 million non-cash impairment charge for operating lease right-of-use, or ROU, assets, $20.0 million for the write-off of the net book value of leasehold improvements at the affected locations, and $18.8 million of other lease obligations. Substantially all of the operating lease payments related to the ROU assets will be paid out through December 31, 2026 (see Note 13 to the consolidated financial statements).\n27\nOperating Expenses - Selling, General & Administrative Expenses\nSG&A expenses primarily consist of third-party marketing costs, professional fees, and compensation and benefits and occupancy and other costs of our corporate and executive offices, including group-wide finance and accounting, treasury, legal and governance, human resource oversight and similar costs.\n2024 vs. 2023\nSG&A expenses for 2024 increased $14.4 million compared to 2023, primarily due to professional fees related to our strategic initiatives. \n \nIncluded in selling, general and administrative expenses in the fourth quarter of 2024 are acquisition transaction costs of $14.6 million ($13.1 million after-tax) related to the proposed merger with IPG (see Note 1 to the consolidated financial statements).\n2023 vs. 2022\nSG&A expenses for 2023 increased $15.2 million compared to 2022, primarily as a result of higher professional fees in connection with our acquisition activity during the year, and acquisition transaction costs of $14.5 million ($13.0 million after-tax), primarily related to the Flywheel Digital acquisition that closed in January 2024.\nOperating Income\n2024 vs. 2023\nOperating income for 2024 increased $169.9 million, or 8.1%, to $2,274.6 million, compared to 2023, and operating margin increased to 14.5% from 14.3%. EBITA increased $195.6 million to $2,362.1 million, and EBITA margin increased to 15.1% from 14.7%. The net effect of repositioning actions, primarily related to severance, recorded in the second quarter of 2024 and acquisition transaction costs recorded in the fourth quarter of 2024 (see Note 13 to the consolidated financial statements) reduced both operating income and EBITA by $72.4 million, and reduced both operating margin by 0.5% and EBITA margin by 0.4%. The net effect of the real estate and other repositioning costs, the gain on disposition of subsidiaries (see Notes 13 and 14 to the consolidated financial statements) and acquisition costs, reduced both operating income and EBITA by $127.2 million, and reduced both operating margin and EBITA margin by 0.9% in 2023.\n2023 vs. 2022\nOperating income for 2023 compared to 2022, increased $21.4 million to $2,104.7 million and operating margin decreased to 14.3% from 14.6%. EBITA decreased $24.4 million to $2,166.5 million and EBITA margin decreased to 14.7% from 15.0%. The net effect of the real estate and other repositioning costs, the gain on disposition of subsidiaries (see Notes 13 and 14 to the consolidated financial statements) and acquisition costs, reduced both operating income and EBITA by $127.2 million, and reduced both operating margin and EBITA margin by 0.9%. Operating income and EBITA in 2022 included a reduction of $113.4 million related to charges arising from the war in Ukraine, which decreased both operating margin and EBITA margin by 0.8%.\nNet Interest Expense\n2024 vs. 2023\nNet interest expense in 2024 increased $35.2 million year-over-year to $147.0 million. Interest expense on debt increased by $31.2 million year-over-year, primarily related to the issuance in the first quarter of 2024 of €600 million 3.70% Senior Notes due 2032, or 2032 Notes, and the issuance in the third quarter of 2024 of $600 million 5.30% Senior Notes due 2034, or 2034 Notes. The net proceeds from the issuance of the 2032 Notes were used for general corporate purposes, including working capital expenditures, acquisitions and repurchases of our common stock. The net proceeds from the issuance of the 2034 Notes, along with available cash, were used to fund the repayment of our $750 million 3.65% Senior Notes on November 1, 2024 (see Note 7 to the consolidated financial statements). Interest income in 2024 decreased $5.8 million year-over-year to $100.9 million, primarily as a result of lower cash balances in the first half of the year due to the timing of our financing and acquisition activity, including the purchase of Flywheel in the first quarter of 2024.\n2023 vs. 2022\nNet interest expense in 2023 decreased $26.1 million year-over-year to $111.8 million. Interest expense increased by $9.9 million year-over-year, primarily related to non-cash interest charges on pension and other postemployment benefits (see Note 12 to the consolidated financial statements). Interest income in 2023 increased $36.0 million year-over-year to 106.7 million, primarily as a result of higher average cash balances.\nIncome Taxes\n2024 vs. 2023\nOur effective tax rate for 2024 remained flat year-over-year at 26.3%. The effective tax rate for 2024 was favorably impacted by the windfall tax benefit on share-based compensation. The effective tax rate for 2023 includes an increase of approximately $10.7 million in income tax expense related to a lower tax benefit in certain jurisdictions for the real estate and other repositioning costs in the period and an increase in the U.K. statutory tax rate, partially offset by approximately $10.0 million of favorable impacts from the resolution of certain non-U.S. tax positions.\n28\n2023 vs. 2022\nOur effective tax rate for 2023 decreased year-over-year to 26.3% from 28.1%. The higher effective tax rate for 2022 was predominantly the result of the non-deductibility of the $113.4 million charge recorded in the first quarter of 2022, arising from the effects of the war in Ukraine.\nNumerous foreign jurisdictions have enacted or are in the process of enacting legislation to adopt a minimum effective tax rate described in the Global Anti-Base Erosion, or Pillar Two, model rules issued by the Organization for Economic Co-operation and Development. A minimum effective tax rate of 15% would apply to multinational companies with consolidated revenue above €750 million.\nUnder the Pillar Two rules, a company would be required to determine a combined effective tax rate for all entities located in a jurisdiction. If the jurisdictional effective tax rate determined under the Pillar Two is less than 15%, a top-up tax will be due to bring the jurisdictional effective tax rate up to 15%. We are continuing to monitor the pending implementation of Pillar Two by individual countries and the potential effects of Pillar Two on our business. The provisions effective in 2024 did not have a materially adverse impact on our results of operations, financial condition or cash flows.\nNet Income and Net Income Per Share - Omnicom Group, Inc.\n2024 vs. 2023\nNet income - Omnicom Group Inc. in 2024 increased $89.2 million to $1,480.6 million from $1,391.4 million. The year-over-year increase is due to the factors described above. Diluted net income per share - Omnicom Group Inc. increased to $7.46 in 2024, from $6.91 in 2023, due to the factors described above and the impact of the reduction in our weighted average common shares outstanding resulting from the repurchases of our common stock, net of shares issued for restricted stock awards, stock option exercises and the employee stock purchase plan during the year. For 2024, the net impact of the real estate and other repositioning costs, primarily related to severance, recorded in the second quarter of 2024 (see Note 13 to the consolidated financial statements) and acquisition transaction costs, recorded in the fourth quarter of 2024 reduced net income - Omnicom Group Inc. by $56.0 million and diluted net income per share - Omnicom Group Inc. by $0.28. \n2023 vs. 2022\n Net income - Omnicom Group Inc. in 2023 increased $74.9 million to $1,391.4 million from $1,316.5 million. The year-over-year increase is due to the factors described above. Diluted net income per share - Omnicom Group Inc. decreased to $6.91 in 2023, compared to $6.36 in 2022, due to the factors described above and the impact of the reduction in our weighted average common shares outstanding resulting from repurchases of our common stock, net of shares issued for restricted stock awards, stock option exercises and the employee stock purchase plan during the year. For 2023, the net impact of the real estate and other repositioning costs (see Note 13 to the consolidated financial statements), gain on disposition of subsidiaries (see Note 14 to the consolidated financial statements) and acquisition transaction costs reduced net income - Omnicom Group Inc. by $102.6 million and diluted net income per share - Omnicom Group Inc. by $0.50. \n29\nNON-GAAP FINANCIAL MEASURES\nWe use certain non-GAAP financial measures in describing our performance. We use EBITA and EBITA Margin as additional operating performance measures, which exclude from operating income the non-cash amortization expense of acquired intangible assets and internally developed strategic platform assets. We believe EBITA and EBITA Margin are useful measures for investors to evaluate the performance of our business and allow for comparability between the periods presented. Non-GAAP financial measures should not be considered in isolation from, or as a substitute for, financial information presented in compliance with U.S. GAAP. Non-GAAP financial measures reported by us may not be comparable to similarly titled amounts reported by other companies.\nReconciliation of Non-GAAP Financial Measures\nThe following table reconciles the U.S. GAAP financial measure of Net Income - Omnicom Group Inc. to EBITA and EBITA Margin:\nYear Ended December 31,\n2024\n2023\n2022\nNet Income - Omnicom Group Inc.\n$\n1,480.6\n$\n1,391.4\n$\n1,316.5\nNet Income Attributed To Noncontrolling Interests\n93.4\n81.8\n87.3\nNet Income\n1,574.0\n1,473.2\n1,403.8\nIncome From Equity Method Investments\n6.9\n5.2\n5.2\nIncome Tax Expense\n560.5\n524.9\n546.8\nIncome Before Income Taxes and Income From Equity Method Investments\n2,127.6\n1,992.9\n1,945.4\nInterest Expense\n247.9\n218.5\n208.6\nInterest Income\n100.9\n106.7\n70.7\nOperating Income\n2,274.6\n2,104.7\n2,083.3\nAdd back: Amortization of acquired intangible assets and\n   internally developed strategic platform assets\n87.5\n61.8\n58.8\nEarnings before interest, taxes, and amortization of intangible assets (“EBITA”)\n$\n2,362.1\n$\n2,166.5\n$\n2,142.1\nRevenue\n$\n15,689.1\n$\n14,692.2\n$\n14,289.1\nEBITA\n$\n2,362.1\n$\n2,166.5\n$\n2,142.1\nEBITA Margin %\n15.1\n \n%\n14.7 \n%\n15.0 \n%\n30\nLIQUIDITY AND CAPITAL RESOURCES\nCash Sources and Requirements\nThe primary sources of our short-term liquidity are net cash provided by operating activities and cash and cash equivalents. Additional liquidity sources include our $2.5 billion unsecured multi-currency revolving credit facility, or Credit Facility, terminating on June 2, 2028, the ability to issue up to $2 billion of U.S. Dollar denominated commercial paper and issue up to the equivalent of $500 million in British Pounds or Euro under a Euro commercial paper program, and access to the capital markets. In addition, certain of our international subsidiaries have uncommitted credit lines that are guaranteed by Omnicom aggregating $517.4 million. Our liquidity sources fund our non-discretionary cash requirements and our discretionary spending. Our $600 million Delayed Draw Term Loan Agreement automatically terminated on July 15, 2024.\nWorking capital, which we define as current assets minus current liabilities, is our principal non-discretionary funding requirement. Our working capital cycle typically peaks during the second quarter of the year due to the timing of payments for incentive compensation, income taxes and contingent purchase price obligations. In addition, we have contractual obligations related to our long-term debt (principal and interest payments), recurring business operations, primarily related to lease obligations, and acquisition related obligations. Our principal discretionary cash spending includes dividend payments to common shareholders, capital expenditures, strategic acquisitions and repurchases of our common stock.\nCash and cash equivalents decreased $92.6 million from December 31, 2023. The decrease was composed of:\nSources  \nNet cash provided by operating activities - as reported\n \n$\n1,733.5 \nAdd back: Decrease in operating capital\n \n231.2 \nPrincipal cash sources\n \n$\n1,964.7 \nUses\nCapital expenditures\n$\n(140.6)\nDividends paid to common shareholders\n(552.7)\nDividends paid to noncontrolling interest shareholders\n(85.4)\nAcquisition payments, including payment of contingent purchase price obligations and acquisition of additional noncontrolling interests\n(998.1)\nRepurchases of common stock, net of proceeds from stock plans\n(268.6)\nPrincipal cash uses\n \n$\n(2,045.4)\nPrincipal cash uses in excess of principal cash sources\n \n$\n(80.7)\nEffect of foreign exchange rate changes on cash and cash equivalents\n \n(185.4)\nOther net financing and investing activities\n \n404.7 \nDecrease in operating capital\n \n(231.2)\nDecrease in cash and cash equivalents - as reported\n \n$\n(92.6)\nPrincipal cash sources and principal cash uses are Non-GAAP liquidity measures. These amounts exclude changes in operating capital and other investing and financing activities. This presentation reflects the metrics used by us to assess our sources and uses of cash and was derived from our consolidated statement of cash flows. We believe that this presentation is meaningful to understand the primary sources and uses of our cash flow and the effect on our cash and cash equivalents. Non-GAAP liquidity measures should not be considered in isolation from, or as a substitute for, financial information presented in compliance with U.S. GAAP. Non-GAAP liquidity measures as reported by us may not be comparable to similarly titled amounts reported by other companies. Additional information regarding our cash flows can be found in our consolidated statement of cash flows and Note 16 to the consolidated financial statements.\nAt December 31, 2024, we have the following contractual obligations:\n•\nThe aggregate principal amount of long-term debt is $6.1 billion and matures at various dates from 2026 through 2034. Future interest payments on the debt total $1.0 billion, of which $186.6 million is payable in 2025.\n•\nThe liability for operating and finance lease payments is $1,414.9 million, of which $294.2 million is due in 2025.\n•\nThe obligation for the defined benefit pension plans is $216.0 million, and the liability for the postemployment arrangements is $126.6 million. In 2024, we contributed $10.6 million to the defined benefit plans and paid $11.4 million for the postemployment arrangements. We do not expect these payments to increase significantly in 2025.\n•\nThe liability for contingent purchase price payments (earn-outs) is $220.1 million, of which $56.0 million is payable in 2025.\n•\nThe remaining balance for the transition tax on accumulated foreign earnings imposed by the Tax Cut and Jobs Act of 2017 is $41.3 million, of which $34.9 million is payable in 2025.\nBased on past performance and current expectations, we believe that net cash provided by operating activities and cash and cash equivalents will be sufficient to meet our non-discretionary cash requirements for the next twelve months. In addition, and over the longer term, our Credit Facility is available to fund our working capital and contractual obligations.\n31\nCash Management\nOur regional treasury centers in North America, Europe and Asia manage our cash and liquidity. Each day, operations with excess funds invest those funds with their regional treasury center. Likewise, operations that require funds borrow from their regional treasury center. Treasury centers with excess cash invest on a short-term basis with third parties, with maturities generally ranging from overnight to 90 days. Certain treasury centers have notional pooling arrangements that are used to manage their cash and set-off foreign exchange imbalances. The arrangements require each treasury center to have its own notional pool account and to maintain a notional positive account balance. Additionally, under the terms of the arrangement, set-off of foreign exchange positions are limited to the long and short positions within their own account. To the extent that our treasury centers require liquidity, they can issue up to a total of $2 billion of U.S. Dollar-denominated commercial paper, issue up to the equivalent of $500 million in British Pounds or Euro under a Euro commercial paper program, or borrow under the Credit Facility or the uncommitted credit lines. This process enables us to manage our debt more efficiently and utilize our cash more effectively, as well as manage our risk to foreign exchange rate imbalances. In countries where we either do not conduct treasury operations or it is not feasible for one of our treasury centers to fund net borrowing requirements on an intercompany basis, we arrange for local currency uncommitted credit lines. We have a policy governing counterparty credit risk with financial institutions that hold our cash and cash equivalents, and we have deposit limits for each institution. In countries where we conduct treasury operations, generally the counterparties are either branches or subsidiaries of institutions that are party to the Credit Facility. These institutions generally have credit ratings better than or equal to our credit ratings. In countries where we do not conduct treasury operations, all cash and cash equivalents are held by counterparties that meet specific minimum credit standards.\nAt December 31, 2024, our foreign subsidiaries held approximately $2.0 billion of our total cash and cash equivalents of $4.3 billion. Substantially all of the cash is available to us, net of any foreign withholding taxes payable upon repatriation to the United States.\nAs of December 31, 2024, our net debt position, which we define as total debt, including short-term debt, less cash and cash equivalents increased $498.7 million to $1.7 billion from December 31, 2023. The increase in net debt primarily resulted from our discretionary spending of $2.0 billion, primarily related to our acquisition and other financing activities. This increase was substantially offset by the increase in cash from the net cash provided by operating activities of $1.7 billion. In addition, the net effect of foreign exchange rate changes on cash and cash equivalents and on our foreign currency denominated debt increased net debt by $114 million.\nNet debt:\nDecember 31,\n2024\n2023\nShort-term debt\n$\n21.3 \n$\n10.9 \nLong-term debt, including current portion\n6,035.3 \n5,639.6 \nTotal debt\n6,056.6 \n5,650.5 \nLess: Cash and cash equivalents\n4,339.4 \n4,432.0 \nNet debt\n$\n1,717.2 \n$\n1,218.5 \nNet debt is a Non-GAAP liquidity measure. This presentation, together with the comparable U.S. GAAP liquidity measures, reflects one of the key metrics used by us to assess our cash management. Non-GAAP liquidity measures should not be considered in isolation from, or as a substitute for, financial information presented in compliance with U.S. GAAP. Non-GAAP liquidity measures as reported by us may not be comparable to similarly titled amounts reported by other companies.\nDebt Instruments and Related Covenants\nOn August 2, 2024, Omnicom issued $600 million 5.30% Senior Notes due 2034. The net proceeds from the issuance, after deducting the underwriting discount and offering expenses, were $592.4 million. The net proceeds from the issuance, along with available cash, were used to fund the repayment of our $750 million 3.65% Senior Notes on November 1, 2024.\nOn March 6, 2024, Omnicom Finance Holdings plc, or OFH, a U.K.-based wholly owned subsidiary of Omnicom, issued  €600 million 3.70% Senior Notes due 2032. The net proceeds from the issuance, after deducting the underwriting discount and offering expenses, were $643.1 million and were used for general corporate purposes, including working capital expenditures, acquisitions and repurchases of our common stock.\nOur 2.45% Senior Notes due 2030, 4.20% Senior Notes due 2030, 2.60% Senior Notes due 2031 and 5.30% Senior Notes due 2034 are senior unsecured obligations of Omnicom that rank equal in right of payment with all existing and future unsecured senior indebtedness.\n32\nOmnicom and its wholly owned finance subsidiary, Omnicom Capital Inc., or OCI, are co-obligors under the 3.60% Senior Notes due 2026. These notes are a joint and several liability of Omnicom and OCI, and Omnicom unconditionally guarantees OCI’s obligations with respect to the notes. OCI provides funding for our operations by incurring debt and lending the proceeds to our operating subsidiaries. OCI’s assets primarily consist of cash and cash equivalents and intercompany loans made to our operating subsidiaries, and the related interest receivable. There are no restrictions on the ability of OCI or Omnicom to obtain funds from our subsidiaries through dividends, loans or advances. Such notes are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness.\nOmnicom and OCI have, jointly and severally, fully and unconditionally guaranteed the obligations of OFH with respect to the €500 million 0.80% Senior Notes due 2027 and the €500 million 1.40% Senior Notes due 2031, and Omnicom has fully and unconditionally guaranteed the obligations of OFH with respect the €600 million 3.70% Senior Notes due 2032, collectively the Euro Notes. OFH’s assets consist of its investments in several wholly owned finance companies that function as treasury centers, providing funding for various operating companies in Europe, Australia and other countries in the Asia-Pacific region. The finance companies’ assets consist of cash and cash equivalents and intercompany loans that they make or have made to the operating companies in their respective regions and the related interest receivable. There are no restrictions on the ability of Omnicom, OCI or OFH to obtain funds from their subsidiaries through dividends, loans or advances. The Euro Notes and the related guarantees are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness of OFH and each of Omnicom and OCI, as applicable.\nOmnicom has fully and unconditionally guaranteed the obligations of Omnicom Capital Holdings plc, or OCH, a U.K.-based wholly owned subsidiary of Omnicom, with respect to the £325 million 2.25% Senior Notes due 2033, or Sterling Notes. OCH’s assets consist of its investments in several wholly owned finance companies that function as treasury centers, providing funding for various operating companies in EMEA, Australia and other countries in the Asia-Pacific region. The finance companies’ assets consist of cash and cash equivalents and intercompany loans that they make or have made to the operating companies in their respective regions and the related interest receivable. There are no restrictions on the ability of Omnicom or OCH to obtain funds from their subsidiaries through dividends, loans or advances. The Sterling Notes and the related guarantee are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness of OCH and Omnicom, respectively.\n The Credit Facility has a financial covenant that requires us to maintain a Leverage Ratio of consolidated indebtedness to consolidated EBITDA (earnings before interest, taxes, depreciation, amortization and non-cash charges) of no more than 3.5 times for the most recently ended 12-month period. At December 31, 2024, we were in compliance with this covenant as our Leverage Ratio was 2.4 times. The Credit Facility does not limit our ability to declare or pay dividends or repurchase our common stock.\nAt December 31, 2024, our long-term and short-term debt was rated BBB+ and A2 by S&P and Baa1 and P2 by Moody's. Our access to the commercial paper market and the cost of any issuances is affected by market conditions and our credit ratings. The long-term debt indentures and the Credit Facility do not contain provisions that require acceleration of cash payments in the event of a downgrade in our credit ratings.\nCredit Markets and Availability of Credit\nIn light of the uncertainty of future economic conditions, we will continue to take actions available to us to respond to changing economic conditions, and we will manage our discretionary expenditures. We will also continue to monitor and manage the level of credit made available to our clients. We believe that these actions, in addition to the availability of our Credit Facility, are sufficient to fund our near-term working capital needs and our discretionary spending. Information regarding our Credit Facility is provided in Note 7 to the consolidated financial statements.\nWe have the ability to fund our day-to-day liquidity, including working capital, by issuing commercial paper or borrowing under the Credit Facility. We did not issue commercial paper in 2024. In 2023, we had a maximum of $200 million of commercial paper outstanding during the year, the average amount outstanding was $5.1 million, the average days outstanding were 1.7 days, and the weighted average interest rate was 5.24%. At December 31, 2024, there were no outstanding borrowings under the Credit Facility and no outstanding commercial paper issuances. \nWe may issue commercial paper to fund our day-to-day liquidity when needed. However, disruptions in the credit markets may lead to periods of illiquidity in the commercial paper market and higher credit spreads. To mitigate any disruption in the credit markets and to fund our liquidity, we may borrow under the Credit Facility or the uncommitted credit lines or access the capital markets if favorable conditions exist. We will continue to monitor closely our liquidity and conditions in the credit markets. We cannot predict with any certainty the impact on us of any disruptions in the credit markets. In such circumstances, we may need to obtain additional financing to fund our day-to-day working capital requirements. Such additional financing may not be available on favorable terms, or at all.\n33\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe manage our exposure to foreign exchange rate risk and interest rate risk through various strategies, including the use of derivative financial instruments. We use forward foreign exchange contracts as economic hedges to manage the cash flow volatility arising from foreign exchange rate fluctuations. We use net investment hedges to manage the volatility of foreign exchange rates on the investment in our foreign subsidiaries. We do not use derivatives for trading or speculative purposes. Using derivatives exposes us to the credit risk that counterparties to the derivative contracts will fail to meet their contractual obligations. We manage that risk through careful selection and ongoing evaluation of the counterparty financial institutions based on specific minimum credit standards and other factors.\nWe evaluate the effects of changes in foreign currency exchange rates, interest rates and other relevant market risks on our derivatives. We periodically determine the potential loss from market risk on our derivatives by performing a value-at-risk, or VaR, analysis. VaR is a statistical model that uses historical currency exchange rate data to measure the potential impact on future earnings of our derivative financial instruments assuming normal market conditions. The VaR model is not intended to represent actual losses but is used as a risk estimation and management tool. Based on the results of the model, we estimate with 95% confidence a maximum one-day change in the net fair value of our derivative financial instruments at December 31, 2024 was not material.\nForeign Currency Exchange Risk\nIn 2024, our international operations represented approximately 48% of our revenue. Changes in the value of foreign currencies against the U.S. Dollar affect our results of operations and financial condition. For the most part, because the revenue and expenses of our foreign operations are denominated in the same local currency, the economic impact on operating margin is minimized. The effects of foreign currency exchange transactions on our results of operations are discussed in Note 2 to the consolidated financial statements.\nWe operate in all major international markets including the U.K., Euro Zone, Australia, Brazil, Canada, China and Japan. Our agencies transact business in more than 50 different currencies. As an integral part of our global treasury operations, we centralize our cash and use notional multicurrency pools to manage the foreign currency exchange risk that arises from imbalances between subsidiaries and their respective treasury centers. In addition, there are circumstances where revenue and expense transactions are not denominated in the same currency. In these instances, amounts are either promptly settled or hedged with forward foreign exchange contracts. To manage this risk, at December 31, 2024, we had outstanding forward foreign exchange contracts with an aggregate notional amount of $4.7 million. The net fair value of the forward foreign contracts at December 31, 2024 was not material (see Note 22 to the consolidated financial statements). At December 31, 2023, there were no forward foreign exchange contracts outstanding.\nForeign currency derivatives are designated as economic hedges; therefore, any gain or loss in fair value incurred on those instruments is generally offset by decreases or increases in the fair value of the underlying exposure. By using these financial instruments, we reduce financial risk of adverse foreign exchange changes by foregoing any gain which might occur if the markets move favorably. The terms of our forward foreign exchange contracts are generally less than 90 days.\nWe have fixed-to-fixed cross currency swaps with a notional value of $150 million that hedge a portion of the net investment in our Japanese subsidiaries against volatility in the Yen/U.S. Dollar exchange rate. The swaps are designated and qualify as a hedge of a net investment in a foreign subsidiary and are scheduled to mature in 2025 and 2029. Changes in the fair value of the swaps are recognized in foreign currency translation and are reported in accumulated other comprehensive income (loss), or AOCI. Any gain or loss will remain in AOCI until the complete or substantially complete liquidation of our investment in the underlying operations. We have elected to assess the effectiveness of our net investment hedges based on changes in spot exchange rates. We receive net fixed U.S. Dollar interest payments. We recorded a reduction of interest expense of $6.6 million in each of 2024 and 2023. At December 31, 2024, an asset of $9.3 million is recorded in other assets, and at December 31, 2023, a liability of $6.6 million is recorded in long-term liabilities, for the swap fair value.\nInterest Rate Risk\nWe may use interest rate swaps to manage our interest cost and structure our long-term debt portfolio to achieve a mix of fixed rate and floating rate debt. There were no interest rate swaps in 2024 and 2023. Long-term debt at December 31, 2024 and 2023 consisted entirely of fixed-rate debt.\nCredit Risk\nWe provide marketing and communications services to several thousand clients that operate in nearly every sector of the global economy, and we grant credit to qualified clients in the normal course of business. Due to the diversified nature of our client base, we do not believe that we are exposed to a concentration of credit risk as our largest client represented 2.7% of revenue in 2024. However, during periods of economic downturn, the credit profiles of our clients could change.\nIn the normal course of business, our agencies enter into contractual commitments with media providers and production companies on behalf of our clients at levels that can substantially exceed the revenue from our services. These commitments are included in accounts payable when the services are delivered by the media providers or production companies. If permitted by \n34\nlocal law and the client agreement, many of our agencies purchase media and production services for our clients as an agent for a disclosed principal. In addition, while operating practices vary by country, media type and media vendor, in the United States and certain foreign markets, many of our agencies’ contracts with media and production providers specify that our agencies are not liable to the media and production providers under the theory of sequential liability until and to the extent we have been paid by our client for the media or production services.\nWhere purchases of media and production services are made by our agencies as a principal or are not subject to the theory of sequential liability, the risk of a material loss as a result of payment default by our clients could increase significantly and such a loss could have a material adverse effect on our business, results of operations and financial condition.\nWhile we use various methods to manage the risk of payment default, including obtaining credit insurance, requiring payment in advance, mitigating the potential loss in the marketplace or negotiating with media providers, these may be insufficient, less available, or unavailable during a severe economic downturn.\nItem 8. Financial Statements and Supplementary Data\nSee Item 15, “Exhibits, Financial Statement Schedules.”\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nWe maintain disclosure controls and procedures designed to ensure that information required to be disclosed in reports we file with the SEC is recorded, processed, summarized and reported within applicable time periods. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports we file or submit under the Securities Exchange Act of 1934, as amended, or the Exchange Act, is accumulated and communicated to management, including our Chief Executive Officer, or CEO, and Chief Financial Officer, or CFO, as appropriate to allow timely decisions regarding required disclosure. Management, including our CEO and CFO, conducted an evaluation of the effectiveness of our disclosure controls and procedures as of December 31, 2024. Based on that evaluation, our CEO and CFO concluded that, as of December 31, 2024, our disclosure controls and procedures are effective to ensure that decisions can be made timely with respect to required disclosures, as well as ensuring that the recording, processing, summarization and reporting of information required to be included in our Annual Report on Form 10-K for the year ended December 31, 2024 are appropriate.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Management, with the participation of our CEO, CFO and our agencies, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that evaluation, our CEO and CFO concluded that our internal control over financial reporting was effective as of December 31, 2024. \nOmnicom management excluded Flywheel Digital from its assessment of the effectiveness of Omnicom’s internal control over financial reporting as of December 31, 2024, in accordance with SEC staff guidance allowing management to exclude a recently acquired business from management’s report on internal control over financial reporting. Flywheel Digital constituted two percent of total revenue for the year ended December 31, 2024 and two percent of total assets, excluding acquired goodwill and other intangible assets, as of December 31, 2024.\nThere have not been any changes in our internal control over financial reporting during our most recent fiscal quarter that have materially affected or are reasonably likely to materially affect our internal control over financial reporting.\nKPMG LLP, an independent registered public accounting firm that audited our consolidated financial statements included in this Annual Report on Form 10-K, has issued an attestation report on Omnicom’s internal control over financial reporting as of December 31, 2024, dated February 5, 2025, which is included on page F-2 of this 2024 10-K.\nItem 9B. Other Information\nDuring the fiscal quarter ended December 31, 2024, none of the Company’s directors or officers \nadopted\n, modified, or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement, in each case as defined in Item 408 of Regulation S-K.\nItem 9C. Disclosure Regarding Foreign Jurisdictions That Prevent Inspections\nNot applicable.\n35\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information required by this Item will be included in our definitive proxy statement, which is expected to be filed with the SEC within 120 days after December 31, 2024, in connection with the solicitation of proxies for our 2025 annual meeting of shareholders (the “2025 Proxy Statement”) and is incorporated herein by reference. \nOur Code of Business Conduct includes our policy governing the purchase, sale, and/or other dispositions of our securities by directors, officers and employees and is reasonably designed to promote compliance with insider trading laws, rules and regulations, and New York Stock Exchange listing standards. This policy, included in the “Insider Trading” section of our Code of Business Conduct, is included as Exhibit 19.  \n \nItem 11. Executive Compensation\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\nItem 14. Principal Accountant Fees and Services\nOur independent registered public accounting firm is \nKPMG LLP\n, \nNew York, NY\n, Auditor Firm ID: \n185\n.\nThe information required by this Item will be included in the 2025 Proxy Statement and is incorporated herein by reference.\nPART IV\nItem 15. Exhibit and Financial Statement Schedules\n(a)(1)\nFinancial Statements:\nPage\nManagement Report on Internal Control Over Financial Reporting\nF-\n1\nReport of Independent Registered Public Accounting Firm\nF-\n2\nConsolidated Balance Sheets at December 31, 2024 and 2023\nF-\n4\nConsolidated Statements of Income for the Three Years Ended December 31, 2024\nF-\n5\nConsolidated Statements of Comprehensive Income for the Three Years Ended December 31, 2024\nF-\n6\nConsolidated Statements of Equity for the Three Years Ended December 31, 2024\nF-\n7\nConsolidated Statements of Cash Flows for the Three Years Ended December 31, 2024\nF-\n8\nNotes to Consolidated Financial Statements\nF-\n9\n(a)(2)\nFinancial Statement Schedules:\n \nSchedule II - Valuation and Qualifying Accounts for the Three Years Ended December 31, 2024\nS-\n1\n \nAll other schedules are omitted because they are not applicable.\n \n(a)(3)\nExhibits:\nExhibit\nNumber\nDescription\n2.1\nAgreement and Plan of Merger among Omnicom Group, Inc., EXT Subsidiary Inc. and The Interpublic Group of Companies, Inc., dated as of December 8, 2024 (Exhibit 2.1 to our Current Report on Form 8-K (File No. 1-10551) filed on December 9, 2024 and incorporated herein by reference). \n3(i)\nRestated Certificate of Incorporation of Omnicom Group Inc. (Exhibit 3.1 to our Quarterly Report on Form 10-Q (File No. 1-10551) for the quarter ended September 30, 2011 and incorporated herein by reference).\n3(ii)\nBy-laws of Omnicom Group Inc., as amended and restated on October 17, 2024 (Exhibit 3.1 to our Current Report on Form 8-K (File No. 1-10551) dated October 17, 2024 and incorporated herein by reference).\n4.1\nBase Indenture, dated as of October 29, 2014, among Omnicom Group Inc., Omnicom Capital Inc. and Deutsche Bank Trust Company Americas, as trustee (“2014 Base Indenture”), (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated October 29, 2014 (“October 29, 2014 8-K”) and incorporated herein by reference).\n4.2\nSecond Supplemental Indenture to the 2014 Base Indenture, dated as of April 6, 2016, among Omnicom Group Inc., Omnicom Capital Inc. and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of $1.4 billion 3.60% Senior Notes due 2026 (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated April 6, 2016 (“April 6, 2016 8-K”) and incorporated herein by reference).\n36\n4.3\nForm of 3.60% Notes due 2026 (included in Exhibit 4.1 to the April 6, 2016 8-K and incorporated herein by reference).\n4.4\nBase Indenture, dated as of July 8, 2019, among Omnicom Finance Holdings plc, as issuer, Omnicom Group Inc. and Omnicom Capital Inc., as guarantors, and Deutsche Bank Trust Company Americas, as trustee (“2019 Base Indenture”), (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated July 8, 2019 (“July 8, 2019 8-K”) and incorporated herein by reference).\n4.5\nFirst Supplemental Indenture to the 2019 Base Indenture, dated as of July 8, 2019, among Omnicom Finance Holdings plc, as issuer, Omnicom Group Inc. and Omnicom Capital Inc., as guarantors, and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of €500 million aggregate principal amount of Senior Notes due 2027 and €500 million aggregate principal amount of Senior Notes due 2031 (Exhibit 4.2 to the July 8, 2019 8-K and incorporated herein by reference).\n4.6\nForm of 0.80% Notes due 2027 (included in Exhibit 4.2 to the July 8, 2019 8-K and incorporated herein by reference).\n4.7\nForm of 1.40% Notes due 2031 (included in Exhibit 4.2 to the July 8, 2019 8-K and incorporated herein by reference).\n4.8\nBase Indenture, dated as of February 21, 2020, among Omnicom Group Inc., as issuer, and Deutsche Bank Trust Company Americas, as trustee (“2020 Base Indenture”) (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) filed on February 21, 2020 (“February 21, 2020 8-K”) and incorporated herein by reference).\n4.9\nFirst Supplemental Indenture to the 2020 Base Indenture, dated as of February 21, 2020, among Omnicom Group Inc., as issuer, and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of $600 million 2.450% Senior Notes due 2030 (Exhibit 4.2 to the February 21, 2020 8-K and incorporated herein by reference).\n4.10\nForm of 2.450% Notes due 2030 (Included in Exhibit 4.2 to the February 21, 2020 8-K and incorporated herein by reference).\n4.11\nSecond Supplemental Indenture to the 2020 Base Indenture, dated as of April 1, 2020, among Omnicom Group Inc., as issuer, and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of $600 million 4.200% Senior Notes due 2030 (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) filed on April 1, 2020 (“April 1, 2020 8-K”) and incorporated herein by reference).\n4.12\nForm of 4.200% Notes due 2030 (Included in Exhibit 4.1 to the April 1, 2020 8-K and incorporated herein by reference).\n4.13\nThird Supplemental Indenture to the 2020 Base Indenture, dated as of April 28, 2021, among Omnicom Group Inc., as issuer, and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of $800 million 2.600% Senior Notes due 2031 (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) filed on May 3, 2021 (the “May 3, 2021 8-K”) and incorporated herein by reference).\n4.14\nForm of 2.600% Notes due 2031 (Included in Exhibit 4.1 to the May 3, 2021 8-K and incorporated herein by reference).\n4.15\nBase Indenture, dated as of November 22, 2021, among Omnicom Capital Holdings plc, as issuer, Omnicom Group Inc., as guarantor, and Deutsche Bank Trust Company Americas, as trustee (“2021 Base Indenture”),  (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) filed on November 22, 2021 (“November 22, 2021 8-K”) and incorporated herein by reference).\n4.16\nFirst Supplemental Indenture to the 2021 Base Indenture, dated as of November 22, 2021, among Omnicom Capital Holdings plc, as issuer, Omnicom Group Inc., as guarantor, and Deutsche Bank Trust Company Americas, as trustee, in connection with the issuance of £325 million aggregate principal amount of 2.250% Senior Notes due 2033 (Exhibit 4.2 to the November 22, 2021 8-K) and incorporated herein by reference).\n4.17\nForm of 2.250% Senior Notes due 2033 (Included in Exhibit 4.2 to the November 22, 2021 8-K and incorporated herein by reference).\n4.18\nBase Indenture, dated as of March 6, 2024, among Omnicom Finance Holdings plc, as issuer, Omnicom Group Inc., as guarantor, and Deutsche Bank Trust Company Americas, as trustee (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated March 6, 2024 and incorporated herein by reference).\n4.19\nFirst Supplemental Indenture, dated as of March 6, 2024, among Omnicom Finance Holdings plc, as issuer, Omnicom Group Inc., as guarantor, and Deutsche Bank Trust Company Americas, as trustee (Exhibit 4.2 to our Current Report on Form 8-K (File No. 1-10551) dated March 6, 2024 and incorporated herein by reference).\n4.20\nForm of 3.700% Notes due 2032 (included in Exhibit 4.2 to our Current Report on Form 8-K (File No. 1-10551) dated March 6, 2024 and incorporated herein by reference). \n4.21\nFourth Supplemental Indenture, dated as of August 2, 2024, among Omnicom Group Inc., as issuer, and Deutsche Bank Trust Company Americas, as trustee (Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated July 30, 2024, and incorporated herein by reference).\n4.22\nForm of 5.300% Notes due 2034 (included in Exhibit 4.1 to our Current Report on Form 8-K (File No. 1-10551) dated July 30, 2024, and incorporated herein by reference).\n37\n4.23\nDescription of Securities (Exhibit 4.17 to our Registration Statement on Form S-3ASR (File No. 333-282748) filed on October 21, 2024 and incorporated herein by reference).\n10.1\nThird Amended and Restated Five Year Credit Agreement, dated as of June 2, 2023, by and among Omnicom Capital Inc., a Connecticut corporation, Omnicom Finance Limited, a private limited company organized under the laws of England and Wales, Omnicom Group Inc., a New York corporation, any other subsidiary of Omnicom Group Inc. designated for borrowing privileges, the banks, financial  institutions and other institutional lenders and initial issuing banks listed on the signature pages thereof, Citibank, N.A., JPMorgan Chase Bank, N.A., and Wells Fargo Securities, LLC, as lead arrangers and book managers, JPMorgan Chase Bank, N.A. and Wells Fargo Bank, National Association, as syndication agents, Bank of America, N.A., BNP Paribas, Barclays Bank PLC, Deutsche Bank Securities Inc. and HSBC Bank USA, National Association, as documentation agents, and Citibank, N.A., as administrative agent for the lenders (Exhibit 10.1 to our Current Report on Form 8-K (File No. 1-10551) dated June 5, 2023 and incorporated herein by reference)\n.\n10.2\nDelayed Draw Term Loan Agreement, dated as of January 3, 2024, among Omnicom Capital Inc., a Connecticut corporation, Omnicom Group Inc., a New York corporation, the initial lenders named therein, Citibank, N.A., BofA Securities, Inc., Barclays Bank PLC, BNP Paribas Securities Corp., Deutsche Bank Securities Inc., HSBC Securities (USA), Inc., JPMorgan Chase Bank, N.A., Mizuho Bank, Ltd., Société Générale, Sumitomo Mitsui Banking Corporation, TD Securities (USA), LLC, U.S. Bank National Association and Wells Fargo Securities, LLC, as lead arrangers and book managers, and Citibank, N.A., as administrative agent for the lenders (Exhibit 10.1 to our Current Repor\nt on Form 8-K (File No. 1-10551) dated January 5, 2024 and incorporated herein by reference).\n10.3\nDirector Compensation and Deferred Stock Program Stock Program  (As Amended, Effective January 1, 2020) (Exhibit 10.1 to our Quarterly Report on Form 10-Q (File No. 1-10551) for the quarter ended March 31, 2020 (“March 31, 2020 10-Q”) and incorporated herein by reference).\n10.4\nStandard form of our Executive Salary Continuation Plan Agreement (Exhibit 10.5 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2012 and incorporated herein by reference).\n10.5\nStandard form of the Director Indemnification Agreement (Exhibit 10.25 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 1989 and incorporated herein by reference).\n10.6\nSenior Management Incentive Plan, As Amended and Restated on December 12, 2023 (Exhibit 10.6 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2023 and incorporated  herein by reference).\n10.7\nOmnicom Group Inc. SERCR Plan (Exhibit 10.10 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2011 and incorporated herein by reference).\n10.8\nOmnicom Group Inc. SERCR Plan Amended and Restated Form of Award Agreement.\n10.9\nForm of Indemnification Agreement (Exhibit 10.1 to our Quarterly Report on Form 10-Q (File No. 1-10551) for the quarter ended June 30, 2007 and incorporated herein by reference).\n10.10\nRestricted Stock Unit Deferred Compensation Plan (Exhibit 10.16 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2008 (the “2008 10-K”) and incorporated herein by reference).\n10.11\nRestricted Stock Deferred Compensation Plan (Exhibit 10.17 to the 2008 10-K and incorporated herein by reference).\n10.12\nAmendment No. 1 to the Restricted Stock Deferred Compensation Plan (Exhibit 10.18 to the 2008 10-K and incorporated herein by reference).\n10.13\nAmendment No. 2 to the Restricted Stock Deferred Compensation Plan (Exhibit 10.19 to the 2008 10-K and incorporated herein by reference).\n10.14\nForm of Grant Notice and Option Agreement (Exhibit 10.20 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2010 (“2010 10-K”) and incorporated herein by reference).\n10.15\nForm of Grant Notice and Restricted Stock Agreement (Exhibit 10.21 to 2010 10-K and incorporated herein by reference).\n10.16\nForm of Grant Notice and Restricted Stock Unit Agreement (Exhibit 10.22 to 2010 10-K and incorporated herein by reference).\n10.17\n2021 Incentive Award Plan – Performance Restricted Stock Unit Agreement - Form of Grant Notice and Agreement (Exhibit 10.1 to our Quarterly Report on Form 10-Q (File No. 1-10551) for the quarter ended September 30, 2024 and incorporated herein by reference).\n10.18\nOmnicom Group Inc. 2013 Incentive Award Plan (Appendix A to our Proxy Statement (File No. 1-10551) filed on April 11, 2013 and incorporated herein by reference).\n10.19\nDirector Compensation and Deferred Stock Program (Exhibit 10.19 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2016 and incorporated herein by reference).\n10.20\nOmnicom Group Inc. 2021 Incentive Award Plan (incorporated by reference to our Definitive Proxy Statement on Schedule 14A, filed on March 25, 2021).\n38\n10.21\n2021 Incentive Award Plan Restricted Stock Unit Agreement - Form of Grant Notice and Agreement (Exhibit 10.2 to our Quarterly Report on Form 10-Q (File No. 1-10551) for the quarter ended June 30, 2021 (“June 30, 2021 10-Q”) and incorporated herein by reference).\n10.22\n2021 Incentive Award Plan Option Agreement - Form of Grant Notice and Agreement (Exhibit 10.3 to June 30, 2021 10-Q and incorporated herein by reference).\n10.23\nEmployment Agreement dated as of July 21, 2021 by and between Omnicom Management Inc. and John D. Wren (Exhibit 10.1 to our Current Report on Form 8-K (File No. 1-10551) filed on July 23, 2021 and incorporated herein by reference).\n10.24\nRochelle Tarlowe employment letter (Exhibit 10.3 to the March 31, 2020 10-Q and incorporated herein by reference).\n10.25\nDirector Compensation and Deferred Stock Program (As amended, effective January 1, 2025).\n19\n“Insider Trading” Section of Omnicom Group Inc. Code of Business Conduct.\n21\nSubsidiaries of the Registrant.\n23\nConsent of KPMG LLP.\n31.1\nCertification of Chairman and Chief Executive Officer required by Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended.\n31.2\nCertification of Executive Vice President and Chief Financial Officer required by Rule 13a-14(a) under the Securities Exchange Act of 1934, as amended.\n32\nCertification of the Chairman and Chief Executive Officer and the Executive Vice President and Chief Financial Officer required by Rule 13a-14(b) under the Securities Exchange Act of 1934, as amended, and 18 U.S.C. Section 1350.\n97\nOmnicom Group Inc. Clawback Policy (Exhibit 97 to our Annual Report on Form 10-K (File No. 1-10551) for the year ended December 31, 2023 and incorporated herein by reference).\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)\n \nItem 16. Form 10-K Summary\nNone.\n39\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nO\nMNICOM \nG\nROUP\n I\nNC.\nFebruary 5, 2025\nBY:\n/s/ P\nHILIP\n J. A\nNGELASTRO\n \n \nPhilip J. Angelastro\nExecutive Vice President and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ J\nOHN\n D. W\nREN\nChairman and Chief Executive Officer and Director (Principal Executive Officer)\nFebruary 5, 2025\nJohn D. Wren\n \n \n/s/ P\nHILIP\n J. A\nNGELASTRO\nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\nFebruary 5, 2025\nPhilip J. Angelastro\n \n \n/s/ A\nNDREW \nL\n.\n C\nASTELLANETA\nSenior Vice President, Chief Accounting Officer\n(Principal Accounting Officer)\nFebruary 5, 2025\nAndrew L. Castellaneta\n/s/ M\nARY\n C. C\nHOKSI\nDirector\nFebruary 5, 2025\nMary C. Choksi\n/s/ L\nEONARD\n S. C\nOLEMAN, JR.\nDirector\nFebruary 5, 2025\nLeonard S. Coleman, Jr.\n/s/ \nMARK D. GERSTEIN\nDirector\nFebruary 5, 2025\nMark D. Gerstein\n/s/ \nR\nONNIE\n \nS.\n \nH\nAWKINS\nDirector\nFebruary 5, 2025\nRonnie S. Hawkins\n/s/ D\nEBORAH\n J. K\nISSIRE\nDirector\nFebruary 5, 2025\nDeborah J. Kissire\n/s/ \nG\nRACIA\n \nC\n. \nM\nARTORE\nDirector\nFebruary 5, 2025\nGracia C. Martore\n/s/ P\nATRICIA SALAS PINEDA\nDirector\nFebruary 5, 2025\nPatricia Salas Pineda\n/s/ \nLINDA JOHNSON RICE\nDirector\nFebruary 5, 2025\nLinda Johnson Rice\n/s/ \nCASSANDRA SANTOS\nDirector\nFebruary 5, 2025\nCassandra Santos\n/s/ \nV\nALERIE\n \nM\n. \nW\nILLIAMS\nDirector\nFebruary 5, 2025\nValerie M. Williams\n40\nMANAGEMENT REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for the preparation of the consolidated financial statements and related information of Omnicom Group Inc., or Omnicom. Management uses its best judgment to ensure that the consolidated financial statements present fairly, in all material respects, Omnicom’s consolidated financial position and results of operations in conformity with generally accepted accounting principles in the United States.\nThe financial statements have been audited by an independent registered public accounting firm in accordance with the standards of the Public Company Accounting Oversight Board. Their report expresses the independent accountant’s judgment as to the fairness of management’s reported financial position, results of operations and cash flows. This judgment is based on the procedures described in the fourth and fifth paragraphs of their report.\nOmnicom management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Securities Exchange Act Rule 13a-15(f). Management, with the participation of our Chief Executive Officer, or CEO, Chief Financial Officer, or CFO, and our agencies, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that evaluation, our CEO and CFO concluded that our internal control over financial reporting was effective as of December 31, 2024.\n Omnicom management excluded Flywheel Digital from its assessment of the effectiveness of Omnicom’s internal control over financial reporting as of December 31, 2024, in accordance with SEC staff guidance allowing management to exclude a recently acquired business from management’s report on internal control over financial reporting. Flywheel Digital constituted two percent of total revenue for the year ended December 31, 2024 and two percent of total assets, excluding acquired goodwill and other intangible assets, as of December 31, 2024.\nThere have not been any changes in our internal control over financial reporting during our fourth fiscal quarter that have materially affected or are reasonably likely to affect our internal control over financial reporting.\nKPMG LLP, an independent registered public accounting firm that audited our consolidated financial statements included in this Annual Report on Form 10-K, has issued an attestation report on Omnicom’s internal control over financial reporting as of December 31, 2024, dated February 5, 2025.\nThe Board of Directors of Omnicom has an Audit Committee comprised of five independent directors. The Audit Committee meets periodically with financial management, Internal Audit and the independent auditors to review accounting, control, audit and financial reporting matters.\nF-1\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors\nOmnicom Group Inc.:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Omnicom Group Inc. and subsidiaries (the Company) as of  December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes and financial statement schedule II (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control -\n \nIntegrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nThe Company acquired Flywheel Digital during 2024, and management excluded from its assessment of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, Flywheel Digital’s internal control over financial reporting associated with 2% of total assets and 2% of total revenues included in the consolidated financial statements of the Company as of and for the year ended December 31, 2024. Our audit of internal control over financial reporting of the Company also excluded an evaluation of the internal control over financial reporting of Flywheel Digital.\nChange in Accounting Principle\nAs discussed in Note 1 to the consolidated financial statements, the Company has changed its method of accounting for segment disclosure as of January 1, 2024 due to the adoption of ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosure\n.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of \nF-2\nfinancial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of the sufficiency of audit evidence over revenue recognition\nAs discussed in Note 3 to the consolidated financial statements, the Company provides an extensive range of marketing and sales solutions through its networks, practice areas and agencies, which operate in all major markets throughout the Americas, EMEA and Asia-Pacific regions. Consolidated revenues across all disciplines and geographic markets was $15,689.1 million for the year-ended December 31, 2024.\nWe identified the evaluation of the sufficiency of audit evidence over revenue recognition as a critical audit matter. Revenue is recognized from contracts with customers that are based on statements of work which are typically separately negotiated with the client at a local agency level and local agencies execute tens of thousands of contracts per year. Evaluating the sufficiency of audit evidence obtained required a high degree of auditor judgment because of the volume of contracts entered into across the networks and agencies for which revenue was recorded. This included selecting the locations where testing would be performed and the supervision and review of procedures performed at those locations.\n \nThe following are the primary procedures we performed to address this critical audit matter. We applied auditor judgment to determine the scope of agencies at which we performed audit procedures and the nature and extent of the procedures performed at each location. At each agency where procedures over revenue were performed, we (1) evaluated the design and tested the operating effectiveness of certain internal controls over revenue recognition, including controls to check that local agencies recorded revenue in accordance with the Company’s accounting policies and billings were recorded and presented in accordance with client agreements, (2) examined a selection of contracts and assessed that the Company’s accounting policies were applied consistently and accurately, and (3) assessed the recording of revenue by selecting certain transactions and comparing the amounts recognized for consistency with the underlying documentation including contracts with customers. We evaluated the sufficiency of audit evidence obtained by assessing the results of procedures performed over revenue recognition.\n \n/s/ KPMG LLP\nWe have served as the Company’s auditor since 2002.\nNew York, New York\nFebruary 5, 2025\nF-3\nOMNICOM GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share amounts)\nDecember 31,\n2024\n2023\nASSETS\nCurrent Assets:\n \n \nCash and cash equivalents\n$\n4,339.4\n \n$\n4,432.0\n \nAccounts receivable, net of allowance for doubtful accounts of $\n15.0\n and $\n17.2\n9,242.0\n \n8,659.8\n \nWork in process\n1,622.2\n \n1,342.5\n \nOther current assets\n1,019.4\n \n949.9\n \nTotal Current Assets\n16,223.0\n \n15,384.2\n \nProperty and Equipment at cost, less accumulated depreciation of $\n1,096.9\n and $\n1,150.4\n824.7\n \n874.9\n \nOperating Lease Right-Of-Use Assets\n1,043.6\n \n1,046.4\n \nEquity Method Investments\n59.0\n \n66.4\n \nGoodwill\n10,677.4\n \n10,082.3\n \nIntangible Assets, net of accumulated amortization of $\n832.4\n and $\n863.6\n522.0\n \n366.9\n \nOther Assets\n271.0\n \n223.5\n \nTOTAL ASSETS\n$\n29,620.7\n \n$\n28,044.6\n \nLIABILITIES AND EQUITY\nCurrent Liabilities:\n \n \nAccounts payable\n$\n12,484.4\n \n$\n11,634.0\n \nCustomer advances\n1,336.1\n \n1,356.2\n \nCurrent portion of debt\n—\n \n750.5\n \nShort-term debt\n21.3\n \n10.9\n \nTaxes payable\n402.5\n \n351.6\n \nOther current liabilities\n2,056.0\n \n2,142.8\n \nTotal Current Liabilities\n16,300.3\n \n16,246.0\n \nLong-Term Liabilities\n804.2\n \n887.7\n \nLong-Term Liability - Operating Leases\n814.2\n \n853.0\n \nLong-Term Debt\n6,035.3\n \n4,889.1\n \nDeferred Tax Liabilities\n491.8\n \n529.1\n \nCommitments and Contingent Liabilities (Note 20)\nTemporary Equity - Redeemable Noncontrolling Interests\n429.0\n \n414.6\n \nEquity:\n \n \nShareholders’ Equity:\n \n \nPreferred stock, $\n1.00\n par value, \n7.5\n million shares authorized, \nnone\n issued\n—\n \n—\n \nCommon stock, $\n0.15\n par value, \n1.0\n billion shares authorized, \n297.2\n million shares\nissued, \n196.4\n million and \n198.0\n million shares outstanding\n44.6\n \n44.6\n \nAdditional paid-in capital\n472.1\n \n492.0\n \nRetained earnings\n11,500.5\n \n10,571.5\n \nAccumulated other comprehensive income (loss)\n(\n1,475.9\n)\n(\n1,337.6\n)\nTreasury stock, at cost, \n100.8\n million and \n99.2\n million shares\n(\n6,347.8\n)\n(\n6,154.2\n)\nTotal Shareholders’ Equity\n4,193.5\n \n3,616.3\n \nNoncontrolling interests\n552.4\n \n608.8\n \nTotal Equity\n4,745.9\n \n4,225.1\n \nTOTAL LIABILITIES AND EQUITY\n$\n29,620.7\n \n$\n28,044.6\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nF-4\nOMNICOM GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(In millions, except per share amounts)\nYear Ended December 31,\n2024\n2023\n2022\nRevenue\n$\n15,689.1\n \n$\n14,692.2\n \n$\n14,289.1\n \nOperating Expenses:\n   Salary and service costs\n11,432.5\n \n10,701.2\n \n10,325.9\n \n   Occupancy and other costs\n1,274.4\n \n1,168.8\n \n1,168.6\n \n   Real estate and other repositioning costs\n57.8\n \n191.5\n \n—\n \n   Charges arising from the effects of the war in Ukraine\n—\n \n—\n \n113.4\n \n   Gain on disposition of subsidiary\n—\n \n(\n78.8\n)\n—\n \nCost of services\n12,764.7\n \n11,982.7\n \n11,607.9\n \n   Selling, general and administrative expenses\n408.1\n \n393.7\n \n378.5\n \n   Depreciation and amortization\n241.7\n \n211.1\n \n219.4\n \nTotal Operating Expenses\n13,414.5\n \n12,587.5\n \n12,205.8\n \nOperating Income\n2,274.6\n \n2,104.7\n \n2,083.3\n \nInterest Expense\n247.9\n \n218.5\n \n208.6\n \nInterest Income\n100.9\n \n106.7\n \n70.7\n \nIncome Before Income Taxes and Income From Equity Method Investments\n2,127.6\n \n1,992.9\n \n1,945.4\n \nIncome Tax Expense\n560.5\n \n524.9\n \n546.8\n \nIncome From Equity Method Investments\n6.9\n \n5.2\n \n5.2\n \nNet Income\n1,574.0\n \n1,473.2\n \n1,403.8\n \nNet Income Attributed To Noncontrolling Interests\n93.4\n \n81.8\n \n87.3\n \nNet Income - Omnicom Group Inc.\n$\n1,480.6\n \n$\n1,391.4\n \n$\n1,316.5\n \nNet Income Per Share - Omnicom Group Inc.:\n \n \n \nBasic\n$\n7.54\n$\n6.98\n$\n6.40\nDiluted\n$\n7.46\n$\n6.91\n$\n6.36\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nF-5\nOMNICOM GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet Income\n$\n1,574.0\n \n$\n1,473.2\n \n$\n1,403.8\n \nOther Comprehensive Income (Loss):\nCash flow hedge:\nAmortization of loss included in interest expense\n4.4\n \n5.6\n \n5.6\n \nIncome tax effect\n(\n1.3\n)\n(\n1.6\n)\n(\n1.6\n)\n    Cash flow hedge, net of tax\n3.1\n \n4.0\n \n4.0\n \nPension and other postemployment benefits:\nUnrecognized actuarial gains (losses) and prior service cost for the period\n18.7\n \n(\n6.8\n)\n58.4\n \nAmortization of prior service cost and actuarial (gains) losses\n5.8\n \n4.8\n \n10.7\n \nIncome tax effect\n(\n7.3\n)\n0.6\n \n(\n20.0\n)\n     Pension and other postemployment benefits, net of tax\n17.2\n \n(\n1.4\n)\n49.1\n \nForeign currency translation adjustment\n(\n171.7\n)\n98.9\n \n(\n255.2\n)\nOther Comprehensive Income (Loss)\n(\n151.4\n)\n101.5\n \n(\n202.1\n)\nComprehensive Income\n1,422.6\n \n1,574.7\n \n1,201.7\n \nComprehensive Income Attributed To Noncontrolling Interests\n80.3\n \n83.0\n \n70.8\n \nComprehensive Income - Omnicom Group Inc.\n$\n1,342.3\n \n$\n1,491.7\n \n$\n1,130.9\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nF-6\nOMNICOM GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY \n(In millions, except per share amounts)\nYear Ended December 31,\n \n2024\n2023\n2022\nCommon Stock, shares\n297.2\n \n297.2\n \n297.2\n \nCommon Stock, par value\n$\n44.6\n \n$\n44.6\n \n$\n44.6\n \nAdditional Paid-in Capital:\nBeginning balance\n492.0\n \n571.1\n \n622.0\n \nNet change in noncontrolling interests\n(\n9.9\n)\n(\n88.1\n)\n(\n17.1\n)\nChange in temporary equity\n(\n24.0\n)\n(\n27.2\n)\n(\n49.9\n)\nShare-based compensation\n91.4\n \n84.8\n \n81.7\n \nCommon stock issued, share-based compensation\n(\n77.4\n)\n(\n48.6\n)\n(\n65.6\n)\nEnding balance\n472.1\n \n492.0\n \n571.1\n \nRetained Earnings:\nBeginning balance\n10,571.5\n \n9,739.3\n \n8,998.8\n \nNet income\n1,480.6\n \n1,391.4\n \n1,316.5\n \nCommon stock dividends declared\n(\n551.6\n)\n(\n559.2\n)\n(\n576.0\n)\nEnding balance\n11,500.5\n \n10,571.5\n \n9,739.3\n \nAccumulated Other Comprehensive Income (Loss):\nBeginning balance\n(\n1,337.6\n)\n(\n1,437.9\n)\n(\n1,252.3\n)\nOther comprehensive income (loss)\n(\n138.3\n)\n100.3\n \n(\n185.6\n)\nEnding balance\n(\n1,475.9\n)\n(\n1,337.6\n)\n(\n1,437.9\n)\nTreasury Stock:\nBeginning balance\n(\n6,154.2\n)\n(\n5,665.0\n)\n(\n5,142.9\n)\nCommon stock issued, share-based compensation\n179.1\n \n86.0\n \n89.3\n \nCommon stock repurchased\n(\n372.7\n)\n(\n575.2\n)\n(\n611.4\n)\nEnding balance\n(\n6,347.8\n)\n(\n6,154.2\n)\n(\n5,665.0\n)\nShareholders’ Equity\n4,193.5\n \n3,616.3\n \n3,252.1\n \nNoncontrolling Interests:\nBeginning balance\n608.8\n \n524.3\n \n503.5\n \nNet income\n93.4\n \n81.8\n \n87.3\n \nOther comprehensive income (loss)\n(\n13.1\n)\n1.2\n \n(\n16.5\n)\nDividends to noncontrolling interests\n(\n85.4\n)\n(\n70.9\n)\n(\n79.5\n)\nNet change in noncontrolling interests\n(\n51.3\n)\n72.4\n \n29.5\n \nEnding balance\n552.4\n \n608.8\n \n524.3\n \nTotal Equity\n$\n4,745.9\n \n$\n4,225.1\n \n$\n3,776.4\n \nDividends Declared Per Common Share\n$\n2.80\n$\n2.80\n$\n2.80\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nF-7\nOMNICOM GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\nYear Ended December 31,\n2024\n2023\n2022\nCash Flows from Operating Activities:\n \n \n \nNet income\n$\n1,574.0\n \n$\n1,473.2\n \n$\n1,403.8\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n \n \nDepreciation and amortization of right-of-use assets\n136.1\n \n130.8\n \n139.1\n \nAmortization of intangible assets\n105.6\n \n80.3\n \n80.3\n \nShare-based compensation\n91.4\n \n84.8\n \n81.7\n \nReal estate and other repositioning costs\n57.8\n \n191.5\n \n—\n \nGain on disposition of subsidiary\n—\n \n(\n78.8\n)\n—\n \nNon-cash charges related to the effects of the war in Ukraine\n—\n \n—\n \n65.8\n \nOther, net\n(\n0.2\n)\n3.0\n \n(\n0.2\n)\nDecrease in operating capital\n(\n231.2\n)\n(\n462.9\n)\n(\n844.0\n)\nNet Cash Provided By Operating Activities\n1,733.5\n \n1,421.9\n \n926.5\n \nCash Flows from Investing Activities:\n \n \n \nCapital expenditures\n(\n140.6\n)\n(\n78.4\n)\n(\n78.2\n)\nAcquisition of businesses and interests in affiliates, net of cash acquired\n(\n902.1\n)\n(\n93.3\n)\n(\n276.8\n)\nMaturity (purchase) of short-term investments\n—\n \n60.8\n \n(\n61.4\n)\nProceeds from disposition of subsidiaries and other\n(\n16.0\n)\n190.0\n \n35.5\n \nNet Cash Provided By (Used In) Investing Activities\n(\n1,058.7\n)\n79.1\n \n(\n380.9\n)\nCash Flows from Financing Activities:\n \n \n \nProceeds from borrowings\n1,235.5\n \n—\n \n—\n \nRepayment of debt\n(\n750.0\n)\n—\n \n—\n \nChange in short-term debt\n12.6\n \n(\n8.7\n)\n8.9\n \nDividends paid to common shareholders\n(\n552.7\n)\n(\n562.7\n)\n(\n581.1\n)\nRepurchases of common stock\n(\n370.7\n)\n(\n570.8\n)\n(\n611.4\n)\nProceeds from stock plans\n102.1\n \n35.6\n \n17.4\n \nAcquisition of additional noncontrolling interests\n(\n53.6\n)\n(\n87.6\n)\n(\n20.8\n)\nDividends paid to noncontrolling interest shareholders\n(\n85.4\n)\n(\n70.9\n)\n(\n79.5\n)\nPayment of contingent purchase price obligations\n(\n42.4\n)\n(\n67.7\n)\n(\n32.6\n)\nOther, net\n(\n77.4\n)\n(\n55.0\n)\n(\n62.9\n)\nNet Cash Used In Financing Activities\n(\n582.0\n)\n(\n1,387.8\n)\n(\n1,362.0\n)\nEffect of foreign exchange rate changes on cash and cash equivalents\n(\n185.4\n)\n37.0\n \n(\n218.6\n)\nNet Increase (Decrease) in Cash and Cash Equivalents\n(\n92.6\n)\n150.2\n \n(\n1,035.0\n)\nCash and Cash Equivalents at the Beginning of Year\n4,432.0\n \n4,281.8\n \n5,316.8\n \nCash and Cash Equivalents at the End of Year\n$\n4,339.4\n \n$\n4,432.0\n \n$\n4,281.8\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nF-8\n1. \nPresentation of Financial Statements \nThe terms “Omnicom,” “the Company,” “we,” “our” and “us” each refer to Omnicom Group Inc. and its subsidiaries, unless the context indicates otherwise. The accompanying consolidated financial statements were prepared in accordance with generally accepted accounting principles in the United States, or U.S. GAAP or GAAP. All intercompany balances and transactions have been eliminated. The preparation of financial statements in conformity with U.S. GAAP requires us to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Actual results could differ from those estimates and assumptions. Unless otherwise noted, dollars in tables are in millions, except per share amounts.\nAgreement to Acquire IPG\nOn December 8, 2024, Omnicom entered into an Agreement and Plan of Merger, or the Merger Agreement, by and among Omnicom, EXT Subsidiary Inc., a direct wholly owned subsidiary of Omnicom, or Merger Sub, and The Interpublic Group of Companies, Inc., or IPG, pursuant to which, subject to the terms and conditions of the Merger Agreement, Merger Sub will merge with and into IPG, or the Merger, with IPG surviving the Merger as a wholly owned subsidiary of Omnicom. The completion of the Merger is subject to customary closing conditions, including the required regulatory approvals and the approval of the stockholders of both Omnicom and IPG. If completed, the Merger is expected to have a material impact on our ongoing results of operations and financial condition. In the fourth quarter of 2024, we recorded $\n14.6\n million of acquisition transaction costs related to the Merger in selling, general and administrative expenses. The results of IPG are not included in our 2024 results of operations or financial position. \nRisks and Uncertainties\nGlobal economic disruptions, including geopolitical events, international hostilities, acts of terrorism, public health crises, inflation or stagflation, tariffs and other trade barriers, central bank interest rate policies in countries that comprise our major markets and labor and supply chain challenges could cause economic uncertainty and volatility. The impact of these issues on our business will vary by geographic market and discipline. We monitor economic conditions closely, as well as client revenue levels and other factors. In response to reductions in revenue, we can take actions to align our cost structure with changes in client demand and manage our working capital. However, there can be no assurance as to the effectiveness of our efforts to mitigate any impact of the current and future adverse economic conditions, reductions in client revenue, changes in client creditworthiness and other developments.\nAccounting Changes\nOn January 1, 2024, we adopted ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, or\n \nASU 2023-07, that requires retrospective disclosure of significant expenses that are regularly provided to the chief operating decision maker (see Note 8 - \nSegment Reporting\n). ASU 2023-07 is effective for annual periods beginning January 1, 2024 and for interim periods beginning January 1, 2025. ASU 2023-07 affects financial statement disclosure only, and its adoption did not affect our results of operations or financial condition.\nOn January 1, 2025, we adopted ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures \n(“ASU 2023-09”), that requires, among other things, greater disaggregation of information in the rate reconciliation, and income taxes paid disaggregated by jurisdiction. ASU 2023-09 affects financial statement disclosure only in 2025, and its adoption did not affect our results of operations or financial condition.\n2. \nSignificant Accounting Policies\nRevenue Recognition\n.\n \nRevenue is recognized when a customer obtains control and receives the benefit of the promised goods or services (the performance obligation) in an amount that reflects the consideration we expect to receive in exchange for those goods or services (the transaction price). We measure revenue by estimating the transaction price based on the consideration specified in the client arrangement. Revenue is recognized as the performance obligations are satisfied. Our revenue is primarily derived from the planning and execution of advertising, marketing, and communications services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Our client contracts are primarily fees for service on a rate per hour or per project basis. Revenue is recorded net of sales, use and value added taxes.\nPerformance Obligations.\n In substantially all our disciplines, the performance obligation is to provide advisory and consulting services at an agreed-upon level of effort to accomplish the specified engagement. Our client contracts are comprised of diverse arrangements involving fees based on any one or a combination of the following: an agreed fee or rate per hour for the level of effort expended by our employees; commissions based on the client’s spending for media purchased from third parties; qualitative or quantitative incentive provisions specified in the contract; and reimbursement for third-party costs that we are required to include in revenue when we control the vendor services related to these costs and we act as principal. The transaction price of a contract is allocated to each distinct performance obligation based on its relative stand-alone selling price and is recognized as revenue when, or as, the customer receives the benefit of the performance obligation. Clients typically receive and consume the benefit of our services as they are performed. Substantially all our client contracts provide that we are compensated for services performed to date and allow for cancellation by either party on short notice, typically 90 days, without penalty.\nF-9\nGenerally, our short-term contracts, which normally take 30 to 90 days to complete, are performed by a single agency and consist of a single performance obligation. As a result, we do not consider the underlying services as separate or distinct performance obligations because our services are highly interrelated, occur in close proximity, and the integration of the various components of a marketing message is essential to overall service. In certain of our long-term client contracts, which have a term of up to one year, the performance obligation is a stand-ready obligation, because we provide a constant level of similar services over the term of the contract. In other long-term contracts, when our services are not a stand-ready obligation, we consider our services distinct performance obligations and allocate the transaction price to each separate performance obligation based on its stand-alone selling price, including contracts for strategic media planning and buying services, which are considered to be multiple \nperformance obligations, and we allocate the transaction price to each distinct service based on the staffing plan and the stand-alone selling price. In substantially all of our creative services contracts, we have distinct performance obligations for our services, including certain creative services contracts where we act as an agent and arrange, at the client’s direction, for third parties to perform studio production efforts.\nRevenue Recognition Methods. \n A substantial portion of our revenue is recognized over time, as the services are performed, because the client receives and consumes the benefit of our performance throughout the contract period, or we create an asset with no alternative use and are contractually entitled to payment for our performance to date in the event the client terminates the contract for convenience. For these client contracts, other than when we have a stand-ready obligation to perform services, revenue is recognized over time using input measures that correspond to the level of staff effort expended to satisfy the performance obligation on a rate per hour or equivalent basis. For client contracts when we have a stand-ready obligation to perform services on an ongoing basis over the life of the contract, typically for periods up to one year, where the scope of these arrangements is broad and there are no significant gaps in performing the services, we recognize revenue using a time-based measure resulting in a straight-line revenue recognition. From time to time, there may be changes in the client service requirements during the term of a contract and the changes could be significant. These changes are typically negotiated as new contracts covering the additional requirements and the associated costs, as well as additional fees for the incremental work to be performed.\nTo a lesser extent, for certain other contracts where our performance obligations are satisfied in phases, we recognize revenue over time using certain output measures based on the measurement of the value transferred to the customer, including milestones achieved. Where the transaction price or a portion of the transaction price is derived from commissions based on a percentage of purchased media from third parties, the performance obligation is not satisfied until the media is run and we have an enforceable contract providing a right to payment. Accordingly, revenue for commissions is recognized at a point in time, typically when the media is run, including when it is not subject to cancellation by the client or media vendor.\nPrincipal vs. Agent. \nIn substantially all our businesses, we incur third-party costs on behalf of clients, including direct costs and incidental, or out-of-pocket costs. Third-party direct costs incurred in connection with the creation and delivery of advertising, marketing, and communications services include, among others: purchased media, studio production services, specialized talent, including artists and other freelance labor, event marketing supplies, materials and services, promotional items, market research and third-party data and other related expenditures. Out-of-pocket costs include, among others: transportation, hotel, meals, shipping and telecommunication charges incurred by us in the course of providing our services. Billings related to out-of-pocket costs are included in revenue since we control the goods or services prior to delivery to the client.\nHowever, the inclusion of billings related to third-party direct costs in revenue depends on whether we act as a principal or as an agent in the client arrangement. In most of our businesses, including advertising, which also includes studio production efforts and media planning and buying services, precision marketing, public relations, healthcare, and branding and retail commerce, we act as an agent and arrange, at the client’s direction, for third parties to perform certain services. In these cases, we do not control the goods or services prior to the transfer to the client. As a result, revenue is recorded net of these costs, equal to the amount retained for our fee or commission.\nIn certain businesses we may act as principal when contracting for third-party services on behalf of our clients. In our experiential business and most of our execution and support businesses, including field marketing and certain specialty marketing businesses, we act as principal because we control the specified goods or services before they are transferred to the client and we are responsible for providing the specified goods or services, or we are responsible for directing and integrating third-party vendors to fulfill our performance obligation at the agreed upon contractual price. In such arrangements, we also take pricing risk under the terms of the client contract. In certain media buying businesses, we act as principal when we control the buying process for the purchase of the media and contract directly with the media vendor. In these arrangements, we assume the pricing risk under the terms of the client contract. When we act as principal, we include billable amounts related to third-party costs in the transaction price and record revenue over time at the gross amount billed, including out-of-pocket costs, consistent with the manner that we recognize revenue for the underlying services contract. However, in media buying contracts where we act as principal, we recognize revenue at a point in time, typically when the media is run, including when it is not subject to cancellation by the client or media vendor.\nVariable Consideration. \nSome\n \nof our client arrangements include variable consideration provisions, which include performance incentives, tiered commission structures and vendor rebates in certain markets outside of the United States. Variable consideration is estimated and included in total consideration at contract inception based on either the expected value method or the \nF-10\nmost likely outcome method. These estimates are based on historical award experience, anticipated performance and other factors known at the time. Performance incentives are typically recognized in revenue over time. Variable consideration for our media businesses in certain international markets includes rebate revenue and is recognized when it is probable that the media will be run, including when it is not subject to cancellation by the client. In addition, when we receive rebates or credits from vendors for transactions entered into on behalf of clients, they are remitted to the clients in accordance with contractual requirements or retained by us based on the terms of the client contract or local law. Amounts passed on to clients are recorded as a liability and amounts retained by us are recorded as revenue when earned, typically when the media is run.\nOperating Expenses.\n \nOperating expenses include cost of services, selling, general and administrative expenses, or SG&A, and depreciation and amortization. We measure cost of services in two distinct categories: salary and service costs and occupancy and other costs. As a service business, salary and service costs make up a significant portion of our operating expenses, and substantially all these costs comprise the essential components directly linked to the delivery of our services. Salary and service costs include employee compensation and benefits, freelance labor, third-party service costs, and third-party incidental costs. Third-party service costs include vendor costs when we act as principal in providing services to our clients. Third-party incidental costs that are required to be included in revenue primarily consist of client-related travel and incidental out-of-pocket costs that we bill back to the client directly at our cost. Occupancy and other costs consist of the indirect costs related to the delivery of our services, including office rent and other occupancy costs, equipment rent, technology costs, general office expenses and other expenses. SG&A expenses primarily consist of third-party marketing costs, professional fees and compensation and benefits and occupancy and other costs of our corporate and executive offices, which includes group-wide finance and accounting, treasury, legal and governance, human resource oversight and similar costs.\nCash and Cash Equivalents.\n Cash and cash equivalents include cash in banks and highly liquid interest-bearing time deposits with original maturities of three months or less. Due to the short-term nature of these investments, carrying value approximates fair value. We have a policy governing counterparty credit risk for financial institutions that hold our cash and cash equivalents and we have deposit limits for each institution.\n \nWork in Process.\n Work in process represents accrued costs incurred on behalf of customers, including media and production costs and fees, other third-party costs and contract assets that have not yet been billed. Media and production costs are billed during the production process in accordance with the terms of the client contract. Substantially all unbilled fees and costs will be billed within the next 30 days. Contract assets primarily include incentive fees, which are not material, and will be billed to clients in accordance with the terms of the client contract.\nProperty and Equipment. \nProperty and equipment are carried at cost and are depreciated over the estimated useful lives of the assets using the straight-line method ranging from: \nthree\n to \nfive\n years for technology and related equipment, \nseven\n to \nten\n years for furniture, and up to \n40\n years for office buildings. Leasehold improvements are amortized on a straight-line basis over the shorter of the lease term or the estimated useful life of the asset. Assets under finance leases are amortized on a straight-line basis over the lease term.\nEquity Method Investments.\n Investments in companies where we exercise significant influence over the operating and financial policies of the investee and own less than 50% of the equity are accounted for using the equity method. Our proportionate share of the net income or loss of equity method investments is included in results of operations and any dividends received reduce the carrying value of the investment. The excess of the cost of our investment over our proportionate share of the fair value of the net assets of the investee at the acquisition date is recognized as goodwill and included in the carrying amount of the investment. Goodwill in the equity method investments is not amortized. Gains and losses from changes in our ownership interests are recorded in results of operations until control is achieved. In circumstances where a change in our ownership interest results in obtaining control, the existing carrying value of the investment is remeasured to the acquisition date fair value and any gain or loss is recognized in results of operations. We periodically review the carrying value of the equity method investments to determine if there has been an other-than-temporary decline in carrying value. A variety of factors are considered when determining if a decline in carrying value is other-than-temporary, including the financial condition and business prospects of the investee, as well as our investment intent.\nMarketable Equity Securities.\n Marketable equity securities are measured at fair value and changes in fair value are recognized in results of operations.\nNon-Marketable Equity Securities\n.\n \nNon-marketable equity securities do not have a readily determinable fair value and are measured at cost, less any impairment, and are adjusted for observable changes in fair value from transactions for identical or similar securities of the same issuer.\nBusiness Combinations.\n \nIn a business combination, the assets acquired, including identified intangible assets, liabilities assumed and any noncontrolling interest in the acquired business are recorded at acquisition date fair value. In circumstances where control is obtained and less than 100% of a business is acquired, goodwill related to the noncontrolling shareholders is recorded as if 100% were acquired. Acquisition-related costs, including advisory, legal, accounting, valuation and other costs are expensed as incurred. Certain acquisitions include an initial payment at closing and provide for future additional contingent purchase price payments (earn-outs), which are recorded as a liability at the acquisition date fair value using the discount rate in effect on the acquisition \nF-11\ndate. Subsequent changes in the fair value of the liability are recorded in results of operations. Amounts earned under the contingent purchase price arrangements may be subject to a maximum and payment is not contingent upon future employment. The results of operations of acquired businesses are included in results of operations from the acquisition date.\nGoodwill and Intangible Assets.\n Goodwill represents the excess of the acquisition cost over the fair value of the net assets acquired. Goodwill is not amortized but is reviewed for impairment. Intangible assets comprise customer relationships, including the related customer contracts and trade names, and purchased and internally developed software and are amortized over their estimated useful lives ranging from \nfive\n to \ntwelve\n years. We consider a number of factors in determining the useful lives and amortization method, including the pattern in which the economic benefits are consumed, as well as trade name recognition and customer attrition. There is no estimated residual value for the intangible assets.\nWe evaluate goodwill for impairment at least annually on May 1 and whenever events or circumstances indicate the carrying value may not be recoverable. The impairment evaluation compares the fair value of each reporting unit, which we identified as our six agency networks, to its carrying value, including goodwill. If the fair value of the reporting unit is equal to or greater than its carrying value, goodwill is not impaired. Goodwill is impaired when the carrying value of the reporting unit exceeds its fair value. Goodwill is written down to its fair value through a non-cash expense recorded in results of operations in the period the impairment is identified.\nWe identified our regional reporting units as components of our operating segments, which are our six global agency networks. The regional reporting units and practice areas monitor the performance and are responsible for the agencies in their region. The regional reporting units report to the segment managers and facilitate the administrative and logistical requirements of our key client matrix organization structure for delivering services to clients in their regions. We have concluded that, for each of our operating segments, their regional reporting units have similar economic characteristics and should be aggregated for purposes of testing goodwill for impairment at the operating segment level. Our conclusion was based on a detailed analysis of the aggregation criteria set forth in FASB ASC Topic 280, \nSegment Reporting\n, and in FASB ASC Topic 350. Consistent with our fundamental business strategy, the agencies within our regional reporting units serve similar clients in similar industries, and in many cases the same clients. In addition, the agencies within our regional reporting units have similar economic characteristics, and the employees share similar skill sets. The main economic components of each agency are employee compensation and related costs, and direct service costs and occupancy and other costs, which include rent and occupancy costs, technology costs that are generally limited to personal computers, servers and off-the-shelf software and other overhead expenses. Finally, the expected benefits of our acquisitions are typically shared by multiple agencies in various regions as they work together to integrate the acquired agency into our virtual client network strategy. We use the following valuation methodologies to determine the fair value of our reporting units: (1) the income approach, which utilizes discounted expected future cash flows, (2) comparative market participant multiples of EBITDA (earnings before interest, taxes, depreciation and amortization) and (3) when available, consideration of recent and similar acquisition transactions. The market assumptions used in our assessment reflected the current economic environment (see Note 1 - \nRisks and Uncertainties\n).\nBased on the results of the annual impairment test, we concluded that, at May 1, 2024 and 2023, goodwill was not impaired because either the fair value of each reporting unit was substantially in excess of its respective net book value, or for reporting units with a negative book value, fair value of assets exceeds total assets. Subsequent to the annual goodwill impairment test, there have been no events or circumstances that triggered the need for an interim impairment test.\nDebt\n \nIssuance Costs. \nDebt issuance costs are capitalized and amortized in interest expense over the term of the related debt and are presented as a reduction to the carrying amount of debt.\nTemporary Equity - Redeemable Noncontrolling Interests.\n Owners of noncontrolling equity interests in some of our subsidiaries have the right in certain circumstances to require us to purchase all or a portion of their equity interests at fair value as defined in the applicable agreements. The intent of the parties is to approximate fair value at the time of redemption by using a multiple of earnings that is consistent with generally accepted valuation practices used by market participants in our industry. These contingent redemption rights are embedded in the equity security at issuance, are not free-standing instruments, do not represent a de facto financing and are not under our control, however, in almost all cases we have a similar protective call right to buy the security at fair value.\nTreasury Stock.\n \nRepurchases of\n \nour common stock are accounted for at cost and are recorded as treasury stock. The excise tax on net stock repurchases is recorded as a cost of acquiring treasury stock. Reissued treasury stock, primarily in connection with share-based compensation plans, is accounted for at average cost. Gains or losses on reissued treasury stock arising from the difference between the average cost and the fair value of the award are recorded in additional paid-in capital and do not affect results of operations.\nNoncontrolling Interests.\n \nNoncontrolling interests represent equity interests in certain subsidiaries held by third parties. Noncontrolling interests are presented as a component of equity and the proportionate share of net income attributed to the noncontrolling interests is recorded in results of operations. Changes in noncontrolling interests that do not result in a loss of control are accounted for in equity. Gains and losses resulting from a loss of control are recorded in results of operations.\nF-12\nForeign Currency Translation and Transactions.\n Substantially all of our foreign subsidiaries use their local currency as their functional currency. Assets and liabilities are translated from the local functional currency into U.S. Dollars at the exchange rate on the balance sheet date and revenue and expenses are translated at the average exchange rate for the period. Translation adjustments are recorded in accumulated other comprehensive income. Foreign currency gains and losses arising from transactions not in the subsidiaries’ local currency are recorded in results of operations. We recorded foreign currency transaction losses of $\n5.4\n million and $\n14.0\n million in 2024 and 2023, respectively, and recorded foreign currency transaction gains of $\n1.1\n million in 2022. Foreign currency gains and losses for hyper-inflationary economies are recorded in results of operations.\nShare-Based Compensation.\n Share-based compensation for restricted stock and stock option awards is measured at the grant date fair value. The fair value of restricted stock awards is determined and fixed using the closing price of our common stock on the grant date and is recorded in additional paid-in capital. The fair value of stock option awards is determined using the Black-Scholes option valuation model. For awards with a service only vesting condition, compensation expense is recognized on a straight-line basis over the requisite service period. For awards with a performance vesting condition, compensation expense is recognized on a graded-vesting basis. Typically, all share-based awards are settled with treasury stock. See Note 10 for additional information regarding our specific award plans.\nSeverance.\n The liability for one-time termination benefits, such as severance pay or benefit payouts, is measured and recognized at fair value in the period the liability is incurred. Subsequent changes to the liability are recognized in results of operations in the period of change.\nPension and Other Postemployment Benefits\n. \n We have various defined benefit and defined contribution plans throughout the world. We have a Senior Executive Retention Plan and Key Executive Retention Plan that cover certain executives. In addition, we have postemployment benefit plans for various key employees that primarily cover a period of 10 years after cessation of full-time employment. We use various actuarial methods and assumptions in determining our net pension and postemployment benefit costs and obligations, including the discount rate used to determine the present value of future benefits, expected long-term rate of return on plan assets and compensation cost trends. The overfunded or underfunded status of our pension and other postemployment benefit plans is recorded on the balance sheet (see Note 12 for additional information).\n \nDeferred Compensation\n.\n Some of our subsidiaries have deferred compensation arrangements with certain executives that provide for payments over varying terms upon retirement, cessation of employment or death. The cost of these arrangements is accrued during the employee’s service period, and included in other long-term liabilities except for the current portion.\nIncome Taxes.\n We use the asset and liability method of accounting for income taxes. Under this method, income tax expense is recognized for the amount of taxes payable for the current period and the deferred taxes recognized during the period. Deferred income taxes reflect the temporary difference between assets and liabilities that are recognized for financial reporting purposes and income tax purposes and are recorded as noncurrent. Deferred income taxes are measured using the enacted tax rates that are assumed to be in effect when the differences reverse. Valuation allowances are recorded where it is more likely than not that all or a portion of a deferred tax asset will not be realized. In assessing the need for a valuation allowance, we evaluate factors such as prior earnings history, expected future earnings, carry-back and carry-forward periods and tax strategies that could potentially enhance the likelihood of the realization of a deferred tax asset.\nInterest and penalties related to tax positions taken in our tax returns are recorded in income tax expense. We record a liability for uncertain tax positions that reflects the treatment of certain tax positions taken in our tax returns that do not meet the more-likely-than not threshold, or that meet the more-likely-than-not threshold but have measurement related unrecognized tax benefits. Until these positions are sustained by the taxing authorities or the statute of limitations concerning such issues lapses, we do not generally recognize the tax benefits resulting from such positions.\nNet Income Per Share.\n Basic net income per share is based on the weighted average number of common shares outstanding during the period. Diluted net income per share is based on the weighted average number of common shares outstanding, plus the dilutive effect of common share equivalents, which include outstanding stock options and restricted stock awards.\nLeases.\n \nAt the inception of a contract, we assess whether the contract is, or contains, a lease. A lease is classified as a finance lease if any one of the following criteria are met: the lease transfers ownership of the asset by the end of the lease term, the lease contains an option to purchase the asset that is reasonably certain to be exercised, the lease term is for a major part of the remaining useful life of the asset or the present value of the lease payments equals or exceeds substantially all of the fair value of the asset. A lease is classified as an operating lease if it does not meet any one of the criteria. Substantially all our operating leases are office space leases, and substantially all our finance leases are office furniture and technology equipment leases.\nFor all leases a right-of-use, or ROU, asset and lease liability are recognized at the lease commencement date. The lease liability represents the present value of the lease payments under the lease. The ROU asset is initially measured at cost, which includes the initial lease liability, plus any initial direct costs incurred, consisting mainly of brokerage commissions, less any lease incentives received. All ROU assets are reviewed for impairment. The lease liability is initially measured as the present value of the lease payments, discounted using the interest rate implicit in the lease or, if that rate cannot be readily determined, our secured incremental borrowing rate for the same term as the underlying lease. For real estate and certain equipment operating leases, we \nF-13\nuse our secured incremental borrowing rate. For finance leases, we use the rate implicit in the lease or our secured incremental borrowing rate if the implicit lease rate cannot be determined.\nLease payments included in the measurement of the lease liability comprise: the fixed noncancelable lease payments, payments for optional renewal periods where it is reasonably certain the renewal period will be exercised, and payments for early termination options unless it is reasonably certain the lease will not be terminated early. Lease components, including fixed payments for real estate taxes and insurance for office space leases, are included in the measurement of the initial lease liability.\nOffice space leases may contain variable lease payments, which include payments based on an index or rate. Variable lease payments based on an index or rate are initially measured using the index or rate in effect at lease commencement. Additional payments based on the change in an index or rate, or payments based on a change in our portion of the operating expenses, including real estate taxes and insurance, are recorded as a period expense when incurred. Lease modifications result in remeasurement of the lease liability.\nOperating lease expense is recognized on a straight-line basis over the lease term. Lease expense may include variable lease payments incurred in the period that were not included in the initial lease liability. Finance lease expense consists of the amortization of the ROU asset on a straight-line basis over the lease term and interest expense determined on an amortized cost basis. Finance lease payments are allocated between a reduction of the lease liability and interest expense.\nConcentration of Credit Risk.\n We provide data-inspired, creative marketing and sales solutions to several thousand clients that operate in nearly every industry sector of the global economy, and we grant credit to qualified clients in the normal course of business. Due to the diversified nature of our client base, we do not believe that we are exposed to a concentration of credit risk as our largest client accounted for \n2.7\n% of revenue in 2024.\nDerivative Financial Instruments.\n All derivative instruments, including certain derivative instruments embedded in other contracts, are recorded at fair value. Derivatives qualify for hedge accounting if: the hedging instrument is designated as a hedge, the hedged exposure is specifically identifiable and exposes us to risk, and a change in fair value of the derivative financial instrument and an opposite change in the fair value of the hedged exposure have a high degree of correlation. The method of assessing hedge effectiveness and measuring hedge ineffectiveness is formally documented. Hedge effectiveness is assessed, and hedge ineffectiveness is measured at least quarterly throughout the designated hedge period. Changes in the fair value of a fair value hedge are offset against the change in fair value of the hedged asset, liability or firm commitment through results of operations. Gains and losses on a terminated fair value hedge of our long-term debt are included in long-term debt and are amortized over the remaining term of the respective debt that was hedged. Changes in the fair value of a cash flow hedge are recognized in other comprehensive income until the hedged item is recognized in results of operations. Foreign currency hedges of the net investment in our foreign operations are recorded in accumulated other comprehensive income (loss), or AOCI. Any gain or loss will remain in AOCI until the complete or substantially complete liquidation of our investment in the underlying operation. We do not use derivatives for trading or speculative purposes. Using derivatives exposes us to the risk that counterparties to the derivative contracts will fail to meet their contractual obligations. We manage that risk through careful selection and ongoing evaluation of the counterparty financial institutions based on specific minimum credit standards and other factors.\nFair Value.\n We apply the fair value measurement guidance in FASB ASC Topic 820, \nFair Value Measurements and Disclosures\n, for our financial assets and liabilities that are required to be measured at fair value and for our nonfinancial assets and liabilities that are not required to be measured at fair value on a recurring basis, which includes goodwill and other identifiable intangible assets. The measurement of fair value requires the use of techniques based on observable and unobservable inputs. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect our market assumptions.\nThe inputs create the following fair value hierarchy:\n•\nLevel 1 - Unadjusted quoted prices in active markets for identical assets or liabilities.\n•\nLevel 2 - Unadjusted quoted prices in active markets for similar assets or liabilities; unadjusted quoted prices for identical assets or liabilities in markets that are not active; and model-derived valuations with observable inputs.\n•\nLevel 3 - Unobservable inputs for the asset or liability.\nWe use unadjusted quoted market prices to determine the fair value of our financial assets and liabilities and classify such items in Level 1. We use unadjusted quoted market prices for similar assets and liabilities in active markets and model-derived valuations and classify such items in Level 2.\nIn determining the fair value of financial assets and liabilities, we consider certain market valuation adjustments that market participants would consider in determining fair value, including, counterparty credit risk adjustments applied to financial assets and liabilities, taking into account the actual credit risk of the counterparty when valuing assets measured at fair value and credit risk adjustments applied to reflect our credit risk when valuing liabilities measured at fair value.\nF-14\n3.  \nRevenue\nNature of our services\nWe provide data-inspired, creative marketing and sales solutions through various client-centric networks that are organized to meet specific client objectives. Our networks, practice areas and agencies provide a comprehensive range of services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Media & Advertising includes creative services across digital and traditional media, strategic media planning and buying, performance media, data analytics services, and Omnicom Production. Precision Marketing includes digital and direct marketing, digital transformation consulting, e-commerce operations, media execution, market intelligence and data and analytics. Public Relations services include corporate communications, crisis management, public affairs and media and media relations services. Healthcare includes corporate communications and advertising and media services to global healthcare and pharmaceutical companies. Branding & Retail Commerce services include brand and product consulting, strategy and research and retail marketing. Experiential marketing services include live and digital events and experience design and execution. Execution & Support includes field marketing, sales support, digital and physical merchandising, point-of-sale and product placement, as well as other specialized marketing and custom communications services. At the core of all our services is the ability to create or develop a client’s marketing or corporate communications message into content that can be delivered to a target audience across different communications mediums.\nEconomic factors affecting our revenue\nGlobal economic conditions have a direct impact on our revenue. Adverse economic conditions pose a risk that our clients may reduce, postpone or cancel spending for our services, which would impact our revenue.\nRevenue by discipline:\nYear Ended December 31,\n2024\n2023\n2022\nMedia & Advertising\n$\n8,466.2\n \n$\n7,891.2\n \n$\n7,433.9\n \nPrecision Marketing\n1,820.9\n \n1,473.5\n \n1,426.6\n \nPublic Relations\n1,679.2\n \n1,578.9\n \n1,552.7\n \nHealthcare\n1,354.7\n \n1,362.7\n \n1,322.3\n \nBranding & Retail Commerce\n792.9\n \n853.7\n \n848.1\n \nExperiential\n731.5\n \n651.4\n \n635.6\n \nExecution & Support\n843.7\n \n880.8\n \n1,069.9\n \nRevenue\n$\n15,689.1\n \n$\n14,692.2\n \n$\n14,289.1\n \nRevenue by geographic market:\nYear Ended December 31,\n2024\n2023\n2022\nAmericas:\nNorth America\n$\n8,650.2\n \n$\n7,951.0\n \n$\n7,856.0\n \nLatin America\n433.7\n \n386.8\n \n329.0\n \nEMEA:\nEurope\n4,439.0\n \n4,266.9\n \n4,010.5\n \nMiddle East and Africa\n319.2\n \n309.6\n \n346.7\n \nAsia-Pacific\n1,847.0\n \n1,777.9\n \n1,746.9\n \nRevenue\n$\n15,689.1\n \n$\n14,692.2\n \n$\n14,289.1\n \nThe Americas is comprised of North America, which includes the United States, Canada and Puerto Rico, and Latin America, which includes South America and Mexico. EMEA is comprised of Europe, the Middle East and Africa. Asia-Pacific includes Australia, Greater China, India, Japan, Korea, New Zealand, Singapore and other Asian countries. Revenue in the United States for 2024, 2023 and 2022 was $\n8,186.5\n million, $\n7,471.6\n million and $\n7,367.3\n million, respectively.\nF-15\nContract balances\nContract balances include work in process and customer advances that primarily consist of advance billings to customers in accordance with the terms of the client contracts, primarily for the reimbursement of third-party costs.\nDecember 31,\n2024\n2023\nWork in process:\n   Media and production costs\n$\n864.0\n \n$\n664.4\n \n   Unbilled fees and costs and contract assets\n758.2\n \n678.1\n \nWork in process\n$\n1,622.2\n \n$\n1,342.5\n \nCustomer advances\n$\n1,336.1\n \n$\n1,356.2\n \nThere were no impairment charges to work in process recorded in 2024 or 2023.\n4. \nNet Income per Share\nBasic and diluted net income per share:\nYear Ended December 31,\n2024\n2023\n2022\nNet income - Omnicom Group Inc.\n$\n1,480.6\n \n$\n1,391.4\n \n$\n1,316.5\n \nWeighted average shares (millions):\n \n \n \nBasic\n196.4\n \n199.4\n \n205.6\n \nDilutive stock options and restricted shares\n2.2\n \n2.0\n \n1.4\n \nDiluted\n198.6\n \n201.4\n \n207.0\n \nAnti-dilutive stock options and restricted shares (millions):\n—\n \n—\n \n4.3\n \nNet income per share - Omnicom Group Inc.:\n \n \n \nBasic\n$\n7.54\n$\n6.98\n$\n6.40\nDiluted\n$\n7.46\n$\n6.91\n$\n6.36\n5. \nBusiness Combinations\nIn 2024, we completed two acquisitions that increased goodwill by $\n784.0\n million. \nOn \nJanuary 2, 2024\n, we acquired Flywheel Digital, the digital commerce business of Ascential plc, for a net cash purchase price of approximately \n$\n845\n million\n.\n The principal tangible assets and liabilities acquired were net working capital, and the intangible assets acquired were primarily comprised of customer relationships, intellectual property and trade names aggregating $\n182.6\n million and goodwill of $\n672.5\n million. We expect goodwill attributed to the U.S. operations of Flywheel Digital to be tax deductible. In addition, during 2024, we acquired additional equity interests in certain majority owned subsidiaries, which are accounted for as equity transactions, and no additional goodwill was recorded. None of the acquisitions in 2024, either individually or in the aggregate, were material to our results of operations or financial condition.\nThe evaluation of potential acquisitions is based on various factors, including specialized know-how, reputation, geographic coverage, competitive position and service offerings, as well as our experience and judgment. Our acquisition strategy is focused on acquiring the expertise of an assembled workforce in order to continue to build upon the core capabilities of our strategic business platforms and agency brands, through the expansion of their geographic area or their service capabilities to better serve our clients. Certain acquisitions include an initial payment at closing and provide for future additional contingent purchase price payments (earn-outs), which are derived using the performance of the acquired company and are based on predetermined formulas. At December 31, 2024 and 2023, contingent purchase price obligations were $\n220.1\n million and $\n229.5\n million, respectively, of which $\n56.0\n million and $\n62.4\n million, respectively, are current liabilities.\nFor each acquisition, we undertake a detailed review to identify other intangible assets that are required to be valued separately. We use several market participant measurements to determine fair value. This approach includes consideration of similar and recent transactions, as well as utilizing discounted expected cash flow methodologies, and when available and as appropriate, we use comparative market multiples to supplement our analysis. As is typical for most service businesses, a substantial portion of the intangible asset value we acquire is the specialized know-how of the workforce, which is treated as part of goodwill and is not valued separately. A significant portion of the identifiable intangible assets acquired is derived from customer relationships, including the related customer contracts, as well as trade names. One of the primary drivers in executing our acquisition strategy is the existence of, or the ability to, expand our existing client relationships. The expected benefits of our acquisitions are typically shared across multiple agencies and regions.\nF-16\n6. \nGoodwill and Intangible Assets\nChange in goodwill:\nDecember 31,\n2024\n2023\nJanuary 1\n$\n10,082.3\n \n$\n9,734.3\n \nAcquisitions\n761.2\n \n51.7\n \nNoncontrolling interests in acquired businesses\n22.8\n \n128.6\n \nContingent purchase price obligations of acquired businesses\n—\n \n159.7\n \nDispositions\n(\n6.0\n)\n(\n120.6\n)\nForeign currency translation\n(\n182.9\n)\n128.6\n \nDecember 31\n$\n10,677.4\n \n$\n10,082.3\n \nThe increase in goodwill in 2024 is primarily attributable to the acquisition of Flywheel Digital. There were \nno\n goodwill impairment losses recorded in 2024 or 2023, and there are \nno\n accumulated goodwill impairment losses.\nIntangible assets:  \nDecember 31,\n \n2024\n2023\nGross\nCarrying\nValue\nAccumulated\nAmortization\nNet\nCarrying\nValue\nGross\nCarrying\nValue\nAccumulated\nAmortization\nNet\nCarrying\nValue\nAcquired intangible assets and internally\n   developed strategic platform assets\n$\n1,096.1\n \n$\n(\n606.1\n)\n$\n490.0\n \n$\n902.6\n \n$\n(\n572.9\n)\n$\n329.7\n \nOther purchased and internally\n   developed software\n258.3\n \n(\n226.3\n)\n32.0\n \n327.9\n \n(\n290.7\n)\n37.2\n \nIntangible Assets\n$\n1,354.4\n \n$\n(\n832.4\n)\n$\n522.0\n \n$\n1,230.5\n \n$\n(\n863.6\n)\n$\n366.9\n \nThe increase in the gross carrying value of acquired intangible assets was primarily related to the $\n182.6\n million of combined customer relationships, intellectual property and trade name for Flywheel Digital. \nAmortization of intangible assets:\nYear Ended December 31,\n2024\n2023\n2022\nAcquired intangible assets and internally developed\n   strategic platform assets\n$\n87.5\n \n$\n61.8\n \n$\n58.8\n \nOther purchased and internally developed software\n18.1\n \n18.5\n \n21.5\n \nAmortization Expense\n$\n105.6\n \n$\n80.3\n \n$\n80.3\n \n7. \nDebt\nCredit Facilities\nOur $\n2.5\n billion unsecured multi-currency revolving credit facility, or Credit Facility, terminates on \nJune 2, 2028\n. We can issue up to $\n2\n billion of U.S. Dollar denominated commercial paper, and issue up to the equivalent of $\n500\n million in British Pounds or Euro under a Euro commercial paper program. In addition, certain of our international subsidiaries have uncommitted credit lines that are guaranteed by Omnicom aggregating $\n517.4\n million. All of these facilities provide additional liquidity sources for operating capital and general corporate purposes. During 2024, we did not issue commercial paper. In 2023, we had a maximum of $\n200\n million of commercial paper outstanding during the year, the average amount outstanding was $\n5.1\n million, the average days outstanding were 1.7 days, and the weighted average interest rate was \n5.24\n%. At December 31, 2024, there were \nno\n outstanding borrowings under the Credit Facility and \nno\n outstanding commercial paper issuances. \nThe Credit Facility has a financial covenant that requires us to maintain a Leverage Ratio of consolidated indebtedness to consolidated EBITDA (earnings before interest, taxes, depreciation, amortization and non-cash charges) of no more than 3.5 times for the most recently ended 12-month period.\n \nAt December 31, 2024, we were in compliance with this covenant as our Leverage Ratio was 2.4 times.\n The Credit Facility does not limit our ability to declare or pay dividends or repurchase our common stock.\nThe $\n600\n million Delayed Draw Term Loan Agreement automatically terminated on \nJuly 15, 2024\n.\nShort-Term Debt\nShort-term debt of $\n21.3\n million and $\n10.9\n million at December 31, 2024 and 2023, respectively, represented bank overdrafts and short-term borrowings primarily of our international subsidiaries. The weighted average interest rate was \n11.4\n% and \n12.0\n%, respectively. Due to the short-term nature of this debt, carrying value approximates fair value.\nF-17\nLong-Term Debt\nDecember 31,\n2024\n2023\n3.65\n% Senior Notes due 2024\n$\n—\n \n$\n750.0\n \n3.60\n% Senior Notes due 2026\n1,400.0\n \n1,400.0\n \n€\n500\n Million \n0.80\n% Senior Notes due 2027\n520.3\n \n553.0\n \n2.45\n% Senior Notes due 2030\n600.0\n \n600.0\n \n4.20\n% Senior Notes due 2030\n600.0\n \n600.0\n \n€\n500\n Million \n1.40\n% Senior Notes due 2031\n520.3\n \n553.0\n \n2.60\n% Senior Notes due 2031\n800.0\n \n800.0\n \n€\n600\n Million  \n3.70\n% Senior Notes due 2032\n624.5\n \n—\n \n£\n325\n Million \n2.25\n% Senior Notes due 2033\n407.9\n \n413.9\n \n5.30\n% Senior Notes due 2034\n600.0\n \n—\n \nLong-Term Debt, Gross\n6,073.0\n \n5,669.9\n \nUnamortized discount\n(\n9.5\n)\n(\n7.8\n)\nUnamortized debt issuance costs\n(\n27.4\n)\n(\n22.3\n)\nUnamortized deferred gain (loss) from settlement of interest rate swaps\n(\n0.8\n)\n(\n0.2\n)\nLong-Term Debt, including current portion\n6,035.3\n \n5,639.6\n \nCurrent portion\n—\n \n(\n750.5\n)\nLong-Term Debt\n$\n6,035.3\n \n$\n4,889.1\n \nOn August 2, 2024, Omnicom issued $\n600\n million \n5.30\n% Senior Notes due 2034. The net proceeds from the issuance after deducting the underwriting discount and offering expenses, were $\n592.4\n million. The net proceeds from the issuance, along with available cash, were used to fund the repayment of our $\n750\n million \n3.65\n% Senior Notes on November 1, 2024.\nOn March 6, 2024, Omnicom Finance Holdings plc, or OFH, a U.K.-based wholly owned subsidiary of Omnicom, issued €\n600\n million \n3.70\n% Senior Notes due 2032. The net proceeds from the issuance, after deducting the underwriting discount and offering expenses, were $\n643.1\n million and were used for general corporate purposes, including working capital expenditures, acquisitions and repurchases of our common stock.\nOur \n2.45\n% Senior Notes due 2030, \n4.20\n% Senior Notes due 2030, \n2.60\n% Senior Notes due 2031 and \n5.30\n% Senior Notes due 2034 are senior unsecured obligations of Omnicom that rank equal in right of payment with all existing and future unsecured senior indebtedness.\nOmnicom and its wholly owned finance subsidiary, Omnicom Capital Inc., or OCI, are co-obligors under the \n3.60\n% Senior Notes due 2026. These notes are a joint and several liability of Omnicom and OCI, and Omnicom unconditionally guarantees OCI’s obligations with respect to the notes. OCI provides funding for our operations by incurring debt and lending the proceeds to our operating subsidiaries. OCI’s assets primarily consist of cash and cash equivalents and intercompany loans made to our operating subsidiaries, and the related interest receivable. There are no restrictions on the ability of OCI or Omnicom to obtain funds from our subsidiaries through dividends, loans or advances. Such notes are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness.\nOmnicom and OCI have, jointly and severally, fully and unconditionally guaranteed the obligations of OFH with respect to the €\n500\n million \n0.80\n% Senior Notes due 2027 and the €\n500\n million \n1.40\n% Senior Notes due 2031, and Omnicom has fully and unconditionally guaranteed the obligations of OFH with respect the €\n600\n million \n3.70\n% Senior Notes due 2032, collectively the Euro Notes. OFH’s assets consist of its investments in several wholly owned finance companies that function as treasury centers, providing funding for various operating companies in Europe, Australia and other countries in the Asia-Pacific region. The finance companies’ assets consist of cash and cash equivalents and intercompany loans that they make or have made to the operating companies in their respective regions and the related interest receivable. There are no restrictions on the ability of Omnicom, OCI or OFH to obtain funds from their subsidiaries through dividends, loans or advances. The Euro Notes and the related guarantees are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness of OFH and each of Omnicom and OCI, as applicable.\nOmnicom has fully and unconditionally guaranteed the obligations of Omnicom Capital Holdings plc, or OCH, a U.K.-based wholly owned subsidiary of Omnicom, with respect to the £\n325\n million \n2.25\n% Senior Notes due 2033, or Sterling Notes. OCH’s assets consist of its investments in several wholly owned finance companies that function as treasury centers, providing funding for various operating companies in EMEA, Australia and other countries in the Asia-Pacific region. The finance companies’ assets consist of cash and cash equivalents and intercompany loans that they make or have made to the operating companies in their respective regions and the related interest receivable. There are no restrictions on the ability of Omnicom or OCH to obtain funds \nF-18\nfrom their subsidiaries through dividends, loans or advances. The Sterling Notes and the related guarantee are senior unsecured obligations that rank equal in right of payment with all existing and future unsecured senior indebtedness of OCH and Omnicom, respectively.\nLong-term debt maturities at December 31, 2024:\n2025\n$\n—\n \n2026\n1,400.0\n \n2027\n520.3\n \n2028\n—\n \n2029\n—\n \nThereafter\n4,152.7\n \nLong-Term Debt, Gross\n$\n6,073.0\n \nInterest Expense\nYear Ended December 31,\n2024\n2023\n2022\nLong-term debt\n$\n194.9\n \n$\n165.1\n \n$\n164.7\n \nFees\n4.4\n \n4.8\n \n4.6\n \nPension and other interest\n50.3\n \n50.5\n \n35.8\n \nInterest rate and cross currency swaps\n(\n1.7\n)\n(\n1.9\n)\n3.5\n \nInterest Expense\n$\n247.9\n \n$\n218.5\n \n$\n208.6\n \n8. \nSegment Reporting\n Our branded agency networks operate in the advertising, marketing and corporate communications services industry, and are organized into agency networks, virtual client networks, regional reporting units and operating groups or practice areas. Our networks, virtual client networks and agencies increasingly share clients and provide clients with integrated services. The main economic components of each agency are employee compensation and related costs, direct service costs and occupancy and other costs which include rent and occupancy costs, technology costs and overhead expenses. Therefore, given these similarities, we aggregate our six operating segments, which are our agency networks, into one reporting segment. The chief operating decision maker, or CODM, reviews segment operating income for each network and allocates resources accordingly. The CODM includes Omnicom’s chief executive officer, chief financial officer and chief operating officer.\n Segment operating results include allocations of costs, including information technology, and other shared services costs, that are allocated using metrics designed to correlate the allocation with consumption.\nSegment revenue, segment operating expenses and segment operating income of our operating segments:\nYear Ended December 31,\n2024\n2023\n2022\nRevenue\n$\n15,689.1\n \n$\n14,692.2\n \n$\n14,289.1\nSegment Operating Expenses:\nSalary and service costs:\nSalary and related costs\n$\n7,441.4\n \n$\n7,212.8\n \n$\n7,197.9\nThird-party service costs\n3,348.6\n \n2,917.9\n \n2,585.5\nThird-party incidental costs\n642.5\n \n570.5\n \n542.5\nTotal salary and service costs\n11,432.5\n \n10,701.2\n \n10,325.9\nOccupancy and other costs\n1,274.4\n \n1,168.8\n \n1,168.6\n   Segment cost of services\n12,706.9\n \n11,870.0\n \n11,494.5\nSelling, general and administrative expenses\n408.1\n \n393.7\n \n378.5\nDepreciation and amortization\n241.7\n \n211.1\n \n219.4\nTotal segment operating expenses\n13,356.7\n \n12,474.8\n \n12,092.4\nSegment Operating Income\n$\n2,332.4\n \n$\n2,217.4\n \n$\n2,196.7\nF-19\nReconciliation of segment operating income to operating income and income before income taxes and income from equity method investments:\nYear Ended December 31,\n2024\n2023\n2022\nSegment Operating Income\n$\n2,332.4\n \n$\n2,217.4\n \n$\n2,196.7\n \nReal estate and other repositioning costs\n57.8\n \n191.5\n \n—\n \nChanges arising from the effects of the war in Ukraine\n—\n \n—\n \n113.4\n \nGain on disposition of subsidiary\n—\n \n(\n78.8\n)\n—\n \nOperating Income\n$\n2,274.6\n \n$\n2,104.7\n \n$\n2,083.3\n \nInterest Expense\n247.9\n \n218.5\n \n208.6\n \nInterest Income\n100.9\n \n106.7\n \n70.7\n \nIncome Before Income Taxes and Income From Equity Method Investments\n$\n2,127.6\n \n$\n1,992.9\n \n$\n1,945.4\n \nWe reconcile segment operating income to income before income taxes and income from equity method investments as income tax expense is reviewed at the consolidated level and the segment managers are not held accountable for performance of net income.\nThe agency networks' regional reporting units comprise three principal regions: the Americas, EMEA and Asia-Pacific. The regional reporting units monitor the performance and are responsible for the agencies in their region. Agencies within the regional reporting units serve similar clients in similar industries and in many cases the same clients and have similar economic characteristics.\nRevenue and long-lived assets and goodwill by geographic region:\nAmericas\nEMEA\nAsia-Pacific\nDecember 31, 2024\nRevenue\n$\n9,083.9\n \n$\n4,758.2\n \n$\n1,847.0\n \nLong-lived assets and goodwill\n8,166.6\n \n3,693.9\n \n685.2\n \nDecember 31, 2023\nRevenue\n$\n8,337.8\n \n$\n4,576.5\n \n$\n1,777.9\n \nLong-lived assets and goodwill\n7,749.5\n \n3,523.3\n \n730.8\n \nDecember 31, 2022\nRevenue\n$\n8,185.0\n \n$\n4,357.2\n \n$\n1,746.9\n \nLong-lived assets and goodwill\n7,727.0\n \n3,315.2\n \n757.2\n \n9. \nEquity Method Investments\nIncome from our equity method investments was $\n6.9\n million in 2024 and $\n5.2\n million in each of 2023 and 2022. At December 31, 2024 and 2023, our proportionate share in the net assets of the equity method investments was $\n12.7\n million and $\n17.0\n million, respectively. Equity method investments are not material to our results of operations or financial condition; therefore, summarized financial information is not required to be presented.\n10. \nShare-Based Compensation Plans\nShare-based incentive awards are granted to employees under the 2021 Incentive Award Plan, or the 2021 Plan, that was approved by the shareholders. The 2021 Plan is administered by the Compensation Committee of the Board of Directors, or the Compensation Committee. Awards include stock options, restricted stock and other performance-based stock awards. The maximum number of shares of common stock that can be granted under the 2021 Plan is \n14.7\n million shares plus any shares awarded under the 2021 Plan and any prior plan that have been forfeited or have expired. All awards reduce the number of shares available for grant on a one-for-one basis. The terms of each award and the exercise date are determined by the Compensation Committee. The 2021 Plan does not permit the holder of an award to elect cash settlement under any circumstances. At December 31, 2024, there were \n7,781,173\n shares available for grant under the 2021 Plan.\nShare-based compensation expense in 2024, 2023 and 2022 was $\n91.4\n million, $\n84.8\n million and $\n81.7\n million, respectively. At December 31, 2024, unamortized share-based compensation that will be expensed over the next \nfive\n years is $\n222.8\n million.\nWe recognize a tax benefit in income tax expense and record a deferred tax asset for the share-based compensation expense recognized for financial reporting purposes that has not been deducted on our income tax return. Excess tax benefits and deficiencies represent the difference between the actual compensation deduction for tax purposes, which is calculated as the difference between the grant date price of the award, and the price of our common stock on the vesting or exercise date. Upon vesting of restricted stock awards or exercise of stock options, any excess tax benefit or deficiency related to share-based compensation is recorded in results of operations, as a component of income tax expense. In 2024 and 2023, we recognized a tax benefit of $\n12.3\n million and $\n6.7\n million, respectively.\nF-20\nStock Options\nThe exercise price of stock option awards cannot be less than 100% of the market price of our common stock on the grant date and have a maximum contractual life of 10 years.\nStock option activity:\nYear Ended December 31,\n2024\n2023\n2022\nShares\nWeighted Average Exercise Price\nShares\nWeighted Average Exercise Price\nShares\nWeighted Average Exercise Price\nJanuary 1\n4,564,575\n \n$\n71.81\n5,127,625\n \n$\n72.90\n4,689,250\n \n$\n74.30\nGranted\n—\n \n—\n \n853,875\n \n68.88\n \nExercised\n(\n1,297,238\n)\n72.47\n(\n413,750\n)\n84.94\n(\n157,500\n)\n84.94\n \nForfeited\n(\n182,050\n)\n69.80\n(\n149,300\n)\n72.99\n(\n258,000\n)\n77.69\n \nDecember 31\n3,085,287\n \n$\n71.65\n4,564,575\n \n$\n71.81\n5,127,625\n \n$\n72.90\nExercisable December 31\n2,302,762\n \n$\n72.47\n—\n \n423,750\n \n$\n84.94\nOptions outstanding and exercisable:\nDecember 31, 2024\nOptions Outstanding\nOptions Exercisable\nExercise Price Range\nShares\nWeighted Average Remaining Contractual Life\nWeighted Average\nExercise Price\nShares\nWeighted Average\nExercise Price\n$\n69.00\nto\n$\n70.00\n782,525\n \n7.6\n years\n$\n69.23\n—\n \n$\n72.00\nto\n$\n73.00\n2,302,762\n \n6.9\n years\n72.47\n2,302,762\n \n$\n72.47\n3,085,287\n$\n71.65\n2,302,762\n \n$\n72.47\nThe grant date fair value of $\n12.60\n for the 2022 option awards was determined using the Black-Scholes option valuation model. The assumptions, without adjusting for forfeitures and lack of liquidity, were: an expected life ranging from \n6.5\n years to \n7.5\n years, risk free interest rate ranging from \n3.0\n% to \n3.1\n%, expected volatility ranging from \n24.5\n% to \n24.7\n%, and dividend yield ranging from \n4.2\n% to \n4.5\n%.\nRestricted Stock\nRestricted stock activity:\nYear Ended December 31,\n2024\n2023\n2022\nJanuary 1\n2,802,297\n \n3,010,343\n \n2,932,836\n \nGranted\n1,459,525\n \n1,010,575\n \n1,147,496\n \nVested\n(\n878,247\n)\n(\n915,245\n)\n(\n889,736\n)\nForfeited\n(\n232,061\n)\n(\n303,376\n)\n(\n180,253\n)\nDecember 31\n3,151,514\n \n2,802,297\n \n3,010,343\n \nWeighted average grant date fair value of shares granted in the period\n$\n81.39\n$\n84.33\n$\n59.02\nWeighted average grant date fair value at December 31\n$\n71.59\n$\n64.84\n$\n61.11\nGenerally, restricted shares vest ratably over five years from the grant date provided the employee remains employed by us.\n Restricted shares do not pay a dividend, and may not be sold, transferred, pledged or otherwise encumbered until the forfeiture restrictions lapse. Under most circumstances, the employee forfeits the shares if employment ceases prior to the end of the restriction period.\nPerformance Restricted Stock Units\nThe Compensation Committee grants certain employees performance restricted stock units, or PRSU. \nEach PRSU represents the right to receive one share of common stock on vesting. The ultimate number of PRSUs received by the employee depends on the Company's average return on equity over a three-year period compared to the average return on equity of a peer group of principal competitors over the same period. The PRSUs vest three years from the grant date.\n The PRSUs have a service and performance vesting condition and compensation expense is recognized on a graded-vesting basis. Over the performance period, compensation expense is adjusted upward or downward based on our estimate of the probability of achieving the performance target for the portion of the awards subject to the performance vesting condition. We have assumed that all PRSUs will vest.\nF-21\nPRSU activity:\nYear Ended December 31,\n2024\n2023\n2022\nShares\nWeighted Average Grant Date Fair Value\nShares\nWeighted Average Grant Date Fair Value\nShares\nWeighted Average Grant Date Fair Value\nJanuary 1\n563,036\n \n$\n81.11\n570,235\n \n$\n71.19\n533,890\n \n$\n70.42\nGranted\n177,059\n \n93.19\n \n178,998\n \n92.18\n \n218,127\n \n76.79\n \nDistributed\n(\n165,911\n)\n74.89\n \n(\n186,197\n)\n61.36\n \n(\n181,782\n)\n75.64\n \nDecember 31\n574,184\n \n$\n86.63\n563,036\n \n$\n81.11\n570,235\n \n$\n71.19\nEmployee Stock Purchase Plan\nThe employee stock purchase plan, or ESPP, enables employees to purchase our common stock through payroll deductions over each plan quarter at \n95\n% of the market price on the last trading day of the plan quarter. Purchases are limited to \n10\n% of eligible compensation as defined by the Employee Retirement Income Security Act of 1974, or ERISA. In 2024, 2023 and 2022, employees purchased \n56,473\n shares, \n65,644\n shares and \n72,672\n shares, respectively. All shares purchased were issued from treasury stock, for which we received $\n5.1\n million, $\n5.3\n million and $\n5.2\n million, respectively. At December 31, 2024, there were \n8,174,023\n shares available under the ESPP.\n11. \nIncome Taxes \nIncome before income taxes:\nYear Ended December 31,\n2024\n2023\n2022\nDomestic\n$\n940.0\n \n$\n696.0\n \n$\n789.3\n \nInternational\n1,187.6\n \n1,296.9\n \n1,156.1\n \nIncome Before Income Taxes\n$\n2,127.6\n \n$\n1,992.9\n \n$\n1,945.4\n \nIncome tax expense (benefit):\nYear Ended December 31,\n2024\n2023\n2022\nCurrent:\n \n \n \nU.S. federal\n$\n183.8\n \n$\n154.2\n \n$\n180.1\n \nU.S. state and local\n46.6\n \n34.8\n \n57.0\n \nInternational\n309.9\n \n330.8\n \n287.4\n \n \n540.3\n \n519.8\n \n524.5\n \nDeferred:\n \n \n \nU.S. federal\n17.5\n \n10.9\n \n11.1\n \nU.S. state and local\n1.3\n \n1.3\n \n(\n0.3\n)\nInternational\n1.4\n \n(\n7.1\n)\n11.5\n \n \n20.2\n \n5.1\n \n22.3\n \nIncome Tax Expense\n$\n560.5\n \n$\n524.9\n \n$\n546.8\n \nReconciliation from the statutory U.S. federal income tax rate to effective tax rate:\nYear Ended December 31,\n2024\n2023\n2022\nStatutory U.S. federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nU.S. state and local income taxes, net of U.S. federal income tax benefit\n1.7\n \n1.4\n \n2.3\n \nImpact of foreign operations\n3.8\n \n3.9\n \n3.5\n \nOther, including impact of war in Ukraine\n(\n0.2\n)\n—\n \n1.3\n \nEffective tax rate\n26.3\n \n%\n26.3\n \n%\n28.1\n \n%\nF-22\nOur effective tax rate for 2024 remained flat year-over-year at \n26.3\n%. The effective tax rate for 2024 was favorably impacted by the windfall tax benefit on share-based compensation. The effective tax rate for 2023 includes an increase of approximately $\n10.7\n million in income tax expense related to a lower tax benefit in certain jurisdictions for the real estate and other repositioning costs in the period and an increase in the U.K. statutory tax rate, partially offset by approximately $\n10.0\n million of favorable impacts from the resolution of certain non-U.S. tax positions.\nNumerous foreign jurisdictions have enacted or are in the process of enacting legislation to adopt a minimum effective tax rate described in the Global Anti-Base Erosion, or Pillar Two, model rules issued by the Organization for Economic Co-operation and Development. A minimum effective tax rate of 15% would apply to multinational companies with consolidated revenue above €750 million.\nUnder the Pillar Two rules, a company would be required to determine a combined effective tax rate for all entities located in a jurisdiction. If the jurisdictional effective tax rate determined under the Pillar Two is less than 15%, a top-up tax will be due to bring the jurisdictional effective tax rate up to 15%. We are continuing to monitor the pending implementation of Pillar Two by individual countries and the potential effects of Pillar Two on our business. The provisions effective in 2024 did not have a materially adverse impact on our results of operations, financial condition or cash flows.\nThe Tax Cuts and Jobs Act of 2017, or the Tax Act, imposed a one-time tax, the transition tax, on the accumulated earnings of foreign subsidiaries. At December 31, 2024 and 2023, the remaining transition tax liability was $\n41.2\n million and $\n68.9\n million, respectively. The transition tax is expected to be fully paid by 2026. The Tax Act also implemented a territorial tax system that allows us to repatriate earnings of our foreign subsidiaries without incurring additional U.S. tax by providing a 100% dividend exemption. While a territorial tax system limits U.S. federal income tax to domestic source income, foreign source income is subject to tax in the appropriate foreign jurisdiction at the local rate, which in certain jurisdictions may be higher than the U.S. federal statutory income tax rate of 21%. Therefore, the foreign tax rate differential will cause our effective tax rate to be higher than the U.S. federal statutory income tax rate. The international tax rate differentials in 2024 and 2023 are primarily attributed to our earnings in Germany, Australia, Italy, Japan and Brazil being taxed at higher rates than the U.S. statutory tax rate.\nWe have elected to account for any tax on the global intangible low-taxed income, or GILTI, in the period in which it is incurred. We provided $\n5.5\n million and $\n17.0\n million in 2024 and 2023, respectively, for tax impact of GILTI.\nDeferred tax assets and liabilities and balance sheet classification:\nDecember 31,\n2024\n2023\nDeferred tax assets:\n \n \nCompensation\n$\n136.1\n \n$\n153.8\n \nTax loss and credit carryforwards\n78.2\n \n78.6\n \nBasis differences from acquisitions\n53.2\n \n41.2\n \nBasis differences from short-term assets and liabilities\n27.6\n \n33.3\n \nCapitalized research and development expenditures\n106.8\n \n64.8\n \nDeferred tax assets\n401.9\n \n371.7\n \nValuation allowance\n(\n17.0\n)\n(\n18.9\n)\nDeferred tax assets, net\n$\n384.9\n \n$\n352.8\n \nDeferred tax liabilities:\n \n \nGoodwill and intangible assets\n$\n707.5\n \n$\n687.3\n \nUnremitted foreign earnings\n44.1\n \n71.1\n \nBasis differences from investments\n5.2\n \n3.8\n \nFinancial instruments\n—\n \n0.9\n \nOther\n44.4\n \n45.3\n \nDeferred tax liabilities\n$\n801.2\n \n$\n808.4\n \nLong-term deferred tax assets\n$\n75.5\n \n$\n73.5\n \nLong-term deferred tax liabilities\n$\n491.8\n \n$\n529.1\n \nWe have concluded that it is more likely than not that we will be able to realize our net deferred tax assets in future periods because results of future operations are expected to generate sufficient taxable income. At December 31, 2024 and 2023, the valuation allowance of $\n17.0\n million and $\n18.9\n million, respectively, relates to tax losses and tax credit carryforwards in the U.S. and in international jurisdictions. Tax loss and credit carryforwards for which there is no valuation allowance are available for periods ranging from 2025 to 2044, which is longer than the forecasted utilization of such carryforwards.\nF-23\nReconciliation of unrecognized tax benefits:\nDecember 31,\n2024\n2023\nJanuary 1\n$\n167.8\n \n$\n167.6\n \nAdditions:\n \n \nCurrent year tax positions\n15.7\n \n3.3\n \nPrior year tax positions\n4.4\n \n4.3\n \nReduction of prior year tax positions\n(\n2.5\n)\n(\n7.9\n)\nSettlements\n(\n2.6\n)\n—\n \nForeign currency translation\n(\n1.3\n)\n0.5\n \nDecember 31\n$\n181.5\n \n$\n167.8\n \nSubstantially all the liability for uncertain tax positions is recorded in long-term liabilities. At December 31, 2024 and 2023, approximately $\n175.1\n million and $\n161.7\n million, respectively, of the liability for uncertain tax positions would affect our effective tax rate upon resolution of the uncertain tax positions.\nIncome tax expense in 2024, 2023 and 2022 includes $\n4.4\n million, $\n3.2\n million and $\n4.3\n million, respectively, of interest, net of tax benefit, and penalties related to tax positions taken on our tax returns. At December 31, 2024 and 2023, accrued interest and penalties were $\n23.5\n million and $\n19.9\n million, respectively.\nWe file a consolidated U.S. federal income tax return and income tax returns in various state and local jurisdictions. Our subsidiaries file tax returns in various foreign jurisdictions. Our principal foreign jurisdictions include the U.K., France and Germany. The Internal Revenue Service has completed its examination of our U.S. federal tax returns through 2017. Tax returns in the U.K., France and Germany have been examined through 2021, 2019 and 2017, respectively.\n12. \nPension and Other Postemployment Benefits\nDefined Contribution Plans\nOur domestic and international subsidiaries provide retirement benefits for their employees primarily through defined contribution profit sharing and savings plans. Contributions to the plans vary by subsidiary and have generally been in amounts up to the maximum percentage of total eligible compensation of participating employees that is deductible for income tax purposes. Contribution expense was $\n87.9\n million, $\n127.9\n million and $\n123.2\n million in 2024, 2023 and 2022, respectively.\nDefined Benefit Pension Plans\nTwo of our U.S. businesses and several of our non-U.S. businesses sponsor noncontributory defined benefit pension plans. These plans provide benefits to employees based on formulas recognizing length of service and earnings. The U.S. plans are subject to ERISA and cover approximately 700 participants. These plans are closed to new participants and do not accrue future benefit credits. The non-U.S. plans, which include statutory plans, are not subject to ERISA and cover approximately 12,000 participants.\nWe have a Senior Executive Restrictive Covenant and Retention Plan, or Senior Executive Retention Plan, for certain executive officers and senior executives selected by the Compensation Committee. In 2024, we adopted a Key Executive Restrictive Covenant and Retention Plan, or Key Executive Retention Plan, for certain key employees who are not executive officers selected by the Compensation Committee. These plans are non-qualified deferred compensation severance plans that are not subject to ERISA. These plans were adopted to secure non-competition, non-solicitation, non-disparagement and ongoing consulting services from such individuals and to strengthen the retention aspect of executive officer, senior executive or key executive compensation. \nThe Senior Executive Retention Plan provides annual payments to the participants or to their beneficiaries upon termination following at least seven years of service with Omnicom or its subsidiaries. A participant’s annual benefit is payable for 15 consecutive calendar years following termination, but in no event prior to age 55. The annual benefit is generally equal to the lesser of (i) the participant’s final average pay times an applicable percentage, which is based upon the executive’s years of service as an executive officer, not to exceed 35% or (ii) $1.5 million adjusted for cost-of-living, not to exceed 2.5% per year. The Senior Executive Retention Plan is not funded, and benefits are paid when due.\nThe Key Executive Retention Plan provides annual payments to the participants or to their beneficiaries upon termination following at least six years of service from the date of the participant’s award agreement with Omnicom or its subsidiaries. A participant’s annual benefit is payable for 12 consecutive calendar years following termination, but in no event prior to age 55. The annual benefit is equal to the lesser of (i) the participant’s final average pay times an applicable percentage, which is based upon the employee’s years of service, not to exceed 65% or (ii) $1.0 million. The annual benefit vests 100% after six years of service from the date of the award agreement. The Key Executive Retention Plan is not funded, and benefits are paid when due.\nF-24\nPostemployment Arrangements\nWe have executive retirement agreements under which benefits will be paid to participants or to their beneficiaries over periods up to ten years beginning after cessation of full-time employment. Our postemployment arrangements are unfunded and benefits are paid when due. \nPension and other postemployment benefits net periodic benefit expense:\nDefined Benefit Pension Plans\nPostemployment Arrangements\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n1.6\n \n$\n2.4\n \n$\n2.8\n \n$\n2.9\n \n$\n3.4\n \n$\n4.5\n \nInterest cost\n8.5\n \n11.1\n \n5.6\n \n5.9\n \n5.7\n \n2.6\n \nExpected return on plan assets\n(\n2.2\n)\n(\n0.3\n)\n(\n1.4\n)\n—\n \n—\n \n—\n \nAmortization of prior service cost\n0.4\n \n0.3\n \n0.4\n \n4.4\n \n3.8\n \n3.8\n \nAmortization of actuarial loss\n0.8\n \n0.7\n \n4.0\n \n0.2\n \n—\n \n2.5\n \nNet Periodic Benefit Expense\n$\n9.1\n \n$\n14.2\n \n$\n11.4\n \n$\n13.4\n \n$\n12.9\n \n$\n13.4\n \nIncluded in AOCI for Defined Benefit Pension Plans at December 31, 2024 and 2023 were unrecognized costs for actuarial gains and losses and prior service cost of $\n6.5\n million ($\n4.5\n million net of income taxes) and $\n15.9\n million ($\n11.0\n million net of income taxes), respectively, that have not yet been recognized in net periodic benefit cost. The unrecognized costs for actuarial gains and losses and prior service cost included in AOCI and expected to be recognized in net periodic benefit cost in 2025 is a benefit of $\n0.4\n million.\nIncluded in AOCI for Postemployment Arrangements at December 31, 2024 and 2023 were unrecognized costs for actuarial gains and losses and prior service cost of $\n25.3\n million ($\n17.6\n million net of income taxes) and $\n41.1\n million ($\n28.8\n million net of income taxes), respectively, that have not yet been recognized in the net periodic benefit cost. The unrecognized costs for actuarial gains and losses and prior service cost included in AOCI and expected to be recognized in net periodic benefit cost in 2025 is $\n3.7\n million.\nWeighted average assumptions:\nDefined Benefit Pension Plans\nPostemployment Arrangements\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n4.5\n \n%\n4.7\n \n%\n2.1\n \n%\n4.5\n \n%\n4.7\n \n%\n1.8\n \n%\nCompensation increases\n3.4\n \n%\n2.6\n \n%\n2.6\n \n%\n3.5\n \n%\n3.5\n \n%\n3.5\n \n%\nExpected return on plan assets\n2.2\n \n%\n1.5\n \n%\n1.6\n \n%\nThe expected long-term rate of return for plan assets for the U.S. plans is based on several factors, including current and expected asset allocations, historical and expected returns on various asset classes and current and future market conditions. A total return investment approach using a mix of equities and fixed income investments maximizes the long-term return. This strategy is intended to minimize plan expense by achieving long-term returns in excess of the growth in plan liabilities over time. The discount rate used to compute net periodic benefit cost is based on yields of available high-quality bonds and reflects the expected cash flow as of the measurement date. The expected returns on plan assets and discount rates for the non-U.S. plans are based on local factors, including each plan’s investment approach, local interest rates and plan participant profiles.\nExperience gains and losses and the effects of changes in actuarial assumptions are generally amortized over a period no longer than the expected average future service of active employees.\nOur funding policy is to contribute amounts sufficient to meet minimum funding requirements in accordance with the applicable employee benefit and tax laws that the plans are subject to, plus such additional amounts as we may determine to be appropriate. In 2024 and 2023, we contributed $\n10.6\n million and $\n8.8\n million, respectively, to the defined benefit pension plans. We do not expect the contributions for 2025 to differ materially from the 2024 contributions.\nF-25\nChange in benefit obligation and fair value of plan assets:\nDefined Benefit Pension Plans\nPostemployment Arrangements\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2024\n2023\nBenefit obligation:\nBenefit obligation, January 1\n$\n224.3\n \n$\n228.6\n \n$\n142.2\n \n$\n130.8\n \nService cost\n1.6\n \n2.4\n \n2.9\n \n3.4\n \nInterest cost\n8.5\n \n11.1\n \n5.9\n \n5.7\n \nAmendments, curtailments and settlements\n16.1\n \n(\n0.4\n)\n(\n0.6\n)\n6.9\n \nActuarial (gain) loss\n(\n23.1\n)\n(\n2.1\n)\n(\n12.4\n)\n6.3\n \nBenefits paid\n(\n11.7\n)\n(\n12.4\n)\n(\n11.4\n)\n(\n10.9\n)\nForeign currency translation\n0.3\n \n(\n2.9\n)\n—\n \n—\n \nBenefit obligation, December 31\n$\n216.0\n \n$\n224.3\n \n$\n126.6\n \n$\n142.2\n \nFair value of plan assets:\nFair value of plan assets, January 1\n$\n45.5\n \n$\n44.0\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n2.0\n \n3.9\n \n—\n \n—\n \nEmployer contributions\n10.6\n \n8.8\n \n—\n \n—\n \nBenefits paid\n(\n11.7\n)\n(\n12.4\n)\n—\n \n—\n \nForeign currency translation and other\n(\n0.5\n)\n1.2\n \n—\n \n—\n \nFair value of plan assets, December 31\n$\n45.9\n \n$\n45.5\n \n$\n—\n \n$\n—\n \nFunded status, December 31\n$\n(\n170.1\n)\n$\n(\n178.8\n)\n$\n(\n126.6\n)\n$\n(\n142.2\n)\nFunded status recognized in the balance sheet:\nOther assets\n$\n1.5\n \n$\n2.1\n \n$\n—\n \n$\n—\n \nOther current liabilities\n(\n10.7\n)\n(\n8.6\n)\n(\n13.5\n)\n(\n11.9\n)\nLong-term liabilities\n(\n160.9\n)\n(\n172.3\n)\n(\n113.1\n)\n(\n130.3\n)\n$\n(\n170.1\n)\n$\n(\n178.8\n)\n$\n(\n126.6\n)\n$\n(\n142.2\n)\nWeighted average assumptions:\nDiscount rate\n5.2\n \n%\n4.6\n \n%\n5.3\n \n%\n4.6\n \n%\nCompensation increases\n2.5\n \n%\n3.5\n \n%\n3.5\n \n%\n3.5\n \n%\nAt December 31, 2024 and 2023, the accumulated benefit obligation for our defined benefit pension plans was $\n169.1\n million and $\n179.5\n million, respectively.\nDefined benefit pension plans with benefit obligations in excess of plan assets:\nYear Ended December 31,\n2024\n2023\nBenefit obligation\n$\n(\n208.3\n)\n$\n(\n215.5\n)\nPlan assets\n36.7\n \n34.7\n \n \n$\n(\n171.6\n)\n$\n(\n180.8\n)\nAt December 31, 2024, the estimated pension and other postemployment benefits expected to be paid over the next 10 years:\nDefined Benefit Pension Plans\nPostemployment Arrangements\n2025\n$\n12.3\n \n$\n13.5\n \n2026\n11.8\n \n12.2\n \n2027\n12.6\n \n13.7\n \n2028\n16.0\n \n13.4\n \n2029\n22.2\n \n12.7\n \n2030 - 2034\n102.0\n \n48.0\n \nF-26\n13. \nReal Estate and Other Repositioning Costs\nIn connection with our strategic initiatives, for the year ended December 31, 2024, operating expenses included $\n57.8\n million ($\n42.9\n million after-tax), primarily reflecting severance actions related to ongoing efficiency initiatives, including strategic agency consolidation in our smaller international markets and the launch of our centralized production strategy. \nIn connection with the transition to a flexible working environment, a hybrid model which allows for partial remote work, we took certain actions in the first quarter of 2023 to reduce and reposition our office lease portfolio. In the second quarter of 2023, as a result of our continuing efforts to increase efficiencies and relevant skill sets to meet client demands, we incurred severance  charges and other exit costs associated with rebalancing our workforce and consolidating operations in certain markets. As a result, for the year ended December 31, 2023, operating expenses included $\n191.5\n million ($\n145.5\n million after-tax), related to non-cash impairment charges for the operating lease right-of-use, or ROU, assets, severance charges, and other exit costs. All severance and other costs were paid during the year ended December 31, 2023. Substantially all of the operating lease payments related to the ROU assets will be paid out through December 31, 2026\n.\n14. \nDispositions of Subsidiaries\nIn April 2023, we disposed of certain research businesses included in our Execution & Support discipline for the net proceeds of $\n180.5\n million. As a result, we recorded a pretax gain of $\n78.8\n million. The disposition did not have a material impact on our ongoing results of operations or financial condition.\n15. \nCharges Arising from the Effects of the War in Ukraine\n In 2022, we disposed of our businesses in Russia. In the first quarter of 2022, we recorded pretax charges of $\n113.4\n million, which included cash charges of $\n47.6\n million and primarily consisted of the loss on the disposition of our net investment in our Russian businesses and included charges related to the suspension of operations in Ukraine. All the charges related to the disposition of our businesses in Russia have been paid as of December 31, 2022, and substantially all of our commitments related to the suspension of operations in Ukraine have been paid\n.\n16. \nSupplemental Cash Flow Data\nChange in operating capital:\nYear Ended December 31,\n2024\n2023\n2022\n(Increase) decrease in accounts receivable\n$\n(\n597.1\n)\n$\n(\n513.9\n)\n$\n(\n129.1\n)\n(Increase) decrease in work in process and other current assets\n(\n316.9\n)\n(\n121.8\n)\n(\n197.9\n)\nIncrease (decrease) in accounts payable\n997.5\n \n602.3\n \n(\n350.1\n)\nIncrease (decrease) in customer advances, taxes payable and other\n     current liabilities\n(\n229.1\n)\n(\n399.6\n)\n(\n97.8\n)\nChange in other assets and liabilities, net\n(\n85.6\n)\n(\n29.9\n)\n(\n69.1\n)\nIncrease (decrease) in operating capital\n$\n(\n231.2\n)\n$\n(\n462.9\n)\n$\n(\n844.0\n)\nSupplemental financial information:\nYear Ended December 31,\n2024\n2023\n2022\nIncome taxes paid\n$\n544.1\n \n$\n474.3\n \n$\n450.3\n \nInterest paid\n$\n156.4\n \n$\n162.8\n \n$\n173.9\n \nNon-cash increase in lease liabilities:\nYear Ended December 31,\n2024\n2023\nOperating leases\n$\n231.1\n \n$\n206.9\n \nFinance leases\n$\n47.1\n \n$\n48.2\n \n17. \nNoncontrolling Interests\nChanges in the ownership interests in our less than 100% owned subsidiaries:\nYear Ended December 31,\n2024\n2023\n2022\nNet income attributed to Omnicom Group Inc.\n$\n1,480.6\n \n$\n1,391.4\n \n$\n1,316.5\n \nNet transfers (to) from noncontrolling interests\n(\n10.0\n)\n(\n88.1\n)\n(\n17.1\n)\nChange from net income attributed to Omnicom Group Inc. and\n       transfers (to) from noncontrolling interests\n$\n1,470.6\n \n$\n1,303.3\n \n$\n1,299.4\n \nF-27\n18. \nLeases and Property and Equipment\nLeases\nYear Ended December 31,\n2024\n2023\n    Operating lease cost:\nOperating lease cost\n$\n209.6\n \n$\n216.2\n \nVariable lease cost\n16.5\n \n29.9\n \nShort-term lease cost\n3.9\n \n2.5\n \nSublease income\n(\n0.9\n)\n(\n3.7\n)\nTotal Operating Lease Cost\n$\n229.1\n \n$\n244.9\n \n     Finance lease cost:\nDepreciation of ROU assets\n$\n58.9\n \n$\n58.9\n \nInterest\n8.3\n \n7.4\n \nTotal Finance Lease Cost\n$\n67.2\n \n$\n66.3\n \nTotal Lease Cost\n$\n296.3\n \n$\n311.2\n \nFuture lease payments:\nDecember 31\nOperating Leases\nFinance Leases\n2025\n$\n238.5\n \n$\n55.7\n \n2026\n208.8\n \n37.1\n \n2027\n162.7\n \n22.2\n \n2028\n127.7\n \n9.1\n \n2029\n98.2\n \n3.5\n \nThereafter\n449.2\n \n2.2\n \nTotal lease payments\n1,285.1\n \n129.8\n \nLess: Interest\n266.4\n \n8.1\n \nPresent Value of Lease Liabilities\n$\n1,018.7\n \n$\n121.7\n \nBalance sheet classification of operating leases:\nDecember 31,\n2024\n2023\nOperating Lease ROU Assets\n$\n1,043.6\n \n$\n1,046.4\n \n     Operating lease liability:\nOther current liabilities\n$\n204.5\n \n$\n217.3\n \nLong-term liability - operating leases\n814.2\n \n853.0\n \nTotal Operating Lease Liability\n$\n1,018.7\n \n$\n1,070.3\n \nAt December 31, 2024 and 2023, office space and equipment operating leases had a weighted average remaining lease term of \n6.2\n and \n6.4\n years, respectively, and a weighted average discount rate of \n3.9\n% and \n3.7\n%, respectively.\nProperty and Equipment\nProperty and equipment:\nDecember 31,\n2024\n2023\nProperty and equipment - owned\n$\n1,520.3\n \n$\n1,620.9\n \nEquipment under finance leases\n401.3\n \n404.4\nProperty and Equipment, Gross\n1,921.6\n \n2,025.3\n \nAccumulated depreciation\n(\n1,096.9\n)\n(\n1,150.4\n)\nProperty and Equipment, Net\n$\n824.7\n \n$\n874.9\n \n \nAt December 31, 2024 and 2023, finance leases had a weighted average remaining lease term of \n2.6\n years and \n2.9\n years, respectively, and a weighted average discount rate of \n7.3\n% and \n6.6\n%, respectively.\nF-28\n19. \nTemporary Equity - Redeemable Noncontrolling Interests\nOwners of noncontrolling equity interests in certain of our subsidiaries have the right in certain circumstances to require us to purchase all or a portion of their equity interest at fair value as defined in the applicable agreements. In most cases we have a protective call right under similar terms. Assuming that the subsidiaries perform at their current and projected profit levels, at December 31, 2024, the aggregate estimated amount we could be required to pay in future periods is $\n429.0\n million, of which $\n179.6\n million is currently exercisable by the holders. If these rights are exercised, there would be an increase in net income attributable to Omnicom as a result of our increased ownership interest and the reduction of net income attributable to noncontrolling interests. The ultimate amount paid could be significantly different because the redemption amount depends on the future results of operations of the subject businesses, the timing of the exercise of these rights and changes in foreign currency exchange rates. Upon redemption, the difference between the estimated redemption value and the actual amount paid is recorded in additional paid-in capital.\n20. \nCommitments and Contingent Liabilities\nIn the ordinary course of business, we are involved in various legal proceedings. We do not expect that such proceedings will have a material adverse effect on our business, results of operations or financial condition.\n21. \nAccumulated Other Comprehensive Income (Loss)\nChanges in AOCI, net of income taxes:\nCash\nFlow\nHedge\n Pension and Other Postemployment Benefits\nForeign Currency Translation\nTotal\nJanuary 1, 2023\n$\n(\n12.1\n)\n$\n(\n41.3\n)\n$\n(\n1,384.5\n)\n$\n(\n1,437.9\n)\nOther comprehensive income (loss) before reclassifications\n—\n \n(\n4.8\n)\n97.7\n \n92.9\n \nReclassification from accumulated other comprehensive income (loss)\n4.0\n \n3.4\n \n—\n \n7.4\n \nDecember 31, 2023\n(\n8.1\n)\n(\n42.7\n)\n(\n1,286.8\n)\n(\n1,337.6\n)\nOther comprehensive income (loss) before reclassifications\n—\n \n13.1\n \n(\n158.6\n)\n(\n145.5\n)\nReclassification from accumulated other comprehensive income (loss)\n3.1\n \n4.1\n \n—\n \n7.2\n \nDecember 31, 2024\n$\n(\n5.0\n)\n$\n(\n25.5\n)\n$\n(\n1,445.4\n)\n$\n(\n1,475.9\n)\n,\n22. \nFair Value\nFinancial assets and liabilities measured at fair value on a recurring basis:\nDecember 31, 2024\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\n \n \n \n \nCash and cash equivalents\n$\n4,339.4\n \n \n$\n4,339.4\n \nMarketable equity securities\n0.9\n \n0.9\n \nCross currency swaps - net investment hedge\n$\n9.3\n \n9.3\n \nLiabilities:\n \n \n \nForeign currency derivatives\n$\n0.1\n \n$\n0.1\n \nContingent purchase price obligations\n$\n220.1\n \n220.1\n \nDecember 31, 2023\nAssets:\nCash and cash equivalents\n$\n4,432.0\n \n \n$\n4,432.0\n \nMarketable equity securities\n0.9\n \n \n0.9\n \nLiabilities:\n \nCross currency swaps - net investment hedge\n$\n6.6\n \n$\n6.6\n \nContingent purchase price obligations\n$\n229.5\n \n229.5\n \nF-29\nChanges in contingent purchase price obligations:\nDecember 31,\n2024\n2023\nJanuary 1\n$\n229.5\n \n$\n115.0\n \nAcquisitions\n39.2\n \n217.4\n \nRevaluation and interest\n(\n5.1\n)\n(\n36.1\n)\nPayments\n(\n42.4\n)\n(\n67.7\n)\nForeign currency translation\n(\n1.1\n)\n0.9\n \nDecember 31\n$\n220.1\n \n$\n229.5\n \nCarrying amount and fair value of our financial assets and liabilities:\nDecember 31,\n \n2024\n2023\nCarrying\nAmount\nFair\nValue\nCarrying\nAmount\nFair\nValue\nAssets:\n \n \n \n \nCash and cash equivalents\n$\n4,339.4\n \n$\n4,339.4\n \n$\n4,432.0\n \n$\n4,432.0\n \nMarketable equity securities\n0.9\n \n0.9\n \n0.9\n \n0.9\n \nNon-marketable equity securities\n36.8\n \n36.8\n \n6.7\n \n6.7\n \nCross currency swaps - net investment hedge\n9.3\n \n9.3\n \n—\n \n—\n \nLiabilities:\n \n \n \n \nShort-term debt\n$\n21.3\n \n$\n21.3\n \n$\n10.9\n \n$\n10.9\n \nForeign currency derivatives\n0.1\n \n0.1\n \n—\n \n—\n \nCross currency swaps - net investment hedge\n—\n \n—\n \n6.6\n \n6.6\n \nContingent purchase price obligations\n220.1\n \n220.1\n \n229.5\n \n229.5\n \nLong-term debt\n6,035.3\n \n5,664.9\n \n5,639.6\n \n5,237.8\n \nThe estimated fair values of the cross-currency swaps and foreign currency derivative instruments are determined using model-derived valuations, taking into consideration foreign currency rates, interest rates, and counterparty credit risk. The estimated fair value of the contingent purchase price obligations is calculated in accordance with the terms of each acquisition agreement and is discounted. The fair value of long-term debt is based on quoted market prices.\n23. \nDerivative Instruments and Hedging Activities\nWe manage our exposure to foreign exchange rate risk and interest rate risk through various strategies, including the use of derivative financial instruments. We use net investment hedges to manage the volatility of foreign exchange rates on the investment in our foreign subsidiaries. We may use forward foreign exchange contracts as economic hedges to manage the cash flow volatility arising from foreign exchange rate fluctuations related to foreign currency transactions. We do not use derivatives for trading or speculative purposes. Using derivatives exposes us to the risk that counterparties to the derivative contracts will fail to meet their contractual obligations. We manage that risk through careful selection and ongoing evaluation of the counterparty financial institutions based on specific minimum credit standards and other factors.\nWe evaluate the effects of changes in foreign currency exchange rates, interest rates and other relevant market risks on our derivatives. We periodically determine the potential loss from market risk on our derivatives by performing a value-at-risk, or VaR, analysis. VaR is a statistical model that uses historical currency exchange rate data to measure the potential impact on future earnings of our derivative financial instruments assuming normal market conditions. The VaR model is not intended to represent actual losses but is used as a risk estimation and management tool. Based on the results of the model, we estimate with 95% confidence a maximum one-day change in the net fair value of our derivative financial instruments at December 31, 2024 was not significant.\nForeign Currency Exchange Risk\nAs an integral part of our global treasury operations, we centralize our cash and use notional multicurrency pools to manage the foreign currency exchange risk that arises from imbalances between subsidiaries and their respective treasury centers. In addition, there are circumstances where revenue and expense transactions are not denominated in the same currency. In these instances, amounts are either promptly settled or hedged with forward foreign exchange contracts. To manage this risk, at December 31, 2024, we had outstanding forward foreign exchange contracts with an aggregate notional amount of $\n4.7\n million. At December 31, 2023, there were \nno\n outstanding forward foreign exchange contracts.\nForeign currency derivatives are designated as fair value hedges; therefore, any gain or loss in fair value incurred on those instruments is recorded in results of operations and is generally offset by decreases or increases in the fair value of the underlying \nF-30\nexposure. By using these financial instruments, we reduce financial risk of adverse foreign exchange changes by foregoing any gain which might occur if the markets move favorably. \nThe terms of our forward foreign exchange contracts are generally less than 90 days.\nWe have fixed-to-fixed cross currency swaps with a notional value of $\n150\n million that hedge a portion of the net investment in our Japanese subsidiaries against volatility in the Yen/U.S. Dollar exchange rate. The swaps are designated and qualify as a hedge of a net investment in a foreign subsidiary and are scheduled to mature in 2025 and 2029. Changes in the fair value of the swaps are recognized in foreign currency translation and are reported in AOCI. Any gain or loss will remain in AOCI until the complete or substantially complete liquidation of our investment in the underlying operations. We have elected to assess the effectiveness of our net investment hedges based on changes in spot exchange rates. We receive net fixed U.S. Dollar interest payments from the swaps. We recorded a reduction of interest expense of $\n6.6\n million\n in each of 2024 and 2023. At December 31, 2024, an asset of $\n9.3\n million is recorded in other assets, and at December 31, 2023, a liability of $\n6.6\n million is recorded in long-term liabilities, for the swap fair value.\nInterest Rate Risk\nWe may use interest rate swaps to manage our interest cost and structure our long-term debt portfolio to achieve a mix of fixed rate and floating rate debt. In 2024 and 2023, we did not have any interest rate swaps. At December 31, 2024 and 2023, long-term debt consisted entirely of fixed-rate debt.\n24. \nNew Accounting Standards\nOn November 4, 2024, the FASB issued ASU 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40)\n (“ASU 2024-03”),  that requires, additional information about specific expense \ncategories in the notes to financial statements at interim and annual reporting periods. ASU 2024-03 is effective for annual periods beginning after December 15, 2026, and for interim periods beginning after December 15, 2027. We will adopt ASU 2024-03 for annual periods beginning on January 1, 2027, and for interim periods beginning on January 1, 2028. ASU 2024-03 affects financial statement disclosure only, and its adoption will not affect our results of operations or financial condition.\n25. \nSubsequent Events\nWe have evaluated events subsequent to the balance sheet date and determined there have not been any events that have occurred that would require adjustment to or disclosure in the consolidated financial statements.\nF-31\nOMNICOM GROUP INC. AND SUBSIDIARIES\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\nFor the Three Years Ended December 31, 2024 \n(In millions)\nDescription\nBalance\nBeginning\nof Period\nCharged\nto Costs\nand Expenses\nRemoval of\nUncollectible\nReceivables\nTranslation\nAdjustment\nIncrease (Decrease)\nBalance\nEnd of\nPeriod\nValuation accounts deducted from assets:\n \n \n \n \n \nAllowance for Doubtful Accounts:\n \n \n \n \n \nDecember 31, 2024\n$\n17.2\n \n$\n(\n2.7\n)\n$\n0.9\n \n$\n(\n0.4\n)\n$\n15.0\n \nDecember 31, 2023\n24.7\n \n(\n2.8\n)\n(\n5.1\n)\n0.4\n \n17.2\n \nDecember 31, 2022\n21.7\n \n6.1\n \n(\n2.4\n)\n(\n0.7\n)\n24.7\n \nS-1"
  }
}