{
  "ticker": "OTIS",
  "cik": "0001781335",
  "company_name": "Otis Worldwide Corp",
  "filing_date": "2025-02-04",
  "accession": "0001781335-25-000010",
  "primary_doc": "otis-20241231.htm",
  "item_sections": {
    "item1": "Item 1A in this Form 10-K for macroeconomic risks related to our business.\nRisks Associated with Ongoing Conflicts\nThe ongoing conflict between Russia and Ukraine has resulted in worldwide geopolitical and macroeconomic uncertainty, including volatile commodity markets, foreign exchange fluctuations, supply chain disruptions, increased risk of cybersecurity incidents, reputational risk, increased operating costs (including fuel and other input costs), environmental, health and safety risks related to securing and maintaining facilities, additional sanctions and other regulations (including restrictions on the transfer of funds to and from Russia). As discussed below, we do not have operations in Russia.\nTo the extent possible, we continue to operate our business in Ukraine, which represented less than 1% of our 2024, 2023 and 2022 revenue and operating profit. As previously disclosed, we sold our business in Russia, which represented approximately 1% of our revenue and operating profit in 2022, respectively, to a third party in July 2022. The operations were comprised mostly of New Equipment. We recorded losses from the sale and conflict-related charges totaling $28 million, primarily in Other income (expense), net in the Consolidated Statements of Operations in 2022. See \"Note 8: Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" in Item 8 in this Form 10-K for further details.\nAdditionally, we do not have operations or material net sales in Israel or Gaza. Although we have operations in the Middle East and transport products through the Red Sea, we currently do not expect the recent conflicts in that region to have a material impact on our business.\n27\nTable of Contents\nWe cannot predict how the events described above will evolve. Depending on the ultimate outcomes of these conflicts, which remain uncertain, they could heighten certain risks disclosed in",
    "item1a": "Item 1A in this Form 10-K for further discussion.\nEmployee Benefit Plans\nWe sponsor domestic and international defined benefit pension and other postretirement plans. Major assumptions used in the accounting for these employee benefit plans include the discount rate, expected return on plan assets, rate of increase in employee compensation levels and mortality rates. Assumptions are determined based on company data and appropriate market indicators, and are evaluated each year as of December 31. A change in any of these assumptions would have an effect on net periodic pension and postretirement benefit costs reported in the Consolidated Financial Statements.\nIn the following table, we show the sensitivity of our pension plan liabilities to a 25 basis point change in the discount rates for benefit obligations, as of December 31, 2024:\n(dollars in millions)\nIncrease in Discount Rate of 25 bps\nDecrease in Discount Rate of 25 bps\nProjected benefit obligation\n$\n(22)\n$\n23\nThe impact on the net periodic pension (benefit) cost, the accumulated postretirement benefit obligation and the net periodic postretirement (benefit) cost is each less than $1 million. \nPension expense is also sensitive to changes in the expected long-term rate of asset return. An increase or decrease of 25 basis points in the expected long-term rate of asset return would have decreased or increased 2024 pension expense by approximately $2 million. \nThe weighted-average discount rates used to measure pension liabilities and costs utilize each plan’s specific cash flows and are then compared to high-quality bond indices for reasonableness. Global market interest rates decreased in 2024 as compared with 2023, and, as a result, the weighted-average discount rate used to measure pension liabilities was 3.3% in 2024 and 3.4% in 2023. \nSee \"Note 12: Employee Benefit Plans\" in Item 8 in this Form 10-K for further discussion.\n45\nTable of Contents\nOff-Balance Sheet Arrangements and Contractual Obligations\nWe extend a variety of financial guarantees to third parties in support of our business. We also have obligations arising from environmental, health and safety, tax and employment matters. Circumstances that could cause the contingent obligations and liabilities arising from these arrangements to come to fruition include changes in the underlying transaction, non-performance under a contract or deterioration in the financial condition of the guaranteed party.\nOtis' contractual obligations and commitments as of December 31, 2024 are discussed below. See also \"Note 12: Employee Benefit Plans\" in Item 8 of this Form 10-K for further discussion of our expected pension and postretirement contributions.\nLong-term Debt\nSee \"Note 9: Borrowings and Lines of Credit\" in Item 8 of this Form 10-K for further discussion of our long-term debt principal payments as of December 31, 2024. In the following table, we show the timing of payments of interest on long-term debt as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nLong-term debt - future interest\n$\n1,738\n$\n216\n$\n395\n$\n285\n$\n842\nFor long-term debt denominated in foreign currencies, the interest payments above reflect U.S. dollar amounts using foreign currency exchange rates as of \nDecember 31, 2024.\nPurchase Obligations\nPurchase obligations include amounts committed for the purchase of goods and services under legally enforceable contracts or purchase orders. Where it is not practically feasible to determine the legally enforceable portion of our obligation under certain of our long-term purchase agreements, we include additional expected purchase obligations beyond what may be legally enforceable. We enter into contractual purchase commitments with suppliers and service vendors to support our information technology that are either necessary to operate our business or result from implementing strategic initiatives. In the following table, we show the timing of payments of total purchase obligations as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nPurchase obligations\n$\n1,606\n$\n1,062\n$\n477\n$\n67\n$\n—\nOther Long-term Liabilities\nOther long-term liabilities in the table below includes obligations related to product, service and warranty policies, estimated remediation costs and contractual indemnities, and are included in Other long-term liabilities on the \"Consolidated Balance Sheets\" in Item 8 of this Form 10-K. \nThe timing of expected cash flows associated with these obligations is based upon management's estimates over the terms of these agreements and is largely based upon historical experience. \nIn the following table, we show the timing of these payments as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nOther long-term liabilities\n$\n192\n$\n10\n$\n105\n$\n14\n$\n63\nThe amounts above include $80 million of non-current contractual payables due to RTX for reimbursement of tax payments that RTX is responsible to pay after the Separation pursuant to the TMA. Otis will reimburse RTX for those tax payments through 2026.\n46\nTable of Contents\nUnrecognized Tax Benefits\nOtis has unrecognized tax benefits\n of $149 million as\n of December 31, \n2024.\n The timing of when such unrecognized tax benefits will become realizable is uncertain. See \"Note 15: Income Taxes\" in Item 8 in this Form 10-K for additional discussion on unrecognized tax benefits.\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nOur primary market exposures are to fluctuations in foreign currency exchange rates, commodity prices and interest rates. To manage certain of those exposures, we use derivative instruments, including forward contracts. Derivative instruments utilized in our hedging activities are viewed as risk management tools, involve relatively little complexity and are not used for trading or speculative purposes. We diversify the counterparties used and monitor the concentration of risk to limit our counterparty exposure.\nTo quantify our market risk exposure, we perform a sensitivity analysis \nbased on hypothetical changes in foreign currency exchange rates and interest rates\n.\n \nRefer to \"Note 2: Summary of Significant Accounting Policies\", \"Note 9: Borrowings and Lines of Credit\" and \"Note 17: Financial Instruments\" i\nn Item 8 in this Form 10-K \nfor additional discussion of foreign currency exchange, interest rates and financial instruments, including the average aggregate notional amount of our outstanding foreign currency and commodity price hedges during 2024\n and \n2023\n.\nForeign Currency Risk\nFor our non-U.S. based entities, a substantial portion of revenues are generated, and costs are incurred, in local currencies. We transact business in various foreign currencies, which exposes our cash flows and earnings to changes in foreign currency exchange rates. We periodically enter into sales contracts denominated in currencies other than the functional currency of the parties to the transaction, which can create foreign exchange exposure.\nThe value of certain foreign currencies as compared to the U.S. dollar may impact Otis’ financial results. We have a high volume of foreign currency exposures that result from our international net sales, purchases, investments and other international transactions. International net sales were approxi\nmatel\ny $10.0 billion, $10.2 billion\n and $9.9 billion in \n2024\n, \n2023\n and 2022, respectively\n.\nWe manage foreign currency exposures associated\n with committed foreign currency purchases and sales, as well as foreign currency denominated assets and liabilities that are created in the ordinary course of business. Foreign exchange exposures arising from intercompany loan and deposit transactions are also hedged regularly. More than insignificant exposures that cannot be naturally offset are generally hedged with foreign currency derivatives. The aggregate notional amount of our outstanding foreign currency hedges was approximately $5.1 billion and $4.9 billion as of December 31, 2024 and 2023\n, respectively. Foreign currency forward contracts are sensitive to changes in foreign currency exchange rates.\n An unfavorable exchange rate movement of 10% to our portfolio of foreign currency contracts would have resulted in an increase in unrealized losses of $124 million and $120 million as of December 31, 2024 and 2023, respectively. Such losses or gains would be offset by corresponding gains or losses in the remeasurement of the underlying transactions or investments being hedged. We believe these foreign currency forward exchange contracts and the offsetting underlying commitments or investments, when taken together, do not create material market risk.\nWhile the objective of the hedging program is to minimize the foreign currency exchange impact on operating results, there are typically variances between the hedging gains or losses and the translational impact due to the length of hedging contracts, changes in the sales profile, volatility in the exchange rates and other such operational considerations. Otis does not enter into hedging contracts for speculative purposes.\nAs discussed in \"Note 17: Financial Instruments\" in Item 8 in this Form 10-K, as of December 31, 2024 we have ¥21.5 billion ($137 million) of Japanese Yen denominated long-term debt that qualifies as a net investment hedge against our investments in Japanese businesses, as well as derivative instruments that qualify as net investment hedges against our investments in certain European businesses with notional amounts of €150 million ($156 million) and Asian businesses with notional amounts of HK$1.3 billion and ¥2.1 billion ($178 million total)\n.\n As of December 31, 2024, these net investment hedges are deemed to be effective. \n47\nTable of Contents\nAs of December 31, 2024 we have approximately €2.0 billion ($2.0 billion) of Euro denominated long-term debt. This debt was issued by a subsidiary with Euro functional currency. The currency effects of this debt are reflected in the Accumulated other comprehensive income (loss) within Shareholder's (Deficit) Equity in the Balance Sheet in Item 8 in this Form 10-K. Refer to \"Note 9: Borrowings and Lines of Credit\" in Item 8 in this Form 10-K for additional discussion of our borrowings.\nCommodity Price Risk\nThe fluctuation in prices of certain raw materials may impact Otis' financial results. We are exposed to volatility in the prices of commodities used in some of our products and component parts, such as steel, aluminum and copper, among others. When possible and appropriate, we maintain fixed price contracts on raw materials and component parts. However, we are prone to exposure as these contracts expire. When possible and appropriate, we also include price escalation linked to commodity prices in contracts with our customers and take pricing actions for future contracts. However, products and services delivered to our customers can be provided a year or more after being agreed to, and not all raw material price increases can be passed along to customers with existing contracts. Therefore, when commodity price risk is not mitigated by other methods, we may enter into hedging contracts. Otis does not enter into hedging contracts for speculative purposes.\nCommodity hedging contracts are sensitive to changes in commodity prices, but any losses or gains would be offset by corresponding gains or losses in the underlying commodity purchases being hedged. Therefore, we believe these commodity hedging contracts and the offsetting underlying purchases, when taken together, do not create material market risk.\nInterest Rate Risk\nA 100 basis points increase in interest rates would have had an approximate\n $400 million reduction on the fai\nr value of our fixed-rate debt as of\n December 31, 2024 and 2023\n. Our long-term debt portfolio consists of fixed-rate instruments, and, therefore, any fluctuation in market interest rates is not expected to have a material effect on the Company's results of operations. Additionally, the investors in our fixed-rate debt obligations generally do not have the right to demand we pay off these obligations prior to maturity. Therefore, we believe our exposure to interest rate risk on our fixed-rate debt is not material.\nFrom time to time, we may hedge floating rates using interest rate swaps. The hedges would be designated as fair value hedges and the gains and losses on the swaps would be reported in interest expense, reflecting that portion of interest expense at a variable rate.\n48\nTable of Contents\nItem 8. Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND\nFINANCIAL STATEMENT SCHEDULE\nPage\nManagement's Report on Internal Control Over Financial Reporting\n50\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n51\nConsolidated Statements of Operations for the years ended December 31, 202\n4\n, 202\n3\n and 202\n2\n53\nConsolidated Statements of Comprehensive Income for the years ended December 31, 202\n4\n, 202\n3\n and 202\n2\n54\nConsolidated Balance Sheets as of December 31, 202\n4\n and 202\n3\n55\nConsolidated Statements of Changes in Equity for the years ended December 31, 202\n4\n, 202\n3\n and 202\n2\n56\nConsolidated Statements of Cash Flows for the years ended December 31, 202\n4\n, 202\n3\n and 202\n2\n57\nNotes to Consolidated Financial Statements\n59\nFinancial Statement Schedule - Schedule II — Valuation and Qualifying Accounts for the years ended December 31, 202\n4\n, 202\n3\n and 202\n2\n98\n(All other schedules are not required and have been omitted)\n49\nTable of Contents\nManagement's Report on Internal Control over Financial Reporting\nThe management of Otis is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with accounting principles generally accepted in the United States of America. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.\nManagement has assessed the effectiveness of Otis' internal control over financial reporting as of December 31, 2024. In making its assessment, management has utilized the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in \nInternal Control - Integrated Framework \n(2013). Management concluded that based on its assessment, Otis' internal control over financial reporting was effective as of December 31, 2024. The effectiveness of Otis' internal control over financial reporting, as of December 31, 2024, has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which is included herein.\nOTIS WORLDWIDE CORPORATION\n(Registrant)\nby:\n/s/ JUDITH F. MARKS\nJudith F. Marks\nChair, President and Chief Executive Officer\nby:\n/s/ CRISTINA MÉNDEZ\nCristina Méndez\nExecutive Vice President and Chief Financial Officer\nby:\n/s/ MICHAEL P. RYAN\nMichael P. Ryan\nSenior Vice President and Chief Accounting Officer\n50\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Board of Directors and Shareholders of Otis Worldwide Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Otis Worldwide Corporation and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of operations, of comprehensive income, of changes in equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and financial statement schedule listed in the accompanying index (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n51\nTable of Contents\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Estimated Costs at Completion for New Equipment and Modernization Contracts\nAs described in Notes 2 and 22 to the consolidated financial statements, the Company recognized $5.4 billion and $1.7 billion of revenue from new equipment and modernization contracts, respectively, for the year ended December 31, 2024. For new equipment and modernization contracts, equipment and installation are typically procured in a single contract providing the customer with a complete installed elevator or escalator unit. The combination of equipment and installation promises are typically a single performance obligation. For these performance obligations, revenue is recognized over time using costs incurred to date relative to total estimated costs at completion to measure progress. As disclosed by management, contract costs are usually incurred over a period of time, which can be several years, and the estimation of these costs requires management’s judgment. The long-term nature of the contracts, the complexity of the products and the scale of the projects can affect management’s ability to estimate costs precisely. In developing the cost estimates, management utilizes a combination of the historical costs and expected costs considering current circumstances. Management reviews cost estimates for modification on significant new equipment and modernization contracts on a quarterly basis and when circumstances change and, for others, no less frequently than annually or when circumstances change and warrant a modification to a previous estimate. Management records changes in contract estimates using the cumulative catch-up method and reviews changes in contract estimates for their impact on net sales or operating profit in the consolidated financial statements. Contract costs included in the calculation are comprised of labor, materials, subcontractors’ costs or other direct costs and indirect costs, which include indirect labor costs. \nThe principal considerations for our determination that performing procedures relating to revenue recognition - estimated costs at completion for new equipment and modernization contracts is a critical audit matter are the significant judgment by management to determine the estimated costs at contract completion, which in turn led to significant auditor judgment, subjectivity and effort in performing procedures and evaluating audit evidence related to the estimated expected labor and indirect labor costs used in the development of estimated costs at contract completion.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the determination of the estimated costs at contract completion and development of the significant assumptions related to the estimated expected labor and indirect labor costs. These procedures also included, among others, evaluating and testing management’s process for developing and modifying estimated costs at contract completion for a sample of contracts, which included evaluating the reasonableness of significant assumptions related to the estimated expected labor and indirect labor costs considered by management specific to each contract. Evaluating the reasonableness of the estimated expected labor and indirect labor costs involved assessing management’s ability to reasonably estimate costs at completion by (i) testing costs incurred to date and obtaining a sample of executed contracts and related change orders, (ii) performing a comparison of the margin, driven by the estimated and actual costs incurred, to that of similar completed equipment contracts, and (iii) evaluating the timely identification of circumstances that may warrant a modification to estimated total cost to complete.\n/s/ \nPricewaterhouseCoopers LLP\nHartford, Connecticut\nFebruary 4, 2025\nWe have served as the Company’s auditor since 2019.\n52\nTable of Contents\nOTIS WORLDWIDE CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(dollars in millions, except per share amounts; shares in millions)\n2024\n2023\n2022\nNet sales:\nProduct sales\n$\n5,367\n \n$\n5,812\n \n$\n5,864\n \nService sales\n8,894\n \n8,397\n \n7,821\n \n14,261\n \n14,209\n \n13,685\n \nCosts and expenses:\nCost of products sold\n4,459\n \n4,843\n \n4,949\n \nCost of services sold\n5,545\n \n5,173\n \n4,816\n \nResearch and development\n152\n \n144\n \n150\n \nSelling, general and administrative\n1,861\n \n1,884\n \n1,763\n \n12,017\n \n12,044\n \n11,678\n \nOther income (expense), net\n(\n236\n)\n21\n \n26\n \nOperating profit\n2,008\n \n2,186\n \n2,033\n \nNon-service pension cost (benefit)\n—\n \n5\n \n2\n \nInterest expense (income), net\n(\n31\n)\n150\n \n143\n \nNet income before income taxes\n2,039\n \n2,031\n \n1,888\n \nIncome tax expense\n305\n \n533\n \n519\n \nNet income\n1,734\n \n1,498\n \n1,369\n \nLess: Noncontrolling interest in subsidiaries' earnings\n89\n \n92\n \n116\n \nNet income attributable to Otis Worldwide Corporation\n$\n1,645\n \n$\n1,406\n \n$\n1,253\n \nEarnings per share (Note 3):\nBasic\n$\n4.10\n \n$\n3.42\n \n$\n2.98\n \nDiluted\n$\n4.07\n \n$\n3.39\n \n$\n2.96\n \nWeighted average number of shares outstanding\nBasic shares\n401.7\n \n411.4\n \n420.0\n \nDiluted shares\n404.4\n \n414.6\n \n423.0\n \nSee accompanying Notes to Consolidated Financial Statements.\n53\nTable of Contents\nOTIS WORLDWIDE CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(dollars in millions)\n2024\n2023\n2022\nNet income\n$\n1,734\n \n$\n1,498\n \n$\n1,369\n \nOther comprehensive income (loss):\nForeign currency translation adjustments, net of tax\n(\n13\n)\n(\n93\n)\n(\n55\n)\nPension and postretirement benefit plan adjustments:\nNet actuarial gain (loss)\n(\n2\n)\n(\n90\n)\n146\n \nAmortization of actuarial (gain) loss and prior service credit\n—\n \n(\n1\n)\n10\n \nOther\n6\n \n(\n1\n)\n11\n \n4\n \n(\n92\n)\n167\n \nTax benefit (expense)\n(\n2\n)\n22\n \n(\n47\n)\nPension and postretirement benefit plan adjustments, net of tax\n2\n \n(\n70\n)\n120\n \nChange in unrealized cash flow hedging:\nUnrealized cash flow hedging gain (loss)\n2\n \n6\n \n(\n3\n)\nAdjustment for net (gain) loss realized and included in net income\n—\n \n(\n8\n)\n(\n1\n)\nChange in unrealized cash flow hedging, net of tax\n2\n \n(\n2\n)\n(\n4\n)\nOther comprehensive income (loss), net of tax\n(\n9\n)\n(\n165\n)\n61\n \nComprehensive income (loss), net of tax\n1,725\n \n1,333\n \n1,430\n \nLess: Comprehensive (income) loss attributable to noncontrolling interest\n(\n75\n)\n(\n85\n)\n(\n6\n)\nComprehensive income attributable to Otis Worldwide Corporation\n$\n1,650\n \n$\n1,248\n \n$\n1,424\n \nSee accompanying Notes to Consolidated Financial Statements.\n54\nTable of Contents\nOTIS WORLDWIDE CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(dollars in millions)\n2024\n2023\nAssets\nCash and cash equivalents\n$\n2,300\n \n$\n1,274\n \nAccounts receivable (net of allowance for expected credit losses of $\n125\n and $\n130\n)\n3,428\n \n3,538\n \nContract assets\n706\n \n717\n \nInventories\n557\n \n612\n \nOther current assets\n679\n \n259\n \nTotal Current Assets\n7,670\n \n6,400\n \nFuture income tax benefits\n302\n \n323\n \nFixed assets, net\n701\n \n727\n \nOperating lease right-of-use assets\n422\n \n416\n \nIntangible assets, net\n311\n \n335\n \nGoodwill\n1,548\n \n1,588\n \nOther assets\n362\n \n328\n \nTotal Assets\n$\n11,316\n \n$\n10,117\n \nLiabilities and Equity (Deficit)\nShort-term borrowings and current portion of long-term debt\n$\n1,351\n \n$\n32\n \nAccounts payable\n1,879\n \n1,878\n \nAccrued liabilities\n1,921\n \n1,873\n \nContract liabilities\n2,598\n \n2,696\n \nTotal Current Liabilities\n7,749\n \n6,479\n \nLong-term debt\n6,973\n \n6,866\n \nFuture pension and postretirement benefit obligations\n434\n \n462\n \nOperating lease liabilities\n298\n \n292\n \nFuture income tax obligations \n207\n \n245\n \nOther long-term liabilities\n383\n \n493\n \nTotal Liabilities\n16,044\n \n14,837\n \nCommitments and contingent liabilities (Note 21)\nRedeemable noncontrolling interest\n57\n \n135\n \nShareholders' Equity (Deficit):\nCommon Stock and additional paid-in-capital\n265\n \n213\n \nTreasury Stock\n(\n3,390\n)\n(\n2,382\n)\nAccumulated deficit\n(\n978\n)\n(\n2,005\n)\nAccumulated other comprehensive income (loss)\n(\n745\n)\n(\n750\n)\nTotal Shareholders' Equity (Deficit)\n(\n4,848\n)\n(\n4,924\n)\nNoncontrolling interest\n63\n \n69\n \nTotal Equity (Deficit)\n(\n4,785\n)\n(\n4,855\n)\nTotal Liabilities and Equity (Deficit)\n$\n11,316\n \n$\n10,117\n \nSee accompanying Notes to Consolidated Financial Statements.\n55\nTable of Contents\nOTIS WORLDWIDE CORPORATION \nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY\n(dollars in millions, except per share amounts)\nCommon Stock and Additional Paid-In Capital\nTreasury Stock\nAccumulated Deficit\nAccumulated Other Comprehensive Income (Loss)\nTotal Shareholders' \n(Deficit) Equity\nNoncontrolling Interest\nTotal (Deficit) Equity\nRedeemable Noncontrolling Interest\nBalance as of December 31, 2021\n$\n119\n \n$\n(\n725\n)\n$\n(\n2,256\n)\n$\n(\n763\n)\n$\n(\n3,625\n)\n$\n481\n \n$\n(\n3,144\n)\n$\n160\n \nNet income\n— \n— \n1,253\n \n— \n1,253\n \n101\n \n1,354\n \n15\n \nOther comprehensive income (loss), net of tax and foreign currency reclassifications (Note 14)\n— \n— \n— \n171\n \n171\n \n(\n12\n)\n159\n \n(\n98\n)\nStock-based compensation and Common Stock issued under employer plans\n61\n \n— \n(\n2\n)\n— \n59\n \n— \n59\n \n— \nCash dividends declared ($\n1.11\n per Common Share)\n— \n— \n(\n465\n)\n— \n(\n465\n)\n— \n(\n465\n)\n— \nRepurchase of Common Shares\n— \n(\n850\n)\n— \n— \n(\n850\n)\n— \n(\n850\n)\n— \nDividends attributable to noncontrolling interest\n— \n— \n— \n— \n— \n(\n86\n)\n(\n86\n)\n(\n14\n)\nReclassification of noncontrolling interest to forward purchase agreement and redeemable noncontrolling interest (Note 1)\n— \n— \n(\n1,482\n)\n— \n(\n1,482\n)\n(\n403\n)\n(\n1,885\n)\n1,476\n \nAcquisitions, disposals and other changes\n(\n18\n)\n— \n87\n \n— \n69\n \n(\n10\n)\n59\n \n(\n1,404\n)\nBalance as of December 31, 2022\n162\n \n(\n1,575\n)\n(\n2,865\n)\n(\n592\n)\n(\n4,870\n)\n71\n \n(\n4,799\n)\n135\n \nNet income\n— \n— \n1,406\n \n— \n1,406\n \n83\n \n1,489\n \n9\n \nOther comprehensive income (loss), net of tax\n— \n— \n— \n(\n158\n)\n(\n158\n)\n(\n3\n)\n(\n161\n)\n(\n4\n)\nStock-based compensation and Common Stock issued under employer plans\n51\n \n— \n(\n2\n)\n— \n49\n \n— \n49\n \n— \nCash dividends declared ($\n1.31\n per Common Share)\n— \n— \n(\n539\n)\n— \n(\n539\n)\n— \n(\n539\n)\n— \nRepurchase of Common Shares\n— \n(\n807\n)\n— \n— \n(\n807\n)\n— \n(\n807\n)\n— \nDividends attributable to noncontrolling interest\n— \n— \n— \n— \n— \n(\n79\n)\n(\n79\n)\n(\n9\n)\nAcquisitions, disposals and other changes\n—\n \n— \n(\n5\n)\n— \n(\n5\n)\n(\n3\n)\n(\n8\n)\n4\n \nBalance as of December 31, 2023\n213\n \n(\n2,382\n)\n(\n2,005\n)\n(\n750\n)\n(\n4,924\n)\n69\n \n(\n4,855\n)\n135\n \nNet income\n—\n \n—\n \n1,645\n \n—\n \n1,645\n \n80\n \n1,725\n \n9\n \nOther comprehensive income (loss), net of tax\n—\n \n—\n \n—\n \n5\n \n5\n \n(\n5\n)\n—\n \n(\n9\n)\nStock-based compensation and Common Stock issued under employer plans\n53\n \n—\n \n(\n3\n)\n—\n \n50\n \n—\n \n50\n \n—\n \nCash dividends declared ($\n1.51\n per Common Share)\n—\n \n—\n \n(\n606\n)\n—\n \n(\n606\n)\n—\n \n(\n606\n)\n—\n \nRepurchase of Common Shares\n—\n \n(\n1,008\n)\n—\n \n—\n \n(\n1,008\n)\n—\n \n(\n1,008\n)\n—\n \nDividends attributable to noncontrolling interest\n—\n \n—\n \n—\n \n—\n \n—\n \n(\n81\n)\n(\n81\n)\n(\n12\n)\nAcquisitions, disposals and other changes\n(\n1\n)\n—\n \n(\n9\n)\n—\n \n(\n10\n)\n—\n \n(\n10\n)\n(\n66\n)\nBalance as of December 31, 2024\n$\n265\n \n$\n(\n3,390\n)\n$\n(\n978\n)\n$\n(\n745\n)\n$\n(\n4,848\n)\n$\n63\n \n$\n(\n4,785\n)\n$\n57\n \nSee accompanying Notes to Consolidated Financial Statements.\n56\nTable of Contents\n57\nTable of Contents\nOTIS WORLDWIDE CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(dollars in millions)\n2024\n2023\n2022\nOperating Activities:\nNet income\n$\n1,734\n \n$\n1,498\n \n$\n1,369\n \nAdjustments to reconcile net income to net cash flows provided by operating activities, net of acquisitions and dispositions:\nDepreciation and amortization\n181\n \n193\n \n191\n \nDeferred income tax expense (benefit)\n(\n31\n)\n(\n61\n)\n(\n16\n)\nStock compensation cost\n73\n \n64\n \n67\n \nGain from reversal of German Tax Litigation interest accrual (Note 1)\n(\n50\n)\n—\n \n—\n \nChange in:\nAccounts receivable, net\n(\n68\n)\n(\n239\n)\n(\n309\n)\nContract assets and liabilities, current\n(\n40\n)\n(\n30\n)\n38\n \nInventories\n26\n \n15\n \n(\n65\n)\nOther current assets\n(\n354\n)\n38\n \n52\n \nAccounts payable\n57\n \n152\n \n272\n \nAccrued liabilities\n85\n \n33\n \n(\n84\n)\nPension and postretirement contributions\n(\n51\n)\n(\n48\n)\n(\n34\n)\nOther operating activities, net\n1\n \n12\n \n79\n \nNet cash flows provided by operating activities\n1,563\n \n1,627\n \n1,560\n \nInvesting Activities:\nCapital expenditures\n(\n126\n)\n(\n138\n)\n(\n115\n)\nAcquisitions of businesses and intangible assets, net of cash (Note 8)\n(\n87\n)\n(\n36\n)\n(\n46\n)\nDispositions of businesses, net of cash (Note 8)\n—\n \n—\n \n61\n \nProceeds from sale of (investments in) marketable securities, net\n(\n9\n)\n4\n \n(\n7\n)\nReceipts (payments) on settlements of derivative contracts, net\n49\n \n(\n28\n)\n65\n \nOther investing activities, net\n9\n \n15\n \n9\n \nNet cash flows provided by (used in) investing activities\n(\n164\n)\n(\n183\n)\n(\n33\n)\nFinancing Activities:\nNet proceeds from (repayments of) borrowings (maturities of 90 days or less)\n11\n \n(\n113\n)\n113\n \nIssuance of long-term debt\n1,497\n \n747\n \n—\n \nPayment of debt issuance costs\n(\n11\n)\n(\n6\n)\n—\n \nRepayment of long-term debt\n—\n \n(\n534\n)\n(\n500\n)\nDividends paid on Common Stock\n(\n606\n)\n(\n539\n)\n(\n465\n)\nRepurchases of Common Stock\n(\n1,007\n)\n(\n800\n)\n(\n850\n)\nAcquisition of noncontrolling interest shares (Note 1)\n(\n75\n)\n—\n \n(\n1,802\n)\nDividends paid to noncontrolling interest\n(\n94\n)\n(\n85\n)\n(\n118\n)\nOther financing activities, net\n(\n24\n)\n(\n20\n)\n(\n30\n)\nNet cash flows provided by (used in) financing activities\n(\n309\n)\n(\n1,350\n)\n(\n3,652\n)\nEffect of foreign exchange rate changes on cash and cash equivalents\n(\n49\n)\n(\n9\n)\n(\n157\n)\nNet increase (decrease) in cash and cash equivalents\n1,041\n \n85\n \n(\n2,282\n)\nCash, cash equivalents and restricted cash, beginning of year\n1,280\n \n1,195\n \n3,477\n \nCash, cash equivalents and restricted cash, end of year\n2,321\n \n1,280\n \n1,195\n \nLess: Restricted cash\n21\n \n6\n \n6\n \nCash and cash equivalents, end of period\n$\n2,300\n \n$\n1,274\n \n$\n1,189\n \nSupplemental cash flow information:\nInterest paid\n$\n172\n \n$\n132\n \n$\n134\n \nIncome taxes paid, net of (refunds)\n586\n \n546\n \n562\n \nSee accompanying Notes to Consolidated Financial Statements.\n58\nTable of Contents\nNote 1: \nBusiness Overview \nOtis (as defined below) is the world’s largest elevator and escalator manufacturing, installation and service company. Our operations are classified into \ntwo\n segments: New Equipment and Service. Through the New Equipment segment, we design, manufacture, sell and install a wide range of passenger and freight elevators, as well as escalators and moving walkways, for residential, commercial and infrastructure projects. The Service segment provides maintenance and repair services for both our products and those of other manufacturers, and provides modernization services to upgrade elevators and escalators.\nUpLift\nDuring 2023, the Company announced UpLift to transform the Company's operating model. UpLift includes, among other aspects, the standardization of processes and improvement of supply chain procurement, as well as organizational changes which result in restructuring actions. See Note 16, \"Restructuring and Transformation Costs\" for information regarding UpLift restructuring actions and related costs incurred.\nGerman Tax Litigation\nIn August 2024, we received a favorable ruling regarding a tax litigation in Germany. As a result, income tax benefits of approximately $\n185\n million and related interest income of approximately $\n200\n million are included in Income tax expense (benefit) and Interest expense (income), net, respectively, in the Consolidated Statements of Operations for 2024. The income tax benefits are recorded as an income tax receivable in Other current assets in the Consolidated Balance Sheets as of December 31, 2024. The interest income includes the reversal of an interest accrual of $\n50\n million and recognition of an interest receivable of approximately $\n140\n million reflected in Accrued liabilities and Other current assets, respectively, in the Consolidated Balance Sheets as of December 31, 2024.\nPursuant to the Tax Matters Agreement (\"TMA\") with RTX Corporation (\"RTX\", our former parent), the Company recorded indemnification expense of $\n194\n million for amounts due to RTX resulting from the outcome of this tax litigation in Germany. This expense is included in Other expense (income), net in the Consolidated Statements of Operations 2024, and the resulting amounts due to RTX are included in Accrued liabilities in the Consolidated Balance Sheets as of December 31, 2024.\nSee Note 15, \"Income Taxes\" and Note 21, \"Contingencies\"\n \nfor additional information.\nAcquisitions of Noncontrolling Interests\nIn 2024, we purchased all of the outstanding shares of our consolidated subsidiary in Japan from the noncontrolling shareholders for approximately $\n70\n million. \nIn 2021, the Company announced its Tender Offer to acquire all of the issued and outstanding shares of Zardoya Otis not owned by the Company in cash, and its intention to delist the shares of Zardoya Otis from the Spanish stock exchanges subsequent to the Tender Offer (the \"Tender Offer\"). The price per share of the Tender Offer was €\n7.07\n in cash as of \nMarch 31, 2022\n, after adjustments for dividends paid. The Tender Offer was approved by the Spanish regulator on February 28, 2022. As a result of the Tender Offer approval, the issued and outstanding shares of Zardoya Otis owned by Euro Syns, S.A. (\"Euro Syns\") were reclassified to current liabilities as Forward purchase agreement, and the remaining shares not owned by the Company were deemed redeemable at the option of the other shareholders and were reclassified from Noncontrolling interest to Redeemable noncontrolling interest on our Consolidated Financial Statements. The difference between the historical noncontrolling interest carrying value in the balance sheet and the fair value of the Tender Offer was recorded to Accumulated deficit.\nThe results of the Tender Offer were announced on April 7, 2022, with tenders, including Euro Syns' shares, of \n45.49\n% of the shares outstanding accepted, resulting in the Company owning \n95.51\n% of Zardoya Otis. The shares tendered to the Company were settled in cash on April 12, 2022 for approximately €\n1.5\n billion from the Company's restricted cash held in escrow. The acquisition and settlement of the remaining issued and outstanding shares of Zardoya Otis not owned by the Company occurred in the second quarter of 2022 for approximately €\n150\n million. The automatic \ndelisting of Zardoya Otis\n shares occurred on \nMay 9, 2022. Zardoya Otis was then renamed Otis Mobility S.A. (\"Otis Mobility\").\n59\nTable of Contents\nThe Company owned a controlling interest and had operational control of Otis Mobility (formerly Zardoya Otis) during 2024, 2023 and 2022, and therefore its financial results are included in our Consolidated Financial Statements. The Company owned \n50.02\n% of Otis Mobility prior to the Tender Offer and \n100\n% after completion of the Tender Offer.\nSale of Russia Business\nThe Company sold its business in Russia during 2022. See Note 8, \"Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" for additional information regarding the sale of our Russia business.\nSeparation from United Technologies Corporation\nOn April 3, 2020, United Technologies Corporation, subsequently renamed to RTX Corporation (\"UTC\" or \"RTX\", as applicable), completed the spin-off of the Company into an independent publicly-traded company (the \"Separation\") through a pro-rata distribution of \n0.5\n shares of Common Stock for every share of UTC common stock held at the close of business on the record date of March 19, 2020 (\"Distribution\"). Otis began to trade as a separate public company (New York Stock Exchange (\"NYSE\"): OTIS) on April 3, 2020. \nSee Note 2, \"Summary of Significant Accounting Policies\" for additional information regarding the Separation and related costs.\nUnless the context otherwise requires, references to \"Otis\", \"we\", \"us\", \"our\" and \"the Company\" refer to (i) Otis Worldwide Corporation's business prior to the Separation and (ii) Otis Worldwide Corporation and its subsidiaries following the Separation, as applicable. References to \"UTC\" relate to pre-Separation matters, and references to \"RTX\" relate to post-Separation matters.\nNote 2: \nSummary of Significant Accounting Policies\nPrinciples of Consolidation and Basis of Presentation.\n The accompanying Consolidated Financial Statements include the accounts of Otis and its controlled subsidiaries, as well as entities where Otis has a variable interest and is the primary beneficiary as defined by Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") Topic 810, \nConsolidation\n. The factors we use to determine the primary beneficiary of a variable interest entity (\"VIE\") may include decision authority, control over management of day-to-day operations and the amount of our equity investment in relation to others' investments.\nAll significant intercompany accounts and transactions within the Company have been eliminated in the preparation of the Consolidated Financial Statements.\nCertain amounts for prior years have been reclassified to conform to the current year presentation, which are immaterial.\nUse of Estimates.\n The preparation of the Consolidated Financial Statements and accompanying notes in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities. In addition, estimates and assumptions may impact the disclosure of contingent assets and liabilities at the date of the financial statements, as well as the reported amounts of revenues and expenses during the reporting period. Actual results could differ materially from those estimates.\nWe assessed certain accounting matters that generally require consideration of forecasted financial information in the context of the information reasonably available to us and the unknown future impacts of macroeconomic conditions, including inflationary pressures, higher interest rates and tighter credit conditions as of December 31, 2024 and through the date of this report. The accounting matters assessed included, but were not limited to, our allowance for credit losses, the carrying value of our goodwill and other long-lived assets, financial assets and revenue recognition. While there was not a material impact to our Consolidated Financial Statements resulting from our assessments of these matters, future assessment of our current expectations at that time of the magnitude and duration of these macroeconomic conditions, as well as other factors, could result in material impacts to our Consolidated Financial Statements in future reporting periods.\nWe also assessed certain accounting matters as they relate to the ongoing conflict between Russia and Ukraine and the conflicts in the Middle East, including, but not limited to, our allowance for credit losses, the carrying value of long-lived assets, revenue recognition and the classification of assets. There was not a material impact to our Consolidated Financial Statements resulting from our assessment of these matters. We continue to assess the impact on our results of operations, financial position and overall performance as the situations develop and any broader implications they may have on the global economy.\n60\nTable of Contents\nCash and Cash Equivalents.\n Cash and cash equivalents includes cash on hand, demand deposits and short-term cash investments that are highly liquid in nature and have original maturities of three months or less. \nRestricted Cash. \nIn certain circumstances we are required to maintain cash deposits with certain banks with respect to contractual or other legal obligations, and therefore the use of these cash deposits for general operational purposes is restricted. Our restricted cash balances are $\n21\n million and $\n6\n million as of December 31, \n2024 and 2023, respectively, which\n are\n primarily included in Other current assets in the Consolidated Balance Sheets.\nAccounts Receivable. \nThe Company records accounts receivable when the right to consideration becomes unconditional. We regularly evaluate the collectability of our accounts receivable and maintain reserves for expected credit losses. See Note 5, \"Accounts Receivable, Net\" for additional information on the Company's policy for evaluation of expected credit losses. We do not believe that accounts receivable represent significant concentrations of credit risk because of the diversified portfolio of individual customers and geographic areas.\nRetainage and Unbilled Receivables.\n Current an\nd long-term accounts receivable as of December 31, 2024 and 2023 include retainage of \n$\n57\n million\n and $\n63\n million, respectively, and unbilled receiv\nables of $\n129\n million and $\n119\n million, respectively. Retainage represents amounts that, pursuant to the applicable contract, are not due until after project completion and acceptance by the customer. Unbilled receivables represent revenues that are earned but may not be currently billable to the customer under the terms of the contract. These items are expected to be billed and collected in the ordinary course of business. Unbilled receivables where we have an unconditional right to payment are included in Accounts receivable, net as of December 31, 2024 and 2023.\nCustomer Financing Notes Receivable.\n Through financing arrangements with our customers, we extend payment terms, which are generally not more than one year in duration. \nFactoring.\n The Company may sell certain trade accounts and notes receivable to lending institutions primarily to manage credit risk. Financial assets sold under these arrangements are excluded from Accounts receivable, net in the Company’s Consolidated Balance Sheets at the time of sale if the Company has surrendered control over the related assets. Whether control has been relinquished requires, among other things, an evaluation of relevant legal considerations and an assessment of the nature and extent of the Company’s continuing involvement with the assets transferred. Gains and losses stemming from transfers reported as sales are included in Interest expense (income), net in the accompanying Consolidated Statements of Operations.\nContract Assets and Liabilities.\n Contract assets and liabilities represent the difference in the timing of revenue recognition from receipt of cash from our customers and billings.\nContract assets reflect revenue recognized and performance obligations satisfied in advance of customer billings. Performance obligations partially satisfied in advance of customer billings are included in Contract assets, current. Contract liabilities relate to payments received in advance of the satisfaction of performance under the contract. We receive payments from customers based on the terms established in our contracts.\n See Note 4, \"Contract Assets and Liabilities\" \nfor further discussion of contract assets and liabilities.\nInventories.\n Inventories are stated at the lower of cost or estimated realizable value and are primarily based on a first-in, first-out method. Valuation write-downs for excess, obsolete and slow-moving inventory are estimated by comparing the inventory levels of individual parts to both future sales forecasts or production requirements and historical usage rates in order to identify inventory where the resale value or replacement value is less than inventoriable cost. See Note 6, \"Inventories\" for further details of the inventories by classification.\nFixed Assets.\n Fixed assets, including software capitalized for internal-use, are recorded at cost. Depreciation of fixed assets is computed over the fixed assets' useful lives on a straight-line basis, unless another systematic and rational basis is more representative of the fixed asset's pattern of use. See Note 7, \"Fixed Assets\" for further details of useful lives.\nInternal Use Software.\n The Company capitalizes direct costs of services used in the development of, and external software acquired for use as, internal-use software. Amounts capitalized are amortized over a period ranging from \nthree\n to \nfive years\n, on a straight-line basis, unless another systematic and rational basis is more representative of the software's use. Amounts are reported as a component of Machinery and equipment.\n61\nTable of Contents\nAsset Retirement Obligations.\n The Company records the fair value of legal obligations associated with the retirement of tangible long-lived assets in the period in which the legal obligations are determined to exist. Upon initial recognition of a liability, the Company capitalizes the cost of the asset retirement obligation by increasing the carrying amount of the related long-lived asset. Over time, the liabilit\ny is adjusted for c\nhanges in its present value and the capitalized cost is depreciated over the useful life of the related asset.\nFair Value of Financial Instruments.\n The fair value hierarchy is based on inputs to valuation techniques that are used to measure fair value that are either observable or unobservable. Observable inputs reflect assumptions market participants would use in pricing an asset or liability based on market data obtained from independent sources, while unobservable inputs reflect a reporting entity’s pricing based upon their own market assumptions. The fair value hierarchy consists of the following three levels:\nLevel I – Quoted prices for identical instruments in active markets.\nLevel II – Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable.\nLevel III – Instruments whose significant value drivers are unobservable.\nThe carrying amount of current trade receivables, accounts payable and accrued expenses approximates fair value due to the short maturity (less than one year) of the instruments.\nEquity Method Investments.\n Entities in which we have the ability to exercise significant influence, but do not control, are accounted for under the equity method of accounting and are included in Other assets in the Consolidated Balance Sheets. Under this method of accounting, our share of the net earnings or losses of the investee entity is included in Other income (expense), net in the Consolidated Statements of Operations since the activities of the investee entity are closely aligned with the operations of the Company. We evaluate our equity method investments whenever events or changes in circumstance indicate that the carrying amounts of such investments may be impaired. If a decline in the value of an equity method investment is determined to be other than temporary, a loss is recorded in earnings in the current period.\nBusiness Combinations.\n We account for transactions that are classified as business combinations in accordance with the FASB ASC Topic 805: \nBusiness Combinations\n. Once a business is acquired, the fair values of the identifiable assets acquired and liabilities assumed are d\netermined with the excess cost recorded to goodwill. As required, preliminary fair values are determined once a business is acquired, with the final determination of the fair values being completed within the one-year measurement period from the date of acquisition.\nGoodwill, Intangible Assets and Long-Lived Assets. \nGoodwill represents costs in excess of fair values assigned to the underlying net assets of acquired businesses. Intangible assets consist of service portfolios, patents, trademarks/trade names, customer relationships and other intangible assets. Acquired intangible assets are recognized at fair value during acquisition accounting and then amortized to Cost of products and services sold and Selling, general and administrative over the applicable useful lives.\nGoodwill and Indefinite-Lived Intangible Assets. \nGoodwill and intangible assets deemed to have indefinite lives are not amortized. Goodwill and indefinite-lived intangible assets are subject to impairment testing annually or when a triggering event occurs using the guidance and criteria described in FASB ASC Topic 350: \nIntangibles – Goodwill and Other\n. This testing compares carrying values to fair values and, when appropriate, the carrying value of these assets is reduced to fair value.\n62\nTable of Contents\nWe test goodwill for impairment at a level within the Company referred to as the reporting unit, which is one level below the operating segment level. When testing goodwill for impairment, the Company may first assess qualitative factors. If an initial qualitative assessment identified that it is more likely than not that the fair value of a reporting unit is less than its carrying value, additional quantitative testing is performed. The Company may also elect to skip the qualitative testing and proceed directly to the quantitative testing. If the quantitative testing indicates that goodwill is impaired, an impairment charge is recognized based on the difference between the reporting unit's carrying value and its fair value. When it is determined that a quantitative analysis is required, the Company primarily utilizes a discounted cash flow methodology to calculate the fair value of its reporting units. \nThe Company completed its most recent annual impairment testing as of July 1, 2024, and determined in the qualitative assessment that quantitative testing is not necessary. There were no triggering events since the annual impairment test.\nFinite-Lived Intangible Assets and Long-Lived Assets.\n Useful lives of finite-lived intangible assets are estimated based upon the nature of the intangible asset. These intangible assets are amortized based on the pattern in which the economic benefits of the intangible assets are consumed or if straight-line amortization approximates the pattern of economic benefit, a straight-line amortization method may be used. \nThe range of estimated useful lives is as follows: \nPurchased service portfolios\n5\n to \n25\n years\nPatents, trademarks/trade names\n4\n to \n40\n years\nCustomer relationships and other\n1\n to \n20\n years\nThe Company evaluates the potential impairment of long-lived assets, including finite-lived intangible assets, whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable. If the carrying value of other long-lived assets h\neld and used exceeds the sum of the undiscounted expected future cash flows, the carrying value is written down to fair value. See Note 7, \"Fixed Assets\" and Note 8, \"\nBusiness Acquisitions, Dispositions, Goodwill and Intangible Assets\n\" for additional information regarding intangible assets and other long-lived asse\nts.\nIncome Taxes.\n In the ordinary course of business, there is inherent uncertainty in quantifying our income tax positions. We assess our income tax positions and record tax benefits for all years subject to examination based upon management’s evaluation of the facts, circumstances and information available at the reporting date. For those tax positions where it is more-likely-than-not that a tax benefit will be sustained, we have recorded the largest amount of tax benefit with a greater than 50% likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more-likely-than-not that a tax benefit will be sustained, no tax benefit has been recognized in the financial statements. Where applicable, associated interest expense has also been recognized. We recognize accrued interest related to unrecognized tax benefits in Interest expense (income), net. Penalties, if incurred, would be recognized as a component of Income tax expense.\nThe U.S. Tax Cuts and Jobs Act (\"TCJA\") subjects the Company to a tax on Global Intangible Low-Taxed Income (\"GILTI\"). GILTI is a tax on foreign income in excess of a deemed return on tangible assets of foreign corporations. We account for GILTI as a period cost as incurred.\nSee Note 15, \"Income Taxes\" for additional information.\nRevenue Recognition.\n We recognize revenue in accordance with FASB ASC Topic 606: \nRevenue from Contracts with Customers\n and its related amendments,\n \n(referred to, collectively, as \"ASC 606\"). The Company's revenue streams include new equipment, maintenance and repair, and modernization. New equipment, modernization and repair services revenue are recognized over time as we are enhancing an asset the customer controls. Maintenance revenue is recognized on a straight-line basis over the life of the maintenance contract.\nNew Equipment, Modernization and Repair Services. \nFor new equipment and modernization transactions, equipment and installation are typically procured in a single contract providing the customer with a complete installed elevator or escalator unit. The combination of equipment and installation promises are typically a single performance obligation. For repair services, the customer typically contracts for specific short-term services which form a single performance obligation.\n63\nTable of Contents\nFor these performance obligations, revenue is recognized over time using costs incurred to date relative to total estimated costs at completion to measure progress. Incurred costs represent work performed, which corresponds with and best depicts transfer of control or the enhancement of the customer’s assets. Contract costs included in the calculation are comprised of labor, materials, subcontractors’ costs or other direct costs and indirect costs, which include indirect labor costs. In developing our cost estimates, we utilize a combination of our historical cost experience and expected costs considering current circumstances. Specific to new equipment and modernization arrangements, the Company, based on project progression, reviews cost estimates for modification on significant contracts on a quarterly basis and when circumstances change, and\n for others, no less frequently than annually or when circumstances change and warrant a modification to a previous estimate. These estimates form the basis for the amount of revenue to be recognized and include the latest updated total transaction price, costs and risks for each contract. These estimates for our ongoing contracts may materially change due to the change and completions of the contract scopes, cost estimates and customers' plans, among other factors.\nFor performance obligations recognized under the cost to cost method, we record changes in contract estimates using the cumulative catch-up method. Modifications are recognized as a cumulative catch-up or treated as a separate accounting contract if the modification adds distinct goods or services and the modification is priced at its stand-alone selling price.\nMaintenance. \nOur customers purchase maintenance contracts which include services such as required periodic maintenance procedures, preventive services and stand ready obligations to remediate issues with the elevator/escalator when and if they arise. Given the continuous nature of these services throughout the year, we recognize revenue on maintenance contracts on a straight-line basis which aligns with the cost profile of these services. Contractual changes are typically recognized prospectively as most modifications are extensions of the existing arrangement.\nTransaction Price Considerations. \nOur contracts with customers typically include fixed payments to Otis. These fixed payments are generally received as we progress the performance obligations to the customers. As a result, we have not identified any significant financing elements in our contracts, and our contracts do not have significant estimates related to variable consideration except in the case of a project having an underlying performance issue, which is rare. In situations where multiple performance obligations in a single contract exist (e.g.\n, \nboth new equipment and maintenance)\n, the transaction price is allocated to each performance obligation in proportion to its stand-alone selling price. Estimates are made to account for changes in transaction prices attributable to pricing disputes that occur subsequent to the inception of contracts, based upon historical experience and the status of contracts.\nCertain Costs to Obtain or Fulfill Contracts\n. Certain costs to obtain or fulfill a contract with a customer must be capitalized, to the extent recoverable from the associated contract margin, and subsequently amortized as the products or services are delivered to the customer. Sales commissions related to new equipment, modernization and maintenance contracts, excluding renewals, are capitalized as contract fulfillment costs and are amortized consistent with the pattern of transfer of the goods or services. Customer contract costs, which do not qualify for capitalization as contract fulfillment costs, are expensed as incurred.\nLoss Contracts. \nLoss provisions on contracts are recognized to the extent that estimated contract costs exceed the estimated consideration from the products or services contemplated under the contractual arrangement. For new commitments, we generally record loss provisions at contract inception. For existing commitments, anticipated losses on contractual arrangements are recognized in the period in which losses become probable.\n64\nTable of Contents\nRemaining Performance Obligations (\"RPO\").\n RPO represents the aggregate amount of total contract transaction price that is unsatisfied or partially unsatisfied.\n As of December 31, 2024, our total RPO was approximately $\n17.6\n billion. Of the total RPO as of December 31, 2024, we expect approximately \n90\n% will be recognized as sales over the following \n24\n months.\nAdditional disclosure required by ASC 606 is provided in Note 22, \"Segment Financial Data\", including disaggregation of revenue into categories that depict how the nature, \namount, timing and uncertainty of revenue and cash flows are affected by economic factors.\nSupplier Finance Programs\n. Certain Otis subsidiaries participate in supplier finance programs, under which we agree to pay third-party financial institutions the stated amounts of confirmed invoices from suppliers on the original due date of the invoices, while the participating suppliers generally have the ability to sell, or otherwise pledge as collateral, their receivables from the Company to the participating financial institutions. Our obligations to suppliers, including the amounts due and scheduled payment dates, are not impacted by the suppliers' decisions to sell their receivables to the financial institutions, or otherwise pledge their receivables as collateral, under these arrangements. The Company is not a party to the arrangements between the suppliers and the financial institutions, and the Company's payment terms to the financial institutions, including the timing and amount of payments, are based on the original supplier invoices.\nBased on the applicable supplier agreements, the payment terms of these supplier invoices typically range between \n30\n and \n120\n days from the invoice date. Additionally, in 2024, we have initiated new programs with payment terms of \n240\n days from the invoice date.\nThe outstanding obligations confirmed by the Company as valid to the financial institutions under our supplier finance programs were $\n714\n million and $\n627\n million as of December 31, 2024 and \n2023\n, respectively, including $\n67\n million as of December 31, 2024 related to the new programs with payment terms of \n240\n days from the invoice date. These obligations are included in \nAccounts payable\n in the Consolidated Balance Sheets, and all activity related to the obligations is presented within operating activities in the Consolidated Statements of Cash Flows.\nThe Company or the financial institutions may terminate the agreements with advanced notice. Otis has pledged no assets in connection with its supplier finance programs.\nThe changes in outstanding obligations confirmed as valid by the Company under its supplier finance programs for 2024 are as follows:\n(dollars in millions)\n2024\nConfirmed obligations outstanding as of January 1\n$\n627\n \nInvoices confirmed during the year\n2,118\n \nConfirmed invoices paid during the year\n(\n2,013\n)\nForeign currency exchange impact\n(\n18\n)\nConfirmed obligations outstanding as of December 31\n$\n714\n \nSelf-Insurance.\n The Company is primarily self-insured for a number of risks including, but not limited to, workers’ compensation, general liability, automobile liability and employee-related healthcare benefits. The Company has obtained insurance coverage for amounts exceeding individual and aggregate loss limits. The Company accrues for known future claims and incurred but not reported losses wit\nhin Accrued liabilities and Other long-term liabilities in the Consolidated Balance Sheets, totaling \n$\n238\n million\n and $\n256\n million as of December 31, 2024 and 2023, respectively.\nDerivatives and Hedging Activity. \nWe have used derivative instruments, principally forward contracts, to help manage certain foreign currency and commodity price exposures. Derivative instruments are viewed as risk management tools by us and are not used for trading or speculative purposes. By their nature, all financial instruments involve market and credit risks. We enter into derivative and other financial instruments with major investment-grade financial institutions and have policies to monitor the credit risk of those counterparties. We limit counterparty exposure and concentration of risk by diversifying counterparties. While there can be no assurance, we do not anticipate any material non-performance by any of these counterparties.\nDesignated Derivative Instruments. \nDerivatives used for hedging purposes may be designated and effective as a hedge of the identified risk exposure at the inception of the contract. All derivative instruments are recorded in the Consolidated Balance Sheets at fair value. Derivatives are used to hedge foreign currency denominated balance sheet items and commodity prices for \n65\nTable of Contents\nmaterials recognized in cost of sales, and are reported directly in earnings along with offsetting transaction gains and losses on the items being hedged. Derivatives used to hedge forecasted cash flows associated with foreign currency commitmen\nts or forecasted commodity purchases m\nay be accounted for as cash flow hedges, as deemed appropriate. Gains and losses on derivatives designated as cash flow hedges are recorded in Other comprehensive income (loss), net of tax and reclassified to earnings as a component of product sales or expenses, as applicable, when the hedged transaction occurs. Gains and losses on derivatives designated as cash flow hedges are recorded in Other operating activities, net within the Consolidated Statement of Cash Flows until reclassification to earnings. To the extent that a previously designated hedging transaction is no longer an effective hedge, any ineffectiveness measured in the hed\nging relationship is recorded in earnings in the period it occurs. \nAdditional information pertaining to net investment hedging is included in Note 17, \"Financial Instruments\".\nNon-Designated Derivative Instruments. \nTo the extent the hedge accounting criteria are not applied, the foreign currency forward contracts and commodity price contracts are utilized as economic hedges and changes in the fair value of these contracts are recorded in earnings in the period in which they occur. Additional information pertaining to these contracts is included in Note 17, \"Financial Instruments\".\nIn addition, the Company periodically enters into sales contracts denominated in currencies other than the functional currency of the parties to the transaction. The Company accounts for these transactions separately valuing the embedded derivative component of these contracts. The changes in the fair value of these embedded derivatives are immaterial in 2024, 2023 and 2022.\nEnvironmental.\n Environmental investigatory, remediation, operating and maintenance costs are accrued when it is probable that a liability has been incurred and the amount can be reasonably estimated. The most likely cost to be incurred is accrued based on an evaluation of currently available facts with respect to each individual site, including current laws, regulations and prior remediation experience. Whe\nre no amount within a range of estimates is more likely, the minimum is accrued. Liabilities with fixed or reliably determinable future cash payments are discounted. Accrued environmental liabilities are not reduced by potential insurance reimbursements. See Note 21, \"Contingent Liabilities\" for additional details on the environmental remediation activities.\nResearch and Development.\n These costs are expensed in the period incurred and are shown on a separate line of the Consolidated Statements of Operations. Research and development expenses, covering research and the advancement of potential new and improved products and their uses, primarily include salaries and other employment costs.\nOther Income (Expense), Net.\n Other income (expense), net i\nncludes the impact of changes in the fair value and settlement of certain derivatives, gains or losses on sale of businesses and fixed assets, earnings from equity method investments, fair value changes on marketable securities, impairments, UpLift transformation costs, Separation-related adjustments, \ngains on insurance recoveries \nand certain other infrequent operating income and expense items.\n See Note 16, \"Restructuring and Transformation Costs\" for additional details on UpLift transformation costs.\nForeign Exchange. \nWe conduct business in many different currencies and, accordingly, are subject to the inherent risks associated with foreign exchange rate movements. The financial position and results of operations of substantially all of our foreign subsidiaries are measured using the local currency as the functional currency. Foreign currency denominated assets and liabilities are translated into U.S. dollars at the exchange rates existing at the respective balance sheet dates, and income and expense items are translated at the average exchange rates during the respective periods. The aggregate effects of translating the balance sheets of these subsidiaries are deferred within Accumulated other comprehensive income (loss).\nPension and Postretirement Obligations.\n Guidance under FASB ASC Topic 715: \nCompensation – Retirement Benefits\n requires balance sheet recognition of the overfunded or underfunded status of pension and postretirement benefit plans. Under this guidance, actuarial gains and losses, prior service costs or credits and any remaining transition assets or obligations that have not been recognized under previous accounting standards must be recognized in Other comprehensive income (loss), net of tax effects, until they are amortized as a component of net periodic benefit cost.\n See Note 12, \"Employee Benefit Plans\" for additional information.\nAdditional Paid-in Capital.\n Additional paid-in capital includes the value of stock-based award activity, as well as the difference between the cost of acquiring the Noncontrolling interest in consolidated subsidiaries and Otis' carrying value of the Noncontrolling interest associated with those subsidiaries.\n66\nTable of Contents\nThe Company recorded $\n18\n million in 2022 in Additional paid-in capital for transaction costs associated with the acquisition of shares of Otis Mobility (formerly Zardoya Otis) not owned by the Company. Refer to Note 1, \"Business Overview\" for additional information on the Tender Offer. There were \nno\n transaction costs recorded in Additional paid-in capital in 2024 and 2023.\nNoncontrolling Interest. \nOwnership interest in the Company's consolidated subsidiaries held by parties other than the Company are presented separately from Shareholders' Equity (Deficit) as \"Noncontrolling interest\" within equity in the Consolidated Balance Sheets. The amount of net income attributable to Otis Worldwide Corporation and the noncontrolling interest are both presented in the Consolidated Statements of Operations.\nAll noncontrolling interest with redemption features, such as put options or other contractual obligations to acquire the noncontrolling interest, that are not solely within our control are redeemable noncontrolling interest. Redeemable noncontrolling interest are reported in the mezzanine section of the Consolidated Balance Sheets, between Liabilities and Shareholders' Equity (Deficit), at the greater of redemption value or initial carrying value.\nThe activity attributable to noncontrolling interest and redeemable noncontrolling interest for 2024, 2023 and 2022 is presented in the Consolidated Statements of Changes in Equity.\nSeparation from UTC and Related Costs. \nThe Separation, as further described in Note 1, \"Business Overview\", was completed pursuant to a Separation and Distribution Agreement (\"Separation Agreement\") and other agreements with our former parent, UTC, and Carrier Global Corporation (\"Carrier\"), related to the Separation, including but not limited to a tax matters agreement (the \"Tax Matters Agreement\" or \"TMA\").\nWe entered into the TMA with our former parent UTC and Carrier that governs the parties’ respective rights, responsibilities and obligations with respect to tax matters (including responsibility for taxes, entitlement to refunds, allocation of tax attributes, preparation of tax returns, control of tax contests and other tax matters). Subject to certain exceptions set forth in the TMA, Otis generally is responsible for federal, state and foreign taxes imposed on a separate return basis on Otis (or any of its subsidiaries) with respect to taxable periods (or portions thereof) that ended on or prior to the date of the Distribution. The TMA provides special rules that allocate responsibility for tax liabilities arising from a failure of the Separation transactions to qualify for tax-free treatment based on the reasons for such failure.\nAccounting Pronouncements.\nIn March 2020, the FASB issued ASU 2020-04\n, \nReference Rate Reform (Topic 848):\n Facilitation of the Effects of Reference Rate Reform on Financial Reportin\ng (\"ASU 2020-04\")\n, \nwhich provides temporary optional expedients and exceptions for applying generally accepted accounting principles to contracts, hedging relationships and other transactions affected by reference rate reform if certain criteria are met. The amendments in ASU 2020-04 apply only to contracts, \nhedging relationships, and other transactions that reference LIBOR or another reference rate expected to be discontinued because of reference rate reform\n. Additionally, in December 2022, the FASB issued ASU 2022-06, Reference Rate Reform (Topic 848):\n Deferral of the Sunset Date of Topic 848 \n(\"ASU 2022-06\"), which allows ASU 2020-04 to be adopted and applied prospectively to contract modifications made on or before December 31, 2024. The adoption of this ASU did not have a material impact on our Consolidated Financial Statements.\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): \nAccounting for Contract Assets and Contract Liabilities from Contracts with Customers\n. This ASU clarifies that an acquirer of a business should recognize and measure contract assets and contract liabilities in a business combination in accordance with Accounting Standards Codification (\"ASC\") Topic 606, Revenue from Contracts with Customers. ASU 2021-08 is effective for fiscal years beginning after December 15, 2022, with early application permitted. The Company adopted ASU 2021-08 effective January 1, 2023. The adoption of this ASU did not have a material impact on our Consolidated Financial Statements.\n67\nTable of Contents\nIn September 2022, the FASB issued ASU 2022-04, \nLiabilities - Supplier Finance Programs (Topic 450-50)\n: \nDisclosure of Supplier Finance Program Obligations\n, which requires entities that use supplier finance programs in connection with the purchase of goods and services to disclose the key terms of the programs and information about obligations outstanding at the end of the reporting period, including a rollforward of those obligations. The guidance does not affect the recognition, measurement or financial statement presentation of supplier finance program obligations. ASU 2022-04 is effective for fiscal years beginning after December 15, 2022, except for the disclosure of rollforward information, which is effective for fiscal years beginning after December 15, 2023. The adoption of this ASU did not have a material impact on our Consolidated Financial Statements, as disclosed in Note 2, \"Summary of Significant Accounting Policies\" under the heading \"Supplier Finance Programs\".\nIn August 2023, the FASB issued ASU 2023-05, Business Combinations - Joint Ventures Formations (Subtopic 805-60): \nRecognition and initial measurement \n(\"ASU 2023-05\"), which requires that joint ventures, upon formation, apply a new basis of accounting by initially measuring assets and liabilities at fair value. The amendments in ASU 2023-05 are effective for joint ventures that are formed on or after January 1, 2025. Early adoption is permitted. We are currently evaluating the impact of this standard; however, we do not expect it to have a material impact on our Consolidated Financial Statements.\nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): \nImprovements to Reportable Segment Disclosures\n. The amendments in this update improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The amendments in ASU 2023-07 are effective for fiscal years beginning after December 15, 2023. Early adoption is permitted. We adopted this standard effective for the reporting period December 31, 2024. The adoption of this standard resulted in additional disclosure. See Note 22, \"Segment Financial Data\" for further details. \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): \nImprovements to Income Tax Disclosures\n. The amendments in this update address investor requests for more transparency about income tax information through improvements to income tax disclosures primarily related to the rate reconciliation and income taxes paid information. This update also includes certain other amendments to improve the effectiveness of income tax disclosures. The amendments in ASU 2023-09 are effective for fiscal years beginning after December 15, 2024. Early adoption is permitted. Adoption of this ASU will result in additional disclosure, but will not impact our consolidated financial position, results of operations, or cash flows.\nIn November 2024, the FASB issued ASU 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): \nDisaggregation of Income Statement Expenses\n. The amendments in this update require disclosure, in the notes to financial statements, on disaggregated information about specific categories underlying certain income statement expense line items that are considered relevant which among other items include items such as the purchase of inventory, employee compensation, depreciation, and intangible asset amortization. The amendments in ASU 2024-03 are effective for fiscal years beginning after December 15, 2026. Early adoption is permitted. Adoption of this ASU will result in additional disclosure, but will not impact our consolidated financial position, results of operations, or cash flows.\nOther new accounting pronouncements issued but not effective until after December 31, 2024 did not and are not expected to have a material impact on our financial position, results of operations or cash flows.\nNote 3: \nEarnings per Share\n(dollars in millions, except per share amounts; shares in millions)\n2024\n2023\n2022 \nNet income attributable to common shareholders\n$\n1,645\n \n$\n1,406\n \n$\n1,253\n \nBasic weighted average number of shares outstanding\n401.7\n \n411.4\n \n420.0\n \nStock awards and equity units (share equivalent) \n2.7\n \n3.2\n \n3.0\n \nDiluted weighted average number of shares outstanding\n404.4\n \n414.6\n \n423.0\n \nEarnings Per Share of Common Stock:\nBasic\n$\n4.10\n \n$\n3.42\n \n$\n2.98\n \nDiluted\n$\n4.07\n \n$\n3.39\n \n$\n2.96\n \nThe computation of diluted earnings per share excludes the effect of the potential exercise of stock awards, including stock appreciation rights and stock options, when the average market price of the Common Stock is lower than the exercise price of \n68\nTable of Contents\nthe related stock awards during the period because the effect would be anti-dilutive. In addition, the computation of diluted earnings per share excludes the effect of the potential exercise of stock awards when the awards' assumed proceeds exceed the average market price of the common shares during the period. Lastly, the computations of diluted earnings per share include outstanding awards granted prior to the Separation from UTC and converted upon the Separation, in accordance with the Employee Matters Agreement. There were \n0.7\n million, \n1.0\n million and \n2.3\n million of anti-dilutive stock awards excluded from the computation for 2024, 2023 and 2022 respectively.\nThe impact of redeemable noncontrolling interest to Net income attributable to common shareholders was immaterial for 2024, 2023, and 2022.\nNote 4: \nContract Assets and Liabilities\nContract assets reflect revenue recognized in advance of customer billings. Contract liabilities are recognized when a customer pays consideration, or we have an unconditional right to receive consideration, in advance of the satisfaction of performance obligations under the contract. We receive payments from customers based on the terms established in our contracts, which are payments in advance of performing work, progress payments as we perform contract work over time, or in some cases, payments upon completion of work.\nTotal Contract assets and Contract liabilities as of December 31, 2024 and 2023 are as follows:\n(dollars in millions)\n2024\n2023\nContract assets, current\n$\n706\n \n$\n717\n \nTotal contract assets\n706\n \n717\n \nContract liabilities, current\n2,598\n \n2,696\n \nContract liabilities, noncurrent (included within Other long-term liabilities)\n38\n \n48\n \nTotal contract liabilities \n2,636\n \n2,744\n \nNet contract liabilities\n$\n1,930\n \n$\n2,027\n \nContract assets decreased by $\n11\n million and Contract liabilities decreased by $\n108\n million during 2024, primarily as a result of the movement of foreign exchange rates. The balances were also impacted by the progression of current contracts and the timing of billing on customer contracts relative to the progression on the contracts, which were mostly offsetting during 2024.\nDuring 2024, 2023 and 2022, we recognized revenue of approximately $\n2.0\n billion each year related to the contract liabilities as of January 1, 2024, 2023, and 2022.\nNote 5: \nAccounts Receivable, Net\nAccounts receivable, net consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\nTrade receivables\n$\n3,285\n \n$\n3,390\n \nUnbilled receivables\n129\n \n119\n \nMiscellaneous receivables\n84\n \n96\n \nCustomer financing notes receivable\n55\n \n63\n \n3,553\n \n3,668\n \nLess: allowance for expected credit losses\n(\n125\n)\n(\n130\n)\nAccounts receivable, net\n$\n3,428\n \n$\n3,538\n \nCredit Losses.\n We are exposed to credit losses primarily through our net sales of products and services to our customers which are recorded as Accounts Receivable, net in the Consolidated Balance Sheets. We evaluate each customer's ability to pay through assessing customer creditworthiness, historical experience and current economic conditions through a reasonable forecast period. Factors considered in our evaluation of assessing collectability and risk include: underlying value of any \n69\nTable of Contents\ncollateral or security interests, significant past due balances, historical losses and existing economic conditions including country and political risk. There can be no assurance that actual results will not differ from estimates or that consideration of these factors in the future will not result in an increase or decrease to the allowance for credit losses. We may require collateral or prepayment to mitigate credit risk.\nWe estimate expected credit losses of financial assets with similar risk characteristics. We determine an asset is impaired when our assessment identifies there is a risk that we will be unable to collect amounts due according to the contractual terms of the agreement. We monitor our ongoing credit exposure through reviews of customer balances against contract terms and due dates, current economic conditions and dispute resolution. Estimated credit losses are written off in the period in which the financial asset is no longer collectible.\nThe changes in allowance for credit losses related to Accounts receivable, net for 2024, 2023 and 2022 are as follows:\n(dollars in millions)\n2024\n2023\n2022\nBalance as of January 1\n$\n130\n \n$\n152\n \n$\n175\n \nProvision for expected credit losses\n34\n \n29\n \n5\n \nWrite-offs charged against the allowance for expected credit losses\n(\n32\n)\n(\n48\n)\n(\n22\n)\nForeign exchange and other\n(\n7\n)\n(\n3\n)\n(\n6\n)\nBalance as of December 31\n$\n125\n \n$\n130\n \n$\n152\n \nNote 6: \nInventories\nInventories consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\nRaw materials and work-in-process\n$\n134\n \n$\n154\n \nFinished goods\n423\n \n458\n \nTotal\n$\n557\n \n$\n612\n \nRaw materials and work-in-process and finished goods are net of valuation write-downs of $\n82\n million and $\n87\n million as of December 31, 2024 and 2023, respectively.\nNote 7: \nFixed Assets\nFixed assets consisted of the following as of December 31:\n(dollars in millions)\nEstimated Useful Lives\n2024\n2023\nLand\n$\n38\n \n$\n40\n \nBuildings and improvements\n20\n - \n40\n Years\n516\n \n543\n \nMachinery and equipment\n3\n - \n12\n Years\n1,234\n \n1,270\n \nAssets under construction\n105\n \n106\n \n1,893\n \n1,959\n \nLess: Accumulated depreciation\n(\n1,192\n)\n(\n1,232\n)\nTotal\n$\n701\n \n$\n727\n \nDepreciation expense was $\n120\n million, $\n126\n million and $\n118\n million in 2024, 2023 and 2022, respectively.\n \nNote 8: \nBusiness Acquisitions, Dispositions, Goodwill and Intangible Assets\nBusiness Acquisitions.\n Our acquisitions of businesses and intangible assets, net of cash, totaled $\n87\n million, $\n36\n million and $\n46\n million (including debt assumed) in\n \n2024, 2023 and 2022, respectively, and were primarily in our Service segment. Transaction costs incurred were not considered significant.\n70\nTable of Contents\nGoodwill. \nChanges in our Goodwill balances in 2024 were as follows:\n(dollars in millions)\nBalance as of\nDecember 31, 2023\nGoodwill Resulting\nFrom Business Combinations\nForeign Currency\nTranslation \nand Other\nBalance as of December 31, 2024\nNew Equipment\n$\n295\n \n$\n—\n \n$\n(\n18\n)\n$\n277\n \nService\n1,293\n \n46\n \n(\n68\n)\n1,271\n \nTotal\n$\n1,588\n \n$\n46\n \n$\n(\n86\n)\n$\n1,548\n \nChanges in our Goodwill balances in 2023 were as follows:\n(dollars in millions)\nBalance as of\nDecember 31, 2022\nGoodwill Resulting\nFrom Business Combinations\nForeign Currency\nTranslation \nand Other\nBalance as of December 31, 2023\nNew Equipment\n$\n292\n \n$\n—\n \n$\n3\n \n$\n295\n \nService\n1,275\n \n7\n \n11\n \n1,293\n \nTotal\n$\n1,567\n \n$\n7\n \n$\n14\n \n$\n1,588\n \nIntangible Assets.\n \nIdentifiable intangible assets are comprised of the following:\n2024\n2023\n(dollars in millions)\nGross Amount\nAccumulated\nAmortization\nGross Amount\nAccumulated\nAmortization\nAmortized:\nPurchased service portfolios\n$\n1,930\n \n$\n(\n1,640\n)\n$\n1,989\n \n$\n(\n1,679\n)\nPatents, trademarks/trade names\n18\n \n(\n16\n)\n20\n \n(\n16\n)\nCustomer relationships and other\n52\n \n(\n39\n)\n56\n \n(\n42\n)\n2,000\n \n(\n1,695\n)\n2,065\n \n(\n1,737\n)\nUnamortized:\nTrademarks and other\n6\n \n—\n \n7\n \n— \nTotal\n$\n2,006\n \n$\n(\n1,695\n)\n$\n2,072\n \n$\n(\n1,737\n)\nAmortization of intangible assets was $\n62\n million, $\n67\n million and $\n73\n million in 2024, 2023 and 2022, respectively. Excluding the impact of acquisitions, currency translation adjustments and the reclassification of $\n16\n million of intangible assets, net to assets held for sale in 2024, there were no other significant changes in our Intangible Assets during 2024, 2023 and 2022.\nThe estimated future amortization of intangible assets over the next five years is as follows:\n(dollars in millions)\n2025\n2026\n2027\n2028\n2029\nFuture amortization\n$\n60\n \n$\n45\n \n$\n39\n \n$\n33\n \n$\n30\n \nDisposals and Held for Sale Assets and Liabilities.\n As of December 31, 2024, assets and liabilities held for sale were $\n38\n million and $\n9\n million, respectively, and are included in Other current assets and Accrued liabilities, respectively, in the Consolidated Balance Sheets. As of December 31, 2023, assets held for sale were $\n11\n million, and were included in Other current assets in the Consolidated Balance Sheets.\nAs of December 31, 2024, the assets and liabilities of one of our non-U.S. subsidiaries, primarily in the Service segment, are classified as assets and liabilities held for sale. It is the Company's intention to complete the sale of these assets and liabilities within the next 12 months. These assets and liabilities held for sale were $\n25\n million and $\n9\n million, respectively, as of December 31, 2024. In 2024, the Company recorded an impairment loss of $\n18\n million related to the net assets held for sale in Other expense (income), net in the Consolidated Statements of Operations.\n71\nTable of Contents\nOn July 27, 2022, we sold our business in Russia to a third party. In 2022, the Company recorded the loss on sale and related charges of $\n21\n million in Other expense (income), net in the Consolidated Statements of Operations.\n72\nTable of Contents\nNote 9: \nBorrowings and Lines of Credit\nShort-term borrowings consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\nCommercial paper\n$\n—\n \n$\n—\n \nOther borrowings\n51\n \n32\n \nTotal short-term borrowings\n$\n51\n \n$\n32\n \nCommercial Paper. \nAs of December 31, 2024, there were \nno\n borrowings outstanding under the Company's $\n1.5\n billion unsecured, unsubordinated commercial paper programs. We use our commercial paper borrowings for general corporate purposes including to finance acquisitions, pay dividends, repurchase shares and for debt refinancing. The need for commercial paper borrowings may arise if the use of domestic cash for general corporate purposes exceeds the sum of domestic cash generation and foreign cash repatriated to the U.S.\nLong-Term Debt. \nAs of December 31, 2024, we have a credit agreement (\"Credit Agreement\") with various banks providing for a $\n1.5\n billion unsecured, unsubordinated \nfive-year\n revolving credit facility, effective March 10, 2023, with an interest rate on US dollar denominated borrowings at Otis' option of the Term Secured Overnight Financing Rate (\"SOFR\") plus \n0.10\n% or a base rate, and an interest rate on Euro denominated borrowings at Otis' option of the EURIBO rate or a daily simple Euro Short Term Rate (\"ESTR\"), plus, in each case, an applicable margin. The applicable margin initially is \n1.25\n% for Term SOFR rate, EURIBO rate and daily simple ESTR rate borrowings, and \n0.25\n% for base rate borrowings, and can fluctuate determined by reference to Otis' public debt ratings, as specified in the Credit Agreement. As of December 31, 2024, there were \nno\n borrowings under the revolving credit facility. The undrawn portion of the revolving credit facility serves as a backstop for the issuance of commercial paper. On March 10, 2023, we terminated all commitments outstanding under the previous credit agreement, which was scheduled to expire on April 3, 2025.\nOn August 16, 2023, we issued $\n750\n million unsecured, unsubordinated \nfive-year\n notes due August 16, 2028 (the \"Notes\") with an interest rate of \n5.25\n%. The net proceeds of the Notes were used to fund the repayment of our outstanding commercial paper borrowings and to fund the repayment at maturity of the €\n500\n million \n0.000\n% Euro Notes due November 12, 2023, with the remainder used for other general corporate purposes.\nOn November 19, 2024, we issued $\n600\n million unsecured, unsubordinated \nseven-year\n notes due November 19, 2031 with an interest rate of \n5.125\n% and €\n850\n million Euro denominated ($\n899\n million), unsecured, unsubordinated \nthree-year\n notes due November 19, 2027 with an interest rate of \n2.875\n%. A portion of the net proceeds of the notes will be used to fund the repayment at maturity of the $\n1.3\n billion \n2.056\n% Notes due April 5, 2025. The remainder of the proceeds were used to fund the repayment of the Company's commercial paper borrowings and for other general corporate purposes.\nOur revolving credit agreement and indentures contain affirmative and negative covenants customary for financings of these types that, among other things, limit the Company's and its subsidiaries' ability to incur additional liens, to make certain fundamental changes and to enter into sale and leaseback transactions. In addition, the revolving credit agreement requires that we maintain a maximum consolidated leverage ratio, as defined in the agreement. The revolving credit agreement and indentures also contain events of default customary for financings of these types. The Company is in compliance with all covenants in the revolving credit agreement and the indentures governing all notes as of \nDecember 31, 2024.\n73\nTable of Contents\nLong-term debt, including current portion, consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\n2.056\n% notes due 2025 \n$\n1,300\n \n$\n1,300\n \n0.37\n% notes due 2026 ( ¥\n21.5\n billion principal value) \n137\n \n150\n \n0.318\n% notes due 2026 (€\n600\n million principal value) \n624\n \n658\n \n2.293\n% notes due 2027 \n500\n \n500\n \n2.875\n% notes due 2027 (€\n850\n million principal value)\n885\n \n—\n \n5.25\n% notes due 2028 \n750\n \n750\n \n2.565\n% notes due 2030 \n1,500\n \n1,500\n \n5.125\n% notes due 2031\n600\n \n—\n \n0.934\n% notes due 2031 (€\n500\n million principal value) \n520\n \n548\n \n3.112\n% notes due 2040 \n750\n \n750\n \n3.362\n% notes due 2050 \n750\n \n750\n \nOther (including finance leases)\n6\n \n4\n \nTotal principal long-term debt\n8,322\n \n6,910\n \nOther (discounts and debt issuance costs)\n(\n49\n)\n(\n44\n)\nTotal long-term debt\n8,273\n \n6,866\n \nLess: current portion\n1,300\n \n—\n \nLong-term debt, net of current portion\n$\n6,973\n \n$\n6,866\n \nWe may redeem any series of notes at our option pursuant to certain terms.\nDebt discounts and debt issuance costs are presented as a re\nduction of debt in the Consolidated Balance Sheets and are amortized as a component of interest expense over the term of the related debt using the effective interest method. \nThe Consolidated Statements of Operations for 2024, 2023 and 2022 reflects the following:\n(dollars in millions)\n2024\n2023\n2022\nDebt issuance costs amortization\n$\n8\n \n$\n7\n \n$\n8\n \nTotal interest expense on debt\n183\n \n155\n \n140\n \nThe unamortized debt issuance costs as of December 31, 2024 and 2023 were $\n45\n million and $\n42\n million, respectively.\nThe average maturity of our long-term debt as of December 31, 2024 is approximately \n6.5\n years. \nThe average interest expense rate on our borrowings as of December 31, 2024 and 2023 was as follows:\n2024\n2023\nShort-term commercial paper\n—\n \n%\n—\n \n%\nTotal long-term debt\n2.7\n \n%\n2.5\n \n%\nThe average interest expense rate on our borrowings for 2024, 2023 and 2022 was as follows:\n2024\n2023\n2022\nShort-term commercial paper\n5.4\n \n%\n5.1\n \n%\n2.3\n \n%\nTotal long-term debt\n2.5\n \n%\n2.1\n \n%\n2.0\n \n%\n74\nTable of Contents\nThe schedule of principal payments required on long-term debt, excluding finance leases, for the next five years and thereafter is:\n(dollars in millions)\nPrincipal Payments\n2025\n$\n1,300\n \n2026\n762\n \n2027\n1,385\n \n2028\n750\n \n2029\n—\n \nThereafter\n4,119\n \nTotal \n$\n8,316\n \nNote 10: \nAccrued Liabilities\nAccrued liabilities consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\nAccrued salaries, wages and employee benefits\n$\n579\n \n$\n592\n \nContractual indemnity obligations\n244\n \n46\n \nAccrued interest\n147\n \n205\n \nVAT and other non-income tax payables\n123\n \n116\n \nOperating lease liabilities\n120\n \n117\n \nAccrued income taxes payable\n75\n \n141\n \nOther liabilities\n633\n \n656\n \nTotal\n$\n1,921\n \n$\n1,873\n \nAccrued interest primarily consists of interest accrued for uncertain tax positions, as well as $\n64\n million and $\n58\n million of interest accrued for borrowings as of December 31, 2024 and 2023, respectively, as described in Note 9, \"Borrowings and Lines of Credit\". Accrued interest also included interest for the German tax litigation as of December 31, 2023, as described in Note 21, \"Contingent Liabilities\".\nAs of December 31, 2024, Contractual indemnity obligations includes a $\n194\n million payable to RTX, resulting from the outcome of the German tax litigation as described in Note 21, \"Contingent Liabilities\".\nNote 11: \nOther Long-Term Liabilities\nOther long-term liabilities consisted of the following as of December 31:\n(dollars in millions)\n2024\n2023\nGeneral, product and auto liability\n$\n137\n \n$\n139\n \nContractual indemnity obligations\n80\n \n149\n \nEmployee benefits\n92\n \n95\n \nOther liabilities\n74\n \n110\n \nTotal\n$\n383\n \n$\n493\n \nThe Contractual indemnity obligations consist of payables to RTX, resulting from\n the TMA\n. See Note 2, \"Summary of Significant Accounting Policies\" for further details.\n75\nTable of Contents\nNote 12: \nEmployee Benefit Plans\nThe Company sponsors numerous single-employer domestic and foreign employee benefit plans.\nEmployee Savings Plans. \nWe sponsor various employee savings plans. Our contributions to employer-sponsored defined contribution plans were $\n71\n million, $\n65\n million and $\n64\n million for 2024, 2023, and 2022, respectively.\nPension Plans. \nWe sponsor both funded and unfunded domestic and foreign defined benefit pension plans that cover a large number of our employees. While we sponsor domestic pension plans that provide retirement benefits to certain employees, they are not a material component of the projected benefit obligation. \nOur plans use a December 31 measurement date consistent with our fiscal year.\n(dollars in millions)\n2024\n2023\nChange in benefit obligation:\nBeginning balance\n$\n957\n \n$\n853\n \nService cost\n32\n \n29\n \nInterest cost\n32\n \n33\n \nActuarial (gain) loss\n25\n \n75\n \nBenefits paid\n(\n46\n)\n(\n35\n)\nNet settlement, curtailment and special termination benefits\n(\n9\n)\n(\n21\n)\nOther\n(\n42\n)\n23\n \nEnding balance\n$\n949\n \n$\n957\n \nChange in plan assets:\nBeginning balance\n$\n609\n \n$\n589\n \nActual return on plan assets\n57\n \n13\n \nEmployer contributions\n51\n \n48\n \nBenefits paid\n(\n46\n)\n(\n35\n)\nSettlements\n(\n9\n)\n(\n21\n)\nOther\n(\n25\n)\n15\n \nEnding balance\n$\n637\n \n$\n609\n \nFunded status:\nFair value of plan assets\n$\n637\n \n$\n609\n \nBenefit obligations\n(\n949\n)\n(\n957\n)\nFunded status of plan\n$\n(\n312\n)\n$\n(\n348\n)\nAmounts recognized in the Consolidated Balance Sheets consist of:\nNoncurrent assets\n$\n115\n \n$\n98\n \nCurrent liability\n(\n28\n)\n(\n23\n)\nNoncurrent liability\n(\n399\n)\n(\n423\n)\nNet amount recognized\n$\n(\n312\n)\n$\n(\n348\n)\nAmounts recognized in Accumulated other comprehensive loss consist of:\nNet actuarial loss\n$\n98\n \n$\n103\n \nPrior service cost\n1\n \n1\n \nNet amount recognized\n$\n99\n \n$\n104\n \nThe amounts included in \"actuarial (gain) loss\" in the above table are primarily due to changes in discount rate assumptions driven by changes in corporate bond yields. The amounts included in \"Other\" in the above table primarily reflect the impact of foreign exchange translation, primarily for plans in Australia, Canada, France, Germany, Japan, South Korea, Spain and Switzerland.\n76\nTable of Contents\nIn 2024, 2023 and 2022 we made cash contributions to our defined benefit pension plans of $\n51\n million, $\n48\n million and $\n33\n million, respectively.\nInformation for pension plans with accumulated benefit obligations or projected benefit obligations in excess of plan assets as of December 31 are as follows:\n(dollars in millions)\n2024\n2023\nPension plans with accumulated benefit obligations in excess of plan assets:\nProjected benefit obligation\n$\n397\n \n$\n628\n \nAccumulated benefit obligation\n353\n \n555\n \nFair value of plan assets\n3\n \n192\n \nPension plans with projected benefit obligations in excess of plan assets:\nProjected benefit obligation\n$\n707\n \n$\n704\n \nAccumulated benefit obligation\n609\n \n605\n \nFair value of plan assets\n280\n \n257\n \nThe accumulated benefit obligation for all defined benefit pension plans was approximately $\n0.8\n billion as of December 31, 2024 and 2023.\nThe components of the net periodic pension cost are as follows:\n(dollars in millions)\n2024\n2023\n2022\nService cost\n$\n32\n \n$\n29\n \n$\n39\n \nInterest cost\n32\n \n33\n \n16\n \nExpected return on plan assets\n(\n34\n)\n(\n31\n)\n(\n25\n)\nRecognized actuarial net loss\n1\n \n(\n1\n)\n10\n \nNet settlement, curtailment and special termination benefits loss (gain)\n1\n \n4\n \n—\n \nNet periodic pension cost – employer\n$\n32\n \n$\n34\n \n$\n40\n \nOther changes in plan assets and benefit obligations recognized in other comprehensive loss are as follows:\n(dollars in millions)\n2024\n2023\n2022\nCurrent year actuarial (gain) loss\n$\n2\n \n$\n93\n \n$\n(\n144\n)\nAmortization of actuarial gain (loss)\n—\n \n1\n \n(\n10\n)\nNet settlement and curtailment (loss) gain\n(\n1\n)\n(\n4\n)\n—\n \nOther\n(\n6\n)\n1\n \n(\n11\n)\nTotal recognized in other comprehensive (income) loss\n$\n(\n5\n)\n$\n91\n \n$\n(\n165\n)\nNet recognized in net periodic pension cost and other comprehensive (income) loss\n$\n27\n \n$\n125\n \n$\n(\n125\n)\nThe amounts included in \"Other\" in the above table primarily reflect the impact of foreign exchange translation, primarily for plans in Canada, Germany, South Korea, Switzerland, and Turkey.\n77\nTable of Contents\nMajor assumptions used in determining the benefit obligation and net cost for pension plans are presented in the following table as weighted-averages:\nBenefit Obligation\nNet Cost\n2024\n2023\n2024\n2023\n2022\nDiscount rate\n3.3\n \n%\n3.4\n \n%\n3.4\n \n%\n3.8\n \n%\n1.5\n \n%\nSalary scale\n3.1\n \n%\n3.2\n \n%\n3.2\n \n%\n3.1\n \n%\n3.0\n \n%\nExpected return on plan assets\n—\n \n—\n \n5.3\n \n%\n5.1\n \n%\n4.2\n \n%\nInterest crediting rate\n1.8\n \n%\n1.7\n \n%\n1.7\n \n%\n2.1\n \n%\n1.2\n \n%\nThe weighted-average discount rates used to measure pension benefit obligations and net costs are set by reference to specific analyses using each plan’s specific cash flows and then compared to high-quality bond indices for reasonableness.\nIn determining the expected return on plan assets, we consider the relative weighting of plan assets, the historical performance of total plan assets and individual asset classes, and economic and other indicators of future performance. In addition, we may consult with, and consider the opinions of, financial and other professionals in developing appropriate capital market assumptions. Return projections are also validated using a simulation model that incorporates yield curves, credit spreads and risk premiums to project long-term prospective returns.\nThe plans’ investment management objectives include providing the liquidity and asset levels needed to meet current and future benefit payments, while maintaining a prudent degree of portfolio diversification considering interest rate risk and market volatility. Globally, investment strategies target a mix of approximately 50% of growth-seeking assets and 50% of income-generating and hedging assets using a wide diversification of asset types, fund strategies and investment managers. The growth seeking allocation consists of global public equities in developed and emerging countries, and alternative-asset class strategies. Within the income-generating assets, the fixed income portfolio consists of mainly government and broadly diversified high-quality corporate bonds.\nThe fair values of pension plan assets as of December 31, 2024 by asset category are as follows:\n(dollars in millions)\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant Observable Inputs\n(Level 2)\nSignificant Unobservable Inputs\n(Level 3)\nNot Subject to Leveling\nTotal\nAsset category\nPublic equities:\nGlobal Equity Commingled Funds \n(1)\n$\n72\n \n$\n3\n \n$\n—\n \n$\n—\n \n$\n75\n \nGlobal Equity Funds at net asset value \n(5)\n—\n \n—\n \n—\n \n143\n \n143\n \nFixed income securities:\nGovernments\n14\n \n2\n \n—\n \n—\n \n16\n \nCorporate Bonds\n44\n \n—\n \n—\n \n—\n \n44\n \nFixed income securities at net asset value \n(5)\n—\n \n—\n \n—\n \n140\n \n140\n \nReal estate \n(2) (5)\n12\n \n17\n \n—\n \n9\n \n38\n \nOther \n(3) (5)\n5\n \n122\n \n—\n \n23\n \n150\n \nCash and cash equivalents \n(4) (5)\n27\n \n—\n \n—\n \n3\n \n30\n \nTotal\n$\n174\n \n$\n144\n \n$\n—\n \n$\n318\n \n636\n \nOther assets and liabilities \n(6)\n1\n \nTotal as of December 31, 2024\n$\n637\n \n(1)\n Represents investments in mutual funds and investments in commingled funds that invest primarily in common stocks.\n(2)\n Represents investments in real estate including commingled funds.\n(3)\n Represents insurance contracts and global-balanced-risk commingled funds consisting mainly of equity, bonds and some commodities.\n78\nTable of Contents\n(4)\n Represents short-term commercial paper, bonds and other cash or cash-like instruments.\n(5)\n In accordance with FASB ASU 2015-07, Fair Value Measurement (Topic 820), certain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the amounts presented for the total pension benefits plan assets.\n(6)\n Represents trust receivables and payables that are not leveled.\nThe fair values of pension plan assets as of December 31, 2023 by asset category are as follows:\n(dollars in millions)\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\nSignificant Observable Inputs\n(Level 2)\nSignificant Unobservable Inputs\n(Level 3)\nNot Subject to Leveling\nTotal\nAsset category\nPublic equities:\nGlobal Equity Commingled Funds \n(1)\n$\n66\n \n$\n2\n \n$\n—\n \n$\n—\n \n$\n68\n \nGlobal Equity Funds at net asset value \n(5)\n—\n \n—\n \n—\n \n138\n \n138\n \nFixed income securities:\nGovernments\n14\n \n1\n \n—\n \n—\n \n15\n \nCorporate Bonds\n42\n \n1\n \n—\n \n—\n \n43\n \nFixed income securities at net asset value \n(5)\n—\n \n—\n \n—\n \n101\n \n101\n \nReal estate \n(2) (5)\n9\n \n16\n \n—\n \n9\n \n34\n \nOther \n(3) (5)\n5\n \n122\n \n—\n \n27\n \n154\n \nCash and cash equivalents \n(4) (5)\n15\n \n—\n \n—\n \n40\n \n55\n \nTotal\n$\n151\n \n$\n142\n \n$\n—\n \n$\n315\n \n$\n608\n \nOther assets and liabilities \n(6)\n1\n \nTotal as of December 31, 2023\n$\n609\n \n(1)\n Represents investments in mutual funds and investments in commingled funds that invest primarily in common stocks.\n(2)\n Represents investments in real estate including commingled funds.\n(3)\n Represents insurance contracts and global-balanced-risk commingled funds consisting mainly of equity, bonds and some commodities.\n(4)\n Represents short-term commercial paper, bonds and other cash or cash-like instruments.\n(5)\n In accordance with FASB ASU 2015-07, Fair Value Measurement (Topic 820), certain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the amounts presented for the total pension benefits plan assets.\n(6)\n Represents trust receivables and payables that are not leveled.\nQuoted market prices are used to value investments when available. Investments in securities traded on exchanges, including listed futures and options, are valued at the last reported sale prices on the last business day of the year or, if not available, the last reported bid prices. Fixed income securities are primarily measured using a market approach pricing methodology, where observable prices are obtained by market transactions involving identical or comparable securities of issuers with similar credit ratings. Over-the-counter securities and government obligations are valued at the bid prices or the average of the bid and ask prices on the last business day of the year from published sources or, if not available, from other sources considered reliable, generally broker quotes. Temporary cash investments are stated at cost, which approximates fair value.\nWe expect to make total contributions of approximately $\n44\n million to our global defined benefit pension plans in 2025, including benefit payments to be paid directly from corporate assets.\nBenefit payments, including amounts to be paid from corporate assets, and reflecting expected future service, as appropriate, are expected to be paid as follows: $\n77\n million in 2025, $\n64\n million in 2026, $\n64\n million in 2027, $\n64\n million in 2028, $\n62\n million in 2029, and $\n326\n million from 2030 through 2034.\n79\nTable of Contents\nPostretirement Benefit Plans.\n We sponsor postretirement benefit plans that provide health benefits to eligible retirees. The postretirement plans are unfunded. The benefit obligation was $\n6\n million and $\n7\n million as of December 31, 2024, and 2023, respectively. The net periodic cost was less than $\n1\n million for 2024, 2023 and 2022. Other comprehensive losses of $\n1\n million were recognized during 2024 and 2023, related to changes in benefit obligations.\nThe projected benefit obligation discount rate was \n6.8\n% and \n7.2\n% as of December 31, 2024 and 2023, respectively. The Net Cost discount rate was \n7.2\n%, \n7.0\n% and \n5.0\n% for 2024, 2023 and 2022, respectively.\nBenefit payments, including amounts to be paid from corporate assets, and reflecting expected future service, as appropriate, are expected to be paid as follows: $\n1\n million each year from 2025 through 2029, and $\n3\n million from 2030 through 2034.\nMultiemployer Benefit Plans.\n We contribute to various domestic and international multiemployer defined benefit pension plans. The risks of participating in these multiemployer plans are different from single-employer plans in that assets contributed are pooled and may be used to provide benefits to employees of other participating employers. If a participating employer stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers. Lastly, if we choose to stop participating in some of our multiemployer plans, we may be required to pay those plans a withdrawal liability based on the underfunded status of the plan.\nOur participation in these plans for the annual periods ended December 31 is outlined in the table below. Unless otherwise noted, the most recent Pension Protection Act (\"PPA\") zone status available in 2024 and 2023 is for the plan’s year-end at June 30, 2023 and June 30, 2022, respectively. The zone status is based on information that we received from the plan and is certified by the plan’s actuary. Our significant plan is in the green zone which represents a plan that is at least 80% funded and does not require a financial improvement plan (\"FIP\") or a rehabilitation plan (\"RP\").\n(dollars in millions)\nPPA Zone Status\nFIP/RP Status\nContributions\nSurcharge Imposed\nExpiration Date of Collective-Bargaining Agreement\nPension Fund\nEIN/Pension Plan Number\n2024\n2023\nPending/Implemented\n2024\n2023\n2022\nNational Elevator Industry Pension Plan\n23-2694291\nGreen\nGreen\nNo\n$\n134\n$\n128\n \n$\n112\n \nNo\n7/8/2027\nOther funds\n9\n9\n \n8\n \nTotal\n$\n143\n$\n137\n \n$\n120\n \nFor the plan years ended June 30, 2023 and 2022, respectively, we were listed in the National Elevator Industry Pension Plan’s Forms 5500 as providing more than 5% of the total contributions for the plan. At the date these financial statements were issued, the Form 5500 was not available for the plan year ending June 30, 2024.\nIn addition, we participate in multiemployer arrangements that provide postretirement benefits other than pensions, with the National Elevator Industry Health Benefit Plan being the most significant. These arrangements generally provide medical and life benefits for eligible active employees and retirees and their dependents. Contributions to multiemployer plans that provide postretirement benefits other than pensions were $\n20\n million, $\n20\n million and $\n17\n million for 2024, 2023 and 2022, respectively.\nStock-Based Compensation.\n The Company adopted the 2020 Long-Term Incentive Plan (the \"Plan\") effective on April 3, 2020. A total of \n45\n million shares of common stock are authorized under the Plan. The Plan provides for the grant of various types of awards including restricted share unit awards, stock appreciation rights, stock options, and performance-based awards. Under the Plan, the exercise price of awards, if any, is set on the grant date and may not be less than the fair market value per share on that date. Generally, stock appreciation rights and stock options have a term of \nten years\n and a \nthree-year\n vesting period, subject to limited exceptions. In the event of retirement, annual stock appreciation rights, stock options, and restricted share units held for more than one year may become vested and exercisable (if applicable), subject to certain terms and conditions. Awards with performance-based vesting generally have a minimum \nthree-year\n vesting period and vest based on actual performance against pre-established metrics. In the event of retirement, performance-based awards held for more than one year generally remain eligible to vest based on actual performance relative to target metrics. All other restricted awards generally have a \nthree-year\n vesting period. We currently intend to issue new shares for share option exercises and conversions under our equity compensation arrangements, and will continue to evaluate this policy in connection with our share repurchase program. As of December 31, 2024, approximately \n19\n million shares remain available for awards under the 2020 Plan.\n80\nTable of Contents\nStock-based Compensation Expense\nWe measure the cost of all share-based payments, including stock options, at fair value on the grant date and recognize this cost in the Consolidated Statements of Operations. A forfeiture rate assumption is applied on grant date to adjust the expense recognition for awards that are not expected to vest.\nStock-based compensation expense, net of estimated forfeitures, is primarily reflected in Selling, General and administrative expenses in the Consolidated Statements of Operations, in addition to Cost of products sold, Cost of services sold and Research and development.\nStock-based compensation expense and the resulting tax benefits in 2024, 2023 and 2022 were as follows:\n(dollars in millions)\n2024\n2023\n2022\nStock-based compensation expense (Share Based)\n$\n73\n \n$\n64\n \n$\n67\n \nStock-based compensation expense (income) (Liability Awards)\n—\n \n—\n \n(\n1\n)\nTotal gross stock-based compensation expense\n73\n \n64\n \n66\n \nLess: future tax benefit\n(\n7\n)\n(\n7\n)\n(\n8\n)\nStock-based compensation expense, net of tax\n$\n66\n \n$\n57\n \n$\n58\n \nFor 2024, 2023 and 2022, the amount of cash received from the exercise of stock options was $\n4\n million, $\n6\n million and $\n5\n million, respectively, with an associated tax benefit realized of $\n11\n million, $\n6\n million and $\n2\n million, respectively. In addition, for 2024, 2023 and 2022, the associated tax benefit realized from the vesting of performance share units and other restricted awards was $\n10\n million, $\n9\n million and $\n7\n million, respectively. The tax benefit was computed using current U.S. federal and state taxes rates applicable in 2024, 2023 and 2022.\nAs of December 31, 2024, there was approximately $\n101\n million of total unrecognized compensation cost related to non-vested equity awards granted under the Plan. This cost is expected to be recognized ratably over a weighted-average period of \n2.0\n years.\nA summary of the activity under Otis' plans for 2024 follows:\nStock Appreciation Rights\nRestricted Share Units\nPerformance Share Units\nStock Options\n(shares in thousands)\nShares\nAverage Price*\nShares\nAverage Price**\nShares\nAverage Price **\nShares\nAverage Price *\nOutstanding at:\nDecember 31, 2023\n7,741\n \n$\n67.55\n \n862\n \n$\n78.60\n \n844\n \n$\n80.30\n \n188\n \n$\n62.94\n \nGranted \n(1)\n661\n \n92.10\n \n582\n \n94.95\n \n767\n \n85.74\n \n5\n \n91.94\n \nExercised / Earned \n(1)\n(\n2,348\n)\n63.47\n \n(\n449\n)\n79.05\n \n(\n595\n)\n67.61\n \n(\n69\n)\n55.49\n \nCancelled\n(\n108\n)\n84.50\n \n(\n52\n)\n86.81\n \n(\n63\n)\n87.87\n \n—\n \n—\n \nDecember 31, 2024\n5,946\n$\n71.58\n \n943\n \n$\n88.01\n \n953\n \n$\n92.08\n \n124\n \n$\n68.21\n \n* \nWeighted-average grant price\n** \nWeighted-average grant fair value\n(1) \nIncludes annual retainer awards issued to the Board of Directors\n81\nTable of Contents\nThe weighted-average grant date fair value of stock options and stock appreciation rights granted by Otis, during 2024, 2023 and 2022 was $\n24.34\n, $\n24.67\n and $\n20.14\n, respectively. The weighted-average grant date fair value of performance share units, which vest upon achieving certain performance metrics, and other restricted stock awards granted by Otis during 2024, 2023 and 2022 was $\n89.54\n, $\n84.88\n and $\n81.67\n, respectively. The total intrinsic value (which is the amount by which the stock price exceeded the exercise price on the date of exercise) of stock options and stock appreciation rights exercised during 2024, 2023 and 2022 was $\n78\n million, $\n65\n million and $\n35\n million, respectively. The total fair value (which is the stock price at vesting) of performance share units and other restricted awards vested was $\n95\n million, $\n75\n million and $\n53\n million during 2024, 2023 and 2022, respectively.\nThe following table summarizes information about equity awards outstanding that are vested and expected to vest and equity awards outstanding that are exercisable as of December 31, 2024:\nEquity Awards Vested and Expected to Vest\nEquity Awards That Are Exercisable\n(shares in thousands; aggregate intrinsic value in millions)\nAwards\nAverage Price *\nAggregate Intrinsic Value\nRemaining Term **\nAwards\nAverage Price *\nAggregate Intrinsic Value\nRemaining Term **\nStock Options/Stock Appreciation Rights\n6,043\n \n$\n71.43\n \n$\n128\n \n5.0\n years\n4,968\n \n$\n67.87\n \n$\n123\n \n4.2\n years\nPerformance Share Units/Restricted Share Units\n1,823\n \n—\n$\n169\n \n1.3\n years\n—\n \n—\n \n—\n—\n \n* \nWeighted-average grant price per share \n** \nWeighted-average contractual remaining term in years\n \nThe fair value of each option award is estimated on the date of grant using a Binomial Lattice model. \nThe following table indicates the assumptions used in estimating fair value for 2024, 2023 and 2022. Lattice-based option models incorporate ranges of assumptions for inputs; those ranges are as follows:\n2024\n2023\n2022\nExpected volatility\n26.1\n% - \n26.8\n%\n27.8\n% - \n28.1\n%\n26.7\n% - \n27.7\n%\nWeighted-average volatility\n26.8\n%\n27.9\n%\n26.8\n%\nExpected term (in years)\n5.3\n6.2\n6.2\nExpected dividend yield\n1.6\n%\n1.5\n%\n1.2\n%\nRisk-free rate\n3.6\n% - \n3.7\n%\n3.4\n% - \n4.7\n%\n0.0\n% - \n4.1\n%\nStarting in 2023, the expected volatility for Otis was calculated using a blend of Otis and peer-group stock volatility. Prior to 2023, we assessed the trading history of Otis' stock at the time of the valuations and determined that the trading history was not sufficient to support the award valuation, given the length of the expected term. Therefore, the expected volatility prior to 2023 for Otis was calculated based on the average of the volatility of the peer group within the industry. The estimate for equity award exercise and employee termination behavior within the valuation model incorporates Otis employee data from prior to the Separation. The expected term represents an estimate of the period of time equity awards are expected to remain outstanding. The risk-free rate is based on the term structure of interest rates at the time of equity award grant. \nThe Company uses a Monte Carlo simulation approach based on a three-year measurement period to determine fair value of performance share units. This approach includes the use of assumptions regarding the future performance of the Company’s stock and those of a peer group. Those assumptions include expected volatility, risk-free interest rates, correlations and dividend yield.\nNote 13: \nStock\nPreferred Stock.\n There are \n125\n million shares of $\n0.01\n par value authorized Preferred Stock, of which \nnone\n were issued or outstanding as of December 31, 2024 or 2023.\nCommon Stock.\n There are \n2.0\n billion shares of $\n0.01\n par value Common Stock authorized. As of December 31, 2024 and 2023, \n438.6\n million and \n437.0\n million shares of Common Stock were issued, respectively, which includes \n41.0\n million and \n30.4\n million shares of treasury stock, respectively.\n82\nTable of Contents\nTreasury Stock.\n As of December 31, 2024, the Company was authorized by the Board of Directors to purchase up to $\n2.0\n billion of Common Stock under a share repurchase program, of which approximately $\n200\n million was remaining at such time. \nDuring 2024, 2023 and 2022, the Company repurchased \n10.6\n million, \n9.6\n million and \n11.1\n million shares of Common Stock, respectively, for approximately $\n1.0\n billion, $\n800\n million and $\n850\n million, respectively. Beginning January 1, 2023, share repurchases in excess of issuances are subject to a \n1\n% excise tax, which is included as part of the cost basis of the shares acquired in Treasury Stock in the Consolidated Balance Sheets as of December 31, 2024 and 2023, as well as within financing activities in the Consolidated Statements of Cash Flows when paid.\nOn January 16, 2025, our Board of Directors revoked the remaining share repurchase authority under the prior share repurchase program and approved a new share repurchase program for up to $\n2.0\n billion of Common Stock. \nThe Company's share repurchase program does not obligate it to acquire any specific number of shares. Under this program, shares may be purchased on the open market, in privately negotiated transactions, under accelerated share repurchase programs or under plans complying with Rules 10b5-1 and 10b-18 under the Securities Exchange Act of 1934, as amended.\nNote 14: \nAccumulated Other Comprehensive Income (Loss)\nA summary of the changes in each component of Accumulated other comprehensive income (loss), net of tax, for 2024, 2023 and 2022 is provided below:\n(dollars in millions)\nForeign\nCurrency\nTranslation\nDefined Benefit\nPension and\nPostretirement\nPlans\nUnrealized\nHedging\nGains (Losses)\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nBalance as of December 31, 2021\n$\n(\n642\n)\n$\n(\n128\n)\n$\n7\n \n$\n(\n763\n)\nOther comprehensive income (loss) before reclassifications, net\n47\n \n113\n \n(\n3\n)\n157\n \nAmounts reclassified upon change in Otis' share of Zardoya Otis ownership (Note 1)\n(\n69\n)\n—\n \n—\n \n(\n69\n)\nAmounts reclassified, pre-tax\n77\n \n10\n \n(\n1\n)\n86\n \nTax expense (benefit) reclassified\n—\n \n(\n3\n)\n—\n \n(\n3\n)\nBalance as of December 31, 2022\n(\n587\n)\n(\n8\n)\n3\n \n(\n592\n)\nOther comprehensive income (loss) before reclassifications, net\n(\n87\n)\n(\n69\n)\n6\n \n(\n150\n)\nAmounts reclassified, pre-tax\n1\n \n(\n1\n)\n(\n8\n)\n(\n8\n)\nTax expense (benefit) reclassified\n—\n \n—\n \n—\n \n—\n \nBalance as of December 31, 2023\n(\n673\n)\n(\n78\n)\n1\n \n(\n750\n)\nOther comprehensive income (loss) before reclassifications, net\n1\n \n2\n \n2\n \n5\n \nAmounts reclassified, pre-tax\n—\n \n—\n \n—\n \n—\n \nTax expense (benefit) reclassified\n—\n \n—\n \n—\n \n—\n \nBalance as of December 31, 2024\n$\n(\n672\n)\n$\n(\n76\n)\n$\n3\n \n$\n(\n745\n)\nAmounts reclassified that relate to defined benefit pension and postretirement plans include amortization of prior service costs and actuarial net losses recognized during each period presented. These costs are recorded as components of net periodic pension cost for each period presented\n. See Note 12, \"E\nmployee Benefit Plans\" for additional information.\nAmounts reclassified in 2022 for foreign currency translation are related to our Russia business. See Note 8, \"Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" for additional information regarding the sale of our Russia business.\n83\nTable of Contents\nNote 15: \nIncome Taxes\nIncome Before Income Taxes. \nThe sources of income from operations before income taxes are:\n(dollars in millions)\n2024\n2023\n2022\nUnited States\n$\n505\n \n$\n565\n \n$\n484\n \nForeign\n1,534\n \n1,466\n \n1,404\n \nNet income before income taxes\n$\n2,039\n \n$\n2,031\n \n$\n1,888\n \nAs a result of the TCJA the Company determined it no longer intends to reinvest certain undistributed earnings of its international subsidiaries that have been previously taxed in the U.S. As such, Otis recorded the international taxes associated with the future remittance of these earnings as part of the Separation from UTC. For the remainder of the Company's undistributed international earnings, unless tax effective to repatriate, Otis will continue to permanently reinvest these earnings. As of December 31, 2024, such undistributed earnings were approximately $\n7.2\n billion, excluding other comprehensive income amounts. It is not practicable to estimate the amount of tax that might be payable on the remaining amounts.\nProvision for Income Taxes. \nThe income tax expense (benefit) for 2024, 2023 and 2022 consisted of the following components:\n(dollars in millions)\n2024\n2023\n2022\nCurrent:\nUnited States:\nFederal\n$\n74\n \n$\n82\n \n$\n68\n \nState\n45\n \n50\n \n43\n \nForeign\n217\n \n462\n \n424\n \n336\n \n594\n \n535\n \nFuture:\nUnited States:\nFederal\n(\n11\n)\n(\n24\n)\n(\n4\n)\nState\n(\n1\n)\n(\n5\n)\n(\n1\n)\nForeign\n(\n19\n)\n(\n32\n)\n(\n11\n)\n(\n31\n)\n(\n61\n)\n(\n16\n)\nIncome tax expense\n$\n305\n \n$\n533\n \n$\n519\n \nAttributable to items (charged) credited to (deficit) equity\n$\n(\n6\n)\n$\n16\n \n$\n(\n50\n)\nReconciliation of Effective Income Tax Rate. \nDifferences between effective income tax rates and the statutory U.S. federal income tax rate are as follows: \n2024\n2023\n2022\nStatutory U.S. federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income taxes\n1.7\n \n%\n1.8\n \n%\n1.7\n \n%\nTax on international activities\n(\n8.4\n)\n%\n4.3\n \n%\n4.6\n \n%\nU.S. tax effect of foreign earnings\n(\n1.0\n)\n%\n(\n0.8\n)\n%\n0.3\n \n%\nSeparation-related indemnity payments\n1.8\n \n%\n—\n \n%\n—\n \n%\nOther\n(\n0.1\n)\n%\n(\n0.1\n)\n%\n(\n0.1\n)\n%\nEffective income tax rate\n15.0\n \n%\n26.2\n \n%\n27.5\n \n%\nU.S. tax effect of foreign earnings includes Base Erosion Anti Abuse Tax (\"BEAT\"), Foreign-Derived Intangible Income (\"FDII\"), Global Intangible Low-Taxed Income (\"GILTI\"), and Subpart F Income.\n84\nTable of Contents\nThe Separation-related indemnity payments represent nondeductible payments due to our former parent.\nThe 2024 effective tax rate is lower than the 2023 effective tax rate and the statutory U.S. rate primarily due to recognition of estimated tax benefits arising as a result of the resolution of the German tax litigation and the reduction of a deferred tax liability related to the mitigation of future repatriation costs.\nThe 2023 effective tax rate is lower than the 2022 effective tax rate primarily due to the absence of the tax impact related to the sale of our Russia business recorded in 2022, as well as the release of valuation allowances on non-U.S. losses and U.S. foreign tax credits, reduction in the deferred tax liability related to lower withholding tax on repatriation of certain foreign earnings, and reversal of tax reserves related to the U.S. foreign tax credit regulations, all recorded in 2023.\nThe \n2023 and 2022\n effective tax rates are higher than the statutory U.S. rate primarily due to higher international tax rates as co\nmpared to the lower U.S. federal statutory rate.\nDeferred Tax Assets and Liabilities. \nFuture income taxes represent the tax effects of transactions which are reported in different periods for tax and financial reporting purposes. These amounts consist of the tax effects of temporary differences between the tax and financial reporting balance sheets and tax carryforwards. Future income tax benefits and obligations within the same tax paying component of a particular jurisdiction are offset for presentation in the Consolidated Balance Sheets. \nThe tax effects of temporary differences and tax carryforwards which gave rise to future income tax benefits and obligations as of December 31, 2024 and 2023 are as follows:\n(dollars in millions)\n2024\n2023\nFuture income tax benefits:\nInsurance and employee benefits\n$\n109\n \n$\n118\n \nOther asset basis differences\n113\n \n115\n \nOther liability basis differences\n349\n \n358\n \nTax loss carryforwards\n201\n \n208\n \nTax credit carryforwards\n54\n \n58\n \nValuation allowances\n(\n250\n)\n(\n239\n)\nTotal future income tax benefits\n$\n576\n \n$\n618\n \nFuture income tax obligations:\nIntangible assets\n$\n143\n \n$\n145\n \nOther assets basis differences\n203\n \n258\n \nTotal future income tax obligations\n$\n346\n \n$\n403\n \nValuation allowances have been established primarily for tax credit carryforwards, tax loss carryforwards, and certain foreign temporary differences to reduce the future income tax benefits to expected realizable amounts. \nTax Credit and Loss Carryforwards. \nAs of December 31, 2024, tax credit carryforwards, principally federal and state, and tax loss carryforwards, principally foreign, were as follows: \n(dollars in millions)\nTax Credit Carryforwards\nTax Loss Carryforwards\nExpiration period:\n2025-2029\n$\n7\n \n$\n47\n \n2030-2034\n15\n \n22\n \n2035-2044\n2\n \n80\n \nIndefinite\n30\n \n707\n \nTotal\n$\n54\n \n$\n856\n \n85\nTable of Contents\nUnrecognized Tax Benefits. \nAs of December 31, 2024, the Company had gross tax-effected unrecognized tax benefits of $\n149\n million, all of which, if recognized, would impact the effective tax rate. \nA reconciliation of the beginning and ending amounts of unrecognized tax benefits and interest expense related to unrecognized tax benefits for 2024, 2023 and 2022 is as follows: \n(dollars in millions)\n2024\n2023\n2022\nBalance at January 1\n$\n394\n \n$\n386\n \n$\n392\n \nAdditions for tax positions related to the current year\n12\n \n10\n \n25\n \nAdditions for tax positions of prior years\n—\n \n7\n \n3\n \nReductions for tax positions of prior years\n(\n12\n)\n(\n8\n)\n(\n32\n)\nSettlements\n(\n245\n)\n(\n1\n)\n(\n2\n)\nBalance at December 31\n$\n149\n \n$\n394\n \n$\n386\n \nGross interest expense (income) related to unrecognized tax benefits\n$\n(\n146\n)\n$\n6\n \n$\n2\n \nTotal accrued interest balance at December 31\n$\n84\n \n$\n148\n \n$\n143\n \nThe decrease in unrecognized tax benefits and associated interest in 2024 is primarily due to the resolution of the German tax litigation. See Note 21, \"Contingent Liabilities\" for discussion regarding the German tax litigation.\nOtis conducts business globally and, as a result, Otis or one or more of its subsidiaries files income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions.\nIn the ordinary course of business, Otis could be subject to examination by taxing authorities throughout the world, including such major jurisdictions as Austria, Belgium, Brazil, Canada, China, France, Germany, Hong Kong, India, Italy, Japan, Mexico, Netherlands, Portugal, South Korea, Spain, Switzerland, the United Kingdom and the U.S. With a few exceptions, Otis is no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations for years b\nefo\nre 2015.\nA subsidiary of Otis engaged in tax-related litigation in Belgium received a favorable appellate court decision in 2018. The Belgian tax authorities appealed the decision to the Court of Cassation (the equivalent of the Supreme Court in Belgium). On December 4, 2020, the Court of Cassation overturned the decision of the appellate court and remanded the case to the appellate court for reconsideration. Following a hearing on March 20, 2023, the Antwerp Appellate Court ruled against the Company. Otis has decided not to appeal the decision, which marks the end of this litigation. Otis expects to receive the assessment for tax and interest in 2025. The associated tax and interest have been fully reserved and are included in the range below.\nIn the ordinary course of business, there is inherent uncertainty in quantifying our income tax positions. We assess our income tax positions and record tax benefits for all years subject to examination based upon management’s evaluation of the facts, circumstances, and information available at the reporting date. The evaluation considers any additional worldwide uncertain tax positions, the closure of tax statutes or the re-valuation of current uncertain tax positions arising from the issuance of legislation, regulatory or other guidance or developments in examinations, in appeals, or in the courts. Based on the preceding factors, it is reasonably possible that within the next 12 months unrecognized tax benefits could change within the range of a $\n10\n million increase to an $\n80\n million decrease and associated interest could change within the range of a $\n10\n million increase to an $\n80\n million decrease.\n \nNote 16: \nRestructuring and Transformation Costs\nWe initiate restructuring actions to keep our cost structure competitive. Charges generally arise from severance related to workforce reductions, an\nd to a lesser degree, facility exit and lease termination costs associated with the consolidation of office and manufacturing operations. Due to the size, nature and frequency of these discrete actions, they are fundamentally different from the Company's ongoing productivity initiatives.\n86\nTable of Contents\nDuring \n2024, 2023 and 2022\n, we recorded restructuring costs for new and ongoing restructuring actions, including UpLift actions beginning in 2023, as follows:\n(dollars in millions)\n2024\n2023\n2022\nUpLift\nOther\nTotal\nUpLift\nOther\nTotal\nTotal\nCost of products and services sold\n$\n8\n \n$\n20\n \n$\n28\n \n$\n—\n \n$\n6\n \n$\n6\n \n$\n22\n \nSelling, general and administrative\n23\n \n20\n \n43\n \n25\n \n36\n \n61\n \n38\n \nTotal \n$\n31\n \n$\n40\n \n$\n71\n \n$\n25\n \n$\n42\n \n$\n67\n \n$\n60\n \nRestructuring costs incurred and expected, unless otherwise indicated, are approximately \n30\n% New Equipment and \n70\n% Service. Although this reflects the segments to which the restructuring costs relate, refer to Note 22 for more information about our measure of segment performance (segment operating profit), which no longer includes restructuring costs, among other items, beginning in 2024.\nUpLift Restructuring Actions and Transformation Costs.\n In\n 2023, we announced UpLift to transform our operating model. UpLift includes, among other aspects, the standardization of our processes and improvement of our supply chain procurement, as well as organizational changes which result in restructuring actions.\nUpLift restructuring actions were approved in 2023, with additional actions initiated in 2024 and further actions expected through 2025. These costs are primarily severance related costs. We expect these actions initiated during 2024 and 2023 to be substantially completed and cash to be paid by the end of 2025. Expected total costs and remaining costs to incur for the actions initiated are approximately $\n80\n million and $\n24\n million, respectively.\nIn 2024 and 2023, we incurred $\n65\n million and $\n16\n million of incremental, non-restructuring costs associated with transforming our operating model as a part of UpLift (\"UpLift transformation costs\"), which are recorded in Other income (expense), net in the Consolidated Statements of Operations. The UpLift transformation costs are primarily for consultants, third-party service providers and personnel focused on designing and implementing a centralized service delivery model that supports our new organizational structure, including the standardization of our supply chain and digital technology procurement.\nOther Restructuring Actions.\n The other restructuring expenses incurred during 2024, 2023 and 2022 were primarily the result of restructuring programs initiated related to severance and facility exit costs. We are targeting to complete in 2025 the majority of the remaining restructuring actions initiated in 2024 and 2023, with certain utilization beyond 2025 due to contractual obligations or legal requirements in the applicable jurisdictions. Expected total costs and remaining costs to incur for the other restructuring actions initiated are $\n101\n million and $\n29\n million, respectively. Remaining costs are expected to be approximately \n90\n% New Equipment and \n10\n% Service.\nIn January 2025, we announced the reorganization of our operations in China, which among other aspects, will result in restructuring actions. See Note 23, \"Subsequent Events\" for additional information.\nRestructuring Accruals.\n \nThe following table summarizes the accrual balance and utilization for the restructuring actions, which are primarily for severance costs:\n(dollars in millions)\nUpLift Actions\nOther Actions\nTotal Restructuring Actions\nRestructuring accruals as of December 31, 2022\n$\n—\n \n$\n41\n \n$\n41\n \nNet restructuring costs\n25\n \n42\n \n67\n \nUtilization, foreign exchange and other costs\n(\n12\n)\n(\n48\n)\n(\n60\n)\nRestructuring accruals as of December 31, 2023\n13\n \n35\n \n48\n \nNet restructuring costs\n31\n \n40\n \n71\n \nUtilization, foreign exchange and other costs\n(\n31\n)\n(\n51\n)\n(\n82\n)\nRestructuring accrual as of December 31, 2024\n$\n13\n \n$\n24\n \n$\n37\n \n87\nTable of Contents\nNote 17: \nFinancial Instruments\nWe enter into derivative instruments primarily for risk management purposes, including derivatives designated as hedging instruments under ASC 815, \nDerivatives and Hedging\n. We operate internationally and, in the normal course of business, are exposed to fluctuations in interest rates, commodity prices and foreign exchange rates. These fluctuations can increase the costs of financing, investing in and operating the business. We may use derivative instruments, including swaps, forward contracts and options, to manage certain foreign currency, commodity price and interest rate exposures.\nThe four-quarter average of the notional amount of foreign exchange contracts hedging foreign currency transactions was approximately $\n5.3\n billion and $\n4.6\n billion as of December 31, 2024 and 2023, respectively. The four-quarter average of the notional amount of contracts hedging commodity purchases was $\n14\n million and $\n21\n million as of December 31, 2024 and 2023, respectively.\nThe following table summarizes the fair value and presentation in the Consolidated Balance Sheets for derivative instruments as of December 31:\n(dollars in millions)\nBalance Sheet Classification\n2024\n2023\nDerivatives designated as Cash flow hedging instruments:\nAsset Derivatives:\nForeign exchange contracts\nOther current assets\n$\n5\n \n$\n2\n \nCommodity contracts\nOther current assets\n—\n \n1\n \nForeign exchange contracts\nOther assets\n4\n \n2\n \nTotal asset derivatives\n$\n9\n \n$\n5\n \nLiability Derivatives:\nForeign exchange contracts\nAccrued liabilities\n$\n(\n4\n)\n$\n(\n4\n)\nForeign exchange contracts\nOther long-term liabilities\n(\n1\n)\n(\n1\n)\nTotal liability derivatives\n$\n(\n5\n)\n$\n(\n5\n)\nDerivatives not designated as Cash flow hedging instruments:\nAsset Derivatives:\nForeign exchange contracts\nOther current assets\n$\n53\n \n$\n20\n \nForeign exchange contracts\nOther assets\n6\n \n4\n \nTotal asset derivatives\n$\n59\n \n$\n24\n \nLiability Derivatives:\nForeign exchange contracts\nAccrued liabilities\n$\n(\n39\n)\n$\n(\n34\n)\nForeign exchange contracts\nOther long-term liabilities\n(\n6\n)\n(\n7\n)\nTotal liability derivatives\n$\n(\n45\n)\n$\n(\n41\n)\nDerivatives designated as Cash flow hedging instruments. \nThe amount of gain or (loss) attributable to foreign exchange and commodity contract activity reclassified from Accumulated other comprehensive income (loss) was immaterial for 2024, 2023 and 2022.\nThe effect of cash flow hedging relationships on Accumulated other comprehensive income (loss) as of December 31, 2024 and 2023 are presented in the table below:\n(dollars in millions)\n2024\n2023\nGain (loss) recorded in Accumulated other comprehensive income (loss)\n$\n3\n \n$\n1\n \n88\nTable of Contents\nThe Company utilizes the critical terms match method in assessing firm commitment derivatives and regression testing in assessing commodity derivatives for hedge effectiveness. Accordingly, the hedged items and derivatives designated as hedging instruments are highly effective.\nAssuming current market conditions continue, a pre-tax loss of less than $\n1\n million is expected to be reclassified from Accumulated other comprehensive income (loss) into Cost of product sold to reflect the fixed prices obtained from foreign exchange and commodity hedging within the next 12 months. All derivative contracts accounted for as cash flow hedges as of December 31, 2024 will mature by December 2028.\nNet Investment Hedges. \nWe may use non-derivative instruments (foreign currency denominated borrowings) and derivative instruments (foreign exchange forward contracts) to hedge portions of the Company's investments in foreign subsidiaries and manage foreign exchange risk. For instruments that are designated and qualify as a hedge of net investment in foreign operations and that meet the effectiveness requirements, the net gains or losses attributable to changes in spot exchange rates are recorded in foreign currency translation within Other comprehensive income (loss) in the Consolidated Statements of Comprehensive Income, and will remain in Accumulated other comprehensive income (loss) until the hedged investment is sold or substantially liquidated. The remainder of the change in value of such instruments is recorded in earnings, including to the extent foreign currency denominated borrowings are not designated in, or are de-designated from, a net investment hedge relationship.\nOur use of derivative instruments designated as hedges of the Company's net investment in foreign subsidiaries can vary depending on the Company's desired foreign exchange risk coverage.\nWe have ¥\n21.5\n billion of Japanese Yen denominated long-term debt that qualifies as a net investment hedge against our investments in Japanese businesses, as well as derivative instruments that qualify as net investment hedges against our investments in certain European businesses (notional amount of €\n150\n million) and Asian businesses (notional amounts of HK$\n1.3\n billion and ¥\n2.1\n billion). The net investment hedges are deemed to be effective. The maturity dates of the current non-derivative and derivative instruments designated in net investment hedges range from 2025 to 2026.\nIn 2024, we de-designated a derivative instrument that qualified as a net investment hedge in certain Asian businesses with a notional amount of HK$\n1.5\n billion, which was deemed to be effective until de-designation.\nAdditionally, we had derivative instruments with notional amount of €\n95\n million that matured during 2023. These derivative instruments qualified as net investment hedges which were deemed to be effective until maturity.\nThe following table summarizes the amounts of gains (losses) recognized in other comprehensive income (loss) related to non-derivative and derivative instruments designated as net investment hedges in 2024, 2023 and 2022:\n(dollars in millions)\n2024\n2023\n2022\nForeign currency denominated long-term debt\n$\n13\n \n$\n13\n \n$\n27\n \nForeign currency forward contracts\n10\n \n4\n \n—\n \nTotal\n$\n23\n \n$\n17\n \n$\n27\n \nDerivatives not designated as Cash flow hedging instruments. \nThe net effect of derivatives not designated as Cash flow hedging instruments within Other income (expense) net, in the Consolidated Statements of Operations in \n2024, 2023 and 2022 \nwas as follows:\n(dollars in millions)\n2024\n2023\n2022\nForeign exchange contracts\n$\n7\n \n$\n20\n \n$\n16\n \nThe effects of derivatives not designated as Cash flow hedge instruments within Cost of products sold in the Consolidated Statements of Operations were losses of $\n1\n million, $\n5\n million and $\n9\n million in 2024, 2023 and 2022, respectively.\n89\nTable of Contents\nNote 18: \nFair Value Measurements\nIn accordance with the provisions of ASC 820: \nFair Value Measurements\n, the following tables provide the valuation hierarchy classification of assets and liabilities that are carried at fair value and measured on a recurring and non-recurring basis in our Consolidated Balance Sheets as of December 31, 2024 and 2023:\nDecember 31, 2024\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nRecurring fair value measurements:\nMarketable securities\n$\n44\n \n$\n44\n \n$\n—\n \n$\n—\n \nDerivative assets\n68\n \n—\n \n68\n \n—\n \nDerivative liabilities\n(\n50\n)\n—\n \n(\n50\n)\n—\n \nDecember 31, 2023\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nRecurring fair value measurements:\nMarketable securities\n$\n28\n \n$\n28\n \n$\n—\n \n$\n—\n \nDerivative assets\n29\n \n—\n \n29\n \n—\n \nDerivative liabilities\n(\n46\n)\n—\n \n(\n46\n)\n—\n \nValuation Techniques.\n Our marketable securities include investments that are traded in active markets, either domestically or internationally, and are measured at fair value using closing stock prices from active markets. The fair value gains or losses related to our marketable securities are recorded through net income. Our derivative assets and liabilities include foreign exchange and commodity contracts that are measured at fair value using internal and third party models based on observable market inputs such as forward rates, interest rates, our own credit risk and our counterparties' credit risks.\nAs of December 31, 2024, there has not been any significant impact to the fair value of our derivative liabilities due to our own credit risk. Similarly, there has not been any significant adverse impact to our derivative assets based on our evaluation of our counterparties' credit risks.\nThe fair values of the current portion of the Company's financial instruments not carried at fair value approximated their carrying values because of the short-term nature of the current portion. The fair value of receivables, including customer financing notes receivable, net, that were issued long-term are based on the discounted values of their related cash flows at interest rates reflecting the attributes of the counterparties, including geographic location. Customer-specific risk, including credit risk, is already considered in the carrying value of those receivables. Our long-term debt, as described in Note 9, \"Borrowings and Lines of Credit\", is measured at fair value using closing bond prices from active markets.\nThe following table provides carrying amounts and fair values of financial instruments that are not carried at fair value in our Consolidated Balance Sheets as of December 31, 2024 and 2023:\n \nDecember 31, 2024\nDecember 31, 2023\n(dollars in millions)\nCarrying\nAmount\nFair\nValue\nCarrying\nAmount\nFair\nValue\nLong-term receivables, net\n$\n47\n \n$\n46\n \n$\n55\n \n$\n54\n \nCustomer financing notes receivable, net\n21\n \n19\n \n26\n \n23\n \nShort-term borrowings\n(\n51\n)\n(\n51\n)\n(\n32\n)\n(\n32\n)\nLong-term debt, including current portion (excluding leases and other)\n(\n8,316\n)\n(\n7,600\n)\n(\n6,906\n)\n(\n6,224\n)\nLong-term liabilities, including current portion\n(\n132\n)\n(\n123\n)\n(\n197\n)\n(\n185\n)\nLong-term liabilities, including current portion, as of December 31, 2024 and 2023 is primarily $\n131\n million and $\n195\n million, respectively, of payables to RTX for reimbursement of tax payments that RTX is responsible to pay after the Separation as a result of the TMA.\n90\nTable of Contents\nThe following tables provide the valuation hierarchy classification of assets and liabilities that are not carried at fair value in the Consolidated Balance Sheets as of December 31, 2024 and 2023:\nDecember 31, 2024\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nLong-term receivables, net\n$\n46\n \n$\n—\n \n$\n46\n \n$\n—\n \nCustomer financing notes receivable, net\n19\n \n—\n \n19\n \n—\n \nShort-term borrowings\n(\n51\n)\n—\n \n(\n51\n)\n—\n \nLong-term debt, including current portion (excluding leases and other)\n(\n7,600\n)\n—\n \n(\n7,600\n)\n—\n \nLong-term liabilities, including current portion\n(\n123\n)\n—\n \n(\n123\n)\n—\n \nDecember 31, 2023\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nLong-term receivables, net\n$\n54\n \n$\n—\n \n$\n54\n \n$\n—\n \nCustomer financing notes receivable, net\n23\n \n—\n \n23\n \n—\n \nShort-term borrowings\n(\n32\n)\n—\n \n(\n32\n)\n—\n \nLong-term debt, including current portion (excluding leases and other)\n(\n6,224\n)\n—\n \n(\n6,224\n)\n—\n \nLong-term liabilities, including current portion\n(\n185\n)\n—\n \n(\n185\n)\n—\n \n \nNote 19: \nGuarantees\nThe Company provides service and warranty on its products beyond normal service and warranty policies. The carrying amounts of service and product guarantees were $\n16\n million and $\n12\n million as of December 31, 2024 and 2023, respectively.\nThe Company provides certain financial guarantees to third parties. As of December 31, 2024, Otis has stand-by letters of credit with maximum potential payment totaling $\n144\n million. We accrue costs associated with guarantees when it is probable that a liability has been incurred and the amount can be reasonably estimated. The most likely cost to be incurred is accrued based on an evaluation of currently available facts, and where no amount within a range of estimates is more likely, the minimum is accrued. In accordance with the FASB ASC Topic 460: \nGuarantees\n, we record these liabilities at fair value. As of December 31, 2024, Otis has determined there are no estimated costs probable under these guarantees.\nNote 20: \nLeases \nASU 2016-02,\n Leases (Topic 842)\n and its related amendments (collectively, \"Lease Accounting Standard\") establishes a right-of-use (\"ROU\") model that requires a lessee to record a ROU asset and a lease liability in the Consolidated Balance Sheets for all leases with terms longer than 12 months. Leases are classified as either finance or operating, with classification affecting the pattern of expense recognition in the Consolidated Statements of Operations.\nWe enter into lease agreements for the use of real estate space, vehicles and certain other equipment under operating and finance leases. We determine if an arrangement contains a lease at inception. Operating leases are included in Operating lease ROU assets, Accrued liabilities, and Operating lease liabilities in our Consolidated Balance Sheets. Finance leases are not considered significant to our Consolidated Balance Sheets or Consolidated Statements of Operations. We apply the practical expedient for short-term leases, whereby a lease ROU asset and liability is not recognized and the expense is recognized in a straight-line basis over the lease term.\n91\nTable of Contents\nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we use\n our \nincremental borrowing rate based on the information available at commencement date in determining the present value of lease payments, and use the implicit rate when readily determinable. We determine our incremental borrowing rate through market sources including relevant industry rates. Our lease ROU assets also include any lease pre-payments and exclude lease incentives. Certain of our leases inclu\nde variable payments, which may vary based upon changes in facts or circumstances after the start of the lease. We exclude variable payments from lease ROU assets and lease liabilities, to the extent not considered fixed, and instead, expense variable payments as incurred. Variable lease expense and lease expense for short duration contracts is not a material component of lease expense. Our leases generally have remaining lease terms of \n1\n to \n20\n years, some of which include options to extend leases. The majority of our leases with options to extend are up to \nfive years\n with the ability to terminate the lease within \none year\n. The exercise of lease renewal options is at our sole discretion and our lease ROU assets and liabilities reflect only the options we are reasonably certain that we will exercise. Lease expense is recognized on a straight-line basis over the lease term.\nOperating lease cost for 2024, 2023\n and \n2022 was $\n166\n million,\n $\n153\n million and $\n145\n million, respectively\n.\nSupplemental cash flow information related to operating leases for 2024, 2023 and 2022 was as follows:\n(dollars in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of operating lease liabilities:\nOperating cash outflows from operating leases\n$\n(\n129\n)\n$\n(\n129\n)\n$\n(\n140\n)\nNon-cash operating lease activity:\nROU assets obtained in exchange for operating lease liabilities\n150\n \n93\n \n145\n \nOperating lease ROU assets and liabilities are reflected on our Consolidated Balance Sheets as of December 31, 2024 and 2023 are as follows:\n(dollars in millions)\n2024\n2023\nOperating lease ROU assets\n$\n422\n \n$\n416\n \nAccrued liabilities\n$\n120\n \n$\n117\n \nOperating lease liabilities\n298\n \n292\n \nTotal operating lease liabilities\n$\n418\n \n$\n409\n \nSupplemental information related to operating leases as of December 31, 2024 and 2023 are as follows: \n2024\n2023\nWeighted Average Remaining Lease Term (in years)\n4.1\n4.1\nWeighted Average Discount Rate\n4.0\n%\n5.1\n%\n92\nTable of Contents\nUndiscounted maturities of operating lease liabilities, including options to extend lease terms that are reasonably certain of being exercised, as of December 31, 2024 are as follows:\n(dollars in millions)\nTotal\n2025\n$\n151\n \n2026\n117\n \n2027\n81\n \n2028\n49\n \n2029\n25\n \nThereafter\n32\n \nTotal undiscounted lease payments\n455\n \nLess: imputed interest\n(\n37\n)\nTotal discounted lease payments\n$\n418\n \nNote 21: \nContingent Liabilities\nExcept as otherwise noted, while we are unable to predict the final outcome, based on information currently available, we do not believe that resolution of any of the following matters will have a material adverse effect upon our competitive position, results of operations, cash flows or financial condition. In addition to the specific amounts noted below, where we have recorded loss contingency accruals for other matters described below and other matters, the amounts in aggregate are not material. Legal costs generally are expensed when incurred.\nEnvironmental. \nAs previously disclosed, the Company's operations are subject to environmental regulation by authorities with jurisdiction over its operations. The Company has accrued for the costs of environmental remediation activities, including, but not limited to, investigatory, remediation, operating and maintenance costs and performance guarantees, and periodically reassesses these amounts. Management believes that the likelihood of incurring losses materially in excess of amounts accrued is remote. The outstanding liability for environmental obligations \nwas \n$\n5\n million as of December 31, 2024 and \n2023\n, and is principally included in Other long-term liabilities in the Consolidated Balance Sheets.\nLegal Proceedings.\nGerman Tax Litigation\nWe were involved in administrative review proceedings with the German Tax Office, which concern approximately €\n215\n million (approximately $\n224\n million as of December 31, 2024) of tax benefits that we have claimed related to a 1998 reorganization of the corporate structure of our operations in Germany. Upon audit, these tax benefits were disallowed by the German Tax Office. We estimate interest associated with the aforementioned tax benefits is an additional approximately €\n118\n million (approximately $\n123\n million as of December 31, 2024).\nIn August 2012, a suit was filed in the local German Tax Court (Berlin-Brandenburg). \nIn 2015, before the Separation from our former parent, UTC, now RTX, we made tax and interest payments to German tax authorities of €\n275\n million (approximat\nely $\n300\n million) i\nn order to avoid additional interest accruals pending final resolution of this matter. \nIn March 2016, the local German Tax Court dismissed the suit, and we appealed this decision to the German Federal Tax Court. Following a hearing in July 2018, the German Federal Tax Court remanded the matter to the local German Tax C\nourt for further proce\nedings. In December 2020, the local German Tax Court ruled against the Company. \nOn January 26, 2021, the Company filed an appeal with the German Federal Tax Court. On February 8, 2022, the Company received the decision of the German Federal Tax Court, in which the Court remanded the case for reconsideration by the local German Tax Court. The local German Tax Court held a hearing on June 12, 2023 and issued a decision in favor of Otis on July 21, 2023. On September 14, 2023, the German tax authorities filed an appeal to the German Federal Tax Court. On August 13, 2024, the German Federal Tax Court rejected the appeal, concluding the litigation in favor of the Company.\n93\nTable of Contents\nAs a result of the court's decision, the Company expects to receive a refund of prepaid tax, prepaid interest, overpayment interest, and court fees of approximately €\n306\n million net of tax (approximately $\n318\n million as of December 31, 2024). We expect the refund will be paid to the Company over several quarters, which we currently expect to start in the second quarter of 2025 and continue through the end of 2025, by which time the Company expects to receive substantially all of the refund. The Company has also released the liability associated with the remaining interest of €\n45\n million (approximately $\n50\n million) during 2024.\nAny recoveries related to this matter would be allocated between RTX and the Company pursuant to the terms of the TMA with our former parent, UTC, by way of indemnification payments. Based on its understanding of the facts and contractual provisions as of this date, and taking into account its limited access to information held by RTX to support the calculation, the Company has estimated the additional tax and interest to be paid to RTX as a result of this recovery to be $\n194\n million and has recorded this amount in its financial statements. The parties are still in process of resolving the scope of the indemnity obligation and the final indemnity amount.\nSee Note 1, \"General\" for additional information on the impacts of the litigation and TMA activity to the Consolidated Financial Statements as of December 31, 2024.\nAsbestos Matters\nWe have been named as defendants in lawsuits alleging personal injury as a result of exposure to asbestos. While we have never manufactured any asbestos-containing component parts, and no longer incorporate asbestos in any current products, certain of our historical products have contained components manufactured by third parties incorporating asbestos. A substantial majority of these asbestos-related claims have been dismissed without payment or were covered in full or in part by insurance or other forms of indemnity. Additional cases were litigated and settled without any insurance reimbursement. The amounts involved in asbestos relate\nd claims were not material individually or in the aggregate for \n2024\n and 2023.\nThe estimated range of total liabilities to resolve all pending and unasserted potential future asbestos claims through \n2059\n is approximately \n$\n11\n million\n to \n$\n21\n million\n as of December 31, 2024, and approximately $\n20\n million to $\n43\n million as of December 31, 2023. Since no amount within the range of estimates is more likely to occur than any other, we have recorded the minimum amount of \n$\n11\n million\n and $\n20\n million as of December 31, 2024 and 2023, respectively, which is principally recorded in Other long-term liabilities on our Consolidated Balance Sheets. Amounts are on a pre-tax basis, not discounted, and exclude the Company's legal fees to defend the asbestos claims (which will continue to be expensed as they are incurred). In addition, the Company has an insurance recovery receivable for probable asbestos related recoveries of approximately \n$\n3\n million and $\n5\n million\n, which is principally included in Other assets on our Consolidated Balance Sheets as of December 31, 2024 and 2023, respectively.\nOther. \nWe have commitments and contingent liabilities related to legal proceedings, self-insurance programs and matters arising out of the normal course of business. We accrue contingencies based on a range of possible outcomes. If no amount within this range is a better estimate than any other, we accrue the minimum amount. While it is not possible to determine the ultimate disposition of each of these claims and whether they will be resolved consistent with our beliefs, we expect that the outcome of such claims, individually or in the aggregate, will not have a material adverse effect on our business, financial condition, cash flows or results of operations.\nIn certain European countries, claims for overcharges on elevators and escalators related to civil cartel cases have been made, which we have accrued for based on our evaluation of the claims. While it is not possible to determine the ultimate disposition of each of these claims and whether they will be resolved consistent with our beliefs, historical settlement experience of these cases have not been material to the business, financial condition, cash flows or results of operations. However, the future outcome of these cases cannot be determined.\nIn the ordinary course of business, the Company is also routinely a defendant in, party to or otherwise subject to many pending and threatened legal actions, claims, disputes and proceedings. These matters are often based on alleged violations of contract, product liability, warranty, regulatory, environmental, health and safety, employment, intellectual property, tax and other laws. In some of these proceedings, claims for substantial monetary damages are asserted against the Company and its subsidiaries and could result in fines, penalties, compensatory or treble damages or non-monetary relief. We do not believe that these matters will have a material adverse effect upon our competitive position, results of operations, cash flows or financial condition.\n94\nTable of Contents\nNote 22: \nSegment Financial Data\nOur operations are classified into \ntwo\n operating segments: New Equipment and Service. Through the New Equipment segment, we design, manufacture, sell and install a wide range of passenger and freight elevators as well as escalators and moving walkways to customers in the residential, commercial and infrastructure projects. The Service segment provides maintenance and repair services for both our products and those of other manufacturers, and provides modernization services to upgrade elevators and escalators. The operating segments are generally based on the management structure of the Company, as well as how management allocates resources, assesses performance and makes strategic and operational decisions.\nSegment Information. \nOtis discloses segment operating profit as its measure of segment performance, reconciled to Net income before income taxes. Segment operating profit excludes certain expenses and income that are not allocated to segments (as described below in \"Corporate and Unallocated\").\nEffective in the first quarter of 2024, the measure of segment performance used by Otis' Chief Operating Decision Maker (\"CODM\"), which is the Company’s Chief Executive Officer, changed and, as a result, Otis' disclosed measure of segment performance (segment operating profit) was updated. The change to segment operating profit aligns with the update to how the CODM assesses performance and allocates resources for the Company's segments, and therefore is our measure of segment profitability in accordance with GAAP under ASC 280, \nSegment Reporting\n.\nAs a result of the change, restructuring costs and other items not allocated to the operating segments are presented as part of Corporate and Unallocated. The financial information presented herein reflects the impact of the measure of segment performance change for all periods presented.\nThe CODM assesses the performance of each operating segment and allocates resources to those segments based on net sales and segment operating profit. The discrete asset information for each segment is not presented to, or reviewed by, the CODM.\nSegment information for 2024 is as follows:\n2024\n(dollars in millions)\nNew Equipment\nService\nTotal\nNet sales\n$\n5,367\n \n$\n8,894\n \n$\n14,261\n \nCosts and expenses:\nCost of sales\n4,443\n \n5,533\n \n9,976\n \nSelling, general and administrative\n490\n \n1,144\n \n1,634\n \nOther including research and development\n105\n \n32\n \n137\n \nTotal segment operating profit\n$\n329\n \n$\n2,185\n \n2,514\n \nCorporate and Unallocated:\nGeneral corporate expenses and other\n158\n \nUpLift restructuring\n31\n \nOther restructuring\n40\n \nUpLift transformation costs\n65\n \nSeparation-related adjustments\n177\n \nLitigation-related settlement costs\n18\n \nHeld for sale impairment\n18\n \nOther, net\n(\n1\n)\nTotal company operating profit\n2,008\n \nNon-service pension cost (benefit) \n—\n \nInterest expense (income), net\n(\n31\n)\nNet income before income taxes\n$\n2,039\n \n95\nTable of Contents\nSegment information for 2023 is as follows:\n2023\n(dollars in millions)\nNew Equipment\nService\nTotal\nNet sales\n$\n5,812\n \n$\n8,397\n \n$\n14,209\n \nCosts and expenses:\nCost of sales\n4,837\n \n5,173\n \n10,010\n \nSelling, general and administrative\n498\n \n1,174\n \n1,672\n \nOther including research and development\n96\n \n36\n \n132\n \nTotal segment operating profit\n$\n381\n \n$\n2,014\n \n2,395\n \nCorporate and Unallocated:\nGeneral corporate expenses and other\n126\n \nUpLift restructuring\n25\n \nOther restructuring\n42\n \nUpLift transformation costs\n16\n \nTotal company operating profit\n2,186\n \nNon-service pension cost (benefit) \n5\n \nInterest expense (income), net\n150\n \nNet income before income taxes\n$\n2,031\n \nSegment information for\n \n2022 is as follows:\n2022\n(dollars in millions)\nNew Equipment\nService\nTotal\nNet sales\n$\n5,778\n \n$\n7,801\n \n$\n13,579\n \nCosts and expenses:\nCost of sales\n4,855\n \n4,791\n \n9,646\n \nSelling, general and administrative\n430\n \n1,155\n \n1,585\n \nOther including research and development\n112\n \n23\n \n135\n \nTotal segment operating profit\n$\n381\n \n$\n1,832\n \n2,213\n \nCorporate and Unallocated:\nGeneral corporate expenses and other\n87\n \nOther restructuring\n60\n \nRussia operations\n5\n \nRussia sale and conflict-related charges\n28\n \nTotal company operating profit\n2,033\n \nNon-service pension cost (benefit) \n2\n \nInterest expense (income), net\n143\n \nNet income before income taxes\n$\n1,888\n \nCorporate and Unallocated includes adjustments related to the separation of Otis from RTX Corporation (previously United Technologies Corporation, \"RTX\") (the \"Separation\"), Litigation-related settlement costs, impairment loss for held for sale net assets, restructuring costs, UpLift transformation costs, as well as the results of our Russia operations and Russia sale and conflict-related charges in 2022.\n96\nTable of Contents\nSeparation-related adjustments represent net adjustments of amounts due to and from RTX in accordance with the TMA. Separation-related adjustments in 2024 represent amounts due to RTX related to a favorable ruling received in August 2024 regarding the German tax litigation. Separation-related adjustments in 2024 also include a reduction of our contractual indemnity obligation payable to RTX that resulted from the TMA and receipts from RTX in accordance with the TMA. These adjustments are recorded in Other income (expense), net in our Consolidated Statements of Operations in 2024. See Note 15, \"Income Taxes\" and Note 21, \"Contingencies\" for additional information about the German tax litigation.\nLitigation-related settlement costs in 2024 represent the aggregate amount of settlement costs and increase in loss contingency accruals, excluding legal costs, for certain legal matters that are outside of the ordinary course of business due to the size, complexity and unique facts of these matters.\nImpairment loss related to net assets held for sale is recorded in Other income (expense), net in the Consolidated Statements of Operations in 2024. See Note 8, \"Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" for additional information about the held for sale assets and liabilities.\nRefer to Note 16, \"Restructuring and Transformation Costs\" for more information about restructuring and UpLift transformation costs.\nThe results of our Russia operations in 2022 and the Russia sale and conflict related charges are excluded from the segment results. See Note 8, \"Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" for additional information regarding the sale of our Russia business.\nGeographic External Sales.\n \nGeographic Net sales are attributed to the geographic regions based on their location of origin. With the exception of the U.S. and China, there were no individually significant countries with Net sales exceeding 10% of Net sales during \n2024, 2023 and 2022\n.\nExternal Net Sales\nLong Lived Assets\n(dollars in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nUnited States Operations\n$\n4,239\n \n$\n4,030\n \n$\n3,834\n \n$\n315\n \n$\n325\n \n$\n327\n \nInternational Operations\nChina\n1,919\n \n2,444\n \n2,573\n \n72\n \n83\n \n89\n \nOther\n8,103\n \n7,735\n \n7,278\n \n314\n \n319\n \n303\n \nTotal\n$\n14,261\n \n$\n14,209\n \n$\n13,685\n \n$\n701\n \n$\n727\n \n$\n719\n \nDisaggregated Net sales by type.\n \nNet sales disaggregated by product and service type for \n2024, 2023 and 2022\n are as follows:\n(dollars in millions)\n2024\n2023\n2022\nNew Equipment\n$\n5,367\n \n$\n5,812\n \n$\n5,864\n \nMaintenance and Repair\n7,211\n \n6,870\n \n6,393\n \nModernization\n1,683\n \n1,527\n \n1,428\n \nTotal Service\n8,894\n \n8,397\n \n7,821\n \nTotal\n$\n14,261\n \n$\n14,209\n \n$\n13,685\n \nMajor Customers. \nThere were no customers that individually accounted for 10% or more of the Company's consolidated Net sales for \n2024, 2023 and 2022\n.\nNote 23: \nSubsequent Events\nIn January 2025, we announced the reorganization of our operations in China. Among other aspects, this reorganization will result in restructuring actions of approximately $\n40\n million, which are expected to be incurred beginning in 2025. These actions include severance related costs, and we expect these actions to be mostly completed and any cash to be paid by the end of 2025.\n97\nTable of Contents\nOTIS WORLDWIDE CORPORATION\nSCHEDULE II - Valuation and Qualifying Accounts\nThree years ended December 31, 2024\n(Dollars in millions)\nFuture Income Tax Benefits - Valuation Allowance\nBalance, December 31, 2021\n$\n247\n \nAdditions charged to income tax expense\n29\n \nReductions credited to income tax expense\n(\n23\n)\nOther adjustments\n(\n13\n)\nBalance, December 31, 2022\n240\n \nAdditions charged to income tax expense\n16\n \nReductions credited to income tax expense\n(\n22\n)\nOther adjustments\n5\n \nBalance, December 31, 2023\n239\n \nAdditions charged to income tax expense\n32\n \nReductions credited to income tax expense\n(\n11\n)\nOther adjustments\n(\n10\n)\nBalance, December 31, 2024\n$\n250\n \n98\nTable of Contents\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a-15(e) under the\n Exchange Act, we carried out an evaluation under the supervision and with the participation of our management, including the Chair, President and Chief Executive Officer (\"CEO\"), the Executive Vice President and Chief Financial Officer (\"CFO\") and the Senior Vice President and Chief Accounting Officer (\"CAO\"), of the effectiveness of the design and operation of our disclosure controls and procedures\n as of December 31, 2024. T\nhere are inherent limitations to the effectiveness of any system of disclosure controls and procedures, including the possibility of human error and the circumvention or overriding of the controls and procedures. Accordingly, even effective disclosure controls and procedures can only provide reasonable assurance of achieving their control objectives. Based upon our evaluation, our CEO, our CFO and our CAO have concluded that, as of December 31, 2024, our disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the applicable rules and forms, and that it is accumulated and communicated to our management, including our CEO, our CFO and our CAO, as appropriate, to allow timely decisions regarding required disclosure.\nManagement Report on Internal Control over Financial Reporting\nThe information required by Item 9A relating to Management's Annual Report on Internal Control Over Financial Reporting and Attestation Report of the Registered Public Accounting Firm is found in Item 8 Financial Statements and Supplementary Data of this Form 10-K and incorporated herein by reference. \nChanges in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting during the quarter ended December 31, 2024, that materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B. Other Information\nNone\n.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot Applicable.\n99\nTable of Contents\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information required by Item 10 with respect to directors, the Audit Committee of the Board of Directors and audit committee financial experts is incorporated herein by reference to the section of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Corporate governance\" (under the subheadings \"Proposal 1: Election of directors\", \"Our Board leadership structure\", \"\nAreas of Board oversight\n\" and \"Our Board nominees\").\nInformation about our Executive Officers\nThe following persons are executive officers of Otis Worldwide Corporation:\nName\nPosition\nOther Business Experience\nSince 1/1/2020\nAge as of 2/4/2025\nTracy A. Embree\nPresident, Otis Americas (since October 2023)\nVice President and President - Distribution, Cummins, Inc.; Vice President and President - Components, Cummins, Inc.\n51\nNeil Green\nExecutive Vice President and Chief Digital Officer (since April 2020)\nVice President, Transformation and Chief Digital Officer, Otis\n54\nNora E. LaFreniere\nExecutive Vice President and General Counsel (since July 2021)\nExecutive Vice President, Chief General Counsel and Corporate Secretary, Vice President, General Counsel, Otis\n53\nSally A. Loh\nPresident, Otis China (since March 2023)\nChief Operating Officer and Chief Financial Officer, Otis China; Chief Financial Officer, Otis China\n51\nAbbe Luersman\nExecutive Vice President and Chief People Officer (since July 2021)\nChief Human Resource Officer, Ahold Delhaize\n57\nCristina Méndez\nExecutive Vice President and Chief Financial Officer (since August 2024)\nSenior Vice President Finance and Transformation, EMEA; Chief Controlling Officer and Deputy CFO, Telefónica Deutschland\n44\nJudith F. Marks\nChair, President and Chief Executive Officer (since February 2022)\nPresident and Chief Executive Officer, Otis\n61\nEnrique Miñarro Viseras\nPresident, Otis EMEA (since October 2023)\nSenior Vice President and General Manager (\"GM\"), Global Precision & Science Technologies, Ingersoll Rand; Senior Vice President and GM, Global Pressure & Vacuum Solutions, Europe, Middle East, India and Africa (\"EMEIA\"), Ingersoll Rand; Vice President and GM, EMEIA, Gardner Denver Holdings, Inc.\n47\nStephane de Montlivault\nPresident, Otis Asia Pacific (since April 2020)\nPresident, Otis Asia Pacific\n65\nMichael P. Ryan\nSenior Vice President and Chief Accounting Officer (since April 2020)\nVice President and Assistant Controller, UTC\n55\nPeiming Zheng (Perry)\nExecutive Vice President, Chief Product, Delivery and Customer Officer (since March 2023)\nChief Customer Product Officer, Otis; President, Otis China\n56\nAll of the officers serve at the pleasure of the Board of Directors of Otis Worldwide Corporation.\n100\nTable of Contents\nInformation concerning Section 16(a) compliance is incorporated herein by reference to the section of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Other important information\" under the subheading \"Delinquent section 16(a) reports.\" We have adopted a code of ethics, the Otis Absolutes, that applies to all our directors, officers, employees and representatives\n. This code is publicly available on our website at https://www.otisinvestors.com/governance/governance-documents. \nAmendments to the code of ethics and any grant of a waiver from a provision of the code requiring disclosure under applicable SEC rules will be disclosed on our website. Our Corporate Governance Guidelines and the charters of our Board of Directors’ Audit Committee, Compensation Committee and Nominations and Governance Committee are available on our we\nbsite at https://www.otisinvestors.com/governance/governance-documents. These materials may also be requested in print free of charge by writing to our Investor Relations Department at Otis Worldwide Corporation, One Carrier Place, Investor Relations, Farmington, CT 06032.\nThe Company has adopted an \ninsider trading policy\n which governs the purchase, sale, and/or any other dispositions of our securities by its directors, officers, employees and subsidiaries and is designed to promote compliance with insider trading laws, rules and regulations, and listing standards applicable to the Company. A copy of our insider trading policy is filed with this Annual Report on Form 10-K as Exhibit 19. Additionally, our Board of Directors has approved a share repurchase program, which allows the Company to purchase shares \non the open market, in privately negotiated transactions, under accelerated share repurchase programs or under plans complying with Rules 10b5-1 and 10b-18 under the Exchange Act. While the Company does not have a formal written policy governing the purchase, sale, and/or any other dispositions of its securities by the Company, the Company has developed procedures that are designed to promote compliance with insider trading laws, \nrules and regulations \nwith respect to the Company's share repurchase program. For more information regarding our share repurchase program, see \nPart II. Item 5 of this Form 10-K. \nItem 11. Executive Compensation\nThe information required by Item 11 is incorporated herein by reference to the sections of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Compensation of directors\", \"Executive compensation\" and \"Report of the compensation committee\".\n101\nTable of Contents\nItem 12. Security Ownership of Certain\n Beneficial Owners and Management and Related Stockholder Matters\nThe information relating to security ownership of certain beneficial owners and management is incorporated herein by reference to the section of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Other important information\" under the subheading \"Stock ownership\" (\"Beneficial stock ownership of directors and executive officers\" and \"Certain beneficial owners\").\nEquity Compensation Plan Information\nThe following table provides information as of December 31, 2024 concerning Common Stock issuable under Otis’ equity compensation plans.\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights (a)\nWeighted-average exercise price of outstanding options, warrants and rights (b)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a)) (c)\nEquity compensation plans approved by shareholders\n3,635,709\n(1)\n$71.52\n19,374,690\n(2)\nEquity compensation plans not approved by shareholders\n-\n-\n-\n (1)     \nConsists of the following issuable shares of Common Stock awarded under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan (\"LTIP\"): (i) shares of Common Stock issuable upon the exercise of outstanding non-qualified stock options; (ii) shares of Common Stock issuable upon the exercise of outstanding stock appreciation rights (\"SARs\"); (iii) shares of Common Stock issuable pursuant to outstanding restricted stock unit and performance share unit awards, assuming performance at the target level (up to an additional 747,239 shares of Common Stock could be issued if performance goals are achieved above target); and (iv) shares of Common Stock issuable upon the settlement of outstanding deferred stock units and restricted stock units under the Otis Worldwide Corporation Board of Directors Stock Unit Plan. Under the LTIP, each SAR is exercisable for a number of shares of Common Stock having a value equal to the increase in the market price of a share of such stock from the date the SAR was granted. For purposes of determining the total number of shares to be issued in respect of outstanding SARs, we have used the New York Stock Exchange (\"NYSE\") closing price for a share of Common Stock on December 31, 2024 of $92.61. The weighted-average exercise price shown in the column above takes into account only the shares identified in clauses (i) and (ii).\n \n \n(2)    \nRepresents the maximum number of shares of Common Stock available to be awarded under the LTIP as of December 31, 2024. Performance share units, deferred stock units and restricted stock units (\"Full Share Awards\") will result in a reduction in the number of shares of Common Stock available for delivery under the LTIP in an amount equal to twice the number of shares to which the award corresponds under the terms of the LTIP. Stock options and SARs do not constitute Full Share Awards and will result in a reduction in the number of shares of Common Stock available for delivery under the 2020 LTIP on a one-for-one basis.\n102\nTable of Contents\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by Item 13 is incorporated herein by reference to the sections of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Corporate governance\" under the subheading \"Our board nominees\" \n(including under the subheading \n\"Director independence\") and \"Other important information\" (under the subheading \"Transactions with related persons\").\nItem 14. Principal Accounting Fees and Services\nThe information required by Item 14 is incorporated by reference to the section of our Proxy Statement for the 2025 Annual Meeting of Shareholders titled \"Proposal 3: Appoint an independent auditor for 2025\", including the information provided in that section with regard to \"Audit Fees\", \"Audit-Related Fees\", \"Tax Fees\" and \"All Other Fees\".\n103\nTable of Contents\nPART IV\nItem 15. Exhibits and Financial Statement Schedules\n(a)   The following documents are filed as part of this Form 10-K:\n(1)     Financial Statements. The financial statements are set forth in Item 8. \"Financial Statements and Supplementary Data\" in this Form 10-K.\n(2)    Financial Statement Schedules. The following financial statement schedule is set forth in Item 8. \"Financial Statements and Supplementary Data\" in this Form 10-K. All other schedules have been omitted because they are not required, are not applicable or the required information is shown in the financial statements or the notes thereto.\n•\nSchedule II — Valuation and Qualifying Accounts\n(3)    Exhibits. The following list of exhibits includes exhibits submitted with this Form 10-K as filed with the SEC and those incorporated by reference to other filings.\nExhibit\nNumber\nExhibit Description\n2.1\nSeparation and Distribution Agreement, dated as of April 2, 2020, by and among United Technologies Corporation, Otis Worldwide Corporation and Carrier Global Corporation, incorporated by reference to Exhibit 2.1 of the Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n3.1\nAmended and Restated Certificate of Incorporation of Otis Worldwide Corporation, incorporated by reference to Exhibit 3.1(b) of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n3.2\nAmended and Restated Bylaws of Otis Worldwide Corporation, incorporated by reference to Exhibit 3.2 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n4.1\nIndenture, dated February 27, 2020, between Otis Worldwide Corporation and The Bank of New York Mellon Trust Company, N.A., incorporated by reference to Exhibit 4.1 to Otis’ Amendment No. 1 to Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on March 11, 2020.\n4.2\nSupplemental Indenture No. 1, dated February 27, 2020, between Otis Worldwide Corporation and The Bank of New York Mellon Trust Company, N.A., incorporated by reference to Exhibit 4.2 to Otis’ Amendment No. 1 to Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on March 11, 2020.\n4.3\nSupplemental Indenture No. 2, dated as of March 11, 2021, between Otis Worldwide Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee, incorporated by reference to Exhibit 4.1 to Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on March 11, 2021.\n4.4\nIndenture, dated as of November 12, 2021, among Otis Worldwide Corporation, Highland Holdings S.à r.l. and The Bank of New York Mellon Trust Company, N.A., as trustee., incorporated by reference to Exhibit 4.1 to Otis' Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on November 12, 2021.\n4.5\nSupplemental Indenture No. 1, dated as of November 12, 2021, among Otis Worldwide Corporation, Highland Holdings S.à r.l and The Bank of New York Mellon Trust Company, N.A., as trustee, incorporated by reference to Exhibit 4.2 of Otis’ Current Report on 8-K (Commission file number 001-39221) filed with the SEC on November 12, 2021).\n4.6\nSupplemental Indenture No. 3, dated as of August 16, 2023, between Otis Worldwide Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee, incorporated by reference to Exhibit 4.1 to Otis' Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on August 16, 2023.\n4.7\nSupplemental Indenture No. 4, dated as of November 19, 2024, between Otis Worldwide Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee, incorporated by reference to Exhibit 4.2 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on November 19, 2024.\n104\nTable of Contents\nExhibit\nNumber\nExhibit Description\n4.8\nSupplemental Indenture No. 2, dated as of November 19, 2024, among Otis Worldwide Corporation, Highland Holdings S.à r.l. and The Bank of New York Mellon Trust Company, N.A., as trustee, incorporated by reference to Exhibit 4.5 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on November 19, 2024.\n4.9\nDescription of Securities.*\n10.1\nTax Matters Agreement, dated as of April 2, 2020, by and among United Technologies Corporation, Otis Worldwide Corporation and Carrier Global Corporation incorporated by reference to Exhibit 10.2 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.2\nEmployee Matters Agreement, dated as of April 2, 2020, by and among United Technologies Corporation, Otis Worldwide Corporation and Carrier Global Corporation incorporated by reference to Exhibit 10.3 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.3\nIntellectual Property Agreement, dated as of April 2, 2020, by and among United Technologies Corporation, Otis Worldwide Corporation and Carrier Global Corporation, incorporated by reference to Exhibit 10.4 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.4\nOtis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.5 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\nOtis Worldwide Corporation 2020 Long-Term Incentive Plan (As Amended and Restated as of January 1, 2024), incorporated by reference to Exhibit 10.1 of Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 (Commission file number 001-39221) filed with the SEC on April 25, 2024.\n10.5\nOtis Worldwide Corporation Change in Control Severance Plan, incorporated by reference to Exhibit 10.6 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.6\nOtis Worldwide Corporation Executive Annual Bonus Plan incorporated by reference to Exhibit 10.7 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\nAmendment No. 1 to Otis Worldwide Corporation Executive Annual Bonus Plan, incorporated by reference to Exhibit 10.3 to Otis' Quarterly Report on Form 10-Q for the quarter ended June 30, 2021 (Commission file number 001-39221) filed with the SEC on July 28, 2021.\nOtis Worldwide Corporation Short-Term Incentive Plan (As Amended and Restated as of January 1, 2024), incorporated by reference to Exhibit 10.2 of Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 (Commission file number 001-39221) filed with the SEC on April 25, 2024.\n10.7\nOtis Worldwide Corporation Pension Preservation Plan, incorporated by reference to Exhibit 10.8 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.8\nOtis Worldwide Corporation Retirement Plan for Third Country National Employees, incorporated by reference to Exhibit 10.9 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.9\nOtis Worldwide Corporation Board of Directors Deferred Stock Unit Plan (Amended and Restated effective as of February 4, 2021), incorporated by reference to Exhibit 10.4 to Otis' Quarterly Report on Form 10-Q for the quarter ended June 30, 2021 (Commission file number 001-39221) filed with the SEC on July 28, 2021.\n10.10\nFrench Sub-Plan for Restricted Stock Units Granted Under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.11 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on April 3, 2020.\n10.11\nSchedule of Terms for Restricted Stock Unit Awards granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.8 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.12\nSchedule of Terms for Restricted Stock Unit Awards (Off-Cycle) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.9 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n105\nTable of Contents\nExhibit\nNumber\nExhibit Description\n10.13\nSchedule of Terms for Stock Appreciation Right Awards granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.10 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.14\nSchedule of Terms for Stock Appreciation Right Awards (Off-Cycle) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.11 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.15\nSchedule of Terms for Performance Share Unit Awards granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.12 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.16\nOtis Worldwide Corporation Deferred Compensation Plan, incorporated by reference to Exhibit 10.14 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\nAmendment No. 1 to the Otis Worldwide Corporation Deferred Compensation Plan, incorporated by reference to Exhibit 10.17 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\n10.17\nOtis Worldwide Corporation Amended and Restated Savings Restoration Plan, incorporated by reference to Exhibit 10.15 to Otis’ Amendment No. 1 to Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on March 11, 2020.\nAmendment No. 1 to Otis Worldwide Corporation Amended and Restated Savings Restoration Plan, incorporated by reference to Exhibit 10.1 to Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 (Commission file number 001-39221) filed with the SEC on April 28, 2021.\nAmendment No. 2 to the Otis Worldwide Corporation Amended and Restated Savings Restoration Plan, incorporated by reference to Exhibit 10.18 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\n10.18\nOtis Worldwide Corporation Company Automatic Contribution Excess Plan, incorporated by reference to Exhibit 10.16 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\nAmendment No. 1 to the Otis Worldwide Corporation Company Automatic Contribution Excess Plan, incorporated by reference to Exhibit 10.19 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\n10.19\nOtis Worldwide Corporation LTIP Performance Share Unit Deferral Plan, incorporated by reference to Exhibit 10.17 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\nAmendment No. 1 to the Otis Worldwide Corporation LTIP Performance Share Unit Deferral Plan, incorporated by reference to Exhibit 10.20 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\n10.20\nLegacy United Technologies Corporation Executive Leadership Group Agreements, incorporated by reference to Exhibit 10.19 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.21\nLegacy Schedule of Terms for United Technologies Corporation Executive Leadership Group Restricted Stock Unit Retention Awards, incorporated by reference to Exhibit 10.20 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n106\nTable of Contents\nExhibit\nNumber\nExhibit Description\n10.22\nLetter of Assignment with Stephane de Montlivault, dated December 18, 2019, incorporated by reference to Exhibit 10.25 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\nLetter of Assignment Extension with Stephane de Montlivault dated October 1, 2021, incorporated by reference to Exhibit 10.24 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\nExtension of Letter of Assignment for Stephane de Montlivault, effective October 1, 2023, incorporated by reference to Exhibit 10.23 of Otis’ Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024. \n10.23\nLetter of Appointment/Employment with Stephane de Montlivault, dated December 18, 2019, incorporated by reference to Exhibit 10.26 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.24\nLetter Agreement with Judith F. Marks regarding LTIP award amendment, dated February 3, 2020, incorporated by reference to Exhibit 10.29 to Otis’ Registration Statement on Form 10 (Commission file number 001-39221) filed with the SEC on February 7, 2020.\n10.25\nSummary of Compensation and Benefits for Non-Employee Directors, incorporated by reference to Exhibit 10.27 to Otis' Annual Report on Form 10-K for the year ended December 31, 2021 (Commission file number 001-39221) filed with the SEC on February 4, 2022.\n10.26\nOtis Worldwide Corporation Executive Leadership Group Severance Plan, incorporated by reference to Exhibit 10.1 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on September 18, 2020.\n10.27\nLetter of Assignment for Peiming (Perry) Zheng, effective January 1, 2021, incorporated by reference to Exhibit 10.33 of Otis' Annual Report on Form 10-K for the year ended December 31, 2020 (Commission file number 001-39221) filed with the SEC on February 5, 2021.\nExtension of Letter of Assignment for Peiming (Perry) Zheng, effective January 1, 2023, incorporated by reference to Exhibit 10.29 to Otis' Annual Report on Form 10-K for the year ended December 31, 2022 (Commission file number 001-39221) filed with the SEC on February 3, 2023.\n10.28\nRevolving Credit Agreement, dated as of March 10, 2023, by and among Otis Worldwide Corporation, as borrower, Otis Intercompany Lending Designated Activity Company, as subsidiary borrower, each other subsidiary borrower party thereto, the financial institutions from time to time party thereto and JPMorgan Chase Bank, N.A., as administrative agent, incorporated by reference to Exhibit 10.01 of Otis' Current Report on Form 8-K (Commission File No. 001-39221) filed with the SEC on March 20, 2023.\n10.29\nSchedule of Terms for Restricted Stock Unit Awards (February 5, 2021) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.5 to Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 (Commission file number 001-39221) filed with the SEC on April 28, 2021.\n10.30\nSchedule of Terms for Stock Appreciation Right Awards (February 5, 2021) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.6 to Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 (Commission file number 001-39221) filed with the SEC on April 28, 2021.\n10.31\nSchedule of Terms for Performance Share Unit Awards (February 5, 2021) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.7 to Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 (Commission file number 001-39221) filed with the SEC on April 28, 2021.\n10.32\nForm of Executive Award Statement under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.8 to Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021 (Commission file number 001-39221) filed with the SEC on April 28, 2021.\n107\nTable of Contents\nExhibit\nNumber\nExhibit Description\n10.33\nOffer Letter between Otis Worldwide Corporation and Abbe L. Luersman, dated March 27, 2021, incorporated by reference to Exhibit 10.5 to Otis' Quarterly Report on Form 10-Q for the quarter ended September 30, 2021 (Commission file number 001-39221) filed with the SEC on October 26, 2021.\n10.34\nOffer Letter, dated as of June 23, 2022, by and between Anurag Maheshwari and Otis Worldwide Corporation, incorporated by reference to Exhibit 10.1 of Otis’ Current Report on Form 8-K (Commission File No. 001-39221) filed with the Commission on June 27, 2022.\n10.35\nOffer Letter, dated as of August 22, 2023, by and between Tracy Embree and Otis Worldwide Corporation, incorporated by reference to Exhibit 10.36 of Otis’ Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024.\n10.36\nService Agreement between Otis Mobility, S.A. and Enrique Minarro Viseras, dated October 26, 2023, incorporated by reference to Exhibit 10.37 of Otis’ Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024. \n10.37\nEmployment Contract (Foreign National or Hong Kong, Macao or Taiwan Resident) for Sally Loh, effective January 1, 2024, incorporated by reference to Exhibit 10.38 of Otis’ Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024. \n10.38\nLetter of Assignment for Sally Loh, effective January 1, 2024, incorporated by reference to Exhibit 10.39 of Otis’ Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024. \n10.39\nSchedule of Terms for Performance Share Unit Awards granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan (Effective February 6, 2024), incorporated by reference to Exhibit 10.3 of Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 (Commission file number 001-39221) filed with the SEC on April 25, 2024.\n10.40\nSchedule of Terms for Restricted Stock Unit Awards granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan (Effective February 6, 2024), incorporated by reference to Exhibit 10.4 of Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 (Commission file number 001-39221) filed with the SEC on April 25, 2024.\n10.41\nSchedule of Terms for Stock Appreciation Right Awards granted under the Otis Worldwide Corporation 2020 Long -Term Incentive Plan (Effective February 6, 2024), incorporated by reference to Exhibit 10.5 of Otis' Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 (Commission file number 001-39221) filed with the SEC on April 25, 2024.\n10.42\nSchedule of Terms (July 2024) for Performance Share Unit Award (CEO one-time supplemental) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, as amended and restated as of January 1, 2024, incorporated by reference to Exhibit 10.1 of Otis' Quarterly Report on Form 10-Q for the quarter ended June 30, 2024 (Commission file number 001-39221) filed with the SEC on July 25, 2024.\n10.43\nSchedule of Terms (July 2024) for Restricted Stock Unit Award (CEO one-time supplemental) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, as amended and restated as of January 1, 2024, incorporated by reference to Exhibit 10.2 of Otis' Quarterly Report on Form 10-Q for the quarter ended June 30, 2024 (Commission file number 001-39221) filed with the SEC on July 25, 2024.\n10.44\nAmended and Restated Employment Agreement, dated September 18, 2024, between Cristina Méndez and Otis International Sàrl, incorporated by reference to Exhibit 10.1 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on September 20, 2024.\n10.45\nLetter of Assignment for Cristina Méndez, effective December 1, 2024, incorporated by reference to Exhibit 10.2 of Otis’ Current Report on Form 8-K (Commission file number 001-39221) filed with the SEC on September 20, 2024.\n10.46\nSchedule of Terms for Restricted Stock Unit Awards (Off-Cycle) granted under the Otis Worldwide Corporation 2020 Long-Term Incentive Plan, as amended and restated as of January 1, 2024.*\n14\nThe Otis Absolutes. The Otis Absolutes may be accessed via Otis’ website at \nhttps://www.otisinvestors.com/governance/governance-documents.\n19\nInsider trading policies and procedures.\n*\n108\nTable of Contents\nExhibit\nNumber\nExhibit Description\n21\nSubsidiaries of the Registrant.*\n22\nSubsidiary guarantors and issuers of guaranteed securities and affiliates whose securities collateralize securities of the Registrant.*\n23\nConsent of PricewaterhouseCoopers LLP.*\n24\nPowers of Attorney of Thomas A. Bartlett, Jeffrey H. Black, Jill C. Brannon, Nelda J. Connors, Kathy Hopinkah Hannan, Shailesh G. Jejurikar, Christopher J. Kearney, Judith F. Marks, Margaret M.V. Preston, Shelley Stewart, Jr. and John H. Walker.*\n31.1\nRule 13a-14(a)/15d-14(a) Certification.*\n31.2\nRule 13a-14(a)/15d-14(a) Certification.*\n31.3\nRule 13a-14(a)/15d-14(a) Certification.*\n32\nSection 1350 Certifications.*\n97\nErroneously Awarded Compensation Recovery Policy, effective September 13, 2023, incorporated by reference to Exhibit 97 of Otis' Annual Report on Form 10-K for the year ended December 31, 2023 (Commission file number 001-39221) filed with the SEC on February 2, 2024.\n \n101.INS\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.* \n101.SCH\nXBRL Taxonomy Extension Schema Document.*\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document.*\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document.*\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document.*\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document.*\n104\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document.\nNotes to Exhibits List:\n*\n    Submitted electronically herewith.\nAttached as Exhibit 101 to this report are the following formatted in XBRL (Extensible Business Reporting Language): (i) Consolidated Statements of Operations for the three years ended December 31, 2024, (ii) Consolidated Statements of Comprehensive Income for the three years ended December 31, 2024, (iii) Consolidated Balance Sheets as of December 31, 2024 and 2023, (iv) Consolidated Statements of Cash Flows for the three years ended December 31, 2024, (v) Consolidated Statements of Changes in Equity for the three years ended December 31, 2024, (vi) Notes to Consolidated Financial Statements, and (vii) Financial Schedule of Valuation and Qualifying Accounts.\nItem 16. Form 10-K Summary\nNot applicable.\n109\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOTIS WORLDWIDE CORPORATION\n(Registrant)\nDated:\nFebruary 4, 2025\nby:\n/s/ CRISTINA MÉNDEZ\nCristina Méndez\nExecutive Vice President and Chief Financial Officer\n(on behalf of the Registrant and as the Registrant's Principal Financial Officer)\nDated:\nFebruary 4, 2025\nby:\n/s/ MICHAEL P. RYAN\nMichael P. Ryan\nSenior Vice President and Chief Accounting Officer\n(on behalf of the Registrant and as the Registrant's Principal Accounting Officer)\n110\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ JUDITH F. MARKS\nDirector, Chair, President and Chief Executive Officer\nFebruary 4, 2025\nJudith F. Marks\n/s/ CRISTINA MÉNDEZ\nExecutive Vice President and Chief Financial Officer\nFebruary 4, 2025\nCristina Méndez\n/s/ MICHAEL P. RYAN\nSenior Vice President and Chief Accounting Officer\nFebruary 4, 2025\nMichael P. Ryan\n/s/ THOMAS A. BARTLETT*\nDirector\nThomas A. Bartlett\n/s/ JEFFREY H. BLACK*\nDirector\nJeffrey H. Black\n/s/ JILL C. BRANNON*\nDirector\nJill C. Brannon\n/s/ NELDA J. CONNORS*\nDirector\nNelda J. Connors\n/s/ KATHY HOPINKAH HANNAN*\nDirector\nKathy Hopinkah Hannan\n/s/ SHAILESH G. JEJURIKAR*\nDirector\nShailesh G. Jejurikar\n/s/ CHRISTOPHER J. KEARNEY*\nDirector\nChristopher J. Kearney\n/s/ MARGARET M.V. PRESTON*\nDirector\nMargaret M.V. Preston\n/s/ SHELLEY STEWART, JR.*\nDirector\nShelley Stewart, Jr.\n/s/ JOHN H. WALKER*\nDirector\nJohn H. Walker\n*By:   \n /s/ NORA E. LAFRENIERE\nExecutive Vice President and General Counsel, as Attorney-in-fact\nDate: February 4, 2025\n111"
  }
}