{
  "ticker": "OXY",
  "cik": "0000797468",
  "company_name": "OCCIDENTAL PETROLEUM CORP /DE/",
  "filing_date": "2025-02-18",
  "accession": "0000797468-25-000029",
  "primary_doc": "oxy-20241231.htm",
  "item_sections": {
    "item1": "ITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOccidental’s Code of Business Conduct applies to the President and Chief Executive Officer, Senior Vice President and Chief Financial Officer, Vice President, Chief Accounting Officer and Controller and persons performing similar functions. The Code of Business Conduct also applies to Occidental’s directors, employees and the employees of entities which it controls. The Code of Business Conduct is posted on Occidental’s website, www.oxy.com. Occidental will satisfy any disclosure requirement under Item 5.05 of Form 8-K regarding an amendment to, or waiver from, any provision of the Code of Business Conduct by disclosing the nature of that amendment or waiver on its website within four business days following the date of the amendment or waiver.\nThe list of Occidental’s executive officers and related information under Information About Our Executive Officers set forth in Part I of this 10-K is incorporated by reference herein. The information required by this Item 10 is incorporated herein by reference from Occidental’s definitive Proxy Statement to be filed with the SEC pursuant to Regulation 14A within 120 days of December 31, 2024.\nITEM 11.    EXECUTIVE COMPENSATION\nThe information under the caption “Compensation Discussion and Analysis - Compensation Committee Report” shall not be deemed to be “soliciting material,” or to be “filed” with the SEC, or subject to Regulation 14A or 14C under the Exchange Act or to the liabilities of Section 18 of the Exchange Act, nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933. The information required by this Item 11 is incorporated herein by reference from Occidental’s definitive Proxy Statement to be filed with the SEC pursuant to Regulation 14A within 120 days of December 31, 2024.\nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nAll of Occidental’s stock-based compensation plans for its employees and non-employee directors have been approved by the stockholders. The aggregate number of shares of Occidental common stock authorized for issuance under such plans is approximately 133 million, of which approximately 12.9 million had been reserved for issuance through December 31, 2024. The following is a summary of the securities available for issuance under such plans:\na)\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nb)\nWeighted-average exercise price of outstanding options, warrants and rights\nc)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\n12,902,731\n(1)\n38.07 \n(2)\n32,093,127\n(3)\n(1)\nIncludes shares reserved to be issued pursuant to RSUs, Options and performance-based awards. Shares for performance-based awards are included assuming maximum payout, but may be paid out at lesser amounts, or not at all, according to achievement of performance goals. \n(2)\nPrice applies only to the Options included in column (a). Exercise price is not applicable to the other awards included in column (a), nor warrants not issued under equity compensation plans.\n(3)\nA plan provision requires each share covered by an award (other than stock appreciation rights and Options) to be counted as if three shares were issued in determining the number of shares that are available for future awards. Accordingly, the number of shares available for future awards may be less than the amount shown depending on the type of award granted. Additionally, under the plan, the amount shown may increase, depending on the award type, by the number of shares currently unvested or forfeitable, or three times that number as applicable, that are forfeited or canceled, or correspond to the portion of any stock-based awards settled in cash.\nThe information required by this Item 12 is incorporated herein by reference from Occidental’s definitive Proxy Statement to be filed with the SEC pursuant to Regulation 14A within 120 days of December 31, 2024.\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 is incorporated herein by reference from Occidental’s definitive Proxy Statement to be filed with the SEC pursuant to Regulation 14A within 120 days of December 31, 2024.\n OXY\n 2024 FORM 10-K\n129\nITEM 14.    PRINCIPAL ACCOUNTING FEES AND SERVICES\nOccidental’s independent registered public accounting firm is \nKPMG LLP\n, \nHouston, TX\n, Auditor Firm ID: \n185\n.\nThe information about its principal accountant, KPMG LLP, Houston, Texas (185) required by this Item 14 is incorporated herein by reference from Occidental’s definitive Proxy Statement to be filed with the SEC pursuant to Regulation 14A within 120 days of December 31, 2024.\nPart IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe agreements included as exhibits to this report are included to provide information about their terms and not to provide any other factual or disclosure information about Occidental or the other parties to the agreements. The agreements contain representations and warranties by each of the parties to the applicable agreement that were made solely for the benefit of the other agreement parties and:\n■\nShould not be treated as categorical statements of fact, but rather as a way of allocating the risk among the parties if those statements prove to be inaccurate;\n■\nHave been qualified by disclosures that were made to the other party in connection with the negotiation of the applicable agreement, which disclosures are not necessarily reflected in the agreement;\n■\nMay apply standards of materiality in a way that is different from the way investors may view materiality; and\n■\nWere made only as of the date of the applicable agreement or such other date or dates as may be specified in the agreement and are subject to more recent developments.\n(a) (1) and (2). Financial Statements and Financial Statement Schedule\nReference is made to Item 8 of the Table of Contents of the Form 10-K, where these documents are listed.\n(a) (3). Exhibits\n3.(i)\nRestated Certificate of Incorporation of Occidental, dated November 12, 1999, and Certificates of Amendment thereto dated May 5, 2006, May 1, 2009, May 2, 2014 and June 3, 2020 (filed as Exhibit 4.1 to the Registration Statement on Form S-8 of Occidental filed on June 17, 2020, File No. 333-239236).\n3.(i)(a)\nCertificate of Change of Location of Registered Office and of Registered Agent, dated July 6, 2001 (filed as Exhibit 3.1(i) to the Registration Statement on Form S-3 of Occidental dated February 6, 2002, File No. 333-82246).\n3.(ii)\nAmended and Restated By-laws of Occidental Petroleum Corporation as of \nNove\nmber 6, 2024\n (filed as Exhibit 3.1 to the Current Report on Form 8-K of Occidental filed on \nN\november 12, 2024\n, File No. 1-9210).\n3.(ii)(a)\nCertificate of Designations with respect to the Cumulative Perpetual Preferred Stock, Series A (filed as Exhibit 3.1 to the Current Report on Form 8-K of Occidental filed on August 8, 2019, File No. 1-9210).\n3.(ii)(b)\nCertificate of Designations with respect to the Junior Participating Preferred Stock, Series B (filed as Exhibit 3.1 to the Current Report on Form 8-K of Occidental filed on March 13, 2020, File No. 1-9210).\n4.1\nDescription of Securities of Occidental Petroleum Corporation Registered under Section 12 of the Exchange Act (filed as Exhibit 4.1 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2020, File No. 1-9210).\n4.2\nIndenture, dated as of August 8, 2019, between Occidental Petroleum Corporation and The Bank of New York Mellon Trust Company, N.A. (filed as Exhibit 4.1 to the Current Report on Form 8-K of Occidental filed on August 8, 2019, File No. 1-9210).\n4.3\nFirst Supplemental Indenture to that certain Indenture, dated as of August 8, 2019, by and between Occidental Petroleum Corporation and The Bank of New York Mellon Trust Company, N.A. (filed as Exhibit 4.7 to the Current Report on Form 8-K of Occidental filed on July 13, 2020, File No. 1-9210).\n4.4\nSecond Supplemental Indenture to that certain Indenture, dated as of August 8, 2019, by and between Occidental Petroleum Corporation and The Bank of New York Mellon Trust Company, N.A. (filed as Exhibit 4.6 to the Current Report on Form 8-K of Occidental filed on December 22, 2020, File No. 1-9210).\n4.5\nThird Supplemental Indenture to that certain Indenture, dated as of August 8, 2019, by and between Occidental Petroleum Corporation and The Bank of New York Mellon Trust Company, N.A. (filed as Exhibit 4.2 to the Current Report on Form 8-K of Occidental filed on July 15, 2021, File No. 1-9210).\n130\nOXY\n 2024 FORM 10-K\nOther instruments defining the rights of holders of other long-term debt of Occidental and its subsidiaries are not being filed since the total amount of securities authorized under each of such instruments does not exceed 10% of the total assets of Occidental and its subsidiaries on a consolidated basis. Occidental agrees to furnish a copy of any such instrument to the Commission upon request.\nAll of the exhibits numbered 10.1 to 10.25 are management contracts and compensatory plans required to be identified specifically as responsive to Item 601(b)(10)(iii)(A) of Regulation S-K pursuant to Item 15(b) of Form 10-K.\n10.1\nOccidental Petroleum Corporation Savings Plan (Amended and Restated Effective as of January 1, 2023) (filed as Exhibit 10.1 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2022, File No. 1-9210).\n10.2\nOccidental Petroleum Corporation 2015 Long-Term Incentive Plan Form of Notice of Grant of Restricted Stock Unit Incentive Award (filed as Exhibit 10.2 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2021, File No. 1-9210).\n10.3\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Restricted Stock Unit Award (applicable to annual grants made in 2024) (filed as Exhibit 10.3 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2024, File No. 1-9210).\n10.4\nOccidental Petroleum Corporation Modified Deferred Compensation Plan (Effective December 31, 2006 and Amended and Restated Effective January 1, 2021) (filed as Exhibit 10.2 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2020, File No. 1-9210).\n10.5\nOccidental Petroleum Corporation Supplemental Retirement Plan II (Effective as of January 1, 2005 and Amended and Restated as of July 1, 2020) (filed as Exhibit 10.4 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended June 30, 2020, File No. 1-9210).\n10.6\nOccidental Petroleum Corporation Executive Incentive Compensation Plan (As Amended and Restated Effective January 1, 2023) (filed as Exhibit 10.5 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2022, File No. 1-9210).\n10.7\nForm of Indemnification Agreement between Occidental and each of its directors and certain executive officers (filed as Exhibit B to the Proxy Statement of Occidental for its May 21, 1987, Annual Meeting of Stockholders, File No. 1-9210).\n10.8\nForm of Indemnification Agreement between Occidental and each of its directors and certain executive officers (filed as Exhibit 10.9 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2020, File No. 1-9210).\n10.9\nAmended and Restated Occidental Petroleum Corporation 2015 Long-Term Incentive Plan (filed as Exhibit 4.7 to the Registration Statement on Form S-8 of Occidental filed on June 17, 2020, File No. 333-239236).\n10.10\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Common Stock Award For Non-Employee Directors Grant Agreement (filed as Exhibit 10.2 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended June 30, 2015, File No. 1-9210).\n10.11\nAnadarko Retirement Restoration Plan (As Amended and Restated Effective as of December 31, 2021) (filed as Exhibit 10.14 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2021, File No. 1-9210).\n10.12\nAnadarko Petroleum Corporation Savings Restoration Plan (As Amended and Restated Effective July 1, 2020) (filed as Exhibit 10.1 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended June 30, 2020, File No. 1-9210).\n10.13\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Cash Return on Capital Employed Incentive Award (filed as Exhibit 10.1 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2020, File No. 1-9210).\n10.14\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Cash Return on Capital Employed Incentive Award (applicable to annual grants made in 2024) (filed as Exhibit 10.1 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2024, File No. 1-9210).\n10.15\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Stock Option Award \n(filed as Exhibit 10.3 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2020, File No. 1-9210).\n10.16\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Stock Appreciation Right Award\n (filed as Exhibit 10.4 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2020, File No. 1-9210).\n10.17\nOccidental Petroleum Corporation Executive Severance Plan\n \n(As Amended and Restated Effective November 6, 2024)\n.\n10.18\nOccidental Petroleum Corporation Executive Change in Control Severance Plan\n \n(As Amended and Restated Effective \nFebruary 12, 2025\n)\n.\n10.19\nForm of Employee Notice, Impact of August 2020 Warrant Distribution on Long-Term Incentive Awards (filed as Exhibit 10.7 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended September 30, 2020, File No. 1-9210).\n10.20\nLetter Agreement by and between Occidental Petroleum Corporation and Sylvia J. Kerrigan dated September 14, 2022 (filed as Exhibit 10.1 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended September 30, 2022).\n10.21\nOccidental Petroleum Corporation 2015 Long-Term Incentive Plan Form of Notice of Grant of Restricted Stock Unit Incentive Award (for awards to Chief Legal Officer) (filed as Exhibit 10.2 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended September 30, 2022).\n OXY\n 2024 FORM 10-K\n131\n10.22\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Restricted Stock Unit Award (applicable to grant to Chief Legal Officer in 2024)\n \n(filed as Exhibit 10.4 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2024, File No. 1-9210).\n10.23\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Total Shareholder Return Incentive Award (applicable to annual grants made in 2022 and 2023) (filed as Exhibit 10.26 to the Annual Report on Form 10-K of Occidental for the fiscal year ended December 31, 2022, File No. 1-9210).\n10.24\nForm of Occidental Petroleum Corporation 2015 Long-Term Incentive Plan Total Shareholder Return Incentive Award (applicable to annual grants made in 2024) (filed as Exhibit 10.2 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended March 31, 2024, File No. 1-9210).\n10.25\nOccidental Petroleum Corporation Retirement Policy (filed as Exhibit 10.1 to the Current Report on Form 8-K of Occidental filed on February 22, 2023, File No. 1-9210).\n10.26\nWarrant Agreement (including Form of Warrant), dated July 24, 2020, between the Company and Equiniti Trust Company, as Warrant Agent (filed as Exhibit 10.1 to the Current Report on Form 8-K of Occidental filed on July 27, 2020, File No. 1-9210).\n10.27\nTerm Loan Agreement, dated as of December 28, 2023, by and among Occidental Petroleum Corporation, the lenders party thereto and Bank of America, N.A., as administrative agent (filed as Exhibit 10.1 to the Current Report on Form 8-K of Occidental filed on December 28, 2023, File No. 1-9210).\n10.28\nThird Amended and Restated Credit Agreement, dated as of February 2, 2024, by and among Occidental Petroleum Corporation, the banks party thereto, as lenders, and JPMorgan Chase Bank, N.A., as administrative agent (filed as Exhibit 10.1 to the Current Report on Form 8-K of Occidental filed on February 5, 2024, File No. 1-9210).\n10.29\nAmendment No. 1, dated as of May 16, 2024, to the Third Amended and Restated Credit Agreement, dated as of February 2, 2024, by and among Occidental Petroleum Corporation, the banks party thereto, as lenders, and JPMorgan Chase Bank, N.A., as administrative agent (filed as Exhibit 10.2 to the Quarterly Report on Form 10-Q of Occidental for the quarterly period ended June 30, 2024, File No. 1-9210).\n19.1\nOccidental Petroleum Insider Trading Policy\n.\n21\nList of subsidiaries of Occidental as of December 31, 2024.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n23.2\nConsent of Ryder Scott, Independent Petroleum Engineer\ns.\n31.1\nCertification of CEO Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of CFO Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertifications of CEO and CFO Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nOccidental Petroleum Corporation Clawback Policy\n (filed as Exhibit 97.1 to the Annual Report of Form 10-K of Occidental for the fiscal year ended December 31, 2023, File No. 1-9210).\n99.1\nRyder Scott Company Process Review of the Estimated Future Proved Reserves and Income Attributable to Certain Leasehold and Royalty Interests and Certain Economic Interests Derived Through Production Sharing Contracts as of December 31, 202\n4\n.\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n104\nCover Page Interactive Data File - The cover page from Occidental Petroleum Corporation’s Annual Report on Form 10-K for the year ended December 31, 2024 is formatted in Inline XBRL (included as Exhibit 101).\nITEM 16.    FORM 10-K SUMMARY\nNone.\n132\n OXY\n 2024 FORM 10-K\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nOCCIDENTAL PETROLEUM CORPORATION\n \n \n \nBy:\n/s/ Vicki Hollub\n \n \nVicki Hollub\n \n \nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nTitle\nDate\n/s/ Vicki Hollub\n President, Chief Executive Officer\nFebruary 18, 2025\nVicki Hollub\nand Director\n/s/ Sunil Mathew\nSenior Vice President and\nFebruary 18, 2025\nSunil Mathew\nChief Financial Officer\n/s/ Christopher O. Champion\nVice President, Chief Accounting Officer\nFebruary 18, 2025\nChristopher O. Champion\nand Controller\n/s/ Vicky A. Bailey\nDirector\nFebruary 18, 2025\nVicky A. Bailey\n/s/ Andrew F. Gould\nDirector\nFebruary 18, 2025\nAndrew F. Gould\n/s/ Carlos M. Gutierrez\nDirector\nFebruary 18, 2025\nCarlos M. Gutierrez\n/s/ William R. Klesse\nDirector\nFebruary 18, 2025\nWilliam R. Klesse \n/s/ Jack B. Moore\nDirector\nFebruary 18, 2025\nJack B. Moore\n/s/ Claire O’Neill\nDirector\nFebruary 18, 2025\nClaire O’Neill\n/s/ Avedick B. Poladian\nDirector\nFebruary 18, 2025\nAvedick B. Poladian\n/s/ Kenneth B. Robinson\nDirector\nFebruary 18, 2025\nKenneth B. Robinson\n/s/ Robert M. Shearer\nDirector\nFebruary 18, 2025\nRobert M. Shearer\n OXY\n 2024 FORM 10-K\n133"
  }
}