{
  "ticker": "PAYC",
  "cik": "0001590955",
  "company_name": "Paycom Software, Inc.",
  "filing_date": "2025-02-20",
  "accession": "0000950170-25-024136",
  "primary_doc": "payc-20241231.htm",
  "item_sections": {
    "item1a": "Item 1A. Ri\nsk Factors\n\n\nThe risk factors noted in this section and other factors noted throughout this Form 10-K, including those risks identified in Part II,",
    "item1": "Item 1. B\nusiness\n\n\nOverview\n\n\nWe are a leading provider of a comprehensive, cloud-based HCM solution delivered as Software-as-a-Service (“SaaS”). We provide functionality and data analytics that businesses need to manage the complete employment lifecycle, from recruitment to retirement. Our solution requires virtually no customization and is based on a core system of record maintained in a single database for all HCM functions, including payroll, talent acquisition, talent management, human resources (“HR”) management and time and labor management applications. Our user-friendly software allows for easy adoption of our solution by employees, enabling self-management of their HCM activities in the cloud, which reduces the administrative burden on employers and increases employee productivity.\n\n\nWe were founded in 1998 and became a publicly traded company through our initial public offering in 2014. Since our founding, we have focused on providing an innovative SaaS HCM solution. Organizations need sophisticated, flexible and intuitive applications that can quickly adapt to their evolving HCM requirements, streamline their HR processes and systems and enable them to control costs. We believe the HCM needs of many organizations are currently served by multiple providers, which often results in challenges with system integration and data integrity, low scalability, high costs and extended delivery times.\n\n\nBecause our solution was developed in-house and is based on a single platform, there is no need for our clients to integrate, update or access multiple databases, which are common issues with competitor offerings that use multiple third-party systems in order to link together their HCM offerings. Our solution allows clients to automate decisions and time-consuming HR and payroll tasks, freeing them up to focus on strategic items such as employee engagement and workforce planning. Additionally, our solution maintains data integrity for accurate, actionable and real-time analytics and business intelligence and helps clients minimize the risks of compliance errors due to inaccurate or missing information. We deliver feature-rich applications while maintaining excellence in information security, data privacy, business continuity, and quality management standards, as evidenced by our International Organization for Standardization (“ISO”) certifications.\n\n\nWe sell our solution directly through our internally trained, client-focused and highly skilled sales force based in offices across the United States. As a part of our client retention effort, a specialist within a dedicated team is assigned to each client to provide differentiated, personalized service.\n \nWe have approximately 37,500 clients. None of our payroll and HCM clients constituted more than one-half of one percent of our revenues for the year ended December 31, 2024. We believe that as a result of our focus on client experience, we enjoy high client satisfaction as evidenced by an annual revenue retention rate of 90% for the years ended December 31, 2024 and 2023. We believe our revenue retention rate understates our client loyalty because this rate is decreased by former clients that were acquired or otherwise ceased operations.\n\n\nWe have historically generated the majority of our revenues from our payroll applications. We generally do not separately track our revenues across our other applications because we often sell applications in various groupings and configurations for a single price.\n\n\nThe Paycom Solution\n\n\nWe offer an end-to-end SaaS HCM solution that provides our clients and their employees with immediate access to accurate and secure information and analytics at any time from any location where internet service is available. We believe our solution delivers the following benefits:\n\n\nComprehensive HCM Solution\n\n\nOur solution offers functionality that manages the entire employment lifecycle for employers and employees, from recruitment to retirement. Our user-friendly applications streamline client processes and provide clients and their employees with the ability to directly access and manage administrative processes, including applications that identify candidates, on-board employees, manage time and labor, administer payroll deductions and benefits, manage performance, terminate employees and administer post-termination health benefits such as COBRA. Our solution allows clients to automate numerous decisions and tasks from onboarding to offboarding, including payroll, position changes and other processes. The widespread employee usage of our applications further integrates our solution into the administrative processes of our clients. Our solution also has the advantage of being built in-house by our highly trained and skilled team of software developers, thereby minimizing data integrity issues across applications.\n\n\nCore System of Record\n\n\nOur solution is based on a core system of record that contains payroll and HR information in one convenient database, thereby reducing costs and eliminating the need for multiple software products and vendors and the maintenance of employee data in numerous databases. This core system of record enables our clients to input employee data one time and enjoy seamless functionality across our applications. When a revision is made to the file of an employee, all appropriate personnel have access to the change in real time. In addition, our core system of record helps clients minimize the risk of compliance errors due to inaccurate or missing\n \n\n\n5\n\n\n\n\n \n \n\n\ninformation that results from maintaining multiple databases. Through accurate tracking and management of employee payroll and other HR data, such information can be compiled for comprehensive and consistent reporting for our clients.\n\n\nData Analytics and Business Intelligence\n\n\nOur solution’s core system of record allows clients to strategically analyze comprehensive and accurate employee information to make informed business decisions based upon actionable, real-time analytics provided through our client dashboard. This functionality allows our clients to operate with a more complete and accurate picture of their organization, as our solution’s embedded analytics capture the content and context of everyday business events, facilitating fast and informed decision-making from any location. Our industry-first employee usage management analytics tool, Direct Data Exchange\n®\n (DDX\n®\n), provides employers insights into efficiencies gained through employee usage of HR technology and generates a real-time estimate of the savings realized from that usage. We help clients reduce administrative and operational costs and better manage talent through automated processes.\n\n\nEnhanced Employee Experience\n\n\nThe employees of our clients also benefit from our HCM applications. As workforces transition from technology-savvy to technology-dependent, employees expect mobile technology and the resources necessary to readily access information and control their professional development. Through our employee self-service technology, employees can view real-time HR information, including pay stubs, payroll tax filing forms and benefits information, as well as manage their schedules and vacation time and update contact information. Employees can even do their own payroll with our industry-first Beti\n®\n technology. Our mobile app makes it easier for employees to access their self-service information. Our app has fingerprint and facial recognition capabilities, aiding employers in their efforts to engage technology-dependent workers. Our system also allows employers to engage their workforce through learning management courses and training paths, surveys, and performance goals and reviews.\n\n\nTo further enhance the effectiveness of management throughout our clients’ organizations, we also offer easy to use software with Manager on-the-Go\n®\n. Built within our mobile app, this tool allows for 24/7 accessibility to essential manager-side functionality, giving supervisors and managers the ability to perform a variety of tasks — anytime, anywhere.\n\n\nIn addition to our self-service, app-based functionality, we also provide our clients with a strategy to drive usage among their employees. This strategy includes training clients’ employees how to use the Paycom app during implementation and providing additional training from our client relations representatives (“CRRs”). Allowing employees to make changes directly to our database creates efficiencies for both the employer and employee. Today’s employees have little tolerance for complexity, and with our solution, employees have become accustomed to having a direct relationship with their HR data. This relationship is directly correlated with our single-database that is key to increasing usage. Our strategy to promote employee usage of the Paycom system elevates HR personnel to focus on the human element of their jobs, creating a more positive culture and giving HR personnel more time to engage with their employees.\n\n\nPersonalized Support Provided by Trained Personnel\n\n\nOur applications are supported by one-on-one personal assistance from trained specialists. Service specialists are assigned to specific clients and are trained across all of our applications, ensuring they provide comprehensive, expert-level service. Our Quality Management System is ISO 9001:2015 certified on the basis of its quality and consistency. We strive to provide our clients with high levels of service and support to ensure their continued use of our solution for all of their HCM needs.\n\n\nSoftware-as-a-Service Delivery Model\n\n\nOur SaaS delivery model allows clients with geographically dispersed and mobile workforces to operate more efficiently, and allows these clients to implement, access and use our client-oriented internet solution on demand and remotely through standard web browsers, smart phones, tablets and other web-enabled devices. Our SaaS solution reduces the time, risk, headcount and costs associated with installing and maintaining applications for on-premises products within the IT infrastructure of our clients.\n\n\nSecure Cloud-Based Architecture\n\n\nOur cloud-based architecture allows our solution to be implemented remotely with minimal client interaction. Updates such as software enhancements and newly developed applications can be deployed without client interaction, disruption or involvement, allowing our clients to make a smaller investment in hardware, personnel, implementation time and consulting. Additionally, we own and maintain all of the infrastructure technology to host our solution and to maximize system availability for clients. Our focus on, and investment in, technology, data security, and resiliency has been recognized with ISO/IEC 27001:2013, ISO/IEC 27701:2019, and ISO/IEC 22301:2019 certified security and business continuity standards.\n\n\nScalability to Grow with our Clients\n\n\nOur solution is highly scalable. Our target client size is organizations with 50 to 10,000 or more employees. Our clients are able to use the same solution while their businesses grow by deploying applications as needed in real-time. Pricing is determined based on employee headcount and the number of applications utilized, enabling our clients to align HCM spending with their evolving HCM\n \n\n\n6\n\n\n\n\n \n \n\n\nneeds as compared to traditional HCM products that require clients to migrate to new software as\n \nthey grow but retain fixed costs even if the client’s employee headcount shrinks.\n\n\nEfficient and Productive Research and Development\n\n\nWe believe we benefit from a competitive advantage with our research and development investments, people and processes. Early investments in our proprietary, cloud-based architecture enable us to develop and deploy applications in a timely and cost-effective manner. We have also chosen to base our research and development team in Oklahoma and Texas, which we believe provides us with high-quality talent at a lower cost compared to other locations in the United States where there is more competition for technology talent. These strategic decisions have enabled us to have a highly productive research and development function.\n\n\nOur Strategy for Growth\n \n\n\nOur strategy is to continue to establish our solution as the HCM industry standard by continuing to leverage our sales force productivity, penetrating existing markets and expanding into new markets. We intend to continue to increase our domestic sales capacity and expand our offering to additional international markets. We will also execute our strategy for growth by targeting large clients and strengthening and extending our solution.\n \n\n\nPenetrate Existing Markets\n\n\nWe believe a significant market opportunity exists to penetrate markets where we currently have existing sales offices. Each sales office is typically staffed with one outside sales team, consisting of a sales manager and approximately seven other sales professionals. We plan to penetrate and more effectively capture existing markets through increased sales productivity as well as by adding sales capacity in such markets. Although we have a sales office in 41 of the 50 largest metropolitan statistical areas (“MSAs”) in the United States based on July 2023 U.S. Census Bureau estimates, only seven of these MSAs are currently served by multiple Paycom outside sales teams.\n\n\nEnlarge our Existing Client Relationships\n\n\nWe dedicate our resources to helping our clients facilitate their goals, whether through helping our clients execute better hiring decisions, manage compensation more effectively or simply operate more efficiently. We believe a significant growth opportunity exists in selling additional applications to our current clients. Many clients have subsequently deployed additional applications as they recognize the benefits of our comprehensive solution. Furthermore, with the launch of our Global HCM\n™\n solution and expansion of payroll services into certain international markets, we have the opportunity to capture additional revenue from existing clients with international employees. As we extend and enhance the functionality of our solution, we will continue to invest in initiatives to increase the adoption of our solution and maintain our high levels of client satisfaction.\n\n\nExpand Into New Markets\n\n\nWe plan to continue expanding our sales capability by opening sales offices in certain metropolitan areas where we currently have no sales teams. We have historically selected new locations based on potential client and employee demographics as well as business density. When opening a new sales office, we typically relocate a proven sales manager from an existing territory who then recruits a team of high-performing sales representatives. It typically takes a new sales office 24 months to reach maturity. In addition, as we continue to enhance the global capabilities of our solution, our U.S.-based sales teams are expanding our reach into international markets by targeting global organizations with a U.S. presence.\n\n\nTarget Large Clients\n\n\nThe average size of our clients has grown significantly as we have organically grown our operations and increased the number of applications we offer. We believe larger employers, such as organizations with greater than 1,000 employees, represent a substantial opportunity to increase our revenues per client, with limited incremental cost to us, and we intend to continue targeting large businesses. In addition, we expect that our ability to serve organizations with international employees makes our solution more attractive to larger companies, many of which have a global presence.\n\n\nMaintain Our Leadership in Innovation by Strengthening and Extending our Solution\n\n\nOur ability to develop and deploy new applications and updates rapidly and cost-effectively has been integral to the results that we have achieved to date. We intend to continue extending the functionality and range of our solution in the future. Our development efforts are performed exclusively in-house and are heavily based upon proactive research and client input. We are focusing our investments on the development of new applications, enhancements and learning courses that are responsive to the needs of our clients, which are garnered through ongoing client interaction and collaboration.\n\n\nOur Applications and Tools\n\n\nOur HCM solution offers a full suite of applications and tools that generally fall within the following categories: payroll, talent acquisition, talent management, HR management and time and labor management.\n \n\n\n7\n\n\n\n\n \n \n\n\nWith Global HCM, a number of our HCM applications and tools are available in 15 languages and dialects and are accessible to users in more than 190 countries. We also offer native payroll in Canada, Mexico, the United Kingdom and Ireland, and intend to add native payroll in other countries.\n\n\nPayroll\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nBeti.\n Beti (Better Employee Transaction Interface\n®\n) is an industry-first technology that further automates and streamlines the payroll process by empowering employees to do their own payroll, which increases efficiencies and reduces errors. Employees already manage all other components of their paychecks, including timecards, expenses, PTO requests and benefits; now they have the convenience within Paycom to process their own payroll, too. By guiding employees to access, view, manage, troubleshoot and approve their paycheck before payroll is submitted, HR can focus on more strategic endeavors.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPayroll and Payroll Tax Management.\n Our payroll application is the foundation of our solution, and all our clients are required to utilize this application to access our other applications. It is automatically updated with changes in employee information and offers other time-saving functionality such as batch editing and effective dating. Enhanced payroll functionality allows clients to automate and delegate payroll functions to accelerate the processes, giving clients repeatable, reliable payroll processing with additional controls. Our payroll application allows clients to configure the services to fit their specific needs. It can be accessed at any time to make changes, run payroll and generate custom reports. Our payroll tax management tool helps clients handle their payroll taxes, deposits, regulatory correspondence and amendments, as well as assists with penalty and interest disputes. With this tool, Paycom also debits clients’ payroll taxes, deposits them on their due date and submits clients’ filings.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nVault Visa\n®\n Payroll Card. \nThe Vault Visa\n®\n Payroll Card gives employees the financial convenience of allowing them to deposit all or a portion of their wages on a secure pay card usable with mobile wallets like Apple Pay\n®\n, Google Pay\n®\n and Samsung Pay\n®\n. In certain circumstances, Vault card users also can have access to their pay up to two days earlier for greater financial flexibility. For clients, it minimizes the inconvenience of paper-based payroll and helps reduce check fraud through secure digital funding.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nEveryday\n®\n. Our daily payroll service, Everyday, allows employees to receive daily wages on a Vault Visa\n®\n Payroll Card at no cost to the employees. This service provides employees greater financial flexibility and transparency to better meet life’s demands. It also provides employers a competitive edge in hiring and retaining employees with a benefit today’s employees want. Everyday is fully automated, calculating and withholding taxes, benefits and deductions first to protect against overpayment and help ensure compliance.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPaycom Pay\n®\n.\n Paycom Pay eliminates the tedious, risky job of check reconciliation by issuing checks to our clients’ employees that clear from a Paycom bank account, thereby reducing the number of transactions on a client’s general ledger and simplifying bank statement balancing.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nClient Action Center\n. Client Action Center makes it easier for payroll administrators to act on banking and tax-related information. Clients receive a comprehensive view of the data they need to make informed, accurate decisions — all centralized in one intuitive dashboard. With the Paycom mobile app, they can access quick views of wires, tax accounts and access to specialists for assistance.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nExpense Management.\n Our expense management application eliminates the manual, paper-based processes associated with employee expense reimbursement and allows employers to control and monitor expenses by setting clearly defined rules and parameters for employee reimbursement. Employees can upload or email photos of receipts for reimbursement and expenses are automatically parsed when submitted. Our mileage tracker feature allows employers to more accurately track, log and manage employees’ mileage reimbursements that are then automatically updated within our expense management application. Employees can then access an expense dashboard where they can view the status of their submitted expenses through Employee Self-Service\n®\n. Expenses seamlessly flow through virtual approvals to payroll, and our application provides proper allocation of expenses to the general ledger, reducing manual work for accounting personnel. Organizations gain audit-ready reporting, which is critical when a client needs to know the important attributes of the expense approval process.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nGarnishment Administration. \nOur garnishment administration application mitigates the risk of penalties and lawsuits from employees and agencies, allowing clients to handle communications with garnishment payees and agencies, as well as calculate and track garnishment payments.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n8\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nGL Concierge.\n Our GL concierge application offers organizations more control and transparency into their payroll general ledger and gives finance professionals intuitive reporting, enriched audit trails, customizable file layouts and real-time alerts. Clients of all sizes can use a wide variety of general ledger maps along with an action item alert system that improves the dynamics of their daily operations. With this simplified process, accounting departments can generate mapped GL reports for direct import into various accounting software packages.\n \n\n\n\n\n\n\nTalent Acquisition\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nApplicant Tracking.\n Our applicant tracking application simplifies the recruiting processes needed to hire the most qualified employees. By using our comprehensive software, our clients can move candidates from the application process through new employee onboarding without re-keying data. Organizations can maintain and easily access a list of potential employees from a talent pool with real-time candidate, recruiter and manager retrieval while eliminating manual redundancies. Clients can also distribute job openings and reach a wider candidate audience with tools to automatically post jobs to their organization’s website, career sites and online job boards. The application’s enhanced career site analytics reveal which job boards and marketing efforts produce the best return on investment. It not only sends candidates automated job alerts to notify them of a client’s newly posted positions but also allows them to provide their availability up front to discuss potential job opportunities, thereby saving a step for recruiters.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nEnhanced Background Checks\n®\n.\n Our background check application helps clients easily screen prospective new hires or employees. Employers can choose the specific service or package of services desired for each individual, including verification of education, employment, driving history, criminal history, and drug and health screening, among others.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nOnboarding\n. Our onboarding application streamlines the hiring processes for employees of our clients by creating online checklists of tasks to be assigned to an employee or group of employees. This process can begin even before a new hire’s first day on the job, helping the new hire be more productive on their first day.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nE-Verify\n®\n. By pairing electronic signature verification with online storage and analytics, our E-Verify application automates employment verification and streamlines administration, reducing our clients’ exposure to audits and penalties that could result from I-9 violations.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nTax Credits.\n Our tax credits application helps employers process and calculate the available federal tax credits associated with hiring employees who meet various qualifications, ensuring organizations opting into this service receive their share of government-appropriated funds. This application also prescreens candidates to determine who is eligible for tax credits.\n \n\n\n\n\n\n\nTalent Management\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nEmployee Self-Service.\n Available in English or Spanish, our Employee Self-Service application improves employee engagement by empowering employees to self-manage certain transactions, obtain quick answers to frequent payroll and HR questions, access their pay history, view performance goals and reviews, and view total compensation reports that show their compensation and benefits package. Benefits information and paid time-off accruals also give employees the ability to make informed decisions regarding their benefit selections and time-off requests. Employees can access our self-service software through any device with an internet connection or by downloading the Paycom app on the Google Play\n®\n store and the App Store\n®\n online store.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nCompensation Budgeting\n. Our compensation budgeting application provides compensation information, giving clients valuable workforce insight to help manage and formulate salary budgets and establish merit-based compensation increases that automatically upload new rates to payroll once the merit increases are set. Having payroll linked with performance reviews is instrumental for compensation budgeting, which rewards employees fairly while staying within budget.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPerformance Management\n. Our performance management application allows employees to set performance goals and competencies for positions across an organization, helping align company goals with workforce goals. It also helps streamline the performance review process with online facilitation of the review process and links performance to pay.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPosition Management\n. Our position management application provides customizable tools to categorize personnel, increasing consistency and organization companywide. The system ties job attributes to a specific position within the organization, not an individual employee, which frees up time to focus on people instead of antiquated processes.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n9\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nPaycom Learning\n. Our learning management application delivers a smart, simple, data-driven experience that formalizes and standardizes our clients’ training processes, thereby allowing them to quickly adapt in an ever-changing business environment. It provides employees with “anytime, anywhere” access to a central knowledge base where they can access content, share expertise and measure their professional development progress, while its built-in video content creator allows subject-matter experts to share knowledge across the company by empowering them to create, upload and distribute engaging microlearning content quickly and easily. With performance evidence within Paycom Learning, our clients can create a lesson tool that allows their employees to demonstrate knowledge and mastery of a specific skill to confirm they are truly grasping the course material. Managers or trainers then can provide direct input about the employee’s performance, creating a true feedback loop that promotes employee development. In addition to providing the ability to create and upload custom content, we created and launched our own proprietary eLearning content. Paycom Learning clients have immediate access to a library of Paycom-created learning courses, which allows employers to educate their managers and employees quickly and consistently on foundational topics such as workplace violence, discrimination and harassment prevention. Paycom content subscriptions are also available with hundreds of courses in English and Spanish. These courses are tailored to organizations across multiple industries.\n\n\n\n\n\n\nHR Management\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nManager on-the-Go.\n Our Manager on-the-Go tool gives supervisors and managers the ability to perform a variety of tasks, such as approving time-off requests and expense reimbursements — anytime, anywhere. It enhances usage patterns and the interactions within organizations among leaders and employees, while distributing the approval responsibilities more broadly, freeing HR personnel. This tool allows managers and supervisors to, among other things, view their team’s time-off calendar, edit and approve punch-change requests, manage employees’ schedules and respond to employee inquiries through Ask Here. Manager on-the-Go provides a seamless toggle between Manager on-the-Go and Employee Self-Service.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nDirect Data Exchange.\n Our comprehensive management analytics tool gives employers insights into efficiencies gained through employee usage of HR technology and provides a real-time return on investment on that usage (based on findings by EY). Using our Direct Data Exchange (DDX) tool, employers not only can see the cost savings associated with changes made by employees, but they can also drill down into specific aspects of our software, including time and attendance, benefits, expenses, time-off requests, tax and payroll modifications, to determine exactly where additional savings can be achieved. This feature allows clients to see organizational employee usage trends arranged by their preferred time frame and total logins (filterable by individuals) to Employee Self-Service through any device.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nAsk Here.\n Our Ask Here tool gives all client employees a direct line of communication to ask work-related questions of their company representatives and receive timely answers, all through the convenience of our self-service technology. Ask Here’s functionality promotes increased engagement by ensuring all inquiries are addressed, any required actions are taken and no follow-ups are required by the employee. This central repository for employee questions has a convenient dashboard, guided inquiry template, ability to attach documents and photos, and auto-saved responses for commonly asked questions.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nDocuments and Checklists.\n Our documents and checklists application is designed to manage employee files and allows employees to digitally sign and view company documents. Paycom securely stores client records to meet retention requirements and protect documents from unauthorized access and other disasters that can threaten businesses. Aside from expending fewer resources on paper, printing and file storage, our documents and checklists application protects sensitive information and documents by customizing user access levels. In addition, clients can assign checklists to employees for the completion of certain tasks associated with processes such as onboarding and off-boarding.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nGovernment and Compliance\n. Our government and compliance application helps clients reduce exposure to violations, audits and penalties with respect to the employment laws impacting their business, such as the Fair Labor Standards Act, Family Medical Leave Act, Equal Employment Opportunity Act, COBRA and other state and federal regulations. A single database keeps our clients’ employee data consistent and enhances reporting capabilities by providing better accuracy and real-time insight.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nBenefits Administration\n. Our benefits administration application allows clients to customize benefit plan setup, deduction amounts, enrollment dates and waiting periods. Employers are provided census and reconciliation reports to ensure they do not overpay for benefits. Employers can also update deduction amounts for all employees or groups of employees at once, which automatically updates all insurance carriers for any changes. This application also provides employees with online enrollment and helps educate them by allowing them to view per-pay-period deduction amounts and preview how these deductions would affect their take-home pay, driving better informed enrollment decisions for greater employee satisfaction. Our benefits to carrier functionality updates insurance carriers regarding benefit deduction amounts, address changes, termination of benefits and qualifying events. Our benefit enrollment service provides our clients with a\n \n\n\n\n\n\n\n10\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\ndedicated coordinator to help make open enrollment even easier by developing tailored strategies and setting up plans and features within our benefits software offering. The coordinator helps reconcile enrollment and deductions to prepare the client for a successful first payroll of the new plan year.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nCOBRA Administration\n. Our COBRA administration application helps protect employers from COBRA violations and the associated fines and penalties by automatically initiating compliance measures upon entry of qualifying events into the application. In addition to sending required correspondence, this application also tracks important dates, collects and reimburses premiums, and reports on all COBRA activity.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPersonnel Action Forms and Performance Discussion Forms\n. Our personnel action forms (“PAF”) application helps our clients reduce the amount of time and paperwork required to make employee changes, such as pay rate, position and title changes, by allowing managers to complete and approve online personnel action forms, subject to necessary approvals from the HR department. This feature reduces errors, eliminates re-keying of data and automatically populates payroll with an effective date. Performance Discussion Forms, part of our PAF tool, allows clients to manage employee conversations related to a variety of topics, including workplace behavior, development opportunities and paths toward a promotion.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nPaycom Surveys\n. Our surveys application allows employers to conduct confidential email surveys of employees on workplace matters, providing employers with candid feedback that otherwise may go undisclosed. From exit interviews and benefits assessments to rate-the-boss questionnaires, this valuable information can be used to drive decisions and realize company goals. Clients can analyze results by the demographics of the workforce and compare how results change over time.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nRetirement Reporting. \nOur retirement reporting tool simplifies the process of transferring sensitive employee data to clients’ retirement plan providers. It customizes, maps and automates plan reports to meet each provider’s unique specifications. After each payroll is processed and finalized, retirement plan reports are automatically created and delivered to the provider and the secure client inbox within 24 hours.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nReport Center. \nOur easy-to-use reporting software allows clients to create custom reports on HR data within our software. Clients can filter through specifications according to their needs, use the advanced report writer to view visual data representations, such as charts and graphs, and build a detailed analysis of workforce and budget. Report Center provides insights on return on investment, overtime, payroll, job applications, salaries, compensation forecasting and more.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nEnhanced ACA. \nOur ACA application provides clients with access to a dashboard that tracks employee count, employee status, health care plan affordability and ACA periods. Plus, it enables Paycom to file IRS Forms 1094/1095-B and/or -C. Clients using this application also have access to additional real-time compliance reports, alerts and historical data for audit trail purposes.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nClue\n®\n. Clue helps businesses securely collect, track and manage the vaccination and testing data of their workforce. Clue allows employees to easily and quickly enter their vaccination or testing information and also provides automatic reminders and push notifications to help affected employees stay on top of any necessary testing. Clue’s dashboard provides a single, intuitive platform that stores relevant, up-to-date vaccine information and enables organizations to create customized reports to meet different business-specific needs.\n\n\n\n\n\n\nTime and Labor Management\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nTime and Attendance\n. Our time and attendance application allows our clients to accurately and efficiently manage when, where and how employees report their hours worked. Clients can apply customized rules, use batch editing and use timecard management tools to manage complex time and attendance needs. Employees can clock in and out at their desks with web-based time clocks or by using finger scans, badge-swipe or other types of hardware terminals in a single or multi-clock environment. Our web time clock feature allows employees to clock in and out using their mobile device or any device with an internet connection, which automatically updates into the payroll application when approved, eliminating the need to manually calculate time sheets and re-key information into payroll systems.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nScheduling\n. Our scheduling application helps managers with employee scheduling through automated functionality that provides a seamless workflow with the payroll and time and attendance applications. This application allows clients to create and edit templates for different Schedule Groups. It also allows employees and managers access to their schedules at any time, and employees can approve, decline or swap their schedules and see what shifts are available for pickup. Email notifications are sent automatically to supervisors and employees when schedules are created, requests for shift exchanges are submitted or a shift change is approved or denied.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n11\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nTime-Off Requests featuring GONE\n®\n. Our time-off requests application automates and standardizes the time-off request process. GONE, an enhancement to time-off requests, automates time-off decision-making. It allows clients to set criteria to fairly and consistently auto-resolve requests, which helps employers remain adequately staffed. GONE facilitates faster decisions for employees and reduces the burden on managers and HR teams to handle disputes. After setup, decisions flow seamlessly and accurately into payroll. Managers can also view an online time-off calendar to easily monitor time-off requests. Our Employee Self-Service application allows employees to view the time off they have available, submit requests, view the status of requests and any manager comments, and view company holidays and blackout dates.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\nLabor Allocation.\n Our labor allocation application simplifies the process of setting up and tracking employee hours and wages based on different categories, such as job or location. This tool gives clients the ability to streamline pay rules and ensure accurate reporting from the moment their employees record their time.\n\n\n\n\n\n\nOur Clients\n\n\nWe serve a diverse payroll and HCM client base in terms of size and industry. We have approximately 37,500 clients, or approximately 19,400 clients based on parent company grouping. We stored data for over 7.0 million persons employed by our clients during the year ended December 31, 2024.\n\n\nMany small to mid-sized companies can typically make the decision to adopt our solution more quickly than larger companies, which we believe results in a shorter sales cycle and more closely corresponds to our target sales cycle of 30 to 90 days. As a result of the nature and size of our clientele, we maintain a diversified client base and very low revenue concentration among our clients. We believe, however, that larger employers represent a substantial opportunity to increase our revenues per client with limited incremental cost. As we pursue and attract larger clients, we may face longer sales cycles and less predictability in completing some of our sales.\n\n\nCompetition\n \n\n\nThe market for HCM solutions is rapidly evolving, highly competitive and subject to changing technology, shifting client needs and frequent introduction of new products and services. Our competitors range from small, regional firms to large, well-established international firms with multiple product offerings.\n\n\nOur competitors offer HCM solutions that may overlap with one, several or all categories of the applications we offer. We compete with companies such as Automatic Data Processing, Inc., Cornerstone OnDemand, Inc., Dayforce, Inc., Intuit, Inc., Insperity, Inc., Oracle Corporation, Paychex, Inc., Paylocity Holding Corporation, Paycor HCM, Inc., SAP SE, ServiceNow, Inc., Ultimate Kronos Group, Workday, Inc., and other international, national, regional, and local providers. Our competitors provide HCM solutions by various means. Although certain providers continue to deliver legacy enterprise software, most now offer cloud-based solutions, resulting in increased competition for clients seeking the greater flexibility and access to information provided by cloud-based offerings. Furthermore, the HCM industry has experienced an emergence of white label and embedded payroll offerings.\n\n\nCompetition in the HCM solutions market is primarily based on service responsiveness, product quality and reputation, breadth of service, application offering and price. The importance of these factors depends on the size of the business. Price tends to be the most important factor of competition for smaller businesses with fewer employees, while the scope of features and customization is more important to larger businesses. Regardless of a company’s size, another important factor is the implementation experience, as all organizations are seeking a streamlined and simplified process.\n\n\nSales and Marketing\n\n\nWe generate client leads and demo requests, accelerate sales opportunities and build brand awareness through our marketing programs that target senior finance and HR executives, technology professionals and senior business leaders of companies that perform HCM functions in-house or outsource these functions to one of our competitors. Our marketing programs include:\n\n\n•\nPodcasts, webinars, blogs, white papers and infographics;\n\n\n•\nNational and local television advertising campaigns, personalized direct mail campaigns, email campaigns, social and digital media campaigns, industry-specific advertising and tradeshow exhibiting; and\n\n\n•\nSearch engine marketing methods that include site optimization and pay-per-click searches.\n\n\nWe sell our solution exclusively through our captive sales force, substantially all of whom have a four-year college degree. We typically recruit sales candidates who have sales experience in non-HCM industries or, with respect to candidates recruited directly from colleges and universities, who have demonstrated an aptitude for sales. Our sales force is comprised of field sales personnel, who are organized geographically, CRRs, who sell additional applications to existing clients, and our emerging markets representatives, who focus on businesses with fewer than 65 employees. As of the filing of this Form 10-K, we have 58 sales teams (with CRRs and\n \n\n\n12\n\n\n\n\n \n \n\n\nemerging markets representatives counted as one team) located in 29 states and plan to open additional sales offices to further expand our market presence.\n\n\nWhen a new client processes payroll with us for an entire month, our sales representative receives a one-time commission based upon an estimate of future annual revenues from such client. Executive sales representatives receive a higher commission rate and base salary based upon both current year and career-to-date realized sales.\n\n\nIn addition to managing client relationships, our CRRs are focused on expanding the number of applications our clients purchase from us by introducing them to additional applications. When an existing client purchases and then utilizes a new application, a CRR receives a one-time commission based upon an estimate of future annual revenues from such client.\n\n\nTechnology, Operations and Security\n\n\nTechnology\n\n\nOur multi-tenant architecture enables us to deliver our solution across our client base from a single platform, while securely partitioning access to our clients’ respective application data. Because a single version of our solution is developed, supported and deployed across all of our clients, the Paycom solution is seamlessly scalable.\n\n\nOperations\n\n\nWe physically host our solution for our clients in three secure data center facilities located in Oklahoma and Texas. Each of these data centers is owned and managed by Paycom, and Paycom is the only tenant occupying the data centers. All of our critical systems are fully redundant and backed up at regular intervals to these facilities, and backups are monitored for success and failure status daily. Client data is backed up in real-time among the three data centers. We maintain redundant load-balanced internet lines serviced by multiple service providers to each data center, to ensure optimized client access to our solution and the clients’ stored data. Our server and database clusters are fully redundant to ensure continuous service in the event of a disk failure.\n\n\nPhysical security includes biometric and dedicated ID-oriented access control, redundant alarm systems and continuous camera monitoring by our security guards. The data centers also have environmental monitoring and extensive environmental controls such as heat and fire protection, moisture, temperature, and humidity sensors, backup power supply and exterior reinforced concrete walls.\n\n\nTo provide additional support for our operations, we recently purchased a facility in Arizona that will serve as our fourth data center. The security and other features at this facility, which we expect will be fully operational in mid-2025, will be similar to those at our existing data center facilities, as described above.\n\n\nSecurity\n \n\n\nWe maintain a formal and comprehensive security program designed to ensure the confidentiality, integrity and availability of our clients’ data. For a discussion of our information security program, see “",
    "item1c": "Item 1C. Cybersecurity.”\n\n\nSoftware Development\n\n\nOur application development team works closely with our clients to enhance our existing application offerings and develop new applications. This process is led by experienced product managers, who oversee the evolution of their respective applications within a focused timeframe of innovation and cultivation in order to deliver the well-developed applications and enhancements desired by our clients. Our product managers are proactive in their approach to assigning development requests based on research, trends and user feedback. A key element of our development process is the one-on-one personal interaction between clients and our service team, through whom our clients personally suggest new applications and features.\n\n\nWe develop our solution from the “ground up” with our internal development and engineering teams. Our development and engineering teams conceive new applications and enhancements, review requests, schedule development in order of priority and subsequently develop the applications or enhancements. Our new applications and enhancements are independently reviewed by the quality assurance team, in accordance with our software development process, before being fully implemented. Enhancements to our applications are typically released on a monthly scheduled release date to coordinate the communication and release to our clients.\n\n\nClient Service\n\n\nWe are committed to providing industry-leading, client-centered service. For this reason, we assign each client a specialist within a dedicated team. This one-on-one service is a key part of our client service model and helps to ensure we are delivering a differentiated solution and maintaining high client satisfaction. The primary elements of our client service model include the following:\n\n\nStreamlined Setup and Onboarding\n\n\nAfter electing to deploy our solution, a new client begins our onboarding process with assistance from a team of new client setup specialists and the sales representative responsible for obtaining the client’s business. In addition, we also have a team of\n \n\n\n13\n\n\n\n\n \n \n\n\ntransition specialists whose job it is to ensure that the process is performed smoothly, data is collected properly and all relevant employees are fully trained on the system. This team works closely with the client until the client is capable of managing our solution independently, at which time responsibility for the client relationship is transferred to our dedicated CRRs and service specialists. Unlike certain of our competitors, we do not outsource any of our onboarding efforts.\n\n\nDedicated Service Specialists\n\n\nAfter completing the onboarding process, each client is assigned to a service specialist within a dedicated team. Clients can then contact their dedicated service specialist or a team member if any issues or questions arise. These specialists provide personalized service with a historical knowledge of the clients’ communicated business needs. In addition, our CRRs proactively contact our clients to ensure satisfaction with our solution and introduce additional applications.\n\n\nExpert Level Service\n\n\nOur service specialists are trained across all of our applications to ensure that they can provide comprehensive, expert-level service. Our Quality Management System is ISO 9001:2015 certified and helps support our high client retention rate.\n\n\nGovernment Regulation\n\n\nWe are subject to various regulations in each of the jurisdictions in which we provide services. Local laws and regulations, and their interpretation and enforcement, differ significantly among those jurisdictions. We are also subject to certain federal, state, local and foreign regulations based on the products we offer. For example, as a result of our background screening application, Enhanced Background Checks, we are subject to the Fair Credit Reporting Act and other federal and state background reporting laws. Further, our status as a government contractor subjects us to federal government contracting regulations including the adherence to heightened equal employment opportunity requirements, maintaining an affirmative action plan and other federal regulations.\n\n\nData privacy has become a significant issue in the United States and in other countries. The regulatory framework for privacy issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. Many federal, state and foreign government bodies and agencies have adopted or are considering adopting laws and regulations affecting or regarding the collection, use and disclosure of personal information. In the United States, these include, for example, rules and regulations promulgated under the authority of the Federal Trade Commission, the Health Insurance Portability and Accountability Act of 1996, the Family Medical Leave Act of 1993, the ACA, the Financial Services Modernization Act of 1999, the Gramm-Leach-Bliley Act, state biometric privacy laws, including the Illinois Biometric Information Privacy Act (“IBIPA”), state breach notification laws and state consumer privacy laws, including the California Consumer Privacy Act (“CCPA”), as amended by the California Privacy Rights Act (“CPRA”). Further, because some of our clients have international establishments, the Canadian Personal Information Protection and Electronic Documents Act (“PIPEDA”), Mexico’s Federal Law on the Protection of Personal Data held by Private Parties, and the European Union’s General Data Protection Regulation (“GDPR”) and other foreign data privacy laws may impact our processing of certain client and employee information. Artificial intelligence (“AI”) and machine learning software tools have continued to evolve and improve, and these tools have become increasing vital to the development and support of our applications and services. Legislative authorities in the United States and the European Union have responded to this evolution by enacting and/or proposing legislation that imposes restrictions on the development, use, and training of generative AI models and algorithms. For example, earlier this year, the new European Union AI Act was approved, and Colorado enacted its Artificial Intelligence Act. The regulatory landscape related to generative AI and machine learning is rapidly evolving and is likely to remain uncertain for the foreseeable future. As we continue to develop and improve our services by incorporating technologies such as generative AI and machine learning, we must monitor and comply with these new applicable AI laws and regulations.\n\n\nAnti-corruption, anti-money laundering (“AML”), and economic and trade sanctions laws and regulations are under continuously expanding scrutiny by regulators worldwide. We are subject to trade and economic sanctions programming, including schedules administered by the U.S. Treasury Department Office of Foreign Assets Control, which prohibit us from engaging in transactions or dealings with blocked countries, their governments, and, occasionally, specified nationals, including specially designated individuals and entities.\n\n\nGlobally, we intend to maintain registrations and licenses in regulatory alignment with the countries in which we operate. We are registered with the U.S. Treasury Department Financial Crimes Enforcement Network, and Paycom Canada, Inc. is a registered Money Service Business with the Financial Transactions and Reports Analysis Centre of Canada. In 2024, the Office of the Comptroller of Currency (the “OCC”) authorized us to open the Paycom National Trust Bank, National Association (the “Paycom National Trust Bank”), via a national trust bank charter pursuant to the National Bank Act. The Paycom National Trust Bank is the sole trustee of Paycom Client Trust, our grantor trust, which now holds substantially all client payroll and related funds and is responsible for the oversight and management of those client funds. The Paycom National Trust Bank, and all its fiduciary activities, including the U.S. money movement it oversees and manages via Paycom Client Trust, are subject to comprehensive ongoing oversight and regulation by the OCC. In addition, our U.S. money movement managed by the Paycom National Trust Bank is subject to the AML and reporting provisions of The Bank Secrecy Act of 1970, as amended by the USA Patriot Act of 2000 (the “BSA”). Our\n \n\n\n14\n\n\n\n\n \n \n\n\nmoney movement activities outside of the United States are subject to similar licensing and AML and reporting laws and requirements in the countries in which we provide such services.\n \n\n\nCertifications\n\n\nWe voluntarily obtain third-party security examinations relating to our internal controls over financial reporting in accordance with System and Organization Controls Report, I (“SOC 1”). Our SOC 1 examination is conducted every six months by one of the four largest independent international auditing firms, and addresses, among other areas, our physical and environmental safeguards for production data centers, data availability and integrity procedures, change management procedures and logical security procedures. We also obtain third-party examinations relating to our internal controls over security and privacy in accordance with System and Organization Controls Report, II (“SOC 2”). Our SOC 2 examination is conducted every year and addresses, among other areas, internal controls around security, availability, and processing integrity. We publish SOC 1 reports semiannually and SOC 2 and SOC 3 reports annually.\n\n\nIn April 2023, we renewed a certification based on ISO 9001:2015 criteria, a standard for the implementation of a Quality Management System published by ISO, covering our activities required to create and deliver our solution. This independent assessment of our conformity to the ISO 9001:2015 standard includes assessing the design and implementation of quality objectives to meet delivery standards on an ongoing basis. The certification is valid until April 2026, with continuing assessments taking place annually.\n\n\nIn October 2022, we renewed a certification based on ISO 22301:2019 criteria, a standard for implementing and managing an effective Business Continuity Management System (BCMS) published by ISO. This international standard for continuity management specifies requirements to plan, implement, operate and continually improve a documented management system to protect against, prepare for, respond to and recover from disruptive incidents when they arise. The certification is valid until January 2026, with continuing assessments taking place annually.\n\n\nIn November 2022, we renewed a certification based on ISO/IEC 27001:2013 criteria, a security standard for Information Security Management Systems published by ISO covering our production, quality assurance and implementation environments. This independent assessment of our conformity to the ISO 27001 standard includes assessing security risks, designing and implementing comprehensive security controls and adopting an information security management process to meet security needs on an ongoing basis. The certification is valid until October 2025, with continuing assessments taking place annually.\n\n\nIn November 2022, we renewed a certification based on ISO/IEC 27701:2019 criteria, a standard for establishing, implementing, maintaining and continually improving a Privacy Information Management System (“PIMS”) published by ISO. This international standard for PIMS specifies PIMS-related requirements and provides guidance for Personally Identifiable Information (“PII”) controllers and PII processors holding responsibility and accountability for PII processing. The certification is valid until October 2025, with continuing assessments taking place annually.\n\n\nIntellectual Property\n\n\nWe rely on a combination of copyrights, trademarks, service marks, trade secrets and contractual restrictions to establish and protect our intellectual property rights. We have a number of registered and unregistered trademarks designed to protect our brand and goodwill, and we will continue to evaluate the registration of additional trademarks as appropriate. We do not have any patents or patent applications pending.\n\n\nSeasonality\n\n\nOur revenues are seasonal in nature. Generally, we expect our first and fourth quarter revenues to be higher than other quarters during the year because payroll tax filing forms and ACA forms are typically processed in the first quarter, and unscheduled payroll runs (such as bonuses) for our clients are typically concentrated in the fourth quarter. We anticipate that our revenues will continue to exhibit this seasonal pattern related to ACA form filings for so long as the ACA (or replacement legislation) includes employer reporting requirements. Nonetheless, we expect the magnitude of these seasonal fluctuations in our revenues to decrease to the extent clients utilize more of our non-payroll applications.\n\n\nHuman Capital\n \n\n\nAs of December 31, 2024, we employed 7,306 people, substantially all of whom are full-time employees. Our human capital objectives include attracting, developing and retaining the best talent in the industry. We have been recognized both locally and nationally for providing our employees with an excellent work environment. We strive to foster an inclusive workplace that is free from harassment or discrimination, including harassment or discrimination involving race, color, sex, religion, gender, age, national origin, disability, gender identity or expression, sexual orientation, veteran or marital status.\n\n\n15\n\n\n\n\n \n \n\n\nCulture and Values\n\n\nPaycom’s purpose is to create technology that simplifies life for employees. Our purpose guides every aspect of our business and creates a culture that aligns our employees with the core values of our company:\n\n\n•\nWe Innovate\n\n\n•\nWe Win\n\n\n•\nWe Care\n\n\n•\nWe Serve\n\n\n•\nWe Believe\n\n\nThese values further define us and drive our success. They steer how we work with our clients and each other. Paycom would not be the company it is today without a deep desire to win and innovate new ideas. Our focus on people — including our team members, our clients and their employees — and caring about their experience, health and success, is at the heart of our culture. Our can-do attitude helps us embrace uncertainty with optimism and believe we can achieve what others consider impossible.\n\n\nWorkforce Demographics\n\n\nWe recognize Paycom plays an important part in the lives of our employees and strive to create an inclusive workplace where employees feel heard, valued and appreciated for who they are. We continue to work toward our goal of attracting, retaining and developing a workforce that is diverse in background, knowledge, skill and experience at all employee levels, from entry level to executive. The demographic workforce data within the table below, including race and ethnicity, gender and job categories, aligns with the EEO-1 Component 1 data collection reporting requirements outlined by the U.S. Equal Employment Opportunity Commission, where applicable, and includes U.S.-based employees only.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nAs of December 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAll Employees\n\n\n \n\n\n \n\n\nFirst/Mid Level Officials & Managers\n\n\n \n\n\n \n\n\nExecutive/Sr. Level Officials & Managers\n\n\n \n\n\n\n\n\n\nGender:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFemale\n\n\n \n\n\n \n\n\n47.4\n\n\n%\n\n\n \n\n\n \n\n\n52.4\n\n\n%\n\n\n \n\n\n \n\n\n41.9\n\n\n%\n\n\n\n\n\n\nMale\n\n\n \n\n\n \n\n\n52.0\n\n\n%\n\n\n \n\n\n \n\n\n47.6\n\n\n%\n\n\n \n\n\n \n\n\n58.1\n\n\n%\n\n\n\n\n\n\nNon-Binary\n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRace and Ethnicity:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmerican Indian or Alaskan Native\n\n\n \n\n\n \n\n\n2.4\n\n\n%\n\n\n \n\n\n \n\n\n2.8\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAsian\n\n\n \n\n\n \n\n\n12.2\n\n\n%\n\n\n \n\n\n \n\n\n7.2\n\n\n%\n\n\n \n\n\n \n\n\n2.7\n\n\n%\n\n\n\n\n\n\nBlack or African American\n\n\n \n\n\n \n\n\n8.0\n\n\n%\n\n\n \n\n\n \n\n\n4.2\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nHispanic or Latino\n\n\n \n\n\n \n\n\n11.1\n\n\n%\n\n\n \n\n\n \n\n\n6.1\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nNative Hawaiian or Pacific Islander\n\n\n \n\n\n \n\n\n0.3\n\n\n%\n\n\n \n\n\n \n\n\n0.2\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTwo or more races\n\n\n \n\n\n \n\n\n4.1\n\n\n%\n\n\n \n\n\n \n\n\n2.3\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nWhite\n\n\n \n\n\n \n\n\n58.5\n\n\n%\n\n\n \n\n\n \n\n\n74.5\n\n\n%\n\n\n \n\n\n \n\n\n95.9\n\n\n%\n\n\n\n\n\n\nNot Specified\n\n\n \n\n\n \n\n\n3.4\n\n\n%\n\n\n \n\n\n \n\n\n2.7\n\n\n%\n\n\n \n\n\n \n\n\n1.4\n\n\n%\n\n\n\n\n\n\nTraining and Development\n\n\nThrough the use of our Paycom learning tool, we empower our employees by providing tailored learning paths in areas such as leadership, inclusion, technical skills and compliance.\n\n\nWe provide our sales force with intensive training courses. Our unique training program includes instruction in accounting, business metrics, application features and tax matters relevant to our target market and we believe it fosters loyalty and helps maintain our corporate culture. Our training continues for our sales force through weekly strategy sessions and leadership development training. Executive sales representatives are also required to attend conferences to share leading practices and receive legal and business updates.\n\n\nHealth, Safety and Wellness\n\n\nWe believe that our employees are the summation of our successes, which is why we offer an excellent health and benefits program to our employees and their families. We offer our employees comprehensive health insurance as well as optional dental and vision coverage. Additionally, we provide our employees several opportunities to focus on physical, mental and financial wellness by maintaining a fully equipped on-site gym, 401(k) matching, an employee stock purchase plan, and paid vacation, holiday, family leave and sick leave, with numerous other benefits offered to our employees.\n\n\n16\n\n\n\n\n \n \n\n\nSegment Information\n\n\nWe operate in a single operating segment and a single reporting segment. Operating segments are defined as components of an enterprise about which separate financial information is regularly evaluated by the chief operating decision maker function (which is fulfilled by our Chief Executive Officer) in deciding how to allocate resources and in assessing performance. Our Chief Executive Officer allocates resources and assesses performance based upon financial information at the consolidated level. See Note 15 “Segment Reporting” in the notes to the consolidated financial statements for additional information.\n\n\nAvailable Information\n\n\nOur internet address is www.paycom.com and our investor relations website is located at investors.paycom.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports can be found on our investor relations website, free of charge, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (the “SEC”). Information contained on our website is not incorporated by reference into this Form 10-K. The SEC maintains a public website, www.sec.gov, which includes information about and the filings of issuers that file electronically with the SEC.\n\n\n17"
  }
}