{
  "ticker": "PCAR",
  "cik": "0000075362",
  "company_name": "PACCAR INC",
  "filing_date": "2025-02-19",
  "accession": "0000950170-25-023145",
  "primary_doc": "pcar-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. B\nUSINESS.\nPACCAR Inc (the Company or PACCAR), incorporated under the laws of Delaware in 1971, is the successor to Pacific Car and Foundry Company which was incorporated in Washington in 1924. The Company traces its predecessors to Seattle Car Manufacturing Company formed in 1905.\n \nDescription of Business\n \nPACCAR is a multinational company operating in three principal industry segments:\n \n(1)\nThe Truck segment includes the design, manufacture and distribution of high-quality, light-, medium- and heavy-duty commercial trucks. Heavy-duty trucks have a gross vehicle weight (GVW) of over 33,000 lbs (Class 8) in North America and over 16 metric tonnes in Europe and South America. Medium-duty trucks have a GVW ranging from 19,500 to 33,000 lbs (Class 6 to 7) in North America, and in Europe, light- and medium-duty trucks range between 6 and 16 metric tonnes. Trucks are configured with the engine in front of cab (conventional) or cab-over-engine (COE).\n(2)\nThe Parts segment includes the distribution of aftermarket parts for trucks and related commercial vehicles. \n(3)\nThe Financial Services segment includes finance and leasing products and services provided to customers and dealers. PACCAR’s finance and leasing activities are principally related to PACCAR products and associated equipment. \nPACCAR's Other business included the manufacturing and marketing of industrial winches through October 31, 2024, when PACCAR sold 100% of the capital stock of PACCAR Winch Inc.\nTRUCKS\nPACCAR’s trucks are marketed under the Kenworth, Peterbilt and DAF nameplates. These trucks, which are built in three plants in the United States, three in Europe and one each in Australia, Brasil, Canada and Mexico, are used worldwide for over-the-road and off-highway hauling of commercial and consumer goods. The Company also designs and manufactures diesel engines, primarily for use in the Company’s trucks, at its facilities in Columbus, Mississippi; Eindhoven, the Netherlands; and Ponta Grossa, Brasil. PACCAR competes in the North American Class 8 market, primarily with Kenworth and Peterbilt conventional models. These trucks are assembled at facilities in Chillicothe, Ohio; Denton, Texas; Renton, Washington and Mexicali, Mexico. PACCAR also competes in the North American Class 6 to 7 markets primarily with Kenworth and Peterbilt conventional models. These trucks are assembled at facilities in Ste. Therese, Canada; Denton, Texas, and Mexicali, Mexico. PACCAR competes in the European light/medium market with DAF COE trucks assembled in the United Kingdom (U.K.) by Leyland, one of PACCAR’s wholly owned subsidiaries, and participates in the European heavy market with DAF COE trucks assembled in the Netherlands and the U.K. PACCAR competes in the Brazilian heavy truck market with DAF COE models assembled in Ponta Grossa in the state of Paraná, Brasil. PACCAR competes in the Australian medium and heavy truck markets with Kenworth conventional and COE models and certain DAF COE models assembled at its facility at Bayswater in the state of Victoria, Australia, and DAF COE models primarily assembled in the U.K. Commercial truck manufacturing comprises the largest segment of PACCAR’s business and accounted for 74% of total 2024 net sales and revenues.\n \nSubstantially all trucks are sold to independent dealers. The Kenworth and Peterbilt nameplates are marketed and distributed by separate divisions in the U.S. and a foreign subsidiary in Canada. The Kenworth nameplate is also marketed and distributed by foreign subsidiaries in Mexico and Australia. The DAF nameplate is marketed and distributed worldwide by a foreign subsidiary headquartered in the Netherlands and is also marketed and distributed by foreign subsidiaries in Brasil, Australia and Mexico. The decision to operate as a subsidiary or as a division is incidental to PACCAR’s Truck segment operations and reflects legal, tax and regulatory requirements in the various countries where PACCAR operates.\n \nThe Truck segment utilizes centrally managed purchasing, information technology, technical research and testing, treasury and finance functions. Some manufacturing plants in North America produce trucks for more than one nameplate, while other plants produce trucks for only one nameplate, depending on various factors. Best manufacturing practices within the Company are shared on a routine basis reflecting the similarity of the business models employed by each nameplate.\n \n\n\n3\n \n\n\n\n\n \nThe Company’s trucks have a reputation for high quality products, most of which are ordered by dealers according to customer specifications. Some units are ordered by dealers for stocking to meet the needs of certain customers who require immediate delivery or for customers that require the chassis to be fitted with specialized bodies. For a significant portion of the Company’s truck operations, major components, such as engines, transmissions and axles, as well as a substantial percentage of other components, are purchased from component manufacturers pursuant to PACCAR and customer specifications. DAF, which is more vertically integrated, manufactures PACCAR engines and axles and a higher percentage of other components for its heavy truck models. The Company also manufactures engines at its Columbus, Mississippi facility. In 2024, the Company installed PACCAR engines in approximately 33% of the Company’s Kenworth and Peterbilt heavy‑duty trucks in the U.S. and Canada and substantially all of the DAF heavy-duty trucks sold throughout the world. Engines not manufactured by the Company are purchased from Cummins Inc. (Cummins). The Company purchased a significant portion of its transmissions from Eaton Corporation Plc. (Eaton) and ZF Friedrichshafen AG (ZF). The Company also purchased a significant portion of North America stampings used for cabs from Magna International Inc. (Magna). The Company has long-term agreements with Cummins, Eaton, ZF and Magna to provide for continuity of supply. A loss of supply from Cummins, Eaton, ZF or Magna, and the resulting interruption in the production of trucks, would have a material effect on the Company’s results. Purchased materials and parts include raw materials, partially processed materials, such as castings, and finished components manufactured by independent suppliers. The Company and its suppliers rely on semiconductors as an essential component in the production of its trucks and aftermarket parts. The Company and its suppliers source semiconductors from various suppliers. Raw materials, partially processed materials and finished components typically make up approximately 85% of the cost of new trucks. The value of finished truck components manufactured by independent suppliers is lower in Europe due to a higher level of vertical integration as compared to North America. In addition to materials, the Company’s cost of sales includes labor and factory overhead, vehicle delivery and warranty. Accordingly, except for certain factory overhead costs such as facilities depreciation, property taxes and utilities, the Company’s cost of sales are highly correlated to sales.\n \nThe Company’s DAF subsidiary purchases fully assembled cabs from a competitor, Renault V.I., for its European light-, medium-duty product line pursuant to a joint product development and long-term supply contract. Sales of trucks manufactured with these cabs amounted to approximately 2% of consolidated revenues in 2024. A short-term loss of supply, and the resulting interruption in the production of these trucks, would not have a material effect on the Company’s results of operations. However, a loss of supply for an extended period of time would require the Company to either contract for an alternative source of supply or to manufacture cabs itself.\n \nOther than these components, the Company is not limited to any single source for any significant component, although the sudden inability of a supplier to deliver components could have a temporary adverse effect on production of certain products. Manufacturing inventory levels are based upon production schedules and orders are placed with suppliers accordingly.\n \nKey factors affecting Truck segment earnings include the number of new trucks sold in the markets served and the margins realized on the sales. The Company’s sales of new trucks are dependent on the size of the truck markets served and the Company’s share of those markets. Truck segment sales and margins tend to be cyclical based on the level of overall economic activity, the availability of capital and the amount of freight being transported. The Company’s costs for trucks consist primarily of material costs, which are influenced by the price of commodities such as steel, copper, aluminum and petroleum. The Company utilizes long-term supply agreements to reduce the variability of the unit cost of purchased materials and finished components and engages in hedging activities for some commodities in certain geographical markets. The Company’s spending on research and development varies based on product development cycles and government requirements such as changes to diesel engine emissions and vehicle fuel efficiency standards in the various markets served. The Company maintains rigorous control of selling, general and administrative (SG&A) expenses and seeks to minimize such costs.\n \nThere are four principal competitors in the U.S. and Canada commercial truck market. The Company’s share of the U.S. and Canadian Class 8 market was 30.7% of retail sales in 2024, and the Company’s medium-duty market share was 18.0%. In Europe, there are six principal competitors in the commercial truck market, including parent companies to the four competitors of the Company in the U.S. In 2024, DAF had a 14.4% share of the European heavy-duty market and a 9.5% share of the light/medium-duty market. These markets are highly competitive in price, quality and service. PACCAR is not dependent on any single customer for its sales. There are no significant seasonal variations in sales.\nThe Peterbilt, Kenworth and DAF nameplates are recognized internationally and play an important role in the marketing of the Company’s truck products. The Company engages in a continuous program of trademark and trade name protection in all marketing areas of the world.\n \n\n\n4\n \n\n\n\n\n \nThe Company’s truck products are subject to noise, emission and safety regulations. Competing manufacturers are subject to the same regulations. The Company believes the cost of complying with these regulations will not be detrimental to its business.\n \nThe Company had a total production backlog of $7.6 billion at the end of 2024. Within this backlog, orders scheduled for delivery within three months (90 days) are considered to be firm. The 90‑day backlog approximated $3.8 billion at December 31, 2024, $7.6 billion at December 31, 2023 and $8.0 billion at December 31, 2022. Production of the year-end 2024 backlog is expected to be substantially completed during 2025.\nPARTS\nThe Parts segment includes the distribution of aftermarket parts for trucks and related commercial vehicles to over 2,000 Kenworth, Peterbilt and DAF dealers and more than 350 TRP, PACCAR's aftermarket parts brand, stores in 95 countries around the world. Aftermarket truck parts are sold and delivered to the Company’s independent dealers through the Company’s 20 strategically located parts distribution centers (PDCs) in the U.S., Canada, Europe, Australia, Mexico and Central and South America. Parts are primarily purchased from various suppliers and also manufactured by the Company. Aftermarket parts inventory levels are determined largely by anticipated customer demand and the need for timely delivery. The Parts segment accounted for 20% of total 2024 net sales and revenues.\nKey factors affecting Parts segment earnings include the aftermarket parts sold in the markets served and the margins realized on the sales. Aftermarket parts sales are influenced by the total number of the Company’s trucks in service and the average age and mileage of those trucks. To reflect the benefit the Parts segment receives from costs incurred by the Truck segment, certain factory overhead, research and development, engineering and SG&A expenses are allocated from the Truck segment to the Parts segment. The Company’s cost for parts sold consists primarily of material costs, which are influenced by the price of commodities such as steel, copper, aluminum and petroleum. The Company utilizes long-term supply agreements to reduce the variability of the cost of parts sold. The Company maintains rigorous control of SG&A expenses and seeks to minimize such costs.\n \nFINANCIAL SERVICES\n \nPACCAR Financial Services (PFS) operates in 26 countries in North America, Europe, Australia and South America through wholly owned finance companies operating under the PACCAR Financial trade name. PFS also conducts full-service leasing operations through operating divisions or wholly owned subsidiaries in North America, Germany and Australia under the PacLease trade name. Selected dealers in North America and Australia are franchised to provide full-service leasing. PFS provides its franchisees with equipment financing and administrative support. PFS also operates its own full-service lease outlets. PFS’s retail loan and lease customers consist of small, medium and large commercial trucking companies, independent owner/operators and other businesses and acquire their PACCAR trucks principally from independent PACCAR dealers. PFS accounted for 6% of total net sales and revenues and 52% of total assets in 2024.\nPFS is primarily responsible for managing the sales of the Company’s used trucks. The Company’s Financial Services segment sells used trucks returned from matured operating leases in the ordinary course of business and trucks acquired from repossessions. PFS also obtains used trucks from the Truck segment in trades related to new truck sales and trucks returned from residual value guarantees (RVGs). Certain gains and losses from the sale of used trucks are shared with the Truck segment. The Company’s Financial Services segment records revenue on the sale of used trucks received in trade and RVG returns.\nThe Company’s finance receivables are classified as dealer wholesale, dealer retail and customer retail segments. The dealer wholesale segment consists of truck inventory financing to independent PACCAR dealers. The dealer retail segment consists of loans and leases to participating dealers and franchises, which use the proceeds to fund their customers’ acquisition of trucks and related equipment. The customer retail segment consists of loans and leases directly to customers for their acquisition of trucks and related equipment. Customer retail receivables are further segregated by fleet and owner/operator classes. The fleet class consists of customers operating five or more trucks. All others are considered owner/operators. Similar methods are employed to assess and monitor credit risk for each class.\nFinance receivables are secured by the trucks and related equipment being financed or leased. The terms of loan and lease contracts generally range from three to five years depending on the type and use of equipment. Payment is required on dealer inventory financing when the floored truck is sold to a customer or upon maturity of the flooring loan, whichever comes first. Dealer inventory loans generally mature within one year.\n \n\n\n5\n \n\n\n\n\n \nThe Company funds its financial services activities primarily from collections on existing finance receivables and borrowings in the capital markets. The primary sources of borrowings in the capital markets are commercial paper and medium-term notes issued in public and private offerings and, to a lesser extent, bank loans. An additional source of funds is loans from other PACCAR companies. PFS matches the maturity and interest rate characteristics of its debt with the maturity and interest rate characteristics of loans and leases.\n \nKey factors affecting the earnings of the Financial Services segment include the volume of new loans and leases, the yield earned on the loans and leases, the costs of funding investments in loans and leases, the ability to collect the amounts owed to PFS, the volume of used truck sales and used truck prices. New loan and lease volume is dependent on the volume of new trucks sold by Kenworth, Peterbilt and DAF and the share of those truck sales that are financed by the Financial Services segment. The Company’s Financial Services market share is influenced by the extent of competition in the financing market. PFS’s primary competitors include commercial banks and independent finance and leasing companies.\n \nThe revenue earned on loans and leases depends on market interest and lease rates and the ability of PFS to differentiate itself from the competition by superior industry knowledge and customer service. Dealer inventory loans have variable rates with rates reset monthly based on an index pertaining to the applicable local market. Retail loan and lease contracts normally have fixed rates over the contract term. PFS obtains funds either through fixed rate borrowings or through variable rate borrowings, a portion of which have been effectively converted to fixed rate through the use of interest-rate contracts. This enables PFS to obtain a stable spread between the cost of borrowing and the yield on fixed rate contracts over the contract term. Included in Financial Services cost of revenues is depreciation on equipment on operating leases. The amount of depreciation on operating leases principally depends on the acquisition cost of leased equipment, the term of the leases, which generally ranges from three to five years, and the residual value of the leases, which generally ranges from 30% to 70%. The margin earned is the difference between the revenues on loan and lease contracts and the direct costs of operation, including interest and depreciation.\n \nPFS incurs credit losses when customers are unable to pay the full amounts due under loan and finance lease contracts. PFS takes a conservative approach to underwriting new retail business in order to minimize credit losses.\nThe ability of customers to pay their obligations to PFS depends on the state of the general economy, the extent of freight demand, freight rates and the cost of fuel, among other factors. PFS limits its exposure to any one customer, with no one customer or dealer balance representing over 5% of the aggregate portfolio assets. PFS generally requires a down payment and secures its interest in the underlying truck collateral and may require other collateral or guarantees. In the event of default, PFS will repossess the truck and sell it in the open market primarily through its dealer network or PFS used truck centers. PFS will also seek to recover any shortfall between the amounts owed and the amounts recovered from sale of the collateral. The amount of credit losses depends on the rate of default on loans and finance leases and, in the event of repossession, the ability to recover the amount owed from sale of the collateral which is affected by used truck prices and other factors. For over sixty years, PFS’s experience has been that periods of economic weakness result in higher past dues and increased rates of repossession. Used truck prices also tend to fall during periods of economic weakness. As a result, credit losses tend to increase during periods of economic weakness. PFS provides an allowance for credit losses based on specifically identified customer risks and an analysis of estimated losses inherent in the portfolio, considering the amount of past due accounts, the trends of used truck prices and the current and forecasted economic conditions of its geographic markets.\nFinancial Services SG&A expenses consist primarily of personnel costs associated with originating and servicing the loan and lease portfolios. These costs vary somewhat depending on overall levels of business activity, but given the ongoing nature of servicing activities, tend to be relatively stable.\nOTHER BUSINESSES\n \nOther businesses included the manufacturing of industrial winches in two U.S. plants and marketing them under the BRADEN, CARCO and Gearmatic nameplates through October 31, 2024. Sales of industrial winches were less than 1% of total net sales and revenues in 2024, 2023 and 2022.\n \nPATENTS\nThe Company owns numerous patents which relate to all product lines. Although these patents are considered important to the overall conduct of the Company’s business, no patent or group of patents is considered essential to a material part of the Company’s business.\n\n\n6\n \n\n\n\n\n \nREGULATION\nAs a manufacturer of highway trucks, the Company is subject to the National Traffic and Motor Vehicle Safety Act and Federal Motor Vehicle Safety Standards promulgated by the National Highway Traffic Safety Administration as well as environmental laws and regulations in the United States, and is subject to similar regulations in all countries where it has operations and where its trucks are distributed. In addition, the Company is subject to certain other licensing requirements to do business in the United States and Europe. The Company believes it is in compliance with laws and regulations applicable to safety standards, the environment and other licensing requirements in all countries where it has operations and where its trucks are distributed.\n \nThe Company designs and manufactures engines for use in PACCAR vehicles worldwide. The Company’s operations and products are subject to extensive statutory and regulatory requirements governing greenhouse gas and non-greenhouse gas emissions. These include standards imposed by the U.S. Environmental Protection Agency (EPA), the European Union, U.S. state regulatory agencies (such as the California Air Resources Board), regulatory agencies in other international markets where the Company operates, and international accords related to climate change including the Paris Agreement. The primary laws and regulations are the EPA’s Greenhouse Gas Emissions Standards and Fuel Efficiency Standards for Medium and Heavy-Duty Engines and Vehicles, EPA’s Clean Truck Initiative, the Regulation of the European Parliament and of the Council on the Monitoring and Reporting of CO2 Emissions from Fuel Consumption of New Heavy-Duty Vehicles, and the Heavy-Duty Omnibus Regulation and Advanced Clean Truck (ACT) regulation of the California Air Resources Board. The ACT regulation, which has been adopted by several other states, requires an increasing percentage of medium- and heavy-duty trucks sold into the state to be zero emissions.\n \nThe Company continually monitors developments in emissions and climate change-related laws and regulations in the markets in which the Company conducts business. The Company will continue to fund capital and R&D projects to meet future emissions and certification requirements through the introduction of new technologies into our products, engines and exhaust after-treatment systems.\n \n \nThe Company’s manufacturing and assembly plants are subject to environmental laws and regulations such as regulating air emissions, water discharges and the handling and disposal of hazardous substances. Failure to comply with these regulations could lead to fines and other penalties. The Company believes in all material respects it is in compliance with the laws and regulations applicable to our plants and operations.\nInformation regarding the effects that compliance with international, federal, state and local environmental regulations have on the Company’s capital and operating expenditures and the Company’s involvement in environmental matters is included in",
    "item1a": "ITEM 1A. RI\nSK FACTORS.\nThe following are significant risks which could have a material negative impact on the Company’s financial condition or results of operations.\nBusiness and Industry Risks\nCommercial Truck Market Demand is Variable\n. The Company’s business is highly sensitive to global and national economic conditions as well as economic conditions in the industries and markets it serves. Negative economic conditions and outlook can materially weaken demand for the Company’s equipment and services. The yearly demand for commercial vehicles may increase or decrease more than overall gross domestic product in markets the Company serves, which are principally North America and Europe. Demand for commercial vehicles may also be affected by the introduction of new vehicles and technologies by the Company or its competitors.\n \nCompetition and Prices.\n The Company operates in a highly competitive environment, which could adversely affect the Company’s sales and pricing. Financial results depend largely on the ability to develop, manufacture and market competitive products that profitably meet customer demand.\n \nProduction Costs, Capacity and Inflation.\n The Company’s products are exposed to variability in material and commodity costs. Commodity or component price increases, cost pressures due to inflation, significant shortages of component products and labor availability may adversely impact the Company’s financial results or use of its production capacity. Many of the Company’s suppliers also supply automotive manufacturers, and factors that adversely affect the automotive industry can also have adverse effects on these suppliers and the Company. Supplier delivery performance can be adversely affected if increased demand for these suppliers’ products exceeds their production capacity.\nUnexpected events, including natural disasters, extreme weather events, or pandemics, may increase the Company’s cost of doing business or disrupt the Company’s or its suppliers’ operations. The likelihood or severity of these unexpected events may increase due to the effects of climate change.\nTransition Risks Related to Climate Change. \nThe Company has ongoing product development programs intended to address changing customer demand in the context of climate change and achieve its targeted reductions in emissions. These involve the continuing development of compliant clean diesel powertrains and the design, manufacture, and sale of alternative powertrain commercial vehicles (e.g., battery-electric, hybrid, hydrogen fuel cell, and hydrogen combustion). The pace of transition from diesel combustion to alternative powertrain commercial vehicles is highly uncertain and will be influenced by:\n \n \n•\nthe success of the Company’s research and development programs\n•\ncustomer demand for alternative powertrain vehicles\n•\nadvancements in battery-electric, hybrid, hydrogen fuel cell, and hydrogen combustion technology\n•\nthe cost of batteries, hydrogen fuel cells and liquid hydrogen\n•\nglobal regulations requiring the use of alternative powertrain vehicles and/or providing incentives to facilitate the transition to alternative powertrain commercial vehicles\n•\ninvestments in energy and power infrastructure (e.g., renewable power supply, electric charging services, hydrogen supply and distribution) in key markets, as well as the associated utility costs\n•\nthe ability of the supply chain to deliver components, including commodities and raw materials that are unique to alternative powertrain commercial vehicles\n•\nthe success of new and existing competitors in developing and selling alternative powertrain commercial vehicles\nThe Company believes its current strategies, programs and resources are sufficient to address changes in customer demand in the context of climate change and to meet its emissions reduction targets. If the Company is not successful in addressing the risks noted above, there may be a material adverse impact on its business, operations, and financial condition.\n\n\n11\n \n\n\n\n\n \nLiquidity Risks, Credit Ratings and Costs of Funds. \nDisruptions or volatility in global financial markets could limit the Company’s sources of liquidity, or the liquidity of customers, dealers and suppliers. A lowering of the Company’s credit ratings could increase the cost of borrowing and adversely affect access to capital markets. The Company’s Financial Services segment obtains funds for its operations from commercial paper, medium-term notes and bank debt. If the markets for commercial paper, medium-term notes and bank debt do not provide the necessary liquidity in the future, the Financial Services segment may experience increased costs or may have to limit its financing of retail and wholesale assets. This could result in a reduction of the number of vehicles the Company is able to produce and sell to customers.\n \nThe Financial Services Industry is Highly Competitive. \nThe Company’s Financial Services segment competes with banks, other commercial finance companies and financial services firms which may have lower costs of borrowing, higher leverage or market share goals that result in a willingness to offer lower interest rates, which may lead to decreased margins, lower market share or both. A decline in the Company’s truck unit sales or a decrease in used truck prices are also factors which may affect the Company’s Financial Services segment.\nThe Financial Services Segment is Subject to Credit Risk.\n The Financial Services segment is exposed to the risk of loss arising from the failure of a customer, dealer or counterparty to meet the terms of the loans, leases and derivative contracts with the Company. Although the financial assets of the Financial Services segment are secured by the underlying equipment and sometimes other collateral, in the event a customer cannot meet its obligations to the Company, there is a risk the value of the underlying collateral will not be sufficient to recover the amounts owed to the Company, resulting in credit losses.\n \nInterest-Rate Risks. \nThe Financial Services segment is subject to interest-rate risks, because increases in interest rates can reduce demand for its products, increase borrowing costs and potentially reduce interest margins. PFS uses derivative contracts to match the interest-rate characteristics of its debt to the interest-rate characteristics of its finance receivables in order to mitigate the risk of changing interest rates.\nInformation Technology and Cybersecurity.\n The Company relies on information technology systems and networks, some of which are managed by third parties, to process, transmit and store electronic information, and to manage or support a variety of its business processes and activities. Some of the Company’s products include telematics which provide over-the-air software updates, advanced fleet management tools and real-time data analytics on driver and vehicle performance. These computer systems and networks may be subject to disruptions during the process of upgrading or replacing software, databases or components; power outages; hardware failures; computer viruses/malware; or outside parties attempting to disrupt the Company’s business or gain unauthorized access to the Company’s electronic data. The Company maintains a cybersecurity insurance policy and continues to invest in protections to guard against such events. Despite these safeguards, there remains a risk of system disruptions, unauthorized access and data loss.\n \nIf the Company’s computer systems were to be damaged, disrupted or breached, it could impact data availability and integrity, result in a theft of the Company’s intellectual property or lead to unauthorized disclosure of confidential information of the Company’s customers, suppliers and employees. Security breaches could also result in a violation of U.S. and international privacy and other laws and subject the Company to various litigations and governmental proceedings. These events could have an adverse impact on the Company’s results of operations and financial condition, damage its reputation, disrupt operations and negatively impact competitiveness in the marketplace.\nPolitical, Regulatory and Economic Risks\nMultinational Operations\n. The Company’s global operations are exposed to political, economic and other risks and events beyond its control in the countries in which the Company operates. The Company may be adversely affected by political instabilities, fuel shortages or interruptions in utility or transportation systems, natural calamities, recessions or slower economic growth, inflation, epidemics and pandemics, wars, geopolitical tensions and conflicts, terrorism and labor strikes.\n \nChanges in government monetary or fiscal policies and international trade policies may impact demand for the Company’s products, financial results and competitive position. PACCAR’s global operations are subject to extensive trade, competition and anti-corruption laws and regulations that could impose significant compliance costs.\n \nEnvironmental Regulations. \nThe Company’s operations are subject to environmental laws and regulations that impose significant compliance costs. The Company could experience higher research and development and manufacturing costs due to changes in government requirements for its products, including changes in emissions, fuel, greenhouse gas or other regulations.\n\n\n12\n \n\n\n\n\n \nEmissions Requirements and Reduction Targets.\n \nPACCAR’s operations and products are subject to extensive statutory and regulatory requirements governing greenhouse gas and non-greenhouse gas emissions. These include standards imposed by the U.S. Environmental Protection Agency (EPA), the European Union, U.S. state regulatory agencies (such as the California Air Resources Board), regulatory agencies in other international markets where the Company operates, and international accords related to climate change including the Paris Agreement. The primary laws and regulations are the EPA’s Greenhouse Gas Emissions Standards and Fuel Efficiency Standards for Medium and Heavy-Duty Engines and Vehicles, EPA’s Clean Truck Initiative, the Regulation of the European Parliament and of the Council on the Monitoring and Reporting of CO2 Emissions from Fuel Consumption of New Heavy-Duty Vehicles, and the Heavy-Duty Omnibus Regulation and Advanced Clean Truck (ACT) regulation of the California Air Resources Board. The EU regulations have set CO2 emission reduction targets and require a significant portion of vehicles sold to be zero or near zero emission. Not meeting these targets would result in significant fines by the EU commission. The ACT regulation, which has been adopted by several states, requires an increasing percentage of medium- and heavy-duty trucks sold into the state to be zero emission.\n \n The Company’s product planning is aligned with these statutory and regulatory requirements, and uses a climate change scenario analysis to limit global warming to below 2°C. Even without legislation to reduce greenhouse gas emissions, PACCAR expects to continue to significantly invest in technologies to improve fuel efficiency for its customers, which would also reduce greenhouse gas emissions.\nThe Company continually monitors developments in emissions and climate change-related laws and regulations in the markets in which the Company conducts business, and expects that climate change-related laws, regulations, and international accords will continue to evolve. PACCAR cannot reasonably predict whether future laws, regulations, and international accords could materially increase its environmental compliance costs, alter its product development strategy, or impact its business, financial condition, or results of operations.\nRecalls, Litigation, Product Liability and Regulatory.\n The Company’s products are subject to recall for environmental, performance and safety-related issues. Product recalls, lawsuits, regulatory actions or increases in the reserves the Company establishes for contingencies may increase the Company’s costs and lower profits. Due to the international nature of the Company’s business, some products are also subject to international trade regulations, including customs and import/export related laws and regulations, government embargoes and sanctions prohibiting sales to specific persons or countries, as well as anti-corruption laws. The Company’s telematics depend on cellular frequency allocations regulated by government agencies and collected data is subject to various privacy laws and government regulations. The Company’s reputation and its brand names are valuable assets, and claims or regulatory actions, even if unsuccessful or without merit, could adversely affect the Company’s reputation and brand images because of adverse publicity.\n \nCurrency Exchange and Translation.\n The Company’s consolidated financial results are reported in U.S. dollars, while significant operations are denominated in the currencies of other countries. Currency exchange rate fluctuations can affect the Company’s assets, liabilities and results of operations through both translation and transaction risk, as reported in the Company’s financial statements. The Company uses certain derivative financial instruments and localized production of its products to reduce, but not eliminate, the effects of foreign currency exchange rate fluctuations.\nAccounting Estimates. \nIn the preparation of the Company’s financial statements in accordance with U.S. generally accepted accounting principles, management uses estimates and makes judgments and assumptions that affect asset and liability values and the amounts reported as income and expense during the periods presented. Certain of these estimates, judgments and assumptions, such as residual values on operating leases, the allowance for credit losses and product warranty are particularly sensitive. If actual results are different from estimates used by management, they may have a material impact on the financial statements. For additional disclosures regarding accounting estimates, see “Critical Accounting Policies” under"
  }
}