{
  "ticker": "PFE",
  "cik": "0000078003",
  "company_name": "PFIZER INC",
  "filing_date": "2025-02-27",
  "accession": "0000078003-25-000054",
  "primary_doc": "pfe-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\n––About Pfizer\n \nsection. As a science-driven global biopharmaceutical company, we remain focused on advancing our pipeline, supporting our marketed brands and deploying capital responsibly, with a focus on initiatives that can help contribute to our long-term revenue and future growth. Most of our revenues come from the manufacture and sale of biopharmaceutical products. We believe that our medicines and vaccines provide significant value for healthcare providers and patients, and we continuously evaluate how we can best collaborate with patients, physicians and payors to support and expand patient access to reliable, affordable healthcare around the world. In addition, we continually seek to expand and broaden our product portfolio offerings through prioritized development of our pipeline and business development opportunities targeted at critical unmet patient needs. As a result, our commercial organizational structure and R&D operations are critical to the successful execution of our business strategy. Our ability to fulfill our purpose, \nBreakthroughs that change patients’ lives\n, remains a core focus and underscores our commitment to addressing the needs of society to help sustain long-term value creation for all stakeholders.\nOur 2025 key priorities are:\n1.\nImprove R&D productivity with sharpened focus\n2.\nExpand margins and maximize operational efficiency\n3.\nAchieve commercial excellence in our key categories\n4.\nOptimize capital allocation.\nPfizer Inc.\n2024 Form 10-K\n28\nOne way we believe we will be more efficient, effective and able to execute on these strategic priorities is through technology, including AI.\nIn 2024, we managed our commercial operations through a global structure consisting of three operating segments: Biopharma, PC1 and Pfizer Ignite. Biopharma was the only reportable segment. See \nNote 1\n7\nA\n \nand the \nItem 1. Business––Commercial Operations\n \nsection. At the beginning of 2025, we made the following changes within our Biopharma reportable segment that went into effect on January 1, 2025 to support our continued focus on commercial execution and to further strengthen Pfizer’s capabilities and leadership in discovering and developing breakthrough medicines and vaccines:\n•\ntransitioned the Pfizer U.S. Oncology commercial organization and the global Oncology marketing organization, which were part of the former Pfizer Oncology Division, into the Pfizer U.S. Commercial Division, which now focuses on the commercialization of Pfizer’s entire product portfolio in the U.S. and is led by the Chief U.S. Commercial Officer, Executive Vice President; and\n•\ncombined our global ORD and PRD organizations to form a single Pfizer R&D organization that is responsible for all R&D activities across all therapeutic areas.\nIn the fourth quarter of 2023, we announced that we launched a multi-year, enterprise-wide cost realignment program (Realigning Our Cost Base Program) that aims to realign our costs with our longer-term revenue expectations. In the second quarter of 2024, we announced that we launched a multi-year, multi-phased program to reduce our costs of goods sold (Manufacturing Optimization Program), which is expected to include operational efficiencies, network structure changes, and product portfolio enhancements. See \nNote 3\n. For a description of anticipated savings related to these programs, see the \nCosts and Expenses––Restructuring Charges and Other Costs Associated with Acquisitions and Cost-Reduction/Productivity Initiatives\n \nsection within MD&A\n.\nR&D:\n We believe we have a strong pipeline and are well-positioned for future growth. R&D is at the heart of fulfilling our purpose to deliver breakthroughs that change patients’ lives as we work to translate advanced science and technologies into the medicines and vaccines that may be the most impactful for patients. Innovation, drug discovery and development are critical to our success. In addition to discovering and developing new products, our R&D efforts seek to add value to our existing products by improving their effectiveness and ease of dosing and by discovering potential new indications. See the \nItem 1. Business\n—\nResearch and Development\n \nsection for our R&D priorities and strategy.\nWe seek to leverage a strong pipeline, organize around expected operational growth drivers and capitalize on trends creating long-term growth opportunities, including:\n•\nan aging global population that is generating increased demand for innovative medicines and vaccines that address patients’ unmet needs; and\n•\nadvances in both biological science and platform technologies that are enhancing the delivery of potential breakthrough new medicines and vaccines.\nOur Business Development Initiatives\n––\nWe are committed to strategically capitalizing on growth opportunities, primarily by advancing our own product pipeline and maximizing the value of our existing products, but also through various business development activities. We view our business development activity as an enabler of our strategies and seek to generate growth by pursuing opportunities and transactions that have the potential to strengthen our business and our capabilities. We assess our business, assets and scientific capabilities/portfolio as part of our regular, ongoing portfolio review process and also continue to consider business development activities that will help advance our business strategy. See \nNote 2\n \nfor significant recent activities.\nOur 2024 Performance\nTotal Revenues\n––Total revenues\n increased $4.1 billion, or 7%, to $63.6 billion in 2024 from $59.6 billion in 2023, reflecting an operational increase of $4.4 billion, or 7%, partially offset by an unfavorable impact of foreign exchange of $349 million, or approximately 1%. The operational increase was primarily driven by Paxlovid, the addition of legacy Seagen revenues in full-year 2024 following the acquisition in December 2023, and growth from the Vyndaqel family and Eliquis, partially offset by declines in Comirnaty. The operational increase for Paxlovid was primarily due to: (i) a non-cash revenue reversal of $3.5 billion recorded in the fourth quarter of 2023 related to the expected return of an estimated 6.5 million treatment courses of EUA labeled U.S. government inventory and (ii) revenue in 2024 of $1.2 billion from two one-time items: a $771 million favorable final adjustment recorded in the first quarter of 2024 to the aforementioned $3.5 billion revenue reversal; and $442 million from the one-time contractual delivery of treatment courses to the U.S. SNS. See \nNote 17C\n. \nExcluding contributions from Comirnaty and Paxlovid, \nTotal revenues\n increased 12% operationally.\nThe following chart outlines the components of the net change in \nTotal revenues\n:\nSee the \nTotal Revenues by Geography\n \nand \nTotal Revenues––Selected Product Discussion\n sections within MD&A for more information, including a discussion of key drivers of our revenue performance. Certain of our vaccines, including Comirnaty, are subject to seasonality of demand, with a greater portion of revenues anticipated in the fall and winter seasons, and Paxlovid revenues trend with infection rates. See also \nThe Global \nPfizer Inc.\n2024 Form 10-K\n29\nEconomic Environment––COVID-19\n section below for information about our COVID-19 products. For information regarding the primary indications or class of certain products, see \nNote 17C\n.\nIncome from Continuing Operations Before Provision/(Benefit) for Taxes on Income\n––\nThe increase in \nIncome from continuing operations before provision/(benefit) for taxes on income\n of $7.0 billion, to $8.0 billion in 2024 from $1.1 billion in 2023, was primarily attributable to (i) a decrease in \nCost of Sales, \n(ii) higher revenues and (iii) a decrease in \nRestructuring charges and certain acquisition-related costs, \npartially offset by (iv) higher net interest expense, (v) net periodic benefit costs associated with pension and other postretirement plans incurred in 2024 versus net periodic benefit credits in 2023, (vi) lower net gains on equity securities and (vii) an increase in \nAmortization of intangible assets.\nSee\n \nthe\n \nAnalysis of the Consolidated Statements of Operations\n section within MD&A and \nNote 4\n. For information on our tax provision and effective tax rate, see the \nProvision/(Benefit) for Taxes on Income\n section within MD&A and \nNote 5\n.\nOur Operating Environment\n––We, like other businesses in our industry, are subject to certain industry-specific challenges. These include, among others, the topics listed below. See also the \nItem 1. Business––Government Regulation and Price Constraints\n and",
    "item1a": "Item 1A. Risk Factors—Global Operations\n \nsection for key currencies in which we operate. Our sensitivity analyses of such risks are discussed below.\nForeign Exchange Risk\n—The fair values of our financial instrument holdings are analyzed at year-end to determine their sensitivity to foreign exchange rate changes. In this analysis, holding all other assumptions constant and assuming that a change in one currency’s rate relative to the U.S. dollar would not have any effect on another currency’s rates relative to the U.S. dollar, if the dollar were to move against all other currencies by 10%, as of December 31, 2024, the expected impact on our net income would not be significant.\nInterest Rate Risk\n—The fair values of our financial instrument holdings are analyzed at year-end to determine their sensitivity to interest rate changes. In this analysis, holding all other assumptions constant and assuming a parallel shift in the interest rate curve for all maturities and for all instruments, if there were a one hundred basis point change in interest rates as of December 31, 2024, the expected impact on our net income would not be significant.\nEquity Price Risk\n––We hold long-term investments in equity securities with readily determinable fair values in life science companies as a result of certain business development transactions. While we are holding such securities, we are subject to equity price risk, and this may increase the volatility of our income in future periods due to changes in the fair value of equity investments. From time to time, we will sell such equity securities based on our business considerations, which may include limiting our price risk. Our equity securities with readily determinable fair values are analyzed at year-end to determine their sensitivity to equity price rate changes. In this sensitivity analysis, the expected impact on our net income would not be significant.\nPfizer Inc.\n2024 Form 10-K\n47\nNEW ACCOUNTING STANDARDS\nRecently Adopted Accounting Standards\nSee \nNote 1B\n.\nRecently Issued Accounting Standards, Not Adopted as of December 31, 2024\nStandard/Description\nEffective Date\nEffect on the Financial Statements\nIn December 2023, the FASB issued final guidance to improve \nincome tax disclosures\n. The final guidance requires enhanced disclosures primarily related to existing rate reconciliation and income taxes paid information.\n2025 for annual reports. Early adoption is permitted.\nThis new guidance will result in increased disclosures in the notes to our financial statements.\nIn November 2024, the FASB issued final guidance which requires \ndisaggregated disclosures of certain categories of expenses that are included in expense line items on the face of the income statement\n. The disclosures are required on an annual and interim basis. The guidance also requires the total amount of selling expenses to be disclosed and, on an annual basis, the definition of selling expenses.\n2027 for annual reports and 2028 for interim reports. Early adoption is permitted.\nThis new guidance will result in increased disclosures in the notes to our financial statements.\nITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe information required by this Item is incorporated by reference to the discussion in the \nAnalysis of Financial Condition, Liquidity, Capital Resources and Market Risk\n \nsection within MD&A.\nPfizer Inc.\n2024 Form 10-K\n48\nITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nPfizer Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Pfizer Inc. and Subsidiary Companies (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control \n- \nIntegrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 27, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of the U.S. Medicare, Medicaid, and performance-based contract rebates accrual\nAs discussed in \nNote 1G\n to the consolidated financial statements, the Company records estimated deductions for Medicare, Medicaid, and performance-based contract rebates (collectively, U.S. rebates) as a reduction to gross product revenues. The accrual for U.S. rebates is recorded in the same period that the corresponding revenues are recognized. The length of time between when a sale is made and when the U.S. rebate is paid by the Company can be as long as one year, which increases the need for significant management judgment and knowledge of market conditions and practices in estimating the accrual. \nWe identified the evaluation of the U.S. rebates accrual as a critical audit matter because the evaluation of the product-specific experience ratio assumption involved especially challenging auditor judgment. The product-specific experience ratio assumption relates to estimating which of the Company’s revenue transactions will ultimately be subject to a related rebate.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s U.S. rebates accrual process related to the development of the product-specific experience ratio assumptions. We estimated the U.S. rebates accrual using internal information and historical data and compared the result to the Company’s estimated U.S. rebates accrual. We evaluated the Company’s ability to accurately estimate the accrual for U.S. rebates by comparing historically recorded accruals to the actual amount that was ultimately paid by the Company.\nEvaluation of gross unrecognized tax benefits\nAs discussed in \nNotes 5D\n and \n1Q\n, the Company’s tax positions are subject to audit by local taxing authorities in each respective tax jurisdiction, and the resolution of such audits may span multiple years. Since tax law is complex and often subject to varied interpretations and judgments, it is uncertain whether some of the Company’s tax positions will be sustained upon audit. As of December 31, 2024, the Company has recorded gross unrecognized tax benefits, excluding associated interest, of $4.5 billion.\nWe identified the evaluation of certain of the Company’s gross unrecognized tax benefits as a critical audit matter because a high degree of audit effort, including specialized skills and knowledge, and complex auditor judgment was required in evaluating the Company’s interpretation of tax law and its estimate of the ultimate resolution of its tax positions.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of an internal control over the Company’s liability for unrecognized tax position process related to (1) interpretation of tax law, (2) evaluation of which of the Company’s tax positions may not be sustained upon audit, and (3) estimation and recording of the gross \nPfizer Inc.\n2024 Form 10-K\n49\nReport of Independent Registered Public Accounting Firm\nunrecognized tax benefits. We involved tax and valuation professionals with specialized skills and knowledge who assisted in evaluating the Company’s interpretation of tax laws, including the assessment of transfer pricing practices in accordance with applicable tax laws and regulations. We inspected settlements with applicable taxing authorities, including assessing the expiration of statutes of limitations. We tested the calculation of the liability for uncertain tax positions, including an evaluation of the Company’s assessment of the technical merits of tax positions and estimates of the amount of tax benefits expected to be sustained.\nEvaluation of product liability and other product-related litigation\nAs discussed in \nNotes 1S\n and \n16\n to the consolidated financial statements, the Company is involved in product liability and other product-related litigation, which can include personal injury, consumer fraud, off-label promotion, securities, antitrust and breach of contract claims, among others. Certain of these pending product and other product-related legal proceedings could result in losses that could be substantial. The accrued liability and/or disclosure for the pending product liability and other product-related legal proceedings requires a complex series of judgments by the Company about future events, which involves a number of uncertainties.\nWe identified the evaluation of product liability and other product-related litigation as a critical audit matter. Challenging auditor judgment was required to evaluate the Company’s judgments about future events and uncertainties.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s product liability and other product-related litigation processes, including controls related to (1) the evaluation of information from external and internal legal counsel, (2) forward-looking expectations, and (3) new legal proceedings, or other legal proceedings not currently reserved or disclosed. We read letters received directly from the Company’s external and internal legal counsel that described the Company’s probable or reasonably possible legal contingency to pending product liability and other product-related legal proceedings. We inspected the Company’s minutes from meetings of the Audit Committee, which included the status of key litigation matters. We evaluated the Company’s ability to estimate its monetary exposure to pending product and other product-related legal proceedings by comparing historically recorded liabilities to actual monetary amounts incurred upon resolution of prior legal matters. We analyzed relevant publicly available information about the Company, its competitors, and the industry.\nEvaluation of the fair value measurement of the developed technology rights and in-process research and development intangible assets acquired in the Seagen business combination\nAs discussed in \nNote 2A\n to the consolidated financial statements, on December 14, 2023, the Company acquired Seagen Inc. and its subsidiaries (Seagen). The total fair value of consideration transferred was $44.2 billion. Of that, the Company recorded $7.5 billion of developed technology rights with an estimated weighted-average life of approximately 18 years and $19.9 billion of in-process research and development (IPR&D). The preliminary estimates of the fair value of intangible assets were finalized during the measurement period in 2024.  As discussed in \nNote 1\nM\n, the Company performs impairment testing for indefinite-lived intangible assets at least annually and for all other long-lived assets whenever impairment indicators are present. When necessary, the Company records impairments of long-lived assets for the amount by which the fair value is less than the carrying value of these assets.\nWe identified the evaluation of the fair value measurement of Seagen acquired developed technology rights and IPR&D as a critical audit matter. A high degree of subjective auditor judgment was required to evaluate certain key assumptions used to estimate the acquisition-date fair value of the acquired developed technology rights and IPR&D, as well as the fair value for impairment testing purposes. Specifically, the key assumptions for certain IPR&D assets, including revenue growth rates, probability of technical and regulatory success (PTRS) rates, and the discount rate, and the key assumptions for certain developed technology rights, including revenue growth rates and the discount rate, represented subjective determinations of future market and economic conditions. Changes to those assumptions could have had a significant effect on the determination of the fair value measurements.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s valuation process, including controls related to the development of the key assumptions for certain IPR&D assets and developed technology rights. We performed sensitivity analyses over the key assumptions for certain IPR&D assets and developed technology rights to assess the impact of changes in those key assumptions on the Company’s determination of the fair value of the IPR&D and developed technology rights, respectively. We evaluated the reasonableness of the Company’s forecasted revenue growth rates by comparing them to historical results, comparable products and peer companies, analyst expectations, industry related third-party data, and the assumptions used in prior periods. Further, we evaluated the PTRS rates for certain IPR&D assets by considering the phase of development of the clinical projects and the Company's history of obtaining regulatory approval and comparing them to PTRS rates derived from analyst reports and other industry related third-party data and the assumptions used in prior periods. We evaluated the data sources used by management in determining the key assumptions for certain IPR&D assets and developed technology rights by comparing to industry standards and evidence obtained in other areas of the audit. In addition, we involved valuation professionals with specialized skills and knowledge, who assisted in:\n(1)  evaluating the discount rates used by the Company for certain IPR&D and developed technology rights by comparing them against discount rate ranges that were independently developed using publicly available market data for comparable entities\n(2) testing the source information underlying the determination of the discount rates.\n \nWe have not been able to determine the specific year that we or our predecessor firms began serving as the Company’s auditor, however, we are aware that we or our predecessor firms have served as the Company’s auditor since at least 1942.\nNew York, New York\nFebruary 27, 2025\nPfizer Inc.\n2024 Form 10-K\n50\nConsolidated Statements of Operations\nPfizer Inc. and Subsidiary Companies\n \nYear Ended December 31, \n(MILLIONS, EXCEPT PER SHARE DATA)\n2024\n2023\n2022\nRevenues:\nProduct revenues\n$\n53,816\n \n$\n50,914\n \n$\n91,793\n \nAlliance revenues\n8,388\n \n7,582\n \n8,537\n \nRoyalty revenues\n(a)\n1,423\n \n1,058\n \n845\n \nTotal revenues\n63,627\n \n59,553\n \n101,175\n \nCosts and expenses:\n \n \nCost of sales\n(b), (c)\n17,851\n \n24,954\n \n34,344\n \nSelling, informational and administrative expenses\n(b)\n14,730\n \n14,771\n \n13,677\n \nResearch and development expenses\n(b)\n10,822\n \n10,679\n \n11,428\n \nAcquired in-process research and development expenses\n108\n \n194\n \n953\n \nAmortization of intangible assets\n5,286\n \n4,733\n \n3,609\n \nRestructuring charges and certain acquisition-related costs\n2,419\n \n2,943\n \n1,375\n \nOther (income)/deductions––net\n4,388\n \n222\n \n1,062\n \nIncome from continuing operations before provision/(benefit) for taxes on income\n8,023\n \n1,058\n \n34,729\n \nProvision/(benefit) for taxes on income\n(\n28\n)\n(\n1,115\n)\n3,328\n \nIncome from continuing operations\n8,051\n \n2,172\n \n31,401\n \nDiscontinued operations––net of tax\n11\n \n(\n15\n)\n6\n \nNet income before allocation to noncontrolling interests\n8,062\n \n2,158\n \n31,407\n \nLess: Net income attributable to noncontrolling interests\n31\n \n39\n \n35\n \nNet income attributable to Pfizer Inc. common shareholders\n$\n8,031\n \n$\n2,119\n \n$\n31,372\n \nEarnings per common share––basic\n:\n \n \n \nIncome from continuing operations attributable to Pfizer Inc. common shareholders\n$\n1.42\n \n$\n0.38\n \n$\n5.59\n \nDiscontinued operations––net of tax\n—\n \n—\n \n—\n \nNet income attributable to Pfizer Inc. common shareholders\n$\n1.42\n \n$\n0.38\n \n$\n5.59\n \nEarnings per common share––diluted\n:\n \n \nIncome from continuing operations attributable to Pfizer Inc. common shareholders\n$\n1.41\n \n$\n0.37\n \n$\n5.47\n \nDiscontinued operations––net of tax\n—\n \n—\n \n—\n \nNet income attributable to Pfizer Inc. common shareholders\n$\n1.41\n \n$\n0.37\n \n$\n5.47\n \nWeighted-average shares––basic\n5,664\n \n5,643\n \n5,608\n \nWeighted-average shares––diluted\n5,700\n \n5,709\n \n5,733\n \n(a)\nSee \nNote 1A\n.\n(b)\nExclusive of amortization of intangible assets.\n(c)\nSee \nNote\n \n17A\n.\nSee Accompanying Notes.\nPfizer Inc.\n2024 Form 10-K\n51\nConsolidated Statements of Comprehensive Income\nPfizer Inc. and Subsidiary Companies\nYear Ended December 31, \n(MILLIONS)\n2024\n2023\n2022\nNet income before allocation to noncontrolling interests\n$\n8,062\n \n$\n2,158\n \n$\n31,407\n \nForeign currency translation adjustments, net\n32\n \n452\n \n(\n2,328\n)\nUnrealized holding gains/(losses) on derivative financial instruments, net\n499\n \n626\n \n1,444\n \nReclassification adjustments for (gains)/losses included in net income\n(a)\n(\n159\n)\n(\n413\n)\n(\n2,062\n)\n \n341\n \n213\n \n(\n618\n)\nUnrealized holding gains/(losses) on available-for-sale securities, net\n(\n152\n)\n(\n121\n)\n(\n1,306\n)\nReclassification adjustments for (gains)/losses included in net income\n(b)\n42\n \n(\n141\n)\n1,809\n \n(\n111\n)\n(\n261\n)\n502\n \nBenefit plans: prior service (costs)/credits and other, net\n193\n \n(\n25\n)\n(\n24\n)\nReclassification adjustments related to amortization of prior service costs and other, net\n(\n109\n)\n(\n117\n)\n(\n129\n)\nReclassification adjustments related to curtailments of prior service costs and other, net\n—\n \n(\n15\n)\n(\n12\n)\n \n84\n \n(\n157\n)\n(\n166\n)\nOther comprehensive income/(loss), before tax\n347\n \n246\n \n(\n2,609\n)\nTax provision/(benefit) on other comprehensive income/(loss)\n231\n \n(\n85\n)\n(\n187\n)\nOther comprehensive income/(loss) before allocation to noncontrolling interests\n$\n116\n \n$\n331\n \n$\n(\n2,422\n)\n \n \n \nComprehensive income/(loss) before allocation to noncontrolling interests\n$\n8,178\n \n$\n2,488\n \n$\n28,985\n \nLess: Comprehensive income/(loss) attributable to noncontrolling interests\n28\n \n26\n \n20\n \nComprehensive income/(loss) attributable to Pfizer Inc.\n$\n8,149\n \n$\n2,462\n \n$\n28,965\n \n(a)\nReclassified into \nOther (income)/deductions—net \nand \nCost of sales\n. See \nNote 7E\n.\n(b)\nReclassified into \nOther (income)/deductions—net\n.\nSee Accompanying Notes.\nPfizer Inc.\n2024 Form 10-K\n52\nConsolidated Balance Sheets\nPfizer Inc. and Subsidiary Companies\nAs of December 31,\n(MILLIONS, EXCEPT PER SHARE DATA)\n2024\n2023\nAssets\nCash and cash equivalents\n$\n1,043\n \n$\n2,853\n \nShort-term investments\n19,434\n \n9,837\n \nTrade accounts receivable, net of allowance for doubtful accounts: 2024—$\n438\n; 2023—$\n470\n11,463\n \n11,566\n \nInventories\n10,851\n \n10,189\n \nCurrent tax assets\n3,314\n \n3,978\n \nOther current assets\n4,253\n \n4,911\n \nTotal current assets\n50,358\n \n43,333\n \nEquity-method investments\n217\n \n11,637\n \nLong-term investments\n2,010\n \n3,731\n \nProperty, plant and equipment, net\n18,393\n \n18,940\n \nIdentifiable intangible assets, net\n55,411\n \n64,900\n \nGoodwill\n68,527\n \n67,783\n \nNoncurrent deferred tax assets and other noncurrent tax assets\n8,662\n \n3,706\n \nOther noncurrent assets\n9,817\n \n12,471\n \nTotal assets\n$\n213,396\n \n$\n226,501\n \nLiabilities and Equity\n \n \nShort-term borrowings, including current portion of long-term debt: 2024—$\n3,747\n; 2023—$\n2,254\n$\n6,946\n \n$\n10,350\n \nTrade accounts payable\n5,633\n \n6,710\n \nDividends payable\n2,437\n \n2,372\n \nIncome taxes payable\n2,910\n \n2,349\n \nAccrued compensation and related items\n3,838\n \n2,776\n \nDeferred revenues\n1,511\n \n2,700\n \nOther current liabilities\n19,720\n \n20,537\n \nTotal current liabilities\n42,995\n \n47,794\n \nLong-term debt\n57,405\n \n61,538\n \nPension and postretirement benefit obligations\n2,115\n \n2,167\n \nNoncurrent deferred tax liabilities\n2,122\n \n640\n \nOther taxes payable\n6,112\n \n8,534\n \nOther noncurrent liabilities\n14,150\n \n16,539\n \nTotal liabilities\n124,899\n \n137,213\n \nCommitments and Contingencies\nCommon stock, $\n0.05\n par value; \n12,000\n shares authorized; issued: 2024—\n9,593\n; 2023—\n9,562\n480\n \n478\n \nAdditional paid-in capital\n93,603\n \n92,631\n \nTreasury stock, shares at cost: 2024—\n3,926\n; 2023—\n3,916\n(\n114,763\n)\n(\n114,487\n)\nRetained earnings\n116,725\n \n118,353\n \nAccumulated other comprehensive loss\n(\n7,842\n)\n(\n7,961\n)\nTotal Pfizer Inc. shareholders’ equity\n88,203\n \n89,014\n \nEquity attributable to noncontrolling interests\n294\n \n274\n \nTotal equity\n88,497\n \n89,288\n \nTotal liabilities and equity\n$\n213,396\n \n$\n226,501\n \nSee Accompanying Notes.\nPfizer Inc.\n2024 Form 10-K\n53\nConsolidated Statements of Equity\nPfizer Inc. and Subsidiary Companies\n \nPFIZER INC. SHAREHOLDERS\n \nCommon Stock\n \nTreasury Stock\n \n \n \n(MILLIONS, EXCEPT PER SHARE DATA)\nShares\nPar Value\nAdd’l\nPaid-In\nCapital\nShares\nCost\nRetained Earnings\nAccum.\nOther\nComp. Loss\nShare -\nholders’\nEquity\nNon-controlling Interests\nTotal\nEquity\nBalance, January 1, 2022\n9,471\n \n$\n473\n \n$\n90,591\n \n(\n3,851\n)\n$\n(\n111,361\n)\n$\n103,394\n \n$\n(\n5,897\n)\n$\n77,201\n \n$\n262\n \n$\n77,462\n \nNet income\n31,372\n \n31,372\n \n35\n \n31,407\n \nOther comprehensive income/(loss), net of tax\n(\n2,407\n)\n(\n2,407\n)\n(\n15\n)\n(\n2,422\n)\nCash dividends declared, per share: $\n1.61\nCommon stock \n(\n9,037\n)\n(\n9,037\n)\n(\n9,037\n)\nNoncontrolling interests\n— \n(\n13\n)\n(\n13\n)\nShare-based payment transactions\n48\n \n2\n \n1,192\n \n(\n13\n)\n(\n608\n)\n(\n73\n)\n513\n \n513\n \nPurchases of common stock\n(\n39\n)\n(\n2,000\n)\n(\n2,000\n)\n(\n2,000\n)\nOther\n— \n— \n19\n \n— \n—\n \n—\n \n19\n \n(\n13\n)\n6\n \nBalance, December 31, 2022\n9,519\n \n476\n \n91,802\n \n(\n3,903\n)\n(\n113,969\n)\n125,656\n \n(\n8,304\n)\n95,661\n \n256\n \n95,916\n \nNet income\n2,119\n \n2,119\n \n39\n \n2,158\n \nOther comprehensive income/(loss), net of tax\n343\n \n343\n \n(\n12\n)\n331\n \nCash dividends declared, per share: $\n1.65\nCommon stock \n(\n9,316\n)\n(\n9,316\n)\n(\n9,316\n)\nNoncontrolling interests\n— \n(\n8\n)\n(\n8\n)\nShare-based payment transactions\n43\n \n2\n \n829\n \n(\n12\n)\n(\n518\n)\n(\n106\n)\n208\n \n208\n \nOther\n— \n— \n—\n \n— \n— \n—\n \n—\n \n—\n \n—\n \nBalance, December 31, 2023\n9,562\n \n478\n \n92,631\n \n(\n3,916\n)\n(\n114,487\n)\n118,353\n \n(\n7,961\n)\n89,014\n \n274\n \n89,288\n \nNet income\n8,031\n \n8,031\n \n31\n \n8,062\n \nOther comprehensive income/(loss), net of tax\n118\n \n118\n \n(\n3\n)\n116\n \nCash dividends declared, per share: $\n1.69\nCommon stock \n(\n9,577\n)\n(\n9,577\n)\n(\n9,577\n)\nNoncontrolling interests\n—\n \n(\n7\n)\n(\n7\n)\nShare-based payment transactions\n31\n \n2\n \n972\n \n(\n10\n)\n(\n276\n)\n(\n107\n)\n591\n \n591\n \nOther\n—\n \n—\n \n—\n \n25\n \n25\n \n(\n1\n)\n23\n \nBalance, December 31, 2024\n9,593\n \n$\n480\n \n$\n93,603\n \n(\n3,926\n)\n$\n(\n114,763\n)\n$\n116,725\n \n$\n(\n7,842\n)\n$\n88,203\n \n$\n294\n \n$\n88,497\n \nSee Accompanying Notes.\nPfizer Inc.\n2024 Form 10-K\n54\nConsolidated Statements of Cash Flows\nPfizer Inc. and Subsidiary Companies\n \nYear Ended December 31, \n(MILLIONS)\n2024\n2023\n2022\nOperating Activities\n \n \nNet income before allocation to noncontrolling interests\n$\n8,062\n \n$\n2,158\n \n$\n31,407\n \nDiscontinued operations—net of tax\n11\n \n(\n15\n)\n6\n \nNet income from continuing operations before allocation to noncontrolling interests\n8,051\n \n2,172\n \n31,401\n \nAdjustments to reconcile net income from continuing operations before allocation to noncontrolling interests to net cash provided by/(used in) operating activities:\n \n \nDepreciation and amortization\n7,013\n \n6,290\n \n5,064\n \nAsset write-offs and impairments\n4,242\n \n3,408\n \n550\n \nDeferred taxes\n(\n2,102\n)\n(\n3,442\n)\n(\n3,764\n)\nShare-based compensation expense\n877\n \n525\n \n872\n \nBenefit plan contributions in excess of expense/income\n(\n12\n)\n(\n787\n)\n(\n1,158\n)\nInventory write-offs and related charges associated with COVID-19 products\n(a)\n—\n \n6,199\n \n1,183\n \nOther adjustments, net\n(\n2,260\n)\n(\n3,492\n)\n758\n \nOther changes in assets and liabilities, net of acquisitions and divestitures:\nTrade accounts receivable\n(\n109\n)\n347\n \n261\n \nInventories\n(a)\n(\n854\n)\n(\n1,169\n)\n(\n591\n)\nOther assets\n3,380\n \n(\n663\n)\n(\n4,506\n)\nTrade accounts payable\n(\n1,023\n)\n(\n300\n)\n1,191\n \nOther liabilities\n(b)\n(\n3,115\n)\n595\n \n(\n1,449\n)\nOther tax accounts, net\n(\n1,345\n)\n(\n982\n)\n(\n545\n)\nNet cash provided by/(used in) operating activities\n12,744\n \n8,700\n \n29,267\n \nInvesting Activities\n \n \nPurchases of property, plant and equipment\n(\n2,909\n)\n(\n3,907\n)\n(\n3,236\n)\nPurchases of short-term investments\n(\n10,133\n)\n(\n30,974\n)\n(\n36,384\n)\nProceeds from redemptions/sales of short-term investments\n4,128\n \n39,264\n \n44,821\n \nNet (purchases of)/proceeds from redemptions/sales of short-term investments with original maturities of three months or less\n3,136\n \n5,174\n \n(\n483\n)\nPurchases of long-term investments\n(\n180\n)\n(\n204\n)\n(\n1,913\n)\nProceeds from redemptions/sales of long-term investments\n1,570\n \n1,979\n \n641\n \nProceeds from partial sales of investment in Haleon\n(c)\n7,040\n \n—\n \n—\n \nAcquisitions of businesses, net of cash acquired\n—\n \n(\n43,430\n)\n(\n22,997\n)\nDividend received from the Consumer Healthcare JV\n(c)\n—\n \n—\n \n3,960\n \nOther investing activities, net\n2\n \n(\n179\n)\n(\n192\n)\nNet cash provided by/(used in) investing activities\n2,652\n \n(\n32,278\n)\n(\n15,783\n)\nFinancing Activities\n \n \nProceeds from short-term borrowings\n8,907\n \n4,525\n \n3,891\n \nPayments on short-term borrowings\n(\n11,226\n)\n(\n3\n)\n(\n3,887\n)\nNet (payments on)/proceeds from short-term borrowings with original maturities of three months or less\n(\n2,590\n)\n3,161\n \n(\n222\n)\nProceeds from issuance of long-term debt\n—\n \n30,831\n \n—\n \nPayments on long-term debt\n(\n2,250\n)\n(\n2,569\n)\n(\n3,298\n)\nPurchases of common stock\n—\n \n—\n \n(\n2,000\n)\nCash dividends paid\n(\n9,512\n)\n(\n9,247\n)\n(\n8,983\n)\nOther financing activities, net\n(\n469\n)\n(\n631\n)\n(\n335\n)\nNet cash provided by/(used in) financing activities\n(\n17,140\n)\n26,066\n \n(\n14,834\n)\nEffect of exchange-rate changes on cash and cash equivalents and restricted cash and cash equivalents\n(\n66\n)\n(\n40\n)\n(\n165\n)\nNet increase/(decrease) in cash and cash equivalents and restricted cash and cash equivalents\n(\n1,810\n)\n2,448\n \n(\n1,515\n)\nCash and cash equivalents and restricted cash and cash equivalents, at beginning of period\n2,917\n \n468\n \n1,983\n \nCash and cash equivalents and restricted cash and cash equivalents, at end of period\n$\n1,107\n \n$\n2,917\n \n$\n468\n \n- Continued -\nPfizer Inc.\n2024 Form 10-K\n55\nConsolidated Statements of Cash Flows\nPfizer Inc. and Subsidiary Companies\nYear Ended December 31, \n2024\n2023\n2022\nSupplemental Cash Flow Information\n \n \nCash paid/(received) during the period for:\nIncome taxes\n$\n3,605\n \n$\n3,147\n \n$\n7,867\n \nInterest paid\n3,227\n \n2,215\n \n1,442\n \nInterest rate hedges\n178\n \n134\n \n54\n \nNon-cash transaction:\nRight-of-use assets obtained in exchange for lease liabilities\n$\n283\n \n$\n614\n \n$\n752\n \n(a)\nSee \nNote\n \n17A\n.\n(b)\nSee \nNote 17C\n.\n(c)\nSee \nNote 2C\n.\nSee Accompanying Notes.\nPfizer Inc.\n2024 Form 10-K\n56\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nNote 1. \nBasis of Presentation and Significant Accounting Policies\nA. Basis of Presentation\nThe consolidated financial statements include the accounts of our parent company and all subsidiaries and are prepared in accordance with U.S. GAAP.\n \nThe decision of whether or not to consolidate an entity for financial reporting purposes requires consideration of majority voting interests, as well as effective economic or other control over the entity. Typically, we do not seek control by means other than voting interests. For subsidiaries operating outside the U.S., the financial information is included as of and for the year ended November 30 for each year presented. Pfizer's fiscal year-end for U.S. subsidiaries is as of and for the year ended December 31 for each year presented. All significant transactions among our subsidiaries have been eliminated.\nWe manage our commercial operations through \nthree\n operating segments, each led by a single manager: Biopharma, PC1 and Pfizer Ignite. Biopharma is the only reportable segment.\n See \nNote 17A\n.\nOn December 14, 2023, we completed the acquisition of Seagen. In addition, other acquisitions and business development activities completed in 2024, 2023 and 2022 impacted financial results in the periods presented. See \nNote 2\n.\nWe have made certain reclassification adjustments to conform prior-period amounts to the current presentation for:\n•\nin the first quarter of 2024, we reclassified royalty income (substantially all of which is related to Biopharma) from \nOther (income)/deductions––net\n and began presenting \nRoyalty revenues\n as a separate line item within \nTotal revenues\n in our consolidated statements of operations, and reclassified the associated royalty receivables from \nOther current assets\n to \nTrade accounts receivable, less allowance for doubtful accounts\n in our consolidated balance sheet; and\n•\nsegment reporting and geographic information in connection with the commercial reorganization that went into effect on January 1, 2024 (see \nNotes \n9\n and \n1\n7\n).\nCertain amounts in the consolidated financial statements and associated notes may not add due to rounding. All percentages have been calculated using unrounded amounts.\nB\n. \nNew Accounting Standards Adopted in 2024\nOn January 1, 2024, we adopted a new accounting standard which clarifies that contractual sale restrictions are not considered in measuring equity securities at fair value. The new guidance is consistent with our existing policy; therefore, it had no impact on our consolidated financial statements.\nIn the fourth quarter of 2024, we adopted a new accounting standard which requires the disclosure of significant segment expenses that are regularly provided to the CODM and included within each reported measure of segment profit or loss, other segment items by reportable segment and a description of its composition. See \nNote 17A\n.\nC. \nEstimates and Assumptions\nIn preparing these financial statements, we use certain estimates and assumptions that affect reported amounts and disclosures. These estimates and assumptions can impact all elements of our financial statements. For example, in the consolidated statements of operations, estimates are used when accounting for deductions from revenues, determining the cost of inventory that is sold, allocating cost in the form of depreciation and amortization, and estimating restructuring charges and the impact of contingencies, as well as determining provisions for taxes on income. On the consolidated balance sheets, estimates are used in determining the valuation and recoverability of assets, and in determining the reported amounts of liabilities, all of which also impact the consolidated statements of operations. Certain estimates of fair value and amounts recorded in connection with acquisitions, revenue deductions, impairment reviews, restructuring-associated charges, investments and financial instruments, valuation allowances, pension and postretirement benefit plans, contingencies, share-based compensation, and other calculations can result from a complex series of judgments about future events and uncertainties and can rely heavily on estimates and assumptions.\nOur estimates are often based on complex judgments and assumptions that we believe to be reasonable, but that can be inherently uncertain and unpredictable. If our estimates and assumptions are not representative of actual outcomes, our results could be materially impacted. As future events and their effects cannot be determined with precision, our estimates and assumptions may prove to be incomplete or inaccurate, or unanticipated events and circumstances may occur that might cause us to change those estimates and assumptions. We are subject to risks and uncertainties that may cause actual results to differ from estimated amounts, such as changes in the healthcare environment, competition, litigation, legislation, development of competing assets by us or others, regulatory actions, or product recalls or withdrawals. We regularly evaluate our estimates and assumptions using historical experience and expectations about the future. We adjust our estimates and assumptions when facts and circumstances indicate the need for change.\nD. \nAcquisitions\nOur consolidated financial statements include the operations of acquired businesses after the completion of the acquisitions. We account for acquired businesses using the acquisition method of accounting, which requires, among other things, that most assets acquired and liabilities assumed be recognized at their estimated fair values as of the acquisition date and that the fair value of acquired IPR&D be recorded on the balance sheet. Transaction costs are expensed as incurred. Any excess of the consideration transferred over the assigned values of the net assets acquired is recorded as goodwill. When we acquire net assets that do not constitute a business, as defined in U.S. GAAP, no goodwill is recognized and acquired IPR&D is expensed in \nAcquired in-process research and development expenses\n.\nContingent consideration in a business combination is included as part of the acquisition cost and is recognized at fair value as of the acquisition date. Fair value is generally estimated by using a probability-weighted discounted cash flow approach. See \nNote 16D\n. Any liability \nPfizer Inc.\n2024 Form 10-K\n57\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nresulting from contingent consideration is remeasured to fair value at each reporting date until the contingency is resolved. These changes in fair value are recognized in earnings in \nOther (income)/deductions––net\n.\nE. \nFair Value\nWe measure certain assets and liabilities at fair value, either upon initial recognition or for subsequent accounting or reporting. We estimate fair value using an exit price approach, which requires, among other things, that we determine the price that would be received to sell an asset or paid to transfer a liability in an orderly market. The determination of an exit price is considered from the perspective of market participants, considering the highest and best use of non-financial assets and, for liabilities, assuming that the risk of non-performance will be the same before and after the transfer. \nWhen estimating fair value, depending on the nature and complexity of the asset or liability, we may use one or all of the following techniques:\n•\nIncome approach, which is based on the present value of a future stream of net cash flows. \n•\nMarket approach, which is based on market prices and other information from market transactions involving identical or comparable assets or liabilities.\n•\nCost approach, which is based on the cost to acquire or construct comparable assets, less an allowance for functional and/or economic obsolescence.\nOur fair value methodologies depend on the following types of inputs:\n•\nQuoted prices for identical assets or liabilities in active markets (Level 1 inputs).\n•\nQuoted prices for similar assets or liabilities in active markets, or quoted prices for identical or similar assets or liabilities in markets that are not active, or inputs other than quoted prices that are directly or indirectly observable, or inputs that are derived principally from, or corroborated by, observable market data by correlation or other means (Level 2 inputs).\n•\nUnobservable inputs that reflect estimates and assumptions (Level 3 inputs).\nThe following inputs and valuation techniques are used to estimate the fair value of our financial assets and liabilities:\n•\nAvailable-for-sale debt securities—third-party matrix-pricing model that uses significant inputs derived from or corroborated by observable market data and credit-adjusted yield curves. \n•\nEquity securities with readily determinable fair values—quoted market prices and observable NAV prices.\n•\nDerivative assets and liabilities—third-party matrix-pricing model that uses inputs derived from or corroborated by observable market data. Where applicable, these models use market-based observable inputs, including interest rate yield curves to discount future cash flow amounts, and forward and spot prices for currencies. The credit risk impact to our derivative financial instruments was not significant.\n•\nMoney market funds—observable NAV prices.\nWe periodically review the methodologies, inputs and outputs of third-party pricing services for reasonableness. Our procedures can include, for example, referencing other third-party pricing models, monitoring key observable inputs (like benchmark interest rates) and selectively performing test-comparisons of values with actual sales of financial instruments.\nF. \nForeign Currency Translation\nFor most of our international operations, local currencies have been determined to be the functional currencies. We translate functional currency assets and liabilities to their U.S. dollar equivalents at exchange rates in effect as of the balance sheet date and income and expense amounts at average exchange rates for the period. The U.S. dollar effects that arise from changing translation rates are recorded in \nOther comprehensive income/(loss)\n. The effects of converting non-functional currency monetary assets and liabilities into the functional currency are recorded in \nOther (income)/deductions––net\n. For operations in highly inflationary economies, we translate monetary items at rates in effect as of the balance sheet date, with translation adjustments recorded in \nOther (income)/deductions––net\n, and we translate non-monetary items at historical rates.\nG. Revenues and Trade Accounts Receivable\nRevenue Recognition\n––We record revenues from product sales when there is a transfer of control of the product from us to the customer. We typically determine transfer of control based on when the product is shipped or delivered and title passes to the customer. For certain contracts, the finished product may temporarily be stored at our or our third-party subcontractors’ locations under a bill-and-hold arrangement. Revenue is recognized on bill-and-hold arrangements at the point in time when the customer obtains control of the product and all of the following criteria have been met: the arrangement is substantive; the product is identified separately as belonging to the customer; the product is ready for physical transfer to the customer; and we do not have the ability to use the product or direct it to another customer. In bill-and-hold arrangements which are part of the U.S. SNS, we recognize revenue for the product sale when the product is initially placed into the U.S. SNS and we provide a rotation service to maintain an agreed upon level of shelf life for product in the stockpile. In determining when the customer obtains control of the product, we consider certain indicators, including whether we have a present right to payment from the customer, whether title and/or significant risks and rewards of ownership have transferred to the customer and whether customer acceptance has been received.\nOur Sales Contracts\n––Sales on credit are typically under short-term contracts. Collections are based on market payment cycles common in various markets, with shorter cycles in the U.S. Sales\n \nare adjusted for sales allowances, chargebacks, rebates and sales returns and cash discounts. Sales returns may occur due to patent-based expirations or loss of regulatory exclusivity, product recalls or a changing competitive environment.\nDeductions from Revenues\n––Our gross product revenues are subject to a variety of deductions, which generally are estimated and recorded in the same period that the revenues are recognized. Such variable consideration represents chargebacks, rebates, sales allowances and \nPfizer Inc.\n2024 Form 10-K\n58\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nsales returns. These deductions represent estimates of the related obligations and, as such, knowledge and judgment is required when estimating the impact of these product revenue deductions on gross sales for a reporting period. \nProvisions for pharmaceutical sales returns––\nProvisions are based on a calculation for each market that incorporates the following, as appropriate: local returns policies and practices; historical returns as a percentage of sales; an understanding of the reasons for past returns; estimated shelf life by product; an estimate of the amount of time between shipment and return or lag time; and any other factors that could impact the estimate of future returns, such as patent-based expirations or loss of regulatory exclusivity, product recalls or a changing competitive environment. Generally, returned products are destroyed, and customers are refunded the sales price in the form of a credit.\nWe record sales incentives as a reduction of revenues at the time the related revenues are recorded or when the incentive is offered, whichever is later. We estimate the cost of our sales incentives based on our historical experience with similar incentives programs to predict customer behavior.\nThe following outlines our common sales arrangements:\n•\nCustomers\n––Our prescription biopharmaceutical products, with the exception of Paxlovid in 2022 and 2023, are sold principally to wholesalers, but we also sell directly to retailers, hospitals, clinics, government agencies and pharmacies. In 2022 and 2023, we principally sold Paxlovid globally to government agencies. Our vaccines in the U.S. are primarily sold directly to the federal government (including the CDC), wholesalers, individual provider offices, retail pharmacies and integrated delivery systems. Our vaccines outside the U.S. are primarily sold to government and non-government institutions. Certain products in our portfolio are subject to seasonality of demand and Paxlovid revenues trend with infection rates. Prescription pharmaceutical products that ultimately are used by patients are generally covered under governmental programs, managed care programs and insurance programs, including those managed through PBMs in the U.S; and are subject to sales allowances and/or rebates payable directly to those programs. Those sales allowances and rebates are generally negotiated, but government programs may have legislated amounts by type of product (e.g., patented or unpatented).\nSpecifically:\n•\nIn the U.S., we sell our products principally to distributors and hospitals. We also have contracts with managed care programs or PBMs and legislatively mandated contracts with the federal and state governments under which we provide rebates based on medicines utilized by the lives they cover. We record provisions for Medicare, Medicaid, and performance-based contract pharmaceutical rebates based upon our experience ratio of rebates paid and actual prescriptions written during prior periods. We apply the experience ratio to the respective period’s sales to determine the rebate accrual and related expense. This experience ratio is evaluated regularly to ensure that the historical trends are as current as practicable. We estimate discounts on branded prescription drug sales in prior periods to Medicare Part D participants in the Medicare “coverage gap,” also known as the “doughnut hole,” and as of December 31, 2024 in the initial coverage and catastrophic phases under the Manufacturer Discount Program based on the historical experience of beneficiary prescriptions and consideration of the utilization that is expected to result from the discount in the coverage gap or from the manufacturer’s discount, respectively. We evaluate this estimate regularly to ensure that the historical trends and future expectations are as current as practicable. For performance-based contract rebates, we also consider current contract terms, such as changes in formulary status and rebate rates.\n•\nOutside the U.S., the majority of our pharmaceutical sales allowances are contractual or legislatively mandated and our estimates are based on actual invoiced sales within each period, which reduces the risk of variations in the estimation process. In certain European countries, rebates are calculated on the government’s total unbudgeted pharmaceutical spending or on specific product sales thresholds and we apply an estimated allocation factor against our actual invoiced sales to project the expected level of reimbursement. We obtain third-party information that helps us to monitor the adequacy of these accruals.\n•\nProvisions for pharmaceutical chargebacks (primarily reimbursements to U.S. wholesalers for honoring contracted prices and legislated discounts to third parties) closely approximate actual amounts incurred, as we settle these deductions generally within two to five weeks of incurring the liability.\nWe recorded revenues of more than $\n1\n billion for each of 11 products in 2024, for each of nine products in 2023 and for each of ten products in 2022, and these revenues represented \n66\n%, \n64\n% and \n82\n% of our \nTotal revenues\n in 2024, 2023 and 2022, respectively. See \nNote 17C\n. The loss or expiration of intellectual property rights can have a significant adverse effect on our revenues as our contracts with customers will generally be at lower selling prices and lower volumes due to added generic competition. We generally provide for higher sales returns during the period in which individual markets begin to near the loss or expiration of intellectual property rights.\nOur accruals for Medicare, Medicaid and related state program and performance-based contract rebates, chargebacks, sales allowances and sales returns and cash discounts are as follows:\n  \nAs of December 31,\n(MILLIONS)\n2024\n2023\nReserve against \nTrade accounts receivable, less allowance for doubtful accounts\n$\n1,627\n \n$\n1,770\n \nOther current liabilities\n:\nAccrued rebates\n7,195\n \n5,546\n \nOther accruals\n972\n \n902\n \nOther noncurrent liabilities\n1,029\n \n796\n \nTotal accrued rebates and other sales-related accruals\n$\n10,822\n \n$\n9,014\n \nTaxes collected from customers relating to product sales and remitted to governmental authorities are excluded from \nProduct revenues\n.\nTrade Accounts Receivable\n—Trade accounts receivable are stated at their net realizable value. The allowance for credit losses reflects our best estimate of expected credit losses of the receivables portfolio determined on the basis of historical experience, current information, and forecasts of future economic conditions. In developing the estimate for expected credit losses, trade accounts receivables are segmented into pools of assets depending on market (U.S. versus international), delinquency status, and customer type (high risk versus low risk and government versus non-government), and fixed reserve percentages are established for each pool of trade accounts receivables.\nPfizer Inc.\n2024 Form 10-K\n59\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nIn determining the reserve percentages for each pool of trade accounts receivables, we considered our historical experience with certain customers and customer types, regulatory and legal environments, country and political risk, and other relevant current and future forecasted macroeconomic factors. These credit risk indicators are monitored on a quarterly basis to determine whether there have been any changes in the economic environment that would indicate the established reserve percentages should be adjusted, and are considered on a regional basis to reflect more geographic-specific metrics. Additionally, write-offs and recoveries of customer receivables are tracked against collections on a quarterly basis to determine whether the reserve percentages remain appropriate. When management becomes aware of certain customer-specific factors that impact credit risk, specific allowances for these known troubled accounts are recorded. Trade accounts receivable are written off after all reasonable means to collect the full amount (including litigation, where appropriate) have been exhausted.\nDuring 2024 and 2023, additions to the allowance for credit losses, write-offs and recoveries of customer receivables were not material to our consolidated financial statements.\nH. \nCollaborative Arrangements\nPayments to and from our collaboration partners are presented in our consolidated statements of operations based on the nature of the arrangement (including its contractual terms), the nature of the payments and applicable accounting guidance. Under co-commercialization agreements, we record the amounts received for our share of gross profits from our collaboration partners as \nAlliance revenues,\n when our collaboration partners are the principal in the transaction and we receive a share of their net sales or profits. \nAlliance revenues\n are recorded as we perform co-promotion activities for the collaboration and the collaboration partners sell the products to their customers. The related expenses for selling and marketing these products including reimbursements to or from our collaboration partners for these costs are included in \nSelling, informational and administrative expenses.\n In collaborative arrangements where we manufacture a product for our collaboration partners, we record revenues when we transfer control of the product to our collaboration partners. In collaboration arrangements where we are the principal in the transaction, we record amounts paid to collaboration partners for their share of net sales or profits earned, and all royalty payments to collaboration partners as \nCost of sales\n. Royalty payments received from collaboration partners are included in \nRoyalty revenues.\nReimbursements to or from our collaboration partners for development costs are typically recorded in \nResearch and development expenses\n. Upfront payments and pre-approval milestone payments due from us to our collaboration partners in development stage collaborations are recorded as \nAcquired\n \nin-process\n r\nesearch and development expenses\n. Milestone payments due from us to our collaboration partners after regulatory approval has been attained for a medicine are recorded in \nIdentifiable intangible assets\n—developed technology rights. Upfront and pre-approval milestone payments earned from our collaboration partners by us are recognized in \nOther (income)/deductions—net \nover the development period for the products, when our performance obligations include providing R&D services to our collaboration partners. Upfront, pre-approval and post-approval milestone payments earned by us may be recognized in \nOther (income)/deductions—net\n immediately when earned or over other periods depending upon the nature of our performance obligations in the applicable collaboration. Where the milestone event is regulatory approval for a medicine, we generally recognize milestone payments due to us in the transaction price when regulatory approval in the applicable jurisdiction has been attained. We may recognize milestone payments due to us in the transaction price earlier than the milestone event in certain circumstances when recognition of the income would not be probable of a significant reversal.\nI. \nCost of Sales and Inventories\nInventories are recorded at the lower of cost or net realizable value. The cost of finished goods, work in process and raw materials is determined using average actual cost. We regularly review our inventories for impairment and reserves are established when necessary. Inventories that are not expected to be sold within 12 months are classified as \nOther noncurrent assets\n. See \nNote 8A\n.\nJ. \nSelling, Informational and Administrative Expenses\nSelling, informational and administrative costs are expensed as incurred. Among other things, these expenses include the internal and external costs of marketing, advertising, shipping and handling, digital and legal defense.\n Advertising expenses totaled approximately $\n3.3\n billion in 2024, $\n3.7\n billion in 2023 and $\n2.8\n billion in 2022. Production costs are expensed as incurred and the costs of TV, radio, and other electronic media and publications are expensed when the related advertising occurs.\nK. \nResearch and Development Expenses\nR&D costs are expensed as incurred. These expenses include the costs of our proprietary R&D efforts, as well as R&D activities performed in connection with certain licensing arrangements.\nL. \nAcquired In-Process Research and Development Expenses\nBefore a compound receives regulatory approval, we record upfront and milestone payments we make to third parties under licensing and collaboration arrangements as expense. Upfront payments are recorded when incurred, and milestone payments are recorded when the specific milestone has been achieved. Once a compound receives regulatory approval, we record any milestone payments in \nIdentifiable intangible assets, less accumulated amortization\n and, unless the asset is determined to have an indefinite life, we typically amortize the payments on a straight-line basis over the remaining agreement term or the expected product life cycle, whichever is shorter. \nAcquired in-process research and development expenses\n includes costs incurred in connection with (a) all upfront and milestone payments on collaboration and in-license agreements, including premiums on equity securities and (b) asset acquisitions of acquired IPR&D.\nM. Long-Lived Assets\nLong-lived assets include:\n•\nProperty, plant and equipment, net\n—These assets are recorded at cost, including any significant improvements after purchase, less accumulated depreciation. Property, plant and equipment assets, other than land and construction in progress, are depreciated on a \nPfizer Inc.\n2024 Form 10-K\n60\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nstraight-line basis over the estimated useful life of the individual assets. Depreciation begins when the asset is ready for its intended use. For tax purposes, accelerated depreciation methods are used as allowed by tax laws.\n•\nIdentifiable intangible assets, net\n—These assets are recorded at fair value at acquisition. Intangible assets with finite lives\n \nare amortized on a straight-line basis over their estimated useful lives. Intangible assets with indefinite lives are not amortized until a useful life can be determined.\n•\nGoodwill\n—Goodwill represents the excess of the consideration transferred for an acquired business over the assigned values of its net assets. Goodwill is not amortized.\nAmortization of finite-lived acquired intangible assets is included in \nAmortization of intangible assets.\nWe review our long-lived assets for impairment indicators throughout the year. We perform impairment testing for indefinite-lived intangible assets and goodwill at least annually and for all other long-lived assets whenever impairment indicators are present. When necessary, we record impairments of long-lived assets for the amount by which the fair value is less than the carrying value of these assets.\nSpecifically:\n•\nFor finite-lived intangible assets, such as developed technology rights, and for other long-lived assets, such as property, plant and equipment, whenever impairment indicators are present, we calculate the undiscounted value of the projected cash flows for the asset, or asset group, and compare this estimated amount to the carrying amount. If the carrying amount is greater, we record an impairment loss for the excess of book value over fair value. In addition, we reevaluate the remaining useful lives of the assets and modify them, as appropriate.\n•\nFor indefinite-lived intangible assets, such as brands and IPR&D assets, when necessary, we determine the fair value of the asset and record an impairment loss, if any, for the excess of book value over fair value. In addition, in all cases of an impairment review other than for IPR&D assets, we re-evaluate whether continuing to characterize the asset as indefinite-lived is appropriate.\n•\nFor goodwill, when necessary, we determine the fair value of each reporting unit and record an impairment loss, if any, for the excess of the book value of the reporting unit over the implied fair value.\nN. \nRestructuring Charges and Other Costs Associated with Acquisitions and Cost-Reduction/Productivity Initiatives\nWe incur restructuring charges in connection with acquisitions when we implement plans to restructure and integrate the acquired operations or in connection with our cost-reduction and productivity initiatives.\n•\nIn connection with acquisition activity, we typically incur costs associated with executing the transactions, integrating the acquired operations (which may include expenditures for consulting and the integration of systems and processes), and restructuring the combined company (which may include charges related to employees, assets and activities that will not continue in the combined company); and\n•\nIn connection with our cost-reduction/productivity initiatives, we typically incur costs and charges for site closings and other facility rationalization actions, workforce reductions and the expansion of shared services, including the development of global systems.\nIncluded in \nRestructuring charges and certain acquisition-related costs\n are all restructuring charges, as well as certain other costs associated with acquiring and integrating an acquired company. If the restructuring action results in a change in the estimated useful life of an asset, that incremental impact is classified in \nCost of sales, Selling, informational and administrative expenses\n and/or \nResearch and development expenses\n, as appropriate. Employee termination costs are generally recorded when the actions are probable and estimable and include accrued severance benefits, pension and postretirement benefits, many of which may be paid out during periods after termination.\n \nTransaction costs, such as banking, legal, accounting and other similar costs incurred in connection with a business acquisition are expensed as incurred\n.\nOur business may be impacted by these actions, including sales and marketing, manufacturing and R&D, as well as our corporate enabling functions.\nO. Cash Equivalents and Statement of Cash Flows\nCash equivalents include items almost as liquid as cash, such as certificates of deposit and time deposits with maturity periods of three months or less when purchased. If items meeting this definition are part of a larger investment pool, we classify them as \nShort-term investments\n.\nCash flows for financial instruments designated as fair value or cash flow hedges may be included in operating, investing or financing activities, depending on the classification of the items being hedged. Cash flows for financial instruments designated as net investment hedges are classified according to the nature of the hedging instrument. Cash flows for financial instruments that do not qualify for hedge accounting treatment are classified according to their purpose and accounting nature.\nP. \nInvestments and Derivative Financial Instruments\nThe classification of an investment depends on the nature of the investment, our intent and ability to hold the investment, and the degree to which we may exercise influence. Our investments are primarily comprised of the following:\n•\nPublic equity securities with readily determinable fair values, which are carried at fair value, with changes in fair value reported in \nOther (income)/deductions—net.\n•\nAvailable-for-sale debt securities, which are carried at fair value, with changes in fair value reported in \nOther comprehensive income/(loss) \nuntil realized.\n•\nHeld-to-maturity debt securities, which are carried at amortized cost.\n•\nPrivate equity securities without readily determinable fair values and where we have no significant influence are measured at cost minus any impairment and plus or minus adjustments resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer.\nPfizer Inc.\n2024 Form 10-K\n61\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\n•\nFor equity investments in common stock or in-substance common stock where we have significant influence over the financial and operating policies of the investee, we use the equity-method of accounting. Under the equity-method, we record our share of the investee’s income and expenses in \nOther (income)/deductions—net\n. The excess of the cost of the investment over our share of the underlying equity in the net assets of the investee as of the acquisition date is allocated to the identifiable assets and liabilities of the investee, with any remaining excess amount allocated to goodwill. Such investments are initially recorded at cost, which is the fair value of consideration paid and typically does not include contingent consideration.\nRealized gains or losses on sales of investments are determined by using the specific identification cost method.\nWe regularly evaluate all of our financial assets for impairment. For investments in debt and equity, if and when a decline in fair value is determined, an impairment charge is recorded and a new cost basis in the investment is established. For equity-method investments, an impairment charge is recorded only if and when a decline in fair value is determined to be other-than-temporary.\nDerivative financial instruments are carried at fair value in certain balance sheet categories (see \nNote 7A\n), with changes in fair value reported in net income or, for certain qualifying hedging relationships, in \nOther comprehensive income/(loss)\n \n(see \nNote 7E\n).\nQ. \nTax Assets and Liabilities and Income Tax Contingencies\nTax Assets and Liabilities\n––\nCurrent tax assets\n primarily include (i) tax effects for intercompany transfers of inventory within our combined group, which are recognized in the consolidated statements of operations when the inventory is sold to a third party and (ii) income tax receivables that are expected to be recovered either via refunds from taxing authorities or reductions to future tax obligations.\nDeferred tax assets and liabilities are recognized for the expected future tax consequences of differences between the financial reporting and tax bases of assets and liabilities using enacted tax rates and laws. We provide a valuation allowance when we believe that our deferred tax assets are not recoverable based on an assessment of estimated future taxable income that incorporates ongoing, prudent and feasible tax-planning strategies, that would be implemented, if necessary, to realize the deferred tax assets. Amounts recorded for valuation allowances requires judgments about future income which can depend heavily on estimates and assumptions. All deferred tax assets and liabilities within the same tax jurisdiction are presented as a net amount in the noncurrent section of our consolidated balance sheet.\nThe TCJA subjects a U.S. shareholder to current tax on global intangible low-taxed income earned by certain foreign subsidiaries. The FASB Staff Q&A, Topic 740, No. 5, \nAccounting for Global Intangible Low-Taxed Income\n, states that we are permitted to make an accounting policy election to either recognize deferred taxes for temporary basis differences expected to reverse as global intangible low-taxed income in future years or provide for the tax expense related to such income in the year the tax is incurred. We elected to recognize deferred taxes for temporary differences expected to reverse as global intangible low-taxed income in future years.\nOther non-current tax assets primarily represent our estimate of the potential tax benefits in one tax jurisdiction that could result from the payment of income taxes in another tax jurisdiction. These potential benefits generally result from cooperative efforts among taxing authorities, as required by tax treaties to minimize double taxation, commonly referred to as the competent authority process. The recoverability of these assets, which we believe to be more likely than not, is dependent upon the actual payment of taxes in one tax jurisdiction and, in some cases, the successful petition for recovery in another tax jurisdiction.\nOther taxes payable\n as of December 31, 2024 and 2023 include liabilities for uncertain tax positions and the noncurrent portion of the repatriation tax liability for which we elected payment over eight years through 2026. See \nNote 5D\n for uncertain tax positions and \nNote 5A\n for the repatriation tax liability and other estimates and assumptions in connection with the TCJA.\nIncome Tax Contingencies\n––We account for income tax contingencies using a benefit recognition model. If we consider that a tax position is more likely than not to be sustained upon audit, based solely on the technical merits of the position, we recognize all or a portion of the benefit. We measure the benefit by determining the amount that is greater than 50% likely of being realized upon settlement, presuming that the tax position is examined by the taxing authority with full knowledge of all relevant information.\nWe regularly monitor our position and subsequently recognize the unrecognized tax benefit: (i) if there are changes in tax law, analogous case law or there is new information that sufficiently raise the likelihood of prevailing on the technical merits of the position to “more likely than not”; (ii) if the statute of limitations expires; or (iii) if there is a completion of an audit resulting in a favorable settlement of that tax year with the appropriate agency. Liabilities for uncertain tax positions are classified as current only when we expect to pay cash within the next 12 months. Interest and penalties, if any, are recorded in \nProvision/(benefit) for taxes on income\n and are classified on our consolidated balance sheet with the related tax liability.\nOur assessments are based on estimates and assumptions that have been deemed reasonable by management, but our estimates of unrecognized tax benefits and potential tax benefits may not be representative of actual outcomes, and variation from such estimates could materially affect our financial statements in the period of settlement or when the statutes of limitations expire, as we treat these events as discrete items in the period of resolution.\nR. \nPension and Postretirement Benefit Plans\nThe majority of our employees worldwide are covered by defined benefit pension plans, defined contribution plans or both. In the U.S., we have both IRC-qualified and supplemental (non-qualified) defined benefit plans and defined contribution plans, as well as other postretirement benefit plans consisting primarily of medical insurance for retirees and their eligible dependents. Net periodic pension and postretirement benefit costs other than the service costs are recognized in \nOther (income)/deductions—net\n. We immediately recognize actuarial gains and losses arising from the remeasurement of our pension and postretirement plans (mark-to-market accounting). Each time a pension or postretirement plan is remeasured, the actuarial gain or loss is recognized immediately and classified as \nOther (income)/deductions––net\n. We recognize the overfunded or underfunded status of each of our defined benefit plans as an asset or liability. The obligations are generally measured at the actuarial present value of all benefits attributable to employee service rendered, as provided by the applicable benefit formula. Our pension and other postretirement obligations may be determined using assumptions such as discount rate, expected annual rate of return on plan assets, expected employee turnover and participant mortality. For our pension plans, the obligation may also include assumptions as to future compensation levels. For our other postretirement benefit plans, the obligation may include assumptions as to the expected cost of \nPfizer Inc.\n2024 Form 10-K\n62\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nproviding medical insurance benefits, as well as the extent to which those costs are shared with the employee or others (such as governmental programs). Plan assets are measured at fair value.\nS. \nLegal and Environmental Contingencies\nWe and certain of our subsidiaries are subject to numerous contingencies arising in the ordinary course of business, such as patent litigation, product liability and other product-related litigation, commercial and other asserted or unasserted matters, environmental claims and proceedings, government investigations and guarantees and indemnifications. In assessing contingencies related to legal and environmental proceedings that are pending against the Company, or unasserted claims that are probable of being asserted, we record accruals for these contingencies to the extent that we conclude that a loss is both probable and reasonably estimable. If some amount within a range of loss appears to be a better estimate than any other amount within the range, we accrue that amount. Alternatively, when no amount within a range of loss appears to be a better estimate than any other amount, we accrue the lowest amount in the range. We record anticipated recoveries under existing insurance contracts when recovery is assured.\nT. \nShare-Based Payments\nOur compensation programs include share-based payments. Generally, grants under share-based payment programs are accounted for at fair value and these fair values are generally amortized on a straight-line basis or on an accelerated attribution approach over the vesting terms with the related costs recorded in \nCost of sales, Selling, informational and administrative expenses\n and/or \nResearch and development expenses\n, as appropriate.\nNote 2. \nAcquisitions, Divestitures, Equity-Method Investments, Collaborative Arrangements and Research and Development Arrangement\nA. Acquisitions\nSeagen––\nOn December 14, 2023 (the acquisition date), we acquired Seagen, a global biotechnology company that discovers, develops and commercializes transformative cancer medicines, for $\n229\n per share in cash. The total fair value of the consideration transferred was $\n44.2\n billion ($\n43.4\n billion, net of cash acquired). In addition, in connection with the acquisition, $\n476\n million in post-closing compensation expense for Seagen employee incentive awards was recorded in \nRestructuring charges and certain acquisition-related costs\n (see \nNote 3\n).\nSeagen’s principal business was the development, manufacture, marketing and distribution of targeted cancer therapeutics, primarily using ADC technology. Seagen’s portfolio includes \nfour\n approved medicines as well as a pipeline of product candidates. Clinical development programs are ongoing for each of these approved medicines for potential new or expanded indications and for several product candidates. We believe our acquisition of Seagen will strengthen our oncology capabilities by allowing us to combine Seagen’s ADC technology with the resources and scale of the Pfizer enterprise and to advance more potential breakthroughs to patients with cancer.\nThe following table summarizes the amounts recognized for assets acquired and liabilities assumed as of the acquisition date, as well as adjustments made in 2024 to the amounts initially recorded in 2023 (measurement period adjustments) with a corresponding change to goodwill. The measurement period adjustments did not have a material impact on our earnings in any period. The final allocation of the consideration transferred to the assets acquired and the liabilities assumed has been completed.\n(MILLIONS)\nAmounts Recognized \nas of Acquisition Date\n(as previously reported as of December 31, 2023)\nMeasurement Period Adjustments\n(a)\nAmounts Recognized as of Acquisition Date (as adjusted) Final\nWorking capital, excluding inventories\n(b)\n$\n736\n \n$\n(\n115\n)\n$\n621\n \nInventories\n(c)\n4,195\n \n(\n922\n)\n3,273\n \nProperty, plant and equipment\n524\n \n(\n243\n)\n280\n \nIdentifiable intangible assets, excluding in-process research and development\n(d)\n7,970\n \n(\n50\n)\n7,920\n \nIn-process research and development\n20,800\n \n(\n900\n)\n19,900\n \nOther noncurrent assets\n174\n \n(\n115\n)\n59\n \nNet income tax accounts\n(e)\n(\n6,123\n)\n1,343\n \n(\n4,779\n)\nOther noncurrent liabilities\n(\n167\n)\n(\n20\n)\n(\n187\n)\nTotal identifiable net assets\n28,108\n \n(\n1,022\n)\n27,086\n \nGoodwill\n16,126\n \n1,022\n \n17,148\n \nNet assets acquired/total consideration transferred\n$\n44,234\n \n$\n—\n \n$\n44,234\n \n(a)\nThe changes in the estimated fair values are to better reflect market participant assumptions about facts and circumstances existing as of the acquisition date. The measurement period adjustments did not result from intervening events subsequent to the acquisition date.\n(b)\nIncludes cash and cash equivalents, accounts receivable, other current assets, accounts payable, accrued compensation and other current liabilities. \n(c)\nAs adjusted, comprised of $\n1.1\n billion current inventories and $\n2.1\n billion noncurrent inventories.\n(d)\nAs adjusted, comprised mainly of $\n7.5\n billion of finite-lived developed technology rights with an estimated weighted-average life of approximately \n18\n years.\n(e)\nAs adjusted, included primarily in \nNoncurrent deferred tax liabilities. \nThe measurement period adjustments primarily reflect the tax impact of the pre-tax measurement period adjustments.\nAs of the acquisition date, the fair value of accounts receivable approximated the book value acquired. The gross contractual amount receivable was $\n597\n million.\nPfizer Inc.\n2024 Form 10-K\n63\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nIn the ordinary course of business, Seagen may incur liabilities for environmental, legal and tax matters, as well as guarantees and indemnifications. These matters may include contingencies. Except as specifically excluded by the relevant accounting standard, contingencies are required to be measured at fair value as of the acquisition date if the acquisition-date fair value of the asset or liability arising from a contingency can be determined. If the acquisition-date fair value of the asset or liability cannot be determined, the asset or liability would be recognized at the acquisition date if both of the following criteria are met: (i) it is probable that an asset existed or that a liability had been incurred at the acquisition date, and (ii) the amount of the asset or liability can be reasonably estimated. \n•\nEnvironmental Matters\n—In the ordinary course of business, Seagen may incur liabilities for environmental matters such as remediation work, asset retirement obligations and environmental guarantees and indemnifications. \n•\nLegal Matters\n—Seagen is involved in various legal proceedings, including patent, intellectual property, and product liability matters of a nature considered normal to its business. The contingencies arising from legal matters are not significant to our consolidated financial statements.\n•\nTax Matters\n—In the ordinary course of business, Seagen incurs liabilities for income taxes. Income taxes are exceptions to both the recognition and fair value measurement principles associated with the accounting for business combinations. Reserves for income tax contingencies continue to be measured under the benefit recognition model previously used by Seagen (see \nNote 1Q\n). Net liabilities for income taxes as of the acquisition date were $\n4.8\n billion, including $\n48\n million for uncertain tax positions. The net tax liability includes $\n6.3\n billion for the tax impact of fair value adjustments, partially offset by $\n1.5\n billion for deferred tax assets on which Seagen had recognized a valuation allowance.\nGoodwill is calculated as the excess of the consideration transferred over the net assets recognized and represents the future economic benefits arising from other assets acquired that could not be individually identified and separately recognized. Specifically, the goodwill recorded as part of the acquisition of Seagen includes the following: \n•\nthe expected specific synergies and other benefits that we believe will result from combining the operations of Seagen with the operations of Pfizer; \n•\nany intangible assets that do not qualify for separate recognition, as well as future, as yet unidentified projects and products; and \n•\nthe value of the going-concern element of Seagen’s existing businesses (the higher rate of return on the assembled collection of net assets versus if Pfizer had acquired all of the net assets separately). \nGoodwill is not amortized and is not deductible for tax purposes. All of the goodwill related to the acquisition of Seagen is related to our Biopharma segment (see \nNote 10\n). \nActual and Pro Forma Impact of Acquisition\n—\nThe following table presents information for Seagen’s operations that are included in Pfizer’s consolidated statements of operations beginning from the acquisition date, December 14, 2023, through Pfizer’s year-end in 2023: \n(MILLIONS)\nDecember 31,\n2023\nRevenues\n$\n132\n \nNet loss attributable to Pfizer Inc. common shareholders\n(a)\n(\n746\n)\n(a)\nIncludes restructuring, integration and acquisition-related costs ($\n614\n million pre-tax) and purchase accounting charges related to (i) the fair value adjustment for acquisition-date inventory estimated to have been sold ($\n109\n million pre-tax); (ii) amortization expense related to the fair value of identifiable intangible assets acquired from Seagen ($\n25\n million pre-tax); as well as (iii) depreciation expense related to the fair value adjustment of fixed assets acquired from Seagen ($\n2\n million pre-tax).\nThe following table provides unaudited U.S. GAAP supplemental pro forma information as if the acquisition of Seagen had occurred on January 1, 2022:\nUnaudited Supplemental Pro Forma Consolidated Results\nYear Ended December 31,\n(MILLIONS, EXCEPT PER SHARE DATA)\n2023\n2022\nRevenues\n$\n61,893\n \n$\n103,137\n \nNet income/(loss) attributable to Pfizer Inc. common shareholders\n(\n1,481\n)\n27,870\n \nDiluted earnings/(loss) per share attributable to Pfizer Inc. common shareholders\n(\n0.26\n)\n4.86\n \nThe unaudited supplemental pro forma consolidated results do not purport to reflect what the combined company’s results of operations would have been had the acquisition occurred on January 1, 2022, nor do they project the future results of operations of the combined company or reflect the expected realization of any cost savings associated with the acquisition. The actual results of operations of the combined company may differ significantly from the pro forma information reflected here due to many factors. \nThe unaudited supplemental pro forma financial information includes various assumptions, including those related to the purchase price allocation of the assets acquired and the liabilities assumed from Seagen. The historical U.S. GAAP financial information of Pfizer and Seagen was adjusted, primarily for the following pre-tax adjustments for the years ended December 31, 2023 and 2022:\n•\nAdditional amortization expense of approximately $\n553\n million and $\n576\n million, respectively, related to the fair value of identifiable intangible assets acquired.\n•\nAdditional expense related to the fair value adjustment to acquisition-date inventory estimated to have been sold of approximately $\n755\n million and $\n934\n million, respectively.\n•\nAdditional estimated interest expense of approximately $\n984\n million and $\n2.0\n billion, respectively, related to the debt issued by Pfizer and the commercial paper borrowings to partially finance the acquisition.\nPfizer Inc.\n2024 Form 10-K\n64\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\n•\nElimination of interest income of approximately $\n1.2\n billion and $\n267\n million, respectively, related to the debt issuance proceeds that were invested prior to the acquisition date and associated with money market funds under the assumption that a portion of these funds would have been liquidated to partially finance the acquisition.\nThe above adjustments were then adjusted for the applicable tax impact using an estimated weighted-average statutory tax rate applied to the applicable pro forma adjustments.\nThe acquisition of Seagen had no impact on Pfizer’s weighted-average shares as \nno\n shares were issued.\nGBT––\nOn October 5, 2022, we acquired GBT, a biopharmaceutical company dedicated to the discovery, development and delivery of life-changing treatments for underserved patient communities, starting with sickle cell disease, for $\n68.50\n per share in cash. The total fair value of the consideration transferred was $\n5.7\n billion ($\n5.2\n billion, net of cash acquired). In addition, $\n136\n million in payments to GBT employees for the fair value of previously unvested long-term incentive awards was recognized as post-closing compensation expense and recorded in \nRestructuring charges and certain acquisition-related costs\n (see \nNote 3\n).\nThe final allocation of the consideration transferred to the assets acquired and the liabilities assumed was completed in 2023. In connection with this business combination, we recorded: (i) $\n4.4\n billion in \nIdentifiable intangible assets, net\n, consisting of $\n3.0\n billion of IPR&D and $\n1.4\n billion of developed technology rights with a useful life of \nsix years\n, (ii) $\n1.1\n billion of \nGoodwill, \n(iii) $\n644\n million of inventories to be sold over approximately \nthree years\n, (iv) $\n516\n million of net deferred tax liabilities and (v) $\n331\n million of assumed long-term debt that was paid in full in the fourth quarter of 2022.\nBiohaven––\nOn October 3, 2022, we acquired Biohaven, the maker of Nurtec ODT/Vydura (rimegepant), an innovative therapy approved for both acute treatment of migraine and prevention of episodic migraine in adults. The transaction included the acquisition of Biohaven’s CGRP programs, including rimegepant, zavegepant and a portfolio of five pre-clinical CGRP assets. Under the terms of the agreement, we acquired all outstanding common shares of Biohaven not already owned by us for $\n148.50\n per share, in cash, for payments of approximately $\n11.5\n billion, plus repayment of third-party debt of $\n863\n million and redemption of Biohaven’s redeemable preferred stock for $\n495\n million. Effective immediately prior to the closing of the acquisition, Biohaven completed the spin-off of Biohaven Ltd. (NYSE: BHVN), distributing Biohaven Ltd.’s shares to Biohaven shareholders. Biohaven Ltd. became a new publicly traded company that retained Biohaven’s non-CGRP development stage pipeline compounds. Pfizer, a Biohaven shareholder, received a pro rata portion of Biohaven Ltd.’s shares in the distribution.\nThe total fair value of the consideration transferred was $\n11.8\n billion, which includes the fair value of Pfizer’s previous investment in Biohaven on the acquisition date of approximately $\n300\n million. The final allocation of the consideration transferred to the assets acquired and the liabilities assumed was completed in 2023. In connection with this business combination, we recorded: (i) $\n12.1\n billion in \nIdentifiable intangible assets\n, consisting of $\n11.6\n billion of developed technology rights with a useful life of \n11\n years and $\n450\n million of IPR&D, (ii) $\n823\n million of \nGoodwill\n, (iii) $\n813\n million of inventories to be sold over approximately \ntwo years\n, (iv) $\n398\n million of trade accounts receivable, (v) $\n1.4\n billion of assumed long-term debt that was paid in full in the fourth quarter of 2022, (vi) $\n544\n million of net deferred tax liabilities and (vii) $\n526\n million of \nOther current liabilities\n.\nArena––\nOn March 11, 2022, we acquired Arena, a clinical stage company with development-stage therapeutic candidates in gastroenterology, dermatology and cardiology, for $\n100\n per share in cash. The total fair value of the consideration transferred was $\n6.6\n billion ($\n6.2\n billion, net of cash acquired). In addition, $\n138\n million in payments to Arena employees for the fair value of previously unvested long-term incentive awards was recognized as post-closing compensation expense and recorded in \nRestructuring charges and certain acquisition-related costs\n (see \nNote 3\n).\nThe final allocation of the consideration transferred to the assets acquired and the liabilities assumed was completed in 2023. In connection with this business combination, we recorded: (i) $\n5.5\n billion in \nIdentifiable intangible assets\n, consisting of $\n5.0\n billion of IPR&D\n \nand $\n460\n million of indefinite-lived licensing agreements and other, (ii) $\n1.0\n billion\n \nof \nGoodwill \nand (iii) $\n490\n million of net deferred tax liabilities.\nReViral––\nOn June 9, 2022, we acquired ReViral, a privately held, clinical-stage biopharmaceutical company focused on discovering, developing and commercializing novel antiviral therapeutics that target respiratory syncytial virus, for a total consideration of up to $\n536\n million, including upfront payments of $\n436\n million upon closing (including a base payment of $\n425\n million plus working capital adjustments) and an additional $\n100\n million contingent upon a future development milestone for a secondary pipeline asset. It was subsequently determined the applicable milestone was not achieved.\nWe accounted for the transaction as an asset acquisition since the lead asset, sisunatovir, represented substantially all of the fair value of the gross assets acquired. At the acquisition date, we recorded a $\n426\n million charge representing an acquired IPR&D asset with no alternative use in \nAcquired in-process research and development expenses\n, which is presented as a cash outflow from operating activities. Other assets acquired and liabilities assumed were not significant.\nPro forma information for the aforementioned acquisitions (except for Seagen) has not been presented because these acquisitions were not material to our consolidated financial statements.\nB. \nDivestitures\nDivestiture of Early-Stage Rare Disease Gene Therapy Portfolio–\n–On September 19, 2023, we completed an agreement with Alexion, under which Alexion purchased and licensed the assets of our early-stage rare disease gene therapy portfolio. Under the terms of the agreement, Alexion will pay us total consideration of up to $\n1\n billion, consisting of an upfront payment of $\n300\n million which was paid at closing and future contingent milestone payments, plus tiered royalties based on annual net sales of the assets. In connection with the closing of the transaction, Pfizer recognized a $\n222\n million pre-tax gain in \nOther (income)/deductions––net\n (see \nNote 4\n).\nPfizer Inc.\n2024 Form 10-K\n65\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nUpjohn Separation and Combination with Mylan––\nIn connection with the 2020 spin-off and the combination of the Upjohn Business with Mylan to form Viatris, Pfizer and Viatris entered into various agreements, including a separation and distribution agreement, interim operating models, including agency arrangements, MSAs, TSAs, a tax matters agreement, and an employee matters agreement, among others. The interim agency operating model arrangements primarily include billings, collections and remittance of rebates that we are performing on a transitional basis on behalf of Viatris. Under the MSAs, Pfizer or Viatris, as the case may be, manufactures, labels and packages products for the other party. The terms of the MSAs range in initial duration from \nfour\n to \nseven years\n post-separation. Services under the TSAs were largely completed as of December 31, 2023. Amounts recorded under the above agreements in 2024, 2023 and 2022 were not material to our operations. Net amounts due to Viatris under the above agreements were $\n105\n million as of December 31, 2024 and $\n33\n million as of December 31, 2023. The cash flows associated with the above agreements are included in \nNet cash provided by/(used in) operating activities.\nC. \nEquity-Method Investments\nHaleon––\nHaleon, is an independent, publicly traded company listed on the London Stock Exchange that holds the joint historical consumer healthcare business of GSK and Pfizer. We owned \n32\n% of Haleon as of December 31, 2023. In March 2024, we sold approximately \n30\n% of our investment in Haleon through the sale of \n791\n million ordinary shares in a global public offering, and the sale of \n102\n million ordinary shares directly to Haleon, for $\n3.5\n billion. In October 2024, we sold approximately \n34\n% of our remaining investment in Haleon through the sale of \n640\n million ordinary shares in a global public offering, and the sale of \n61\n million ordinary shares directly to Haleon, for $\n3.5\n billion. We recognized total gains on these sales of our Haleon shares of $\n945\n million during 2024 in \nOther (income)/deductions––net\n (see \nNote 4\n). After the October 2024 share sale, we owned approximately \n15\n% of the outstanding voting shares of Haleon as of \nDecember 31, 2024\n.\nThrough the third quarter of 2024, we accounted for our Haleon investment under the equity method and recorded our share of earnings from Haleon on a quarterly basis on a one-quarter lag in \nOther (income)/deductions––net\n. As Haleon is a foreign investee whose reporting currency is the U.K. pound, we translated its financial statements into U.S. dollars and recognized the impact of foreign currency translation adjustments in the carrying value of our investment and in other comprehensive income. With the reduction in our Haleon ownership percentage and board representation after the October 2024 sale, we no longer have the ability to exercise significant influence over the operating and financial policies of Haleon. As a result, we discontinued the application of the equity method to our Haleon investment, and began to account for the investment as an equity security with a readily determinable fair value, which is carried at fair value, with changes in fair value reported in \nOther (income)/deductions––net\n. See \nNote 4\n.\nThe following table summarizes the change in the carrying value of our investment in Haleon:\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\nBeginning carrying value reported in \nEquity-method investments\n$\n11,451\n \n$\n10,824\n \nCarrying value of shares sold\n(\n6,113\n)\n—\n \nDividends\n(\n212\n)\n(\n153\n)\nCurrency translation adjustments and other\n(a)\n341\n \n293\n \nBasis difference adjustments and amortization\n(b), (c)\n(\n91\n)\n(\n2\n)\nPfizer share of Haleon investee capital transaction\n(b), (d)\n(\n44\n)\n—\n \nPfizer share of Haleon earnings\n(b)\n224\n \n489\n \nReclassification of accumulated other comprehensive income balances in \nEquity-method investments\n(e)\n(\n143\n)\n—\n \nTransfer of carrying value to \nShort-term investments\n(f)\n(\n5,411\n)\n—\n \nEnding carrying value\n$\n—\n \n$\n11,451\n \n(a)\nSee \nNote 6\n.\n(b)\nIncluded in \nOther (income)/deductions\n––\nnet\n.\n(c)\nAdjustments in 2024 include (i) the impact of Haleon’s brand divestitures and impairments of intangible assets and (ii) changes in Haleon’s tax rates on intangible asset-related deferred tax liabilities.\n(d)\nIn 2024, includes (i) a decrease of $\n91\n million recorded in the second quarter of 2024 for Pfizer’s share of an investee capital transaction recognized by Haleon for treasury stock Haleon purchased in the first quarter of 2024 and (ii) an increase of $\n46\n million recorded in the third quarter of 2024 for the impact of the reduction in Pfizer’s ownership from approximately \n32\n% to approximately \n23\n% as applied to dividends with a record date in the first quarter of 2024, which were recognized in Haleon’s second quarter 2024 financial statements.\n(e)\nThe 2024 activity primarily represent foreign currency translation balances in \nAccumulated other comprehensive income\n related to the equity-method investment in Haleon that were reclassified into \nEquity-method investments\n upon our loss of significant influence over Haleon and our discontinuance of the equity method for the Haleon investment.\n(f)\nThe final carrying value of our equity-method investment in Haleon was reclassified to\n Short-term investments\n and is being accounted for as an equity investment with a readily determinable fair value.\nPfizer Inc.\n2024 Form 10-K\n66\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nSummarized financial information for Haleon as of September 30, 2024, the most recent period available, and as of September 30, 2023 and for the periods ending September 30, 2024, 2023, and 2022 is as follows:\n(MILLIONS)\nSeptember 30, 2024\nSeptember 30, 2023\nCurrent assets\n$\n7,813\n \n$\n5,876\n \nNoncurrent assets\n37,572\n \n36,954\n \nTotal assets\n$\n45,385\n \n$\n42,830\n \nCurrent liabilities\n$\n7,468\n \n$\n6,117\n \nNoncurrent liabilities\n15,511\n \n15,744\n \nTotal liabilities\n$\n22,979\n \n$\n21,862\n \nEquity attributable to shareholders\n$\n22,129\n \n$\n20,719\n \nEquity attributable to noncontrolling interests\n277\n \n249\n \nTotal net equity\n$\n22,406\n \n$\n20,968\n \nFor the Twelve Months Ended\n(MILLIONS)\nSeptember 30, 2024\nSeptember 30, 2023\nSeptember 30, 2022\nNet sales\n$\n14,252\n \n$\n13,921\n \n$\n13,566\n \nCost of sales\n(\n5,656\n)\n(\n5,580\n)\n(\n5,081\n)\nGross profit\n$\n8,596\n \n$\n8,341\n \n$\n8,486\n \nIncome from continuing operations\n1,668\n \n1,606\n \n1,745\n \nNet income\n1,668\n \n1,606\n \n1,745\n \nIncome attributable to shareholders\n1,600\n \n1,528\n \n1,675\n \nIn connection with GSK’s previously announced planned demerger of at least \n80\n% of GSK’s \n68\n% equity interest in the Consumer Healthcare JV, in March 2022 the Consumer Healthcare JV completed its offering of a total aggregate principal amount of $\n8.75\n billion in U.S. dollar-denominated senior notes of various maturities, €\n2.35\n billion in euro-denominated senior notes of various maturities and £\n700\n million in U.K. pound-denominated senior notes of various maturities (collectively, the “notes”). The notes were guaranteed by GSK generally up to and excluding the date of the demerger (the “Guarantee Assumption Date”). We agreed to indemnify GSK for \n32\n% (representing our pro rata equity interest in the Consumer Healthcare JV at that time) of any amount payable by GSK pursuant to its guarantee of the notes. Our indemnity was provided solely for the benefit of GSK. Neither we, nor any of our subsidiaries, were an issuer or guarantor of any of the notes.\nFollowing its issuance of the notes in March 2022, which fell in our international second quarter of 2022, the Consumer Healthcare JV loaned to us and GSK the net proceeds received from the notes on a pro rata equity ownership basis, for which we received a loan of £\n2.9\n billion ($\n3.7\n billion as of the end of our second quarter of 2022), at an interest rate of \n1.365\n% per annum payable semi-annually in arrears. In conjunction with the demerger, we received £\n3.5\n billion ($\n4.2\n billion) in dividends from the JV in July 2022, of which $\n4.0\n billion related to a one-time pre-separation dividend, which decreased the carrying value of our investment and are included in \nNet cash provided by/(used in) investing activities\n. Simultaneous with the receipt of the dividends, we repaid the £\n2.9\n billion loan from the JV. GSK similarly received pro rata dividends and simultaneously repaid its pro rata loan from the JV. In conjunction with these transactions, our indemnification of GSK’s guarantee discussed above was terminated.\nInvestment in ViiV––\nIn 2009, we and GSK created ViiV, which is focused on research, development and commercialization of human immunodeficiency virus (HIV) medicines. We own approximately \n11.7\n% of ViiV, and prior to 2016 we accounted for our investment under the equity method due to the significant influence that we have over the operations of ViiV through our board representation and minority veto rights. We suspended application of the equity method to our investment in ViiV in 2016 when the carrying value of our investment was reduced to \nzero\n due to the recognition of cumulative equity-method losses and dividends, and therefore we no longer record our proportionate share of ViiV’s net income (loss) in our results of operations. Since 2016, we have recognized dividends from ViiV as income in \nOther (income)/deductions––net\n when earned, including dividends of $\n272\n million in 2024, $\n265\n million in 2023 and $\n314\n million in 2022 (see \nNote 4\n).\nSummarized financial information for our equity-method investee, ViiV, as of December 31, 2024 and 2023 and for the years ending December 31, 2024, 2023, and 2022 is as follows:\nAs of December 31,\n(MILLIONS)\n2024\n2023\nCurrent assets\n$\n4,338\n \n$\n4,237\n \nNoncurrent assets\n3,223\n \n3,009\n \nTotal assets\n$\n7,561\n \n$\n7,245\n \nCurrent liabilities\n$\n4,280\n \n$\n4,085\n \nNoncurrent liabilities\n6,205\n \n5,998\n \nTotal liabilities\n$\n10,485\n \n$\n10,083\n \nTotal net equity/(deficit) attributable to shareholders\n$\n(\n2,924\n)\n$\n(\n2,838\n)\nPfizer Inc.\n2024 Form 10-K\n67\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nNet sales\n$\n8,971\n \n$\n7,845\n \n$\n6,955\n \nCost of sales\n(\n1,360\n)\n(\n1,060\n)\n(\n819\n)\nGross profit\n$\n7,611\n \n$\n6,785\n \n$\n6,135\n \nIncome from continuing operations\n3,062\n \n3,090\n \n3,108\n \nNet income\n3,062\n \n3,090\n \n3,108\n \nIncome attributable to shareholders\n3,062\n \n3,090\n \n3,108\n \nD. \nCollaborative Arrangements\nWe enter into collaborative arrangements with respect to in-line medicines, as well as medicines in development that require completion of research and regulatory approval. Collaborative arrangements are contractual agreements with third parties that involve a joint operating activity, typically a research and/or commercialization effort, where both we and our partner are active participants in the activity and are exposed to the significant risks and rewards of the activity. Our rights and obligations under our collaborative arrangements vary. For example, we have agreements to co-promote pharmaceutical products discovered by us or other companies, and we have agreements where we partner to co-develop and/or participate together in commercializing, marketing, promoting, manufacturing and/or distributing a drug product or vaccine.\nCollaboration with Biohaven––\nIn November 2021, we entered into a collaboration and license agreement and related sublicense agreement with Biohaven and certain of its subsidiaries to commercialize rimegepant and zavegepant for the treatment and prevention of migraines outside of the U.S., subject to regulatory approval. Under the terms of the agreement, Biohaven would lead R&D globally and we would have the exclusive right to commercialization globally, outside of the U.S. Upon the closing of the transaction on January 4, 2022, we paid Biohaven $\n500\n million, including an upfront payment of $\n150\n million and an equity investment of $\n350\n million. We recognized $\n263\n million for the upfront payment and premium paid on our equity investment in \nAcquired in-process research and development expenses\n. In October 2022, we acquired all outstanding common shares of Biohaven not already owned by us for $\n148.50\n per share, in cash, for payments of approximately $\n11.5\n billion. See \nNote 2A\n.\nSummarized Financial Information for Collaborative Arrangements\nThe following provides the amounts and classification of payments (income/(expense)) between us and our collaboration partners:\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nProduct revenues\n(a)\n$\n175\n \n$\n212\n \n$\n437\n \nAlliance revenues\n(b)\n8,388\n \n7,582\n \n8,537\n \nRoyalty revenues\n(c)\n923\n \n605\n \n614\n \nTotal revenues from collaborative arrangements\n$\n9,486\n \n$\n8,400\n \n$\n9,588\n \nCost of sales\n(d)\n$\n(\n2,901\n)\n$\n(\n4,277\n)\n$\n(\n15,589\n)\nSelling, informational and administrative expenses\n(e)\n(\n335\n)\n(\n267\n)\n(\n196\n)\nResearch and development expenses\n(f)\n282\n \n219\n \n272\n \nAcquired in-process research and development expenses\n(g)\n2\n \n(\n13\n)\n(\n339\n)\nRestructuring charges and certain acquisition-related costs\n(h)\n(\n45\n)\n—\n \n—\n \nOther income/(deductions)—net\n(\n15\n)\n25\n \n50\n \n(a)\nRepresents sales to our partners of products manufactured by us.\n(b)\nSubstantially all relates to amounts earned from our partners under co-promotion agreements. The increase in 2024 was primarily driven by an increase in Alliance revenues from Eliquis and Xtandi, partially offset by a decrease in Alliance revenues from Bavencio. The decrease in 2023 was primarily driven by a decline in Alliance revenues from Comirnaty, partially offset by an increase in Alliance revenues from Eliquis.\n(c)\nPrimarily relates to royalties from our collaboration partners.\n(d)\nPrimarily relates to amounts paid to collaboration partners for their share of net sales or profits earned in collaboration arrangements where we are the principal in the transaction, and cost of sales for inventory purchased from our partners. The decreases in 2024 and in 2023 primarily relate to Comirnaty.\n(e)\nRepresents net reimbursements to our partners for selling, informational and administrative expenses incurred.\n(f)\nRepresents net reimbursements from our partners for research and development expenses incurred.\n(g)\nPrimarily relates to upfront payments to our partners as well as premiums paid on our equity investments in the common stock of our partners.\n(h)\nRelates to exit costs associated with terminating a collaboration with SMPS.\nThe amounts outlined in the above table do not include transactions with third parties other than our collaboration partners, or other costs for the products under the collaborative arrangements.\nE. \nResearch and Development Arrangement\nResearch and Development Funding Arrangement with Blackstone––\nIn April 2023, we entered into an arrangement with Blackstone under which we will receive up to a total of $\n550\n million in 2023 through 2026 to co-fund our quarterly development costs for specified treatments. As there is substantive transfer of risk to the financial partner, the development funding is recognized by us as an obligation to perform contractual services. We are recognizing the funding as a reduction of \nResearch and development expenses \nusing an attribution model over the period of the related expenses. The reduction to \nResearch and development expenses\n in 2024 and 2023 was $\n135\n million and $\n175\n million, \nPfizer Inc.\n2024 Form 10-K\n68\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nrespectively. If successful, upon regulatory approval in the U.S. or certain major markets in the EU for the indications based on the applicable clinical trials, Blackstone will be eligible to receive approval-based fixed milestone payments of up to $\n468\n million contingent upon the successful results of the clinical trials. Fixed milestone payments due upon approval will be recorded as intangible assets and amortized to \nAmortization of intangible assets\n over the shorter of the term of the agreement or estimated commercial life of the product. Following potential regulatory approval, Blackstone will be eligible to receive a combination of fixed milestone payments of up to $\n550\n million in total based on achievement of certain levels of cumulative applicable net sales, as well as royalties based on a mid-to-high single digit percentage of the applicable net sales. Fixed sales-based milestone payments will be recorded as intangible assets and amortized to \nAmortization of intangible assets\n over the shorter of the term of the agreement or estimated commercial life of the product, and royalties on net sales will be recorded as \nCost of sales\n when incurred.\nNote 3.\n \nRestructuring Charges and Other Costs Associated with Acquisitions and Cost-Reduction/Productivity Initiatives\nA. Realigning our Cost Base Program\nIn the fourth quarter of 2023, we announced that we launched a multi-year, enterprise-wide cost realignment program that aims to realign our costs with our longer-term revenue expectations. We expect costs associated with this multi-year effort to continue primarily through 2025 and to total approximately $\n2.9\n billion, primarily representing cash expenditures for severance, exit and implementation costs as well as asset write downs of which $\n2.2\n billion is associated with our Biopharma segment. From the start of this program through December 31, 2024, we incurred costs under this program of $\n2.6\n billion, of which $\n2.1\n billion is associated with our Biopharma segment (including $\n2.0\n billion of restructuring charges). \nB. Manufacturing Optimization Program\nIn the second quarter of 2024, we announced that we launched a multi-year, multi-phased program to reduce our costs of goods sold, which is expected to include operational efficiencies, network structure changes, and product portfolio enhancements. The first phase of this program is focused on operational efficiencies and we expect costs for this first phase to total approximately $\n1.6\n billion, primarily representing cash expenditures for severance and implementation costs, all of which is associated with our Biopharma segment. These costs were recorded primarily in 2024, with cash outlays expected primarily in 2025 and 2026. From the start of this program through December 31, 2024, we incurred costs under this program of $\n1.2\n billion, substantially all of which is restructuring costs for our Biopharma segment.\nC. Key Activities\nThe following summarizes costs and credits for acquisitions and cost-reduction/productivity initiatives:\nYear Ended December 31, \n(MILLIONS)\n2024\n2023\n2022\nRestructuring charges/(credits):\nEmployee terminations\n$\n1,152\n \n$\n1,622\n \n$\n776\n \nAsset impairments\n432\n \n227\n \n52\n \nExit costs\n403\n \n119\n \n54\n \nRestructuring charges/(credits)\n(a)\n1,987\n \n1,968\n \n882\n \nTransaction costs\n(b)\n5\n \n190\n \n144\n \nIntegration costs and other\n(c)\n427\n \n785\n \n348\n \nRestructuring charges and certain acquisition-related costs\n2,419\n \n2,943\n \n1,375\n \nNet periodic benefit costs/(credits) recorded in \nOther (income)/deductions––net\n7\n \n(\n7\n)\n(\n9\n)\nAdditional depreciation––asset restructuring\n \nrecorded in our consolidated statements of operations as follows\n(d)\n:\nCost of sales\n14\n \n31\n \n34\n \nSelling, informational and administrative expenses\n5\n \n1\n \n2\n \nTotal additional depreciation––asset restructuring\n19\n \n32\n \n36\n \nImplementation costs recorded in our consolidated statements of operations as follows\n(e)\n:\nCost of sales\n120\n \n67\n \n54\n \nSelling, informational and administrative expenses\n90\n \n289\n \n560\n \nResearch and development expenses\n84\n \n101\n \n2\n \nTotal implementation costs\n294\n \n457\n \n616\n \nTotal costs associated with acquisitions and cost-reduction/productivity initiatives\n$\n2,738\n \n$\n3,426\n \n$\n2,018\n \n(a)\nPrimarily represents cost-reduction initiatives. Amounts associated with our Biopharma segment: charges of $\n1.8\n billion for 2024 (including charges of $\n1.2\n billion for our Manufacturing Optimization Program and charges of $\n571\n million for our Realigning our Cost Base Program), $\n1.5\n billion for 2023 (including charges of $\n1.4\n billion for our Realigning our Cost Base Program and charges of $\n3\n million for our Transforming to a More Focused Company program, that we have substantially completed) and $\n796\n million for 2022 (including charges of $\n601\n million for our Transforming to a More Focused Company program).\n(b)\nRepresents external costs for banking, legal, accounting and other similar services.\n(c)\nRepresents external, incremental costs directly related to integrating acquired businesses, such as expenditures for consulting and the integration of systems and processes, and certain other qualifying costs. 2023 costs mostly relate to our acquisition of Seagen, including $\n476\n million that was recognized as a post-closing compensation expense for payments to Seagen employees in the fourth quarter of 2023 for the fair value of long-term incentive awards that vested upon closing and the expense for employee incentive awards issued in contemplation of the merger. 2022 costs mostly related to our acquisitions of Arena and GBT, including $\n138\n million in payments to Arena employees in the first quarter of 2022 and $\n136\n million in payments to GBT employees in the fourth quarter of 2022 for the fair value of previously unvested long-term incentive awards that was recognized as post-closing compensation expense. See \nNote 2A\n. \nPfizer Inc.\n2024 Form 10-K\n69\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\n(d)\nRepresents the impact of changes in the estimated useful lives of assets involved in restructuring actions.\n(e)\nRepresents external, incremental costs directly related to implementing our non-acquisition-related cost-reduction/productivity initiatives.\nThe following summarizes the components and changes in restructuring accruals:\n(MILLIONS)\nEmployee\nTermination\nCosts\nAsset\nImpairment\nCharges\nExit Costs\nAccrual\nBalance, January 1, 2023 \n$\n1,196\n \n$\n—\n \n$\n8\n \n$\n1,204\n \nProvision\n1,622\n \n227\n \n119\n \n1,968\n \nUtilization and other\n(a)\n(\n840\n)\n(\n227\n)\n(\n116\n)\n(\n1,184\n)\nBalance, December 31, 2023\n(b)\n1,978\n \n—\n \n11\n \n1,988\n \nProvision\n1,152\n \n432\n \n403\n \n1,987\n \nUtilization and other\n(a)\n(\n1,083\n)\n(\n432\n)\n(\n341\n)\n(\n1,856\n)\nBalance, December 31, 2024\n(c)\n$\n2,046\n \n$\n—\n \n$\n74\n \n$\n2,120\n \n(a)\nOther activity includes adjustments for foreign currency translation that are not material to our consolidated financial statements.\n(b)\nIncluded in \nOther current liabilities\n ($\n1.3\n billion) and \nOther noncurrent liabilities\n ($\n663\n million).\n(c)\nIncluded in \nOther current liabilities \n($\n1.7\n billion) and \nOther noncurrent liabilities \n($\n437\n million).\nNote 4. \nOther (Income)/Deductions—Net\nComponents of \nOther (income)/deductions––net \ninclude:\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nInterest income\n$\n(\n545\n)\n$\n(\n1,624\n)\n$\n(\n251\n)\nInterest expense\n(a)\n3,091\n \n2,209\n \n1,238\n \nNet interest expense\n(b)\n2,546\n \n585\n \n987\n \nNet (gains)/losses recognized during the period on equity securities\n(c)\n(\n1,008\n)\n(\n1,590\n)\n1,273\n \nIncome from collaborations, out-licensing arrangements and sales of compound/product rights\n(\n42\n)\n(\n154\n)\n(\n188\n)\nNet periodic benefit costs/(credits) other than service costs\n154\n \n(\n610\n)\n(\n849\n)\nCertain legal matters, net\n(d)\n567\n \n474\n \n230\n \nCertain asset impairments\n(e)\n3,295\n \n3,024\n \n421\n \nHaleon equity method (income)/loss\n(f)\n(\n102\n)\n(\n505\n)\n(\n436\n)\nOther, net\n(g)\n(\n1,022\n)\n(\n1,002\n)\n(\n378\n)\nOther (income)/deductions––net\n$\n4,388\n \n$\n222\n \n$\n1,062\n \n(a)\nCapitalized interest totaled $\n182\n million in 2024, $\n160\n million in 2023 and $\n124\n million in 2022.\n(b)\nThe increase in net interest expense in 2024 reflects (i) a decrease in interest income due to lower investment balances after completion of our $\n43.4\n billion Seagen acquisition in December 2023 and (ii) higher interest expense driven by our $\n31\n billion aggregate principal amount of senior unsecured notes issued in May 2023, as well as the remaining balance of the $\n8\n billion of commercial paper issued in the fourth quarter of 2023, both part of the financing for our acquisition of Seagen.\n(c)\n2024 net gains primarily include, among other things, an unrealized gain of $\n1.0\n billion related to our investment in Haleon, which is now carried at fair value (see \nNote 2C\n). 2023 net gains primarily included, among other things, a realized gain of $\n1.7\n billion related to our investment in Telavant Holdings, Inc. and unrealized gains of $\n297\n million related to our investment in Cerevel Therapeutics Holdings, Inc., partially offset by unrealized losses of $\n292\n million related to our investment in BioNTech. 2022 net losses included, among other things, unrealized losses of $\n986\n million related to investments in BioNTech, Allogene Therapeutics, Inc. and Arvinas.\n(d)\n2024 primarily includes certain product liability expenses related to products discontinued and/or divested by Pfizer. 2023 primarily included certain product liability and other legal expenses related to products discontinued and/or divested by Pfizer and legal obligations related to pre-acquisition matters. 2022 primarily included certain product liability and other legal expenses related to products discontinued and/or divested by Pfizer.\n(e)\nThe amount for 2024 represents intangible asset impairment charges, and includes $\n2.9\n billion recorded in the fourth quarter associated with our Biopharma segment, due to changes in development plans and updated long-range commercial forecasts, composed of: (i) $\n1.0\n billion for B7H4V (felmetatug vedotin), a Phase 1 IPR&D asset, (ii) $\n475\n million for Medrol, a finite-lived brand, (iii) $\n435\n million for Zavzpret nasal spray developed technology rights, (iv) $\n400\n million and $\n200\n million for Tukysa and disitamab vedotin, respectively, IPR&D assets reflecting emerging competition, as well as (v) other developed technology rights, IPR&D impairments and a finite-lived licensing agreement totaling $\n436\n million which also includes de-prioritization of certain assets. 2024 also includes a $\n240\n million intangible asset impairment charge, associated with our Biopharma segment that represents IPR&D related to a Phase 3 study for the treatment of DMD, which reflects unfavorable clinical trial results. The amount for 2023 primarily represented intangible asset impairment charges of $\n3.0\n billion, of which $\n2.9\n billion was associated with our Biopharma segment ($\n2.8\n billion recorded in the fourth quarter), including: (i) $\n1.4\n billion for etrasimod (Velsipity) IPR&D, based on a change in development plans for additional indications and overall revenue expectations, (ii) $\n964\n million for Prevnar 13 developed technology rights due to updated commercial forecasts mainly reflecting a transition to vaccines with higher serotype coverage, as well as (iii) $\n486\n million for various other IPR&D assets and developed technology rights, due to updated commercial forecasts mainly reflecting competitive pressures and/or prioritization decisions. 2023 also included $\n128\n million associated with Other business activities, related to IPR&D and developed technology rights for acquired software assets and reflected unfavorable pivotal trial results and updated commercial forecasts. 2022 represented intangible asset impairment charges associated with our Biopharma segment of $\n200\n million for an IPR&D asset for the unapproved indication of symptomatic dilated cardiomyopathy due to a mutation of the gene encoding the lamin A/C protein that resulted from the Phase 3 trial reaching futility at a pre-planned interim analysis and $\n171\n million for developed technology rights due to updated commercial forecasts mainly reflecting competitive pressures. 2022 also included intangible asset impairment charges of $\n50\n million \nPfizer Inc.\n2024 Form 10-K\n70\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nassociated with PC1, related to finite-lived licensing agreements, and reflected updated contract manufacturing forecasts reflecting changes to market dynamics.\n(f)\nSee \nNote 2C\n.\n(g)\nThe amount for 2024 primarily includes, among other things, (i) gains of $\n945\n million on the partial sales of our investment in Haleon in March and October 2024, (ii) dividend income of $\n272\n million from our investment in ViiV and (iii) a charge of $\n420\n million recorded in the third quarter related to the expected sale of one of our facilities resulting from the discontinuation of our DMD program\n. \n2023 included, among other things, (i) dividend income of $\n265\n million from our investment in ViiV and $\n211\n million from our investment in Nimbus resulting from Takeda’s acquisition of Nimbus’s oral, selective allosteric tyrosine kinase 2 (TYK2) inhibitor program subsidiary and (ii) a $\n222\n million gain on the divestiture of our early-stage rare disease gene therapy portfolio to Alexion. 2022 included, among other things, (i) dividend income of $\n314\n million from our investment in ViiV, (ii) income net of costs associated with TSAs of $\n142\n million and (iii) charges of $\n77\n million, reflecting the change in the fair value of contingent consideration.\nAdditional information about the intangible assets that were impaired during 2024 follows:\nYear Ended\nFair Value\n(a)\nDecember 31, 2024\n(MILLIONS)\nAmount\nLevel 1\nLevel 2\nLevel 3\nImpairment\nIPR&D\n(b)\n$\n4,900\n \n$\n—\n \n$\n—\n \n$\n4,900\n \n$\n1,873\n \nDeveloped technology rights\n(b)\n524\n \n—\n \n—\n \n524\n \n943\n \nFinite-lived brand\n(b)\n270\n \n—\n \n—\n \n270\n \n475\n \nFinite-lived licensing agreement\n(b)\n—\n \n—\n \n—\n \n—\n \n5\n \nTotal\n$\n5,694\n \n$\n—\n \n$\n—\n \n$\n5,694\n \n$\n3,295\n \n(a)\nThe fair value amounts are presented as of the date of impairment, as these assets are not measured at fair value on a recurring basis. See also \nNote 1E\n.\n(b)\nReflects intangible assets written down to fair value in 2024. Fair value was determined using the income approach, specifically the multi-period excess earnings method, also known as the discounted cash flow method. We started with a forecast of all the expected net cash flows for the asset and then applied an asset-specific discount rate to arrive at a net present value amount. Some of the more significant estimates and assumptions inherent in this approach include: the amount and timing of the projected net cash flows, which includes the expected impact of competitive, legal and/or regulatory forces on the product; and assumptions about the probability of technical and regulatory success (PTRS) of ongoing clinical trials, the discount rate, which seeks to reflect the various risks inherent in the projected cash flows; and the tax rate, which seeks to incorporate the geographic diversity of the projected cash flows.\nNote 5. \nTax Matters\nA. Taxes on Income from Continuing Operations\nComponents of \nIncome from continuing operations before provision/(benefit) for taxes on income \ninclude:\n \nYear Ended December 31, \n(MILLIONS)\n2024\n2023\n2022\nUnited States\n$\n(\n637\n)\n$\n(\n4,411\n)\n$\n5,032\n \nInternational\n8,660\n \n5,469\n \n29,697\n \nIncome from continuing operations before provision/(benefit) for taxes on income\n(\na), (b)\n$\n8,023\n \n$\n1,058\n \n$\n34,729\n \n(a)\n2024 v. 2023\n––\nThe reduction in the domestic loss in 2024 versus the domestic loss in 2023 is primarily attributable to increased revenues offset by higher restructuring charges and asset impairment charges. The increase in the international income is primarily attributable to lower: \nCost of Sales\n, \nRestructuring charges and certain acquisition-related costs \nand asset impairment charges.\n(b)\n2023 v. 2022\n––\nThe domestic loss in 2023 versus domestic income in 2022 and the decrease in international income in 2023 was primarily attributable to lower revenues, higher intangible asset impairment charges, and increases in \nRestructuring charges and certain acquisition-related costs\n, \nAmortization of intangible assets\n, and \nSelling, informational and administrative expenses\n, partially offset by a decrease in \nCost of sales\n and net gains on equity securities in 2023 versus net losses on equity securities in 2022\n.\nComponents of \nProvision/(benefit) for taxes on income\n based on the location of the taxing authorities include:\n \nYear Ended December 31, \n(MILLIONS)\n2024\n2023\n2022\nUnited States\nCurrent income taxes:\nFederal\n$\n453\n \n$\n1,321\n \n$\n2,744\n \nState and local\n32\n \n(\n135\n)\n(\n20\n)\nDeferred income taxes:\nFederal\n(\n1,909\n)\n(\n2,606\n)\n(\n3,271\n)\nState and local\n(\n293\n)\n(\n184\n)\n(\n310\n)\nTotal U.S. tax provision/(benefit)\n(\n1,717\n)\n(\n1,605\n)\n(\n857\n)\nInternational\nCurrent income taxes\n1,588\n \n1,142\n \n4,368\n \nDeferred income taxes\n100\n \n(\n652\n)\n(\n183\n)\nTotal international tax provision/(benefit)\n1,689\n \n490\n \n4,185\n \nProvision/(benefit) for taxes on income\n$\n(\n28\n)\n$\n(\n1,115\n)\n$\n3,328\n \nPfizer Inc.\n2024 Form 10-K\n71\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nThe changes in \nProvision/(benefit) for taxes on income\n impacting the effective tax rate year-over-year are summarized below:\n2024 v. 2023\nThe tax benefit of $\n28\n million for 2024 compared to the tax benefit of $\n1.1\n billion for 2023 was primarily a result of changes in the jurisdictional mix of earnings partially offset by a tax benefit related to the Transition Tax liability under the TCJA.\n2023 v. 2022\nThe tax benefit of $\n1.1\n billion for 2023 compared to the tax provision of $\n3.3\n billion for 2022 was primarily a result of changes in the jurisdictional mix of earnings and the resolution of uncertain tax positions in various markets. The 2023 pre-tax income included a greater percentage of expenses taxed at higher rates as compared to the 2022 pre-tax income, resulting in a 2023 tax benefit compared to the 2022 tax provision. These expenses included amortization expense, acquisition-related costs, restructuring charges and intangible asset impairment charges. The tax benefit for 2023 and the tax provision for 2022 included tax benefits related to global income tax resolutions in multiple tax jurisdictions spanning multiple tax years. The tax provision for 2022 also included the closing of U.S. IRS audits covering five tax years.\nIn\n all \nyears, federal, state and international net tax liabilities assumed or established as part of a business acquisition are not included in \nProvision/(benefit) for taxes on income\n (see \nNote 2A\n).\nWe elected, with the filing of our 2018 U.S. Federal Consolidated Income Tax Return, to pay our initial estimated $\n15\n billion repatriation tax liability on accumulated post-1986 foreign earnings (Transition Tax liability) over eight years through 2026. The sixth annual installment was paid by its April 15, 2024 due date. The seventh annual installment is due April 15, 2025 and is reported in current \nIncome taxes payable \nas of December 31, 2024. The remaining liability is reported in noncurrent \nOther taxes payable.\n Our obligations may vary due to the availability of attributes such as foreign tax and other credit carryforwards or carrybacks.\nCash paid for income taxes, net of refunds, consisted of:\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nUnited States\n$\n2,593\n \n$\n1,923\n \n$\n3,867\n \nInternational\n1,012\n \n1,224\n \n4,000\n \nTotal\n$\n3,605\n \n$\n3,147\n \n$\n7,867\n \nB. Tax Rate Reconciliation\nThe reconciliation of the U.S. statutory income tax rate to our effective tax rate for \nIncome from continuing operations\n follows:\n \nYear Ended December 31, \n2024\n2023\n^\n2022\nU.S. statutory income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nTaxation of non-U.S. operations\n(a), (b)\n(\n7.9\n)\n(\n21.1\n)\n(\n5.0\n)\nTransition Tax liability\n(c)\n(\n6.0\n)\n—\n \n—\n \nTax settlements and resolution of certain tax positions\n(c)\n(\n2.4\n)\n(\n40.3\n)\n(\n3.0\n)\nForeign-Derived Intangible Income deduction\n(d)\n(\n1.2\n)\n(\n33.1\n)\n(\n1.9\n)\nState & local taxes\n(e)\n(\n2.5\n)\n(\n22.4\n)\n—\n \nCharitable contributions\n(\n1.7\n)\n(\n7.3\n)\n(\n0.5\n)\nU.S. R&D tax credit\n(\n1.8\n)\n(\n15.8\n)\n(\n0.6\n)\nInterest\n(f)\n2.2\n \n13.5\n \n0.2\n \nAll other, net\n(g)\n0.1\n \n0.2\n \n(\n0.6\n)\nEffective tax rate for income from continuing operations\n(\n0.4\n)\n%\n(\n105.4\n)\n%\n9.6\n \n%\n^\n \nThe higher rate percentages for the 2023 reconciling items are significantly impacted by the lower domestic and international \nIncome from continuing operations before provision/(benefit) for taxes on income\n (see \nNote 5A\n)\n.\n(a)\nFor taxation of non-U.S. operations, this rate impact reflects the income tax rates and relative earnings in the locations where we do business outside the U.S., together with the U.S. tax cost on our international operations, changes in uncertain tax positions not included in the reconciling item called “Tax settlements and resolution of certain tax positions,” as well as changes in valuation allowances. Specifically: (i) the jurisdictional location of earnings is a significant component of our effective tax rate each year, and the rate impact of this component is influenced by the specific location of non-U.S. earnings and the level of such earnings as compared to our total earnings; (ii) the U.S. tax implications of our foreign operations is a significant component of our effective tax rate each year and generally offsets some of the reduction to our effective tax rate each year resulting from the jurisdictional location of earnings; (iii) the impact of certain tax initiatives; and (iv) the impact of changes in uncertain tax positions not included in the reconciling item called “Tax settlements and resolution of certain tax positions” is a component of our effective tax rate each year that can result in either an increase or decrease to our effective tax rate. The jurisdictional mix of earnings, which includes the impact of the location of earnings as well as the U.S. tax cost on our international operations, can vary as a result of operating fluctuations in the normal course of business and as a result of the extent and location of other income and expense items, such as restructuring charges, asset impairments and gains and losses on strategic business decisions. See also \nNote 5A\n \nfor the components of pre-tax income and \nProvision/(benefit) for taxes on income, \nwhich is based on the location of the taxing authorities, and for information about settlements and other items impacting \nProvision/(benefit) for taxes on income\n.\n(b)\nIn all years, the reduction in our effective tax rate is a result of the jurisdictional location of earnings and is largely due to lower tax rates in certain jurisdictions, as well as manufacturing and other incentives for our subsidiaries in Singapore and, to a lesser extent, in Puerto Rico. We have Puerto Rican tax incentives pursuant to a grant that expires during 2053. Under such grant, we are partially exempt from income, property and municipal taxes. In Singapore, we have incentive tax rates effective through 2048 on income from manufacturing and other operations.\nPfizer Inc.\n2024 Form 10-K\n72\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\n(c)\nSee \nNote 5A\n.\n(d)\nThe higher rate benefit from the Foreign-Derived Intangible Income deduction in 2022 is mainly the result of the TCJA requirement to capitalize R&D costs for tax years beginning after December 31, 2021.\n(e)\nIncludes the impact of U.S. state and local taxes and changes in the state valuation allowances including those related to the acquisition of Seagen.\n(f)\nIncludes changes in interest related to our uncertain tax positions not included in the reconciling item called “Tax settlements and resolution of certain tax positions”.\n(g)\nAll other, net is primarily due to routine business operations.\nC. Deferred Taxes\nComponents of our deferred tax assets and liabilities, shown before jurisdictional netting, follow:\n2024 Deferred Tax^\n2023 Deferred Tax^\n(MILLIONS)\nAssets\n(Liabilities)\nAssets\n(Liabilities)\nPrepaid/deferred items\n(a)\n$\n2,988\n \n$\n(\n847\n)\n$\n2,658\n \n$\n(\n654\n)\nAccrued/deferred royalties\n1,306\n \n—\n \n1,655\n \n— \nDeferred revenues\n300\n \n—\n \n471\n \n— \nInventories\n(b)\n992\n \n(\n702\n)\n1,210\n \n(\n1,060\n)\nIntangible assets\n(c)\n1,435\n \n(\n9,066\n)\n1,526\n \n(\n11,605\n)\nProperty, plant and equipment\n265\n \n(\n1,751\n)\n168\n \n(\n2,039\n)\nEmployee benefits\n(d)\n1,002\n \n(\n274\n)\n1,085\n \n(\n287\n)\nRestructurings and other charges\n462\n \n—\n \n537\n \n— \nLegal and product liability reserves\n378\n \n—\n \n430\n \n— \nResearch and development\n(e)\n7,635\n \n—\n \n6,275\n \n— \nNet operating loss/tax credit carryforwards\n(f)\n2,028\n \n—\n \n2,708\n \n— \nUnremitted earnings\n—\n \n(\n69\n)\n— \n(\n60\n)\nState and local tax adjustments\n161\n \n—\n \n119\n \n— \nInvestments\n73\n \n(\n248\n)\n133\n \n(\n395\n)\nAll other\n87\n \n(\n66\n)\n62\n \n(\n72\n)\n19,112\n \n(\n13,023\n)\n19,037\n \n(\n16,172\n)\nValuation allowances\n(\n1,638\n)\n—\n \n(\n1,738\n)\n— \nTotal deferred taxes\n$\n17,474\n \n$\n(\n13,023\n)\n$\n17,299\n \n$\n(\n16,172\n)\nNet deferred tax asset/(liability)\n(g), (h)\n$\n4,451\n \n$\n1,128\n \n^\n \nThe deferred tax assets and liabilities associated with global intangible low-taxed income are included in the relevant categories. See \nNote 1Q\n. \n(a)\nThe increase in net deferred tax assets in 2024 is primarily related to temporary differences associated with the timing of accruals recorded in the ordinary course of business.\n(b)\nThe increase in net deferred tax assets in 2024 is primarily due to measurement period adjustments of inventories related to Seagen. See\n \nNote\n \n2A\n.\n(c)\nThe decrease in net deferred tax liabilities in 2024 is primarily due to amortization of intangible assets and certain impairment charges, as well as the measurement period adjustments of intangible assets related to Seagen.\n(d)\nThe decrease in net deferred tax assets in 2024 is primarily due to changes in pension and postretirement benefit obligations, as well as the performance of plan assets reported in the period. See \nNote 11\n.\n(e)\nThe increase in deferred tax assets in 2024 is primarily related to the TCJA requirement to capitalize R&D costs for tax years beginning after December 31, 2021.\n(f)\nThe amounts in 2024 and 2023 are reduced for unrecognized tax benefits of $\n575\n million and $\n1.3\n billion, respectively, where we have net operating loss carryforwards, similar tax losses, and/or tax credit carryforwards that are available, under the tax law of the applicable jurisdiction, to settle any additional income taxes that would result from the disallowance of a tax position.\n(g)\nIn 2024, \nNoncurrent deferred tax assets and other noncurrent tax assets\n ($\n6.6\n billion), and \nNoncurrent deferred tax liabilities\n ($\n2.1\n billion). In 2023, \nNoncurrent deferred tax assets and other noncurrent tax assets\n ($\n1.8\n billion), and \nNoncurrent deferred tax liabilities\n ($\n640\n million).\n(h)\nExcludes indefinite- and definite-lived deferred tax assets for certain non-U.S. tax losses and interest carryforwards and U.S. state general business credits,  totaling $\n11.3\n billion and $\n11.1\n billion for 2024 and 2023 respectively, given that management has determined based on applicable accounting rules that it is remote that these tax attributes will be utilized.\nWe have carryforwards, primarily related to net operating and capital losses, general business credits, foreign tax credits and charitable contributions, which are available to reduce future U.S. federal and/or state, as well as international, income taxes payable with either an indefinite life or expiring at various times from 2025 to 2044. Certain of our U.S. net operating losses and general business credits are subject to limitations under IRC Section 382.\nAs of December 31, 2024, we have not made a U.S. tax provision on $\n58.0\n billion\n of unremitted earnings of our international subsidiaries. As these earnings are intended to be indefinitely reinvested overseas, the determination of a hypothetical unrecognized deferred tax liability as of December 31, 2024 is not practicable. The amount of indefinitely reinvested earnings is based on estimates and assumptions and subject to management evaluation, and is subject to change in the normal course of business based on operational cash flow, completion of local statutory financial statements and the finalization of tax returns and audits, among other things. Accordingly, we regularly update our earnings and profits analysis for such events.\nD. Tax Contingencies\nFor a description of our accounting policies associated with accounting for income tax contingencies, see \nNote 1Q\n.\nPfizer Inc.\n2024 Form 10-K\n73\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nUncertain Tax Positions\nAs tax law is complex and often subject to varied interpretations, it is uncertain whether some of our tax positions will be sustained upon audit. As of December 31, 2024, we had\n \n$\n2.0\n billion and as of December 31, 2023, we had $\n3.1\n billion in net unrecognized tax benefits, excluding associated interest.\n•\nTax assets for uncertain tax positions represent our estimate of the potential tax benefits in one tax jurisdiction that could result from the payment of income taxes in another tax jurisdiction. These potential benefits generally result from cooperative efforts among taxing authorities, as required by tax treaties to minimize double taxation, commonly referred to as the competent authority process. The recoverability of these assets, which we believe to be more likely than not, is dependent upon the actual payment of taxes in one tax jurisdiction and, in some cases, the successful petition for recovery in another tax jurisdiction. In 2024, tax assets for uncertain tax positions also include the expected filing of an amended income tax return relating to the Transition Tax liability under the TCJA. As of December 31, 2024, we had $\n2.5\n billion in assets associated with uncertain tax positions mainly included in \nNoncurrent deferred tax assets and other noncurrent tax assets\n. As of December 31, 2023, we had $\n1.7\n billion in assets associated with uncertain tax positions mainly included in \nNoncurrent deferred tax assets and other noncurrent tax assets\n.\n•\nThe majority of these unrecognized tax benefits, if recognized, would impact our effective income tax rate. \nThe reconciliation of the beginning and ending amounts of gross unrecognized tax benefits follows:\n(MILLIONS)\n2024\n2023\n2022\nBalance, beginning\n$\n(\n4,802\n)\n$\n(\n4,494\n)\n$\n(\n6,068\n)\nAcquisitions\n8\n \n(\n46\n)\n(\n52\n)\nIncreases based on tax positions taken during a prior period\n(a), (b)\n(\n934\n)\n(\n158\n)\n(\n67\n)\nDecreases based on tax positions taken during a prior period\n(a), (c)\n599\n \n310\n \n1,339\n \nDecreases based on settlements for a prior period\n(c), (d)\n911\n \n85\n \n842\n \nIncreases based on tax positions taken during the current period\n(a)\n(\n433\n)\n(\n515\n)\n(\n701\n)\nImpact of foreign exchange\n52\n \n(\n44\n)\n90\n \nOther, net\n(a), (e)\n70\n \n58\n \n122\n \nBalance, ending\n(f)\n$\n(\n4,530\n)\n$\n(\n4,802\n)\n$\n(\n4,494\n)\n(a)\nPrimarily included in \nProvision/(benefit) for taxes on income.\n(b)\nIn 2024, the amount includes a gross unrecognized tax benefit associated with the expected filing of an amended income tax return related to the Transition Tax liability under the TCJA.\n(c)\nPrimarily related to effectively settling certain issues with the U.S. and foreign tax authorities. See \nNot\ne 5A\n.\n(d)\nPrimarily related to cash payments and reductions of tax attributes.\n(e)\nPrimarily related to decreases as a result of a lapse of applicable statutes of limitations.\n(f)\nIn 2024, included in \nIncome taxes payable\n ($\n103\n million),\n Other current assets\n ($\n0.4\n million), \nNoncurrent deferred tax assets and other noncurrent tax assets\n ($\n1.5\n billion), \nNoncurrent deferred tax liabilities\n ($\n3\n million) and \nOther taxes payable\n ($\n2.9\n billion). In 2023, included in \nIncome taxes payable\n ($\n94\n million),\n Other current assets\n ($\n1\n million), \nNoncurrent deferred tax assets and other noncurrent tax assets\n ($\n1.3\n billion), \nNoncurrent deferred tax liabilities\n ($\n4\n million) and \nOther taxes payable\n ($\n3.4\n billion).\n•\nInterest related to our unrecognized tax benefits is recorded in accordance with the laws of each jurisdiction and is recorded primarily in \nProvision/(benefit) for taxes on income\n. In 2024, we recorded a net increase in interest of $\n91\n million. In 2023, we recorded a net increase in interest of $\n64\n million. In 2022, we recorded a net decrease in interest of $\n17\n million. Gross accrued interest totaled $\n636\n million as of December 31, 2024 (reflecting a decrease of $\n56\n million as a result of cash payments) and gross accrued interest totaled $\n605\n million as of December 31, 2023 (reflecting a decrease of $\n11\n million as a result of cash payments). In 2024 and 2023, these amounts were substantially all included in \nOther taxes payable. \nAccrued penalties are not significant. See also \nNote 5A\n.\nStatus of Tax Matters and Potential Impact on Accruals for Uncertain Tax Positions\nThe U.S. is one of our major tax jurisdictions, and we are regularly audited by the IRS. During the third quarter of 2024, we effectively settled the audit of Pfizer’s federal income tax returns for years 2016-2018. \nTax years 2019-2024 are open but not under audit. All other tax years are closed. In addition to the open audit years in the U.S., we have open audit years and certain related audits, appeals and investigations in certain major international tax jurisdictions such as \nCanada (2017-2024), Europe (2012-2024, primarily in Ireland, the U.K., France, Italy, Spain and Germany), Asia Pacific (2014-2024, primarily in Australia, China, Japan and Singapore) and Latin America (1998-2024, primarily in Brazil).\nAny settlements or statutes of limitations expirations could result in a significant decrease in our uncertain tax positions. We estimate that it is reasonably possible that within the next 12 months, our gross unrecognized tax benefits, exclusive of interest, could decrease by as much as $\n200\n million, as a result of settlements with taxing authorities or the expiration of the statutes of limitations. Our assessments are based on estimates and assumptions that have been deemed reasonable by management, but our estimates of unrecognized tax benefits and potential tax benefits may not be representative of actual outcomes, and variation from such estimates could materially affect our financial statements in the period of settlement or when the statutes of limitations expire, as we treat these events as discrete items in the period of resolution. Finalizing audits with the relevant taxing authorities can include formal administrative and legal proceedings, and, as a result, it is difficult to estimate the timing and range of possible changes related to our uncertain tax positions, and such changes could be significant.\nPfizer Inc.\n2024 Form 10-K\n74\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nE. Tax Provision/(Benefit) on Other Comprehensive Income/(Loss)\nComponents of the \nTax provision/(benefit) on other comprehensive income/(loss) \ninclude:\n \nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nForeign currency translation adjustments, net\n(a)\n$\n156\n \n$\n(\n33\n)\n$\n(\n126\n)\nUnrealized holding gains/(losses) on derivative financial instruments, net\n96\n \n111\n \n183\n \nReclassification adjustments for (gains)/losses included in net income\n(\n29\n)\n(\n93\n)\n(\n270\n)\n \n67\n \n18\n \n(\n87\n)\nUnrealized holding gains/(losses) on available-for-sale securities, net\n(\n19\n)\n(\n15\n)\n(\n164\n)\nReclassification adjustments for (gains)/losses included in net income\n5\n \n(\n18\n)\n226\n \n \n(\n14\n)\n(\n33\n)\n62\n \nBenefit plans: prior service (costs)/credits and other, net\n45\n \n(\n5\n)\n(\n5\n)\nReclassification adjustments related to amortization of prior service costs and other, net\n(\n26\n)\n(\n28\n)\n(\n29\n)\nReclassification adjustments related to curtailments of prior service costs and other, net\n2\n \n(\n4\n)\n(\n3\n)\n \n22\n \n(\n37\n)\n(\n37\n)\nTax provision/(benefit) on other comprehensive income/(loss)\n$\n231\n \n$\n(\n85\n)\n$\n(\n187\n)\n(a)\nTaxes are not provided for foreign currency translation adjustments relating to investments in international subsidiaries that are expected to be held indefinitely.\nNote 6. \nAccumulated Other Comprehensive Loss, Excluding Noncontrolling Interests\nThe following summarizes the changes, net of tax, in \nAccumulated other comprehensive loss\n:\nNet Unrealized Gains/(Losses)\nBenefit Plans\n(MILLIONS)\nForeign Currency Translation Adjustments\n(a)\nDerivative Financial Instruments\nAvailable-For-Sale Securities\nPrior Service (Costs)/Credits and Other\nAccumulated Other Comprehensive Income/(Loss)\nBalance, January 1, 2022\n$\n(\n6,172\n)\n$\n119\n \n$\n(\n220\n)\n$\n377\n \n$\n(\n5,897\n)\nOther comprehensive income/(loss)\n(b)\n(\n2,188\n)\n(\n531\n)\n440\n \n(\n129\n)\n(\n2,407\n)\nBalance, December 31, 2022\n(\n8,360\n)\n(\n412\n)\n220\n \n248\n \n(\n8,304\n)\nOther comprehensive income/(loss)\n(b)\n497\n \n195\n \n(\n229\n)\n(\n120\n)\n343\n \nBalance, December 31, 2023\n(\n7,863\n)\n(\n217\n)\n(\n9\n)\n128\n \n(\n7,961\n)\nOther comprehensive income/(loss)\n(b)\n(\n121\n)\n274\n \n(\n97\n)\n63\n \n118\n \nBalance, December 31, 2024\n$\n(\n7,984\n)\n$\n57\n \n$\n(\n106\n)\n$\n191\n \n$\n(\n7,842\n)\n(a)\nAmounts do not include foreign currency translation adjustments attributable to noncontrolling interests. \n(b)\nForeign currency translation adjustments include net gains/(losses) related to the impact of our net investment hedging program and gains/(losses) related to our investment in Haleon (see \nNote 2C\n).\nPfizer Inc.\n2024 Form 10-K\n75\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nNote 7. \nFinancial Instruments\nA. Fair Value Measurements\nFinancial Assets and Liabilities Measured at Fair Value on a Recurring Basis and Fair Value Hierarchy, using a Market Approach:\nAs of December 31, 2024\nAs of December 31, 2023\n(MILLIONS)\nTotal\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nFinancial assets:\nShort-term investments\nEquity securities with readily determinable fair value\n(a)\n$\n7,848\n \n$\n6,456\n \n$\n1,392\n \n$\n5,124\n \n$\n—\n \n$\n5,124\n \nAvailable-for-sale debt securities:\nGovernment and agency—non-U.S.\n6,855\n \n—\n \n6,855\n \n817\n \n—\n \n817\n \nGovernment and agency—U.S.\n2,853\n \n—\n \n2,853\n \n2,601\n \n—\n \n2,601\n \nCorporate and other\n1,173\n \n—\n \n1,173\n \n982\n \n—\n \n982\n \n10,881\n \n—\n \n10,881\n \n4,400\n \n—\n \n4,400\n \nTotal short-term investments\n18,729\n \n6,456\n \n12,273\n \n9,524\n \n—\n \n9,524\n \nOther current assets\nDerivative assets:\nForeign exchange contracts\n1,056\n \n—\n \n1,056\n \n298\n \n—\n \n298\n \nTotal other current assets\n1,056\n \n—\n \n1,056\n \n298\n \n—\n \n298\n \nLong-term investments\nEquity securities with readily determinable fair values\n(b)\n1,246\n \n1,246\n \n—\n \n2,779\n \n2,772\n \n7\n \nAvailable-for-sale debt securities:\nGovernment and agency—non-U.S.\n—\n \n—\n \n—\n \n124\n \n—\n \n124\n \nCorporate and other\n—\n \n—\n \n—\n \n26\n \n—\n \n26\n \n—\n \n—\n \n—\n \n150\n \n—\n \n150\n \nTotal long-term investments\n1,246\n \n1,246\n \n—\n \n2,929\n \n2,772\n \n156\n \nOther noncurrent assets\nDerivative assets:\nInterest rate contracts\n13\n \n—\n \n13\n \n144\n \n—\n \n144\n \nForeign exchange contracts\n447\n \n—\n \n447\n \n258\n \n—\n \n258\n \nTotal derivative assets\n460\n \n—\n \n460\n \n402\n \n—\n \n402\n \nInsurance contracts\n(c)\n875\n \n—\n \n875\n \n790\n \n—\n \n790\n \nTotal other noncurrent assets\n1,335\n \n—\n \n1,335\n \n1,191\n \n—\n \n1,191\n \nTotal assets\n$\n22,366\n \n$\n7,701\n \n$\n14,665\n \n$\n13,943\n \n$\n2,772\n \n$\n11,170\n \nFinancial liabilities:\nOther current liabilities\nDerivative liabilities:\nInterest rate contracts\n$\n28\n \n$\n—\n \n$\n28\n \n$\n16\n \n$\n—\n \n$\n16\n \nForeign exchange contracts\n217\n \n—\n \n217\n \n404\n \n—\n \n404\n \nTotal other current liabilities\n245\n \n—\n \n245\n \n420\n \n—\n \n420\n \nOther noncurrent liabilities\nDerivative liabilities:\nInterest rate contracts\n397\n \n—\n \n397\n \n275\n \n—\n \n275\n \nForeign exchange contracts\n723\n \n—\n \n723\n \n725\n \n—\n \n725\n \nTotal other noncurrent liabilities\n1,121\n \n—\n \n1,121\n \n1,000\n \n—\n \n1,000\n \nTotal liabilities\n$\n1,366\n \n$\n—\n \n$\n1,366\n \n$\n1,420\n \n$\n—\n \n$\n1,420\n \n(a)\nIncludes money market funds. As of December 31, 2024, short-term equity securities include our investment in Haleon of $\n6.5\n billion. See \nNote 2C\n.\n(b)\nLong-term equity securities of $\n133\n million as of December 31, 2024 and $\n130\n million as of December 31, 2023 were held in restricted trusts for U.S. non-qualified employee benefit plans.\n(c)\nIncludes life insurance policies held in restricted trusts for U.S. non-qualified employee benefit plans. The underlying invested assets in these contracts are marketable securities, which are carried at fair value, with changes in fair value recognized in \nOther (income)/deductions—net\n (see \nNote 4\n)\n.\nFinancial Assets and Liabilities Not Measured at Fair Value on a Recurring Basis––\nThe carrying value of Long-term debt, excluding the current portion was $\n57\n billion as of December 31, 2024 and $\n62\n billion as of December 31, 2023. The estimated fair value of such debt, using a market approach and Level 2 inputs, was $\n54\n billion as of December 31, 2024 and $\n61\n billion as of December 31, 2023.\nThe differences between the estimated fair values and carrying values of held-to-maturity debt securities, private equity securities, long-term receivables and short-term borrowings not measured at fair value on a recurring basis were not significant as of December 31, 2024 and 2023. The fair value measurements of our held-to-maturity debt securities and short-term borrowings are based on Level 2 inputs. The fair value measurements of our long-term receivables and private equity securities are based on Level 3 inputs.\nPfizer Inc.\n2024 Form 10-K\n76\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nB. Investments\nTotal Short-Term, Long-Term and Equity-Method Investments\nThe following summarizes our investments by classification type:\nAs of December 31,\n(MILLIONS)\n2024\n2023\nShort-term investments\nEquity securities with readily determinable fair values\n(a)\n$\n7,848\n \n$\n5,124\n \nAvailable-for-sale debt securities\n10,881\n \n4,400\n \nHeld-to-maturity debt securities\n705\n \n313\n \nTotal Short-term investments\n$\n19,434\n \n$\n9,837\n \nLong-term investments\nEquity securities with readily determinable fair values\n(b)\n$\n1,246\n \n$\n2,779\n \nAvailable-for-sale debt securities\n—\n \n150\n \nHeld-to-maturity debt securities\n45\n \n47\n \nPrivate equity securities at cost\n(b)\n719\n \n755\n \nTotal Long-term investments\n$\n2,010\n \n$\n3,731\n \nEquity-method investments\n(a)\n217\n \n11,637\n \nTotal long-term investments and equity-method investments\n$\n2,228\n \n$\n15,368\n \nHeld-to-maturity cash equivalents\n$\n184\n \n$\n207\n \n(a)\nAs of December 31, 2024, our investment in Haleon is reported in \nShort-term investments\n and as of December 31, 2023 was reported in \nEquity-method investments\n. See \nNote 2C\n. Short term equity securities as of December 31, 2024 include and as of December 31, 2023 represent money market funds primarily invested in U.S. Treasury and government debt.\n(b)\nRepresent investments in the life sciences sector.\nDebt Securities\nOur investment portfolio consists of investment-grade debt securities issued across diverse governments, corporate and financial institutions:\nAs of December 31, 2024\nAs of December 31, 2023\nGross Unrealized\nMaturities (in Years)\nGross Unrealized\n(MILLIONS)\nAmortized Cost\nGains\nLosses\nFair Value\nWithin 1\nOver 1\nto 5\nOver 5\nAmortized Cost\nGains\nLosses\nFair Value\nAvailable-for-sale debt securities\nGovernment and agency\n––\nnon-U.S.\n$\n6,970\n \n$\n8\n \n$\n(\n123\n)\n$\n6,855\n \n$\n6,855\n \n$\n—\n \n$\n—\n \n$\n953\n \n$\n2\n \n$\n(\n14\n)\n$\n941\n \nGovernment and agency\n––\nU.S.\n2,853\n \n—\n \n—\n \n2,853\n \n2,853\n \n—\n \n—\n \n2,601\n \n—\n \n—\n \n2,601\n \nCorporate and other\n1,179\n \n—\n \n(\n6\n)\n1,173\n \n1,173\n \n—\n \n—\n \n1,006\n \n4\n \n(\n2\n)\n1,007\n \nHeld-to-maturity debt securities\nTime deposits and other\n697\n \n—\n \n—\n \n697\n \n657\n \n21\n \n19\n \n561\n \n—\n \n—\n \n561\n \nGovernment and agency\n––\nnon-U.S.\n237\n \n—\n \n—\n \n237\n \n232\n \n4\n \n1\n \n4\n \n—\n \n—\n \n4\n \nTotal debt securities\n$\n11,935\n \n$\n8\n \n$\n(\n129\n)\n$\n11,814\n \n$\n11,770\n \n$\n25\n \n$\n20\n \n$\n5,126\n \n$\n6\n \n$\n(\n16\n)\n$\n5,115\n \nAny expected credit losses to these portfolios would be immaterial to our financial statements.\nEquity Securities\nThe following presents the calculation of the portion of unrealized (gains)/losses that relates to equity securities, excluding equity-method investments, held at the reporting date:\nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2022\nNet (gains)/losses recognized during the period on equity securities\n(a)\n$\n(\n1,008\n)\n$\n(\n1,590\n)\n$\n1,273\n \nLess: Net (gains)/losses recognized during the period on equity securities sold during the period\n(\n1,122\n)\n(\n1,754\n)\n(\n126\n)\nNet unrealized (gains)/losses during the reporting period on equity securities still held at the reporting date\n(b)\n$\n114\n \n$\n165\n \n$\n1,400\n \n(a)\nReported in \nOther (income)/deductions\n––\nnet\n. See \nNote 4\n.\n(b)\nIncluded in net unrealized (gains)/losses are observable price changes on equity securities without readily determinable fair values. As of December 31, 2024, there were cumulative impairments and downward adjustments of $\n360\n million and upward adjustments of $\n222\n million. Impairments, downward and upward adjustments were not material to our operations in 2024, 2023 and 2022\n.\nPfizer Inc.\n2024 Form 10-K\n77\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nC. Short-Term Borrowings\nShort-term borrowings include:\nAs of December 31,\n(MILLIONS)\n2024\n2023\nCommercial paper, principal amount\n(a)\n$\n2,453\n \n$\n7,965\n \nCurrent portion of long-term debt, principal amount\n3,750\n \n2,250\n \nOther short-term borrowings, principal amount\n(b)\n755\n \n252\n \nTotal short-term borrowings, principal amount\n6,957\n \n10,467\n \nNet fair value adjustments related to hedging and purchase accounting\n—\n \n5\n \nNet unamortized discounts, premiums and debt issuance costs\n(\n12\n)\n(\n121\n)\nTotal \nShort-term borrowings, including current portion of long-term debt\n, carried at historical proceeds, as adjusted\n$\n6,946\n \n$\n10,350\n \n(a)\nIssued in the fourth quarter of 2023 as part of the financing for our acquisition of Seagen (see \nNote 2A\n). The weighted-average effective interest rate on commercial paper outstanding was approximately \n4.94\n%\n \nas of December 31, 2024 and \n5.37\n% as of December 31, 2023. \n(b)\nPrimarily includes cash collateral. See \nNote 7F\n.\nAs of December 31, 2024, we had access to a total of $\n15\n billion in committed U.S. revolving credit facilities, consisting of an $\n8\n billion facility maturing in October 2025 (subsequently terminated by Pfizer in February 2025), and a $\n7\n billion facility maturing in October 2029, which may be used for general corporate purposes including to support our global commercial paper borrowings. In addition to the U.S. revolving credit facilities, our lenders have provided us an additional $\n276\n million in lines of credit, of which $\n243\n million expire within one year. Essentially all lines of credit were unused as of December 31, 2024.\n \nD. Long-Term Debt\nThe following outlines our senior unsecured long-term debt\n(a)\n and the weighted-average stated interest rate by maturity:\nAs of December 31,\n(MILLIONS)\n2024\n2023\nNotes due 2025 (\n3.9\n% for 2023)\n(b)\n$\n—\n \n$\n3,750\n \nNotes due 2026 (\n3.7\n% for 2024 and 2023)\n6,000\n \n6,000\n \nNotes due 2027 (\n2.2\n% for 2024 and \n2.1\n% for 2023)\n980\n \n1,029\n \nNotes due 2028 (\n4.6\n% for 2024 and 2023)\n5,660\n \n5,660\n \nNotes due 2029 (\n3.5\n% for 2024 and 2023)\n1,750\n \n1,750\n \nNotes due 2030 (\n3.6\n% for 2024 and 2023)\n5,250\n \n5,250\n \nNotes due 2031-2035 (\n4.5\n% for 2024 and 2023)\n6,750\n \n6,750\n \nNotes due 2036-2040 (\n5.4\n% for 2024 and 2023)\n9,534\n \n9,543\n \nNotes due 2041-2045 (\n4.3\n% for 2024 and 2023)\n6,474\n \n6,501\n \nNotes due 2046-2050 (\n3.7\n% for 2024 and 2023)\n4,750\n \n4,750\n \nNotes due 2051-2063 (\n5.3\n% for 2024 and 2023)\n10,000\n \n10,000\n \nTotal long-term debt, principal amount\n57,147\n \n60,982\n \nNet fair value adjustments related to hedging and purchase accounting\n701\n \n1,039\n \nNet unamortized discounts, premiums and debt issuance costs\n(\n444\n)\n(\n483\n)\nTotal long-term debt, carried at historical proceeds, as adjusted\n$\n57,405\n \n$\n61,538\n \nCurrent portion of long-term debt, carried at historical proceeds, as adjusted (not included above (\n3.9\n% for 2024 and 2023))\n$\n3,747\n \n$\n2,254\n \n(a)\nOur long-term debt is generally redeemable by us at any time at varying redemption prices plus accrued and unpaid interest.\n(b)\nReclassified to the current portion of long-term debt.\nIssuance—\nIn May 2023, we issued, through our wholly-owned finance subsidiary, PIE, $\n31\n billion principal amount of senior unsecured notes at an effective interest rate of \n4.93\n% as part of the financing for our acquisition of Seagen. The notes are fully and unconditionally guaranteed on a senior unsecured basis by Pfizer Inc. PIE was formed to finance a portion of the consideration for the acquisition of Seagen and has no assets or operations, and will have no assets or operations, other than as related to the issuance, administration and repayment of the notes and any other debt securities that it may issue in the future.\nE. Derivative Financial Instruments and Hedging Activities\nForeign Exchange Risk––\nA significant portion of our revenues, earnings and net investments in foreign affiliates is exposed to changes in foreign exchange rates. Where foreign exchange risk is not offset by other exposures, we manage our foreign exchange risk principally through the use of derivative financial instruments and foreign currency debt. These financial instruments serve to mitigate the impact on net income as a result of remeasurement into another currency, or against the impact of translation into U.S. dollars of certain foreign exchange-denominated transactions.\nThe derivative financial instruments primarily hedge or offset exposures in the euro, U.K. pound, Chinese renminbi, Japanese yen, Canadian dollar and Swedish krona, and include a portion of our forecasted foreign exchange-denominated intercompany inventory sales hedged up to \ntwo years\n. We may seek to protect against possible declines in the reported net investments of our foreign business entities.\nPfizer Inc.\n2024 Form 10-K\n78\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nChanges in fair value are reported in earnings or in \nOther comprehensive income/(loss)\n, depending on the nature and purpose of the financial instrument (hedge or offset relationship). For certain foreign exchange contracts, we exclude an amount from the assessment of hedge effectiveness and recognize the excluded amount through an amortization approach in earnings. The hedge relationships are as follows: \n•\nGenerally, we recognize the gains and losses on foreign exchange contracts that are designated as fair value hedges in earnings upon the recognition of the change in fair value of the hedged item. We also recognize the offsetting foreign exchange impact attributable to the hedged item in earnings.\n•\nGenerally, we record in \nOther comprehensive income/(loss)\n gains or losses on foreign exchange contracts that are designated as cash flow hedges and reclassify those amounts into earnings in the same period or periods during which the hedged transaction affects earnings. \n•\nWe record in \nOther comprehensive income/(loss)––Foreign currency translation adjustments, net \nthe foreign exchange gains and losses related to foreign exchange-denominated debt and foreign exchange contracts designated as a hedge of our net investments in foreign subsidiaries and reclassify those amounts into earnings upon the sale or substantial liquidation of our net investments. \n•\nFor foreign exchange contracts not designated as hedging instruments, we recognize the gains and losses immediately into earnings along with the earnings impact of the items they generally offset. These contracts take the opposite currency position of that reflected on the balance sheet to counterbalance the effect of any currency movement.\nInterest Rate Risk––\nOur interest-bearing investments and borrowings are subject to interest rate risk. Depending on market conditions, we may change the profile of our outstanding debt or investments by entering into derivative financial instruments like interest rate swaps, either to hedge or offset the exposure to changes in the fair value of hedged items with fixed interest rates, or to convert variable rate debt or investments to fixed rates. The derivative financial instruments primarily hedge U.S. dollar fixed-rate debt.\nWe recognize the change in fair value on interest rate contracts that are designated as fair value hedges in earnings, as well as the offsetting earnings impact of the hedged risk attributable to the hedged item.\nThe following summarizes the fair value of the derivative financial instruments and notional amounts:\n(MILLIONS)\nAs of December 31, 2024\nAs of December 31, 2023\nFair Value\nFair Value\nNotional\nAsset\nLiability\nNotional\nAsset\nLiability\nDerivatives designated as hedging instruments:\nForeign exchange contracts\n(a)\n$\n23,991\n \n$\n1,250\n \n$\n719\n \n$\n18,750\n \n$\n403\n \n$\n916\n \nInterest rate contracts\n6,750\n \n13\n \n425\n \n6,750\n \n144\n \n290\n \n1,263\n \n1,144\n \n546\n \n1,206\n \nDerivatives not designated as hedging instruments:\nForeign exchange contracts\n$\n26,335\n \n253\n \n221\n \n$\n25,609\n \n154\n \n214\n \nTotal\n$\n1,516\n \n$\n1,366\n \n$\n700\n \n$\n1,420\n \n(a)\nThe notional amount of outstanding foreign exchange contracts hedging our intercompany forecasted inventory sales was $\n5.0\n billion as of December 31, 2024 and $\n4.9\n billion as of December 31, 2023.\nPfizer Inc.\n2024 Form 10-K\n79\nNotes to Consolidated Financial Statements\nPfizer Inc. and Subsidiary Companies\nThe following summarizes information about the gains/(losses) incurred to hedge or offset operational foreign exchange or interest rate risk exposures:\n \nGains/(Losses)\nRecognized in OID\n(a)\nGains/(Losses)\nRecognized in OCI\n(a)\nGains/(Losses)\nReclassified from\nOCI into OID and COS\n(a) \nYear Ended December 31,\n(MILLIONS)\n2024\n2023\n2024\n2023\n2024\n2023\nDerivative Financial Instruments in Cash Flow Hedge Relationships:\n \n \n \n \n \n \nInterest rate contracts\n$\n—\n \n$\n— \n$\n—\n \n$\n68\n \n$\n—\n \n$\n1\n \nForeign exchange contracts\n(b)\n—\n \n— \n466\n \n380\n \n124\n \n236\n \nAmount excluded from effectiveness testing and amortized into earnings\n(c)\n—\n \n— \n34\n \n178\n \n34\n \n177\n \nDerivative Financial Instruments in Fair Value Hedge Relationships:\nInterest rate contracts\n(\n253\n)\n196\n \n—\n \n— \n—\n \n— \nHedged"
  }
}