{
  "ticker": "PGR",
  "cik": "0000080661",
  "company_name": "PROGRESSIVE CORP/OH/",
  "filing_date": "2025-03-03",
  "accession": "0000080661-25-000007",
  "primary_doc": "pgr-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGeneral Development of Business\nThe Progressive Corporation, an insurance holding company, has insurance and non-insurance subsidiaries and affiliates (references in this Item to subsidiaries includes affiliates as well). Our insurance subsidiaries write personal and commercial auto insurance, personal residential property insurance, and insurance for motorcycles, watercraft, and other recreational vehicles. We also offer business-related general liability and commercial property insurance predominantly for small businesses, workers’ compensation insurance primarily for the transportation industry, and other specialty property-casualty insurance and provide related services. Our non-insurance subsidiaries generally support our insurance and investment operations. We operate throughout the United States. Unless noted, references to “state(s)” throughout this report include the District of Columbia. The Progressive Corporation, together with its insurance and non-insurance subsidiaries and affiliates, comprise what we refer to as Progressive. \nProgressive’s vision is to become consumers’, agents’, and business owners’ number one destination for insurance and other financial needs. Progressive’s four strategic pillars of people and culture, broad needs of our customers, leading brand, and competitive prices serve as the foundation of how we will achieve our vision.\nDescription of Business\nOrganization \nOur Chief Executive Officer (CEO) assesses performance and makes key operating decisions for our insurance, investment, and service operations and is supported by the following management team that oversees the business and corporate functions that support all areas of our organization. \nChief Executive Officer \n•\nChief Financial Officer\n•\nPersonal Lines President\n•\nChief Investment Officer\n•\nCommercial Lines President\n•\nChief Human Resources Officer\n•\nClaims President\n•\nChief Information Officer\n•\nCustomer Relationship Management President\n•\nChief Legal Officer\n•\nChief Marketing Officer\n•\nChief Strategy Officer\nOur insurance and claims organizations are generally managed on a state-by-state basis due to the nature of insurance, legal and regulatory requirements, and other local factors, and are supplemented by national operations and supported by our corporate functions. State-specific organizations typically report to a regional general manager, who then reports to the applicable group president. In California, we operate a separate agency auto organization with its own management and customer relationship management organization.\nPersonal Lines\nOur Personal Lines operating segment writes insurance for personal autos and special lines products (e.g., recreational vehicles, such as motorcycles, RVs, and watercraft), collectively referred to as our personal vehicle business, and, beginning in the fourth quarter 2024, personal residential property insurance for homeowners and renters. The Personal Lines segment accounted for 85% of our total net premiums written in 2024, 84% in 2023, and 82% in 2022.\n - 1 -\nOur personal vehicle business generally offers more than one program in a single state, with each program targeted to a specific distribution channel, market, or customer group. As of December 31, 2024, our personal vehicle products represented 95% of our total Personal Lines net premiums written, and 94% at the end of both 2023 and 2022. We write our personal vehicle insurance in all states, however, our special lines products are not written in the District of Columbia. \n•\nPersonal auto insurance represented 95% of our total personal vehicle net premiums written in 2024, and 94% in both 2023 and 2022. We ranked second in market share in the U.S. private passenger auto insurance market, based on 2023 premiums written, and we believe we continue to hold that position for 2024. There are approximately 240 competitors in this market. Progressive and the other leading 15 private passenger auto insurers, each of which writes over $2.5 billion of premiums annually, comprise about 85% of this market. All industry data, including ranking and market share, based on premiums written, has been obtained directly from data reported by either SNL Financial or A.M. Best Company, Inc. (A.M. Best), or was estimated using A.M. Best data as the primary source.\n•\nSpecial lines products represented the remaining personal vehicle net premiums written for the years mentioned above. Due to the seasonal nature of these products, we typically experience higher losses during the warmer weather months. Our competitors are specialty companies and large multi-line insurance carriers. Although industry figures are not available, based on our analysis of this market, we believe that we are the market share leader for both the motorcycle and boat products and that we are one of the largest providers of RV insurance.\nIn addition to writing residential property insurance for homeowners and renters, in virtually all states, our personal property business offers insurance for manufactured homes, personal umbrella insurance, and primary and excess flood insurance. We also act as a participant in the “Write Your Own” program for the National Flood Insurance Program (NFIP) under which we write flood insurance in virtually all states; 100% of this business is reinsured with the NFIP. \nOur personal property business represented 5% of our total Personal Lines net premiums written in 2024, and 6% in both 2023 and 2022, with about 95% of the total personal property net premiums written attributable to the homeowners and renters products. We were the eleventh largest homeowners carrier in the U.S., based on 2023 premiums written, and we are currently unable to determine if we will hold that ranking for 2024. There are approximately 360 competitors in the homeowners insurance market nationwide and we compete with many of these companies. Progressive and the other leading 30 large companies/groups, each with over $800 million of premiums written annually, comprise about 80% of the market.\nWe tend to see more personal property business written during the second and third quarters of the year based on the cyclical nature of property sales. Losses also tend to be higher during the warmer weather months when storms are more prevalent. As a property insurer, we have exposure to losses from catastrophes, including hurricanes, and other severe weather events. See",
    "item1a": "Item 1A, Risk Factors – III. Operating Risks\n above for more information.\n \n - 29 -",
    "item1c": "ITEM 1C. CYBERSECURITY\nOur business requires that we develop and maintain large and complex technology systems, and that we rely on third-party systems and applications, to run our operations and to store the significant volume of data and information that we acquire, including the personal information of our customers and employees and our intellectual property, trade secrets, and other sensitive business and financial information. \nOur overall efforts to safeguard the information systems and confidential information critical to our operations include preventative and detective internal processes, technological defenses, and other controls designed to provide multiple layers of security protection. Our information security efforts are designed to evolve with the changing security threat environment through ongoing assessment and measurement. In our efforts to keep our data and technology systems secure, we leverage both the International Organization for Standardization (ISO) 27002 Security Framework for the body of security control requirements and the National Institute of Standards and Technology Cybersecurity Framework to assess the strength of our processes and defenses. This \nintegrated\n approach to protect data and information systems is also built into our project management, development, and operations. To assess the effectiveness of our cybersecurity program and compliance with applicable rules, regulations, and laws, we employ a variety of internal resources to evaluate our environment, information systems, and processes. In addition, we engage third parties to test the vulnerability of our cybersecurity infrastructure on a regular basis and we have a third-party assessment performed annually.\n \nThrough appropriate risk evaluation, security assessments, and financial due diligence, we seek to protect the security and confidentiality of information provided to our vendors under service provider cloud computing or other arrangements. We also employ contractual nondisclosure requirements and use limitations consistent with our published Privacy Policy, and typically reserve the right to review third-party compliance against the required standards, where we deem appropriate. \nOur response to cybersecurity threats is triggered through various means. Through annual user awareness training, we teach our employees to identify and appropriately respond to such threats. Our incident response program is designed to mitigate and recover from suspected and actual cybersecurity incidents and provide all required consumer and regulatory notices regarding cybersecurity threats in a timely manner.\n \nOur \nChief Security Officer (CSO)\n is ultimately responsible for cybersecurity at Progressive, with management oversight of the prevention, detection, mitigation, and remediation of cybersecurity incidents. The CSO reports directly to the Chief Financial Officer and provides regular cybersecurity updates to the CEO, other members of the executive team, and the Board of Directors’ Technology Committee.\n \nAssuming the role in 2012, our CSO has served in this capacity at Progressive for more than a decade and, prior to joining us in 2010, had over 10 years of cybersecurity experience in the banking industry in security and risk management leadership roles, primarily focused on cybersecurity and banking compliance, with additional experience in the areas of anti-money laundering and financial fraud. Our CSO is also a member of our Management Risk Committee, which leads our Enterprise Risk Management program, and as a member ensures that cybersecurity risks remain a focus of the overall risk management process.\n \nThe \nTechnology Committee\n of the Board of Directors oversees our use of technology in business strategy as well as the major risks arising from our technology, digital and data strategies, legacy information systems, technology investments, data privacy, operational performance, cybersecurity programs, and technology-related business continuity and disaster recovery programs. The Technology Committee, which includes directors with technology experience, also oversees management’s effort to mitigate these risks. Technology Committee meetings typically occur five times a year. Generally, at these meetings, our CSO briefs the committee on cybersecurity-related matters.\nOur systems are being threatened by cybersecurity incidents on a regular basis and our efforts may be insufficient to prevent or defend against incidents or an attack. We, and certain of our third-party vendors, have experienced attacks and incidents in the past, and there can be no assurance that we, or any vendor, will be successful in preventing future attacks or incidents or detecting and stopping them once they have begun. Through the date hereof, risks from \ncybersecurity threats\n, including prior incidents and attacks, have not materially affected, and we do not believe are reasonably likely to materially affect, our business strategy, results of operations, or financial condition. However, we cannot guarantee that we will not be materially affected in the future. Cybersecurity risks evolve rapidly and are complex, so we must continually adapt and enhance our processes and defenses. As we do this, we must make judgments about where to invest resources to most effectively protect ourselves from cybersecurity risks. These are inherently challenging processes, and we can provide no assurance that processes and defenses that we implement will be effective. See",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe currently do not have any unresolved comments from the SEC staff."
  }
}