{
  "ticker": "PH",
  "cik": "0000076334",
  "company_name": "Parker-Hannifin Corp",
  "filing_date": "2025-08-22",
  "accession": "0000076334-25-000035",
  "primary_doc": "ph-20250630.htm",
  "item_sections": {
    "item1": "ITEM 1\n.  \nBusiness\nParker-Hannifin Corporation was incorporated in Ohio in 1938.  As used in this Annual Report on Form 10-K, unless the context otherwise requires, the terms \"Company\", \"Parker\", \"we\" or \"us\" refer to Parker-Hannifin Corporation and its subsidiaries, and the term \"year\" and references to specific years refer to the applicable fiscal year.\nParker is a global leader in motion and control technologies. Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC & refrigeration markets around the world. \nParker values having a decentralized operating structure that fosters deeper connections with our customers and greater engagement among our team members. To align our operations and achieve our goal of top quartile performance, we deploy our business system, The Win Strategy\nTM\n, which establishes goals and strategies for engaged people, customer experience, profitable growth and financial performance. Underpinning this business system is our culture of safety, collaboration, continuous improvement, and team-based problem solving. Together our goals, strategies, and culture help us to fulfill our purpose: Enabling Engineering Breakthroughs that Lead to a Better Tomorrow. We credit the Win Strategy with leading Parker through a period of sustained operational excellence and transformation and believe it is the foundation for achieving our future goals.\nOur investor relations website address is \ninvestors.parker.com\n. We make available free of charge on or through our website our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as soon as reasonably practicable after filing or furnishing those reports electronically with the Securities and Exchange Commission. The information contained on or accessible through our website is not part of this Annual Report on Form 10-K.\nOur Board of Directors has adopted a written charter for each of its committees. These charters, as well as our Global Code of Business Conduct, Corporate Governance Guidelines and Independence Standards for Directors, are posted and available on our investor relations website under the Governance page. Shareholders may request copies of these corporate governance documents, free of charge, by writing to our principal executive offices located at Parker-Hannifin Corporation, 6035 Parkland Boulevard, Cleveland, Ohio 44124-4141, Attention: Secretary, or by calling (216) 896-3000.\nMarkets\nOur interconnected technologies and solutions provide value for customers across our market verticals including aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration.  We serve several hundred thousand OEM and distribution customer locations.\nReportable Segments\nWe have two reportable segments: Diversified Industrial and Aerospace Systems.  Of the Company's $19.9 billion in net sales for fiscal year 2025, Diversified Industrial Segment products accounted for 69 percent and Aerospace Systems Segment products accounted for 31 percent.\nDiversified Industrial Segment\n.\n  Our Diversified Industrial Segment, which is an aggregation of several business units, sells highly engineered differentiated products to both original equipment manufacturers (\"OEMs\") and distributors who serve the aftermarket replacement markets.  The major market verticals served by our Diversified Industrial Segment are listed below:\n•\nAerospace & Defense\n•\nOff-highway\n•\nIn-plant & Industrial Equipment\n•\nEnergy\n•\nTransportation\n•\nHVAC & Refrigeration\n2\nTable of Contents\nAerospace Systems Segment\n.\n  Our Aerospace Systems Segment sells highly engineered, differentiated airframe and engine components and systems to OEMs and aftermarket parts and maintenance directly to end users primarily in the commercial aerospace and defense market verticals.  The major market platforms served by our Aerospace Systems Segment are listed below:\n•\nCommercial Transport\n•\nRegional Transport\n•\nDefense Fixed Wing\n•\nHelicopters\n•\nBusiness Jets\n•\nEnergy\nPrincipal Products and Methods of Distribution\nWe offer hundreds of thousands of individual part numbers, and no single product contributed more than one percent to our total net sales for the year ended June 30, 2025.  Listed below are some of our principal products.\nDiversified Industrial Segment\n.\n  Our Diversified Industrial Segment products consist of a broad range of motion-control systems and components, which are described below: \n•\nActive & Passive Vibration Control\n•\nHigh Purity Sealing\n•\nCoatings\n•\nHigh Temperature Sealing\n•\nCryogenic Valves & Fittings\n•\nHVAC/R Controls & Monitoring\n•\nElastomeric, Fabric Reinforced, Metal, & Precision Cut Seals\n•\nHydrogen & Natural Gas Filters\n•\nElectric & Hydraulic Pumps & Motors\n•\nIndustrial Air & Gas Filtration\n•\nElectric & Hydraulic Valves\n•\nMiniature Pumps & Valves\n•\nElectromagnetic Interface Shielding\n•\nPneumatic Actuators, Regulators & Valves\n•\nElectromechanical & Hydraulic Actuators\n•\nPower Take Offs\n•\nElectronics, Drives & Controllers\n•\nProcess Filtration Solutions\n•\nEngine Filtration Solutions\n•\nRubber to Substrate Adhesives\n•\nFluid Condition Monitoring\n•\nSensors & Diagnostics\n•\nFluid Conveyance Hose & Tubing\n•\nStructural Adhesives\n•\nHigh Pressure Connectors, Fittings, Valves & Regulators\n•\nThermal Management\n•\nHigh Purity Fittings, Valves & Regulators\nDiversified Industrial Segment products include standard products, as well as custom products which are engineered and produced to OEM specifications for application to particular end products.  Standard and custom products are also used in the replacement of original products.  We market our Diversified Industrial Segment products primarily through field sales employees and independent distributors located throughout the world.\nAerospace Systems Segment\n.\n  Our Aerospace Systems Segment products are used in commercial and defense airframe and engine programs and include:\n•\nAvionics\n•\nFuel Systems & Components\n•\nElectric & Hydraulic Braking Systems\n•\nFuel Tank Inerting Systems\n•\nElectric Power\n•\nHydraulic Pumps & Motors\n•\nElectromechanical Actuators\n•\nHydraulic Valves & Actuators\n•\nEngine Exhaust Systems & Components\n•\nPneumatics\n•\nFire Detection & Suppression\n•\nSeals\n•\nFlight Control Systems\n•\nSensors\n•\nFluid Conveyance\n•\nThermal Management\nWe market our Aerospace Systems Segment products through our regional sales organizations, which sell directly to OEMs and end users throughout the world.\n3\nTable of Contents\nCompetition\nParker operates in highly competitive markets and industries.  We offer our products over numerous, varied markets through our divisions operating in 43 countries.  Our global scope means that we have hundreds of competitors across our various markets and product offerings.  Our competitors include U.S. and non-U.S. companies.  These competitors and the degree of competition vary widely by product lines, end markets, geographic scope and/or geographic locations.  Although each of our segments has numerous competitors, given our market and product breadth, no single competitor competes with the Company with respect to all the products we manufacture and sell.\nIn the Diversified Industrial Segment, Parker competes based on product quality and innovation, customer experience, manufacturing and distribution capability, aftermarket support, and price competitiveness.  We believe that we are one of the market leaders in most of the major markets for our most significant Diversified Industrial Segment products.  We have comprehensive motion and control technologies allowing us to provide the broadest systems capabilities.  While our primary global competitors include Bosch Rexroth AG, Danaher Corporation, Danfoss A/S, Donaldson Company, Inc., Emerson Climate Technologies, Inc., Emerson/ASCO, Festo AG & Co., Freudenberg-NOK, Gates Corporation, IMI/Norgren, SMC Corporation, Swagelok Company, and Trelleborg AB, none of these businesses compete with every group or product in our Diversified Industrial Segment.\nIn the Aerospace Systems Segment, we have developed relationships with key customers based on our advanced technological and engineering capabilities, performance in quality, delivery, service, and price competitiveness.  This has enabled us to obtain significant original equipment business on new aircraft programs for our systems and components, as well as the follow-on repair and replacement business for these programs.  Further, the Aerospace Systems Segment utilizes design and manufacturing techniques as well as best cost region and supply chain management strategies to reduce cost.  Although we believe that we are one of the market leaders in most of the major markets for our most significant Aerospace Systems Segment products, primary global competitors for these products include Crane Co., Eaton Corporation plc, Honeywell International, Inc., Moog Inc., RTX Corporation, Safran S.A., Senior plc, Triumph Group, Inc., and Woodward, Inc.\nAcross our two segments, we believe that our broad-based portfolio of core technologies, which consist of hydraulics, pneumatics, electromechanical, filtration, fluid & gas handling, process control, engineered materials, and climate control, is a positive factor in our ability to compete effectively with both large and small competitors.  We believe that the following factors also contribute to our ability to compete effectively:\n•\nOur business system, The Win Strategy\n•\nTechnology powerhouse of interconnected solutions\n•\nDeep partnerships with our customers to develop innovative products\n•\nApplication engineering expertise\n•\nGlobal distribution network\n•\nDecentralized operating structure\nPatents, Trademarks, Trade Names, Copyrights, Trade Secrets, Licenses\nWe own a number of patents, trademarks, trade names, copyrights, trade secrets and licenses related to our products.  We also have exclusive and non-exclusive rights to use patents, trademarks, trade names, copyrights and trade secrets owned by others.  In addition, patent and trademark applications are pending, although there can be no assurance that further patents and trademarks will be issued.  We do not depend on any single patent, trademark, copyright, trade secret or license or group of patents, trademarks, copyrights, trade secrets or licenses to any material extent.\nBacklog and Seasonal Nature of Business\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.  Our backlog by business segment for the past two years is included in Part II, Item 7 of this Annual Report on Form 10-K and is incorporated herein by reference.  Our backlog was $11.0 billion at June 30, 2025 and $10.9 billion at June 30, 2024.  Approximately 71 percent of our backlog at June 30, 2025 is scheduled for delivery in the succeeding twelve months.  Because of the breadth and global scope of our business, our overall business is generally not seasonal in nature.\nEnvironmental Regulation\nCertain of our operations require the use and handling of hazardous materials and, as a result, the Company is subject to United States federal, state, and local laws and regulations as well as non-U.S. laws and regulations designed to protect the \n4\nTable of Contents\nenvironment and regulate the discharge of materials into the environment.  These laws impose penalties, fines and other sanctions for non-compliance and liability for response costs, property damage and personal injury resulting from past and current spills, disposals or other releases of, or exposures to, hazardous materials.  Among other environmental laws, we are subject to the United States federal \"Superfund\" law, under which we have been designated as a \"potentially responsible party\" and may be liable for cleanup costs associated with various waste sites, some of which are on the United States Environmental Protection Agency’s Superfund priority list.\nAs of June 30, 2025, Parker was involved in environmental remediation and litigation at various U.S. and non-U.S. manufacturing facilities presently or formerly operated by us and as a \"potentially responsible party,\" along with other companies, at off-site waste disposal facilities and regional sites.\nWe believe that our policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage and the consequent financial liability to the Company.  Compliance with environmental laws and regulations requires continuing management efforts and expenditures by the Company.  Compliance with environmental laws and regulations has not had in the past, and, we believe, will not have in the future, a material adverse effect on our capital expenditures, earnings, or competitive position.\nOur reserve for environmental matters is discussed in Note 18 to the Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, which is incorporated herein by reference.\nGovernment Regulation\nIn addition to the environmental regulations discussed above, we are subject to various federal, state, local, and foreign government regulations relating to the development, manufacture, marketing, sale and distribution of our products and services in the countries where we conduct business.  Compliance with these laws and regulations often requires the dedication of time and effort of our team members, as well as financial resources.  Additional information about the impact of government regulations on our business is included in “",
    "item1a": "Item 1A. “Risk Factors—Business and Operational Risks” of this Form 10-K, cybersecurity threats remain a risk to our business operations.\n \n15\nTable of Contents\nCybersecurity Governance\nManagement is responsible for assessing and managing material risks from cybersecurity threats with leadership from the Company’s Vice President – Chief Digital and Information Officer (\"CDIO\"), who is responsible for the Company’s global Digital, Information Technology and Cyber Security organization. \nOur CDIO has served in various roles in information technology and information security for approximately 20 years with Fortune 500 companies. Our CDIO holds Bachelor of Science and Master of Science degrees in Computer Engineering. He has also completed other advanced leadership training and coursework regarding cybersecurity risk management.\n Our CDIO reports directly to the Chief Executive Officer.\n \nParker’s cybersecurity program is led by our Digital & IT VP – Infrastructure and Security, who functions as our \nchief information security officer (\"CISO\")\n and has over 25 years of experience in cybersecurity operations, cybersecurity governance and compliance, risk management, operational technology (\"OT\") and connected products (\"IoT\") with global Fortune 200 and Fortune 500 companies across diverse industries, such as retail, consumer goods, entertainment and manufacturing.\n \nThe CISO reports to our CDIO and is supported by and receives regular updates from our dedicated Cyber Security team within our IT function, as well as our IT Risk Council, a cross-functional group that meets regularly to optimize our Digital & IT Risk Management Program and promote alignment with our Enterprise Risk Management program.\nRecognizing the importance of maintaining a secure environment for our products, data and systems that effectively supports our business objectives and customer needs, Parker’s full Board of Directors maintains oversight of cybersecurity. \nOur \nBoard\n receives an in-depth report from our CDIO, at least annually, on the overall cybersecurity program, and updates throughout the year from our CDIO and CISO regarding such topics as cyber-risk management and the status of projects to strengthen cybersecurity effectiveness.",
    "item1b": "ITEM 1B.\n \nUnresolved Staff Comments\nNone.",
    "item1c": "ITEM 1C.\n \nCybersecurity\nCybersecurity Risk Management and Strategy\nParker is committed to the protection of the Company’s data, data systems and digital assets while in storage, use or transit. \nOur cybersecurity program is \nintegrated\n into our overall Enterprise Risk Management program and exists to secure our information systems and data assets, including those data assets entrusted to us by our stakeholders, and to promote our compliance with applicable laws and regulations.\n \nWe proactively work to address cybersecurity risk through our Digital & IT Risk Management Program, which focuses on identifying, assessing, responding to, monitoring and remediating cybersecurity-related risks. Parker’s dedicated Cyber Security team utilizes the National Institute of Standards and Technology (\"NIST\") Cyber Security Framework as its primary resource for identifying areas of risk and benchmarking and implementing continuous improvements. Our technical security configuration employs a centrally managed, layered approach, including hardened PCs, endpoint security detection software, email security, firewall appliances, and various network security protections. We employ enhanced security measures for operational technologies and secure account management, including a secondary anti-malware solution to our existing software to bolster our company-wide defenses. Additionally, we utilize third-party security monitoring services to further improve our 24/7 monitoring capabilities. We also maintain a third-party risk management program, which includes formally evaluating new vendors at onboarding and monitoring existing vendors on an ongoing basis, designed to oversee, identify, and reduce the potential impact to Parker and our customers of a security incident at a third-party vendor, supplier or other provider.\n \nWe have adopted comprehensive Information Security Policies and Standards that clearly articulate Parker’s expectations and requirements with respect to acceptable use, risk management, data privacy, education and awareness, security incident management and reporting, identity and access management, third-party management, security (with respect to physical assets, products, networks and systems), security monitoring and vulnerability identification. These policies and standards set forth a detailed security incident management and reporting protocol, with clear escalation timelines and responsibilities. We also maintain a global incident response plan and regularly conduct exercises to help with our overall preparedness. \nWe believe cybersecurity is the responsibility of every team member and provide ongoing mandatory cybersecurity awareness training globally to help team members recognize, avoid and report malicious activity. This includes interactive training to engage team members in identifying phishing risks and their appropriate response. We also provide regular training on data protection so that our team members understand the types of data they have and how to safeguard it. \nContinuous improvement is a critical aspect of Parker’s cybersecurity program, which is why we integrate security intelligence from internal and external sources to help identify areas for improvement and gap remediation. As a supplement to our internal cybersecurity capabilities and controls, \nwe partner with third-party consultants\n and advisors to conduct penetration testing and to assess our incident response plan. \nWe periodically undergo a third-party risk assessment and third-party incident response adversarial engagement exercises to strengthen our security profile.\n We also conduct internal tabletop exercises to prepare for responding to potential cybersecurity events. Parker also maintains cyber security insurance designed to mitigate the impact of any attacks or threats to our business.\nWithin the last three years, Parker has only experienced immaterial information security breaches for which the total expenses were immaterial. As of the date of this report, \nwe do not believe that any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect the Company, including its business strategy, results of operations, or financial condition.\n However, as discussed more fully under"
  }
}