{
  "ticker": "PKG",
  "cik": "0000075677",
  "company_name": "PACKAGING CORP OF AMERICA",
  "filing_date": "2025-02-27",
  "accession": "0000950170-25-028533",
  "primary_doc": "pkg-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business” of this Form 10-K. We assess the condition and capacity of our manufacturing, distribution, and other facilities needed to meet our operating requirements. Our properties have been generally well maintained and are in good operating condition. In general, our facilities have sufficient capacity and are adequate for our production and distribution requirements.\n\n\nAs of December 31, 2024, we own buildings and land for our eight mills. Additionally, we have 86 corrugated manufacturing operations, of which the buildings and land for 53 are owned, including 45 combining operations, or corrugated plants, one corrugated sheet-only manufacturer, and seven sheet plants. We lease the buildings for 13 corrugated plants and 20 sheet plants. We own warehouses and miscellaneous other properties, including sales offices and woodlands management offices. We lease space for regional design centers and numerous other distribution centers, warehouses, and facilities. The equipment in these leased facilities is, in virtually all cases, owned by us, except for forklifts and other rolling stock, which are generally leased.\n\n\nWe own our corporate headquarters building, which is located in Lake Forest, Illinois.\n \n\n\nItem 3. \nLEG\nAL PROCEEDINGS\n\n\nInformation concerning legal proceedings can be found in Note 19, Commitments, Guarantees, Indemnifications, and Legal Proceedings, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K.\n\n\nItem 4. \nMINE SAFETY \nDISCLOSURE\n\n\nNot applicable.\n\n\n \n\n\n \n\n\n16\n\n\n\n\n \n\n\nPAR\nT II\n\n\nItem 5. \nMARKET FO\nR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\n\n\nMarket Information\n\n\nPCA’s common stock is listed on the New York Stock Exchange (NYSE) under the symbol “PKG.”\n\n\nStockholders\n\n\nOn February 21, 2025, there were 151 holders of record of our common stock.\n\n\nPurchases of Equity Securities\n\n\nShare Repurchase Program\n\n\nOn January 26, 2022, PCA announced that its Board of Directors authorized the repurchase of $1 billion of the Company’s outstanding common stock from time to time in open market or privately negotiated transactions in accordance with applicable securities laws. At the time of the announcement, there was no remaining authority under previously announced programs. Repurchases may be made from time to time in open market or privately negotiated transactions in accordance with applicable securities regulations. The timing and amount of repurchases will be determined by the Company in its discretion based on factors such as PCA’s stock price and market and business conditions.\n\n\nThe Company did not repurchase any shares of its common stock under this authority during the year ended December 31, 2024. At December 31, 2024, $436.0 million of the authorized amount remained available for repurchase of the Company’s common stock. During the third quarter of 2023, we paid $41.5 million, including fees, to repurchase 0.3 million shares of common stock. During the third and fourth quarters of 2022, we paid $522.6 million, including fees, to repurchase 4.0 million shares of common stock. All shares repurchased have been retired.\n\n\nPursuant to its equity incentive plan, the Company withholds shares from vesting employee equity awards to cover employee tax liabilities. We withheld 142,552 shares in 2024 to cover $25.7 million in employee tax liabilities, 120,534 shares in 2023 to cover $15.7 million in employee tax liabilities, and 110,827 shares in 2022 to cover $15.4 million in employee tax liabilities.\n\n\nThe following table presents information related to our repurchases of common stock made under repurchase plans authorized by PCA’s Board of Directors, and shares withheld to cover taxes on vesting of equity awards, during the three months ended December 31, 2024:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIssuer Purchases of Equity Securities\n\n\n \n\n\n\n\n\n\nPeriod\n\n\n \n\n\nTotal\nNumber \nof Shares \nPurchased (a)\n\n\n \n\n\n \n\n\nAverage\nPrice Paid Per\nShare\n\n\n \n\n\n \n\n\nTotal Number\nof Shares  \nPurchased \nas Part of Publicly \nAnnounced Plans \nor Programs\n\n\n \n\n\n \n\n\nApproximate\nDollar Value \nof Shares \nThat May Yet \nBe Purchased \nUnder the Plans \nor Programs\n(in millions)\n\n\n \n\n\n\n\n\n\nOctober 1-31, 2024\n\n\n \n\n\n \n\n\n2,119\n\n\n \n\n\n \n\n\n$\n\n\n212.90\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n436.0\n\n\n \n\n\n\n\n\n\nNovember 1-30, 2024\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n436.0\n\n\n \n\n\n\n\n\n\nDecember 1-31, 2024\n\n\n \n\n\n \n\n\n2,146\n\n\n \n\n\n \n\n\n \n\n\n224.62\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n436.0\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n4,265\n\n\n \n\n\n \n\n\n$\n\n\n218.79\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n436.0\n\n\n \n\n\n\n\n\n\n(a)\nAll shares were withheld from employees to cover income and payroll taxes on equity awards that vested during the period.\n\n\n \n\n\n17\n\n\n\n\n \n\n\nPerformance Graph\n\n\nThe graph below compares PCA’s cumulative 5-year total shareholder return on common stock with the cumulative total returns of the S&P 500 index and the S&P Midcap 400 index. The graph tracks the performance of a $100 investment (including the reinvestment of all dividends) in our common stock and in each index from December 31, 2019 through December 31, 2024. The stock price performance included in this graph is not necessarily indicative of future stock price performance.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nCumulative Total Return\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2019\n\n\n \n\n\n \n\n\n2020\n\n\n \n\n\n \n\n\n2021\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nPackaging Corporation of America\n\n\n \n\n\n$\n\n\n100.00\n\n\n \n\n\n \n\n\n$\n\n\n127.27\n\n\n \n\n\n \n\n\n$\n\n\n129.32\n\n\n \n\n\n \n\n\n$\n\n\n125.90\n\n\n \n\n\n \n\n\n$\n\n\n166.04\n\n\n \n\n\n \n\n\n$\n\n\n235.24\n\n\n \n\n\n\n\n\n\nS&P 500\n\n\n \n\n\n \n\n\n100.00\n\n\n \n\n\n \n\n\n \n\n\n118.40\n\n\n \n\n\n \n\n\n \n\n\n152.39\n\n\n \n\n\n \n\n\n \n\n\n124.79\n\n\n \n\n\n \n\n\n \n\n\n157.59\n\n\n \n\n\n \n\n\n \n\n\n197.02\n\n\n \n\n\n\n\n\n\nS&P Midcap 400\n\n\n \n\n\n \n\n\n100.00\n\n\n \n\n\n \n\n\n \n\n\n113.66\n\n\n \n\n\n \n\n\n \n\n\n141.80\n\n\n \n\n\n \n\n\n \n\n\n123.28\n\n\n \n\n\n \n\n\n \n\n\n143.54\n\n\n \n\n\n \n\n\n \n\n\n163.54\n\n\n \n\n\n\n\n\n\nThe information in the graph and table above is not deemed “filed” with the Securities and Exchange Commission and is not to be incorporated by reference in any of PCA’s filings under the Securities Act of 1933 or the Securities Exchange Act of 1934, whether made before or after the date of this Annual Report on Form 10-K, except to the extent that PCA specifically incorporates such information by reference.\n\n\nItem 6. \n[\nR\nESERVED]\n \n\n\n18\n\n\n\n\n \n\n\nItem 7. \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\n FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n\n\nThe following discussion and analysis of historical results of operations and financial condition should be read in conjunction with the audited financial statements and the notes thereto which appear elsewhere in this Form 10-K. This discussion includes forward-looking statements regarding our expectations with respect to our future performance, liquidity, ESG goals, and capital resources. Such statements, along with any other non-historical statements in the discussion, are forward-looking. See our discussion regarding forward-looking statements included under “Part I,",
    "item1a": "Item 1A. Risk Factors” of this Form 10-K. For our discussion and analysis of our results of operations, financial condition and cash flows for the year ended December 31, 2022, the earliest of the years presented in the accompanying audited financial statements included in Item 8 herein, please refer to our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the Securities and Exchange Commission on February 29, 2024. Such information is presented in Item 7 of such report under the subcaptions “Results of Operations —Year Ended December 31, 2023, Compared with Year Ended December 31, 2022” and “Liquidity and Capital Resources” and is incorporated by reference herein.\n\n\nOver\nview\n\n\nPCA is the third largest producer of containerboard products and a leading producer of uncoated freesheet paper in North America. We operate eight mills and 86 corrugated products manufacturing plants. Our containerboard mills produce linerboard and corrugating medium, which are papers primarily used in the production of corrugated products. Our corrugated products manufacturing plants produce a wide variety of corrugated packaging products, including conventional shipping containers used to protect and transport manufactured goods, multi-color boxes and displays with strong visual appeal that help to merchandise the packaged product in retail locations, and honeycomb protective packaging. In addition, we are a large producer of packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. We also manufacture and sell UFS papers, including both commodity and specialty papers, which may have custom or specialized features such as colors, coatings, high brightness, and recycled content. We are headquartered in Lake Forest, Illinois and operate primarily in the United States.\n\n\nIncluded in this Item 7 are various non-GAAP financial measures, including earnings per diluted share excluding special items, net income excluding special items, earnings before non-operating pension income (expense), interest, income taxes, and depreciation, amortization, and depletion (“EBITDA”), segment EBITDA, EBITDA excluding special items, and segment EBITDA excluding special items. We provide important disclosures regarding our presentation of non-GAAP financial measures and reconciliations of presented non-GAAP financial measures to the most comparable measures presented in accordance with GAAP later in this section under the caption “Non-GAAP Financial Measures.”\n\n\nExecutive\n Summary\n\n\nNet sales were $8.4 billion for the year ended December 31, 2024 and $7.8 billion for 2023. We reported $805 million of net income, or $8.93 per diluted share, in 2024, compared to $765 million, or $8.48 per diluted share, in 2023. Net income included $9 million of expense for special items in 2024, compared to $19 million of expense for special items in 2023. Special items in both periods are described later in this section. Excluding special items, we recorded $814 million of net income, or $9.04 per diluted share, in 2024, compared to $784 million, or $8.70 per diluted share, in 2023.\n1\n The increase was driven primarily by higher volumes in our Packaging and Paper segments, and lower freight and logistic expenses, partially offset by lower prices and mix in our Packaging and Paper segments, higher operating and converting costs driven in part by inflation across our cost base, and higher annual outage expense. PCA ended the year with $852 million\n \nof cash and marketable debt securities and, including borrowing availability under its revolving credit facility, $1,175 million in liquidity.\n\n\nPackaging segment operating income was $1,102 million in 2024, compared to $1,074 million for 2023. Packaging segment EBITDA excluding special items was $1,598 million in 2024, compared to $1,556 million in 2023.\n1\n The increase was driven primarily by higher volumes, and lower freight and logistic expenses, partially offset by lower containerboard and corrugated products prices and mix, higher operating and converting costs and higher annual outage expense.\n \n\n\nPackaging volumes were up throughout the year, compared to 2023, with record-breaking performance in the third and fourth quarters. Overall, total corrugated products shipments were up 10.5% for the year. Our containerboard production was approximately 294 BSF, and containerboard inventory weeks-of-supply increased 0.3 weeks from year end 2023. For more information on our containerboard production and corrugated products shipments, refer to the table presented under the caption “Production and Shipments” in “Part I, Item 1. Business” of this Form 10-K. Containerboard prices published by industry publications increased in the first and second quarter of 2024, after declining late in 2022 and throughout 2023. In part due to the timing of these changes, our average prices were lower in 2024 than in 2023. We notified customers of a $70 per ton price increase for linerboard and a $90 per ton price increase for medium effective January 1, 2025.\n\n\n\n\n1\n  Net income excluding special items, earnings per diluted share excluding special items, and segment EBITDA excluding special items are non-GAAP financial measures. See “Non-GAAP Financial Measures” later in this item 7.\n19\n\n\n\n\n \n\n\nOver the past several years, we made extensive capital investments throughout the packaging segment to improve productivity and efficiencies at our containerboard mills and corrugated products facilities and believe that our success in execution of these capital investments has helped us deliver strong results while minimizing the continued inflationary impact across our cost structure.\n\n\nPaper segment operating income was $130 million in 2024, compared to $119 million in 2023. Paper segment EBITDA excluding special items was $154 million in 2024, compared to $151 million in 2023.\n1\n The increase was due primarily to higher paper volumes and lower operating costs, partially offset by lower prices and mix. We notified customers of a $60 per ton price increase for all office, printing, and converting papers, effective January 13, 2025.\n\n\nIndustry and Busi\nness Conditions\n\n\nTrade publications reported North American industry-wide corrugated products shipments were relatively flat in 2024, compared to 2023. Reported industry containerboard production increased 4.7% compared to 2023, and reported industry containerboard inventories at the end of 2024 were approximately 2.8 million tons, up 5.7% compared to 2023. Reported containerboard export shipments increased 15.4% compared to 2023. Index prices, in February 2024, increased $40 per ton for linerboard and $60 per ton for corrugating medium, followed by an additional increase in June 2024 of $40 per ton for linerboard and corrugating medium.\n\n\nThe market for communication papers competes heavily with electronic data transmission and document storage alternatives. Increasing shifts to these alternatives have reduced usage of traditional print media and communication papers.\n \nTrade publications reported North American uncoated freesheet paper shipments increased slightly 0.5% in 2024, compared to 2023. Average prices reported by a trade publication for cut size office papers were lower by $36 per ton, or (2.4%), in 2024 compared to 2023. For cut size office papers, index prices decreased $40 per ton in January, followed by increases of $20 per ton in April and May 2024. For offset printing papers, index prices decreased $20 per ton in January, followed by increases of $20 per ton in April and May 2024.\n\n\nOutlook\n\n\nFor the first quarter of 2025, in our Packaging segment, we expect volume in our corrugated products plants to increase and set new first quarter records for total shipments and shipments-per-day. Containerboard production will be lower with two less operating days and scheduled maintenance outages at our Counce, TN and Valdosta, GA mills. Domestic prices are expected to be higher with an improved product mix together with our previously announced price increases. Export prices are assumed to be stable. In our Paper segment, we forecast slightly lower volume with two less mill operating days and prices and mix to be fairly flat. With the exception of recycled fiber prices, we expect inflation across most of our direct, indirect and fixed operating and converting costs along with a higher cost mix of mill operations. In addition, wood, energy, and chemical costs will also increase due to the unusually cold seasonal weather negatively affecting usages and yields for these items. Labor and benefits costs will be higher due to timing-related items that occur at the beginning of a new year for annual increases, the restart of payroll taxes, and share-based compensation expenses. First quarter rail rate increases at three of our mills will impact freight and logistics expenses and we expect higher depreciation expense. Lastly, scheduled outage expenses should be slightly lower and we assume a lower corporate tax rate. Considering these items, we expect first quarter earnings to be lower than the fourth quarter of 2024.\n\n\n20\n\n\n\n\n \n\n\nResults of \nOperations\n\n\nYear Ended December 31, 2024, Compared with Year Ended December 31, 2023\n\n\nThe historical results of operations of PCA for the years ended December 31, 2024 and 2023 are set forth below (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\n\n\n\n\nPackaging\n\n\n \n\n\n$\n\n\n7,690.9\n\n\n \n\n\n \n\n\n$\n\n\n7,135.6\n\n\n \n\n\n \n\n\n$\n\n\n555.3\n\n\n \n\n\n\n\n\n\nPaper\n\n\n \n\n\n \n\n\n624.7\n\n\n \n\n\n \n\n\n \n\n\n595.4\n\n\n \n\n\n \n\n\n \n\n\n29.3\n\n\n \n\n\n\n\n\n\nCorporate and other and eliminations\n\n\n \n\n\n \n\n\n67.7\n\n\n \n\n\n \n\n\n \n\n\n71.4\n\n\n \n\n\n \n\n\n \n\n\n(3.7\n\n\n)\n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n8,383.3\n\n\n \n\n\n \n\n\n$\n\n\n7,802.4\n\n\n \n\n\n \n\n\n$\n\n\n580.9\n\n\n \n\n\n\n\n\n\nPackaging\n\n\n \n\n\n$\n\n\n1,101.5\n\n\n \n\n\n \n\n\n$\n\n\n1,074.3\n\n\n \n\n\n \n\n\n$\n\n\n27.2\n\n\n \n\n\n\n\n\n\nPaper\n\n\n \n\n\n \n\n\n129.7\n\n\n \n\n\n \n\n\n \n\n\n118.9\n\n\n \n\n\n \n\n\n \n\n\n10.8\n\n\n \n\n\n\n\n\n\nCorporate and Other\n\n\n \n\n\n \n\n\n(129.9\n\n\n)\n\n\n \n\n\n \n\n\n(118.1\n\n\n)\n\n\n \n\n\n \n\n\n(11.8\n\n\n)\n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n1,101.3\n\n\n \n\n\n \n\n\n \n\n\n1,075.1\n\n\n \n\n\n \n\n\n \n\n\n26.2\n\n\n \n\n\n\n\n\n\nNon-operating pension income (expense)\n\n\n \n\n\n \n\n\n4.5\n\n\n \n\n\n \n\n\n \n\n\n(7.7\n\n\n)\n\n\n \n\n\n \n\n\n12.2\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n(41.4\n\n\n)\n\n\n \n\n\n \n\n\n(53.3\n\n\n)\n\n\n \n\n\n \n\n\n11.9\n\n\n \n\n\n\n\n\n\nIncome before taxes\n\n\n \n\n\n \n\n\n1,064.4\n\n\n \n\n\n \n\n\n \n\n\n1,014.1\n\n\n \n\n\n \n\n\n \n\n\n50.3\n\n\n \n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n(259.3\n\n\n)\n\n\n \n\n\n \n\n\n(248.9\n\n\n)\n\n\n \n\n\n \n\n\n(10.4\n\n\n)\n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n \n\n\n$\n\n\n39.9\n\n\n \n\n\n\n\n\n\nNet income excluding special items (a)\n\n\n \n\n\n$\n\n\n814.5\n\n\n \n\n\n \n\n\n$\n\n\n784.4\n\n\n \n\n\n \n\n\n$\n\n\n30.1\n\n\n \n\n\n\n\n\n\nEBITDA (a)\n\n\n \n\n\n$\n\n\n1,626.9\n\n\n \n\n\n \n\n\n$\n\n\n1,592.8\n\n\n \n\n\n \n\n\n$\n\n\n34.1\n\n\n \n\n\n\n\n\n\nEBITDA excluding special items (a)\n\n\n \n\n\n$\n\n\n1,637.1\n\n\n \n\n\n \n\n\n$\n\n\n1,603.8\n\n\n \n\n\n \n\n\n$\n\n\n33.3\n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nSee “Non-GAAP Financial Measures” included in this Item 7 for a reconciliation of non-GAAP measures to the most comparable GAAP measure.\n\n\nNet Sales\n\n\nNet sales increased $581 million, or 7.4%, to $8,383 million in 2024, compared to $7,802 million in 2023.\n \n\n\nPackaging.\n Net sales increased $555 million, or 7.8%, to $7,691 million, compared to $7,136 million in 2023, due to higher volumes ($735 million), partially offset by lower prices and mix ($180 million). In 2024, our domestic containerboard prices increased 3.7% and export prices decreased (2.2%) compared to 2023. Our containerboard outside shipments increased 16.1%, and total corrugated products shipments were up 10.5% in total and 10.1% per workday, compared to 2023.\n \n\n\nPaper.\n Net sales increased $29 million, or 4.9%, to $625 million, compared to $595 million in 2023. The increase was due to higher volume ($49 million), partially offset by lower prices and mix ($19 million).\n \n\n\nGross Profit\n\n\nGross profit increased $84 million in 2024, compared to 2023. The increase was driven primarily by higher volumes, and lower freight and logistic expenses, partially offset by lower containerboard and corrugated products prices and mix, higher operating and converting costs and higher annual outage expense. In 2024, gross profit included $3 million of special items expense related to Jackson mill conversion-related activities and corrugated facility closure and other costs, compared to $15 million of special items expense related to Jackson mill conversion-related activities and corrugated facility closure and other costs in 2023.\n\n\nSelling, General, and Administrative Expenses\n\n\nSelling, general, and administrative expenses (SG&A) increased $29 million in 2024 compared to 2023. The increase was primarily due to higher employee-related expenses and bad debt expense.\n \n\n\n21\n\n\n\n\n \n\n\nOther Expense, Net\n\n\nOther expense, net for the years ended December 31, 2024 and 2023 are set forth below (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAsset disposals and write-offs\n\n\n \n\n\n$\n\n\n(39.7\n\n\n)\n\n\n \n\n\n$\n\n\n(31.7\n\n\n)\n\n\n\n\n\n\nJackson mill conversion-related activities\n\n\n \n\n\n \n\n\n(7.6\n\n\n)\n\n\n \n\n\n \n\n\n(1.8\n\n\n)\n\n\n\n\n\n\nFacilities closure and other costs\n\n\n \n\n\n \n\n\n(1.0\n\n\n)\n\n\n \n\n\n \n\n\n(7.9\n\n\n)\n\n\n\n\n\n\nDeRidder and other litigation\n\n\n \n\n\n \n\n\n(95.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nDeRidder and other litigation insurance recoveries\n\n\n \n\n\n \n\n\n95.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n(23.2\n\n\n)\n\n\n \n\n\n \n\n\n(1.5\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n(71.5\n\n\n)\n\n\n \n\n\n$\n\n\n(42.9\n\n\n)\n\n\n\n\n\n\n \n\n\nWe discuss these items in more detail in Note 6, Other Expense, Net of the Condensed Notes to the Consolidated Financial Statements in “Part II, Item 8. Financial Statements” of this Form 10-K.\n\n\nIncome from Operations\n\n\nIncome from operations increased $26 million, or 2.4%, for the year ended December 31, 2024, compared to 2023. Income from operations in 2024 included $12 million of expense for special items compared to $25 million in 2023. Special items in 2024 included $10 million for Jackson mill conversion-related activities and $2 million of expense related to corrugated facility closure and other costs. Special items in 2023 included $14 million of expense related to corrugated facility closure and other costs and $11 million for Jackson mill conversion-related activities.\n\n\nPackaging.\n Segment operating income increased $28 million to $1,102 million, compared to $1,074 million in 2023. The increase, excluding special items, related primarily to higher sales and production volumes ($377 million) and lower freight expense ($30 million), partially offset by lower containerboard and corrugated products prices and mix ($211 million), higher operating and converting costs ($121 million), higher depreciation expense ($22 million), higher annual outage expense ($13 million), and other costs ($20 million). Special items in 2024 included $4 million of expense for Jackson mill conversion-related activities and $2 million of expense for corrugated facility closure and other costs. Special items in 2023 included $14 million of expense for corrugated facility closure and other costs.\n\n\nPaper.\n Segment operating income increased $11 million to $130 million, compared to $119 million in 2023. The increase, excluding special items, primarily related to higher sales and production volumes ($22 million), lower depreciation expense ($3 million), and lower operating costs ($2 million), partially offset by lower paper prices and mix ($19 million) and higher freight expense ($1 million). Special items in 2024 included $6 million of expense for Jackson mill conversion-related activities. Special items in 2023 included $11 million of expense for Jackson mill conversion-related activities.\n\n\nNon-Operating Pension Income, Interest Expense, Net and Income Taxes\n\n\nDuring 2024, non-operating pension income increased $12 million compared to 2023.\n \nThe increase in non-operating pension income was related to favorable 2023 asset performance and favorable assumption changes.\n\n\nInterest expense, net, during 2024 decreased $12 million compared to 2023. The decrease in interest expense, net in 2024 was primarily due to higher interest income due to higher rates on invested cash balances, partially offset by higher interest expense in 2024 related to the Company’s November 2023 debt refinancing.\n\n\nDuring 2024, we recorded $259 million of income tax expense, compared to $249 million of income tax expense during 2023. The effective tax rate for 2024 and 2023 was 24.4% and 24.5%, respectively. The lower effective tax rate for 2024 was primarily due to higher excess tax benefits associated with employee restricted stock and performance unit vests partially offset by higher nondeductible employee remuneration paid to covered employees.\n \n\n\n22\n\n\n\n\n \n\n\nLiquidity and Ca\npital Resources\n\n\nSources and Uses of Cash\n\n\nOur primary sources of liquidity are net cash provided by operating activities and available borrowing capacity under our revolving credit facility. We ended the year with $685 million of cash and cash equivalents, $167 million of marketable debt securities, and $323 million of unused borrowing capacity under the revolving credit facility, net of letters of credit. On November 30, 2023, we issued $400 million of 5.70% senior notes due 2033 through a registered public offering and invested the net proceeds received from this issuance in time deposits, which are included in marketable debt securities at December 31, 2023. On September 15, 2024, the Company used the net proceeds from this issuance, together with a portion of cash on hand, to repay its outstanding 3.65% senior notes due 2024. See Note 10, Debt, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K as well as information provided below under “—Investing Activities” and “—Financing Activities” for further information.\n\n\nCurrently, our primary uses of cash are for operations, capital expenditures, acquisitions, debt service, common stock dividends, and repurchases of common stock. We believe that net cash generated from operating activities, cash on hand, available borrowings under our revolving credit facility and available capital through access to capital markets will be adequate to meet our liquidity and capital requirements, including payments of any declared common stock dividends, for the foreseeable future. As our debt or credit facilities become due, we will need to repay, extend or replace such facilities. Our ability to do so will be subject to future economic conditions and financial, business, and other factors, many of which are beyond our control.\n\n\nBelow is a summary table of our cash flows, followed by a discussion of our sources and uses of cash through operating activities, investing activities, and financing activities (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNet cash provided by (used for):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating activities\n\n\n \n\n\n$\n\n\n1,191.2\n\n\n \n\n\n \n\n\n$\n\n\n1,315.1\n\n\n \n\n\n\n\n\n\nInvesting activities\n\n\n \n\n\n \n\n\n(277.8\n\n\n)\n\n\n \n\n\n \n\n\n(875.1\n\n\n)\n\n\n\n\n\n\nFinancing activities\n\n\n \n\n\n \n\n\n(876.4\n\n\n)\n\n\n \n\n\n \n\n\n(112.0\n\n\n)\n\n\n\n\n\n\nNet increase in cash and cash equivalents\n\n\n \n\n\n$\n\n\n37.0\n\n\n \n\n\n \n\n\n$\n\n\n328.0\n\n\n \n\n\n\n\n\n\nOperating Activities\n\n\nOur operating cash flow is primarily driven by our earnings and changes in operating assets and liabilities, such as accounts receivable, inventories, accounts payable and other accrued liabilities, as well as other factors described below. Cash requirements for operating activities are subject to PCA’s operating needs and the timing of collection of receivables and payments of payables and expenses.\n \n\n\nDuring 2024, net cash provided by operating activities was $1,191 million, compared to $1,315 million for 2023, a decrease of $124 million. Cash from operations excluding changes in cash used for operating assets and liabilities increased $80 million, primarily due to higher income from operations in 2024 as discussed above. Cash decreased by $204 million due to changes in operating assets and liabilities, primarily due to the following:\n \n\n\na)\na net unfavorable change in prepaid expenses and other current assets in 2024 compared to 2023 primarily due to an increase in accrued receivables for the insurance recoveries related to pending litigation in 2024;\n\n\nb)\na net unfavorable change in accounts receivable levels in 2024 compared to 2023 primarily due to higher sales and an increase in days sales outstanding in the Packaging segment during 2024;\n\n\nc)\na net unfavorable change in inventories in 2024 compared to 2023 primarily due to an increase in Packaging segment inventory balances related to higher volume, partially offset by a favorable change in Paper segment inventory balances due to a smaller increase in Paper segment inventory balances in 2024 compared to 2023; and\n\n\nd)\na net unfavorable change in income taxes in 2024 compared to 2023 primarily due to a larger decrease in income tax receivables in 2023 compared to 2024.\n\n\n23\n\n\n\n\n \n\n\nThese unfavorable changes were partially offset by a net favorable change in accrued liabilities in 2024 compared to 2023 primarily related to higher accruals related to pending litigation in 2024 and higher accruals for employee compensation and benefit liabilities in 2024.\n\n\nInvesting Activities\n\n\nWe used $278 million for investing activities in 2024, compared to $875 million in 2023. In 2024, we spent $670 million\n \nfor internal capital investments, compared to $470 million in 2023. Additionally, in September 2024, we received $400 million in net proceeds from the maturity of our investments in time deposits, which were used to repay our 3.65% senior notes that were due on September 15, 2024.\n\n\nThe details of capital expenditures for property and equipment by segment for the years ended December 31, 2024 and 2023 are included in the table below (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nPackaging\n\n\n \n\n\n$\n\n\n626.6\n\n\n \n\n\n \n\n\n$\n\n\n426.8\n\n\n \n\n\n\n\n\n\nPaper\n\n\n \n\n\n \n\n\n15.0\n\n\n \n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n\n\n\n\nCorporate and Other\n\n\n \n\n\n \n\n\n28.1\n\n\n \n\n\n \n\n\n \n\n\n33.2\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n669.7\n\n\n \n\n\n \n\n\n$\n\n\n469.7\n\n\n \n\n\n\n\n\n\n \n\n\nWe expect capital investments in 2025 to be between $840 million and $870 million.\n \nThese expenditures could increase or decrease as a result of a number of factors, including our financial results, strategic opportunities, future economic conditions, and our regulatory compliance requirements. We currently estimate capital expenditures to comply with environmental regulations will be about $24 million in 2025. Our estimated environmental expenditures could vary significantly depending upon the enactment of new environmental laws and regulations. For additional information, see “Environmental Matters” in this Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n\n\nFinancing Activities\n\n\nIn 2024, net cash used for financing activities was $876 million, compared to $112 million of cash used for financing activities in 2023, an increase of $764 million. We paid $449 million in dividends on our common stock in both 2024 and 2023. We withheld shares to cover $26 million of employee restricted stock taxes in 2024 compared to $16 million of employee restricted stock taxes withheld in 2023. We did not repurchase any shares of the Company’s common stock in 2024, compared to repurchases of 0.3 million shares for $42 million in 2023.\n \n\n\nOn November 30, 2023, we issued $400 million of 5.70% senior notes due 2033 through a registered public offering. The Company paid $4 million of debt issuance costs associated with the new notes, of which $3 million was funded using the net proceeds received from the issuance of new notes and $1 million was funded using cash on hand. The net proceeds received from the issuance of the new notes were invested in time deposits, which are included in marketable debt securities at December 31, 2023. On September 15, 2024, we used the net proceeds from this issuance, together with a portion of cash on hand, to repay our outstanding 3.65% senior notes due 2024. The repayment of these notes was $400 million excluding accrued interest.\n\n\nSee Note 10, Debt, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our debt.\n \n\n\nCommit\nments\n\n\nContractual Obligations\n\n\nOur cash requirements greater than twelve months from contractual obligations and commitments include:\n\n\n•\nDebt obligations and interest payments.\n See Note 10, Debt, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our debt obligations and interest payments and the timing of expected future payments.\n\n\n•\nOperating and finance leases.\n See Note 3, Leases, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our lease obligations and the timing of expected future payments.\n\n\n•\nAsset retirement obligations.\n See Note 13, Asset Retirement Obligations, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our asset retirement obligation at the end of the period.\n\n\n24\n\n\n\n\n \n\n\n•\nPurchase commitments.\n Purchase commitments relate to various purchase agreements for items such as minimum amounts of energy and fiber purchases. See Note 19, Commitments, Guarantees, Indemnifications, and Legal Proceedings, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our purchase commitments and the timing of expected future payments.\n\n\n•\nEmployee benefit obligations.\n See Note 12, Employee Benefits Plans and Other Postretirement Benefits, of the Consolidated Financial Statements included in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K for more information on our employee benefit obligations and the timing of expected future benefit payments under our pension plans and postretirement plans.\n\n\nOff-B\nalance Sheet Arrangements\n \n\n\nThe Company does not have any off-balance sheet arrangements as of December 31, 2024.\n\n\nInflation and Other G\neneral Cost Increases\n \n\n\nWe are subject to both contractual, inflation, and other general cost increases. If we are unable to offset these cost increases by price increases, growth, and/or cost reductions in our operations, these inflation and other general cost increases could have a material adverse effect on our operating cash flows, profitability, and liquidity. We continuously seek opportunities to increase the efficiency of our mills and corrugated products facilities and make extensive capital investments to minimize the impact that inflation has on our cost structure.\n\n\nIn 2024, our total company costs including cost of sales (COS) and selling, general, and administrative expenses (SG&A) was $7.2 billion, and excluding non-cash costs (depreciation, depletion and amortization, pension and postretirement expense, and share-based compensation expense) was $6.6 billion. A 1% increase in COS and SG&A costs would increase costs by $72 million and cash costs by $66 million.\n\n\nCertain items of product input costs have historically been subject to more cost volatility including fiber, purchased energy, and chemicals.\n\n\nEnergy\n\n\nOur mills represent about 90% of our total purchased fuel costs. In 2024, our Packaging and Paper mills consumed about 101 million MMBTUs of fuel, including internally generated and externally purchased, to produce both steam and electricity. The following table for 2024 provides the total MMBTUs purchased externally by fuel type each quarter and the average cost per MMBTU by fuel type for the year. The cost per MMBTU includes the cost of the fuel plus our transportation and delivery costs.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024 Fuel Purchased (millions of MMBTUs)\n\n\n \n\n\n \n\n\n2024 Avg.\n\n\n \n\n\n\n\n\n\nFuel Type\n\n\n \n\n\nFirst\nQuarter\n\n\n \n\n\n \n\n\nSecond\nQuarter\n\n\n \n\n\n \n\n\nThird\nQuarter\n\n\n \n\n\n \n\n\nFourth\nQuarter\n\n\n \n\n\n \n\n\nFull\nYear\n\n\n \n\n\n \n\n\nCost /\nMMBTU\n\n\n \n\n\n\n\n\n\nNatural gas\n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n \n\n\n28.1\n\n\n \n\n\n \n\n\n$\n\n\n3.54\n\n\n \n\n\n\n\n\n\nPurchased bark\n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n2.0\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n \n\n\n2.31\n\n\n \n\n\n\n\n\n\nOther purchased fuels\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n7.04\n\n\n \n\n\n\n\n\n\nTotal mills\n\n\n \n\n\n \n\n\n9.4\n\n\n \n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n \n\n\n \n\n\n8.4\n\n\n \n\n\n \n\n\n \n\n\n9.5\n\n\n \n\n\n \n\n\n \n\n\n36.0\n\n\n \n\n\n \n\n\n$\n\n\n3.34\n\n\n \n\n\n\n\n\n\nIn addition, the mills purchased 22.41 million CkWh (hundred kilowatt-hours) of electricity in 2024. The purchases by quarter and the average cost per CkWh were as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024 Purchased Electricity (millions of CkWh)\n\n\n \n\n\n \n\n\n2024 Avg.\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nFirst\nQuarter\n\n\n \n\n\n \n\n\nSecond\nQuarter\n\n\n \n\n\n \n\n\nThird\nQuarter\n\n\n \n\n\n \n\n\nFourth\nQuarter\n\n\n \n\n\n \n\n\nFull\nYear\n\n\n \n\n\n \n\n\nCost /\nCkWh\n\n\n \n\n\n\n\n\n\nPurchased electricity\n\n\n \n\n\n \n\n\n5.3\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n \n\n\n \n\n\n6.0\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n \n\n\n22.4\n\n\n \n\n\n \n\n\n$\n\n\n6.32\n\n\n \n\n\n\n\n\n\nRegulatory and Environment\nal Matters\n\n\nOur operations are subject to compliance with the laws and regulations in the jurisdictions in which we operate, primarily in the United States. Of particular importance are laws and regulations relating to the environment and health and safety matters.\n\n\n25\n\n\n\n\n \n\n\nEnvironmental compliance requirements are a significant factor affecting our business. We employ processes in the manufacture of containerboard, paper, and pulp, which result in various discharges, emissions and waste disposal. These processes are subject to numerous federal, state, local and foreign environmental laws and regulations. We operate and expect to continue to operate, under environmental permits and similar authorizations from various governmental authorities that regulate such discharges, emissions, and waste disposal. The most significant of these laws affecting the Company are:\n\n\na)\nResource Conservation and Recovery Act (RCRA); \n\n\nb)\nClean Water Act (CWA); \n\n\nc)\nClean Air Act (CAA); \n\n\nd)\nThe Emergency Planning and Community Right-to-Know-Act (EPCRA); \n\n\ne)\nToxic Substance Control Act (TSCA); and \n\n\nf)\nSafe Drinking Water Act (SDWA). \n\n\nWe believe that we are currently in material compliance with these and all applicable environmental rules and regulations. Because environmental regulations are constantly evolving, the Company has incurred, and will continue to incur, costs to maintain compliance with these and other environmental laws. The Company works diligently to anticipate and budget for the impact of applicable environmental regulations and does not currently expect that future environmental compliance obligations will materially affect its business or financial condition. For the year ended December 31, 2024, we spent $60 million, and for both the years ended December 31, 2023 and 2022, we spent $50 million, to comply with the requirements of these and other environmental laws. Additionally, we had $19 million of environmental capital expenditures in 2024, $14 million in 2023, and $11 million in 2022.\n\n\nUnder the CAA, EPA is required to conduct risk assessments for each source category subject to maximum achievable control technologies (MACT) to determine if additional standards are necessary to reduce residual risks from hazardous air pollutants (HAP) emissions. The national emissions standards for hazardous air pollutants (NESHAP) for Chemical Recovery Combustion Sources at pulp mills is due for residual risk and technology review (RTR). In November 2024, PCA was one of seven companies selected by EPA to respond to an extensive questionnaire about operations and equipment to support EPA’s requirement to revise existing Pulp MACT standards. As part of the questionnaire, EPA is requiring companies, including PCA, to undertake extensive pollutant testing scheduled to begin Spring 2025. President Trump’s Executive Order to suspend all federal rulemaking has paused EPA’s review process. At this time, we cannot predict with certainty how this assessment review will impact our pulp mill MACT compliance efforts or whether we will incur additional costs to comply with any revised standards.\n\n\nAs is the case with any industrial operation, PCA has, in the past, incurred costs associated with the remediation of soil or groundwater contamination, as required by the federal Comprehensive Environmental Response, Compensation and Liability Act, commonly known as the federal “Superfund” law, and analogous state laws. Cleanup requirements arise with respect to properties the Company currently owns or operates, former facilities and off-site facilities where the Company has disposed of hazardous substances. As part of the sale to PCA of the containerboard and corrugated products business of Pactiv Corporation in April 1999, Pactiv agreed to retain all liability for all former facilities and all sites associated with pre-closing off-site waste disposal. Pactiv also retained environmentally impaired real property in Filer City, Michigan unrelated to current mill operations. In addition, OfficeMax (now an indirect, wholly owned subsidiary of ODP) retains responsibility for certain environmental liabilities related to some of the businesses, facilities, and assets we acquired from Boise. Generally, this responsibility relates to hazardous substance releases and other environmental incidents that arose before 2004. Some of these liabilities could be significant; however, ODP may not have sufficient funds to satisfy its indemnification obligations, and in some cases, we may not be entitled to such indemnification.\n\n\nBecause liability for remediation costs under environmental laws is strict, meaning that liability is imposed without fault, joint and several, meaning that liability is imposed on each party without regard to contribution, and retroactive, PCA could receive notifications of cleanup liability in the future and this liability could be material. From 2006 through 2024, there were no significant environmental remediation costs at PCA’s mills and corrugated plants. As of December 31, 2024, we maintained an environmental reserve of $25.8 million relating to on-site landfills and surface impoundments as well as ongoing and anticipated remedial projects. The Company believes that it is not reasonably possible that future environmental expenses above the $25.8 million accrued at December 31, 2024, will have a material impact on its financial condition, results of operations, and cash flows.\n\n\n26\n\n\n\n\n \n\n\nWhile legislation regarding the regulation of greenhouse gas emissions has been proposed at the federal level, it is uncertain whether such legislation will be passed and, if so, what the breadth and scope of such legislation will be. The result of the regulation of greenhouse gas emissions could be an increase in our future environmental compliance costs through carbon cap and trade systems, carbon or other related taxes, or additional capital expenditures to modify facilities to reduce carbon emissions, which may be material. However, climate change legislation and the resulting future energy policy could also provide us with opportunities if the use of renewable energy is encouraged. We currently self-generate the majority of our power requirements at our mills using renewable biogenic fuel such as bark, black liquor and biomass, which are derived from renewable and sustainable resources. While we believe we are well-positioned to take advantage of any renewable energy incentives, it is uncertain what the ultimate costs and opportunities of any climate change legislation will be and how our business and industry will be affected.\n\n\nWe are seeking to further improve our environmental impact and have voluntarily set goals to reduce our absolute Scope 1 and 2 (market-based) greenhouse gas emissions by 35% by 2030 from a 2021 baseline year and to reach net-zero carbon emissions within our own operations and our value chain by 2050. In addition, we and our industry support the American Forest & Paper Association’s goal of a 50% reduction in Scope 1 and Scope 2 greenhouse gas emissions intensity by 2030 from a 2005 baseline. We have a carbon neutrality team, consisting of a cross-functional group of key operational, engineering, environmental, and sustainability personnel to lead our efforts. Our strategy to achieve greenhouse gas emissions reductions is premised upon the carbon neutrality of the biogenic fuels used in our operations and we believe that meaningful reductions in greenhouse gas emissions can be achieved through investment in more efficient operations utilizing carbon-neutral fuels and in emerging and advancing technologies. We regularly work to identify and implement projects that will improve our efficiency. To what extent and when we embark upon major capital projects to reduce emissions will depend in part upon technology advancements, emerging regulatory and tax policies involving greenhouse gas emissions and incentives to invest in projects that reduce emissions. We also regularly assess the use of alternative, non-emitting energy sources at our own facilities (such as solar) and opportunities to support additive carbon-free grid power via renewable energy certificates (RECs) and power purchase agreements (PPAs), where feasible to do so, and partnering with utilities to procure carbon-free power where opportunities exist. We annually report key data to our stakeholders regarding our greenhouse gas emissions, among other things, in our responsibility report. Our responsibility report is available on our website and is not intended to be incorporated by reference herein.\n\n\nWe are also subject to extensive federal, state and local laws related to workplace health and safety, and our safety management system includes measures to assure compliance with these laws and regulations. We do not believe that future compliance with health and safety laws and regulations will have a material adverse effect on our financial condition, results of operations or cash flows.\n\n\nCritical Accounting Po\nlicies and Estimates\n\n\nManagement’s discussion and analysis of financial condition and results of operations are based upon the Company’s consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an ongoing basis, PCA evaluates its estimates, including those related to business combinations, goodwill and intangible assets, pensions and other postretirement benefits, environmental liabilities, income taxes, and long-lived asset impairment, among others. PCA bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\n\n\nCritical accounting estimates are those that are most important to the portrayal of our financial condition and results. These estimates require management’s most difficult, subjective, or complex judgments. We review the development, selection, and disclosure of our critical accounting estimates with the Audit Committee of our Board of Directors. The Company believes that of its significant accounting policies, the following involve a higher degree of judgment and/or complexity:\n\n\nPensions\n\n\nThe Company accounts for defined benefit pension plans in accordance with Accounting Standards Codification (“ASC”) 715, \nCompensation - Retirement Benefits\n. The calculation of pension expense and pension liabilities requires decisions about a number of key assumptions that can significantly affect expense and liability amounts, including discount rates, expected return on plan assets, expected rate of compensation increases, longevity and service lives of participants, expected contributions, and other factors. The pension assumptions used to measure pension expense and liabilities are discussed in Note 12, Employee Benefit Plans and Other Postretirement Benefits, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K.\n\n\n27\n\n\n\n\n \n\n\nWe recognize the funded status of our pension plans on our Consolidated Balance Sheet and recognize the actuarial and experienced gains and losses and the prior service costs and credits as a component of “Accumulated Other Comprehensive Loss” in our Consolidated Statement of Changes in Stockholders’ Equity. Actual results that differ from assumptions are accumulated and amortized over future periods and, therefore, generally affect recognized expense in future periods. At December 31, 2024, we had $43.5 million of actuarial losses and prior service costs, net of tax, recorded in “Accumulated other comprehensive loss” on our Consolidated Balance Sheet. Accumulated losses in excess of 10% of the greater of the projected benefit obligation or the market-related value of assets will be recognized on a straight-line basis over the average remaining service period of active employees in the PCA plans (which is between five and nine years) and over the average remaining lifetime of inactive participants of the Boise plan (which is approximately 22 years), to the extent that losses are not offset by gains in subsequent years. While we believe that the assumptions used to measure our pension obligations are reasonable, differences in actual experience or changes in assumptions may materially affect our pension obligations and future expense.\n\n\nWe believe that the accounting estimate related to pensions is a critical accounting estimate because it is highly susceptible to change from period to period. As discussed above, the future effects of pension plans on our financial position and results of operations will depend on economic conditions, employee demographics, mortality rates, retirement rates, investment performance, and funding decisions, among other factors. The following table presents selected assumptions used and expected to be used in the measurement of pension expense in the following periods (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ending December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nPension expense\n\n\n \n\n\n$\n\n\n10.7\n\n\n \n\n\n \n\n\n$\n\n\n8.0\n\n\n \n\n\n \n\n\n$\n\n\n22.1\n\n\n \n\n\n\n\n\n\nAssumptions\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n \n\n\n5.56\n\n\n %\n\n\n \n\n\n \n\n\n4.86\n\n\n %\n\n\n \n\n\n \n\n\n5.06\n\n\n %\n\n\n\n\n\n\nExpected rate of return on plan assets\n\n\n \n\n\n \n\n\n5.71\n\n\n %\n\n\n \n\n\n \n\n\n5.80\n\n\n %\n\n\n \n\n\n \n\n\n5.52\n\n\n %\n\n\n\n\n\n\n \n\n\nA change of 0.25% in either direction to the discount rate or the expected rate of return on plan assets would have had the following effect on 2024 and 2025 pension expense (dollars in millions):\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nIncrease (Decrease) in Pension Expense(a)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nBase Expense\n\n\n \n\n\n \n\n\n0.25% Increase\n\n\n \n\n\n \n\n\n0.25% Decrease\n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n$\n\n\n8.0\n\n\n \n\n\n \n\n\n$\n\n\n0.7\n\n\n \n\n\n \n\n\n$\n\n\n1.4\n\n\n \n\n\n\n\n\n\nExpected rate of return on plan assets\n\n\n \n\n\n \n\n\n8.0\n\n\n \n\n\n \n\n\n \n\n\n(2.8\n\n\n)\n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n$\n\n\n10.7\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n(0.6\n\n\n)\n\n\n\n\n\n\nExpected rate of return on plan assets\n\n\n \n\n\n \n\n\n10.7\n\n\n \n\n\n \n\n\n \n\n\n(2.7\n\n\n)\n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nThe sensitivities shown above are specific to 2024 and 2025. The sensitivities may not be additive, so the impact of changing multiple factors simultaneously cannot be calculated by combining the individual sensitivities shown. \n\n\nFor more information related to our pension benefit plans, see Note 12, Employee Benefit Plans and Other Postretirement Benefits, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K.\n\n\nNew and Recently Adopte\nd Accounting Standards\n\n\nFor a listing of our new and recently adopted accounting standards, see Note 2, Summary of Significant Accounting Policies, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K.\n\n\n28\n\n\n\n\n \n\n\nNon-GAAP Finan\ncial Measures\n\n\nEarnings per diluted share excluding special items, net income excluding special items, EBITDA, EBITDA excluding special items, segment EBITDA, and segment EBITDA excluding special items are non-GAAP financial measures. Management excludes special items, as it believes that these items are not necessarily reflective of the ongoing operations of our business. These measures are presented because they provide a means to evaluate the performance of our segments and our Company on an ongoing basis using the same measures that are used by our management, because these measures assist in providing a meaningful comparison between periods and because these measures are frequently used by investors and other interested parties in the evaluation of companies and the performance of their segments. Any analysis of non-GAAP financial measures should be done in conjunction with results presented in accordance with GAAP. The non-GAAP measures are not intended to be substitutes for GAAP financial measures and should not be used as such. Reconciliations of the non-GAAP measures to the most comparable measure reported in accordance with GAAP are detailed below.\n\n\nThe following table reconciles earnings per diluted share to earnings per diluted share excluding special items for the periods indicated (dollars in millions):\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nEarnings per diluted share, as reported in accordance with GAAP\n\n\n \n\n\n$\n\n\n8.93\n\n\n \n\n\n \n\n\n$\n\n\n8.48\n\n\n \n\n\n\n\n\n\nSpecial items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nJackson mill conversion-related activities (a)\n\n\n \n\n\n \n\n\n0.08\n\n\n \n\n\n \n\n\n \n\n\n0.09\n\n\n \n\n\n\n\n\n\nFacilities closure and other costs (b)\n\n\n \n\n\n \n\n\n0.03\n\n\n \n\n\n \n\n\n \n\n\n0.12\n\n\n \n\n\n\n\n\n\nTotal special items\n\n\n \n\n\n \n\n\n0.11\n\n\n \n\n\n \n\n\n \n\n\n0.21\n\n\n \n\n\n\n\n\n\nEarnings per diluted share, excluding special items\n\n\n \n\n\n$\n\n\n9.04\n\n\n \n\n\n \n\n\n$               8.70 (c)\n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nFor 2024 and 2023, includes $9.7 million and $11.1 million, respectively, of charges related to the announced discontinuation of production of uncoated freesheet paper grades on the No. 3 machine at the Jackson, Alabama mill associated with the permanent conversion of the machine to produce linerboard and other paper-to-containerboard conversion related activities. \n\n\n \n\n\n(b)\nFor 2024, includes $2.7 million of charges related to the closure of corrugated products facilities, partially offset by income primarily related to a favorable lease buyout for a closed corrugated products facility. For 2023, includes $14.4 million of charges related to the closure of corrugated products facilities and design centers, partially offset by a gain on sale of a corrugated products facility.\n\n\n \n\n\n(c)\nAmount may not foot due to rounding.\n\n\n \n\n\nThe following table reconciles net income to net income excluding special items for the periods indicated (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nIncome\nbefore\nTaxes\n\n\n \n\n\n \n\n\nIncome\nTaxes\n\n\n \n\n\n \n\n\nNet\nIncome\n\n\n \n\n\n \n\n\nIncome\nbefore\nTaxes\n\n\n \n\n\n \n\n\nIncome\nTaxes\n\n\n \n\n\n \n\n\nNet\nIncome\n\n\n \n\n\n\n\n\n\nAs reported in accordance with GAAP\n\n\n \n\n\n$\n\n\n1,064.4\n\n\n \n\n\n \n\n\n$\n\n\n(259.3\n\n\n)\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n1,014.1\n\n\n \n\n\n \n\n\n$\n\n\n(248.9\n\n\n)\n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n\n\n\n\nSpecial items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nJackson mill conversion-related activities (d)\n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n \n\n\n \n\n\n(2.4\n\n\n)\n\n\n \n\n\n \n\n\n7.3\n\n\n \n\n\n \n\n\n \n\n\n11.1\n\n\n \n\n\n \n\n\n \n\n\n(2.7\n\n\n)\n\n\n \n\n\n \n\n\n8.4\n\n\n \n\n\n\n\n\n\nFacilities closure and other costs (e)\n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n(0.6\n\n\n)\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n14.4\n\n\n \n\n\n \n\n\n \n\n\n(3.6\n\n\n)\n\n\n \n\n\n \n\n\n10.8\n\n\n \n\n\n\n\n\n\nTotal special items\n\n\n \n\n\n \n\n\n12.4\n\n\n \n\n\n \n\n\n \n\n\n(3.0\n\n\n)\n\n\n \n\n\n \n\n\n9.4\n\n\n \n\n\n \n\n\n \n\n\n25.5\n\n\n \n\n\n \n\n\n \n\n\n(6.3\n\n\n)\n\n\n \n\n\n \n\n\n19.2\n\n\n \n\n\n\n\n\n\nExcluding special items\n\n\n \n\n\n$\n\n\n1,076.8\n\n\n \n\n\n \n\n\n$\n\n\n(262.3\n\n\n)\n\n\n \n\n\n$\n\n\n814.5\n\n\n \n\n\n \n\n\n$\n\n\n1,039.6\n\n\n \n\n\n \n\n\n$\n\n\n(255.2\n\n\n)\n\n\n \n\n\n$\n\n\n784.4\n\n\n \n\n\n\n\n\n\n \n\n\n(d)\nFor 2024 and 2023, includes charges related to the announced discontinuation of production of uncoated freesheet paper grades on the No. 3 machine at the Jackson, Alabama mill associated with the permanent conversion of the machine to produce linerboard and other paper-to-containerboard conversion related activities. \n\n\n \n\n\n(e)\nFor 2024, includes charges related to the closure of corrugated products facilities. These costs were partially offset by income primarily related to a favorable lease buyout for a closed corrugated products facility during the first quarter of 2024. For 2023, includes charges related to the closure of corrugated products facilities and design centers. These costs were partially offset by a gain on sale of a corrugated products facility.\n\n\n29\n\n\n\n\n \n\n\n \n\n\nThe following table reconciles net income to EBITDA and EBITDA excluding special items for the periods indicated (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n\n\n\n\nNon-operating pension (income) expense\n\n\n \n\n\n \n\n\n(4.5\n\n\n)\n\n\n \n\n\n \n\n\n7.7\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n41.4\n\n\n \n\n\n \n\n\n \n\n\n53.3\n\n\n \n\n\n\n\n\n\nProvision for income taxes\n\n\n \n\n\n \n\n\n259.3\n\n\n \n\n\n \n\n\n \n\n\n248.9\n\n\n \n\n\n\n\n\n\nDepreciation, amortization, and depletion\n\n\n \n\n\n \n\n\n525.6\n\n\n \n\n\n \n\n\n \n\n\n517.7\n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n$\n\n\n1,626.9\n\n\n \n\n\n \n\n\n$\n\n\n1,592.8\n\n\n \n\n\n\n\n\n\nSpecial items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nJackson mill conversion-related activities\n\n\n \n\n\n \n\n\n8.3\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n\n\nFacilities closure and other costs\n\n\n \n\n\n \n\n\n1.9\n\n\n \n\n\n \n\n\n \n\n\n8.9\n\n\n \n\n\n\n\n\n\nEBITDA excluding special items\n\n\n \n\n\n$\n\n\n1,637.1\n\n\n \n\n\n \n\n\n$\n\n\n1,603.8\n\n\n \n\n\n\n\n\n\n \n\n\nThe following table reconciles segment operating income (loss) to segment EBITDA and segment EBITDA excluding special items (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nPackaging\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n1,101.5\n\n\n \n\n\n \n\n\n$\n\n\n1,074.3\n\n\n \n\n\n\n\n\n\nDepreciation, amortization, and depletion\n\n\n \n\n\n \n\n\n490.1\n\n\n \n\n\n \n\n\n \n\n\n472.5\n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n \n\n\n1,591.6\n\n\n \n\n\n \n\n\n \n\n\n1,546.8\n\n\n \n\n\n\n\n\n\nFacilities closure and other costs\n\n\n \n\n\n \n\n\n1.9\n\n\n \n\n\n \n\n\n \n\n\n8.9\n\n\n \n\n\n\n\n\n\nJackson mill conversion-related activities\n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nEBITDA excluding special items\n\n\n \n\n\n$\n\n\n1,597.5\n\n\n \n\n\n \n\n\n$\n\n\n1,555.7\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPaper\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n129.7\n\n\n \n\n\n \n\n\n$\n\n\n118.9\n\n\n \n\n\n\n\n\n\nDepreciation, amortization, and depletion\n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n \n\n\n149.2\n\n\n \n\n\n \n\n\n \n\n\n148.5\n\n\n \n\n\n\n\n\n\nJackson mill conversion-related activities\n\n\n \n\n\n \n\n\n4.3\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n\n\nEBITDA excluding special items\n\n\n \n\n\n$\n\n\n153.5\n\n\n \n\n\n \n\n\n$\n\n\n150.6\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCorporate and Other\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating loss\n\n\n \n\n\n$\n\n\n(129.9\n\n\n)\n\n\n \n\n\n$\n\n\n(118.1\n\n\n)\n\n\n\n\n\n\nDepreciation, amortization, and depletion\n\n\n \n\n\n \n\n\n16.0\n\n\n \n\n\n \n\n\n \n\n\n15.6\n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n \n\n\n(113.9\n\n\n)\n\n\n \n\n\n \n\n\n(102.5\n\n\n)\n\n\n\n\n\n\nEBITDA excluding special items\n\n\n \n\n\n$\n\n\n(113.9\n\n\n)\n\n\n \n\n\n$\n\n\n(102.5\n\n\n)\n\n\n\n\n\n\n \n\n\nItem 7A. \nQUANTI\nTATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n\n\nPCA is exposed to the impact of commodity price changes, interest rate changes, and changes in the market value of its financial instruments. To manage these risks, we may from time to time enter into transactions, including certain physical commodity transactions, that are determined to be derivatives. As of December 31, 2024, we are party to certain physical commodity transactions related to natural gas supply contracts. For a discussion of derivatives and hedging activities, see Note 2, Summary of Significant Accounting Policies, of the Notes to Consolidated Financial Statements in “Part II, Item 8. Financial Statements and Supplementary Data” of this Form 10-K.\n\n\nAt December 31, 2024, the interest rates on 100% of PCA’s outstanding debt are fixed.\n\n\n \n\n\n30\n\n\n\n\n \n\n\nItem 8. \nFINANCIAL STATEMEN\nTS AND SUPPLEMENTARY DATA\n\n\n \n\n\nINDEX TO FINANCIAL STATEMENTS\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPackaging Corporation of America Consolidated Financial Statements\n\n\n \n\n\n\n\n\n\nReports of Independent Registered Public Accounting Firm (KPMG LLP, Chicago, IL, Auditor Firm ID: \n185\n)\n\n\n32\n\n\n\n\n\n\nConsolidated Statements of Income and Comprehensive Income for the years ended December 31, 2024, 2023, and 2022\n\n\n34\n\n\n\n\n\n\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n\n\n35\n\n\n\n\n\n\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022\n\n\n36\n\n\n\n\n\n\nConsolidated Statement of Changes in Stockholders’ Equity for the years ended December 31, 2024, 2023, and 2022\n\n\n37\n\n\n\n\n\n\nNotes to Consolidated Financial Statements\n\n\n38\n\n\n\n\n\n\n \n\n\n31\n\n\n\n\n \n\n\nREPORT OF INDEPENDENT REGIST\nERED PUBLIC ACCOUNTING FIRM\n\n\nTo the Stockholders and Board of Directors\n\n\nPackaging Corporation of America:\n\n\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\n \n\n\nWe have audited the accompanying consolidated balance sheets of Packaging Corporation of America and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income and comprehensive income, changes in stockholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control – Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024 based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\n\n\nBasis for Opinions\n \n\n\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n \n\n\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\n \n\n\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n\n\nDefinition and Limitations of Internal Control Over Financial Reporting\n \n\n\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n \n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\n\n32\n\n\n\n\n \n\n\nCritical Audit Matter\n\n\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n \n\n\n \nEvaluation of the value of the pension benefit obligation\n\n\nAs discussed in Notes 2 and 12 to the consolidated financial statements, the Company’s estimated pension benefit obligation totaled $1,119 million as of December 31, 2024. The pension benefit obligation is measured at the actuarial present value as of a date of all benefits attributed by the pension benefit formula to employee service rendered before that date. The determination of the Company’s pension benefit obligation is dependent, in part, on the selection of certain actuarial assumptions, including the discount rate.\n\n\nWe identified the evaluation of the value of the pension benefit obligation as a critical audit matter because of the specialized skills required to evaluate the measurement of the pension benefit obligation. In particular, the measurement of the pension benefit obligation is sensitive to minor changes in the discount rate assumption.\n\n\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s pension benefit obligation valuation process, including a control related to the development of the discount rate. We involved an actuarial professional with specialized skills and knowledge, who assisted in understanding and assessing the actuarial methods and assumptions used to measure the pension benefit obligation. In addition, the actuarial professional assisted with our evaluation of the discount rate by assessing:\n\n\n•\nchanges in the discount rate from the prior year against changes in published indices; \n\n\n•\nthe pattern of cash flows, including consideration of the plan type and plan provisions; and\n\n\n•\nthe selected yield curve and its consistency with the prior year and spot rates.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n/s/ \nKPMG LLP\n\n\n\n\n\n\n \n\n\n \nWe have served as the Company’s auditor since 2014\n.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nChicago, Illinois\n\n\n\n\n\n\n \n\n\nFebruary 27, 2025\n\n\n\n\n\n\n \n\n\n33\n\n\n\n\n \n\n\nPackaging Corporation of America\n\n\nConsolidated Statements of In\ncome and Comprehensive Income\n\n\n(dollars in millions, except per-share data)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nStatements of Income:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n8,383.3\n\n\n \n\n\n \n\n\n$\n\n\n7,802.4\n\n\n \n\n\n \n\n\n$\n\n\n8,478.0\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n(\n6,600.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n6,103.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n6,387.4\n\n\n)\n\n\n\n\n\n\nGross profit\n\n\n \n\n\n \n\n\n1,783.1\n\n\n \n\n\n \n\n\n \n\n\n1,698.9\n\n\n \n\n\n \n\n\n \n\n\n2,090.6\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n(\n610.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n580.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n608.6\n\n\n)\n\n\n\n\n\n\nOther expense, net\n\n\n \n\n\n \n\n\n(\n71.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n42.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n61.3\n\n\n)\n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n1,101.3\n\n\n \n\n\n \n\n\n \n\n\n1,075.1\n\n\n \n\n\n \n\n\n \n\n\n1,420.7\n\n\n \n\n\n\n\n\n\nNon-operating pension income (expense)\n\n\n \n\n\n \n\n\n4.5\n\n\n \n\n\n \n\n\n \n\n\n(\n7.7\n\n\n)\n\n\n \n\n\n \n\n\n14.5\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n(\n41.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n53.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n70.4\n\n\n)\n\n\n\n\n\n\nIncome before taxes\n\n\n \n\n\n \n\n\n1,064.4\n\n\n \n\n\n \n\n\n \n\n\n1,014.1\n\n\n \n\n\n \n\n\n \n\n\n1,364.8\n\n\n \n\n\n\n\n\n\nProvision for income taxes\n\n\n \n\n\n \n\n\n(\n259.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n248.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n335.0\n\n\n)\n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n \n\n\n$\n\n\n1,029.8\n\n\n \n\n\n\n\n\n\nNet income per common share:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n$\n\n\n8.97\n\n\n \n\n\n \n\n\n$\n\n\n8.52\n\n\n \n\n\n \n\n\n$\n\n\n11.08\n\n\n \n\n\n\n\n\n\nDiluted\n\n\n \n\n\n$\n\n\n8.93\n\n\n \n\n\n \n\n\n$\n\n\n8.48\n\n\n \n\n\n \n\n\n$\n\n\n11.03\n\n\n \n\n\n\n\n\n\nDividends declared per common share\n\n\n \n\n\n$\n\n\n5.00\n\n\n \n\n\n \n\n\n$\n\n\n5.00\n\n\n \n\n\n \n\n\n$\n\n\n4.75\n\n\n \n\n\n\n\n\n\nStatements of Comprehensive Income:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n \n\n\n$\n\n\n1,029.8\n\n\n \n\n\n\n\n\n\nOther comprehensive income, net of tax:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForeign currency translation adjustment\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nChanges in unrealized gains (losses) on marketable debt \n   securities, net of tax of ($\n0.1\n) million, ($\n0.6\n) million, and $\n0.5\n \n   million for 2024, 2023, and 2022, respectively\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n(\n1.7\n\n\n)\n\n\n\n\n\n\nAmortization of pension and postretirement plans actuarial loss\n   and prior service cost, net of tax of ($\n1.4\n) million, ($\n2.1\n) million, \n   and ($\n1.5\n) million for 2024, 2023, and 2022, respectively\n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n \n\n\n \n\n\n6.4\n\n\n \n\n\n \n\n\n \n\n\n4.7\n\n\n \n\n\n\n\n\n\nChanges in unfunded employee benefit obligations, net of tax of  \n   ($\n7.6\n) million, ($\n7.8\n) million, and $\n10.1\n million for 2024, 2023, \n   and 2022, respectively\n\n\n \n\n\n \n\n\n23.1\n\n\n \n\n\n \n\n\n \n\n\n23.2\n\n\n \n\n\n \n\n\n \n\n\n(\n30.2\n\n\n)\n\n\n\n\n\n\nOther comprehensive income\n\n\n \n\n\n \n\n\n27.5\n\n\n \n\n\n \n\n\n \n\n\n31.5\n\n\n \n\n\n \n\n\n \n\n\n(\n27.2\n\n\n)\n\n\n\n\n\n\nComprehensive income\n\n\n \n\n\n$\n\n\n832.6\n\n\n \n\n\n \n\n\n$\n\n\n796.7\n\n\n \n\n\n \n\n\n$\n\n\n1,002.6\n\n\n \n\n\n\n\n\n\n \n\n\nSee notes to consolidated financial statements.\n\n\n34\n\n\n\n\n \n\n\nPackaging Corporation of America\n\n\nConsolidated B\nalance Sheets\n\n\n(dollars and shares in millions, except per-share data)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nASSETS\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent Assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n685.0\n\n\n \n\n\n \n\n\n$\n\n\n648.0\n\n\n \n\n\n\n\n\n\nShort-term marketable debt securities ($\n102.0\n million and $\n93.5\n million measured \n   at fair value as of December 31, 2024 and December 31, 2023, respectively)\n\n\n \n\n\n \n\n\n102.0\n\n\n \n\n\n \n\n\n \n\n\n493.5\n\n\n \n\n\n\n\n\n\nAccounts receivable, net of allowance for credit losses and customer deductions \n   of $\n20.6\n million and $\n13.1\n million as of December 31, 2024 and December 31, 2023, \n   respectively\n\n\n \n\n\n \n\n\n1,144.0\n\n\n \n\n\n \n\n\n \n\n\n1,033.2\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n1,124.9\n\n\n \n\n\n \n\n\n \n\n\n1,013.1\n\n\n \n\n\n\n\n\n\nPrepaid expenses and other current assets\n\n\n \n\n\n \n\n\n166.9\n\n\n \n\n\n \n\n\n \n\n\n62.3\n\n\n \n\n\n\n\n\n\nFederal and state income taxes receivable\n\n\n \n\n\n \n\n\n10.2\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n \n\n\n\n\n\n\nTotal current assets\n\n\n \n\n\n \n\n\n3,233.0\n\n\n \n\n\n \n\n\n \n\n\n3,254.4\n\n\n \n\n\n\n\n\n\nProperty, plant, and equipment, net\n\n\n \n\n\n \n\n\n4,039.0\n\n\n \n\n\n \n\n\n \n\n\n3,863.8\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n922.4\n\n\n \n\n\n \n\n\n \n\n\n922.4\n\n\n \n\n\n\n\n\n\nOther intangible assets, net\n\n\n \n\n\n \n\n\n191.9\n\n\n \n\n\n \n\n\n \n\n\n229.6\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n \n\n\n \n\n\n276.9\n\n\n \n\n\n \n\n\n \n\n\n279.6\n\n\n \n\n\n\n\n\n\nLong-term marketable debt securities\n\n\n \n\n\n \n\n\n65.2\n\n\n \n\n\n \n\n\n \n\n\n64.1\n\n\n \n\n\n\n\n\n\nOther long-term assets\n\n\n \n\n\n \n\n\n104.8\n\n\n \n\n\n \n\n\n \n\n\n67.2\n\n\n \n\n\n\n\n\n\nTotal assets\n\n\n \n\n\n$\n\n\n8,833.2\n\n\n \n\n\n \n\n\n$\n\n\n8,681.1\n\n\n \n\n\n\n\n\n\nLIABILITIES AND STOCKHOLDERS' EQUITY\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent maturities of long-term debt\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n399.6\n\n\n \n\n\n\n\n\n\nOperating lease obligations\n\n\n \n\n\n \n\n\n80.5\n\n\n \n\n\n \n\n\n \n\n\n78.6\n\n\n \n\n\n\n\n\n\nFinance lease obligations\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n2.0\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n430.3\n\n\n \n\n\n \n\n\n \n\n\n402.4\n\n\n \n\n\n\n\n\n\nDividends payable\n\n\n \n\n\n \n\n\n116.3\n\n\n \n\n\n \n\n\n \n\n\n115.9\n\n\n \n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n362.9\n\n\n \n\n\n \n\n\n \n\n\n253.5\n\n\n \n\n\n\n\n\n\nAccrued interest\n\n\n \n\n\n \n\n\n9.5\n\n\n \n\n\n \n\n\n \n\n\n13.7\n\n\n \n\n\n\n\n\n\nTotal current liabilities\n\n\n \n\n\n \n\n\n1,001.6\n\n\n \n\n\n \n\n\n \n\n\n1,265.7\n\n\n \n\n\n\n\n\n\nLong-term liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n \n\n\n2,474.2\n\n\n \n\n\n \n\n\n \n\n\n2,472.2\n\n\n \n\n\n\n\n\n\nOperating lease obligations\n\n\n \n\n\n \n\n\n208.0\n\n\n \n\n\n \n\n\n \n\n\n212.1\n\n\n \n\n\n\n\n\n\nFinance lease obligations\n\n\n \n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n \n\n\n561.9\n\n\n \n\n\n \n\n\n \n\n\n558.0\n\n\n \n\n\n\n\n\n\nCompensation and benefits\n\n\n \n\n\n \n\n\n95.9\n\n\n \n\n\n \n\n\n \n\n\n106.4\n\n\n \n\n\n\n\n\n\nOther long-term liabilities\n\n\n \n\n\n \n\n\n80.9\n\n\n \n\n\n \n\n\n \n\n\n60.7\n\n\n \n\n\n\n\n\n\nTotal long-term liabilities\n\n\n \n\n\n \n\n\n3,427.6\n\n\n \n\n\n \n\n\n \n\n\n3,418.1\n\n\n \n\n\n\n\n\n\nCommitments and contingent liabilities (Note 19)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStockholders' equity:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCommon stock, par value $\n0.01\n per share, \n300.0\n million shares authorized, \n   \n89.8\n million and \n89.6\n million shares issued as of December 31, 2024 and \n   December 31, 2023, respectively\n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n\n\n\n\nAdditional paid in capital\n\n\n \n\n\n \n\n\n669.8\n\n\n \n\n\n \n\n\n \n\n\n620.1\n\n\n \n\n\n\n\n\n\nRetained earnings\n\n\n \n\n\n \n\n\n3,776.7\n\n\n \n\n\n \n\n\n \n\n\n3,447.2\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss\n\n\n \n\n\n \n\n\n(\n43.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n70.9\n\n\n)\n\n\n\n\n\n\nTotal stockholders' equity\n\n\n \n\n\n \n\n\n4,404.0\n\n\n \n\n\n \n\n\n \n\n\n3,997.3\n\n\n \n\n\n\n\n\n\nTotal liabilities and stockholders' equity\n\n\n \n\n\n$\n\n\n8,833.2\n\n\n \n\n\n \n\n\n$\n\n\n8,681.1\n\n\n \n\n\n\n\n\n\n \n\n\nSee notes to consolidated financial statements.\n\n\n35\n\n\n\n\n \n\n\nPackaging Corporation of America\n\n\nConsolidated Statem\nents of Cash Flows\n\n\n(dollars in millions)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash Flows from Operating Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n \n\n\n$\n\n\n1,029.8\n\n\n \n\n\n\n\n\n\nAdjustments to reconcile net income to net cash provided by operating activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation, depletion, and amortization of intangibles\n\n\n \n\n\n \n\n\n525.6\n\n\n \n\n\n \n\n\n \n\n\n517.7\n\n\n \n\n\n \n\n\n \n\n\n456.8\n\n\n \n\n\n\n\n\n\nAmortization of deferred financing costs\n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n\n\nShare-based compensation expense\n\n\n \n\n\n \n\n\n48.8\n\n\n \n\n\n \n\n\n \n\n\n40.0\n\n\n \n\n\n \n\n\n \n\n\n35.6\n\n\n \n\n\n\n\n\n\nDeferred income tax (benefit) provision\n\n\n \n\n\n \n\n\n(\n4.2\n\n\n)\n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n \n\n\n \n\n\n86.0\n\n\n \n\n\n\n\n\n\nNet loss on asset disposals\n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n9.1\n\n\n \n\n\n \n\n\n \n\n\n15.2\n\n\n \n\n\n\n\n\n\nPension and post-retirement benefits expense, net of contributions\n\n\n \n\n\n \n\n\n(\n19.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n30.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n47.4\n\n\n)\n\n\n\n\n\n\nOther, net\n\n\n \n\n\n \n\n\n24.2\n\n\n \n\n\n \n\n\n \n\n\n13.3\n\n\n \n\n\n \n\n\n \n\n\n2.0\n\n\n \n\n\n\n\n\n\nChanges in operating assets and liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(Increase) decrease in assets —\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts receivable\n\n\n \n\n\n \n\n\n(\n110.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.4\n\n\n)\n\n\n \n\n\n \n\n\n39.3\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n(\n111.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n35.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n75.2\n\n\n)\n\n\n\n\n\n\nPrepaid expenses and other current assets\n\n\n \n\n\n \n\n\n(\n104.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n11.0\n\n\n)\n\n\n\n\n\n\nIncrease (decrease) in liabilities —\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n18.3\n\n\n \n\n\n \n\n\n \n\n\n11.4\n\n\n \n\n\n \n\n\n \n\n\n(\n18.1\n\n\n)\n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n104.2\n\n\n \n\n\n \n\n\n \n\n\n(\n8.2\n\n\n)\n\n\n \n\n\n \n\n\n8.3\n\n\n \n\n\n\n\n\n\nFederal and state income taxes payable/receivable\n\n\n \n\n\n \n\n\n(\n5.9\n\n\n)\n\n\n \n\n\n \n\n\n31.4\n\n\n \n\n\n \n\n\n \n\n\n(\n28.4\n\n\n)\n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n \n\n\n \n\n\n1,191.2\n\n\n \n\n\n \n\n\n \n\n\n1,315.1\n\n\n \n\n\n \n\n\n \n\n\n1,495.0\n\n\n \n\n\n\n\n\n\nCash Flows from Investing Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdditions to property, plant, and equipment\n\n\n \n\n\n \n\n\n(\n669.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n469.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n824.2\n\n\n)\n\n\n\n\n\n\nAdditions to other long-term assets\n\n\n \n\n\n \n\n\n(\n1.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n6.2\n\n\n)\n\n\n\n\n\n\nProceeds from asset disposals\n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n\n\n\n\nPurchases of held-to-maturity debt securities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n400.0\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nProceeds from maturities of held-to-maturity debt securities\n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPurchases of available-for-sale debt securities\n\n\n \n\n\n \n\n\n(\n114.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n107.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n126.1\n\n\n)\n\n\n\n\n\n\nProceeds from sales of available-for-sale debt securities\n\n\n \n\n\n \n\n\n8.6\n\n\n \n\n\n \n\n\n \n\n\n5.5\n\n\n \n\n\n \n\n\n \n\n\n31.1\n\n\n \n\n\n\n\n\n\nProceeds from maturities of available-for-sale debt securities\n\n\n \n\n\n \n\n\n98.2\n\n\n \n\n\n \n\n\n \n\n\n97.3\n\n\n \n\n\n \n\n\n \n\n\n87.6\n\n\n \n\n\n\n\n\n\nOther, net\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1.9\n\n\n \n\n\n\n\n\n\nNet cash used for investing activities\n\n\n \n\n\n \n\n\n(\n277.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n875.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n833.7\n\n\n)\n\n\n\n\n\n\nCash Flows from Financing Activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRepayments of debt and finance lease obligations\n\n\n \n\n\n \n\n\n(\n401.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.7\n\n\n)\n\n\n\n\n\n\nNet proceeds received from issuance of debt\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n397.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nFinancing costs paid\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nCommon stock dividends paid\n\n\n \n\n\n \n\n\n(\n448.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n448.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n420.3\n\n\n)\n\n\n\n\n\n\nRepurchases of common stock\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n41.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n522.6\n\n\n)\n\n\n\n\n\n\nShares withheld to cover employee restricted stock taxes\n\n\n \n\n\n \n\n\n(\n25.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n15.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n15.4\n\n\n)\n\n\n\n\n\n\nNet cash used for financing activities\n\n\n \n\n\n \n\n\n(\n876.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n112.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n960.0\n\n\n)\n\n\n\n\n\n\nNet increase (decrease) in cash and cash equivalents\n\n\n \n\n\n \n\n\n37.0\n\n\n \n\n\n \n\n\n \n\n\n328.0\n\n\n \n\n\n \n\n\n \n\n\n(\n298.7\n\n\n)\n\n\n\n\n\n\nCash and cash equivalents, beginning of year\n\n\n \n\n\n \n\n\n648.0\n\n\n \n\n\n \n\n\n \n\n\n320.0\n\n\n \n\n\n \n\n\n \n\n\n618.7\n\n\n \n\n\n\n\n\n\nCash and cash equivalents, end of year\n\n\n \n\n\n$\n\n\n685.0\n\n\n \n\n\n \n\n\n$\n\n\n648.0\n\n\n \n\n\n \n\n\n$\n\n\n320.0\n\n\n \n\n\n\n\n\n\n \n\n\nSee notes to consolidated financial statements.\n\n\n36\n\n\n\n\n \n\n\nPackaging Corporation of America\n\n\nConsolidated Statements of Ch\nanges in Stockholders' Equity\n\n\n(dollars in millions and shares in thousands)\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nCommon Stock\n\n\n \n\n\n \n\n\nAdditional\nPaid in\n\n\n \n\n\n \n\n\nRetained\n\n\n \n\n\n \n\n\nAccumulated\nOther\nComprehensive\n\n\n \n\n\n \n\n\n \n\n\nTotal\nStockholders'\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nCapital\n\n\n \n\n\n \n\n\nEarnings\n\n\n \n\n\n \n\n\nLoss\n\n\n \n\n\n \n\n\n \n\n\nEquity\n\n\n \n\n\n\n\n\n\nBalance at January 1, 2022\n\n\n \n\n\n \n\n\n93,539\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n579.4\n\n\n \n\n\n \n\n\n \n\n\n3,102.1\n\n\n \n\n\n \n\n\n \n\n\n(\n75.2\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n3,607.2\n\n\n \n\n\n\n\n\n\nCommon stock repurchases and retirements\n\n\n \n\n\n \n\n\n(\n4,035\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n33.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n489.1\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n522.6\n\n\n)\n\n\n\n\n\n\nCommon stock withheld and retired to\n   cover taxes on vested stock awards\n\n\n \n\n\n \n\n\n(\n111\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n14.5\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n15.4\n\n\n)\n\n\n\n\n\n\nCommon stock dividends declared\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n441.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n441.2\n\n\n)\n\n\n\n\n\n\nShare-based compensation and other\n\n\n \n\n\n \n\n\n302\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n36.8\n\n\n \n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n36.5\n\n\n \n\n\n\n\n\n\nComprehensive income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,029.8\n\n\n \n\n\n \n\n\n \n\n\n(\n27.2\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n1,002.6\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2022\n\n\n \n\n\n \n\n\n89,695\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n581.8\n\n\n \n\n\n \n\n\n \n\n\n3,186.8\n\n\n \n\n\n \n\n\n \n\n\n(\n102.4\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n3,667.1\n\n\n \n\n\n\n\n\n\nCommon stock repurchases and retirements\n\n\n \n\n\n \n\n\n(\n286\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n2.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n39.0\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n41.5\n\n\n)\n\n\n\n\n\n\nCommon stock withheld and retired to\n   cover taxes on vested stock awards\n\n\n \n\n\n \n\n\n(\n121\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n14.6\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n15.7\n\n\n)\n\n\n\n\n\n\nCommon stock dividends declared\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n451.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n451.2\n\n\n)\n\n\n\n\n\n\nShare-based compensation and other\n\n\n \n\n\n \n\n\n337\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n41.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n41.9\n\n\n \n\n\n\n\n\n\nComprehensive income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n765.2\n\n\n \n\n\n \n\n\n \n\n\n31.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n796.7\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2023\n\n\n \n\n\n \n\n\n89,625\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n620.1\n\n\n \n\n\n \n\n\n$\n\n\n3,447.2\n\n\n \n\n\n \n\n\n$\n\n\n(\n70.9\n\n\n)\n\n\n \n\n\n \n\n\n$\n\n\n3,997.3\n\n\n \n\n\n\n\n\n\nCommon stock withheld and retired to\n   cover taxes on vested stock awards\n\n\n \n\n\n \n\n\n(\n143\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n24.4\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n25.7\n\n\n)\n\n\n\n\n\n\nCommon stock dividends declared\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n451.3\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n451.3\n\n\n)\n\n\n\n\n\n\nShare-based compensation and other\n\n\n \n\n\n \n\n\n320\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n51.0\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n51.1\n\n\n \n\n\n\n\n\n\nComprehensive income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n805.1\n\n\n \n\n\n \n\n\n \n\n\n27.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n832.6\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2024\n\n\n \n\n\n \n\n\n89,802\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n669.8\n\n\n \n\n\n \n\n\n$\n\n\n3,776.7\n\n\n \n\n\n \n\n\n$\n\n\n(\n43.4\n\n\n)\n\n\n \n\n\n \n\n\n$\n\n\n4,404.0\n\n\n \n\n\n\n\n\n\n \n\n\nSee notes to consolidated financial statements.\n\n\n37\n\n\n\n\n \n\n\nNotes to Consolidated\n Financial Statements\n\n\n1.\nNature of Operations and Basis of Presentation\nPackaging Corporation of America (“we,” “us,” “our,” “PCA,” or the “Company”) was incorporated on \nJanuary 25, 1999\n. In April 1999, PCA acquired the containerboard and corrugated packaging products business of Pactiv Corporation (Pactiv), formerly known as Tenneco Packaging, Inc., a wholly owned subsidiary of Tenneco Inc. We are a large, diverse manufacturer of both packaging and paper products. We are headquartered in Lake Forest, Illinois and we operate primarily in the United States. We have approximately \n15,400\n employees.\nWe report our business in \nthree\n reportable segments: Packaging, Paper, and Corporate and Other. Our Packaging segment produces a wide variety of containerboard and corrugated packaging products. The Paper segment manufactures and sells a range of communication-based papers.\n \nCorporate and Other includes support staff services and related assets and liabilities, transportation assets, and activity related to other ancillary support operations. For more information about our segments, see Note 18, Segment Information.\nThe consolidated financial statements include the accounts of PCA and its majority-owned subsidiaries after elimination of intercompany balances and transactions.\n\n\n2.\nSummary of Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions about future events. These estimates and the underlying assumptions affect the amounts of assets and liabilities reported, disclosures about contingent assets and liabilities, and reported amounts of revenues and expenses. These estimates and assumptions are based on management’s best estimates and judgment. Management evaluates its estimates and assumptions on an ongoing basis using historical experience and other factors, including the current economic environment. We adjust such estimates and assumptions when facts and circumstances dictate. As future events and their effects cannot be determined with precision, actual results could differ significantly from these estimates. Changes in these estimates will be reflected in the consolidated financial statements in future periods.\nRevenue Recognition\nIn accordance with Accounting Standards Update (“ASU”) 2014-09 (Topic 606): \nRevenue from Contracts with Customers\n, we recognize revenue when control of the promised goods or services is transferred to customers in an amount that reflects the consideration expected to be received in exchange for those goods or services. The timing of revenue recognition for most goods and services occurs when performance obligations under the terms of a contract with a customer are satisfied. This occurs with the transfer of control of our products at a specific point in time. For most packaging and paper products, revenue is recognized when the product is shipped from the mill or from our manufacturing facility to our customer. Shipping and handling fees billed to a customer are recorded on a gross basis in “Net sales,” with the corresponding shipping and handling costs included in “Cost of sales” in the concurrent period as the revenue is recorded. We present taxes collected from customers and remitted to governmental authorities on a net basis in our Consolidated Statements of Income. See Note 4, Revenue, for more information.\nPlanned Major Maintenance Costs\nThe Company accounts for its planned major maintenance activities in accordance with ASC 360, \nProperty, Plant, and Equipment\n, using the deferral method. All maintenance costs incurred during the year are expensed in the year in which the maintenance activity occurs.\nShare-Based Compensation\nWe recognize compensation expense for awards granted under the PCA long-term equity incentive plans based on the fair value on the grant date. We recognize the cost of the equity awards expected to vest over the period the awards vest and for performance units, compensation expense is recognized regardless of whether the market conditions of the respective performance unit are satisfied. See Note 14, Share-Based Compensation, for more information.\n\n\n38\n\n\n\n\n \n\n\nCash and Cash Equivalents\nCash and cash equivalents include all cash balances and highly liquid investments with original maturities of three months or less at the date of purchase. Cash equivalents are stated at cost, which approximates market. Cash and cash equivalents totaled $\n685.0\n million and $\n648.0\n million at December 31, 2024 and 2023, respectively, which included cash equivalents of $\n614.7\n million and $\n589.1\n million, respectively. At December 31, 2024 and 2023, we had $\n0.7\n million and $\n2.1\n million, respectively, of cash at our operations outside the United States.\n \nMarketable Debt Securities\n\tA majority of the Company’s marketable debt securities have been classified and accounted for as available-for-sale (AFS) marketable debt securities in accordance with ASU 2016-13, \nFinancial Instruments – Credit Losses \n(Topic 326). Short-term investments classified as held-to-maturity (HTM) are financial instruments that the Company has the intent and ability to hold to maturity. The Company reports its AFS marketable debt securities at fair value and held-to-maturity investments at amortized cost, which approximates fair value. Our marketable debt securities are classified as short-term or long-term based on each security’s underlying contractual maturity date.\n \n\tThe Company’s AFS marketable debt securities are analyzed at the individual debt security level. Changes in the fair value of the debt security have the potential to impact accumulated other comprehensive income (loss) (AOCI), the Company’s earnings, or both.\n \n\tThe Company regularly reviews its investment portfolio to determine if any debt security is impaired. A decline in the fair value of the debt security below its amortized cost results in an impairment of the debt security. If there is an intent to sell the debt security, or if it is more likely than not that the debt security will be sold prior to recovering the amortized cost basis, the Company recognizes the impairment as a realized loss in earnings by writing down the debt security’s amortized cost basis.\n \n\tAdditional analysis is required if there is not an intent to sell the debt security, or if a recovery of the amortized cost basis is expected to be made prior to the sale of the security. If any portion of the impairment is the result of a credit loss, the Company recognizes this portion in earnings through an allowance for credit losses, with the remainder recognized as unrealized loss in AOCI. Subsequent improvements in credit losses are recognized as a reduction in the allowance. Any impairment not attributed to credit loss is recognized as an unrealized loss in AOCI in its entirety.\n\tThe Company considers several factors when determining if a portion of an impairment is the result of a credit loss including, but not limited to, adverse conditions related to the financial health and future outlook of the issuer; the credit quality of the issuer, as reported by credit rating agencies; trends present in the issuer’s industry in which it operates; and general market conditions.\n \tFor the years ended December 31, 2024 and 2023, we do \nno\nt consider any of the impairments related to our marketable debt securities to be the result of credit losses. See Note 11, Cash, Cash Equivalents, and Marketable Debt Securities, for more information.\n \nTrade Accounts Receivable, Allowances, and Customer Deductions\nTrade accounts receivable are recorded at amortized cost and represent a contractual right to receive payment from a customer. The Company’s trade accounts receivable are short-term receivables, with most requiring payment within 30 to 60 days, and represent the primary class of financing receivables utilized by the Company.\n The Company has entered into a number of customer-based supply chain financing programs to accelerate the receipt of payments for outstanding accounts receivable from certain customers. Receivables transferred under these programs meet the requirements to be accounted for as sales in accordance with guidance under Financial Accounting Standards Board (“FASB”) ASC 860, \nTransfers and Servicing. \nThe receivables are sold without recourse and are reflected as a reduction of accounts receivable on the Consolidated Balance Sheets at the time of sale. The corresponding proceeds are reflected in cash flows from operating activities within the Consolidated Statements of Cash Flows. Receivables involved with these programs constituted about \n2\n% of our 2024 and 2023 net sales, respectively.\nIn accordance with ASU 2016-13, \nFinancial Instruments – Credit Losses \n(Topic 326), the Company established an allowance for credit losses, which is a valuation account that estimates the expected credit loss over the lifetime of the asset and is deducted from, or added to, the amortized cost basis of the trade accounts receivable. The allowance for credit losses is based upon a combination of factors such as historical collection experience, aged receivables, current economic conditions, and reasonable and supportable forecasts on future economic conditions. Expected recoveries of amounts previously written off, not to exceed the aggregate of the amount previously written off, are also considered when determining the necessary allowance at the balance sheet date. When determining the allowance for credit losses, management also considers specific customer accounts that may be considered higher risk or uncollectible due to customer industry trends, bankruptcy filings, or substantial downgrades of credit scores.\n \n\n\n39\n\n\n\n\n \n\n\nCurrent period estimates for the allowance for credit losses are compared against the allowance previously recorded, and all required adjustments are reported as credit loss expense (for expected losses or write offs) or a reversal of credit loss expense (for expected recoveries) in net income. Outstanding trade accounts receivable balances are written off when deemed uncollectible after undergoing reasonable collection efforts. At December 31, 2024 and 2023, the allowance for credit losses was $\n9.8\n million and $\n3.9\n million, respectively.\n \nThe customer deductions reserve represents the estimated amount required for customer returns, allowances, and earned discounts. Based on the Company’s experience, customer returns, allowances, and earned discounts have averaged approximately \n1\n% of gross selling price. Accordingly, PCA reserves \n1\n% of its open customer accounts receivable balance for these items. The reserves for customer deductions of $\n10.8\n million\n \nand $\n9.2\n million\n \nat December 31, 2024 and 2023, respectively, are also included as a reduction of the accounts receivable balance.\nDerivative Instruments and Hedging Activities\nPCA is exposed to the impact of commodity price changes, interest rate changes, and changes in the market value of its financial instruments. To manage these risks, we may, from time to time, enter into transactions, including certain physical commodity transactions, that are determined to be derivatives. We do not enter into derivative arrangements for trading or speculative purposes.\nThe Company records its derivatives, if any, in accordance with ASC 815, \nDerivatives and Hedging\n. The guidance requires the Company to recognize derivative instruments as either assets or liabilities on the balance sheet at fair value. The accounting for changes in the fair value of a derivative depends on the intended use and designation of the derivative instrument. For a derivative designated as a fair value hedge, the gain or loss on the derivative is recognized in earnings in the period of change at fair value together with the offsetting gain or loss on the hedged item. For a derivative instrument designated as a cash flow hedge, the effective portion of the derivative’s gain or loss is initially reported as a component of AOCI and is subsequently recognized in earnings when the hedged exposure affects earnings. The ineffective portion of the gain or loss is recognized in earnings.\n \nFor the years ended December 31, 2024 and 2023, PCA has entered into master supply contracts, or physical commodity contracts, with suppliers and distributors of natural gas for several of its manufacturing locations. These physical commodity contracts meet the criteria of derivatives under ASC 815 but qualify for the normal purchase normal sales (“NPNS”) scope exception, which we have elected. As such, PCA is not required to apply derivative accounting treatment as required in ASC 815 to these physical commodity transactions.\nFair Value Measurements\nPCA measures the fair value of its financial instruments and marketable debt securities in accordance with ASC 820, \nFair Value Measurements and Disclosures\n. The guidance defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. It is determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, ASC 820 establishes the following hierarchy that prioritizes the inputs to valuation methodologies used to measure fair value:\nLevel 1 — Valuations based on quoted prices for identical assets and liabilities in active markets.\nLevel 2 — Valuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\nLevel 3 — Valuations based on unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nAssets that are measured at fair value using the net asset value (NAV) per share as a practical expedient are not categorized within the fair value hierarchy.\n \nFinancial instruments and marketable debt securities measured at fair value on a recurring basis include the fair values of our AFS marketable debt securities and our pension and postretirement benefit assets and liabilities. The valuation techniques used to measure the fair value of the Company’s marketable debt securities and pension and postretirement benefit assets and liabilities, which generally have counterparties with high credit ratings, are based on quoted market prices or model-driven valuations using significant inputs derived from or corroborated by observable market data. See Note 11, Cash, Cash Equivalents, and Marketable Debt Securities, and Note 12, Employee Benefit Plans and Other Postretirement Benefits, for more information.\n \n\n\n40\n\n\n\n\n \n\n\nOther assets and liabilities measured and recognized at fair value on a nonrecurring basis include assets acquired and liabilities assumed and our asset retirement obligations. Given the nature of these assets and liabilities, evaluating their fair value from the perspective of a market participant is inherently complex. Assumptions and estimates about future values can be affected by a variety of internal and external factors. Changes in these factors may require us to revise our estimates and could require us to retroactively adjust provisional amounts that we recorded for the fair values of assets acquired and liabilities assumed in connection with business combinations. These adjustments could have a material effect on our financial condition and results of operations. See Note 13, Asset Retirement Obligations, for more information.\nInventory Valuation\nWe value our raw materials, work in process, and finished goods inventories using lower of cost, as determined by the average cost method, or net realizable value. Supplies and materials, which are used for the repair and maintenance of our machinery and equipment, are valued at the first-in, first-out (FIFO) or average cost methods.\nThe components of inventories were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nRaw materials\n\n\n \n\n\n$\n\n\n356.6\n\n\n \n\n\n \n\n\n$\n\n\n326.2\n\n\n \n\n\n\n\n\n\nWork in process\n\n\n \n\n\n \n\n\n15.5\n\n\n \n\n\n \n\n\n \n\n\n14.9\n\n\n \n\n\n\n\n\n\nFinished goods\n\n\n \n\n\n \n\n\n234.0\n\n\n \n\n\n \n\n\n \n\n\n200.5\n\n\n \n\n\n\n\n\n\nSupplies and materials\n\n\n \n\n\n \n\n\n518.8\n\n\n \n\n\n \n\n\n \n\n\n471.5\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n$\n\n\n1,124.9\n\n\n \n\n\n \n\n\n$\n\n\n1,013.1\n\n\n \n\n\n\n\nProperty, Plant, and Equipment\nProperty, plant, and equipment are recorded at cost. Cost includes expenditures for major improvements and replacements and the amount of interest cost associated with significant capital additions. Repairs and maintenance costs are expensed as incurred\n.\n When property and equipment are retired, sold, or otherwise disposed of, the asset’s carrying amount and related accumulated depreciation are removed from the accounts and any gain or loss is included in “Other expense, net” in our Consolidated Statements of Income.\nProperty, plant, and equipment consisted of the following (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nLand and land improvements\n\n\n \n\n\n$\n\n\n203.4\n\n\n \n\n\n \n\n\n$\n\n\n197.8\n\n\n \n\n\n\n\n\n\nBuildings\n\n\n \n\n\n \n\n\n1,140.0\n\n\n \n\n\n \n\n\n \n\n\n1,090.4\n\n\n \n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n \n\n\n7,368.8\n\n\n \n\n\n \n\n\n \n\n\n7,006.7\n\n\n \n\n\n\n\n\n\nConstruction in progress\n\n\n \n\n\n \n\n\n397.2\n\n\n \n\n\n \n\n\n \n\n\n335.8\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n195.8\n\n\n \n\n\n \n\n\n \n\n\n177.0\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment, at cost\n\n\n \n\n\n \n\n\n9,305.2\n\n\n \n\n\n \n\n\n \n\n\n8,807.7\n\n\n \n\n\n\n\n\n\nLess accumulated depreciation\n\n\n \n\n\n \n\n\n(\n5,266.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n4,943.9\n\n\n)\n\n\n\n\n\n\nProperty, plant, and equipment, net\n\n\n \n\n\n$\n\n\n4,039.0\n\n\n \n\n\n \n\n\n$\n\n\n3,863.8\n\n\n \n\n\n\n\n \nThe amount of interest capitalized from construction in progress was $\n10.1\n million, $\n8.1\n million, and $\n7.3\n million for the years ended December 31, 2024, 2023, and 2022, respectively. At December 31, 2024 and December 31, 2023, purchases of property, plant, and equipment included in accounts payable were $\n33.8\n million and $\n24.2\n million, respectively.\nDepreciation is computed on the straight-line basis over the estimated useful lives of the related assets. Assets under finance leases are depreciated on the straight-line method over the term of the lease or the useful life, if shorter.\n The following lives are used for the various categories of assets:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBuildings and land improvements\n\n\n \n\n\n5\n to \n40 years\n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n3 \nto \n25 years\n\n\n\n\n\n\nTrucks and automobiles\n\n\n \n\n\n3\n to \n20 years\n\n\n\n\n\n\nFurniture and fixtures\n\n\n \n\n\n3\n to \n25 years\n\n\n\n\n\n\nComputers and hardware\n\n\n \n\n\n3 \nto \n10 years\n\n\n\n\n\n\nLeasehold improvements\n\n\n \n\n\nPeriod of the\nlease\n \nor useful\nlife, if shorter\n\n\n\n\n \n\n\n41\n\n\n\n\n \n\n\n \nThe amount of depreciation expense was $\n485.3\n million, $\n475.3\n million, and $\n413.7\n million for the years ended December 31, 2024, 2023, and 2022, respectively. In 2024, 2023, and 2022, we recognized incremental depreciation expense of $\n2.2\n million, $\n14.4\n million, and $\n5.7\n million, respectively, primarily related to Jackson mill conversion-related activities and closures of corrugated products facilities.\n \nPursuant to the terms of an industrial revenue bond, title to certain property, plant, and equipment was transferred to a municipal development authority in 2009 in order to receive a property tax abatement. The title of these assets would revert back to PCA upon retirement or cancellation of the bond. For the year ended December 31, 2023, the assets were included in the consolidated balance sheets under the caption “Property, plant, and equipment, net,” as all risks and rewards remained with the Company. The last of these industrial revenue bonds matured during 2024, and there were no items outstanding for the year ended December 31, 2024.\n \nLeases\nWe determine if an arrangement is, or contains, a lease at the inception date based on the presence of identified assets and our right to obtain substantially all of the economic benefit from or to direct the use of such assets. When we determine a lease exists, we record a right-of-use asset and corresponding lease liability on our consolidated balance sheets. Right-of-use assets represent our right to use an underlying asset for the lease term. Lease liabilities represent our obligation to make lease payments arising from the lease. Right-of-use assets are recognized at commencement date at the value of the lease liability and are adjusted for any prepayments, lease incentives received, and initial direct costs incurred. Lease liabilities are recognized at lease commencement date based on the present value of remaining lease payments over the lease term. As the discount rate implicit in the lease is not readily determinable in most of our leases, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. Our lease terms include options to extend or terminate the lease when it is reasonably certain that we will exercise that option.\n \nOperating lease balances are included in Operating lease right-of-use assets with the related liabilities included in Current operating lease obligations and Long-term operating lease obligations. Assets under finance leases are included in Property, plant and equipment, net, with the related liabilities included in Current finance lease obligations and Long-term finance lease obligations\n.\n \nWe do not record lease contracts with a term of 12 months or less on our consolidated balance sheets.\nWe recognize fixed lease expense for operating leases on a straight-line basis over the lease term. For finance leases, we recognize amortization expense on the right-of-use asset and interest expense on the lease liability over the lease term.\nWe have lease agreements with non-lease components that relate to lease components (e.g., common area maintenance such as cleaning or landscaping, insurance, etc.). We account for each lease and any non-lease components associated with that lease as a single lease\n \ncomponent for all underlying asset classes. Accordingly, all costs associated with a lease contract are accounted for as lease costs.\nLong-Lived Asset Impairment\nLong-lived assets other than goodwill and other intangibles are reviewed for impairment in accordance with provisions of ASC 360, \nProperty, Plant and Equipment\n. In the event that facts and circumstances indicate that the carrying amount of any long-lived assets may be impaired, an evaluation of recoverability is performed. If an evaluation is required, the estimated future undiscounted cash flows associated with the asset (or group of assets) is compared to the assets (or group of assets) carrying amount to determine if a write-down to fair value is required.\nGoodwill and Intangible Assets\nThe Company has capitalized certain intangible assets, primarily goodwill, customer relationships, and trademarks and trade names, based on their estimated fair value at the date of acquisition. Amortization is provided for customer relationships on a straight-line basis over periods ranging from \nten\n to \n40 years\n and trademarks and trade names over periods ranging from \nfive\n to \n20 years\n.\nGoodwill, which amounted to $\n922.4\n million at both December 31, 2024 and 2023, is not amortized but is subject to an annual impairment test in accordance with ASC 350, \nIntangibles – Goodwill and Other.\n We test goodwill for impairment annually in the fourth quarter or sooner if events or changes in circumstances indicate that the carrying value of the asset may exceed fair value. Additionally, we evaluate the remaining useful lives of our finite-lived purchased intangible assets to determine whether any adjustments to the useful lives are necessary.\n \nThe Company concluded that \nnone\n of the goodwill or intangible assets were impaired during the 2024, 2023, and 2022 annual impairment tests. See Note 8, Goodwill and Intangible Assets, for additional information.\n\n\n42\n\n\n\n\n \n\n\nPension and Postretirement Benefits\nSeveral estimates and assumptions are required to record pension costs and liabilities, including discount rate, return on assets, and longevity and service lives of employees. We review and update these assumptions annually unless a plan curtailment or other event occurs, requiring that we update the estimates on an interim basis. While we believe the assumptions used to measure our pension and postretirement benefit obligations are reasonable, differences in actual experience or changes in assumptions may materially affect our pension and postretirement benefit obligations and future expense. See Note 12, Employee Benefit Plans and Other Postretirement Benefits, for additional information.\nFor postretirement health care plan accounting, the Company reviews external data and its own historical trends for health care costs to determine the health care cost trend rate assumption. \n \nEnvironmental Matters\nEnvironmental expenditures that extend the life of the related property or mitigate or prevent future environmental contamination are capitalized. Liabilities are recorded for environmental contingencies when such costs are probable and reasonably estimable. These liabilities are adjusted as further information develops or circumstances change. Environmental expenditures related to existing conditions resulting from past or current operations from which no current or future benefit is discernible are expensed as incurred.\nAsset Retirement Obligations\nThe Company accounts for its retirement obligations related predominantly to landfill closure, wastewater treatment pond dredging, closed-site monitoring costs, and certain leasehold improvements under ASC 410, \nAsset Retirement and Environmental Obligations\n, which requires recognition of legal obligations associated with the retirement of long-lived assets whether these assets are owned or leased. These legal obligations are recognized at fair value at the time that the obligations are incurred. When we record the liability, we capitalize the cost by increasing the carrying amount of the related long-lived asset, which is amortized to expense over the useful life of the asset. See Note 13, Asset Retirement Obligations, for additional information.\nDeferred Debt Issuance Costs\nPCA has capitalized certain costs related to obtaining its financing. These costs are amortized to interest expense using the effective interest rate method over the terms of the related financing, which range from \n10\n to \n30 years\n. At December 31, 2024, deferred debt issuance costs were $\n18.0\n million, all of which were recorded in “Long-term debt” on our Consolidated Balance Sheets. At December 31, 2023, deferred debt issuance costs were $\n19.9\n million, of which $\n0.3\n million was recorded in “Current maturities of long-term debt” and $\n19.6\n million was recorded in “Long-term debt” on our Consolidated Balance Sheets.\nCutting Rights\nWe lease the cutting rights to approximately \n53,000\n acres of timberland. For our cutting rights, we capitalize the annual lease payments and reforestation costs associated with these leases. Costs are recorded as depletion when the timber or fiber is harvested and used in operations or sold to customers. Capitalized long-term lease costs for our cutting rights, primarily recorded in “Other long-term assets” on our Consolidated Balance Sheets, were $\n23.1\n million and $\n22.7\n million as of December 31, 2024 and 2023, respectively. The amount of depletion expense was $\n1.9\n million, $\n2.5\n million, and $\n2.4\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nDeferred Software Costs\nPCA capitalizes costs related to the purchase and development of software, which is used in its business operations. The costs attributable to these software systems are amortized over their estimated useful lives based on various factors such as the effects of obsolescence, technology, and other economic factors. Net capitalized software costs recorded in “Other long-term assets” on our Consolidated Balance Sheets were $\n1.0\n million and $\n1.9\n million for the years ended December 31, 2024 and 2023, respectively. Software amortization expense was $\n0.6\n million for the year ended, December 31, 2024, $\n1.4\n million for the year ended, December 31, 2023, and $\n1.6\n million for the year ended December 31, 2022.\nThe Company accounts for costs incurred to implement a cloud computing arrangement that is a service contract under ASU 2018-15, \nIntangibles – Goodwill and Other – Internal Use Software \n(Subtopic 350-40)\n: Customer’s Accounting for Implementation Costs Incurred in a Cloud Computing Arrangement That Is a Service Contract. \nThis ASU includes guidance on capitalizing costs associated with developing or obtaining internal-use software. For the years ended December 31, 2024 and 2023, capitalized costs associated with cloud computing arrangements were insignificant.\n\n\n43\n\n\n\n\n \n\n\nIncome Taxes\nPCA utilizes the liability method of accounting for income taxes whereby it recognizes deferred tax assets and liabilities for the future tax consequences of temporary differences between the tax basis of assets and liabilities and the reported amounts in the financial statements. Deferred tax assets will be reduced by a valuation allowance if, based upon management’s estimates, it is more likely than not that a portion of the deferred tax assets will not be realized in a future period. The estimates utilized in the recognition of deferred tax assets are subject to revision in future periods based on new facts or circumstances. PCA’s practice is to recognize interest and penalties related to unrecognized tax benefits in income tax expense\n.\nTrade Agreements\nPCA regularly trades containerboard with other manufacturers primarily to reduce shipping costs. These agreements are entered into with other producers on an annual basis, pursuant to which both parties agree to ship an identical number of tons of containerboard to each other within the agreement period. These agreements lower transportation costs by allowing each party’s containerboard mills to ship containerboard to the other party’s closer corrugated products plant. PCA tracks each shipment to ensure that the other party’s shipments to PCA match PCA’s shipments to the other party during the agreement period. Such transfers are possible because certain grades of containerboard are commodity products with no distinguishing product characteristics. These transactions are accounted for at carrying value, and revenue is not recorded as the transactions do not represent the culmination of an earnings process. The transactions are recorded into inventory accounts, and no sale or income is recorded until such inventory is converted to a finished product and sold to an end-use customer.\nRecently Adopted Accounting Standards\nEffective January 1, 2024, we adopted ASU 2023-07, \nSegment Reporting\n (Topic 280): \nImprovements to Reportable Segment Disclosures\n. This ASU improves reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The new guidance is required to be applied retrospectively. The adoption of this Update did not have a significant impact on the Company’s related disclosure as reflected in Note 18, Segment Information, in this Annual Report on Form 10-K.\nNew Accounting Standards Not Yet Adopted\nIn November 2024, the FASB issued ASU 2024-03 \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures \n(Subtopic 220-40): \nDisaggregation of Income Statement Expenses. \nThis ASU is intended to enhance transparency into the nature and function of expenses. The amendments require that on an annual and interim basis, entities disclose disaggregated operating expense information about specific categories, including purchases of inventory, employee compensation, depreciation, amortization, and depletion. The update is effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027 on a prospective basis or with the option for retrospective application. Early adoption is permitted. The Company is currently assessing the impact of the disclosure requirements on its consolidated financial statements.\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes \n(Topic 740): \nImprovement to the Income Tax Disclosures. \nThis ASU provides for more transparency about income tax information through improvements to income tax disclosures primarily related to the rate reconciliation and income taxes paid information. This ASU is effective for fiscal years beginning after December 15, 2024 on a prospective basis. Early adoption is permitted. The Company is currently assessing the impact of the disclosure requirements on its consolidated financial statements.\n\n\n3.\nLeases\nWe group our leases into \ntwo\n primary lease types, real estate and equipment, and into various asset classes within each type. Real estate leases primarily include manufacturing locations, office space, warehouses, and design centers, while equipment leases primarily include manufacturing equipment.\n \nLeases with an initial term of \n12\n months or less and certain month-to-month leases are not recorded on the balance sheet. The lease expense for these types of leases is recognized on a straight-line basis over the lease term.\n \n\n\n44\n\n\n\n\n \n\n\nTo determine the lease term, we include the non-cancellable period of the lease together with the following: all periods covered by an option to extend the lease if we are reasonably certain to exercise that option; any periods covered by an option to terminate the lease if we are reasonably certain not to exercise that option; and any periods covered by an option to extend or not to terminate the lease that are controlled by the lessor. The exercising of lease renewal options is based on whether future economic benefit is expected to be derived from the renewal. Most \nof our real estate leases contain at least one renewal option. Renewal options generally range from \n3\n to \n5 years\n. Although equipment leases may also contain renewal options, we typically do not expect to extend and/or exercise these renewal options unless a compelling business reason is provided to management.\nOur leases may contain fixed and variable costs. Fixed costs determine the right-of-use asset. Variable costs are those costs which will vary month to month and are excluded from the calculation of the right-of-use asset. Variable lease costs are recorded to lease expense in the period in which they are incurred.\nOur leases do not provide an implicit borrowing rate of return. Therefore, we use our incremental borrowing rate to calculate the present value of lease payments at inception of the lease or when a lease is modified.\nSupplemental balance sheet information related to our operating leases was as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n$\n\n\n276.9\n\n\n \n\n\n \n\n\n$\n\n\n279.6\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent portion of operating lease obligations\n\n\n$\n\n\n80.5\n\n\n \n\n\n \n\n\n$\n\n\n78.6\n\n\n \n\n\n\n\n\n\nLong-term portion of operating lease obligations\n\n\n \n\n\n208.0\n\n\n \n\n\n \n\n\n \n\n\n212.1\n\n\n \n\n\n\n\n\n\nTotal operating lease obligations\n\n\n$\n\n\n288.5\n\n\n \n\n\n \n\n\n$\n\n\n290.7\n\n\n \n\n\n\n\n \nSupplemental balance sheet information related to our finance leases was as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nBuildings\n\n\n$\n\n\n0.3\n\n\n \n\n\n \n\n\n$\n\n\n0.3\n\n\n \n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n28.5\n\n\n \n\n\n \n\n\n \n\n\n28.5\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n28.8\n\n\n \n\n\n \n\n\n \n\n\n28.8\n\n\n \n\n\n\n\n\n\nLess accumulated amortization\n\n\n \n\n\n(\n25.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n24.0\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n$\n\n\n3.8\n\n\n \n\n\n \n\n\n$\n\n\n4.8\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent portion of finance lease obligations\n\n\n$\n\n\n2.1\n\n\n \n\n\n \n\n\n$\n\n\n2.0\n\n\n \n\n\n\n\n\n\nLong-term portion of finance lease obligations\n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n\n\n\n\nTotal finance lease obligations\n\n\n$\n\n\n8.8\n\n\n \n\n\n \n\n\n$\n\n\n10.7\n\n\n \n\n\n\n\n \nThe Company was obligated under finance leases covering buildings and machinery and equipment in the amount of $\n8.8\n million and $\n10.7\n million at December 31, 2024 and 2023, respectively. Amortization of assets under finance lease obligations is included in depreciation expense.\nFor both operating and finance leases, the weighted average remaining lease term in years and weighted average discount rates were as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nWeighted-average remaining lease term (years):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating leases\n\n\n5.1\n\n\n \n\n\n \n\n\n4.9\n\n\n \n\n\n\n\n\n\nFinance leases\n\n\n3.8\n\n\n \n\n\n \n\n\n4.8\n\n\n \n\n\n\n\n\n\nWeighted-average discount rate:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating leases\n\n\n \n\n\n4.28\n\n\n%\n\n\n \n\n\n \n\n\n3.75\n\n\n%\n\n\n\n\n\n\nFinance leases\n\n\n \n\n\n6.66\n\n\n%\n\n\n \n\n\n \n\n\n6.66\n\n\n%\n\n\n\n\n \n\n\n45\n\n\n\n\n \n\n\n \nThe components of lease expense were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nFinance lease cost:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of finance lease assets\n\n\n$\n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n1.4\n\n\n \n\n\n \n\n\n$\n\n\n1.5\n\n\n \n\n\n\n\n\n\nInterest on lease liabilities\n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n\n\n\n\nTotal finance lease cost\n\n\n \n\n\n1.7\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n\n\n\n\nOperating lease cost\n\n\n \n\n\n92.4\n\n\n \n\n\n \n\n\n \n\n\n87.7\n\n\n \n\n\n \n\n\n \n\n\n81.4\n\n\n \n\n\n\n\n\n\nShort-term lease cost\n\n\n \n\n\n25.7\n\n\n \n\n\n \n\n\n \n\n\n24.6\n\n\n \n\n\n \n\n\n \n\n\n27.0\n\n\n \n\n\n\n\n\n\nVariable lease cost\n\n\n \n\n\n22.5\n\n\n \n\n\n \n\n\n \n\n\n21.7\n\n\n \n\n\n \n\n\n \n\n\n17.2\n\n\n \n\n\n\n\n\n\nTotal lease cost\n\n\n$\n\n\n142.3\n\n\n \n\n\n \n\n\n$\n\n\n136.2\n\n\n \n\n\n \n\n\n$\n\n\n128.0\n\n\n \n\n\n\n\n \nWe had an insignificant amount of sublease rental income for the years ended December 31, 2024, 2023, and 2022.\nSupplemental cash flow information related to leases was as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash paid for amounts included in the measurement of lease liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating cash flows for operating leases\n\n\n$\n\n\n(\n84.3\n\n\n)\n\n\n \n\n\n$\n\n\n(\n77.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n73.6\n\n\n)\n\n\n\n\n\n\nOperating cash flows for finance leases\n\n\n \n\n\n(\n1.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.5\n\n\n)\n\n\n\n\n\n\nFinancing cash flows for finance leases\n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n\n\n\n\nRight-of-use assets obtained in exchange for new lease obligations:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating leases\n\n\n$\n\n\n(\n33.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n58.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n83.5\n\n\n)\n\n\n\n\n\n\nFinance leases\n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSupplemental non-cash information on changes in lease liabilities\n\n\n$\n\n\n45.5\n\n\n \n\n\n \n\n\n$\n\n\n1.3\n\n\n \n\n\n \n\n\n$\n\n\n51.6\n\n\n \n\n\n\n\n\n\nSupplemental non-cash information on changes in right-of-use assets\n\n\n$\n\n\n37.3\n\n\n \n\n\n \n\n\n$\n\n\n77.6\n\n\n \n\n\n \n\n\n$\n\n\n23.5\n\n\n \n\n\n\n\n \nThe future minimum payments under operating and finance lease liabilities at December 31, 2024 were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nOperating Leases\n\n\n \n\n\n \n\n\nFinance Leases\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n91.4\n\n\n \n\n\n \n\n\n$\n\n\n2.7\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n74.5\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n53.6\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n32.6\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n52.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTotal lease payments\n\n\n \n\n\n \n\n\n323.7\n\n\n \n\n\n \n\n\n \n\n\n9.9\n\n\n \n\n\n\n\n\n\nLess imputed interest (a)\n\n\n \n\n\n \n\n\n(\n35.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n\n\n\n\nPresent value of lease liabilities\n\n\n \n\n\n$\n\n\n288.5\n\n\n \n\n\n \n\n\n$\n\n\n8.8\n\n\n \n\n\n\n\n \n(a)\nCalculated using the incremental borrowing rate for each lease applied to the future payments.\n\n\n46\n\n\n\n\n \n\n\n4.\nRevenue\nRevenue Recognition\nRevenue is recognized when control of the promised goods or services is transferred to customers in an amount that reflects the consideration expected to be received in exchange for those goods or services. Sales, value added, and other taxes collected concurrently with revenue-producing activities are excluded from revenue.\nThe following table presents our revenues disaggregated by product line (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nPackaging\n\n\n$\n\n\n7,690.9\n\n\n \n\n\n \n\n\n$\n\n\n7,135.6\n\n\n \n\n\n \n\n\n$\n\n\n7,780.7\n\n\n \n\n\n\n\n\n\nPaper\n\n\n \n\n\n624.7\n\n\n \n\n\n \n\n\n \n\n\n595.4\n\n\n \n\n\n \n\n\n \n\n\n622.1\n\n\n \n\n\n\n\n\n\nCorporate and Other\n\n\n \n\n\n67.7\n\n\n \n\n\n \n\n\n \n\n\n71.4\n\n\n \n\n\n \n\n\n \n\n\n75.2\n\n\n \n\n\n\n\n\n\nTotal revenue\n\n\n$\n\n\n8,383.3\n\n\n \n\n\n \n\n\n$\n\n\n7,802.4\n\n\n \n\n\n \n\n\n$\n\n\n8,478.0\n\n\n \n\n\n\n\nPackaging Revenue\nOur containerboard mills produce linerboard and corrugating medium which are papers primarily used in the production of corrugated products. The majority of our containerboard production is used internally by our corrugated products manufacturing facilities. The remaining containerboard is sold to outside domestic and export customers. Our corrugated products manufacturing plants produce a wide variety of corrugated packaging products and retail merchandise displays. We sell corrugated products to national, regional and local accounts, which are broadly diversified across industries and geographic locations.\nThe Company recognizes revenue for its packaging products when performance obligations under the terms of a contract with a customer are satisfied. This occurs with the transfer of control of our products at a specific point in time. Based on our express terms and conditions of the sale of products to our customers, as well as terms included in contractual arrangements with our customers, we do not have an enforceable right of payment that includes a reasonable profit throughout the duration of the contract for products that do not have an alternative use. Revenue is recognized when the product is shipped from the mill or from our manufacturing facility to our customer. Certain customers may receive volume-based incentives, which are accounted for as variable consideration. We estimate these amounts based on the expected amount to be provided to customers and reduce revenue recognized.\nCertain customers receive a portion of their packaging products as consigned inventory with billing triggered once the customer uses or consumes the designated product. Prior to invoicing, these amounts are handled as unbilled receivables. Total unbilled receivables, which are immaterial in amount, are included in the accounts receivable financial statement caption.\nPaper Revenue\nWe manufacture and sell a range of communication-based papers. Communication papers consist of cut-size office papers, and printing and converting papers.\n \nThe Company recognizes revenue for its paper products when performance obligations under the terms of a contract with a customer are satisfied. This occurs with the transfer of control of our products at a specific point in time. Revenue is recognized when the product is shipped from the mill or from our manufacturing facility or distribution center to our customer. Certain customers may receive volume-based incentives, which are accounted for as variable consideration. We estimate these amounts based on the expected amount to be provided to customers and reduce revenue recognized.\nCorporate and Other Revenue\nRevenue in this segment primarily relates to Louisiana Timber Procurement Company, L.L.C. (LTP), a variable-interest entity that is \n50\n% owned by PCA and \n50\n% owned by Boise Cascade Company (Boise Cascade). PCA is the primary beneficiary of LTP and has the power to direct the activities that most significantly affect the economic performance of LTP. Therefore, we consolidate 100% of LTP in our financial statements. See Note 17, Transactions With Related Parties, for more information related to LTP.\nThe Company recognizes revenue within this segment when performance obligations under the terms of a contract with a customer are satisfied. This occurs with the transfer of control of our products at a specific point in time.\n \n\n\n47\n\n\n\n\n \n\n\nPractical Expedients and Exemption\nShipping and handling fees billed to a customer are recorded on a gross basis in “Net sales” with the corresponding shipping and handling costs included in “Cost of sales” in the concurrent period as the revenue is recorded. We expense sales commissions when incurred because the amortization period is one year or less. Sales commissions are recorded in “Selling, general, and administrative expenses”.\n \nWe do not disclose the value of unsatisfied performance obligations for contracts with an original expected duration of one year or less\n.\n\n\n5.\nEarnings Per Share \nThe following table sets forth the computation of basic and diluted income per common share for the periods presented (dollars and shares in millions, except per share data).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNumerator:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n805.1\n\n\n \n\n\n \n\n\n$\n\n\n765.2\n\n\n \n\n\n \n\n\n$\n\n\n1,029.8\n\n\n \n\n\n\n\n\n\nLess: Distributed and undistributed earnings allocated to participating\n   securities\n\n\n \n\n\n \n\n\n(\n5.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n6.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n7.9\n\n\n)\n\n\n\n\n\n\nNet income attributable to common shareholders\n\n\n \n\n\n$\n\n\n799.5\n\n\n \n\n\n \n\n\n$\n\n\n759.0\n\n\n \n\n\n \n\n\n$\n\n\n1,021.9\n\n\n \n\n\n\n\n\n\nDenominator:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted average basic common shares outstanding\n\n\n \n\n\n \n\n\n89.1\n\n\n \n\n\n \n\n\n \n\n\n89.1\n\n\n \n\n\n \n\n\n \n\n\n92.3\n\n\n \n\n\n\n\n\n\nEffect of dilutive securities\n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nDiluted common shares outstanding\n\n\n \n\n\n \n\n\n89.5\n\n\n \n\n\n \n\n\n \n\n\n89.5\n\n\n \n\n\n \n\n\n \n\n\n92.7\n\n\n \n\n\n\n\n\n\nBasic income per common share\n\n\n \n\n\n$\n\n\n8.97\n\n\n \n\n\n \n\n\n$\n\n\n8.52\n\n\n \n\n\n \n\n\n$\n\n\n11.08\n\n\n \n\n\n\n\n\n\nDiluted income per common share\n\n\n \n\n\n$\n\n\n8.93\n\n\n \n\n\n \n\n\n$\n\n\n8.48\n\n\n \n\n\n \n\n\n$\n\n\n11.03\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n6.\nOther Expense, Net\nThe components of other income (expense), net, were as follows (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nAsset disposals and write-offs\n\n\n \n\n\n$\n\n\n(\n39.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n31.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n44.5\n\n\n)\n\n\n\n\n\n\nJackson mill conversion-related activities (a)\n\n\n \n\n\n \n\n\n(\n7.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n6.9\n\n\n)\n\n\n\n\n\n\nFacilities closure and other costs (b)\n\n\n \n\n\n \n\n\n(\n1.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n7.9\n\n\n)\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nDeRidder and other litigation (c)\n\n\n \n\n\n \n\n\n(\n95.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nDeRidder and other litigation insurance recoveries (c)\n\n\n \n\n\n \n\n\n95.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n(\n23.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n10.0\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n(\n71.5\n\n\n)\n\n\n \n\n\n$\n\n\n(\n42.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n61.3\n\n\n)\n\n\n\n\n(a)\nIncludes charges related to the announced discontinuation of production of uncoated freesheet paper grades on the No. 3 machine at the Jackson, Alabama mill in the first quarter of 2021 associated with the permanent conversion of the machine to produce linerboard and other paper-to-containerboard conversion related activities.\n \n(b)\nFor 2024, includes charges consisting of closure costs related to corrugated products facilities, partially offset by income primarily related to a favorable lease buyout for a closed corrugated products facility. For 2023, includes charges consisting of closure costs related to corrugated products facilities and design centers, partially offset by a gain on sale of a corrugated products facility. For 2022, includes income primarily related to insurance proceeds received for a natural disaster at one of the corrugated products facilities and a gain on sale of assets related to a corrugated products facility, partially offset by closure costs related to corrugated products facilities. \n \n(c)\nOn April 24, 2024, a jury for the remaining DeRidder mill lawsuit that was tried in the U.S. District Court for the Middle District of Louisiana awarded plaintiffs compensatory damages plus interest. During the fourth quarter of 2024, the Company, certain of its insurers, and the plaintiffs agreed to settle the matter for $\n59.2\n million. A description of the settlement is included in Note 19, Commitments, Guarantees, Indemnifications, and Legal Proceedings for additional detail\n. \nThe remaining balance relates to other settlement amounts that are fully insured.\n\n\n48\n\n\n\n\n \n\n\n7.\nIncome Taxes\nThe following is an analysis of the components of the consolidated income tax provision (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCurrent income tax provision -\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. federal\n\n\n \n\n\n$\n\n\n218.9\n\n\n \n\n\n \n\n\n$\n\n\n199.4\n\n\n \n\n\n \n\n\n$\n\n\n187.3\n\n\n \n\n\n\n\n\n\nState and local\n\n\n \n\n\n \n\n\n44.6\n\n\n \n\n\n \n\n\n \n\n\n44.3\n\n\n \n\n\n \n\n\n \n\n\n61.7\n\n\n \n\n\n\n\n\n\nTotal current provision for taxes\n\n\n \n\n\n \n\n\n263.5\n\n\n \n\n\n \n\n\n \n\n\n243.7\n\n\n \n\n\n \n\n\n \n\n\n249.0\n\n\n \n\n\n\n\n\n\nDeferred income tax provision (benefit) -\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. federal\n\n\n \n\n\n \n\n\n(\n5.5\n\n\n)\n\n\n \n\n\n \n\n\n3.6\n\n\n \n\n\n \n\n\n \n\n\n86.9\n\n\n \n\n\n\n\n\n\nState and local\n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n\n\n\n\nForeign\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n\n\n\n\nTotal deferred provision (benefit) for taxes\n\n\n \n\n\n \n\n\n(\n4.2\n\n\n)\n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n \n\n\n \n\n\n86.0\n\n\n \n\n\n\n\n\n\nTotal provision for taxes\n\n\n \n\n\n$\n\n\n259.3\n\n\n \n\n\n \n\n\n$\n\n\n248.9\n\n\n \n\n\n \n\n\n$\n\n\n335.0\n\n\n \n\n\n\n\n \nThe effective tax rate varies from the U.S. federal statutory tax rate principally due to the following (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nProvision computed at U.S. federal statutory rate of \n21\n%\n\n\n \n\n\n$\n\n\n223.5\n\n\n \n\n\n \n\n\n$\n\n\n213.0\n\n\n \n\n\n \n\n\n$\n\n\n286.6\n\n\n \n\n\n\n\n\n\nState and local taxes, net of federal benefit\n\n\n \n\n\n \n\n\n39.8\n\n\n \n\n\n \n\n\n \n\n\n38.6\n\n\n \n\n\n \n\n\n \n\n\n51.6\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n(\n4.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.2\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n259.3\n\n\n \n\n\n \n\n\n$\n\n\n248.9\n\n\n \n\n\n \n\n\n$\n\n\n335.0\n\n\n \n\n\n\n\n \nThe following details the scheduled expiration dates of our tax effected net operating loss (NOL) and other tax carryforwards at December 31, 2024 (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025 Through \n2034\n\n\n \n\n\n \n\n\n2035 Through \n2044\n\n\n \n\n\n \n\n\nIndefinite\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nU.S. federal NOLs\n\n\n \n\n\n$\n\n\n12.1\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n12.1\n\n\n \n\n\n\n\n\n\nState taxing jurisdiction NOLs\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n\n\n\n\nU.S. federal and non-U.S. capital loss carryforwards\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n\n\n\n\nU.S. federal tax credit carryforwards\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n12.8\n\n\n \n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n13.0\n\n\n \n\n\n\n\n \n\n\n49\n\n\n\n\n \n\n\n \nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts for income tax purposes. Deferred income tax assets and liabilities at December 31 are summarized as follows (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nDeferred tax assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLease obligations\n\n\n \n\n\n$\n\n\n71.9\n\n\n \n\n\n \n\n\n$\n\n\n72.8\n\n\n \n\n\n\n\n\n\nEmployee benefits and compensation\n\n\n \n\n\n \n\n\n53.3\n\n\n \n\n\n \n\n\n \n\n\n44.8\n\n\n \n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n31.6\n\n\n \n\n\n \n\n\n \n\n\n30.4\n\n\n \n\n\n\n\n\n\nNet operating loss carryforwards\n\n\n \n\n\n \n\n\n12.6\n\n\n \n\n\n \n\n\n \n\n\n16.2\n\n\n \n\n\n\n\n\n\nRestricted stock and performance units\n\n\n \n\n\n \n\n\n10.4\n\n\n \n\n\n \n\n\n \n\n\n9.8\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n13.4\n\n\n \n\n\n\n\n\n\nCapital loss and general business credit carryforwards\n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nDerivatives\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nPension and postretirement benefits\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n12.7\n\n\n \n\n\n\n\n\n\nGross deferred tax assets\n\n\n \n\n\n \n\n\n189.1\n\n\n \n\n\n \n\n\n \n\n\n200.6\n\n\n \n\n\n\n\n\n\nValuation allowance (a)\n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n\n\n\n\nNet deferred tax assets\n\n\n \n\n\n$\n\n\n188.8\n\n\n \n\n\n \n\n\n$\n\n\n200.3\n\n\n \n\n\n\n\n\n\nDeferred tax liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n$\n\n\n(\n598.8\n\n\n)\n\n\n \n\n\n$\n\n\n(\n609.2\n\n\n)\n\n\n\n\n\n\nGoodwill and intangible assets\n\n\n \n\n\n \n\n\n(\n81.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n79.0\n\n\n)\n\n\n\n\n\n\nRight-of-use assets\n\n\n \n\n\n \n\n\n(\n68.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n70.1\n\n\n)\n\n\n\n\n\n\nPension and postretirement benefits\n\n\n \n\n\n \n\n\n(\n1.2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTotal deferred tax liabilities\n\n\n \n\n\n$\n\n\n(\n750.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n758.3\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet deferred tax liabilities\n\n\n \n\n\n$\n\n\n(\n561.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n558.0\n\n\n)\n\n\n\n\n \n(a)\nDeferred tax assets are reduced by a valuation allowance when it is more likely than not that some portion of the deferred tax assets will not be realized. Both the 2024 and 2023 valuation allowances relate to capital losses. We do not expect to generate capital gains before the capital losses expire. If or when recognized, the tax benefits relating to the reversal of any or all of the valuation allowance would be recognized as a benefit to income tax expense.\nCash payments for federal, state, and foreign income taxes were $\n269.4\n million, $\n212.3\n million, and $\n277.4\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nThe following table summarizes the changes related to PCA’s gross unrecognized tax benefits excluding interest and penalties (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nBalance as of January 1\n\n\n \n\n\n$\n\n\n(\n2.4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1.9\n\n\n)\n\n\n\n\n\n\nIncreases related to prior years’ tax positions\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n\n\n\n\nIncreases related to current year tax positions\n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n\n\n\n\nDecreases related to prior years' tax positions\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nSettlements with taxing authorities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nExpiration of the statute of limitations\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n\n\n\n\nBalance at December 31\n\n\n \n\n\n$\n\n\n(\n3.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2.4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1.7\n\n\n)\n\n\n\n\n \nAt December 31, 2024, PCA had recorded a $\n3.2\n million gross reserve for unrecognized tax benefits, excluding interest and penalties. Of the total, $\n3.2\n million (net of the federal benefit for state taxes) would impact the effective tax rate if recognized.\nPCA recognizes interest accrued related to unrecognized tax benefits and penalties as income tax expense. For the years ended December 31, 2024 and 2023, we had $\n0.2\n million and $\n0.1\n million of interest and penalties recorded for unrecognized tax benefits, respectively. PCA does \nno\nt expect the unrecognized tax benefits to change significantly over the next 12 months.\n \n\n\n50\n\n\n\n\n \n\n\nPCA is subject to income taxation in the United States, various state and local jurisdictions, and Hong Kong.\n \nThe tax years 2021-2024 remain open to federal examination. The tax years \n2020-2024\n remain open to state examinations. Some foreign tax jurisdictions are open to examination for the \n2018\n tax year forward. Through the Boise acquisition, PCA recorded net operating losses and credit carryforwards from \n2008 through 2011 and 2013\n that are subject to examinations and adjustments for at least three years following the year in which utilized\n.\n \n\n\n8.\nGoodwill and Intangible Assets    \nGoodwill\nGoodwill represents the excess of the cost of an acquired business over the fair value of the identifiable tangible and intangible assets acquired and liabilities assumed in a business combination. At both December 31, 2024 and 2023, we had $\n922.4\n million of goodwill recorded in our Packaging segment, which represents the entire goodwill balance reported on our Consolidated Balance Sheets. We did not recognize any adjustments to goodwill during the years ended December 31, 2024 and 2023.\nIntangible Assets\nIntangible assets are primarily comprised of customer relationships and trademarks and trade names. \nThe weighted average useful life, gross carrying amount, and accumulated amortization of our intangible assets were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nAs of December 31, 2024\n\n\n \n\n\n \n\n\nAs of December 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nWeighted\nAverage\nRemaining\nUseful Life\n(in Years)\n\n\n \n\n\n \n\n\nGross\nCarrying\nAmount\n\n\n \n\n\n \n\n\nAccumulated\nAmortization\n\n\n \n\n\n \n\n\nWeighted\nAverage\nRemaining\nUseful Life\n(in Years)\n\n\n \n\n\n \n\n\nGross\nCarrying\nAmount\n\n\n \n\n\n \n\n\nAccumulated\nAmortization\n\n\n \n\n\n\n\n\n\nCustomer relationships\n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n \n\n\n$\n\n\n546.0\n\n\n \n\n\n \n\n\n$\n\n\n362.4\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n$\n\n\n546.0\n\n\n \n\n\n \n\n\n$\n\n\n326.9\n\n\n \n\n\n\n\n\n\nTrademarks and trade names\n\n\n \n\n\n \n\n\n6.0\n\n\n \n\n\n \n\n\n \n\n\n41.3\n\n\n \n\n\n \n\n\n \n\n\n33.0\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n \n\n\n41.3\n\n\n \n\n\n \n\n\n \n\n\n30.9\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n1.9\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n \n\n\n\n\n\n\nTotal intangible assets (excluding goodwill)\n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n \n\n\n$\n\n\n591.7\n\n\n \n\n\n \n\n\n$\n\n\n399.8\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n \n\n\n \n\n\n$\n\n\n591.7\n\n\n \n\n\n \n\n\n$\n\n\n362.1\n\n\n \n\n\n\n\nAmortization expense was $\n37.7\n million, $\n38.3\n million, and $\n39.1\n mi\nllion for the years ended December 31, 2024, 2023, and 2022, respectively. \nEstimated amortization expense of intangible assets over the next five years is expected to approximate $\n37.6\n million (2025), $\n37.5\n million (2026), $\n34.7\n million\n \n(2027), $\n27.1\n million (2028) and $\n13.0\n million (2029).\nImpairment Testing\nWe test goodwill for impairment annually in the fourth quarter or sooner if events or changes in circumstances indicate that the carrying value of the asset may exceed fair value. Additionally, when we experience changes to our business or operating environment, we evaluate the remaining useful lives and recoverability of our finite-lived purchased intangible assets to determine whether any adjustments to the useful lives or impairment are necessary. We completed our annual qualitative assessment in the fourth quarter, and there was \nno\n indication of goodwill or intangible asset impairment.\n\n\n51\n\n\n\n\n \n\n\n9.\nAccrued Liabilities\nThe components of accrued liabilities were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nCompensation and benefits\n\n\n \n\n\n$\n\n\n168.5\n\n\n \n\n\n \n\n\n$\n\n\n154.4\n\n\n \n\n\n\n\n\n\nDeRidder and other litigation (a)\n\n\n \n\n\n \n\n\n96.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nCustomer rebates and other credits\n\n\n \n\n\n \n\n\n33.9\n\n\n \n\n\n \n\n\n \n\n\n35.2\n\n\n \n\n\n\n\n\n\nMedical insurance and workers’ compensation\n\n\n \n\n\n \n\n\n29.1\n\n\n \n\n\n \n\n\n \n\n\n28.4\n\n\n \n\n\n\n\n\n\nFranchise, property, sales and use taxes\n\n\n \n\n\n \n\n\n18.7\n\n\n \n\n\n \n\n\n \n\n\n18.6\n\n\n \n\n\n\n\n\n\nSeverance, retention, and relocation\n\n\n \n\n\n \n\n\n3.4\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n\n\n\n\nEnvironmental liabilities and asset retirement obligations\n\n\n \n\n\n \n\n\n3.2\n\n\n \n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n9.9\n\n\n \n\n\n \n\n\n \n\n\n11.9\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n362.9\n\n\n \n\n\n \n\n\n$\n\n\n253.5\n\n\n \n\n\n\n\n \n(a)\nOn April 24, 2024, a jury for the remaining DeRidder mill lawsuit that was tried in the U.S. District Court for the Middle District of Louisiana awarded plaintiffs compensatory damages plus interest. During the fourth quarter of 2024, the Company, certain of its insurers, and the plaintiffs agreed to settle the matter for $\n59.2\n million. A description of the settlement is included in Note 19, Commitments, Guarantees, Indemnifications, and Legal Proceedings for additional detail\n. \nThe remaining balance relates to other settlement amounts that are fully insured.\n\n\n10.\nDebt \nAt December 31, 2024 and 2023, our long-term debt and interest rates on that debt were as follows (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n\n\n\n\nRevolving Credit Facility\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n\n\n\n\n3.65\n% Senior Notes, net of discount of $\n0.1\n million \n   as of December 31 2023, due \nSeptember 2024\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n399.9\n\n\n \n\n\n \n\n\n\n\n\n\n3.40\n% Senior Notes, net of discount of $\n0.6\n million\n   and $\n0.7\n million as of December 31, 2024 and 2023,\n   respectively, due \nDecember 2027\n\n\n \n\n\n \n\n\n499.4\n\n\n \n\n\n \n\n\n \n\n\n499.3\n\n\n \n\n\n \n\n\n\n\n\n\n3.00\n% Senior Notes, net of discount of $\n0.3\n million \n   and $\n0.4\n million as of December 31, 2024 and 2023,\n   respectively, due \nDecember 2029\n\n\n \n\n\n \n\n\n499.7\n\n\n \n\n\n \n\n\n \n\n\n499.6\n\n\n \n\n\n \n\n\n\n\n\n\n5.70\n% Senior Notes, net of discount of $\n0.3\n million\n   as of both December 31, 2024 and 2023, \n   due \nDecember 2033\n\n\n \n\n\n \n\n\n399.7\n\n\n \n\n\n \n\n\n \n\n\n399.7\n\n\n \n\n\n \n\n\n\n\n\n\n4.05\n% Senior Notes, net of discount of $\n3.2\n million \n   and $\n3.3\n million as of December 31, 2024 and 2023,\n   respectively, due \nDecember 2049\n\n\n \n\n\n \n\n\n396.8\n\n\n \n\n\n \n\n\n \n\n\n396.7\n\n\n \n\n\n \n\n\n\n\n\n\n3.05\n% Senior Notes, net of discount of $\n3.4\n million  \n   and $\n3.5\n million as of December 31, 2024 and 2023, \n   respectively, due \nOctober 2051\n\n\n \n\n\n \n\n\n696.6\n\n\n \n\n\n \n\n\n \n\n\n696.5\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n2,492.2\n\n\n \n\n\n \n\n\n \n\n\n2,891.7\n\n\n \n\n\n \n\n\n\n\n\n\nLess current portion (a)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n399.6\n\n\n \n\n\n \n\n\n\n\n\n\nLess unamortized debt issuance costs\n\n\n \n\n\n \n\n\n18.0\n\n\n \n\n\n \n\n\n \n\n\n19.9\n\n\n \n\n\n \n\n\n\n\n\n\nTotal long-term debt\n\n\n \n\n\n$\n\n\n2,474.2\n\n\n \n\n\n \n\n\n$\n\n\n2,472.2\n\n\n \n\n\n \n\n\n\n\n \n(a)\nAs of December 31, 2024, there are \nno\n unamortized debt issuance costs associated with the current portion of long-term debt, as the 2024 senior notes due \nSeptember 2024\n were repaid on September 15, 2024. As of December 31, 2023, the current portion of long-term debt excludes unamortized debt issuance costs of $\n0.3\n million.\n\n\n52\n\n\n\n\n \n\n\nOn November 30, 2023, the Company issued $\n400.0\n million of \n5.70\n% senior notes due 2033 through a registered public offering and invested the net proceeds in time deposits. The $\n3.7\n million of debt issuance costs associated with the new notes will be amortized to interest expense using the effective interest method over the term of the notes. On September 15, 2024, the Company used the net proceeds from this issuance, together with a portion of cash on hand, to repay its outstanding \n3.65\n% senior notes due 2024 at maturity. The repayment of these notes was $\n407.3\n million, which included principal and accrued interest.\nAs of December 31, 2024, the details of our borrowings were as follows:\n•\nSenior Unsecured Credit Agreement\n. On \nJune 8, 2021\n, we entered into a revolving credit agreement with various financial institutions (the “Revolving Credit Agreement”). Loans under the Revolving Credit Agreement bear interest at the term SOFR rate plus an applicable margin based upon the public ratings of PCA’s senior long-term unsecured debt or PCA’s gross leverage ratio. The Revolving Credit Agreement is a $\n350\n million unsecured revolving credit facility, which has a \nfive-year\n term and is available for borrowings on a revolving basis for general corporate purposes. At December 31, 2024, \nunused borrowing capacity was \n$\n323.3\n million\n, which includes various outstanding letters of credit. The outstanding letters of credit were primarily for workers compensation. We are required to pay commitment fees on the unused portions of the credit facility.\n•\n3.65% Senior Notes. \nOn September 5, 2014, we issued $\n400.0\n million of \n3.65\n% senior notes due \nSeptember 15, 2024\n, through a registered public offering. The senior notes were paid off on September 15, 2024 with the proceeds received from the November 2023 offering discussed above and cash on hand.\n•\n3.40% Senior Notes. \nOn December 13, 2017, we issued $\n500.0\n million of \n3.40\n% senior notes due \nDecember 15, 2027\n, through a registered public offering.\n•\n3.00% Senior Notes\n. On November 21, 2019, we issued $\n500.0\n million of \n3.00\n% senior notes due \nDecember 15, 2029\n, through a registered public offering.\n•\n4.05% Senior Notes\n. On November 21, 2019, we issued $\n400.0\n million of \n4.05\n% senior notes due \nDecember 15, 2049\n, through a registered public offering.\n•\n3.05% Senior Notes. \nOn September 21, 2021, we issued $\n700.0\n million of \n3.05\n% senior notes due \nOctober 1, 2051\n, through a registered public offering.\n•\n5.70% Senior Notes\n. On November 30, 2023, we issued $\n400.0\n million of \n5.70\n% senior notes due \nDecember 1, 2033\n, through a registered public offering.\nThe instruments governing our indebtedness contain financial and other covenants that limit the ability of PCA and its subsidiaries to enter into sale and leaseback transactions, incur liens, incur indebtedness at the subsidiary level, enter into certain transactions with affiliates, merge or consolidate with any other person or sell or otherwise dispose of all or substantially all of our assets. The Revolving Credit Agreement also requires us to comply with certain financial covenants, including maintaining a minimum interest coverage ratio and a maximum leverage ratio. A failure to comply with these restrictions could lead to an event of default, which could result in an acceleration of any outstanding indebtedness and/or prohibit us from drawing on the revolving credit facility. An acceleration under the revolving credit facility may also constitute an event of default under the senior notes indenture. At December 31, 2024, we were in compliance with these covenants.\nAt December 31, 2024, we have \n$\n2,492.2\n million\n of fixed-rate senior notes outstanding. At December 31, 2024, the fair value of our fixed-rate debt was estimated to be \n$\n2,104.2\n million\n. The difference between the book value and fair value is due to the difference between the period-end market interest rate and the stated rate of our fixed-rate debt. We estimated the fair value of our fixed-rate debt using quoted market prices (Level 2 inputs), discussed further in Note 2, Summary of Significant Accounting Policies.\nRepayments, Interest, and Other\nOn September 15, 2024, we used the net proceeds from the November 2023 offering of the \n5.70\n% senior notes due 2033 and cash on hand to repay our outstanding \n3.65\n% senior notes due 2024. The repayment of the old \n3.65\n% notes was $\n407.3\n million, which included principal and accrued interest.\nIn 2023 and 2022, we did not repay any outstanding debt, as we did not have any maturities of our senior notes during 2023 and 2022.\nAs of December 31, 2024, annual principal maturities for debt, excluding unamortized debt discount, are: \nno\nne for 2025; \nno\nne for 2026; $\n500.0\n million for 2027; \nno\nne for 2028; and $\n2.0\n billion for 2029 and thereafter.\n\n\n53\n\n\n\n\n \n\n\nInterest payments paid in connection with the Company’s debt obligations for the years ended December 31, 2024, 2023, and 2022 were \n$\n107.7\n million, \n$\n84.8\n million, and $\n85.6\n million, respectively. As of December 31, 2024, the estimated future interest payments for the Company's debt obligations are: \n$\n92.4\n million\n for 2025, 2026, and 2027; \n$\n75.4\n million for 2028; and \n$\n960.3\n million, in aggregate, for 2029 and thereafter.\nIncluded in interest expense, net, are amortization of financing costs, which includes the amortization of debt issuance costs and amortization of bond discount. For 2024, amortization of debt issuance costs was $\n1.8\n million, and for both 2023 and 2022, amortization of debt issuance costs was $\n1.6\n million. For 2024, 2023, and 2022, amortization of bond discount was $\n0.5\n million.\n\n\n11.\nCash, Cash Equivalents, and Marketable Debt Securities \nThe following table shows the Company’s cash, cash equivalents, HTM debt securities, and AFS debt securities by major asset category at December 31, 2024 and 2023 (in millions):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAdjusted\nCost Basis\n\n\n \n\n\n \n\n\nUnrealized\nGain\n\n\n \n\n\n \n\n\nUnrealized\nLoss\n\n\n \n\n\n \n\n\nFair\nValue\n\n\n \n\n\n \n\n\nCash and\nCash Equivalents\n\n\n \n\n\n \n\n\nShort-Term\nMarketable \nDebt Securities\n\n\n \n\n\n \n\n\nLong-Term\nMarketable\nDebt Securities\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n684.8\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n684.8\n\n\n \n\n\n \n\n\n$\n\n\n684.8\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nLevel 1 \n(a)\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. Treasury securities\n\n\n \n\n\n \n\n\n30.8\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n30.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n23.0\n\n\n \n\n\n \n\n\n \n\n\n7.9\n\n\n \n\n\n\n\n\n\nMoney market funds\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nSubtotal\n\n\n \n\n\n \n\n\n31.0\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n31.1\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n23.0\n\n\n \n\n\n \n\n\n \n\n\n7.9\n\n\n \n\n\n\n\n\n\nLevel 2 \n(b)\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCorporate debt securities\n\n\n \n\n\n \n\n\n131.2\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n131.5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n75.8\n\n\n \n\n\n \n\n\n \n\n\n55.7\n\n\n \n\n\n\n\n\n\nCertificates of deposit\n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nU.S. government agency securities\n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n\n\n\n\nSubtotal\n\n\n \n\n\n \n\n\n136.0\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n136.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n79.0\n\n\n \n\n\n \n\n\n \n\n\n57.3\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n851.8\n\n\n \n\n\n \n\n\n$\n\n\n0.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n852.2\n\n\n \n\n\n \n\n\n$\n\n\n685.0\n\n\n \n\n\n \n\n\n$\n\n\n102.0\n\n\n \n\n\n \n\n\n$\n\n\n65.2\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAdjusted\nCost Basis\n\n\n \n\n\n \n\n\nUnrealized\nGain\n\n\n \n\n\n \n\n\nUnrealized\nLoss\n\n\n \n\n\n \n\n\nFair\nValue\n\n\n \n\n\n \n\n\nCash and\nCash Equivalents\n\n\n \n\n\n \n\n\nShort-Term\nMarketable \nDebt Securities\n\n\n \n\n\n \n\n\nLong-Term\nMarketable\nDebt Securities\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n646.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n646.4\n\n\n \n\n\n \n\n\n$\n\n\n646.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nTime Deposits \n(c)\n:\n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLevel 1 \n(a)\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. Treasury securities\n\n\n \n\n\n \n\n\n29.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n11.3\n\n\n \n\n\n \n\n\n \n\n\n18.0\n\n\n \n\n\n\n\n\n\nMoney market funds\n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nSubtotal\n\n\n \n\n\n \n\n\n30.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n30.9\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n11.3\n\n\n \n\n\n \n\n\n \n\n\n18.0\n\n\n \n\n\n\n\n\n\nLevel 2 \n(b)\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCorporate debt securities\n\n\n \n\n\n \n\n\n112.5\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n112.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n68.5\n\n\n \n\n\n \n\n\n \n\n\n43.9\n\n\n \n\n\n\n\n\n\nU.S. government agency securities\n\n\n \n\n\n \n\n\n10.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n10.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n7.8\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n\n\n\n\nCertificates of deposit\n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nSubtotal\n\n\n \n\n\n \n\n\n128.5\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n128.3\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n82.2\n\n\n \n\n\n \n\n\n \n\n\n46.1\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n1,205.8\n\n\n \n\n\n \n\n\n$\n\n\n0.3\n\n\n \n\n\n \n\n\n$\n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n$\n\n\n1,205.6\n\n\n \n\n\n \n\n\n$\n\n\n648.0\n\n\n \n\n\n \n\n\n$\n\n\n493.5\n\n\n \n\n\n \n\n\n$\n\n\n64.1\n\n\n \n\n\n\n\n \n(a)\nValuations based on quoted prices for identical assets and liabilities in active markets.\n(b)\nValuations based on observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data.\n(c)\nWe had $\n400.0\n million of investments in time deposits classified as HTM debt securities as of December 31, 2023, which matured within one year and were recorded in “Short-term marketable debt securities” on our Consolidated Balance Sheets. We recorded these HTM debt securities at amortized cost, which approximated fair value. We did not have any investments in HTM debt securities as of December 31, 2024, as the investments in time deposits matured on September 12, 2024. The proceeds received from the maturity of these time deposits were used to repay our \n3.65\n% senior notes due 2024, which matured on September 15, 2024.\nFor the years ended December 31, 2024, 2023 and 2022, net realized gains and losses on the sales and maturities of certain marketable debt securities were insignificant.\n \n\n\n54\n\n\n\n\n \n\n\nThe Company invests in highly rated securities, with the primary objective of minimizing the potential risk of principal loss. The Company’s investment policy requires securities to be investment grade and limits the amount of credit exposure to any one issuer. The maturities of the Company’s long-term marketable debt securities generally range from \none\n to \ntwo years\n.\nFair values were determined for each individual marketable debt security in the investment portfolio. When evaluating a marketable debt security for other-than-temporary impairment, PCA reviews factors such as the duration and extent to which the fair value of the marketable debt security is less than its cost, the financial condition of the issuer and any changes thereto, the general market condition in which the issuer operates, and PCA’s intent to sell or whether it will more likely than not be required to sell, the marketable debt security before recovery of its amortized cost basis.\nAs of December 31, 2024 and 2023, we do \nno\nt consider any of the impairments related to our marketable debt securities to be the result of credit losses. Therefore, we have \nno\nt recorded an allowance for credit losses related to our marketable debt securities. All unrealized gains and losses were recorded in other comprehensive income (OCI).\n \n \n \nThe following table provides information about the Company’s marketable debt securities that have been in a continuous loss position as of December 31, 2024 and 2023 (in millions, except number of marketable debt securities in a loss position):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nFair Value of\nMarketable\nDebt Securities in a Loss Position \n< 12 Months\n\n\n \n\n\n \n\n\nNumber of Marketable\nDebt Securities\nin a Loss Position\n< 12 Months\n\n\n \n\n\n \n\n\nUnrealized Losses \n<\n 12 Months\n\n\n \n\n\n \n\n\nFair Value of\nMarketable\nDebt Securities in a Loss Position \n≥ 12 Months\n\n\n \n\n\n \n\n\nNumber of Marketable\nDebt Securities\nin a Loss Position\n≥ 12 Months\n\n\n \n\n\n \n\n\nUnrealized Losses \n≥ 12 Months (d)\n\n\n \n\n\n\n\n\n\nCorporate debt securities\n\n\n \n\n\n$\n\n\n16.5\n\n\n \n\n\n \n\n\n \n\n\n26\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nU.S. Treasury securities\n\n\n \n\n\n \n\n\n3.1\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nU.S. government agency securities\n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n20.4\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n9.4\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nFair Value of\nMarketable\nDebt Securities in a Loss Position \n< 12 Months\n\n\n \n\n\n \n\n\nNumber of Marketable\nDebt Securities\nin a Loss Position\n< 12 Months\n\n\n \n\n\n \n\n\nUnrealized Losses \n<\n 12 Months\n\n\n \n\n\n \n\n\nFair Value of\nMarketable\nDebt Securities in a Loss Position \n≥ 12 Months\n\n\n \n\n\n \n\n\nNumber of Marketable\nDebt Securities\nin a Loss Position\n≥ 12 Months\n\n\n \n\n\n \n\n\nUnrealized Losses \n≥ 12 Months\n\n\n \n\n\n\n\n\n\nCorporate debt securities\n\n\n \n\n\n$\n\n\n27.9\n\n\n \n\n\n \n\n\n \n\n\n35\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n36.2\n\n\n \n\n\n \n\n\n \n\n\n49\n\n\n \n\n\n \n\n\n$\n\n\n0.3\n\n\n \n\n\n\n\n\n\nU.S. Treasury securities\n\n\n \n\n\n \n\n\n11.4\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6.2\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nU.S. government agency securities\n\n\n \n\n\n \n\n\n8.5\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1.5\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n47.8\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n43.9\n\n\n \n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n$\n\n\n0.4\n\n\n \n\n\n\n\n \n(d)\nUnrealized losses were insignificant for debt securities in a continuous loss position greater than or equal to 12 months for the period ended December 31, 2024. \n\n\n12.\nEmployee Benefit Plans and Other Postretirement Benefits \nPCA has defined pension benefit plans for both salaried and hourly employees. The plans covering salaried employees are closed to new entrants with only certain current active participants still accruing benefits. The plans covering certain hourly employees are closed to new participants. We also have a Supplemental Executive Retirement Plan (SERP) and other nonqualified defined benefit pension plans that provide supplemental retirement benefits to certain of our current and former management employees. The SERP provides for incremental pension benefits in excess of those offered in our principal pension plans.\nOther Postretirement Benefits\nPCA provides postretirement medical and life insurance benefits for certain retired employees.\n\n\n55\n\n\n\n\n \n\n\nObligations and Funded Status of Defined Benefit Pension and\n \nOther Postretirement Benefits Plans\nThe funded status of PCA’s plans change from year to year based on the plan asset investment return, contributions, benefit payments, the discount rate used to measure the liability, and expected participant longevity. \nThe following table, which includes only company-sponsored defined benefit and other postretirement benefit plans, reconciles the beginning and ending balances of the projected benefit obligation and the fair value of plan assets. We recognize the funded status of these plans on the Consolidated Balance Sheets, and we recognize changes in funded status in the year changes occur through the Consolidated Statements of Comprehensive Income (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPension Plans\n\n\n \n\n\n \n\n\nPostretirement Plans\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nChange in Benefit Obligation:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBenefit obligation at beginning of period\n\n\n \n\n\n$\n\n\n1,202.1\n\n\n \n\n\n \n\n\n$\n\n\n1,167.1\n\n\n \n\n\n \n\n\n$\n\n\n10.5\n\n\n \n\n\n \n\n\n$\n\n\n9.5\n\n\n \n\n\n\n\n\n\nService cost\n\n\n \n\n\n \n\n\n12.3\n\n\n \n\n\n \n\n\n \n\n\n14.1\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n\n\n\n\nInterest cost\n\n\n \n\n\n \n\n\n55.3\n\n\n \n\n\n \n\n\n \n\n\n55.8\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n\n\n\n\nPlan amendments\n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nActuarial (gain) loss (a)\n\n\n \n\n\n \n\n\n(\n89.8\n\n\n)\n\n\n \n\n\n \n\n\n23.3\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n1.5\n\n\n \n\n\n\n\n\n\nParticipant contributions\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nBenefits paid\n\n\n \n\n\n \n\n\n(\n63.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n61.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.6\n\n\n)\n\n\n\n\n\n\nBenefit obligation at plan year end\n\n\n \n\n\n$\n\n\n1,118.7\n\n\n \n\n\n \n\n\n$\n\n\n1,202.1\n\n\n \n\n\n \n\n\n$\n\n\n10.1\n\n\n \n\n\n \n\n\n$\n\n\n10.5\n\n\n \n\n\n\n\n\n\nAccumulated benefit obligation portion of above\n\n\n \n\n\n$\n\n\n1,098.7\n\n\n \n\n\n \n\n\n$\n\n\n1,173.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nChange in Fair Value of Plan Assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPlan assets at fair value at beginning of period\n\n\n \n\n\n$\n\n\n1,161.6\n\n\n \n\n\n \n\n\n$\n\n\n1,055.3\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nActual return on plan assets\n\n\n \n\n\n \n\n\n9.5\n\n\n \n\n\n \n\n\n \n\n\n115.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nCompany contributions\n\n\n \n\n\n \n\n\n26.2\n\n\n \n\n\n \n\n\n \n\n\n51.5\n\n\n \n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n \n\n\n\n\n\n\nParticipant contributions\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nBenefits paid\n\n\n \n\n\n \n\n\n(\n63.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n61.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.6\n\n\n)\n\n\n\n\n\n\nFair value of plan assets at plan year end\n\n\n \n\n\n$\n\n\n1,133.4\n\n\n \n\n\n \n\n\n$\n\n\n1,161.6\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nOverfunded (underfunded) status\n\n\n \n\n\n$\n\n\n14.7\n\n\n \n\n\n \n\n\n$\n\n\n(\n40.5\n\n\n)\n\n\n \n\n\n$\n\n\n(\n10.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n10.5\n\n\n)\n\n\n\n\n\n\nAmounts Recognized on Consolidated Balance Sheets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNoncurrent assets\n\n\n \n\n\n$\n\n\n63.3\n\n\n \n\n\n \n\n\n$\n\n\n26.5\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nCurrent liabilities\n\n\n \n\n\n \n\n\n(\n2.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n\n\n\n\nNoncurrent liabilities\n\n\n \n\n\n \n\n\n(\n45.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n65.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n9.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n10.0\n\n\n)\n\n\n\n\n\n\nAccrued asset (obligation) recognized at December 31\n\n\n \n\n\n$\n\n\n14.7\n\n\n \n\n\n \n\n\n$\n\n\n(\n40.5\n\n\n)\n\n\n \n\n\n$\n\n\n(\n10.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n10.5\n\n\n)\n\n\n\n\n\n\nAmounts Recognized in Accumulated Other \nComprehensive Loss (Pre-Tax)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n$\n\n\n26.4\n\n\n \n\n\n \n\n\n$\n\n\n29.2\n\n\n \n\n\n \n\n\n$\n\n\n(\n3.4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n3.8\n\n\n)\n\n\n\n\n\n\nActuarial loss\n\n\n \n\n\n \n\n\n81.8\n\n\n \n\n\n \n\n\n \n\n\n116.0\n\n\n \n\n\n \n\n\n \n\n\n(\n4.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.7\n\n\n)\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n108.2\n\n\n \n\n\n \n\n\n$\n\n\n145.2\n\n\n \n\n\n \n\n\n$\n\n\n(\n7.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n8.5\n\n\n)\n\n\n\n\n \n(a)\nFor the year ended December 31, 2024, the most significant driver of the decrease in the aggregate benefit obligations for the pension and OPEB plans was the actuarial gain due to an increase in the discount rate assumption. Additional gains due to participant experience and the decrease in the salary scale were offset by actuarial losses due to increases in the PCA Hourly Pension Plan benefit multipliers and updated medical assumptions to better reflect anticipated future experience.\n \nFor the year ended December 31, 2023, the most significant driver of the increase in aggregate benefit obligations for the pension and OPEB plans was the actuarial losses due to a decrease in the discount rate assumption, PCA Hourly Pension Plan benefit multiplier increases, and changes in salary scale and medical claims assumptions to better reflect anticipated future experience.\n\n\n56\n\n\n\n\n \n\n\nComponents of Net Periodic Benefit Cost and Other Comprehensive Loss (Income)\nThe components of net periodic benefit cost and other comprehensive loss (income) (pretax) were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPension Plans\n\n\n \n\n\n \n\n\nPostretirement Plans\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nService cost\n\n\n \n\n\n$\n\n\n12.3\n\n\n \n\n\n \n\n\n$\n\n\n14.1\n\n\n \n\n\n \n\n\n$\n\n\n19.3\n\n\n \n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n\n\n\n\nInterest cost\n\n\n \n\n\n \n\n\n55.3\n\n\n \n\n\n \n\n\n \n\n\n55.8\n\n\n \n\n\n \n\n\n \n\n\n34.7\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n\n\n\n\nExpected return on plan assets\n\n\n \n\n\n \n\n\n(\n65.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n57.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n55.7\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nNet amortization of unrecognized amounts:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrior service cost (credit)\n\n\n \n\n\n \n\n\n5.6\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n \n\n\n \n\n\n3.6\n\n\n \n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n\n\n\n\nActuarial loss (gain)\n\n\n \n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n \n\n\n \n\n\n3.4\n\n\n \n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n\n\n\n\nNet periodic benefit cost\n\n\n \n\n\n$\n\n\n8.1\n\n\n \n\n\n \n\n\n$\n\n\n22.1\n\n\n \n\n\n \n\n\n$\n\n\n5.3\n\n\n \n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.3\n\n\n)\n\n\n\n\n\n\nChanges in plan assets and benefit obligations\n  recognized in other comprehensive \n  loss (income):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nActuarial net (gain) loss\n\n\n \n\n\n$\n\n\n(\n33.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n35.5\n\n\n)\n\n\n \n\n\n$\n\n\n28.6\n\n\n \n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n \n\n\n$\n\n\n1.5\n\n\n \n\n\n \n\n\n$\n\n\n(\n3.4\n\n\n)\n\n\n\n\n\n\nPrior service cost\n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n15.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAmortization of prior service cost (credit)\n\n\n \n\n\n \n\n\n(\n5.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n5.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.6\n\n\n)\n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nAmortization of actuarial loss (gain)\n\n\n \n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.4\n\n\n)\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nTotal recognized in other comprehensive \n   loss (income) (b)\n\n\n \n\n\n$\n\n\n(\n37.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n41.9\n\n\n)\n\n\n \n\n\n$\n\n\n36.7\n\n\n \n\n\n \n\n\n$\n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n2.3\n\n\n \n\n\n \n\n\n$\n\n\n(\n2.6\n\n\n)\n\n\n\n\n\n\nTotal recognized in net periodic benefit\n  cost and other comprehensive loss (income) (pre-tax)\n\n\n \n\n\n$\n\n\n(\n29.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n19.8\n\n\n)\n\n\n \n\n\n$\n\n\n42.0\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n2.2\n\n\n \n\n\n \n\n\n$\n\n\n(\n2.9\n\n\n)\n\n\n\n\n \n(a)\nAccumulated losses in excess of \n10\n% of the greater of the projected benefit obligation or the market-related value of assets will be recognized on a straight-line basis over the average remaining service period of active employees in PCA plans (which is between five and \nnine years\n) and over the average remaining lifetime of inactive participants in the Boise plan (which is approximately 22 years), to the extent that losses are not offset by gains in subsequent years.\n \nFor the years ended December 31, 2024 and 2023, the accumulated benefit obligations for the plans with obligations in excess of plan assets is $\n44.7\n million and $\n42.9\n million, respectively, the pension benefit obligations for the plans with obligations in excess of plan assets is $\n48.6\n million and $\n334.3\n million, respectively, and the fair value of the plan assets for the plans with obligations in excess of plan assets is $\n0.0\n million and $\n267.2\n million, respectively. Additionally, for the years ended December 31, 2024 and 2023, the accumulated benefit obligations for the OPEB plans with obligations in excess of plan assets is $\n10.1\n million and $\n10.5\n million, respectively.\nAssumptions\nThe following table presents the assumptions used in the measurement of our benefits obligations:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPension Plans\n\n\n \n\n\nPostretirement Plans\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\nDecember 31,\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n\n\n\n\nWeighted-Average Assumptions Used to\n   Determine Benefit Obligations at\n   December 31:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n5.56\n %\n\n\n \n\n\n4.86\n %\n\n\n \n\n\n5.06\n %\n\n\n \n\n\n5.62\n %\n\n\n \n\n\n4.90\n %\n\n\n \n\n\n5.07\n %\n\n\n\n\n\n\nRate of compensation increase\n\n\n \n\n\n4.75\n %\n\n\n \n\n\n4.75\n %\n\n\n \n\n\n4.00\n %\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n\n\n\n\nWeighted-Average Assumptions Used to\n   Determine Net Periodic Benefit Cost for the\n   Years Ended December 31:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiscount rate\n\n\n \n\n\n4.86\n %\n\n\n \n\n\n5.06\n %\n\n\n \n\n\n2.89\n %\n\n\n \n\n\n4.90\n %\n\n\n \n\n\n5.07\n %\n\n\n \n\n\n2.92\n %\n\n\n\n\n\n\nExpected return on plan assets\n\n\n \n\n\n5.80\n %\n\n\n \n\n\n5.52\n %\n\n\n \n\n\n4.08\n %\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n\n\n\n\nRate of compensation increase\n\n\n \n\n\n4.75\n %\n\n\n \n\n\n4.75\n %\n\n\n \n\n\n4.00\n %\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n \n\n\nN/A\n\n\n\n\n \n\n\n57\n\n\n\n\n \n\n\nDiscount Rate Assumption.\n The discount rate reflects the current rate at which the pension obligations could be settled on the measurement date: December 31. The discount rate assumption used to calculate the present value of pension and postretirement benefit obligations reflects the rates available on high-quality, fixed-income debt instruments at December 31. In all periods, the bonds included in the models reflect anticipated investments that would be made to match the expected monthly benefit payments over time. The plans’ projected cash flows were duration-matched to these models to develop an appropriate discount rate.\nAsset Return Assumption. \nThe expected return on plan assets reflects the expected long-term rates of return for the categories of investments currently held in the plans as well as anticipated returns for additional contributions made in the future. The expected long-term rate of return is adjusted when there are fundamental changes in expected returns on the plan investments. The weighted-average expected return on plan assets we will use in our calculation of 2025 net periodic pension benefit cost is \n5.71\n%.\nRate of Compensation Increase.\n The rate of compensation increase is determined by PCA based upon annual reviews. The compensation increase assumption is not applicable for all plans as many of our pension plans are frozen and not accruing benefits.\nHealth Care Cost Trend Rate Assumptions. \nPCA assumed health care cost trend rates for its postretirement benefits plans were as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n\n\n\n\nHealth care cost trend rate assumed for next year\n\n\n \n\n\n8.09\n %\n\n\n \n\n\n7.13\n %\n\n\n \n\n\n7.24\n %\n\n\n\n\n\n\nRate to which the cost trend rate is assumed to decline\n   (the ultimate trend rate)\n\n\n \n\n\n4.45\n %\n\n\n \n\n\n4.44\n %\n\n\n \n\n\n4.42\n %\n\n\n\n\n\n\nYear that the rate reaches the ultimate trend rate\n\n\n \n\n\n2035\n\n\n \n\n\n2033\n\n\n \n\n\n2033\n\n\n\n\n \nPostretirement Health Care Plan Assumptions. \nFor postretirement health care plan accounting, PCA reviews external data and its own historical trends for health care costs to determine the health care cost trend rate assumption.\nInvestment Policies and Strategies\nPCA has retained the services of professional advisors to oversee pension investments and provide recommendations regarding investment strategy. PCA’s overall strategy and related apportionments between equity and debt securities may change from time to time based on market conditions, external economic factors, and the funded status of the plans. The general investment objective for all of our plan assets is to optimize growth of the pension plan trust assets, while minimizing the risk of significant losses to enable the plans to satisfy their benefit payment obligations over time. The objectives take into account the long-term nature of the benefit obligations, the liquidity needs of the plans, and the expected risk/return trade-offs of the asset classes in which the plans may choose to invest. \nAssets of our pension plans were invested in the following classes of securities at December 31, 2024 and 2023:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPercentage\nof Fair Value at December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nFixed income securities\n\n\n \n\n\n \n\n\n87\n\n\n %\n\n\n \n\n\n \n\n\n72\n\n\n %\n\n\n\n\n\n\nDomestic equity securities\n\n\n \n\n\n \n\n\n7\n\n\n %\n\n\n \n\n\n \n\n\n11\n\n\n %\n\n\n\n\n\n\nInternational equity securities\n\n\n \n\n\n \n\n\n3\n\n\n %\n\n\n \n\n\n \n\n\n15\n\n\n %\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n3\n\n\n %\n\n\n \n\n\n \n\n\n2\n\n\n %\n\n\n\n\n \nAt December 31, 2024, the targeted investment allocations differed between the plans based on funded status. For our pension plans, the weighted average target allocation of plan assets was \n91\n% in fixed income, \n8\n% in equities, and \n1\n% in other. Our retirement committee reviews the investment allocations for reasonableness at a minimum, semi-annually.\nInvestment securities, in general, are exposed to various risks, such as interest rate, credit, and overall market volatility risk, all of which are subject to change. Due to the level of risk associated with some investment securities, it is reasonably possible that changes in the values of investment securities will occur in the near term, and such changes could materially affect the reported amounts.\n\n\n58\n\n\n\n\n \n\n\nFair Value Measurements of Plan Assets\nThe following tables set forth, by level within the fair value hierarchy, discussed in Note 2, Summary of Significant Accounting Policies, the pension plan assets, by major asset category, at fair value at December 31, 2024 and 2023 (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFair Value Measurements at December 31, 2024\n\n\n \n\n\n\n\n\n\nAsset Category\n\n\n \n\n\nQuoted Prices in\nActive Markets\nfor Identical\nAssets (Level 1)\n\n\n \n\n\n \n\n\nSignificant\nOther Observable Inputs (Level 2)\n\n\n \n\n\n \n\n\nSignificant\nUnobservable\nInputs (Level 3)\n\n\n \n\n\n \n\n\nNet Asset Value (NAV) (a)\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nShort-term investments\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n29.7\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n29.7\n\n\n \n\n\n\n\n\n\nCommon/collective trust funds:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDomestic equities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n76.7\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n76.7\n\n\n \n\n\n\n\n\n\nInternational equities\n\n\n \n\n\n \n\n\n25.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n14.2\n\n\n \n\n\n \n\n\n \n\n\n39.2\n\n\n \n\n\n\n\n\n\nCorporate and government bonds:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCorporate bonds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n407.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n407.9\n\n\n \n\n\n\n\n\n\nFixed income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n321.7\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n321.7\n\n\n \n\n\n\n\n\n\nGovernment bonds and agencies\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n239.6\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n239.6\n\n\n \n\n\n\n\n\n\nMunicipal bonds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n12.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n12.0\n\n\n \n\n\n\n\n\n\nPrivate equity securities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n\n\n\n\nTotal securities at fair value\n\n\n \n\n\n$\n\n\n25.0\n\n\n \n\n\n \n\n\n$\n\n\n1,087.6\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n14.7\n\n\n \n\n\n \n\n\n$\n\n\n1,127.3\n\n\n \n\n\n\n\n\n\nAccrued income\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6.1\n\n\n \n\n\n\n\n\n\nTotal fair value of plan assets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,133.4\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFair Value Measurements at December 31, 2023\n\n\n \n\n\n\n\n\n\nAsset Category\n\n\n \n\n\nQuoted Prices in \nActive Markets\nfor Identical\nAssets (Level 1)\n\n\n \n\n\n \n\n\nSignificant \nOther Observable\nInputs (Level 2)\n\n\n \n\n\n \n\n\nSignificant\nUnobservable\nInputs (Level 3)\n\n\n \n\n\n \n\n\nNet Asset Value (NAV) (a)\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nShort-term investments\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n12.2\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n12.2\n\n\n \n\n\n\n\n\n\nCommon/collective trust funds:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInternational equities\n\n\n \n\n\n \n\n\n96.4\n\n\n \n\n\n \n\n\n \n\n\n53.7\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29.7\n\n\n \n\n\n \n\n\n \n\n\n179.8\n\n\n \n\n\n\n\n\n\nDomestic equities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n130.4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n130.4\n\n\n \n\n\n\n\n\n\nCorporate and government bonds:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCorporate bonds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n362.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n362.2\n\n\n \n\n\n\n\n\n\nGovernment bonds and agencies\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n297.5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n297.5\n\n\n \n\n\n\n\n\n\nFixed income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n160.7\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n160.7\n\n\n \n\n\n\n\n\n\nMunicipal bonds\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n12.7\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n12.7\n\n\n \n\n\n\n\n\n\nPrivate equity securities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n\n\n\n\nTotal securities at fair value\n\n\n \n\n\n$\n\n\n96.4\n\n\n \n\n\n \n\n\n$\n\n\n1,029.4\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n30.5\n\n\n \n\n\n \n\n\n$\n\n\n1,156.3\n\n\n \n\n\n\n\n\n\nAccrued income\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n5.3\n\n\n \n\n\n\n\n\n\nTotal fair value of plan assets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,161.6\n\n\n \n\n\n\n\n \n(a)\nIn accordance with ASC 820, \nFair Value Measurement\n, certain investments that do not have readily determinable fair values are measured at fair value using the net asset value (NAV) per share practical expedient and are not classified within the fair value hierarchy.\n \nFunding and Cash Flows\nPCA makes pension plan contributions that are sufficient to fund its actuarially determined costs, generally equal to the minimum amounts required by the Employee Retirement Income Security Act (ERISA). From time to time, PCA may make discretionary contributions based on the funded status of the plans, tax deductibility, income from operations, and other factors. In 2024, we made contributions of $\n25.0\n million to our qualified pension plans, and for both 2023 and 2022, we made contributions of $\n50.0\n million to our qualified pension plans. We do not have a required minimum contribution amount established for 2025.\n\n\n59\n\n\n\n\n \n\n\nThe following are estimated benefit payments to be paid to current plan participants by year (dollars in millions). Qualified pension benefit payments are paid from plan assets, while nonqualified pension benefit payments are paid by the Company.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPension\nPlans\n\n\n \n\n\n \n\n\nPostretirement \nPlans\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n70.3\n\n\n \n\n\n \n\n\n$\n\n\n0.5\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n73.8\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n76.5\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n78.8\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n \n\n\n\n\n\n\n2029-2034\n\n\n \n\n\n \n\n\n500.7\n\n\n \n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\n\n\nDefined Contribution Plans\nSome of our employees participate in defined contribution savings plans, available to most of our salaried and hourly employees. The defined contribution plans permit participants to make contributions by salary reduction pursuant to Section 401(k) of the Code. PCA made employer-matching contributions of $\n48.8\n million, $\n45.2\n million, and $\n44.3\n million in 2024, 2023, and 2022, respectively. All company-matching contributions to all employees were made in cash. We expense employer matching contributions and charge dividends on shares held by the ESOP to retained earnings. Shares of company stock held by the ESOP are included in basic shares for earnings-per-share computations. At both December 31, 2024 and 2023, the ESOP held \n1.1\n million shares of Company stock.\nCertain salaried and hourly employees that are not participating in a PCA sponsored defined benefit pension plan receive a service-related company retirement contribution to their defined contribution plan account in addition to any employer matching contribution. This contribution increases with years of service and ranges from \n3\n% to \n5\n% of base pay. We contributed $\n49.5\n million, $\n45.4\n million, and $\n43.7\n million for this retirement contribution during the years ended December 31, 2024, 2023, and 2022, respectively.\nDeferred Compensation Plans\nKey managers can elect to participate in a deferred compensation plan. The deferred compensation plan is unfunded; therefore, benefits are paid from our general assets. At December 31, 2024 and 2023, we had $\n40.5\n million and $\n31.0\n million, respectively, of liabilities attributable to participation in our deferred compensation plan on our Consolidated Balance Sheets.\n\n\n13.\nAsset Retirement Obligations\nOur asset retirement obligations relate predominantly to landfill closure, wastewater treatment pond dredging, closed-site monitoring costs, and certain leasehold improvements. In accordance with ASC 410, \nAsset Retirement and Environmental Obligations,\n we recognize the fair value of these liabilities as an asset retirement obligation and capitalize that cost as part of the cost basis of the related asset in the period in which the costs are incurred if sufficient information is available to reasonably estimate the fair value of the obligation. Fair value estimates are determined using Level 3 inputs in the fair value hierarchy. The fair value of our asset retirement obligations is measured using expected future cash outflows discounted using the Company’s credit-adjusted risk-free interest rate. Over time, the liability is accreted to its settlement value, and the capitalized cost is depreciated over the useful life of the related asset. These liabilities are based on the best estimate of costs and are updated periodically to reflect current technology, laws and regulations, inflation, and other economic factors. Occasionally, we become aware of events or circumstances that require us to revise our future estimated cash flows. When revisions become necessary, we recalculate our obligation and adjust our asset and liability accounts utilizing appropriate discount rates. No assets are legally restricted for purposes of settling asset retirement obligations. Upon settlement of the liability, we will recognize a gain or loss for any difference between the settlement amount and the liability recorded.\nThe following table describes changes to the asset retirement obligation liability (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAsset retirement obligation at beginning of period\n\n\n \n\n\n$\n\n\n31.4\n\n\n \n\n\n \n\n\n$\n\n\n30.2\n\n\n \n\n\n\n\n\n\nAccretion expense\n\n\n \n\n\n \n\n\n1.5\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n\n\n\n\nLiabilities incurred\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nPayments\n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n\n\n\n\nRevisions in estimated cash flows\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n\n\n\n\nAsset retirement obligation at end of period\n\n\n \n\n\n$\n\n\n32.4\n\n\n \n\n\n \n\n\n$\n\n\n31.4\n\n\n \n\n\n\n\n \n\n\n60\n\n\n\n\n \n\n\nWe have additional asset retirement obligations with indeterminate settlement dates. The fair value of these asset retirement obligations cannot be estimated due to the lack of sufficient information to estimate the settlement dates of the obligations. These asset retirement obligations include, for example, (i) removal and disposal of potentially hazardous materials related to equipment and/or an operating facility if the equipment and/or facilities were to undergo major maintenance, renovation, or demolition and (ii) storage sites or owned facilities for which removal and/or disposal of chemicals and other related materials are required if the operating facility is closed. We will recognize a liability in the period in which sufficient information becomes available to reasonably estimate the fair value of these obligations.\n\n\n14.\nShare-Based Compensation \nThe Company has a long-term equity incentive plan, \nwhich allows for grants of restricted stock, performance awards, stock appreciation rights, and stock options to directors, officers, and employees, as well as others who engage in services for PCA. On February 28, 2024, our board of directors approved, and, on May 8, 2024, our stockholders approved, the amendment and restatement of the plan. The amendment extended the plan’s term to \nMay 8, 2034\n and increased the number of shares of common stock available for issuance under the plan by \n2.4\n million shares. The total number of shares authorized for past and future awards is \n14.3\n million shares.\n \n \nAs of December 31, 2024, assuming performance units are paid out at the target level of performance, \n2.8\n million shares were available for future grants under the current plan. Forfeitures are added back to the pool of shares of common stock available to be granted at a future date.\nRestricted Stock\nRestricted stock awards granted to officers and employees generally vest at the end of a \nfour-year\n period, and restricted stock awards granted to directors vest immediately. \nA summary of the Company’s restricted stock activity follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n\n\n\n\nRestricted stock at January 1\n\n\n \n\n\n \n\n\n671,723\n\n\n \n\n\n \n\n\n$\n\n\n127.15\n\n\n \n\n\n \n\n\n \n\n\n655,914\n\n\n \n\n\n \n\n\n$\n\n\n117.14\n\n\n \n\n\n \n\n\n \n\n\n651,448\n\n\n \n\n\n \n\n\n$\n\n\n109.16\n\n\n \n\n\n\n\n\n\nGranted\n\n\n \n\n\n \n\n\n175,956\n\n\n \n\n\n \n\n\n \n\n\n176.60\n\n\n \n\n\n \n\n\n \n\n\n196,821\n\n\n \n\n\n \n\n\n \n\n\n134.68\n\n\n \n\n\n \n\n\n \n\n\n175,047\n\n\n \n\n\n \n\n\n \n\n\n145.63\n\n\n \n\n\n\n\n\n\nVested (a)\n\n\n \n\n\n \n\n\n(\n219,530\n\n\n)\n\n\n \n\n\n \n\n\n105.10\n\n\n \n\n\n \n\n\n \n\n\n(\n174,139\n\n\n)\n\n\n \n\n\n \n\n\n97.86\n\n\n \n\n\n \n\n\n \n\n\n(\n153,171\n\n\n)\n\n\n \n\n\n \n\n\n115.33\n\n\n \n\n\n\n\n\n\nForfeitures\n\n\n \n\n\n \n\n\n(\n7,746\n\n\n)\n\n\n \n\n\n \n\n\n154.95\n\n\n \n\n\n \n\n\n \n\n\n(\n6,873\n\n\n)\n\n\n \n\n\n \n\n\n129.74\n\n\n \n\n\n \n\n\n \n\n\n(\n17,410\n\n\n)\n\n\n \n\n\n \n\n\n120.68\n\n\n \n\n\n\n\n\n\nRestricted stock at December 31\n\n\n \n\n\n \n\n\n620,403\n\n\n \n\n\n \n\n\n$\n\n\n148.63\n\n\n \n\n\n \n\n\n \n\n\n671,723\n\n\n \n\n\n \n\n\n$\n\n\n127.15\n\n\n \n\n\n \n\n\n \n\n\n655,914\n\n\n \n\n\n \n\n\n$\n\n\n117.14\n\n\n \n\n\n\n\n \n(a)\nThe total fair value of awards upon vesting for the years ended December 31, 2024, 2023, and 2022 was $\n39.2\n million,\n \n$\n22.7\n million, and $\n21.8\n million, respectively\n.\nPerformance Units\nPerformance unit awards granted to certain officers are earned based on the achievement of defined performance rankings of Return on Invested Capital (ROIC) or Total Shareholder Return (TSR) compared to ROIC and TSR for peer companies. ROIC performance unit awards vest \nfour years\n after the grant date, while TSR performance unit awards vest approximately \nthree years\n after the grant date. Both ROIC and TSR performance units are paid out entirely in shares of the Company’s common stock. \nA summary of the Company’s performance unit activity follows: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nUnits\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n \n\n\nUnits\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n \n\n\nUnits\n\n\n \n\n\n \n\n\nWeighted\nAverage Grant-\nDate Fair Value\n\n\n \n\n\n\n\n\n\nPerformance units at January 1\n\n\n \n\n\n \n\n\n372,777\n\n\n \n\n\n \n\n\n$\n\n\n119.22\n\n\n \n\n\n \n\n\n \n\n\n358,449\n\n\n \n\n\n \n\n\n$\n\n\n109.89\n\n\n \n\n\n \n\n\n \n\n\n358,092\n\n\n \n\n\n \n\n\n$\n\n\n105.38\n\n\n \n\n\n\n\n\n\nGranted\n\n\n \n\n\n \n\n\n129,923\n\n\n \n\n\n \n\n\n \n\n\n189.01\n\n\n \n\n\n \n\n\n \n\n\n146,331\n\n\n \n\n\n \n\n\n \n\n\n140.09\n\n\n \n\n\n \n\n\n \n\n\n133,017\n\n\n \n\n\n \n\n\n \n\n\n148.71\n\n\n \n\n\n\n\n\n\nVested (b)\n\n\n \n\n\n \n\n\n(\n139,984\n\n\n)\n\n\n \n\n\n \n\n\n182.64\n\n\n \n\n\n \n\n\n \n\n\n(\n132,003\n\n\n)\n\n\n \n\n\n \n\n\n117.03\n\n\n \n\n\n \n\n\n \n\n\n(\n132,404\n\n\n)\n\n\n \n\n\n \n\n\n136.62\n\n\n \n\n\n\n\n\n\nForfeitures\n\n\n \n\n\n \n\n\n(\n4,250\n\n\n)\n\n\n \n\n\n \n\n\n168.20\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n256\n\n\n)\n\n\n \n\n\n \n\n\n145.26\n\n\n \n\n\n\n\n\n\nPerformance units at December 31\n\n\n \n\n\n \n\n\n358,466\n\n\n \n\n\n \n\n\n$\n\n\n119.17\n\n\n \n\n\n \n\n\n \n\n\n372,777\n\n\n \n\n\n \n\n\n$\n\n\n119.22\n\n\n \n\n\n \n\n\n \n\n\n358,449\n\n\n \n\n\n \n\n\n$\n\n\n109.89\n\n\n \n\n\n\n\n \n(b)\nThe total fair value of awards upon vesting, including dividends, for the years ended December 31, 2024, 2023, and 2022 was $\n27.8\n million, $\n19.3\n million, and $\n19.7\n million, respectively. Upon vesting of the awards in 2024, 2023, and 2022, PCA issued \n152,196\n \nshares, \n146,631\n shares, and \n144,193\n shares, respectively. For 2024, 2023, and 2022, these amounts included \n12,212\n \nshares, \n14,628\n shares, and \n11,789\n shares, respectively, for dividends accrued during the vesting period.\n\n\n61\n\n\n\n\n \n\n\nCompensation Expense\nOur share-based compensation expense is recorded in “Cost of sales” and “Selling, general, and administrative expenses” \nCompensation expense for share-based awards recognized in the Consolidated Statements of Income, net of forfeitures was as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nRestricted stock\n\n\n \n\n\n$\n\n\n30.6\n\n\n \n\n\n \n\n\n$\n\n\n25.5\n\n\n \n\n\n \n\n\n$\n\n\n22.5\n\n\n \n\n\n\n\n\n\nPerformance units\n\n\n \n\n\n \n\n\n18.2\n\n\n \n\n\n \n\n\n \n\n\n14.5\n\n\n \n\n\n \n\n\n \n\n\n13.1\n\n\n \n\n\n\n\n\n\nTotal share-based compensation expense\n\n\n \n\n\n \n\n\n48.8\n\n\n \n\n\n \n\n\n \n\n\n40.0\n\n\n \n\n\n \n\n\n \n\n\n35.6\n\n\n \n\n\n\n\n\n\nIncome tax benefit\n\n\n \n\n\n \n\n\n(\n12.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n10.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n8.9\n\n\n)\n\n\n\n\n\n\nShare-based compensation expense, net of tax benefit\n\n\n \n\n\n$\n\n\n36.6\n\n\n \n\n\n \n\n\n$\n\n\n30.0\n\n\n \n\n\n \n\n\n$\n\n\n26.7\n\n\n \n\n\n\n\n \nThe fair value of restricted stock is determined based on the closing price of the Company’s stock on the grant date. Compensation expense, net of estimated forfeitures, is recorded over the requisite service period. As PCA’s Board of Directors has the ability to accelerate the vesting of these awards upon an employee’s retirement, the Company accelerates the recognition of compensation expense for certain employees approaching normal retirement age.\nFor performance unit awards made in 2024, 2023, and 2022, in terms of grant date value, \n50\n% used total shareholder return (TSR) as the performance measure and \n50\n% used return on invested capital (ROIC) as the performance measure. All units awarded before 2018 used ROIC as the performance measure. The ROIC component of performance unit awards is valued based on the closing price of the stock on the grant date. As the ROIC component contains a performance condition, compensation expense, net of estimated forfeitures, is recorded over the requisite service period based on the most probable number of awards expected to vest. The TSR component of performance unit awards is valued using a Monte Carlo simulation as the TSR component contains a market condition. The Monte Carlo simulation estimates the fair value of the TSR component based on the expected term of the award, a risk-free interest rate, expected dividends, and expected volatility of the Company’s common stock and the common stock of the peer companies. Compensation expense is recorded ratably over the expected term of the award regardless of whether the market condition is satisfied.\nThe unrecognized compensation expense for all share-based awards was as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nUnrecognized \nCompensation \nExpense\n\n\n \n\n\n \n\n\nRemaining\nWeighted Average\nRecognition\nPeriod (in years)\n\n\n \n\n\n\n\n\n\nRestricted stock\n\n\n \n\n\n$\n\n\n29.3\n\n\n \n\n\n \n\n\n \n\n\n2.5\n\n\n \n\n\n\n\n\n\nPerformance units\n\n\n \n\n\n \n\n\n23.1\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n\n\n\n\nTotal unrecognized share-based compensation expense\n\n\n \n\n\n$\n\n\n52.4\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n\n\n \nWe evaluate share-based compensation expense on a quarterly basis based on our estimate of expected forfeitures, review of recent forfeiture activity, and expected future turnover. We recognize the effect of adjusting the forfeiture rate for all expense amortization in the period that we change the forfeiture estimate. The effect of forfeiture adjustments was insignificant in all periods presented.\n\n\n15.\nStockholders’ Equity \nDividends\nDuring the year ended December 31, 2024, we paid $\n448.8\n million of dividends to shareholders. On December 10, 2024, PCA’s Board of Directors declared a regular quarterly cash dividend of $\n1.25\n per share of common stock, which was paid on January 15, 2025 to shareholders of record as of December 20, 2024. The dividend payment was $\n112.3\n million.\n\n\n62\n\n\n\n\n \n\n\nShare Repurchase Program\nOn January 26, 2022, PCA announced that its Board of Directors authorized the repurchase of an additional $\n1\n billion of the Company’s outstanding common stock. At the time of the announcement, there was no remaining authority under previously announced programs. Repurchases may be made from time to time in open market or privately negotiated transactions in accordance with applicable securities regulations. The timing and amount of repurchases will be determined by the Company in its discretion based on factors such as PCA’s stock price and market and business conditions.\nThe Company did not repurchase any shares of its common stock under this authority during the twelve months ended December 31, 2024. At December 31, 2024, $\n436.0\n million of the authorized amount remained available for repurchase of the Company’s common stock.\n \nDuring 2023, we paid $\n41.5\n million, including fees, to repurchase \n0.3\n million shares of common stock, and during 2022, we paid $\n522.6\n million, including fees, to repurchase \n4.0\n million shares of common stock. All shares repurchased have been retired.\nAccumulated Other Comprehensive Income (Loss)\nChanges in AOCI, net of taxes, by component follows (dollars in millions). Amounts in parentheses indicate losses.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nUnrealized\nLoss On\nForeign Exchange Contracts\n\n\n \n\n\n \n\n\nUnrealized\n(Loss) Gain on Marketable\nDebt Securities\n\n\n \n\n\n \n\n\nUnfunded\nEmployee\nBenefit\nObligations\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nBalance at January 1, 2023\n\n\n \n\n\n$\n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n1.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n100.3\n\n\n)\n\n\n \n\n\n$\n\n\n(\n102.4\n\n\n)\n\n\n\n\n\n\nOther comprehensive income before reclassifications\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n23.2\n\n\n \n\n\n \n\n\n \n\n\n25.0\n\n\n \n\n\n\n\n\n\nAmounts reclassified from AOCI\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n6.4\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n\n\n\n\nNet current-period other comprehensive income\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n \n\n\n \n\n\n31.5\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2023\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n70.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n70.9\n\n\n)\n\n\n\n\n\n\nOther comprehensive income before reclassifications\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n23.1\n\n\n \n\n\n \n\n\n \n\n\n23.4\n\n\n \n\n\n\n\n\n\nAmounts reclassified from AOCI\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n\n\n\n\nNet current-period other comprehensive income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n27.2\n\n\n \n\n\n \n\n\n \n\n\n27.5\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2024\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n0.2\n\n\n \n\n\n \n\n\n$\n\n\n(\n43.5\n\n\n)\n\n\n \n\n\n$\n\n\n(\n43.4\n\n\n)\n\n\n\n\n \nThe following table presents information about reclassifications out of AOCI (dollars in millions). Amounts in parentheses indicate expenses in the Consolidated Statements of Income.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nAmounts Reclassified from AOCI\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDetails about AOCI Components\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnfunded employee benefit obligations (a)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of prior service costs\n\n\n \n\n\n$\n\n\n(\n5.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n4.8\n\n\n)\n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of actuarial gains / (losses)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n(\n5.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n8.5\n\n\n)\n\n\n \n\n\nTotal before tax\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n1.4\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\nTax benefit\n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n(\n4.1\n\n\n)\n\n\n \n\n\n$\n\n\n(\n6.4\n\n\n)\n\n\n \n\n\nNet of tax\n\n\n\n\n \n(a)\nThese AOCI components are included in the computation of net pension and postretirement benefit costs. See Note 12, Employee Benefit Plans and Other Postretirement Benefits, for additional information.\n\n\n16.\nConcentrations of Risk\nODP Corporation (“ODP”), formerly Office Depot Inc., along with its subsidiaries and affiliates, is our largest customer in the Paper segment. Our Paper segment has had a long-standing commercial and contractual relationship with ODP. This relationship exposes us to a significant concentration of business and financial risk. Our sales to ODP represented approximately \n4\n% for 2024 and \n5\n% for 2023, and about \n58\n% and \n61\n% of our Paper segment sales revenue for those periods, respectively. At December 31, 2024 and 2023, we had $\n37.5\n million and $\n46.5\n million of accounts receivable due from ODP, respectively, which represents approximately \n3\n% and \n4\n% of our total Company receivables for those periods, respectively.\nIn 2024, sales to ODP represented about \n58\n% of our Paper segment sales. If these sales are reduced, we would need to find new customers. We may not be able to fully replace any lost sales, and any new sales may be at lower prices or higher costs. Any significant deterioration in the financial condition of ODP affecting its ability to pay or any other change that affects its willingness to purchase our products will harm our business and results of operations.\n\n\n63\n\n\n\n\n \n\n\nLabor\nAt December 31, 2024, we had approximately \n15,400\n employees, and approximately \n44\n%\n \nof these employees worked pursuant to collective bargaining agreements. Approximately \n60\n% of our hourly employees worked pursuant to collective bargaining agreements.\n The majority of our unionized employees are represented by the United Steel Workers (USW), the Printing Packaging Production Workers Union (PPPWU), the Association of Western Pulp and Paper Workers (AWPPW), the International Association of Machinists (IAM), and the International Brotherhood of Teamsters (IBT). Of the employees who work pursuant to collective bargaining agreements, a\npproximately \n23\n% work pursuant to collective bargaining agreements that will expire within the next twelve months.\n\n\n17.\nTransactions With Related Parties \nLouisiana Timber Procurement Company, L.L.C. (LTP) is a variable-interest entity that is \n50\n% owned by PCA and \n50\n% owned by Boise Cascade Company (Boise Cascade). LTP procures sawtimber, pulpwood, residual chips, and other residual wood fiber to meet the wood and fiber requirements of PCA and Boise Cascade in Louisiana. PCA is the primary beneficiary of LTP and has the power to direct the activities that most significantly affect the economic performance of LTP. Therefore, we consolidate 100% of LTP in our financial statements in our Corporate and Other segment. The carrying amounts of LTP’s assets and liabilities (which relate primarily to non-inventory working capital items) on our Consolidated Balance Sheets were $\n3.1\n million at December 31, 2024 and $\n3.3\n million at December 31, 2023. For 2024, 2023, and 2022, we recorded $\n80.9\n million, $\n80.2\n million, and $\n85.5\n million, respectively, of LTP sales to Boise Cascade in “Net Sales” in the Consolidated Statements of Income and approximately the same amount of expenses in “Cost of Sales”.\n \nFiber purchases from related parties were $\n10.7\n million for 2024, $\n11.5\n million for 2023, and $\n13.5\n million for 2022. Most of these purchases related to chip and log purchases by LTP from Boise Cascade’s wood products business. These purchases are recorded in “Cost of Sales” in the Consolidated Statements of Income.\n\n\n18.\nSegment Information \nReportable Segments\nWe report our business in \nthree\n reportable segments: Packaging, Paper, and Corporate and Other. These segments represent distinct businesses that are managed separately because of differing products and services. Each of these businesses requires distinct operating and marketing strategies.\n \nPackaging.\n We manufacture and sell a wide variety of containerboard and corrugated packaging products, including conventional shipping containers used to protect and transport manufactured goods, multi-color boxes and displays with strong visual appeal that help to merchandise the packaged product in retail locations. In addition, we are a large producer of packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products.\nPaper. \nWe manufacture and sell a range of communication-based papers. Our papers can be manufactured as either commodity papers or specialty papers with specialized or custom features, such as colors, coatings, high brightness, or recycled content.\n \nCorporate and Other. \nOur Corporate and Other segment includes corporate support staff services and related assets and liabilities, and foreign exchange gains and losses. This segment also includes transportation assets, such as rail cars and trucks, which we use to transport our products from some of our manufacturing sites and assets related to LTP. See Note 17, Transactions with Related Parties, for more information related to LTP. Sales in this segment relate primarily to LTP and our rail and truck business. We provide transportation services not only to our own facilities but also, on a limited basis, to third parties when geographic proximity and logistics are favorable. Rail cars and trucks are generally leased.\n \nEach segments’ profits and losses are measured on operating profits before non-operating pension income (expense), interest expense, net, and income taxes. For many of these allocated expenses, the related assets and liabilities remain in the Corporate and Other segment.\nAt December 31, 2024 and 2023, we did not have any significant long-lived assets held by foreign operations.\nChief Operating Decision Maker\nASC 280-10-50-5 (Topic 280) defines the chief operating decision maker (“CODM”) as an individual or group of individuals responsible for assessing the performance of the operating segments of a public entity and determining the overall resource allocation to those operating segments. Based on these criteria, we deem our Chief Executive Officer as the CODM, as the Chief Executive Officer is responsible for evaluating our operating results and concluding on the overall resource allocation.\n\n\n64\n\n\n\n\n \n\n\nAnalysis of Operations by Reportable Segment\nAn analysis of operations by reportable segment is as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ended December 31, 2024\n\n\n \n\n\nPackaging\n\n\n \n\n\n \n\n\nPaper\n\n\n \n\n\n \n\n\nCorporate and Other\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nTrade sales\n\n\n \n\n\n$\n\n\n7,668.9\n\n\n \n\n\n \n\n\n$\n\n\n624.7\n\n\n \n\n\n \n\n\n$\n\n\n89.7\n\n\n \n\n\n \n\n\n$\n\n\n8,383.3\n\n\n \n\n\n\n\n\n\nIntersegment sales\n\n\n \n\n\n \n\n\n22.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n157.4\n\n\n \n\n\n \n\n\n \n\n\n179.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n7,690.9\n\n\n \n\n\n \n\n\n \n\n\n624.7\n\n\n \n\n\n \n\n\n \n\n\n247.1\n\n\n \n\n\n \n\n\n \n\n\n8,562.7\n\n\n \n\n\n\n\n\n\nElimination of intersegment sales\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n179.4\n\n\n)\n\n\n\n\n\n\n   Net sales (a)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,383.3\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLess (b):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Variable costs (c)\n\n\n \n\n\n \n\n\n(\n3,767.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n338.7\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Fixed costs (d)\n\n\n \n\n\n \n\n\n(\n1,679.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n81.5\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Freight\n\n\n \n\n\n \n\n\n(\n798.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n69.4\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Other segment items (e)\n\n\n \n\n\n \n\n\n(\n344.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n5.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n377.0\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nIncome (loss) from operations\n\n\n \n\n\n \n\n\n1,101.5\n\n\n \n\n\n \n\n\n \n\n\n129.7\n\n\n \n\n\n \n\n\n \n\n\n(\n129.9\n\n\n)\n\n\n(f)\n\n\n \n\n\n1,101.3\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNon-operating pension income\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n4.5\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n41.4\n\n\n)\n\n\n\n\n\n\nIncome before taxes\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,064.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther segment disclosures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Segment sales to external customers\n\n\n \n\n\n$\n\n\n7,690.9\n\n\n \n\n\n \n\n\n$\n\n\n624.7\n\n\n \n\n\n \n\n\n$\n\n\n67.7\n\n\n \n\n\n(g)\n\n\n$\n\n\n8,383.3\n\n\n \n\n\n\n\n\n\n   Depreciation, amortization, \n   and depletion\n\n\n \n\n\n \n\n\n490.1\n\n\n \n\n\n \n\n\n \n\n\n19.5\n\n\n \n\n\n \n\n\n \n\n\n16.0\n\n\n \n\n\n \n\n\n \n\n\n525.6\n\n\n \n\n\n\n\n\n\n   Capital expenditures (h)\n\n\n \n\n\n \n\n\n626.6\n\n\n \n\n\n \n\n\n \n\n\n15.0\n\n\n \n\n\n \n\n\n \n\n\n28.1\n\n\n \n\n\n \n\n\n \n\n\n669.7\n\n\n \n\n\n\n\n\n\n   Assets\n\n\n \n\n\n \n\n\n7,253.2\n\n\n \n\n\n \n\n\n \n\n\n375.7\n\n\n \n\n\n \n\n\n \n\n\n1,204.3\n\n\n \n\n\n \n\n\n \n\n\n8,833.2\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ended December 31, 2023\n\n\n \n\n\nPackaging\n\n\n \n\n\n \n\n\nPaper\n\n\n \n\n\n \n\n\nCorporate and Other\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nTrade sales\n\n\n \n\n\n$\n\n\n7,116.7\n\n\n \n\n\n \n\n\n$\n\n\n595.4\n\n\n \n\n\n \n\n\n$\n\n\n90.3\n\n\n \n\n\n \n\n\n$\n\n\n7,802.4\n\n\n \n\n\n\n\n\n\nIntersegment sales\n\n\n \n\n\n \n\n\n18.9\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n157.6\n\n\n \n\n\n \n\n\n \n\n\n176.5\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n7,135.6\n\n\n \n\n\n \n\n\n \n\n\n595.4\n\n\n \n\n\n \n\n\n \n\n\n247.9\n\n\n \n\n\n \n\n\n \n\n\n7,978.9\n\n\n \n\n\n\n\n\n\nElimination of intersegment sales\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n176.5\n\n\n)\n\n\n\n\n\n\n   Net sales (a)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n7,802.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLess (b):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Variable costs (c)\n\n\n \n\n\n \n\n\n(\n3,406.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n317.3\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Fixed costs (d)\n\n\n \n\n\n \n\n\n(\n1,592.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n94.1\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Freight\n\n\n \n\n\n \n\n\n(\n747.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n62.9\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Other segment items (e)\n\n\n \n\n\n \n\n\n(\n315.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n366.0\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nIncome (loss) from operations\n\n\n \n\n\n \n\n\n1,074.3\n\n\n \n\n\n \n\n\n \n\n\n118.9\n\n\n \n\n\n \n\n\n \n\n\n(\n118.1\n\n\n)\n\n\n(f)\n\n\n \n\n\n1,075.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNon-operating pension expense\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n7.7\n\n\n)\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n53.3\n\n\n)\n\n\n\n\n\n\nIncome before taxes\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,014.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther segment disclosures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Segment sales to external customers\n\n\n \n\n\n$\n\n\n7,135.6\n\n\n \n\n\n \n\n\n$\n\n\n595.4\n\n\n \n\n\n \n\n\n$\n\n\n71.4\n\n\n \n\n\n(g)\n\n\n$\n\n\n7,802.4\n\n\n \n\n\n\n\n\n\n   Depreciation, amortization, \n   and depletion\n\n\n \n\n\n \n\n\n472.5\n\n\n \n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n \n\n\n \n\n\n15.6\n\n\n \n\n\n \n\n\n \n\n\n517.7\n\n\n \n\n\n\n\n\n\n   Capital expenditures (h)\n\n\n \n\n\n \n\n\n426.8\n\n\n \n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n \n\n\n \n\n\n33.2\n\n\n \n\n\n \n\n\n \n\n\n469.7\n\n\n \n\n\n\n\n\n\n   Assets\n\n\n \n\n\n \n\n\n6,903.7\n\n\n \n\n\n \n\n\n \n\n\n384.4\n\n\n \n\n\n \n\n\n \n\n\n1,393.0\n\n\n \n\n\n \n\n\n \n\n\n8,681.1\n\n\n \n\n\n\n\n \n\n\n65\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ended December 31, 2022\n\n\n \n\n\nPackaging\n\n\n \n\n\n \n\n\nPaper\n\n\n \n\n\n \n\n\nCorporate and Other\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nTrade sales\n\n\n \n\n\n$\n\n\n7,760.7\n\n\n \n\n\n \n\n\n$\n\n\n622.1\n\n\n \n\n\n \n\n\n$\n\n\n95.2\n\n\n \n\n\n \n\n\n$\n\n\n8,478.0\n\n\n \n\n\n\n\n\n\nIntersegment sales\n\n\n \n\n\n \n\n\n20.0\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n148.2\n\n\n \n\n\n \n\n\n \n\n\n168.2\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n7,780.7\n\n\n \n\n\n \n\n\n \n\n\n622.1\n\n\n \n\n\n \n\n\n \n\n\n243.4\n\n\n \n\n\n \n\n\n \n\n\n8,646.2\n\n\n \n\n\n\n\n\n\nElimination of intersegment sales\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n168.2\n\n\n)\n\n\n\n\n\n\n   Net sales (a)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,478.0\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLess (b):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Variable costs (c)\n\n\n \n\n\n \n\n\n(\n3,724.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n336.8\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Fixed costs (d)\n\n\n \n\n\n \n\n\n(\n1,543.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n92.8\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Freight\n\n\n \n\n\n \n\n\n(\n716.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n86.4\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n   Other segment items (e)\n\n\n \n\n\n \n\n\n(\n372.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n349.4\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nIncome (loss) from operations\n\n\n \n\n\n \n\n\n1,423.7\n\n\n \n\n\n \n\n\n \n\n\n103.0\n\n\n \n\n\n \n\n\n \n\n\n(\n106.0\n\n\n)\n\n\n(f)\n\n\n \n\n\n1,420.7\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNon-operating pension income\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n14.5\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(\n70.4\n\n\n)\n\n\n\n\n\n\nIncome before taxes\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,364.8\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther segment disclosures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   Segment sales to external customers\n\n\n \n\n\n$\n\n\n7,780.7\n\n\n \n\n\n \n\n\n$\n\n\n622.1\n\n\n \n\n\n \n\n\n$\n\n\n75.2\n\n\n \n\n\n(g)\n\n\n$\n\n\n8,478.0\n\n\n \n\n\n\n\n\n\n   Depreciation, amortization, \n   and depletion\n\n\n \n\n\n \n\n\n420.2\n\n\n \n\n\n \n\n\n \n\n\n26.1\n\n\n \n\n\n \n\n\n \n\n\n10.5\n\n\n \n\n\n \n\n\n \n\n\n456.8\n\n\n \n\n\n\n\n\n\n   Capital expenditures (h)\n\n\n \n\n\n \n\n\n753.5\n\n\n \n\n\n \n\n\n \n\n\n14.1\n\n\n \n\n\n \n\n\n \n\n\n56.6\n\n\n \n\n\n \n\n\n \n\n\n824.2\n\n\n \n\n\n\n\n\n\n   Assets\n\n\n \n\n\n \n\n\n6,986.5\n\n\n \n\n\n \n\n\n \n\n\n403.1\n\n\n \n\n\n \n\n\n \n\n\n614.2\n\n\n \n\n\n \n\n\n \n\n\n8,003.8\n\n\n \n\n\n\n\n \n(a)\nSales to foreign unaffiliated customers during the years ended December 31, 2024, 2023, and 2022 were $\n445.8\n million, $\n402.6\n million, and $\n512.9\n million, respectively.\n \n(b)\nThe significant expense categories align with the segment-level information that is regularly provided to the CODM.\n(c)\nFor the Packaging segment, primarily includes expense items for liner and medium consumption, purchased sheets usage, raw materials, energy, chemicals, hourly-employee related expenses and benefits, and miscellaneous supplies. For the Paper segment, primarily includes expense items for chemicals, raw materials, hourly-employee related expenses and benefits, and miscellaneous supplies.\n(d)\nFor the Packaging segment, primarily includes expense items for depreciation and salaried employee-related expenses and benefits. For the Paper segment, primarily includes expense items for depreciation, salaried employee-related expenses, and professional services.\n(e)\nOther segment items for each reportable segment primarily include:\n1.\nPackaging: farmout purchases, certain divisional allocations, and other expense/income items.\n2.\nPaper: other expense/income items.\n3.\nCorporate and Other: unallocated corporate costs, transportation business activity, and activity related to LTP.\n(f)\nThe significant expense categories reported for the Packaging and Paper segments are not used for Corporate and Other in the segment-level information that is regularly reviewed by the CODM. The CODM makes resource allocation decisions for Corporate and Other based on divisional income (loss) from operations.\n(g)\nThe Corporate and Other segment sales to external customers is presented net of total company intersegment eliminations.\n(h)\nIncludes “Additions to property, plant, and equipment” and excludes cash used for “Acquisition of business, net of cash acquired” as reported on our Consolidated Statements of Cash Flows.\n\n\n66\n\n\n\n\n \n\n\n19.\nCommitments, Guarantees, Indemnifications, and Legal Proceedings \nWe have financial commitments and obligations that arise in the ordinary course of our business. These include long-term debt (discussed in Note 10, Debt), lease obligations (discussed in Note 3, Leases), purchase commitments for goods and services, and legal proceedings (discussed below).\nPurchase Commitments\nIn the table below, we set forth our enforceable and legally binding purchase obligations as of December 31, 2024. \nThese obligations relate to various purchase agreements for items such as minimum amounts of energy, fiber, and chemical purchases over periods ranging from \none year\n to \n27\n years. \nSome of the amounts are based on management’s estimates and assumptions about these obligations, including their duration, anticipated actions by third parties, and other factors. Because these estimates and assumptions are necessarily subjective, our actual payments may vary from those reflected in the table. \nTotal purchase commitments with obligations greater than one year were as follows (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n100.9\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n76.4\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n44.5\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n13.0\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n10.6\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n64.3\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n309.7\n\n\n \n\n\n\n\n \nThe Company purchased a total of $\n403.5\n million, $\n432.6\n million, and $\n520.5\n million during the years ended December 31, 2024, 2023, and 2022, respectively, under these purchase agreements.\n \nEnvironmental Matters\nThe potential costs for various environmental matters are uncertain due to such factors as the unknown magnitude of possible cleanup costs, the complexity and evolving nature of governmental laws and regulations and their interpretations, and the timing, varying costs and effectiveness of alternative cleanup technologies. From 2006 through 2024, there were no significant environmental remediation costs at PCA's mills and corrugated plants. At December 31, 2024, the Company had $\n25.8\n million of environmental-related reserves recorded on its Consolidated Balance Sheet. Of the $\n25.8\n million, approximately $\n19.5\n million related to environmental-related asset retirement obligations discussed in Note 13, Asset Retirement Obligations, and $\n6.3\n million related to our estimate of other environmental contingencies. The Company recorded $\n3.2\n million in “Accrued liabilities” and $\n22.6\n million in “Other long-term liabilities” on the Consolidated Balance Sheet. Liabilities recorded for environmental contingencies are estimates of the probable costs based upon available information and assumptions. Because of these uncertainties, PCA’s estimates may change. The Company believes that it is not reasonably possible that future environmental expenditures for remediation costs and asset retirement obligations above the $\n25.8\n million accrued as of December 31, 2024 will have a material impact on its financial condition, results of operations, or cash flows.\nGuarantees and Indemnifications\nWe provide guarantees, indemnifications, and other assurances to third parties in the normal course of our business. These include tort indemnifications, environmental assurances, and representations and warranties in commercial agreements. At December 31, 2024, we are not aware of any material liabilities arising from any guarantee, indemnification, or financial assurance we have provided. If we determined such a liability was probable and subject to reasonable determination, we would accrue for it at that time.\n\n\n67\n\n\n\n\n \n\n\nDeRidder Mill Incident\nOn February 8, 2017\n, a tank located in the pulp mill at the Company’s DeRidder, Louisiana facility exploded, resulting in three contractor fatalities and other injuries. The Company was served with multiple lawsuits involving the decedents and other allegedly injured parties, alleging negligence on the part of the Company and claiming compensatory and punitive damages. The Company believes that these suits are covered by its liability insurance policies, subject to an aggregate $\n1.0\n million deductible. The majority of these lawsuits were settled by the Company and its insurers. The Company has not paid any losses in excess of its insurance deductible in connection with these settlements, and its insurance deductible has been satisfied in full. To date, all settlements in excess of the deductible have been paid out by one of the Company’s insurers. The remaining lawsuit, which involves nine plaintiffs, was tried in the U.S. District Court for the Middle District of Louisiana in April 2024. On April 24, 2024, a jury awarded these plaintiffs approximately $\n91.8\n million in compensatory damages plus interest. During the fourth quarter of 2024, the Company, certain of its insurers, and the plaintiffs executed memoranda of understanding to settle the matter for a minimum of $\n59.2\n million. This amount may be increased to $\n68.2\n million depending on the outcome of an insurance coverage action pending in Louisiana state court involving the Company, the settling insurers and certain other insurers, in which PCA has agreed to pursue an additional $\n9.0\n million in coverage from the insurers. Upon the execution of definitive settlement documents, $\n59.2\n million will be paid to the plaintiffs by the settling insurers. If and only if PCA recovers additional amounts in the coverage action up to $\n9.0\n million, those amounts will be paid to plaintiff. The settling insurers may not recover any amount from PCA, and PCA believes that it has no liability for any uninsured losses in the matter.\nThe Company has recorded a liability of $\n59.2\n million in “Other Accrued Liabilities” and a receivable for the insurance recovery of $\n59.2\n million in “Prepaids and Other Assets” in the Consolidated Balance Sheet as of December 31, 2024.\n \nIn May 2017, the EPA conducted an on-site inspection of the DeRidder facility to assess compliance with the Clean Air Act, Risk Management Program (“RMP”). The Company provided additional information to the EPA promptly after the inspection to address certain areas of concern (“AOCs”) observed during the inspection. Since the inspection in 2017, PCA performed several voluntary activities to address the AOCs presented in the EPA’s inspection report and has removed the RMP covered process from the facility. In January 2021, the EPA and U.S. Department of Justice (“DOJ”) initiated civil judicial enforcement discussions with PCA. During the third quarter of 2022, we reached a settlement with the agencies, resulting in an agreed civil penalty of $\n2.5\n million. The Company did not admit liability for violation of the Clean Air Act in connection with the settlement. The settlement was approved by the federal district court for the Western District of Louisiana in December 2022, and the agreed civil penalty was paid out in January 2023.\nLegal Proceedings\nWe are also a party to various legal actions arising in the ordinary course of our business. These legal actions include commercial liability claims, premises liability claims, and employment-related claims, among others. As of the date of this filing, we believe it is not reasonably possible that any of the legal actions against us will, either individually or in the aggregate, have a material adverse effect on our financial condition, results of operations, or cash flows.\n\n\n \n\n\n68\n\n\n\n\n \n\n\nItem 9. \nCHANGES IN AND DISAGREEMENTS WITH ACCO\nUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n\n\nNot applicable.\n\n\nItem 9A. \nCONTROLS\n AND PROCEDURES\n \n\n\nControls and Procedures\n\n\nPCA maintains disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934) that are designed to provide reasonable assurance that information required to be disclosed in PCA’s filings under the Securities Exchange Act is recorded, processed, summarized and reported within the periods specified in the rules and forms of the SEC and that such information is accumulated and communicated to PCA’s management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\n\n\nPrior to filing this report, PCA completed an evaluation under the supervision and with the participation of PCA’s management, including PCA’s Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of PCA’s disclosure controls and procedures as of December 31, 2024. The evaluation of PCA’s disclosure controls and procedures included a review of the controls’ objectives and design, PCA’s implementation of the controls and the effect of the controls on the information generated for use in this report. Based on this evaluation, PCA’s Chief Executive Officer and Chief Financial Officer concluded that PCA’s disclosure controls and procedures were effective at the reasonable assurance level as of December 31, 2024.\n\n\nDuring the quarter ended December 31, 2024, there were no changes to internal controls over financial reporting that have materially affected, or are reasonably likely to materially affect, PCA’s internal control over financial reporting.\n\n\nManagement’s Report on Internal Control Over Financial Reporting\n\n\nPCA’s management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Company’s assets; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only with proper authorizations; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the financial statements.\n\n\nBecause of its inherent limitations, PCA’s internal control over financial reporting may not prevent or detect misstatements. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that objectives of the control system are met. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\n\n\nPCA’s management, under the supervision of and with the participation of the Chief Executive Officer and Chief Financial Officer, assessed the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, PCA’s management concluded that its internal control over financial reporting was effective as of December 31, 2024 based on the specified criteria.\n\n\nKPMG LLP, the independent registered public accounting firm that audited PCA’s financial statements included in this Form 10-K, has also audited the effectiveness of the Company’s internal control over financial reporting. Their attestation report precedes PCA’s audited financial statements included elsewhere in this report.\n\n\nItem 9B. \nOTHE\nR INFORMATION\n\n\nDuring the three months ended December 31, 2024, none of the Company’s directors or officers \nadopted\n or \nterminated\n any contract, instruction, or written plan for the purchase or sale of our securities intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act or any non-Rule 10b5-1 trading arrangements as defined in Item 408(a) of Regulation S-K\n.\n\n\nItem 9C. \nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\n\n\nNot applicable.\n\n\n69\n\n\n\n\n \n\n\nPART\n III\n\n\nItem 10. \nDIRECTORS, EXECUTIVE OFF\nICERS, AND CORPORATE GOVERNANCE\n\n\nInformation regarding PCA’s executive officers required by this Item 10 is set forth in Item 1 of Part I of this report under the caption “Executive Officers of the Registrant.”\n\n\nThe following information required by this Item 10 will be included in PCA’s Proxy Statement for the 2025 Annual Meeting of Stockholders and is incorporated by reference herein:\n\n\n•\nInformation regarding PCA’s directors included under the caption “Election of Directors”\n\n\n•\nInformation regarding PCA’s Audit Committee and financial experts included under the caption “Election of Directors - Audit Committee”\n\n\n•\nInformation regarding PCA’s codes of ethics included under the caption “Election of Directors - Code of Ethics”\n\n\n•\nInformation regarding PCA’s stockholder nominating procedures included under the captions “Election of Directors - Nominating and Governance Committee,” “Other Information - Recommendations for Board - Nominated Director Nominees,” and “Other Information - Procedures for Nominating Directors or Bringing Business Before the 2025 Annual Meeting”\n\n\n•\nInformation regarding compliance with Section 16(a) of the Securities Exchange Act of 1934 included under the caption “Delinquent Section 16(a) Reports”\n\n\nThe Company has adopted an insider trading policy which promotes compliance with insider trading, rules and regulations, and any listing standards applicable to the Company. The trading policy applies to all directors, officers, employees, consultants, and contractors of the Company (including its subsidiaries), as well as family members who live in their household whose transactions in Company securities are directed by (or subject to the influence or control of) any such covered person. The trading policy prohibits trading in Company securities while in possession of material, non-public information (“MNPI”) and prohibits tipping or otherwise disclosing MNPI. A copy of our trading policy is filed as Exhibit 19.1 to this Form 10-K.\n\n\nThe Company has also adopted an insider trading policy addendum that applies to officers, directors and other specified individuals. These individuals are not permitted to transact in Company securities during blackout periods specified in the policy, which generally begin 15 calendar days before the end of each calendar quarter and run through the business day after we release earnings for that quarter, subject to limited exceptions specified in the addendum. Trades by executive officers and directors require pre-clearance from our chief executive officer and our insider trading compliance officer prior to execution. The addendum is included with our trading policy.\n\n\nItem 11. \nEXECUTI\nVE COMPENSATION\n\n\nInformation with respect to executive compensation required by this Item 11 will be included in PCA’s Proxy Statement under the captions “Compensation Discussion and Analysis,” “Compensation Committee Report,” “Executive Officer Compensation” (including all subcaptions and tables thereunder), “Director Compensation,” and “Board Committees - Compensation Committee” and is incorporated herein by reference.\n\n\nItem 12. \nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OW\nNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n\n\nInformation with respect to security ownership of certain beneficial owners and management required by this Item 12 will be included in PCA’s Proxy Statement under the caption “Ownership of Our Stock” and is incorporated herein by reference.\n\n\n70\n\n\n\n\n \n\n\nAuthorization of Securities under Equity Compensation Plans — \nSecurities authorized for issuance under our equity compensation plans at December 31, 2024 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nColumn\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nA\n\n\n \n\n\n \n\n\nB\n\n\n \n\n\n \n\n\nC\n\n\n \n\n\n\n\n\n\nPlan Category\n\n\n \n\n\nNumber of\nSecurities to\nBe Issued\nUpon\n \nExercise\nof Outstanding\nOptions, Warrants,\nand Rights (a)\n\n\n \n\n\n \n\n\nWeighted Average\nExercise Price of\nOutstanding Options,\nWarrants, and Rights\n\n\n \n\n\n \n\n\nNumber of Securities\nRemaining Available\nfor Future Issuance\nUnder Equity\nCompensation Plans\n(Excluding Securities\nReflected in Column A)\n\n\n \n\n\n\n\n\n\nEquity compensation plans approved\n   by securityholders\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2,753,954\n\n\n \n\n\n\n\n\n\nEquity compensation plans not\n   approved by securityholders\n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2,753,954\n\n\n \n\n\n\n\n\n\n \n\n\n(a)\nAssumes that outstanding performance units pay out at the target level. Does not include 978,869 shares of unvested restricted stock and performance units granted pursuant to our Second Amended and Restated 1999 Long-Term Equity Incentive Plan.\n\n\nItem 13. \nCERTAIN RELATIONSHIPS AND RELATE\nD TRANSACTIONS, AND DIRECTOR INDEPENDENCE\n\n\nInformation with respect to certain relationships and related transactions and director independence required by this Item 13 will be included in PCA’s Proxy Statement under the captions “Transactions with Related Persons” and “Election of Directors - Determination of Director Independence,” respectively, and is incorporated herein by reference.\n\n\nItem 14. \nPRINCIPAL ACCOU\nNTING FEES AND SERVICES\n\n\nInformation with respect to fees and services of the principal accountant required by this Item 14 will be included in PCA’s Proxy Statement under the caption “Ratification of Appointment of the Independent Registered Public Accounting Firm” under the subcaptions “- Fees to the Independent Registered Public Accounting Firm” and “- Audit Committee Preapproval Policy for Audit and Non-Audit Fees” and are incorporated herein by reference.\n\n\n71\n\n\n\n\n \n\n\nPAR\nT IV\n\n\nItem 15. \nEXHIBITS, FINAN\nCIAL STATEMENT SCHEDULES\n\n\n(a)\nThe following documents are filed as a part of this report:\n\n\n(1)\nThe financial statements listed in the “Index to Financial Statements.”\n\n\n(2)\nFinancial Statement Schedule.\n\n\nAll schedules for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission are not required under the related instructions, are inapplicable or not material, or the information called for thereby is otherwise included in the financial statements or the accompanying notes to the financial statements and therefore, have been omitted.\n\n\n(3)\nExhibits\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExhibit\nNumber\n\n\n \n\n\nDescription\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2.1\n\n\n \n\n\nContribution Agreement, dated as of January 25, 1999, among Pactiv Corporation (formerly known as Tenneco Packaging Inc.) (“Pactiv”), PCA Holdings LLC (“PCA Holdings”) and Packaging Corporation of America (“PCA”). (Incorporated herein by reference to Exhibit 2.1 to PCA’s registration Statement on Form S-4, Registration No. 333-79511).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2.2\n\n\n \n\n\nLetter Agreement Amending the Contribution Agreement, dated as of April 12, 1999, among Pactiv, PCA Holdings and PCA. (Incorporated herein by reference to Exhibit 2.2 to PCA’s Registration Statement on Form S-4, Registration No. 333-79511).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2.3\n\n\n \n\n\nAgreement and Plan of Merger, dated September 16, 2013, between PCA, Bee Acquisition Corp. and Boise Inc. (Incorporated herein by reference to Exhibit 2.1 to PCA’s Current Report on Form 8-K filed September 17, 2013, File No. 1-15399). PCA will furnish supplementally a copy of any omitted schedule or exhibit to the SEC upon request; provided, however, that PCA may request confidential treatment pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended, for any schedule or exhibit so furnished.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n3.1\n\n\n \n\n\nRestated Certificate of Incorporation of PCA. (Incorporated herein by reference to Exhibit 3.1 to PCA’s Registration Statement on Form S-4, Registration No. 333-79511).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n3.2\n\n\n \n\n\nCertificate of Amendment to Restated Certificate of Incorporation of PCA. (Incorporated herein by reference to Exhibit 3.2 to PCA’s Registration Statement on Form S-4, Registration No. 333-109437.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n3.3\n\n\n \n\n\nAmended and Restated By-laws of PCA. (Incorporated herein by reference to Exhibit 3.1 to PCA’s Current Report on Form 8-K filed December 13, 2020, File No. 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.1\n\n\n \n\n\nForm of certificate representing shares of common stock. (Incorporated herein by reference to Exhibit 4.9 to PCA’s Registration Statement on Form S-1, Registration No. 333-86963.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.2\n\n\n \n\n\nIndenture, dated as of July 21, 2003, between PCA and U.S. Bank National Association. (Incorporated herein by reference to Exhibit 4.2 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2003, File No. 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.3\n\n\n \n\n\nFirst Supplemental Indenture, dated as of July 21, 2003, between PCA and U.S. Bank National Association. (Incorporated herein by reference to Exhibit 4.3 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2003, File No. 1-15399.)\n\n\n\n\n\n\n72\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.4\n\n\n \n\n\nOfficers’ Certificate, dated as of November 21, 2019, pursuant to Section 301 of the Indenture establishing 3.000% Senior Notes due 2029 and 4.050% Senior Notes due 2049. (Incorporated herein by reference to Exhibit 4.1 to PCA’s Current Report on Form 8-K filed November 21, 2019, File No. 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.5\n\n\n \n\n\n3.000% Senior Notes due 2029. (Incorporated herein by reference to Exhibit 4.2 to PCA’s Current Report on Form 8-K filed November 21, 2019, File No. 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.6\n\n\n \n\n\n4.050% Senior Notes due 2049. (Incorporated herein by reference to Exhibit 4.3 to PCA’s Current Report on Form 8-K filed November 21, 2019, File No. 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.7\n\n\n \n\n\nOfficer’s Certificate, dated December 13, 2017, pursuant to Section 301 of the Indenture establishing 2.450% Senior Notes due 2020 (redeemed and no longer outstanding) and 3.400% Senior Notes due 2027. (Incorporated herein by reference to Exhibit 4.1 to PCA’s Current Report on Form 8-K filed December 13, 2017, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.8\n\n\n \n\n\n3.400% Senior Notes due 2027 (Incorporated herein by reference to Exhibit 4.3 to PCA’s Current Report on Form 8-K filed December 13, 2017, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.9\n\n\n \n\n\nOfficer’s Certificate, dated September 21, 2021, pursuant to Section 301 of the Indenture establishing 3.050% Senior Notes due 2051. (Incorporated herein by reference to Exhibit 4.1 to PCA’s Current Report on Form 8-K filed September 21, 2021, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.10\n\n\n \n\n\n3.050% Senior Notes due 2051 (Incorporated herein by reference to Exhibit 4.2 to PCA’s Current Report on Form 8-K filed September 21, 2021, File No 1-15399.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.11\n\n\n \n\n\nOfficers’ Certificate, dated November 30, 2023, pursuant to Section 301 of the Indenture establishing 5.700% Senior Notes due 2033. (Incorporated herein by reference to Exhibit 4.1 to PCA's Current Report on Form 8-K filed November 30, 2023, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.12\n\n\n \n\n\n5.700% Senior Notes due 2033 (Incorporated herein by reference to Exhibit 4.2 to PCA’s Current Report on Form 8-K filed November 30, 2023, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4.14\n\n\n \n\n\nDescription of Common Stock. (Incorporated herein by reference to Exhibit 4.13 to PCA’s Annual Report on Form 10-K for the year ended December 31, 2019, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.1\n\n\n \n\n\nFirst Amendment to Credit Agreement, dated April 27, 2023, between Packaging Corporation of America and the lenders and agents named therein. (Incorporated herein by reference to Exhibit 10.1 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2023, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.2\n\n\n \n\n\nPackaging Corporation of America Thrift Plan for Hourly Employees and First Amendment of Packaging Corporation of America Thrift Plan for Hourly Employees, effective February 1, 2000. (Incorporated herein by reference to Exhibit 4.5 to PCA’s Registration Statement on Form S-8, Registration No. 333-33176.)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.3\n\n\n \n\n\nPackaging Corporation of America Retirement Savings Plan, effective February 1, 2000. (Incorporated herein by reference to Exhibit 4.6 to PCA’s Registration Statement on Form S-8, Registration No. 333-33176.)*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.4\n\n\n \n\n\nPackaging Corporation of America Supplemental Executive Retirement Plan, as Amended and Restated Effective as of January 1, 2023. (Incorporated herein by reference to Exhibit 10.4 to PCA’s Annual Report on Form 10-K for the year ended December 31, 2022, File No. 1-15399).*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.5\n\n\n \n\n\nPackaging Corporation of America Deferred Compensation Plan, as Amended and Restated Effective as of February 27, 2019. (Incorporated herein by reference to Exhibit 10.5 to PCA's Annual Report on Form 10-K for the year ended December 31, 2019, File No. 1-15399).*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.6\n\n\n \n\n\nSecond Amended and Restated 1999 Long-Term Equity Incentive Plan, effective as of May 8, 2024, conformed to incorporate all amendments. (Incorporated herein by reference to Appendix B to PCA’s Proxy Statement for the 2024 Annual Meeting of Stockholders)*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.7\n\n\n \n\n\nAmended and Restated Executive Incentive Compensation Plan, effective as of December 29, 2017. (Incorporated herein by reference to Exhibit 10.10 to PCA’s Annual Report on Form 10-K for the year ended December 31, 2017, File No. 1-15399.)*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n73\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.8\n\n\n \n\n\nTrade Vendor Purchasing Agreement, dated December 6, 2019, between Boise White Paper, L.L.C. and Office Depot, Inc. (Incorporated by reference to Exhibit 10.11 to PCA’s Annual Report on Form 10-K for the year ended December 31, 2019, File No. 1-15399)**\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.9\n\n\n \n\n\nForm of Return on Invested Capital Performance Unit Agreement for executive officer awards. (Incorporated by reference to Exhibit 10.2 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2018, File No. 1-15399).*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.10\n\n\n \n\n\nForm of Total Shareholder Return Performance Unit Agreement for executive officer awards. (Incorporated by reference to Exhibit 10.3 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2018, File No. 1-15399).*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.11\n\n\n \n\n\nForm of Restricted Stock Agreement for executive officer awards. (Incorporated by reference to Exhibit 10.1 to PCA’s Quarterly Report on Form 10-Q for the period ended June 30, 2018, File No. 1-15399).*\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n19.1\n\n\n \n\n\nPackaging Corporation of America Insider Trading Policy adopted December 7, 2011 with Addendum applicable to certain designated persons. \n†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n21.1\n\n\n \n\n\nSubsidiaries of the Registrant.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n23.1\n\n\n \n\n\nConsent of KPMG LLP.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n24.1\n\n\n \n\n\nPowers of Attorney.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n31.1\n\n\n \n\n\nCertification of Chief Executive Officer, As Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n31.2\n\n\n \n\n\nCertification of Chief Financial Officer, As Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n32\n\n\n \n\n\nCertification of Chief Executive Officer and Chief Financial Officer Pursuant to 18 U.S.C. §1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.†\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n97\n\n\n \n\n\nPackaging Corporation of America Clawback Policy, adopted as of December 1, 2023. (Incorporated herein by reference to Exhibit 97 to PCA’s Annual Report on Form 10-K for the year ended December 31, 2023, File No. 1-15399).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n101.INS\n\n\n \n\n\nInline XBRL Instance Document – the instance document does not appear in the Interactive Data File because XBRL tags are embedded within the Inline XBRL document.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n101.SCH\n\n\n \n\n\nInline XBRL Taxonomy Extension Schema With Embedded Linkbase Documents\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n104\n\n\n \n\n\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n* Management contract or compensatory plan or arrangement.\n\n\n** Confidential information in this exhibit has been omitted.\n\n\n† Filed herewith.\n\n\n74\n\n\n\n\n \n\n\nSIG\nNATURES\n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrants have duly caused this report to be signed on their behalf by the undersigned, thereunto duly authorized on February 27, 2025.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPackaging Corporation of America\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n/s/    MARK W. KOWLZAN\n\n\n\n\n\n\n \n\n\n \n\n\nMark W. Kowlzan\n\n\n\n\n\n\n \n\n\n \n\n\nChairman of the Board and Chief Executive Officer\n\n\n\n\n\n\n \n\n\n \n\n\nPrincipal Executive Officer\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n/s/    ROBERT P. MUNDY\n\n\n\n\n\n\n \n\n\n \n\n\nRobert P. Mundy\n\n\n\n\n\n\n \n\n\n \n\n\nExecutive Vice President and Chief Financial Officer\n\n\n\n\n\n\n \n\n\n \n\n\nPrincipal Financial Officer \nand \nPrincipal Accounting Officer\n\n\n\n\n\n\n \n\n\n \n\n\n75\n\n\n\n\n \n\n\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on February 27, 2025, by the following persons on behalf of the registrants and in the capacities indicated.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSignature\n\n\n \n\n\nCapacity\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/    MARK W. KOWLZAN\n\n\n \n\n\nChairman of the Board and Chief Executive Officer\n\n\n\n\n\n\nMark W. Kowlzan\n\n\n \n\n\n(Principal Executive Officer)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/    ROBERT P. MUNDY\n\n\n \n\n\nExecutive Vice President and Chief Financial Officer\n\n\n\n\n\n\nRobert P. Mundy\n\n\n \n\n\n(Principal Financial Officer and Principal Accounting Officer)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nCheryl K. Beebe\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nDuane C. Farrington\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nKaren E. Gowland\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nDonna A. Harman\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nRobert C. Lyons\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nSamuel M. Mencoff\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nRoger B. Porter\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nThomas S. Souleles\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n*\n\n\n \n\n\nDirector\n\n\n\n\n\n\nPaul T. Stecko\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/    ROBERT P. MUNDY\n\n\n \n\n\n \n\n\n\n\n\n\nRobert P. Mundy\n\n\n \n\n\n \n\n\n\n\n\n\n(Attorney-In-Fact)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n76"
  }
}