{
  "ticker": "PLTR",
  "cik": "0001321655",
  "company_name": "Palantir Technologies Inc.",
  "filing_date": "2025-02-18",
  "accession": "0001321655-25-000022",
  "primary_doc": "pltr-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOverview\nWe build software that empowers organizations to effectively integrate their data, decisions, and operations at scale.\nWe were founded in 2003 and started building software for the intelligence community in the United States to assist in counterterrorism investigations and operations. We later began working with commercial enterprises, who often faced fundamentally similar challenges in working with data.\nWe have built four principal software platforms, Palantir Gotham (“Gotham”), Palantir Foundry (“Foundry”), Palantir Apollo (“Apollo”), and Palantir Artificial Intelligence Platform (“AIP”). Gotham and Foundry enable institutions to transform massive amounts of information into an integrated data asset that reflects their operations, and AIP leverages the power of our existing machine learning technologies alongside generative AI models, including large language models (“LLMs”), directly within Gotham and/or Foundry to help operationalize AI on enterprise data. For over a decade, Gotham has surfaced insights for global defense agencies, the intelligence community, disaster relief organizations and beyond. And Foundry is becoming a central operating system not only for individual institutions but also for entire industries. Apollo, which we began offering as a commercial solution in 2021, is a cloud-agnostic, single control layer that coordinates ongoing delivery of new features, \n4\nTable of Contents\nsecurity updates, and platform configurations, helping to ensure the continuous operation of critical systems. Apollo allows our customers to run their software in virtually any environment. \nIn 2023, we began deploying our newest offering, AIP, which is designed for customers across the commercial and government sectors, enabling them to derive value from recent breakthroughs in artificial intelligence via the combination of our existing software platforms with generative AI models, including LLMs. We believe AIP uniquely allows users to connect LLMs and other AI with their data and operations to facilitate decision-making within the legal, ethical, and security constraints that they require.\nRecent crises and systemic shocks, such as the ongoing Russia-Ukraine and Israel conflicts, have made clear to many of our customers that accommodating the extended timelines ordinarily required to realize results from implementing new software solutions is not a viable option. As a result, customers are increasingly adopting our software, which can be ready in days, over internal software development efforts, which may take months or years. See further discussion in the section titled \n“Management’s Discussion and Analysis of Financial Condition and Results of Operations—Macroeconomic Trends\n.\n”\nOur Platforms\nWe have built four principal software platforms: Gotham, Foundry, Apollo, and AIP. Our software platforms provide the critical infrastructure needed to integrate our customers’ data and operations and run their software in virtually any environment. \nThe vertically integrated nature of these platforms allows users of varying technical abilities to collaborate effectively in our platforms. Data engineers can integrate new data sources, analysts can clean and transform data, data scientists can write models, business users can conduct daily workflows, and senior leaders can make critical decisions. With AIP, trusted data from relevant sources can be integrated into business logic, machine-language models, optimizers, and other computations spread across varying environments to power enterprise and government processes and help drive critical decisions. Customers may bundle these platforms together as a single ecosystem.\nData, analyses, decisions, and the metadata around each are secured with fine-grained access controls that propagate from source data to shared analyses. Each platform is comprised of user-facing applications that may be targeted to the specific industries and sectors in which they are used.\nDespite their differences, Gotham and Foundry both serve as central operating systems for our customers. While they vary in specific functionality, they align in approach. AIP provides an integrated architecture to Gotham and Foundry that can bring AI to every decision. These platforms, backed by Apollo, can be deployed in almost any environment. \nSimilarly, customers can now use Apollo to enable continuous deployment, configuration management, and central software operations management across almost any environment for their own software products. \nGotham\nGotham enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants. It also facilitates the hand-off between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. Gotham is now used broadly across government functions.\nFoundry\nFoundry transforms the ways organizations operate by creating a central operating system for their data. Individual users can integrate and analyze the data they need in one place. The speed with which users can experiment and test new ideas is what makes the software stick.\nData projects often fail because the steps and methods used to build data pipelines are difficult to understand and recreate. We built Foundry’s backend to solve the root of this problem. The platform’s graphical interface does the rest, allowing users to track and trace their pipelines so they know what the rows and columns in their tables represent and why they are there. All of our commercial customers now use it, as do several of our government customers.\nAIP\nAIP enables responsible AI-advantage across the enterprise and government by using primary, core components built to effectively activate LLMs and other AI within any organization. It provides unified access to open-source, self-hosted, and commercially available LLMs that can transform structured and unstructured data into LLM-understandable objects and can \n5\nTable of Contents\nturn organizations’ actions and processes into tools for humans and LLM-driven agents. AIP can allow organizations to power operational use of AI and LLMs with interfaces for decision making, feedback, and safe hand-off among AI agents and human operators with wide-spectrum security and audit controls, which allow for granular control over model usage and integrated human review checkpoints throughout the workflows. AIP is seamlessly bundled with existing Palantir offerings such as the Foundry, Gotham, and Apollo platforms.\nApollo\n \nWe have always prioritized meeting our customers wherever they need us most. We originally built Apollo to enable the continuous delivery of our software wherever our customers are: in the cloud, on-premises, or even more rugged environments. Today, Apollo enables the rapid, secure delivery of our software and updates across our business, and also enables our customers to securely deploy their own software in virtually any environment. Apollo provides a single control layer to coordinate ongoing delivery of new features, security updates, and platform configurations. \nOur Customers\nWe work with many of the world’s leading government and commercial institutions. As of December 31, 2024, we had 711 customers.\nOur software is currently used across approximately 90 industries around the world. It is applied to a variety of use cases by users across various business functions and levels of organizations, including by utility operations analysts, automotive manufacturing workers, oil and gas technicians and operators, and pharmaceutical researchers in the United States; supply-chain managers in South Korea; public health administrators in the United Kingdom and the United States; and special forces personnel and military officials in the United States and abroad.\nOf the $2.9 billion in revenue that we generated in 2024, 55% came from customers in the government segment, and 45% came from customers in the commercial segment.\nOur business continues to have a global presence. In 2024, we earned 66% of our revenue from customers in the United States, and 34% from those abroad.\nThe average revenue for our top twenty customers during the trailing twelve months ended December 31, 2024 was $64.6 million, and is up from 2023, when the average revenue from our top twenty customers during the trailing twelve months ended December 31, 2023 was $54.6 million, demonstrating our expanding relationships with existing customers.\nSales and Marketing\nOur approach to sales and marketing is built around discussions with existing and prospective customers in order to understand the principal challenges our customers face and identify ways in which our software platforms can provide long-term value and results. We continue to evaluate and refine our sales and marketing approach as we develop relationships with existing and prospective customers. For example, beginning in 2023, we introduced AIP bootcamps to the initial stages of our customer acquisition process, which helped to accelerate these discussions and provide an opportunity for our customers to experience our platforms through their own use cases in days. \nCustomer Acquisition\nOur customer acquisition strategy generally targets large-scale, hard-to-execute opportunities at large government and commercial institutions. The high installation costs, high failure risks, complexity of data environments, and the long sales cycles associated with these opportunities raise the barriers to entry for competition. The larger, more complex, and more technologically demanding the problem, the more likely we are to succeed. Additionally, our focus in the short term remains making our principal software platforms available to an increasingly broad swath of our potential market. We believe that every institution faces challenges that our platforms and products were designed to address. \nAcross both the public and private sectors, there is a history of failures when investing in new technologies. One U.S. military department spent more than $1 billion building an enterprise resource planning system from scratch. The system was never delivered, and the project was terminated.\nMany of our customers have had similar experiences investing millions — even billions — of dollars in digital transformation projects, enterprise data warehouses, and digital twin initiatives that never really worked.\nThese failures have made both software buyers and vendors highly risk-averse. Institutions often doubt that any vendor can implement a working solution and are unwilling to invest. On the other hand, smaller technology companies are often unable to \n6\nTable of Contents\ncompete for complex, large-scale opportunities because installation costs and the risks of failure are too high, and the sales cycles too long.\nThese are precisely the opportunities we target. Rather than reject projects with risky and resource intensive installation requirements, we actively seek them out.\nThere are a number of sales and marketing strategies that have accelerated our ability to acquire customers in recent years:\nExpansion of Access to Platforms \nThe speed with which our platforms can be deployed has significantly expanded the range of potential customers with which we plan on partnering over the long term. During 2023, we introduced AIP bootcamps, which allow us to deliver real workflows on actual customer data in days. We anticipate that our reach among an increasingly broad set of customers, in both the commercial and government sectors, will accelerate moving forward, aided by our sales and marketing approaches, including AIP bootcamps and other pilots. Additionally, in 2024, we introduced Developer Tier, offering limited access to Foundry and AIP in the United States and select countries. This expansion allows developers to explore, innovate, and develop without significant upfront enterprise costs.\nOur proximity to a variety of businesses and the industries in which they are operating has enhanced, and is expected to continue enhancing, our own product and business development efforts, as we continue expanding access to our platforms to the broadest possible set of customers. We believe that, as these new partners grow, we will grow with them.\nDirect Sales Force \nWe have invested and may continue to invest in an account-based sales force to identify and capture new customers and opportunities.\nWe believe that our decision to build our sales force in recent years has resulted in multiple new customers, and the broadening and expansion of our commercial customer base and relationships with leading government agencies around the world. \nSector and Industry Operating Systems\nIn addition to supporting individual institutions, our platforms have become central operating systems for entire industries and sectors. We are developing industry operating systems to help companies and government agencies manage operations across their entire organizations. These operating systems allow our software to be distributed at scale to institutions within given industries. We have and are continuing to develop partnerships in industries such as airline, insurance, healthcare, automotive, security and risk management, and government, which we anticipate will have a significant impact on our business moving forward.\nU.S. Government\nWe continue to believe we are uniquely positioned to provide commercially available software to the U.S. federal government. Our government customers remain a meaningful source of revenue for our business. We intend to capture an even greater share of U.S. federal government spending on software systems.\nSee the section titled \n“Management’s Discussion and Analysis of Financial Condition and Results of Operations—Overview—Our Customers”\n for a discussion of the terms of our government contracts.\nChannel Sales & Cloud Partnerships\nWe have entered into, and continue to explore the development of, partnerships for specific industries and sectors by partnering closely with leading providers of public, private, and hybrid cloud services, which have relationships with essentially every major enterprise in the world and have large, existing sales forces. These cloud partnerships emerged as an extension of the large computing requirements for our platforms and the migration towards the cloud as the hosting environment of choice for many customers. The existing footprint of these providers provides us with access to their large customer base and expands our distribution capabilities.\nWe have also continued to explore the establishment of channel sales relationships and similar alliances with public and private organizations, opening a path for us to partner with varying providers, including smaller technology providers.\n7\nTable of Contents\nJoint Ventures & New Business Partnerships\nWe intend to continue to form joint ventures and new business partnerships, where we believe specific industries or sectors require a partner and additional investment in order to realize the full potential of our platforms. For example, we, through Palantir Technologies Japan KK, entered into a strategic global partnership with Fujitsu Limited through which the parties will incorporate the capabilities of Foundry and AIP as a key element in the data infrastructure for Fujitsu Uvance, a portfolio of global solutions that address business challenges and solve societal issues.\nAccount Growth\nThere are a number of sales and marketing strategies that we use to drive revenue growth at an account.\nThese strategies include (i) creating new ecosystem partnerships to extend the platform beyond the customer’s four walls into the operations of its partners and suppliers, (ii) selling additional productized cross-industry software capabilities, and (iii) selling strategic implementations of our software against specific use cases, which deliver competitive differentiation.\nOur sales and marketing strategies allow us to scale existing customer contracts horizontally to include additional divisions or functions within a single institution and vertically to include additional users and user groups. In tackling the customer’s most pressing and challenging problems first, we establish the trust needed to expand platform usage across the full enterprise.\nResearch and Development\nWe believe that in order to fully address the most complex and valuable challenges that our customers face, we must experience and understand their problems firsthand. To do so, we embed with our users. Our research and development function is responsible for the design, development, testing, validation, and refinement of our platforms, and embedding with our users allows us to identify research and development opportunities for our platforms or new products. We focus on innovating and developing new features and modules for our new and existing platforms, including AIP, or new products, and further enhancing the functionality, compatibility, reliability, usability, and performance of our platforms. By leveraging the tens of thousands of front-line hours across various industries and using emerging technologies, we can better anticipate customer needs and bring new use cases and new applications of services to our existing and potential customers. Our AIP bootcamps have and may continue to provide a forum to experience these new use cases and applications. Many of our current research and development efforts are focused on deploying software, models, and other critical assets at the edge. This includes integrations with complex hardware, operations in disconnected environments, and more. We have made, and will continue to make, significant investments in research and development to broaden our platform capabilities, strengthen our existing platforms and innovate.\nPrivacy and Civil Liberties\nWe are committed to ensuring that our software is as effective as possible while preserving individuals’ fundamental rights, including privacy and civil liberties. We have made deep investments to ensure that privacy, civil liberties, and other fundamental rights protections remain central to our software and business practices.\nOur platforms were built from the start to protect individual privacy and prevent the misuse of information. We are not in the business of collecting, mining, or selling data. We build software platforms that enable our customers to integrate their own data — data to which they already have access.\nThe same technology that makes Palantir’s software platforms so analytically powerful — the ability to construct a model of the real world from countless data points — is what enables our customers to monitor and control access to that data and its use, while responsibly deploying increasingly advanced tools and capabilities, such as LLMs and other AI models.\nPrinciples\nAs we build and implement technology to answer questions of increasing significance and complexity, we follow a set of principles that help us ensure we are doing so responsibly, including the consideration of AI ethics and best practices.\n•\nSystems should incorporate principles of “privacy by design.” \nOur goal has always been to eliminate the perceived trade-offs between privacy and utility. To do so, we treat privacy as a first-order concern at every stage of the engineering process and build privacy features as core capabilities in our platforms, seamlessly integrated with analytical and collaboration tools. \n•\nDecisions that can affect individuals’ rights to freedom, opportunity, and happiness cannot be left solely to computers.\n Our customers are using data to inform decisions with significant implications for individuals. Rather than relying \n8\nTable of Contents\nexclusively on algorithms that may inhibit accountability and redress, we build in means for humans to make necessary judgment calls based on their context and intuition. \n•\nSystems must facilitate accountability and oversight.\n Effective privacy protection entails multi-layered, overlapping policies and procedures to reassure the protection of fundamental rights. We design our platforms to support these policies with mechanisms that control usage, alert users to data handling requirements, and generate information for those responsible for oversight. \n•\nTechnology is not the answer to every problem. \nSome decisions carry implications that are too complex or significant to be automated or streamlined, even with a human in the loop. We strive to contextualize major world problems and think critically about whether it’s possible to engineer complementary solutions in an ethically responsible way. When the answer is “no,” we turn the opportunity down. Privacy, civil liberties, and ethical engineering is an evolving field, and every organization is subject to unique requirements and concerns. \nThe ways in which these principles are realized will differ among products and organizations. But the end goal should be the same: developing and implementing technology with a full understanding of its potential effects on fundamental rights and incorporating technical capabilities that can support responsible technology and data handling policies. \nCustomer Impact\nSome examples of the ways in which our software facilitates data protection for our customers follow below.\n•\nOur platforms serve as the central analytics system of a major law enforcement agency in northern Europe. Scandinavia has long been at the forefront of data protection, and our software facilitates effective implementation of its rigorous privacy policies.\n•\nA financial institution required strong cryptographic guarantees of access control and selective revelation for sensitive client information on a need-to-know basis. Palantir Foundry’s integrated obfuscation tool for cryptographic processes provided both IT and data governance teams with the necessary functionality and security assurances to establish privacy and governance safeguards in operational workflows carried out by non-technical users. This service, in conjunction with system-wide advanced encryption at both storage and network levels, helps to ensure continuous security guarantees for data throughout the full data use and management lifecycle.\n•\nA customer in Europe needed to adhere to rigorous purpose specification and proportionality requirements during sensitive analytical workflows. We worked with the customer to implement technical measures requiring analysts to provide reviewable justifications for access. Those controls were further supported by auditing capabilities to ensure that data processing satisfied legitimate purposes under the relevant regulations.\n•\nA European telecommunications company needed to process personal data for a customer support workflow, while complying with the necessity and proportionality requirements of the European General Data Protection Regulation (“GDPR”). The client leveraged Palantir’s minimization tool to obfuscate sensitive data in workflows, while allowing cell-level access by operational users based on demonstrated need.\n•\nOur platforms provide a secure, privacy-protective cloud-based data enclave which centralizes data on COVID-19 for collaborative clinical research.\nOur Team\nWe employ a team of engineers, lawyers, philosophers, and social scientists to ensure that our company remains a leader in the field when it comes to privacy practices and software development.\nThe Privacy and Civil Liberties Engineering team is responsible for ensuring a culture of responsibility around the development and use of our technology by leading the development of privacy-enhancing technologies, publishing research, consulting with policymakers, helping our customers implement data governance best practices, and facilitating company-wide dialogue on ethical issues. The team is supported by the Palantir Council of Advisors on Privacy and Civil Liberties, a group of independent experts in privacy law, policy, and ethics who help us to understand and address the implications of our work.\nPrivacy-Enhancing Technologies\n•\nGranular Access Controls and Dynamic Data Minimization. \nOur platforms provide granular access restrictions with flexible permissions frameworks, such as role-, temporal-, and purpose-based access controls. These access control frameworks enable users to see only the specific information necessary for a defined task and only for the duration needed to complete it. Beyond access controls, organizations can also apply dynamic data minimization procedures such as pseudonymization, obfuscation, and encryption to adhere to compliance obligations while considering the context of specific workflows.\n9\nTable of Contents\n•\nSensitive Data Discovery and Management.\n Palantir’s software platforms enable users to securely integrate and analyze sensitive data. To ensure robust governance and to enforce data protection and compliance policies, our platforms also come with tools to detect and manage the use of such sensitive data.\n•\nOversight and Auditability.\n Overseeing sensitive user actions within a system is critical to ensure that data is used appropriately and in compliance with applicable policies and regulations. Palantir’s software platforms enable our customers’ internal governance, compliance, or audit teams to easily understand the nature of such sensitive user actions. Our platforms also maintain audit logs and make them accessible to authorized users, allowing them to both investigate potential past misuse of systems and flag suspicious activity proactively.\n•\nData Retention and Deletion.\n System administrators must be able to implement flexible and auditable retention policies and verify that data scheduled for deletion has truly been removed from the system. Our platforms allow organizations to ensure that out-of-date, expired, or irrelevant information is removed efficiently in order to improve data protection, governance, and compliance in accordance with applicable regulations.\n•\nData Provenance.\n Providing users with well-curated, up-to-date data is critical for building trust in an organization’s data foundation. Our platforms automatically maintain complete records of both data provenance and all transformations applied to data in the system, allowing users to assess the reliability of the data and facilitate the review and correction of inaccuracies when necessary.\nCompetition\nWe are fundamentally competing with the internal software development efforts of our potential customers.\nOrganizations frequently attempt to build their own data platforms before turning to buy ours. In trying to build something on their own, they generally rely on a patchwork of custom solutions, outside consultants, IT services companies, packaged enterprise and open source software, and significant internal IT resources.\nIn addition, our competitors include large enterprise software companies, government contractors, and system integrators. We also face competition from emerging companies as well as established companies that are only now beginning to enter this market.\nThe principal competitive factors in the markets in which we operate include:\n•\nplatform capabilities and product functionality;\n•\ndata security and privacy;\n•\nease and speed of adoption, use, and deployment;\n•\nproduct innovation;\n•\npricing and cost structures;\n•\ncustomer experience, including support; and\n•\nbrand awareness and reputation.\nWhile we believe we generally compete favorably with our competitors, as well as with software developed by customers internally, based on these competitive factors, some of our competitors have greater name recognition, longer operating histories, and larger customer bases; larger sales and marketing budgets and resources and the capacity to leverage their sales efforts and marketing expenditures across a broader portfolio of products; broader, deeper, or otherwise more established relationships with technology, channel, and distribution partners and customers; wider geographic presence or greater access to larger potential customer bases; greater focus in specific geographies; lower labor and research and development costs; larger and more mature intellectual property portfolios; and substantially greater financial, technical, and other resources to provide services, to make acquisitions, and to develop and introduce new products and capabilities.\nIntellectual Property\nWe believe that our intellectual property rights are valuable and important to our business. We rely on a combination of patents, copyrights, trademarks, trade secrets, know-how, contractual provisions, and confidentiality procedures to protect our intellectual property rights.\nWe seek to protect our proprietary inventions relevant to our business through patent protection in the United States and abroad; however, we are not dependent on any particular patent or application for the operation of our business.\n10\nTable of Contents\nIn addition, we have registered “Palantir” as a trademark in the United States and other jurisdictions. We also have registered trademarks for “Gotham,” “Palantir Foundry,” and our corporate logo, and are the registered holder of a variety of domestic and international domain names that include “Palantir,” including, most importantly, “Palantir.com.”\nIn addition to the protection provided by our intellectual property rights, we enter into proprietary information and invention assignment agreements or similar agreements with our employees, consultants, and contractors. We further control the use of our proprietary technology and intellectual property rights through provisions in our agreements with customers.\nSeasonality\nWe generally experience seasonality in the timing of recognition of revenue as a result of the timing of the execution of our contracts as we have historically executed many of our contracts in the third and fourth quarters due to the fiscal year ends and procurement cycles of our customers and at times we may start work prior to finalizing such contracts. See \n“Risk Factors—Seasonality may cause fluctuations in our results of operations and financial position.”\nEmployees and Human Capital\nOur employees are critical to the success of our business. As of December 31, 2024, we had 3,936 full-time employees, 31% of whom are employed outside of the United States. We also engage part-time employees, independent contractors, and third-party personnel to supplement our workforce.\nOther than in France, where we recognize a works council, we do not recognize a union or works council in respect of employees in other jurisdictions. We have not experienced any work stoppages due to employee disputes, and we believe that our employee relations are strong.\nOur human capital resources objectives include recruiting, retaining, training, and motivating our personnel. We strive to foster an environment which encourages active dialogue and robust engagement on the issues most salient to employee satisfaction and believe our employees are empowered to play a significant role in shaping the direction and success of the company. For example, we solicit feedback to assess the sentiment toward our values and culture, and our employees’ well-being and overall health. This signal allows Palantir to get actionable feedback and drive awareness, discussion, and change across areas that our employees value.\nAvailable Information\nOur website is https://www.palantir.com, our investor relations website is https://investors.palantir.com, our LinkedIn account is @Palantir Technologies, and our X (formerly known as Twitter) account is @PalantirTech. We have used, and intend to continue to use, our website, investor relations website, and our LinkedIn and X (formerly known as Twitter) accounts as a means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. The following filings are available for download free of charge through our investor relations website after we file them with the Securities and Exchange Commission (“SEC”): Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, current reports on Form 8-K, and our Proxy Statement for our Annual Meeting of Stockholders (“Proxy Statement”), and any amendments to such filings. The SEC also maintains an Internet website that contains reports, proxy statements and other information about issuers, like us, that file electronically with the SEC. The address of that website is www.sec.gov.\nWe webcast our earnings calls and certain events we participate in or host with members of the investment community on our investor relations website. Additionally, we provide notifications of news or announcements regarding our financial performance, including SEC filings, investor events, press and earnings releases, and blogs as part of our investor relations website. Further corporate governance information, including our corporate governance guidelines, code of business conduct and ethics, and committee charters is also available on our investor relations website under the heading “Governance.” The contents of the websites provided above are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC. Further, our references to the URLs for these websites are intended to be inactive textual references only.\n11\nTable of Contents",
    "item1a": "Item 1A. “Risk Factors”\n in this Annual Report on Form 10-K, including the risk factors under the section entitled \n“Risks Related to Intellectual Property, Information Technology, Data Privacy, and Security”\n.\nGovernance\nRisk is inherent with every business, and we face a number of risks, including strategic, financial, business and operational, legal and compliance, and reputational. We have designed and implemented processes to manage risk in our operations. \nManagement is responsible for the day-to-day management of risks we face, while our Board of Directors, as a whole and assisted by its committees, has responsibility for the oversight of risk management.\n \nOur Board of Directors administers its cybersecurity risk oversight function directly and may choose to administer this function through its committees as well.\nOur \nChief Information Security Officer\n oversees our cybersecurity program, policies and processes, including those described in \n“Risk Management and Strategy”\n above, and works with the information security team and other stakeholders on the prevention, detection, mitigation, response and remediation of cybersecurity incidents, as applicable. As our information security team monitors the security and effectiveness of our policies and processes, they also work to keep the Chief Information Security Officer and other members of leadership informed of critical incidents, process updates, or other material details, in accordance with our internal reporting structure. \nOur Chief Information Security Officer in turn provides periodic briefings to our Board of Directors regarding our company’s cybersecurity risks and activities, which would include recent material cybersecurity incidents and related responses, if any, changes to the risk landscape, and updates or changes to the cybersecurity program.\n \nOur current Chief Information Security Officer has over 15 years of systems engineering and technical cybersecurity experience, and holds an undergraduate degree in computer science and a graduate degree in business administration. He has also completed graduate-level courses in computer science, and holds certifications in information security.\n The information security team includes employees with broad ranging experience in cybersecurity threat assessments and detection, incident response, and mitigation and management of various types of threats, including from insiders and nation-state actors.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nRisk Management and Strategy\nWe maintain a security organization that is responsible for overseeing security practices across the Company, including with respect to information, personnel, and facilities. Our information security team maintains policies and processes for assessing, identifying, and managing material risk from cybersecurity and other information security threats, including as may be related to our third party vendors and suppliers. \nOur Chief Information Security Officer leads our information security team and works with Palantir’s other departments in areas such as facilities, physical security, operations, data protection, information technology, product development, finance, \n61\nTable of Contents\nlegal and compliance, where necessary in assessing and reviewing risks and identifying actions to be taken. As part of our overall approach to risk management, we monitor and evaluate the sufficiency of our policies, processes and controls, including with respect to cybersecurity risks and process. \nRegular assessments and reviews, both internal and independent, are conducted on Palantir information assets and networks, including systems, devices, applications, and related computing resources, to evaluate potential risks and vulnerabilities, identify actions to be taken, and evaluate the effectiveness of our cybersecurity program and controls. Risk management exercises occur regularly, and in response to changes in Company operations, risk landscape, and threat actor activities using threat modeling, risk forecasting, and other techniques to identify where investments in security should be made. Internal assessments occur based on results from risk management exercises, changes in infrastructure, cybersecurity risks, threat actor activity, and in response to other internal or external events. External assessments are conducted by independent assessors, consultants, or auditors, as relevant, and occur regularly in order to maintain our certifications and accreditations with certain compliance regimes (for example, FedRAMP).\nWe also provide employees with policies and training in areas such as ethics, corruption, information security, social engineering, data protection, and compliance, and with regular updates on the cybersecurity program and potential threats.\n \nAdditionally, Palantir utilizes third-party software, services, and providers in our cybersecurity program in furtherance of our security processes such as endpoint security, threat intelligence, cloud security, and authentication services. \nThe third-party vendors we engage with are generally required to implement industry standard technical, administrative, cybersecurity, and physical measures designed to protect the security and confidentiality of Palantir information (including customer information).\n Additionally, such providers undergo review, dependent on the software and services they are expected to provide, as part of our vendor onboarding process and may be subject to additional review upon certain critical events, or in connection with contract renewals. Third-party providers must notify Palantir promptly of relevant security incidents. \nWe face a number of cybersecurity risks in connection with our business. To date, our business strategy, results of operations, and financial condition have not been materially affected by cybersecurity incidents.\n For additional information, please refer to"
  }
}