{
  "ticker": "PNR",
  "cik": "0000077360",
  "company_name": "PENTAIR plc",
  "filing_date": "2025-02-25",
  "accession": "0000077360-25-000006",
  "primary_doc": "pnr-20241231.htm",
  "item_sections": {
    "item1": "ITEM 16.\n \nForm 10-K Summary\n  \n86\n \nSignatures\n  \n87\nPART I\nITEM 1.    BUSINESS\nUnless the context otherwise indicates, references herein to “Pentair,” the “Company,” and such words as “we,” “us,” and “our” include Pentair plc and its consolidated subsidiaries.\nGENERAL\nAt Pentair, we help the world sustainably move, improve and enjoy water, life’s most essential resource. From our residential and commercial water solutions to industrial water managemen\nt and everything in between, Pentair is focused on smart, sustainable water solutions that help our planet and people thrive.\nPentair strategy\nOur vision is to be the world’s most valued sustainable water solutions company for our employees, customers and shareholders. As a company, we:\n•\nFocus on growth in our core businesses and strategic initiatives;\n•\nAccelerate digital innovation and technology as well as sustainability investments;\n•\nExpedite growth and drive margin expansion through our Transformation Program; and\n•\nBuild a high performance growth culture and deliver on our commitments while living our Win Right values.\nHISTORY AND DEVELOPMENT\nWe are an Irish public limited company that was formed in 2014. We are the successor to Pentair Ltd., a Swiss corporation formed in 2012, and Pentair, Inc., a Minnesota corporation formed in 1966 and our wholly-owned subsidiary, under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Although our jurisdiction of organization is Ireland, we manage our affairs so that we are centrally managed and controlled in the United Kingdom (the “U.K.”) and therefore have our tax residency in the U.K.\nOn December 2, 2024, as part of our Pool reportable segment, we completed the acquisition of G & F Manufacturing, LLC (“G & F Manufacturing”) for $116.0 million in cash, net of cash acquired and subject to customary adjustments. The net purchase price is comprised of an upfront cash payment of $108.0 million, subject to customary adjustments, and the estimated fair value at the acquisition date of a contingent earn-out liability based upon the achievement of certain defined operating results in the two years following the acquisition. G & F Manufacturing manufactures and services pool heat pumps. \nOur registered principal office is located at Regal House, 70 London Road, Twickenham, London, TW13QS United Kingdom. Our management office in the United States (“U.S.”) is located at 5500 Wayzata Boulevard, Suite 900, Golden Valley, Minnesota.\nBUSINESS AND PRODUCTS\nPentair is comprised of three reportable segments: Flow, Water Solutions and Pool. The following is a brief description of each of the Company’s reportable segments and business activities.\nFlow\nThe Flow segment aims to deliver water where it is needed, when it is needed, more efficiently and to transform waste into value. This segment designs, manufactures and sells a variety of fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps, and agricultural spray nozzles, while serving the global residential, commercial and industrial markets. These products and systems are used in a range of applications, including fluid delivery, ion exchange, desalination, food and beverage, separation technologies for the oil and gas industry, residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, circulation and transfer, fire suppression, flood control, agricultural irrigation and crop spray.\nFor the fiscal year ended December 31, 2024, our residential and irrigation flow businesses, which sell pumps focused on residential and agriculture, comprised approximately 37% of Flow sales. Another approximately 29% of Flow sales were from the commercial & infrastructure flow businesses, which sell larger pumps focused on fire suppression, water supply, wastewater and flood control. The remaining approximately 34% of Flow sales were from the industrial solutions business, comprised of applications focused on industrial process and air filtration and sustainable gas.\n1\nFlow brand names include Pentair Flow, Aurora, Berkeley, Codeline, Fairbanks-Nijhuis, Haffmans, Hydromatic, Hypro, Jung Pumpen, Myers, Sta-Rite, Shurflo, Südmo and X-Flow.\nCustomers\nFlow customers include businesses engaged with end users, and wholesale and retail distribution in the residential, agricultural, commercial, food and beverage, and industrial vertical markets.\nSeasonality\nWe have historically experienced increased demand following warm weather trends for residential water supply and agricultural products. Such demand historically has been at seasonal highs from April to August. Seasonal effects may vary from year to year and are impacted by weather patterns, particularly by temperatures, heavy flooding and droughts.\nCompetition\nFlow faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including energy-efficient offerings and required specifications), quality, service and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced. \nWater Solutions\nThe Water Solutions segment aims to provide great tasting, higher-quality water and ice while helping people use water more productively. This segment designs, manufactures and sells commercial and residential water treatment products and systems including pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems. These water treatment products and systems are for use in residential whole home water filtration, drinking water filtration and water softening solutions in addition to commercial water management and filtration in foodservice operations. In addition, our water solutions business also provides installation and preventative services for water management solutions for commercial operators.\nFor the fiscal year ended December 31, 2024, our commercial business, which offers products such as conventional filtration products, commercial point-of-entry and point-of-use water treatment systems, activated carbon products and commercial ice machines, comprised approximately 66% of Water Solutions sales. In addition, our commercial business also provides installation and preventative services for water management solutions for commercial operators. The other approximately 34% of Water Solutions sales were associated with our residential business, which primarily focuses on products associated with residential point of entry and point of use filtration and softening systems, pressure tanks and control valves. \nWater Solutions brand names include Pentair Water Solutions, Everpure, Fleck, KBI, Manitowoc Ice, Pentek and RainSoft.\nCustomers\nWater Solutions customers include businesses engaged in wholesale and retail distribution in the residential, commercial and food and beverage vertical markets. Customers also include end users, consumers, commercial operators and original equipment manufacturers. \nSeasonality\nWe experience seasonal demand with several end customers and end users within Water Solutions. End-user demand for water solution products generally follows warm weather trends and is at seasonal highs from April to September.\nCompetition\nWater Solutions faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including required specifications), quality and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced. We believe our distribution channels and reputation for quality also provide us a competitive advantage.\nPool\nThe Pool segment aims to provide innovative, energy-efficient pool solutions to help people more sustainably enjoy water. This segment designs, manufactures and sells a complete line of energy-efficient residential and commercial pool equipment and accessories including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment and pool accessories. Applications for our pool products include residential and commercial pool maintenance, pool repair, renovation, service, construction and aquaculture solutions.\nThe primary brand names associated with the Pool segment are Pentair Pool, Kreepy Krauly, Pleatco and Sta-Rite.\n2\nCustomers\nPool customers include businesses engaged in wholesale and retail distribution in the residential and commercial vertical markets. Customers in the residential and commercial verticals also include end users and consumers.\nOne customer in the Pool business represented approximately 15% of our consolidated net sales in both 2024 and 2023.\nSeasonality\nWe have historically experienced seasonal demand with several end customers and end users. End-user demand for pool equipment follows warm weather trends and historically has been at seasonal highs from April to August. The magnitude of the sales spike has historically been partially mitigated by employing some advance sale “early buy” programs (generally including extended payment terms and/or additional discounts). \nCompetition\nPool faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including energy-efficient offerings and required specifications), quality, service and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced. We believe our distribution channels and reputation for quality also provide us a competitive advantage.\nINFORMATION REGARDING ALL REPORTABLE SEGMENTS\nResearch and development\nWe conduct research and development activities primarily in our own facilities. These efforts consist mostly of the development of new products, product applications and manufacturing processes.\nRaw materials\nThe principal materials we use in manufacturing our products are mild steel, stainless steel, electronic components (including drives and motors), plastics (resins, fiberglass, epoxies), metals and paint (powder and liquid). In addition to the purchase of raw materials, we purchase some finished goods for distribution for resale.\nWe purchase the materials we use in various manufacturing processes on the open market. We believe the majority of such materials are available through multiple sources and in adequate supply. We have certain long-term commitments, principally price commitments, for the purchase of various component parts and raw materials and continue to work with our suppliers to maintain delivery continuity. Alternate sources of supply are available for most materials and we believe that the termination of any of these commitments would not have a material adverse effect on our financial position, results of operations or cash flows.\nCertain commodities, such as metals and resins, are subject to commodity market and duty-driven price fluctuations. We manage these fluctuations through several mechanisms, including long-term agreements with price adjustment clauses for significant commodity market movements in certain circumstances. Prices for raw materials, such as metals, may trend higher in the near future due to the volatile market trends.\nIntellectual property\nPatents, non-compete agreements, proprietary technologies, customer relationships, trademarks, trade names and brand names are important to our business. However, we do not regard our business as being materially dependent upon any single patent, non-compete agreement, proprietary technology, customer relationship, trademark, trade name or brand name.\nPatents, patent applications and license agreements will expire or terminate over time by operation of law, in accordance with their terms or otherwise. We do not expect the termination of patents, patent applications or license agreements to have a material adverse effect on our financial position, results of operations or cash flows.\nHuman capital resources\nWe believe our success depends on our ability to attract, develop and retain strong employees. We believe a deep-rooted culture energizes our employees to make a difference within and beyond the workplace. We strive to be the destination for top talent, and work hard to develop and retain high performers throughout their career. We also believe our Win Right values, positive culture and commitment to inclusion and diversity foster innovation and curiosity, which, in turn, can contribute to us being an industry leader.\nAs of December 31, 2024, we had approximately 9,750 employees worldwide, of which approximately 50% are located in the U.S. A small portion of our U.S. employees are unionized. Outside the U.S. we have employees in certain countries, primarily in Europe, who are represented by an employee representative organization, such as a union, works council or employee association.\n3\nEmployee engagement and development\nWe believe engaging our employees and developing their careers is important to our long-term success and ties directly to our Win Right culture and values. We support our Win Right culture by providing dedicated culture training to our employees globally.\n \nWe engage with our employees and gather feedback about our employee programs, practices and policies through various approaches that include town hall meetings where Pentair leaders share strategies and perspectives and answer questions; quarterly leadership meetings to communicate our results and expectations; and an annual senior leadership meeting to drive growth and productivity initiatives, share best practices, and invest in our leaders. In addition, we conduct employee engagement and pulse surveys during the year to gauge the level of engagement and potential actions needed on culture, the business, employee experience and retention.\n \nWe believe in transparency with our employees and provide the results of those surveys to the manager level and above which drive the development of action plans.\nTraining and development\nTo support employees in their career journey, we have developed and shared through our dedicated development site, a number of tools and resources. We offer career pathing and development resources for all functions throughout Pentair. We support development annually with a dedicated career week, individual development planning and targeted development experiences supported through live training sessions; on-demand eLearning, virtual classrooms and downloadable materials. Additionally, our annual talent management process supports employees to set objectives, receive feedback and development, and build development plans with their leaders.\nOur talent development efforts span across various levels of our organization, including our early career Leadership Development Program, a 36-month program in which potential future leaders participate in rotations intended to develop their capabilities through organization-wide exposure, and our Growth Manager development programs that prepare our new and experienced managers to be more effective and inclusive leaders at Pentair. \nInclusion\nOur commitment to inclusion is part of living our Win Right values. Our success also depends on our ability to attract, engage, develop and retain our employees, which includes diverse employees from an array of backgrounds. We believe an inclusive and diverse workforce contributes different perspectives and innovative ideas that enable us to improve. We believe that every employee should be provided the same opportunity to be heard, respected, have a sense of belonging and contribute to our mission. Our Business Resource Groups, which are open to everyone, have been established to help promote a culture of inclusion by providing an additional forum for employee feedback, such as sharing insights that could help the business improve, and sponsoring awareness, education and engagement.\nWe take an integrated approach to supporting and promoting workplace inclusion by fostering a globally aware, inclusive culture; and reinforcing our practices to be fair and nondiscriminatory. We have various training and organizational approaches dedicated to fostering inclusion, including a training called the “The Power of Inclusion;” Business Resource Groups led by employees; Pentair’s Code of Business Conduct and Ethics; and other resources on our company’s intranet.\nHealth, safety and wellness\nWe are committed to providing a safe workplace for all of our employees. We encourage employees to “Stop Work” anytime there is a potential concern regarding worker safety, and promote an open door policy so that all of our employees feel free to speak to their manager if there are any potential health, safety, compliance or sustainability concerns. Additionally, each site maintains a confidential reporting process, and we encourage the use of the Ethics Hotline for employees to report anonymously potential safety concerns. All locations, enterprise wide, are required to meet regulatory agency standards as applicable to each site’s location.\nCompensation and benefits\nIn the U.S., non-union full-time employees are eligible to receive the following benefits: short-term and long-term disability insurance; flexible and health savings accounts and wellness programs; health insurance (medical, pharmacy, dental); eight weeks paid parental leave for birth, adoptive and foster parents; two weeks paid caregiver leave; legal services; retirement benefits; employee stock purchase plan; tuition reimbursement; holidays; vacation and sick time. Benefits for union employees and employees of G & F Manufacturing, which was acquired on December 2, 2024, may vary.\n4\nSustainability Activities\nAs a leading provider of smart, sustainable water solutions and with a foundation of Win Right values, we recognize that the work we do and the products and services we provide help to improve lives and the environment around the world. We are focused on building on our Win Right values and culture by further contributing to the development of a sustainable and responsible society that we believe will also drive our future growth. We are also focused on further integrating our sustainability goals throughout our business by creating accountability for our sustainability strategy and shared commitments. We have established formal sustainability programs to further advance our sustainability goals. \nIn 2023, Pentair completed an Environmental, Social and Governance (“ESG”) assessment in alignment with the European Union’s Corporate Sustainability Reporting Directive (“CSRD”). This assessment supported the topics focused on in our first set of social responsibility strategic targets, which we announced in 2021. These strategic targets remained in effect through 2024 and reflected the Company’s social responsibility focus areas. Also in alignment with the CSRD, in 2025 we are conducting an updated sustainability assessment, and expect to use the results of this updated assessment for continued sustainability strategic planning and risk management, as well as to determine future focus areas, targets, goals and disclosure requirements under the CSRD.\nAnnually, we publish a corporate responsibility/sustainability report on our sustainability activities and accomplishments, which can be found on our corporate website, and which is not incorporated by reference into this Annual Report on Form 10-K.\nEnvironmental Matters\nSee",
    "item1a": "ITEM 1A. “Risk Factors - Increased cybersecurity threats and computer crime pose a risk to our systems, networks, products and services, and we are exposed to potential regulatory, financial and reputational risks relating to the protection of our data” for a discussion of cybersecurity risks.\n19",
    "item1c": "ITEM 1C. CYBERSECURITY\nOur management and Board of Directors (the “Board”) recognize the importance of maintaining the security and resiliency of our cybersecurity environment to deliver on the expectations of our customers, dealers, business partners, employees and investors. The Board oversees our risk management practices, including our overall enterprise risk management (“ERM”) program, in which cybersecurity risk is included. Our cybersecurity program is aligned with the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework (“CSF”) and leverages the International Organization for Standardization and other applicable industry standards. Overall, the purpose of our information security program is to protect the confidentiality, integrity and availability of our systems and data, along with the safe operation of our connected products. This is supported by our security operating framework, roadmap and governance.\nCybersecurity Risk Management and Strategy\nOur cybersecurity program is focused on the following areas:\nSecurity governance \nWe have established processes aimed to assess, identify and manage material risks from cybersecurity threats. Our ERM organizational process includes annual risk assessments. Our cybersecurity team, which is led by our Chief Information Officer and Chief Information Security Officer (the “CIO/CISO”), is responsible for identifying, assessing and managing strategic and operational cybersecurity risks. \nOur cybersecurity team shares information regarding such risks with our \nSecurity Steering Committee\n, which consists of our General Counsel, Chief Financial Officer, CIO/CISO, and members of our IT, Legal and ERM functions.\n Both our Security Steering Committee and our ERM function support the Board’s oversight of cybersecurity risk.\nTechnical safeguards \nWe deploy technical safeguards designed to protect our systems from cybersecurity threats, including firewalls, anti-malware software, and authentication and authorization controls. \nOngoing enhancements are \nintegrated\n into our security roadmap, as informed by our security audits and assessments.\n18\nSecurity and privacy incident response \nWe maintain an incident response plan to identify, protect, detect, respond to and recover from cybersecurity threats and incidents. We test and evaluate our plans on a regular basis. The CIO/CISO, the Security Steering Committee, our Chief Executive Officer and the Board are notified of any material cybersecurity incidents through an established escalation process.\nThird-party risk management\nWe maintain a risk-based third-party risk management process designed to identify, assess and manage risks presented by service providers, vendors and other third parties that access our systems or that process or store our data.\nSecurity awareness and training\nWe provide ongoing security awareness and training to educate internal users on how to identify and report potential issues. Professional-level employees receive mandatory cybersecurity education and training. Employee phishing tests are conducted on a regular basis. Employees who do not follow protocol are redirected for additional training. We also provide periodic updates to employees on emerging cybersecurity trends and ways to protect themselves and our company.\nSecurity audits and assessments\nWe perform periodic security audits and assessments to test our cybersecurity program. These efforts span across our cybersecurity program, including but not limited to audits, assessments, tabletop exercises, vulnerability scanning and penetration tests. We regularly \nengage third parties\n to assess our cybersecurity program, including cybersecurity maturity assessments, penetration testing, and independent review of our security control environment and operating effectiveness. The results of the assessments are included for review by the Security Steering Committee and the Audit and Finance Committee of the Board. We look to enhance our cybersecurity program with the results of the audits, assessments and reviews we perform.\nGovernance\nThe Board is responsible for general oversight of our risk management, including cybersecurity risk.\n The Audit and Finance Committee of the Board is responsible for overseeing our risk exposure to information security, cybersecurity and data protection, as well as the steps management has taken to monitor and control such exposures.\n \nWe conduct cybersecurity audits and assessments on a regular basis and either our CIO/CISO or Chief Financial Officer report to the Audit and Finance Committee on a quarterly basis.\nOur cybersecurity team, which is responsible for assessing and managing our risks from cybersecurity threats, is led by the \nCIO/CISO\n, who reports to our Chief Financial Officer. The Security Steering Committee provides additional oversight for assessing and managing cybersecurity risk.\nThe CIO/CISO has over 20 years of cybersecurity and technology experience and has previously held Chief Information Security Officer positions at a large public retail company, as well as at a public technology company and services organization. The CIO/CISO has an undergraduate degree in Management Information Systems. Members of our cybersecurity team have broad experience in security functions in various industries. Our Chief Executive Officer, Chief Financial Officer and General Counsel each hold degrees in their respective fields, and each have over 25 years of experience managing risks at the Company and at similar companies, including risks arising from cybersecurity threats.\nImpact of Cybersecurity Threats\nPrevious cybersecurity incidents have not materially affected us, including our business strategy, results of operations or financial condition.\n However, risks from cybersecurity threats, including but not limited to exploitation of vulnerabilities, ransomware, denial of service, supply chain attacks, or other similar threats may materially affect us, including our execution of business strategy, reputation, results of operations and/or financial condition. See",
    "item1b": "ITEM 1B.  UNRESOLVED STAFF COMMENTS\nNone."
  }
}