{
  "ticker": "PODD",
  "cik": "0001145197",
  "company_name": "INSULET CORP",
  "filing_date": "2025-02-21",
  "accession": "0001145197-25-000007",
  "primary_doc": "podd-20241231.htm",
  "item_sections": {
    "item1": "Item 16\nForm 10-K Summary\n82\nSIGNATURES\n83\nTable of Contents\nPART I\nItem 1. Business\nOverview \nInsulet Corporation (“we” or the “Company”) is primarily engaged in the development, manufacture, and sale of its proprietary continuous insulin delivery systems for people with insulin-dependent diabetes. The Omnipod platform includes: the Omnipod\n®\n 5 Automated Insulin Delivery System (“Omnipod 5”), the Omnipod DASH\n®\n Insulin Management System (“Omnipod DASH”), and the Omnipod Insulin Management System (“Classic Omnipod”).\nWe also produce pods for Amgen for use in the Neulasta\n®\n Onpro\n®\n kit, a delivery system for Amgen’s Neulasta to help reduce the risk of infection after intense chemotherapy.\nMarket Opportunity: Management of Diabetes\nDiabetes is a chronic, life-threatening disease for which there is no known cure. It is caused by the body’s inability to produce or effectively utilize the hormone insulin, which prevents the body from adequately regulating blood glucose levels. Glucose, the primary source of energy for cells, must be maintained at certain concentrations in the blood in order to permit optimal cell function and health. In people with diabetes, blood glucose levels fluctuate between very high levels, a condition known as hyperglycemia, and very low levels, a condition called hypoglycemia. Hyperglycemia can lead to serious short-term complications, such as confusion, vomiting, dehydration, and loss of consciousness and long-term complications, such as blindness, kidney disease, nervous system disease, occlusive vascular diseases, stroke, cardiovascular disease, or death. Hypoglycemia can lead to confusion, loss of consciousness, or death.\nDiabetes is typically classified as either type 1 or type 2:\n•\nType 1 diabetes is characterized by the body’s nearly complete inability to produce insulin. It is diagnosed throughout the age spectrum, with over half of newly diagnosed cases occurring in adulthood. Individuals with type 1 diabetes require daily insulin therapy to survive. We estimate that approximately 5 million people have type 1 diabetes in the countries we currently serve.\n•\nType 2 diabetes, the more common form, is characterized by the body’s inability to either properly utilize insulin or produce enough insulin. Historically, type 2 diabetes has occurred in later adulthood, but its incidence is increasing among the younger population, due primarily to increasing obesity. Initially, many people with type 2 diabetes attempt to manage their diabetes with improvements in diet, exercise, and/or medications, both oral and injectable, including SGLT2 inhibitors and GLP-1 drugs. As their diabetes advances, some individuals progress to multiple drug therapies, which often include insulin therapy. People with type 2 diabetes who take insulin either require intensive insulin therapy (typically multiple injections of insulin per day) or basal (long-acting) insulin (typically a single injection daily or weekly). We estimate that approximately 6 million people have insulin-intensive type 2 diabetes in the countries we currently serve and another 3 million people with type 2 diabetes in the United States require only long-acting insulin.\nWe estimate that approximately 40% of the type 1 diabetes population in the United States and 20% of the international type 1 diabetes population use insulin pump therapy. An even smaller portion of the U.S. and international insulin-intensive type 2 diabetes population and the U.S. basal only insulin type 2 population use insulin pump therapy. We believe these factors present a significant available market for our Omnipod platform globally.\nThroughout this Annual Report on Form 10-K, we refer to both type 1 diabetes and insulin-intensive type 2 diabetes as insulin-dependent diabetes.\nDiabetes Management Challenges\nDiabetes is often frustrating and difficult for people to manage. Blood glucose levels can be affected by the carbohydrate and fat content of meals, exercise, stress, illness, impending illness, hormonal releases, variability in insulin absorption, and changes in the effects of insulin on the body. For people with insulin-dependent diabetes, many corrections, consisting of the administration of additional insulin or ingestion of additional carbohydrates, are needed throughout the day in order to maintain blood glucose levels within normal ranges. Achieving this result can be very difficult with multiple daily injections of insulin. Individuals with diabetes attempting to control their blood glucose levels tightly to prevent the long-term complications associated with fluctuations in blood glucose levels are at greater risk for overcorrection and hypoglycemia. Additionally, the time spent managing fluctuations in blood glucose levels and the fear associated with hypoglycemia can be incredibly stressful for individuals with diabetes and their families.\n3\nTable of Contents\nCurrent Insulin Therapy\nPeople with insulin-dependent diabetes need a continuous supply of insulin, known as basal insulin, for background metabolic needs. In addition to basal insulin, people with insulin-dependent diabetes require supplemental insulin, known as bolus insulin, to compensate for carbohydrates ingested during meals or snacks or for a high blood glucose level caused by other physiological reasons. There are two primary types of insulin therapy practiced today: multiple daily injection (“MDI”) therapy using syringes or insulin pens and pump therapy using insulin pumps.\nMDI therapy involves injecting fast-acting insulin before meals (bolus) to lower blood glucose levels to a healthy range. MDI therapy may also require a separate injection of a long-acting (basal) insulin, to control glucose levels between meals; typically, once or twice per day. By comparison, insulin pump therapy uses only fast-acting insulin to fulfill both mealtime (bolus) and background (basal) requirements. Insulin pump therapy allows individuals to customize their bolus and basal insulin doses to meet their insulin needs throughout the day and is intended to more closely resemble the physiologic function of a healthy pancreas.\nInsulin pumps perform continuous subcutaneous insulin infusion and typically use a programmable device and an infusion set to administer insulin into the body. Insulin pump therapy has been shown to provide numerous advantages relative to MDI therapy. For example, insulin pump therapy eliminates individual insulin injections, delivers insulin more accurately and precisely than injections, often improves HbA1c (a common measure of blood glucose levels) over time, provides greater flexibility with meals, exercise, and daily schedules, and can reduce severe low blood glucose levels. We believe that these advantages, along with technological advancements, including the use of continuous glucose monitoring technology and automated insulin device (“AID”) algorithms, and increased awareness of insulin pump therapy, will continue to generate demand for insulin pump devices. \nOur Solution: The Omnipod Platform\nThe Omnipod platform offers continuous insulin delivery that provides all the benefits of insulin pump therapy in a unique way without the need for external tubing required with conventional pumps. The small, lightweight, self-adhesive disposable tubeless Omnipod device (“Pod”), can be worn in multiple locations, including the abdomen, hip, back of upper arm, upper thigh, or lower back, and delivers insulin into the body through a small flexible tube (called a cannula). We refer to this as “Pod therapy.” We believe the Omnipod platform’s innovative proprietary design and differentiated features allow people with insulin-dependent diabetes to live their lives and manage their diabetes, with unprecedented freedom, comfort, convenience, and ease.\nOmnipod 5\nOmnipod DASH\nOmnipod 5\nIn 2022, we received U.S. Food and Drug Administration (“FDA”) clearance and CE Mark approval under the European Union Medical Device Regulation (“MDR”) for Omnipod 5, which builds on our Omnipod DASH platform. Omnipod 5 is now available in 10 countries. Additionally, in August 2024, we received FDA clearance for an expanded indication of Omnipod 5 for people with type 2 diabetes (ages 18 years and older) in the United States.\nOmnipod 5 includes a proprietary AID algorithm embedded in the Pod. The Pod integrates with a third-party continuous glucose monitor (“CGM”) to obtain glucose values through wireless Bluetooth communication. The embedded algorithm utilizes these glucose values to predict glucose levels into the future and automatically adjusts insulin dosing intended to improve time-in-range and reduce the occurrence of blood glucose highs and lows. The user can also deliver insulin doses for snacks or meals or to correct high blood glucose through the system. The Pod can be controlled by an Insulet-provided \n4\nTable of Contents\nhandheld device or a user-downloaded Android app or, in the US, the iOS app, with full smartphone compatibility. The Omnipod 5 Controller and the Android and iOS apps use cloud-based technology to upload data wirelessly via a built-in SIM card or secure Wi-Fi. The Pod currently integrates with Dexcom, Inc.’s G6 and G7 CGMs and with Abbott Diabetes Care, Inc.’s (“Abbott”) FreeStyle Libre 2 Plus sensor (“Libre 2 Plus”) in various markets as depicted under \nMarkets and Distribution Methods\n. \nOmnipod DASH\nOmnipod DASH features a secure Bluetooth enabled Pod that is controlled by a smartphone-like Personal Diabetes Manager (“PDM”) with a color touch screen user interface. In the U.S., the PDM has Wi-Fi capabilities to enable automatic data uploads providing users and their clinicians with cloud access to data and enhancements for pushing software updates wirelessly to users. Omnipod DASH provides continuous insulin delivery at preset rates, eliminating the need for individual insulin injections. In addition, insulin delivery can be changed with the press of a button to adapt to snacks or unexpected changes in daily routine. Omnipod DASH delivers insulin in two ways:\n•\nA small, constant background supply of insulin is delivered automatically at a programmed rate, all day and night.\n•\nAn extra dose of insulin can be delivered when needed to match the carbohydrates in a snack or meal to correct high blood glucose.\nWe have designed Omnipod DASH to fit within the normal daily routines of users. Omnipod DASH communicates wirelessly, provides for virtually pain-free automated cannula insertion, and eliminates the need for MDI therapy or the use of pump and tubing. The Pod can be worn for up to three days at a time and, because it is waterproof (with an IP28 rating for up to 25 feet for 60 minutes), there is no need to remove it when showering, swimming, or performing other activities. \nOmnipod Classic\nFollowing the launch of Omnipod 5, the vast majority of our customer base is no longer using our Classic Omnipod product. Accordingly, we are phasing out our Classic Omnipod product.\nData Management\nWe have partnered with Glooko Inc. (“Glooko”) to connect user data with Glooko’s comprehensive diabetes data management system (including Glooko and Diasend in selected regions). Glooko provides a cloud-based application for clinicians and users accessible through a kiosk, home computer, or a mobile application on the user’s smartphone that provides users and their healthcare providers access to insulin delivery trends, blood glucose levels, and other integrated data. \nSecurity\nParamount to our ability to deliver full compatible smartphone control is our commitment to cybersecurity and information security. With certifications from the Diabetes Technology Society’s “Standard for Wireless Diabetes Device Security” cybersecurity and assurance standard and program as well as from the International Organization for Standardization (“ISO”), Insulet is globally recognized for incorporating the highest standards for cybersecurity, information security, and safety, including secure data transfer between the Pod and PDM, as well as secure cloud storage. See",
    "item1c": "Item 1C. Cybersecurity\nWe manage cyber risk on a daily basis, as we face a multitude of threats ranging from ransomware, phishing attacks, business email compromise, and a wide array of other cyber-criminal tactics aimed at impacting our operations and compromising our sensitive information. Our customers, suppliers, subcontractors, and partners face similar cybersecurity threats, and a cybersecurity incident impacting us or any of these entities could materially adversely affect our operations, performance and results of operations. Accordingly, we have invested in resources (people, processes, and technology) aimed at identifying, assessing, and responding to cyber threats.\nOur Board of Directors (“Board”) oversees management’s processes for identifying and mitigating risks, including cybersecurity risks, to help align our risk exposure to our strategic objectives. While the Board reviews the Company’s cybersecurity program annually, the \nNominating, Governance, and Risk Committee (“NGR Committee”)\n of the Board has primary responsibility for cybersecurity as part of its risk oversight mandate. The NGR Committee is updated on cybersecurity matters from our \nChief Information Security Officer (“CISO”)\n and members of the CISO’s team at least twice annually. The CISO discusses management’s actions to identify and detect threats and reviews the structure of and enhancements to the Company’s defenses as well as management’s progress on its cybersecurity strategic roadmap. \nThe NGR Committee Chair reports to the full Board after each Committee meeting, including information relating to the cybersecurity discussions.\n \nOur Cybersecurity organization, which includes infrastructure security, product security, technology risk management, and security awareness and culture is led by our CISO. \nOur CISO, reports directly to our Chief Technology Officer (“CTO”) and is responsible for developing and implementing our cybersecurity program, including setting the directional security strategy and continuous improvement plans for the overall security program.\n \nOur CISO has over a decade of experience leading cyber-security and technology risk management programs in both healthcare and medical device manufacturing organizations and maintains multiple industry certifications, including Certified Information Systems Security Professional and Certified Information Security Manager.\n \nThe CTO ensures cyber-security measures are prioritized across research and development, software engineering, and our information technology functions. The CTO supports the CISO in chairing a quarterly Technology Risk Committee aimed at providing proper oversight and governance of the cybersecurity program, remediation of identified technology risks, and execution of the cybersecurity strategy. Our processes for assessing, identifying, and managing cybersecurity-related risks is also included within our overall enterprise risk management (ERM) program.\n \nWe leverage the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework to better manage and respond to cybersecurity risks in protecting our infrastructure and sensitive data.\n We have mapped and base-lined our people, processes, and technology in alignment with the categories defined in the NIST industry standard framework: Identify, Protect, Detect, Respond, and Recover.\n Additionally, Insulet’s information security management system is ISO 27001 and 27701 certified. For the seventh consecutive year, Insulet received re-certification from the ISO, which is the recognized standard for information security management and privacy best practices that adheres to the highest international data security standards. In 2024, we also added ISO certifications specific to Cloud Computing and Health Informatics, which pairs with and supports other applicable medical device and international certification requirements.\nWe regularly assess the threat landscape and take a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection, and mitigation\n. We maintain a cybersecurity risk register, and cybersecurity team leaders hold monthly meetings to discuss and prioritize risks as well as the status of any remediation activity. Key facets of our cybersecurity program include:\n•\n24/7 cyber monitoring.\n Our security operations center is located in multiple time zones to ensure around-the-clock coverage and timely threat detection and response. \n•\nExternal Threat Landscape Assessment. \nOur integrated privacy, legal, and security teams are continuously monitoring for any external threat that may impact our operations. Third-party threat intelligence feeds are leveraged to monitor Insulet’s digital footprint and activity that may cause brand damage.\n•\nInsider Risk Detection. \nWe have targeted tools aimed at detecting insider threats and suspicious data movement.\n•\nCloud and Vulnerability Management.\n To enhance cloud and data security, we reduce the attack surface by establishing secure defaults, implementing least privilege, and monitoring configurations continuously. As part of vulnerability and overall security posture management, we have a focused cross-functional team that meets regularly to address issues identified by security scans and security configuration checks to maintain hygiene of Insulet’s computing devices.  \n•\nTesting and Audits. \nRegular penetration testing, incident response tabletop testing, and audits are performed by trusted third-party security consultants. These final reports and gap analysis documents are logged into our risk register as appropriate. \n•\nOperating Technology (“OT”) Visibility. \nAs a manufacturer of medical devices, OT is a vital component of our business operations. Interconnectedness between OT technology and other business critical information technology \n28\nTable of Contents\ninfrastructure can create a material cyber risk. Insult deploys segmentation and OT-specific monitoring capabilities to mitigate and monitor this risk. \n•\nVendor Management.\n Vendors and key partners are subject to Insulet’s Vendor Risk assessment process and subsequently monitored by our threat intelligence capability, which tracks our key vendors and suppliers. \n•\nTraining and Culture\n. Training, awareness, and incorporating security into Insulet’s culture is key to reducing risk around common threats such as phishing. We have an operational information security training program for all employees. In addition to annual trainings, we require and monitor completion of frequent “nanolearning” targeted trainings. These quick trainings provide constant reminders to our employees to be vigilant and give them the tools to recognize and protect against cyber threats. We also conduct phishing simulations to test effectiveness of our training program with the aim of reducing the percentage of employees who click on suspicious emails.\nWe are intensely focused on protecting the security of our products; our guiding principle of “security and privacy by design” underlies all of our product development. We have a cybersecurity team embedded with our research and development group to deliver on this mission as well as a Product Cybersecurity Risk Management Policy that aligns with FDA guidance.  Omnipod 5 incorporates cybersecurity by design principles, which includes secure data transfer between the Pod, Controller, cloud storage, and compatible CGMs. Our Secure Software Development Lifecycle enforces application testing and continuous monitoring to identify security risks. Omnipod 5 is certified by ISO (27001, 27017 and 27799) and the U.K. Cyber Essentials. Omnipod 5 incorporates authentication, encryption, and cybersecurity protection to ensure only trusted devices and authorized people can access the system.\nNotwithstanding the extensive approach we take to cybersecurity, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us. Should a cyber incident occur, we have in place the Insulet Cybersecurity Incident Response Procedure (“CIRP”) and Crisis Management Plan, which are designed to enable us to respond efficiently to any incidents. Pursuant to the CIRP, cybersecurity incidents are reviewed and rated by our CISO and his team. A cybersecurity incident rated at predefined risk levels will be escalated to CTO, the Chief Compliance Officer, and the General Counsel and assessed for materiality and disclosure to the CEO and the Board. Our internal Disclosure Committee will review any planned public disclosures or filings. CIRP provides the organizational and operational structure to respond to incidents that may affect the confidentiality, integrity or availability of our information systems.\nWe currently do not believe that risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected the Company’s business strategy, results of operations, or financial condition.\n While Insulet maintains cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be fully insured. See",
    "item1a": "Item 1A. “Risk Factors” for a discussion of cybersecurity and other risks which may impact Insulet.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.\n27\nTable of Contents"
  }
}