{
  "ticker": "POOL",
  "cik": "0000945841",
  "company_name": "POOL CORP",
  "filing_date": "2025-02-27",
  "accession": "0000945841-25-000032",
  "primary_doc": "pool-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business,” of this Form 10-K.\nThe following table presents certain unaudited quarterly included income statement and balance sheet data for the most recent eight quarters to allow for a meaningful comparison of the seasonal fluctuations in these amounts.  We believe this information reflects all normal and recurring adjustments considered necessary for a fair presentation of this data.  Due to the seasonal nature of our industry, the results of any one or more quarters are not necessarily a good indication of results for an entire fiscal year or of continuing trends, including the impact of new and acquired sales centers.\n(Unaudited)\nQUARTER\n(in thousands)\n2024\n2023\n \nFirst\nSecond\nThird\nFourth\nFirst \nSecond \nThird \nFourth\nStatement of Income Data\n \n \n \n \n \n \n \n \nNet sales\n1,120,810\n1,769,784\n1,432,879\n987,480\n1,206,774\n1,857,363\n1,474,407\n1,003,050\nGross profit\n338,560\n530,141\n416,403\n290,244\n369,755\n567,783\n428,731\n293,775\nOperating income\n108,720\n271,481\n176,353\n60,651\n145,771\n327,009\n194,443\n79,344\nNet income\n78,885\n192,439\n125,701\n37,300\n101,699\n232,250\n137,843\n51,437\nNet sales as a % of annual net sales\n21%\n33%\n27%\n19%\n22%\n34%\n27%\n18%\nGross profit as a % of annual gross profit\n21%\n34%\n26%\n18%\n22%\n34%\n26%\n18%\nOperating income as a % of annual operating income\n18%\n44%\n29%\n10%\n20%\n44%\n26%\n11%\nBalance Sheet Data\nTotal receivables, net\n527,175\n577,529\n425,693\n314,861\n564,171\n630,950\n461,582\n342,910\nProduct inventories, net\n1,496,947\n1,295,600\n1,180,491\n1,289,300\n1,686,683\n1,392,886\n1,259,308\n1,365,466\nAccounts payable\n907,806\n515,645\n401,702\n525,235\n739,749\n485,099\n429,436\n508,672\nTotal debt\n979,177\n1,116,553\n923,829\n950,356\n1,365,750\n1,184,586\n1,033,897\n1,053,320\n \nNote: Due to rounding, the sum of quarterly percentage amounts may not equal 100%.\nWeather Impacts on Fiscal Year 2024 to Fiscal Year 2023 Comparisons\nThe first quarter of 2024 was the tenth wettest first quarter on national record leading to mixed impacts across our markets, particularly in the month of March, which is seasonally our highest sales month of the first quarter.  However, we also observed above-average temperatures during the quarter contributing positively to economic activities in many regions, such as improvement in California during March.  The adverse effects of cooler and wetter weather in Florida and the Southeast compared to the first quarter of last year and excessive precipitation in Texas and the Northeast outweighed the positives, resulting in an unfavorable net impact on net sales.  In the first quarter of 2023, varied weather conditions had a more pronounced unfavorable impact on net sales due to unusually wet and cold weather in the western U.S., particularly California and Arizona.  This wet and cold weather was partially offset by generally favorable conditions in our southern markets, where sales benefited from warmer weather and below-average precipitation.\nThe second quarter of 2024 was marked by precipitation variability across the U.S. with wetter conditions in the central U.S. and Texas and below average precipitation in the western U.S.  Maintenance activities benefited from warmer-than-average temperatures across most regions, particularly in June.  Overall, mixed weather conditions led to varied impacts across our markets.  In contrast, weather conditions in the second quarter of 2023 unfavorably impacted sales due to cooler temperatures across the West through the mid-Atlantic region and the impact of wildfires in Canada. \nThe third quarter of 2024 saw a mix of weather conditions across the continental U.S.  Several regions faced notable weather events during the quarter.  Tropical weather brought localized flooding and heavy rainfall particularly to the coastal areas of \n41\nFlorida, Louisiana and the Carolinas.  Wetter conditions and cooler temperatures in July of 2024, compared to July of 2023, impacted maintenance activities in Texas, a key market, during a prominent selling month.  The Northeast and Midwest regions experienced generally warm and dry conditions throughout the quarter, which was favorable for pool-related activities.  The West, particularly in California, continued its trend of above-average temperatures and dry conditions, which supported outdoor and construction activities.  Collectively, weather conditions in the third quarter of 2024 had a relatively neutral impact on the overall business. Similarly, in the third quarter of 2023, hot temperatures across the southern United States were offset by rainy conditions in the Northeast, resulting in a fairly neutral impact on our business. \nRepair and replacement activity following Hurricanes Helene and Milton provided some weather-related benefits to Florida’s fourth quarter results, contributing to an increase in consolidated sales of approximately 1%.  The fourth quarter of 2024 was warmer than average with low precipitation across the country.  October 2024 was one of the warmest and driest months on record while November provided some relief with above average precipitation levels in the Midwest.  December was consistent with observed trends with both above-average temperatures and below-average precipitation.  Excluding Florida, the fourth quarter of 2024 was comparable to the fourth quarter of 2023 which had overall warm weather conditions. \nWeather Impacts on Fiscal Year 2023 to Fiscal Year 2022 Comparisons\nFor a detailed discussion of Weather Impacts on Fiscal Year 2023 compared to Fiscal Year 2022, see the Seasonality and Quarterly Fluctuations section of Management’s Discussion and Analysis included in Part II, Item 7 of our 2023 Annual Report on Form 10-K.  \nGeographic Areas\nSince all of our sales centers have similar operations and share similar economic characteristics, we aggregate our sales centers into a single reportable segment.  For additional details, see Note 1 of our “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K.  \nFor a breakdown of net sales and property, plant and equipment between our United States and international operations, see Item 1, “Business,” of this Form 10-K.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity is defined as the ability to generate adequate amounts of cash to meet short-term and long-term cash needs.  We assess our liquidity in terms of our ability to generate cash to fund our operating activities, taking into consideration the seasonal nature of our business.  Significant factors which could affect our liquidity include the following: \n•\ncash flows generated from operating activities;\n•\nthe adequacy of available bank lines of credit;\n•\nthe quality of our receivables;\n•\nacquisitions;\n•\ndividend payments;\n•\ncapital expenditures;\n•\nchanges in income tax laws and regulations; \n•\nthe timing and extent of share repurchases; and\n•\nthe ability to attract long-term capital with satisfactory terms.\nOur primary capital needs are seasonal working capital obligations, debt repayment obligations and other general corporate initiatives, including acquisitions, opening new sales centers, technology-related investments, dividend payments and share repurchases.  Our primary working capital obligations are for the purchase of inventory, payroll, rent, other facility costs and selling and administrative expenses.  Our working capital obligations fluctuate during the year, driven primarily by seasonality and the timing of inventory purchases.  Our primary sources of working capital are cash from operations supplemented by bank borrowings, which have historically been sufficient to support our growth and finance acquisitions.  We have funded our capital expenditures and share repurchases in substantially the same manner.\n42\nWe prioritize our use of cash based on investing in our business, maintaining a prudent capital structure, including a modest amount of debt, and returning cash to our shareholders through dividends and share repurchases.  Our specific priorities for the use of cash are as follows:\n•\ncapital expenditures primarily for maintenance and growth of our sales center network, technology-related investments and fleet vehicles;\n•\ninventory and other operating expenses;\n•\nstrategic acquisitions executed opportunistically; \n•\npayment of cash dividends as and when declared by our Board;\n•\nrepayment of debt to maintain an average total target leverage ratio (as defined below) between 1.5 and 2.0; and\n•\ndiscretionary repurchases of our common stock under our Board authorized share repurchase program.\nWe focus our capital expenditure plans based on the needs of our existing sales centers and the opening of new sales centers.  Our capital spending primarily relates to leasehold improvements, delivery and service vehicles and information technology.  In recent years, we have increased our investment in technology and automation enabling us to operate more efficiently and better serve our customers.  \nHistorically, our capital expenditures have averaged roughly 1.0% of net sales.  Capital expenditures were 1.1% of net sales in 2024, 1.1% of net sales in 2023 and 0.7% in 2022.  In 2022, our capital expenditures as a percentage of net sales were lower than our historical average due to significant sales growth in that year.  Based on management’s current plans, we project capital expenditures for 2025 will average 1% to 1.5% of net sales.  \nWe believe we have adequate availability of capital to fund present operations and the current capacity to finance any working capital needs that may arise.  We continually evaluate potential acquisitions and hold discussions with acquisition candidates.  If suitable acquisition opportunities arise that would require financing, we believe that we have the ability to finance any such transactions.\nAs of February 20, 2025, $336.8 million remained available to purchase shares of our common stock under our current Board-approved share repurchase plan program.  We expect to repurchase additional shares in the open market from time to time depending on market conditions.  We plan to fund these repurchases with cash provided by operations and borrowings under our credit and receivables facilities described below.\nSources and Uses of Cash\nThe following table summarizes our cash flows (in thousands):\n \nYear Ended December 31,\n \n2024\n2023\nOperating activities\n$\n659,186\n \n$\n888,229 \nInvesting activities\n(66,169)\n(71,597)\nFinancing activities\n(576,550)\n(798,132)\nCash provided by operations of $659.2 million for 2024 decreased $229.0 million compared to 2023.  This decline was primarily driven by our inventory reduction efforts in prior year and lower net income in 2024.  These impacts were partially offset by a benefit from the hurricane relief deferral of our third and fourth quarter estimated tax payments totaling $68.5 million.  \nCash used in investing activities decreased $5.4 million to $66.2 million in 2024, primarily reflecting a decrease of $6.8 million in payments for acquisitions compared to 2023. \nCash used in financing activities decreased to $576.6 million in 2024 compared to $798.1 million in 2023.  The change in financing activities primarily reflects a $232.4 million decrease in net debt payments, partially offset by an increase in dividends paid of $12.2 million. \nFor a discussion of our sources and uses of cash in 2022, see the Liquidity and Capital Resources – Sources and Uses of Cash section of Management’s Discussion and Analysis included in Part II, Item 7 of our 2023 Annual Report on Form 10-K.\n43\nFuture Sources and Uses of Cash\nTo supplement cash from operations as our primary source of working capital, we will continue to utilize our three major credit facilities, which are the Amended and Restated Revolving Credit Facility (the Credit Facility), the Term Facility (the Term Facility) and the Receivables Securitization Facility (the Receivables Facility).  For additional details regarding these facilities, see the summary descriptions below and more complete descriptions in Note 5 of our “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K.  \nCredit Facility\nOur Credit Facility, as amended, provides for $1.3 billion in borrowing capacity consisting of a $800.0 million unsecured revolving credit facility and a $500.0 million term loan facility.  The Credit Facility also includes an accordion feature permitting us to request one or more incremental term loans or revolving credit family commitment increases up to $250.0 million and sublimits for the issuance of swingline loans and standby letters of credit.  We pay interest on revolving and term loan borrowings under the Credit Facility at a variable rate based on the one-month Term secured overnight financing rate (SOFR), plus an applicable margin.  The term loan requires quarterly amortization payments with all remaining principal due on the term loan maturity date of September 25, 2026.  The revolving credit facility matures on September 30, 2029.  We intend to continue to use the Credit Facility for general corporate purposes, for future share repurchases and to fund future growth initiatives.\nAt December 31, 2024, there was $657.1 million outstanding, including a $462.5 million term loan, with a $15.1 million standby letter of credit outstanding and $590.3 million available for borrowing under the Credit Facility.  The weighted average effective interest rate for the Credit Facility as of December 31, 2024 was approximately 4.0%, excluding commitment fees and including the impact of our interest rate swaps.\nTerm Facility\nOur Term Facility provides for $185.0 million in borrowing capacity and matures on December 30, 2026.  Proceeds from the Term Facility were used to pay down the Credit Facility in December 2019, adding borrowing capacity for future share repurchases, acquisitions and growth-oriented working capital expansion.  We pay interest on borrowings under the Term Facility at a variable rate based on one month Term SOFR, plus an applicable margin.  The Term Facility is repaid in quarterly installments of 1.250% of the Term Facility on the last business day of each quarter beginning in the first quarter of 2020 with the final principal repayment due on the maturity date.  We may prepay amounts outstanding under the Term Facility without penalty other than interest breakage costs.  In June 2023, we made a prepayment on the Term Facility of $45.0 million with $32.4 million applied against the remaining quarterly installments and the remainder applied against the amount due at maturity.\nAt December 31, 2024, the Term Facility had an outstanding balance of $109.9 million at a weighted average effective interest rate of 5.6%.  \nReceivables Securitization Facility\nOur two-year accounts receivable securitization facility (the Receivables Facility) offers us a lower-cost form of financing and was recently amended on October 31, 2024. As amended, under this facility, we can borrow up to $375.0 million between April through May and from $210.0 million to $350.0 million during the remaining months of the year.  We pay interest on borrowings under the Receivables Facility at a variable rate based on one month Term SOFR, plus an applicable margin.  The Receivables Facility matures on October 30, 2026. \nThe Receivables Facility provides for the sale of certain of our receivables to a wholly owned subsidiary (the Securitization Subsidiary).  The Securitization Subsidiary transfers variable undivided percentage interests in the receivables and related rights to certain third-party financial institutions in exchange for cash proceeds, limited to the applicable funding capacities.  Upon payment of the receivables by customers, rather than remitting to the financial institutions the amounts collected, we retain such collections as proceeds for the sale of new receivables until payments become due.  \nAt December 31, 2024, there was $174.1 million outstanding under the Receivables Facility at a weighted average effective interest rate of 5.3%, excluding commitment fees.  \n44\nFinancial Covenants\nFinancial covenants of the Credit Facility, Term Facility and Receivables Facility include maintenance of a maximum average total leverage ratio and a minimum fixed charge coverage ratio, which are our most restrictive financial covenants.  As of December 31, 2024, the calculations of these two covenants are detailed below:\n•\nMaximum Average Total Leverage Ratio\n. On the last day of each fiscal quarter, our average total leverage ratio must be less than 3.25 to 1.00.  Average Total Leverage Ratio is the ratio of the sum of (i) Total Non-Revolving Funded Indebtedness as of such date, (ii) the trailing twelve months (TTM) Average Total Revolving Funded Indebtedness and (iii) the TTM Average Accounts Securitization Proceeds divided by TTM EBITDA (as those terms are defined in the Credit Facility).  As of December 31, 2024, our average total leverage ratio equaled 1.42 (compared to 1.39 as of December 31, 2023) and the TTM average total indebtedness amount used in this calculation was $970.1 million.\n•\nMinimum Fixed Charge Coverage Ratio\n. On the last day of each fiscal quarter, our fixed charge ratio must be greater than or equal to 2.25 to 1.00.  Fixed Charge Ratio is the ratio of the TTM EBITDAR divided by TTM Interest Expense paid or payable in cash plus TTM Rental Expense (as those terms are defined in the Credit Facility).  As of December 31, 2024, our fixed charge ratio equaled 5.07 (compared to 5.94 as of December 31, 2023) and TTM Rental Expense was $104.0 million.\nThe Credit Facility and Term Facility limit the declaration and payment of dividends on our common stock to a manner consistent with past practice, provided no default or event of default has occurred and is continuing, or would result from the payment of dividends.  We may declare and pay quarterly dividends so long as (i) the amount per share of such dividends is not greater than the most recently publicly announced dividends per share and (ii) our Average Total Leverage Ratio is less than 3.25 to 1.00 both immediately before and after giving pro forma effect to such dividends. Under the Credit Facility and Term Facility, we may repurchase shares of our common stock provided no default or event of default has occurred and is continuing, or would result from the repurchase of shares, and our maximum average total leverage ratio (determined on a pro forma basis) is less than 3.25 to 1.00.  \nOther covenants include restrictions on our ability to grant liens, incur indebtedness, make investments, merge or consolidate, and sell or transfer assets.  Failure to comply with any of our financial covenants or any other terms of the Credit Facility and the Term Facility could result in higher interest rates on our borrowings or the acceleration of the maturities of our outstanding debt.\nInterest Rate Swaps\nWe utilize interest rate swap contracts and forward-starting interest rate swap contracts to reduce our exposure to fluctuations in variable interest rates for future interest payments on our variable rate borrowings.  Interest expense related to the notional amounts under all swap contracts is based on applicable fixed rates plus the applicable margin on the respective borrowings. \nAs of December 31, 2024, we had two interest rate swap contracts in place and one forward-starting interest rate swap contract, each of which has the effect of converting our exposure to variable interest rates on a portion of our variable rate borrowings to fixed interest rates.  For more information, see Note 5 of “Notes to Consolidated Financial Statements” included in Item 8 of this Form 10-K.\nCompliance and Future Availability\nAs of December 31, 2024, we were in compliance with all covenants and financial ratio requirements under our Credit Facility, our Term Facility and our Receivables Facility.  We believe we will remain in compliance with all covenants and financial ratio requirements throughout 2025.  For additional information regarding our debt arrangements, see Note 5 of “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K.\nFuture Obligations\nWe have certain fixed contractual obligations and commitments that include future estimated payments for general operating purposes.  Changes in our business needs, fluctuating interest rates and other factors may result in actual payments differing from our estimates.  We cannot provide certainty regarding the timing and amounts of these payments.  The following table summarizes our obligations as of December 31, 2024 that are expected to impact liquidity and cash flow in future periods.  We believe we will be able to fund these obligations through our existing cash, cash expected to be generated from operations, borrowings on our facilities and proceeds from any future refinancing transactions.  \n45\n \n \n \nPayments Due by Period\nTotal\nLess than\n1 year\n1-3 years\n3-5 years\nMore than\n5 years\nLong-term debt\n$\n953,111\n \n$\n49,473 \n$\n709,038 \n$\n194,600 \n$\n— \nOperating leases\n365,467\n \n98,746 \n156,104 \n75,305 \n35,312 \nPurchase obligations\n2,652\n \n1,326 \n1,326 \n— \n— \n \n$\n1,321,230\n \n$\n149,545 \n$\n866,468 \n$\n269,905 \n$\n35,312 \nThe significant assumptions used in our determination of amounts presented in the above table are as follows:\n•\nLong-term debt amounts represent only the future principal payments on our debt as of December 31, 2024.  Estimates of interest payable on this debt is separately reflected in the table appearing below.  For additional information regarding our debt arrangements, see Note 5 of our “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K. \n•\nOperating lease amounts include future rental payments for our operating leases.  The amounts presented are consistent with contractual terms and are not expected to differ significantly from actual results under our existing leases.  For additional information regarding our operating leases, see Note 9 of our “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K. \n•\nPurchase obligations include all legally binding contracts such as firm minimum commitments for inventory purchases and software commitments.  We issue inventory purchase orders in the normal course of business, which represent authorizations to purchase that are cancellable by their terms.  We do not consider our cancellable purchase orders to be firm inventory commitments; therefore, they are excluded from the table above. \nFor certain of our future obligations, such as unrecognized tax benefits, uncertainties exist regarding the timing of future payments and the amount by which these potential obligations will increase or decrease over time.  As such, we have excluded unrecognized tax benefits from the table above.  See Note 7 of “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10-K for additional discussion related to our unrecognized tax benefits.  The table also excludes various other liabilities that are not contractual in nature, including contingent liabilities, litigation accruals and contract termination fees.\nThe table below contains estimated interest payments (in thousands) related to our long-term debt obligations presented in the table above.  We calculated estimates of future interest payments based on the December 31, 2024 outstanding debt balances, using the fixed rates under our interest rate swap agreements for the applicable notional amounts and the weighted average effective interest rates as of December 31, 2024 for the remaining outstanding balances not covered by our swap contracts.  To project the estimated interest expense to coincide with the time periods used in the table above, we projected the estimated debt balances for future years based on the scheduled maturity dates of the Credit Facility, the Term Facility and the Receivables Facility.  Our actual interest payments could vary substantially from the amounts projected.\n \n \nEstimated Interest Payments Due by Period\nTotal\nLess than\n1 year\n1-3 years\n3-5 years\nMore than\n5 years\nInterest\n$\n94,266\n \n$\n34,690 \n$\n40,849 \n$\n18,727 \n$\n— \n46\nItem 7A.  Quantitative and Qualitative Disclosures about Market Risk\nWe are exposed to market risks, including interest rate risk and foreign currency risk.  The adverse effects of potential changes in these market risks are discussed below.  The following discussion does not consider the effects of the reduced level of overall economic activity that could exist following such changes.  Further, in the event of changes of such magnitude, we would likely take actions to mitigate our exposure to such changes.\nInterest Rate Risk\nOur earnings are exposed to changes in short-term interest rates because of the variable interest rates on our debt.  However, we have entered into interest rate swap contracts to reduce our exposure to market fluctuations.  For information about our debt arrangements and interest rate swaps, see Note 5 of “Notes to Consolidated Financial Statements,” included in Item 8 of this Form 10‑K.\nIn 2024, there was no interest rate risk related to the notional amounts under our interest rate swap contracts.  The portions of our outstanding balances under the Credit Facility, Term Facility and the Receivables Facility that were not covered by our interest rate swap contracts were subject to variable interest rates.  To calculate the potential impact in 2024 related to interest rate risk, we performed a sensitivity analysis assuming that we borrowed the monthly maximum available amount under the Credit Facility, the maximum amount available under the Receivables Facility and the amount outstanding under our Term Facility.  In this analysis, we assumed that the variable interest rates for the Credit Facility and the Receivables Facility increased by 1.0%.  Based on this calculation, our pretax income would have decreased by approximately $13.5 million and earnings per share would have decreased by approximately $0.26 per diluted share (based on the number of weighted average diluted shares outstanding for the year ended December 31, 2024).  The maximum amount available under the Credit Facility is $1.3 billion and the maximum amount available under the Receivables Facility is $375.0 million.\nFailure of our swap counterparties would result in the loss of any potential benefit to us under our swap agreements.  In this case, we would still be obligated to pay the variable interest payments underlying our debt agreements.  Additionally, failure of our swap counterparties would not eliminate our obligation to continue to make payments under our existing swap agreements if we continue to be in a net pay position.\nCurrency Risk\nChanges in the exchange rates for the functional currencies of our international subsidiaries, as shown in the table below, may positively or negatively impact our sales, operating expenses and earnings.  Historically, we have not hedged our currency exposure and fluctuations in exchange rates have not materially affected our operating results.  While our international operations, including Canada and Mexico, accounted for only 7% of total net sales in 2024, our exposure to currency rate fluctuations could be material in 2025 and future years to the extent that either currency rate changes are significant or that our international operations comprise a larger percentage of our consolidated results. \nFunctional Currencies\nCanada\nCanadian Dollar\nUnited Kingdom\nBritish Pound\nBelgium\nEuro\nCroatia\nEuro\nFrance\nEuro\nGermany\nEuro\nItaly\nEuro\nPortugal\nEuro\nSpain\nEuro\nMexico\nMexican Peso\nAustralia\nAustralian Dollar\n47\nItem 8.  Financial Statements and Supplementary Data\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n49\n \n \nConsolidated Statements of Income\n51\nConsolidated Statements of Comprehensive Income\n52\n \n \nConsolidated Balance Sheets\n53\n \n \nConsolidated Statements of Cash Flows\n54\n \n \nConsolidated Statements of Changes in Stockholders’ Equity\n \n55\n \n \nNotes to Consolidated Financial Statements\n56\n48\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Pool Corporation\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of Pool Corporation (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, changes in stockholders’ equity, and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\n49\nValuation of Goodwill\nDescription of the Matter\nAt December 31, 2024, the Company’s goodwill was $698.9 million, including $401.6 million of goodwill relating to one reporting unit. As discussed in Note 3 of the consolidated financial statements, goodwill is tested for impairment at least annually at the reporting unit level. The Company’s goodwill is assigned to reporting units as of the acquisition date. \nAuditing management’s annual goodwill impairment test for this reporting unit was complex and highly judgmental due to the estimation required to determine the fair value of the reporting unit. In particular, the fair value estimate is sensitive to certain assumptions, such as changes in the weighted average cost of capital, revenue growth rate, operating margin, and terminal growth rate which are affected by expectations about future market or economic conditions.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of controls over the Company’s goodwill impairment review process, including controls over management’s review of the significant assumptions described above. \nTo test the estimated fair value of the Company’s largest reporting unit, we performed audit procedures that included, among others, assessing methodologies and testing the significant assumptions discussed above and the underlying data used by the Company in its analysis. We compared the significant assumptions used by management to current industry and economic trends and other relevant factors, such as historical results. We assessed the historical accuracy of management’s estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of the reporting unit that would result from changes in the assumptions. We also involved a specialist to assist in our evaluation of the valuation methodology applied by the Company and certain significant assumptions used in estimating the fair value of the reporting unit.  In addition, we reviewed the comparison of the Company’s fair value of its largest reporting unit and the fair value of all other reporting units to the Company’s market capitalization.\n/s/ \nErnst & Young LLP\n \nWe have served as the Company’s auditor since 1994.\nNew Orleans, Louisiana\nFebruary 27, 2025\n50\nPOOL CORPORATION\nConsolidated Statements of Income\n(In thousands, except per share data)\n \nYear Ended December 31,\n  \n2024\n2023\n2022\nNet sales\n$\n5,310,953\n \n$\n5,541,595\n \n$\n6,179,727\n \nCost of sales\n3,735,606\n \n3,881,551\n \n4,246,315\n \nGross profit\n1,575,347\n \n1,660,044\n \n1,933,412\n \nSelling and administrative expenses\n958,143\n \n913,477\n \n907,629\n \nOperating income\n617,204\n \n746,567\n \n1,025,783\n \nInterest and other non-operating expenses, net\n50,250\n \n58,431\n \n40,911\n \nIncome before income taxes and equity in earnings\n566,954\n \n688,136\n \n984,872\n \nProvision for income taxes\n132,836\n \n165,084\n \n236,763\n \nEquity in earnings of unconsolidated investments, net\n207\n \n177\n \n353\n \nNet income\n$\n434,325\n \n$\n523,229\n \n$\n748,462\n \nEarnings per share attributable to common stockholders:\n \n \n \nBasic\n$\n11.37\n \n$\n13.45\n \n$\n18.89\n \nDiluted\n$\n11.30\n \n$\n13.35\n \n$\n18.70\n \nWeighted average common shares outstanding:\n \n \n \nBasic\n38,007\n \n38,704\n \n39,409\n \nDiluted\n38,228\n \n38,997\n \n39,806\n \nCash dividends declared per common share\n$\n4.70\n \n$\n4.30\n \n$\n3.80\n \nThe accompanying Notes are an integral part of these Consolidated Financial Statements.\n51\nPOOL CORPORATION\nConsolidated Statements of Comprehensive Income\n(In thousands)\n \nYear Ended December 31,\n  \n2024\n2023\n2022\nNet income\n$\n434,325\n \n$\n523,229\n \n$\n748,462\n \nOther comprehensive (loss) income:\nForeign currency translation adjustments\n(\n16,389\n)\n6,909\n \n(\n10,028\n)\nUnrealized (losses) gains on interest rate swaps, \nnet of the change in taxes of $\n1,285\n, $\n2,074\n and $(\n7,802\n)\n(\n3,857\n)\n(\n6,222\n)\n23,407\n \nTotal other comprehensive (loss) income\n(\n20,246\n)\n687\n \n13,379\n \nComprehensive income\n$\n414,079\n \n$\n523,916\n \n$\n761,841\n \nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\n52\nPOOL CORPORATION\nConsolidated Balance Sheets\n(In thousands, except share data)\n \nDecember 31,\n \n2024\n2023\nAssets\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n77,862\n \n$\n66,540\n \nReceivables, net\n115,835\n \n145,723\n \nReceivables pledged under receivables facility\n199,026\n \n197,187\n \nProduct inventories, net\n1,289,300\n \n1,365,466\n \nPrepaid expenses and other current assets\n47,091\n \n40,444\n \nTotal current assets\n1,729,114\n \n1,815,360\n \nProperty and equipment, net\n251,324\n \n223,929\n \nGoodwill\n698,910\n \n700,078\n \nOther intangible assets, net\n290,732\n \n298,282\n \nEquity interest investments\n1,439\n \n1,305\n \nOperating lease assets\n314,853\n \n305,688\n \nOther assets\n81,812\n \n83,426\n \nTotal assets\n$\n3,368,184\n \n$\n3,428,068\n \nLiabilities and stockholders’ equity\n \n \nCurrent liabilities:\n \n \nAccounts payable\n$\n525,235\n \n$\n508,672\n \nAccrued expenses and other current liabilities\n171,194\n \n134,676\n \nShort-term borrowings and current portion of long-term debt \n49,473\n \n38,203\n \nCurrent operating lease liabilities\n98,284\n \n89,215\n \nTotal current liabilities\n844,186\n \n770,766\n \nDeferred income taxes\n81,408\n \n67,421\n \nLong-term debt, net\n900,883\n \n1,015,117\n \nOther long-term liabilities\n44,959\n \n40,028\n \nNon-current operating lease liabilities\n223,283\n \n221,949\n \nTotal liabilities\n2,094,719\n \n2,115,281\n \nStockholders’ equity:\n \n \nCommon stock, $\n0.001\n par value; \n100,000,000\n shares authorized; \n37,691,942\n shares issued and outstanding at December 31, 2024 and \n38,354,829\n shares issued and outstanding at December 31, 2023\n38\n \n38\n \nAdditional paid-in capital\n638,615\n \n606,177\n \nRetained earnings\n648,476\n \n699,990\n \nAccumulated other comprehensive (loss) income\n(\n13,664\n)\n6,582\n \nTotal stockholders’ equity\n1,273,465\n \n1,312,787\n \nTotal liabilities and stockholders’ equity\n$\n3,368,184\n \n$\n3,428,068\n \nThe accompanying Notes are an integral part of these Consolidated Financial Statements.\n53\nPOOL CORPORATION\nConsolidated Statements of Cash Flows\n(In thousands)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOperating activities\n \n \n \nNet income \n$\n434,325\n \n$\n523,229\n \n$\n748,462\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n \n \nDepreciation\n36,784\n \n31,585\n \n30,381\n \nAmortization\n8,697\n \n8,555\n \n8,644\n \nShare-based compensation\n19,248\n \n19,582\n \n14,879\n \n(Benefit) provision for doubtful accounts receivable, net of write-offs\n(\n3,122\n)\n2,197\n \n3,580\n \nProvision for inventory obsolescence, net of write-offs\n3,048\n \n1,930\n \n5,869\n \nProvision for deferred income taxes\n15,739\n \n10,359\n \n15,169\n \nGains on sales of property and equipment\n(\n1,645\n)\n(\n317\n)\n(\n527\n)\nEquity in earnings of unconsolidated investments, net\n(\n207\n)\n(\n177\n)\n(\n353\n)\nNet losses (gains) on foreign currency transactions\n218\n \n(\n813\n)\n48\n \nGoodwill impairment\n—\n \n550\n \n605\n \nOther\n(\n245\n)\n200\n \n472\n \nChanges in operating assets and liabilities, net of effects of acquisitions:\n \n \n \nReceivables\n29,146\n \n10,108\n \n19,685\n \nProduct inventories\n66,201\n \n231,240\n \n(\n263,567\n)\nPrepaid expenses and other assets\n75,122\n \n57,840\n \n(\n52,815\n)\nAccounts payable\n14,429\n \n96,128\n \n7,597\n \nAccrued expenses and other liabilities\n(\n38,552\n)\n(\n103,967\n)\n(\n53,275\n)\nNet cash provided by operating activities\n659,186\n \n888,229\n \n484,854\n \nInvesting activities\n \n \n \nAcquisition of businesses, net of cash acquired\n(\n4,692\n)\n(\n11,533\n)\n(\n9,264\n)\nPurchases of property and equipment, net of sale proceeds\n(\n59,476\n)\n(\n60,096\n)\n(\n43,619\n)\nOther investments, net\n(\n2,001\n)\n32\n \n2,013\n \nNet cash used in investing activities\n(\n66,169\n)\n(\n71,597\n)\n(\n50,870\n)\nFinancing activities\n \n \n \nProceeds from revolving line of credit\n1,517,800\n \n1,548,618\n \n1,917,173\n \nPayments on revolving line of credit\n(\n1,575,700\n)\n(\n1,815,829\n)\n(\n1,970,388\n)\nProceeds from term loan under credit facility\n—\n \n—\n \n250,000\n \nPayments on term loan under credit facility\n(\n25,000\n)\n(\n12,500\n)\n—\n \nProceeds from asset-backed financing\n727,000\n \n552,500\n \n220,000\n \nPayments on asset-backed financing\n(\n744,600\n)\n(\n560,300\n)\n(\n205,500\n)\nPayments on term facility\n—\n \n(\n47,313\n)\n(\n9,250\n)\nProceeds from short-term borrowings and current portion of long-term debt\n8,873\n \n19,998\n \n28,445\n \nPayments on short-term borrowings and current portion of long-term debt\n(\n10,103\n)\n(\n19,338\n)\n(\n27,675\n)\nPayments of deferred financing costs\n(\n2,077\n)\n(\n52\n)\n(\n170\n)\nPayments of deferred and contingent acquisition consideration\n—\n \n(\n551\n)\n(\n1,374\n)\nProceeds from stock issued under share-based compensation plans\n13,190\n \n10,455\n \n8,934\n \nPayments of cash dividends\n(\n179,633\n)\n(\n167,461\n)\n(\n150,624\n)\nRepurchases of common stock and payments of excise tax\n(\n306,300\n)\n(\n306,359\n)\n(\n471,229\n)\nNet cash used in financing activities\n(\n576,550\n)\n(\n798,132\n)\n(\n411,658\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n5,145\n)\n2,449\n \n(\n1,056\n)\nChange in cash and cash equivalents\n11,322\n \n20,949\n \n21,270\n \nCash and cash equivalents at beginning of year\n66,540\n \n45,591\n \n24,321\n \nCash and cash equivalents at end of year\n$\n77,862\n \n$\n66,540\n \n$\n45,591\n \nThe accompanying Notes are an integral part of these Consolidated Financial Statements.\n54\nPOOL CORPORATION\nConsolidated Statements of Changes in Stockholders’ Equity \n(In thousands)\nCommon Stock\nAdditional\nPaid-In\nRetained \nAccumulated\nOther\nComprehensive\n \nShares\nAmount\nCapital\nEarnings\n(Loss) Income\nTotal\nBalance at December 31, 2021\n40,193\n \n$\n40\n \n$\n551,963\n \n$\n526,874\n \n$\n(\n7,484\n)\n$\n1,071,393\n \nNet income\n—\n \n—\n \n—\n \n748,462\n \n—\n \n748,462\n \nForeign currency translation\n—\n \n—\n \n—\n \n—\n \n(\n10,028\n)\n(\n10,028\n)\nInterest rate swaps, net of the change in taxes of $(\n7,802\n)\n—\n \n—\n \n—\n \n—\n \n23,407\n \n23,407\n \nRepurchases of common stock, net of retirements\n(\n1,234\n)\n(\n1\n)\n—\n \n(\n471,228\n)\n—\n \n(\n471,229\n)\nShare-based compensation\n—\n \n—\n \n14,879\n \n—\n \n—\n \n14,879\n \nIssuance of stock under share-based compensation plans \n110\n \n—\n \n8,934\n \n—\n \n—\n \n8,934\n \nDeclaration of cash dividends\n—\n \n—\n \n—\n \n(\n150,624\n)\n—\n \n(\n150,624\n)\nBalance at December 31, 2022\n39,069\n \n39\n \n575,776\n \n653,484\n \n5,895\n \n1,235,194\n \nNet income\n—\n \n—\n \n—\n \n523,229\n \n—\n \n523,229\n \nForeign currency translation\n—\n \n—\n \n—\n \n—\n \n6,909\n \n6,909\n \nInterest rate swaps, net of the change in taxes of $\n2,074\n—\n \n—\n \n—\n \n—\n \n(\n6,222\n)\n(\n6,222\n)\nRepurchases of common stock, net of retirements\n(\n862\n)\n(\n1\n)\n—\n \n(\n309,262\n)\n—\n \n(\n309,263\n)\nShare-based compensation\n—\n \n—\n \n19,582\n \n—\n \n—\n \n19,582\n \nIssuance of stock under share-based compensation plans\n148\n \n—\n \n10,819\n \n—\n \n—\n \n10,819\n \nDeclaration of cash dividends\n—\n \n—\n \n—\n \n(\n167,461\n)\n—\n \n(\n167,461\n)\nBalance at December 31, 2023\n38,355\n \n38\n \n606,177\n \n699,990\n \n6,582\n \n1,312,787\n \nNet income\n—\n \n—\n \n—\n \n434,325\n \n—\n \n434,325\n \nForeign currency translation\n—\n \n—\n \n—\n \n—\n \n(\n16,389\n)\n(\n16,389\n)\nInterest rate swaps, net of the change in taxes of $\n1,285\n—\n \n—\n \n—\n \n—\n \n(\n3,857\n)\n(\n3,857\n)\nRepurchases of common stock, net of retirements\n(\n843\n)\n—\n \n—\n \n(\n306,206\n)\n—\n \n(\n306,206\n)\nShare-based compensation\n—\n \n—\n \n19,248\n \n—\n \n—\n \n19,248\n \nIssuance of stock under share-based compensation plans\n180\n \n—\n \n13,190\n \n—\n \n—\n \n13,190\n \nDeclaration of cash dividends\n—\n \n—\n \n—\n \n(\n179,633\n)\n—\n \n(\n179,633\n)\nBalance at December 31, 2024\n37,692\n \n$\n38\n \n$\n638,615\n \n$\n648,476\n \n$\n(\n13,664\n)\n$\n1,273,465\n \nThe accompanying Notes are an integral part of these Consolidated Financial Statements.\n55\nPOOL CORPORATION\nNotes to Consolidated Financial Statements\n \nNote 1 - \nOrganization and Summary of Significant Accounting Policies\nDescription of Business\nAs of December 31, 2024, Pool Corporation and our subsidiaries (the \nCompany\n, which may also be referred to as \nwe, us\n or \nour\n) operated \n448\n sales centers in North America, Europe and Australia from which we sell swimming pool supplies, equipment and related leisure products, irrigation and landscape maintenance products and hardscape, tile and stone products to pool builders, retail stores, service companies, landscape contractors and others.  We distribute products through \nfive\n networks: SCP Distributors (SCP), Superior Pool Products (Superior), Horizon Distributors (Horizon), National Pool Tile (NPT) and Sun Wholesale Supply (Sun Wholesale). \nBasis of Presentation and Principles of Consolidation\nWe prepared the Consolidated Financial Statements following U.S. generally accepted accounting principles (GAAP) and the requirements of the Securities and Exchange Commission (SEC).  The financial statements include all normal and recurring adjustments that are necessary for a fair presentation of our financial position and operating results.  The Consolidated Financial Statements include the accounts of Pool Corporation and our subsidiaries.  All of our subsidiaries are wholly owned.  All significant intercompany accounts and intercompany transactions have been eliminated.\nUse of Estimates\nTo prepare financial statements that conform to GAAP, we make estimates and assumptions that affect the amounts reported in our financial statements and accompanying notes.  Our most significant estimates relate to the allowance for doubtful accounts, inventory obsolescence reserves, vendor programs, income taxes, performance-based compensation accruals and goodwill impairment evaluations.  We continually review our estimates and make adjustments as necessary, but actual results could be significantly different from what we expected when we made these estimates.\nNewly Adopted Accounting Pronouncements\nIn November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07, \nSegment Reporting (Topic 280) - Improvements to Reportable Segment Disclosures\n, which intends to improve reportable segment disclosures by requiring enhanced disclosures about significant segment expenses, enhance interim disclosure requirements, refine situations in which an entity can disclose multiple segment measures of profit or loss and provide advanced segment disclosure requirements for entities with a single reportable segment, as well as other disclosure requirements.  We adopted ASU 2023-07 for the year ended December 31, 2024, and have applied the guidance retrospectively for all periods presented within the notes to the consolidated financial statements in this Form 10-K.  The adoption of this ASU only impacted our disclosures.  For additional information regarding segment information, see Note 12.\nSeasonality and Weather\nOur business is seasonal, and weather is one of the principal external factors affecting our business.  In general, sales and net income are highest during the second and third quarters, which represent the peak months of swimming pool use, pool and irrigation installation and remodeling and repair activities.  Sales are lower during the first and fourth quarters.\nRevenue Recognition\nWe recognize a sale when a customer obtains control of the product, and we record the amount that reflects the consideration we expect to receive in exchange for such product.  We recognize a sale when a customer picks up product at any sales center, when we deliver product to their premises or job sites via our trucks or when we present the product to a third-party carrier.  For bill and hold sales, we determine when the customer obtains control of the product on a case-by-case basis to determine the amount of revenue to recognize each period. \nWe consider our distribution of products to represent one reportable revenue stream.  Our products are similar in nature, and our revenue recognition policy is the same across our distribution networks.  Our customers share similar characteristics and generally purchase products across all categories.  We recognize revenue when our customers take control of our products.  We include shipping and handling fees billed to customers as freight out income within net sales.  \n56\nWe measure revenue as the amount of consideration we expect to receive in exchange for transferring our products.  Consideration may vary due to volume incentives and expected customer returns.  We offer volume incentives to some of our customers and account for these incentives as a reduction of sales.  We estimate the amount of volume incentives earned based on our estimate of cumulative sales for the fiscal year relative to our customers’ progress toward achieving minimum purchase requirements.  We record customer returns, including those associated with customer early buy programs, as a reduction of sales.  Based on available information related to our customers’ returns, we record an allowance for estimated returns, which historically has not been material.  We regularly review our marketing programs, coupons and customary business practices to determine if any variable consideration exists.  Other items that we record as reductions to sales include cash discounts, pricing adjustments and credit card fees related to customer payments.  \nThe majority of our sales transactions do not contain additional performance obligations after delivery; therefore, we do not have multiple performance obligations for which to allocate the transaction price.  We recognize shipping and handling costs associated with outbound freight in Selling and administrative expenses.  \nWe report sales net of tax amounts that we collect from our customers and remit to governmental authorities.  These tax amounts may include, but are not limited to, sales, use, value-added and some excise taxes.\nVendor Programs\nMany of our arrangements with our vendors provide for us to receive specified amounts of consideration when we achieve any of a number of measures.  These measures are generally related to the volume level of purchases from our vendors, or our net cost of products sold, and may include negotiated pricing arrangements.  We account for vendor programs as a reduction of the prices of the vendors’ products and as a reduction of inventory until we sell the products, at which time such considerations are recognized as a reduction of Cost of sales on our Consolidated Statements of Income.\nThroughout the year, we estimate the amount earned based on our expectation of total purchases for the fiscal year relative to the purchase levels that mark our progress toward earning each program.  We accrue vendor benefits on a monthly basis using these estimates, provided that we determine they are probable and reasonably estimable.  We continually revise these estimates to reflect actual credits earned based on actual purchase levels and trends related to sales and purchasing mix.  When we make adjustments to our estimates, we determine whether any portion of the adjustment impacts the amount of vendor credits that are deferred in inventory.  We recognize changes in our estimates as a cumulative catch-up adjustment to the amounts recognized to date in our Consolidated Financial Statements.\nShipping and Handling Costs\nWe record shipping and handling costs associated with inbound freight as cost of sales.  \nThe table below presents shipping and handling costs associated with outbound freight, which we include in Selling and administrative expenses (in thousands):\n2024\n2023\n2022\n$\n90,268\n \n$\n84,932\n \n$\n89,002\n \nShare-Based Compensation\nWe record share-based compensation for stock options and other share-based awards based on the estimated fair value as measured on the grant date.  For stock option awards, we use a Black-Scholes model for estimating the grant date fair value.  For additional discussion of share-based compensation, see Note 6.\nAdvertising Costs\nWe expense advertising costs when incurred.  The table below presents advertising expense for the past three years (in thousands):\n2024\n2023\n2022\n$\n25,209\n \n$\n28,532\n \n$\n28,778\n \n57\nIncome Taxes\nWe reduce federal and state income taxes payable by the tax benefits associated with the exercise of nonqualified stock options and the lapse of restrictions on restricted stock awards.  To the extent realized tax deductions exceed the amount of previously recognized deferred tax benefits related to share-based compensation, we record an excess tax benefit.  We record all excess tax benefits as a component of income tax benefit or expense in the income statement in the period in which stock options are exercised or restrictions on stock awards lapse. \nWe record Global Intangible Low Tax Income (GILTI) on foreign earnings as period costs if and when incurred, although we have not realized any impacts since the U.S. first imposed taxes on GILTI in December 2017. \nFor additional information regarding income taxes, see Note 7.\nEquity Method Investments\nWe account for our \n50\n% investment in Northpark Corporate Center, LLC (NCC) using the equity method of accounting.  Accordingly, we report our share of income or loss based on our ownership interest in this investment.\nEarnings Per Share\nWe calculate basic and diluted earnings per share using the two-class method.  Earnings per share under the two-class method is calculated using net income attributable to common stockholders, which is net income reduced by earnings allocated to participating securities.  Our participating securities include share-based payment awards that contain a non-forfeitable right to receive dividends and are considered to participate in undistributed earnings with common shareholders.\nDiluted EPS reflects the dilutive effects of potentially dilutive securities, which include in-the-money outstanding stock options and shares to be purchased under our employee stock purchase plan.  Using the treasury stock method, the effect of dilutive securities includes these additional shares of common stock that would have been outstanding based on the assumption that these potentially dilutive securities had been issued.  For additional discussion of earnings per share, see Note 8.\nForeign Currency\nThe functional currency of each of our foreign subsidiaries is its applicable local currency.  We translate our foreign subsidiary financial statements into U.S. dollars based on published exchange rates.  We include these translation adjustments as a component of Accumulated other comprehensive (loss) income on the Consolidated Balance Sheets.  We include realized transaction gains and losses that arise from exchange rate fluctuations in Interest and other non-operating expenses, net on the Consolidated Statements of Income.  We realized a net foreign currency transaction loss of $\n0.2\n million in 2024, gain of $\n0.8\n million in 2023 and loss of $\n0.1\n million in 2022.\n \nFair Value Measurements \nRecurring Fair Value Measurements \nOur assets and liabilities that are measured at fair value on a recurring basis include the unrealized gains or losses on our interest rate swap contracts and our deferred compensation plan asset and liability.  The three levels of the fair value hierarchy under the accounting guidance are described below:\nLevel 1    Inputs to the valuation methodology are unadjusted quoted prices for identical assets or liabilities in active markets.\nLevel 2    Inputs to the valuation methodology include:\n•\nquoted prices for similar assets or liabilities in active markets;\n•\nquoted prices for identical or similar assets or liabilities in inactive markets;\n•\ninputs other than quoted prices that are observable for the asset or liability; or\n•\ninputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3    Inputs to the valuation methodology are unobservable and significant to the fair value measurement.\n58\n \nThe table below presents our assets and liabilities measured and recorded at fair value on a recurring basis (in thousands): \n \nFair Value at December 31,\nInput Level\nClassification\n2024\n2023\nAssets\n     Unrealized gains on interest rate swaps\nLevel 2\nPrepaid expenses and other current assets\n$\n734\n \n$\n—\n \n     Unrealized gains on interest rate swaps\nLevel 2\nOther assets\n19,876\n \n25,752\n \n     Deferred compensation plan asset\nLevel 1\nOther assets\n18,018\n \n15,347\n \nLiabilities\n     Deferred compensation plan liability\nLevel 1\nOther long-term liabilities\n$\n18,018\n \n$\n15,347\n \nWe use significant other observable market data or assumptions (Level 2 inputs) in determining the fair value of our interest rate swaps and forward-starting interest rate swap contracts that we believe market participants would use in pricing similar assets or liabilities, including assumptions about counterparty risk.  Our fair value estimates reflect an income approach based on the terms of the interest rate swap contracts and inputs corroborated by observable market data including interest rate curves.\nOur deferred compensation plan asset represents investments in securities (primarily mutual funds) traded in an active market (Level 1 inputs) held for the benefit of certain employees as part our deferred compensation plan.  We record an equal and offsetting deferred compensation plan liability, which represents our obligation to participating employees.  Changes in the fair value of the plan asset and liability are reflected in Selling and administrative expenses in the Consolidated Statements of Income.  For additional discussion of our nonqualified deferred compensation plan, see Note 11. \nThe carrying values of cash, receivables, accounts payable and accrued liabilities approximate fair value due to the short maturity of those instruments.  The carrying value of long-term debt approximates fair value.  Our determination of the estimated fair value reflects a discounted cash flow model using our estimates, including assumptions related to borrowing rates (Level 3 inputs).\nNonrecurring Fair Value Measurements \nIn addition to our assets and liabilities that we measure at fair value on a recurring basis, our assets and liabilities are also subject to nonrecurring fair value measurements.  Certain of our assets are recorded at fair value on a nonrecurring basis, primarily assets acquired in a business combination or those subject to impairment charges.  For additional discussion of goodwill and intangible assets and impairment, see Note 3.\n \nDerivatives and Hedging Activities\nAt inception, we formally designate and document our interest rate swap contracts that qualify for hedge accounting as cash flow hedges of interest payments on variable rate borrowings.  We formally assess, both at inception and at least quarterly, whether the financial instruments used in hedging transactions are effective at offsetting changes in cash flows of the related underlying exposure.  To the extent our derivatives are effective in offsetting the variability of the hedged cash flows, we record the changes in the estimated fair value of our interest rate swap contracts to Accumulated other comprehensive (loss) income on the Consolidated Balance Sheets.  \nOur interest rate swap contracts and forward-starting interest rate swap contracts are subject to master netting arrangements.  According to our accounting policy, we do not offset the fair values of assets with the fair values of liabilities related to these contracts.\nWe recognize any differences between the variable interest rate in effect and the fixed interest rate per our swap contracts as an adjustment to interest expense over the life of the swaps.    \nFor our interest rate swap contracts currently in effect, a portion of the change in the estimated fair value between periods relates to future interest expense.  Recognition of the change in fair value between periods attributable to accrued interest is reclassified from Accumulated other comprehensive (loss) income to Interest and other non-operating expenses, net on the Consolidated Statements of Income.  These amounts were not material in any period presented.  For additional discussion of our interest rate swaps, see Note 5.\n \n59\nCash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\nCredit Risk and Allowance for Doubtful Accounts\nWe record trade receivables at the invoiced amounts less an allowance for doubtful accounts for estimated losses we may incur if customers do not pay.  We perform periodic credit evaluations of our customers, and we typically do not require collateral.  Consistent with industry practices, we generally require payment from our North American customers within 30 days, except for sales under early buy programs for which we provide extended payment terms to qualified customers.\nManagement estimates future losses based on historical bad debts, customer receivable balances, age of customer receivable balances, customers’ financial conditions and current and forecasted economic trends, including certain trends in the housing market, the availability of consumer credit and general economic conditions (as commonly measured by Gross Domestic Product or GDP).  We monitor housing market trends through review of the House Price Index as published by the Federal Housing Finance Agency, which measures the movement of single-family house prices.  At the end of each quarter, we perform a reserve analysis of all accounts with balances greater than $\n20,000\n that are more than \n60\n days past due.  During the year, we write off account balances when we have exhausted reasonable collection efforts and determined that the likelihood of collection is remote.  These write-offs are charged against our allowance for doubtful accounts.\nThe following table summarizes the changes in our allowance for doubtful accounts for the past three years (in thousands):\n \n2024\n2023\n2022\nBalance at beginning of year\n$\n11,718\n \n$\n9,522\n \n$\n5,942\n \nBad debt expense\n4,187\n \n7,526\n \n7,449\n \nWrite-offs, net of recoveries\n(\n7,312\n)\n(\n5,330\n)\n(\n3,869\n)\nBalance at end of year\n$\n8,593\n \n$\n11,718\n \n$\n9,522\n \nProduct Inventories and Reserve for Inventory Obsolescence\nProduct inventories consist primarily of goods we purchase from manufacturers to sell to our customers.  We record inventory at the lower of cost, using the moving average cost method, or net realizable value.  We establish our reserve for inventory obsolescence based on inventory with lower sales velocity and inventory with no sales for the past \n12\n months, which we believe represent some exposure to inventory obsolescence.  The reserve is intended to reflect the net realizable value of inventory that we may not be able to sell at a profit.\nIn evaluating the adequacy of our reserve for inventory obsolescence, we consider a combination of factors including:\n•\nthe level of inventory in relation to historical sales by product, including inventory usage based on product sales at both the sales center and on a company-wide basis;\n•\nchanges in customer preferences or regulatory requirements;\n•\nseasonal fluctuations in inventory levels;\n•\ngeographic location; and\n•\nsuperseded products and new product offerings.\nWe periodically adjust our reserve for inventory obsolescence as changes occur in the above-identified factors.\nThe following table summarizes the changes in our reserve for inventory obsolescence for the past three years (in thousands):\n \n2024\n2023\n2022\nBalance at beginning of year\n$\n23,464\n \n$\n21,208\n \n$\n15,196\n \nProvision for inventory write-downs\n10,484\n \n8,483\n \n11,989\n \nDeduction for inventory write-offs\n(\n7,286\n)\n(\n6,227\n)\n(\n5,977\n)\nBalance at end of year\n$\n26,662\n \n$\n23,464\n \n$\n21,208\n \n60\nProperty and Equipment\nProperty and equipment are stated at cost.  \nWe depreciate property and equipment on a straight-line basis over the following estimated useful lives:\nBuildings\n40\n years\nLeasehold improvements \n(1)\n1\n - \n10\n years\nAutos and trucks\n3\n - \n6\n years\nMachinery and equipment\n3\n - \n15\n years\nComputer equipment\n3\n - \n7\n years\nFurniture and fixtures\n5\n - \n10\n years\n(1)\nFor substantial improvements made near the end of a lease term where we are reasonably certain the lease will be renewed, we amortize the leasehold improvement over the remaining life of the lease including the expected renewal period.\nThe table below presents depreciation expense for the past three years (in thousands):\n2024\n2023\n2022\n$\n36,784\n \n$\n31,585\n \n$\n30,381\n \nAcquisitions\nWe use the acquisition method of accounting and recognize assets acquired and liabilities assumed at fair value as of the acquisition date.  Any contingent assets acquired, and contingent liabilities assumed are also recognized at fair value if we can reasonably estimate fair value during the measurement period (which cannot exceed one year from the acquisition date).  We re-measure any contingent liabilities at fair value in each subsequent reporting period.  We expense all acquisition-related costs as incurred, including any restructuring costs associated with a business combination.\nAny excess of the purchase price over the estimated fair values of the identifiable net assets acquired is recorded as goodwill. Significant judgment is often required in estimating the fair value of assets acquired, particularly intangible assets.  Our fair value estimates are based on available historical information and on expectations and assumptions about the future, considering the perspective of market participants.  Unanticipated market or macroeconomic events and circumstances may occur, which could affect the underlying estimates and assumptions. \nIf our initial acquisition accounting is incomplete by the end of the reporting period in which a business combination occurs, we report provisional amounts for incomplete items.  Once we obtain information required to finalize the accounting for incomplete items, we adjust the provisional amounts recognized.  We make adjustments to these provisional amounts during the measurement period.\nFor all acquisitions, we include the results of operations in our Consolidated Financial Statements as of the acquisition date.  For additional discussion of acquisitions, see Note 2.\nGoodwill and Other Intangible Assets\nGoodwill represents the excess of the amount we paid to acquire a company over the estimated fair value of tangible assets and identifiable intangible assets acquired less liabilities assumed.  We test goodwill and other indefinite-lived intangible assets for impairment annually as of October 1st and at any other time when impairment indicators exist.\nWe have the option of first analyzing qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount.  When a qualitative goodwill test is performed, we analyze factors to determine whether it is more likely than not that the fair value of a reporting unit is less than the carrying amount as a basis for determining whether it is necessary to perform a quantitative goodwill impairment test.  The evaluation of qualitative factors includes an assessment of relevant facts, events and circumstances including but not limited to: macroeconomic conditions, industry and market conditions, and the current and forecasted financial performance of the reporting unit.  In combination with our qualitative test, we also estimate the fair value of our reporting units by projecting company-wide future cash flows using management’s assumptions for sales growth rates, operating margins and discount rates.  Estimated earnings multiples are then used to estimate the fair value of each reporting unit.  \n61\nTo the extent our qualitative test indicates it is more likely than not that the fair value of a reporting unit is less than the carrying amount or for a reporting unit where we only perform a quantitative test, we perform a quantitative test using a discounted cash flow analysis at the reporting unit level to further evaluate our initial fair value estimate.  If the carrying value of the reporting unit exceeds the fair value, we record a goodwill impairment charge for the difference, up to the carrying value of the goodwill.  We recognize any impairment loss in operating income.  The assumptions used in our impairment test are considered unobservable inputs (Level 3 inputs as defined in the accounting guidance).  Since we define an operating segment as an individual sales center and we do not have operations below the sales center level, our reporting unit is an individual sales center.  For additional discussion of goodwill and other intangible assets, see Note 3.\nReceivables Securitization Facility\nOur accounts receivable securitization facility (the Receivables Facility) provides for the sale of certain of our receivables to a wholly owned subsidiary (the Securitization Subsidiary).  The Securitization Subsidiary transfers variable undivided percentage interests in the receivables and related rights to certain third-party financial institutions in exchange for cash proceeds, limited to the applicable funding capacities.  \nWe account for the sale of the receivable interests as a secured borrowing on our Consolidated Balance Sheets.  The receivables subject to the agreement collateralize the cash proceeds received from the third-party financial institutions.  We classify the entire outstanding balance as Long-term debt on our Consolidated Balance Sheets as we intend and have the ability to refinance the obligations on a long-term basis.  We present the receivables that collateralize the cash proceeds separately as Receivables pledged under receivables facility on our Consolidated Balance Sheets.  For additional discussion of the Receivables Facility, see Note 5.\nSelf-Insurance\nWe are self-insured for employee health benefits, workers’ compensation coverage, property and casualty, and automobile insurance.  To limit our exposure, we also maintain excess and aggregate liability coverage.  We establish self-insurance reserves based on estimates of claims incurred but not reported and information that we obtain from third-party service providers regarding known claims.  Our management reviews these reserves based on consideration of various factors, including but not limited to the age of existing claims, estimated settlement amounts and other historical claims data.\nAccumulated Other Comprehensive (Loss) Income \nThe table below presents the components of our Accumulated other comprehensive (loss) income balance (in thousands):\n December 31,\n2024\n2023\nForeign currency translation adjustments\n$\n(\n29,088\n)\n$\n(\n12,699\n)\nUnrealized gains on interest rate swaps, net of tax\n15,424\n \n19,281\n \nAccumulated other comprehensive (loss) income\n$\n(\n13,664\n)\n$\n6,582\n \nRetained Earnings \nWe account for the retirement of share repurchases as a decrease to our Retained earnings on our Consolidated Balance Sheets.  As of December 31, 2024, the retained earnings reflects cumulative net income, the cumulative impact of adjustments for changes in accounting pronouncements, treasury share retirements since the inception of our share repurchase programs of $\n2.7\n billion and cumulative dividends of $\n1.3\n billion.\n62\nSupplemental Cash Flow Information\nThe following table presents supplemental disclosures to the accompanying Consolidated Statements of Cash Flows (in thousands):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCash paid during the year for:\n \n \n \nInterest \n$\n51,046\n \n$\n58,131\n \n$\n39,759\n \nIncome taxes, net of refunds\n42,990\n \n153,157\n \n314,714\n \nIn 2024, cash paid for income taxes was lower due to a $\n68.5\n million deferral of our third and fourth quarter estimated tax payments, subsequently paid in February 2025, as allowed for companies impacted by Hurricane Francine.\n \nRecent Accounting Pronouncements Pending Adoption\nThe following table summarizes the remaining recent accounting pronouncements that we plan to adopt in future periods:\nStandard\nDescription\nEffective Date\nEffect on Financial Statements and Other Significant Matters\nASU 2024-03, \nIncome Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement-Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n, which introduces new disclosure requirements for public business entities to provide more detailed information about specific natural expense categories within their income statements.\nFor annual periods beginning after December 15, 2026, and interim periods within those annual periods beginning after December 15, 2027. The ASU may be adopted on a prospective or retrospective basis with early adoption permitted.\nWe are currently evaluating the effect this standard will have on our disclosures.\nASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which will require enhancements and further transparency for decision usefulness to various income tax disclosures, most notably the tax rate reconciliation and income taxes paid. \nAnnual periods beginning after December 15, 2024 on a prospective basis and retrospective application is permitted. Early adoption is also permitted. \nWe expect that the adoption of this standard will expand our disclosures and do not expect the adoption of this standard will have a material impact on our consolidated financial statements.\nASU 2023-06, \nDisclosure Improvements: Codification Amendments in Response to the SEC’s Disclosure Update and Simplification Initiative\nIn October 2023, the FASB issued ASU 2023-06, \nDisclosure Improvements: Codification Amendments in Response to the SEC’s Disclosure Update and Simplification Initiative\n, which will impact various disclosure areas, including the statement of cash flows, accounting changes and error corrections, earnings per share, debt, equity, derivatives, and transfers of financial assets. \nThe amendments in ASU 2023-06 will be effective on the date the related disclosures are removed from Regulation S-X or Regulation S-K by the SEC and will no longer be effective if the SEC has not removed the applicable disclosure requirement by June 30, 2027. Early adoption is prohibited. \nWe do not expect the adoption of this standard to have a material impact on our consolidated financial statements since we are already subject to the requirements under Regulation S-X and Regulation S-K.\n63\nNote 2 - \nAcquisitions\n2024 Acquisitions\nIn May 2024, we acquired the distribution assets of Swimline Distributors, Inc., a wholesale distributor of swimming pool products and supplies, adding \none\n location in Georgia.\nIn January 2024, we acquired the distribution assets of Shoreline Pool Distribution, a wholesale distributor of swimming pool products and supplies, adding \none\n location in Mississippi.\n2023 Acquisitions\nIn December 2023, we acquired the distribution assets of A.C. Solucoes para Piscinas, Lda., a wholesale distributor of swimming pool equipment, chemicals and supplies, adding \none\n location in Braga, Portugal. \nIn June 2023, we acquired the distribution assets of Pioneer Pool Products, Inc., a wholesale distributor of swimming pool equipment, chemicals and supplies, adding \none\n location in Alabama. \nIn May 2023, we acquired the distribution assets of Recreation Supply Company, a wholesale distributor of commercial swimming pool products, adding \none\n location in North Dakota.\nIn March 2023, we acquired the distribution assets of Pro-Water Irrigation & Landscape Supply, Inc., a wholesale distributor of irrigation and landscape supply products, adding \ntwo\n locations in Arizona. \n2022 Acquisitions\nIn April 2022, we acquired the distribution assets of Tri-State Pool Distributors, a wholesale distributor of swimming pool equipment, chemicals and supplies, adding \none\n location in West Virginia.\nWe have completed our acquisition accounting for all acquisitions discussed above, subject to adjustments for standard holdback provisions per the terms of the purchase agreements, which are not material.\n \n64\nNote 3 - \nGoodwill and Other Intangible Assets \nThe table below presents changes in the carrying amount of goodwill and our accumulated impairment losses (in thousands):\nGoodwill (gross) at December 31, 2022\n$\n705,987\n \nAcquired goodwill\n8,137\n \nForeign currency translation and other adjustments\n498\n \nGoodwill (gross) at December 31, 2023\n714,622\n \nAccumulated impairment losses at December 31, 2022\n(\n13,994\n)\nGoodwill impairment\n(\n550\n)\nAccumulated impairment losses at December 31, 2023\n(\n14,544\n)\nGoodwill (net) at December 31, 2023\n$\n700,078\n \nGoodwill (gross) at December 31, 2023\n$\n714,622\n \nAcquired goodwill\n2,170\n \nForeign currency translation and other adjustments\n (1)\n(\n3,338\n)\nGoodwill (gross) at December 31, 2024\n713,454\n \nAccumulated impairment losses at December 31, 2023\n(\n14,544\n)\nGoodwill impairment\n—\n \nAccumulated impairment losses at December 31, 2024\n(\n14,544\n)\nGoodwill (net) at December 31, 2024\n$\n698,910\n \n(1)   \nIncludes a $\n2.0\n million reduction of goodwill for our\n \nPorpoise Pool & Patio reporting unit for the sale of two Pinch A Penny retail stores in 2024.\nThe determination of our reporting units’ goodwill and intangibles fair values includes numerous assumptions that are subject to various risks and uncertainties when performing a quantitative test.  The principal assumptions, all of which are considered Level 3 inputs, used in our cash flow analyses consisted of changes in market conditions, forecasted future operating results (including sales growth rates and operating margins) and discount rates (including our weighted-average cost of capital).\nIn October 2024, we performed our annual goodwill impairment test and did not record any goodwill impairment at the reporting unit level.  As of October 1, 2024, we had \n251\n reporting units with allocated goodwill balances.   Our most significant goodwill balance of $\n401.6\n million was related to our Porpoise Pool & Patio reporting unit and the next largest goodwill balance for a reporting unit was $\n12.1\n million.  The average goodwill balance per reporting unit was $\n2.8\n million.  \nIn September 2023, we recorded goodwill impairment of $\n0.6\n million, primarily related to one of our Horizon reporting units in Texas that we previously identified as being most at risk of goodwill impairment.  We had been monitoring this location’s results, which came in below expectations at the end of the 2023 season.  We performed an interim goodwill impairment analysis, which included a discounted cash flow analysis, and determined that the estimated fair value of the reporting unit no longer exceeded its carrying value.  In October 2023, we performed our annual goodwill impairment test and did not record any additional goodwill impairment at the reporting unit level.\nWe record goodwill and intangibles impairment in Selling and administrative expenses on our Consolidated Statements of Income. \n65\nOther intangible assets consisted of the following (in thousands):\n \nDecember 31,\nWeighted Average Useful Life\n \n2024\n2023\nIntangibles Gross\nAccumulated Amortization\nIntangibles Net\nIntangibles Gross\nAccumulated Amortization\nIntangibles Net\nHorizon tradename\n$\n8,400\n \n$\n—\n \n$\n8,400\n \n$\n8,400\n \n$\n— \n$\n8,400\n \nIndefinite\nPinch A Penny brand name\n169,000\n \n—\n \n169,000\n \n169,000\n \n— \n169,000\n \nIndefinite\nNational Pool Tile (NPT) tradename\n1,500\n \n(\n1,262\n)\n238\n \n1,500\n \n(\n1,187\n)\n313\n \n20\nNon-compete agreements\n6,419\n \n(\n4,394\n)\n2,025\n \n6,206\n \n(\n3,258\n)\n2,948\n \n4.65\nCustomer relationships\n109,000\n \n(\n16,573\n)\n92,427\n \n109,000\n \n(\n11,125\n)\n97,875\n \n20\nFranchise agreements\n22,000\n \n(\n3,358\n)\n18,642\n \n22,000\n \n(\n2,254\n)\n19,746\n \n20\nTotal other intangibles\n$\n316,319\n \n$\n(\n25,587\n)\n$\n290,732\n \n$\n316,106\n \n$\n(\n17,824\n)\n$\n298,282\n \nThe Horizon tradename and Pinch A Penny brand name each have an indefinite useful life and are not subject to amortization.  We evaluate the useful life of these intangible assets and test for impairment annually.  The NPT tradename, our non-compete agreements, customer relationships and franchise agreements have finite useful lives, and we amortize the estimated fair value of these agreements using the straight-line method over their respective useful lives.  We have not identified any indicators of impairment related to these assets.  The useful lives for our non-compete agreements are based on their contractual terms. \nOther intangible amortization expense was $\n7.8\n million in 2024, $\n7.8\n million in 2023 and $\n7.8\n million in 2022.\nThe table below presents estimated amortization expense for other intangible assets for the next five years (in thousands):\n2025\n$\n7,724\n \n2026\n7,203\n \n2027\n6,850\n \n2028\n6,678\n \n2029\n6,567\n \n66\nNote 4 - \nDetails of Certain Balance Sheet Accounts\nThe table below presents additional information regarding certain balance sheet accounts (in thousands):\n \n \nDecember 31,\n \n2024\n2023\nReceivables, net:\n \n \nTrade accounts\n$\n31,472\n \n$\n60,966\n \nVendor programs\n90,199\n \n92,072\n \nOther, net\n2,757\n \n4,403\n \nTotal receivables\n124,428\n \n157,441\n \nLess: Allowance for doubtful accounts\n(\n8,593\n)\n(\n11,718\n)\nReceivables, net\n$\n115,835\n \n$\n145,723\n \nPrepaid expenses and other current assets:\n \n \nPrepaid expenses\n$\n42,904\n \n$\n31,175\n \nOther current assets\n4,187\n \n9,269\n \nPrepaid expenses and other current assets\n$\n47,091\n \n$\n40,444\n \nProperty and equipment, net:\n \n \nLand\n$\n24,474\n \n$\n24,077\n \nBuildings\n58,744\n \n56,181\n \nLeasehold improvements\n90,337\n \n81,114\n \nAutos and trucks\n144,556\n \n127,381\n \nMachinery and equipment\n126,606\n \n109,532\n \nComputer equipment\n36,707\n \n34,192\n \nFurniture and fixtures\n10,042\n \n9,935\n \nFixed assets in progress\n15,012\n \n14,653\n \nTotal property and equipment\n506,478\n \n457,065\n \nLess: Accumulated depreciation\n(\n255,154\n)\n(\n233,136\n)\nProperty and equipment, net\n$\n251,324\n \n$\n223,929\n \nAccrued expenses and other current liabilities:\n \n \nSalaries and payroll deductions\n$\n18,956\n \n$\n23,378\n \nPerformance-based compensation\n18,312\n \n30,346\n \nTaxes payable\n87,848\n \n21,209\n \nOther current liabilities\n46,078\n \n59,743\n \nAccrued expenses and other current liabilities\n$\n171,194\n \n$\n134,676\n \n67\nNote 5 - \nDebt\nThe table below presents the components of our debt (in thousands):\n \nDecember 31,\n \n2024\n2023\nVariable rate debt\nCurrent portion of long-term debt:\nAustralian credit facility\n$\n11,973\n \n$\n13,203\n \nCurrent portion of term loans under credit facility\n37,500\n \n25,000\n \nShort-term borrowings and current portion of long-term debt\n49,473\n \n38,203\n \nLong-term portion:\n \n \nRevolving credit facility \n194,600\n \n252,500\n \nTerm loans under credit facility\n425,000\n \n462,500\n \nTerm facility\n109,937\n \n109,937\n \nReceivables securitization facility \n174,100\n \n191,700\n \nLess:  financing costs, net\n2,754\n \n1,520\n \nLong-term debt, net\n900,883\n \n1,015,117\n \nTotal debt \n$\n950,356\n \n$\n1,053,320\n \nCredit Facility\nOn September 30, 2024, we entered into the Third Amended and Restated Credit Agreement (the “Amended Agreement”) by and among Pool Corporation, as U.S. Borrower, SCP Distributors Canada Inc., as Canadian Borrower, SCP International, Inc., as Euro Borrower, Wells Fargo Bank, National Association, as Administrative Agent, and certain other lenders party thereto.  The Amended Agreement amends and restates the terms of the Company’s predecessor revolving credit facility principally by increasing its borrowing capacity from $\n750.0\n million to $\n800.0\n million and extending its maturity date from September 25, 2026 to September 30, 2029.  \nOur Credit Facility provides for $\n1.3\n billion in borrowing capacity, consisting of a $\n800.0\n million revolving credit facility and a $\n500.0\n million term loan facility.  The Credit Facility also includes sublimits for the issuance of swingline loans and standby letters of credit.\nOur term loans under the credit facility require quarterly amortization payments beginning in September 2023 aggregating to \n20\n% of the original principal amount of the loan during the third, fourth and fifth years of the loan, with all remaining principal due on September 25, 2026.  All other terms of these term loans are substantially similar to those governing revolving credit loans under the Credit Agreement.  \nAll obligations under the Credit Agreement are guaranteed on an unsecured basis by substantially all of our existing and future domestic subsidiaries.  The Credit Agreement also contains various customary affirmative and negative covenants and events of default.  The occurrence of any of these events of default would permit the lenders to, among other things, require immediate payment of all amounts outstanding under the Credit Agreement.\nAt December 31, 2024, there was $\n657.1\n million outstanding, including a $\n462.5\n million term loan, $\n15.1\n million in standby letter of credits outstanding, and $\n590.3\n million available for borrowing under the Credit Facility.  The weighted average effective interest rate for the Credit Facility as of December 31, 2024 was approximately \n4.0\n%, excluding commitment fees and including the impact of our interest rate swaps.\nRevolving and term borrowings under the Credit Facility bear interest, at our option, at either of the following and, in each case, plus an applicable margin:\na.\na base rate, which is the highest of (i) the Agent’s prime rate, (ii) the Federal Funds Rate plus \n0.500\n% and (iii) Adjusted Term SOFR (defined below) for a one-month tenor in effect on such day plus \n1.000\n%; or \nb.\nAdjusted Term SOFR, the rate per annum equal to Term SOFR for such calculation plus the Term SOFR adjustment of \n0.10\n%. \n68\nBorrowings by the Canadian Borrower bear interest, at the Canadian Borrower’s option, at either of the following and, in each case, plus an applicable margin:\na.\na base rate, which is the greatest of (i) the Canadian Reference Bank prime rate and (ii) the Canadian Dealer Offered Rate (CDOR) plus \n1.000\n%; or \nb.\nCDOR. \nBorrowings by the Euro Borrower bear interest at the Adjusted Eurocurrency rate plus an applicable margin.\nBorrowings under any swingline loans under the Credit Facility bear interest, at our option, at either of the following and, in each case, plus an applicable margin: \na.\nthe Term SOFR Swingline Rate, the greater of (i) Adjusted Term SOFR for a period equal to one month (commencing on the date of determination of such interest rate) and (ii) a floor rate specified in the Credit Agreement; or\nb.\na base rate, which is the highest of (i) the Agent’s prime rate, (ii) the Federal Funds Rate plus \n0.500\n% and (iii) Adjusted Term SOFR for a one-month tenor in effect on such day plus \n1.000\n%.\nThe interest rate margins on the borrowings and letters of credit issued under the Credit Agreement are based on our leverage ratio and will range from \n0.000\n% to \n0.425\n% on Base Rate, Canadian Base Rate and Base Rate swingline loans and from \n0.910\n% to \n1.425\n% on CDOR, Adjusted Term SOFR, Adjusted Eurocurrency rate and Term SOFR Swingline Rate loans (with all such rates being calculated in accordance with the terms and by reference to the definitions specified in the Credit Agreement).  We are also required to pay an annual facility fee with respect to the lenders’ aggregate revolving credit agreement, the amount of which is based on our leverage ratio.\nTerm Facility\nOn December 30, 2019, we along with certain of our subsidiaries entered into a $\n185.0\n million term facility (the “Term Facility”) with Bank of America, N.A. pursuant to a credit agreement subsequently amended on October 12, 2021, among us, as Borrower and Bank of America, N.A., as the Lender.  On June 30, 2023, we entered into the Second Amendment to Credit Agreement (the “Term Facility Agreement”) among us, as Borrower, the Guarantors party thereto and Bank of America, N.A. as Lender.  The amendment updated the index used for the Base Rate from LIBOR to Term SOFR (with all such terms being defined within the Term Facility Agreement).  The Term Facility matures on December 30, 2026. \nUnder the Term Facility, we are required to make quarterly amortization payments in installments of \n1.250\n% of the Term Facility on the last business day of each quarter.   We may prepay amounts outstanding under the Term Facility without penalty other than interest breakage costs.  In June 2023, we made a prepayment on the Term Facility of $\n45.0\n million with $\n32.4\n million applied against the remaining quarterly installments and the remainder applied against the amount due at maturity.\nOur obligations under the Term Facility are guaranteed on an unsecured basis by substantially all of our existing and future domestic subsidiaries.  The Term Facility Agreement contains various customary affirmative and negative covenants and events of default.  The occurrence of any of these events of default would permit the lenders to, among other things, require immediate payment of all amounts outstanding under the Term Facility Agreement.\nAt December 31, 2024, the Term Facility had an outstanding balance of $\n109.9\n million at a weighted average effective interest rate of \n5.6\n%.\nBorrowings under the Term Facility bear interest, at our option, at either of the following and, in each case, plus an applicable margin:\na.\na base rate, which is the greatest of (i) the rate per annum equal to the weighted average of the rates on overnight federal funds transactions with members of the Federal Reserve System, as published by the Federal Reserve Bank of New York on the business day next succeeding such day plus \n0.50\n%, (ii) Bank of America’s “prime rate,” or (iii) the Term SOFR Rate (defined below) plus \n1.00\n%; or \nb.\nthe Term SOFR Rate, which is the greater of (i) the rate per annum equal to the Term SOFR Screen Rate administered by CME Group Benchmark Administration Limited or any successor administrator plus the SOFR adjustment of \n0.10\n% or (ii) a floor rate specified in the Term Facility Agreement. \n69\nThe interest rate margins on the borrowings under the Term Facility are based on our leverage ratio and will range from \n0.000\n% to \n0.625\n% on Base Rate borrowings and \n1.000\n% to \n1.625\n% on Adjusted Term SOFR Rate borrowings (with all such rates being calculated in accordance with the terms and by reference to the definitions specified in the Term Facility Agreement). \nReceivables Securitization Facility\nOn October 31, 2024, our subsidiaries entered into the Joinder and Amendment No. 13 to the Receivables Purchase Agreement by and among Superior Commerce LLC, as Seller, SCP Distributors LLC, as the Servicer, the purchasers from time to time party thereto (the “Purchasers”), and Wells Fargo Bank, National Association, as Administrative Agent (as amended, the “Amended Receivables Purchase Agreement”).  The Amended Receivables Purchase Agreement amended our receivable securitization facility principally to extend the facility termination date to October 30, 2026 and increase the maximum facility limit to $\n375.0\n million in the months of April through May.  The funding capacity during the remaining months of year ranges from $\n210.0\n million to $\n350.0\n million.  Amounts outstanding under the Receivables Facility bear interest at Term SOFR plus an applicable margin of \n0.85\n%.  We classify the entire outstanding balance as Long-term debt on our Consolidated Balance Sheets as we intend and have the ability to refinance the obligations on a long-term basis.\nThe Receivables Facility provides for the sale of certain of our receivables to a wholly owned subsidiary (the “Securitization Subsidiary”).  The Securitization Subsidiary transfers variable undivided percentage interests in the receivables and related rights to certain third-party financial institutions in exchange for cash proceeds, limited to the applicable funding capacities.  Upon payment of the receivables by customers, rather than remitting to the financial institutions the amounts collected, we retain such collections as proceeds for the sale of new receivables until payments become due to the financial institutions.   \nThe Receivables Facility is subject to terms and conditions (including representations, covenants and conditions precedent) customary for transactions of this type.  Additionally, an amortization event will occur if we fail to meet certain covenants, including maintaining a maximum average total leverage ratio (average total funded debt/EBITDA) of \n3.25\n to 1.00 and a minimum fixed charge coverage ratio (EBITDAR/cash interest expense plus rental expense) of \n2.25\n to 1.00.\nAt December 31, 2024, there was $\n174.1\n million outstanding under the Receivables Facility at a weighted average effective interest rate of \n5.3\n%, excluding commitment fees.  \nWe also pay an unused fee on the excess of the facility limit over the average daily capital outstanding.  The unused fee is \n0.25\n% if utilization is less than \n50\n% or \n0.35\n% otherwise.  We pay this fee monthly in arrears. \nAustralian Seasonal Credit Facility\nIn the second quarter of 2017, Pool Systems Pty. Ltd. (PSL) entered into a credit facility to fund expansion and supplement working capital needs.  The credit facility provides a borrowing capacity of AU$\n20.0\n million.\nCash Pooling Arrangement\nCertain of our foreign subsidiaries entered into a cash pooling arrangement with a financial institution for cash management purposes.  This arrangement allows the participating subsidiaries to withdraw cash from the financial institution to the extent that aggregate cash deposits held by these subsidiaries are available at the financial institution.  To the extent the aggregate of the participating subsidiaries is in an overdraft position, such overdrafts are recorded as short-term borrowings under a committed cash overdraft facility.  These borrowings bear interest at a variable rate based on 3-month Euro Interbank Offered Rate (EURIBOR), plus a fixed margin.  Our borrowing capacity under this overdraft facility is €\n14.0\n million.  \nMaturities of Long-Term Debt \nThe table below presents maturities of long-term debt, excluding unamortized deferred financing costs, for the next five years (in thousands):\n2025\n$\n49,473\n \n2026\n709,037\n \n2027\n—\n \n2028\n—\n \n2029\n194,600\n \n70\nInterest Rate Swaps\nOur interest rate swaps in effect during the year were previously forward-starting and converted the variable interest rate to a fixed interest rate on a portion of our variable rate borrowings.  Interest expense related to the notional amounts under our swap contracts was based on the fixed rates plus the applicable margin on our variable rate borrowings.  Changes in the estimated fair value of these interest rate swap contracts were recorded to Accumulated other comprehensive (loss) income on the Consolidated Balance Sheets.\nWe currently have two interest rate swap contracts in place.  \nThe following table provides additional details related to these swap contracts:\nDerivative\nInception Date\nEffective Date\nTermination Date\nNotional\nAmount\n(in millions)\nFixed\nInterest\nRate\nInterest rate swap 1\nFebruary 5, 2020\nFebruary 26, 2021\nFebruary 28, 2025\n$\n150.0\n1.3260\n%\nInterest rate swap 2\nMarch 9, 2020\nSeptember 29, 2022\nFebruary 26, 2027\n$\n150.0\n0.6690\n%\nWe have entered into an additional forward-starting interest rate swap contract to extend the hedged period for future interest payments on a portion of our variable rate borrowings.  \nThe following table provides details related to our forward-starting interest rate swap contract:\nDerivative\nInception Date\nEffective Date\nTermination Date\nNotional\nAmount\n(in millions)\nFixed\nInterest\nRate\nForward-starting interest rate swap\nMarch 9, 2020\nFebruary 28, 2025\nFebruary 26, 2027\n$\n150.0\n0.7630\n%\nTwo of our interest rate swap contracts terminated on September 29, 2022.  \nThe following table provides additional details related to these former swap contracts:\nDerivative\nInception Date\nEffective Date\nTermination Date\nNotional\nAmount\n(in millions)\nFixed\nInterest\nRate\nFormer interest rate swap 1\nMay 7, 2019\nNovember 20, 2020\nSeptember 29, 2022\n$\n75.0\n2.0925\n%\nFormer interest rate swap 2\nJuly 25, 2019\nNovember 20, 2020\nSeptember 29, 2022\n$\n75.0\n1.5500\n%\nThe net difference between interest paid and interest received related to our swap agreements resulted in an interest benefit of $\n12.7\n million in 2024, $\n12.2\n million in 2023 and $\n0.8\n million in 2022.\nFailure of our swap counterparties would result in the loss of any potential benefit to us under our swap agreements.  In this case, we would still be obligated to pay the variable interest payments underlying our debt agreements.  Additionally, failure of our swap counterparties would not eliminate our obligation to continue to make payments under our existing swap agreements if we continue to be in a net pay position.\nFinancial and Other Covenants\nThe Credit Facility and Term Facility limit the declaration and payment of dividends on our common stock to a manner consistent with past practice, provided no default or event of default has occurred and is continuing, or would result from the payment of dividends.  We may declare and pay quarterly dividends so long as (i) the amount per share of such dividends is not greater than the most recently publicly announced dividends per share and (ii) our Average Total Leverage Ratio is less than \n3.25\n to 1.00 both immediately before and after giving pro forma effect to such dividends. Under the Credit Facility and Term Facility, we may repurchase shares of our common stock provided no default or event of default has occurred and is continuing, or would result from the repurchase of shares, and our maximum average total leverage ratio (determined on a pro forma basis) is less than \n3.25\n to 1.00.  \nOther covenants include restrictions on our ability to grant liens, incur indebtedness, make investments, merge or consolidate, and sell or transfer assets.  Failure to comply with any of our financial covenants or any other terms of the Credit Facility and the Term Facility could result in higher interest rates on our borrowings or the acceleration of the maturities of our outstanding debt.\n71\nAs of December 31, 2024, we were in compliance with all covenants and financial ratio requirements related to the Credit Facility, the Term Facility and the Receivables Facility.\nDeferred Financing Costs \nWe capitalize financing costs we incur related to implementing and amending our debt arrangements.  We record these costs as a reduction of Long-term debt, net on our Consolidated Balance Sheets and amortize them over the contractual life of the related debt arrangements.  \nThe table below summarizes changes in deferred financing costs for the past two years (in thousands):\nDecember 31,\n \n2024\n2023\nDeferred financing costs:\n \n \nBalance at beginning of year\n$\n4,264\n \n$\n4,212\n \nFinancing costs deferred\n2,077\n \n52\n \nWrite-off of fully amortized deferred financing costs\n(\n1,326\n)\n—\n \nBalance at end of year\n5,015\n \n4,264\n \nLess: Accumulated amortization \n(\n2,261\n)\n(\n2,744\n)\nDeferred financing costs, net of accumulated amortization\n$\n2,754\n \n$\n1,520\n \nNote 6 - \nShare-Based Compensation\nShare-Based Plans\nCurrent Plan\nIn May 2007, our shareholders approved the 2007 Long-Term Incentive Plan (the 2007 LTIP), which authorizes the Compensation Committee of our Board of Directors (the Board) to grant non-qualified stock options and restricted stock awards to employees, directors, consultants or advisors.  In May 2016, our shareholders approved an amendment and restatement of the 2007 Long-Term Incentive Plan (the Amended 2007 LTIP) and increased the number of shares that may be issued to a total of \n9,315,000\n shares.  As of December 31, 2024, we had \n3,877,023\n shares available for future issuance including \n803,009\n shares that may be issued as restricted stock.\nStock options granted under the Amended 2007 LTIP have an exercise price equal to our stock’s closing market price on the grant date and expire ten years from the grant date.  Restricted stock awards granted under the Amended 2007 LTIP are issued at no cost to the grantee.  Both stock options and restricted stock awards vest over time depending on an employee’s length of service with the company.  Share-based awards to our employees generally vest either five years from the grant date or on a three/five year split vest schedule, where half of the awards vest three years from the grant date and the remainder of the awards vest five years from the grant date.  Share-based awards to our non-employee directors vest one year from the grant date.\nPS-1 Awards\nRestricted stock awards granted to our employees from 2016 to 2023 contain performance-based criteria in addition to the service-based vesting criteria described above.  The awards provide for a \nthree-year\n performance period for the metric to be achieved.  If the performance metric fails to be met, it may be extended by \none\n or \ntwo years\n; however, if it is not met by the end of the extended performance period, then all shares of performance-based restricted stock will be immediately forfeited and canceled.  For each of the performance-based grants from 2016 through 2022, we achieved the performance condition in the initial three-year performance period.  For the performance-based grants in 2023, we have concluded that the performance condition is probable to be attained in the initial three-year performance period. \nPS-2 Awards\nCertain restricted stock awards granted to our employees from 2023 and 2024 contain performance-based criteria in addition to the service-based vesting criteria described above.  The awards provide for a \nthree-year\n performance period for the metric to be achieved.  If the performance condition is not met, all shares of the performance-based restricted stock will be immediately forfeited and canceled.  We have not recognized any expense for these performance-based grants in 2023 or 2024. \n72\nStock Option Awards\nThe following table summarizes stock option activity under our share-based plans for the year ended December 31, 2024:\n \nShares\nWeighted Average\nExercise Price\nWeighted Average\nRemaining\nContractual Term\n(Years)\nAggregate\nIntrinsic Value\nBalance at December 31, 2023\n570,722\n \n$\n173.13\n \n \n \nGranted\n28,312\n \n391.62\n \n \n \nLess:  Exercised\n122,300\n \n87.89\n \n \n \n           Forfeited\n7,955\n \n336.98\n \n \n \nBalance at December 31, 2024\n468,779\n \n$\n205.78\n \n4.18\n$\n67,440,657\n \nExercisable at December 31, 2024\n297,612\n \n$\n127.83\n \n2.39\n$\n63,540,112\n \nThe following table presents information about stock options outstanding and exercisable at December 31, 2024:\n \nOutstanding \nStock Options\nExercisable \nStock Options\nRange of Exercise Prices\nShares\nWeighted Average\nRemaining\nContractual Term\n(Years)\nWeighted Average Exercise Price\nShares\nWeighted Average Exercise Price\n$\n69.85\n to $\n117.04\n178,578\n \n1.18\n$\n89.24\n \n178,578\n \n$\n89.24\n \n$\n117.05\n to $\n328.39\n165,584\n \n4.57\n205.67\n \n116,858\n \n181.84\n \n$\n328.40\n to $\n515.41\n124,617\n \n7.98\n372.92\n \n2,176\n \n393.69\n \n \n468,779\n \n4.18\n$\n205.78\n \n297,612\n \n$\n127.83\n \nThe following table summarizes the cash proceeds and tax benefits realized from the exercise of stock options:\n \nYear Ended December 31,\n(in thousands, except share amounts)\n2024\n2023\n2022\nOptions exercised\n122,300\n \n90,439\n \n71,737\n \nCash proceeds\n$\n10,749\n \n$\n8,368\n \n$\n6,247\n \nIntrinsic value of options exercised\n$\n36,198\n \n$\n23,356\n \n$\n21,976\n \nTax benefits realized\n$\n9,049\n \n$\n5,839\n \n$\n5,494\n \nWe estimated the fair value of employee stock option awards at the grant date based on the assumptions summarized in the following table:\n \n \nYear Ended December 31,\n(Weighted average)\n2024\n2023\n2022\nExpected volatility\n32.0\n \n%\n31.0\n \n%\n28.9\n \n%\nExpected term\n8.1\nyears\n7.4\nyears\n7.1\nyears\nRisk-free interest rate\n4.29\n \n%\n4.01\n \n%\n2.92\n \n%\nExpected dividend yield\n1.15\n \n%\n1.15\n \n%\n1.15\n \n%\nGrant date fair value\n$\n149.37\n \n$\n130.74\n \n$\n116.56\n \nWe calculated expected volatility over the expected term of the awards based on the historical volatility of our common stock.  We use weekly price observations for our historical volatility calculation because we believe this provides the most appropriate measurement of volatility given the trading patterns of our common stock.  We estimated the expected term based on the vesting period of the awards and our historical exercise activity for awards with similar characteristics.  The risk-free interest rate is based on the U.S. Treasury zero-coupon issues with a remaining term approximating the expected term of the option.  We determined the expected dividend yield based on the dividends we anticipate paying over the expected term.\n73\nFor purposes of recognizing share-based compensation expense, we ratably expense the estimated fair value of employee stock options over the options’ requisite service period.  The requisite service period for our share-based awards is either the vesting period, or if shorter, the period from the grant date to the date the employee becomes eligible to retire under our share-based award agreements.  We recognize compensation cost for awards with graded vesting using the graded vesting recognition method.  We estimate a forfeiture rate to calculate our share-based compensation expense for our share-based awards based on an analysis of actual forfeitures.  We continue to evaluate the appropriateness of the forfeiture rate based on actual forfeiture experience, analysis of employee turnover and other factors.\nThe following table presents the total share-based compensation expense for stock option awards for the past three years (in thousands):\n \n2024\n2023\n2022\nOption grants share-based compensation expense\n$\n4,387\n \n$\n4,618\n \n$\n3,413\n \nOption grants share-based compensation tax benefits\n1,097\n \n1,154\n \n853\n \nAt December 31, 2024, the unamortized compensation expense related to stock option awards totaled $\n7.4\n million.  We anticipate recognizing this expense over a weighted average period of \n2.6\n ye\na\nrs.\nRestricted Stock Awards\nThe table below presents restricted stock award activity under our share-based plans for the year ended December 31, 2024:\n \nShares\nWeighted Average\nGrant Date Fair Value\nBalance unvested at December 31, 2023\n203,637\n \n$\n306.79\n \nGranted (at market price) \n(1)\n57,434\n \n391.72\n \nLess:  Vested\n49,512\n \n209.14\n \nForfeited\n7,106\n \n369.83\n \nBalance unvested at December 31, 2024\n204,453\n \n$\n351.56\n \n(1)\nThe majority of these shares contain performance-based vesting conditions.\nAt December 31, 2024, the unamortized compensation expense related to the restricted stock awards totaled $\n22.0\n million.  We anticipate recognizing this expense over a weighted average period of \n2.2\n years.\nThe table below presents the total number of restricted stock awards that vested for the past three years and the related fair value of those awards (in thousands, except share amounts):\n \n2024\n2023\n2022\nRestricted stock awards - shares vested\n49,512\n \n58,705\n \n78,931\n \nFair value of restricted stock awards vested\n$\n19,241\n \n$\n20,906\n \n$\n37,258\n \nThe following table presents the total share-based compensation expense for restricted stock awards for the past three years (in thousands):\n \n2024\n2023\n2022\nRestricted stock awards share-based compensation expense\n$\n14,436\n \n$\n14,487\n \n$\n11,024\n \nEmployee Stock Purchase Plan\nWe maintain the Pool Corporation Amended and Restated Employee Stock Purchase Plan (the ESPP), which was last approved by the Board and our stockholders in 2016.  Under the ESPP, employees who meet minimum age and length of service requirements may purchase stock at \n85\n% of the lower of:\na.\nthe closing price of our common stock at the end of a six month plan period ending either July 31 or January 31; or \nb.\nthe average of the beginning and ending closing prices of our common stock for such six month period. \n74\nNo more than \n956,250\n shares of our common stock may be issued under the ESPP.  \nFor the two six month offering periods in each of the last three years, our employees purchased the following aggregate number of shares:\n2024\n2023\n2022\n7,707\n \n7,640\n \n7,658\n \nThe grant date fair value for the most recent ESPP purchase period ended July 31, 2024 was\n $\n56.11\n per share.  Share-based compensation expense related to our ESPP was $\n0.4\n million in 2024, $\n0.5\n million in 2023 and $\n0.5\n million in 2022.\nNote 7 - \nIncome Taxes\nIncome before income taxes and equity in earnings is attributable to the following jurisdictions (in thousands):\n  \nYear Ended December 31,\n  \n2024\n2023\n2022\nUnited States\n$\n553,533\n \n$\n662,138\n \n$\n919,461\n \nForeign \n13,421\n \n25,998\n \n65,411\n \nTotal\n$\n566,954\n \n$\n688,136\n \n$\n984,872\n \nThe provision for income taxes consisted of the following (in thousands):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCurrent:\n \n \n \nFederal\n$\n97,251\n \n$\n120,122\n \n$\n164,135\n \nState and other\n19,846\n \n34,603\n \n57,459\n \nTotal current provision for income taxes\n117,097\n \n154,725\n \n221,594\n \nDeferred:\n \n \n \nFederal\n9,199\n \n9,929\n \n13,592\n \nState and other\n6,540\n \n430\n \n1,577\n \nTotal deferred provision for income taxes\n15,739\n \n10,359\n \n15,169\n \nProvision for income taxes\n$\n132,836\n \n$\n165,084\n \n$\n236,763\n \nA reconciliation of the U.S. federal statutory tax rate to our effective tax rate on Income before income taxes and equity in earnings is as follows:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nFederal statutory rate\n21.00\n \n%\n21.00\n \n%\n21.00\n \n%\nChange in valuation allowance\n0.20\n \n0.05\n \n(\n0.02\n)\nStock-based compensation\n(\n1.55\n)\n(\n0.97\n)\n(\n1.09\n)\nOther, primarily state income tax rate\n3.78\n \n3.91\n \n4.15\n \nTotal effective tax rate\n23.43\n \n%\n23.99\n \n%\n24.04\n \n%\nIn 2024, several countries in which we operate have adopted the Global Anti-Base Erosion Model Rules (Pillar Two), which generally provides for a minimum effective tax rate of \n15\n%, as established by the Organization for Economic Co-operation and Development (OECD) Pillar Two Framework.  The Pillar Two directive did not have a material effect on our financial statements for the year ended December 31, 2024.  We are continuing to evaluate the potential effect on future periods and will monitor additional guidance as it is released.\nWe reduce federal and state income taxes payable by the tax benefits associated with the exercise of deductible nonqualified stock options and the lapse of restrictions on deductible restricted stock awards.  To the extent realized tax deductions exceed the amount of previously recognized deferred tax benefits related to share-based compensation, we record an excess tax benefit.  We record all excess tax benefits or deficiencies as income tax benefit or expense in the income statement.  We recorded excess tax benefits of $\n8.8\n million to our income tax provision in 2024, $\n6.7\n million in 2023 and $\n10.8\n million in 2022.  \n75\nThe table below presents the components of our deferred tax assets and liabilities (in thousands):\n \nDecember 31,\n \n2024\n2023\nDeferred tax assets:\n \n \nProduct inventories\n$\n13,625\n \n$\n11,764\n \nTrade discounts on purchases\n1,044\n \n—\n \nAccrued expenses\n824\n \n4,724\n \nLeases\n74,108\n \n73,874\n \nShare-based compensation\n10,844\n \n9,977\n \nUncertain tax positions\n4,133\n \n3,753\n \nNet operating losses\n2,336\n \n1,447\n \nOther\n4,843\n \n4,716\n \nTotal non-current\n111,757\n \n110,255\n \nLess: Valuation allowance\n(\n2,255\n)\n(\n1,133\n)\nComponent reclassified for net presentation\n(\n108,583\n)\n(\n107,733\n)\nTotal non-current, net\n919\n \n1,389\n \nTotal deferred tax assets\n919\n \n1,389\n \nDeferred tax liabilities:\nTrade discounts on purchases\n—\n \n2,112\n \nPrepaid expenses\n9,380\n \n6,610\n \nLeases\n73,583\n \n73,092\n \nIntangible assets, primarily goodwill\n73,334\n \n60,902\n \nDepreciation\n28,541\n \n26,000\n \nInterest rate swaps\n5,153\n \n6,438\n \nTotal non-current\n189,991\n \n175,154\n \nComponent reclassified for net presentation\n(\n108,583\n)\n(\n107,733\n)\nTotal non-current, net\n81,408\n \n67,421\n \nTotal deferred tax liabilities\n81,408\n \n67,421\n \nNet deferred tax liability\n$\n80,489\n \n$\n66,032\n \nAt December 31, 2024, certain of our international subsidiaries had tax loss carryforwards totaling approximately $\n7.9\n million, which expire in various years after 2025.  Deferred tax assets related to the tax loss carryforwards of these international subsidiaries were $\n2.3\n million as of December 31, 2024 and $\n1.4\n million as of December 31, 2023.  We have recorded a corresponding valuation allowance of $\n2.1\n million and $\n1.0\n million in the respective years. \nAs of December 31, 2024, United States income taxes were not provided on earnings or cash balances of our foreign subsidiaries, outside of the provisions of the transition tax from U.S. tax reform enacted in December 2017.  As we have historically invested or expect to invest the undistributed earnings indefinitely to fund current cash flow needs in the countries where held, additional income tax provisions may be required.  Determining the amount of unrecognized deferred tax liability on these undistributed earnings and cash balances is not practicable due to the complexity of tax laws and regulations and the varying circumstances, tax treatments and timing of any future repatriation. \n76\nThe following table summarizes the activity related to uncertain tax positions for the past three years (in thousands):\n \n2024\n2023\n2022\nBalance at beginning of year\n$\n17,871\n \n$\n15,489\n \n$\n13,297\n \nIncreases for tax positions taken during a prior period\n—\n \n—\n \n275\n \nIncreases for tax positions taken during the current period\n4,517\n \n4,457\n \n5,264\n \nDecreases resulting from the expiration of the statute of limitations\n2,709\n \n2,075\n \n3,347\n \nBalance at end of year\n$\n19,679\n \n$\n17,871\n \n$\n15,489\n \nThe total amount of unrecognized tax benefits that, if recognized, would decrease the effective tax rate was $\n15.5\n million at December 31, 2024 and $\n14.1\n million at December 31, 2023.\nWe record interest expense related to unrecognized tax benefits in Interest and other non-operating expenses, net, while we record related penalties in Selling and administrative expenses on our Consolidated Statements of Income.  For unrecognized tax benefits, we had interest expense of $\n0.8\n million in 2024 and $\n0.4\n million in 2023 and interest income of $\n0.1\n million in 2022.  Accrued interest related to unrecognized tax benefits was approximately $\n2.7\n million at December 31, 2024 and $\n1.9\n million at December 31, 2023.\nWe file income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions.  With few exceptions, we are no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations by tax authorities for years before 2021.\n77\nNote 8 - \nEarnings Per Share\nWe calculate basic and diluted earnings per share using the two-class method.  Earnings per share under the two-class method is calculated using net income attributable to common stockholders, which is net income reduced by the earnings allocated to participating securities.  Our participating securities include share-based payment awards that contain a non-forfeitable right to receive dividends and are considered to participate in undistributed earnings with common shareholders.  Participating securities excluded from weighted average common shares outstanding were \n206,000\n for the year ended December 31, 2024, \n207,000\n for the year ended December 31, 2023 and \n221,000\n for the year ended December 31, 2022. \nThe table below presents the computation of earnings per share, including the reconciliation of basic and diluted weighted average shares outstanding (in thousands, except per share data):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n434,325\n \n$\n523,229\n \n$\n748,462\n \n   Amounts allocated to participating securities\n(\n2,250\n)\n(\n2,771\n)\n(\n4,151\n)\nNet income attributable to common stockholders\n$\n432,075\n \n$\n520,458\n \n$\n744,311\n \nWeighted average common shares outstanding:\n \n \n \nBasic\n38,007\n \n38,704\n \n39,409\n \nEffect of dilutive securities:\n \n \n \nStock options and employee stock purchase plan\n221\n \n293\n \n397\n \nDiluted \n38,228\n \n38,997\n \n39,806\n \nEarnings per share attributable to common stockholders:\n \n \n \nBasic\n$\n11.37\n \n$\n13.45\n \n$\n18.89\n \nDiluted\n$\n11.30\n \n$\n13.35\n \n$\n18.70\n \nAnti-dilutive stock options excluded from diluted earnings per share computations \n(1)\n57\n \n64\n \n34\n \n(1)\nSince these options have exercise prices that are higher than the average market prices of our common stock, including them in the calculation would have an anti-dilutive effect on earnings per share.\nNote 9 - \nCommitments and Contingencies\nLease Commitments \nWe lease facilities for our corporate and administrative offices, sales centers and centralized shipping locations under operating leases that expire in various years through 2036.  Most of our leases contain five-year terms with renewal options that allow us to extend the lease term beyond the initial period, subject to terms agreed upon at lease inception.  Based on our leasing practices and contract negotiations, we determined that we are not reasonably certain to exercise the renewal options and, as such, we have not included optional renewal periods in our measurement of operating lease assets, liabilities and expected lease terms.  We exclude short-term leases from our Consolidated Balance Sheets and combine lease and non-lease components.  \nFor leases with step rent provisions whereby the rental payments increase incrementally over the life of the lease, we recognize expense on a straight-line basis determined by the total lease payments over the lease term.  To the extent we determine that future obligations related to real estate taxes, insurance and other lease components are variable, we exclude them from the measurement of our operating lease assets and liabilities.  \nSome of our real estate agreements include rental payments adjusted periodically for inflation.  Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.  \n78\nThe table below presents rent expense associated with facility and vehicle operating leases for the past three years (in thousands):\nLease Cost\nClassification\n2024\n2023\n2022\nOperating lease cost\n (1)\nSelling and administrative expenses\n$\n106,404\n \n$\n92,939\n \n$\n81,750\n \nVariable lease cost\nSelling and administrative expenses\n27,474\n \n24,535\n \n22,326\n \n(1)\nIncludes short-term lease cost, which is not material.\nBased on our lease portfolio as of December 31, 2024, the table below sets forth the approximate future lease payments related to operating leases with initial terms of one year or more (in thousands):\n2025\n$\n98,746\n \n2026\n86,531\n \n2027\n69,573\n \n2028\n47,549\n \n2029\n27,756\n \nThereafter\n35,312\n \nTotal lease payments\n365,467\n \nLess: interest\n43,900\n \nPresent value of lease liabilities\n$\n321,567\n \nTo calculate the present value of our lease liabilities, we determined our incremental borrowing rate based on the effective interest rate on our Credit Facility adjusted for a collateral feature similar to that of our leased properties, as we are unable to derive implicit rates from our existing leases.  \nThe table below presents the weighted-average remaining lease term (years) of our operating leases and the weighted-average discount rate used in the above calculation:\nDecember 31,\nLease Term and Discount Rate for Operating Leases\n2024\n2023\n2022\nWeighted-average remaining lease term (years)\n4.65\n4.81\n5.08\nWeighted-average discount rate\n4.56\n \n%\n4.04\n \n%\n3.05\n \n%\nThe table below presents the amount of cash paid for amounts included in the measurement of lease liabilities and lease assets obtained in exchange for lease obligations (in thousands):\nYear Ended\nDecember 31,\n2024\n2023\n2022\nOperating cash flows for lease liabilities\n$\n96,267\n \n$\n84,703\n \n$\n75,281\n \nOperating lease assets obtained in exchange for operating lease obligations\n89,239\n \n107,869\n \n91,622\n \n79\nContingencies\nFrom time to time, we are subject to various claims and litigation arising in the ordinary course of business, including product liability, personal injury, commercial, contract and employment matters.  Each quarter, we evaluate developments related to claims and litigation and record a liability if we deem a loss to be probable and estimable.  When evaluating these matters for accrual and disclosure, we consider factors such as historical experience, specific facts and claims asserted, the likelihood we will prevail and the magnitude of any potential loss.  The outcome of any litigation is inherently unpredictable.  Based on currently available facts, we do not believe that the ultimate resolution of any of these claims and litigation matters will have a material adverse impact on our financial condition, results of operations or cash flows.  We do not believe our exposure for any of these matters is material for disclosure, either individually or in the aggregate.\nNote 10 - \nRelated Party Transactions\nWe lease corporate and administrative offices from NCC, an entity we have held a \n50\n% ownership interest in since 2005.  NCC owns and operates an office building in Covington, Louisiana.  We lease corporate and administrative offices from NCC, occupying approximately \n60,000\n square feet of office space, and we pay rent of $\n0.1\n million per month.  Our lease term ends May 2025.  We expect to renew this lease in the second quarter of 2025.\nThe table below presents rent expense associated with this lease for the past three years (in thousands):\n \n2024\n2023\n2022\nNCC\n$\n1,222\n \n$\n1,222\n \n$\n1,222\n \nNote 11 - \nEmployee Benefit Plans\nWe offer a 401(k) savings and retirement plan, which is a defined contribution plan that provides benefits for substantially all employees who meet length of service requirements.  Eligible employees are able to contribute up to \n75\n% of their compensation, subject to the federal dollar limit.  For plan participants, we provide a matching contribution.  We contribute a total maximum match on employee contributions of up to \n4\n% of their compensation, with a \n100\n% match on the first \n3\n% of compensation deferred and a \n50\n% match on deferrals between \n3\n% and \n5\n% of compensation.  We also offer retirement plans for certain of our international entities.  The plan funding is calculated as a percentage of the employee’s earnings and in compliance with local laws and practices.  The related expense is not material and is included in the table below.\nWe have a nonqualified deferred compensation plan that allows certain employees who occupy key management positions to defer salary and bonus amounts.  This plan also provides a matching contribution similar to that provided under our 401(k) plan to the extent that a participant’s contributions to the 401(k) plan are limited by IRS deferral and compensation limitations.  The total combined company matching contribution provided to a participant under the 401(k) plan and the nonqualified deferred compensation plan for any one year may not exceed \n4\n% of a participant’s salary and bonus.  The employee and company matching contributions are invested in certain equity and fixed income securities based on individual employee elections.\nThe table below sets forth our contributions for the past three years (in thousands):\n \n2024\n2023\n2022\nDefined contribution and international retirement plans\n$\n10,953\n \n$\n10,973\n \n$\n10,230\n \nDeferred compensation plan\n238\n \n218\n \n283\n \nNote 12 - \nSegment Information\nSince all of our sales centers have similar operations and share similar economic characteristics, we aggregate our sales centers into a single reportable segment and one reportable revenue stream.  These similarities include (i) the nature of our products and services, (ii) the types of customers we sell to and (iii) the distribution methods we use.  Our chief operating decision maker (CODM) is our president and chief executive officer.  Our CODM evaluates each sales center based on individual performance that includes both financial and operational measures.  These measures include operating income, accounts receivable and inventory management criteria.  \nA bottom-up approach is used to develop the operating budget for each individual sales center.  Our CODM makes resource allocation decisions primarily on a sales center-by-sales center basis.  No single sales center meets any of the quantitative thresholds (10% of revenues, profit or assets) for separately reporting information about an operating segment.  We do not track sales by product lines and product categories on a consolidated basis.  We lack readily available financial information due to the \n80\nnumber of our product lines and product categories and the fact that we make ongoing changes to product classifications within these groups, thus making it impracticable to report our sales by product category. \nOur segment derives revenue from sales centers in North America, Europe and Australia that sell swimming pool supplies, equipment and related leisure products, irrigation and landscape maintenance products and hardscape, tile and stone products to pool builders, retail stores, service companies, landscape contractors and others.\n  No single customer accounted for 10% or more of our sales.  The accounting policies for our segment are the same as those described in Note 1. \nT\nhe table below presents segment revenue, operating expenses and operating income and reconciles segment operating income to consolidated income before taxes and equity in earnings (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nNet sales\n$\n5,310,953\n \n$\n5,541,595\n \n$\n6,179,727\n \nCost of sales\n3,735,606\n \n3,881,551\n \n4,246,315\n \nGross profit\n1,575,347\n \n1,660,044\n \n1,933,412\n \nCompensation expenses\n486,824\n \n477,971\n \n495,860\n \nFreight out expenses\n90,268\n \n84,932\n \n89,002\n \nOther selling and administrative expenses\n381,051\n \n350,574\n \n322,767\n \nOperating income\n617,204\n \n746,567\n \n1,025,783\n \nReconciliation:\nInterest and other non-operating expenses, net\n50,250\n \n58,431\n \n40,911\n \nIncome before income taxes and equity in earnings\n$\n566,954\n \n$\n688,136\n \n$\n984,872\n \nThe tables below present supplemental information for our segment (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nDepreciation\n$\n36,784\n \n$\n31,585\n \n$\n30,381\n \nAmortization\n8,697\n \n8,555\n \n8,644\n \nGoodwill impairment\n—\n \n550\n \n605\n \nDecember 31,\n2024\n2023\nReceivables, net\n$\n115,835\n \n$\n145,723\n \nReceivables pledged under receivables facility\n199,026\n \n197,187\n \nProduct inventories, net\n1,289,300\n \n1,365,466\n \nThe table below presents net sales by geographic region, with international sales translated into U.S. dollars at prevailing exchange rates, for the past three years (in thousands):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nUnited States\n$\n4,936,981\n \n$\n5,126,308\n \n$\n5,674,909\n \nInternational\n373,972\n \n415,287\n \n504,818\n \n \n$\n5,310,953\n \n$\n5,541,595\n \n$\n6,179,727\n \n81\nThe table below presents net property and equipment by geographic region, with international property and equipment balances translated into U.S. dollars at prevailing exchange rates, for the past three years (in thousands):\n \nDecember 31,\n \n2024\n2023\n2022\nUnited States\n$\n241,891\n \n$\n215,109\n \n$\n185,117\n \nInternational\n9,433\n \n8,820\n \n8,592\n \n \n$\n251,324\n \n$\n223,929\n \n$\n193,709\n \n82\nItem 9.  Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.\nItem 9A.  Controls and Procedures\nThe term “disclosure controls and procedures” is defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 (the Act).  The rules refer to the controls and other procedures designed to ensure that information required to be disclosed in reports that we file or submit under the Act is (1) recorded, processed, summarized and reported within the time periods specified in the Commission’s rules and forms and (2) accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.  As of December 31, 2024, management, including the CEO and CFO, performed an evaluation of the effectiveness of our disclosure controls and procedures.  Based on that evaluation, management, including the CEO and CFO, concluded that as of December 31, 2024, our disclosure controls and procedures were effective.\nWe maintain a system of internal control over financial reporting that is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles.  Based on the most recent evaluation, we have concluded that no change in our internal control over financial reporting occurred during the last fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\n83\nManagement’s Report on Internal Control Over Financial Reporting\n \nPool Corporation’s management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended.  Our internal control system was designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of published financial statements.  All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Any evaluation or projection of effectiveness to future periods is also subject to risk that controls may become inadequate due to changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nPool Corporation’s management assessed the effectiveness of our internal control over financial reporting as of December 31, 2024.  In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in the \nInternal Control-Integrated Framework \n(2013 Framework)\n.\n Based on this assessment, management has concluded that, as of December 31, 2024, Pool Corporation’s internal control over financial reporting was effective.\nThe independent registered public accounting firm that audited the Consolidated Financial Statements included in Item 8 of this Form 10-K has issued a report on Pool Corporation’s internal control over financial reporting. This report appears below.\n84\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Pool Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Pool Corporation’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Pool Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, changes in stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.  \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n /s/ Ernst & Young LLP\nNew Orleans, Louisiana\nFebruary 27, 2025\n85\nItem 9B.  Other Information\nDuring the quarter ended December 31, 2024, none of our directors or officers (as defined in Rule 16a-1(f) under the Exchange Act) \nadopted\n or \nterminated\n any Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement (as such terms are defined in Item 408(a) of Regulation SK).\nItem 9C.  Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III.\nItem 10.  Directors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated by reference to Pool Corporation’s 2025 Proxy Statement to be filed with the SEC.\nWe have a Code of Business Conduct and Ethics (the Code) that applies to all of our employees, officers and directors, and is available on our website at \nwww.poolcorp.com\n.  Any substantive amendments to the Code, or any waivers granted to any directors or executive officers, including our principal executive officer, principal financial officer or principal accounting officer and controller, will be disclosed on our website and remain there for at least 12 months.\nItem 11.  Executive Compensation\nThe information required by this item is incorporated by reference to Pool Corporation’s 2025 Proxy Statement to be filed with the SEC.\nItem 12.  Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated by reference to Pool Corporation’s 2025 Proxy Statement to be filed with the SEC.\nItem 13.  Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference to Pool Corporation’s 2025 Proxy Statement to be filed with the SEC.\nItem 14.  Principal Accountant Fees and Services\nThe information required by this item is incorporated by reference to Pool Corporation’s 2025 Proxy Statement to be filed with the SEC.\n86\nPART IV.\nItem 15.  Exhibits, Financial Statement Schedules\n(a)\nThe following documents are filed as part of this report:\n(1)\nConsolidated Financial Statements:\n \n \nPage\n \nReport of Independent Registered Public Accounting Firm\n49\n \nConsolidated Statements of Income\n51\nConsolidated Statements of Comprehensive Income\n52\n \nConsolidated Balance Sheets\n53\n \nConsolidated Statements of Cash Flows\n54\n \nConsolidated Statements of Changes in Stockholders’ Equity \n55\n \nNotes to Consolidated Financial Statements\n56\n \n \n(2)\nFinancial Statement Schedules.\n \n \n \nAll schedules are omitted because they are not applicable or are not required or because the required information is provided in our Consolidated Financial Statements or accompanying Notes included in Item 8 of this Form 10-K.\n \n \n(3)\nThe exhibits listed in the Index to Exhibits.\nItem 16.  Form 10-K Summary\nNone.\n87\nINDEX TO EXHIBITS\n \n \n \n \n \n \nIncorporated by Reference\nNo.\n \nDescription\n \nFiled/\nFurnished\nwith this\nForm 10-K\n \nForm\n \nFile No.\n \nDate Filed\n3.1\n \nRestated Certificate of Incorporation of the Company.\n \n \n \n10-Q\n \n000-26640\n \n08/09/2006\n3.2\n \nAmended and Restated By-laws of the Company.\n \n \n \n \n8-K\n \n000-26640\n \n10/25/2023\n4.1\n \nForm of certificate representing shares of common stock of the Company.\n \n \n \n8-K\n \n000-26640\n \n05/19/2006\n4.2\nDescription of the Securities of Pool Corporation Registered Under Section 12 of the Securities and Exchange Act of 1934.\n10-K\n000-26640\n02/27/2024\n10.1\n*\nPool Corporation Amended and Restated Employee Stock Purchase Plan.\n \n \n \n8-K\n \n000-26640\n \n05/06/2016\n10.2\n*\nPool Corporation Amended and Restated 2007 Long\n-\nTerm Incentive Plan.\n \n \n8-K\n \n000-26640\n \n05/06/2016\n10.3\n*\nForm of Performance-Based Restricted Stock Agreement under the Pool Corporation Amended and Restated 2007 Long-Term Incentive Plan\n (2024 PS-2)\n.\nX\n10.4\n*\nForm of Stock Option Agreement for \nEmployees\n under the Amended and Restated 2007 Long-Term Incentive Plan.\nX\n10.5\n*\nForm of Restricted Stock Agreement for \nEmployees\n under the Amended and Restated 2007 Long-Term Incentive Plan.\nX\n10.6\n*\nForm of Performance-Based Restricted Stock Agreement under the Pool Corporation Amended and Restated 2007 Long-Term Incentive Plan\n (2023 PS-2)\n.\n \nX\n10.7\n*\nForm of Performance-Based Restricted Stock Agreement under the Pool Corporation Amended and Restated 2007 Long-Term Incentive Plan\n (PS-1)\n.\n10-K\n000-26640\n02/25/2022\n10.8\n*\nForm of Stock Option Agreement for Directors under the Amended and Restated 2007 Long‑Term Incentive Plan.\n \n \n \n8-K\n \n000-26640\n \n05/06/2009\n10.9\n*\nForm of Restricted Stock Agreement for Directors under the Amended and Restated 2007 Long-Term Incentive Plan.\n \n \n \n8-K\n \n000-26640\n \n05/06/2009\n10.10\n*\nForm of Employment Agreement for Executive Officers\n, Including CEO\n.\n \nX\n \n \n \n10.11\n*\nNonqualified Deferred Compensation Plan Basic Plan Document, dated March 1, 2005.\n \n \n \n10-Q\n \n000-26640\n \n04/29/2005\n10.12\n*\nNonqualified Deferred Compensation Plan Adoption Agreement by and among SCP Distributors, L.L.C., Superior Pool Products, L.L.C. and Cypress, Inc., dated March 1, 2005.\n \n \n \n10-Q\n \n000-26640\n \n04/29/2005\n10.13\n*\nTrust Agreement by and among SCP Distributors, L.L.C., Superior Pool Products, L.L.C. and Cypress, Inc. and T. Rowe Price Trust Company, dated March 1, 2005, establishing a trust relating to Registrant’s Nonqualif\ni\ned Deferred Compensation Plan.\n \n \n \n10-Q\n \n000-26640\n \n04/29/2005\n10.14\n*\nPool Corporation Executive Officer Annual Incentive Plan\n.\n10-K\n000-26640\n02/27/2019\n10.15\n*\nPool Corporation Strategic Plan Incentive Program.\n10-K\n000-26640\n02/25/2022\n \n \n \n \n \n \nIncorporated by Reference\nNo.\n \nDescription\n \nFiled/\nFurnished\nwith this\nForm 10-K\n \nForm\n \nFile No.\n \nDate Filed\n10.16\nThird Amended and Restated Credit Agreement dated as of September 30, 2024, by and among Pool Corporation, as U.S. Borrower, SCP Distributors Canada Inc., as Canadian Borrower, SCP International, Inc., as Euro Borrower, Wells Fargo Bank, National Association, as administrative Agent, and certain other lenders party thereto.\n8-K\n000-26640\n10/02/2024\n10.17\nReceivables Sale and Contribution Agreement, dated as of October 11, 2013, between SCP Distributors LLC, Horizon Distributors, Inc., Superior Pool Products LLC and Poolfx Supply LLC, as Originators and Superior Commerce LLC, as Buyer.\n8-K\n000-26640\n10/17/2013\n10.18\nJoinder and Amendment No. 13 to the Receivables Purchase Agreement, effective October 31, 2024, among Superior Commerce LLC, as Seller, SCP Distributors LLC, as the Servicer, the Purchasers from time to time party thereto, and Wells Fargo Bank, National Association, as Administrative Agent, including Exhibit A/B containing the Receivables Purchase Agreement, as amended and restated through October 31, 2024.\n8-K\n000-26640\n11/05/2024\n10.19\nPerformance Undertaking, dated as of October 11, 2013, by and between Pool Corporation and Superior Commerce LLC in respect of the Receivables Sale and Contribution Agreement.\n8-K\n000-26640\n10/17/2013\n10.20\nCredit Agreement, dated as of December 30, 2019, among Pool Corporation as the Borrower, Certain Subsidiaries of the Borrower Party Hereto, as the Guarantors, and Bank of America, N.A., as the Lender.\n8-K\n000-26640\n01/02/2020\n10.21\nas amended by First Amendment to Credit Agreement dated October 12, 2021.\n10-Q\n000-26640\n10/28/2021\n10.22\nas amended by Second Amendment to Credit Agreement dated June 30, 2023.\n8-K\n000-26640\n07/05/2023\n10.23\nas amended by Third Agreement to Credit Agreement dated September 30, 2024.\n10-Q\n000-26640\n10/30/2024\n19.1\nPool Corporation Insider Trading Policy.\n10-K\n000-26640\n02/27/2024\n21.1\n \nSubsidiaries of the registrant.\n \nX\n \n \n \n \n \n \n23.1\n \nConsent of Ernst & Young LLP.\n \nX\n \n \n \n \n \n \n31.1\n \nCertification by Chief Financial Officer pursuant to Rule 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n \n \n \n31.2\n \nCertification by Chief Executive Officer pursuant to Rule 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n \n \n \n32.1\n \nCertification by Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n \n \n \n97.1\nPool Corporation Clawback Policy. \n10-K\n000-26640\n02/27/2024\n101.INS\n+\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n \nX\n \n \n \n \n \n \n101.SCH\n+\nInline XBRL Taxonomy Extension Schema Document\n \nX\n \n \n \n \n \n \n101.CAL\n+\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n \nX\n \n \n \n \n \n \n \n \n \n \n \n \nIncorporated by Reference\nNo.\n \nDescription\n \nFiled/\nFurnished\nwith this\nForm 10-K\n \nForm\n \nFile No.\n \nDate Filed\n101.DEF\n+\nInline XBRL Taxonomy Extension Definition Linkbase Document\n \nX\n \n \n \n \n \n \n101.LAB\n+\nInline XBRL Taxonomy Extension Label Linkbase Document\n \nX\n \n \n \n \n \n \n101.PRE\n+\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n \nX\n \n \n \n \n \n \n104\n+\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\nX\n*    Indicates a management contract or compensatory plan or arrangement\n+    \nAttached as Exhibit 101 to this report are the following items formatted in iXBRL (Inline Extensible Business Reporting Language):\n1.\nConsolidated Statements of Income for the years ended December 31, 2024, December 31, 2023 and December 31, 2022;\n2.\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, December 31, 2023 and December 31, 2022;\n3.\nConsolidated Balance Sheets at December 31, 2024 and December 31, 2023;\n4.\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, December 31, 2023 and December 31, 2022;\n5.\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2024, December 31, 2023 and December 31, 2022; and\n6.\nNotes to Consolidated Financial Statements.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on February 27, 2025.\n \nPOOL CORPORATION\n \n \nBy:\n/s/ JOHN E. STOKELY\n \nJohn E. Stokely, Chair of the Board \n \nand Lead Independent Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant in the capacities indicated on February 27, 2025.\nSignature:\nTitle:\n \n \n/s/ JOHN E. STOKELY\n \nJohn E. Stokely\nChair of the Board and Lead Independent Director\n \n \n/s/ PETER D. ARVAN\n \nPeter D. Arvan\nPresident, Chief Executive Officer and Director (principal executive officer)\n \n \n/s/ MELANIE M. HOUSEY HART\n \nMelanie M. Housey Hart\nSenior Vice President and Chief Financial Officer (principal financial officer)\n \n \n/s/ WALKER F. SAIK\nWalker F. Saik\nChief Accounting Officer and Corporate Controller (principal accounting officer)\n/s/ MARTHA S. GERVASI\nMartha S. Gervasi\nDirector\n/s/ JAMES D. HOPE\nJames D. Hope\nDirector\n/s/ KEVIN M. MURPHY\nKevin M. Murphy\nDirector\n/s/ DEBRA S. OLER\nDebra S. Oler\nDirector\n/s/ MANUEL J. PEREZ DE LA MESA\nManuel J. Perez de la Mesa\nDirector\n/s/ CARLOS A. SABATER\nCarlos A. Sabater\nDirector\n/s/ DAVID G. WHALEN\nDavid G. Whalen\nDirector"
  }
}