{
  "ticker": "PPG",
  "cik": "0000079879",
  "company_name": "PPG INDUSTRIES INC",
  "filing_date": "2025-02-20",
  "accession": "0000079879-25-000034",
  "primary_doc": "ppg-20241231.htm",
  "item_sections": {
    "item1": "Item 1. “Business” of this Form 10-K for the principal manufacturing and distribution facilities by reportable business segment. \nThe Company’s principal research and development centers are located in Allison Park, Pa.; Tianjin, China; Cleveland, Oh.; Springdale, Pa.; Milan, Italy; Monroeville, Pa.; Ingersheim, Germany; Marly, France; Oak Creek, Wi.; Sumare, Brazil; Amsterdam, Netherlands; Vantaa, Finland; Tepexpan, Mexico; Burbank, Ca.; Zhangjiagang, China; Cheonan, Republic of Korea; Wroclaw, Poland; Bangplee, Thailand; and Sylmar, Ca.\nOur headquarters, certain distribution centers and substantially all company-owned paint stores are located in facilities that are leased while our other facilities are generally owned. Our facilities are considered to be suitable and adequate for the purposes for which they are intended and overall have sufficient capacity to conduct business in the upcoming year.\n2024 PPG ANNUAL REPORT AND FORM 10-K      15\nItem 3. Legal Proceedings\nPPG is involved in a number of lawsuits and claims, both actual and potential, including some that it has asserted against others, in which substantial monetary damages are sought. These lawsuits and claims may relate to contract, patent, environmental, product liability, asbestos exposure, antitrust, employment, securities and other matters arising out of the conduct of PPG’s current and past business activities. To the extent these lawsuits and claims involve personal injury, property damage and certain other claims, PPG believes it has adequate insurance; however, certain of PPG’s insurers are contesting coverage with respect to some of these claims, and other insurers may contest coverage. PPG’s lawsuits and claims against others include claims against insurers and other third parties with respect to actual and contingent losses related to environmental, asbestos and other matters.\nFrom the late 1880’s until the early 1970’s, PPG owned property located in Cadogan and North Buffalo Townships, Pennsylvania which was used for the disposal of solid waste from PPG’s former glass manufacturing facility in Ford City, Pennsylvania. In October 2018, the Pennsylvania Department of Environmental Protection (the “DEP”) approved PPG’s cleanup plan for the Cadogan Property. In April 2019, PPG and the DEP entered into a consent order and agreement (“CO&A”) which incorporated PPG’s approved cleanup plan and a draft final permit for the collection and discharge of seeps emanating from the former disposal area. The CO&A includes a civil penalty of $1.2 million for alleged past unauthorized discharges. PPG’s former disposal area is also the subject of a citizens’ suit filed by the Sierra Club and PennEnvironment seeking remedial measures beyond the measures specified in PPG’s approved cleanup plan, a civil penalty in addition to the penalty included in the CO&A and plaintiffs’ attorneys fees. PPG and the plaintiffs settled plaintiffs’ claims for injunctive relief and PPG agreed to enhancements to the DEP approved cleanup plan and a $250,000 donation to a Pennsylvania nonprofit organization. This settlement has been memorialized by an amendment to the CO&A which was appended to a Consent Agreement between PPG and the plaintiffs which has been entered by the federal court. The remaining claims in the case for attorneys’ fees and a civil penalty are not affected by this settlement. A trial on the issue of a civil penalty under the Clean Water Act was held in June 2024. Following the trial, the parties filed Proposed Findings of Fact and Conclusions of Law and the matter is now ready for a decision by the Court. \n \nWith regard to plaintiffs’ motion for attorneys’ fees, the Court appointed a Special Master to review the parties' positions regarding the amount of fees that should be awarded. \nIn 2006, a lawsuit was filed in Manaus, Brazil, captioned \nDi Gregório Navegação LTDA v. PPG Industries, Inc.\n (the “Di Gregório litigation”).  The lawsuit asserted claims arising from a November 1998 fire on a cargo ship off the coast of Brazil; the lawsuit alleges the fire was caused by PPG chemical products that were part of the ship’s cargo. The plaintiff, a charterer of the ship, brought claims for various alleged damages. This litigation was pending as of July 18, 2012 when PPG and Eagle Spinco Inc. (“Eagle Spinco”) signed a Separation Agreement setting forth the separation of the assets and liabilities of PPG’s commodity chemicals business to an entity to be later identified by Eagle Spinco.  The assets and liabilities identified in the Separation Agreement specifically included all liabilities relating to the Di Gregório litigation. On January 22, 2013, PPG and Eagle US 2, LLC (“Eagle US 2”) signed a Contribution Agreement, by which PPG transferred to Eagle US 2 the assets and liabilities as set forth in the Separation Agreement.  Georgia Gulf Corporation then acquired Eagle Spinco and Eagle US 2 in a merger transaction after which Georgia Gulf was renamed Axiall Corporation (“Axiall”).  Thereafter, Axiall owned Eagle Spinco and Eagle US 2.  Under the terms of the Contribution Agreement, Eagle US 2 acquired the assets and liabilities as defined in the Separation Agreement, including the Di Gregório litigation. In 2016, Westlake Corporation acquired Axiall and its subsidiaries, including Eagle Spinco and Eagle US 2. For convenience, Westlake Corporation, Axiall, Eagle Spinco, and Eagle US 2 collectively are referred to as “Westlake.”\nUnder the Separation Agreement and Contribution Agreement, Eagle US 2 assumed the Di Gregório litigation liability, and Eagle Spinco and Eagle US 2 were required to remove PPG as an obligor for this liability. To the extent PPG was not removed as an obligor, the Separation Agreement provides that Eagle Spinco and Axiall must act as agents or subcontractors of PPG and pay any liability in the matter on PPG’s behalf. The Separation Agreement also provides PPG an uncapped right of indemnification for all damages PPG incurs arising from the Di Gregório litigation and for any breach of the Separation Agreement or Contribution Agreement.\n \nSince 2013, Westlake exclusively has controlled the defense of the Di Gregório litigation. In 2024, PPG learned that Westlake never substituted itself into the case in place of PPG or otherwise informed the Brazilian court that Westlake is the real party in interest and assumed all liability for the matter. On May 30, 2024, Westlake informed PPG that the Brazilian court entered an award against PPG (which remains the nominal defendant) that with prejudgment interest, fees, and costs would total over $700 million. More recently, Westlake informed PPG that it believes simple prejudgment interest applies to the judgment which would result in the final award being approximately $350 million.\n \nWestlake informed PPG that although it will continue to defend the case and pursue an appeal of the award, it will not post any bond, pay any judgment, or take any steps to prevent the plaintiff from attempting to execute on the judgment against PPG.\n2024 PPG ANNUAL REPORT AND FORM 10-K      16\nOn May 17, 2024, Eagle Spinco filed a lawsuit against PPG in Delaware Superior Court alleging breach of the Separation Agreement and requesting declaratory relief (the “Eagle Spinco Lawsuit”). In its lawsuit, Eagle Spinco sought to have the Di Gregório liability determined to be one in which its obligation is only to indemnify PPG for any damages PPG incurs\n \nnet of any insurance coverage available from PPG’s insurers.\n \nOn June 13, 2024, PPG filed a lawsuit against Westlake in the Court of Chancery in Delaware (the “PPG Lawsuit”), asserting claims for specific performance, declaratory relief, breach of contract, and equitable estoppel. The PPG Lawsuit asserts: (a) Westlake assumed all liability for the Di Gregório litigation, (b) Westlake is obligated to remove PPG as an obligor in the litigation and has a continuing duty to act as PPG’s agent to satisfy any award if PPG is not removed as an obligor in the case, (c) Westlake has the duty to pay any award, bond, court fees and other costs awarded in the Di Gregório litigation, (d) Westlake’s obligations are unconditional and not contingent upon the recovery of any insurance proceeds and Westlake did not acquire any right to PPG’s insurance assets, and (e) PPG has an uncapped right of indemnification if Westlake fails to satisfy its obligations under the Separation Agreement and Contribution Agreement.  Eagle Spinco filed counterclaims in the PPG Lawsuit restating the claims originally asserted in the Eagle Spinco Lawsuit, and dismissed the Eagle Spinco Lawsuit.\nPPG intends to vigorously enforce its rights under the Separation Agreement and Contribution Agreement and to hold Westlake accountable for any damages PPG suffers as a result of Westlake’s breach of contract.\n \nThe Delaware Court of Chancery has set a trial date of May 6, 2025 for the PPG Lawsuit. \n \nPPG believes the risk of loss associated with this matter is remote.\nFor many years, PPG has been a defendant in lawsuits involving claims alleging personal injury from exposure to asbestos. For a description of asbestos litigation affecting the Company, see Note 15, “Commitments and Contingent Liabilities” to the accompanying consolidated financial statements in Part I, Item 8 of this Form 10-K.\n2024 PPG ANNUAL REPORT AND FORM 10-K      17\nInformation About Our Executive Officers\nSet forth below is information related to the Company’s executive officers as of February 20, 2025. \nName\nAge\nTitle\nTimothy M. Knavish \n(a)\n59\nChairman and Chief Executive Officer since October 2023\nAnne M. Foulkes \n(b)\n62\nSenior Vice President and General Counsel since September 2018\nVincent J. Morales \n(c)\n59\nSenior Vice President and Chief Financial Officer since March 2017\nK. Henrik Bergström \n(d)\n52\nSenior Vice President, Architectural Coatings, Latin America, EMEA and Asia Pacific since May 2023\nKevin D. Braun \n(e)\n56\nSenior Vice President, Operations since October 2024\nAmy R. Ericson \n(f)\n59\nSenior Vice President, Protective and Marine Coatings since January 2023\nChancey E. Hagerty \n(g)\n51\nSenior Vice President, Automotive Refinish Coatings since May 2023\n(a)\nMr. Knavish served as President and Chief Executive Officer from January 2023 until September 2023. Mr. Knavish served as Chief Operating Officer from March 2022 through December 2022, Executive Vice President from October 2019 through February 2022, Senior Vice President, Architectural Coatings and President, PPG EMEA from January 2019 through September 2019, Senior Vice President, Industrial Coatings from October 2017 through December 2018, Senior Vice President, Automotive Coatings from March 2016 through September 2017, Vice President, Protective and Marine Coatings from August 2012 through February 2016 and Vice President, Automotive Coatings, Americas from March 2010 through July 2012. \n(b)\nMs. Foulkes served as Senior Vice President, General Counsel and Secretary from April 2022 to June 2022 and from August 2018 to September 2018, Vice President and Associate General Counsel and Secretary from March 2016 through July 2018 and Assistant General Counsel and Secretary from April 2011 through February 2016. \n(c)\nMr. Morales served as Vice President, Finance from June 2016 through February 2017. From June 2015 through June 2016, he served as Vice President, Investor Relations and Treasurer and from October 2007 through May 2015 he served as Vice President, Investor Relations.\n(d)\nMr. Bergström served as Vice President, Architectural Coatings, Latin America, EMEA and Asia Pacific from February 2022 through April 2023 and as Vice President Architectural Coatings, Latin America from April 2017 through January 2022.\n(e)\nEffective October 1, 2024, Mr. Braun was named Senior Vice President, Operations. Mr. Braun served as Senior Vice President, Industrial Coatings Segment from May 2023 through September 2024, Vice President, Global Industrial Coatings from January 2020 through April 2023 and as Vice President, Industrial Coatings, Americas from September 2013 through December 2019.\n(f)\nMs. Ericson served as Senior Vice President, Packaging Coatings from July 2018 through December 2022. She served as President of SUEZ Chemical Monitoring and Solutions from 2017 until 2018, President of General Electric Water Services Company from 2015 to 2017 and President and Chief Executive Officer of Alstom SA’s U.S. business from 2013 to 2015.\n(g)\nMr. Hagerty served as Vice President, Global Automotive Refinish Coatings from January 2020 through April 2023 and as Vice President, Global Industrial Coatings from January 2019 through December 2019. \nItem 4. Mine Safety Disclosures\nNot Applicable.\n2024 PPG ANNUAL REPORT AND FORM 10-K      18\nPart II\nItem 5. Market for the Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nThe information required by Item 5 regarding market information, including PPG’s stock exchange listing and quarterly stock market prices, dividends, holders of common stock, and the stock performance graph is included in Exhibit 13.1 filed with this Form 10-K and is incorporated herein by reference.\nIssuer Purchases of Equity Securities - Fourth Quarter 2024\nMonth\nTotal Number of Shares Purchased\nAvg. Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Programs\n \nMax. Number of Shares That May Yet Be Purchased Under the Programs\n(1)\nOctober 2024\n \n \n \nRepurchase program\n— \n$— \n— \n24,177,629 \nNovember 2024\nRepurchase program\n— \n$— \n— \n24,204,845 \nDecember 2024\nRepurchase program\n2,034,464 \n$122.92 \n2,034,464 \n23,108,291 \nTotal quarter ended December 31, 2024\nRepurchase program\n2,034,464\n—\n2,034,464\n23,108,291\n(1)\nIn December 2017, PPG's board of directors approved a $2.5 billion share repurchase program. In April 2024, PPG’s Board of Directors authorized the repurchase of an additional $2.5 billion of outstanding common stock. The remaining shares yet to be purchased under the program has been calculated using PPG’s closing stock price on the last business day of the respective month. The repurchase programs do not have an expiration date.\nItem 6. [Reserved]\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion includes a comparison of our results of operations and liquidity and capital resources for the years ended December 31, 2024, 2023 and 2022. The Company’s financial results have been recast to present the results of the architectural coatings business in the U.S. and Canada as discontinued operations for all periods presented.\nHighlights\nNet sales were approximately $15.8 billion in 2024, a decrease of 2% compared to the prior year, due to sales volumes declining and the combination of unfavorable foreign currency translation and divestitures reducing net sales. Despite decreased  sales due to lower industry demand in automotive OEM coatings, industrial coatings and architectural coatings in Europe, results were supported by record sales in aerospace coatings and growth in several other key technology-driven businesses.\nIncome before income taxes was $1,852 million in 2024, an increase of $162 million compared to the prior year. This increase was primarily due lower raw material costs, lower performance-based compensation costs and restructuring savings, partially offset by overhead inflation and the impact of lower sales volumes.\nPerformance Overview \nNet Sales by Region\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nUnited States and Canada\n$5,352 \n$5,485 \n$5,346 \n(2.4)%\n2.6%\nEurope, Middle East and Africa (EMEA)\n5,386 \n5,617 \n5,458 \n(4.1)%\n2.9%\nAsia Pacific\n2,912 \n2,873 \n2,824 \n1.4%\n1.7%\nLatin America\n2,195 \n2,267 \n1,986 \n(3.2)%\n14.1%\nTotal\n$15,845 \n$16,242 \n$15,614 \n(2.4)%\n4.0%\n2024 vs. 2023\nNet sales decreased $397 million due to the following:\n● Lower sales volumes (-1%)\n● Unfavorable foreign currency translation and divestitures (-1%)\n2024 PPG ANNUAL REPORT AND FORM 10-K      19\nFor specific business results, see the Performance of Reportable Business Segments section within Item 7 of this Form 10-K.  \n2023 vs. 2022\nNet sales increased $628 million due to the following:\n● Higher selling prices (+5%)\n● Favorable foreign currency translation (+1%)\nPartially offset by:\n● Lower sales volumes (-2%)\nFor specific business results, see the Performance of Reportable Business Segments section within Item 7 of this Form 10-K.  \nCost of sales, exclusive of depreciation and amortization\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCost of sales, exclusive of depreciation and amortization\n$9,252 \n$9,678 \n$9,975 \n(4.4)%\n(3.0)%\nCost of sales as a % of net sales\n58.4 \n%\n59.6 \n%\n63.9 \n%\n(1.2)%\n(4.3)%\n2024 vs. 2023\nCost of sales, exclusive of depreciation and amortization, decreased $426 million due to the following:\n● Moderating raw material costs\n● Lower sales volume\n2023 vs. 2022\nCost of sales, exclusive of depreciation and amortization, decreased $297 million due to the following:\n● Moderating raw material costs\n● Lower sales volume\nPartially offset by:\n● Wage and other cost inflation\nSelling, general and administrative expenses\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nSelling, general and administrative expenses\n$3,391 \n$3,401 \n$3,037 \n(0.3)%\n12.0%\nSelling, general and administrative expenses as a % of net sales\n21.4 \n%\n20.9 \n%\n19.5 \n%\n0.5%\n1.4%\n2024 vs. 2023\nSelling, general and administrative expenses decreased $10 million primarily due to:\n● Restructuring cost savings\n● Lower performance-based compensation\nPartially offset by:\n● Wage and other cost inflation\n2023 vs. 2022\nSelling, general and administrative expenses increased $364 million primarily due to:\n● Wage and other cost inflation\n● Unfavorable foreign currency translation\n● Higher performance-based compensation expense\n2024 PPG ANNUAL REPORT AND FORM 10-K      20\n● Selling, general and administrative expenses from acquired businesses\nPartially offset by:\n● Restructuring cost savings\nOther charges and other income\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nInterest expense\n$241 \n$247 \n$167 \n(2.4)%\n47.9%\nInterest income\n($177)\n($140)\n($54)\n26.4%\n159.3%\nBusiness restructuring, net\n$233 \n($2)\n$33 \nN/A\nN/A\nImpairment and other related charges, net\n$146 \n$160 \n$231 \n(8.8)%\n(30.7)%\nPension settlement charge\n$— \n$190 \n$— \nN/A\nN/A\nOther charges/(income), net\n($8)\n$80 \n($66)\nN/A\nN/A\nInterest expense\nInterest expense decreased $6 million in 2024 versus 2023 primarily due to lower debt balances. \nInterest expense increased $80 million in 2023 versus 2022 primarily due to the unfavorable impact of higher interest rates on PPG’s variable debt obligations.\nInterest income\nInterest income increased $37 million  in 2024 versus 2023 primarily due to the favorable impact of higher interest rates.\nInterest income increased $86 million in 2023 versus 2022 primarily due to strong cash generation, resulting in higher levels of cash and cash equivalents, as well as the favorable impact of higher interest rates.\nBusiness restructuring, net\nIn October 2024, the Company approved a comprehensive cost reduction program focused on reducing structural costs primarily in Europe and in certain other global businesses, along with other corporate costs following the divestitures of  PPG’s silicas products business and the architectural coatings business in the U.S. and Canada. In connection with approval of this restructuring program, the Company recorded a pretax restructuring charge of $239 million, representing employee severance and other cash costs. Refer to Note 8, “Business Restructuring” in Item 8 of this Form 10-K for additional information.\nIn 2022, the Company approved a business restructuring plan which included actions to reduce its global cost structure in response to economic conditions, including softening demand in Europe and lower than expected demand recovery in China. In connection with approval of this restructuring program, the Company recorded a pretax restructuring charge of $33 million.\nImpairment and other related charges, net\nDuring 2024, the Company received written approval from Russian regulatory authorities of a definitive agreement to sell the Company’s remaining Russian business. As a result, the Company classified the business as held for sale as of December 31, 2024 and recognized an impairment charge of $146 million, primarily related to accumulated foreign currency translation losses.\nDuring 2023, as a result of its annual impairment testing performed in the fourth quarter, the Company recorded Impairment and other related charges, net of $158 million due to the goodwill impairment recognized for the traffic solutions reporting unit and $2 million to reduce the carrying value of certain indefinite-lived trademarks.\nDuring 2022, the Company recorded Impairment and other related charges, net of $231 million primarily related to the wind down of the Company’s operations in Russia. \nRefer to Note 6, “Goodwill and Other Identifiable Intangible Assets” and Note 7 ”Impairment and Other Related Charges, Net” in Item 8 of this Form 10-K for additional information.\nPension settlement charge\nIn March 2023, the Company purchased group annuity contracts that transferred to third-party insurance companies pension benefit obligations for certain of the Company’s retirees in the U.S. who were receiving their monthly retirement benefit payments from the U.S. pension plan. This transaction resulted in a pension settlement charge of $190 million. Refer to Note 14, “Employee Benefit Plans\" in Item 8 of this Form 10-K for additional information.\n2024 PPG ANNUAL REPORT AND FORM 10-K      21\nOther (income)/charges, net\nOther (income)/charges, net was higher in 2024 compared to 2023 primarily due to a gain recognized on the divestiture of the silicas products business, partially offset by the recognition of accumulated foreign currency translation losses related to the Company’s exit of its Argentina operations. Refer to Note 18, “Other (Income)/Charges, Net” in Item 8 of this Form 10-K for additional information. \nOther (income)/charges, net was lower in 2023 compared to 2022 due to an increase in the non-service cost components of pension and other postretirement benefit expense, an increase in environmental remediation costs and foreign currency losses recognized in Argentina related to a central bank adjustment to official foreign currency rates.\nEffective tax rate and earnings per diluted share, continuing operations\n% Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nIncome tax expense\n$475 \n$428 \n$320 \n11.0%\n33.8%\nEffective tax rate\n25.6 \n%\n25.3 \n%\n23.6 \n%\n0.3%\n1.7%\nAdjusted effective tax rate, continuing operations*\n22.9 \n%\n22.2 \n%\n22.1 \n%\n0.7%\n0.1%\nEarnings per diluted share, continuing operations\n$5.72 \n$5.16 \n$4.24 \n10.9%\n21.7%\nAdjusted earnings per diluted share, continuing operations*\n$7.87 \n$7.42 \n$5.84 \n6.1%\n27.1%\n*See the Regulation G reconciliations - results of operations\nThe effective tax rate on continuing operations for the year ended December 31, 2024 was 25.6%, an increase of 0.3% compared to the prior year. The adjusted effective tax rate was 22.9%, which was higher than the prior year adjusted effective tax rate in part due to the adverse impact of the Pillar 2 global minimum tax.\nThe effective tax rate on continuing operations for the year ended December 31, 2023 was 25.3%, an increase of 1.7% compared to the prior year due in part to the goodwill impairment charge, for which there was no tax benefit. The adjusted effective tax rate for the year ended December 31, 2023 was 22.2%, an increase of 0.1% compared to the prior year.\nEarnings per diluted share from continuing operations for the year ended December 31, 2024 increased year over year primarily due to lower overhead costs, restructuring cost savings and moderating raw material costs, partially offset by lower sales volumes. Earnings per diluted share from continuing operations for the year ended December 31, 2023 increased year over year primarily due to increased selling prices, moderating raw material cost inflation and favorable foreign currency translation impact, partially offset by lower sales volumes. Refer to the Regulation G Reconciliations - Results from Operations for additional information.\nReview and Outlook\nDuring 2024, PPG demonstrated resilience in a challenging industrial macroeconomic environment by growing adjusted EPS, improving aggregate segment margins and generating $1.4 billion in operating cash flow. Net sales were $15.8 billion, a decrease of 2% over the prior year. Results were supported by the breadth and diversity of the business portfolio, as the Company benefited from higher prices in several businesses which was more than offset by unfavorable foreign currency translation, divestitures and lower sales volumes. Net sales, excluding the impact of currency, acquisitions and divestitures (\"organic sales\") decreased 1% during the year with continued strong growth in our aerospace coatings business, which was more than offset by declines in the industrial coatings and automotive OEM coatings businesses. On a regional basis, sales volumes were modestly higher in the Asia Pacific and Latin America regions. Earnings per diluted share from continuing operations was $5.72, compared to $5.16 in the prior year. Adjusted earnings per diluted share was $7.87, up 6% compared to $7.42 in 2023. Combined, segment income increased by 2%. Aggregate segment margins were 70 basis points higher than the prior year, driven by sales of our technology-advantaged products and strong brands.\nDemand for PPG products was mixed by end-use market and geographic region during 2024. Demand for aerospace coatings, which was impacted by mobility restrictions in 2020 and 2021, continues to recover. Global automotive OEM manufacturers’ production decreased by about 1% versus 2023 due to lower demand and extended maintenance periods in the U.S. and Europe. Despite the lower demand, PPG outperformed the market in both Latin America and Asia Pacific. In the U.S. and Canada, demand was strong for aerospace coatings, packaging coatings and traffic solutions but declined for most other businesses. In Latin America, demand was solid throughout the year with steady demand for architectural products and growth in automotive OEM products and packaging coatings. The PPG Comex business made strong contributions, supported by a focus on its omnichannel sales approach. Demand was soft in Europe with the largest impact on the automotive OEM coatings business and the architectural coatings business. In Asia, demand was strong \n2024 PPG ANNUAL REPORT AND FORM 10-K      22\nwith sales volume growth in aerospace coatings, protective and marine coatings, automotive OEM coatings, industrial coatings and packaging coatings.\nWe anticipate a slow start to 2025 as demand in Europe and in global industrial end-use markets remains challenged. Despite the macroeconomic environment, we expect to deliver organic sales growth of a low single-digit percentage for the year. We anticipate demand growth in China, India and Mexico, continued strength in aerospace coatings as well as protective and marine coatings and expect growth in automotive refinish coatings above industry rates. Gaining momentum in infrastructure spending should aid the traffic solutions business in 2025. Global industrial production is expected to be a headwind and remain at a low level in the first quarter with improvement in the Asia Pacific and Latin America regions offset by sluggishness in Europe and in the U.S. In general, most end-use markets do not have significant excess inventories, and any demand improvement should lead to a faster ramp-up of sales volumes.\nSignificant other factors\nDuring the year, PPG successfully executed various strategic initiatives to strengthen the company. In December, the Company completed the divestitures of both the silicas products business and the architectural coatings U.S. and Canada business. These divestitures improve our financial profile, including higher operating margins, and result in a more focused organization which positions the Company to deliver sustainable organic growth. In conjunction with the divestiture of U.S. and Canada architectural coatings business, PPG entered into a supply agreement with the divested business to sell certain products, which will be recognized as Net sales in the refinish coatings, industrial coatings and protective and marine coatings businesses going forward. However, PPG has entered into transition services agreements to provide administrative services subsequent to the sale. The fees for services rendered under the transition services agreements are expected to offset the cost of providing the services.\nPPG made significant progress to reduce costs and improve the profitability of the overall business portfolio through the global restructuring programs that were announced in 2022 and 2023.  Total restructuring savings were approximately $40 million in 2024. In October 2024, the Company approved a comprehensive cost reduction program with anticipated annualized pre-tax savings of approximately $175 million once fully implemented, including savings of $60 million in 2025. The multi-year program is focused on reducing structural costs primarily in Europe and in certain other global businesses, along with other corporate costs following the divestitures of PPG’s silicas products business and the architectural coatings business in the U.S. and Canada. The Company will continue to monitor and manage its cost structure to ensure alignment with the overall demand environment.\nRaw materials are the Company’s most significant input cost. PPG experiences fluctuating energy and raw material costs driven by various factors, including changes in supplier feedstock costs and inventories, global industry activity levels, foreign currency exchange rates, and global supply and demand factors. \nIn 2024, the company incurred wage inflation, which adversely impacted operating costs compared to 2023. There was an ample supply of  commodity-related raw materials in all regions, and raw material costs were a favorable impact to our operating costs for 2024 versus 2023. In 2025, we anticipate that increased raw material costs and enacted tariffs will result in low single-digit percentage inflation.  Additionally, we expect manufacturing efficiencies to improve as the year progresses. \nWe achieved selling price improvement across several businesses in 2024 stemming from our advantaged products and solutions. The Company will carefully monitor all costs during 2025 and assess the need for additional selling price increases.\nIn 2024, foreign currency exchange rates were volatile, with the U.S. dollar strengthening in the second half of the year against certain currencies in the countries within the regions where PPG operates, resulting in a net unfavorable impact to net income from continuing operations of approximately $20 million. We expect that foreign currency exchange rates will have a net unfavorable impact on net income from continuing operations in 2025; however, the Company generally purchases raw materials, incurs manufacturing costs and sells finished goods in the same currency, which reduces foreign currency transaction-related impacts to net income.\nThe 2025 effective tax rate from continuing operations is expected to be in the range of 23% to 25%, varying by quarter. This range is the Company’s best estimate and represents an increase compared to the 2024 adjusted effective tax rate driven by higher rates in certain countries, including the impact of recent global minimum tax standards, and the geographic mix of earnings.\nOver the past four years, the Company used nearly $1.3 billion of cash to repurchase approximately nine million shares of PPG stock, including using $752 million to repurchase shares of PPG stock during 2024. The Company ended the year with approximately $2.8 billion remaining under its current share repurchase authorization. During 2024, the Company deployed $721 million for capital expenditures, $622 million for dividends and $31 million for acquisitions. In 2024, PPG marked the 53rd annual per share dividend increase and the 125th successive year of annual dividend payments.\n2024 PPG ANNUAL REPORT AND FORM 10-K      23\nPPG ended 2024 with approximately $1.4 billion in cash and short-term investments. The Company expects strong cash generation in 2025.\nRegulation G Reconciliations - Results from Operations\nPPG believes investors’ understanding of the Company’s performance is enhanced by the disclosure of net income from continuing operations, earnings per diluted share from continuing operations, PPG’s effective tax rate and segment income adjusted for certain items. PPG’s management considers this information useful in providing insight into the Company’s ongoing performance because it excludes the impact of items that cannot reasonably be expected to recur on a quarterly basis or that are not attributable to our primary operations. Net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate and segment income adjusted for these items are not recognized financial measures determined in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”) and should not be considered a substitute for net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate, segment income or other financial measures as computed in accordance with U.S. GAAP. In addition, adjusted net income, adjusted earnings per diluted share and the adjusted effective tax rate may not be comparable to similarly titled measures as reported by other companies.\nIncome before income taxes from continuing operations is reconciled to adjusted income before income taxes from continuing operations, the effective tax rate from continuing operations is reconciled to the adjusted effective tax rate from continuing operations and net income from continuing operations (attributable to PPG) and earnings per share – assuming dilution (attributable to PPG) are reconciled to adjusted net income from continuing operations (attributable to PPG) and adjusted earnings per share – assuming dilution below.\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2024\nAs reported, continuing operations\n$1,852 \n$475 \n25.6 \n%\n$1,344 \n$5.72 \nIncludes:\nAcquisition-related amortization expense\n132 \n32 \n24.2 \n%\n100 \n0.42 \nBusiness restructuring-related costs, net\n(2)\n377 \n53 \n14.1 \n%\n324 \n1.39 \nPortfolio optimization\n(3)\n59 \n(6)\n(10.2 \n%)\n65 \n0.28 \nLegacy environmental remediation charges\n(4)\n24 \n6 \n25.0 \n%\n18 \n0.07 \nInsurance recoveries\n(7)\n(4)\n(1)\n25.0 \n%\n(3)\n(0.01)\nAdjusted, continuing operations, excluding certain items\n$2,440 \n$559 \n22.9 \n%\n$1,848 \n$7.87 \n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2023\nAs reported, continuing operations\n$1,690 \n$428 \n25.3 \n%\n$1,223 \n$5.16 \nIncludes:\nAcquisition-related amortization expense\n154 \n39 \n25.3 \n%\n115 \n0.48 \nBusiness restructuring-related costs, net\n(2)\n41 \n8 \n19.5 \n%\n33 \n0.14 \nPortfolio optimization\n(3)\n53 \n(7)\n(13.2 \n%)\n58 \n0.24 \nLegacy environmental remediation charges\n(4)\n24 \n7 \n29.2 \n%\n17 \n0.07 \nImpairment and other related charges, net\n(5)\n160 \n— \n— \n%\n160 \n0.67 \nArgentina currency devaluation losses\n(6)\n20 \n(4)\n(20.0 \n%)\n24 \n0.10 \nInsurance recoveries\n(7)\n(16)\n(4)\n25.0 \n%\n(12)\n(0.05)\nPension settlement charge\n(8)\n190 \n46 \n24.2 \n%\n144 \n0.61 \nAdjusted, continuing operations, excluding certain items\n$2,316 \n$513 \n22.2 \n%\n$1,762 \n$7.42 \n2024 PPG ANNUAL REPORT AND FORM 10-K      24\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2022\nAs reported, continuing operations\n$1,355 \n$320 \n23.6 \n%\n$1,007 \n$4.24 \nIncludes:\nAcquisition-related amortization expense\n145 \n35 \n24.1 \n%\n110 \n0.46 \nBusiness restructuring-related costs, net\n(2)\n72 \n18 \n25.3 \n%\n54 \n0.23 \nPortfolio optimization\n(3)\n10 \n(2)\n(20.0 \n%)\n12 \n0.05 \nImpairment and other related charges, net\n(5)\n231 \n29 \n12.7 \n%\n202 \n0.86 \nAdjusted, continuing operations, excluding certain items\n$1,813 \n$400 \n22.1 \n%\n$1,385 \n$5.84 \n(1)\nEarnings per diluted share is calculated based on unrounded numbers. Figures in the table may not recalculate due to rounding.\n(2)\nBusiness restructuring-related costs, net include business restructuring charges, offset by releases related to previously approved programs, which are included in Business restructuring, net on the consolidated statement of income, accelerated depreciation of certain assets, which is included in Depreciation on the consolidated statement of income, and other restructuring-related costs, which are included in Cost of sales, exclusive of depreciation and amortization and Selling, general and administrative on the consolidated statement of income. Business restructuring-related costs, net also includes the fourth quarter 2024 recognition of accumulated foreign currency translation losses of $110 million related to the Company's exit of its Argentina operations in connection with a restructuring program, which are included in Other (income)/charges, net in the consolidated statement of income.  No tax benefit was recorded on the fourth quarter 2024 recognition of the accumulated foreign currency translation losses.  \n(3)\nPortfolio optimization includes gains and losses related to the sale of certain assets, which are included in Other (income)/charges, net on the consolidated statement of income, including the gain of $129 million on the sale of the Company's silicas products business in the fourth quarter 2024, and the losses on the sales of the Company's traffic solutions business in Argentina in the second quarter 2024, the Company's European and Australian Traffic Solutions businesses in the fourth quarter 2023 and the Company's legacy industrial Russian operations in the third quarter 2023. Portfolio optimization includes advisory, legal, accounting, valuation, other professional or consulting fees and certain internal costs directly incurred to effect acquisitions, as well as similar fees and other costs to effect divestitures and other portfolio optimization exit actions. These costs are included in Selling, general and administrative expense on the consolidated statement of income. Portfolio optimization also includes an impairment charge of $146 million recognized during the fourth quarter 2024 when the Company's remaining operations in Russia were classified as held for sale, which is included in Impairment and other related charges, net on the consolidated statement of income.  No tax benefit was recorded on the fourth quarter 2024 impairment charge.\n(4)\nLegacy environmental remediation charges represent environmental remediation costs at certain non-operating PPG manufacturing sites. These charges are included in Other (income)/charges, net in the consolidated statement of income.\n(5)\nIn the fourth quarter 2023, the Company recorded impairment and other related charges due to a non-cash goodwill impairment recognized for the Traffic Solutions reporting unit as a result of its annual goodwill impairment test. The fair value of the Traffic Solutions reporting unit decreased primarily due to increases in the cost of capital (discount rate assumption) and declines in the reporting unit’s long-term forecast driven by challenges at its operations in Argentina due to the highly inflationary environment and changes to the reporting unit’s global footprint, including the fourth quarter 2023 divestiture of its European and Australian businesses. In 2022, the Company recorded impairment and other related charges due to the wind down of the Company’s operations in Russia.\n(6)\nIn December 2023, the central bank of Argentina adjusted the official foreign currency exchange rate for the Argentine peso, significantly devaluing the currency relative to the United States dollar. Argentina currency devaluation losses represent foreign currency translation losses recognized during December 2023 related to the devaluation of the Argentine peso, which is included in Other charges/(income), net on the consolidated statement of income.\n(7)\nIn the fourth quarter 2024 and the fourth quarter 2023, the Company received reimbursement for previously approved insurance claims under policies covering legacy asbestos-related matters. In the first quarter 2023, the Company received reimbursement under its insurance policies for damages incurred at a southern U.S. factory from a winter storm in 2020. These insurance recoveries are included in Other charges/(income), net on the consolidated statement of income.\n(8)\nIn the first quarter 2023, PPG purchased group annuity contracts that transferred pension benefit obligations for certain of the Company’s retirees in the U.S. to third-party insurance companies, resulting in a non-cash pension settlement charge.\nPerformance of Reportable Business Segments\nGlobal Architectural Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$\n3,921\n \n$\n4,021\n \n$\n3,852\n \n($100)\n$169\n(2.5)%\n4.4%\nSegment income\n$\n678\n \n$\n673\n \n$\n558\n \n$5\n$115\n0.7%\n20.6%\nDepreciation and amortization expense\n$\n104\n \n$\n101\n \n$\n102\n \n$3\n($1)\n3.0%\n(1.0)%\nSegment income before interest, taxes, depreciation and amortization (EBITDA)\n$782 \n$774 \n$660 \n$8\n$114\n1.0%\n17.3%\n2024 PPG ANNUAL REPORT AND FORM 10-K      25\n2024 vs. 2023\nGlobal Architectural Coatings net sales decreased due to the following: \n● Lower sales volumes (-2%)\n● Foreign currency translation (-1%)\nPartially offset by:\n● Higher selling prices (+1%)\nThe Global Architectural Coatings segment, which was previously reported as part of the Performance Coatings segment, is comprised of architectural coatings Europe, Middle East and Africa (EMEA) and architectural coatings Latin America and Asia Pacific. Net sales decreased during 2024, primarily driven by lower sales volumes.\nArchitectural coatings EMEA organic sales decreased by a low single-digit percentage year over year due to lower sales volumes partially offset by higher selling prices. Consumer confidence remained weak, and regional demand was uneven by country. Demand declined in all sub-regions in the fourth quarter; however, sales were higher for the full year in eastern and central Europe.\nArchitectural coatings Latin America and Asia Pacific organic sales were flat during the year primarily due to lower sales volumes offset by higher selling prices. In Mexico, architectural coatings organic sales increased compared to the prior year, as concessionaire network demand continued to be strong throughout 2024.\nSegment income increased $5 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\n2023 vs. 2022\nGlobal Architectural Coatings net sales increased due to the following: \n● Higher selling prices (+6%)\n● Foreign currency translation (+4%)\nPartially offset by:\n● Lower sales volumes (-5%)\n● Divestitures (-1%)\nIn 2023, the Global Architectural Coatings business achieved organic sales growth of 1% as higher prices in all regions offset lower sales volumes.\nArchitectural coatings EMEA organic sales were flat year over year, with higher selling prices offset by lower sales volumes. Regional demand remained uneven by country, and positive sales trends occurred in some countries, including the United Kingdom, Poland and the Netherlands. \nArchitectural coatings Latin America and Asia Pacific organic sales increased during the year due to selling price increases. In Mexico, the concessionaire network demand was strong throughout 2023.\nSegment income increased $115 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\nLooking Ahead\nIn the first quarter 2025, demand in Mexico is expected to continue to be robust, and consumer sentiment in Europe is expected to be tepid. Aggregate organic sales for the segment are expected to be in the range of flat to an increase of a low single-digit percentage compared to the first quarter 2024.\nPerformance Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$5,237 \n$5,132 \n$4,792 \n$105\n$340\n2.0%\n7.1%\nSegment income\n$1,142 \n$1,019 \n$847 \n$123\n$172\n12.1%\n20.3%\nDepreciation and amortization expense\n$132 \n$139 \n$142 \n($7)\n($3)\n(5.0)%\n(2.1)%\nSegment EBITDA\n$1,274 \n$1,158 \n$989 \n$116\n$169\n10.0%\n17.1%\n2024 PPG ANNUAL REPORT AND FORM 10-K      26\n2024 vs. 2023\nPerformance Coatings net sales increased due to the following: \n● Higher selling prices (+3%)\n● Higher sales volumes (+1%)\nPartially offset by:\n● Divestiture-related sales and other (-2%)\nNet sales for the Performance Coatings segment, which is now comprised of aerospace coatings, automotive refinish coatings, protective and marine coatings, and traffic solutions, increased 2% during 2024. This increase was driven by higher selling prices and sales volumes, partially offset by the divestitures of the non-North American portion of the traffic solutions business.\nOrganic sales in automotive refinish coatings were flat year-over-year with sales volume declines offset by higher selling prices. In the U.S., sales volumes declined with benefits from share gains more than offset by lower industry collision claims. In Europe, organic sales increased modestly year over year driven by price. In China, demand for refinish products is recovering and is expected to improve.\nAerospace coatings organic sales increased by a double-digit percentage driven by increases in both price and sales volume in all regions. Demand remained strong and customer order backlogs are at similar levels to the prior year. Global air travel has improved year over year, but domestic flights remain about 3% below pre-pandemic levels. The Company remains focused on debottlenecking and expanding manufacturing capabilities to drive volume and earnings growth.\nProtective and marine coatings organic sales increased by a low single-digit percentage compared to the prior year driven by higher sales volumes in Europe and Asia.\nTraffic solutions organic sales increased by a low single-digit percentage year over year due to higher sales volumes, which benefited from market share gains across North America.\nSegment income increased $123 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation.\n2023 vs. 2022\nPerformance Coatings net sales increased due to the following: \n● Higher selling prices (+7%)\nIn 2023, all businesses within the Performance Coatings reportable business segment achieved higher selling prices. \nAutomotive refinish coatings organic sales increased a low single-digit percentage year over year. Price gains in all regions and sales volume growth in the Latin America and Asia Pacific regions were partially offset by lower sales volumes in all other regions. \nAerospace coatings organic sales were higher by 20% driven by increases in both price and volume. This strong organic sales growth was achieved despite global air travel remaining below pre-pandemic levels. \nProtective and marine coatings organic sales increased by a mid-single-digit percentage driven by solid selling price realization and higher sales volumes. \nTraffic solutions organic sales decreased by a mid-single-digit percentage year over year, with sales volume declines in all regions. \nSegment income increased $172 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\nLooking Ahead\nIn the first quarter 2025, continued strength in aerospace coatings and protective and marine coatings is expected, as well as growth in automotive refinish coatings above industry rates. Traffic solutions is expected to follow typical seasonal trends and is well positioned to continue to benefit in the coming years from increased U.S. infrastructure spending. First quarter aggregate organic sales for the Performance Coatings segment are anticipated to increase by a low single-digit percentage to a mid-single-digit percentage compared to the first quarter 2024.\n2024 PPG ANNUAL REPORT AND FORM 10-K      27\nIndustrial Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$6,687 \n$7,089 \n$6,970 \n($402)\n$119\n(5.7)%\n1.7%\nSegment income\n$893 \n$968 \n$646 \n($75)\n$322\n(7.7)%\n49.8%\nDepreciation and amortization expense\n$206 \n$213 \n$207 \n($7)\n$6\n(3.3)%\n2.9%\nSegment EBITDA\n$1,099 \n$1,181 \n$853 \n($82)\n$328\n(6.9)%\n38.5%\n2024 vs. 2023\nIndustrial Coatings segment net sales decreased due to the following:\n● Lower selling prices (-3%)\n● Lower sales volumes (-2%)\n● Unfavorable foreign currency translation and the silicas products business divestiture (-1%)\nIn 2024, Industrial Coatings segment Net sales decreased due to lower selling prices and lower sales volume driven by lower industry demand.\nAutomotive OEM coatings organic sales decreased by a high single-digit percentage year over year driven by lower sales volumes and lower indexed-based selling prices for certain customer contracts. Sales volume increases in the Latin America and Asia Pacific regions were more than offset by declines in the U.S. and Europe. \nFor the industrial coatings business, organic sales decreased by a mid-single-digit percentage due to lower selling prices and lower sales volumes driven by softening global industrial demand.\nPackaging coatings organic sales increased by a low single-digit percentage year over year due to higher sales volumes in all regions, partially offset by lower selling prices in all regions.\nSpecialty products organic sales increased by a mid-single-digit percentage primarily due to higher sales volumes, partially offset by lower selling prices.\nSegment income decreased $75 million year over year primarily due to lower selling prices, lower sales volumes and wage and other cost inflation, partially offset by moderating raw material costs and lower overhead costs, including restructuring savings.\n2023 vs. 2022\nIndustrial Coatings net sales increased due to the following: \n● Higher selling prices (+4%)\nPartially offset by:\n● Lower sales volumes (-2%)\nIn 2023, all businesses within the Industrial Coatings reportable business segment achieved higher selling prices, which helped to offset a decrease in sales volumes driven by lower global industrial production. \nAutomotive OEM coatings organic sales increased by a high single-digit percentage year over year driven by higher selling prices and strong sales volume growth in most regions. Sales volume growth was led by the EMEA and Asia Pacific regions. \nFor the industrial coatings business, organic sales decreased by a mid-single-digit percentage year over year as higher selling prices were more than offset by lower sales volumes in all regions due to softening global industrial demand. \nPackaging coatings organic sales decreased by a mid-single-digit percentage year over year due to lower sales volumes in all regions due to broad demand weakness. These sales volume decreases were partially offset by higher selling prices in most regions. \nSpecialty coatings and materials organic sales decreased by a mid-single-digit percentage primarily due to lower sales volumes, partially offset by higher selling prices. \nSegment income increased $322 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost of sales inflation and lower sales volumes.\n2024 PPG ANNUAL REPORT AND FORM 10-K      28\nLooking Ahead\nIn the first quarter 2025, global industrial production is expected to remain at a relatively low level with improvement in the Asia Pacific and Latin America regions offset by sluggishness in Europe and in the U.S. Demand growth for PPG's industrial coatings in China is expected to continue for the next several quarters. Automotive OEM industry build rates are expected to decline in the first quarter, but are expected to outpace market growth in Latin America and the Asia Pacific region. Aggregate organic sales for the segment are anticipated to decrease by a mid-single-digit percentage to a low single-digit percentage compared to the first quarter 2024.\nCommitments and Contingent Liabilities, including Environmental Matters\nPPG is involved in a number of lawsuits and claims, both actual and potential, including some that it has asserted against others, in which substantial monetary damages are sought. Refer to Item 3. “Legal Proceedings” and Note 15, “Commitments and Contingent Liabilities” in Item 8 of this Form 10-K for a description of certain of these lawsuits.\nAs discussed in Item 3 and Note 15, although the result of any future litigation of such lawsuits and claims is inherently unpredictable, management believes that, in the aggregate, the outcome of all lawsuits and claims involving PPG, including asbestos-related claims, will not have a material effect on PPG’s consolidated financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized.\nAs also discussed in Note 15, PPG has significant reserves for environmental contingencies. Refer to the Environmental Matters section of Note 15 for details of these reserves. It is PPG’s policy to accrue expenses for contingencies when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. Reserves for environmental contingencies are exclusive of claims against third parties and are generally not discounted. In management’s opinion, the Company operates in an environmentally sound manner and the outcome of the Company’s environmental contingencies will not have a material effect on PPG’s financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized. Management anticipates that the resolution of the Company’s environmental contingencies will occur over an extended period of time. \nAccounting Standards Adopted in 2024 \nNote 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K describes the Company’s recently adopted accounting pronouncements.\nAccounting Standards to be Adopted in Future Years\nNote 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K describes accounting pronouncements that have been promulgated prior to December 31, 2024 but are not effective until a future date.\nLiquidity and Capital Resources\nDuring the past two years, PPG had sufficient financial resources to meet its operating requirements, to fund capital spending, including acquisitions, share repurchases and pension plans, and to pay increasing dividends to shareholders.\nCash and cash equivalents and short-term investments\n($ in millions)\n2024\n2023\nCash and cash equivalents\n$1,270 \n$1,493 \nShort-term investments\n88 \n75 \nTotal\n$1,358 \n$1,568 \nCash from operating activities - continuing operations\n($ in millions, except percentages)\n% Change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash from operating activities - continuing operations\n$1,391 \n$2,294 \n$1,000 \n(39.4)%\n129.4%\n2024 vs. 2023\nThe $903 million decrease in Cash from operating activities - continuing operations was primarily due to unfavorable changes in working capital compared to the prior year. Accrued incentive compensation was lower at December 31, 2024 versus December 31, 2023, driving operating cash outflows during 2024 compared to 2023. The Company paid an additional $80 million in cash taxes during 2024 related to divestitures, primarily due to the taxable gain recognized on the sale of the silicas products business. The Company also recorded operating cash outflows of $55 million related to net \n2024 PPG ANNUAL REPORT AND FORM 10-K      29\npayables paid on behalf of the divested United States and Canada architectural coatings business during 2024 that were reimbursed in 2025. \n2023 vs. 2022\nThe $1,294 million increase in Cash from operating activities - continuing operations was primarily due to higher net income driven by higher selling prices and moderating raw material costs and favorable changes in working capital compared to the prior year.\nOperating working capital\nOperating working capital is a subset of total working capital and represents (1) receivables from customers, net of allowance for doubtful accounts, (2) inventories, and (3) trade liabilities. Refer to Note 3, “Working Capital Detail” in Item 8 of this Form 10-K for further information related to the components of the Company’s operating working capital. We believe operating working capital represents the key components of working capital under the operating control of our businesses.\nA key metric we use to measure our working capital management is operating working capital as a percentage of sales (fourth quarter sales annualized). \n($ in millions, except percentages)\n2024\n2023\nTrade receivables, net\n$2,477 \n$2,622 \nInventories, FIFO\n2,015 \n2,117 \nTrade creditors’ liabilities\n2,161 \n2,438 \nOperating working capital\n$2,331 \n$2,301 \nOperating working capital as a % of fourth quarter sales, annualized\n15.6 \n%\n14.7 \n%\nTrade receivables, net as a % of fourth quarter sales, annualized\n16.6 \n%\n16.8 \n%\nDays sales outstanding\n51 \n55 \nInventories, FIFO as a % of fourth quarter sales, annualized\n13.5 \n%\n13.5 \n%\nInventory turnover\n4.5 \n4.2 \nEnvironmental expenditures\n($ in millions)\n2024\n2023\n2022\nCash outlays related to environmental remediation activities\n$28 \n$31 \n$73 \nWe expect cash outlays for environmental remediation activities to be between $20 million to $60 million annually from 2025 through 2029.\nCash used for investing activities - continuing operations\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash used for investing activities - continuing operations\n$399 \n$525 \n$430 \n(24.0)%\n22.1%\n2024 vs. 2023\nThe $126 million decrease in cash used for investing activities - continuing operations was primarily due to proceeds from the sale of our silicas products business, partially offset by higher capital expenditures. \n2023 vs. 2022\nThe $95 million increase in cash used for investing activities was primarily due to higher capital expenditures and lower proceeds from asset sales. \n2024 PPG ANNUAL REPORT AND FORM 10-K      30\nCapital expenditures, including business acquisitions\n \n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCapital expenditures \n(1)\n$721 \n$516 \n$486 \n39.7%\n6.2%\nBusiness acquisitions, net of cash balances acquired\n$31 \n$109 \n$114 \n(71.6)%\n(4.4)%\nTotal capital expenditures, including acquisitions\n$752 \n$625 \n$600 \n20.3%\n4.2%\nCapital expenditures, excluding acquisitions, as a % of sales\n4.6 \n%\n3.2 \n%\n3.1 \n%\n43.8%\n3.2%\n(1)\nIncludes modernization and productivity improvements, expansion of existing businesses and environmental control projects.\nDuring 2025, capital expenditures, which are expected to be approximately $725 million to $775 million, will support future organic growth opportunities. The Company will continue to deploy cash focused on shareholder value creation.\nCash used for financing activities\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash used for financing activities\n$1,425 \n$1,550 \n$409 \n(8.1)%\n279.0%\n2024 vs. 2023\nThe $125 million decrease in cash used for financing activities was primarily due to lower repayments of long-term debt, partially offset by higher share repurchases.\n2023 vs. 2022\nThe $1,141 million increase in cash used for financing activities was primarily due to repayment of long-term debt and lower proceeds from the issuance of debt, partially offset by the absence of net payments on commercial paper.\nShare repurchase activity\n($ in millions, except number of shares)\n2024\n2023\n2022\nNumber of shares repurchased (millions)\n5.8\n0.6 \n1.5 \nCash paid for shares repurchased\n$752 \n$86 \n$190 \nThe Company has approximately $2.8 billion remaining under the current authorization from the Board of Directors. The Board of Directors authorized $2.5 billion of share repurchases in December 2017 and authorized an additional $2.5 billion of share repurchases in April 2024. The repurchase programs do not have an expiration date.\nDividends paid to shareholders\n($ in millions)\n2024\n2023\n2022\nDividends paid to shareholders\n$622 \n$598 \n$570 \nPPG has paid uninterrupted annual dividends since 1899, and 2024 marked the 53rd successive year of increased annual per-share dividend payments to shareholders. The Company raised its per-share quarterly dividend by approximately 5% to $0.68 per share in July 2024.\nDebt issued and repaid\nDebt Issued (net of premium/discount and issuance costs)\nYear\n$ in millions\nTerm Loan Credit Agreement, due 2026\n2024\n$274 \nTerm Loan Credit Agreement, due 2026\n2023\n$550 \n1.875% notes (€300) due 2025\n2022\n$319 \n2.750% notes (€700) due 2029\n2022\n$742 \n1.95% note (€50) due 2037\n2022\n$55 \nDebt Repaid\nYear\n$ in millions\n2.4% notes ($300)\n2024\n$300 \n3.2% notes ($300)\n2023\n$300 \nTerm Loan Credit Agreement, due 2024\n2023\n$1,100 \nTerm Loan Credit Agreement, due 2024\n2022\n$300 \nAcquired debt\n2022\n$2 \n2024 PPG ANNUAL REPORT AND FORM 10-K      31\nThe Company’s commercial paper borrowings are classified as long-term debt based on PPG’s intent and ability to refinance these borrowings on a long-term basis. Net payments on commercial paper were zero for both the years ended December 31, 2024 and December 31, 2023 and $440 million for the year ended December 31, 2022. \nCredit agreements and lines of credit\nIn April 2023, PPG entered into a €500 million term loan credit agreement (the \"Term Loan\"). The Term Loan contains covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan terminates and all amounts outstanding are payable in April 2026. In April 2023, PPG borrowed €500 million under the Term Loan. In December 2023, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €250 million. In January 2024, PPG borrowed the additional €250 million. In December 2024, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €300 million. In January 2025, PPG borrowed the additional €300 million. \nIn February 2021, PPG entered into a $2.0 billion term loan credit agreement (the \"Term Loan Credit Agreement\") to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. The Term Loan Credit Agreement provided the Company with the ability to borrow up to an aggregate principal amount of $2.0 billion on an unsecured basis. The Term Loan Credit Agreement contained covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which included, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan Credit Agreement was scheduled to mature and all outstanding borrowings were due and payable on the third anniversary of the date of the initial borrowing under the Agreement. In June 2021, PPG borrowed $700 million under the Term Loan Credit Agreement to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. In December 2021, PPG borrowed an additional $700 million under the Term Loan Credit Agreement to be used for working capital and general corporate purposes.  In 2022 and 2023, PPG repaid $300 million and $1.1 billion, respectively, of the Term Loan Credit Agreement using cash on hand. The Term Loan Credit Agreement was fully repaid as of December 31, 2023. \nIn March 2023, PPG amended its five-year credit agreement (the “Credit Agreement”) dated as of August 30, 2019. The amendments to the Credit Agreement replaced the LIBOR-based reference interest rate option with a reference interest rate option based upon Term SOFR. The other terms of the Credit Agreement remained unchanged. In July 2023, PPG amended and restated the Credit Agreement, extending the term through July 27, 2028. The amended and restated Credit Agreement provides for a $2.3 billion unsecured revolving credit facility. The Company has the ability to increase the size of the Credit Agreement by up to an additional $750 million, subject to the receipt of lender commitments and other conditions precedent. The Company has the right, subject to certain conditions set forth in the Credit Agreement, to designate certain subsidiaries of the Company as borrowers under the Credit Agreement. In connection with any such designation, the Company is required to guarantee the obligations of any such subsidiaries under the Credit Agreement. There were no amounts outstanding under the Credit Agreement as of December 31, 2024, December 31, 2023 and December 31, 2022.\nThe Term Loan and the Credit Agreement require the Company to maintain a ratio of Total Indebtedness to Total Capitalization, as defined in the Term Loan and the Credit Agreement, of 60% or less; provided, that for any fiscal quarter in which the Company has made an acquisition for consideration in excess of $1 billion and for the next five fiscal quarters thereafter, the ratio of Total Indebtedness to Total Capitalization may not exceed 65% at any time. As of December 31, 2024, Total Indebtedness to Total Capitalization as defined under the Credit Agreement and the Term Loan was 45%. \nIn addition to the amounts available under lines of credit, the Company maintains access to the capital markets and may issue debt or equity securities from time to time, which may provide an additional source of liquidity. \nRefer to Note 10, “Borrowings and Lines of Credit” in Item 8 of this Form 10-K for information regarding notes entered into and repaid as well as details regarding the use and availability of committed and uncommitted lines of credit, letters of credit and debt covenants.\n2024 PPG ANNUAL REPORT AND FORM 10-K      32\nCash requirements\nWe continue to believe that our cash on hand and short-term investments, cash from operations and the Company’s access to capital markets will continue to be sufficient to fund our operating activities, capital spending, acquisitions, dividend payments, debt service, share repurchases, contributions to pension plans, and PPG’s significant cash requirements. The Company’s significant cash requirements include the following contractual obligations and commitments.\n \nObligations Due In:\n($ in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nLong-term debt\n$5,808 \n$933 \n$2,095 \n$1,888 \n$892 \nInterest payments\n(1)\n$832 \n$127 \n$220 \n$153 \n$332 \nOperating leases\n(2)\n$653 \n$144 \n$208 \n$127 \n$174 \nUnconditional purchase commitments\n(3)\n$218 \n$108 \n$82 \n$23 \n$5 \n(1)\nInterest on all outstanding debt.\n(2)\nIncludes interest payments.\n(3)\nThe unconditional purchase commitments are principally take-or-pay obligations related to the purchase of certain materials, utilities and services consistent with customary industry practice.\nThe Company’s off-balance sheet arrangements include unconditional purchase commitments disclosed in the “Liquidity and Capital Resources” section in the cash requirements table as well as letters of credit as discussed in Note 10, “Borrowings and Lines of Credit” in Item 8 of this Form 10-K.\nOther liquidity matters\nAt December 31, 2024, the total amount of unrecognized tax benefits for uncertain tax positions, including an accrual of related interest and penalties along with positions only impacting the timing of ta\nx benefits, was $152 million. The timing of payments will depend on the progress of examinations by tax authorities. PPG does not expect a significant tax p\nayment related to these obligations within the next year. The Company is unable to make a reasonably reliable estimate as to if, or when, any significant cash settlements with tax authorities may occur.\nCritical Accounting Estimates\nManagement has evaluated the accounting policies used in the preparation of the financial statements and related notes presented in Item 8 of this Form 10-K and believes those policies to be reasonable and appropriate. We believe that the most critical accounting estimates made in the preparation of our financial statements are those related to accounting for contingencies, under which we accrue a loss when it is probable that a liability has been incurred and the amount can be reasonably estimated, and to accounting for pensions, other postretirement benefits, business combinations, goodwill and other identifiable intangible assets with indefinite lives because of the importance of management judgment in making the estimates necessary to apply these policies.\nContingencies\nContingencies, by their nature, relate to uncertainties that require management to exercise judgment both in assessing the likelihood that a liability has been incurred as well as in estimating the amount of potential loss. The most important contingencies impacting our financial statements are those related to environmental remediation, to pending, impending or overtly threatened litigation against the Company and to the resolution of matters related to open tax years. For more information on these matters, see Note 15, “Commitments and Contingent Liabilities” and Note 13, “Income Taxes” in Item 8 of this Form 10-K.\nDefined Benefit Pension and Other Postretirement Benefit Plans\nAccounting for pensions and other postretirement benefits involves estimating the cost of benefits to be provided well into the future and attributing that cost over the time period each employee works. To accomplish this, we make extensive use of assumptions about inflation, investment returns, mortality, turnover, medical costs and discount rates. The Company has established a process by which management reviews and selects these assumptions annually. Refer to Note 14, “Employee Benefit Plans” in Item 8 of this Form 10-K for information on these plans and the assumptions used.\nBusiness Combinations\nThe Company uses the acquisition method of accounting to allocate costs of acquired businesses to the assets acquired and liabilities assumed based on their estimated fair values at the dates of acquisition. The excess costs of acquired businesses over the fair values of the assets acquired and liabilities assumed is recognized as goodwill. The valuations of the acquired assets and liabilities impacts the determination of future operating results. In addition to using management estimates and negotiated amounts, the Company uses a variety of information sources to determine the estimated fair values of acquired assets and liabilities including: third-party appraisals for the estimated value and lives of identifiable \n2024 PPG ANNUAL REPORT AND FORM 10-K      33\nintangible assets and property, plant and equipment; third-party actuaries for the estimated obligations of defined benefit pension plans and similar benefit obligations; and legal counsel or other experts to assess the obligations associated with legal, environmental and other contingent liabilities. \nThe business and technical judgment of management is used in determining wh\nich acquired intangible assets have indefinite lives and in determining the useful lives of acquired finite-lived intangible assets in accordance with the accounting guidance for goodwill and other intangible assets.\nGoodwill and Intangible Assets\nThe Company tests indefinite-lived intangible assets and goodwill for impairment by either performing a qualitative evaluation or a quantitative test at least annually, or more frequently if an indication of impairment arises. The qualitative evaluation is an assessment of factors to determine whether it is more likely than not that the fair value of a reporting unit or asset is less than its carrying amount. In the quantitative test, fair values are estimated using a discounted cash flow model. Key assumptions and estimates used in the discounted cash flow model include projected future revenues, discount rates, operating cash flows, capital expenditures and tax rates. For more information on these matters, see Note 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K. \nWe believe that the amounts recorded in the financial statements in Item 8 of this Form 10-K related to these contingencies, pensions, other postretirement benefits, business combinations, goodwill and other identifiable intangible assets with indefinite lives are based on the best estimates and judgments of the appropriate members of PPG’s management, although actual outcomes could differ from our estimates.\nCurrency\nComparing spot exchange rates at December 31, 2024 and at December 31, 2023, the U.S. dollar strengthened against the currencies of many countries within the regions PPG operates, most notably the Mexican peso. As a result, consolidated net assets at December 31, 2024 decreased by $905 million from December 31, 2023. Comparing spot exchange rates at December 31, 2023 and at December 31, 2022, the U.S. dollar weakened against the currencies of many countries within the regions PPG operates, most notably the Mexican peso. As a result, consolidated net assets at December 31, 2023 increased by $508 million from December 31, 2022.\nComparing average exchange rates during 2024 to those of 2023, the U.S. dollar strengthened against the currencies of certain countries where PPG operates, including the Mexican peso and the Chinese yuan. This had an unfavorable impact of approximately $20 million on full year 2024 Income before income taxes from the translation of this foreign income into U.S. dollars. Comparing average exchange rates during 2023 to those of 2022, the U.S. dollar weakened against the currencies of certain countries where PPG operates, including the Mexican peso and the euro, partially offset by strengthening against the Chinese yuan and Argentine peso. This had a favorable impact of approximately $25 million on full year 2023 Income before income taxes from the translation of this foreign income into U.S. dollars.\nForward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements made by or on behalf of the Company. Management’s Discussion and Analysis and other sections of this Annual Report contain forward-looking statements that reflect the Company’s current views with respect to future events and financial performance. You can identify forward-looking statements by the fact that they do not relate strictly to current or historic facts. Forward-looking statements are identified by the use of the words “aim,” “believe,” “expect,” “anticipate,” “intend,” “estimate,” “project,” “outlook,” “forecast” and other expressions that indicate future events and trends. Any forward-looking statement speaks only as of the date on which such statement is made, and the Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. You are advised, however, to consult any further disclosures we make on related subjects in our reports to the SEC. Also, note the following cautionary statements.\nMany factors could cause actual results to differ materially from the Company’s forward-looking statements. Such factors include statements related to global economic conditions, geopolitical issues, increasing price and product competition by our competitors, fluctuations in cost and availability of raw materials, energy, labor and logistics, the ability to achieve selling price increases, the ability to recover margins, customer inventory levels, PPG inventory levels, our ability to maintain favorable supplier relationships and arrangements, the timing of and the realization of anticipated cost savings from restructuring initiatives, the ability to identify additional cost savings opportunities, the timing and expected benefits of our acquisitions, difficulties in integrating acquired businesses and achieving expected synergies therefrom, the amount of future share repurchases, economic and political conditions in the markets we serve, the imposition of tariffs, the ability to penetrate existing, developing and emerging foreign and domestic markets, foreign exchange rates and fluctuations in such rates, fluctuations in tax rates, the impact of future legislation, the impact of environmental regulations, unexpected business disruptions, cybersecurity events, global human health issues, the unpredictability of existing and possible future \n2024 PPG ANNUAL REPORT AND FORM 10-K      34\nlitigation, including asbestos litigation, and government investigations. However, it is not possible to predict or identify all such factors.\nConsequently, while the list of factors presented here and in",
    "item1a": "Item 1A of this Form 10-K and similar risks, any of which could have a material adverse effect on the Company’s consolidated financial condition, results of operations or liquidity. PPG undertakes no obligation to update any forward-looking statement, except as otherwise required by applicable law.\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nPPG is exposed to market risks related to changes in foreign currency exchange rates and interest rates. The Company may enter into derivative financial instrument transactions in order to manage or reduce these market risks. A detailed description of these exposures and the Company’s risk management policies are provided in Note 11, “Financial Instruments, Hedging Activities and Fair Value Measurements” in Item 8 of this Form 10-K.\nThe following disclosures summarize PPG’s exposure to market risks and information regarding the use of and fair value of derivatives employed to manage its exposure to such risks. Quantitative sensitivity analyses have been provided to reflect how reasonably possible, unfavorable changes in market rates could impact PPG’s consolidated results of operations, cash flows and financial position.\nForeign Currency Risk\nWe conduct operations in many countries around the world. Our results of operations are subject to both currency transaction and currency translation risk. Certain foreign currency forward contracts outstanding during 2024 and 2023 served as a hedge of a portion of PPG’s exposure to foreign currency transaction risk. The fair value of these contracts were net liabilities of $53 million and net assets of $23 million as\n of December 31, 2024 \nand\n December 31, 2023, respectively\n. The potential reduction in PPG’s Income before income taxes resulting from the impact of adverse changes in exchange rates on the fair value of its outstanding foreign currency hedge contracts of 10% for European and Canadian currencies and 20% for Asian and Latin American currencies for the years ended December 31, 2024 and 2023 would have been $429 million and $402 million, respectively.\nPPG had U.S. dollar to euro cross currency swap contracts with a total notional amount of $375 million and $475 million as of \nDecember 31, 2024\n and \nDecember 31, 2023, respectively\n. The fair value of these contracts were net assets of $50 million and $33 million as of December 31, 2024 and 2023, respectively. A 10% increase in the value of the euro to the U.S. dollar would have had an unfavorable effect on the fair value of these swap contracts by reducing the value of these instruments by $31 million and $46 million at December 31, 2024 and 2023, respectively.\nAs of both December 31, 2024 and 2023, PPG had non-U.S. dollar denominated debt outstanding of $3.3 billion. A weakening of the U.S. dollar by 10% against European currencies and by 20% against Asian and South American currencies would have resulted in unrealized translation losses of $369 million and $363 million as of December 31, 2024 and 2023, respectively.\nInterest Rate Risk\nThe Company manages its interest rate risk by balancing its exposure to fixed and variable rates while attempting to minimize its interest costs. PPG has interest rate swaps which converted $375 million of fixed rate debt to variable rate debt as of both December 31, 2024 and December 31, 2023, respectively. The fair values of these contracts were liabilities of $16 million and $14 million as of December 31, 2024 and 2023, respectively. An increase in variable interest rates of 10% would have lowered the fair values of these swaps and increased interest expense by $5 million for both the periods ended December 31, 2024 and 2023. Considering the debt balance outstanding as of December 31, 2024 and 2023, a 10% increase in interest rates in the U.S., Canada, Mexico and Europe and a 20% increase in interest rates in Asia and South America would have increased annual interest expense associated with PPG's variable rate debt obligations by $3 million and by $2 million, respectively. Further, a 10% reduction in interest rates would have increased the fair value of the Company’s fixed rate debt by approximately $77 million and $96 million as of December 31, 2024 and 2023, respectively; however, such changes would not have had an effect on PPG’s annual Income before income taxes or cash flows.\n2024 PPG ANNUAL REPORT AND FORM 10-K      35\nItem 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of PPG Industries, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheet of PPG Industries, Inc. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of shareholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended December 31, 2024 appearing under Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  \nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions \nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become \n2024 PPG ANNUAL REPORT AND FORM 10-K      36\ninadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nLoss from Discontinued Operations, Net of Tax Associated with the Sale of the U.S. and Canada Architectural Coatings Business \nAs described in Note 2 to the consolidated financial statements, on December 2, 2024, the Company completed the sale of 100% of its architectural coatings business in the U.S. and Canada. The Company received $516 million in proceeds and recorded a loss on the sale of $285 million, which is recorded in “Income from discontinued operations, net of tax” for the year ended December 31, 2024.  The sale represents a strategic shift in the Company’s business portfolio that has a major effect on the Company’s operations and financial results. Accordingly, the Company’s consolidated results of operations and cash flows have been recast to present the results of the architectural coatings business in the U.S. and Canada as discontinued operations.\nThe principal considerations for our determination that performing procedures relating to the loss from discontinued operations, net of tax associated with the sale of the U.S. and Canada architectural coatings business is a critical audit matter are the high degree of auditor effort in performing procedures and evaluating audit evidence related to management’s calculation of the loss from discontinued operations, net of tax.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s calculation of the loss from discontinued operations, net of tax, associated with the sale of the U.S. and Canada architectural coatings business. These procedures also included, among others, reading the purchase agreement and testing management’s calculation of the loss from discontinued operations, net of tax.\n/s/ \nPricewaterhouseCoopers LLP\n \nPittsburgh, Pennsylvania\nFebruary 20, 2025\nWe have served as the Company’s auditor since 2013.\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      37\nManagement Report\nManagement’s Annual Report on Internal Control Over Financial Reporting\nWe are responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nWe conducted an evaluation of the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In making this evaluation, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal Control - Integrated Framework (2013)\n. Based on this evaluation we have concluded that, as of December 31, 2024, the Company’s internal control over financial reporting was effective.\nPricewaterhouseCoopers LLP, an independent registered public accounting firm, has issued their report, included on pages 36-37 of this Form 10-K, regarding the Company’s internal control over financial reporting.\n/s/ Timothy M. Knavish\n/s/ Vincent J. Morales\nTimothy M. Knavish\nChairman and Chief Executive Officer\nFebruary 20, 2025\nVincent J. Morales\nSenior Vice President and Chief Financial Officer\nFebruary 20, 2025\n2024 PPG ANNUAL REPORT AND FORM 10-K      38\nConsolidated Statement of Income\n \nFor the Year\n($ in millions, except per share amounts)\n2024\n2023\n2022\nNet sales\n$\n15,845\n \n$\n16,242\n \n$\n15,614\n \nCost of sales, exclusive of depreciation and amortization\n9,252\n \n9,678\n \n9,975\n \nSelling, general and administrative\n3,391\n \n3,401\n \n3,037\n \nDepreciation\n360\n \n360\n \n357\n \nAmortization\n132\n \n154\n \n145\n \nResearch and development, net\n423\n \n424\n \n434\n \nInterest expense\n241\n \n247\n \n167\n \nInterest income\n(\n177\n)\n(\n140\n)\n(\n54\n)\nBusiness restructuring, net\n233\n \n(\n2\n)\n33\n \nImpairment and other-related charges, net\n146\n \n160\n \n231\n \nPension settlement charge\n—\n \n190\n \n—\n \nOther (income)/charges, net \n(\n8\n)\n80\n \n(\n66\n)\nIncome before income taxes\n$\n1,852\n \n$\n1,690\n \n$\n1,355\n \nIncome tax expense\n475\n \n428\n \n320\n \nIncome from continuing operations \n$\n1,377\n \n$\n1,262\n \n$\n1,035\n \n(Loss)/income from discontinued operations, net of tax\n(\n228\n)\n47\n \n19\n \nNet income attributable to the controlling and noncontrolling interests\n$\n1,149\n \n$\n1,309\n \n$\n1,054\n \nLess: Net income attributable to noncontrolling interests\n33\n \n39\n \n28\n \nNet income (attributable to PPG)\n$\n1,116\n \n$\n1,270\n \n$\n1,026\n \nAmounts attributable to PPG\nIncome from continuing operations, net of tax\n$\n1,344\n \n$\n1,223\n \n$\n1,007\n \n(Loss)/income from discontinued operations, net of tax\n(\n228\n)\n47\n \n19\n \nNet income (attributable to PPG)\n$\n1,116\n \n$\n1,270\n \n$\n1,026\n \nEarnings per common share\nIncome from continuing operations, net of tax\n$\n5.75\n \n$\n5.18\n \n$\n4.26\n \n(Loss)/income from discontinued operations, net of tax\n(\n0.98\n)\n0.20\n \n0.08\n \nNet income (attributable to PPG)\n$\n4.77\n \n$\n5.38\n \n$\n4.34\n \nEarnings per common share - assuming dilution\nIncome from continuing operations, net of tax\n$\n5.72\n \n$\n5.16\n \n$\n4.24\n \n(Loss)/income from discontinued operations, net of tax\n(\n0.97\n)\n0.19\n \n0.08\n \nNet income (attributable to PPG)\n$\n4.75\n \n$\n5.35\n \n$\n4.32\n \nConsolidated Statement of Comprehensive Income\n \nFor the Year\n($ in millions)\n2024\n2023\n2022\nNet income attributable to the controlling and noncontrolling interests\n$\n1,149\n \n$\n1,309\n \n$\n1,054\n \nOther comprehensive (loss)/income, net of tax\nDefined benefit pension and other postretirement benefits\n36\n \n63\n \n206\n \nUnrealized foreign currency translation adjustments\n(\n916\n)\n509\n \n(\n279\n)\nOther comprehensive (loss)/income, net of tax\n(\n880\n)\n572\n \n(\n73\n)\nTotal comprehensive income\n$\n269\n \n$\n1,881\n \n$\n981\n \nLess: amounts attributable to noncontrolling interests:\n \n \n \nNet income\n(\n33\n)\n(\n39\n)\n(\n28\n)\nUnrealized foreign currency translation adjustments\n11\n \n(\n1\n)\n13\n \nComprehensive income attributable to PPG\n$\n247\n \n$\n1,841\n \n$\n966\n \nThe accompanying notes to the consolidated financial statements are an integral part of these consolidated statements.\n2024 PPG ANNUAL REPORT AND FORM 10-K      39\nConsolidated Balance Sheet\nDecember 31\n($ in millions)\n2024\n2023\nAssets\n \n \nCurrent assets\n \n \nCash and cash equivalents\n$\n1,270\n \n$\n1,493\n \nShort-term investments\n88\n \n75\n \nReceivables\n2,985\n \n3,007\n \nInventories\n1,846\n \n1,934\n \nOther current assets\n368\n \n922\n \nTotal current assets\n$\n6,557\n \n$\n7,431\n \nProperty, plant and equipment, net\n3,464\n \n3,450\n \nGoodwill\n5,690\n \n6,115\n \nIdentifiable intangible assets, net\n1,922\n \n2,261\n \nDeferred income taxes\n303\n \n272\n \nInvestments\n331\n \n254\n \nOperating lease right-of-use assets\n597\n \n571\n \nOther assets\n569\n \n1,293\n \nTotal\n$\n19,433\n \n$\n21,647\n \nLiabilities and Shareholders’ Equity\n \n \nCurrent liabilities\n \n \nAccounts payable and accrued liabilities\n$\n3,731\n \n$\n4,161\n \nRestructuring reserves\n128\n \n84\n \nShort-term debt and current portion of long-term debt\n939\n \n306\n \nCurrent portion of operating lease liabilities\n126\n \n128\n \nOther\n90\n \n375\n \nTotal current liabilities\n$\n5,014\n \n$\n5,054\n \nLong-term debt\n4,876\n \n5,748\n \nOperating lease liabilities \n454\n \n417\n \nAccrued pensions\n558\n \n588\n \nOther postretirement benefits\n410\n \n450\n \nDeferred income taxes\n405\n \n500\n \nOther liabilities\n754\n \n867\n \nTotal liabilities\n$\n12,471\n \n$\n13,624\n \nCommitments and contingent liabilities (See Note 15)\nShareholders’ equity\n \n \nCommon stock\n$\n969\n \n$\n969\n \nAdditional paid-in capital\n1,272\n \n1,202\n \nRetained earnings\n21,994\n \n21,500\n \nTreasury stock, at cost\n(\n14,342\n)\n(\n13,600\n)\nAccumulated other comprehensive loss\n(\n3,108\n)\n(\n2,239\n)\nTotal PPG shareholders’ equity\n$\n6,785\n \n$\n7,832\n \nNoncontrolling interests\n177\n \n191\n \nTotal shareholders’ equity\n$\n6,962\n \n$\n8,023\n \nTotal\n$\n19,433\n \n$\n21,647\n \nThe accompanying notes to the consolidated financial statements are an integral part of this consolidated statement.\n2024 PPG ANNUAL REPORT AND FORM 10-K      40\nConsolidated Statement of Shareholders’ Equity\n($ in millions)\nCommon Stock\nAdditional Paid-In Capital\nRetained Earnings\nTreasury Stock\nAccumulated Other Comprehensive Loss\nTotal PPG\nNon-controlling Interests\nTotal\nJanuary 1, 2022\n$\n969\n \n$\n1,081\n \n$\n20,372\n \n($\n13,386\n)\n($\n2,750\n)\n$\n6,286\n \n$\n125\n \n$\n6,411\n \nNet income attributable to controlling and noncontrolling interests\n— \n— \n1,026\n \n— \n— \n1,026\n \n28\n \n1,054\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n(\n60\n)\n(\n60\n)\n(\n13\n)\n(\n73\n)\nCash dividends\n— \n— \n(\n570\n)\n— \n— \n(\n570\n)\n— \n(\n570\n)\nPurchase of treasury stock\n— \n— \n— \n(\n150\n)\n— \n(\n150\n)\n— \n(\n150\n)\nIssuance of treasury stock\n— \n36\n \n— \n11\n \n— \n47\n \n— \n47\n \nStock-based compensation activity\n— \n10\n \n— \n— \n— \n10\n \n— \n10\n \nDividends paid on subsidiary common stock to noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n13\n)\n(\n13\n)\nReductions in noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n10\n)\n(\n10\n)\nDecember 31, 2022\n$\n969\n \n$\n1,130\n \n$\n20,828\n \n($\n13,525\n)\n($\n2,810\n)\n$\n6,592\n \n$\n117\n \n$\n6,709\n \nNet income attributable to controlling and noncontrolling interests\n— \n— \n1,270\n \n— \n— \n1,270\n \n39\n \n1,309\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n571\n \n571\n \n1\n \n572\n \nCash dividends\n— \n— \n(\n598\n)\n— \n— \n(\n598\n)\n— \n(\n598\n)\nPurchase of treasury stock\n— \n— \n— \n(\n100\n)\n— \n(\n100\n)\n— \n(\n100\n)\nIssuance of treasury stock\n— \n58\n \n— \n25\n \n— \n83\n \n— \n83\n \nStock-based compensation activity\n— \n14\n \n— \n— \n— \n14\n \n— \n14\n \nDividends paid on subsidiary common stock to noncontrolling interests\n— \n— \n— \n— \n— \n— \n(\n21\n)\n(\n21\n)\nReductions in noncontrolling interests\n— \n— \n— \n— \n— \n— \n55\n \n55\n \nOther\n— \n— \n— \n— \n— \n— \n— \n— \nDecember 31, 2023\n$\n969\n \n$\n1,202\n \n$\n21,500\n \n($\n13,600\n)\n($\n2,239\n)\n$\n7,832\n \n$\n191\n \n$\n8,023\n \nNet income attributable to controlling and noncontrolling interests\n1,116\n \n1,116\n \n33\n \n1,149\n \nOther comprehensive income, net of tax\n(\n869\n)\n(\n869\n)\n(\n11\n)\n(\n880\n)\nCash dividends\n(\n622\n)\n(\n622\n)\n(\n622\n)\nPurchase of treasury stock\n(\n759\n)\n(\n759\n)\n(\n759\n)\nIssuance of treasury stock\n50\n \n17\n \n67\n \n67\n \nStock-based compensation activity\n20\n \n20\n \n20\n \nDividends paid on subsidiary common stock to noncontrolling interests\n— \n(\n25\n)\n(\n25\n)\nAcquisition of noncontrolling interests\n— \n(\n11\n)\n(\n11\n)\nDecember 31, 2024\n$\n969\n \n$\n1,272\n \n$\n21,994\n \n($\n14,342\n)\n($\n3,108\n)\n$\n6,785\n \n$\n177\n \n$\n6,962\n \nThe accompanying notes to the consolidated financial statements are an integral part of this consolidated statement.\n2024 PPG ANNUAL REPORT AND FORM 10-K      41\nConsolidated Statement of Cash Flows\n \nFor the Year\n($ in millions)\n2024\n2023\n2022\nOperating activities\nNet income attributable to controlling and noncontrolling interests\n$\n1,149\n \n$\n1,309\n \n$\n1,054\n \nLess: (Loss)/income from discontinued operations\n($\n228\n)\n$\n47\n \n$\n19\n \nIncome from continuing operations\n$\n1,377\n \n$\n1,262\n \n$\n1,035\n \nAdjustments to reconcile net income to cash from operations:\n \n \n \nDepreciation and amortization\n492\n \n514\n \n502\n \nPension settlement charge\n—\n \n190\n \n—\n \nImpairment and other related charges, net\n146\n \n160\n \n231\n \nStock-based compensation expense\n42\n \n56\n \n34\n \nDeferred income taxes\n(\n97\n)\n(\n187\n)\n(\n151\n)\nBusiness restructuring, net\n233\n \n(\n2\n)\n33\n \nCash contributions to pension plans\n(\n26\n)\n(\n46\n)\n(\n11\n)\nCash used for restructuring actions\n(\n52\n)\n(\n56\n)\n(\n85\n)\nChange in certain asset and liability accounts (net of acquisitions):\nReceivables\n(\n181\n)\n12\n \n(\n248\n)\nInventories\n(\n27\n)\n145\n \n(\n177\n)\nOther current assets\n(\n30\n)\n(\n41\n)\n(\n59\n)\nAccounts payable and accrued liabilities\n(\n259\n)\n151\n \n21\n \nNoncurrent assets and liabilities, net\n(\n73\n)\n(\n50\n)\n(\n112\n)\nTaxes and interest payable\n(\n31\n)\n71\n \n143\n \nOther\n(\n123\n)\n115\n \n(\n156\n)\nCash from operating activities - continuing operations\n$\n1,391\n \n$\n2,294\n \n$\n1,000\n \nCash from/(used for) operating activities - discontinued operations\n29\n \n117\n \n(\n37\n)\nCash from operating activities\n$\n1,420\n \n$\n2,411\n \n$\n963\n \nInvesting activities\n \n \n \nCapital expenditures\n($\n721\n)\n($\n516\n)\n($\n486\n)\nBusiness acquisitions, net of cash balances acquired\n(\n31\n)\n(\n109\n)\n(\n114\n)\nProceeds from divestiture of businesses\n325\n \n36\n \n117\n \nOther\n28\n \n64\n \n53\n \nCash used for investing activities - continuing operations\n($\n399\n)\n($\n525\n)\n($\n430\n)\nCash from/(used for) investing activities - discontinued operations\n506\n \n(\n31\n)\n(\n31\n)\nCash from/(used for) investing activities\n$\n107\n \n($\n556\n)\n($\n461\n)\nFinancing activities\nProceeds from Term Loan Credit Agreement, net of fees\n$\n274\n \n$\n550\n \n$\n—\n \nRepayment of Term Loan Credit Agreement\n—\n \n(\n1,100\n)\n(\n300\n)\nNet payments on commercial paper and short-term debt\n—\n \n—\n \n(\n439\n)\nProceeds from the issuance of debt, net of discounts and fees\n—\n \n—\n \n1,116\n \nRepayment of long-term debt\n(\n300\n)\n(\n300\n)\n—\n \nPurchase of treasury stock\n(\n752\n)\n(\n86\n)\n(\n190\n)\nDividends paid on PPG common stock\n(\n622\n)\n(\n598\n)\n(\n570\n)\nOther\n(\n25\n)\n(\n16\n)\n(\n26\n)\nCash used for financing activities - continuing operations\n($\n1,425\n)\n($\n1,550\n)\n($\n409\n)\nCash used for financing activities - discontinued operations\n—\n \n—\n \n—\n \nCash used for financing activities\n($\n1,425\n)\n($\n1,550\n)\n($\n409\n)\nEffect of currency exchange rate changes on cash and cash equivalents\n(\n325\n)\n110\n \n1\n \nCash reclassified to assets held for sale\n—\n \n(\n5\n)\n(\n3\n)\nNet (decrease)/increase in cash and cash equivalents\n($\n223\n)\n$\n410\n \n$\n91\n \nCash and cash equivalents, beginning of year\n$\n1,493\n \n$\n1,083\n \n$\n992\n \nCash and cash equivalents, end of year\n$\n1,270\n \n$\n1,493\n \n$\n1,083\n \nSupplemental disclosures of cash flow information:\nInterest paid, net of amount capitalized\n$\n247\n \n$\n213\n \n$\n156\n \nTaxes paid, net of refunds\n$\n653\n \n$\n488\n \n$\n436\n \nSupplemental disclosure of noncash investing and financing activities:\nCapital expenditures accrued within Accounts payable and accrued liabilities at year-end\n$\n160\n \n$\n170\n \n$\n71\n \nPurchases of treasury stock transacted but not yet settled\n$\n12\n \n$\n14\n \n$\n—\n \nThe accompanying notes to the consolidated financial statements are an integral part of this consolidated statement.\n2024 PPG ANNUAL REPORT AND FORM 10-K      42\n1. \nSummary of Significant Accounting Policies \nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of PPG Industries, Inc. (“PPG” or the “Company”) and all subsidiaries, both U.S. and non-U.S., that it controls. PPG owns more than 50% of the voting stock of most of the subsidiaries that it controls. For those consolidated subsidiaries in which the Company’s ownership is less than 100%, the outside shareholders’ interests are shown as noncontrolling interests. Investments in companies in which PPG owns 20% to 50% of the voting stock and has the ability to exercise significant influence over operating and financial policies of the investee are accounted for using the equity method of accounting. As a result, PPG’s share of income or losses from such equity affiliates is included in the consolidated statement of income and PPG’s share of these companies’ shareholders’ equity is included in Investments on the consolidated balance sheet. Transactions between PPG and its subsidiaries are eliminated in consolidation.\nUse of Estimates in the Preparation of Financial Statements\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements, as well as the reported amounts of income and expenses during the reporting period. Such estimates also include the fair value of assets acquired and liabilities assumed resulting from the allocation of the purchase price related to business combinations consummated. Actual outcomes could differ from those estimates.\n \nRevenue Recognition\nRevenue is recognized as performance obligations with the customer are satisfied, at an amount that is determined to be collectible. For the sale of products, this generally occurs at the point in time when control of the Company’s products transfers to the customer based on the agreed upon shipping terms. \nShipping and Handling Costs\nAmounts billed to customers for shipping and handling are reported in Net sales in the consolidated statement of income. Shipping and handling costs incurred by the Company for the delivery of goods to customers are included in Cost of sales, exclusive of depreciation and amortization in the consolidated statement of income.\nSelling, General and Administrative Costs\nAmounts presented in Selling, general and administrative in the consolidated statement of income are comprised of selling, customer service, distribution and advertising costs, as well as the costs of providing corporate-wide functional support in areas such as finance, law, human resources and planning. Distribution costs pertain to the movement and storage of finished goods inventory at company-owned and leased warehouses and other distribution facilities.\n \nAdvertising Costs\nAdvertising costs are charged to expense as incurred and totaled $\n203\n million, $\n193\n million and $\n159\n million in 2024, 2023 and 2022, respectively.\n \nResearch and Development\nResearch and development costs, which consist primarily of employee-related costs, are charged to expense as incurred.\n \n($ in millions)\n2024\n2023\n2022\nResearch and development – total\n$\n447\n \n$\n446\n \n$\n457\n \nLess: depreciation on research facilities\n24\n \n22\n \n23\n \nResearch and development, net\n$\n423\n \n$\n424\n \n$\n434\n \nLegal Costs\nLegal costs, which primarily include costs associated with acquisition and divestiture transactions, general litigation, environmental regulation compliance, patent and trademark protection and other general corporate purposes, are charged to expense as incurred.\nIncome Taxes\nIncome taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to operating losses and tax credit carryforwards as well as differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in Income tax expense in the consolidated statement of income in the period that includes the enactment date.\n2024 PPG ANNUAL REPORT AND FORM 10-K      43\nA valuation allowance is provided against deferred tax assets in situations where PPG determines it is more likely than not such assets will not ultimately be realized.\nPPG does not recognize a tax benefit unless it concludes that it is more likely than not that the benefit will be sustained on audit by the taxing authority based solely on the technical merits of the associated tax position. If the recognition threshold is met, PPG recognizes a tax benefit measured at the largest amount of the tax benefit that, in PPG’s judgment, is greater than 50 percent likely to be realized. PPG records interest and penalties related to uncertain tax positions in Income tax expense in the consolidated statement of income.\nForeign Currency Translation\nThe functional currency of most significant non-U.S. operations is their local currency. Assets and liabilities of those operations are translated into U.S. dollars using year-end exchange rates. Income and expenses are translated using the average exchange rates for the reporting period. Unrealized foreign currency translation gains and losses are deferred in Accumulated other comprehensive loss on the consolidated balance sheet.\nCash Equivalents\nCash equivalents are highly liquid investments (valued at cost, which approximates fair value) acquired with an original maturity of three months or less.\nShort-term Investments\nShort-term investments are highly liquid, high credit quality investments (valued at cost plus accrued interest) that have stated maturities of greater than three months to less than one year. The purchases and sales of these investments are classified as Investing activities in the consolidated statement of cash flows.\nMarketable Equity Securities\nThe Company’s investment in marketable equity securities is recorded at fair market value and reported as Other current assets and Investments on the consolidated balance sheet with changes in fair market value recorded in income.\nInventories\nInventories are stated at the lower of cost or net realizable value. Most U.S. inventories are stated at cost, using the last-in, first-out (“LIFO”) method of accounting, which does not exceed net realizable value. All other inventories are stated at cost, using the first-in, first-out (“FIFO”) method of accounting, which does not exceed net realizable value. PPG determines cost using either average or standard factory costs, which approximate actual costs, excluding certain fixed costs such as depreciation and property taxes. Refer to Note 3, “Working Capital Detail” for further information related to the Company’s inventories.\n \nDerivative Financial Instruments\nThe Company recognizes all derivative financial instruments (a “derivative”) as either assets or liabilities at fair value on the consolidated balance sheet. The accounting for changes in the fair value of a derivative depends on the use of the instrument.\nFor derivative instruments that are designated and qualify as cash flow hedges, the unrealized gains or losses on the derivatives are recorded in the consolidated statement of comprehensive income. Amounts in Accumulated other comprehensive loss on the consolidated balance sheet are reclassified into Income before income taxes in the consolidated statement of income in the same period or periods during which the hedged transactions are recorded in Income before income taxes in the consolidated statement of income.\nFor derivative instruments that are designated and qualify as fair value hedges, the change in the fair value of the derivatives are reported in Income before income taxes in the consolidated statement of income, offsetting the gain or loss recognized for the change in fair value of the asset, liability, or firm commitment that is being hedged.\nFor derivatives, debt or other financial instruments that are designated and qualify as net investment hedges, the gains or losses associated with the financial instruments are reported as translation gains or losses in Accumulated other comprehensive loss on the consolidated balance sheet. Gains and losses in Accumulated other comprehensive loss related to hedges of the Company’s net investments in foreign operations are reclassified out of Accumulated other comprehensive loss and recognized in Income before income taxes in the consolidated statement of income upon a substantial liquidation, sale or partial sale of such investments or upon impairment of all or a portion of such investments. The cash flow impact of these instruments is classified as Investing activities in the consolidated statement of cash flows. \nChanges in the fair value of derivative instruments not designated as hedges for hedge accounting purposes are recognized in Income before income taxes in the consolidated statement of income in the period of change.\n2024 PPG ANNUAL REPORT AND FORM 10-K      44\nProperty, Plant and Equipment\nProperty, plant and equipment is recorded at cost. Depreciation is computed on a straight-line method based on the estimated useful lives of related assets. Accelerated depreciation expense is recorded when facilities or equipment are subject to abnormal economic conditions, restructuring actions or obsolescence.\nThe cost of significant improvements that add to productive capacity or extend the lives of properties are capitalized. Costs for repairs and maintenance are charged to expense as incurred. When a capitalized asset is retired or otherwise disposed of, the original cost and related accumulated depreciation balance are removed from the accounts and any related gain or loss is recorded in Income before income taxes in the consolidated statement of income. The amortization cost of finance lease assets is recorded in Depreciation expense in the consolidated statement of income. Property and other long-lived assets are reviewed for impairment whenever events or circumstances indicate that their carrying amounts may not be recoverable. Refer to Note 4, “Property, Plant and Equipment” for further details.\n \nGoodwill and Identifiable Intangible Assets\nGoodwill represents the excess of the cost over the fair value of acquired identifiable tangible and intangible assets less liabilities assumed from acquired businesses. Identifiable intangible assets acquired in business combinations are recorded based upon their fair value at the date of acquisition.\nPPG is a multinational manufacturer with \n10\n operating segments (which the Company refers to as “strategic business units”) that are organized based on the Company’s major product lines. These operating segments are also the Company’s reporting units for purposes of testing goodwill for impairment, which is tested at least annually in connection with PPG’s strategic planning process or more frequently if an indication of impairment exists. The Company tests goodwill for impairment by either performing a qualitative evaluation or a quantitative test. The qualitative evaluation is an assessment of factors, including reporting unit specific operating results as well as industry, market and general economic conditions, to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. The Company may elect to bypass this qualitative assessment for some or all of its reporting units and perform a quantitative test. Quantitative goodwill impairment testing, if deemed necessary, is performed during the fourth quarter of each year by comparing the estimated fair value of an associated reporting unit as of September 30 to its carrying value. Fair value is estimated using a discounted cash flow model. Key assumptions and estimates used in the discounted cash flow model include projected future revenues, discount rates, operating cash flows, capital expenditures and tax rates.\nThe annual indefinite-lived intangible asset impairment assessment takes place in the fourth quarter of each year either by completing a qualitative assessment or quantitatively by comparing the estimated fair value of each trademark as of September 30 to its carrying value. Fair value is estimated using the relief from royalty method (a discounted cash flow methodology). The qualitative assessment includes consideration of factors, including revenue relative to the asset being assessed, the operating results of the related business and industry, market and general economic conditions, to determine whether it is more likely than not that the fair value of the asset is less than its carrying amount.\nIdentifiable intangible assets with finite lives are amortized on a straight-line basis over their estimated useful lives (\n1\n to \n30\n years) and are reviewed for impairment whenever events or circumstances indicate that their carrying amount may not be recoverable.\nReceivables and Allowances\n \nAll trade receivables are reported on the consolidated balance sheet at the outstanding principal adjusted for any allowance for doubtful accounts and any charge offs. The Company provides an allowance for doubtful accounts to reduce receivables to their estimated net realizable value when it is probable that a loss will be incurred. Those estimates are based on historical collection experience, current regional economic and market conditions, the aging of accounts receivable, assessments of current creditworthiness of customers, and forward-looking information. Refer to Note 20, “Revenue Recognition” for further details.\n \nLeases\nThe Company determines if a contract is a lease at the inception of the arrangement. The Company reviews all options to extend, terminate, or purchase its right of use assets at the inception of the lease and accounts for these options when they are reasonably certain of being exercised. Certain real estate leases contain lease and non-lease components, which are accounted for separately. For certain equipment leases, lease and non-lease components are accounted for as a single lease component.\nLeases with an initial term of 12 months or less are not recorded on the consolidated balance sheet. Lease expense for these leases is recognized on a straight-line basis over the lease term. \n2024 PPG ANNUAL REPORT AND FORM 10-K      45\nVariable lease expense is based on contractual arrangements with PPG’s lessors determined based on external indices or other relevant market factors. In addition, PPG’s variable lease expense also includes elements of a contract that do not represent a good or service but for which the lessee is responsible for paying. \nNearly all of PPG’s lease contracts do not provide a readily determinable implicit rate. For these contracts, PPG’s estimated incremental borrowing rate is based on information available at the inception of the lease.\n \nProduct Warranties\nThe Company accrues for product warranties at the time the associated products are sold based on historical claims experience. The reserve, pretax charges against income and cash outlays for product warranties were not significant to the consolidated financial statements of the Company for any year presented.\nAsset Retirement Obligations\nAn asset retirement obligation represents a legal obligation associated with the retirement of a tangible long-lived asset that is incurred upon the acquisition, construction, development or normal operation of that long-lived asset. PPG recognizes asset retirement obligations in the period in which they are incurred if a reasonable estimate of fair value can be made. The asset retirement obligation is subsequently adjusted for changes in fair value. The associated estimated asset retirement costs are capitalized as part of the carrying amount of the long-lived asset and depreciated over its useful life. PPG’s asset retirement obligations are primarily associated with the retirement or closure of certain assets used in PPG’s manufacturing process. The accrued asset retirement obligation is recorded in Accounts payable and accrued liabilities and Other liabilities on the consolidated balance sheet and was $\n11\n million and $\n15\n million as of December 31, 2024 and December 31, 2023, respectively.\nPPG’s only conditional asset retirement obligation relates to the possible future abatement of asbestos contained in certain PPG production facilities. The asbestos in PPG’s production facilities arises from the application of normal and customary building practices in the past when the facilities were constructed. This asbestos is encapsulated in place and, as a result, there is no current legal requirement to abate it. Because there is no requirement to abate, the Company does not have any current plans or an intention to abate and therefore the timing, method and cost of future abatement, if any, are not known. The Company has not recorded an asset retirement obligation associated with asbestos abatement, given the uncertainty concerning the timing of future abatement, if any.\nEnvironmental Contingencies\nIt is PPG’s policy to accrue expenses for environmental contingencies when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. Reserves for environmental contingencies are exclusive of claims against third parties and are generally not discounted.\n \nAssets and Liabilities Held for Sale\nThe Company classifies assets and liabilities as held for sale (a “disposal group”) when management commits to a plan to sell the disposal group, the sale is probable within one year and the disposal group is available for immediate sale in its present condition. The Company considers various factors, particularly whether actions required to complete the plan indicate it is unlikely that significant changes to the plan will be made or the plan will be withdrawn. Assets held for sale are measured at the lower of carrying value or fair value less costs to sell. Any loss resulting from the measurement is recognized in the period the held-for-sale criteria are met. Conversely, gains are not recognized until the date of the sale. When the disposal group is classified as held for sale, depreciation and amortization ceases and the Company tests the assets for impairment.\nReclassifications\nCertain reclassifications of prior years’ data have been made to conform to the current year presentation. These reclassifications had no impact on our previously reported Net income, cash flows or shareholders’ equity.\nSegment Reporting\nEffective December 31, 2024, the Company revised the aggregation of its \nten\n operating segments to present \nthree\n reportable business segments: Global Architectural Coatings, Performance Coatings and Industrial Coatings. Prior year amounts have been recast to conform to current year presentation. Refer to Note 21, “Reportable Business Segment Information” for further details.\nAccounting Standards Adopted in 2024 \nEffective January 1, 2024, PPG adopted Accounting Standards Update (\"ASU\") No. 2023-02, \"Investment - Equity Method and Joint Ventures (Topic 323): Accounting for Investments in Tax Credit Structures Using the Proportional Amortization Method.\" This ASU permits reporting entities to elect to account for tax equity investments under the proportional amortization method, regardless of the tax credit program from which the income tax credits are received, if certain \n2024 PPG ANNUAL REPORT AND FORM 10-K      46\nconditions are met. Adoption of this ASU did not have a material impact on PPG's consolidated financial position, results of operations or cash flows.\nEffective for the annual period ended December 31, 2024, PPG adopted Financial Accounting Standards Board (“FASB”) Accounting Standards Update (“ASU”) No. 2023-07 “Improvements to Reportable Segment Disclosures (Topic 280)”. This ASU updated the reportable segment disclosure requirements to require disclosures of significant reportable segment expenses that are regularly provided to the Chief Operating Decision Maker (“CODM”) and included within each reported measure of a segment's profit or loss. This ASU also requires disclosure of the title and position of the individual identified as the CODM and an explanation of how the CODM uses the reported measures of a segment’s profit or loss in assessing segment performance and deciding how to allocate resources. Adoption of this ASU resulted in additional disclosure, but did not impact PPG’s consolidated financial position, results of operations or cash flows.\nAccounting Standards to be Adopted in Future Years\nIn December 2023, the FASB issued ASU No. 2023-09 “Improvements to Income Tax Disclosures (Topic 740)”. This ASU updates current income tax disclosure requirements to require disclosures of specific categories of information within the effective tax rate reconciliation, as well as disclosure of income taxes paid disaggregated by jurisdiction. This ASU will be effective for the annual period ending December 31, 2025. Adoption of this ASU will result in additional disclosure, but will not impact PPG’s consolidated financial position, results of operations or cash flows.\nIn November 2024, the FASB issued ASU 2024-03, “Income Statement – Reporting Comprehensive Income-Expense Disaggregation (Subtopic 220-40): Disaggregation of Income Statement Expenses”. The ASU requires the disclosure of additional information related to certain costs and expenses, including amounts of inventory purchases, employee compensation, and depreciation and amortization included in each income statement line item. The ASU also requires disclosure of the total amount of selling expenses and our definition of selling expenses. This ASU will be effective for the annual period ending December 31, 2027. Adoption of this ASU will result in additional disclosure, but will not impact PPG’s consolidated financial position, results of operations or cash flows.\n2. \nDivestitures\nU.S. and Canada Architectural Coatings Business\nOn December 2, 2024, PPG completed the sale of \n100\n% of its architectural coatings business in the U.S. and Canada to American Industrial Partners (AIP), an industrials investor. PPG received $\n516\n million in proceeds and recorded a loss on the sale of $\n285\n million during the fourth quarter 2024. No tax benefit was recorded on the loss. The loss on the sale is recorded in “\nIncome from discontinued operations, net of tax\n” in the consolidated statement of income. The proceeds from the sale are recorded in “Cash from/(used for) investing activities - discontinued operations” in the consolidated statement of cash flows. \nThe sale represents a strategic shift in PPG’s business portfolio that has a major effect on the Company’s operations and financial results. Accordingly, the Company’s consolidated results of operations and cash flows have been recast to present the results of the architectural coatings business in the U.S. and Canada as discontinued operations for all periods presented. The results of the U.S. and Canada architectural coatings business were previously included in the Performance Coatings segment. \nThe operating results of discontinued operations related to the U.S. and Canada architectural coatings business for the three years ended December 31, 2024, 2023, and 2022 were as follows:\n($ in millions)\n2024\n2023\n2022\nNet sales\n$\n1,878\n \n$\n2,004\n \n$\n2,038\n \nCost of sales, exclusive of depreciation and amortization\n976\n \n1,067\n \n1,121\n \nSelling, general, and administrative\n787\n \n821\n \n805\n \nDepreciation\n28\n \n31\n \n31\n \nAmortization\n6\n \n13\n \n21\n \nResearch and development, net\n9\n \n9\n \n14\n \nImpairment and other-related charges, net\n—\n \n—\n \n14\n \nOther charges, net\n1\n \n5\n \n6\n \nLoss on sale of discontinued operations\n285\n \n—\n \n—\n \n(Loss)/income before income taxes\n($\n214\n)\n$\n58\n \n$\n26\n \nIncome tax expense\n14\n \n11\n \n5\n \n(Loss)/income from discontinued operations, net of tax\n($\n228\n)\n$\n47\n \n$\n21\n \nThe Company’s December 31, 2023 balance sheet has been recast to present the assets and liabilities of the U.S. and Canada architectural coatings business as held for sale. \nThe major classes of assets and liabilities of the U.S. and Canada architectural coatings business included in the PPG consolidated balance sheet at December 31, 2023 were as follows:\n2024 PPG ANNUAL REPORT AND FORM 10-K      47\n($ in millions)\nDecember 31, 2023\nCash and cash equivalents\n$\n21\n \nReceivables\n272\n \nInventories\n193\n \nOther current assets\n41\n \nTotal current assets held for sale (included in Other current assets on the consolidated balance sheet)\n$\n527\n \nProperty, plant and equipment, net\n$\n194\n \nGoodwill\n85\n \nIdentifiable intangible assets, net\n163\n \nDeferred income taxes\n1\n \nInvestments\n5\n \nOperating lease right-of-use assets\n261\n \nOther assets\n38\n \nTotal noncurrent assets held for sale (included in Other assets on the consolidated balance sheet)\n$\n747\n \nAccounts payable and accrued liabilities\n$\n306\n \nRestructuring reserves\n3\n \nCurrent portion of operating lease liabilities\n66\n \nTotal current liabilities held for sale (included in Current liabilities - other on the consolidated balance sheet)\n$\n375\n \nOperating lease liabilities\n$\n205\n \nDeferred income taxes\n8\n \nOther liabilities\n14\n \nTotal noncurrent liabilities held for sale (included in Other liabilities on the consolidated balance sheet)\n$\n227\n \nThe following table presents the significant non-cash items and capital expenditures for the discontinued operations related to the U.S. and Canada architectural coatings business that are included in the Consolidated Statement of Cash Flows for the three years ended December 31, 2024, 2023, and 2022:\n($ in millions)\n2024\n2023\n2022\nDepreciation and amortization\n$\n34\n \n$\n44\n \n$\n52\n \nCapital expenditures\n10\n \n33\n \n32\n \nIn conjunction with the divestiture of U.S. and Canada architectural coatings business, PPG entered into a supply agreement with the divested business to sell certain products, which will be recognized as Net sales in the refinish coatings, industrial coatings and protective and marine coatings businesses going forward. Additionally, PPG has entered into transition services agreements to provide administrative services subsequent to the sale. The fees for services rendered under the transition services agreements are expected to offset the cost of providing those services.\nSilicas Products Business\nOn November 25, 2024, PPG completed the sale of its silicas products business for $\n325\n million in proceeds and recorded a pre-tax gain on the sale of $\n129\n million in the fourth quarter 2024. The gain on the sale is recorded in “Other (income)/charges, net” in the consolidated statement of income. The Company determined that the divestiture did not meet the criteria of a discontinued operation as it did not represent a strategic shift for the Company, and therefore, its historical results are included in the Company's continuing operations within the Industrial Coatings reportable business segment.\n2024 PPG ANNUAL REPORT AND FORM 10-K      48\n3. \nWorking Capital Detail \n($ in millions)\n2024\n2023\nReceivables\n \n \n \nTrade - net\n$\n2,477\n \n$\n2,622\n \n \nOther - net\n508\n \n385\n \n \nTotal\n$\n2,985\n \n$\n3,007\n \nInventories\n(1)\n \nFinished products\n$\n993\n \n$\n1,032\n \n \nWork in process\n213\n \n233\n \n \nRaw materials\n591\n \n615\n \n \nSupplies\n49\n \n54\n \n \nTotal\n$\n1,846\n \n$\n1,934\n \nAccounts payable and accrued liabilities\n \nTrade \n$\n2,161\n \n$\n2,438\n \n \nAccrued payroll\n490\n \n630\n \n \nCustomer rebates\n364\n \n353\n \n \nOther postretirement and pension benefits\n76\n \n96\n \n \nIncome taxes\n130\n \n128\n \n \nOther\n510\n \n516\n \n \nTotal\n$\n3,731\n \n$\n4,161\n \n(1)\nInventories valued using the LIFO method of inventory valuation comprised \n9\n% and \n11\n% of total gross inventory values as of December 31, 2024 and 2023, respectively. If the FIFO method of inventory valuation had been used, inventories would have been $\n169\n million and $\n183\n million higher as of December 31, 2024 and 2023, respectively.\n4. \nProperty, Plant and Equipment\n($ in millions)\nUseful Lives (years)\n2024\n2023\nLand and land improvements\n1-30\n$\n525\n \n$\n541\n \nBuildings\n20-40\n1,769\n \n1,761\n \nMachinery and equipment\n5-25\n3,545\n \n3,862\n \nOther\n3-20\n1,107\n \n1,122\n \nConstruction in progress\n \n735\n \n669\n \nTotal\n$\n7,681\n \n$\n7,955\n \nLess: accumulated depreciation\n4,217\n \n4,505\n \nNet\n \n$\n3,464\n \n$\n3,450\n \n5. \nInvestments \n($ in millions)\n2024\n2023\nInvestments in equity affiliates\n$\n141\n \n$\n141\n \nMarketable equity securities (See Note 11)\n85\n \n74\n \nOther\n105\n \n39\n \nTotal\n$\n331\n \n$\n254\n \nInvestments in equity affiliates represent PPG’s ownership interests in entities between 20% and 50% that manufacture and sell coatings and certain chemicals. \nPPG’s share of undistributed net earnings of equity affiliates was $\n20\n million, $\n21\n million and $\n25\n million in 2024, 2023 and 2022, respectively. Dividends received from equity affiliates were $\n14\n million, $\n17\n million and $\n17\n million in 2024, 2023 and 2022, respectively.\n2024 PPG ANNUAL REPORT AND FORM 10-K      49\n6. \nGoodwill and Other Identifiable Intangible Assets \nGoodwill\n($ in millions)\nGlobal Architectural Coatings\nPerformance Coatings\nIndustrial Coatings\nTotal\nJanuary 1, 2023\n$\n2,860\n \n$\n1,936\n \n$\n1,197\n \n$\n5,993\n \nAcquisitions, including purchase accounting adjustments\n— \n126\n \n13\n \n139\n \nDivestitures\n—\n \n(\n5\n)\n—\n \n(\n5\n)\nForeign currency impact and other\n136\n \n14\n \n(\n4\n)\n146\n \nGoodwill impairment\n— \n(\n158\n)\n— \n(\n158\n)\nDecember 31, 2023\n$\n2,996\n \n$\n1,913\n \n$\n1,206\n \n$\n6,115\n \nAcquisitions, including purchase accounting adjustments\n— \n2\n \n— \n2\n \nDivestitures\n—\n \n—\n \n(\n2\n)\n(\n2\n)\nForeign currency impact and other\n(\n308\n)\n(\n61\n)\n(\n56\n)\n(\n425\n)\nDecember 31, 2024\n$\n2,688\n \n$\n1,854\n \n$\n1,148\n \n$\n5,690\n \nIn the fourth quarter, the Company tests the carrying value of goodwill for impairment, as discussed in Note 1. “Summary of Significant Accounting Policies.” In 2024, the annual impairment testing of goodwill did not result in impairment of any of the Company’s reporting units. In conjunction with the 2023 assessment, the Company determined that the estimated fair value of the traffic solutions reporting unit was less than its carrying value, resulting in recognition of a goodwill impairment charge of $\n158\n million in Impairment and other related charges, net in the accompanying consolidated statements of income. The fair value of the traffic solutions reporting unit was estimated using a discounted cash flow model. Key assumptions and estimates used in the discounted cash flow model included projected future revenues, a discount rate, operating cash flows, capital expenditures, and a tax rate. The decline in the fair value of the traffic solutions reporting unit compared to prior periods was primarily due to an increase in the weighted average cost of capital (discount rate assumption) reflecting the current interest rate environment. In addition, the fair value was impacted by a decline in the reporting unit’s long-term cash generation forecast due to the highly inflationary environment in Argentina and the fourth quarter 2023 divestitures of its European and Australian businesses. In 2022, the annual impairment testing of goodwill did not result in impairment of any of the Company’s reporting units. \nAs of December 31, 2024, accumulated goodwill impairment losses totaled $158 million, all of which relates to the Performance Coatings reportable segment.\nIdentifiable Intangible Assets\n \nDecember 31, 2024\nDecember 31, 2023\n($ in millions)\nGross Carrying Amount\nAccumulated Amortization\nNet\nGross Carrying Amount\nAccumulated Amortization\nNet\nIndefinite-Lived Identifiable Intangible Assets\nTrademarks\n$\n1,123\n \n$— \n$\n1,123\n \n$\n1,297\n \n$— \n$\n1,297\n \nDefinite-Lived Identifiable Intangible Assets\nAcquired technology\n$\n800\n \n($\n666\n)\n$\n134\n \n$\n817\n \n($\n651\n)\n$\n166\n \nCustomer-related\n1,656\n \n(\n1,106\n)\n550\n \n1,759\n \n(\n1,098\n)\n661\n \nTrade names\n276\n \n(\n162\n)\n114\n \n299\n \n(\n164\n)\n135\n \nOther\n43\n \n(\n42\n)\n1\n \n46\n \n(\n44\n)\n2\n \nTotal Definite Lived Intangible Assets\n$\n2,775\n \n($\n1,976\n)\n$\n799\n \n$\n2,921\n \n($\n1,957\n)\n$\n964\n \nTotal Identifiable Intangible Assets\n$\n3,898\n \n($\n1,976\n)\n$\n1,922\n \n$\n4,218\n \n($\n1,957\n)\n$\n2,261\n \nIn the fourth quarter, the Company tests the carrying value of indefinite-lived trademarks for impairment, as discussed in Note 1, “Summary of Significant Accounting Policies.” In 2024, the annual impairment testing review of indefinite-lived intangibles did not result in an impairment. In conjunction with both the 2023 and 2022 annual impairment tests, the Company determined that the estimated fair value of certain trademarks in the Global Architectural Coatings segment was less than the carrying value, resulting in recognition of impairment charges of $\n2\n million and $\n4\n million, respectively, in Impairment and other related charges, net in the accompanying consolidated statement of income. \nIn the first quarter 2022, due to the adverse economic impacts of the Russian invasion in Ukraine, the Company recognized $\n147\n million of Impairment and other related charges, net in the consolidated statement of income related to certain definite-lived and indefinite-lived intangible assets in the Performance Coatings segment. Refer to Note 7, “Impairment and Other Related Charges, Net” for further details.\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      50\nAggregate amortization expense was $\n132\n million, $\n154\n million and $\n145\n million in 2024, 2023 and 2022, respectively. In the fourth quarter 2023, the Company recognized accelerated amortization expense of $\n6\n million related to the exit of a non-core business.\n($ in millions)\n2025\n2026\n2027\n2028\n2029\nThereafter\nEstimated future amortization expense\n$\n126\n \n$\n97\n \n$\n89\n \n$\n81\n \n$\n75\n \n$331 \n7. Impairment and Other Related Charges, Net\nIn 2023, the Company recorded a goodwill impairment charge for the traffic solutions reporting unit and indefinite-lived intangible asset impairment charges related to certain trademarks. In 2022, the Company recorded indefinite-lived intangible asset impairment charges for certain trademarks. Refer to Note 6, “Goodwill and Intangible Assets” for further detail related to these charges, which are included in Impairment and other related charges, net in the accompanying consolidated statement of income.\nWind Down of Russia Operations\nDuring 2022, the Company commenced actions to wind down its operations in Russia in response to the Russian invasion of Ukraine. As a result, the Company recognized $\n227\n million of Impairment and other related charges, net, in the consolidated statement of income during 2022, comprised of $\n201\n million of long-lived asset impairment charges and $\n26\n million of other related charges. During 2023, the Company divested its legacy industrial Russian operations. \nIn the fourth quarter 2024, the Company received written approval from Russian regulatory authorities of a definitive agreement to sell the Company’s remaining Russian business. The sale closed in the first quarter 2025. As a result, the Company classified the business as held for sale as of December 31, 2024 and recognized an impairment charge of $\n146\n million during the fourth quarter 2024, primarily related to accumulated foreign currency translation losses, which is included in Impairment and other related charges, net on the consolidated statement of income. No tax benefit was recorded on the impairment charge. The remaining liabilities of the business are reported are reported as held for sale in Other current liabilities on the consolidated balance sheet as of December 31, 2024. The results of the business are reported within the Global Architectural Coatings reportable business segment.\n8. \nBusiness Restructuring\nThe Company records restructuring liabilities that represent charges incurred in connection with consolidations of certain operations, including operations from acquisitions, as well as headcount reduction programs. These charges consist primarily of severance costs and certain other cash costs. As a result of these programs, the Company will also incur incremental non-cash accelerated depreciation expense for certain assets due to their reduced expected asset life. These charges are not allocated to the Company’s reportable business segments. Refer to Note 21, “Reportable Business Segment Information” for additional information.\nIn October 2024, the Company approved a comprehensive cost reduction program with anticipated annualized pre-tax savings of approximately $\n175\n million once fully implemented, including savings of $\n60\n million in 2025. The multi-year program is focused on reducing structural costs primarily in Europe and in certain other global businesses, along with other corporate costs following the divestitures of  PPG’s silicas products business and the architectural coatings business in the U.S. and Canada. The program includes various facility closures and other targeted fixed cost reductions. In the fourth quarter of 2024, the Company recorded a pretax restructuring charge of $\n239\n million, representing employee severance and other cash costs. As a result of this program, the Company also recognized a $\n110\n million non-cash charge in the fourth quarter of 2024 due to the recognition of accumulated currency losses related to the exit of its Argentina operations.  Additionally, the Company expects to incur approximately $\n100\n million of incremental noncash accelerated depreciation expense over the life of the program for certain assets due to their reduced expected asset life in addition to other cash costs of approximately $\n70\n million over the duration of this program, consisting of incremental restructuring-related cash costs for certain items that are required to be recognized as period expense as incurred. The restructuring actions will result in the net reduction of approximately \n1,800\n positions, primarily in Europe and the U.S. The majority of these restructuring actions are expected to be completed in 2025 and 2026.\nIn 2023, the Company approved business restructuring actions to reduce costs and improve the profitability of the overall business portfolio. The majority of these restructuring actions are expected to be completed by the end of 2025.\nIn 2022, the Company approved a business restructuring plan which included actions to reduce its global cost structure in response to economic conditions, including softening demand in Europe and lower than expected demand recovery in China. The Company performed a comprehensive evaluation to identify opportunities to reduce costs and improve the profitability of the overall business portfolio. The program includes actions to right-size employee headcount, reductions in functional and administrative costs and other cost savings actions. The majority of these restructuring actions are expected to be completed by the end of 2025.\n2024 PPG ANNUAL REPORT AND FORM 10-K      51\nThe following table summarizes restructuring reserve activity for the years ended December 31, 2024 and 2023:\nTotal Reserve\n($ in millions)\n2024\n2023\nJanuary 1\n$\n110\n \n$\n165\n \nApproved restructuring actions\n239\n \n33\n \nRelease of prior reserves and other adjustments\n(a)\n(\n6\n)\n(\n35\n)\nCash payments\n(\n52\n)\n(\n56\n)\nForeign currency impact\n(\n15\n)\n3\n \nDecember 31\n$\n276\n \n$\n110\n \n(a)\nCertain releases\n \nwere recorded to reflect the current estimate of costs to complete planned business restructuring actions.\n9. \nLeases \nPPG leases certain retail paint stores, warehouses, distribution facilities, office space, fleet vehicles and equipment. \nThe components of lease expense for the years ended December 31, 2024, 2023 and 2022 were as follows:\n($ in millions)\nClassification in the Consolidated Statement of Income\n2024\n2023\n2022\nOperating lease cost\nCost of sales, exclusive of depreciation and amortization\n$\n47\n \n$\n45\n \n$\n42\n \nOperating lease cost\nSelling, general and administrative\n141\n \n138\n \n136\n \nTotal operating lease cost\n$\n188\n \n$\n183\n \n$\n178\n \nFinance lease cost:\nAmortization of right-of-use assets\nDepreciation\n$\n1\n \n$\n1\n \n$\n2\n \nInterest on lease liabilities\nInterest expense\n1\n \n1\n \n1\n \nTotal finance lease cost\n$\n2\n \n$\n2\n \n$\n3\n \nTotal lease cost\n$\n190\n \n$\n185\n \n$\n181\n \nTotal operating lease cost for the years ended December 31, 2024, 2023 and 2022 is inclusive of the following:\n($ in millions)\n2024\n2023\n2022\nVariable lease costs\n$\n9\n \n$\n9\n \n$\n6\n \nShort-term lease costs\n$\n20\n \n$\n19\n \n$\n21\n \nThe lease amounts included in\n the consolidated balance sheet as of December 31, 2024 and 2023 were as follows:\n($ in millions)\nClassification on the Consolidated Balance Sheet\n2024\n2023\nAssets:\nOperating\nOperating lease right-of-use assets\n$\n597\n \n$\n571\n \nFinance\n(1)\nProperty, plant, and equipment, net\n12\n \n12\n \nTotal leased assets\n$\n609\n \n$\n583\n \nLiabilities:\nCurrent\nOperating\nCurrent portion of operating lease liabilities\n$\n126\n \n$\n128\n \nFinance\nShort-term debt and current portion of long-term debt\n2\n \n2\n \nNoncurrent\nOperating\nOperating lease liabilities\n454\n \n417\n \nFinance\nLong-term debt\n5\n \n6\n \nTotal lease liabilities\n$\n587\n \n$\n553\n \n(1)\nNet of accumulated depreciation of $\n14\n million as of both December 31, 2024 and 2023.\nSupplemental cash flow information related to leases for the years ended December 31, 2024, 2023 and 2022 was as follows:\n \n($ in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows paid for operating leases\n$\n157\n \n$\n155\n \n$\n151\n \nOperating cash flows paid for finance leases\n$\n1\n \n$\n1\n \n$\n1\n \nFinancing cash flows paid for finance leases\n$\n2\n \n$\n2\n \n$\n2\n \nRight-of-use assets obtained in exchange for lease obligations:\nOperating leases\n$\n184\n \n$\n119\n \n$\n90\n \nFinance leases\n$\n1\n \n$\n1\n \n$\n3\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      52\nLease terms and discount rates as of December 31, 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\nWeighted-average remaining lease term (in years)\nOperating leases\n6.9\n6.8\n7.3\nFinance leases\n8.1\n9.3\n8.6\nWeighted-average discount rate\nOperating leases\n3.6\n \n%\n3.0\n \n%\n2.4\n \n%\nFinance leases\n6.8\n \n%\n6.0\n \n%\n5.9\n \n%\nAs of December 31, 2024, maturities of lease liabilities were as follows:\n($ in millions)\nOperating Leases\nFinance Leases\n2025\n$\n144\n \n$\n2\n \n2026\n119\n \n2\n \n2027\n89\n \n2\n \n2028\n72\n \n1\n \n2029\n55\n \n1\n \nThereafter\n174\n \n—\n \nTotal lease payments\n$\n653\n \n$\n8\n \nLess: Interest\n73\n \n1\n \nTotal lease obligations\n$\n580\n \n$\n7\n \n10. \nBorrowings and Lines of Credit \nLong-term Debt Obligations\n($ in millions)\nMaturity Date\n2024\n2023\n2.4\n% notes ($\n300\n)\n2024\n—\n \n299\n \n0.875\n% notes (€\n600\n)\n2025\n620\n \n660\n \n1.875\n% notes (€\n300\n)\n2025\n310\n \n330\n \n1.2\n% notes ($\n700\n)\n2026\n698\n \n696\n \nTerm Loan Credit Agreement, due 2026 (€\n750\n)\n2026\n776\n \n552\n \n1.4\n% notes (€\n600\n)\n2027\n619\n \n659\n \n3.75\n% notes ($\n800\n)\n(1)\n2028\n806\n \n808\n \n2.5\n% notes (€\n80\n)\n2029\n83\n \n87\n \n2.8\n% notes ($\n300\n)\n2029\n298\n \n298\n \n2.75\n% notes (€\n700\n)\n2029\n718\n \n768\n \n2.55\n% notes ($\n300\n)\n2030\n297\n \n297\n \n1.95\n% note (€\n50\n)\n2037\n51\n \n54\n \n7.7\n% notes ($\n176\n)\n2038\n175\n \n174\n \n5.5\n% notes ($\n250\n)\n2040\n248\n \n247\n \n3.0\n% notes (€\n120\n)\n2044\n118\n \n126\n \nVarious other non-U.S. debt\nVarious\n—\n \n1\n \nFinance lease obligations\nVarious\n7\n \n8\n \nImpact of derivatives on debt\n(2)\nN/A\n(\n16\n)\n(\n14\n)\nTotal\n$\n5,808\n \n$\n6,050\n \nLess payments due within one year\nN/A\n932\n \n302\n \nLong-term debt\n$\n4,876\n \n$\n5,748\n \n(1)\nIn February 2018, PPG entered into interest rate swaps which converted $\n375\n million of the notes from a fixed interest rate to a floating interest rate based on the three month LIBOR. The impact of the derivative on the notes represents the fair value adjustment of the debt. The average effective interest rate for the portion of the notes impacted by the swaps was \n6.4\n% and \n6.2\n% for the years ended December 31, 2024 and 2023, respectively. Refer to Note 11, “Financial Instruments, Hedging Activities and Fair Value Measurements” for additional information. \n(2)\nFair value adjustment of the \n3.75\n%  $\n800\n million notes as a result of fair value hedge accounting treatment related to the outstanding interest rate swaps as of December 31, 2024 and 2023. Refer to Note 11, “Financial Instruments, Hedging Activities and Fair Value Measurements” for additional information.\n2024 PPG ANNUAL REPORT AND FORM 10-K      53\nCredit Agreements\nIn April 2023, PPG entered into a €\n500\n million term loan credit agreement (the \"Term Loan\"). The Term Loan contains covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan terminates and all amounts outstanding are payable in April 2026. In April 2023, PPG borrowed €\n500\n million under the Term Loan. In December 2023, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €\n250\n million. In January 2024, PPG borrowed the additional €\n250\n million. In December 2024, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €\n300\n million. In January 2025, PPG borrowed the additional €\n300\n million.  The Term Loan is denominated in euro and has been designated as a hedge of the net investment in the Company’s European operations. For more information, refer to Note 11 “Financial Instruments, Hedging Activities and Fair Value Measurements.” \nIn March 2023, PPG amended its \nfive-year\n credit agreement (the “Credit Agreement”) dated as of August 30, 2019. The amendments to the Credit Agreement replaced the LIBOR-based reference interest rate option with a reference interest rate option based upon Term SOFR. The other terms of the Credit Agreement remained unchanged. In July 2023, PPG amended and restated the Credit Agreement, extending the term through July 27, 2028. The amended and restated Credit Agreement provides for a $\n2.3\n billion unsecured revolving credit facility. The Company has the ability to increase the size of the Credit Agreement by up to an additional $\n750\n million, subject to the receipt of lender commitments and other conditions precedent. The Company has the right, subject to certain conditions set forth in the Credit Agreement, to designate certain subsidiaries of the Company as borrowers under the Credit Agreement. In connection with any such designation, the Company is required to guarantee the obligations of any such subsidiaries under the Credit Agreement. There were no amounts outstanding under the Credit Agreement as of December 31, 2024 and December 31, 2023. \nBorrowings under the Credit Agreement may be made in U.S. Dollars or in euros. The Credit Agreement provides that loans will bear interest at rates based, at the Company’s option, on one of two specified base rates plus a margin based on certain formulas defined in the Credit Agreement. Additionally, the Credit Agreement contains a Commitment Fee, as defined in the Credit Agreement, on the amount of unused commitments under the Credit Agreement ranging from \n0.060\n% to \n0.125\n% per annum.\nThe Credit Agreement also supports the Company’s commercial paper borrowings which are classified as long-term based on PPG’s intent and ability to refinance these borrowings on a long-term basis.  There were \nno\n commercial paper borrowings outstanding as of both December 31, 2024 and December 31, 2023.\nThe Credit Agreement contains usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Credit Agreement also requires the Company to maintain a ratio of Total Indebtedness to Total Capitalization, as defined in the Credit Agreement, of \n60\n% or less; provided, that for any fiscal quarter in which the Company has made an acquisition for consideration in excess of $\n1\n billion and for the next five fiscal quarters thereafter, the ratio of Total Indebtedness to Total Capitalization may not exceed \n65\n% at any time. As of December 31, 2024, Total Indebtedness to Total Capitalization as defined under the Credit Agreement was \n45\n%.\nThe Credit Agreement contains, among other things, customary events of default that would permit the lenders to accelerate the loans, including the failure to make timely payments when due under the Credit Agreement or other material indebtedness, the failure to satisfy covenants contained in the Credit Agreement, a change in control of the Company and specified events of bankruptcy and insolvency.\n2024 PPG ANNUAL REPORT AND FORM 10-K      54\nOther Long-term Debt Activities\nIn August 2024, PPG’s $\n300\n million \n2.4\n% notes matured, and the Company repaid this obligation using cash on hand.\nIn March 2023, PPG’s $\n300\n million \n3.2\n% notes matured, and the Company repaid this obligation using cash on hand.\nIn May 2022, PPG completed a public offering of €\n300\n million \n1.875\n% Notes due 2025 and €\n700\n million \n2.750\n% Notes due 2029. These notes were issued pursuant to PPG’s existing shelf registration statement and pursuant to an indenture between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee, as supplemented (the \"2022 Indenture\"). The 2022 Indenture governing these notes contains covenants that limit the Company’s ability to, among other things, incur certain liens securing indebtedness, engage in certain sale-leaseback transactions, and enter into certain consolidations, mergers, conveyances, transfers or leases of all or substantially all the Company’s assets. The terms of these notes also require the Company to make an offer to repurchase Notes upon a Change of Control Triggering Event (as defined in the 2022 Indenture) at a price equal to \n101\n% of their principal amount plus accrued and unpaid interest. The Company may issue additional debt from time to time pursuant to the Indenture. The aggregate cash proceeds from the notes, net of discounts and fees, was $\n1,061\n million. The notes are denominated in euro and have been designated as hedges of net investments in the Company’s European operations. Refer to Note 11 “Financial Instruments, Hedging Activities and Fair Value Measurements.” for additional information.\nIn March 2022, PPG privately placed a \n15-year\n €\n50\n million \n1.95\n% fixed interest note. This note contains covenants materially consistent with the \n1.875\n% and \n2.750\n% notes discussed above. This debt arrangement is denominated in euros and has been designated as a net investment hedge of the Company's European operations. Refer to Note 11 \"Financial Instruments, Hedging Activities and Fair Value Measurements\" for additional information.\nIn February 2021, PPG entered into a $\n2.0\n billion term loan credit agreement (the \"Term Loan Credit Agreement\") to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. The Term Loan Credit Agreement provided the Company with the ability to borrow up to an aggregate principal amount of $\n2.0\n billion on an unsecured basis. The Term Loan Credit Agreement contained covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan Credit Agreement was scheduled to mature and all outstanding borrowings were due and payable on the third anniversary of the date of the initial borrowing under the Agreement. In June 2021, PPG borrowed $\n700\n million under the Term Loan Credit Agreement to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. In December 2021, PPG borrowed an additional $\n700\n million under the Term Loan Credit Agreement to be used for working capital and general corporate purposes.  In 2022 and 2023, PPG repaid $\n300\n million and $\n1.1\n billion, respectively, of the Term Loan Credit Agreement using cash on hand. The Term Loan Credit Agreement was fully repaid as of December 31, 2023. \nRestrictive Covenants and Cross-Default Provisions\nAs of December 31, 2024, PPG was in full compliance with the restrictive covenants under its various credit agreements, loan agreements and indentures. \nAdditionally, the Company’s Credit Agreement contains customary cross-default provisions. These provisions provide that a default on a debt service payment of $\n100\n million or more for longer than the grace period provided under another agreement may result in an event of default under this agreement. None of the Company’s primary debt obligations are secured or guaranteed by the Company’s affiliates.\nLong-term Debt Maturities\n($ in millions)\nMaturity per year\n2025\n$\n933\n \n2026\n$\n1,474\n \n2027\n$\n621\n \n2028\n$\n782\n \n2029\n$\n1,106\n \nThereafter\n$\n892\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      55\nShort-term Debt Obligations\n($ in millions)\n2024\n2023\nVarious, weighted average 1.9% and 2.4% as of December 31, 2024 and 2023, respectively. \n$\n7\n \n$\n4\n \nLines of Credit, Letters of Credit and Surety Bonds\nPPG’s non-U.S. operations have uncommitted lines of credit totaling $\n480\n million of which none was used as of December 31, 2024. These uncommitted lines of credit are subject to cancellation at any time and are generally not subject to any commitment fees.\nThe Company had outstanding letters of credit and surety bonds of $\n302\n million and $\n232\n million as of December 31, 2024 and 2023, respectively. The letters of credit secure the Company’s performance to third parties under certain self-insurance programs and other commitments made in the ordinary course of business. The Company does not believe any loss related to these letters of credit or surety bonds is likely.\n11. \nFinancial Instruments, Hedging Activities and Fair Value Measurements \nFinancial instruments include cash and cash equivalents, short-term investments, cash held in escrow, marketable equity securities, accounts receivable, company-owned life insurance, accounts payable, short-term and long-term debt instruments, and derivatives. The fair values of these financial instruments approximated their carrying values at December 31, 2024 and 2023, in the aggregate, except for long-term debt instruments.\nHedging Activities\nThe Company has exposure to market risk from changes in foreign currency exchange rates and interest rates. As a result, financial instruments, including derivatives, have been used to hedge a portion of these underlying economic exposures. Certain of these instruments qualify as fair value, cash flow, and net investment hedges upon meeting the requisite criteria, including effectiveness of offsetting hedged or underlying exposures. Changes in the fair value of derivatives that do not qualify for hedge accounting are recognized in Income before income taxes in the period incurred.\nPPG’s policies do not permit speculative use of derivative financial instruments. PPG enters into derivative financial instruments with high credit quality counterparties and diversifies its positions among such counterparties in order to reduce its exposure to credit losses. The Company did not realize a credit loss on derivatives during the three-year period ended December 31, 2024.\nAll of PPG’s outstanding derivative instruments are subject to accelerated settlement in the event of PPG’s failure to meet its debt or payment obligations under the terms of the instruments’ contractual provisions. In addition, if the Company would be acquired and its payment obligations under its derivative instruments’ contractual arrangements are not assumed by the acquirer, or if PPG would enter into bankruptcy, receivership or reorganization proceedings, its outstanding derivative instruments would also be subject to accelerated settlement.\nIn 2024 and 2023, there were no derivative instruments de-designated or discontinued as a hedging instrument. There were no gains or losses deferred in Accumulated other comprehensive loss on the consolidated balance sheet that were reclassified to Income before income taxes in the consolidated statement of income during the \nthree-year\n period ended December 31, 2024 related to hedges of anticipated transactions that were no longer expected to occur.\nFair Value Hedges\nThe Company uses interest rate swaps from time to time to manage its exposure to changing interest rates. When outstanding, the interest rate swaps are typically designated as fair value hedges of certain outstanding debt obligations of the Company and are recorded at fair value. \nPPG has interest rate swaps which converted to $\n375\n million of fixed rate debt to variable rate debt as of both December 31, 2024 and December 31, 2023, respectively. These swaps are designated as fair value hedges and are carried at fair value. Changes in the fair value of these swaps and changes in the fair value of the related debt are recorded in Interest expense in the accompanying consolidated statement of income. The fair value of these interest rate swaps were liabilities of $\n16\n million and $\n14\n million at December 31, 2024 and 2023, respectively.\nCash Flow Hedges\nAt times, PPG designates certain foreign currency forward contracts as cash flow hedges of the Company’s exposure to variability in exchange rates on third party transactions denominated in foreign currencies. There were no outstanding cash flow hedges at December 31, 2024 and December 31, 2023, respectively. \nNet Investment Hedges\nPPG uses cross currency swaps and foreign currency euro-denominated debt to hedge a significant portion of its net investment in its European operations, as follows: \n2024 PPG ANNUAL REPORT AND FORM 10-K      56\nPPG had U.S. dollar to euro cross currency swap contracts with total notional amounts o\nf $\n375\n million\n and $\n475\n million  as of December 31, 2024 and December 31, 2023, respectively, and designated these contracts as hedges of the Company's net investment in its European operations. During the term of these contracts, PPG will receive payment in U.S. dollars and make payments in euros to the counterparties. As of December 31, 2024 and 2023, the fair value of these contracts were net assets of  $\n50\n million and $\n33\n million, respectively.\nAt December 31, 2024 and 2023, PPG had designated \n€\n3.2\n billion\n and €\n3.0\n billion, respectively, of euro-denominated borrowings as hedges of a portion of its net investment in the Company’s European operations. The carrying value of these instruments was $\n3.3\n billion at both December 31, 2024 and 2023. \nThere were no foreign currency forward contracts designated as net investment hedges used or outstanding as of and for the periods ended December 31, 2024, 2023 and 2022.\nOther Financial Instruments\nPPG uses foreign currency forward contracts to manage net transaction exposures that do not qualify for hedge accounting; therefore, the change in the fair value of these instruments is recorded in Other (income)/charges, net in the consolidated statement of income in the period of change. Underlying notional amounts related to these foreign currency forward contracts were  $\n2.8\n billion and $\n2.5\n billion at December 31, 2024 and 2023, respectively. The fair values of these contracts were net liabilities of \n$\n53\n million\n as of December 31, 2024 and net assets of \n$\n23\n million a\ns of December 31, 2023 respectively.\nGains/Losses Deferred in Accumulated Other Comprehensive Loss \nAs of December 31, 2024 and 2023, the Company had accumulated pretax unrealized translation gains in Accumulated other comprehensive loss on the consolidated balance sheet related to the euro-denominated borrowings, foreign currency forward contracts, and the cross currency swaps of $\n460\n million and $\n223\n million, respectively. \nThe following table summarizes the amount of gains/(losses) deferred in Other comprehensive (loss)/income (\"OCI\") and the amount and location of gains recognized within the consolidated statement of income related to derivative and debt financial instruments for \nthe years ended December 31, 2024, 2023 and 2022. All dollar amounts are shown on a pretax basis.\n2024\n2023\n2022\n($ in millions)\nGain Deferred in OCI\n(Loss)/Gain Recognized\nLoss Deferred in OCI\n(Loss)/Gain Recognized\nGain Deferred in OCI\nGain Recognized\nCaption in Consolidated Statement of Income\nFair Value\nInterest rate swaps\n($\n10\n)\n($\n10\n)\n$\n8\n \nInterest expense\nTotal Fair Value\n($\n10\n)\n($\n10\n)\n$\n8\n \nNet Investment\nCross currency swaps\n$\n20\n \n$\n9\n \n($\n15\n)\n$\n12\n \n$\n38\n \n$\n16\n \nInterest expense\nForeign denominated debt\n217\n \n— \n(\n89\n)\n— \n85\n \n— \nTotal Net Investment\n$\n237\n \n$\n9\n \n($\n104\n)\n$\n12\n \n$\n123\n \n$\n16\n \nEconomic\nForeign currency forward contracts\n$\n43\n \n$\n49\n \n$\n43\n \nOther charges/(income), net\nFair Value Measurements\nThe Company follows a fair value measurement hierarchy to measure its assets and liabilities. As of December 31, 2024 and 2023, respectively, the assets and liabilities measured at fair value on a recurring basis were cash equivalents, equity securities and derivatives. In addition, the Company measures its pension plan assets at fair value (see Note 14, “Employee Benefit Plans” for further details). The Company’s financial assets and liabilities are measured using inputs from the following three levels: \nLevel 1 inputs are quoted prices in active markets for identical assets and liabilities that the Company has the ability to access at the measurement date. Level 1 inputs are considered to be the most reliable evidence of fair value as they are based on unadjusted quoted market prices from various financial information service providers and securities exchanges. \nLevel 2 inputs are directly or indirectly observable prices that are not quoted on active exchanges, which include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability and inputs that are derived principally from or corroborated by observable market data by correlation or other means. The fair values of the derivative instruments reflect the instruments’ contractual terms, including the period to maturity, and uses observable market-based inputs, including forward curves. \n2024 PPG ANNUAL REPORT AND FORM 10-K      57\nLevel 3 inputs are unobservable inputs employed for measuring the fair value of assets or liabilities. The Company does not have any recurring financial assets or liabilities that are recorded in its consolidated balance sheets as of December 31, 2024 and 2023 that are classified as Level 3 inputs.\nAssets and liabilities reported at fair value on a recurring basis\nDecember 31, 2024\nDecember 31, 2023\n($ in millions)\nLevel 1\nLevel 2\nLevel 3\nLevel 1\nLevel 2\nLevel 3\nAssets:\nOther current assets:\n \n \n \nMarketable equity securities\n$\n9\n \n$— \n$— \n$\n9\n \n$— \n$— \nForeign currency forward contracts\n(a)\n— \n5\n \n— \n— \n28\n \n— \nCross currency swaps\n(b)\n— \n—\n \n— \n— \n2\n \n— \nInvestments:\nMarketable equity securities\n$\n85\n \n$— \n$— \n$\n74\n \n$— \n$— \nOther assets:\nCross currency swaps\n(b)\n$— \n$\n50\n \n$— \n$— \n$\n31\n \n$— \nLiabilities:\nAccounts payable and accrued liabilities:\nForeign currency forward contracts\n(a)\n$— \n$\n58\n \n$— \n$— \n$\n5\n \n$— \nOther liabilities:\nInterest rate swaps\n(c)\n$— \n$\n16\n \n$— \n$— \n$\n14\n \n$— \n(a)    Derivatives not designated as hedging instruments\n(b)    Net investment hedges\n(c)    Fair value hedges\nLong-Term Debt\n($ in millions)\nDecember 31, 2024 \n(a)\nDecember 31, 2023 \n(b)\nLong-term debt - carrying value\n$\n5,801\n$\n6,042\nLong-term debt - fair value\n$\n5,634\n$\n5,781\n(a)    Excluding finance lease obligations of $\n7\n million and short term borrowings of $\n7\n million as of December 31, 2024.\n(b)    Excluding finance lease obligations of $\n8\n million and short term borrowings of $\n4\n million as of December 31, 2023.\nThe fair values of the debt instruments were measured using Level 2 inputs, including discounted cash flows and interest rates then currently available to the Company for instruments of the same remaining maturities.\n12. \nEarnings Per Common Share \n($ in millions, except per share amounts)\n2024\n2023\n2022\nEarnings per common share (attributable to PPG)\nIncome from continuing operations, net of tax\n$\n1,344\n \n$\n1,223\n \n$\n1,007\n \n(Loss)/income from discontinued operations, net of tax\n(\n228\n)\n47\n \n19\n \nNet income (attributable to PPG)\n$\n1,116\n \n$\n1,270\n \n$\n1,026\n \nWeighted average common shares outstanding\n233.8\n \n236.0\n \n236.1\n \nEffect of dilutive securities:\n \n \n \nStock options\n0.4\n \n0.5\n \n0.5\n \nOther stock compensation plans\n0.7\n \n0.7\n \n0.7\n \nPotentially dilutive common shares\n1.1\n \n1.2\n \n1.2\n \nAdjusted weighted average common shares outstanding\n234.9\n \n237.2\n \n237.3\n \nEarnings per common share (attributable to PPG)\nIncome from continuing operations, net of tax\n$\n5.75\n \n$\n5.18\n \n$\n4.26\n \n(Loss)/income from discontinued operations, net of tax\n(\n0.98\n)\n0.20\n \n0.08\n \nNet income (attributable to PPG)\n$\n4.77\n \n$\n5.38\n \n$\n4.34\n \nEarnings per common share - assuming dilution (attributable to PPG)\nIncome from continuing operations, net of tax\n$\n5.72\n \n$\n5.16\n \n$\n4.24\n \n(Loss)/income from discontinued operations, net of tax\n(\n0.97\n)\n0.19\n \n0.08\n \nNet income (attributable to PPG)\n$\n4.75\n \n$\n5.35\n \n$\n4.32\n \nAntidilutive securities\n(a)\n:\nStock options\n1.3\n \n0.9\n \n0.9\n \n(a)\nExcluded from the computation of earnings per diluted share due to their antidilutive effect.\n2024 PPG ANNUAL REPORT AND FORM 10-K      58\n13. \nIncome Taxes \nThe provision for income taxes by taxing jurisdiction and by significant components consisted of the following:\n($ in millions)\n2024\n2023\n2022\nCurrent\n \n \n \nU.S. federal\n$\n67\n \n$\n95\n \n$\n136\n \nU.S. state and local\n15\n \n14\n \n20\n \nForeign\n490\n \n506\n \n315\n \nTotal current income tax expense\n$\n572\n \n$\n615\n \n$\n471\n \nDeferred\n \n \n \nU.S. federal\n($\n2\n)\n($\n156\n)\n($\n77\n)\nU.S. state and local\n(\n8\n)\n(\n15\n)\n(\n7\n)\nForeign\n(\n87\n)\n(\n16\n)\n(\n67\n)\nTotal deferred income tax benefit\n($\n97\n)\n($\n187\n)\n($\n151\n)\nTotal income tax expense\n$\n475\n \n$\n428\n \n$\n320\n \nA reconciliation of the statutory U.S. corporate federal income tax rate to the Company’s effective tax rate follows:\n2024\n2023\n2022\nU.S. federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nChanges in rate due to:\n \n \n \nTaxes on non-U.S. earnings\n4.8\n \n4.3\n \n3.6\n \nChange in valuation allowance reserves\n3.5\n \n3.6\n \n0.6\n \nOther foreign tax effects\n(\n4.7\n)\n(\n2.8\n)\n(\n1.7\n)\nPillar 2 global minimum tax\n0.8\n \n—\n \n—\n \nImpairment and other related charges, net\n(\n0.2\n)\n2.0\n \n1.4\n \nUncertain tax positions\n1.2\n \n(\n1.8\n)\n(\n0.3\n)\nU.S. tax cost/(benefit) on foreign operations\n0.9\n \n(\n0.9\n)\n(\n0.2\n)\nU.S. tax incentives\n(\n0.8\n)\n(\n0.8\n)\n(\n1.1\n)\nTax benefits from equity awards\n—\n \n(\n0.2\n)\n(\n0.3\n)\nU.S. state and local taxes\n0.3\n \n—\n \n0.7\n \nOther\n(\n1.2\n)\n0.9\n \n(\n0.1\n)\nEffective income tax rate\n25.6\n \n%\n25.3\n \n%\n23.6\n \n%\nIncome/(loss) before income taxes of the Company’s U.S. operations for 2024, 2023 and 2022 was $\n210\n million, $(\n129\n) million and $\n290\n million, respectively. Income before income taxes of the Company’s foreign operations for 2024, 2023 and 2022 was $\n1,642\n million, $\n1,819\n million and $\n1,065\n million, respectively.\nDeferred income taxes\nDeferred income taxes are provided for the effect of temporary differences that arise because there are certain items treated differently for financial accounting than for income tax reporting purposes. The deferred tax assets and liabilities are determined by applying the enacted tax rate in the year in which the temporary difference is expected to reverse. \n($ in millions)\n2024\n2023\nDeferred income tax assets related to\nEmployee benefits\n$\n215\n \n$\n266\n \nContingent and accrued liabilities\n105\n \n61\n \nOperating loss and other carry-forwards\n389\n \n270\n \nOperating lease liabilities\n144\n \n187\n \nResearch and development amortization\n259\n \n213\n \nOther\n280\n \n198\n \nValuation allowance\n(\n327\n)\n(\n240\n)\nTotal\n$\n1,065\n \n$\n955\n \nDeferred income tax liabilities related to\n \n \nProperty\n$\n268\n \n$\n220\n \nIntangibles\n607\n \n679\n \nEmployee benefits\n39\n \n47\n \nOperating lease right-of-use assets\n148\n \n194\n \nOther\n105\n \n43\n \nTotal\n$\n1,167\n \n$\n1,183\n \nDeferred income tax liabilities – net\n($\n102\n)\n($\n228\n)\n2024 PPG ANNUAL REPORT AND FORM 10-K      59\nNet operating loss and credit carryforwards\n($ in millions)\n2024\n2023\nExpiration\nAvailable net operating loss carryforwards, tax effected:\nIndefinite expiration\n$\n85\n \n$\n86\n \nNA\nDefinite expiration\n150\n \n72\n \n2025-2044\nTotal\n$\n235\n \n$\n158\n \nIncome tax credit carryforwards\n$\n112\n \n$\n108\n \n2025-2034\nA valuation allowance of $\n327\n million and $\n240\n million has been established as of December 31, 2024 and 2023, respectively, for carryforwards and certain other items when the ability to utilize them is not likely.\nUndistributed foreign earnings\nThe Company had $\n6.1\n billion of undistributed earnings of non-U.S. subsidiaries as of December 31, 2024. This amount relates to approximately \n245\n subsidiaries in approximately \n65\n taxable jurisdictions. The Company estimates repatriation of undistributed earnings of non-U.S. subsidiaries as of December 31, 2024 would result in a tax cost o\nf \n$\n142\n million\n. \nAs of December 31, 2024, the Company had not changed its intention to reinvest foreign earnings indefinitely or repatriate when it is tax effective to do so, and as such, has not established a liability for foreign withholding taxes or other costs that would be incurred if the earnings were repatriated.\nUnrecognized tax benefits\nThe Company files federal, state and local income tax returns in numerous domestic and foreign jurisdictions. In most tax jurisdictions, returns are subject to examination by the relevant tax authorities for a number of years after the returns have been filed. The Company is no longer subject to examinations by tax authorities in any major tax jurisdiction for years before 2008. Additionally, the Company is no longer subject to examination by the Internal Revenue Service for U.S. federal income tax returns filed for years through 2018. The examinations of the Company’s U.S. federal income tax returns for 2019 and 2020 are currently underway. \nA reconciliation of the total amounts of unrecognized tax benefits (excluding interest and penalties) as of December 31 follows:\n($ in millions)\n2024\n2023\n2022\nJanuary 1\n$\n121\n \n$\n145\n \n$\n158\n \nCurrent year tax positions - additions\n8\n \n16\n \n19\n \nPrior year tax positions - additions\n43\n \n33\n \n2\n \nPrior year tax positions - reductions\n(\n1\n)\n(\n14\n)\n(\n2\n)\nStatute of limitations expirations\n(\n20\n)\n(\n9\n)\n(\n23\n)\nSettlements\n(\n6\n)\n(\n51\n)\n(\n3\n)\nForeign currency translation\n(\n4\n)\n1\n \n(\n6\n)\nDecember 31\n$\n141\n \n$\n121\n \n$\n145\n \nThe Company expects that any reasonably possible change in the amount of unrecognized tax benefits in the next 12 months would not be significant. The total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rate was $\n138\n million as of December 31, 2024. \nInterest and penalties\n($ in millions)\n2024\n2023\n2022\nAccrued interest and penalties related to unrecognized tax benefits\n$\n11\n \n$\n14\n \n$\n17\n \n(Income)/loss recognized in income tax expense related to interest and penalties\n($\n2\n)\n($\n2\n)\n$\n1\n \nThe Company recognizes accrued interest and penalties related to unrecognized tax benefits in income tax expense.\n14. \nEmployee Benefit Plans \nDefined Benefit Plans\nPPG has defined benefit pension plans that cover certain employees worldwide. The principal defined benefit pension plans are those in the U.S., Canada, Germany, the Netherlands and the U.K. These plans in the aggregate represent approximately \n92\n% of PPG’s total projected benefit obligation at December 31, 2024, of which the U.S. defined benefit pension plans represent the largest component.\nAs of January 1, 2006, the Company’s U.S. salaried defined benefit plans were closed to new entrants. In 2011 and 2012, the Company approved amendments related to its U.S. and Canadian defined benefit plans pursuant to which employees \n2024 PPG ANNUAL REPORT AND FORM 10-K      60\nstopped accruing benefits at certain dates based on the affected employee’s combined age and years of service to PPG. As of December 31, 2020, the Company’s U.S. and Canadian defined benefit plans were frozen for all participants. The Company plans to continue reviewing and potentially amending PPG defined benefit plans in the future.\nU.S. pension annuity contracts\nIn March 2023, the Company purchased group annuity contracts that transferred to third-party insurance companies pension benefit obligations for certain of the Company’s retirees in the U.S. who were receiving their monthly retirement benefit payments from a U.S. pension plan. The amount of each affected retiree’s annuity payment is equal to the amount of such individual’s pension benefit. The purchase of group annuity contracts was funded directly by the assets of the U.S. plans. By transferring the obligations and assets to the insurance companies, the Company reduced its overall pension projected benefit obligation by $\n309\n million and recognized a non-cash Pension settlement charge of $\n190\n million in the consolidated statement of income for the year ended December 31, 2023.\nPostretirement medical \nPPG sponsors welfare benefit plans that provide postretirement medical and life insurance benefits for certain U.S. and Canadian employees and their dependents of which the U.S. welfare benefit plans represent approximately \n86\n% of PPG’s total projected benefit obligation at December 31, 2024. Salaried and certain hourly employees in the U.S. hired on or after October 1, 2004, or rehired on or after October 1, 2012 are not eligible for postretirement medical benefits. These plans in the U.S. and Canada require retiree contributions based on retiree-selected coverage levels for certain retirees and their dependents and provide for sharing of future benefit cost increases between PPG and participants based on management discretion. The Company has the right to modify, amend or terminate certain of these benefit plans in the future. \nEffective January 1, 2017, the Company-sponsored Medicare-eligible plans were replaced by a Medicare private exchange. The announcement of this plan design change triggered a remeasurement of PPG’s retiree medical benefit obligation using prevailing interest rates. The plan design change resulted in a $\n306\n million reduction in the Company's postretirement benefit obligation. PPG accounted for the plan design change prospectively, and the impact was amortized to periodic postretirement benefit cost over a \n5.6\n year period through mid-2022.\nThe following table sets forth the changes in projected benefit obligations (“PBO”), plan assets, the funded status and the amounts recognized on the accompanying consolidated balance sheet for the Company’s defined benefit pension and other postretirement benefit plans:\nDefined Benefit Pension Plans\n \nUnited States \nInternational \nTotal PPG\n($ in millions)\n2024\n2023\n2024\n2023\n2024\n2023\nProjected benefit obligation, January 1\n$\n1,143\n \n$\n1,425\n \n$\n1,068\n \n$\n956\n \n$\n2,211\n \n$\n2,381\n \nService cost\n—\n \n—\n \n8\n \n7\n \n8\n \n7\n \nInterest cost\n55\n \n62\n \n48\n \n49\n \n103\n \n111\n \nPlan amendments\n—\n \n—\n \n1\n \n—\n \n1\n \n—\n \nActuarial (gains)/losses\n(\n57\n)\n44\n \n(\n33\n)\n75\n \n(\n90\n)\n119\n \nBenefits paid\n(\n67\n)\n(\n79\n)\n(\n53\n)\n(\n50\n)\n(\n120\n)\n(\n129\n)\nForeign currency translation adjustments\n—\n \n—\n \n(\n54\n)\n47\n \n(\n54\n)\n47\n \nSettlements\n(\n19\n)\n(\n309\n)\n(\n13\n)\n(\n11\n)\n(\n32\n)\n(\n320\n)\nOther\n—\n \n—\n \n—\n \n(\n5\n)\n—\n \n(\n5\n)\nProjected benefit obligation, December 31\n$\n1,055\n \n$\n1,143\n \n$\n972\n \n$\n1,068\n \n$\n2,027\n \n$\n2,211\n \nMarket value of plan assets, January 1\n$\n731\n \n$\n1,028\n \n$\n989\n \n$\n937\n \n$\n1,720\n \n$\n1,965\n \nActual return on plan assets\n7\n \n45\n \n(\n15\n)\n43\n \n(\n8\n)\n88\n \nCompany contributions\n24\n \n28\n \n2\n \n18\n \n26\n \n46\n \nBenefits paid\n(\n49\n)\n(\n61\n)\n(\n44\n)\n(\n40\n)\n(\n93\n)\n(\n101\n)\nPlan settlements\n(\n19\n)\n(\n309\n)\n(\n6\n)\n(\n11\n)\n(\n25\n)\n(\n320\n)\nForeign currency translation adjustments\n—\n \n—\n \n(\n37\n)\n45\n \n(\n37\n)\n45\n \nOther\n—\n \n—\n \n(\n3\n)\n(\n3\n)\n(\n3\n)\n(\n3\n)\nMarket value of plan assets, December 31\n$\n694\n \n$\n731\n \n$\n886\n \n$\n989\n \n$\n1,580\n \n$\n1,720\n \nFunded Status\n($\n361\n)\n($\n412\n)\n($\n86\n)\n($\n79\n)\n($\n447\n)\n($\n491\n)\nAmounts recognized in the Consolidated Balance Sheet:\nOther assets (long-term)\n—\n \n—\n \n144\n \n148\n \n144\n \n148\n \nAccounts payable and accrued liabilities\n(\n18\n)\n(\n38\n)\n(\n15\n)\n(\n13\n)\n(\n33\n)\n(\n51\n)\nAccrued pensions\n(\n343\n)\n(\n374\n)\n(\n215\n)\n(\n214\n)\n(\n558\n)\n(\n588\n)\nNet liability recognized\n($\n361\n)\n($\n412\n)\n($\n86\n)\n($\n79\n)\n($\n447\n)\n($\n491\n)\n2024 PPG ANNUAL REPORT AND FORM 10-K      61\nOther Postretirement Benefit Plans\n \nUnited States \nInternational\nTotal PPG\n($ in millions)\n2024\n2023\n2024\n2023\n2024\n2023\nProjected benefit obligation, January 1\n$\n424\n \n$\n458\n \n$\n71\n \n$\n66\n \n$\n495\n \n$\n524\n \nService cost\n3\n \n4\n \n—\n \n—\n \n3\n \n4\n \nInterest cost\n20\n \n23\n \n3\n \n4\n \n23\n \n27\n \nPlan amendments\n—\n \n(\n17\n)\n—\n \n—\n \n—\n \n(\n17\n)\nActuarial (gains)/losses\n(\n22\n)\n(\n3\n)\n(\n2\n)\n3\n \n(\n24\n)\n—\n \nBenefits paid\n(\n35\n)\n(\n39\n)\n(\n4\n)\n(\n3\n)\n(\n39\n)\n(\n42\n)\nForeign currency translation adjustments\n—\n \n—\n \n(\n5\n)\n1\n \n(\n5\n)\n1\n \nCurtailments\n—\n \n(\n2\n)\n—\n \n—\n \n—\n \n(\n2\n)\nProjected benefit obligation, December 31\n$\n390\n \n$\n424\n \n$\n63\n \n$\n71\n \n$\n453\n \n$\n495\n \nAmounts recognized in the Consolidated Balance Sheet:\nAccounts payable and accrued liabilities\n(\n39\n)\n(\n41\n)\n(\n4\n)\n(\n4\n)\n(\n43\n)\n(\n45\n)\nOther postretirement benefits\n(\n351\n)\n(\n383\n)\n(\n59\n)\n(\n67\n)\n(\n410\n)\n(\n450\n)\nNet liability recognized\n($\n390\n)\n($\n424\n)\n($\n63\n)\n($\n71\n)\n($\n453\n)\n($\n495\n)\nThe PBO is the actuarial present value of benefits attributable to employee service rendered to date, including the effects of estimated future pay increases. The accumulated benefit obligation (“ABO”) is the actuarial present value of benefits attributable to employee service rendered to date, but does not include the effects of estimated future pay increases. The ABO for all defined benefit pension plans as of December 31, 2024 and 2023 was $\n2.0\n billion and $\n2.2\n billion, respectively.\nThe following table details the pension plans where the benefit liability exceeds the fair value of the plan assets:\n \nPensions\n($ in millions)\n2024\n2023\nPlans with PBO in Excess of Plan Assets:\nProjected benefit obligation\n$\n1,307\n \n$\n1,426\n \nFair value of plan assets\n$\n717\n \n$\n771\n \nPlans with ABO in Excess of Plan Assets:\nAccumulated benefit obligation\n$\n1,274\n \n$\n1,366\n \nFair value of plan assets\n$\n712\n \n$\n737\n \nNet actuarial losses/(gains) and prior service credit deferred in accumulated other comprehensive loss\nPensions\nOther Postretirement Benefits\n($ in millions)\n2024\n2023\n2024\n2023\nAccumulated net actuarial losses/(gains)\n$\n670\n \n$\n682\n \n($\n37\n)\n($\n15\n)\nAccumulated prior service credit\n—\n \n—\n \n(\n16\n)\n(\n20\n)\nTotal\n$\n670\n \n$\n682\n \n($\n53\n)\n($\n35\n)\nThe accumulated net actuarial losses (gains) for pensions and other postretirement benefits relate primarily to historical changes in the discount rates. The accumulated net actuarial losses exceeded 10% of the higher of the market value of plan assets or the PBO at the beginning of each of the last three years; therefore, amortization of such excess has been included in net periodic benefit costs for pension and other postretirement benefits in these periods. The amortization period is the average remaining service period of active employees expected to receive benefits unless a plan is mostly inactive in which case the amortization period is the average remaining life expectancy of the plan participants. Accumulated prior service credit is amortized over the future service periods of those employees who are active at the dates of the plan amendments and who are expected to receive benefits.\nThe net decrease in Accumulated other comprehensive loss (pretax) related to defined benefit pension and other postretirement benefit plans during the year ended December 31, 2024 was due to the following:\n($ in millions)\nPensions\nOther Postretirement Benefits\nNet actuarial loss/(gain) arising during the year\n$\n28\n \n($\n24\n)\nPlan amendment\n1\n \n—\n \nAmortization of actuarial (loss)/gain\n(\n22\n)\n1\n \nAmortization of prior service credit\n(\n1\n)\n4\n \nForeign currency translation adjustments\n(\n7\n)\n1\n \nImpact of settlements\n(\n11\n)\n—\n \nNet decrease\n($\n12\n)\n($\n18\n)\n2024 PPG ANNUAL REPORT AND FORM 10-K      62\nThe 2024 net actuarial loss related to the Company’s pension and other postretirement benefit plans was primarily due to a decrease in the weighted average discount rate used to determine the benefit obligation at December 31, 2024.\nNet periodic benefit cost/(income)\nPensions\nOther Postretirement Benefits\n($ in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n8\n \n$\n7\n \n$\n9\n \n$\n3\n \n$\n4\n \n$\n8\n \nInterest cost\n103\n \n111\n \n73\n \n23\n \n27\n \n16\n \nExpected return on plan assets\n(\n109\n)\n(\n110\n)\n(\n140\n)\n— \n— \n— \nAmortization of prior service cost\n1\n \n— \n— \n(\n4\n)\n(\n7\n)\n(\n11\n)\nAmortization of actuarial losses/(gains)\n22\n \n21\n \n34\n \n(\n1\n)\n(\n1\n)\n12\n \nSettlements, curtailments, and special termination benefits\n11\n \n192\n \n6\n \n— \n(\n2\n)\n— \nNet periodic benefit cost/(income)\n$\n36\n \n$\n221\n \n($\n18\n)\n$\n21\n \n$\n21\n \n$\n25\n \nService cost for net periodic pension and other postretirement benefit costs is included in Cost of sales, exclusive of depreciation and amortization, Selling, general and administrative, and Research and development, net in the accompanying consolidated statement of income. Except for the U.S. pension settlement charge in 2023, which is recorded in Pension settlement charge, all other non-service cost components of net periodic benefit cost are recorded in Other (income)/charges, net in the accompanying consolidated statement of income.\nKey assumptions\nThe following weighted average assumptions were used to determine the benefit obligation for the Company’s defined benefit pension and other postretirement plans as of December 31, 2024 and 2023:\nUnited States\nInternational\nTotal PPG\n2024\n2023\n2024\n2023\n2024\n2023\nDiscount rate\n5.7\n \n%\n5.2\n \n%\n4.8\n \n%\n4.5\n \n%\n5.3\n \n%\n4.9\n \n%\nRate of compensation increase\n2.5\n \n%\n2.5\n \n%\n3.3\n \n%\n3.2\n \n%\n2.9\n \n%\n2.8\n \n%\nThe following weighted average assumptions were used to determine the net periodic benefit cost for the Company’s defined benefit pension and other postretirement benefit plans for the three years in the period ended December 31, 2024:\n2024\n2023\n2022\nDiscount rate\n4.9\n \n%\n5.2\n \n%\n2.5\n \n%\nExpected return on assets\n6.6\n \n%\n6.5\n \n%\n5.0\n \n%\nRate of compensation increase\n2.8\n \n%\n2.7\n \n%\n2.6\n \n%\nThese assumptions for each plan are reviewed on an annual basis. In determining the expected return on plan asset assumption, the Company evaluates the mix of investments that comprise each plan’s assets and external forecasts of future long-term investment returns. The Company compares the expected return on plan assets assumption to actual historic returns to ensure reasonability. For 2024, the return on plan assets assumption for PPG’s U.S. defined benefit pension plans was \n7.7\n%. A change in the rate of return of 75 basis points, with other assumptions held constant, would impact 2025 net periodic pension expense by $\n5\n million. The global expected return on plan assets assumption to be used in determining 2025 net periodic pension expense will be \n6.7\n% (\n7.7\n% for the U.S. plans only).\nThe discount rates used in accounting for pension and other postretirement benefits are determined using a yield curve constructed of high-quality fixed-income securities as of the measurement date and using the plans’ projected benefit payments. The Company has elected to use a full yield curve approach in the estimation of the service and interest cost components of net periodic pension benefit cost/(income) for countries with significant pension plans. The full yield curve approach (also known as the split-rate or spot-rate method) allows the Company to align the applicable discount rates with the cost of additional service being earned and the interest being accrued on these obligations. A change in the discount rate of 75 basis points, with all other assumptions held constant, would impact 2025 net periodic benefit expense for our defined benefit pension and other postretirement benefit plans by $\n3\n million and $\n1\n million, respectively.\nThe weighted-average health care cost trend rate (inflation) used for 2024 was \n5.5\n% declining to a projected \n3.9\n% in the year 2047. For 2025, the assumed weighted-average health care cost trend rate used will be \n6.6\n% declining to a projected \n3.9\n% between 2024 and 2048 for medical and prescription drug costs. These assumptions are reviewed on an annual basis. In selecting rates for current and long-term health care cost assumptions, the Company takes into consideration a number of factors, including the Company’s actual health care cost increases, the design of the Company’s benefit programs, the demographics of the Company’s active and retiree populations and external expectations of future medical cost inflation rates. \n2024 PPG ANNUAL REPORT AND FORM 10-K      63\nContributions to defined benefit pension plans\n($ in millions)\n2024\n2023\n2022\nU.S. defined benefit pension plans\n$\n24\n \n$\n28\n \n$\n—\n \nNon-U.S. defined benefit pension plans\n$\n2\n \n$\n18\n \n$\n11\n \nPPG expects to make mandatory contributions to its defined benefit pension plans in the range of $\n20\n million to $\n30\n million during 2025. In addition to any mandatory contributions, PPG may elect to make voluntary contributions to its defined benefit pension plans in 2025 and beyond.\nBenefit payments\nThe estimated benefits expected to be paid under the Company’s defined benefit pension and other postretirement benefit plans are:\n($ in millions)\nPensions\nOther Postretirement Benefits\n2025\n$\n139\n \n$\n43\n \n2026\n$\n139\n \n$\n41\n \n2027\n$\n143\n \n$\n39\n \n2028\n$\n143\n \n$\n38\n \n2029\n$\n146\n \n$\n37\n \n2030 to 2034\n$\n778\n \n$\n172\n \nPlan assets\nEach PPG sponsored defined benefit pension plan is managed in accordance with the requirements of local laws and regulations governing defined benefit pension plans for the exclusive purpose of providing pension benefits to participants and their beneficiaries. Investment committees comprised of PPG managers have fiduciary responsibility to oversee the management of pension plan assets by third party asset managers. Pension plan assets are held in trust by financial institutions and managed on a day-to-day basis by the asset managers. The asset managers receive a mandate from each investment committee that is aligned with the asset allocation targets established by each investment committee to achieve the plan’s investment strategies. The performance of the asset managers is monitored and evaluated by the investment committees throughout the year. \nPension plan assets are invested to generate investment earnings over an extended time horizon to help fund the cost of benefits promised under the plans while mitigating investment risk. The asset allocation targets established for each pension plan are intended to diversify the investments among a variety of asset categories and among a variety of individual securities within each asset category to mitigate investment risk and provide each plan with sufficient liquidity to fund the payment of pension benefits to retirees.\nThe following summarizes the weighted average target pension plan asset allocation as of December 31, 2024 and 2023 for all PPG defined benefit plans:\nAsset Category\n2024\n2023\nEquity securities\n15-45%\n15-45%\nDebt securities\n30-65%\n30-65%\nReal estate\n0-10%\n0-10%\nOther\n20-40%\n20-40%\n2024 PPG ANNUAL REPORT AND FORM 10-K      64\nThe fair values of the Company’s pension plan assets at December 31, 2024 and 2023, by asset category, are as follows:\nDecember 31, 2024\nDecember 31, 2023\n($ in millions)\nLevel 1\n(1)\nLevel 2\n(1)\nLevel 3\n(1)\nTotal\nLevel 1\n(1)\nLevel 2\n(1)\nLevel 3\n(1)\nTotal\nAsset Category\n \n \n \n \n \nEquity securities:\n \n \n \n \n \nU.S. Large cap\n$\n80\n \n$\n54\n \n$\n—\n \n$\n134\n \n$\n65\n \n$\n55\n \n$\n—\n \n$\n120\n \nU.S. Small cap\n18\n \n—\n \n—\n \n18\n \n16\n \n—\n \n—\n \n16\n \nNon-U.S.\n(2)\n68\n \n34\n \n—\n \n102\n \n96\n \n43\n \n—\n \n139\n \nDebt securities:\n \n \n \n \n \n \n \n \nCash and cash equivalents\n11\n \n33\n \n—\n \n44\n \n22\n \n41\n \n—\n \n63\n \nDiversified\n(3)\n—\n \n45\n \n—\n \n45\n \n—\n \n—\n \n—\n \n—\n \nOther\n(4)\n—\n \n2\n \n239\n \n241\n \n—\n \n2\n \n258\n \n260\n \nReal estate, hedge funds, and other\n—\n \n203\n \n332\n \n535\n \n—\n \n306\n \n341\n \n647\n \nTotal assets in the fair value hierarchy\n$\n177\n \n$\n371\n \n$\n571\n \n$\n1,119\n \n$\n199\n \n$\n447\n \n$\n599\n \n$\n1,245\n \nCommon-collective trusts\n(5)\n— \n— \n— \n461\n \n— \n— \n— \n475\n \nTotal Investments\n$\n177\n \n$\n371\n \n$\n571\n \n$\n1,580\n \n$\n199\n \n$\n447\n \n$\n599\n \n$\n1,720\n \n(1)\nThese levels refer to the accounting guidance on fair value measurement described in Note 11, “Financial Instruments, Hedging Activities and Fair Value Measurements.”\n(2)\nThis category represents holdings in investment grade debt or equity securities of issuers in both developed markets and emerging economies.\n(3)\nThis category represents investment grade debt securities from a diverse set of industry issuers.\n(4)\nThis category primarily represents insurance contracts.\n(5)\nCertain investments that are measured at net asset value per share (or its equivalent) are not required to be classified in the fair value hierarchy.\nThe change in the fair value of the Company’s Level 3 pension assets for the years ended December 31, 2024 and 2023 was as follows:\n($ in millions)\nReal Estate\nOther Debt Securities\nHedge Funds and Other Assets\nTotal\nJanuary 1, 2023\n$\n149\n \n$\n235\n \n$\n293\n \n$\n677\n \nRealized gains/(losses)\n4\n \n25\n \n(\n29\n)\n—\n \nUnrealized (losses)/gains\n(\n19\n)\n—\n \n21\n \n2\n \nTransfers out, net\n(\n17\n)\n(\n9\n)\n(\n89\n)\n(\n115\n)\nForeign currency gains\n2\n \n7\n \n26\n \n35\n \nDecember 31, 2023\n$\n119\n \n$\n258\n \n$\n222\n \n$\n599\n \nRealized gains\n2\n \n9\n \n2\n \n13\n \nUnrealized (losses)/gains\n(\n5\n)\n—\n \n5\n \n—\n \nTransfers (in)/out, net\n(\n28\n)\n(\n12\n)\n19\n \n(\n21\n)\nForeign currency losses\n(\n1\n)\n(\n16\n)\n(\n3\n)\n(\n20\n)\nDecember 31, 2024\n$\n87\n \n$\n239\n \n$\n245\n \n$\n571\n \nReal estate properties are externally appraised at least annually by reputable, independent appraisal firms. Property valuations are also reviewed on a regular basis and are adjusted if there has been a significant change in circumstances related to the property since the last valuation.\nOther debt securities primarily consist of insurance contracts, which are valued externally by insurance companies based on the present value of the expected future cash flows. \nHedge funds consist of a wide range of investments which target a relatively stable investment return. The underlying funds are valued at different frequencies, some monthly and some quarterly, based on the value of the underlying investments. Other assets consist primarily of small investments in private equity funds and debt obligations of non-investment grade borrowers.\nOther Plans\nEmployee savings plans\nPPG’s Employee Savings Plans (“Savings Plans”) cover substantially all employees in the U.S., Puerto Rico and Canada. The Company makes matching contributions to the Savings Plans, at management’s discretion, based upon participants’ savings, subject to certain limitations. For most participants, Company-matching contributions are established each year at the discretion of the Company and are applied to participant accounts up to a maximum of \n6\n% of eligible participant compensation. The Company-matching contribution remained at \n100\n% for 2024. \n2024 PPG ANNUAL REPORT AND FORM 10-K      65\nCompensation expense and cash contributions related to the Company match of participant contributions to the Savings Plans for 2024, 2023, and 2022 totaled \n$\n52\n million, \n$\n49\n million and $\n44\n million, respectively. A portion of the Savings Plans qualifies under the Internal Revenue Code as an Employee Stock Ownership Plan. Accordingly, dividends received on PPG shares held in that portion of the Savings Plans totaling\n $\n11\n million in each of the years ended December 31, \n 2024, 2023 and 2022, respectively, are deductible for PPG’s U.S. Federal tax purposes. \nDefined contribution plans\nAdditionally, the Company has defined contribution plans for certain employees in the U.S., China, United Kingdom, Australia, Italy and other countries. The U.S. defined contribution plan is part of the Employee Savings Plan, and eligible employees receive a contribution equal to between \n2\n% and \n5\n% of annual compensation, based on age and years of service. For the years ended December 31, 2024, 2023 and 2022, the Company recognized expense for its defined contribution retirement plans of \n$\n97\n million\n, $\n83\n million and $\n85\n million, respectively. The Company’s annual cash contributions to its defined contribution retirement plans approximated the expense recognized in each year.\nDeferred compensation plan\nThe Company has a deferred compensation plan for certain key managers which allows them to defer a portion of their compensation in a phantom PPG stock account or other phantom investment accounts. The amount deferred earns a return based on the investment options selected by the participant. The amount owed to participants is an unfunded and unsecured general obligation of the Company. Upon retirement, death, disability, termination of employment, scheduled payment or unforeseen emergency, the compensation deferred and related accumulated earnings are distributed in accordance with the participant’s election in cash or in PPG stock, based on the accounts selected by the participant.\nThe plan provides participants with investment alternatives and the ability to transfer amounts between the phantom non-PPG stock investment accounts. To mitigate the impact on compensation expense of changes in the market value of the liability, the Company has purchased a portfolio of marketable securities that mirror the phantom non-PPG stock investment accounts selected by the participants, except the money market accounts. These investments are carried by PPG at fair market value, and the changes in market value of these securities are also included in Income before income taxes in the consolidated statement of income. Trading occurs in this portfolio to align the securities held with the participant’s phantom non-PPG stock investment accounts, except the money market accounts.\nThe cost of the deferred compensation plan, comprised of dividend equivalents accrued on the phantom PPG stock account, investment income and the change in market value of the liability, was $\n25\n million, $\n23\n million and $\n23\n million in 2024, 2023 and 2022, respectively. These amounts are included in Selling, general and administrative in the consolidated statements of income. The change in market value of the investment portfolio was income of $\n23\n million, $\n21\n million, and $\n24\n million in 2024, 2023 and 2022, respectively, and is also included in Selling, general and administrative in the consolidated statements of income.\nThe Company’s obligations under this plan, which are included in Accounts payable and accrued liabilities and Other liabilities on the consolidated balance sheet, totaled $\n125\n million and $\n113\n million as of December 31, 2024 and 2023, respectively, and the investments in marketable securities, which are included in Investments and Other current assets on the accompanying consolidated balance sheet, were $\n94\n million and $\n83\n million as of December 31, 2024 and 2023, respectively.\n15. \nCommitments and Contingent Liabilities \nPPG is involved in a number of lawsuits and claims, both actual and potential, including some that it has asserted against others, in which substantial monetary damages are sought. These lawsuits and claims may relate to contract, patent, environmental, product liability, antitrust, employment and other matters arising out of the conduct of PPG’s current and past business activities. To the extent that these lawsuits and claims involve personal injury, property damage and certain other claims, PPG believes it has adequate insurance; however, certain of PPG’s insurers are contesting coverage with respect to some of these claims, and other insurers may contest coverage with respect to some claims in the future. PPG’s lawsuits and claims against others include claims against insurers and other third parties with respect to actual and contingent losses related to environmental, asbestos and other matters.\nThe results of any current or future litigation and claims are inherently unpredictable. However, management believes that, in the aggregate, the outcome of all lawsuits and claims involving PPG will not have a material effect on PPG’s consolidated financial position or liquidity; however, such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized.\nAsbestos Matters \nAs of December 31, 2024, the Company was aware of certain asbestos-related claims pending against the Company and certain of its subsidiaries. The Company is defending these asbestos-related claims vigorously. The asbestos-related claims consist of claims against the Company alleging:\n2024 PPG ANNUAL REPORT AND FORM 10-K      66\n•\nexposure to asbestos or asbestos-containing products manufactured, sold or distributed by the Company or its subsidiaries (“Products Claims”);\n•\npersonal injury caused by asbestos on premises presently or formerly owned, leased or occupied by the Company (“Premises Claims”); and\n•\nasbestos-related claims against a subsidiary the Company acquired in 2013 (“Subsidiary Claims”).\nThe Company monitors and reviews the activity associated with its asbestos claims and evaluates, on a periodic basis, its estimated liability for such claims and all underlying assumptions to determine whether any adjustment to the reserves for these claims is required. Additionally, as a supplement to its periodic monitoring and review, the Company conducts discussions with counsel and engages valuation consultants to analyze its claims history and estimate the amount of the Company’s potential liability for asbestos-related claims.\nAs of December 31, 2024 and 2023, the Company’s asbestos-related reserves totaled $\n45\n million and $\n48\n million, respectively. \nThe Company believes that, based on presently available information, the total reserves for asbestos-related claims will be sufficient to encompass all of the Company’s current and estimable potential future asbestos liabilities. These reserves, which are included within Other liabilities on the accompanying consolidated balance sheets, involve significant management judgment and represent the Company’s current best estimate of its liability for these claims.\nThe amount reserved for asbestos-related claims by its nature is subject to many uncertainties that may change over time, including (i) the ultimate number of claims filed; (ii) whether closed, dismissed or dormant claims are reinstituted, reinstated or revived; (iii) the amounts required to resolve both currently known and future unknown claims; (iv) the amount of insurance, if any, available to cover such claims; (v) the unpredictable aspects of the tort system, including a changing trial docket and the jurisdictions in which trials are scheduled; (vi) the outcome of any trials, including potential judgments or jury verdicts; (vii) the lack of specific information in many cases concerning exposure for which the Company is allegedly responsible, and the claimants’ alleged diseases resulting from such exposure; and (viii) potential changes in applicable federal and/or state tort liability law. All of these factors may have a material effect upon future asbestos-related liability estimates. While the ultimate outcome of the Company’s asbestos litigation cannot be predicted with certainty, the Company believes that any financial exposure resulting from its asbestos-related claims will not have a material adverse effect on the Company’s consolidated financial position, liquidity or results of operations.\nEnvironmental Matters\nIn management’s opinion, the Company operates in an environmentally sound manner and the outcome of the Company’s environmental contingencies will not have a material effect on PPG’s financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized. Management anticipates that the resolution of the Company’s environmental contingencies will occur over an extended period of time.\nAs remediation at certain environmental sites progresses, PPG continues to refine its assumptions underlying the estimates of the expected future costs of its remediation programs. PPG’s ongoing evaluation may result in additional charges against income to adjust the reserves for these sites. In 2024, 2023 and 2022, certain charges have been recorded based on updated estimates to increase existing reserves for these sites. Certain other charges related to environmental remediation actions are recorded to expense as incurred.\nAs of December 31, 2024 and 2023, PPG had reserves for environmental contingencies associated with PPG’s former chromium manufacturing plant in Jersey City, New Jersey (“New Jersey Chrome”), glass and chemical manufacturing sites, and for other environmental contingencies, including current manufacturing locations and National Priority List sites. These reserves are reported as Accounts payable and accrued liabilities and Other liabilities in the accompanying consolidated balance sheet.\nEnvironmental Reserves\n($ in millions)\n2024\n2023\nNew Jersey Chrome\n$\n58\n \n$\n53\n \nGlass and chemical\n51\n \n54\n \nOther\n113\n \n120\n \nTotal environmental reserves\n$\n222\n \n$\n227\n \nCurrent Portion\n$\n39\n \n$\n52\n \nPretax charges against income for environmental remediation costs are included in Other charges/(income), net in the accompanying consolidated statement of income. \nThe pretax charges and cash outlays related to such environmental remediation in 2024, 2023 and 2022, were as follows:\n2024 PPG ANNUAL REPORT AND FORM 10-K      67\n($ in millions)\n2024\n2023\n2022\nNew Jersey Chrome\n$\n16\n \n$\n7\n \n$\n—\n \nGlass and chemical\n5\n \n5\n \n3\n \nOther\n9\n \n23\n \n10\n \nTotal pretax environmental charges\n$\n30\n \n$\n35\n \n$\n13\n \nCash outlays for environmental spending\n$\n28\n \n$\n31\n \n$\n73\n \nThe Company continues to analyze, assess and remediate the environmental issues associated with New Jersey Chrome as further discussed below. Excluding the charges related to New Jersey Chrome, pretax charges against income for environmental remediation have ranged between approximately $\n5\n million and $\n40\n million per year for the past \n10\n years.\nManagement expects cash outlays for environmental remediation costs to range from $\n20\n million to $\n60\n million annually from 2025 through 2029. \nActual future cash outlays may vary from expected future cash outlays and actual future costs may vary from accrued estimates due to the inherent uncertainties involved in estimating future environmental remediation costs, including possible technological, regulatory and enforcement developments, the results of environmental studies and other factors. Specifically, the level of expected future remediation costs and cash outlays is highly dependent upon activity related to New Jersey Chrome as discussed below.\nRemediation: New Jersey Chrome\nIn June 2009, PPG entered into a settlement agreement with the New Jersey Department of Environmental Protection (“NJDEP”) and Jersey City, New Jersey (which had asserted claims against PPG for lost tax revenue) which was in the form of a Partial Consent Judgement (the \"Consent\"). Under the Consent, PPG accepted sole responsibility for the remediation activities at its former chromium manufacturing location in Jersey City and a number of additional surrounding sites. Remediation of the New Jersey Chrome sites requires PPG to remediate soil and groundwater contaminated by hexavalent chromium, as well as perform certain other environmental remediation activities. The most significant assumptions underlying the estimate of remediation costs for all New Jersey Chrome sites relate to the extent and concentration of chromium in the soil.\nPPG regularly evaluates the assessments of costs incurred to date versus current progress and the potential cost impacts of the most recent information, including the extent of impacted soils and groundwater, engineering, administrative and other associated costs. Based on these assessments, the reserve is adjusted accordingly. As of December 31, 2024 and 2023, PPG’s reserve for remediation of all New Jersey Chrome sites was $\n58\n million and $\n53\n million, respectively. The major cost components of this liability are related to excavation of impacted soil, as well as groundwater remediation. These components each account for approximately \n60\n% and \n25\n% of the amount accrued at December 31, 2024, respectively.\nThere are multiple, future events yet to occur, including further remedy selection and design, remedy implementation and execution and applicable governmental agency or community organization approvals. Considerable uncertainty exists regarding the timing of these future events for the New Jersey Chrome sites. Further resolution of these events is expected to occur over the next several years. As these events occur and to the extent that the cost estimates of the environmental remediation remedies change, the existing reserve for this environmental remediation matter will continue to be adjusted.\nRemediation: Glass, Chemicals and Other Sites\nAmong other sites at which PPG is managing environmental liabilities, remedial actions are occurring at a chemical manufacturing site in Barberton, Ohio where PPG has completed a Facility Investigation and Corrective Measure Study under the United States Environmental Protection Agency's Resource Conservation and Recovery Act Corrective Action Program. PPG has also been addressing the impacts from a legacy plate glass manufacturing site in Kokomo, Indiana under the Voluntary Remediation Program of the Indiana Department of Environmental Management and a site associated with a legacy plate glass manufacturing site near Ford City, Pennsylvania under the Pennsylvania Land Recycling Program under the oversight of the Pennsylvania Department of Environmental Protection. PPG is currently performing additional investigation and remedial activities at these locations. \nWith respect to certain other waste sites, the financial condition of other potentially responsible parties also contributes to the uncertainty of estimating PPG’s final costs. Although contributors of waste to sites involving other potentially responsible parties may face governmental agency assertions of joint and several liability, in general, final allocations of costs are made based on the relative contributions of wastes to such sites. PPG is generally not a major contributor to such sites.\n2024 PPG ANNUAL REPORT AND FORM 10-K      68\nRemediation: Reasonably Possible Matters\nIn addition to the amounts currently reserved for environmental remediation, the Company may be subject to loss contingencies related to environmental matters estimated to be as much as $\n100\n million to $\n200\n million. Such unreserved losses are reasonably possible but are not currently considered to be probable of occurrence. These reasonably possible unreserved losses relate to environmental matters at a number of sites, none of which are individually significant. The loss contingencies related to these sites include significant unresolved issues such as the nature and extent of contamination at these sites and the methods that may have to be employed to remediate them.\nThe impact of evolving programs, such as natural resource damage claims, industrial site re-use initiatives and domestic and international remediation programs, also adds to the present uncertainties with regard to the ultimate resolution of this unreserved exposure to future loss. The Company’s assessment of the potential impact of these environmental contingencies is subject to considerable uncertainty due to the complex, ongoing and evolving process of investigation and remediation, if necessary, of such environmental contingencies, and the potential for technological and regulatory developments.\n16. \nShareholders' Equity \nA class of \n10\n million shares of preferred stock, without par value, is authorized but unissued. Common stock has a par value of $1.66 \n2\n/\n3\n per share; \n1.2\n billion shares are authorized.\nCommon Stock\nTreasury Stock\nShares Outstanding\nJanuary 1, 2022\n581,146,136\n \n(\n345,239,110\n)\n235,907,026\n \nPurchases\n— \n(\n1,269,830\n)\n(\n1,269,830\n)\nIssuances\n— \n436,730\n \n436,730\n \nDecember 31, 2022\n581,146,136\n \n(\n346,072,210\n)\n235,073,926\n \nPurchases\n— \n(\n673,638\n)\n(\n673,638\n)\nIssuances\n— \n810,566\n \n810,566\n \nDecember 31, 2023\n581,146,136\n \n(\n345,935,282\n)\n235,210,854\n \nPurchases\n— \n(\n5,838,606\n)\n(\n5,838,606\n)\nIssuances \n— \n555,635\n \n555,635\n \nDecember 31, 2024\n581,146,136\n \n(\n351,218,253\n)\n229,927,883\n \nPer share cash dividends paid were $\n2.66\n, $\n2.54\n and $\n2.42\n in 2024, 2023 and 2022, respectively.\n17. \nAccumulated Other Comprehensive Loss (AOCL) \n($ in millions)\nForeign Currency Translation Adjustments\n(1)\nPension and Other Postretirement Benefit Adjustments, net of tax\n(2)\nUnrealized Gain on Derivatives, net of tax\nAccumulated Other Comprehensive Loss\nJanuary 1, 2022\n($\n1,988\n)\n($\n763\n)\n$\n1\n \n($\n2,750\n)\nCurrent year deferrals to AOCL\n(\n301\n)\n175\n \n—\n \n(\n126\n)\nReclassifications from AOCL to net income\n35\n \n31\n \n—\n \n66\n \nDecember 31, 2022\n($\n2,254\n)\n($\n557\n)\n$\n1\n \n($\n2,810\n)\nCurrent year deferrals to AOCL\n475\n \n(\n93\n)\n—\n \n382\n \nReclassifications from AOCL to net income\n33\n \n156\n \n—\n \n189\n \nDecember 31, 2023\n($\n1,746\n)\n($\n494\n)\n$\n1\n \n($\n2,239\n)\nCurrent year deferrals to AOCL\n(\n1,122\n)\n15\n \n—\n \n(\n1,107\n)\nReclassifications from AOCL to net income\n217\n \n21\n \n—\n \n238\n \nDecember 31, 2024\n($\n2,651\n)\n($\n458\n)\n$\n1\n \n($\n3,108\n)\n(1)\nThe tax cost related to unrealized foreign currency translation adjustments on net investment hedges as of December 31, 2024, 2023 and 2022 was $\n105\n million, $\n47\n million and $\n73\n million, respectively. \n(2)\nThe tax (benefit)/cost related to the adjustment for pension and other postretirement benefits as of December 31, 2024, 2023 and 2022 was $(\n12\n) million, $\n20\n million and $\n83\n million, respectively. Reclassifications from AOCL are included in the computation of net periodic benefit costs (see Note 14, “Employee Benefit Plans\").\n2024 PPG ANNUAL REPORT AND FORM 10-K      69\n18. \nOther (Income)/Charges, Net \n($ in millions)\n2024\n2023\n2022\nEnvironmental charges\n(1)\n$\n30\n \n$\n35\n \n$\n13\n \nPension and other postretirement benefit plans, non-service cost components\n43\n \n39\n \n(\n10\n)\nShare of net earnings of equity affiliates (See Note 5)\n(\n20\n)\n(\n21\n)\n(\n25\n)\n(Gain)/loss on sale of businesses \n(2)\n(\n129\n)\n23\n \n(\n4\n)\nArgentina currency translation charge \n(3)\n110\n \n—\n \n—\n \nInsurance recoveries \n(4)\n(\n4\n)\n(\n16\n)\n—\n \nRoyalty income\n(\n10\n)\n(\n10\n)\n(\n8\n)\nOther, net\n(\n28\n)\n30\n \n(\n32\n)\nTotal Other (income)/charges, net\n($\n8\n)\n$\n80\n \n($\n66\n)\n(1)\nIn both 2024 and 2023, PPG recognized charges of $\n24\n million related to environmental remediation costs at certain non-operating PPG manufacturing sites. \n(2)\nIn the fourth quarter 2024, PPG recognized a $\n129\n million gain on the divestiture of the silicas products business. In 2023, PPG recognized a $\n22\n million loss on the divestitures of the European and Australian traffic solutions businesses.\n(3)\nIn the fourth quarter 2024, PPG recognized accumulated foreign currency translation losses of $\n110\n million related to the Company's exit of its Argentina operations in connection with a restructuring program.\n(4)\nIn the fourth quarter 2024 and the fourth quarter 2023, the Company received reimbursement for previously approved insurance claims under policies covering legacy asbestos-related matters. In the first quarter 2023, the Company received reimbursement under its insurance policies for damages incurred at a southern U.S. factory from a winter storm in 2020.\n19. \nStock-Based Compensation \nThe Company’s stock-based compensation includes stock options, restricted stock units (“RSUs”) and grants of contingent shares that are earned based on achieving targeted levels of total shareholder return. All current grants of stock options, RSUs and contingent shares are made under the PPG Industries, Inc. Amended and Restated Omnibus Incentive Plan (“PPG Amended Omnibus Plan”), which was amended and restated effective April 21, 2016.\n($ in millions)\n2024\n2023\n2022\nTotal stock-based compensation\n$\n42\n \n$\n56\n \n$\n34\n \nIncome tax benefit recognized\n$\n9\n \n$\n11\n \n$\n8\n \nStock Options \nPPG has outstanding stock option awards that have been granted under the PPG Amended Omnibus Plan. Under the PPG Amended Omnibus Plan, certain employees of the Company have been granted options to purchase shares of common stock at prices equal to the fair market value of the shares on the date the options were granted. The options are generally exercisable \n36\n months after being granted and have a maximum term of \n10\n years. Upon exercise of a stock option, shares of Company stock are issued from treasury stock.\nThe fair value of stock options issued to employees is measured on the date of grant and is recognized as expense, net of estimated forfeitures, over the requisite service period. PPG estimates the fair value of stock options using the Black-Scholes option pricing model. The risk-free interest rate is determined by using the U.S. Treasury yield curve at the date of the grant and using a maturity equal to the expected life of the option. The expected life of options is calculated using the average of the vesting term and the maximum term, as prescribed by accounting guidance on the use of the simplified method for determining the expected term of an employee share option. The expected dividend yield and volatility are based on historical stock prices and dividend amounts over past time periods equal in length to the expected life of the options. PPG applies an estimated forfeiture rate that is calculated based on historical activity. \nThe following weighted average assumptions were used to calculate the fair values of stock option grants in each year:\n2024\n2023\n2022\nWeighted average exercise price\n$\n142.65\n \n$\n130.17\n \n$\n151.87\n \nRisk-free interest rate\n4.3\n \n%\n3.9\n \n%\n2.0\n \n%\nExpected life of option in years\n6.5\n6.5\n6.5\nExpected dividend yield\n1.7\n \n%\n1.7\n \n%\n1.6\n \n%\nExpected volatility\n28.4\n \n%\n27.8\n \n%\n25.7\n \n%\nThe weighted average fair value of options granted was $\n43.83\n per share, $\n38.55\n per share and $\n36.52\n per share for the years ended December 31, 2024, 2023, and 2022, respectively.\n2024 PPG ANNUAL REPORT AND FORM 10-K      70\nStock Options Outstanding and Exercisable\nNumber of Shares\nWeighted Average Exercise Price\nWeighted Average Remaining Contractual Life (in years)\nIntrinsic Value (in millions)\nOutstanding, January 1, 2024\n3,318,763\n \n$\n122.00\n \n5.7\nGranted\n426,389\n \n$\n142.65\n \n \n \nExercised\n(\n202,146\n)\n$\n106.53\n \n \n \nForfeited/Expired\n(\n53,950\n)\n$\n139.19\n \n \n \nOutstanding, December 31, 2024\n3,489,056\n \n$\n125.15\n \n5.3\n$\n15\n \nVested or expected to vest, December 31, 2024\n3,440,538\n \n$\n124.95\n \n5.3\n$\n15\n \nExercisable, December 31, 2024\n2,295,923\n \n$\n116.50\n \n3.9\n$\n15\n \nAt December 31, 2024, unrecognized compensation cost related to outstanding stock options that have not yet vested totaled $\n10\n million. This cost is expected to be recognized as expense over a weighted average period of \n0.4\n years.\nThe following table presents stock option activity for the years ended December 31, 2024, 2023 and 2022:\n($ in millions)\n2024\n2023\n2022\nTotal intrinsic value of stock options exercised\n$\n6\n \n$\n24\n \n$\n12\n \nCash received from stock option exercises\n$\n24\n \n$\n55\n \n$\n12\n \nIncome tax benefit from the exercise of stock options\n$\n1\n \n$\n6\n \n$\n3\n \nTotal fair value of stock options vested\n$\n15\n \n$\n10\n \n$\n16\n \nRestricted Stock Units (“RSUs”)\nLong-term incentive value is delivered to selected key management employees by granting RSUs, which have either time or performance-based vesting features. The fair value of an RSU is equal to the market value of a share of PPG common stock on the date of grant. Time-based RSUs generally vest over the \nthree-year\n period following the date of grant, unless forfeited, and will be paid out in the form of stock, cash or a combination of both at the Company’s discretion at the end of the vesting period. Performance-based RSUs vest based on achieving specific annual performance targets for earnings per share growth and cash flow return on capital over the \nthree\n calendar year-end periods following the date of grant. Unless forfeited, the performance-based RSUs will be paid out in the form of stock at the end of the \nthree-year\n performance period if PPG meets the performance targets. \nThe amount paid upon vesting of performance-based RSUs may range from \n0\n% to \n200\n% of the original grant, based upon the level of earnings per share growth achieved and frequency with which the annual cash flow return on capital performance target is met over the \nthree\n calendar year periods comprising the vesting period. Performance against the earnings per share growth and the cash flow return on capital goal is calculated annually, and the annual payout for each goal will be weighted equally over the \nthree-year\n period. \nRSU Activity\nNumber of Shares\nWeighted Average Grant Date Fair Value\nOutstanding, January 1, 2024\n605,941\n \n$\n137.96\n \nGranted\n245,499\n \n$\n140.81\n \nVested\n(\n179,621\n)\n$\n138.63\n \nForfeited\n(\n27,563\n)\n$\n139.62\n \nOutstanding, December 31, 2024\n644,256\n \n$\n139.14\n \nVested or expected to vest, December 31, 2024\n638,566\n \n$\n139.15\n \nThere was $\n21\n million of total unrecognized compensation cost related to unvested RSUs outstanding as of December 31, 2024. This cost is expected to be recognized as expense over a weighted average period of \n1.5\n years.\nContingent Share Grants \nThe Company also provides grants of contingent shares to selected key executives that may be earned based on PPG’s total shareholder return (“TSR”) over the \nthree-year\n period following the date of grant. Contingent share grants (referred to as “TSR awards”) are made annually and are paid out at the end of each \nthree-year\n period based on the Company’s performance. Performance is measured by determining the percentile rank of the total shareholder return of PPG common stock in relation to the total shareholder return of the S&P 500 for the \nthree-year\n period following the date of grant. This comparison group represents the entire S&P 500 Index as it existed at the beginning of the performance period, excluding any companies that have been removed from the index because they ceased to be publicly traded. The payout is based on performance achieved during the \nthree-year\n period calculated in accordance with the scale set forth in the plan agreement and may range from \n0\n% to \n200\n% of the initial grant. A payout of \n100\n% is earned if the target performance is achieved. Contingent share awards earn dividend equivalents for the award period, which will be paid to participants or credited to the participants’ deferred compensation plan accounts with the award payout at the end of the period based on the actual number of contingent shares earned. Any payments made at the end of the award period may be in the form of \n2024 PPG ANNUAL REPORT AND FORM 10-K      71\nstock, cash or a combination of both. The TSR awards are classified as liability awards, and compensation expense is recognized over the \nthree-year\n award period based on the fair value of the awards (giving consideration to the Company’s percentile rank of total shareholder return) remeasured in each reporting period until settlement of the awards. \nThe performance period for the TSR shares granted in 2022 ended on December 31, 2024, and PPG’s total shareholder return was measured against that of the S&P 500 over the \nthree‑year\n period. PPG’s ranking on this performance measure was at the 19th percentile, resulting in payouts at \n0.0\n% of target. Total unrecognized compensation cost related to the outstanding TSR awards is $\n0\n.\n20. \nRevenue Recognition \nThe Company recognizes revenue when control of the promised goods or services is transferred to the customer and in amounts that the Company expects to collect. The timing of revenue recognition takes into consideration the various shipping terms applicable to the Company’s sales. For most transactions, control passes in accordance with agreed upon delivery terms.\nThe Company delivers products to company-owned stores, home centers and other regional or national consumer retail outlets, paint dealers, concessionaires and independent distributors, company-owned distribution networks, and directly to manufacturing companies and retail customers. Each product delivered to a third party customer is considered to satisfy a performance obligation. Performance obligations generally occur at a point in time and are satisfied when control of the goods passes to the customer. The Company is entitled to collection of the sales price under normal credit terms in the regions in which it operates. Accounts receivable are recognized when there is an unconditional right to consideration. Payment terms vary from customer to customer, depending on creditworthiness, prior payment history and other considerations.\nThe Company also provides services by applying coatings to customers' manufactured parts and assembled products and by providing technical support to certain customers. Performance obligations are satisfied over time as critical milestones are met and as services are provided. PPG is entitled to payment as the services are rendered. For the years ended December 31, 2024, 2023 and 2022, service revenue constituted less than \n5\n% of total revenue.\n2024 PPG ANNUAL REPORT AND FORM 10-K      72\nNet sales by segment and region for the years ended December 31, 2024, 2023 and 2022 were as follows:\n($ in millions)\n2024\n2023\n2022\nGlobal Architectural Coatings\nUnited States and Canada\n$\n—\n \n$\n—\n \n$\n—\n \nEMEA\n2,357\n \n2,408\n \n2,436\n \nAsia Pacific\n232\n \n237\n \n244\n \nLatin America\n1,332\n \n1,376\n \n1,172\n \nTotal\n$\n3,921\n \n$\n4,021\n \n$\n3,852\n \nPerformance Coatings\nUnited States and Canada\n$\n2,981\n \n$\n2,902\n \n$\n2,668\n \nEMEA\n1,262\n \n1,220\n \n1,114\n \nAsia Pacific\n883\n \n866\n \n875\n \nLatin America\n111\n \n144\n \n135\n \nTotal\n$\n5,237\n \n$\n5,132\n \n$\n4,792\n \nIndustrial Coatings\nUnited States and Canada\n$\n2,371\n \n$\n2,583\n \n$\n2,678\n \nEMEA\n1,767\n \n1,989\n \n1,908\n \nAsia Pacific\n1,797\n \n1,770\n \n1,705\n \nLatin America\n752\n \n747\n \n679\n \nTotal\n$\n6,687\n \n$\n7,089\n \n$\n6,970\n \nTotal Net Sales\n(1)\nUnited States and Canada\n(2)\n$\n5,352\n \n$\n5,485\n \n$\n5,346\n \nEMEA\n5,386\n \n5,617\n \n5,458\n \nAsia Pacific\n2,912\n \n2,873\n \n2,824\n \nLatin America\n2,195\n \n2,267\n \n1,986\n \nTotal PPG\n$\n15,845\n \n$\n16,242\n \n$\n15,614\n \n(1)\nNet sales to external customers are attributed to geographic regions based upon the location of the operating unit shipping the product.\n(2)\nNet sales recognized in the United States represented \n32\n% of the Company’s total Net sales for each of the years ended December 31, 2024, 2023 and 2022, respectively.\nAllowance for Doubtful Accounts\nAll trade receivables are reported on the consolidated balance sheet at the outstanding principal amount adjusted for any allowance for doubtful accounts and any charge-offs. PPG provides an allowance for doubtful accounts to reduce trade receivables to their estimated net realizable value equal to the amount that is expected to be collected. This allowance is estimated based on historical collection experience, current regional economic and market conditions, the aging of accounts receivable, assessments of current creditworthiness of customers and forward-looking information. The use of forward-looking information is based on certain macroeconomic and microeconomic indicators including, but not limited to, regional business environment risk, political risk, and commercial and financing risks. \nPPG reviews its allowance for doubtful accounts on a quarterly basis to ensure the estimate reflects regional risk trends as well as current and future global operating conditions.\nThe following table summarizes allowance for doubtful accounts activity for the years ended December 31, 2024 and 2023:\nTrade Receivables Allowance for Doubtful Accounts\n($ in millions)\n2024\n2023\nJanuary 1\n$\n23\n \n$\n29\n \nBad debt expense\n17\n \n15\n \nWrite-offs and recoveries of previously reserved trade receivables\n(\n15\n)\n(\n19\n)\nOther\n(\n2\n)\n(\n2\n)\nDecember 31\n$\n23\n \n$\n23\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      73\n21. \nReportable Business Segment Information \nPPG is a multinational manufacturer with 10 operating segments (which the Company refers to as “strategic business units”) that are organized based on the Company’s major products lines. The operating segments are aggregated into reportable business segments based on their similar economic characteristics, including similar nature of products, production processes, end-use markets and methods of distribution.\nEffective December 31, 2024, the Company revised the aggregation of its ten operating segments to present three reportable business segments: Global Architectural Coatings, Performance Coatings and Industrial Coatings. This expanded segmentation will provide investors with enhanced visibility as the Company drives growth and performance. Prior year amounts have been recast to conform to current year presentation. Additionally, as a result of the divestiture of the architectural coatings business in the United States and Canada during the fourth quarter 2024, the architectural coatings Americas and Asia Pacific operating segment was renamed to the architectural coatings Latin America and Asia Pacific operating segment.\nThe Global Architectural Coatings reportable business segment is comprised of the architectural coatings EMEA and architectural coatings Latin America and Asia Pacific operating segments. This reportable business segment primarily supplies paints, wood stains, adhesives, sealants and purchased sundries.\nThe Performance Coatings reportable business segment is comprised of the automotive refinish coatings, aerospace coatings, protective and marine coatings and traffic solutions operating segments. This reportable business segment primarily supplies a variety of coatings, solvents, adhesives, sealants, foams and finishes, along with pavement marking products, transparencies and paint films.\nThe Industrial Coatings reportable business segment is comprised of the automotive OEM coatings, industrial coatings, packaging coatings, and the specialty products operating segments. This reportable business segment primarily supplies a variety of protective and decorative coatings and finishes along with adhesives, sealants, metal pretreatment products, optical monomers and coatings, low-friction coatings, paint films and other specialty products. \nProduction facilities and sales for PPG’s reportable business segments are global and each segment continues to pursue opportunities to further develop their global reach. Each of the reportable business segments in which PPG is engaged is highly competitive. The diversification of product lines and the worldwide sales tend to minimize the impact on PPG’s business of changes in demand in a particular industry or in a particular geographic area.\nPPG’s chief operating decision maker is its Executive Committee, which is comprised of the Chief Executive Officer, the Chief Financial Officer and General Counsel. The Executive Committee regularly reviews the discrete financial information of the Global Architectural Coatings, Performance Coatings and Industrial Coatings reportable business segments to assess performance and make decisions about the allocation of resources. The primary measure of profit or loss considered by the Executive Committee when evaluating reportable business segment performance is segment income, which is income before interest expense, interest income, income taxes and noncontrolling interests and excludes certain charges which are considered to be unusual or non-recurring. The Company also evaluates performance of operating segments based on working capital management and selling price and sales volume performance.\nThe accounting policies of the operating segments are the same as those described in the summary of significant accounting policies (see Note 1, “Summary of Significant Accounting Policies”). Corporate unallocated costs include the costs of corporate staff functions not directly associated with the operating segments, certain legal matters, net of related insurance recoveries, the cost of certain insurance and stock-based compensation programs and certain other unusual or non-recurring items. The service cost component of net periodic benefit cost related to current employees of each reportable business segment is allocated to that reportable business segment and the remaining portion of net periodic pension expense is included in Corporate unallocated costs.\nProduct movement between PPG’s reportable business segments is limited, is accounted for as an inventory transfer, and is recorded at cost plus a mark-up, the impact of which is not significant to the net sales or segment income of the reportable business segments.\n2024 PPG ANNUAL REPORT AND FORM 10-K      74\n($ in millions)\n2024\n2023\n2022\nGlobal Architectural Coatings\nNet sales to external customers\n$\n3,921\n \n$\n4,021\n \n$\n3,852\n \nCost of sales, exclusive of depreciation and amortization\n1,904\n \n2,022\n \n2,096\n \nSelling, general and administrative\n1,186\n \n1,170\n \n1,058\n \nDepreciation and amortization\n104\n \n101\n \n102\n \nOther\n(1)\n49\n \n55\n \n38\n \nGlobal Architectural Coatings segment income\n$\n678\n \n$\n673\n$\n558\nPerformance Coatings\nNet sales to external customers\n$\n5,237\n \n$\n5,132\n \n$\n4,792\n \nCost of sales, exclusive of depreciation and amortization\n2,851\n \n2,893\n \n2,813\n \nSelling, general and administrative\n1,017\n \n966\n \n879\n \nDepreciation and amortization\n132\n \n139\n \n142\n \nOther\n(1)\n95\n \n115\n \n111\n \nPerformance Coatings segment income\n$\n1,142\n \n$\n1,019\n$\n847\nIndustrial Coatings\nNet sales to external customers\n$\n6,687\n \n$\n7,089\n \n$\n6,970\n \nCost of sales, exclusive of depreciation and amortization\n4,498\n \n4,759\n \n5,062\n \nSelling, general and administrative\n838\n \n870\n \n786\n \nDepreciation and amortization\n206\n \n213\n \n207\n \nOther\n(1)\n252\n \n279\n \n269\n \nIndustrial Coatings segment income\n$\n893\n \n$\n968\n$\n646\nTotal Net Sales\n$\n15,845\n \n$\n16,242\n \n$\n15,614\n \nTotal Segment income\n$\n2,713\n \n$\n2,660\n \n$\n2,051\n \nCorporate / Non-Segment Items\nCorporate / non-segment unallocated, exclusive of depreciation and amortization\n(\n291\n)\n(\n330\n)\n(\n219\n)\nCorporate / non-segment depreciation and amortization\n(\n50\n)\n(\n61\n)\n(\n51\n)\nInterest expense, net of interest income\n(\n64\n)\n(\n107\n)\n(\n113\n)\nBusiness restructuring-related costs, net\n(2)\n(\n377\n)\n(\n41\n)\n(\n72\n)\nPortfolio optimization\n(3)\n(\n59\n)\n(\n53\n)\n(\n10\n)\nLegacy environmental remediation charges, net\n(4)\n(\n24\n)\n(\n24\n)\n—\n \nInsurance recoveries\n(5)\n4\n \n16\n \n—\n \nImpairment and other related charges, net\n(6)\n—\n \n(\n160\n)\n(\n231\n)\nArgentina currency devaluation losses\n(7)\n—\n \n(\n20\n)\n—\n \nPension settlement charge\n(8)\n—\n \n(\n190\n)\n—\n \nTotal Income from continuing operations before income taxes\n$\n1,852\n \n$\n1,690\n \n$\n1,355\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      75\n($ in millions)\n2024\n2023\n2022\nSegment assets\n(9)\nGlobal Architectural Coatings\n$\n5,887\n \n$\n6,595\n \n$\n6,149\n \nPerformance Coatings\n5,601\n \n5,586\n \n5,612\n \nIndustrial Coatings\n5,230\n \n5,643\n \n5,802\n \nCorporate / Non-Segment Items\n2,715\n \n3,823\n \n3,181\n \nTotal\n$\n19,433\n \n$\n21,647\n \n$\n20,744\n \nExpenditures for property (including business acquisitions)\nGlobal Architectural Coatings\n$\n160\n \n$\n93\n \n$\n86\n \nPerformance Coatings\n166\n \n217\n \n136\n \nIndustrial Coatings\n247\n \n184\n \n313\n \nCorporate / Non-Segment Items\n179\n \n131\n \n65\n \nTotal\n$\n752\n \n$\n625\n \n$\n600\n \nInvestment in equity affiliates\nGlobal Architectural Coatings\n$\n20\n \n$\n25\n \n$\n22\n \nPerformance Coatings\n26\n \n23\n \n20\n \nIndustrial Coatings\n20\n \n18\n \n15\n \nCorporate / Non-Segment Items\n75\n \n75\n \n77\n \nTotal \n$\n141\n \n$\n141\n \n$\n134\n \nShare of net earnings of equity affiliates\nGlobal Architectural Coatings\n$\n3\n \n$\n1\n \n$\n3\n \nPerformance Coatings\n5\n \n6\n \n4\n \nIndustrial Coatings\n2\n \n1\n \n—\n \nCorporate / Non-Segment Items\n10\n \n13\n \n18\n \nTotal\n$\n20\n \n$\n21\n \n$\n25\n \n($ in millions)\n2024\n2023\n2022\nGeographic Information\nSegment income\n \n \n \nUnited States and Canada\n$\n1,039\n \n$\n1,033\n \n$\n828\n \nEMEA\n617\n \n679\n \n505\n \nAsia Pacific\n476\n \n430\n \n332\n \nLatin America\n581\n \n518\n \n386\n \nTotal\n$\n2,713\n \n$\n2,660\n \n$\n2,051\n \nProperty, plant and equipment — net\n \n \n \nUnited States and Canada\n$\n1,502\n \n$\n1,365\n \n$\n1,200\n \nEMEA\n945\n \n1,010\n \n943\n \nAsia Pacific\n693\n \n718\n \n685\n \nLatin America\n324\n \n357\n \n306\n \nTotal\n$\n3,464\n \n$\n3,450\n \n$\n3,134\n \n(1)\nOther segment items for each reportable business segment includes research and development, net and other segment (income)/expense, net.\n(2)\nBusiness restructuring-related costs, net include business restructuring charges, offset by releases related to previously approved programs, which are included in Business restructuring, net on the consolidated statement of income, accelerated depreciation of certain assets, which is included in Depreciation on the consolidated statement of income, and other restructuring-related costs, which are included in Cost of sales, exclusive of depreciation and amortization and Selling, general and administrative on the consolidated statement of income. Business restructuring-related costs, net also includes the fourth quarter 2024 recognition of accumulated foreign currency translation losses of $\n110\n million related to the Company's exit of its Argentina operations in connection with a restructuring program, which are included in Other (income)/charges, net in the consolidated statement of income. No tax benefit was recorded on the fourth quarter 2024 recognition of the accumulated foreign currency translation losses.\n(3)\nPortfolio optimization includes gains and losses related to the sale of certain assets, which are included in Other (income)/charges, net on the consolidated statement of income, including the gain of $\n129\n million on the sale of the Company's silicas products business in the fourth quarter 2024, and the losses on the sales of the Company's traffic solutions business in Argentina in the second quarter 2024, the Company's European and Australian Traffic Solutions businesses in the fourth quarter 2023 and the Company's legacy industrial Russian operations in the third quarter 2023. Portfolio optimization includes advisory, legal, accounting, valuation, other professional or consulting fees and certain internal costs directly incurred to effect acquisitions, as well as similar fees and other costs to effect divestitures and other portfolio optimization exit actions. These costs are included in Selling, general and administrative expense on the consolidated statement of income. Portfolio optimization also includes an impairment charge of $\n146\n million recognized during the fourth quarter 2024 when the Company's remaining operations in Russia were classified as held for sale, which is included in Impairment and other related charges, net on the consolidated statement of income. No tax benefit was recorded on the fourth quarter 2024 impairment charge.\n(4)\nLegacy environmental remediation charges represent environmental remediation costs at certain non-operating PPG manufacturing sites. These charges are included in Other (income)/charges, net in the consolidated statement of income.\n2024 PPG ANNUAL REPORT AND FORM 10-K      76\n(5)\nIn the fourth quarter 2024 and the fourth quarter 2023, the Company received reimbursement for previously approved insurance claims under policies covering legacy asbestos-related matters. In the first quarter 2023, the Company received reimbursement under its insurance policies for damages incurred at a southern U.S. factory from a winter storm in 2020. These insurance recoveries are included in Other charges/(income), net on the consolidated statement of income.\n(6)\nIn the fourth quarter 2023, the Company recorded impairment and other related charges due to a non-cash goodwill impairment recognized for the Traffic Solutions reporting unit as a result of its annual goodwill impairment test. The fair value of the Traffic Solutions reporting unit decreased primarily due to increases in the cost of capital (discount rate assumption) and declines in the reporting unit’s long-term forecast driven by challenges at its operations in Argentina due to the highly inflationary environment and changes to the reporting unit’s global footprint, including the fourth quarter 2023 divestiture of its European and Australian businesses. In 2022, the Company recorded impairment and other related charges due to the wind down of the Company’s operations in Russia.\n(7)\nIn December 2023, the central bank of Argentina adjusted the official foreign currency exchange rate for the Argentine peso, significantly devaluing the currency relative to the United States dollar. Argentina currency devaluation losses represent foreign currency translation losses recognized during December 2023 related to the devaluation of the Argentine peso, which is included in Other charges/(income), net on the consolidated statement of income.\n(8)\nIn the first quarter 2023, PPG purchased group annuity contracts that transferred pension benefit obligations for certain of the Company’s retirees in the U.S. to third-party insurance companies, resulting in a non-cash pension settlement charge.\n(9)\nSegment assets are the total assets used in the operation of each segment. Corporate assets principally include amounts recorded in Cash and cash equivalents, Deferred income taxes, and Property, plant and equipment, net on the consolidated balance sheet.\n22. \nSupplier Finance Programs \nPPG has certain voluntary \nsupply chain finance programs\n with financial intermediaries which provide participating suppliers the option to be paid by the intermediary earlier than the original invoice due date. PPG’s responsibility is limited to making payments on the terms originally negotiated with the suppliers, regardless of whether the intermediary pays the supplier in advance of the original due date. The range of payment terms PPG negotiates with suppliers are consistent, regardless of whether a supplier participates in a supply chain finance program. These amounts are included within Accounts payable and accrued liabilities on the accompanying consolidated balance sheet.\nThe rollforward of outstanding obligations confirmed as valid under the supplier finance programs for the twelve months ended December 31, 2024 is as follows:\n($ in millions)\n2024\nJanuary 1\n$\n286\n \nInvoices confirmed \n598\n \nConfirmed invoices paid \n(\n673\n)\nCurrency impact \n40\n \nDecember 31 \n$\n251\n \n2024 PPG ANNUAL REPORT AND FORM 10-K      77\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures \n(a) \nEvaluation of disclosure controls and procedures.\nBased on their evaluation as of the end of the period covered by this Form 10-K, the Company’s principal executive officer and principal financial officer have concluded that the Company’s disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the “Exchange Act”)) are effective to ensure that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms and to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company’s management, including its principal executive and principal financial officers, as appropriate, to allow timely decisions regarding required disclosure\n.\n(b) \nChanges in internal control over financial reporting.\nThere were no changes in the Company’s internal control over financial reporting that occurred during the Company’s quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\n(c) \nManagement report on internal control over financial reporting.\nRefer to Management Report on page 38 for management’s annual report on internal control over financial reporting. Refer to Report of Independent Registered Public Accounting Firm on pages 36-37 for PricewaterhouseCoopers LLP’s audit report on the Company’s internal control over financial reporting.\nItem 9B. Other Information\nRule 10b5-1 Trading Plans\nDuring the quarter ended December 31, 2024, none of the Company's directors or officers, as defined in Section 16 of the Securities Exchange Act of 1934, \nadopted\n or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or a \"non-Rule 10b5-1 trading arrangement,\" as each term is defined in Item 408(a) of Regulation S-K of the Securities Exchange Act of 1934.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPart III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information about the Company’s directors required by Item 10 and not otherwise set forth below is contained under the caption “Proposal 1: Election of Directors” in PPG’s definitive Proxy Statement for the 2025 Annual Meeting of Shareholders (the “Proxy Statement”) which the Company anticipates filing with the Securities and Exchange Commission, pursuant to Regulation 14A, not later than 120 days after the end of the Company’s fiscal year, and is incorporated herein by reference.\nThe executive officers of the Company are elected by the Board of Directors. The information required by this item concerning the Company’s executive officers is incorporated by reference herein from Part I of this report under the caption “Information About Our Executive Officers.” \nInformation regarding the Company’s Audit Committee is included in the Proxy Statement under the caption “Corporate Governance – Audit Committee” and is incorporated herein by reference.Information regarding the Company’s codes of ethics is included in the Proxy Statement under the caption “Corporate Governance – Codes of Ethics” and is incorporated herein by reference.\nWe have adopted insider trading policies and procedures governing the purchase, sale, and other dispositions of securities of PPG by directors, officers, and employees that we believe are reasonably designed to promote compliance with insider trading laws, rules and regulations. Our insider trading policy states, among other things, that our directors, officers, and certain employees are prohibited from trading in such securities while in possession of material, nonpublic information. In addition, PPG’s Global Code of Ethics prohibits all employees from trading PPG securities while in possession of material, nonpublic information. The foregoing summary of our insider trading policy and procedures does not purport to be complete and is qualified by reference to our Insider Trading Policy filed as an exhibit to this Annual Report on Form 10-K.\n2024 PPG ANNUAL REPORT AND FORM 10-K      78\nItem 11. Executive Compensation\nThe information required by Item 11 is contained in the Proxy Statement under the captions “Compensation of Directors,” “Compensation Discussion and Analysis,” “Compensation of Executive Officers,” “Potential Payments upon Termination or Change in Control,” “Corporate Governance – Compensation Committee Interlocks and Insider Participation,” and “Corporate Governance – Human Capital Management and Compensation Committee Report to Shareholders” and is incorporated herein by reference.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by Item 12 is contained in the Proxy Statement under the captions “Beneficial Ownership” and “Equity Compensation Plan Information” and is incorporated herein by reference.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by Item 13 is contained in the Proxy Statement under the captions “Corporate Governance – Director Independence,” “Corporate Governance – Review and Approval or Ratification of Transactions with Related Persons” and “Corporate Governance – Certain Relationships and Related Transactions” and is incorporated herein by reference.\nItem 14. Principal Accounting Fees and Services\nThe information required by Item 14 is contained in the Proxy Statement under the caption “Independent Registered Public Accounting Firm” and is incorporated herein by reference.\nPart IV\nItem 15. Exhibits, Financial Statement Schedules\n(a)(1)    Consolidated Financial Statements and Reports of Independent Registered Public Accounting Firm (see Part II, Item 8 of this Form 10-K).\nThe following information is filed as part of this Form 10-K:\n \nPage\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID \n238\n)\n36\nManagement Report\n38\nConsolidated Statement of Income for the Years Ended December 31, 2024, 2023 and 2022\n39\nConsolidated Statement of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\n39\nConsolidated Balance Sheet as of December 31, 2024 and 2023\n40\nConsolidated Statement of Shareholders’ Equity for the Years Ended December 31, 2024, 2023 and 2022\n41\nConsolidated Statement of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\n42\nNotes to the Consolidated Financial Statements\n43\n2024 PPG ANNUAL REPORT AND FORM 10-K      79\n(a)(2)    Consolidated Financial Statement Schedule for the years ended December 31, 2024, 2023 and 2022.\nThe following Consolidated Financial Statement Schedule should be read in conjunction with the previously referenced financial statements:\nSchedule II – Valuation and Qualifying Accounts\nAllowance for Doubtful Accounts for the Years Ended December 31, 2024, 2023, and 2022 \n($ in millions)\nBalance at Beginning of Year\nCharged to Costs and Expenses(1)\nDeductions(1, 2)\nBalance at End of Year\n2024\n$\n23\n \n$\n17\n \n($\n17\n)\n$\n23\n \n2023\n$\n29\n \n$\n15\n \n($\n21\n)\n$\n23\n \n2022\n$\n29\n \n$\n51\n \n($\n51\n)\n$\n29\n \n(1)\nIn the first quarter 2022, PPG recorded a bad debt reserve of $\n43\n million associated with the adverse economic impacts of the Russian invasion of Ukraine. Subsequently, the Company released a portion of this previously established bad debt reserve due to the collection of certain trade receivables. \n(2)\nNotes and accounts receivable written off as uncollectible, net of recoveries, amounts attributable to divestitures and changes attributable to foreign currency translation.\nAll other schedules are omitted because they are not applicable.\n2024 PPG ANNUAL REPORT AND FORM 10-K      80\n(a)(3)    Exhibits. The following exhibits are filed as a part of, or incorporated by reference into, this Form 10-K.\nIndex to Exhibits\n3\nStatement with Respect to Shares Eliminating the Series A Junior Participating Preferred Stock, was filed as Exhibit 3.1 to the Registrant’s Quarterly Report on Form 10-Q for the period ended September 30, 2014.\n3.1\nRestated Articles of Incorporation of PPG Industries, Inc., was filed as Exhibit 3.2 to the Registrant’s Quarterly Report on Form 10-Q for the period ended September 30, 2014.\n3.2\nArticles of Amendment to the Restated Articles of Incorporation of PPG Industries, Inc., effective May 13, 2022, was filed as Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed on May 13, 2022.\n3.3\nArticles of Amendment to the Restated Articles of Incorporation of PPG Industries, Inc., effective April 19, 2024, was filed as Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed on April 23, 2024.\n3.4\nAmended and Restated Bylaws of PPG Industries, Inc., as amended on January 18, 2024, was filed as Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed on January 22, 2024.\n4\nIndenture, dated as of March 18, 2008, was filed as Exhibit 4.1 to the Registrant’s Current Report on Form 8-K filed on March 18, 2008.\n4.1\nSupplemental Indenture, dated as of March 18, 2008, was filed as Exhibit 4.2 to the Registrant’s Current Report on Form 8-K filed on March 18, 2008.\n4.2\nSecond Supplemental Indenture, dated as of November 12, 2010, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on November 12, 2010.\n4.3\nThird Supplemental Indenture, dated as of August 3, 2012, was filed as Exhibit 4.4 to the Registrant’s Current Report on Form 8-K filed on August 3, 2012.\n4.4\nFifth Supplemental Indenture, dated as of March 13, 2015, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on March 13, 2015.\n4.5\nSixth Supplemental Indenture, dated as of November 3, 2016, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on November 3, 2016.\n4.6\nSeventh Supplemental Indenture, dated as of February 27, 2018, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on February 27, 2018.\n4.7\nEighth Supplemental Indenture, dated as of August 15, 2019, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on August 15, 2019.\n4.8\nNinth Supplemental Indenture, dated as of May 19, 2020, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on May 19, 2020.\n4.9\nTenth Supplemental Indenture, dated as of March 4, 2021, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on March 4, 2021.\n4.10\nEleventh Supplemental Indenture, dated as of May 25, 2022, between PPG Industries, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, was filed as Exhibit 4.3 to the Registrant’s Current Report on Form 8-K filed on May 25, 2022.\n†\n4.11\nPPG Industries, Inc. Description of Securities.\n*\n10\nPPG Industries, Inc. Nonqualified Retirement Plan, as amended and restated September 24, 2008, was filed as Exhibit 10 to the Registrant’s Annual Report on Form 10-K for the period ended December 31, 2011.\n*\n10.1\nForm of Change in Control Employment Agreement entered into with executives on or after January 1, 2010, was filed as Exhibit 10.3 to the Registrant’s Annual Report on Form 10-K for the period ended December 31, 2009.\n*\n10.2\nForm of Change in Control Employment Agreement entered into with executives on or after June 30, 2012 was filed as Exhibit 10.4 to the Registrant’s Annual Report on Form 10-K for the period ended December 31, 2012.\n*\n10.3\nForm of Change in Control Employment Agreement entered into with executives on or after January 1, 2014, was filed as Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q for the period ended March 31, 2014.\n*\n10.4\nPPG Industries, Inc. Deferred Compensation Plan for Directors related to compensation deferred prior to January 1, 2005, was filed as Exhibit 10.3 to the Registrant’s Annual Report on Form 10-K for the period ended December 31, 1997.\n2024 PPG ANNUAL REPORT AND FORM 10-K      81\n†\n10.5\nPPG Industries, Inc. Deferred Compensation Plan for Directors related to compensation deferred on or after January 1, 2005, as amended and restated effective January 1, 202\n5\n.\n*\n10.6\nPPG Industries, Inc. Deferred Compensation Plan related to compensation deferred prior to January 1, 2005, as amended effective July 14, 2004, was filed as Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the period ended June 30, 2004.\n†*\n10.7\nPPG Industries, Inc. Deferred Compensation Plan related to compensation deferred on or after January 1, 2005, as amended and restated effective January 1, 2024.\n*\n10.8\nPPG Industries, Inc. Amended and Restated Omnibus Incentive Plan, was filed as Annex B to the Registrant’s Definitive Proxy Statement for its 2016 Annual Meeting of Shareholders filed on March 10, 2016.\n†*\n10.9\nForm of Non-Qualified Stock Option Award Agreement.\n†*\n10.10\nForm of TSR Share Award Agreement.\n†*\n10.11\nForm of Performance-Based Restricted Stock Unit Award Agreement.\n†*\n10.12\nForm of Time-Vested Restricted Stock Unit Award Agreement.\n†*\n10.13\nForm of Time-Vested Restricted Stock Unit Award Agreement for Directors.\n10.14\nTerm Loan Credit Agreement, dated as of April 12, 2023, among PPG Industries, Inc., the banks, financial institutions and other institutional lenders party thereto and Banco Bilbao Vizcaya Argentaria, S.A. New York Branch, as administrative agent was filed as Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed on April 18, 2023.\n†\n10.15\nAmendment No. 1, dated as of December 15, 2023, to Term Loan Credit Agreement, dated as of April 12, 2023, among PPG Industries, Inc., the banks, financial institutions and other institutional lenders party thereto and Banco Bilbao Vizcaya Argentaria, S.A. New York Branch, as administrative agent.\n†\n10.16\nAmendment No. 2, dated as of December 6, 2024, to Term Loan Credit Agreement, dated as of April 12, 2023, among PPG Industries, Inc., the banks, financial institutions and other institutional lenders party thereto and Banco Bilbao Vizcaya Argentaria, S.A. New York Branch, as administrative agent.\n10.17\nFive Year Credit Agreement dated as of July 27, 2023 among PPG Industries, Inc.; the several banks and financial institutions party thereto; JPMorgan Chase Bank, N.A., as administrative agent; JPMorgan Chase Bank, N.A., PNC Capital Markets LLC, BNP Paribas Securities Corp, and Citibank, N.A. as joint lead arrangers and joint bookrunners; PNC Bank, National Association, BNP Paribas, and Citibank, N.A., as co-syndication agents; and Banco Bilbao Vizcaya Argentaria, S.A. New York Branch, Banco Santander, S.A., New York Branch, Bank of America, N.A., Goldman Sachs Bank USA, HSBC Bank USA, National Association, Intesa Sanpaolo S.P.A., New York Branch, Societe Generale, Sumitomo Mitsui Banking Corporation, The Toronto-Dominion Bank, New York Branch, Unicredit Bank AG, New York Branch, U.S. Bank National Association, and Wells Fargo Bank, National Association, as co-documentation agents was filed as Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed on July 31, 2023.\n†*\n10.18\nPPG Industries, Inc. Incentive Compensation Plan for Key Employees, as amended and restated on \nDecember 11, 2024\n.\n†*\n10.19\nPPG Industries, Inc. Management Award Plan, as amended and restated on \nDecember 11, 2024\n.\n†\n10.20\nSeparation Agreement and Release, dated October 14, 2024, between PPG Industries, Inc. and Ramaprasad Vadlamannati.\n†\n10.21\nEmployment Agreement between PPG Industries Europe Sàrl and K. Henrik Bergstrom dated June 2, 2022.\n†\n13.1\nMarket Information, Dividends, Holders of Common Stock and Stock Performance Graph.\n†\n19.1\nPPG Industries, Inc. Insider Trading Policy.\n†\n21\nSubsidiaries of the Registrant.\n†\n23\nConsent of PricewaterhouseCoopers LLP.\n†\n24\nPowers of Attorney.\n†\n31.1\nCertification of Principal Executive Officer Pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n†\n31.2\nCertification of Principal Financial Officer Pursuant to Rule 13a-14(a) or 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n††\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n††\n32.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n2024 PPG ANNUAL REPORT AND FORM 10-K      82\n†\n97.1\nPPG Industries, Inc. Compensation Recovery Policy Adopted by the Board of Directors on July 20, 2023\n.\n††\n99.1\nRecast Financial Tables\n**\n101.INS\nInline XBRL Instance Document\n**\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n**\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n**\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n**\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n**\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n†\nFiled herewith.\n††\nFurnished herewith.\n*\nManagement contracts, compensatory plans or arrangements required to be filed as an exhibit hereto pursuant to Item 601 of Regulation S-K.\n**\nAttached as Exhibit 101 to this report are the following documents formatted in Inline XBRL (Extensible Business Reporting Language) as of and for the year ended December 31, 2024: (i) the Consolidated Statement of Income, (ii) the Consolidated Balance Sheet, (iii) the Consolidated Statement of Shareholders’ Equity, (iv) the Consolidated Statement of Comprehensive Income (Loss), (v) the Consolidated Statement of Cash Flows, (vi) Notes to Consolidated Financial Statements and (vii) Financial Schedule of Valuation and Qualifying Accounts. \nQuarterly Financial Statements\nSummarized quarterly financial information for the two most recent fiscal years is included as Exhibit 99.1 to this Form 10-K. This information has been recast to present the results of the architectural coatings business in the United States and Canada as discontinued operations, and to reflect the revised presentation of three reportable business segments.\nItem 16. Form 10-K Summary\nNone.\n2024 PPG ANNUAL REPORT AND FORM 10-K      83\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized on February 20, 2025.\nPPG INDUSTRIES, INC.\n(Registrant)\nBy:\n/s/ Vincent J. Morales\nVincent J. Morales\nSenior Vice President and Chief Financial Officer (Principal Financial Officer and Duly Authorized Officer)\nBy:\n/s/ Brian R. Williams\nBrian R. Williams\nVice President and Controller (Principal Accounting Officer and Duly Authorized Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities indicated on February 20, 2025.\nSignature\nCapacity\n/s/ Timothy M. Knavish\nChairman and Chief Executive Officer\nTimothy M. Knavish\n/s/ Vincent J. Morales\nSenior Vice President and Chief Financial Officer (Principal Financial Officer and Duly Authorized Officer)\nVincent J. Morales\n/s/ Brian R. Williams\nVice President and Controller (Principal Accounting Officer and Duly Authorized Officer)\nBrian R. Williams\nK. L. Fortmann\nDirector\nM. L. Healey\nDirector\nG. R. Heminger\nDirector\nM. W. Lamach\nDirector\nBy:\n/s/ Vincent J. Morales\nK. A. Ligocki\nDirector\nVincent J. Morales, Attorney-in-Fact\nM. T. Nally\nDirector\nG. Novo\nDirector\nM. H. Richenhagen\nDirector\nC. N. Roberts III\nDirector\nC. R. Smith\nDirector\n2024 PPG ANNUAL REPORT AND FORM 10-K      84"
  }
}