{
  "ticker": "REGN",
  "cik": "0000872589",
  "company_name": "REGENERON PHARMACEUTICALS, INC.",
  "filing_date": "2025-02-05",
  "accession": "0001804220-25-000011",
  "primary_doc": "regn-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nThis Annual Report on Form 10-K contains forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (where applicable, together with its subsidiaries, \"Regeneron,\" \"Company,\" \"we,\" \"us,\" and \"our\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others: \n•\nthe nature, timing, and possible success and therapeutic applications of products marketed or otherwise commercialized by Regeneron and/or its collaborators or licensees (collectively, \"Regeneron's Products\") and product candidates being developed by Regeneron and/or its collaborators or licensees (collectively, \"Regeneron's Product Candidates\") and research and clinical programs now underway or planned, including without limitation those discussed or referenced in this report, Regeneron's and its collaborators' earlier-stage programs, and the use of human genetics in Regeneron's research programs; \n•\nthe likelihood and timing of achieving any of our anticipated development milestones referenced in this report; \n•\nsafety issues resulting from the administration of Regeneron's Products and Regeneron's Product Candidates in patients, including serious complications or side effects in connection with the use of Regeneron's Products and Regeneron's Product Candidates in clinical trials; \n•\nthe likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's Product Candidates and new indications for Regeneron's Products, including without limitation those discussed or referenced in this report; \n•\nthe extent to which the results from the research and development programs conducted by us and/or our collaborators may be replicated in other studies and/or lead to advancement of product candidates to clinical trials, therapeutic applications, or regulatory approval; \n•\nongoing regulatory obligations and oversight impacting Regeneron's Products, research and clinical programs, and business, including those relating to patient privacy; \n•\ndeterminations by regulatory and administrative governmental authorities which may delay or restrict our ability to continue to develop or commercialize Regeneron's Products and Regeneron's Product Candidates; \n•\ncompeting drugs and product candidates that may be superior to, or more cost effective than, Regeneron's Products and Regeneron's Product Candidates (including biosimilar versions of Regeneron's Products);\n•\nuncertainty of the utilization, market acceptance, and commercial success of Regeneron's Products and Regeneron's Product Candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) or recommendations and guidelines from governmental authorities and other third parties on the commercial success of Regeneron's Products and Regeneron's Product Candidates; \n•\nour ability to manufacture and manage supply chains for multiple products and product candidates; \n•\nthe ability of our collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's Products and Regeneron's Product Candidates; \n•\nthe availability and extent of reimbursement of Regeneron's Products from third-party payors, including private payor healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; \n•\ncoverage and reimbursement determinations by such payors and new policies and procedures adopted by such payors;\n•\nchanges in laws, regulations, and policies affecting the healthcare industry;\n•\nthe costs of developing, producing, and selling products or unanticipated expenses;\n•\nour ability to meet any of our financial projections or guidance, including without limitation capital expenditures, and changes to the assumptions underlying those projections or guidance; \n•\nthe potential for any license or collaboration agreement, including our agreements with Sanofi and Bayer (or their respective affiliated companies, as applicable), to be cancelled or terminated; \n•\nthe impact of public health outbreaks, epidemics, or pandemics on our business; and \n•\nrisks associated with litigation and other proceedings and government investigations relating to the Company and/or its operations (including without limitation those described in Note 16 to our Consolidated Financial Statements included in this report), risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings described further in Note 16 to our Consolidated Financial Statements included in this report), the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on our business, prospects, operating results, and financial condition. \nThese statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any such statements. In evaluating such statements, shareholders and potential investors should specifically consider the various \n2\nTable of \nContents\nfactors identified under Part I,",
    "item1a": "Item 1A. \"Risk Factors\" for additional information regarding cybersecurity risks and potential related impacts on our Company.\nGovernance\nOur board of directors oversees our risk management process, including as it pertains to cybersecurity risks, directly and through its committees. The \nAudit Committee\n of the board oversees our risk management program, which focuses on the most significant risks we face in the short-, intermediate-, and long-term timeframe. Audit Committee meetings include discussions of specific risk areas throughout the year, including, among others, those relating to cybersecurity threats, and reports from the Chief Audit Executive on our enterprise risk profile on an annual basis. The Audit Committee reviews our cybersecurity risk profile with management on a periodic basis using key performance and/or risk indicators. These key performance indicators are metrics and measurements designed to assess the effectiveness of our cybersecurity program in the prevention, detection, mitigation, and remediation of cybersecurity incidents.\nWe take a risk-based approach to cybersecurity and have implemented cybersecurity policies throughout our operations that are designed to address cybersecurity threats and incidents. \nThe Company's Chief Information Security Officer (\"CISO\"), in coordination with the Chief Information Officer and the Technology Risk Management Committee, is responsible for the establishment and maintenance of our cybersecurity program, as well as the assessment and management of cybersecurity risks\n. \nThe current CISO has over 35 years of experience in technology and information security, including operating in the role of the CISO for several large companies in the pharmaceutical and healthcare industries, and possesses the requisite education, skills, experience, and industry certifications expected of an individual assigned to these duties.\n \nThe \nCISO\n provides periodic updates on our cybersecurity risk profile to management's Technology Risk Management Committee and the Audit Committee of our board of directors.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nWe regularly assess risks from cybersecurity threats; monitor our information systems for potential vulnerabilities; and test those systems pursuant to our cybersecurity policies, processes, and practices, which are integrated into our overall risk management program.\n To protect our information systems from cybersecurity threats, we use various security tools that are designed to help identify, escalate, investigate, resolve, and recover from security incidents in a timely manner. Our Technology Risk Management Committee, which is comprised of representatives from our business operations and support functions (e.g., legal, finance, internal audit, commercial, privacy), assesses cybersecurity risks based on probability and potential impact to key business systems and processes. Cybersecurity risks that are considered high are incorporated into our overall risk management program. A mitigation plan is developed for each identified high risk, with progress on risk mitigation reported to the Technology Risk Management Committee and tracked as part of our overall risk management program, which is overseen by the Audit Committee of our board of directors.\nWe collaborate with third parties to assess the effectiveness of our cybersecurity prevention and response systems and processes. These include cybersecurity assessors, consultants, and other external cybersecurity experts to assist in the identification, verification, and validation of cybersecurity risks, as well as to support associated mitigation plans when necessary.\n \nWe have also \n67\nTable of \nContents\ndeveloped a process to conduct due diligence on third parties with which we work to oversee and identify material risks from cybersecurity threats associated with our use of those third parties' services, including those that perform cybersecurity services.\nTo date, the Company is not aware of risks from cybersecurity threats, including those resulting from any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect our Company, including our business strategy, results of operations, or financial condition.\n Refer to the risk factor captioned \"\nSignificant disruptions of information technology systems or breaches of data security could adversely affect our business\n\" in Part I,"
  }
}