{
  "ticker": "RMD",
  "cik": "0000943819",
  "company_name": "RESMED INC",
  "filing_date": "2025-08-08",
  "accession": "0000943819-25-000035",
  "primary_doc": "rmd-20250630.htm",
  "item_sections": {
    "item1": "Item 1B — 4\nRESMED INC. AND SUBSIDIARIES\nWe believe that our facilities meet the needs of our current business operations. At June 30, 2025, our principal owned and leased properties were as follows:\nLocation\nOwnership Status\n(Owned / Leased)\nSquare\nFootage\nPrimary Usage\nSan Diego, California\nOwned\n230,000 \nCorporate headquarters, engineering, research and development, sales and administration\nSydney, Australia\nOwned\n437,000 \nManufacturing, engineering, research and development, sales and administration\nSuzhou, China\nOwned\n53,000 \nManufacturing, warehouse, engineering, research and development\nAtlanta, Georgia\nLeased\n467,000 \nManufacturing, warehouse and distribution\nSingapore\nLeased\n305,000 \nManufacturing, engineering, research and development, sales and administration\nJohor, Malaysia\nLeased\n284,000 \nManufacturing, engineering, research and development\nMoreno Valley, California\nLeased\n244,000 \nWarehouse and distribution\nLyon, France\nLeased\n132,000 \nSales, manufacturing and distribution\nCalabasas, California\n(1)\nLeased\n129,000 \nManufacturing, engineering, research and development\nChatsworth, California\n(1)\nLeased\n72,000 \nManufacturing, engineering, research and development\nAtlanta, Georgia\nLeased\n55,000 \nResidential care software sales and administration, engineering, research and development\nGremsdorf, Germany\nLeased\n51,000 \nWarehouse and distribution, sales and administration\nMunich, Germany\nLeased\n46,000 \nSales and distribution\n(1)\nWe expect to transition operations from our Chatsworth, California location to our Calabasas, California location during fiscal year 2026.\nITEM 3 LEGAL PROCEEDINGS \nWe are involved in various legal proceedings, claims, investigations and litigation that arise in the ordinary course of our business. See Note 15 – Legal Actions, Contingencies and Commitments of the Notes to Consolidated Financial Statements (Part II, Item 8) included in this report, which is incorporated by reference herein.\nLitigation is inherently uncertain. Accordingly, we cannot predict with certainty the outcome of these matters. But we do not expect the outcome of these matters to have a material adverse effect on our consolidated financial statements when taken as a whole.\nITEM 4 MINE SAFETY DISCLOSURES\nNot Applicable.\n-50-\nTable of Contents\nPART II\nItem 5\nRESMED INC. AND SUBSIDIARIES\nPART II\nITEM 5 MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES \nOur common stock is traded on the NYSE under the symbol “RMD”. As of July 31, 2025, there were 27 holders of record of our common stock, although the actual number of stockholders of our common stock is greater than this number of holders of record and many of these holders of record own shares as nominees on behalf of other beneficial owners.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe information included under Item 12 of Part III of this Report, “Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters,” is hereby incorporated by reference into this Item 5 of Part II of this Report.\nPurchases of Equity Securities\nThe following table summarizes our purchases of common stock during the three months ended June 30, 2025:\nPeriod\nTotal Number of Shares Purchased\nAverage Price Paid per Share (USD)\nTotal Number of Shares Purchased as Part of Publicly Announced Programs\nMaximum Number of Shares that May Yet Be Purchased Under the Program\nApril 1 - 30, 2025\n97,600 \n$\n234.98 \n43,604,613 \n11,111,400 \nMay 1 - 31, 2025\n321,134 \n239.98 \n43,925,747 \n10,790,266 \nJune 1 - 30, 2025\n— \n— \n43,925,747 \n10,790,266 \nTotal\n418,734 \n$\n238.81 \n43,925,747 \n10,790,266 \nOn February 21, 2014, our board of directors approved our current share repurchase program, authorizing us to acquire up to an aggregate of 20.0 million shares of our common stock. The program allows us to repurchase shares of our common stock from time to time for cash in the open market, or in negotiated or block transactions, as market and business conditions warrant and subject to applicable legal requirements. The share repurchase program may be accelerated, suspended, delayed or discontinued at any time at the discretion of our board of directors. All share repurchases after February 21, 2014 have been executed under this program. Since approval of the share repurchase program in 2014 through June 30, 2025, we have repurchased a total of 9.2 million shares for an aggregate of $862.7 million. As of June 30, 2025, 10.8 million additional shares can be repurchased under the approved share repurchase program. \nDividends\nWhile we have historically paid dividends to holders of our common stock on a quarterly basis, the declaration and payment of future dividends will depend on many factors, including, but not limited to, our earnings, financial condition, business development needs and regulatory considerations, and are at the discretion of our board of directors pursuant to authority delegated to our audit committee.\nPERFORMANCE GRAPH\nThis performance graph is furnished and shall not be deemed “filed” with the SEC or subject to Section 18 of the Exchange Act, nor shall it be deemed incorporated by reference in any of our filings under the Securities Act of 1933, as amended. \n-51-\nTable of Contents\nPART II\nItem 5\nRESMED INC. AND SUBSIDIARIES\nThe following graph compares the cumulative total stockholders return on our common stock from June 30, 2020 through June 30, 2025, with the comparable cumulative return of the S&P 500 index, the S&P 500 Health Care index, and the Dow Jones U.S. Select Medical Equipment index. The graph assumes that $100 was invested in our common stock and each index on June 30, 2020. In addition, the graph assumes the reinvestment of all dividends paid. The stock price performance on the following graph is not necessarily indicative of future stock price performance. \nThe following table shows total indexed return of stock price plus reinvestments of dividends, assuming an initial investment of $100 at June 30, 2020, for the indicated periods.\nIndex\n2021\n2022\n2023\n2024\n2025\nResMed Inc.\n129\n109\n114\n100\n136\nS&P 500\n139\n122\n144\n176\n200\nS&P 500 Health Care\n126\n128\n133\n146\n135\nDow Jones U.S. Select Medical Equipment\n136\n114\n128\n127\n142\nITEM 6 SELECTED FINANCIAL DATA \nThe following table summarizes certain selected consolidated financial data for, and as of the end of, each of the fiscal years in the five-year period ended June 30, 2025. The data set forth below should be read together with Item 7 of Part II of this report, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Item 8 of Part II of this report, “Consolidated Financial Statements and Supplementary Data”, and related notes included elsewhere in this report. The consolidated statement of income data for the years ended June 30, 2025, 2024 and 2023 and the consolidated balance sheet data as of June 30, 2025 and 2024 are derived from our audited consolidated financial statements included elsewhere in this report. The consolidated statement of income data for the years ended June 30, 2022 and 2021 and the consolidated balance sheet data as of June 30, 2023, 2022 and 2021 are derived from our audited consolidated financial \n-52-\nTable of Contents\nPART II\nItem 6\nRESMED INC. AND SUBSIDIARIES\nstatements not included in this report. Historical results do not necessarily indicate the results to be expected in the future, and the results for the years presented should not be considered to indicate our future results of operations.\nConsolidated Statement of Income Data \nYears Ended June 30,\n(In thousands, except per share data):\n2025\n2024\n2023\n2022\n2021\nNet revenue\n$\n5,146,327 \n$\n4,685,297 \n$\n4,222,993 \n$\n3,578,127 \n$\n3,196,825 \nCost of sales (exclusive of amortization shown separately below)\n2,059,241 \n1,997,031 \n1,836,935 \n1,514,166 \n1,312,598 \nAmortization of acquired intangible assets\n32,116 \n32,963 \n30,396 \n39,650 \n45,127 \nTotal cost of sales\n2,091,357 \n2,029,994 \n1,867,331 \n1,553,816 \n1,357,725 \nGross profit\n3,054,970 \n2,655,303 \n2,355,662 \n2,024,311 \n1,839,100 \nSelling, general and administrative expenses\n991,019 \n917,136 \n874,003 \n737,508 \n670,387 \nResearch and development expenses\n331,284 \n307,525 \n287,642 \n253,575 \n225,284 \nAmortization of acquired intangible assets\n45,273 \n46,521 \n42,020 \n31,078 \n31,078 \nRestructuring expenses\n— \n64,228 \n9,177 \n— \n8,673 \nAcquisition related expenses\n2,031 \n— \n10,949 \n1,864 \n— \nTotal operating expenses\n1,369,607 \n1,335,410 \n1,223,791 \n1,024,025 \n935,422 \nIncome from operations\n1,685,363 \n1,319,893 \n1,131,871 \n1,000,286 \n903,678 \nOther income:\nInterest expense, net\n4,114 \n(45,708)\n(47,379)\n(22,312)\n(23,627)\nLoss attributable to equity method investments\n3,644 \n(1,848)\n(7,265)\n(8,486)\n(11,205)\nGain on insurance recoveries\n— \n— \n20,227 \n— \n— \nGain (loss) on equity investments\n(10,299)\n(4,045)\n9,922 \n(12,202)\n14,515 \nOther, net\n(5,256)\n(3,494)\n(5,712)\n3,197 \n301 \nTotal other income (loss), net\n(7,797)\n(55,095)\n(30,207)\n(39,803)\n(20,016)\nIncome before income taxes\n1,677,566 \n1,264,798 \n1,101,664 \n960,483 \n883,662 \nIncome taxes\n276,843 \n243,847 \n204,108 \n181,046 \n409,157 \nNet income\n$\n1,400,723 \n$\n1,020,951 \n$\n897,556 \n$\n779,437 \n$\n474,505 \nBasic earnings per share\n$\n9.55 \n$\n6.94 \n$\n6.12 \n$\n5.34 \n$\n3.27 \nDiluted earnings per share\n$\n9.51 \n$\n6.92 \n$\n6.09 \n$\n5.30 \n$\n3.24 \nDividends per share\n$\n2.12 \n$\n1.92 \n$\n1.76 \n$\n1.68 \n$\n1.56 \nWeighted average:\nBasic shares outstanding\n146,716 \n147,021 \n146,765 \n146,066 \n145,313 \nDiluted shares outstanding \n147,340 \n147,550 \n147,455 \n147,043 \n146,451 \nAs of June 30,\nConsolidated Balance Sheet Data (In thousands):\n2025\n2024\n2023\n2022\n2021\nWorking capital\n$\n2,486,485 \n$\n1,447,064 \n$\n1,609,297 \n$\n1,242,179 \n$\n662,991 \nTotal assets\n$\n8,174,391 \n$\n6,872,394 \n$\n6,751,708 \n$\n5,095,853 \n$\n4,728,125 \nLong-term debt, net\n$\n658,392 \n$\n697,313 \n$\n1,431,234 \n$\n765,325 \n$\n643,351 \nTotal stockholders’ equity\n$\n5,967,859 \n$\n4,864,043 \n$\n4,129,903 \n$\n3,360,751 \n$\n2,885,679 \n-53-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nITEM 7 MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview \nManagement’s discussion and analysis of financial condition and results of operations, or the MD&A, is intended to help the reader understand our results of operations and financial condition. It is provided as a supplement to, and should be read in conjunction with, the selected financial data and consolidated financial statements and notes included in this report.\nWe are a global leader in the development, manufacturing, distribution and marketing of medical devices and cloud-based software applications that diagnose, treat and manage respiratory disorders, including sleep disordered breathing, or SDB, chronic obstructive pulmonary disease, neuromuscular disease and other chronic diseases. SDB includes obstructive sleep apnea and other respiratory disorders that occur during sleep. Our products and solutions are designed to improve patient quality of life, reduce the impact of chronic disease and lower healthcare costs as global healthcare systems continue to drive a shift in care from hospitals to the home and lower cost settings. Our digital cloud-based health software applications, along with our devices, are designed to provide connected care to improve patient outcomes and efficiencies for our customers.\nSince the development of continuous positive airway pressure therapy, we have expanded our business by developing or acquiring a number of products and solutions for a broader range of respiratory disorders including technologies to be applied in medical and consumer products, ventilation devices, diagnostic products, mask systems for use in the hospital and home, headgear and other accessories, dental devices, and cloud-based software informatics solutions to manage patient outcomes and customer and provider business processes. Our growth has been fueled by geographic expansion, our research and product development efforts, acquisitions and an increasing awareness of SDB and respiratory conditions like chronic obstructive pulmonary disease as significant health concerns. \nWe are committed to ongoing investment in research and development and product enhancements. During fiscal year 2025, we invested $331.3 million on research and development activities, which represents 6.4% of net revenues with a continued focus on the development and commercialization of new, innovative products and solutions that improve patient outcomes, create efficiencies for our customers and help physicians and providers better manage chronic disease and lower healthcare costs. For example, our newest device, AirSense 11, introduced new features such as a touch screen, algorithms for patients new to therapy, digital enhancements and over-the-air update capabilities. Our operations include residential care software platforms designed to support the professionals and caregivers who help people stay healthy in the home or care setting of their choice. These platforms comprise our Residential Care Software business and, along with our cloud-based remote monitoring and therapy management system, and a robust product pipeline, these products should continue to provide us with a strong platform for future growth. \nWe have determined that we have two operating segments, which are the sleep and respiratory disorders sector of the medical device industry, or Sleep and Breathing Health, and the supply of business management software as a service to residential healthcare providers, or Residential Care Software. During fiscal year 2025, we renamed our operating segments from Sleep and Respiratory Care to Sleep and Breathing Health and from Software as a Service to Residential Care Software in alignment with our 2030 strategy. There have been no changes in the preparation and disclosure of financial information by operating segment.\nNet revenue in fiscal year 2025 increased to $5,146.3 million, an increase of 10% compared to fiscal year 2024. Gross profit increased for the year ended June 30, 2025 to $3,055.0 million, from $2,655.3 million for the year ended June 30, 2024, an increase of $399.7 million or 15%. Our net income for the year ended June 30, 2025 was $1,400.7 million or $9.51 per diluted share compared to net income of $1,021.0 million or $6.92 per diluted share for the year ended June 30, 2024. \nTotal operating cash flow for fiscal year 2025 was $1,751.6 million and at June 30, 2025, our cash and cash equivalents totaled $1,209.5 million. At June 30, 2025, our total assets were $8.2 billion and our stockholders’ equity was $6.0 billion. We paid a quarterly dividend of $0.53 per share during fiscal 2025 with a total amount of $310.9 million paid to stockholders.\n-54-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIn order to provide a framework for assessing how our underlying businesses performed, excluding the effect of foreign currency fluctuations, we provide certain financial information on a “constant currency basis”, which is in addition to the actual financial information presented. To calculate our constant currency information, we translate the current period financial information using the foreign currency exchange rates that were in effect during the previous comparable period. However, constant currency measures should not be considered in isolation or as an alternative to United States, or U.S., dollar measures that reflect current period exchange rates, or to other financial measures calculated and presented in accordance with accounting principles generally accepted in the United States, or GAAP.\nFor discussion related to the results of operations and changes in financial condition for the fiscal year ended June 30, 2024 compared to fiscal year June 30, 2023, please refer to Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the Year Ended June 30, 2024, which was filed with the U.S. Securities and Exchange Commission, or SEC, on August 9, 2024.\nFiscal Year Ended June 30, 2025 Compared to Fiscal Year Ended June 30, 2024\nNet Revenues \nNet revenue for the year ended June 30, 2025 increased to $5,146.3 million from $4,685.3 million for the year ended June 30, 2024, an increase of $461.0 million or 10% (a 10% increase on a constant currency basis). The following table summarizes our net revenue disaggregated by segment, product and region for the year ended June 30, 2025 compared to the year ended June 30, 2024 (in thousands):\nYear Ended June 30,\n2025\n2024\n% Change \nConstant\nCurrency*\nU.S., Canada and Latin America\nDevices\n$\n1,654,413 \n$\n1,522,758 \n9 \n%\nMasks and other\n1,343,101 \n1,199,798 \n12 \nTotal U.S., Canada and Latin America\n$\n2,997,514 \n$\n2,722,556 \n10 \nCombined Europe, Asia and other markets \nDevices\n$\n1,010,760 \n$\n921,253 \n10 \n%\n9 \n%\nMasks and other\n496,616 \n457,363 \n9 \n8 \nTotal Combined Europe, Asia and other markets\n$\n1,507,376 \n$\n1,378,616 \n9 \n9 \nGlobal revenue\nDevices\n$\n2,665,173 \n$\n2,444,011 \n9 \n%\n9 \n%\nMasks and other\n1,839,717 \n1,657,161 \n11 \n11 \nTotal Sleep and Breathing Health\n$\n4,504,890 \n$\n4,101,172 \n10 \n10 \nResidential Care Software\n641,437 \n584,125 \n10 \n10 \nTotal\n$\n5,146,327 \n$\n4,685,297 \n10 \n10 \n*\nConstant currency numbers exclude the impact of movements in international \ncurrencies.\nSleep and Breathing Health\nNet revenue from our Sleep and Breathing Health business for the year ended June 30, 2025 increased to $4,504.9 million from $4,101.2 million for the year ended June 30, 2024, an increase of $403.7 million or 10%. Movements in international currencies against the U.S. dollar positively impacted net revenues by approximately $4.0 million for the year ended June 30, 2025. Excluding the impact of currency movements, total net revenue from our Sleep and Breathing Health business for the year ended June 30, 2025 increased by 10% compared to the year ended June 30, 2024. The increase in net revenue associated with our devices and masks was primarily attributable to \nincreased demand and unit sales.\nNet revenue from our Sleep and Breathing Health business in the U.S., Canada and Latin America for the year ended June 30, 2025 increased to $2,997.5 million from $2,722.6 million for the year ended June 30, 2024, an increase of $275.0 \n-55-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nmillion or 10%. The increase in net revenue associated with our devices and masks was primarily attributable to \nincreased demand and unit sales\n.\nNet revenue from our Sleep and Breathing Health business in combined Europe, Asia and other markets increased for the year ended June 30, 2025 to $1,507.4 million from $1,378.6 million for the year ended June 30, 2024, an increase of $128.8 million or 9% (a 9% increase on a constant currency basis). \nThe constant currency increase in device and mask sales in combined Europe, Asia and other \nwas primarily attributable to \nincreased demand and unit sales.\nNet revenue from devices for the year ended June 30, 2025 increased to $2,665.2 million from $2,444.0 million for the year ended June 30, 2024, an increase of $221.2 million or 9%, including an increase of 9% in the U.S., Canada and Latin America and an increase of 10% in combined Europe, Asia and other markets (a 9% increase on a constant currency basis). Excluding the impact of foreign currency movements, device sales for the year ended June 30, 2025 increased by 9%.\nNet revenue from masks and other for the year ended June 30, 2025 increased to $1,839.7 million from $1,657.2 million for the year ended June 30, 2024, an increase of 11%, including an increase of 12% in the U.S., Canada and Latin America and an increase of 9% in combined Europe, Asia and other markets (an 8% increase on a constant currency basis). Excluding the impact of foreign currency movements, masks and other sales increased by 11%, compared to the year ended June 30, 2024.\nResidential Care Software\nNet revenue from our Residential Care Software business for the year ended June 30, 2025 was $641.4 million, compared to $584.1 million for the year ended June 30, 2024, an increase of $57.3 million or 10%. The increase was driven by continued growth in the Home Medical Equipment, or HME, and MEDIFOX DAN verticals within our Residential Care Software business.\nGross Profit and Gross Margin. \nGross profit increased for the year ended June 30, 2025 to $3,055.0 million from $2,655.3 million for the year ended June 30, 2024, an increase of $399.7 million or 15%. Gross margin, which is gross profit as a percentage of net revenue, was 59.4% for the year ended June 30, 2025, compared with the 56.7% for the year ended June 30, 2024. The increase in gross margin was due primarily to procurement, manufacturing and logistics efficiencies, $14.3 million of combined expenses associated with the field safety notifications for masks with magnets and Astral devices recognized during the year ended June 30, 2024, as well as a reduction in the amortization of acquired intangibles during the year ended June 30, 2025. The masks with magnets field safety notification expenses relate to estimated \ncosts to provide alternative masks to patients in response to updated contraindications for use of masks that incorporate magnets. \nThe Astral field safety notification expenses relate to estimated costs associated with the replacement of a certain component in some of our Astral ventilation devices that were manufactured between 2013 to 2019. \nOperating Expenses\nThe following table summarizes our operating expenses (in thousands):\nYear Ended June 30,\nChange\n% Change\nConstant Currency\n2025\n2024\nSelling, general, and administrative\n$\n991,019 \n$\n917,136 \n$\n73,883 \n8 \n%\n8 \n%\nas a % of net revenue\n19.3 \n%\n19.6 \n%\nResearch and development \n$\n331,284 \n$\n307,525 \n$\n23,759 \n8 \n%\n8 \n%\nas a % of net revenue\n6.4 \n%\n6.6 \n%\nAmortization of acquired intangible assets\n$\n45,273 \n$\n46,521 \n$\n(1,248)\n(3)\n%\n(3)\n%\nSelling, General and Administrative Expenses \nSelling, general and administrative expenses increased for the year ended June 30, 2025 to $991.0 million from $917.1 million for the year ended June 30, 2024, an increase of $73.9 million or 8%. Selling, general and administrative expenses, as reported in U.S. dollars, were favorably impacted by the movement of international currencies against the U.S. dollar, which decreased our expenses by approximately $0.2 million. Excluding the impact of foreign currency movements, selling, general and administrative expenses for the year ended June 30, 2025 increased by 8% compared to the year ended \n-56-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nJune 30, 2024. As a percentage of net revenue, selling, general and administrative expenses for the year ended June 30, 2025 improved to 19.3% compared to 19.6% for the year ended June 30, 2024. \nThe constant currency increase in selling, general and administrative expenses for the year ended June 30, 2025 compared to the year ended June 30, 2024 was primarily due to increases in employee-related costs and marketing expenses.\nResearch and Development Expenses \nResearch and development expenses increased for the year ended June 30, 2025 to $331.3 million from $307.5 million for the year ended June 30, 2024, an increase of $23.8 million or 8%. Research and development expenses were favorably impacted by the movement of international currencies against the U.S. dollar, which decreased our expenses by approximately $1.3 million, as reported in U.S. dollars. Excluding the impact of foreign currency movements, research and development expenses for the year ended June 30, 2025 increased by 8% compared to the year ended June 30, 2024. As a percentage of net revenue, research and development expenses were 6.4% for the year ended June 30, 2025 compared to 6.6% for the year ended June 30, 2024. \nThe constant currency increase in research and development expenses was primarily due to increases in employee-related costs.\nAmortization of Acquired Intangible Assets \nAmortization of acquired intangible assets for the year ended June 30, 2025 was $45.3 million compared to $46.5 million for the year ended the year ended June 30, 2024. The decrease in amortization of acquired intangibles is due to certain acquired intangible assets reaching the end of their useful lives and becoming fully amortized, partially offset by increases from amortization of acquired intangibles associated with new acquisitions.\nRestructuring Expenses \nWe did not incur material restructuring expenses during the year ended June 30, 2025. During the year ended June 30, 2024, we incurred restructuring expenses of $64.2 million associated with an evaluation of our existing operations to increase operational efficiency, decrease costs and increase profitability. Restructuring charges for the year ended June 30, 2024 were comprised of $28.6 million of employee severance and other one-time termination benefits, $33.2 million of intangible asset impairments associated with the wind down of certain business activities, and $2.4 million of other miscellaneous asset impairments. \nTotal Other Income (Loss), Net\nThe following table summarizes our other income (loss) (in thousands):\nYear Ended June 30,\n2025\n2024\nChange\nInterest income (expense), net\n$\n4,114 \n$\n(45,708)\n$\n49,822 \nGain (loss) attributable to equity method investments\n3,644 \n(1,848)\n5,492 \nGain (loss) on equity investments\n(10,299)\n(4,045)\n(6,254)\nOther, net\n(5,256)\n(3,494)\n(1,762)\nTotal other income (loss), net\n$\n(7,797)\n$\n(55,095)\n$\n47,298 \nTotal other income (loss), net for the year ended June 30, 2025 was a loss of $7.8 million, compared to a loss of $55.1 million for the year ended June 30, 2024. We recorded interest income, net, of $4.1 million for the year ended June 30, 2025 compared to interest expense, net of $45.7 million for the year ended June 30, 2024 due to lower debt levels following the repayment of our revolving credit facility and interest earned on cash balances. Losses associated with our investments in marketable and non-marketable equity securities were $10.3 million for the year ended June 30, 2025 compared to a loss of $4.0 million or the year ended June 30, 2024. Losses associated with our investments in marketable and non-marketable equity securities were partially offset by a gain attributable to equity method investments for the year ended June 30, 2025 of $3.6 million, compared to a loss of $1.8 million for the year ended June 30, 2024. \n-57-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIncome Taxes \nOur effective income tax rate decreased to 16.5% for the year ended June 30, 2025 from 19.3% for the year ended June 30, 2024. Our effective rate of 16.5% for the year ended June 30, 2025 differs from the statutory rate of 21.0% primarily due to interest and penalties refunded by the IRS in relation to certain amended returns, tax benefits realized from the cessation of certain business activities, along with research credits and foreign operations. The decrease in our effective tax rate for the year ended June 30, 2025 was primarily due to the IRS refund of interest and penalties and tax benefits realized from the cessation of certain business activities. \nOur Singapore operations operate under certain tax holidays and tax incentive programs that will expire in whole or in part at various dates through June 30, 2030. As a result of the TCJA, we treated all non-U.S. historical earnings as taxable during the year ended June 30, 2018. Therefore, future repatriation of cash held by our non-U.S. subsidiaries will generally not be subject to U.S. federal tax, if repatriated, except as discussed in Note 12 – Income Taxes of the Notes to the Consolidated Financial Statements (Part II, Item 8).\nThe Organization of Economic Co-operation and Development (OECD) and the G20 Inclusive Framework on Base Erosion and Profit Shifting (the Inclusive Framework) has put forth two proposals—Pillar One and Pillar Two—that (i) revise the existing profit allocation and nexus rules and (ii) ensure a minimal level of taxation, respectively. Effective in our fiscal year beginning July 1, 2024, various jurisdictions in which we operate began implementing the global minimum tax prescribed under Pillar Two. These changes in legislation did not have a material impact on our income tax expense and cash flows for the fiscal year ending June 30, 2025. \nOn June 28, 2025, the G7 issued a joint statement in which its members agreed that Pillar Two will operate alongside the U.S. system of tax and proposed that U.S.-parented multinational groups would not be subject to the income inclusion rules and undertaxed profits rules of Pillar Two. The remaining OECD countries are likely to consider changes to existing and proposed tax laws to align with the recommendations and guidelines proposed by G7. We are continuing to evaluate the potential impacts of the Inclusive Framework for future periods.\nNet Income and Earnings per Share\nAs a result of the factors discussed above, our net income for the year ended June 30, 2025 was $1,400.7 million compared to net income of $1,021.0 million for the year ended June 30, 2024. Our earnings per diluted share for the year ended June 30, 2025 was $9.51 compared to $6.92 for the year ended June 30, 2024, an increase of 37%. \nSummary of Non-GAAP Financial Measures\nIn addition to financial information prepared in accordance with GAAP, our management uses certain non-GAAP financial measures, such as non-GAAP cost of sales, non-GAAP gross profit, non-GAAP gross margin, non-GAAP income from operations, non-GAAP net income, and non-GAAP diluted earnings per share, in evaluating the performance of our business. We believe that these non-GAAP financial measures, when reviewed in conjunction with GAAP financial measures, can provide investors better insight when evaluating our performance from core operations and can provide more consistent financial reporting across periods. For these reasons, we use non-GAAP information internally in planning, forecasting, and evaluating the results of operations in the current period and in comparing it to past periods. These non-GAAP financial measures should be considered in addition to, and not superior to or as a substitute for, GAAP financial measures. We strongly encourage investors and shareholders to review our financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure. Non-GAAP financial measures as presented herein may not be comparable to similarly titled measures used by other companies. \nThe measure “non-GAAP cost of sales” is equal to GAAP cost of sales less amortization of acquired intangible assets relating to cost of sales and field safety notification expenses. The masks with magnets field safety notification expenses relate to estimated \ncosts to provide alternative masks to patients in response to updated contraindications for use of masks that incorporate magnets. \nThe Astral field safety notification expenses relate to estimated costs associated with the replacement of a certain component in some of our Astral ventilation devices that were manufactured between 2013 to 2019. The measure “non-GAAP gross profit” is the difference between GAAP net revenue and non-GAAP cost of sales, and “non-GAAP gross margin” is the ratio of non-GAAP gross profit to GAAP net revenue. \n-58-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThese non-GAAP measures are reconciled to their most directly comparable GAAP financial measures below (in thousands, except percentages):\nYear Ended June 30,\n2025\n2024\nGAAP Net revenue\n$\n5,146,327 \n$\n4,685,297 \nGAAP Cost of sales\n$\n2,091,357 \n$\n2,029,994 \nLess:\n Amortization of acquired intangibles\n(32,116)\n(32,963)\nLess\n: Masks with magnets field safety notification expenses\n1,512 \n(6,351)\nLess\n: Astral field safety notification expenses\n— \n(7,911)\nNon-GAAP cost of sales\n$\n2,060,753 \n$\n1,982,769 \nGAAP gross profit\n$\n3,054,970 \n$\n2,655,303 \nGAAP gross margin\n59.4 \n%\n56.7 \n%\nNon-GAAP gross profit\n$\n3,085,574 \n$\n2,702,528 \nNon-GAAP gross margin\n60.0 \n%\n57.7 \n%\nThe measure “non-GAAP income from operations” is equal to GAAP income from operations once adjusted for amortization of acquired intangibles, restructuring expenses, field safety notification expenses, and acquisition-related expenses. Non-GAAP income from operations is reconciled with GAAP income from operations below (in thousands):\nYear Ended June 30,\n2025\n2024\nGAAP income from operations\n$\n1,685,363 \n$\n1,319,893 \nAmortization of acquired intangibles - cost of sales\n32,116 \n32,963 \nAmortization of acquired intangibles - operating expenses\n45,273 \n46,521 \nRestructuring expenses\n— \n64,228 \nMasks with magnets field safety notification expenses\n(1,512)\n6,351 \nAstral field safety notification expenses\n— \n7,911 \nAcquisition-related expenses\n2,031 \n483 \nNon-GAAP income from operations \n$\n1,763,271 \n$\n1,478,350 \n-59-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe measure “non-GAAP net income” is equal to GAAP net income once adjusted for amortization of acquired intangibles, restructuring expenses, field safety notification expenses, acquisition related expenses, and associated tax effects, in addition to tax benefits from business cessation, and the tax effect of interest and penalties on tax refunds. The measure “non-GAAP diluted earnings per share” is the ratio of non-GAAP net income to diluted shares outstanding. These non-GAAP measures are reconciled to their most directly comparable GAAP financial measures below (in thousands, except for per share amounts):\nYear Ended June 30,\n2025\n2024\nGAAP net income\n$\n1,400,723 \n$\n1,020,951 \nAmortization of acquired intangibles - cost of sales\n32,116 \n32,963 \nAmortization of acquired intangibles - operating expenses\n45,273 \n46,521 \nRestructuring expenses\n— \n64,228 \nMasks with magnets field safety notification expenses\n(1,512)\n6,351 \nAstral field safety notification expenses\n— \n7,911 \nAcquisition-related expenses\n2,031 \n483 \nTax benefit from business cessation\n(21,430)\n— \nIncome tax effect of interest income on tax refunds\n(29,976)\n— \nIncome tax effect on non-GAAP adjustments\n(20,448)\n(40,114)\nNon-GAAP net income\n$\n1,406,777 \n$\n1,139,294 \nDiluted shares outstanding\n147,340 \n147,550 \nGAAP diluted earnings per share\n$\n9.51 \n$\n6.92 \nNon-GAAP diluted earnings per share\n$\n9.55 \n$\n7.72 \nLiquidity and Capital Resources \nOur principal sources of liquidity are our existing cash and cash equivalents, cash generated from operations and access to our revolving credit facility. Our primary uses of cash have been for research and development activities, selling and marketing activities, capital expenditures, strategic acquisitions and investments, share repurchases, dividend payments and repayment of debt obligations. We expect that cash provided by operating activities may fluctuate in future periods as a result of several factors, including fluctuations in our operating results, which include supply chain disruptions, working capital requirements and capital deployment decisions.\nOur future capital requirements will depend on many factors including our growth rate in net revenue, third-party reimbursement of our products for our customers, the timing and extent of spending to support research development efforts, the expansion of selling, general and administrative activities, the timing of introductions of new products, the expenditures associated with possible future acquisitions, investments or other business combination transactions. As we assess inorganic growth strategies, we may need to supplement our internally generated cash flow with outside sources. If we are required to access the debt market, we believe that we will be able to secure reasonable borrowing rates. As part of our liquidity strategy, we will continue to monitor our current level of earnings and cash flow generation as well as our ability to access the market considering those earning levels. \nAs of June 30, 2025 and June 30, 2024, we had cash and cash equivalents of $1,209.5 million and $238.4 million, respectively. Our cash and cash equivalents held within the U.S. at June 30, 2025 and June 30, 2024 were $555.0 million and $51.2 million, respectively. Our remaining cash and cash equivalent balances at June 30, 2025 and June 30, 2024, were $654.5 million and $187.2 million, respectively. Our cash and cash equivalent balances are held at highly rated financial institutions.\nAs of June 30, 2025, we had up to $1,500.0 million available for draw down under the revolving credit facility and a combined total of $2,709.5 million in cash and available liquidity under the revolving credit facility. \nWe repatriated $1,050.0 million and $800.0 million to the U.S. during the years ended June 30, 2025 and 2024, respectively, from earnings generated in each of those years. The amount of the current year foreign earnings that we have repatriated to the U.S. in the past has been determined, and the amount that we expect to repatriate during fiscal year 2025 will be determined, based on a variety of factors, including current year earnings of our foreign subsidiaries, foreign \n-60-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\ninvestment needs and the cash flow needs we have in the U.S., such as for the repayment of debt, dividend distributions, and other domestic obligations.\nAs a result of the TCJA, we treated all non-U.S. historical earnings as taxable, which resulted in additional tax expense of $92.4 million which was payable over the proceeding eight years. Therefore, future repatriation of cash held by our non-U.S. subsidiaries will generally not be subject to U.S. federal tax if repatriated, except as discussed in Note 12 – Income Taxes of the Notes to the Consolidated Financial Statements (Part II, Item 8).\nWe believe that our current sources of liquidity will be sufficient to fund our operations, including expected capital expenditures, for the next 12 months and beyond.\nRevolving Credit Agreement, Term Credit Agreement and Senior Notes\nOn June 29, 2022, we entered into a second amended and restated credit agreement, or as amended from time to time, the Revolving Credit Agreement. The Revolving Credit Agreement, among other things, provided a senior unsecured revolving credit facility of $1,500.0 million, with an uncommitted option to increase the revolving credit facility by an additional amount equal to the greater of $1,000.0 million or 1.0 times the EBITDA for the trailing twelve-month measurement period. Additionally, on June 29, 2022, ResMed Pty Limited entered into a Second Amendment to the Syndicated Facility Agreement, or the Term Credit Agreement. The Term Credit Agreement, among other things, provides ResMed Pty Limited a senior unsecured term credit facility of $200.0 million. The Revolving Credit Agreement and Term Credit Agreement each terminate on Jun 29, 2027, when all unpaid principal and interest under the loans must be repaid. As of June 30, 2025, we had $1,500.0 million available for draw down under the revolving credit facility.\nOn July 10, 2019, we entered into a Note Purchase Agreement with the purchasers to that agreement, in connection with the issuance and sale of $250.0 million principal amount of our 3.24% senior notes due July 10, 2026, and $250.0 million principal amount of our 3.45% senior notes due July 10, 2029, or the Senior Notes. \nOn June 30, 2025, there was a total of $670.0 million outstanding under the Revolving Credit Agreement, Term Credit Agreement and Senior Notes. We expect to satisfy all of our liquidity and long-term debt requirements through a combination of cash on hand, cash generated from operations and debt facilities.\nCash Flow Summary\nThe following table summarizes our cash flow activity (in thousands):\n \n \nYear Ended June 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n1,751,588 \n$\n1,401,260 \nNet cash used in investing activities\n(200,045)\n(269,784)\nNet cash used in financing activities\n(606,253)\n(1,119,287)\nEffect of exchange rate changes on cash\n25,799 \n(1,719)\nNet increase in cash and cash equivalents\n$\n971,089 \n$\n10,470 \nOperating Activities\nCash provided by operating activities was $1,751.6 million for the year ended June 30, 2025, compared to cash provided of $1,401.3 million for the year ended June 30, 2024. The $350.3 million increase in cash flow from operations was primarily due to increased net income, partially offset by higher working capital during the year ended June 30, 2025 compared to the year ended June 30, 2024. During the year ended June 30, 2025, our operating cash flows included $124.4 million of income tax refunds and associated interest and penalties.\nInvesting Activities\nCash used in investing activities was $200.0 million for the year ended June 30, 2025, compared to cash used of $269.8 million for the year ended June 30, 2024. The $69.7 million decrease in cash flow used in investing activities was primarily due to net proceeds from maturity of foreign currency contracts during the year ended June 30, 2025 compared to net \n-61-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\npayments from maturity of foreign currency contracts and decreased purchases of property, plant and equipment during the year ended June 30, 2025.\nFinancing Activities\nCash used in financing activities was $606.3 million for the year ended June 30, 2025, compared to cash used of $1,119.3 million for the year ended June 30, 2024. We repurchased $300.0 million of treasury stock during the year ended June 30, 2025 compared to repurchases of $150.0 million during the year ended June 30, 2024. Cash outflows for treasury stock repurchases were offset by lower net repayments under our Revolving Credit Agreement of $40.0 million for the year ended June 30, 2025 compared to net repayments of $730.0 million for the year ended June 30, 2024. \nDividends\nDuring the year ended June 30, 2025, we paid cash dividends of $2.12 per common share totaling $310.9 million. On July 31, 2025, our board of directors declared a cash dividend of $0.60 per common share, to be paid on September 18, 2025, to shareholders of record as of the close of business on August 14, 2025. Future dividends are subject to approval by our board of directors.\nContractual Obligations and Commitments\nDetails of contractual obligations at June 30, 2025 are as follows (in thousands): \nPayments Due by June 30,\nTotal\n2026\n2027\n2028\n2029\n2030\nThereafter\nDebt\n$\n670,775 \n$\n10,775 \n$\n410,000 \n$\n— \n$\n— \n$\n250,000 \n$\n— \nInterest on debt\n59,788 \n25,344 \n16,954 \n8,625 \n8,625 \n240 \n— \nOperating leases\n224,945 \n41,131 \n34,688 \n28,347 \n26,242 \n20,633 \n73,904 \nPurchase obligations\n963,763 \n927,365 \n26,090 \n4,430 \n2,339 \n2,154 \n1,385 \nTotal \n$\n1,919,271 \n$\n1,004,615 \n$\n487,732 \n$\n41,402 \n$\n37,206 \n$\n273,027 \n$\n75,289 \nDetails of other commercial commitments at June 30, 2025 are as follows (in thousands): \nAmount of Commitment Expiration Per Period\nTotal\n2026\n2027\n2028\n2029\n2030\nThereafter\nStandby letter of credit\n$\n11,985 \n$\n4,087 \n$\n91 \n$\n— \n$\n313 \n$\n30 \n$\n7,464 \nGuarantees*\n4,719 \n4,617 \n7 \n27 \n33 \n2 \n33 \nTotal \n$\n16,704 \n$\n8,704 \n$\n98 \n$\n27 \n$\n346 \n$\n32 \n$\n7,497 \n*\nThese guarantees mainly relate to requirements under contractual obligations with insurance companies transacting with our German subsidiaries and guarantees provided under our facility leasing obligations.\nRefer to Note 15 – Legal Actions, Contingencies and Commitments of the Notes to the Consolidated Financial Statements (Part II, Item 8) for details of our contingent obligations under recourse provisions.\nSegment Information \nWe have determined that we have two operating segments, which are the Sleep and Breathing Health segment and the Residential Care Software segment. See Note 13 – Segment Information of the Notes to the Consolidated Financial Statements (Part II, Item 8) for financial information regarding segment reporting. Financial information about our revenues from and assets located in foreign countries is also included in the notes to the consolidated financial statements included in this report.\nCritical Accounting Principles and Estimates \nThe preparation of financial statements in conformity with U.S. GAAP requires us to make estimates and judgments that affect our reported amounts of assets and liabilities, revenues and expenses and related disclosures of contingent assets and \n-62-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nliabilities. On an ongoing basis we evaluate our estimates, including those related to allowance for doubtful accounts, inventory reserves, warranty obligations, goodwill, potentially impaired assets, intangible assets, income taxes and contingencies.\nWe state these accounting policies in the notes to the financial statements and at relevant sections in this discussion and analysis. The estimates are based on the information that is currently available to us and on various other assumptions that we believe to be reasonable under the circumstances. Actual results could vary from those estimates under different assumptions or conditions.\nWe believe that the following critical accounting policies affect the more significant judgments and estimates used in the preparation of our consolidated financial statements: \n(1)\nValuation of Goodwill. \nWe make assumptions in establishing the carrying value and fair value of our goodwill. Our goodwill impairment tests are performed at our reporting unit level, which is one level below our operating segments. The criteria used for these evaluations include management’s estimate of the asset’s continuing ability to generate positive income from operations and positive cash flow in future periods compared to the carrying value of the asset, as well as the strategic significance of the assets in our business objectives. If goodwill is considered to be impaired, we recognize as an impairment the amount by which the carrying value of the goodwill exceeds its fair value, limited to the value of goodwill allocated to the impaired reporting unit, as described in Step 1 below. Factors that would influence the likelihood of a material change in our reported results include significant changes in the asset’s ability to generate positive cash flow, a significant decline in the economic and competitive environment on which the asset depends, significant changes in our strategic business objectives, utilization of the asset, and a significant change in the economic and/or political conditions in certain countries. \nWe conduct an annual review for goodwill impairment at our reporting unit level based on the following steps: \nStep 0 or Qualitative assessment – Evaluate qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. The factors we consider include, but are not limited to, macroeconomic conditions, industry and market considerations, cost factors, overall financial performance or events-specific to that reporting unit. If or when we determine it is more likely than not that the fair value of a reporting unit is less than the carrying amount, including goodwill, we would move to Step 1 of the quantitative method.\nStep 1 – Compare the fair value for each reporting unit to its carrying value, including goodwill. Fair value is determined based on estimated discounted cash flows. A goodwill impairment charge is recognized for the amount that the carrying amount of a reporting unit, including goodwill, exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit. If a reporting unit’s fair value exceeds the carrying value, no further work is performed and no impairment charge is necessary.\nDuring the annual reviews for the years ended June 30, 2025, 2024 and 2023, we completed a Step 0 or Qualitative assessment and determined it was more likely than not that the fair value of our reporting units exceeded their carrying amounts, including goodwill, and therefore goodwill was not impaired.\n(2)\nIncome Tax. \nManagement judgment is required in determining our income tax provision, deferred tax assets and liabilities, and any valuation allowance recorded against net deferred tax assets in accordance with GAAP. These estimates and judgments occur in the calculation of tax credits, benefits, and deductions and in the calculation of certain tax assets and liabilities, which arise from differences in the timing of recognition of revenue and expense for tax and financial statement purposes, as well as the interest and penalties related to uncertain tax positions. Significant changes to these estimates may result in an increase or decrease in our income tax provision in the current period or subsequent periods.\nWe maintain valuation allowances if it is more likely than not that all or a portion of the deferred tax asset will not be realized. In determining whether a valuation allowance is warranted, we evaluate factors such as prior earnings history, expected future earnings, carryback and carryforward periods and tax strategies that could potentially enhance the likelihood of realization of a deferred tax asset. The realizability assessments made at a given balance sheet date are subject to change in the future, particularly if earnings of a subsidiary are significantly higher or lower than expected, or if we take operational or tax planning actions that could impact the future taxable earnings of a subsidiary.\n-63-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and our income tax returns are based on calculations and assumptions subject to audit by various tax authorities. We recognize liabilities for uncertain tax positions based on a two-step process. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement. While we believe we have appropriate support for the positions taken on our tax returns, we assess the potential outcomes of examinations by tax authorities in determining the adequacy of our provision for income taxes on a quarterly basis. Based on our assessment, we may adjust the income tax provision, deferred taxes and valuation allowances in the period in which the facts that give rise to a revision become known.\nTax years 2018 to 2024 remain subject to examination by the major tax jurisdictions in which we are subject to tax.\n(3)\nRevenue Recognition. \nWe have determined that we have two operating segments, which are Sleep and Breathing Health and Residential Care Software. For products in our Sleep and Breathing Health business, we transfer control and recognize a sale when products are shipped to the customer in accordance with the contractual shipping terms. For our Residential Care Software business, revenue associated with cloud-hosted services are recognized as they are provided. Unbilled receivables arise when revenue is recognized for goods or services transferred but the customer has not yet been invoiced, typically due to billing terms or timing differences. We defer the recognition of a portion of the consideration received when performance obligations are not yet satisfied. Consideration received from customers in advance of revenue recognition is classified as deferred revenue. Performance obligations resulting in deferred revenue in our Sleep and Breathing Health business relate primarily to extended warranties on our devices and the provision of data for patient monitoring. Performance obligations resulting in deferred revenue in our Residential Care Software business relate primarily to the provision of software access with maintenance and support over an agreed term and material rights associated with future discounts upon renewal of some Residential Care Software contracts. Generally, deferred revenue will be recognized over a period of one to five years. Our contracts do not contain significant financing components.\nRevenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. In our Sleep and Breathing Health segment, the amount of consideration received and revenue recognized varies with changes in marketing incentives (e.g. rebates, discounts, free goods) and returns by our customers and their customers. When we give customers the right to return eligible products and receive credit, returns are estimated based on an analysis of our historical experience. Returns of products, excluding warranty-related returns, have historically been infrequent and insignificant. We adjust the estimate of revenue at the earlier of when the most likely amount of consideration can be estimated, the amount expected to be received changes, or when the consideration becomes fixed.\nWe offer our Sleep and Breathing Health customers cash or product rebates based on volume or sales targets measured over quarterly or annual periods. We estimate rebates based on each customer’s expected achievement of its targets. In accounting for these rebate programs, we reduce revenue ratably as sales occur over the rebate period by the expected value of the rebates to be returned to the customer. Rebates measured over a quarterly period are updated based on actual sales results and, therefore, no estimation is required to determine the reduction to revenue. For rebates measured over annual periods, we update our estimates each quarter based on actual sales results and updated forecasts for the remaining rebate periods. \nWe participate in programs where we issue credits to our Sleep and Breathing Health distributors when they are required to sell our products below negotiated list prices if we have preexisting contracts with the distributors' customers. We reduce revenue for future credits at the time of sale to the distributor, which we estimate based on historical experience using the expected value method. \nWe also offer discounts to both our Sleep and Breathing Health as well as our Residential Care Software customers as part of normal business practice and these are deducted from revenue when the sale occurs.\nWhen Sleep and Breathing Health or Residential Care Software contracts have multiple performance obligations, we generally use an observable price to determine the stand-alone selling price by reference to pricing and discounting practices for the specific product or service when sold separately to similar customers. Revenue is then allocated proportionately, based on the determined stand-alone selling price, to each performance obligation. An allocation is not \n-64-\nTable of Contents\nPART II\nItem 7\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nrequired for many of our Sleep and Breathing Health contracts that have a single performance obligation, which is the shipment of our therapy-based equipment.\nOff-Balance Sheet Arrangements \nAs of June 30, 2025, we are not involved in any significant off-balance sheet arrangements, as described in Instruction 8 to Item 303(b) of Regulation S-K promulgated by the SEC.\n-65-\nTable of Contents\nPART II\nItem 7A\nRESMED INC. AND SUBSIDIARIES\nQuantitative and Qualitative Disclosures About Market and Business Risks\nITEM 7A QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET AND BUSINESS RISKS\nForeign Currency Market Risk\nOur reporting currency is the U.S. dollar, although the financial statements of our non-U.S. subsidiaries are maintained in their respective local currencies. We transact business in various foreign currencies, including a number of major European currencies as well as the Australian and Singapore dollars. We have significant foreign currency exposure through our Australian and Singapore manufacturing activities and our international sales operations. \nNet Investment and Fair Value Hedging\nOn November 17, 2022, we executed foreign cross-currency swaps as net investment hedges and fair value hedges in designated hedging relationships with either the foreign denominated net asset balances or the foreign denominated intercompany loan as the hedged items. All derivatives are recorded at fair value as either an asset or liability. Cash flows associated with derivative instruments are presented in the same category on the consolidated statements of cash flows as the hedged item.\nThe purpose of the cross-currency swaps for the fair value hedge is to mitigate foreign currency risk associated with changes in spot rates on foreign denominated intercompany debt between USD and EUR. For these hedges, we excluded certain components from the assessment of hedge effectiveness that are not related to spot rates. For fair value hedges that qualify and are designated for hedge accounting, the change in fair value of the derivative is recorded in the same line item as the hedged item, Other, net, in the condensed consolidated statement of income. The initial fair value of hedge components excluded from the assessment of effectiveness is recognized in the statement of income under a systematic and rational method over the life of the hedging instrument and is presented in interest (expense) income, net. Any difference between the change in the fair value of the hedge components excluded from the assessment of effectiveness and the amounts recognized in earnings is recorded as a component of other comprehensive income. \nThe purpose of the cross-currency swaps for the net investment hedge is to mitigate foreign currency risk associated with changes in spot rates on the net asset balances of our foreign functional subsidiaries. For net investment hedges that qualify and are designated for hedge accounting, the change in fair value of the derivative is recorded in cumulative translation adjustment within other comprehensive loss and reclassified into earnings when the hedged net investment is either sold or substantially liquidated. The initial fair value of components excluded from the assessment of hedge effectiveness will be recognized in interest (expense) income, net. \nThe notional value of outstanding foreign cross-currency swaps was $1,128.3 million and $1,026.2 million at June 30, 2025 and June 30, 2024, respectively. These contracts mature at various dates prior to December 31, 2029.\nNon-Designated Hedges\nWe transact business in various foreign currencies, including a number of major European currencies as well as the Australian and Singapore dollars. We have foreign currency exposure through both our Australian and Singapore manufacturing activities, and international sales operations. We have established a foreign currency hedging program using purchased foreign currency call options, collars and forward contracts to hedge foreign-currency-denominated financial assets, liabilities and manufacturing cash flows. The terms of such foreign currency hedging contracts generally do not exceed three years. The purpose of this hedging program is to economically manage the financial impact of foreign currency exposures denominated mainly in Euros, and Australian and Singapore dollars. Under this program, increases or decreases in our foreign currency denominated financial assets, liabilities, and firm commitments are partially offset by gains and losses on the hedging instruments. We do not designate these foreign currency contracts as hedges. All movements in the fair value of the foreign currency instruments are recorded within other, net in our condensed consolidated statements of income. \nThe notional value of the outstanding non-designated hedges was $1,410.2 million and $1,340.0 million at June 30, 2025 and June 30, 2024, respectively. These contracts mature at various dates prior to June 15, 2026.\n-66-\nTable of Contents\nPART II\nItem 7A\nRESMED INC. AND SUBSIDIARIES\nQuantitative and Qualitative Disclosures About Market and Business Risks\nFair Values of Derivative Instruments \nThe table below provides information (in U.S. dollars) on our significant foreign-currency-denominated financial assets by legal entity functional currency as of June 30, 2025 (in thousands): \nU.S.\nDollar\n(USD)\nEuro\n(EUR)\nCanadian\nDollar\n(CAD)\nChinese\nYuan\n(CNY)\nAUD Functional:\n \n \n \n \nNet Assets/(Liabilities)\n409,575 \n(201,058)\n(63)\n37,600 \nForeign Currency Hedges\n(340,000)\n188,330 \n— \n(27,918)\nNet Total\n69,575 \n(12,728)\n(63)\n9,682 \nUSD Functional:\nNet Assets/(Liabilities)\n— \n333,760 \n37,442 \n— \nForeign Currency Hedges\n— \n(329,578)\n(36,711)\n— \nNet Total\n— \n4,182 \n731 \n— \nSGD Functional:\n \n \n \n \nNet Assets/(Liabilities)\n473,872 \n256,438 \n— \n2,871 \nForeign Currency Hedges\n(470,000)\n(241,298)\n— \n— \nNet Total\n3,872 \n15,140 \n— \n2,871 \n-67-\nTable of Contents\nPART II\nItem 7A\nRESMED INC. AND SUBSIDIARIES\nQuantitative and Qualitative Disclosures About Market and Business Risks\nThe table below provides information about our material foreign currency derivative financial instruments and presents the information in U.S. dollar equivalents. The table summarizes information on instruments and transactions that are sensitive to foreign currency exchange rates, including foreign currency call options, collars, forward contracts and cross-currency swaps held at June 30, 2025. The table presents the notional amounts and weighted average exchange rates by contractual maturity dates for our foreign currency derivative financial instruments, including the forward contracts used to hedge our foreign currency denominated assets and liabilities. These notional amounts generally are used to calculate payments to be exchanged under the contracts (in thousands, except exchange rates). \nFair Value Assets / (Liabilities)\nTotal\nJune 30,\n2025\nJune 30,\n2024\nAUD/USD\nContract amount\n340,000\n2,969 \n730 \nAve. contractual exchange rate\nAUD 1 = USD 0.6521\nAUD/Euro\nContract amount\n276,610\n(1,203)\n(1,610)\nAve. contractual exchange rate\nAUD 1 = EUR 0.5777\nSGD/Euro\nContract amount\n258,954\n(1,426)\n825 \nAve. contractual exchange rate\nSGD 1 = EUR 0.6716\nSGD/USD\nContract amount\n470,000\n3,031 \n(2,054)\nAve. contractual exchange rate\nSGD 1 = USD 0.7826\nAUD/CNY\nContract amount\n27,918\n374 \n(112)\nAve. contractual exchange rate\nAUD 1 = CNY 4.6233\nUSD/EUR\nContract amount\n1,128,329\n(128,631)\n(31,743)\nAve. contractual exchange rate\nUSD 1 = EUR 0.9610\nUSD/CAD\nContract amount\n36,711\n370 \n(143)\nAve. contractual exchange rate\nCAD 1 = USD 0.7416\nInterest Rate Risk\nWe are exposed to risk associated with changes in interest rates affecting the return on our cash and cash equivalents and debt. At June 30, 2025, we held cash and cash equivalents of $1,209.5 million principally comprising of bank term deposits and at-call accounts and are invested at both short-term fixed interest rates and variable interest rates. At June 30, 2025, there was $170.0 million outstanding under the term loan facilities, which were subject to variable interest rates. A hypothetical 10% change in interest rates during the year ended June 30, 2025, would not have had a material impact on pretax income. We have no interest rate hedging agreements. On July 10, 2019, we entered into the Note Purchase Agreement with the purchasers to that agreement, in connection with the issuance and sale of $250.0 million principal amount of our 3.24% senior notes due July 10, 2026, and $250.0 million principal amount of our 3.45% senior notes due July 10, 2029. The interest rate on these notes is fixed and not subject to fluctuation. \nInflation\nInflationary factors such as increases in the cost of our products, freight, overhead costs or wage rates may adversely affect our operating results. Sustained inflationary pressures in the future may have an adverse effect on our ability to maintain current levels of gross margin and operating expenses as a percentage of net revenue if we are unable to offset such higher costs through price increases.\n-68-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nITEM 8 CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \nThe information required by this Item is incorporated by reference to the financial statements set forth in Item 15 of Part IV of this report, “Exhibits and Consolidated Financial Statement Schedules.”\n(a) Index to Consolidated Financial Statements \nReport of Independent Registered Public Accounting Firm \n(\nKPMG LLP\n, \nSan Diego, CA\n, Auditor Firm ID: \n185\n)\n70\nConsolidated Balance Sheets as of June 30, 2025 and 2024\n72\nConsolidated Statements of Income for the years ended June 30, 2025, 2024 and 2023\n73\nConsolidated Statements of Comprehensive Income for the years ended June 30, 2025, 2024 and 2023\n74\nConsolidated Statements of Stockholders’ Equity for the years ended June 30, 2025, 2024 and 2023\n75\nConsolidated Statements of Cash Flows for the years ended June 30, 2025, 2024 and 2023\n76\nNotes to Consolidated Financial Statements\n77\nSchedule II – Valuation and Qualifying Accounts and Reserves\n103\n(b) Supplementary Data \nQuarterly Financial Information (unaudited)—The quarterly results for the years ended June 30, 2025 and 2024 are summarized below (in thousands, except per share amounts): \n2025\nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nFiscal\nYear\nNet revenue\n$\n1,224,509 \n$\n1,282,089 \n$\n1,291,736 \n$\n1,347,993 \n$\n5,146,327 \nGross profit\n$\n717,219 \n$\n751,275 \n$\n766,409 \n$\n820,070 \n$\n3,054,970 \nNet income\n$\n311,355 \n$\n344,622 \n$\n365,041 \n$\n379,705 \n$\n1,400,723 \nBasic earnings per share\n$\n2.12 \n$\n2.35 \n$\n2.49 \n$\n2.59 \n$\n9.55 \nDiluted earnings per share\n$\n2.11 \n$\n2.34 \n$\n2.48 \n$\n2.58 \n$\n9.51 \n2024\nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nFiscal\nYear\nNet revenue\n$\n1,102,321 \n$\n1,162,801 \n$\n1,196,980 \n$\n1,223,195 \n$\n4,685,297 \nGross profit\n$\n600,060 \n$\n646,934 \n$\n692,781 \n$\n715,527 \n$\n2,655,303 \nNet income\n$\n219,422 \n$\n208,800 \n$\n300,492 \n$\n292,237 \n$\n1,020,951 \nBasic earnings per share\n$\n1.49 \n$\n1.42 \n$\n2.04 \n$\n1.99 \n$\n6.94 \nDiluted earnings per share\n$\n1.49 \n$\n1.42 \n$\n2.04 \n$\n1.98 \n$\n6.92 \nNote: the amounts for each quarter are computed independently and, due to the computation formula, the sum of the four quarters may not equal the year. \n-69-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nResMed Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of ResMed Inc. and subsidiaries (the Company) as of June 30, 2025 and 2024, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended June 30, 2025, and the related notes and financial statement schedule II (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2025 and 2024, and the results of its operations and its cash flows for each of the years in the three-year period ended June 30, 2025, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of June 30, 2025, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated August 7, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of goodwill triggering events\nAs discussed in Notes 2(i) and 5 to the consolidated financial statements, the Company’s goodwill balance was $3,047 million as of June 30, 2025. The Company performs goodwill impairment testing on an annual basis and whenever events or changes in circumstances indicate that the carrying value of a reporting unit, including goodwill, might exceed the fair value of the reporting unit. In the current year, the Company performed qualitative, or Step 0, assessments to determine whether there was a greater than 50 percent likelihood that the fair value of each reporting unit was less than its carrying value. After completing Step 0, the Company determined that goodwill was not more likely than not impaired and, therefore, no Step 1, or quantitative assessment, was necessary. \n-70-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nWe identified the evaluation of goodwill triggering events as a critical audit matter. The evaluation of potential triggering events, including macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, market capitalization and events specific to the entity and reporting units, required a higher degree of auditor judgment. These potential triggering events could have a significant effect on the Company’s Step 0 assessment and the determination of whether further quantitative analysis of goodwill impairment was required. \nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the evaluation of goodwill impairment. This included a control related to the Company’s assessment of potential goodwill triggering events. We evaluated the Company’s Step 0 assessment for its reporting units by:\n•\nconsidering macroeconomic conditions including gross domestic product, labor market, and inflation by key regions around the world for negative indicators \n•\nevaluating information from analyst reports in the enterprise software and sleep and breathing health industries, which were compared to industry and market considerations used by the Company \n•\nanalyzing information including changes in the costs of raw materials and labor, the financial performance of the reporting units, the Company’s market capitalization, and other entity and reporting-unit specific events. \n/s/ KPMG LLP\nWe have served as the Company’s auditor since 1994.\nSan Diego, California\nAugust 7, 2025\n-71-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nConsolidated Balance Sheets\nJune 30, 2025 and 2024\n(In US$ and in thousands, except share and per share data)\nJune 30,\n2025\nJune 30,\n2024\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n1,209,450\n \n$\n238,361\n \nAccounts receivable, net of allowances of $\n22,424\n and $\n21,132\n at June 30, 2025 and June 30, 2024, respectively\n939,492\n \n837,275\n \nInventories (note 4)\n927,711\n \n822,250\n \nPrepaid expenses and other current assets (note 4)\n428,952\n \n459,833\n \nTotal current assets\n3,505,605\n \n2,357,719\n \nNon-current assets:\nProperty, plant and equipment, net (note 4)\n550,790\n \n548,025\n \nOperating lease right-of-use assets (note 9)\n167,497\n \n151,121\n \nGoodwill (note 5)\n3,046,680\n \n2,842,055\n \nOther intangible assets, net (note 5)\n464,861\n \n485,904\n \nDeferred income taxes (note 12)\n253,119\n \n203,569\n \nPrepaid taxes and other non-current assets\n185,839\n \n284,001\n \nTotal non-current assets\n4,668,786\n \n4,514,675\n \nTotal assets\n$\n8,174,391\n \n$\n6,872,394\n \nLiabilities and Stockholders’ Equity\nCurrent liabilities:\nAccounts payable\n$\n278,157\n \n$\n237,728\n \nAccrued expenses (note 7)\n402,253\n \n377,678\n \nOperating lease liabilities, current (note 9)\n30,506\n \n25,278\n \nDeferred revenue\n166,030\n \n152,554\n \nIncome taxes payable (note 12)\n132,274\n \n107,517\n \nShort-term debt, net (note 8)\n9,900\n \n9,900\n \nTotal current liabilities\n1,019,120\n \n910,655\n \nNon-current liabilities:\nDeferred revenue\n156,803\n \n137,343\n \nDeferred income taxes (note 12)\n77,682\n \n79,339\n \nOperating lease liabilities, non-current (note 9)\n153,015\n \n141,444\n \nOther long-term liabilities\n141,520\n \n42,257\n \nLong-term debt, net (note 8)\n658,392\n \n697,313\n \nLong-term income taxes payable (note 12)\n—\n \n—\n \nTotal non-current liabilities\n1,187,412\n \n1,097,696\n \nTotal liabilities\n2,206,532\n \n2,008,351\n \nCommitments and contingencies (note 15)\nStockholders’ equity: \nPreferred stock, $\n0.01\n par value, \n2,000,000\n shares authorized; \nnone\n issued\n—\n \n—\n \nCommon stock, $\n0.004\n par value, \n350,000,000\n shares authorized; \n190,311,097\n issued and \n146,385,350\n outstanding at June 30, 2025 and \n189,565,112\n issued and \n146,901,045\n outstanding at June 30, 2024\n761\n \n588\n \nAdditional paid-in capital\n2,033,599\n \n1,896,604\n \nRetained earnings\n6,081,490\n \n4,991,647\n \nTreasury stock, at cost, \n43,925,747\n shares at June 30, 2025 and \n42,664,067\n shares at June 30, 2024\n(\n2,073,292\n)\n(\n1,773,267\n)\nAccumulated other comprehensive loss\n(\n74,699\n)\n(\n251,529\n)\nTotal stockholders’ equity\n5,967,859\n \n4,864,043\n \nTotal liabilities and stockholders’ equity\n$\n8,174,391\n \n$\n6,872,394\n \nSee accompanying notes to consolidated financial statements.\n-72-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nConsolidated Statements of Income\nYears Ended June 30, 2025, 2024 and 2023\n(In US$ and in thousands, except share and per share data)\nJune 30, 2025\nJune 30, 2024\nJune 30, 2023\nNet revenue - Sleep and Breathing Health products\n$\n4,504,890\n \n$\n4,101,172\n \n$\n3,725,017\n \nNet revenue - Residential Care Software\n641,437\n \n584,125\n \n497,976\n \nNet revenue\n5,146,327\n \n4,685,297\n \n4,222,993\n \nCost of sales - Sleep and Breathing Health products\n1,864,198\n \n1,806,845\n \n1,662,957\n \nCost of sales - Residential Care Software\n195,043\n \n190,186\n \n173,978\n \nCost of sales (exclusive of amortization shown separately below)\n2,059,241\n \n1,997,031\n \n1,836,935\n \nAmortization of acquired intangible assets - Sleep and Breathing Health products\n6,646\n \n5,515\n \n5,340\n \nAmortization of acquired intangible assets - Residential Care Software\n25,470\n \n27,448\n \n25,056\n \nAmortization of acquired intangible assets\n32,116\n \n32,963\n \n30,396\n \nTotal cost of sales\n2,091,357\n \n2,029,994\n \n1,867,331\n \nGross profit\n3,054,970\n \n2,655,303\n \n2,355,662\n \nSelling, general, and administrative\n991,019\n \n917,136\n \n874,003\n \nResearch and development \n331,284\n \n307,525\n \n287,642\n \nAmortization of acquired intangible assets\n45,273\n \n46,521\n \n42,020\n \nRestructuring expenses (note 17)\n—\n \n64,228\n \n9,177\n \nAcquisition related expenses\n2,031\n \n—\n \n10,949\n \nTotal operating expenses\n1,369,607\n \n1,335,410\n \n1,223,791\n \nIncome from operations\n1,685,363\n \n1,319,893\n \n1,131,871\n \nOther income (loss), net:\nInterest income (expense), net\n4,114\n \n(\n45,708\n)\n(\n47,379\n)\nGain (loss) attributable to equity method investments (note 6)\n3,644\n \n(\n1,848\n)\n(\n7,265\n)\nGain (loss) on equity investments (note 6)\n(\n10,299\n)\n(\n4,045\n)\n9,922\n \nGain on insurance recoveries\n—\n \n—\n \n20,227\n \nOther, net\n(\n5,256\n)\n(\n3,494\n)\n(\n5,712\n)\nTotal other income (loss), net\n(\n7,797\n)\n(\n55,095\n)\n(\n30,207\n)\nIncome before income taxes\n1,677,566\n \n1,264,798\n \n1,101,664\n \nIncome taxes (note 12)\n276,843\n \n243,847\n \n204,108\n \nNet income\n$\n1,400,723\n \n$\n1,020,951\n \n$\n897,556\n \nBasic earnings per share (note 11)\n$\n9.55\n \n$\n6.94\n \n$\n6.12\n \nDiluted earnings per share (note 11)\n$\n9.51\n \n$\n6.92\n \n$\n6.09\n \nDividend declared per share\n$\n2.12\n \n$\n1.92\n \n$\n1.76\n \nBasic shares outstanding (000's)\n146,716\n \n147,021\n \n146,765\n \nDiluted shares outstanding (000's)\n147,340\n \n147,550\n \n147,455\n \nSee accompanying notes to consolidated financial statements.\n-73-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nConsolidated Statements of Comprehensive Income\nYears Ended June 30, 2025, 2024 and 2023\n(In US$ and in thousands)\nJune 30, 2025\nJune 30, 2024\nJune 30, 2023\nNet income\n$\n1,400,723\n \n$\n1,020,951\n \n$\n897,556\n \nOther comprehensive income (loss):\nUnrealized gains (losses) on designated hedging instruments\n(\n52,573\n)\n31,743\n \n(\n35,596\n)\nForeign currency translation (loss) gain adjustments\n229,403\n \n(\n10,744\n)\n75,815\n \nComprehensive income \n$\n1,577,553\n \n$\n1,041,950\n \n$\n937,775\n \nSee accompanying notes to consolidated financial statements.\n-74-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nConsolidated Statements of Stockholders’ Equity\nYears ended June 30, 2025, 2024 and 2023\n(In US$ and in thousands)\nCommon Stock\nAdditional\nPaid-in\nCapital\nTreasury Stock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive \nIncome (Loss)\nTotal\nShares\nAmount\nShares\nAmount\nBalance, June 30, 2022\n188,247\n \n$\n586\n \n$\n1,682,432\n \n(\n41,836\n)\n$\n(\n1,623,256\n)\n$\n3,613,736\n \n$\n(\n312,747\n)\n$\n3,360,751\n \nCommon stock issued on exercise of options (note 10) \n157\n \n— \n9,696\n \n— \n— \n— \n— \n9,696\n \nCommon stock issued on vesting of restricted stock units, net of shares withheld for tax (note 10) \n277\n \n1\n \n(\n30,632\n)\n— \n— \n— \n— \n(\n30,631\n)\nCommon stock issued on employee stock purchase plan (note 10) \n220\n \n1\n \n39,445\n \n— \n— \n— \n— \n39,446\n \nStock-based compensation costs (note 10) \n— \n— \n71,142\n \n— \n— \n— \n— \n71,142\n \nOther comprehensive loss\n— \n— \n— \n— \n— \n— \n40,219\n \n40,219\n \nNet income\n— \n— \n— \n— \n— \n897,556\n \n— \n897,556\n \nDividends declared ($\n1.76\n per common share)\n— \n— \n— \n— \n— \n(\n258,276\n)\n— \n(\n258,276\n)\nBalance, June 30, 2023\n188,901\n \n$\n588\n \n$\n1,772,083\n \n(\n41,836\n)\n$\n(\n1,623,256\n)\n$\n4,253,016\n \n$\n(\n272,528\n)\n$\n4,129,903\n \nCommon stock issued on exercise of options (note 10) \n166\n \n— \n13,484\n \n— \n— \n— \n— \n13,484\n \nCommon stock issued on vesting of restricted stock units, net of shares withheld for tax (note 10) \n175\n \n1\n \n(\n8,758\n)\n— \n— \n— \n— \n(\n8,757\n)\nCommon stock issued on employee stock purchase plan (note 10) \n323\n \n1\n \n39,609\n \n— \n— \n— \n— \n39,610\n \nTreasury stock purchases\n— \n(\n2\n)\n2\n \n(\n828\n)\n(\n150,011\n)\n— \n— \n(\n150,011\n)\nStock-based compensation costs (note 10) \n— \n— \n80,184\n \n— \n— \n— \n— \n80,184\n \nOther comprehensive income\n— \n— \n— \n— \n— \n— \n20,999\n \n20,999\n \nNet income\n— \n— \n— \n— \n— \n1,020,951\n \n— \n1,020,951\n \nDividends declared ($\n1.92\n per common share)\n— \n— \n— \n— \n— \n(\n282,320\n)\n— \n(\n282,320\n)\nBalance, June 30, 2024\n189,565\n \n$\n588\n \n$\n1,896,604\n \n(\n42,664\n)\n$\n(\n1,773,267\n)\n$\n4,991,647\n \n$\n(\n251,529\n)\n$\n4,864,043\n \nAdjustment to common stock amount\n— \n170\n \n(\n170\n)\n— \n— \n— \n— \n—\n \nCommon stock issued on exercise of options (note 10) \n293\n \n1\n \n30,882\n \n— \n— \n— \n— \n30,883\n \nCommon stock issued on vesting of restricted stock units, net of shares withheld for tax (note 10) \n227\n \n2\n \n(\n18,079\n)\n— \n— \n— \n— \n(\n18,077\n)\nCommon stock issued on employee stock purchase plan (note 10) \n226\n \n—\n \n43,556\n \n— \n— \n— \n— \n43,556\n \nTreasury stock purchases\n— \n—\n \n—\n \n(\n1,262\n)\n(\n300,025\n)\n(\n300,025\n)\nStock-based compensation costs (note 10) \n— \n— \n91,661\n \n— \n— \n— \n— \n91,661\n \nAcquisition of consolidated subsidiary\n— \n— \n(\n10,855\n)\n— \n— \n— \n— \n(\n10,855\n)\nOther comprehensive income\n— \n— \n— \n— \n— \n— \n176,830\n \n176,830\n \nNet income\n— \n— \n— \n— \n— \n1,400,723\n \n— \n1,400,723\n \nDividends declared ($\n2.12\n per common share)\n— \n— \n— \n— \n— \n(\n310,880\n)\n— \n(\n310,880\n)\nBalance, June 30, 2025\n190,311\n \n$\n761\n \n$\n2,033,599\n \n(\n43,926\n)\n$\n(\n2,073,292\n)\n$\n6,081,490\n \n$\n(\n74,699\n)\n$\n5,967,859\n \nSee accompanying notes to consolidated financial statements.\n-75-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\nYears ended June 30, 2025, 2024 and 2023\n(In US$ and in thousands)\nJune 30, 2025\nJune 30, 2024\nJune 30, 2023\nCash flows from operating activities:\nNet income \n$\n1,400,723\n \n$\n1,020,951\n \n$\n897,556\n \nAdjustment to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n198,473\n \n176,870\n \n165,156\n \nAmortization of right-of-use assets\n37,338\n \n39,339\n \n32,406\n \nStock-based compensation costs (note 10)\n91,661\n \n80,184\n \n71,142\n \n(Gain) loss attributable to equity method investments, net of dividends received (note 6)\n(\n3,644\n)\n1,848\n \n10,138\n \n(Gain) loss on equity investments (note 6)\n10,299\n \n4,045\n \n(\n9,922\n)\nRestructuring expenses (note 17)\n—\n \n33,239\n \n9,177\n \nGain on insurance recoveries\n—\n \n—\n \n(\n20,227\n)\nChanges in operating assets and liabilities:\nAccounts receivable\n(\n76,684\n)\n(\n134,278\n)\n(\n106,511\n)\nInventories\n(\n80,165\n)\n172,203\n \n(\n248,833\n)\nPrepaid expenses, net deferred income taxes and other current assets\n82,629\n \n(\n115,213\n)\n(\n138,125\n)\nAccounts payable, accrued expenses and other\n90,958\n \n122,072\n \n31,342\n \nNet cash provided by operating activities\n1,751,588\n \n1,401,260\n \n693,299\n \nCash flows from investing activities:\nPurchases of property, plant and equipment\n(\n89,865\n)\n(\n99,460\n)\n(\n119,672\n)\nPatent registration costs\n(\n10,777\n)\n(\n15,396\n)\n(\n14,328\n)\nBusiness acquisitions, net of cash acquired\n(\n139,248\n)\n(\n133,464\n)\n(\n1,012,749\n)\nPurchases of investments (note 6)\n(\n6,416\n)\n(\n12,765\n)\n(\n32,229\n)\nProceeds from exits of investments (note 6)\n4,628\n \n1,000\n \n3,937\n \nProceeds / (payments) on maturity of foreign currency contracts\n41,633\n \n(\n9,699\n)\n15,196\n \nNet cash used in investing activities\n(\n200,045\n)\n(\n269,784\n)\n(\n1,159,845\n)\nCash flows from financing activities:\nProceeds from issuance of common stock, net\n74,439\n \n53,094\n \n49,142\n \nTaxes paid related to net share settlement of equity awards\n(\n18,077\n)\n(\n8,757\n)\n(\n30,631\n)\nPurchases of treasury stock\n(\n300,025\n)\n(\n150,011\n)\n—\n \nPayments of business combination contingent consideration\n(\n855\n)\n(\n1,293\n)\n(\n2,361\n)\nAcquisition of consolidated subsidiary\n(\n10,855\n)\n—\n \n—\n \nProceeds from borrowings, net of borrowing costs\n—\n \n105,000\n \n1,070,000\n \nRepayment of borrowings\n(\n40,000\n)\n(\n835,000\n)\n(\n405,000\n)\nDividends paid\n(\n310,880\n)\n(\n282,320\n)\n(\n258,276\n)\nNet cash (used in) provided by financing activities\n(\n606,253\n)\n(\n1,119,287\n)\n422,874\n \nEffect of exchange rate changes on cash\n25,799\n \n(\n1,719\n)\n(\n2,147\n)\nNet increase (decrease) in cash and cash equivalents\n971,089\n \n10,470\n \n(\n45,819\n)\nCash and cash equivalents at beginning of period\n238,361\n \n227,891\n \n273,710\n \nCash and cash equivalents at end of period\n$\n1,209,450\n \n$\n238,361\n \n$\n227,891\n \nSupplemental disclosure of cash flow information:\nIncome taxes paid, net of refunds\n$\n214,013\n \n$\n278,400\n \n$\n216,866\n \nInterest paid\n$\n28,415\n \n$\n45,708\n \n$\n47,379\n \nFair value of assets acquired, excluding cash\n$\n43,534\n \n$\n46,033\n \n$\n359,730\n \nLiabilities assumed\n(\n6,279\n)\n(\n7,696\n)\n(\n131,765\n)\nGoodwill on acquisition\n101,323\n \n92,191\n \n786,990\n \nDeferred payments\n670\n \n(\n143\n)\n2,542\n \nFair value of contingent consideration\n855\n \n4,372\n \n(\n2,387\n)\nCash paid for acquisitions\n$\n140,103\n \n$\n134,757\n \n$\n1,015,110\n \nSee accompanying notes to consolidated financial statements.\n-76-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(1) \nOrganization and Basis of Presentation \nResMed Inc. (referred to herein as \"Resmed\", “we”, “us”, “our” or the “Company”) is a Delaware corporation formed in March 1994 as a holding company for the Resmed Group. Through our subsidiaries, we design, manufacture and market equipment for the diagnosis and treatment of sleep-disordered breathing and other respiratory disorders, including obstructive sleep apnea. Our manufacturing operations are located in Australia, Singapore, Malaysia, France, China and the United States, or U.S. Major distribution and sales sites are located in the U.S., Germany, France, the United Kingdom, Switzerland, Australia, Japan, China, Finland, Norway and Sweden. We also operate a software as a service, or SaaS, business in the U.S. and Germany that includes residential care software platforms designed to support the professionals and caregivers who help people stay healthy in the home or care setting of their choice.\n \n(2) \nSummary of Significant Accounting Policies \n(a)\nBasis of Consolidation \nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany transactions and balances have been eliminated in consolidation. The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management estimates and assumptions that affect amounts reported in the consolidated financial statements and accompanying notes. Actual results could differ from management’s estimates. Certain prior period amounts have been reclassified to conform to the current period presentation.\n \n(b)\nRevenue Recognition \nIn accordance with Accounting Standard Codification, or ASC, Topic 606, “Revenue from Contracts with Customers”, we account for a contract with a customer when there is a legally enforceable contract, the rights of the parties are identified, the contract has commercial substance, and collectability of the contract consideration is probable. We have determined that we have \ntwo\n operating segments, which are the sleep and respiratory disorders sector of the medical device industry, or Sleep and Breathing Health, and the supply of business management SaaS to residential care providers, or Residential Care Software. Our Sleep and Breathing Health revenue relates primarily to the sale of our products that are therapy-based equipment. Some contracts include additional performance obligations such as the provision of extended warranties and provision of data for patient monitoring. Our Residential Care Software revenue relates to the provision of software access with ongoing support and maintenance services as well as professional services such as training and consulting.\nDisaggregation of revenue\nSee Note 13 – Segment Information for our net revenue disaggregated by segment, product and region for the years ended June 30, 2025, 2024 and 2023.\nPerformance obligations and contract balances\nRevenue is recognized when performance obligations under the terms of a contract with a customer are satisfied; generally, this occurs with the transfer of risk and/or control of our products at a point in time. For products in our Sleep and Breathing Health business, we transfer control and recognize a sale when products are shipped to the customer in accordance with the contractual shipping terms. For our Residential Care Software business, revenue associated with cloud-hosted services are recognized as they are provided. Unbilled receivables arise when revenue is recognized for goods or services transferred but the customer has not yet been invoiced, typically due to billing terms or timing differences. We defer the recognition of a portion of the consideration received when performance obligations are not yet satisfied. Consideration received from customers in advance of revenue recognition is classified as deferred revenue. Performance obligations resulting in deferred revenue in our Sleep and Breathing Health business relate primarily to extended warranties on our devices and the provision of data for patient monitoring. Performance obligations resulting in deferred revenue in our Residential Care Software business relate primarily to the provision of software access with maintenance and support over an agreed term and material rights associated with future discounts upon renewal of some Residential Care Software contracts. Generally, deferred revenue will be recognized over a period of \none year\n to \nfive years\n. Our contracts do not contain significant financing components.\n \n-77-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe following table summarizes our contract balances as of June 30, 2025 and 2024 (in thousands):\n2025\n2024\nBalance sheet caption\nContract assets\nAccounts receivable, net\n$\n939,492\n \n$\n837,275\n \nAccounts receivable, net\nUnbilled receivables, current\n$\n51,175\n \n$\n38,183\n \nPrepaid expenses and other current assets\nUnbilled receivables, non-current\n$\n14,581\n \n$\n18,450\n \nPrepaid taxes and other non-current assets\nContract liabilities\nDeferred revenue, current\n$\n(\n166,030\n)\n$\n(\n152,554\n)\nDeferred revenue (current liabilities)\nDeferred revenue, non-current\n$\n(\n156,803\n)\n$\n(\n137,343\n)\nDeferred revenue (non-current liabilities)\nTransaction price determination\nRevenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. In our Sleep and Breathing Health segment, the amount of consideration received and revenue recognized varies with changes in marketing incentives (e.g. rebates, discounts, free goods) and returns by our customers and their customers. When we give customers the right to return eligible products and receive credit, returns are estimated based on an analysis of our historical experience. Returns of products, excluding warranty-related returns, have historically been infrequent and insignificant. We adjust the estimate of revenue at the earlier of when the most likely amount of consideration can be estimated, the amount expected to be received changes, or when the consideration becomes fixed.\nWe offer our Sleep and Breathing Health customers cash or product rebates based on volume or sales targets measured over quarterly or annual periods. We estimate rebates based on each customer’s expected achievement of its targets. In accounting for these rebate programs, we reduce revenue ratably as sales occur over the rebate period by the expected value of the rebates to be returned to the customer. Rebates measured over a quarterly period are updated based on actual sales results and, therefore, no estimation is required to determine the reduction to revenue. For rebates measured over annual periods, we update our estimates each quarter based on actual sales results and updated forecasts for the remaining rebate periods. \nWe participate in programs where we issue credits to our Sleep and Breathing Health distributors when they are required to sell our products below negotiated list prices if we have preexisting contracts with the distributors' customers. We reduce revenue for future credits at the time of sale to the distributor, which we estimate based on historical experience using the expected value method. \nWe also offer discounts to both our Sleep and Breathing Health as well as our Residential Care Software customers as part of normal business practice and these are deducted from revenue when the sale occurs.\nWhen Sleep and Breathing Health or Residential Care Software contracts have multiple performance obligations, we generally use an observable price to determine the stand-alone selling price by reference to pricing and discounting practices for the specific product or service when sold separately to similar customers. Revenue is then allocated proportionately, based on the determined stand-alone selling price, to each performance obligation. An allocation is not required for many of our Sleep and Breathing Health contracts that have a single performance obligation, which is the shipment of our therapy-based equipment.\nAccounting and practical expedient elections\nWe have elected to account for shipping and handling activities associated with our Sleep and Breathing Health segment as a fulfillment cost within cost of sales, and record shipping and handling costs collected from customers in net revenue. We have also elected for all taxes assessed by government authorities that are imposed on and concurrent with revenue-producing transactions, such as sales and value added taxes, to be excluded from revenue and presented on a net basis. We have adopted two practical expedients including the “right to invoice” practical expedient, which is relevant for some of our Residential Care Software contracts as it allows us to recognize revenue in the amount of the invoice when it corresponds directly with the value of performance completed to date. The second practical expedient adopted permits \n-78-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nrelief from considering a significant financing component when the payment for the good or service is expected to be one year or less.\n(c)\nConcentration of Credit Risk and Significant Customers\nFinancial instruments that are potentially subject to concentrations of credit risk consist primarily of cash and cash equivalents, marketable securities, derivatives and trade receivables. Our cash and cash equivalents are generally held with large, diverse financial institutions to reduce the amount of exposure to any single financial institution. Our derivative contracts are transacted with various financial institutions with high credit standings and any exposure to counterparty credit-related losses in these contracts is largely mitigated with collateralization and master-netting agreements. The risk with respect to trade receivables is mitigated by credit evaluations we perform on our customers, the short duration of our payment terms for the majority of our customer contracts and by the diversification of our customer base. No single customer accounted for 10% or more of our total revenues for any of the periods presented.\n(d)\n \nFair Value of Financial Instruments\nThe fair value of financial instruments is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. We measure our financial instruments at fair value at each reporting period using a fair value hierarchy that requires that we maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. A financial instrument’s classification within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. Three levels of inputs may be used to measure fair value:\nLevel 1 - Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2 - Other inputs that are directly or indirectly observable in the marketplace.\nLevel 3 - Unobservable inputs that are supported by little or no market activity.\nThe carrying value of cash equivalents, accounts receivable and accounts payable, approximate their fair value because of their short-term nature. The carrying value of long-term debt related to our Revolving Credit and Term Credit Agreements approximates its fair value as the principal amounts outstanding are subject to variable interest rates that are based on market rates which are regularly reset. The carrying value of long-term debt related to our Senior Notes can differ to its fair value as the principal amounts outstanding are subject to fixed interest rates as outlined in Note 8 – Debt. Foreign currency hedging instruments are marked to market and therefore reflect their fair value. In addition, we measure investments in publicly held equity securities and privately held equity securities for which there has been an observable price change in an identical or similar security, at fair value. We do not hold or issue financial instruments for trading purposes.\n \n(e)\nCash and Cash Equivalents \nCash equivalents include money market funds, certificates of deposit and other highly liquid investments and we state them at cost, which approximates market. We consider investments with original maturities of 90 days or less to be cash equivalents for purposes of the consolidated statements of cash flows.\nOur cash and cash equivalents balance at June 30, 2025 includes $\n302.7\n million in institutional money market accounts that require advance notice of up to 90 days for redemption, in accordance with the terms of the investment agreements. These cash balances earn interest rates above normal term deposit rates otherwise available and are held at highly rated financial institutions.\n(f)\nInventories \nWe state inventories at the lower of cost (determined principally by the first-in, first-out method) or net realizable value. We include material, labor and manufacturing overhead costs in finished goods and work-in-process inventories. We review and provide for any product obsolescence in our manufacturing and distribution operations by assessing throughout the year individual products and components (based on estimated future usage and sales).\n-79-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(g)\nProperty, Plant and Equipment \nWe record property, plant and equipment, including rental and demonstration equipment at cost. We compute depreciation expense using the straight-line method over the estimated useful lives of the assets. Useful lives are generally \ntwo years\n to \nten years\n except for buildings which are depreciated over an estimated useful life of \nforty years\n and leasehold improvements, which we amortize over the shorter of the useful life or the lease term. We charge maintenance and repairs to expense as we incur them.\nDepreciation expense for property, plant, and equipment was $\n111.8\n million, $\n88.9\n million, and $\n84.7\n million for the years ended June 30, 2025, 2024 and 2023, respectively.\n(h)\nIntangible Assets \nWe capitalize the registration costs for new patents and amortize the costs over the estimated useful life of the patent, which is generally \nten years\n. If a patent is superseded or a product is retired, any unamortized costs are written off immediately.\nWe amortize our other intangible assets on a straight-line basis over their estimated useful lives, which range from \ntwo years\n to \nfifteen years\n. We evaluate events or circumstances that warrant revised estimates of useful lives or that indicate that impairment exists and, at least annually, evaluate the recoverability of intangible assets.\n \n(i)\nGoodwill \nWe conduct our annual review for goodwill impairment during the final quarter of the fiscal year. Our goodwill impairment review is performed at our reporting unit level, which is one level below our operating segments and involves the following steps: \nStep 0 or Qualitative assessment – Evaluate qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. The factors we consider include, but are not limited to, macroeconomic conditions, industry and market considerations, cost factors, overall financial performance or events-specific to that reporting unit. If or when we determine it is more likely than not that the fair value of a reporting unit is less than the carrying amount, including goodwill, we would move to Step 1 of the quantitative method.\nStep 1 – Compare the fair value for each reporting unit to its carrying value, including goodwill. Fair value is determined based on estimated discounted cash flows. A goodwill impairment charge is recognized for the amount that the carrying amount of a reporting unit, including goodwill, exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit. If a reporting unit’s fair value exceeds the carrying value, no further work is performed and no impairment charge is necessary.\nDuring the annual reviews for the years ended June 30, 2025, 2024 and 2023, we completed a Step 0 or Qualitative assessment and determined it was more likely than not that the fair value of our reporting units exceeded their carrying amounts, including goodwill, and therefore goodwill was not impaired.\n(j)\nBusiness Combinations\nWe allocate the purchase price to the estimated fair values of the assets acquired and liabilities assumed. This allocation process involves the use of estimates and assumptions made in connection with determining the fair value of assets acquired and liabilities assumed including cash flows expected to be derived from the use of the asset, the timing of such cash flows, the remaining useful life of assets and applicable discount rates. \nIf actual results vary from the estimates or assumptions used in the valuation or allocation process, we may be required to record an impairment charge or an increase in depreciation or amortization in future periods, or both.\n-80-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(k)\nEquity Investments\nWe have equity investments in privately and publicly held companies that are unconsolidated entities. The following discusses our accounting for investments in marketable equity securities, non-marketable equity securities, and investments accounted for under the equity method.\nOur marketable equity securities are publicly traded stocks measured at fair value and classified within Level 1 in the fair value hierarchy because we use quoted prices for identical assets in active markets. Marketable equity securities are recorded in prepaid expenses and other current assets on the consolidated balance sheets.\nNon-marketable equity securities consist of investments in privately held companies without readily determinable fair values and are recorded in prepaid taxes and other non-current assets on the consolidated balance sheets. Non-marketable equity securities are reported at cost, minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or similar investment of the same issuer. We assess non-marketable equity securities at least quarterly for impairment and consider qualitative and quantitative factors including the investee's financial metrics, product and commercial outlook and cash usage. All gains and losses on marketable and non-marketable equity securities, realized and unrealized, are recognized in gain (loss) on equity investments as a component of other income (loss), net on the consolidated statements of income.\nEquity investments whereby we have significant influence but not control over the investee and are not the primary beneficiary of the investee’s activities, are accounted for under the equity method. Under this method, we record our share of gains or losses attributable to equity method investments as a component of other income (loss), net on the consolidated statements of income.\n \n(l)\nResearch and Development \nWe record all research and development expenses in the period we incur them.\n(m)\nForeign Currency \nThe consolidated financial statements of our non-U.S. subsidiaries, whose functional currencies are other than the U.S. dollar, are translated into U.S. dollars for financial reporting purposes. We translate assets and liabilities of non-U.S. subsidiaries whose functional currencies are other than the U.S. dollar at period end exchange rates but translate revenue and expense transactions at average exchange rates for the period. We recognize cumulative translation adjustments as part of comprehensive income, as detailed in the consolidated statements of comprehensive income, and include those adjustments in accumulated other comprehensive income in the consolidated balance sheets until such time the relevant subsidiary is sold or substantially or completely liquidated. We reflect gains and losses on transactions denominated in other than the functional currency of an entity in our results of operations.\n(n)\nForeign Exchange Risk Management \nWe may use derivative financial instruments, specifically foreign cross-currency swaps, purchased foreign currency call options, collars and forward contracts to mitigate exposure from certain foreign currency risk. No derivatives are used for trading or speculative purposes. We do not require or are not required to pledge collateral for the derivative instruments.\nFair Value and Net Investment Hedging\nOn November 17, 2022, we executed foreign cross-currency swaps as net investment hedges and fair value hedges in designated hedging relationships with either the foreign denominated net asset balances or the foreign denominated intercompany loan as the hedged items. All derivatives are recorded at fair value as either an asset or liability. Cash flows associated with derivative instruments are presented in the same category on the consolidated statements of cash flows as the hedged item.\nThe purpose of the cross-currency swaps for the fair value hedge is to mitigate foreign currency risk associated with changes in spot rates on foreign denominated intercompany debt between USD and EUR. For these hedges, we excluded certain components from the assessment of hedge effectiveness that are not related to spot rates. For fair value hedges that qualify and are designated for hedge accounting, the change in fair value of the derivative is recorded in the same line item \n-81-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nas the hedged item, other, net, in the consolidated statement of income. The initial fair value of hedge components excluded from the assessment of effectiveness is recognized in the statement of income under a systematic and rational method over the life of the hedging instrument and is presented in interest (expense) income, net. Any difference between the change in the fair value of the hedge components excluded from the assessment of effectiveness and the amounts recognized in earnings is recorded as a component of other comprehensive income. \nThe purpose of the cross-currency swaps for the net investment hedge is to mitigate foreign currency risk associated with changes in spot rates on the net asset balances of our foreign functional subsidiaries. For net investment hedges that qualify and are designated for hedge accounting, the change in fair value of the derivative is recorded in cumulative translation adjustment within other comprehensive loss and reclassified into earnings when the hedged net investment is either sold or substantially liquidated. The initial fair value of components excluded from the assessment of hedge effectiveness will be recognized in interest (expense) income, net. \nThe notional value of outstanding foreign cross-currency swaps was $\n1,128.3\n million and $\n1,026.2\n million at June 30, 2025 and June 30, 2024, respectively. These contracts mature at various dates prior to December 31, 2029.\nNon-Designated Hedges\nWe transact business in various foreign currencies, including a number of major European currencies as well as the Australian and Singapore dollars. We have foreign currency exposure through both our Australian and Singapore manufacturing activities, and international sales operations. We have established a foreign currency hedging program using purchased foreign currency call options, collars and forward contracts to hedge foreign-currency-denominated financial assets, liabilities and manufacturing cash flows. The terms of such foreign currency hedging contracts generally do not exceed \ntwo years\n. The purpose of this hedging program is to economically manage the financial impact of foreign currency exposures denominated mainly in Euros, and Australian and Singapore dollars. Under this program, increases or decreases in our foreign currency denominated financial assets, liabilities, and firm commitments are partially offset by gains and losses on the hedging instruments. We do not designate these foreign currency contracts as hedges. All movements in the fair value of the foreign currency instruments are recorded within other, net in our consolidated statements of income. \nThe notional value of the outstanding non-designated hedges was $\n1,410.2\n million and $\n1,340.0\n million at June 30, 2025 and June 30, 2024, respectively. These contracts mature at various dates prior to June 15, 2026.\nWe classified the fair values of all hedging instruments as Level 2 measurements within the fair value hierarchy.\n \nWe are exposed to credit-related losses in the event of non-performance by counter parties to financial instruments. We minimize counterparty credit risk by entering into derivative transactions with major financial institutions and we do not expect material losses as a result of default by our counterparties.\n(o)\nIncome Taxes\nWe account for income taxes under the asset and liability method. We recognize deferred tax assets and liabilities for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. We measure deferred tax assets and liabilities using the enacted tax rates we expect to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. \nWe recognize the impact of a tax position in the consolidated financial statements only if that position is more likely than not of being sustained upon examination by taxing authorities, based on the technical merits of the position. Any interest and penalties related to uncertain tax positions are reflected in income tax expense.\n(p)\nAllowance for Credit Losses\nWe maintain an allowance for credit losses on customer receivables based expected losses, considering our historical write-off experience, an assessment of our customers’ financial conditions, and available information that is relevant to assessing the collectability of cash flows, which includes current conditions and forecasts about future economic conditions. Customer receivables are charged against the allowance when they are deemed uncollectible. \n-82-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nWe are also contingently liable, within certain limits, in the event of a customer default, to independent financing companies in connection with customer financing programs. We monitor the collection status of these installment receivables and provide for estimated losses separately under accrued expenses within our consolidated balance sheets based upon our historical collection experience with such receivables and a current assessment of our credit exposure.\n(q)\nImpairment of Long-Lived Assets \nWe periodically evaluate the carrying value of long-lived assets to be held and used, including certain identifiable intangible assets, when events and circumstances indicate that the carrying amount of an asset may not be recovered. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future net cash flows expected to be generated by the asset. If assets are considered to be impaired, we recognize as the impairment the amount by which the carrying amount of the assets exceeds the fair value of the assets. We report assets to be disposed of at the lower of the carrying amount or fair value less costs to sell. \nDuring the year ended June 30, 2024, we impaired $\n18.6\n million of developed/core product technology intangible assets, $\n14.5\n million of customer relationship intangible assets, and $\n0.1\n million of other intangibles associated with restructuring activities. These non-cash charges were recorded within \nrestructuring expenses\n in the consolidated statements of income. Refer to Note 17 – Restructuring Expenses for the facts and circumstances leading to the impairments. We did not record any material intangible asset impairments during the years ended June 30, 2025 and 2023.\n(r)\nContingencies\nWe record a liability in the consolidated financial statements for loss contingencies when a loss is known or considered probable and the amount can be reasonably estimated. If the reasonable estimate of a known or probable loss is a range, and no amount within the range is a better estimate than any other, the minimum amount of the range is accrued. If a loss is reasonably possible but not known or probable, and can be reasonably estimated, the estimated loss or range of loss is disclosed. When determining the estimated loss or range of loss, significant judgment is required to estimate the amount and timing of a loss to be recorded.\n \n(3) \nNew Accounting Pronouncements \n(a)\nRecently issued accounting standards not yet adopted \nASU 2023-09 Income Taxes (Topic 740): Improvements to Income Tax Disclosures\nIn December 2023, the FASB issued ASU No. 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures,\" which updates income tax disclosure requirements primarily by requiring specific categories and greater disaggregation within the rate reconciliation and disaggregation of income taxes paid. This ASU is applicable to our Annual Report on Form 10-K for the fiscal year ended June 30, 2026, with early application permitted. We are currently evaluating the impact of adopting this ASU on our consolidated financial statements and disclosures. \nASU 2024-03 Income Statement – Reporting Comprehensive Income – Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\nIn November 2024, the FASB issued ASU No. 2024-03, \"Income Statement – Reporting Comprehensive Income – Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses,\" which requires disclosure in the notes to the financial statements of specified information about certain costs and expenses, including amounts of purchases of inventory, employee compensation, depreciation, and intangible asset amortization included in each relevant expense caption, as well as a qualitative description of amounts remaining in relevant expense captions that are not separately disaggregated quantitatively. ASU No. 2024-03 also requires disclosure of the total amount of selling expenses and, in annual periods, an entity's definition of selling expenses. This ASU is applicable to our Annual Report on Form 10-K for the fiscal year ended June 30, 2028, and subsequent interim periods. Early adoption is permitted and the amendments may be either applied prospectively to financial statements issued for reporting periods after the effective date of the amendment or retrospectively to all prior periods presented. We are currently evaluating the impact of adopting this ASU on our consolidated financial statements and disclosures\n.\n-83-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(b) Recently adopted accounting standards\nASU No. 2023-07 Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\nIn November 2023, the Financial Accounting Standards Board (FASB) issued ASU No. 2023-07, \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures,\" which expands segment disclosures to include significant segment expenses that are regularly provided to the chief operating decision maker and included within each reported measure of segment profit or loss, an amount and description of its composition for other segment items, and interim disclosures of a reportable segment’s profit or loss and assets. We adopted ASU No. 2023-07 during the fiscal year ended June 30, 2025. The amendment was applied retrospectively. See Note 13 – Segment Information for disclosure within the notes to the consolidated financial statements.\n \n(4) \nSupplemental Balance Sheet Information\nComponents of selected captions in the consolidated balance sheets consisted of the following as of June 30, 2025 and June 30, 2024 (in thousands): \nInventories\n2025\n2024\nRaw materials\n$\n367,284\n \n$\n355,570\n \nWork in progress\n2,550\n \n2,713\n \nFinished goods\n557,877\n \n463,967\n \nTotal inventories\n$\n927,711\n \n$\n822,250\n \nPrepaid expenses and other current assets\n2025\n2024\nPrepaid taxes\n$\n165,034\n \n$\n107,623\n \nPrepaid inventories\n48,245\n \n172,198\n \nUnbilled receivables, current\n51,175\n \n38,183\n \nOther prepaid expenses and current assets\n164,498\n \n141,829\n \nTotal prepaid expenses and other current assets\n$\n428,952\n \n$\n459,833\n \nProperty, plant and equipment\n2025\n2024\nMachinery and equipment\n$\n441,906\n \n$\n479,941\n \nComputer equipment and software\n201,437\n \n200,128\n \nFurniture and fixtures\n64,062\n \n61,969\n \nVehicles and aircraft\n21,209\n \n20,450\n \nClinical, demonstration and rental equipment\n121,125\n \n127,358\n \nLeasehold improvements\n124,046\n \n102,104\n \nLand\n51,682\n \n51,977\n \nBuildings\n230,631\n \n231,065\n \nProperty, plant and equipment, at cost\n$\n1,256,098\n \n$\n1,274,992\n \nAccumulated depreciation and amortization\n(\n705,308\n)\n(\n726,967\n)\nProperty, plant and equipment, net\n$\n550,790\n \n$\n548,025\n \n-84-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(5) \nGoodwill and Other Intangible Assets, net\nGoodwill\nFor each of the years ended June 30, 2025 and June 30, 2024, we have not recorded any goodwill impairments. \nChanges in the carrying amount of goodwill is comprised of the following for the year ended June 30, 2025 (in thousands): \n2025\nSleep and Breathing Health\nResidential Care Software\nTotal\nBalance at the beginning of the period\n$\n757,529\n \n$\n2,084,526\n \n$\n2,842,055\n \nBusiness acquisitions\n101,323\n \n—\n \n101,323\n \nAdjustment to fair values of preliminary purchase price allocations\n(\n185\n)\n—\n \n(\n185\n)\nForeign currency translation adjustments\n24,911\n \n78,576\n \n103,487\n \nBalance at the end of the period\n$\n883,578\n \n$\n2,163,102\n \n$\n3,046,680\n \nOther Intangible Assets\nOther intangibles, net are comprised of the following as of June 30, 2025 and June 30, 2024 (in thousands): \n2025\n2024\nDeveloped/core product technology\n$\n396,242\n \n$\n384,679\n \nAccumulated amortization\n(\n315,032\n)\n(\n280,970\n)\nDeveloped/core product technology, net\n81,210\n \n103,709\n \nCustomer relationships\n475,541\n \n432,470\n \nAccumulated amortization\n(\n189,050\n)\n(\n150,486\n)\nCustomer relationships, net\n286,491\n \n281,984\n \nOther intangibles\n267,499\n \n252,210\n \nAccumulated amortization\n(\n170,339\n)\n(\n151,999\n)\nOther intangibles, net\n97,160\n \n100,211\n \nTotal other intangibles, net\n$\n464,861\n \n$\n485,904\n \nIntangible assets consist of developed/core product technology, trade names, non-compete agreements, customer relationships, and patents, and we amortize them over the estimated useful life of the assets, generally between \ntwo years\n and \nfifteen years\n. There are no expected residual values related to these intangible assets. \nAmortization expense related to identified intangible assets for the years ended June 30, 2025 and June 30, 2024 was $\n77.4\n million and $\n79.5\n million, respectively. Amortization expense related to patents, included in other intangibles, for the years ended June 30, 2025 and June 30, 2024 was $\n8.2\n million and $\n7.6\n million, respectively. \nTotal estimated annual amortization expense for the years ending June 30, 2026 through June 30, 2030, is shown below (in thousands): \nFiscal Years Ending June 30\n2026\n2027\n2028\n2029\n2030\nEstimated amortization expense\n$\n84,859\n \n$\n65,853\n \n$\n57,248\n \n$\n50,983\n \n$\n45,795\n \n(6) \nInvestments\nEquity investments by measurement category as of June 30, 2025 and June 30, 2024 were as follows (in thousands):\nMeasurement category\n2025\n2024\nFair value\n$\n13,080\n \n$\n12,026\n \nMeasurement alternative\n63,642\n \n73,739\n \nEquity method\n76,178\n \n65,462\n \nTotal\n$\n152,900\n \n$\n151,227\n \n-85-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe following table shows a reconciliation of the changes in our equity investments for the year ended June 30, 2025 (in thousands):\nNon-marketable securities\nMarketable securities\nEquity method investments\nTotal\nBalance at the beginning of the period\n$\n73,739\n \n$\n12,026\n \n$\n65,462\n \n$\n151,227\n \nAdditions to investments\n5,778\n \n—\n \n638\n \n6,416\n \nImpairment of investments\n(\n11,742\n)\n—\n \n—\n \n(\n11,742\n)\nRealized gains on marketable and non-marketable equity securities\n389\n \n—\n \n—\n \n389\n \nProceeds from exits of investments\n(\n4,628\n)\n—\n \n—\n \n(\n4,628\n)\nUnrealized gains on marketable equity securities\n—\n \n1,054\n \n—\n \n1,054\n \nGain attributable to equity method investments\n—\n \n—\n \n3,644\n \n3,644\n \nForeign currency translation adjustments\n106\n \n—\n \n6,434\n \n6,540\n \nCarrying value at the end of the period\n$\n63,642\n \n$\n13,080\n \n$\n76,178\n \n$\n152,900\n \nThe following table shows a reconciliation of the changes in our equity investments for the year ended June 30, 2024 (in thousands):\nNon-marketable securities\nMarketable securities\nEquity method investments\nTotal\nBalance at the beginning of the period\n$\n68,748\n \n$\n12,423\n \n$\n65,366\n \n$\n146,537\n \nAdditions to investments\n8,640\n \n1,000\n \n3,125\n \n12,765\n \nObservable price adjustments on non-marketable equity securities\n2,315\n \n—\n \n—\n \n2,315\n \nImpairment of investments\n(\n4,963\n)\n—\n \n—\n \n(\n4,963\n)\nProceeds from exits of investments\n(\n1,000\n)\n—\n \n—\n \n(\n1,000\n)\nUnrealized losses on marketable equity securities\n—\n \n(\n1,397\n)\n—\n \n(\n1,397\n)\nLoss attributable to equity method investments\n—\n \n—\n \n(\n1,848\n)\n(\n1,848\n)\nForeign currency translation adjustments\n(\n1\n)\n—\n \n(\n1,181\n)\n(\n1,182\n)\nCarrying value at the end of the period\n$\n73,739\n \n$\n12,026\n \n$\n65,462\n \n$\n151,227\n \nNet unrealized gains and losses recognized in the years ended June 30, 2025, 2024 and 2023 for equity investments in non-marketable and marketable securities still held as of those respective dates were a loss of $\n10.7\n million, a loss of $\n4.0\n million, and a gain of $\n6.0\n million, respectively.\n \n(7) \nAccrued Expenses \nAccrued expenses at June 30, 2025 and June 30, 2024 consist of the following (in thousands): \n2025\n2024\nProduct warranties\n$\n37,230\n \n$\n35,134\n \nConsulting and professional fees\n40,297\n \n27,143\n \nValue added taxes and other taxes due\n35,584\n \n27,016\n \nEmployee related costs\n235,450\n \n223,862\n \nPromotional and marketing\n9,391\n \n6,023\n \nForeign currency hedging instruments\n2,695\n \n4,654\n \nAccrued interest\n8,642\n \n9,206\n \nLogistics and occupancy costs\n13,982\n \n17,996\n \nInventory in transit\n6,063\n \n8,045\n \nOther\n12,919\n \n18,599\n \nTotal accrued expenses\n$\n402,253\n \n$\n377,678\n \n-86-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(8) \nDebt \nDebt at June 30, 2025 and June 30, 2024 consists of the following (in thousands): \n2025\n2024\nShort-term debt\n$\n10,000\n \n$\n10,000\n \nDeferred borrowing costs\n(\n100\n)\n(\n100\n)\nShort-term debt, net\n$\n9,900\n \n$\n9,900\n \nLong-term debt\n$\n660,000\n \n$\n700,000\n \nDeferred borrowing costs\n(\n1,608\n)\n(\n2,687\n)\nLong-term debt, net\n$\n658,392\n \n$\n697,313\n \nTotal debt\n$\n668,292\n \n$\n707,213\n \nCredit Facility\nOn June 29, 2022, we entered into a second amended and restated credit agreement, or the Revolving Credit Agreement, as borrower, with lenders MUFG Union Bank, N.A., as administrative agent, joint lead arranger, sole book runner, swing line lender and letter of credit issuer, Westpac Banking Corporation, as syndication agent and joint lead arranger, HSBC Bank USA, National Association, as syndication agent and joint lead arranger, and Wells Fargo Bank, National Association, as documentation agent. The Revolving Credit Agreement, among other things, provided a senior unsecured revolving credit facility of $\n1,500.0\n million, with an uncommitted option to increase the revolving credit facility by an additional amount equal to the greater of $\n1,000.0\n million or \n1.0\n times the EBITDA (as defined in the Revolving Credit Agreement) for the trailing twelve-month measurement period. The Revolving Credit Agreement amends and restates that certain Amended and Restated Credit Agreement, dated as of April 17, 2018, among Resmed, MUFG Union Bank, N.A., Westpac Banking Corporation and the lenders party thereto.\nAdditionally, on June 29, 2022, ResMed Pty Limited entered into a Second Amendment to the Syndicated Facility Agreement and First Amendment to Unconditional Guaranty Agreement, or the Term Credit Agreement, as borrower, with lenders MUFG Union Bank, N.A., as administrative agent, joint lead arranger and joint book runner, and Westpac Banking Corporation, as syndication agent, joint lead arranger and joint book runner, which amends that certain Syndicated Facility Agreement dated as of April 17, 2018. The Term Credit Agreement, among other things, provides ResMed Pty Limited a senior unsecured term credit facility of $\n200.0\n million. \nOur obligations under the Revolving Credit Agreement are guaranteed by certain of our direct and indirect U.S. subsidiaries, and ResMed Pty Limited’s obligations under the Term Credit Agreement are guaranteed by us and certain of our direct and indirect U.S. subsidiaries. The Revolving Credit Agreement and Term Credit Agreement contain customary covenants, including, in each case, a financial covenant that requires that we maintain a maximum leverage ratio of funded debt to EBITDA (as defined in the Revolving Credit Agreement and Term Credit Agreement, as applicable). The entire principal amounts of the revolving credit facility and term credit facility, and, in each case, any accrued but unpaid interest may be declared immediately due and payable if an event of default occurs, as defined in the Revolving Credit Agreement and the Term Credit Agreement, as applicable. Events of default under the Revolving Credit Agreement and the Term Credit Agreement include, in each case, failure to make payments when due, the occurrence of a default in the performance of any covenants in the respective agreements or related documents, or certain changes of control of us, or the respective guarantors of the obligations borrowed under the Revolving Credit Agreement and Term Credit Agreement. \nThe Revolving Credit Agreement and Term Credit Agreement each terminate on June 29, 2027, when all unpaid principal and interest under the loans must be repaid. Amounts borrowed under the Term Credit Agreement will also amortize on a semi-annual basis, with a $\n5.0\n million principal payment required on each such semi-annual amortization date. The outstanding principal amounts will bear interest at a rate equal to the Adjusted Term SOFR (as defined in the Revolving Credit Agreement) plus \n0.75\n% to \n1.50\n% (depending on the then-applicable leverage ratio) or the Base Rate (as defined in the Revolving Credit Agreement and the Term Credit Agreement, as applicable) plus \n0.0\n% to \n0.50\n% (depending on the then-applicable leverage ratio). At June 30, 2025, the interest rate that was being charged on the outstanding principal amounts was \n5.15\n%. An applicable commitment fee of \n0.075\n% to \n0.150\n% (depending on the then-applicable leverage \n-87-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nratio) applies on the unused portion of the revolving credit facility. As of June 30, 2025, we had $\n1,500.0\n million available for draw down under the revolving credit facility.\nWe are required to disclose the fair value of financial instruments for which it is practicable to estimate the value, even though these instruments are not recognized at fair value in the consolidated balance sheets. As the Revolving Credit and Term Credit Agreements’ interest rate is calculated as Adjusted Term SOFR plus the spreads described above, its carrying amount is equivalent to its fair value as at June 30, 2025 and June 30, 2024, which was $\n170.0\n million and $\n210.0\n million, respectively. \nSenior Notes\nOn July 10, 2019, we entered into a Note Purchase Agreement with the purchasers to that agreement, in connection with the issuance and sale of $\n250.0\n million principal amount of our \n3.24\n% senior notes due July 10, 2026, and $\n250.0\n million principal amount of our \n3.45\n% senior notes due July 10, 2029, collectively referred to as the Senior Notes. Our obligations under the Note Purchase Agreement and the Senior Notes are unconditionally and irrevocably guaranteed by certain of our direct and indirect U.S. subsidiaries. The net proceeds from this transaction were used to pay down borrowings on our Revolving Credit Agreement.\nUnder the terms of the Note Purchase Agreement, we agreed to customary covenants including with respect to our corporate existence, transactions with affiliates, and mergers and other extraordinary transactions. We also agreed that, subject to limited exceptions, we will maintain a ratio of consolidated funded debt to consolidated EBITDA (as defined in the Note Purchase Agreement) of no more than \n3.50\n to 1.00 as of the last day of any fiscal quarter, and will not at any time permit the amount of all priority secured and unsecured debt of us and our subsidiaries to exceed \n10.0\n% of our consolidated tangible assets, determined as of the end of our most recently ended fiscal quarter. This ratio is calculated at the end of each reporting period for which the Note Purchase Agreement requires us to deliver financial statements, using the results of the 12 consecutive month period ending with such reporting period.\nWe are required to disclose the fair value of financial instruments for which it is practicable to estimate the value, even though these instruments are not recognized at fair value in the consolidated balance sheets. As of June 30, 2025 and June 30, 2024, the Senior Notes had a carrying amount of $\n500.0\n million, excluding deferred borrowing costs, and an estimated fair value of $\n479.5\n million and $\n463.0\n million, respectively. Quoted market prices in active markets for identical liabilities based inputs (Level 2) were used to estimate fair value.\nAt June 30, 2025, we were in compliance with our debt covenants and there was $\n670.0\n million outstanding under the Revolving Credit Agreement, Term Credit Agreement and Senior Notes.\n \n(9) \nLeases\n(a)\nLeases where Resmed is the Lessee\nWe determine whether a contract is, or contains, a lease at inception. Right of use, or ROU, assets represent our right to use an underlying asset during the lease term, and lease liabilities represent our obligation to make lease payments arising from the lease. ROU assets and lease liabilities are recognized at lease commencement based upon the estimated present value of unpaid lease payments over the lease term. We use our incremental borrowing rate based on the information available at lease commencement in determining the present value of unpaid lease payments. ROU assets also include any lease payments made at or before lease commencement and any initial direct costs incurred and exclude any lease incentives received.\nWe determine the lease term as the non-cancellable period of the lease and may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Leases with a term of 12 months or less are not recognized on the balance sheet. Some of our leases include variable lease payments that are based on costs incurred or actual usage or adjusted periodically based on an index or a rate. Our leases do not contain any residual value guarantees and we do not account for lease and non-lease components as a single lease component. Operating leases are included in operating lease right-of-use assets and operating lease liabilities on our consolidated balance sheets. We lease certain office space, warehouses and distribution centers, manufacturing facilities, vehicles, and equipment with remaining lease terms ranging from less than \n1\n year to \n17\n years, some of which include options to extend or terminate the leases.\n-88-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nOperating lease costs for the years ended June 30, 2025, 2024 and 2023 were $\n39.0\n million, $\n40.8\n million and $\n33.6\n million, respectively. Short-term and variable lease costs were not material for the years ended June 30, 2025, 2024 and 2023. \nFuture lease payments under non-cancellable operating leases as of June 30, 2025 are as follows (in thousands):\nTotal\n2026\n2027\n2028\n2029\n2030\nThereafter\nMinimum lease payments\n$\n216,318\n \n$\n36,501\n \n$\n30,216\n \n$\n24,367\n \n$\n22,566\n \n$\n19,056\n \n$\n83,612\n \nLess: imputed interest\n(\n32,797\n)\nTotal lease liabilities\n$\n183,521\n \nAs of June 30, 2025, future operating lease commitments for leases that have not yet commenced were not material. \nThe supplemental information related to operating leases for the years ended June 30, 2025 and June 30, 2024 was as follows (in thousands):\n2025\n2024\nWeighted-average inputs:\nWeighted-average remaining lease term (years)\n8.3\n8.7\nWeighted-average discount rate\n3.7\n \n%\n3.5\n \n%\nCash flow information:\nOperating cash flows paid for amounts included in the measurement of lease liabilities\n$\n35,732\n \n$\n30,573\n \nRight of use assets obtained in exchange for new lease liabilities:\n$\n33,638\n \n$\n54,588\n \n(b)\nLeases where Resmed is the Lessor\nWe lease sleep and respiratory medical devices to customers primarily to comply with local health insurer requirements in certain foreign geographies. Device rental contracts are classified as operating leases, and contract terms vary by customer and include options to terminate or extend the contract. When lease contracts also include the sale of masks and accessories, we allocate contract consideration to those items on a relative standalone price basis and recognize revenue when control transfers to the customer. Operating lease revenue was $\n98.8\n million, $\n92.9\n million and $\n88.6\n million for the years ended June 30, 2025, 2024 and 2023, respectively.\n(10) \nStockholders’ Equity \nCommon Stock.\n On February 21, 2014, our board of directors approved a new share repurchase program, authorizing us to acquire up to an aggregate of \n20.0\n million shares of our common stock. The program allows us to repurchase shares of our common stock from time to time for cash in the open market, or in negotiated or block transactions, as market and business conditions warrant and subject to applicable legal requirements. The \n20.0\n million shares the program authorizes us to purchase are in addition to the shares we repurchased on or before February 21, 2014 under our previous programs. There is no expiration date for this program, and the program may be accelerated, suspended, delayed or discontinued at any time at the discretion of our board of directors. All share repurchases since February 21, 2014 have been executed in accordance with this program. \nDuring fiscal year 2025, we repurchased approximately \n1,262,000\n shares at a cost of $\n300.0\n million. During fiscal year 2024, we repurchased \n828,000\n shares at a cost of $\n150.0\n million. As of June 30, 2025, we have repurchased a total of \n43.9\n million shares at a cost of $\n2.1\n billion. Shares that are repurchased are classified as “treasury stock pending future use” and reduce the number of shares outstanding used in calculating earnings per share. At June 30, 2025, \n10.8\n million additional shares can be repurchased under the approved share repurchase program.\nPreferred Stock.\n In April 1997, our board of directors authorized \n2.0\n million shares of \n0.01\n par value preferred stock. \nNo\n such shares were issued or outstanding at June 30, 2025. \n-89-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nStock Options and Restricted Stock Units.\n We have granted stock options, restricted stock units, or RSUs, and performance restricted stock units, or PRSUs, to personnel, including officers and directors, in accordance with the ResMed Inc. 2009 Incentive Award Plan, as amended and restated, or the 2009 Plan. Options and restricted stock units vest over \none year\n to \nfour years\n and the options have expiration dates of \nseven years\n from the date of grant. We have granted the options with an exercise price equal to the market value as determined at the date of grant. We have granted PRSUs that are subject to market conditions, with the ultimate realizable number of PRSUs dependent on both absolute and relative total stockholder return over a period of \nthree years\n. The maximum amounts to be issued under the awards range from \n200\n% to \n225\n% of the original grant. We have also granted PRSUs that are subject to a performance condition based on meeting threshold levels of profitability measured by our actual adjusted earnings compared to board approved targeted levels of earnings.\nAt the annual meeting of our stockholders in November 2017, our stockholders approved an amendment and restatement to the 2009 Plan to increase the number of shares of common stock that may be issued or transferred pursuant to awards under the 2009 Plan by \n7.4\n million. The amendment and restatement imposes a maximum award amount which may be granted under the 2009 Plan to a non-employee director in a calendar year, which when taken together with any other cash fees earned for services as a non-employee director during the calendar year, has a total value of $\n0.7\n million, or $\n1.2\n million in the case of a non-employee director who is also serving as chairman of our board of directors. The amendment and restatement also increased the maximum amount payable pursuant to cash-denominated performance awards granted in any calendar year from $\n3.0\n million to $\n5.0\n million. In addition, the amendment and restatement extended the existing prohibition on the payment of dividends or dividend equivalents on unvested awards to apply to all awards, including time-based restricted stock, deferred stock and stock payment. The term of the 2009 Plan was extended by \nfour years\n so that the plan expires on September 11, 2027, unless otherwise amended or extended.\nThe maximum number of shares of our common stock authorized for issuance under the 2009 Plan is \n51.1\n million. The number of securities remaining available for future issuance under the 2009 Plan at June 30, 2025 is \n11.9\n million. The number of shares of our common stock available for issuance under the 2009 Plan will be reduced by (i) \n2.8\n shares for each one share of common stock delivered in settlement of any “full-value award,” which is any award other than a stock option, stock appreciation right or other award for which the holder pays a purchase price and (ii) \none\n share for each share of common stock delivered in settlement of all other awards. The maximum number of shares, which may be subject to awards granted under the 2009 Plan to any individual during any calendar year, may not exceed \n3\n million shares of our common stock (except in a participant’s initial year of hiring up to \n4.5\n million shares of our common stock may be granted). \nIn certain regions, shares are withheld on behalf of employees to satisfy statutory tax withholding requirements upon exercise or vesting of awards. The number of shares withheld is based upon the closing price of our common stock on the trading day of the applicable settlement date. The remaining shares are delivered to the recipient as shares of our common stock. The amount remitted to the tax authorities for the employees’ tax obligation is reflected as a financing activity on our consolidated statements of cash flows. Shares withheld by us as a result of the net settlement are not considered issued and outstanding and are added to the shares available for future issuance under the 2009 Plan.\nThe total fair value of RSUs that vested during the years ended June 30, 2025, 2024 and 2023, was $\n45.3\n million, $\n38.0\n million and $\n28.7\n million, respectively.\nThe total fair value of PRSUs that vested during the years ended June 30, 2025, 2024 and 2023, was $\n10.3\n million, $\n13.0\n million, and $\n38.1\n million, respectively.\n-90-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe following table summarizes the activity of RSUs and PRSUs during year ended June 30, 2025 (in thousands, except years and per share amounts):\nWeighted Average Grant-Date\nFair Value\nWeighted Average Remaining\nContractual Term in Years\nRestricted\nStock\nUnits\nPerformance Restricted Stock Units\nRestricted\nStock\nUnits\nPerformance Restricted Stock Units\nRestricted\nStock\nUnits\nPerformance Restricted Stock Units\nOutstanding at beginning of period\n791\n \n348\n \n$\n175.09\n \n$\n204.02\n \n1.6\n1.7\nGranted\n371\n \n79\n \n240.69\n \n241.73\n \nVested*\n(\n247\n)\n(\n53\n)\n183.95\n \n193.24\n \nForfeited \n(\n82\n)\n(\n32\n)\n181.27\n \n187.33\n \nOutstanding at end of period\n833\n \n342\n \n$\n201.05\n \n$\n213.28\n \n1.5\n1.5\n*\nIncludes \n53\n thousand RSUs and \n20\n thousand PRSUs netted for tax.\nThe following table summarizes option activity during the year ended June 30, 2025 (in thousands, except years and per share amounts):\nOptions\nWeighted\nAverage\nExercise\nPrice\nWeighted\nAverage\nRemaining\nContractual\nTerm in Years\nOutstanding at beginning of period\n786\n \n$\n146.90\n \n2.8\nGranted\n35\n \n249.56\n \nExercised\n(\n293\n)\n105.35\n \nForfeited\n(\n11\n)\n222.57\n \nOutstanding at end of period\n517\n \n$\n175.61\n \n2.7\nOptions exercisable at end of period\n415\n \n$\n169.87\n \n2.0\nOptions vested and expected to vest at end of period\n512\n \n$\n175.35\n \n2.7\nThe aggregate intrinsic value of options exercised during the fiscal years 2025, 2024 and 2023, was $\n37.7\n million, $\n17.9\n million and $\n25.4\n million, respectively. As at June 30, 2025, the aggregate intrinsic value of options outstanding, exercisable, and vested and expected to vest were $\n42.8\n million, $\n36.8\n million and $\n42.5\n million respectively.\nEmployee Stock Purchase Plan, or the ESPP.\n Under the ESPP, we offer participants the right to purchase shares of our common stock at a discount during successive offering periods. Each offering period under the ESPP will be for a period of time determined by the board of directors’ compensation committee of no less than \n3\n months and no more than \n27\n months. The purchase price for our common stock under the ESPP will be the lower of \n85\n% of the fair market value of our common stock on the date of grant or \n85\n% of the fair market value of our common stock on the date of purchase. An individual participant cannot subscribe for more than $\n25,000\n in common stock during any calendar year. At June 30, 2025, the number of shares remaining available for future issuance under the ESPP is \n0.8\n million shares.\nDuring years ended June 30, 2025, 2024 and 2023, we issued \n226,000\n, \n323,000\n and \n220,000\n shares to our employees in \ntwo\n offerings and we recognized $\n11.8\n million, $\n11.4\n million and $\n11.5\n million, respectively, of stock compensation expense associated with the ESPP.\nStock–based Employee compensation.\n We measure the compensation expense of all stock-based awards at fair value on the grant date. We estimate the fair value of stock options and purchase rights granted under the ESPP using the Black-Scholes valuation model. The fair values of RSUs and PRSUs subject to performance conditions are equal to the market value of the underlying shares as determined at the grant date less the fair value of dividends that holders are not entitled to during the vesting period. The fair value of PRSUs that are subject to market conditions is measured using a Monte-Carlo simulation valuation model. We recognize the fair value as compensation expense using the straight-line method over the service period for awards expected to vest.\nFor the years ended June 30, 2025, 2024 and 2023, we estimated the fair value of PRSUs that are measured using a Monte-Carlo simulation valuation model, stock options granted under our stock option plans and purchase rights granted under the \n-91-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nESPP using the assumptions in the following tables. The risk-free interest rate is estimated using the U.S. Treasury yield curve and is based on the term of the award. The expected term of awards is estimated from the vesting period of the award, as well as historical exercise behavior, and represents the period of time the awards granted are expected to be outstanding. Expected volatility is estimated based upon the historical volatility of Resmed stock.\n2025\n2024\n2023\nPerformance restricted stock units\nWeighted average grant date fair value\n$\n272.47\n$\n168.14\n$\n208.40\nWeighted average risk-free interest rate\n4.23\n%\n4.50\n%\n3.75\n%\nExpected life in years\n3\n - \n4\n3\n - \n4\n4\nDividend yield\n(1)\n0.88\n%\n1.29\n%\n0.78\n% - \n0.84\n%\nExpected volatility\n32\n% - \n34\n%\n31\n% - \n36\n%\n32\n%\nAverage peer volatility\n(2)\n31\n%\n31\n%\n—\nAverage peer correlation coefficient\n(3)\n0.5189\n0.5385\n—\nStock options:\nWeighted average grant date fair value\n$\n88.54\n$\n50.48\n$\n74.95\nWeighted average risk-free interest rate\n4.17\n%\n4.44\n%\n3.85\n%\nExpected life in years\n4.9\n4.9\n4.9\nDividend yield\n0.85\n%\n1.29\n%\n0.78\n%\nExpected volatility\n37\n%\n36\n%\n34\n%\nESPP purchase rights:\nWeighted average grant date fair value\n$\n59.55\n$\n47.40\n$\n52.38\nWeighted average risk-free interest rate\n4.7\n%\n5.4\n%\n3.6\n%\nExpected life in years\n0.5\n0.5\n0.5\nDividend yield\n0.87\n% - \n0.90\n%\n0.75\n% - \n1.30\n%\n0.75\n% - \n0.84\n%\nExpected volatility\n34\n% - \n39\n%\n27\n% - \n40\n%\n27\n% - \n34\n%\n(1)    The dividend yield used to project the value of the stock delivered to the holder is based on historical dividends and the expectation of future dividend payouts. Total stockholder return is determined assuming the reinvestment of dividends over the performance period, which is mathematically equivalent to a \n0\n% dividend yield.\n(2)    The correlation coefficients are based upon the stock price data used to estimate the volatility assumptions. \n(3)    The average peer volatility is estimated based upon the historical volatility of each peer company.\n \nThe following table summarizes total stock-based compensation costs incurred and the associated tax benefit recognized during the years ended June 30, 2025, 2024 and 2023 (in thousands): \n2025\n2024\n2023\nCost of sales \n$\n8,945\n \n$\n7,563\n \n$\n6,465\n \nSelling, general and administrative expenses\n64,588\n \n58,149\n \n53,049\n \nResearch and development expenses\n18,128\n \n14,472\n \n11,628\n \nStock-based compensation costs\n91,661\n \n80,184\n \n71,142\n \nTax benefit\n(\n21,833\n)\n(\n15,053\n)\n(\n24,860\n)\nStock-based compensation costs, net of tax benefit\n$\n69,828\n \n$\n65,131\n \n$\n46,282\n \nAt June 30, 2025, there was $\n163.8\n million in unrecognized compensation costs related to unvested stock-based compensation arrangements. This is expected to be recognized over a weighted average period of \n2.5\n years.\n \n(11) \nEarnings Per Share \nWe compute basic earnings per share by dividing the net income available to common stockholders by the weighted average number of shares of common stock outstanding. For purposes of calculating diluted earnings per share, the denominator includes both the weighted average number of shares of common stock outstanding and the number of dilutive \n-92-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\ncommon stock equivalents such as stock options and restricted stock units. The weighted average number of outstanding stock options and restricted stock units not included in the computation of diluted earnings per share were \n154,567\n, \n603,859\n and \n272,104\n for the years ended June 30, 2025, 2024 and 2023, respectively, as the effect would have been anti-dilutive. \nBasic and diluted earnings per share for the years ended June 30, 2025, 2024 and 2023 are calculated as follows (in thousands except per share data): \n2025\n2024\n2023\nNumerator:\nNet income\n$\n1,400,723\n \n$\n1,020,951\n \n$\n897,556\n \nDenominator:\nBasic weighted-average common shares outstanding\n146,716\n \n147,021\n \n146,765\n \nEffect of dilutive securities:\nStock options and restricted stock units\n624\n \n529\n \n690\n \nDiluted weighted average shares \n147,340\n \n147,550\n \n147,455\n \nBasic earnings per share\n$\n9.55\n \n$\n6.94\n \n$\n6.12\n \nDiluted earnings per share\n$\n9.51\n \n$\n6.92\n \n$\n6.09\n \n(12) \nIncome Taxes \nIncome before income taxes for the years ended June 30, 2025, 2024 and 2023, was taxed under the following jurisdictions (in thousands): \n2025\n2024\n2023\nU.S.\n$\n359,741\n \n$\n181,107\n \n$\n128,589\n \nNon-U.S.\n1,317,825\n \n1,083,691\n \n973,075\n \nIncome before income taxes\n$\n1,677,566\n \n$\n1,264,798\n \n$\n1,101,664\n \nThe provision for income taxes is presented below (in thousands): \n2025\n2024\n2023\nCurrent:\nFederal\n$\n19,744\n \n$\n57,103\n \n$\n36,631\n \nState\n19,919\n \n17,250\n \n14,142\n \nNon-U.S.\n298,170\n \n219,372\n \n198,767\n \n337,833\n \n293,725\n \n249,540\n \nDeferred: \nFederal\n(\n5,701\n)\n(\n22,915\n)\n(\n21,721\n)\nState\n(\n1,231\n)\n(\n4,632\n)\n(\n2,389\n)\nNon-U.S.\n(\n54,058\n)\n(\n22,331\n)\n(\n21,322\n)\n(\n60,990\n)\n(\n49,878\n)\n(\n45,432\n)\nProvision for income taxes\n$\n276,843\n \n$\n243,847\n \n$\n204,108\n \n-93-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe provision for income taxes differs from the amount of income tax determined by applying the applicable U.S. federal income tax rate of 21% for the years ended June 30, 2025, 2024 and 2023, to pretax income as a result of the following (in thousands): \n2025\n2024\n2023\nTaxes computed at statutory U.S. rate\n$\n352,289\n \n$\n265,608\n \n$\n231,349\n \nIncrease (decrease) in income taxes resulting from:\nState income taxes, net of U.S. tax benefit\n15,590\n \n8,609\n \n9,448\n \nResearch and development credit\n(\n28,859\n)\n(\n27,786\n)\n(\n21,481\n)\nChange in valuation allowance\n20,644\n \n849\n \n(\n5,007\n)\nEffect of non-U.S. tax rates\n(\n12,225\n)\n(\n15,838\n)\n(\n3,982\n)\nForeign tax credits\n(\n3,896\n)\n(\n8,293\n)\n(\n3,988\n)\nStock-based compensation expense\n1,735\n \n4,875\n \n(\n6,282\n)\nCessation of business\n(\n35,847\n)\n—\n \n—\n \nNet refunds for prior tax years\n(\n29,976\n)\n—\n \n—\n \nOther\n(\n2,612\n)\n15,823\n \n4,051\n \nProvision for income taxes\n$\n276,843\n \n$\n243,847\n \n$\n204,108\n \nWe reported net deferred tax assets and liabilities in our consolidated balance sheets at June 30, 2025 and June 30, 2024, as follows (in thousands): \n2025\n2024\nNon-current deferred tax asset\n$\n253,119\n \n$\n203,569\n \nNon-current deferred tax liability\n(\n77,682\n)\n(\n79,339\n)\nNet deferred tax asset\n$\n175,437\n \n$\n124,230\n \n-94-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe components of our deferred tax assets and liabilities at June 30, 2025 and June 30, 2024, are as follows (in thousands):\n \n2025\n2024\nDeferred tax assets:\nEmployee liabilities\n$\n37,189\n \n$\n35,336\n \nTax credit carry overs\n1,577\n \n9,271\n \nInventories\n20,523\n \n15,602\n \nProvision for warranties\n5,997\n \n6,112\n \nProvision for doubtful debts\n4,942\n \n5,340\n \nNet operating loss carryforwards\n14,408\n \n23,455\n \nCapital loss carryover\n27,454\n \n5,587\n \nStock-based compensation expense\n12,752\n \n11,538\n \nDeferred revenue\n31,289\n \n28,030\n \nResearch and development capitalization\n132,043\n \n125,411\n \nLease liabilities\n21,138\n \n25,602\n \nHedging contracts\n94,626\n \n56,324\n \nState income taxes\n2,883\n \n3,566\n \nOther\n18,527\n \n5,538\n \n425,348\n \n356,712\n \nLess valuation allowance\n(\n30,072\n)\n(\n9,384\n)\nDeferred tax assets\n395,276\n \n347,328\n \nDeferred tax liabilities:\nGoodwill and other intangibles\n(\n196,698\n)\n(\n192,398\n)\nRight of use assets\n(\n18,491\n)\n(\n22,843\n)\nProperty, plant and equipment\n(\n4,650\n)\n(\n7,857\n)\nDeferred tax liabilities\n(\n219,839\n)\n(\n223,098\n)\nNet deferred tax asset\n$\n175,437\n \n$\n124,230\n \nAs of June 30, 2025, we had $\n6.0\n million of U.S. federal and state net operating loss carryforwards and $\n8.4\n million of non-U.S. net operating loss carryforwards, which expire in various years beginning in 2026 or carry forward indefinitely. \nThe valuation allowance at June 30, 2025 relates to a provision for uncertainty of the utilization of net operating loss carryforwards of $\n0.6\n million, capital loss of $\n28.8\n million and other items of $\n0.6\n million. We believe that it is more likely than not that the benefits of deferred tax assets, net of any valuation allowance, will be realized.\nA substantial portion of our manufacturing operations and administrative functions in Singapore operate under certain tax holidays and tax incentive programs that will expire in whole or in part at various dates through June 30, 2030. The end of certain tax holidays may be extended if specific conditions are met. The net impact of these tax holidays and tax incentive programs increased our net income by $\n67.4\n million ($\n0.46\n per diluted share) for the year ended June 30, 2025, $\n49.6\n million ($\n0.34\n per diluted share) for the year ended June 30, 2024, and $\n40.5\n million ($\n0.27\n per diluted share) for the year ended June 30, 2023. \nAs a result of the Tax Cuts and Jobs Act of 2017, or the TCJA, we have treated all non-U.S. historical earnings as taxable. Therefore, future repatriation of cash held by our non-U.S. subsidiaries will generally not be subject to U.S. federal tax if repatriated. The total amount of these undistributed earnings at June 30, 2025 amounted to approximately $\n4.7\n billion. In the event our non-U.S. earnings had not been permanently reinvested, approximately $\n5.9\n million in U.S. state deferred taxes would have been recognized in the consolidated financial statements.\nThe TCJA also introduced U.S. taxation on certain global intangible low-taxed income, or GILTI. We have elected to account for tax expense attributable to GILTI tax as a period cost when incurred.\nIn accounting for uncertainty in income taxes, we recognize a tax benefit in the financial statements for an uncertain tax position only if management’s assessment is that the position is “more likely than not” (that is, a likelihood greater than \n50\n percent) to be allowed by the tax jurisdiction based solely on the technical merits of the position. The term “tax position” \n-95-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nrefers to a position in a previously filed tax return or a position expected to be taken in a future tax return that is reflected in measuring current or deferred income tax assets and liabilities for annual periods. We recognize interest and penalties related to unrecognized tax benefits within the income tax expense line in the accompanying consolidated statements of income. Accrued interest and penalties are included within the related tax liability line in the consolidated balance sheets. Based on all known facts and circumstances and current tax law, we believe the total amount of unrecognized tax benefits on June 30, 2025 is not material to our results of operations, financial condition or cash flows, and if recognized, would not have a material impact on our effective tax rate.\nOur income tax returns are based on calculations and assumptions subject to audit by various tax authorities. In addition, the calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws. We regularly assess the potential outcomes of examinations by tax authorities in determining the adequacy of our provision for income taxes. We are currently under audit by the ATO for the 2018 tax year. If any ongoing tax audits are resolved in a manner not consistent with management’s expectations, the result could be a material adjustment to our past or future taxable income, tax payable or deferred tax assets, and may require us to pay penalties and interest that could materially adversely affect our financial results. \nTax years 2018 to 2024 remain subject to examination by the major tax jurisdictions in which we are subject to tax.\n(13) \nSegment Information \nWe have \ntwo\n operating segments, which are the Sleep and Breathing Health segment and the Residential Care Software segment. During fiscal year 2025, we renamed our operating segments from Sleep and Respiratory Care to Sleep and Breathing Health and from Software as a Service to Residential Care Software in alignment with our 2030 strategy. There have been no changes in the preparation and disclosure of financial information by operating segment. The identification of operating segments is based on our internal organizational structure and the information regularly reviewed by our Chief Executive Officer, who is our Chief Operating Decision Maker (CODM). Our CODM evaluates segment performance and makes resource allocation decisions based on net revenue and net operating profit. Impacts to segment net operating profit are referenced by our CODM when deciding to enter new markets, launch new products, reinvest profits, acquire or otherwise invest in other companies, and for monitoring actual results against forecasts. The accounting policies of the segments are the same as those described in Note 2 – Summary of Significant Accounting Policies. Segment net sales and segment net operating profit do not include inter-segment profits and revenue is allocated to a geographic area based on where the products are shipped to or where the services are performed.\nCertain items are maintained at the corporate level and are not allocated to the segments. The non-allocated items include corporate headquarters costs, stock-based compensation, amortization expense from acquired intangibles, restructuring expenses, field safety notification expenses, acquisition related expenses, net interest expense (income), gains and losses attributable to equity method investments, gains and losses on equity investments, and other, net. We neither discretely allocate assets to our operating segments, nor does our CODM evaluate the operating segments using discrete asset information.\nAdditionally, effective in the third quarter of fiscal year 2024, we updated the method of attribution of certain costs that are principally managed at the segment level as part of our evaluation of segment operating performance. As a result, certain costs relating to quality and regulatory assurance, commercial legal, operations, sales and marketing, customer service, information technology, and other administrative costs, which were previously included in Corporate costs within our reconciliation of segment operating profit to income before income taxes, are now reported in segment operating results. The financial information presented herein reflects the impact of the preceding reporting change for all periods presented.\n-96-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nThe table below presents a reconciliation of net revenues, significant expenses, net operating profit and depreciation and amortization by reportable segments for the years ended June 30, 2025, 2024 and 2023 (in thousands):\n2025\n2024\n2023\nNet revenue by segment\nSleep and Breathing Health\n$\n4,504,890\n \n$\n4,101,172\n \n$\n3,725,017\n \nResidential Care Software\n641,437\n \n584,125\n \n497,976\n \nTotal\n$\n5,146,327\n \n$\n4,685,297\n \n$\n4,222,993\n \nSignificant segment expenses\nCost of Sales\nSleep and Breathing Health\n$\n1,852,574\n \n$\n1,782,023\n \n$\n1,659,037\n \nResidential Care Software\n195,043\n \n190,186\n \n174,718\n \nTotal\n$\n2,047,617\n \n$\n1,972,209\n \n$\n1,833,755\n \nSelling, general, and administrative\nSleep and Breathing Health\n$\n491,591\n \n$\n451,334\n \n$\n443,467\n \nResidential Care Software\n(1)\n143,435\n \n143,999\n \n120,483\n \nTotal\n$\n635,026\n \n$\n595,333\n \n$\n563,950\n \nResearch and development\nSleep and Breathing Health\n$\n196,340\n \n$\n186,461\n \n$\n175,393\n \nResidential Care Software\n97,959\n \n95,490\n \n87,120\n \nTotal\n$\n294,299\n \n$\n281,951\n \n$\n262,513\n \nNet operating profit by segment\nSleep and Breathing Health\n$\n1,964,385\n \n$\n1,681,354\n \n$\n1,447,120\n \nResidential Care Software \n205,000\n \n154,450\n \n115,655\n \nTotal\n$\n2,169,385\n \n$\n1,835,804\n \n$\n1,562,775\n \nReconciling items\nCorporate costs\n$\n406,114\n \n$\n357,937\n \n$\n338,362\n \nAmortization of acquired intangible assets\n77,389\n \n79,484\n \n72,416\n \nRestructuring expenses\n—\n \n64,228\n \n9,177\n \nMasks with magnets field safety notification expenses \n(2)\n(\n1,512\n)\n6,351\n \n—\n \nAstral field safety notification expenses \n(3)\n—\n \n7,911\n \n—\n \nAcquisition related expenses\n2,031\n \n—\n \n10,949\n \nInterest (income) expense, net\n(\n4,114\n)\n45,708\n \n47,379\n \n(Gain) loss attributable to equity method investments\n(\n3,644\n)\n1,848\n \n7,265\n \n(Gain) loss on equity investments\n10,299\n \n4,045\n \n(\n9,922\n)\nGain on insurance recoveries\n—\n \n—\n \n(\n20,227\n)\nOther, net\n5,256\n \n3,494\n \n5,712\n \nIncome before income taxes\n$\n1,677,566\n \n$\n1,264,798\n \n$\n1,101,664\n \nDepreciation and amortization by segment\nSleep and Breathing Health\n$\n110,543\n \n$\n86,070\n \n$\n82,544\n \nResidential Care Software\n9,467\n \n10,241\n \n9,119\n \nAmortization of acquired intangible assets and corporate assets\n78,463\n \n80,559\n \n73,493\n \nTotal\n$\n198,473\n \n$\n176,870\n \n$\n165,156\n \n-97-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(1)     During the fiscal year ended June 30, 2024, we recorded $\n4.1\n million of operating lease right-of-use asset impairments within our Residential Care Software segment. The impairments related to leases for office space and were recorded within selling, general and administrative expenses. \n(2)    The masks with magnets field safety notification expenses relate to estimated \ncosts to provide alternative masks to patients in response to updated contraindications for use of masks that incorporate magnets.\n(3)    The Astral field safety notification expenses relate to estimated costs associated with the replacement of a certain component in some of our Astral ventilation devices that were manufactured between 2013 to 2019.\nThe following table summarizes our net revenue disaggregated by segment, product and region for the years ended June 30, 2025, 2024 and 2023 (in thousands):\n2025\n2024\n2023\nU.S., Canada and Latin America\nDevices\n$\n1,654,413\n \n$\n1,522,758\n \n$\n1,444,361\n \nMasks and other\n1,343,101\n \n1,199,798\n \n1,039,026\n \nTotal U.S., Canada and Latin America\n$\n2,997,514\n \n$\n2,722,556\n \n$\n2,483,387\n \nCombined Europe, Asia and other markets \nDevices\n$\n1,010,760\n \n$\n921,253\n \n$\n826,341\n \nMasks and other\n496,616\n \n457,363\n \n415,289\n \nTotal Combined Europe, Asia and other markets\n$\n1,507,376\n \n$\n1,378,616\n \n$\n1,241,630\n \nGlobal revenue\nDevices\n$\n2,665,173\n \n$\n2,444,011\n \n$\n2,270,702\n \nMasks and other\n1,839,717\n \n1,657,161\n \n1,454,315\n \nTotal Sleep and Breathing Health\n$\n4,504,890\n \n$\n4,101,172\n \n$\n3,725,017\n \nResidential Care Software\n641,437\n \n584,125\n \n497,976\n \nTotal\n$\n5,146,327\n \n$\n4,685,297\n \n$\n4,222,993\n \nRevenue information by geographic area for the years ended June 30, 2025, 2024 and 2023 is summarized below (in thousands):\n2025\n2024\n2023\nUnited States\n$\n3,285,581\n \n$\n2,980,053\n \n$\n2,719,923\n \nRest of the World\n1,860,746\n \n1,705,244\n \n1,503,070\n \nTotal\n$\n5,146,327\n \n$\n4,685,297\n \n$\n4,222,993\n \nLong-lived assets of geographic areas are those assets used in our operations in each geographical area, and excludes goodwill, other intangible assets, and deferred tax assets. \nLong-lived assets by geographic area as of June 30, 2025 and 2024 is summarized below (in thousands):\n2025\n2024\nAustralia\n$\n170,836\n \n$\n197,017\n \nUnited States\n180,770\n \n160,606\n \nSingapore\n98,509\n \n89,679\n \nRest of the World\n100,675\n \n100,723\n \nTotal\n$\n550,790\n \n$\n548,025\n \n-98-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(14) \nEmployee Retirement Plans \nWe contribute to a number of employee retirement plans for the benefit of our employees. Details of the main plans are as follows: \nAustralia \nWe contribute to defined contribution plans for each employee resident in Australia at the rate of approximately \n11.5\n% of salaries. Employees may contribute additional funds to the plans. All Australian employees, after serving a qualifying period, are entitled to benefits on retirement, disability or death. Our total contributions to the plans for the years ended June 30, 2025, 2024 and 2023, were $\n15.9\n million, $\n14.9\n million and $\n13.0\n million, respectively. \nUnited States \nWe sponsor a defined contribution plan available to substantially all domestic employees. Company contributions to this plan are based on a percentage of employee contributions to a maximum of \n4.0\n% of the employee’s eligible compensation, subject to the annual IRS limit. Our total contributions to the plan were $\n12.7\n million, $\n13.8\n million and $\n12.7\n million in fiscal 2025, 2024 and 2023, respectively. \nSingapore \nWe sponsor a defined contribution plan available to all domestic employees. Company contributions to this plan are based on a percentage of employee contributions to a maximum of \n17.0\n% of the employee’s salary. Our total contributions to the plan were $\n4.4\n million, $\n3.9\n million and $\n3.6\n million in fiscal 2025, 2024 and 2023, respectively.\n(15) \nLegal Actions, Contingencies and Commitments\nLitigation\nIn the normal course of business, we are subject to routine litigation incidental to our business. While the results of this litigation cannot be predicted with certainty, we believe that their final outcome will not, individually or in aggregate, have a material adverse effect on our consolidated financial statements taken as a whole.\nOn June 2, 2021, New York University, or NYU, filed a complaint for patent infringement in the United States District Court, District of Delaware against Resmed, case no. 1:21-cv-00813 (JPM). The complaint alleges that the AutoSet or AutoRamp features of Resmed’s AirSense 10 AutoSet flow generators infringe one or more claims of various NYU patents, including U.S. Patent Nos. 6,988,994; 9,108,009; 9,168,344; 9,427,539; 9,533,115; 9,867,955; and 10,384,024. According to the complaint, the NYU patents are directed to systems and methods for diagnosis and treating sleeping disorders during different sleep states. The complaint seeks monetary damages and attorneys’ fees. We answered the complaint on September 30, 2021 and filed a motion to dismiss the complaint on the basis that the patents are invalid because the subject matter of the patents is not patentable under the Supreme Court and Federal Circuit precedent. The motion to dismiss was granted in part and denied in part. In December 2022, the Patent Trial and Appeal Board, or PTAB, of the Patent and Trademark Office granted our request to review the validity of the claims in the patents asserted by NYU against us, determining that there is a reasonable likelihood that we will prevail. In December 2023, the PTAB issued written decisions invalidating each of the challenged claims in each of the NYU patents asserted against us. On December 28, 2023, the District Court entered an order continuing its stay of all proceedings against us pending any appeal by NYU of the invalidation of its patents by the PTAB. On January 31, 2024, NYU appealed the PTAB’s rulings to the Court of Appeals for the Federal Circuit. Briefing has been completed and oral argument before the Court of Appeals for the Federal Circuit has been scheduled in August 2025. \nOn June 16, 2022, Cleveland Medical Devices Inc., or Cleveland Medical, filed suit for patent infringement against Resmed in the United States District Court for the District of Delaware, case no. 1:22-cv-00794. Cleveland Medical asserts that numerous Resmed connected devices, when combined with certain Resmed data platforms and/or software, including AirView and ResScan, infringe one or more of \nseven\n Cleveland Medical patents, including U.S. Patent Nos. 10,076,269; 10,426,399; 10,925,535; 11,064,937; 10,028,698; 11,202,603; and 11,234,637. We moved to dismiss the action because Cleveland Medical sued the wrong Resmed entity, and to dismiss the indirect and willful infringement allegations by Cleveland Medical. On October 2, 2023, the court granted a portion of the motion, dismissing all Cleveland Medical claims for indirect and willful infringement, and denied the rest of the motion. On March 22, 2023, ResMed Corp. filed a petition with the PTAB seeking review of the validity of U.S. Patent No. 10,076,269. On May 6, 2024, the PTAB granted the petition and instituted an Inter Partes Review proceeding against the patent. On June 21, 2024, the District Court of Delaware granted Resmed's motion to stay the case until the PTAB issues its final written decision in the Inter Partes \n-99-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nReview proceeding. On May 2, 2025, the PTAB issued its decision finding all claims of U.S. Patent No. 10,076,269 unpatentable.\nOn March 20, 2023, ResMed Corp. filed suit in the United States District Court for the Southern District of California, case no. 23-cv-00500-TWR-JLB, seeking a declaration that it does not infringe U.S. Patent No. 11,602,284 issued to Cleveland Medical. In November 2023, the case was transferred to the Northern District of Ohio for the convenience of the parties. Cleveland Medical answered the complaint and filed a counterclaim asserting that ResMed Corp. infringes \nthree\n additional Cleveland Medical patents, including U.S. Patent Nos. 11,375,921; 11,690,512; and 11,786,680. On April 9, 2024, Cleveland Medical filed a second amended answer and counterclaims accusing ResMed Corp. of infringing U.S. Patent Nos. 11,857,333 and 11,872,029. ResMed Corp. filed a petition with the PTAB for post-grant review of the validity of U.S. Patent No. 11,602,284, which the PTAB denied on June 24, 2024. On October 17, 2024, the PTAB denied ResMed Corp.’s request for rehearing of its decision to deny the petition for post-grant review of U.S. Patent No. 11,602,284.\nOn October 11, 2024, ResMed Corp. filed a request for ex parte reexamination of U.S. Patent No. 11,375,921, and on November 15, 2024, the United States Patent and Trademark Office, or the Patent Office, ordered reexamination of the patent. On October 17, 2024, ResMed Corp. filed a request for ex parte reexamination of U.S. Patent No. 11,786,680, and on December 3, 2024, the Patent Office ordered reexamination of the patent. Between November 15, 2024, and January 10, 2025, ResMed Corp. filed petitions with the PTAB seeking Inter Partes Review of the validity of all \nsix\n patents asserted by Cleveland Medical in the District Court of the Northern District of Ohio proceedings. On March 7, 2025, the District Court of the Northern District of Ohio granted ResMed Corp.'s motion to stay the case pending the conclusion of all Patent Office proceedings related to the asserted patents. On June 10, 2025, the PTAB denied institution of Inter Partes Review directed to U.S. Patent No. 11,602,284. On June 12, 2025, the PTAB instituted an Inter Partes Review proceeding against U.S. Patent No. 11,375,921. On June 13, 2025, the PTAB instituted Inter Partes Review proceedings against U.S. Patent Nos. 11,690,512 and 11,786,680. On July 30, 2025, the PTAB instituted Inter Partes Review proceedings against U.S. Patent Nos. 11,857,333 and 11,872,029. The PTAB’s final written decisions in the instituted Inter Partes Review proceedings are expected by July 2026. \nBased on currently available information, we are unable to make a reasonable estimate of loss or range of losses, if any, arising from matters that remain open.\nContingent Obligations Under Recourse Provisions\nWe use independent financing institutions to offer some of our customers financing for the purchase of some of our products. Under these arrangements, if the customer qualifies under the financing institutions’ credit criteria and finances the transaction, the customers repay the financing institution on a fixed payment plan. For some of these arrangements, the customer’s receivable balance is with limited recourse whereby we are responsible for repaying the financing company should the customer default. We record a contingent provision, which is estimated based on historical default rates. This is applied to receivables sold with recourse and is recorded in accrued expenses.\nDuring the year ended June 30, 2025 and 2024, receivables sold with limited recourse were $\n212.5\n million and $\n206.7\n million, respectively. As of June 30, 2025, the maximum exposure on outstanding receivables sold with recourse and contingent provision were $\n34.1\n million and $\n0.7\n million, respectively. As of June 30, 2024, the maximum exposure on outstanding receivables sold with recourse and contingent provision were $\n35.8\n million and $\n0.8\n million, respectively.\nCommitments\nIn the normal course of business, we enter into agreements to purchase goods or services that are not cancelable without penalty, primarily related to supply arrangements. \nObligations under our purchase agreements at June 30, 2025 were as follows (in thousands):\nTotal \nFiscal Years Ending June 30\n2026\n2027\n2028\n2029\n2030\nThereafter\nMinimum purchase obligations\n$\n963,763\n \n$\n927,365\n \n$\n26,090\n \n$\n4,430\n \n$\n2,339\n \n$\n2,154\n \n$\n1,385\n \n-100-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\n(16) \nDerivative Instruments and Hedging Activities \nFair Values of Derivative Instruments \nThe following table presents our assets and liabilities related to derivative instruments on a gross basis within the consolidated balance sheets (in thousands):\nJune 30,\n2025\nJune 30,\n2024\nBalance Sheet Caption\nDerivative Assets\nNot Designated as Hedging Instruments\nForeign currency hedging instruments\n$\n6,810\n \n$\n2,343\n \nPrepaid taxes and other non-current assets\nForeign currency hedging instruments\n—\n \n89\n \nPrepaid taxes and other non-current assets\nTotal derivative assets\n$\n6,810\n \n$\n2,432\n \nDerivative Liabilities\nDesignated as Hedging Instruments\nForeign cross-currency swaps – Fair Value Hedge\n$\n38,533\n \n$\n10,472\n \nOther long-term liabilities\nForeign cross-currency swaps – Net Investment Hedge\n91,596\n \n21,270\n \nOther long-term liabilities\nNot Designated as Hedging Instruments\nForeign currency hedging instruments\n2,695\n \n4,654\n \nAccrued expenses\nForeign currency hedging instruments\n—\n \n142\n \nOther long-term liabilities\nTotal derivative liabilities\n$\n132,824\n \n$\n36,538\n \nFair Value Hedge Gains (Losses)\nWe recognized the following gains (losses) on the foreign cross currency swaps designated as fair value hedges (in thousands):\nTwelve Months Ended\nJune 30,\n2025\n2024\n2023\nGain (loss) recognized in other comprehensive income (loss)\n$\n1,762\n \n$\n3,329\n \n$\n(\n5,414\n)\nGain (loss) recognized on cross-currency swap in interest (expense) income, net (amount excluded from effectiveness testing)\n$\n4,699\n \n$\n4,010\n \n$\n3,754\n \nGain (loss) recognized on cross-currency swap in other, net\n$\n(\n29,822\n)\n$\n5,942\n \n$\n(\n14,329\n)\nGain (loss) recognized on intercompany debt in other, net\n$\n29,822\n \n$\n(\n5,942\n)\n$\n14,329\n \nNet Investment Hedge Gains (Losses)\nWe recognized the following gains (losses) on the foreign cross currency swaps designated as net investment hedges (in thousands):\nTwelve Months Ended\nJune 30,\n2025\n2024\n2023\nGain (loss) recognized in cumulative translation adjustment within other comprehensive income (loss)\n$\n(\n70,326\n)\n$\n19,532\n \n$\n(\n40,803\n)\nGain (loss) recognized from the excluded components in interest (expense) income, net \n$\n12,024\n \n$\n10,337\n \n$\n9,482\n \nNon-designated Derivative Gains (Losses)\nWe recognized the following gains (losses) in the consolidated statement of income on derivatives not designated as hedging instruments (in thousands):\n-101-\nTable of Contents\nPART II\nItem 8\nRESMED INC. AND SUBSIDIARIES\nNotes to the Consolidated Financial Statements\nTwelve Months Ended\nJune 30,\n2025\n2024\n2023\nGain (loss) recognized on foreign currency hedging instruments in other, net\n$\n47,241\n \n$\n(\n4,168\n)\n$\n8,576\n \nGain (loss) recognized on other foreign-currency-denominated transactions in other, net\n(\n54,330\n)\n19\n \n(\n12,780\n)\nTotal\n$\n(\n7,089\n)\n$\n(\n4,149\n)\n$\n(\n4,204\n)\n(17) \nRestructuring Expenses \nRestructuring expenses consist of costs incurred in connection with the realignment of business strategies and operations as well as cost rationalization efforts. These costs are separately presented as restructuring expenses within our consolidated statement of income for all periods presented. Although the costs associated with restructuring plans have not been allocated to our business segments' results in Note 13 – Segment Information, the restructuring plans impacted both our Sleep and Breathing Health and Residential Care Software segments. \nWe did \nnot\n incur material restructuring expenses during the year ended June 30, 2025. \nDuring the year ended June 30, 2024, we recorded $\n64.2\n million of restructuring related charges associated with an evaluation of our existing operations to increase operational efficiency, decrease costs and increase profitability. Restructuring charges for the year ended June 30, 2024 are comprised of $\n28.6\n million of employee severance and other one-time termination benefits, $\n33.2\n million of intangible asset impairments associated with the wind down of certain business activities, and $\n2.4\n million of other miscellaneous asset impairments. As of June 30, 2024, there were no restructuring expenses remaining in our accruals. \nDuring the year ended June 30, 2023, we incurred restructuring expenses of $\n9.2\n million associated with the reorganization and rationalization of our operations. We recorded the full amount of $\n9.2\n million during the year ended June 30, 2023. The restructuring expenses consisted primarily of severance to employees. As of June 30, 2023, we had $\n7.8\n million in restructuring expenses remaining in our accruals which were paid during the year ended June 30, 2024.\n-102-\nTable of Contents\nPART II\nItem 8\nSCHEDULE II\nRESMED INC. AND SUBSIDIARIES\nVALUATION AND QUALIFYING ACCOUNTS AND RESERVES\nJune 30, 2025, 2024 and 2023\n(in thousands)\nBalance at\nBeginning\nof Period\nCharged to costs and expenses\nOther\n(deductions)\nBalance at\nEnd of\nPeriod\nYear ended June 30, 2025\nApplied against asset account\nAllowance for trade accounts receivable \n$\n21,132\n \n$\n9,053\n \n$\n(\n7,761\n)\n$\n22,424\n \nYear ended June 30, 2024\nApplied against asset account\nAllowance for trade accounts receivable \n$\n23,603\n \n$\n9,802\n \n$\n(\n12,273\n)\n$\n21,132\n \nYear ended June 30, 2023\nApplied against asset account\nAllowance for trade accounts receivable\n$\n23,259\n \n$\n5,770\n \n$\n(\n5,426\n)\n$\n23,603\n \nSee accompanying report of independent registered public accounting firm.\n-103-\nTable of Contents\nPART II\nItems 9 – 9C\nRESMED INC. AND SUBSIDIARIES\nITEM 9 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE \nNone.\nITEM 9A CONTROLS AND PROCEDURES \nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms and that such information is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. \nAs required by SEC Rule 13a-15(b), we carried out an evaluation, under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of June 30, 2025. Based on the foregoing, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures were effective at the reasonable assurance level as of June 30, 2025. \nThere has been no change in our internal control over financial reporting during our most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. \n-104-\nTable of Contents\nPART II\nItems 9 – 9C\nRESMED INC. AND SUBSIDIARIES\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles in the United States of America. Our internal control over financial reporting includes those policies and procedures that: \n(i)\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; \n(ii)\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and \n(iii)\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \nManagement assessed the effectiveness of our internal control over financial reporting as of June 30, 2025. In making this assessment, management used the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Management’s assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of our internal control over financial reporting. Management reviewed the results of its assessment with the audit committee of our board of directors. \nBased on that assessment under the framework in Internal Control-Integrated Framework (2013), management concluded that the company’s internal control over financial reporting was effective as of June 30, 2025. \nKPMG LLP, independent registered public accounting firm, who audited and reported on the consolidated financial statements of ResMed Inc. included in this report, has issued an attestation report on the effectiveness of internal control over financial reporting.\n-105-\nTable of Contents\nPART II\nItems 9 – 9C\nRESMED INC. AND SUBSIDIARIES\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nResMed Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited ResMed Inc. and subsidiaries' (the Company) internal control over financial reporting as of June 30, 2025, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of June 30, 2025, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of June 30, 2025 and 2024, the related consolidated statements of income, comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended June 30, 2025, and the related notes and financial statement schedule II (collectively, the consolidated financial statements), and our report dated August 7, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/ KPMG LLP\nSan Diego, California \nAugust 7, 2025\n-106-\nTable of Contents\nPART II\nItems 9 – 9C\nRESMED INC. AND SUBSIDIARIES\nITEM 9B OTHER INFORMATION\nInsider Trading Arrangements\nOur directors and executive officers may purchase or sell shares of our common stock in the market from time to time, including pursuant to equity trading plans adopted in accordance with Rule 10b5-1 under the Exchange Act and in compliance with guidelines specified by our insider trading policy. In accordance with Rule 10b5-1 and our insider trading policy, directors, officers and certain employees who, at such time, are not in possession of material non-public information are permitted to enter into written plans that pre-establish amounts, prices and dates (or formula for determining the amounts, prices and dates) of future purchases or sales of our stock, including shares acquired pursuant to our equity incentive plans. Under a Rule 10b5-1 trading plan, a broker executes trades pursuant to parameters established by the director or executive officer when entering into the plan, without further direction from them. The use of these trading plans permits asset diversification as well as personal financial and tax planning. Our directors and executive officers also may buy or sell additional shares outside of a Rule 10b5-1 plan when they are not in possession of material nonpublic information, subject to compliance with SEC rules, the terms of our insider trading policy and certain minimum holding requirements. \nDuring the quarterly period ended June 30, 2025, none of our directors or executive officers \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (each term as defined in Item 408 of Regulation S-K).\nAmendment of Bylaws\nOn August 6, 2025, the board of directors approved and adopted Resmed’s Ninth Amended and Restated Bylaws, effective as of such date. The Ninth Amended and Restated Bylaws, among other things, remove or modify certain limitations relating to stockholder action by written consent without a meeting, remove references to classified board of directors and include various other minor updates, including ministerial and conforming changes. \nThe foregoing summary of the Ninth Amended and Restated Bylaws does not purport to be complete and is qualified in its entirety by reference to the full text of the Ninth Amended and Restated Bylaws, a copy of which is attached hereto as Exhibit 3.2 and is incorporated herein by reference.\nITEM 9C DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n-107-\nTable of Contents\nPART III\nItems 10 – 14\nRESMED INC. AND SUBSIDIARIES\nPART III\nITEM 10 DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE \nInformation required by this Item is premised on information that will be included in our definitive proxy statement for our next annual meeting of stockholders, which will be filed with the SEC within 120 days after June 30, 2025. \nWe have filed as exhibits to this report for the year ended June 30, 2025, the certifications of our chief executive officer and chief financial officer required by Section 302 of the Sarbanes-Oxley Act of 2002. \nCode of Conduct\nWe have adopted a Code of Business Conduct & Ethics that applies to our board of directors and all of our employees, including our chief executive officer and principal financial officer.\nOur code of conduct is available at our website by visiting \nhttps://investor.resmed.com/\n and clicking through “Investors,” “Corporate Governance,” “Corporate Governance Documents,” and “Code of Conduct -English.” When required by the rules of the NYSE, or the SEC, we will disclose any future amendment to, or waiver of, any provision of the code of conduct for our chief executive officer and principal financial officer or any member or members of our board of directors on our website within four business days following the date of such amendment or waiver\nITEM 11 EXECUTIVE COMPENSATION \nInformation required by this Item is incorporated by reference from our definitive proxy statement for our next annual meeting of stockholders, which will be filed with the SEC within 120 days after June 30, 2025. \nITEM 12 SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS \nInformation required by this Item is incorporated by reference from our definitive proxy statement for our next annual meeting of stockholders, which will be filed with the SEC within 120 days after June 30, 2025. \nITEM 13 CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE \nInformation required by this Item is incorporated by reference from our definitive proxy statement for our next annual meeting of stockholders, which will be filed with the SEC within 120 days after June 30, 2025.\nITEM 14 PRINCIPAL ACCOUNTANT FEES AND SERVICES \nInformation required by this Item is incorporated by reference from our definitive proxy statement for our next annual meeting of stockholders, which will be filed with the SEC within 120 days after June 30, 2025. \n-108-\nTable of Contents\nPART IV\nItems 15 – 16\nRESMED INC. AND SUBSIDIARIES\nPART IV\nITEM 15 EXHIBITS AND CONSOLIDATED FINANCIAL STATEMENT SCHEDULES \nThe following documents are filed as part of this report: \n(a)\nConsolidated Financial Statements and Schedules – The index to our consolidated financial statements and schedules are set forth in the “Index to Consolidated Financial Statements” under Item 8 of this report.\n(b)\nExhibit Lists\n3.1\nFirst Restated Certificate of Incorporation of ResMed Inc., as amended. (Incorporated by reference to Exhibit 3.1 to the Registrant’s Report on Form 10-Q \nfiled on October\n 30, 2013)\n3.2\nNinth\n Amended and Restated Bylaws of ResMed Inc.\n, a Delaware Corporation (as Approved and \nA\ndopted \nby Bo\nard Resolution\n \nAugust 6\n, 202\n5\n)\n4.1\nForm of certificate evidencing shares of Common Stock. (Incorporated by reference to Exhibit 4.1 to the Registrant’s Registration Statement on Form S-1 (No. 33-91094) declared effective on June 1, 1995)\n4.2\nDescription of ResMed Inc.’s securities registered pursuant to Section 12 of the Securities Exchange Act of 1934. (Incorporated by reference to Exhibit 4.2 to the Registrant's Report on Form 10-K filed on August 9, 2024)\n10.1*\nForm of Indemnification Agreements for our directors and officers. (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on Form 8-K filed on June 24, 2009)\n10.2*\nForm of Access Agreement for directors. (Incorporated by reference to Exhibit 10.2 to the Registrant’s Report on Form 8-K filed on June 24, 2009)\n10.3*\nUpdated Form of Executive Agreement. (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on Form 10-Q filed on \nApril\n 2\n4\n, 2025)\n10.4*\nAmendment and Restatement to the ResMed Inc. 2009 Incentive Award Plan. (Incorporated by reference to Appendix B of ResMed Inc.’s Proxy Statement filed with the Securities and Exchange Commission on September 25, 2017)\n10.5*\nAmended and Restated ResMed Inc. Deferred Compensation Plan. (Incorporated by reference to Exhibit 10.5 to the Registrant's Report on Form 10-K filed on August 9, 2024)\n10.6*\nR\nesMed Inc. Non-Employee Director Deferral Program\n.\n (Incorporated by re\nference to \nExhibit \n10.1 to the Registrant's \nRe\nport on Form 10-Q filed on October 25, 2024)\n10.7*\nForm of Restricted Stock Unit Award Agreement for Directors.\n \n10.8*\nForm of Stock Option Award Agreement for Executive Officers.\n10.9*\nForm of Stock Option Award Agreement for Directors.\n \n10.10*\nForm of Performance-Based Restricted Stock Unit Award Agreement for Executive Officers.\n \n10.11*\nForm of Performance-Based Restricted Stock Unit Award Agreement for Executive Officers.\n \n10.12*\nForm of Restricted Stock Unit Award Agreement for Executive Officers.\n10.13\nSecond Amended and Restated Credit Agreement dated as of June 29, 2022, by and among ResMed Inc., as borrower, MUFG Union Bank, N.A., as administrative agent, joint lead arranger, sole book runner, swing line lender and letter of credit issuer, Westpac Banking Corporation, as syndication agent and joint lead arranger, HSBC Bank Australia Limited, as syndication agent and joint lead arranger, HSBC Bank USA, National Association, as syndication agent and joint lead arranger, Wells Fargo Bank, National Association, as documentation agent, and each of the lenders identified therein. (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on Form 8-K filed on June 29, 2022)\n10.14\nSecond Amended and Restated Unconditional Guaranty dated as of June 29, 2022, by each of the Revolving Facility Guarantors, in favor of MUFG Union Bank, N.A., in its capacity as administrative agent under the Revolving Credit Agreement. (Incorporated by reference to Exhibit 10.2 to the Registrant’s Report on Form 8-K filed on June 29, 2022)\n10.15\nSecond Amendment to Syndicated Facility Agreement and First Amendment to Unconditional Guaranty Agreement, dated as of June 29, 2022, by and among ResMed Pty Limited, as borrower, ResMed, Inc., the other parties party thereto, and MUFG Union Bank, N.A., as administrative agent. (Incorporated by reference to Exhibit 10.3 to the Registrant’s Report on Form 8-K filed on June 29, 2022)\n-109-\nTable of Contents\nPART IV\nItems 15 – 16\nRESMED INC. AND SUBSIDIARIES\n10.16\nUnconditional Guaranty dated as of April 17, 2018, by each of the guarantors identified on the Term Facility Guaranty’s signature pages as a guarantor, in favor of MUFG Union Bank, N.A., in its capacity as administrative agent under the Term Credit Agreement. (Incorporated by reference to Exhibit 10.4 to the Registrant’s Report on Form 8-K filed on April 19, 2018).\n10.17*\nThe ResMed Inc. 2018 Employee Stock Purchase Plan. (Incorporated by reference to Appendix B of ResMed Inc.’s Proxy Statement filed with the Securities and Exchange Commission on October 3, 2018.)\n10.18\nNote Purchase Agreement, dated July 10, 2019 by and among ResMed Inc. and the purchasers party to that agreement (including form of 3.24% Series A Senior Note due 2026, form of Series B 3.45% Senior Note due 2029, and form of Subsidiary Guaranty Agreement). (Incorporated by reference to Exhibit 10.1 to the Registrant’s Report on Form 8-K filed on July 15, 2019)\n19\nInsider Trading Policy and Guidelines. (Incorporated by reference to Exhibit 19 to the Registrant's Report on Form 10-K filed on August 9, 2024)\n21.1\nSubsidiaries of the Registrant.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n \n31.1\nCertification of Chief Executive Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002. \n31.2\nCertification of Chief Financial Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002. \n32.1\nCertification of Chief Executive Officer and Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. \n97\nCompensation Recovery Policy. (Incorporated by reference to Exhibit 97 to the Registrant's Report on Form 10-K filed on August 9, 2024)\n101\nThe following materials from ResMed Inc.’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025 formatted in Inline XBRL (Inline Extensible Business Reporting Language): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Income, (iii) the Consolidated Statements of Comprehensive Income, (iv) the Consolidated Statements of Stockholders' Equity, (v) the Consolidated Statements of Cash Flows and (vi) related notes.\n104\nThe cover page from ResMed Inc.’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025, formatted in Inline XBRL and contained in Exhibit 101.\n*\nManagement contract or compensatory plan or arrangement\nITEM 16 FORM 10-K SUMMARY\nNone.\n-110-\nTable of Contents\nPART IV\nSignatures\nRESMED INC. AND SUBSIDIARIES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized. \nDATED August 7, 2025\nResMed Inc. \n/s/ \nMICHAEL J. FARRELL\nMichael J. Farrell\nChief Executive Officer \n(Principal Executive Officer)\n-111-\nTable of Contents\nPART IV\nSignatures\nRESMED INC. AND SUBSIDIARIES\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. \nSIGNATURE\nTITLE\nDATE\n/S/ MICHAEL J. FARRELL\nChief Executive Officer and Chairman\nAugust 7, 2025\nMichael J. Farrell\n(Principal Executive Officer)\n/S/ BRETT A. SANDERCOCK\nChief Financial Officer\nAugust 7, 2025\nBrett A. Sandercock\n(Principal Financial Officer and\nPrincipal Accounting Officer)\n/S/ PETER C. FARRELL\nDirector and Chair Emeritus\nAugust 7, 2025\nPeter C. Farrell\n/S/ CAROL J. BURT\nDirector\nAugust 7, 2025\nCarol J. Burt\n/S/ CHRISTOPHER DELOREFICE\nDirector\nAugust 7, 2025\nChristopher DelOrefice\n/S/ KAREN DREXLER \nDirector\nAugust 7, 2025\nKaren Drexler\n/S/ HARJIT GILL\nDirector\nAugust 7, 2025\nHarjit Gill\n/S/ JOHN HERNANDEZ\nDirector\nAugust 7, 2025\nJohn Hernandez\n/S/ RICHARD SULPIZIO\nDirector\nAugust 7, 2025\nRichard Sulpizio\n/S/ DESNEY TAN\nDirector\nAugust 7, 2025\nDesney Tan\n/S/ RON TAYLOR\nDirector\nAugust 7, 2025\nRon Taylor\n/S/ JAN DE WITTE\nDirector\nAugust 7, 2025\nJan De Witte\n-112-"
  }
}