{
  "ticker": "ROK",
  "cik": "0001024478",
  "company_name": "ROCKWELL AUTOMATION, INC",
  "filing_date": "2025-11-12",
  "accession": "0001024478-25-000116",
  "primary_doc": "rok-20250930.htm",
  "item_sections": {
    "item1": "Item 1A. \nRisk Factors\n for more information.\n1\nTable of Contents\nItem 1. \nBusiness\nGeneral\nRockwell Automation, Inc. (Rockwell Automation or the Company) is the world’s largest company dedicated to industrial automation and digital transformation. We understand and simplify our customers’ complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. See Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n (MD&A)\n \nfor additional information on our business and long-term strategy.\nThe Company continues the business founded as the Allen-Bradley Company in 1903. The privately-owned Allen-Bradley Company was a leading North American manufacturer of industrial automation equipment when the former Rockwell International Corporation (RIC) purchased it in 1985. \nThe Company was incorporated in Delaware in connection with a tax-free reorganization completed on December 6, 1996, pursuant to which we divested our former aerospace and defense businesses (the A&D Business) to The Boeing Company (Boeing). In the reorganization, RIC contributed all of its businesses, other than the A&D Business, to the Company and distributed all capital stock of the Company to RIC’s shareowners. Boeing then acquired RIC. \nAs used herein, the terms “we”, “us”, “our”, “Rockwell Automation”, or the “Company” include wholly-owned and controlled majority-owned subsidiaries and predecessors unless the context indicates otherwise. Information included in this Annual Report on Form 10-K refers to our continuing businesses unless otherwise indicated.\nWhenever an Item of this Annual Report on Form 10-K refers to information in our Proxy Statement for our Annual Meeting of Shareowners to be held on February 10, 2026 (the Proxy Statement), or to information under specific captions in Item 7. \nMD&A\n, or in Item 8. \nFinancial Statements and Supplementary Data\n (the Consolidated Financial Statements), the information is incorporated in that Item by reference. All date references to years and quarters refer to our fiscal year and quarters, unless otherwise stated.\nOperating Segments\nWe have three operating segments: Intelligent Devices, Software & Control, and Lifecycle Services. The Intelligent Devices segment includes drives, motion, advanced material handling, safety, sensing, industrial components, and configured-to-order products. The Software & Control segment includes control and visualization software and hardware, digital twin, simulation and information software, and network and security infrastructure. The Lifecycle Services segment includes digital consulting, professional services including engineered-to-order solutions, recurring services including cybersecurity, safety, remote monitoring, and asset management, and the Sensia joint venture. \nOur operating segments share common sales, supply chain, and functional support organizations and conduct business globally. Major markets served by all segments consist of discrete end markets (e.g., Automotive including Electric Vehicle and Battery, Semiconductor, and e-Commerce & Warehouse Automation), hybrid end markets (e.g., Food & Beverage, Life Sciences, and Tire), and process end markets (e.g., Energy, Mining, and Chemicals). See Note 20 in the Consolidated Financial Statements for additional information on our operating segments.\nGeographic Information\nWe do business in more than 100 countries around the world. The largest sales outside the United States on a country of destination basis are in Canada, China, Italy, the United Kingdom, and Mexico. See",
    "item1a": "Item 1A. \nRisk Factors\n.\nThe Company’s Disclosure Committee is a part of the cybersecurity risk program as it meets quarterly to review cyber incidents that have occurred during the quarter, and additionally, as needed, to discuss any potentially material cybersecurity incidents. The Disclosure Committee, which includes senior leaders from finance and accounting, legal, investor relations, and corporate communications, is responsible for determining if risks from cybersecurity threats have materially affected or are reasonably likely to materially affect, the organization such that public disclosure is necessary. Additional management governance is provided by an Enterprise Security Council, comprised of key senior business leadership with diverse experiences and responsibilities. The Enterprise Security Council oversees key cybersecurity and product security matters and initiatives, including policy, standards, strategy, program metrics, and cybersecurity risk escalation.\nCybersecurity oversight by the \nBoard of Directors\n is shared between the full Board and the Audit Committee. The full Board of Directors receives periodic updates on the cybersecurity threat landscape, recent cybersecurity events, our cybersecurity strategy, and cybersecurity program priorities.\n \nThe Audit Committee receives updates on information security, including internal controls and external reporting processes. The Audit Committee also receives updates from the Disclosure Committee with respect to cybersecurity incidents reviewed by the Disclosure Committee.\n \n12\nTable of Contents",
    "item1b": "Item 1B. \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C. \nCybersecurity\nRisk Management and Strategy\nThe Company has a cybersecurity risk management program designed to assess, identify, manage, and govern risks from cybersecurity threats. \nOur cybersecurity risk management program is a key component of our overall enterprise risk management strategy.\n The Company’s cybersecurity risk management program focuses on risk and threat identification, protection, detection, response, and recovery, designed to protect the confidentiality, integrity, and availability of critical systems and data. The Company’s cybersecurity incident response and crisis management plans are components of the cybersecurity risk management program, focusing on effective response to cybersecurity incidents or attacks. We monitor our internal technology for cybersecurity threats, and we use various security capabilities to mitigate the risk of these threats. Additionally, the Company provides annual cybersecurity and information security awareness training for all employees and contractors. \nThe Company maintains a robust, risk-based approach to identifying and overseeing cybersecurity risks presented by third parties, including vendors, service providers, and other external users of the Company’s systems, as well as the systems of third parties that could adversely impact our business in the event of a cybersecurity incident affecting those third-party systems.\n \nGovernance \nThe Company’s cybersecurity program is led by the \nChief Information Security Officer (CISO)\n. \nOur CISO has more than 30 years of technology and cybersecurity leadership experience and is a Certified Information System Security Professional (CISSP), and a Certified Information Systems Auditor (CISA).\n The CISO reports to the Chief Information Officer (CIO).\n The CISO leads a team that is responsible for executing cybersecurity strategy, to support risk management, and protection of Company systems, products, and employee and customer information. As the foundation of the cybersecurity program, the Company maintains cybersecurity policies and procedures that are informed by recognized security frameworks and applicable regulations, laws, and standards. We use various frameworks, standards, guidelines, and best practices as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business. \nThe Company engages third parties to assess our cybersecurity posture and program maturity.\n \nWe also consider cybersecurity, along with other top risks for the Company, within our ERM framework. The ERM framework includes internal reporting at the business and enterprise levels, with consideration of key risk indicators, trends, and countermeasures for cybersecurity and other types of significant risks. \nDuring the year ended September 30, 2025, the Company has not identified risks from cybersecurity threats, including as a result of prior cybersecurity incidents, that have materially affected or are reasonably likely to materially affect the Company, including its business strategy, results of operations, or financial condition.\n Nevertheless, the Company recognizes cybersecurity threats are ongoing and evolving, and we continue to remain vigilant. For more information on the Company’s cybersecurity-related risks, see"
  }
}