{
  "ticker": "ROL",
  "cik": "0000084839",
  "company_name": "ROLLINS INC",
  "filing_date": "2025-02-13",
  "accession": "0000084839-25-000024",
  "primary_doc": "rol-20241231.htm",
  "item_sections": {
    "item1": "Item 1.    Business\nGeneral Overview\nRollins, Inc. (“Rollins,” “we,” “us,” “our,” or the “Company”), is an international services company headquartered in Atlanta, Georgia. Through our family of leading brands, we provide essential pest and wildlife control services and protection against termite damage, rodents and insects to more than two million residential and commercial customers from more than 800 Company-owned and franchised locations in approximately 70 countries. Over the course of our lengthy operating history, we have garnered a reputation for providing great customer service. The contracted and recurring nature of our services provide us with visibility into a significant portion of our future revenue.\nIn 1964, brothers O. Wayne and John Rollins acquired Orkin Exterminating Company and in 1965 we changed our name from Rollins Broadcasting, Inc to Rollins, Inc. In 1968, Rollins began trading on the New York Stock Exchange under the symbol “ROL.” Since then, we have grown into a premier consumer and commercial services business with numerous industry leading brands including the world renowned Orkin, as well as HomeTeam Pest Defense, Clark Pest Control, Western Pest Services, Critter Control Wildlife, Northwest Exterminating, and Fox Pest Control, among others.\nPest control generally consists of assessing a customer's property for conditions that invite pests, tackling current infestations, and stopping the life cycle to prevent future invaders. Termite protection programs include liquid treatments, wet and dry foam applications, termite baiting and wood treatments. We operate under one reportable segment which contains our three service offerings: \n•\nResidential\n: Pest control services protecting residential properties from common pests, including rodents, insects and wildlife; \n•\nCommercial\n: Workplace pest control solutions for customers across diverse end markets such as healthcare, food service, logistics; and \n•\nTermite and Ancillary\n: Termite protection services and ancillary services (wildlife exclusion, crawlspace encapsulation and moisture remediation, insulation) for both residential and commercial customers.\nRisk factors associated with our business are discussed in Item 1.A. \"Risk Factors.\"\nOur Strategic Objectives\nWe regularly assess the business environment, as well as our own strengths and opportunities, and have aligned around key strategic objectives that will help us to drive continued success for Rollins. \nPeople First\nWe promote a people first mindset that prioritizes the well-being and development of the individual, as well as our collective team, in all aspects of our business. To provide our customers with the best customer experience, we must focus on cultivating our position as the employer of choice in our industry. This means not only investing in competitive wages and benefits, but also providing tools, training and development opportunities that drive a high level of teammate engagement.\nCustomer Loyalty\nWe focus on creating the best customer experience that will enable a loyal customer base and in turn reduce the amount of churn across our customer base. This starts with our people and the interactions they have with our customers. By focusing on this key objective, we expect it to enable growth that will outpace our market growth. \nGrowth Mindset\nA growth mindset helps us consider ways to improve and best position our business. Our focus here is to identify changes that may present both risks and opportunities to our business. We focus on evaluating changes in the markets we compete \n3\nTable of Contents\nin but also across other industries to continue to identify changing dynamics that may impact our people and our customers that may impact our position in the markets we compete.\nOperational Efficiency\nAs a complement to our growth mindset, our dedication to continuous improvement and operational efficiency is another key tenet of our strategy and culture. We approach our operations from the perspective that everything we do can be improved upon. We are constantly striving to improve our service levels by optimizing our business model and modernizing our business.\nWe believe that our alignment around the key strategic areas will enable us to grow faster than our market, position our business for the future, and deliver value for all stakeholders, including our customers, our teammates, our communities and our shareholders. \nOur Competitive Strengths\nRollins is a leader in the global pest control market. We have established a portfolio of premier brands with extensive service capabilities across a deep operating network with a focus on our core pest control market. Our scale enables delivery of great service and provides a significant and reinforcing competitive advantage through (i) comprehensive capabilities to win new residential and commercial accounts, (ii) technology investments for operations optimization and enhanced customer experience, (iii) a diverse portfolio of brands of varying sizes of which to innovate, test, learn, and grow or expand, particularly when it comes to emerging technology, (iv) route density to manage variable costs, and (v) financial flexibility to generate organic growth and pursue acquisitions.\nRobust Operating Platform with Proprietary Technology\nOur extensive footprint creates an efficient and scalable operating platform to facilitate exceptional customer service delivery, increased cross-selling opportunities, and cost efficiencies. We have strategically invested in proprietary routing and scheduling technologies to increase our competitive advantage, which includes real-time service tracking and customer internet communication to personalize the customer experience. The majority of our business runs on our proprietary Branch Operating Support System (“BOSS”), which offers a back-end interface to facilitate service tracking and payment processing for technicians. BOSS also provides virtual route management tools to increase route efficiency across our network, reducing miles driven and associated costs while increasing customer retention through on-time and rapid response service. We have made investments to evolve and modernize BOSS capabilities to standardize for efficiency, while continuing to deliver differentiating and exceptional customer and employee experiences. Additionally, InSite, a proprietary web reporting capability unique to our commercial customers, provides a competitive advantage and supports the growth of our commercial division.\nDifferentiated Employee Base and Service Delivery\nOur teammates are critical to delivering an outstanding customer experience, and we are highly focused on providing our team with best-in-class training and development opportunities. We operate the 27,000 square foot Rollins Learning Center training facility located in Atlanta, GA, which is a distance-learning and global broadcast facility with simulated environments and classrooms for training. In addition to in-person training, the Rollins Learning Center offers on-demand training sessions that teammates can access from anywhere in the world that are produced at our on-site, state-of-the-art broadcast studio. Our unique programs contribute to our position as an employer of choice and have earned us recognition from Training magazine among the Top 125 U.S. Training Companies 17 times in the past 22 years. We continuously monitor co-worker engagement and customer loyalty.\nExperienced Management Team\nOur management team combines extensive business and consumer services experience with robust local pest control leadership. Consistent with our culture of attracting, developing and progressing talented individuals, our senior leadership team consists of a combination of long-term internal leaders and strategic hires from well-respected external platforms. \nOur Executive Chairman Emeritus, Gary Rollins, is the son of Rollins, Inc. co-founder O. Wayne Rollins and has spent his entire career with the Company, serving as Chief Executive Officer (“CEO”) from 2001 to 2022 and Executive Chairman \n4\nTable of Contents\nfrom 2020 to 2024. John Wilson, having served in various roles of increasing responsibility at the Company for over 27 years, currently serves as Executive Chairman of the Company effective January 1, 2025. \nJerry Gahlhoff, Jr. currently serves as President and CEO. Mr. Gahlhoff joined the Company as part of the HomeTeam acquisition in 2008. Mr. Gahlhoff has extensive knowledge of the Company’s business and industry, having served in various roles of increasing responsibility at HomeTeam and the Company, collectively, for over 23 years. He is also a trained Entomologist. \nAdditional members of our Executive Leadership Team include:\n•\nKenneth Krause has served as the Executive Vice President and Chief Financial Officer of the Company since September 2022. Mr. Krause brings over nine years of public company Chief Financial Officer experience and over 21 years of global finance and strategy experience. \n•\nElizabeth Chandler joined the Company in 2013 and currently serves as our Chief Legal Officer. Ms. Chandler brings over 36 years of legal experience. \n•\nPat Chrzanowski, President of Orkin US, joined the Company in 2007 and has over 22 years of pest control experience. \n•\nStanford Phillips, President of Rollins Brands, joined the Company in 2017 and has over 20 years of pest control experience. \n•\nThomas Tesh joined the Company in 2012 and currently serves as Senior Group Vice President and Chief Administrative Officer. Mr. Tesh brings over 24 years of pest control experience. \n•\nRenee Pearson joined the Company in 2023 and currently serves as Group Vice President and Chief Information Officer. Ms. Pearson brings over 20 years of information technology leadership experience. \n•\nClay Scherer joined the Company in 2024 and currently serves as Group Vice President, Technical Services. Mr. Scherer brings over 30 years of global pest markets experience. \n•\nJamie Benton joined the Company in 2014 and currently serves as Group Vice President, Human Resources. Mr. Benton brings 22 years of Human Resources experience.\nInternational Business\nWe continue to expand our international presence through organic growth, acquisitions, and our international franchise programs. In 2024, we saw revenue growth in our company-owned operations in Canada, Australia, the United Kingdom, and Singapore. We believe geographic diversity allows us to increase brand recognition, meet demands of global customers, and draw on business and technical expertise from teams in several countries, and offers us an opportunity to access new markets.\nFranchising Programs\nWe have franchise programs through Orkin, Critter Control, MissQuito, and our Australian subsidiaries. We had a total of 140 domestic franchise agreements as of December 31, 2024. International franchise agreements totaled 87 as of December 31, 2024. Transactions with our franchises involve sales of territories and customer contracts to establish new franchises and the payment of initial franchise fees and royalties by franchisees. The territories, customer contracts and initial franchise fees are typically paid for by a combination of cash and notes. \nAcquisition Strategy\nWe have extensive experience acquiring companies of all sizes. Over the last three years, we have completed 99 acquisitions, including 44 acquisitions in 2024. Our acquisition strategy targets high quality, profitable businesses with strong leadership, a healthy level of brand awareness, and customer loyalty in the markets they serve that would benefit from incremental growth capital and have the potential to achieve organic growth and margin expansion.\n5\nTable of Contents\nSeasonality \nOur business is affected by weather conditions, including climate change and the seasonal nature of our pest and termite control services. The increase in pest presence and activity, as well as the metamorphosis of termites in the spring and summer (the occurrence of which is determined by the timing of the change in seasons), has historically resulted in an increase in the revenue of our pest and termite control operations during such periods as evidenced by the following table.\nConsolidated Net Revenues\n(in thousands)\n2024\n2023\n2022\nFirst Quarter\n$\n748,349\n \n$\n658,015 \n$\n590,680 \nSecond Quarter\n891,920\n \n820,750 \n714,049 \nThird Quarter\n916,270\n \n840,427 \n729,704 \nFourth Quarter\n832,169\n \n754,086 \n661,390 \nYear to date\n$\n3,388,708\n \n$\n3,073,278 \n$\n2,695,823 \nOur quarterly profitability correlates with our revenue due to seasonality, as profit is lower in the first and fourth quarters and higher in the second and third quarters.\nMaterials and Supplies\nOur Company has relationships with a vast network of national pest control product distributors, manufacturers and other suppliers for pest and termite treatment products. We maintain a sufficient level of products, materials, and other supplies to fulfill our immediate servicing needs and to mitigate any potential short-term shortage in availability from our national network of suppliers. We also have qualified comparable products and materials for key categories to have alternatives ready as needed. However, at any time supply chain disruptions that are more than short-term in nature could impact our levels of products, materials and other supplies. We proactively work with our supplier base and in 2024, we hosted a Partner Summit, with over 30 of our top suppliers in attendance at our corporate headquarters, to enhance collaboration and strategic relationships.\nCompetition\nWe operate in a highly competitive environment with fragmented markets and low barriers to entry. The principal factors of competition in our pest and termite control markets are quality and speed of service, customer proximity, customer satisfaction, brand awareness and reputation, terms of guarantees, safety, technical proficiency and price. Due to our strong direct partnerships with product manufacturers, distributors, and visibility into the inventories, ordering and distribution of materials and supplies, we are able to foresee potential supply disruptions and to quickly adapt. The use of an innovative and industry changing distribution model and technology enables us to maintain adequate supplies for our field operations without a significant investment in warehousing and inventory\n.\nWe believe that, through our wholly-owned subsidiaries, we compete effectively and favorably with our competitors as one of the world’s largest pest and termite control companies. Our major competitors include Rentokil, Ecolab, Anticimex, and numerous other regional and local companies.\nResearch and Development\nOur expenditures on research activities relating to the development of new products or services are not significant. We utilize the relationships with our manufacturers and materials suppliers to provide new and innovative products and services, coupled with in-depth reviews by our tenured Entomology Department to confirm they meet our strict requirements. We also conduct evaluations of new products with the specific manufacturers of such products and we rely on research performed by leading universities. \nWe maintain close relationships with several universities for research and validation of treatment procedures and material selection. Some of the new and improved service methods and products are also researched, developed and produced by unaffiliated universities and companies with a portion of these methods and products being produced to the specifications provided by us.\n6\nTable of Contents\nHuman Capital\nWe believe one of the largest contributors to our Company’s success is the quality of our people. Attracting, developing and retaining high-quality talent is the primary objective of our human capital management strategy. The development and retention of high-quality talent enables a better customer experience and improved customer retention. We develop and engage our people through our training at all levels of our organization.\nAs of December 31, 2024, the Company had 20,265 employees. Approximately 18,270 of our employees were located in the United States, with approximately 16,250 employees at U.S. branch offices. Of the U.S. employees, less than 2% are represented by a labor union or covered by a collective bargaining agreement.\nAt December 31, \n2024\n2023\n2022\nEmployees\n20,265\n19,031\n17,515\nLeadership Development\nEach Rollins brand cultivates its own leadership development programs that support its own values and culture while considering the best practices of all Rollins brands. Our leaders are trained on the fundamentals of people leadership, business acumen, sales excellence, and technical expertise. Having the right leaders at all levels of our organization is critical to our current and future success. This includes establishing effective succession planning to support our business growth plans. While each of our brands is focused on developing operational leadership capabilities that are brand-specific, Rollins is focused on developing overall leadership capabilities through our Region Manager Development Program (RMDP). The RMDP is a comprehensive leadership development program for mid-level leaders across the organization who lead multiple business units or departments and those preparing to lead at that level. The 12-month program offers a blended learning approach that includes facilitator-led training, executive and peer mentoring, immersive field learning experiences, 360-degree assessments, a 6-month executive coaching engagement, and supported individualized development plans. Since the program was established in 2018, we have graduated a total of 112 senior leaders in six different RMDP classes with continued successes.\nWorkplace Inclusion\nWe make it a priority to promote and create an inclusive workplace that results in higher levels of satisfaction and engagement, stronger staff retention, higher productivity, and a heightened sense of belonging. Our mission is to foster a culture of inclusion, where all individuals feel respected, are treated fairly, with an opportunity to excel. \nOur Workplace Inclusion (WPI) mission to build an inclusive workplace has continued under the guidance of our Executive Sponsor and Inclusion Advisory Council which is made up of teammates from Rollins brands across the United States. In January 2022, we hired a Director of WPI. The Director’s primary role is to implement the WPI Strategic Plan (the “Plan”) which was approved by the Executive Leadership team in April of 2022. In April of 2024, we integrated responsibility for Workplace Inclusion to our Talent Management department, and in June of 2024, we hired a Senior Manager of Workplace Inclusion. \nThe Plan includes 5 Strategic Focus Areas to be implemented across all brands. The 5 Strategic Focus areas are Training & Education, Talent Acquisition & Career Development, Policies & Programs, Communication, and Employee Resource Groups (ERGs). \nOur ERGs, led by Rollins teammates, are inclusive to all and represent our employee population. Each ERG provides a platform for teammates to connect, collaborate, and advocate for their shared interests and experiences. These groups promote inclusivity, provide networking opportunities, and contribute to a sense of belonging among teammates. We have established five ERGs:\n•\nR-Collective: Strives to improve company culture and teammate engagement and retention through multigenerational networking.\n•\nWomen+ Resource Community: Provides a resource for women+ at any career level to achieve their goals and celebrate their accomplishments resulting in an enhanced work experience at Rollins.\n7\nTable of Contents\n•\nWomen's Impact Network (WIN): Increases communication between the women of Orkin by providing opportunities for professional development, mentoring, and networking.\n•\nPRIDE: Provides a network that supports the professional development of LGBTQ+ teammates and allies, promotes recruitment and retention, and builds community.\n•\nP.E.A.C.E.: Promoting Equality, Acceptance and Cultural Empowerment through networking, team building, and allyship to foster an inclusive and respectful environment that celebrates the diverse cultures represented within the workforce.\nWe are excited about the accomplishments on our journey to create a workplace of inclusion and will continue to execute on the strategic plan.\nHealth and Safety\nWe are committed to the health and safety of our teammates, customers and communities where we work, live and play. Rollins undertakes a variety of efforts to support the health and well-being of our teammates, including their physical and mental health. This includes investing in competitive compensation and benefits while also providing the culture, tools, training and development opportunities to make working at Rollins an enjoyable and rewarding experience. Adapting to feedback provided by our teammates about the needs of themselves and their families, in 2023, we increased our investment in mental health and wellness services that are offered at no cost. Other benefits include our Employee Stock Purchase Program (ESPP), personal finance education and advisory services, assistance programs to help with managing personal and work-life challenges, family support programs, and educational assistance. \nIn 2022, we formed a partnership with Marathon Health (formerly Everside Health) to build an on-site medical clinic at our Rollins Support Center in Atlanta. That clinic provides no-cost primary care to Rollins teammates who participate in one of our medical plans in the state of Georgia. Marathon Health provides these services either virtually or through the existing nationwide network of Marathon Health clinics for all our teammates participating in one of our insurance plans in the U.S. This is an enhanced medical benefit, provided at no cost to teammates.\nWe motivate our teammates to be leaders in safety by continuously evaluating and improving our safety performance, implementing best practices, monitoring regulations and encouraging safety excellence in everything we do. We set measurable safety goals and have made improvements so that our tracking is timely and user friendly for our field leaders. In 2024, we continued our focus on improving driver safety scores. These scores are calculated using an application that monitors driving behaviors once a vehicle is in motion, detecting positive and negative driving maneuvers related to acceleration, braking, distractions, and speed. This resulted in improvement in our average driver safety score for 2024. In addition, we launched several training programs for our new teammates focused on driver safety as well as general safety onboarding.\nWe have an established safety governance structure that helps our company prioritize measures to progressively reduce motor vehicle collision and injury-related risk. We have established an ongoing process that requires commitment, communication, and collaboration at all levels of the organization. Our structure is designed to support effectiveness and alignment with our organization’s goals and objectives. \nWe review and refine our health and safety policies and procedures on an ongoing basis so that they remain efficient and relevant for our business. \nCommunity Involvement\nWe are a family of brands that has always upheld service – to our teammates, customers, and communities – as a cornerstone. While each of our diverse brands has their own culture of service, we are firmly united in our commitment to engaging with our local communities.\nWe offer teammates the opportunity to participate in various community outreach programs. Our brands work closely with their local communities to create an impact through outreach, volunteerism, and donations. Our overarching goal is to create a significant impact in local communities over an extended period of time. We believe everyone deserves a safe place to live, work, and play.\n8\nTable of Contents\nSince 1985, we have partnered with the United Way of Greater Atlanta through employee and company-matching funds, helping make Rollins a community leader for many years. Rollins ranked #8 in the top 25 corporate contributors in both 2024 and 2023 compared to ranking #7 and #9 in 2022 and 2021, respectively. Rollins is proud to be #6 in corporate contributors to United Way’s Child Well-Being Mission Fund for 2024. \nAlong with personal contributions from teammates, the Company hosts rallies, golf tournaments, contests, and silent auctions to raise funds for the United Way of Greater Atlanta, as well as other local organizations it supports. Rollins has contributed approximately $1 million annually for each of the past 5 years in support of local community outreach.\nWe have a partnership with the Grove Park Foundation (the “Foundation”) to help serve our Atlanta community. The partnership allows our teammates to volunteer and support the Foundation, which is committed to neighborhood revitalization, education programs, and job training that improves the quality of life in the Grove Park neighborhood, a predominantly African American community. Our support helps fund both a volunteer coordinator for the Foundation and community service events hosted for the citizens of Grove Park. Teammates from our Atlanta family of brands participate in volunteer opportunities in the Grove Park neighborhood throughout the year.\nOur Orkin brand demonstrates its culture of service through its OrkinServes program, which is designed to help take care of communities through employee volunteer opportunities. In 2022, OrkinServes introduced five new Division Advocates to serve as a voice for volunteering within their divisions across the United States and Canada. Similarly, our Northwest Exterminating brand developed the Northwest Good Deed Team (\"GDT\") in 2011 with the focus of being active and involved in the communities where they serve. Led by two full-time teammates, the GDT works with local organizations across six states and is supported by our team across Northwest. \nRegulatory Considerations\nOur business is subject to various local and national legislative and regulatory enactments including, but not limited to, environmental laws, antitrust laws, employment and benefit laws (including wage and hour laws, payroll taxes, anti-discrimination laws, pension laws and regulations, and ERISA), immigration laws, motor vehicle laws and regulations, human health and safety laws, securities laws including, but not limited to, SEC regulations, and federal, state and local laws and regulations governing worker safety and the pest and termite control industry. If we were to fail to comply with any of these applicable laws or regulations, we could be subject to substantial fines or damages, be involved in lawsuits, enforcement actions and other claims by third parties or governmental authorities, suffer losses to our reputation and our business or suffer the loss of licenses or penalties that may affect how the business is operated. \nConsumer Protection, Privacy and Solicitation Matters\nWe are subject to international, federal, state, provincial and local laws and regulations designed to protect consumers generally, including laws governing lending, debt collection and consumer finance; consumer privacy and fraud; collection and use of consumer data; laws governing billing practices and contract renewals; telemarketing; and other forms of solicitation. Specifically, rules adopted by the Federal Communications Commission and Federal Trade Commission, including the Telephone Consumer Protection Act and the Telemarketing Sales Rule, along with state laws and other legal authorities, govern our telephone and texting sales practices. The CAN-SPAM Act regulates our email solicitations, and the Consumer Review Fairness Act regulates consumer opinions on social media regarding our products and services. The California Consumer Privacy Act, including amendments under the California Privacy Rights Act, and laws in other states provide consumers and sometimes employees the right to know what personal data businesses collect, how the data is used, and give them the right to access, delete and opt out of the sale of their personal information to third parties. We are subject to some of these states’ laws depending on the number of customers or amount of revenue in the specific state. Similarly, we are bound by foreign laws and regulations governing data protection in the United Kingdom (UK General Data Protection Regulation and Data Protection Act 2018; Canada (Personal Information Protection and Electronic Documents Act); Australia (Privacy Act and its Australian Privacy Principles); and Singapore (Personal Data Protection Act and Spam Control Act), when applicable.\nEnvironmental, Health and Safety Matters\nSpecifically, our businesses are subject to various international, federal, state and local laws and regulations regarding environmental, health and safety matters. Among other things, these laws regulate the emission or discharge of materials into the environment, govern the use, storage, treatment, disposal, transportation and management of hazardous substances and wastes and protect the health and safety of our employees. In addition, the use of certain pesticide products is also \n9\nTable of Contents\nregulated by various federal, state, provincial and local environmental and public health agencies. These laws also impose liability for the costs of investigating and remediating, and damages resulting from, present and past releases of hazardous substances, including releases by prior owners or operators of sites we currently own or operate. Compliance with environmental, health and safety laws increases our operating costs, limits or restricts the services we provide and subjects us to the possibility of regulatory or private actions or proceedings. Penalties for noncompliance with these laws may include criminal sanctions or civil remedies, including, but not limited to, cancellation of licenses, fines, and other corrective actions. Noncompliance with, changes in, expanded enforcement of, or adoption of new laws and regulations governing hazardous waste disposal and other environmental matters, could result in operational changes and increased costs.\nFranchise Matters\nCertain of our subsidiaries are subject to various international, federal, state, provincial and local laws and regulations governing franchise sales, marketing and licensing and franchise trade practices generally, including applicable rules and regulations of the Federal Trade Commission. These laws and regulations generally require disclosure of business information in connection with the sale and licensing of our franchises. Certain state regulations also affect our ability as a franchisor to revoke or refuse to renew a franchise. From time to time, we and one or more franchisees have been, and may in the future become, involved in a dispute regarding the franchise relationship, including payment of royalties or fees, location of branches, advertising, purchase of products by franchisees, non-competition covenants, compliance with our standards or franchise renewal criteria.\nEmployment Laws\nWe are subject to a myriad of complex laws and regulations in the various federal, state, provincial, regional, and local governments in the countries in which we operate related to employees, including, but not limited to wage and hour laws, anti-discrimination laws, immigration, pension benefit plans, ERISA laws, and retirement benefits. Any failure to comply with such applicable laws or regulations could result in fines or legal proceedings.\nIntellectual Property\nWe rely on a combination of intellectual property rights, including a patent, trademarks, copyrights, trade secrets, and contractual provisions to protect our intellectual property. Our worldwide intellectual property portfolio is strengthened through innovation and brand recognition, and a comprehensive approach for protection and enforcement. \nWe protect and promote our intellectual property portfolio and take those actions we deem appropriate to enforce our intellectual property rights and to defend our rights both domestically and internationally. Although in the aggregate, our global portfolio of more than 450 trademarks is a valuable asset that is important to our operations, we believe that our competitive advantage is also largely attributable to the technical, marketing, and sales competence and capabilities of our teammates, rather than on any individual trademark; however, the loss of the Orkin trademark could be material to our business as a whole.\nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to these reports, are available free of charge on our website at www.rollins.com, under the heading “SEC Filings,” as soon as reasonably practicable after those reports are electronically filed with or furnished to the Securities and Exchange Commission (“SEC”).\nItem 1.A.    Risk Factors\nAn investment in our common stock involves certain risks. Before making an investment decision, you should carefully consider the following risks and all of the other information included in this Annual Report on Form 10-K. Our business, reputation, financial condition, results of operations, or cash flows could be materially adversely affected by any of these risks. The trading price of our common stock could decline due to any of these risks, and you may lose all or part of your investment. This Annual Report on Form 10-K also contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of certain factors, including the risks faced by us described below and elsewhere in this Annual Report on Form 10-K. You are cautioned that the risk factors discussed below are not exhaustive. \n10\nTable of Contents\nRisks Related to our Business, Brand, Industry and Operations\nWe face risks regarding our ability to compete in the pest control industry in the future.\nWe operate in a highly competitive industry with fragmented markets and low barriers to entry. Our revenues and earnings are affected by changes in competitors’ services, markets, and prices and general economic issues. We compete with other large pest control companies, as well as numerous smaller pest control companies and do-it-yourself options, for a finite number of customers. We believe that the principal competitive factors in the market areas that we serve are quality and speed of service, customer proximity, customer satisfaction, brand awareness and reputation, terms of guarantees, technical proficiency and price. Although we believe that our customer experience and quality service are excellent, we cannot assure investors that we will be able to maintain our competitive position in the future.\nWe may not be able to identify, complete or successfully onboard acquisitions or guarantee that any acquisitions will achieve the anticipated financial benefits.\nAcquisitions have been and may continue to be an important element of our business strategy. We cannot assure investors that we will be able to identify and acquire acceptable acquisition targets on terms favorable to us in the future, that we will receive necessary regulatory approvals, or that any acquisitions will achieve the anticipated financial benefits. Our inability to achieve the anticipated financial benefits from any acquisition transactions may not be realized due to any number of factors, including, but not limited to, unsuccessful onboarding efforts, unexpected or underestimated liabilities or increased costs, fees, expenses and charges related to such transactions. Such adverse events could result in a decrease in the estimated fair value of goodwill or other intangible assets established as a result of such transactions, triggering an impairment.\nOur business depends on our strong brands, and failing to maintain and enhance our brands and develop a positive client reputation and experience could hurt our ability to retain and expand our base of customers.\nOur strong brands, such as Orkin, HomeTeam Pest Defense, Clark Pest Control, Northwest Exterminating, Fox Pest Control, Trutech, Western Pest Services, The Industrial Fumigant Company (IFC), Waltham Services, Okolona Pest Control (OPC), and Critter Control, have significantly contributed to the success of our business. Maintaining and enhancing our brands increases our ability to enter new markets and launch new and innovative services that better serve the needs of our customers. Our brands may be negatively impacted by a number of factors, including, among others, reputational issues, product/technical failures, and customer experience. We continue to develop strategies and innovative tools to gain a deeper understanding of customer acquisition and retention in order to more effectively expand and retain our customer base. Maintaining and enhancing our brands will depend largely on our brands’ ability to remain service leaders and continue to provide high-quality pest control services that are truly beneficial and play a meaningful role in people’s lives.\nLabor shortages, our ability to attract and retain skilled workers, and increased labor costs may impair growth potential and profitability.\nOur ability to remain productive and profitable will depend substantially on our ability to compete with other pest control and service companies to attract, adequately train, and retain skilled workers and key employees (including executive officers), and create leadership opportunities. Our ability to expand our operations is in part impacted by our ability to increase our labor force. The demand for employees is high, and the supply is limited. Ongoing labor shortages could negatively affect our ability to efficiently operate at full capacity or lead to increased costs, such as increased overtime to meet demand and increased wage rates to attract and retain employees. A significant increase in the wages paid and benefits offered by competing employers could also result in a reduction in our labor force, increases in our labor costs, or both. Prolonged labor shortages, increased turnover or labor inflation could diminish our profitability and impair our growth potential.\nIn addition, decisions and rules by the National Labor Relations Board, including “expedited elections” and restrictions on appeals, has and could continue to lead to increased organizing activities at our brands. If these labor organizing activities are successful, it could further increase labor costs, decrease operating efficiency and productivity in the future, or otherwise disrupt or negatively impact our operations which could have a material adverse effect on our reputation and business.\n11\nTable of Contents\nWe may experience difficulties integrating, streamlining and optimizing our information technology (“IT”) systems and processes.\nWe have invested in, and expect to continue to invest in, new systems and technology to implement new or improve existing business capabilities and streamline business processes, financial reporting, and acquisition integration. Many of these efforts impact customers, suppliers, employees, and others, and any disruption or failure could adversely affect our business and operations. We may experience significant delays, increased costs, and other difficulties, which could adversely affect our ability to process work orders, send invoices, track, and collect payments, fulfill contractual obligations, or otherwise operate our business in compliance with laws. In addition, our efforts to centralize various business processes within our organization in connection with the implementations may disrupt operations. We may also experience difficulties, costs or delays in migrating acquired businesses to our systems, processes, and technologies.\nDistributor or supply chain issues may result in product shortages or disruptions to our business.\nWe have a complex global network of distributors and suppliers that has expanded to meet increased customer demand and may, in the future, further evolve in response to market conditions. Although the majority of the products we use are generally available from multiple sources, and alternatives have been generally available in the event of disruption in the past, we could experience material disruptions in production, transportation, labor disputes, and other supply chain issues on specific products, which could result in out-of-stock conditions, and our results of operations and relationships with customers could be adversely affected (a) if new or existing distributors or suppliers are unable to meet any standards that we set or that are set by government or industry regulations or customers, (b) if we are unable to contract with distributors or suppliers at the quantity, quality and price levels needed for our business, or (c) if any of our key distributors or suppliers has shipping disruptions or becomes insolvent, ceases or significantly reduces its operations or experiences financial distress.\nOur inability to fully or substantially meet customer demand due to distributor or supply chain issues could result in, among other things, unmet consumer demand leading to reduced preference for our products or services in the future, customers' purchasing services from competitors, strained customer relationships, termination of customer contracts, additional competition and new entrants into the market, and loss of potential sales and revenue.\nClimate change and unfavorable weather conditions could adversely impact our financial results.\nOur operations are directly impacted by the weather conditions worldwide, including catastrophic events, natural disasters and potential impacts from climate change. Our business is also affected by extreme weather such as hurricanes, wildfires, and other storms which can impact our ability to operate as well as drought which can greatly reduce the pest population for extended periods. Climate change continues to receive increasing global attention. The possible effects of climate change could include changes in rainfall patterns, water shortages, changing storm patterns and intensities, changing temperature levels, as well as changes in legislation, regulation, and international accords, all of which could adversely impact our costs and business operations. Our business is also affected by seasonality associated with our pest and termite control services. The increase in pest presence and activity, as well as the metamorphosis of termites in the spring and summer (the occurrence of which is determined by the timing of the change in seasons), has historically resulted in an increase in the revenue and income of our pest and termite control operations during such periods. \nWe may not successfully execute our business strategies, including achieving our growth objectives.\nWe may not be able to fully implement our business strategies or realize, in whole or in part within the expected time frames, the anticipated benefits of various growth or other initiatives. Our ability to implement our business strategy may be adversely affected by factors that we cannot foresee currently, such as unanticipated costs and expenses, global health crises, technological change, recession and economic slowdown, the level of interest rates, foreign exchange risks, our inability to effectively manage and implement change, failure to onboard acquisitions, or a decline in the effectiveness of our marketing (including digital marketing) efforts. \nIn addition, we will incur certain costs to achieve efficiency improvements, systems implementations, and growth in our business, and we may not meet anticipated implementation timetables or stay within budgeted costs. As these initiatives are implemented, we may not fully achieve the desired results, including but not limited to, expected cost savings or growth rates, and these initiatives may adversely impact customer retention or our operations. Also, our business strategies may change in light of our ability to implement new business initiatives, competitive pressures, economic uncertainties or developments or other factors.\n12\nTable of Contents\nWe currently conduct business in international markets, our planned further expansion into international markets presents unique challenges, and our expansion efforts with respect to international operations may not be successful.\nWe currently conduct business in international markets, with approximately 7% of our 2024 revenues derived from our international operations. In addition, a key element of our business strategy includes further expansion in international markets. Our ability to operate successfully in international markets may be adversely affected by political, economic and social conditions beyond our control and geopolitical conflicts, such as the conflict between Russia and Ukraine and the conflict in Gaza. Also, we may be adversely affected by local laws and customs and legal and regulatory constraints, including compliance with applicable export, anti-corruption and currency laws and regulations of the countries or regions in which we currently operate or intend to operate in the future. Risks inherent in our existing and future international operations also include, among others, the costs and difficulties of managing international operations, difficulties in identifying and gaining access to local distributors and suppliers, suffering possible adverse tax consequences from changes in tax laws or the unfavorable resolution of tax assessments or audits, maintaining product quality and greater difficulty in enforcing intellectual property rights. Additionally, foreign currency exchange rates and fluctuations could have an adverse effect on our financial results.\nOur franchisees, subcontractors, and vendors could take actions that could harm our business.\nOur franchisees, subcontractors, and vendors are contractually obligated to operate their businesses in accordance with the standards set forth in our agreements with them and applicable laws and regulations. Each of our brands that are franchised also provides training and support to franchisees. However, franchisees, subcontractors, and vendors are independent third parties that we do not control, and who own, operate and oversee the daily operations of their respective businesses, and the ultimate success of any business operation rests with the business owner. If franchisees do not successfully operate their businesses in a manner consistent with required standards, royalty payments owed to us will be adversely affected and our brands’ image and reputation could be harmed. Similarly, if franchisees, subcontractors, and vendors do not successfully operate their businesses in a manner consistent with required laws, standards and regulations, we could be subject to claims from regulators or legal claims for the actions or omissions of such third-party franchisees, subcontractors, and vendors. In addition, our relationship with our franchisees, subcontractors, and vendors could become strained (including resulting in litigation) as we impose new standards or assert more rigorous enforcement practices of the existing required standards. \nRisks Related to Cybersecurity, Privacy Compliance and Business Disruptions \nThe Company, our brands, third-party business partners and service providers have been subject to cybersecurity incidents in the past and could be the targets of future attacks that could result in disruption to our business operations, economic and reputational damage, and possible fines, penalties and private litigation. These could include unauthorized access to or unintentional distribution of personal, financial, proprietary, confidential, or other protected data or information the Company is entrusted to keep about its customers, employees, business practices, or third parties; significant operational disruptions that result from a cybersecurity incident; or vulnerabilities through the use of evolving tools such as Artificial Intelligence.\nOur internal IT systems contain certain personal, financial, health, or other protected and confidential information that is entrusted to us by our customers and employees. Our IT systems also contain our and our brands’ proprietary and other confidential information related to our business, such as business plans, customer lists, pricing, and service development initiatives. From time to time, we integrate new IT systems due to organic growth and acquisitions. In addition, we grant third-party business partners and service providers access to confidential information in order to facilitate business operations and administer employee benefits. Employees, third-party business partners, and service providers can knowingly or unknowingly disseminate such information or serve as an entry point for bad actors to access such information. \nThe Company has assigned responsibility for Board oversight of cybersecurity risk to the Audit Committee, which monitors the cybersecurity risk management and cyber control functions, including external security audits, and receives periodic updates from experienced senior management, outside legal counsel, and cybersecurity insurance carriers knowledgeable about assessing and managing cyber risks, including, as appropriate, updates on the prevention, detection, mitigation, and remediation of cyber incidents. \nWe continue to evaluate and modify our systems and protocols for data security compliance purposes, and such standards may change from time to time. We have processes in place to oversee and identify cybersecurity risks and vulnerability related to certain third-party business partners, vendors, and service providers. We have processes to address risks of a key \n13\nTable of Contents\nservice provider experiencing a significant cybersecurity incident that renders their services unavailable, but those processes may not cover all business losses. Activities by bad actors, changes in computer and software capabilities and encryption technology, new tools and discoveries, cloud applications, changes in multi-jurisdictional regulations, and other events or developments may result in a compromise or breach of our systems. Any compromises, breaches, application errors or human mistakes related to our systems or failures to comply with applicable standards could not only disrupt our financial operations, including our customers’ ability to pay for our services and products by credit card or their willingness to purchase our services and products, but could also result in violations of applicable laws, regulations, orders, industry standards or agreements and subject us to costs, penalties and liabilities. A breach of data security or failure to comply with rigorous multi-jurisdictional consumer privacy requirements could expose us to customer litigation, regulatory actions and costs related to the reporting and handling of such a violation or breach. Furthermore, while we maintain cybersecurity insurance, our insurance may not cover all liabilities incurred due to a security breach or incident.\nRisks Related to Legal, Regulatory and Risk Management Matters \nIn the countries in which we operate, our business is subject to various federal, state, provincial, and local laws and regulations pertaining to environmental, public health and safety matters, including those related to the pest control industry, and any noncompliance with, changes to, or increased enforcement of such laws, could significantly impact our business.\nOur business is subject to various federal, state, provincial, and local laws and regulations pertaining to environmental, public health and safety matters, including those related to the pest control industry. Among other things, these laws also govern the use, storage, treatment, disposal, transportation and management of certain pesticides and hazardous substances and waste and regulate the emission or discharge of materials into the environment. In addition, the use of certain pesticide products is also regulated by various federal, state, provincial and local environmental and public health agencies. Penalties for noncompliance with these laws may include criminal sanctions or civil remedies, including, but not limited to, cancellation of licenses, fines, and other corrective actions. Noncompliance with, changes in, expanded enforcement of, or adoption of new laws and regulations governing hazardous waste disposal and other environmental matters, could result in operational changes and increased costs. \nWe are subject to regulation in the countries in which we operate related to employment laws, and noncompliance could lead to fines or legal proceedings.\nWe are subject to a myriad of complex laws and regulations in the various federal, state, provincial, regional, and local governments in the countries in which we operate related to employees, including, but not limited to wage and hour laws, anti-discrimination laws, immigration, pension benefit plans, ERISA laws, OSHA regulations, and retirement benefits. Any failure to comply with such applicable laws or regulations could result in fines or legal proceedings.\nNew or proposed regulations regarding climate change could have uncertain impacts on our business.\nClimate change has been the subject of increased focus by various governmental authorities and regulators around the world. For example, the State of California has enacted legislation that will require large U.S. companies doing business in California to make broad-based climate-related disclosures, and other states are also considering similar measures. Also, the SEC has issued final rules, which are currently stayed pending judicial review; however, if implemented as proposed, these rules would significantly increase our climate-related disclosure obligations. We are assessing our obligations under these proposed and enacted rules in the United States and around the world and expect that compliance could require substantial effort in the future. Compliance with any new or more stringent laws or requirements, or stricter interpretations of existing laws, could require additional expenditures by us or our suppliers. We cannot predict how the proposed rules, if finalized, or any future legislation or regulations pertaining to climate change, will ultimately affect our business.\nTermite claims and lawsuits related thereto could increase our legal expenses.\nFrom time to time, we are subject to claims brought by our customers for termite protection services, generally based on alleged termite damage to the structure(s) covered by our contracts with those customers. In some instances of these claims, the customer may initiate litigation or arbitration proceedings against us or one of our brands.\n14\nTable of Contents\nOur safety and risk management programs may not have the intended effect of reducing our liability for employee-work related injuries, third party-liability claims or property loss.\n \nOur auto or other safety management system and performance measures are critical to our reputation and results of operation. We attempt to mitigate risks relating to employee work-related injuries, automobile collision, third-party liability, or property loss through the implementation of company-wide safety management programs designed to focus on prevention and decrease the occurrence of incidents or events that may occur. Such incidents could also have the effect of destabilizing or increasing our insurance costs and financial reserves. Incidents involving injury or property loss may be caused by multiple potential factors, a significant number of which are beyond our control. Therefore, there is no guarantee that our safety and risk management and safety programs will have the desired effect of avoiding or controlling all potential expenses and liability exposure.\nAdditionally,\n \nwe retain certain risks related to general liability, workers’ compensation, and auto liability. The accruals and reserves we hold are based on estimates that involve a degree of judgment and are inherently variable and could be overestimated or insufficient. If actual claims exceed our estimates, our operating results could be materially affected, and our ability to take timely corrective actions to limit future costs may be limited.\nFurther, some of our commercial customers require that we meet certain safety criteria to be eligible to provide service and bid for contracts, and many contracts provide for automatic termination or forfeiture of some or all of our contract fees or profit in the event we fail to meet certain measures. Accordingly, if we fail to maintain adequate safety standards, we could experience reduced profitability or the loss of projects or clients. \nOur insurance coverage may be inadequate to cover all significant risk exposures and our accruals and reserves for uninsured claims are variable.\n \nWe are exposed to liabilities that are unique to our business and the services we provide. We maintain commercial liability insurance that extends to products liability. In addition, we also maintain other insurance and other traditional risk transfer tools to respond to certain types of liabilities and risks. However, such tools are subject to terms such as deductibles, retentions, limits and policy exclusions, commercial availability and supply of coverage as well as risk of denial of coverage, default or insolvency. If we experience unexpected or uncovered losses, or if any of our insurance policies are terminated for any reason or are not effective in mitigating our risks, we may incur losses that are not covered or that exceed our coverage limits. In addition, there can be no assurance that the types or levels of coverage maintained are adequate to cover these potential significant and catastrophic risks. Further, we may not be able to continue to maintain our existing insurance coverage or obtain comparable or additional insurance coverage at a reasonable cost in the event a significant product or service claim arises. \nWe have been and may in the future be subject to lawsuits, investigations and other proceedings which could have a material adverse effect on our business.\nIn the normal course of business, we have been and may in the future be involved in various claims, contractual disputes, investigations, arbitration and litigation, including (1) claims that our acts, omissions, services or vehicles caused damage or injury, (2) claims that our pest control, termite and/or ancillary services did not achieve the desired results, (3) claims related to acquisitions, (4) claims related to violations of antitrust laws or consumer protection laws, (4) claims related to allegations by federal, state or local authorities, including the Securities and Exchange Commission, the Federal Trade Commission and Department of Justice, of violations of regulations or statutes, (5) claims related to federal securities laws, (6) claims related to employment or wage and hour violations, including class actions under the California Private Attorney General Act (\"PAGA\"), (7) claims related to environmental matters, and (8) claims related to additional laws and regulations. These claims, proceedings or litigation, either alone or in the aggregate, could have a material adverse effect on our business.\nRisks Related to Certain Intellectual Property Rights \nOur brand recognition or reputation could be impacted if we are not able to adequately protect our intellectual property and other proprietary rights that are material to our business. \nOur ability to compete effectively depends in part on our rights to service marks, trademarks, trade names and other intellectual property rights we own or license. Although we have sought to register or protect many of our marks either in the United States or in the countries in which they are or may be used, we have not sought to protect our marks in every \n15\nTable of Contents\ncountry. Furthermore, because of the differences in foreign trademark, patent and other intellectual property or proprietary rights laws, we may not receive the same protection in other countries as we would in the United States. If we are unable to protect our proprietary information and brand names, we could suffer a material adverse effect to our reputation and business. Litigation may be necessary to enforce our intellectual property rights and protect our proprietary information, or to defend against claims by third parties that our products, services or activities infringe their intellectual property rights. \nRisks Related to Public Health Crises\nThe effects of a pandemic or other major public health concern, could materially impact our business.\nThe impact of a pandemic or other major public health concerns, including changes in consumer behavior and discretionary spending, market downturns, and restrictions on business and individual activities, could create significant volatility in the global economy. Additionally, government or regulatory responses to pandemics or other public health concerns, such as mandatory lockdowns, vaccine mandates or other restrictions on operations, could negatively impact our business. \nThe ultimate impact of a pandemic or other major public health concern also depends on events beyond our knowledge or control, including the duration and severity of such pandemics and other major public health concerns, and related remedial or containment measures taken by parties other than us to respond to them.\nWe are unable to completely predict the full impact that a pandemic, or other major public health concern will have on our business due to numerous uncertainties. In addition, our compliance with remedial or containment measures could impact our day-to-day operations and could disrupt our business and operations, as well as that of our customers and suppliers, for an indefinite period of time. Furthermore, labor force availability may be impaired due to exposure, reluctance to comply with governmental, regulatory or contractual mandates, or other restrictions, which could negatively affect our operating costs and profitability or negatively impact our ability to provide quality services. \nRisks Related to Market Conditions and External Factors\nAdverse economic conditions, including inflation and restrictions in customer discretionary expenditures, increases in interest rates or other disruptions in credit or financial markets, geopolitical developments, increases in fuel prices, raw material costs, or other operating costs could materially adversely affect our business. \nEconomic downturns may adversely affect our commercial customers, including food service, hospitality and food processing industries whose business levels are particularly sensitive to adverse economies. For example, we may lose commercial customers and related revenues because of consolidation or cessation of commercial businesses or because these businesses switch to a lower cost provider. Pest and termite services represent discretionary expenditures to many of our residential customers. If consumers restrict their discretionary expenditures, due to inflation or other economic hardships, we may suffer a decline in revenues from our residential service lines. Disruptions in credit or financial markets could make it more difficult for us to obtain, or increase the cost of obtaining, financing in the future. Increases in interest rates may cause a reduction in new home construction or real estate transactions, which could result in a decrease in revenue. We may be impacted by geopolitical tensions and conflicts, including changes to trade policies and regulations, such as tariffs. In addition, there can be no assurances that fuel prices, raw material costs, or other operating costs, all of which may be subject to inflationary pressures, will not materially increase in future years.\nRisks Related to our Capital and Ownership Structure\nA group that includes members of the Company’s Board of Directors and management has a significant ownership interest; public stockholders may have no effective voice in the Company’s management.\nThe Company has a significant shareholder group, which includes the Company’s Executive Chairman Emeritus of the Board, Gary W. Rollins, Board member, Pam Rollins, and certain persons acting as a group with them (the “Significant Shareholder”) which as of December 31, 2024, beneficially held (in the aggregate, including direct and indirect ownership) approximately 42 percent of our common stock. As a result, the Significant Shareholder has significant influence over our operations, including the election of directors, approval of substantial corporate transactions such as acquisitions, and approval of matters requiring stockholder approval. This concentration of ownership could also have the effect of delaying or preventing a third party from acquiring control of the Company at a premium.\n16\nTable of Contents\nThe Significant Shareholder has a substantial ownership interest, and the availability of the Company’s common stock to the investing public may be limited.\nThe availability of Rollins’ common stock to the investing public is limited to those shares not held by the Significant Shareholder, which could negatively impact Rollins’ stock trading prices and affect the ability of minority stockholders to sell their shares. Future sales or other transactions entered into by the Significant Shareholder with respect to all or a portion of their shares or otherwise could also negatively affect the trading price of, or cause volatility in the market for, our common stock.\nCertain provisions in Rollins, Inc.’s certificate of incorporation and bylaws may inhibit a takeover of the Company.\nRollins, Inc.’s certificate of incorporation, bylaws and other documents contain provisions including advance notice requirements for stockholder proposals and staggered terms for the Board of Directors. These provisions may make a tender offer, change in control or takeover attempt that is opposed by the Company’s Board of Directors more difficult or expensive.\nItem 1.B.    Unresolved Staff Comments\nNone.\nItem 1.C Cybersecurity\nThe Company has security incident response policies and procedures for identifying, assessing, and managing material risks arising from cybersecurity incidents, including those arising from third-party service providers\n. \nThe Company’s Chief Information Security Officer (“CISO”), who has over 30 years of experience in information technology and information security and has several industry certifications, including CISSP, CCSP, CISM, CRISC, and CIPP, is the executive primarily responsible for managing cybersecurity risks\n. \nThe CISO assesses cybersecurity incidents and classifies them by severity level in accordance with the Company’s Security Incident Guidelines, which determine how each cybersecurity incident is managed and communicated.\n The Company uses both internal and external resources to assess risk and manage its IT and 24x7 cybersecurity operations, including managed service providers who assist in the support of key business systems. The Company may also periodically engage external consultants to assist with cybersecurity incident management, particularly where advanced or specialized expertise may be required. The Company’s Incident Response and Breach Notification Policy outlines the procedures that the Company follows for evaluation and recovery from an incident, including containment of the affected systems, to restore our systems to normal operations\n. \nTo date, the Company has not had a cybersecurity event that materially impacted or is reasonably likely to materially affect its business strategy, results of operations, financial condition, or the security of its proprietary data.\nThe Company has assigned responsibility for Board oversight of cybersecurity risk to the Audit Committee, which monitors the cybersecurity risk management and cyber control functions, including external security audits, and receives periodic updates from experienced senior management, including the CISO, knowledgeable about assessing and managing cyber risks, including, as appropriate, updates on the prevention, detection, mitigation, and remediation of cyber incidents.\nCybersecurity incidents that significantly impact the confidentiality, integrity, or availability of Company data or the reliability of the Company system or network are reported to certain members of the Company’s Executive Leadership Team, including the Chief Executive Officer, Chief Financial Officer, Chief Legal Officer, Chief Administrative Officer, and Chief Information Officer, for assessment of the materiality of the incident, which will be made using both quantitative and qualitative analyses to determine an incident’s immediate and reasonably likely future impacts. Such cybersecurity incidents are also \nreported to the Audit Committee\n. Cybersecurity incidents that moderately impact the confidentiality, integrity, or availability of Company data or the reliability of the Company systems or networks are reported to the Security Incident Response Team, for assessment of the materiality of the incident.\n \nOur privacy compliance and digital risk management initiatives focus on the threats and risks to enterprise information and the underlying IT systems processing such information as part of the implementation of business processes. We have also implemented policies and procedures for the assessment, identification, and management of material risks from cybersecurity threats, including internal training, system controls, and monitoring and audit processes to protect the Company from internal and external vulnerabilities and to comply with consumer privacy laws in the areas in which we operate. Further, we limit retention of certain data, encrypt certain data and otherwise protect information to comply with consumer privacy laws in the areas in which we operate. \nThe Company also has a cross-functional group of representatives \n17\nTable of Contents\nfrom several departments that comprise the Cybersecurity and Privacy Committee, which meets and discusses information at least quarterly related to cybersecurity and privacy compliance at the Company, including training, policies, and trends. \nWe also rely on, among other things, commercially available third parties\n including vendors, cybersecurity protection systems, software, tools and monitoring to provide security for processing, transmission and storage of protected information and data. The systems currently used for transmission and approval of payment card transactions, and the technology utilized in payment cards themselves, all of which can put payment card data at risk, meet standards set by the payment card industry.\n \nThe Company has a global cybersecurity training program that requires all employees with access to the Company networks to participate in regular and mandatory training on how to be aware of, and help defend against, cybersecurity risks. Also, the Company regularly tests the efficacy of its training efforts as well as its systems to assess vulnerabilities to cybersecurity risks, including tabletop incident response exercises.\n \nAnnually the Company conducts an Enterprise Risk Assessment during which management identifies and quantifies risks, including cybersecurity risks, that could enhance or impede the Company’s ability to achieve current or future strategic objectives. The conclusions of the annual Enterprise Risk Assessment are shared with the Audit Committee. The \nCISO\n also reviews with the Audit Committee the strategy, priorities, and goals of the cybersecurity program."
  }
}