{
  "ticker": "ROP",
  "cik": "0000882835",
  "company_name": "ROPER TECHNOLOGIES INC",
  "filing_date": "2025-02-24",
  "accession": "0000882835-25-000008",
  "primary_doc": "rop-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.     BUSINESS\nAll currency amounts are in millions unless specified\nOur Business\nRoper Technologies, Inc. (“Roper,” the “Company,” “we,” “our,” or “us”) is a diversified technology company. Roper has a proven, long-term, successful track record of compounding cash flow and increasing shareholder value. We operate market leading businesses that design and develop vertical software and technology enabled products for a variety of defensible niche markets.\nWe pursue consistent and sustainable growth in revenue, earnings, and cash flow by enabling continuous improvement in the operating performance of our businesses and by acquiring businesses that offer high value-added software, services, technology-enabled products, and solutions that we believe are capable of realizing growth while maintaining high margins. We compete in many defensible niche markets and believe we are the market leader or a competitive alternative to the market leader in most of these markets.\nIn the last three years, we have deployed approximately $9,950 of capital toward acquisitions. In 2024, this included approximately $1,860 for the acquisition of Procare, a leading provider of Software-as-a-Service (“SaaS”) solutions and integrated payment processing for early childhood education centers and approximately $1,600 for the acquisition of Transact Campus, a leading provider of integrated campus technology and payment solutions serving higher education, healthcare, and business campuses, which was combined with our CBORD business. In 2023, this included approximately $1,380 for the acquisition of Syntellis, a leading provider of SaaS solutions for healthcare, financial institution, and higher education providers, which was combined with our Strata business, and 2022 included approximately $3,750 for the acquisition of Frontline, a leading provider of SaaS solutions for school administration. Additionally, we deployed approximately $1,360 toward other bolt-on acquisitions to help build on the strategic position of several of our businesses.\nIn November 2022, Roper completed the divestiture of a majority equity stake in its industrial businesses, including its entire historical Process Technologies reportable segment and the industrial businesses within its historical Measurement & Analytical Solutions reportable segment (collectively “Indicor”), to Clayton, Dubilier & Rice, LLC (“CD&R”). Following the sale of the majority stake, Roper retained a minority equity interest in Indicor. See Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report for additional information regarding Roper’s minority equity interest in Indicor.\nDuring 2021, Roper entered into definitive agreements to divest its TransCore, Zetec, and CIVCO Radiotherapy businesses (“2021 Divestitures”). Roper completed the 2021 Divestitures by March 2022. \nThe financial results of Indicor and the 2021 Divestitures are reported as discontinued operations for all periods presented. Unless otherwise noted, discussion within Part I relates to continuing operations. Refer to Note 3 of the Notes to Consolidated Financial Statements included in this Annual Report for further information regarding discontinued operations.\nWe were incorporated on December 17, 1981 under the laws of the State of Delaware.\nMarket Share, Market Expansion, and Product Development\nLeadership with Technology and Products for Niche Markets\n – We maintain a leading position in many of our markets. We believe our market positions are attributable to the applications expertise used to create high value products and solutions for our customers, the underlying critical nature of our offerings, and the inherent customer intimacy of our chosen niche markets. Our businesses realize growth from new and existing customers in their niche markets through successfully executing go-to-market strategies, developing new products and applications, and delivering professional services.\nDiversified End Markets and Geographic Reach\n – We have a global presence, with sales to customers outside of the United States (“U.S.”) totaling $975.9 in 2024. Information regarding our international operations is set forth in Note 14 of the Notes to Consolidated Financial Statements included in this Annual Report.\n4\nOur Reportable Segments\nRoper’s segment reporting structure is based on business model and delivery of performance obligations. The three reportable segments are as follows:\n–Application Software\n—Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, Vertafore\n–Network Software\n—ConstructConnect, DAT, Foundry, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, SoftWriters\n–Technology Enabled Products\n—CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, Verathon\nFinancial information about our reportable segments is presented in Note 14 of the Notes to Consolidated Financial Statements included in this Annual Report.\nApplication Software\nOur Application Software segment had net revenues of $3,868.3 for the year ended December 31, 2024, representing 55.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Application Software segment:\nAderant \n–\n \ncomprehensive management software solutions for law and other professional services firms, including business development, calendar/docket matter management, time and billing, and case management.\nClinisys\n – diagnostic and laboratory information management software solutions.\nData Innovations\n – software solutions that enable enterprise management of hospitals and independent laboratories.\nDeltek\n – enterprise software and information solutions for government contractors, professional services firms, and other project-based businesses.\nFrontline\n – K-12 school administration software, connecting solutions for human capital management, student and special programs, and business operations, with powerful analytics that empower educators.\nIntelliTrans\n – transportation management software and services to bulk and break-bulk commodity producers.\nPowerPlan\n – financial and compliance management software and solutions to large complex companies in asset-intensive industries.\nProcare\n – cloud-based software and integrated payment processing for the management of early childhood education centers.\nStrata\n – cloud-based financial analytics, performance management software, and data solutions used by healthcare providers, higher education, and financial institutions for financial planning, decision support, and continuous cost improvement.\nTransact/CBORD\n – integrated campus technology and payment solutions, including secure access and campus identity software, commerce solutions, tuition management software and payment processing, as well as foodservice technologies, serving higher education, healthcare, K-12, and business campuses.\nVertafore\n – cloud-based software for the property and casualty insurance industry, including agency and distribution management, compliance, workflow, and data solutions.\n5\nNetwork Software\nOur Network Software segment had net revenues of $1,475.6 for the year ended December 31, 2024, representing 21.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Network Software segment:\nConstructConnect\n – cloud-based data, collaboration, and estimating automation software solutions focused on the pre-construction phase for a network of construction contractors and building product manufacturers/distributors.\nDAT\n – electronic marketplaces that connect available capacity of trucking units with the available loads of freight throughout North America, and freight analytics solutions.\nFoundry\n – software technologies used to deliver visual effects and 3D content for the entertainment and digital design industries.\niPipeline\n – cloud-based software solutions for the life insurance/annuities and financial services industries.\niTradeNetwork\n – electronic marketplaces and supply chain software that connect food suppliers, distributors, and vendors, primarily in the perishable food sector.\nLoadlink\n – electronic marketplaces that connect available capacity of trucking units with the available loads of freight throughout Canada, and freight analytics solutions.\nMHA\n – health care services and software solutions to alternate site health care markets.\nSHP\n – data analytics and benchmarking information for the post-acute healthcare provider marketplace.\nSoftWriters\n – software solutions to pharmacies that primarily serve the long-term care marketplace.\nTechnology Enabled Products\nOur Technology Enabled Products segment had net revenues of $1,695.3 for the year ended December 31, 2024, representing 24.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Technology Enabled Products segment:\nCIVCO Medical Solutions\n – accessories focused on guidance and infection control for ultrasound procedures.\nFMI\n – dispensers and metering pumps which are utilized in a broad range of applications requiring precision fluid control.\nInovonics\n – high-performance wireless sensor networks and solutions for a variety of applications.\nIPA\n – automated surgical scrub and linen dispensing equipment for healthcare providers.\nNeptune\n – water meters, enabling water utilities to remotely monitor their customers utilizing Automatic Meter Reading (AMR), Advanced Metering Infrastructure (AMI) technologies, and cloud-based software supporting meter data management.\nNorthern Digital\n – optical and electromagnetic precision measurement systems for medical and industrial applications.\nrf IDEAS\n – RFID card and credential readers used in numerous identity access management applications across a variety of vertical markets.\nVerathon\n – medical devices that enable airway management, including bronchoscopes and video laryngoscopes, and bladder volume measurement solutions for healthcare providers.\n6\nMaterials and Suppliers\nWe believe most materials and supplies we use are readily available from numerous sources and suppliers throughout the world. However, some components and sub-assemblies are currently available from only a limited number of suppliers for which we regularly investigate and identify alternative sources where possible. We also believe these conditions affect our competitors.\nRemaining Performance Obligations and Backlog\nRemaining performance obligations represent the transaction price of firm orders for which work has not been performed, excluding unexercised contract options. As of December 31, 2024 and 2023, total remaining performance obligations were $4,754.9 and $4,612.6, respectively.\nBacklog is equal to our remaining performance obligations expected to be recognized as revenue within the next 12 months. Backlog was $3,105.4 at December 31, 2024 and $3,156.6 at December 31, 2023.\nDistribution and Sales\nDistribution and sales occur primarily through direct sales offices, manufacturers’ representatives, resellers, and distributors.\nGovernmental Regulations\nWe face extensive government regulation around the world relating to the development, manufacture, marketing, sale, and distribution of our software, services, and products. The following sections describe certain significant regulations to which we are subject, but these are not the only regulations with which our businesses must comply. For a description of risks related to the regulations that our businesses are subject to, please refer to “",
    "item1a": "Item 1A. Risk Factors, We rely on information and technology, including third-party cloud computing platforms and other third-party business partners, for many of our business operations which could fail and cause disruption to our business operations.” above for more information. While we work to maintain our Cybersecurity Program, there can be no assurance that such actions will be sufficient to prevent cybersecurity incidents or mitigate all risks from cybersecurity threats or potential risks to such systems, networks, and data or those of our third-party providers.",
    "item1b": "ITEM 1B.     UNRESOLVED STAFF COMMENTS\nNone.\n16",
    "item1c": "ITEM 1C.     CYBERSECURITY\nRoper’s Cybersecurity Program\nRoper maintains a global Cybersecurity Program supervised by the Vice President of Cybersecurity that outlines required cybersecurity controls for all Roper businesses. \nGiven the decentralized nature of Roper’s operating model, day-to-day management and implementation of the Cybersecurity Program and deployment of the program’s cybersecurity controls are managed locally by each of Roper’s 28 business units, including localized information security management.\n In addition, because Roper’s businesses generally operate independently and maintain separate infrastructure and systems, we believe the risk of an enterprise-wide cybersecurity incident is somewhat reduced. While cybersecurity technologies and implementation may differ based on the needs and risk profile of each individual business, Roper has also implemented cybersecurity tools and managed services to centrally monitor certain aspects of the Cybersecurity Program.\nRoper deploys cybersecurity practices and tools across all of its businesses designed to protect data, maintain resilient operations, and limit the impact of cybercrime. We deploy a Managed Detection and Response solution across all of our business units and our Corporate infrastructure designed to address the detection, response, and remediation effectiveness for cybersecurity threats. This solution is intended to provide real-time visibility of the endpoint footprint across the enterprise, including patch management and vulnerabilities, device encryption, and cybersecurity threats and detections. Additionally, this solution is designed to provide real-time monitoring of identity-based attacks, as well as monitoring of the deep, dark and social webs for cybersecurity threats targeting Roper’s businesses.\nThe Cybersecurity Program includes controls designed to oversee and identify risks from cybersecurity threats associated with third parties as they are leveraged by Roper’s businesses in their respective software code development processes or for other purposes that require third-party access to critical infrastructure.\n The controls include, as appropriate, regularly assessing management of access controls and the cybersecurity risks posed by third parties.\nRoper performs cybersecurity risk assessments to assess compliance with mandated cybersecurity controls and to assess the likelihood and impact of specific cyberattacks. Cybersecurity risk assessments are periodically performed to assess internal compliance with cybersecurity strategy and the implementation of cybersecurity controls, which would include the validation of cybersecurity control implementation through testing. Areas identified for enhancement and improvement are monitored and tracked to remediation by the Roper cybersecurity team, including the Vice President of Cybersecurity. Cybersecurity risk is also addressed in, and monitored by, the Company’s enterprise risk management program.\nWe maintain a centralized incident response process with a third-party forensic partner on retainer. In addition, we have cybersecurity insurance policies in place. Roper maintains a Cybersecurity Incident Response Plan (“CSIRP”), which requires each Roper business to designate a Cybersecurity Incident Response Team that is responsible for receiving, reviewing, and responding to cybersecurity incident reports and activities. Cybersecurity incidents are required to be promptly reported to the Roper cybersecurity team, who then monitors such incidents through their resolution. We work on security awareness with our employees throughout the year with annual cybersecurity training and monthly simulated phishing campaigns to better identify and report unusual behavior and to mitigate the likelihood and impact of possible cybersecurity incidents.\nCybersecurity Governance\nThe Cybersecurity Program is supervised by Roper’s \nVice President of Cybersecurity\n, who has related experience including cybersecurity, IT, Cloud, and Security Compliance\n.\n The Vice President of Cybersecurity has obtained a B.S. in Management Information Systems, a Master’s in Business Administration, and a Master’s in Management Information Systems. She also maintains the following industry cybersecurity certifications: CISA, CISSP, GSEC, GCED, GSA, and a Boardroom Certified Qualified Technology Expert (QTE).\nOur Board of Directors (the “Board”) has not delegated responsibility for cybersecurity matters to a committee. Rather, the Board believes that due to the importance and continually evolving nature of risks from cybersecurity threats, all members of the Board should participate in the oversight of these topics. As a result, management briefs the Board on cybersecurity matters during regularly scheduled Board meetings. Roper’s Vice President of Audit Services also periodically briefs the Audit Committee on cybersecurity matters and related risks, as needed. \nThe Vice President of Audit Services also reports to the Audit Committee on matters, including cybersecurity matters, that are addressed and monitored pursuant to the Company’s enterprise risk management program.\nRoper has also established a Cyber Disclosure Committee chaired by the Vice President of Cybersecurity to track and evaluate potentially material cybersecurity incidents and to assess their potential impact on the organization. This process builds upon \n17\nthe CSIRP and provides a framework for Roper management to monitor potentially material cybersecurity incidents. \nThe Cyber Disclosure Committee reports its activities and findings, as appropriate, to the Chief Executive Officer, Chief Financial Officer, Principal Accounting Officer, and General Counsel, and, if appropriate, to the Board of Directors.\nAlthough we have experienced cybersecurity incidents, these incidents have not materially affected Roper, including its business strategy, results of operations, or financial condition.\n See “"
  }
}