{
  "ticker": "ROST",
  "cik": "0000745732",
  "company_name": "ROSS STORES, INC.",
  "filing_date": "2025-04-01",
  "accession": "0000745732-25-000010",
  "primary_doc": "rost-20250201.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS.\nThe following table summarizes the locations of our stores by state/territory as of February 1, 2025 and February 3, 2024.\nState/Territory\nFebruary 1, 2025\nFebruary 3, 2024\nAlabama\n30\n \n27 \nArizona\n91\n \n89 \nArkansas\n11\n \n10 \nCalifornia\n476\n \n463 \nColorado\n43\n \n42 \nDelaware\n4\n \n4 \nDistrict of Columbia\n2\n \n2 \nFlorida\n248\n \n244 \nGeorgia\n70\n \n70 \nGuam\n3\n \n3 \nHawaii\n19\n \n21 \nIdaho\n12\n \n12 \nIllinois\n104\n \n102 \nIndiana\n36\n \n33 \nIowa\n9\n \n9 \nKansas\n15\n \n15 \nKentucky\n19\n \n17 \nLouisiana\n24\n \n24 \nMaryland\n35\n \n32 \nMichigan\n16\n \n8 \nMinnesota\n4\n \n1 \nMississippi\n12\n \n12 \nMissouri\n32\n \n31 \nMontana\n6\n \n6 \nNebraska\n10\n \n8 \nNevada\n43\n \n43 \nNew Jersey\n22\n \n21 \nNew Mexico\n23\n \n22 \nNew York\n7\n \n4 \nNorth Carolina\n56\n \n53 \nNorth Dakota\n4\n \n3 \nOhio\n27\n \n25 \nOklahoma\n31\n \n30 \nOregon\n31\n \n32 \nPennsylvania\n64\n \n56 \nSouth Carolina\n32\n \n31 \nSouth Dakota\n2\n \n2 \nTennessee\n45\n \n45 \nTexas\n312\n \n304 \nUtah\n27\n \n27 \nVirginia\n44\n \n43 \nWashington\n48\n \n48 \nWest Virginia\n4\n \n4 \nWisconsin\n29\n \n28 \nWyoming\n4\n \n3 \nTotal\n2,186\n \n2,109 \n19\nWhere possible, we obtain sites in buildings requiring minimal alterations, allowing us to establish stores in new locations in a relatively short period of time and at reasonable costs in a given market. Nearly all of our stores are leased. The majority of our new stores have unexpired original lease terms ranging from three years to ten years, with three to four renewal options of five years each. \nThe following table summarizes the location and approximate sizes of our distribution/warehouse facilities and office locations as of February 1, 2025. Square footage information for the distribution and warehouse facilities represents total ground floor area of the facility.\nTotal Approximate Square\nFootage\nLocation\nNumber of Facilities\nOwned\nLeased\nDistribution and Warehouse Facilities\nBuckeye, Arizona\n1\n1\n1,700,000 \n— \nMoreno Valley, California\n3\n1,300,000 \n1,850,000 \nPerris, California\n2\n1,999,000 \n— \nShafter, California\n3\n1,700,000 \n1,353,000 \nStatesville, North Carolina\n1\n— \n640,000 \nCarlisle, Pennsylvania\n4\n465,000 \n604,000 \nFort Mill, South Carolina\n5\n2,051,000 \n415,000 \nRock Hill, South Carolina\n2\n1,200,000 \n431,000 \nBrookshire, Texas\n1\n1,890,000 \n— \nOffice Space\nDublin, California\n1\n414,000 \n— \nLos Angeles, California\n1\n— \n120,000 \nBoston, Massachusetts\n1\n— \n5,000 \nNew York City, New York\n2\n1\n572,000 \n— \n1\n We are currently in the process of completing the construction of this distribution center.\n2\n Our New York buying office building is subject to a 99-year ground lease.\nSee additional discussion under “Distribution” in ITEM 1. BUSINESS.\n20\nITEM 3. LEGAL PROCEEDINGS\nWe have been named in class/representative action lawsuits, primarily in California, alleging violations by us of wage and hour laws. Class/representative action litigation remains pending as of February 1, 2025. \nWe are also party to various other legal and regulatory proceedings arising in the normal course of business. Actions filed against us may include commercial, product and product safety, consumer, intellectual property, environmental, and labor and employment-related claims, including lawsuits in which private plaintiffs or governmental agencies allege that we violated federal, state, and/or local laws. Actions against us are in various procedural stages. Many of these proceedings raise factual and legal issues and are subject to uncertainties.\nLike many retailers and other businesses, we have filed a lawsuit as plaintiff against various insurance companies with respect to our claims for insurance coverage for business interruption and for other losses that we have experienced as a result of the COVID-19 pandemic. Our suit was filed in Alameda County, California in December 2020. The proceedings are ongoing and remain subject to significant uncertainties.\nWe believe that the resolution of our currently pending class/representative action litigation and other currently pending legal and regulatory proceedings will not have a material adverse effect on our financial condition, results of operations, or cash flows.\nITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\n21\nPART II\nITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nGeneral information.\n \nOur stock is traded on The Nasdaq Global Select Market\n®\n under the symbol ROST. There were 1,146 stockholders of record as of March 10, 2025, and the closing stock price on that date was $132.12 per share.\nCash dividends.\n \nOn March 4, 2025, our Board of Directors declared a quarterly cash dividend of $0.4050 per common share, payable on March 31, 2025. Our Board of Directors declared a cash dividend of $0.3675 per common share in March, May, August, and November 2024. Our Board of Directors declared a cash dividend of $0.3350 per common share in February, May, August, and November 2023.\nIssuer purchases of equity securities.\n \nInformation regarding shares of common stock we repurchased during the fourth quarter of fiscal 2024 is as follows:\nPeriod\nTotal number\nof shares\n(or units) purchased\n1\nAverage price\npaid per share (or unit)\nTotal number\nof shares\n(or units)\npurchased as\npart of publicly\nannounced\nplans or programs\nMaximum\nnumber (or\napproximate\ndollar value) of\nshares (or units)\nthat may yet be\npurchased under\nthe plans or programs ($000)\nNovember\n \n(11/03/2024 - 11/30/2024)\n452,426 \n$145.05\n452,426 \n$1,246,900\nDecember\n(12/01/2024 - 01/04/2025)\n704,593 \n$153.01\n704,593 \n$1,139,090\nJanuary\n(01/05/2025 - 02/01/2025)\n592,070 \n$150.43\n592,070 \n$1,050,020\nTotal\n1,749,089 \n$150.08\n1,749,089 \n$1,050,020\n1\n We did not acquire shares of treasury stock during the quarter ended February 1, 2025. Treasury stock includes shares acquired from employees for tax withholding purposes related to vesting of restricted stock grants.\nIn March 2024, our Board of Directors approved a two-year program to repurchase up to $2.1 billion of the Company’s common stock through January 31, 2026. This program followed the previous two-year $1.9 billion stock repurchase program, effective at the end of fiscal 2023.\nRefer to Note C: Stock-Based Compensation in the Notes to Consolidated Financial Statements for equity compensation plan information. The information under Item 12 of this Annual Report on Form 10-K under the caption “Equity compensation plan information” is incorporated herein by reference.\n22\nStockholder Return Performance Graph\nThe following information in this Item 5 shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933.\nThe graph below compares total stockholder returns over the last five years for our common stock to the Standard & Poor’s 500 Index (“S&P Index”) and the Dow Jones Apparel Retailers Index. \nWe use the Dow Jones Apparel Retailers Index in our performance graph because we believe the retail companies comprising that index are aligned with the segment of the retail industry in which we operate, and it provides a relevant comparison against which to measure our stock performance. \nThe cumulative total return listed below assumed an initial investment of $100 and reinvestment of dividends at each fiscal year-end and measures the performance of this investment as of the last trading day in the month of January for each of the following five years. These measurement dates are based on the historical month-end data available and vary slightly from our actual fiscal year end date for each period. Data with respect to returns for the S&P Index and the Dow Jones Apparel Retailers Index is not readily available for periods shorter than one month. The graph is a historical representation of past performance only and is not necessarily indicative of future performance.\n23\nCOMPARISON OF 5 YEAR CUMULATIVE TOTAL RETURN\nAmong Ross Stores, Inc., the S&P 500 Index, and Dow Jones Apparel Retailers\nIndexed Returns for Fiscal Years Ended\nBase Period\nCompany/Index\n2019\n2020\n2021\n2022\n2023\n2024\nRoss Stores, Inc.\n100 \n100 \n87 \n109 \n133 \n141\n \nS&P 500 Index\n100 \n117 \n145 \n133 \n160 \n203\n \nDow Jones Apparel Retailers\n100 \n109 \n120 \n131 \n155 \n187\n \n24\nITEM 6. RESERVED\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nRoss Stores, Inc. operates two brands of off-price retail apparel and home fashion stores—Ross Dress for Less\n®\n (“Ross”) and dd’s DISCOUNTS\n®\n. Ross is the largest off-price apparel and home fashion chain in the United States, with 1,831 locations in 43 states, the District of Columbia, and Guam, as of February 1, 2025. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. We also operate 355 dd’s DISCOUNTS stores in 22 states as of February 1, 2025 that feature a more moderately-priced assortment of first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day.\nOur primary objective is to pursue and refine our existing off-price strategies to maintain and improve both profitability and financial returns over the long term. Macroeconomic pressures and uncertainties continue to impact both consumer confidence and discretionary spending. We are closely monitoring these external factors, along with market share trends for the off-price industry. We believe that our flexible business model better positions us to navigate through uncertainty, and we plan to continue to focus on strong execution of our key initiatives. We believe that our market share gains can continue to grow through our continued focus on bringing value and convenience to our customers.\nOur merchandising strategies emphasize consistently offering a wide assortment of quality branded bargains for our customers. We believe that our merchandising and operational strategies enable us to deliver the most competitive bargains available to meet our customers’ ongoing demand for quality branded goods for the family and home at compelling discounts every day. Additionally, we anticipate the current retail environment will result in more opportunities for us to obtain close-out merchandise and to deliver even greater values on branded goods. We believe that staying diligently focused on executing our merchandising strategies is an important driver of our ability to gain market share in fiscal 2025 and the long term.\nThe fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023 are referred to as fiscal 2024, fiscal 2023, and fiscal 2022, respectively. Fiscal 2023 was a 53-week year. Fiscal 2024 and 2022 were each 52-week years.\nThe discussion that follows relates to fiscal 2024 and fiscal 2023. Discussion of fiscal 2022 items and year-to-year comparisons between fiscal 2023 and fiscal 2022 that are not included in this Annual Report on Form 10-K can be found in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nin our Annual Report on Form 10-K for fiscal 2023.\n25\nResults of Operations\nThe following table summarizes our financial results for fiscal 2024, 2023, and 2022:\n2024\n2023\n2022\nSales\nSales (millions)\n$\n21,129\n \n$\n20,377 \n$\n18,696 \nSales growth (decline)\n3.7%\n9.0%\n(1.2)%\nComparable store sales growth (decline)\n1\n3%\n5%\n(4)%\nCosts and expenses (as a percent of sales)\nCost of goods sold\n72.2%\n72.7%\n74.6%\nSelling, general and administrative\n15.5%\n16.0%\n14.8%\nOperating income (as a percent of sales)\n12.2%\n11.3%\n10.7%\nInterest (income) expense, net\n(0.8)%\n(0.8)%\n0.0%\nNet earnings (as a percent of sales)\n9.9%\n9.2%\n8.1%\n1\n Comparable stores are stores open for more than 14 complete months.\nStores.\n \nTotal stores open at the end of fiscal 2024, 2023, and 2022 were 2,186, 2,109, and 2,015, respectively. The number of stores at the end of fiscal 2024, 2023, and 2022 increased by 4%, 5%, and 5% from the respective prior years. In fiscal 2024, \nwe opened \n89\n new stores. \nLooking forward to 2025, we expect to open approximately 90 new stores. Our long-term strategy is to open additional stores based on market penetration, local demographic characteristics, competition, expected store profitability, and the ability to leverage overhead expenses. We continually evaluate opportunistic real estate acquisitions and opportunities for potential new store locations. We also evaluate our current store locations and determine store closures based on similar criteria. We continue to believe that consumers’ focus on value and convenience provide opportunities for us to gain market share.\nThe following table summarizes the stores opened and closed during fiscal 2024, 2023, and 2022:\nStore Count\n2024\n2023\n2022\nRoss Dress for Less\nBeginning of the period\n1,764\n \n1,693 \n1,628 \nOpened in the period\n75\n \n72 \n1\n71 \nClosed in the period\n(8)\n(1)\n(6)\n2\nTotal Ross Dress for Less stores end of period\n1,831\n \n1,764 \n1,693 \ndd’s DISCOUNTS\nBeginning of the period\n345\n \n322 \n295 \nOpened in the period\n14\n \n25 \n28 \nClosed in the period\n(4)\n(2)\n(1)\nTotal dd’s DISCOUNTS stores end of period\n355\n \n345 \n322 \nTotal stores end of period\n2,186\n \n2,109 \n2,015 \n1 \nIncludes the reopening of a store previously temporarily closed due to a weather event.\n2 \nIncludes the temporary closure of a store impacted by a weather event.\nThe total selling square footage as of February 1, 2025, February 3, 2024, and January 28, 2023 was 43.9 million, 42.8 million, and 41.4 million, respectively.\n26\nSales. \nSales for fiscal 2024 increased $752.3 million, or 3.7%, compared to the prior year. This was primarily due to the 3% increase in comparable store sales and the opening of 77 net new stores during fiscal 2024. Sales for fiscal 2023 included approximately $308 million from the additional week of sales due to the 53rd week.\nOur sales mix is shown below for fiscal 2024, 2023, and 2022:\n2024\n1\n2023\n2022\nHome Accents and Bed and Bath\n26\n \n%\n26 \n%\n26 \n%\nLadies\n22\n \n%\n23 \n%\n24 \n%\nMen’s\n16\n \n%\n15 \n%\n15 \n%\nAccessories, Lingerie, Fine Jewelry, and Cosmetics\n15\n \n%\n15 \n%\n14 \n%\nShoes\n12\n \n%\n13 \n%\n12 \n%\nChildren’s\n9\n \n%\n8 \n%\n9 \n%\nTotal\n100\n \n%\n100 \n%\n100 \n%\nCost of goods sold. \nCost of goods sold in fiscal 2024 increased $458.9 million compared to the prior year primarily due to the 3% comparable store sales increase and higher sales from the opening of 77 net new stores during fiscal 2024.\nCost of goods sold as a percentage of sales for fiscal 2024 decreased approximately 40 basis points from fiscal 2023 primarily due to a 45 basis point decrease in buying costs mainly due to lower incentive compensation expense, a 45 basis point decrease in distribution costs, and a 30 basis point decrease in domestic freight costs. Partially offsetting these items was a 60 basis point decrease in merchandise margin primarily due to our continued efforts to offer more sharply priced branded bargains and a 20 basis point increase in occupancy costs.\nSelling, general and administrative expenses. \nFor fiscal 2024, selling, general and administrative expenses (“SG&A”) increased $15.5 million compared to the prior year. In December 2024, we completed the sale of a packaway warehouse facility and recognized a pre-tax gain on sale of $61.6 million. This sale, along with lower incentive compensation expense, partially offset the increase in SG&A which was primarily driven by the opening of 77 net new stores during fiscal 2024.\nSG&A as a percentage of sales for fiscal 2024 decreased 50 basis points compared to fiscal 2023, primarily due to the gain recognized from the previously mentioned packaway facility sale and lower incentive compensation expense.\nOperating income.\n Operating income as a percentage of sales for fiscal 2024 increased 90 basis points compared to fiscal 2023, primarily due to lower cost of goods sold and lower SG&A expenses.\nIn fiscal 2025, we expect operating income as a percentage of sales to be impacted by sales deleverage, higher distribution costs, and lower incentive compensation expense. \nInterest (income) expense, net\n.\n \nIn fiscal 2024, interest (income) expense, net improved by $7.5 million compared to fiscal 2023. Interest (income), expense, net as a percentage of sales, was flat compared to the prior year.\nThe table below shows the components of interest (income) expense, net for fiscal 2024, 2023, and 2022:\n($000)\n2024\n2023\n2022\nInterest income\n$\n(234,955)\n$\n(238,207)\n$\n(77,706)\nCapitalized interest expense\n(19,447)\n(12,106)\n(5,678)\nOther interest expense\n1,571\n \n1,599 \n1,668 \nInterest expense on long-term debt\n81,263\n \n84,596 \n84,558 \nInterest (income) expense, net\n$\n(171,568)\n$\n(164,118)\n$\n2,842 \n27\nTaxes on earnings. \nOur effective tax rate for fiscal 2024, 2023, and 2022 was approximately 24%. Our effective tax rate represents the applicable combined federal and state statutory rates reduced by the federal benefit of state taxes deductible on federal returns. Our effective tax rate is impacted by changes in tax law and accounting guidance, location of new stores, level of earnings, tax effects associated with stock-based compensation, and the resolution of tax positions with various tax authorities. \nEarnings per share.\n Diluted earnings per share in fiscal 2024 was \n$6.32\n compared to $5.56 in the prior year. Fiscal 2024 earnings include a per share benefit of approximately $0.14 from the sale of the packaway warehouse facility. Fiscal \n2023\n earnings include a per share benefit of approximatel\ny $0.20 from the 53rd week\n. The \n$0.76 increase\n in\n dil\nuted earnings per share in fiscal 2024 was primarily attributab\nle to a 12% increase in net earnings and a 2% reduction in weighted-average diluted shares outstanding largely due to stock repurchases under our stock repurchase program.\nFinancial Condition\nLiquidity and Capital Resources\nThe primary sources of funds for our business activities are cash flows from operations and short-term trade credit. Our primary ongoing cash requirements are for merchandise inventory purchases, payroll, operating and variable lease costs, taxes, capital expenditures related to our new and existing stores, and investments in distribution centers, information systems, and buying and corporate offices. We also use cash to repurchase stock under our stock repurchase programs, pay dividends, and repay debt as it becomes due. In September 2024, we repaid at maturity the $250 million principal amount of the 3.375% Senior Notes. As of February 1, 2025, we had $700 million principal amount of 4.600% Senior Notes that will reach maturity in 2025.\n($ millions)\n2024\n2023\n2022\nCash provided by operating activities\n$\n2,357\n \n$\n2,514 \n$\n1,689 \nCash used in investing activities\n(637)\n(763)\n(654)\nCash used in financing activities\n(1,859)\n(1,428)\n(1,405)\nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(139)\n$\n323 \n$\n(370)\nOperating Activities\nNet cash provided by operating activities was $2.4 billion in fiscal 2024. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, stock-based compensation, and the gain on sale of property (i.e., packaway warehouse facility), partially offset by the payment of fiscal 2023 incentive bonuses in fiscal 2024. Net cash provided by operating activities was $2.5 billion in fiscal 2023. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and \nstock-based compensation. Net cash provided by operating activities was $1.7 billion in fiscal \n2022\n. \nThis was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and stock-based compensation, and an increase in deferred income taxes, partially offset by merchandise inventory payments and payment of fiscal 2021 incentive bonuses.\nThe decrease in cash provided by operating activities in fiscal 2024 compared to fiscal 2023 was primarily driven by \nhigher incentive compensation payments, partially offset by higher net earnings.\nAccounts payable leverage \n(defined as accounts payable divided by merchandise inventory) \nwas \n87% and \n89% as of February 1, 2025 and February 3, 2024\n,\n respectively. \nThe decrease in accounts payable leverage in fiscal 2024 compared to fiscal 2023 was primarily due to the timing of inventory receipts and related payments versus last year.\n28\nAs a regular part of our business, packaway inventory levels will vary over time based on availability of compelling merchandise purchase opportunities in the marketplace and our decisions on the timing for release of that inventory to our stores. Packaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to our store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage for less than six months. We expect to continue to take advantage of packaway inventory opportunities to maximize our ability to deliver bargains to our customers.\nChanges in packaway inventory levels affect our operating cash flow. Packaway inventory was 41% of total inventory at the end of fiscal 2024, compared to 40% at the end of fiscal 2023.\nInvesting Activities\nNet cash used in investing activities was $637 million, $763 million, and $654 million in fiscal 2024, 2023, and 2022\n,\n respectively, and was primarily related to our capital expenditures. In fiscal 2024, capital expenditures were partially offset by cash proceeds from the sale of the packaway warehouse facility. Our capital expenditures include costs to build, expand, and improve distribution centers, open new stores and improve existing stores, and for various other expenditures related to our information technology systems and buying and corporate offices.\nThe decrease in cash used in investing activities in fiscal 2024 compared to fiscal 2023 was primarily due to lower capital expenditures in fiscal 2024 related to our new Buckeye, Arizona distribution center and cash proceeds from the sale of the packaway facility, partially offset by the purchase of land and the start of construction for our next distribution center.\nOur capital expenditures over the last three years are set forth in the table below:\n($ millions)\n2024\n2023\n2022\nDistribution and transportation\n$\n260\n \n$\n306 \n$\n270 \nNew stores\n193\n \n209 \n171 \nExisting stores\n171\n \n168 \n148 \nInformation systems, corporate, and other\n96\n \n80 \n65 \nTotal capital expenditures\n$\n720\n \n$\n763 \n$\n654 \nCapital expenditures for fiscal 2025 are projected to be approximately $855 million. Our planned capital expenditures for fiscal 2025 are for costs to open new stores and improve existing stores, investments in our supply chain to support long-term growth, including construction of our next distribution centers, investments in our information technology systems, and for various other expenditures related to our stores, distribution centers, and buying and corporate offices. We expect to fund capital expenditures with available cash. The increase in our planned capital expenditures for fiscal 2025 compared to fiscal 2024 is primarily driven by investments in our next distribution centers, new and existing store improvements, and various investments in our information technology systems.\nFinancing Activities\nNet cash used in financing activities was $1.9 billion, $1.4 billion, and $1.4 billion in fiscal 2024, 2023\n, and 2022, respectively, primarily resulting from stock repurchases under our stock repurchase program and dividend payments. In fiscal \n2024, we\n repaid the $250 million principal amount of the\n 3.375%\n Senior Notes in September 2024.\nRevolving credit facilities.\n We have a $1.3 billion senior unsecured revolving credit facility (“Credit Facility”). As of \nFebruary 1, 2025\n, we had no borrowings or standby letters of credit outstanding under the Credit Facility, t\nhe \n$1.3 billion\n Credit Facility remained in place and available, and \nwe were in compliance with the financial covenant. Refer to Note D: Debt\n \nin the Notes to Consolidated Financial Statements \nfor additional information.\n29\nSenior notes.\n As of February 1, 2025, we had approximately \n$2.2 billion\n of outstanding unsecured Senior Notes, of which \n$699.7 million\n was classified within Current Liabilities on our Consolidated Balance Sheet. Refer to\n Note D: Debt\n \nin the Notes to Consolidated Financial Statements \nfor additional information.\nOther financing activities.\n In March 2024, our Board of Directors approved a two-year program to repurchase up to $2.1 billion of the Company’s common stock through January 31, 2026. This program followed the previous two-year $1.9 billion stock repurchase program, effective at the end of fiscal 2023.\nThe following table summarizes our stock repurchase activity in fiscal 2024, 2023, and 2022:\nFiscal Year\nShares repurchased\n(in millions)\n Average repurchase\nprice\nAmount repurchased\n(in millions)\n2024\n7.3\n \n$\n144.46\n \n$\n1,050\n \n1\n2023\n8.2 \n$\n115.24 \n$\n950 \n1\n2022\n10.3 \n$\n92.15 \n$\n950 \n1\n Amount excludes excise tax due under the Inflation Reduction Act of 2022.\nDuring fiscal 2024, 2023, and 2022, we also acquired 0.6 million, 0.5 million, and 0.5 million shares of treasury stock, respectively, from our employee equity incentive plans for aggregate purchase prices of approximately $86.1 million, $48.6 million, and $48.9 million, respectively.\nOn March 4, 2025, our Board of Directors declared a quarterly cash dividend of $0.4050 per common share, payable on March 31, 2025. \nOur Board of Directors declared a cash dividend of $0.3675 per common share in March, May, August, and November 2024. Our Board of Directors declared a cash dividend of $0.3350 per common share in February, May, August, and November 2023, and a cash dividend of $0.3100 per common share in March, May, August, and November 2022.\nDuring fiscal 2024, 2023, and 2022, we paid dividends of $488.7 million, $454.8 million, and $431.3 million, respectively. \nShort-term trade credit represents a significant source of financing for our merchandise inventory. Trade credit arises from customary payment terms and trade practices with our vendors. We regularly review the adequacy of credit available to us from all sources and expect to be able to maintain adequate trade credit, bank credit facility, and other credit sources to meet our capital and liquidity requirements.\nDuring fiscal 2024, fiscal 2023, and fiscal 2022, our liquidity and capital requirements were provided by available cash and cash flows from operations.\nWe ended fiscal 2024 with $4.7 billion of unrestricted cash balances, which were held primarily in overnight money market funds invested in U.S. treasury and government instruments across a highly diversified set of banks and other financial institutions. We also have $1.3 billion available under our Credit Facility. We estimate that existing cash and cash equivalent balances, cash flows from operations, our bank credit facility, and trade credit are adequate to meet our operating cash needs and to fund our planned capital investments, debt repayments, interest payments, common stock repurchases, and quarterly dividend payments for at least the next 12 months.\n30\nContractual Obligations \nThe table below presents our significant contractual obligations as of February 1, 2025:\nLess than\n1 year\nGreater than \n1 year\nTotal¹\n($000)\nRecorded contractual obligations:\n   Senior notes\n$\n700,000 \n$\n1,524,991 \n$\n2,224,991 \n   Operating leases\n758,519 \n2,869,467 \n3,627,986 \n   New York buying office ground lease\n2\n7,552 \n1,092,953 \n1,100,505 \nUnrecorded contractual obligations:\n   Real estate obligations\n3\n9,026 \n178,204 \n187,230 \n   Interest payment obligations\n55,778 \n299,040 \n354,818 \n   Purchase obligations\n4\n4,183,454 \n104,916 \n4,288,370 \nTotal contractual obligations\n$\n5,714,329 \n$\n6,069,571 \n$\n11,783,900 \n1 \nWe have a $61.3 million liability for unrecognized tax benefits that is included in Other long-term liabilities on our Consolidated Balance Sheets. This liability is excluded from the schedule above as the timing of payments cannot be reasonably estimated.\n2\n Our New York buying office building is subject to a 99-year ground lease.\n3 \nMinimum lease payments for operating leases signed that have not yet commenced.\n4 \nPurchase obligations primarily consist of merchandise inventory purchase orders, commitments related to construction projects, transportation, information technology services, store fixtures and supplies, and maintenance contracts.\nSupply chain finance program. \nWe facilitate a voluntary supply chain finance program (the “program”) to provide certain suppliers with the opportunity to sell their receivables due from us to participating financial institutions at the sole discretion of both the suppliers and the financial institutions. A third-party financial institution administers the program. Our responsibility is limited to making payments on the terms originally negotiated with each supplier, regardless of whether a supplier sells its receivable to a financial institution. We are not a party to the agreements between the participating financial institutions and the suppliers in connection with the program, and we do not receive financial incentives from the suppliers or the financial institutions. We do not provide guarantees under the program, and our rights and obligations to our suppliers are not affected by the program. The range of payment terms negotiated with suppliers is consistent, irrespective of whether a supplier participates in the program.\nAll outstanding payments owed under the program are recorded within Accounts payable in the Consolidated Balance Sheets. We account for all payments made under the program as a reduction to operating cash flows in Accounts payable within the Consolidated Statements of Cash Flows. The amounts owed to participating financial institutions under the program and included in Accounts payable were \n$159.2 million\n and \n$146.9 million\n at February 1, 2025 and February 3, 2024, respectively.\nStandby letters of credit and collateral trust. \nWe use standby letters of credit outside of our revolving credit facility and a funded trust to collateralize some of our insurance obligations. As of February 1, 2025 and February 3, 2024, we had $1.8 million and $2.2 million, respectively, in standby letters of credit outstanding. As of February 1, 2025 and February 3, 2024, we had $63.9 million and $60.8 million, respectively, held in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash and cash equivalents.\nOther than the unrecorded contractual obligations noted above, we did not have any material off-balance sheet arrangements as of February 1, 2025.\n31\nOther\nCritical Accounting \nEstimates\nThe preparation of our consolidated financial statements requires our management to make estimates and assumptions that affect the reported amounts. These estimates and assumptions are evaluated on an ongoing basis and are based on historical experience and on various other factors that management believes to be reasonable. We believe the following critical accounting estimates describe the more significant judgments and estimates used in the preparation of our consolidated financial statements and are not intended to be a comprehensive list of all of our accounting estimates. \nMerchandise inventory.\n \nOur merchandise inventory is stated at the lower of cost (determined using a weighted-average basis) or net realizable value. Inventory we purchase can either be shipped to stores or processed as packaway merchandise with the intent that it will be warehoused and released to stores at a later date. Merchandise inventory includes acquisition, transportation, pr\nocessing, and storage costs. Included in the carrying value of our merchandise inventory is a provision for shortage. The shortage reserve is based on historical shortage rates as determined through our annual physical inventory counts and cycle counts. Historically, our actual physical inventory count results have shown our provision for shortage to be reliable. \nA \nfive percent\n change in shortage rates as of \nFebruary 1, 2025\n \nwould not have materially impacted our cost of goods sold \nin fiscal 2024.\nInsurance obligations.\n \nWe use a combination of insurance and self-insurance for a number of risk management activities, including workers’ compensation, general liability, and employee-related health care benefits. Our self-insurance and deductible liability is determined actuarially, based on claims filed and an estimate of claims incurred but not reported. Should a greater amount of claims occur compared to what is estimated or the costs of medical care increase beyond what was anticipated, our recorded reserves may not be sufficient and additional charges could be required. A five percent increase or decrease in our insurance reserves would not have materially impacted our net earnings in fiscal 2024.\nRecent Accounting Pronouncements\n \nRefer to Note A: Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements for a discussion of recent accounting pronouncements and their impact to our Consolidated Financial Statements.\nForward-Looking Statements\nOur Annual Report on Form 10-K for fiscal 2024, and information we provide in our Annual Report to Stockholders, press releases, and other investor communications including those on our corporate website, may contain a number of forward-looking statements regarding, without limitation, projected sales, costs, earnings, planned new store growth, capital expenditures, sustainability and carbon reduction targets, and other matters. These forward-looking statements reflect our then-current beliefs, plans, and estimates with respect to future events and our projected financial performance, operations, and competitive position. The words “plan,” “expect,” “target,” “anticipate,” “estimate,” “believe,” “forecast,” “projected,” “guidance,” “outlook,” “looking ahead,” and similar expressions identify forward-looking statements.\nFuture impact from inflation, high interest rates and interest rate changes, tariffs, ongoing military conflicts and economic sanctions, extreme weather, public health events, natural disasters, climate change, and other economic, regulatory, consumer spending, and industry trends that could potentially adversely affect our revenue, profitability, operating conditions, and growth are difficult to predict. Our forward-looking statements are subject to risks and uncertainties which could cause our actual results to differ materially from those forward-looking statements and our previous expectations, plans, and projections. Refer to",
    "item1a": "ITEM 1A. RISK FACTORS in this Annual Report on Form 10-K for a more complete discussion of risk factors for Ross and dd’s DISCOUNTS. The factors underlying our forecasts and plans are dynamic and subject to change. As a result, any forecasts or forward-looking statements speak only as of the date they are given, and do not necessarily reflect our outlook at any other point in time. We disclaim any obligation to update or revise these forward-looking statements.\n32\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risks, which primarily include changes in interest rates. We do not engage in financial transactions for trading or speculative purposes.\nWe occasionally use forward contracts to hedge against fluctuations in foreign currency prices. We had \nno\n outstanding forward contracts as of February 1, 2025.\nInterest that is payable on our revolving credit facility is based on variable interest rates and is, therefore, affected by changes in market interest rates. As of February 1, 2025, we had no borrowings outstanding under our revolving credit facility.\nAs of February 1, 2025, we had outstanding six series of unsecured Senior Notes. Interest that is payable on all series of our Senior Notes is based on fixed interest rates, and is therefore unaffected by changes in market interest rates. \nWe receive interest on our short- and long-term investments. Changes in interest rates may impact interest income recognized in the future, or the fair value of our investment portfolio.\nA hypothetical 100 basis point increase or decrease in prevailing market interest rates would not have a material negative impact on our consolidated financial position, results of operations, cash flows, or the fair values of our short- and long-term investments as of and for the year ended February 1, 2025. We do not consider the potential losses in future earnings and cash flows from reasonably possible, near-term changes in interest rates to be material.\n33\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Statements of \nEarnings\nFiscal Year Ended\n($000, except per share data)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nSales\n$\n21,129,219\n \n$\n20,376,941\n \n$\n18,695,829\n \nCosts and Expenses\nCost of goods sold\n15,260,506\n \n14,801,601\n \n13,946,230\n \nSelling, general and administrative\n3,283,127\n \n3,267,677\n \n2,759,268\n \nOperating income\n2,585,586\n \n2,307,663\n \n1,990,331\n \nInterest (income) expense, net\n(\n171,568\n)\n(\n164,118\n)\n2,842\n \nEarnings before taxes\n2,757,154\n \n2,471,781\n \n1,987,489\n \nProvision for taxes on earnings\n666,424\n \n597,261\n \n475,448\n \nNet earnings\n$\n2,090,730\n \n$\n1,874,520\n \n$\n1,512,041\n \nEarnings per share\nBasic\n$\n6.36\n \n$\n5.59\n \n$\n4.40\n \nDiluted\n$\n6.32\n \n$\n5.56\n \n$\n4.38\n \nWeighted-average shares outstanding (000)\nBasic\n328,593\n \n335,187\n \n343,452\n \nDiluted\n330,984\n \n337,433\n \n345,222\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n34\nConsolidated Statements of Comprehensive Income\nFiscal Year Ended\n($000)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet earnings\n$\n2,090,730\n \n$\n1,874,520\n \n$\n1,512,041\n \nOther comprehensive income\n—\n \n—\n \n—\n \nComprehensive income\n$\n2,090,730\n \n$\n1,874,520\n \n$\n1,512,041\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n35\nConsolidated Balance Sheets\n($000, except share data)\nFebruary 1, 2025\nFebruary 3, 2024\nAssets\nCurrent Assets\nCash and cash equivalents\n$\n4,730,744\n \n$\n4,872,446\n \nAccounts receivable\n144,482\n \n130,766\n \nMerchandise inventory\n2,444,513\n \n2,192,220\n \nPrepaid expenses and other\n218,957\n \n202,706\n \nTotal current assets\n7,538,696\n \n7,398,138\n \nProperty and Equipment\nLand and buildings\n1,493,496\n \n1,486,557\n \nFixtures and equipment\n4,521,044\n \n4,220,221\n \nLeasehold improvements\n1,701,340\n \n1,577,102\n \nConstruction-in-progress\n807,256\n \n628,730\n \n8,523,136\n \n7,912,610\n \nLess accumulated depreciation and amortization\n4,730,733\n \n4,380,709\n \nProperty and equipment, net\n3,792,403\n \n3,531,901\n \nOperating lease assets\n3,294,858\n \n3,126,841\n \nOther long-term assets\n279,375\n \n243,229\n \nTotal assets\n$\n14,905,332\n \n$\n14,300,109\n \nLiabilities and Stockholders’ Equity\nCurrent Liabilities\nAccounts payable\n$\n2,126,317\n \n$\n1,955,850\n \nAccrued expenses and other\n626,490\n \n671,867\n \nCurrent operating lease liabilities\n703,337\n \n683,625\n \nAccrued payroll and benefits\n462,284\n \n548,371\n \nIncome taxes payable\n43,666\n \n76,370\n \nCurrent portion of long-term debt\n699,731\n \n249,713\n \nTotal current liabilities\n4,661,825\n \n4,185,796\n \nLong-term debt\n1,515,080\n \n2,211,017\n \nNon-current operating lease liabilities\n2,764,281\n \n2,603,349\n \nOther long-term liabilities\n267,911\n \n232,383\n \nDeferred income taxes\n187,040\n \n196,238\n \nCommitments and contingencies\nStockholders’ Equity\nCommon stock, par value $\n0.01\n per share\n   Authorized \n1,000,000,000\n shares\n   Issued and outstanding \n328,813,000\n and\n   \n335,172,000\n shares, respectively\n3,288\n \n3,352\n \nAdditional paid-in capital\n2,097,110\n \n1,952,625\n \nTreasury stock\n(\n719,410\n)\n(\n633,318\n)\nRetained earnings\n4,128,207\n \n3,548,667\n \nTotal stockholders’ equity\n5,509,195\n \n4,871,326\n \nTotal liabilities and stockholders’ equity\n$\n14,905,332\n \n$\n14,300,109\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n \n36\nConsolidated Statements of Stockholders’ Equity\nAdditional paid-in capital\nCommon stock\nTreasury stock\nRetained earnings\n(000)\nShares\nAmount\nTotal\nBalance at January 29, 2022\n351,720\n \n$\n3,517\n \n$\n1,717,530\n \n$\n(\n535,895\n)\n$\n2,874,898\n \n$\n4,060,050\n \nNet earnings\n— \n— \n— \n— \n1,512,041\n \n1,512,041\n \nCommon stock issued under stock plans, net of shares used for tax withholding\n1,343\n \n14\n \n24,688\n \n(\n48,855\n)\n— \n(\n24,153\n)\nStock-based compensation\n— \n— \n121,936\n \n— \n— \n121,936\n \nCommon stock repurchased\n(\n10,310\n)\n(\n103\n)\n(\n43,905\n)\n— \n(\n905,988\n)\n(\n949,996\n)\nDividends declared ($\n1.240\n per share)\n— \n— \n— \n— \n(\n431,295\n)\n(\n431,295\n)\nBalance at January 28, 2023\n342,753\n \n$\n3,428\n \n$\n1,820,249\n \n$\n(\n584,750\n)\n$\n3,049,656\n \n$\n4,288,583\n \nNet earnings\n— \n— \n— \n— \n1,874,520\n \n1,874,520\n \nCommon stock issued under stock plans, net of shares used for tax withholding\n662\n \n7\n \n24,893\n \n(\n48,568\n)\n— \n(\n23,668\n)\nStock-based compensation\n— \n— \n145,490\n \n— \n— \n145,490\n \nCommon stock repurchased, inclusive of excise tax\n(\n8,243\n)\n(\n83\n)\n(\n38,007\n)\n— \n(\n920,695\n)\n(\n958,785\n)\nDividends declared ($\n1.340\n per share)\n— \n— \n— \n— \n(\n454,814\n)\n(\n454,814\n)\nBalance at February 3, 2024\n335,172\n \n$\n3,352\n \n$\n1,952,625\n \n$\n(\n633,318\n)\n$\n3,548,667\n \n$\n4,871,326\n \nNet earnings\n— \n— \n— \n— \n2,090,730\n \n2,090,730\n \nCommon stock issued under stock plans, net of shares used for tax withholding\n910\n \n9\n \n25,076\n \n(\n86,092\n)\n— \n(\n61,007\n)\nStock-based compensation\n— \n— \n156,298\n \n— \n— \n156,298\n \nCommon stock repurchased, inclusive of excise tax\n(\n7,269\n)\n(\n73\n)\n(\n36,889\n)\n— \n(\n1,022,469\n)\n(\n1,059,431\n)\nDividends declared ($\n1.470\n per share)\n— \n— \n— \n— \n(\n488,721\n)\n(\n488,721\n)\nBalance at February 1, 2025\n328,813\n \n$\n3,288\n \n$\n2,097,110\n \n$\n(\n719,410\n)\n$\n4,128,207\n \n$\n5,509,195\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n37\nConsolidated Statements of Cash Flows\nFiscal Year Ended\n($000)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCash Flows From Operating Activities\nNet earnings\n$\n2,090,730\n \n$\n1,874,520\n \n$\n1,512,041\n \nAdjustments to reconcile net earnings to net cash provided by operating activities:\nDepreciation and amortization\n446,788\n \n419,432\n \n394,655\n \nStock-based compensation\n156,298\n \n145,490\n \n121,936\n \nGain on sale of property\n(\n61,575\n)\n—\n \n—\n \nDeferred income taxes\n(\n9,198\n)\n(\n20,821\n)\n79,417\n \nChange in assets and liabilities:\nMerchandise inventory\n(\n252,293\n)\n(\n168,725\n)\n238,778\n \nOther current assets\n(\n27,319\n)\n(\n2,261\n)\n(\n39,487\n)\nAccounts payable\n154,664\n \n(\n65,327\n)\n(\n365,262\n)\nOther current liabilities\n(\n123,556\n)\n296,980\n \n(\n304,454\n)\nIncome taxes\n(\n27,457\n)\n22,931\n \n33,876\n \nOperating lease assets and liabilities, net\n12,627\n \n8,330\n \n9,261\n \nOther long-term, net\n(\n2,721\n)\n3,941\n \n8,612\n \nNet cash provided by operating activities\n2,356,988\n \n2,514,490\n \n1,689,373\n \nCash Flows From Investing Activities\nAdditions to property and equipment\n(\n720,104\n)\n(\n762,812\n)\n(\n654,070\n)\nProceeds from sale of property\n82,642\n \n—\n \n—\n \nNet cash used in investing activities\n(\n637,462\n)\n(\n762,812\n)\n(\n654,070\n)\nCash Flows From Financing Activities\nIssuance of common stock related to stock plans\n25,085\n \n24,900\n \n24,702\n \nTreasury stock purchased\n(\n86,092\n)\n(\n48,568\n)\n(\n48,855\n)\nRepurchase of common stock\n(\n1,049,979\n)\n(\n949,996\n)\n(\n949,996\n)\nExcise tax paid on repurchase of common stock\n(\n8,798\n)\n—\n \n—\n \nDividends paid\n(\n488,721\n)\n(\n454,814\n)\n(\n431,295\n)\nPayment of long-term debt\n(\n250,000\n)\n—\n \n—\n \nNet cash used in financing activities\n(\n1,858,505\n)\n(\n1,428,478\n)\n(\n1,405,444\n)\nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n(\n138,979\n)\n323,200\n \n(\n370,141\n)\nCash and cash equivalents, and restricted cash and cash equivalents:\nBeginning of year \n4,935,441\n \n4,612,241\n \n4,982,382\n \nEnd of year\n$\n4,796,462\n \n$\n4,935,441\n \n$\n4,612,241\n \nSupplemental Cash Flow Disclosures\nInterest paid\n$\n80,316\n \n$\n80,316\n \n$\n80,316\n \nIncome taxes paid, net\n$\n703,079\n \n$\n595,152\n \n$\n362,156\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n38\nNotes to Consolidated Financial Statements\nNote A: \nSummary of Significant Accounting Policies\nBusiness.\n \nRoss Stores, Inc. and its subsidiaries (the “Company”) is an off-price retailer of first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family. At the end of fiscal 2024, the Company operated \n1,831\n Ross Dress for Less\n®\n (“Ross”) locations in \n43\n states, the District of Columbia, and Guam, and \n355\n dd’s DISCOUNTS\n®\n stores in \n22\n states. The Ross and dd’s DISCOUNTS stores are supported by the Company’s headquarters, buying offices, and its network of distribution centers and warehouses.\n \nBasis of presentation and fiscal year.\n \nThe consolidated financial statements include the accounts of the Company and its subsidiaries, all of which are wholly-owned. Intercompany transactions and accounts have been eliminated.\n \nThe Company follows the National Retail Federation fiscal calendar and utilizes a 52-53 week fiscal year whereby the fiscal year ends on the Saturday nearest to January 31. The fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023 are referred to as fiscal 2024, fiscal 2023, and fiscal 2022, respectively. Fiscal 2023 was a 53-week year. Fiscal 2024 and 2022 were each 52-week years.\nUse of accounting estimates.\n \nThe preparation of consolidated financial statements in conformity with Generally Accepted Accounting Principles in the United States of America (“GAAP”) requires the Company to make estimates and assumptions that affect the reported amounts of assets, liabilities, and disclosures of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ materially from the Company’s estimates. The Company’s significant accounting estimates include valuation reserves for inventory, packaway and other inventory carrying costs, useful lives of fixed assets, insurance reserves, reserves for uncertain tax positions, and legal claims.\nSegment reporting.\n \nThe Company has \none\n reportable segment.\n Refer to Note I: Segment Reporting\n for additional information.\nCash and cash equivalents.\n \nCash equivalents consist of highly liquid, fixed income instruments purchased with an original maturity of three months or less. The institutions where these instruments are held could potentially subject the Company to concentrations of credit risk. The Company manages its risk associated with these instruments by primarily holding its cash and cash equivalents across a highly diversified set of banks and other financial institutions.\nRestricted cash and cash equivalents.\n \nRestricted cash and cash equivalents serve as collateral for certain insurance obligations. These restricted funds are invested in bank deposits, money market mutual funds, and U.S. Government and agency securities, and cannot be withdrawn from the Company’s account without the prior written consent of the secured parties. The classification between current and long-term is based on the timing of expected payments of the obligations.\nThe Company uses standby letters of credit in addition to a funded trust to collateralize certain insurance obligations. The standby letters of credit are collateralized by restricted cash. As of February 1, 2025, February 3, 2024, and January 28, 2023, the Company had $\n1.8\n million, $\n2.2\n million, and $\n2.6\n million, respectively, in standby letters of credit outstanding. As of February 1, 2025, February 3, 2024, and January 28, 2023, the Company had $\n63.9\n million, $\n60.8\n million, and $\n57.8\n million, respectively, in a collateral trust.\n39\nThe following table provides a reconciliation of cash, cash equivalents, and restricted cash and cash equivalents in the Consolidated Balance Sheets, that reconcile to the amounts shown on the Consolidated Statements of Cash Flows:\n($000)\n2024\n2023\n2022\nCash and cash equivalents\n$\n4,730,744\n \n$\n4,872,446\n \n$\n4,551,876\n \nRestricted cash and cash equivalents included in:\nPrepaid expenses and other\n17,087\n \n14,489\n \n12,677\n \nOther long-term assets\n48,631\n \n48,506\n \n47,688\n \nTotal restricted cash and cash equivalents\n65,718\n \n62,995\n \n60,365\n \nTotal cash and cash equivalents, and restricted cash and cash equivalents\n$\n4,796,462\n \n$\n4,935,441\n \n$\n4,612,241\n \nEstimated fair value of financial instruments. \nThe carrying value of cash and cash equivalents, restricted cash and cash equivalents, accounts receivable, other long-term assets, accounts payable, and other long-term liabilities approximates their estimated fair value. Refer to Note B: Fair Value Measurements\n \nand Note D: Debt for additional information.\nCash and cash equivalents were $\n4.7\n billion and $\n4.9\n billion at February 1, 2025 and February 3, 2024, respectively, and include bank deposits, money market funds, and U.S. Government and agency securities for which the fair value was determined using quoted prices for identical assets in active markets, which are considered to be Level 1 inputs under the fair value measurements and disclosures guidance.\nMerchandise inventory.\n \nMerchandise inventory is stated at the lower of cost (determined using a weighted-average basis) or net realizable value. Inventory purchased by the Company can either be shipped to stores or processed as packaway merchandise with the intent that it will be warehoused and released to stores at a later date.\n Merchandise inventory includes acquisition, transportation, processing, and storage costs. \nThe timing of the release of packaway inventory to the stores is principally driven by the product mix, seasonality of the merchandise, and its relation to the Company’s store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage less than \nsix months\n. I\nncluded in the carrying value of the Company’s merchandise inventory is a provision for shortage. The shortage reserve is based on historical shortage rates as determined through our annual physical merchandise inventory counts and cycle counts.\nProperty and equipment.\n \nProperty and equipment are stated at cost, less accumulated depreciation and amortization. Depreciation is\n calculated using the straight-line method over the estimated useful life of the asset, typically ranging from \nthree years\n to \n12\n years for equipment, \n20\n years to \n40\n years for land improvements and buildings, and \nthree years\n to \nseven years\n for computer software costs incurred in developing or obtaining software for internal use. The cost of leasehold improvements is amortized over the useful life of the asset or the applicable lease term, whichever is less. Depreciation and amortization expense on property and equipment was $\n446.8\n million, $\n419.4\n million, and $\n394.7\n million for fiscal 2024, 2023, and 2022, respectively. The Company capitalizes interest during the construction period of facilities and during the development and implementation phase of software projects. Interest capitalized was $\n19.4\n million, $\n12.1\n million, and $\n5.7\n million in fiscal 2024, 2023, and 2022, respectively.\nAs of February 1, 2025, February 3, 2024, and January 28, 2023, the Company had $\n85.4\n million, $\n78.2\n million, and $\n71.0\n million, respectively, of property and equipment purchased but not yet paid. These purchases are included in Property and Equipment and the related liabilities are included in Accounts payable and Accrued expenses and other in the accompanying Consolidated Balance Sheets.\nIn December 2024, the Company completed the sale of a packaway warehouse facility and recognized a pre-tax gain on sale of $\n61.6\n million which is included within Selling, general and administrative on the Consolidated Statements of Earnings. Cash proceeds from the sale of the facility were $\n82.6\n million.\n40\nOther long-term assets.\n \nOther long-term assets as of February 1, 2025 and February 3, 2024 consisted of the following:\n($000)\n2024\n2023\nDeferred compensation (Note G)\n$\n196,786\n \n$\n165,582\n \nRestricted cash and cash equivalents\n48,631\n \n48,506\n \nOther\n33,958\n \n29,141\n \nTotal\n$\n279,375\n \n$\n243,229\n \nImpairment of long-lived assets.\n \nProperty and other long-term assets that are subject to depreciation and amortization are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable based on estimated undiscounted future cash flows. For stores that are closed, the Company records an impairment charge, if appropriate, or accelerates depreciation over the revised useful life of the asset. Intangible assets that are not subject to amortization, including goodwill, are tested for impairment annually or more frequently if events or changes in circumstances indicate that the asset may be impaired.\n \nNo\n material impairment charges were recorded during fiscal \n2024, \n2023, and 2022. \nAccounts payable.\n \nAccounts payable represents amounts owed to third parties at the end of the period. Accounts payable includes book cash overdrafts (checks issued under zero balance accounts not yet presented for payment) in excess of cash balances in such accounts of approximately $\n71.3\n million and $\n61.4\n million at February 1, 2025 and February 3, 2024, respectively. The Company includes the change in book cash overdrafts in operating cash \nflows.\nSupply chain finance program.\n \nThe Company facilitates a voluntary supply chain finance program (the “program”) to provide certain suppliers with the opportunity to sell their receivables due from the Company to participating financial institutions at the sole discretion of both the suppliers and the financial institutions. A third-party financial institution administers the program. The Company’s responsibility is limited to making payments on the terms originally negotiated with each supplier, regardless of whether a supplier sells its receivable to a financial institution. The Company is not a party to the agreements between the participating financial institutions and the suppliers in connection with the program, and does not receive financial incentives from the suppliers or the financial institutions. The Company does not provide guarantees under the program, and the Company’s rights and obligations to its suppliers are not affected by the program. The range of payment terms negotiated with a supplier is consistent, irrespective of whether a supplier participates in the program.\nAll outstanding payments owed under the program are recorded within Accounts payable in the Consolidated Balance Sheets. The Company accounts for all payments made under the program as a reduction to operating cash flows in Accounts payable within the Consolidated Statements of Cash Flows.\n The amounts owed to participating financial institutions under the program and included in \nAccounts payable\n were $\n159.2\n million and $\n146.9\n million as of February 1, 2025 and February 3, 2024, respectively.\nThe following table is a reconciliation of the outstanding obligations confirmed as valid under the Company’s supply chain finance program for fiscal \n2024\n:\n($000)\n2024\nConfirmed obligations outstanding at the beginning of the year\n$\n146,937\n \nInvoices confirmed during the year\n856,294\n \nConfirmed invoices paid during the year\n(\n844,022\n)\nConfirmed obligations outstanding at the end of the year\n$\n159,209\n \n41\nInsurance obligations.\n \nThe Company uses a combination of insurance and self-insurance for a number of risk management activities, including workers’ compensation, general liability, and employee-related health care benefits. The self-insurance and deductible liability is determined actuarially, based on claims filed and an estimate of claims incurred but not yet reported.\n \nSelf-insurance and deductible reserves as of February 1, 2025 and February 3, 2024 consisted of the following:\n($000)\n2024\n2023\nWorkers’ compensation\n$\n70,747\n \n$\n80,791\n \nGeneral liability\n58,460\n \n47,663\n \nMedical plans\n7,938\n \n8,145\n \nTotal\n$\n137,145\n \n$\n136,599\n \nWorkers’ compensation and self-insured medical plan liabilities are included in Accrued payroll and benefits, and accruals for general liability are included in Accrued expenses and other in the accompanying Consolidated Balance Sheets.\nOther long-term liabilities.\n \nOther long-term liabilities as of February 1, 2025 and February 3, 2024 consisted of the following:\n($000)\n2024\n2023\nDeferred compensation (Note G)\n$\n196,786\n \n$\n165,582\n \nIncome taxes (Note F)\n61,292\n \n56,045\n \nOther\n9,833\n \n10,756\n \nTotal\n$\n267,911\n \n$\n232,383\n \nLease accounting.\n \nAs the Company’s leases generally do not provide an implicit discount rate, the Company uses the estimated collateralized incremental borrowing rate based on information available at the lease commencement date in determining the present value of lease payments for use in the calculation of the operating lease liabilities and right-of-use assets. This rate is determined using a portfolio approach based on the risk-adjusted rate of interest and requires estimates and assumptions including credit rating, credit spread, and adjustments for the impact of collateral. The Company believes that this is the rate it would have to pay to borrow an amount equal to the lease payments on a collateralized basis over a similar lease term. Operating lease liabilities and corresponding right-of-use assets include options to extend lease terms that are reasonably certain of being exercised. The Company does not record a lease liability and corresponding right-of-use asset for leases with terms of 12 months or less and accounts for lease and non-lease components as a single lease component. The Company’s lease portfolio is comprised of operating leases with the lease cost recorded on a straight-line basis over the lease term. Refer to \nNote E: Leases for additional information.\nRevenue recognition.\n \nThe Company recognizes revenue at the point of sale, net of sales taxes collected and an allowance for estimated future returns. The Company recognizes allowances for estimated sales returns on a gross basis as a reduction to sales. The asset recorded for the expected recovery of merchandise inventory was $\n12.4\n million, $\n12.1\n million, and $\n11.8\n million and the liability recorded for the refund due to the customer was $\n24.1\n million, $\n23.7\n million, and $\n23.1\n million as of February 1, 2025, February 3, 2024, and January 28, 2023, respectively. Sales taxes collected that are outstanding and the allowance for estimated future returns are included in Accrued expenses and other, and the asset for expected recovery of merchandise is included in Prepaid expenses and other in the Consolidated Balance Sheets.\nSales of stored value cards are deferred until they are redeemed for the purchase of Company merchandise. The Company’s stored value cards do not have expiration dates. Based upon historical redemption rates, a small percentage of stored value cards will never be redeemed, which represents breakage. Breakage is estimated and recognized as revenue based upon the historical pattern of customer redemptions. \nBreakage was not material to the consolidated financial statements in fiscal 2024, 2023, and 2022. \n42\nThe following sales mix table disaggregates revenue by merchandise category for fiscal 2024, 2023, and 2022:\n2024\n1\n2023\n2022\nHome Accents and Bed and Bath\n26\n \n%\n26\n \n%\n26\n \n%\nLadies\n22\n \n%\n23\n \n%\n24\n \n%\nMen’s\n16\n \n%\n15\n \n%\n15\n \n%\nAccessories, Lingerie, Fine Jewelry, and Cosmetics\n15\n \n%\n15\n \n%\n14\n \n%\nShoes\n12\n \n%\n13\n \n%\n12\n \n%\nChildren’s\n9\n \n%\n8\n \n%\n9\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\nCost of goods sold.\n \nIn addition to\n \nproduct costs, the Company includes in cost of goods sold its buying, distribution, and freight expenses, as well as occupancy costs and depreciation and amortization related to the Company’s retail stores, buying, and distribution facilities. Buying expenses include costs to procure merchandise inventories. Distribution expenses include the cost of operating the Company’s distribution centers, warehouses, and cross-dock facilities.\nStore pre-opening.\n \nStore pre-opening costs are expensed in the period incurred.\nAdvertising.\n \nAdvertising costs are expensed in the period incurred and are included in Selling, general and administrative expenses.\n Advertising costs for fiscal 2024, 2023, and 2022 were $\n70.2\n million, $\n67.7\n million, and $\n66.5\n million, respectively.\nStock-based compensation.\n \nThe Company recognizes compensation expense based upon the grant date fair value of all stock-based awards, typically over the vesting period.\n Refer to Note C: Stock-Based Compensation for more information on the Company’s stock-based compensation plans.\nInterest (income) expense, net.\n \nInterest (income) expense, net primarily includes interest income, capitalized interest expense, interest expense on long-term debt, and other interest expense.\nThe table below shows the components of interest (income) expense, net for fiscal 2024, 2023, and 2022:\n($000)\n2024\n2023\n2022\nInterest income\n$\n(\n234,955\n)\n$\n(\n238,207\n)\n$\n(\n77,706\n)\nCapitalized interest expense\n(\n19,447\n)\n(\n12,106\n)\n(\n5,678\n)\nOther interest expense\n1,571\n \n1,599\n \n1,668\n \nInterest expense on long-term debt\n81,263\n \n84,596\n \n84,558\n \nInterest (income) expense, net\n$\n(\n171,568\n)\n$\n(\n164,118\n)\n$\n2,842\n \nTaxes on earnings.\n \nThe Company accounts for income taxes in accordance with the Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) 740,\n Accounting for Income Taxes\n, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been recognized in the Company’s consolidated financial statements or tax returns. In estimating future tax consequences, the Company generally considers all expected future events other than changes in the tax law or tax rates. ASC 740 clarifies the criteria that an individual tax position must satisfy for some or all of the benefits of that position to be recognized in a company’s consolidated financial statements. ASC 740 prescribes a recognition threshold of more-likely-than-not and a measurement standard for all tax positions taken or expected to be taken on a tax return in order for those tax positions to be recognized in the consolidated financial statements.\n Refer to \nNote F: Taxes on Earnings\n for additional information.\nTreasury stock.\n \nThe Company records treasury stock at cost. Treasury stock includes shares purchased from employees for tax withholding purposes related to vesting of equity plan awards.\n43\nEarnings per share.\n \nThe Company computes and reports both basic earnings per share (“EPS”) and diluted EPS. Basic EPS is computed by dividing net earnings by the weighted-average number of common shares outstanding for the period. Diluted EPS is computed by dividing net earnings by the sum of the weighted-average number of common shares and dilutive common stock equivalents outstanding during the period. Diluted EPS reflects the total potential dilution that could occur from outstanding equity plan awards and unvested shares of both performance and non-performance based awards of restricted stock and restricted stock units.\nShares are excluded from the calculation of diluted EPS if their effect would have been anti-dilutive to the calculation of diluted EPS. In fiscal 2024, 2023, and 2022 approximately \n49,600\n, \n200\n, and \n11,100\n weighted-average shares were excluded from the calculation of diluted EPS, respectively.\nThe following is a reconciliation of the number of shares (denominator) used in the basic and diluted EPS computations:\nShares in (000s)\nBasic EPS\nEffect of dilutive\ncommon stock\nequivalents\nDiluted\nEPS\n2024\nShares\n328,593\n \n2,391\n \n330,984\n \nAmount\n$\n6.36\n \n$\n(\n0.04\n)\n$\n6.32\n \n2023\nShares\n335,187\n \n2,246\n \n337,433\n \nAmount\n$\n5.59\n \n$\n(\n0.03\n)\n$\n5.56\n \n2022\nShares\n343,452\n \n1,770\n \n345,222\n \nAmount\n$\n4.40\n \n$\n(\n0.02\n)\n$\n4.38\n \nRecently adopted accounting standards. \nI\nn November 2023, the FASB issued Accounting Standards Update (“ASU”) 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.\n The ASU is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The Company adopted ASU 2023-07 for the fiscal year ended February 1, 2025 on a retrospective basis. The adoption of the standard did not have a material impact on the Company’s consolidated financial statements.\nIn September 2022, the FASB issued ASU 2022-04, \nLiabilities — Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations\n, to enhance transparency about an entity’s use of supplier finance programs. The ASU requires enhanced and additional disclosures about the key terms of supplier finance programs including a description of where in the financial statements any related amounts are presented. The Company adopted ASU 2022-04 in the first quarter of fiscal 2023 on a retrospective basis, and the rollforward requirements for the fiscal year ended February 1, 2025 on a prospective basis. T\nhe adoption of this standard did not have a material impact on the Company’s consolidated financial statements.\nRecently issued accounting standards. \nIn November 2024, the FASB issued ASU 2024-03,\n \nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40)\n:\n \nDisaggregation of Income Statement Expenses\n. The ASU is intended to enhance transparency of income statement disclosures primarily through additional disaggregation of relevant expense captions. The standard is effective for annual reporting periods beginning after December 15, 2026, and interim periods within annual reporting periods beginning after December 15, 2027, with prospective or retrospective application permitted. The Company is currently evaluating the impact of this guidance on its disclosures in the consolidated financial statements.\n44\nIn December 2023, the FASB issued ASU 2023-09,\n Income Taxes (Topic 740)\n:\n Improvements to Income Tax Disclosures\n. The ASU is intended to enhance the transparency and decision usefulness of income tax disclosures. It requires the Company to disclose disaggregated jurisdictional and categorical information for the tax rate reconciliation and the amount of income taxes paid as well as additional income tax related amounts. The new guidance is effective for annual reporting periods beginning after December 15, 2024, with retrospective application permitted. The Company is currently evaluating the impact of this guidance on its disclosures in the consolidated financial statements.\nNote B: \nFair Value Measurements\nAccounting standards pertaining to fair value measurements establish a three-tier fair value hierarchy which prioritizes the inputs used in measuring fair value. The inputs used to measure fair value include: Level 1, observable inputs such as quoted prices in active markets; Level 2, inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, unobservable inputs in which little or no market data exists. This fair value hierarchy requires the Company to develop its own assumptions, maximize the use of observable inputs, and minimize the use of unobservable inputs when measuring fair value. Corporate and U.S. government and agency securities are classified within Level 1 because these securities are valued using quoted market prices.\nThe fair value of the Company’s financial instruments as of February 1, 2025 and February 3, 2024 are as follows:\n($000)\n2024\n2023\nCash and cash equivalents (Level 1)\n$\n4,730,744\n \n$\n4,872,446\n \nRestricted cash and cash equivalents (Level 1)\n$\n65,718\n \n$\n62,995\n \nThe underlying assets in the Company’s nonqualified deferred compensation program as of February 1, 2025 and February 3, 2024 (included in Other long-term assets and Other long-term liabilities) primarily consist of participant-directed money market, \nst\nock, and bond funds. \nThe fair value measurement for funds with quoted market prices in active markets (Level 1) are as follows:\n($000)\n2024\n2023\nNonqualified deferred compensation program (Level 1)\n$\n196,786\n \n$\n165,582\n \nNote C: \nStock-Based Compensation\nOn May 17, 2017, the Company’s stockholders approved the Ross Stores, Inc. 2017 Equity Incentive Plan (the “2017 Plan”). The 2017 Plan had an initial share reserve of \n12.0\n million shares of the Company’s common stock, which could be increased by a maximum of \n5.5\n million shares from certain expired, withheld, or forfeited shares from the 2017 Plan or the predecessor plan. The 2017 Plan provides for various types of incentive awards, which may potentially include the grant of stock options, stock appreciation rights, restricted stock purchase rights, restricted stock bonuses, restricted stock units, performance shares, performance units, and deferred compensation awards.\nRestricted stock.\n The Company grants shares of restricted stock and restricted stock units to directors, officers, and key employees. The fair value of shares of restricted stock and restricted stock units at the date of grant is amortized to expense over the vesting period of generally \nthree\n \nto \nfive years\n. \nPerformance awards.\n The Company has a performance share award program for senior executives. A performance share award represents a right to receive shares of restricted stock on a specified settlement date based on the Company’s attainment of a performance goal during the performance period, which is the Company’s fiscal year. If attained, the restricted stock then vests over a service period, generally \nthree years\n from the date the performance award was granted.\nIn fiscal 2024, the Company also granted a performance-conditioned restricted stock unit award (“PRSU”) in connection with the hiring of its new CEO. The PRSU is subject to vesting based on both service and market-based conditions, over a period that ends in March 2029. The fair value of the PRSU on the grant date was $\n6.9\n million, determined using a Monte Carlo simulation model, and will be amortized to expense over the service period. \n45\nRestricted stock awards and performance awards (including the PRSU) are collectively referred to as stock awards.\nA summary of stock awards activity for fiscal 2024 is presented below:\nNumber of \nshares (000)\nWeighted-average\ngrant date\nfair value\nUnvested at February 3, 2024\n4,395\n \n$\n104.52\n \nAwarded\n1,214\n \n148.08\n \nReleased\n(\n1,307\n)\n104.80\n \nForfeited\n(\n145\n)\n108.39\n \nUnvested at February 1, 2025\n4,157\n \n$\n117.02\n \nAll unvested shares at February 1, 2025, with the exception of the PRSU shares, are only subject to service vesting conditions. The \n51,164\n PRSU shares awarded in fiscal 2024 all remain unvested as of February 1, 2025. The weighted-average grant date fair value of the PRSU shares was $\n135.83\n.\nThe unamortized stock award compensation expense at February 1, 2025 and February 3, 2024 was $\n229.3\n million and $\n217.1\n million, respectively, which are each expected to be recognized over a weighted-average remaining period of \n1.7\n years. Intrinsic value for unvested stock awards, defined as the closing market value per share on the last business day of fiscal year 2024 (or $\n150.56\n), applied to the unvested shares was $\n625.9\n million. A total of \n7.3\n million, \n7.8\n million, and \n8.9\n million shares were available under the 2017 Plan for new stock awards at the end of fiscal 2024, 2023, and 2022, respectively.\nEmployee Stock Purchase Plan.\n Under the Employee Stock Purchase Plan (“ESPP”), eligible employees participating in the quarterly offering period can choose to have up to the lesser of \n10\n% of their annual base earnings or the IRS annual share purchase limit of $\n25,000\n in aggregate market value to purchase the Company’s common stock. The purchase price of the stock is \n85\n% of the closing market price on the date of purchase. Purchases occur on a quarterly basis (on the last trading day of each calendar quarter). The Company recognizes expense for ESPP purchase rights equal to the value of the \n15\n% discount given on the purchase date.\nDuring fiscal 2024, 2023, and 2022, employees purchased approximately \n0.2\n million, \n0.3\n million, and \n0.3\n million shares, respectively, of the Company’s common stock under the plan at weighted-average per share prices of $\n126.18\n, $\n98.86\n, and $\n74.54\n, respectively. Through February 1, 2025, approximately \n41.5\n million shares had been issued under this plan and \n3.4\n million shares remained available for future issuance.\nFor fiscal 2024, 2023, and 2022, the Company recognized stock-based compensation expense as follows:\n($000)\n2024\n2023\n2022\nRestricted stock\n$\n92,837\n \n$\n92,511\n \n$\n85,092\n \nPerformance awards\n59,033\n \n48,584\n \n32,484\n \nEmployee stock purchase plan \n4,428\n \n4,395\n \n4,360\n \nTotal\n$\n156,298\n \n$\n145,490\n \n$\n121,936\n \nCapitalized stock-based compensation cost was not material in any year presented.\n46\nTotal stock-based compensation recognized in the Company’s Consolidated Statements of Earnings for fiscal 2024, 2023, and 2022 is as follows:\nStatements of Earnings Classification ($000)\n2024\n2023\n2022\nCost of goods sold\n$\n73,901\n \n$\n76,301\n \n$\n67,141\n \nSelling, general and administrative\n82,397\n \n69,189\n \n54,795\n \nTotal\n$\n156,298\n \n$\n145,490\n \n$\n121,936\n \nThe tax benefits related to stock-based compensation expense for fiscal 2024, 2023, and 2022\n \nwere $\n29.6\n million, $\n29.6\n million, and $\n24.8\n million, respectively.\nNote D: \nDebt\nLong-term debt.\n \nUnsecured senior debt (the “Senior Notes”), net of unamortized discounts and debt issuance costs, as of February 1, 2025 and February 3, 2024 consisted of the following:\n($000)\n2024\n2023\n3.375\n% Senior Notes due 2024\n$\n—\n \n$\n249,713\n \n4.600\n% Senior Notes due 2025\n699,731\n \n698,441\n \n0.875\n% Senior Notes due 2026\n498,503\n \n497,268\n \n4.700\n% Senior Notes due 2027\n240,778\n \n240,335\n \n4.800\n% Senior Notes due 2030\n132,953\n \n132,776\n \n1.875\n% Senior Notes due 2031\n496,390\n \n495,820\n \n5.450\n% Senior Notes due 2050\n146,456\n \n146,377\n \nTotal long-term debt\n1\n$\n2,214,811\n \n$\n2,460,730\n \nLess: current portion\n$\n699,731\n \n$\n249,713\n \nTotal due beyond one year\n$\n1,515,080\n \n$\n2,211,017\n \n1 \nNet of unamortized discount and debt issuance costs of $\n10.2\n million and $\n14.3\n million as of February 1, 2025 and February 3, 2024, respectively.\n \nInterest on all Senior Notes is payable semi-annually and the Senior Notes are subject to prepayment penalties for early payment of principal.\nIn September 2024, the Company repaid at maturity the $\n250\n million principal amount of the \n3.375\n% Senior Notes.\nThe aggregate fair value of the remaining \nsix\n outstanding series of Senior Notes was approximately $\n2.1\n billion as of February 1, 2025. The aggregate fair value of the \nseven\n outstanding series of Senior Notes was approximately $\n2.3\n billion as of February 3, 2024. The fair value is estimated by obtaining comparable market quotes which are considered to be Level 1 inputs under the fair value measurements and disclosures guidance. \nThe following table shows scheduled annual principal payments on long-term debt:\n($000)\n2025\n$\n700,000\n \n2026\n$\n500,000\n \n2027\n$\n241,786\n \nThereafter\n$\n783,205\n \n47\nRevolving credit facilities. \nThe Company’s $\n1.3\n billion senior unsecured revolving credit facility (“Credit Facility”) expires in February 2027 and may be extended at the Company’s request for up to \ntwo\n additional \none-year\n periods subject to customary conditions. The Credit Facility contains a $\n300\n million sublimit for issuance of standby letters of credit. It also contains an option allowing the Company to increase the size of its Credit Facility by up to an additional $\n700\n million, with the agreement of the committing lenders. Interest on borrowings under this Credit Facility is a term rate based on the Secured Overnight Financing Rate (“Term SOFR”) (or an alternate benchmark rate, if Term SOFR is no longer available) plus an applicable margin and is payable quarterly and upon maturity.\nThe Credit Facility is subject to a quarterly Consolidated Adjusted Debt to Consolidated EBITDAR financial leverage ratio covenant. As of \nFebruary 1, 2025\n, the Company was in compliance with the financial covenant, had \nno\n borrowings or standby letters of credit outstanding under the Credit Facility, and the $\n1.3\n billion Credit Facility remained in place and available.\nNote E: \nLeases\nThe Company currently leases its store locations with original, non-cancelable terms that in general range from \nthree years\n to \nten years\n. Store leases typically contain provisions for \nthree\n to \nfour\n renewal options of \nfive years\n each. The exercise of lease renewal options is at the sole discretion of the Company. Most store leases also provide for minimum annual rentals and for payment of variable lease costs. In addition, some store leases also have provisions for additional rent based on a percentage of sales (“percentage rent”) and others include rental payments adjusted periodically for inflation. The Company’s lease agreements do not contain any material residual guarantees or material restrictive covenants. The Company does not have any financing leases.\nThe Company leases certain \nd\nistribution/warehouse facilities with expiration dates ranging from 2025 to 2031 and the majority\n contain renewal provisions. \nThe Company also leases office space for its Los Angeles and Boston buying offices. The lease terms for these facilities expire in 2027 and 2026, respectively. The Los Angeles and Boston buying office facilities contain renewal provisions. \nI\nn addition, the Company has a ground lease related to its New York buying office. \nThe following table presents net operating lease cost included in the Consolidated Statement of Earnings for fiscal 2024, 2023, and 2022: \n($000)\n2024\n2023\n2022\nOperating lease cost\n1\n$\n800,834\n \n$\n760,268\n \n$\n721,340\n \nVariable lease costs\n2\n246,315\n \n219,526\n \n206,262\n \nNet lease cost\n3\n$\n1,047,149\n \n$\n979,794\n \n$\n927,602\n \n1\n Net of sublease income which was immaterial.\n2\n Includes property and rent taxes, insurance, common area maintenance, percentage rent, and negotiated rent abatements.\n3\n Excludes short-term lease costs which were immaterial.\n48\nThe maturity of operating lease liabilities, including the ground lease related to the New York buying office as of February 1, 2025, are as follows:\n($000)\nOperating Leases\n1\n2025\n$\n766,071\n \n2026\n774,352\n \n2027\n663,938\n \n2028\n536,465\n \n2029\n362,872\n \nThereafter\n1,624,793\n \nTotal lease payments\n$\n4,728,491\n \nLess: interest\n1,260,873\n \nPresent value of lease liabilities\n$\n3,467,618\n \nLess: current operating lease liabilities\n703,337\n \nNon-current operating lease liabilities\n$\n2,764,281\n \n1\n Operating leases exclude $\n187.2\n million of minimum lease payments for leases signed that have not yet commenced.\nThe weighted-average remaining lease term and the weighted-average discount rate for operating leases as of February 1, 2025 and February 3, 2024 are as follows:\n2024\n2023\nWeighted-average remaining lease term (years):\nIncluding the long-term ground lease related to the New York buying office\n9.6\n9.8\nExcluding the long-term ground lease related to the New York buying office\n5.5\n5.4\nWeighted-average discount rate:\nIncluding the long-term ground lease related to the New York buying office\n4.2\n \n%\n3.9\n \n%\nExcluding the long-term ground lease related to the New York buying office\n4.1\n \n%\n3.6\n \n%\nThe following table presents cash paid for amounts included in the measurement of operating lease liabilities and operating lease assets obtained in exchange for operating lease liabilities (includes new leases and remeasurements or modifications of existing leases) for fiscal 2024, 2023, and 2022:\n($000)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n789,211\n \n$\n746,254\n \n$\n701,478\n \nOperating lease assets obtained in exchange for operating lease liabilities\n$\n841,891\n \n$\n682,580\n \n$\n705,220\n \n49\nNote F: \nTaxes on Earnings\nThe provision for income taxes consisted of the following:\n($000)\n2024\n2023\n2022\nCurrent\nFederal\n$\n580,253\n \n$\n532,913\n \n$\n338,479\n \nState\n95,369\n \n85,169\n \n57,552\n \n675,622\n \n618,082\n \n396,031\n \nDeferred\nFederal\n(\n7,016\n)\n(\n16,265\n)\n74,062\n \nState\n(\n2,182\n)\n(\n4,556\n)\n5,355\n \n(\n9,198\n)\n(\n20,821\n)\n79,417\n \nTotal\n$\n666,424\n \n$\n597,261\n \n$\n475,448\n \nThe provision for taxes for financial reporting purposes is different from the tax provision computed by applying the statutory federal income tax rate. The differences are reconciled below:\n2024\n2023\n2022\nFederal income taxes at the statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income taxes (net of federal benefit) and other, net\n3.2\n \n%\n3.2\n \n%\n2.9\n \n%\nTotal\n24.2\n \n%\n24.2\n \n%\n23.9\n \n%\nThe components of deferred taxes at February 1, 2025 and February 3, 2024 are as follows:\n($000)\n2024\n2023\nDeferred Tax Assets\nAccrued liabilities\n$\n32,819\n \n$\n35,010\n \nDeferred compensation\n45,689\n \n39,366\n \nStock-based compensation\n53,995\n \n52,431\n \nState taxes and credits\n20,534\n \n18,494\n \nEmployee benefits\n29,549\n \n33,764\n \nOperating lease liabilities\n870,577\n \n826,566\n \nOther\n9,633\n \n9,053\n \nGross Deferred Tax Assets\n1,062,796\n \n1,014,684\n \nLess: Valuation allowance\n(\n583\n)\n—\n \nDeferred Tax Assets\n1,062,213\n \n1,014,684\n \nDeferred Tax Liabilities\nDepreciation and amortization\n(\n364,320\n)\n(\n369,529\n)\nMerchandise inventory\n(\n26,004\n)\n(\n25,410\n)\nSupplies\n(\n14,873\n)\n(\n14,137\n)\nOperating lease assets\n(\n826,425\n)\n(\n785,608\n)\nOther\n(\n17,631\n)\n(\n16,238\n)\nDeferred Tax Liabilities\n(\n1,249,253\n)\n(\n1,210,922\n)\nNet Deferred Tax Liabilities\n$\n(\n187,040\n)\n$\n(\n196,238\n)\n50\nAt the end of fiscal 2024 and 2023, the Company’s state tax credit carryforwards for income tax purposes were approximately $\n9.6\n million and $\n10.1\n million, respectively. The state tax credit carryforwards will begin to expire in fiscal 2031. The Company has provided a valuation allowance of $\n0.6\n million as of the end of fiscal 2024 for deferred tax assets related to state tax credits that are not expected to be realized.\nThe changes in amounts of unrecognized tax benefits (gross of federal tax benefits and excluding interest and penalties) at fiscal 2024, 2023, and 2022 are as follows:\n($000)\n2024\n2023\n2022\nUnrecognized tax benefits - beginning of year\n$\n52,379\n \n$\n53,544\n \n$\n60,547\n \nGross increases:\nTax positions in current period\n13,100\n \n13,206\n \n10,132\n \nTax positions in prior period\n1,163\n \n2,295\n \n672\n \nGross decreases:\nTax positions in prior periods\n(\n3,405\n)\n(\n4,366\n)\n(\n6,808\n)\nLapse of statutes of limitations\n(\n8,820\n)\n(\n11,148\n)\n(\n9,989\n)\nSettlements\n(\n126\n)\n(\n1,152\n)\n(\n1,010\n)\nUnrecognized tax benefits - end of year\n$\n54,291\n \n$\n52,379\n \n$\n53,544\n \nAt the end of fiscal 2024, 2023, and 2022, the reserves for unrecognized tax benefits were $\n62.2\n million, $\n58.6\n million, and $\n60.6\n million inclusive of $\n7.9\n million, $\n6.2\n million, and $\n7.1\n million of related reserves for interest and penalties, respectively. The Company accounts for interest and penalties related to unrecognized tax benefits as a part of its provision for taxes on earnings. If recognized, $\n49.4\n million would impact the Company’s effective tax rate. The difference between the total amount of unrecognized tax benefits and the amounts that would impact the effective tax rate relates to amounts attributable to deferred tax assets and liabilities. These amounts are net of federal and state income taxes.\nIt is reasonably possible that certain federal and state tax matters may be concluded or statutes of limitations may lapse during the next twelve months. Accordingly, the total amount of unrecognized tax benefits may decrease by up to $\n7.7\n million.\nThe Company is open to audit by the Internal Revenue Service under the statute of limitations for fiscal years 2021 through 2024. The Company’s state income tax returns are generally open to audit under the various statutes of limitations for fiscal years 2020 through 2024. Certain state tax returns are currently under audit by various tax authorities. The Company does not expect the results of these audits to have a material impact on the consolidated financial statements.\nIn December 2021, the Organization for Economic Co-operation and Development released Pillar Two Model Rules (“Pillar Two”), which provide for a global minimum tax of 15% on multinational entities. Although the United States has not yet adopted Pillar Two, several countries enacted Pillar Two with an initial effective date of January 1, 2024. The impact of Pillar Two on the Company’s effective tax rate was not material for fiscal 2024. The Company will continue to monitor future Pillar Two legislation in relevant jurisdictions for any impacts to its effective tax rate.\nNote G: \nEmployee Benefit Plans\nThe Company has a defined contribution plan that is available to certain employees. Under the plan, employee and Company contributions and accumulated plan earnings qualify for favorable tax treatment under Section 401(k) of the Internal Revenue Code. This plan permits employees to make contributions up to the maximum limits allowable under the Internal Revenue Code. The Company matches up to \n4\n% of the employee’s salary up to the plan limits. Company matching contributions to the 401(k) plan were $\n28.6\n million, $\n26.9\n million, and $\n24.8\n million in fiscal 2024, 2023, and 2022, respectively.\nThe Company also makes available to management a Nonqualified Deferred Compensation Plan which allows management to make payroll contributions on a pre-tax basis in addition to the 401(k) plan. Other long-term assets include $\n196.8\n million and $\n165.6\n million at February 1, 2025 and February 3, 2024, respectively, of long-term plan investments, at market value, set aside or designated for the Nonqualified Deferred Compensation Plan. Refer to \n51\nNote B: Fair Value Measurements for additional information. Plan investments are designated by the participants, and investment returns are not guaranteed by the Company. The Company has a corresponding liability to participants of $\n196.8\n million and $\n165.6\n million at February 1, 2025 and February 3, 2024, respectively, included in Other long-term liabilities in the Consolidated Balance Sheets.\nIn addition, the Company has certain individuals who receive or will receive post-employment medical benefits. The estimated liability for these benefits of $\n13.2\n million and $\n13.1\n million is included in Accrued expenses and other in the accompanying Consolidated Balance Sheets as of February 1, 2025 and February 3, 2024, respectively.\n \nNote H: \nShareholders’ Equity\nStock repurchase program.\n In March 2024, the Company’s Board of Directors approved a \ntwo-year\n program to repurchase up to $\n2.1\n billion of the Company’s common stock through January 31, 2026. This program followed the previous \ntwo-year\n $\n1.9\n billion stock repurchase program, effective at the end of fiscal 2023.\nThe following table summarizes the Company’s stock repurchase activity in fiscal 2024, 2023, and 2022:\nFiscal Year\nShares repurchased\n(in millions)\n Average repurchase\nprice\nAmount repurchased\n(in millions)\n2024\n7.3\n \n$\n144.46\n \n$\n1,050\n \n1\n2023\n8.2\n \n$\n115.24\n \n$\n950\n \n1\n2022\n10.3\n \n$\n92.15\n \n$\n950\n \n1\n Amount excludes excise tax due under the Inflation Reduction Act of 2022.\nTreasury stock. \nAs of February 1, 2025 and February 3, 2024, the Company held \n16.4\n million and \n15.8\n million shares of treasury stock, respectively. Shares repurchased for tax withholding are considered treasury shares which are available for reissuance. Shares purchased by the Company for tax withholding totaled \n0.6\n million, \n0.5\n million, and \n0.5\n million shares for fiscal 2024, 2023, and 2022, respectively.\nPreferred stock.\n \nThe Company has \n4.0\n million shares of preferred stock authorized, with a par value of $\n.01\n per share. \nNo\n preferred stock is issued or outstanding.\nDividends.\n \nOn March 4, 2025, the Company’s Board of Directors declared a quarterly cash dividend of $\n0.4050\n per common share, payable on March 31, 2025. The Company’s Board of Directors declared a cash dividend of $\n0.3675\n per common share in March, May, August, and November 2024. The Company’s Board of Directors declared a cash dividend of $\n0.3350\n per common share in February, May, August, and November 2023. The Company’s Board of Directors declared a cash dividend of $\n0.3100\n per common share in March, May, August, and November 2022. During fiscal 2024, 2023, and 2022, the Company paid dividends of $\n488.7\n million, $\n454.8\n million, and $\n431.3\n million, respectively.\nNote I: \nSegment Reporting\nThe Company has \none\n reportable segment. As of February 3, 2024, the Company identified \ntwo\n operating segments; Ross and dd’s DISCOUNTS. Each operating segment’s operations include only activities related to off-price retailing in stores throughout the United States and its territories. The Company determined that the \ntwo\n operating segments share similar economic and other qualitative characteristics and are therefore aggregated into one reportable segment.\nThe Company considers operating income, defined as earnings before interest and taxes, to be the measure of profit or loss for its reportable segment. The measure of segment assets is reported on the Consolidated Balance Sheets as Total assets. Segment information is prepared on the same basis that the Company’s Chief Executive Officer, who is the Chief Operating Decision Maker (CODM), manages the segments. The CODM uses operating income to monitor budget versus actual results, make key operating decisions, perform competitive analysis to the Company’s peers, and make resource allocation decisions.\n52\nThe financial information below, including the significant expense categories regularly provided to the CODM, is presented for the Company’s reportable segment for the fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023: \n($000)\n2024\n2023\n2022\nSales\n$\n21,129,219\n \n$\n20,376,941\n \n$\n18,695,829\n \nLess:\nCosts and Expenses\n1\nCost of goods sold, excluding occupancy costs\n2\n13,983,087\n \n13,612,994\n \n12,810,290\n \nOccupancy costs\n1,277,419\n \n1,188,607\n \n1,135,940\n \nStore related costs\n3\n2,859,879\n \n2,762,186\n \n2,435,313\n \nOther segment items\n4\n423,248\n \n505,491\n \n323,955\n \nSegment operating income\n2,585,586\n \n2,307,663\n \n1,990,331\n \nInterest (income) expense, net\n5\n(\n171,568\n)\n(\n164,118\n)\n2,842\n \nEarnings before taxes\n$\n2,757,154\n \n$\n2,471,781\n \n$\n1,987,489\n \n1 \nRefer to Note A: Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements for depreciation and amortization expense.\n2 \nCost of goods sold, excluding occupancy costs primarily includes merchandise related costs, distribution costs, freight costs, and buying costs.\n3 \nStore related costs primarily includes store payroll, other store operating expenses, and advertising costs.\n4 \nOther segment items included in Segment operating income primarily includes other general and administrative expenses.\n5 \nRefer to Note A: Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements for disclosure of the components of Interest (income) expense, net.\nNote J: \nLitigation, Claims, and Assessments\nLike many retailers, the Company has been named in class/representative action lawsuits, primarily in California, alleging violations by the Company of wage and hour laws. Class/representative action litigation remains pending as of February 1, 2025.\nThe Company is also party to various other legal and regulatory proceedings arising in the normal course of business. Actions filed against the Company may include commercial, product and product safety, consumer, intellectual property, environmental, and labor and employment-related claims, including lawsuits in which private plaintiffs or governmental agencies allege that the Company violated federal, state, and/or local laws. Actions against the Company are in various procedural stages. Many of these proceedings raise factual and legal issues and are subject to uncertainties.\nIn the opinion of management, the resolution of currently pending class/representative action litigation and other currently pending legal and regulatory proceedings will not have a material adverse effect on the Company’s financial condition, results of operations, or cash flows.\n53\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Ross Stores, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Ross Stores, Inc. and subsidiaries (the “Company”) as of February 1, 2025 and February 3, 2024, the related consolidated statements of earnings, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023, and the related notes (collectively referred to as the “financial statements”). We also have audited the Company’s internal control over financial reporting as of February 1, 2025, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO)\n.\n \nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of February 1, 2025 and February 3, 2024, and the results of its operations and its cash flows for each of the fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of February 1, 2025, based on criteria established \nin Internal Control - Integrated Framework\n (2013) issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying “Management’s Annual Report on Internal Control over Financial Reporting.” Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects. \nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n54\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/\nDELOITTE & TOUCHE LLP\nSan Francisco, California\nMarch 31, 2025 \nWe have served as the Company’s auditor since 1982.\n55\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of our “disclosure controls and procedures,” (as defined in Exchange Act Rule 13a-15(e)), as of the end of the period covered by this report. Our disclosure controls and procedures are designed to provide reasonable assurance of achieving their objectives. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective at that reasonable assurance level as of the end of the period covered by this report.\nIt should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework established by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) as set forth in\n \nInternal Control — Integrated Framework \n(2013). Based on our evaluation under the framework in\n \nInternal Control — Integrated Framework \n(2013), our management concluded that our internal control over financial reporting was effective as of February 1, 2025.\nOur internal control over financial reporting as of February 1, 2025 has also been audited by Deloitte & Touche LLP, an independent registered public accounting firm, and their opinion as to the effectiveness of our internal control over financial reporting is stated in their report, dated March 31, 2025, which is included in Item 8 in this Annual Report on Form 10-K.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. It should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nQuarterly Evaluation of Changes in Internal Control Over Financial Reporting\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, also conducted an evaluation of our internal control over financial reporting to determine whether any change occurred during the fourth fiscal quarter of 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Based on that evaluation, our management concluded that there was no such change during the fourth fiscal quarter.\n56\nITEM 9B. OTHER INFORMATION\nNone\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 401 of Regulation S-K is incorporated herein by reference to the section entitled “Executive Officers of the Registrant” at the end of Item I of this report; and to the section of the Ross Stores, Inc. Proxy Statement for the Annual Meeting of Stockholders to be held on Wednesday, May 21, 2025 (the “Proxy Statement”) entitled “Information Regarding Nominees and Incumbent Directors.” Information required by Item 405 of Regulation S-K is incorporated by reference to the Proxy Statement under the section titled “Delinquent Section 16(a) Reports.” Since our last Annual Report on Form 10-K, we have not made any material changes to the procedures by which our stockholders may recommend nominees to the Board of Directors. Information required by Item 407(d)(4) and (d)(5) of Regulation S-K is incorporated by reference to the Proxy Statement under the section entitled “Information Regarding Nominees and Incumbent Directors” under the caption “Audit Committee.” The information required by Item 408(b) of Regulation S-K is incorporated by reference to the section of the Proxy Statement entitled “Additional Executive Compensation Policies, Practices, and Guidelines” under the caption \n“Insider Trading Policy and Procedures and Guidelines Governing Hedging and Securities Trades by Directors, Officers, and Employees.”\nOur Board of Directors has adopted a Code of Ethics for Senior Financial Officers that applies to our Chief Executive Officer (Principal Executive Officer), Chief Financial Officer (Principal Financial Officer), and Chief Accounting Officer (Principal Accounting Officer), along with other of our senior operating and financial executives. This Code of Ethics is posted on our corporate website (www.rossstores.com) under Corporate Governance in the Investors Section. We intend to satisfy the disclosure requirements of Item 5.05 of Form 8-K regarding any future amendments to, or waivers from, our Code of Ethics for Senior Financial Officers by posting any changed version on the same corporate website.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 402 of Regulation S-K is incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation of Directors” and “Executive Compensation” under the captions “Compensation Discussion and Analysis,” “Summary Compensation Table,” “All Other Compensation,” “Discussion of Summary Compensation Table,” “CEO Pay Ratio,” “Grants of Plan-Based Awards During Fiscal Year,” “Outstanding Equity Awards at Fiscal Year-End,” “Option Exercises and Stock Vested,” “Non-Qualified Deferred Compensation,” and “Potential Payments Upon Termination or Change in Control.”\nThe information required by Items 407(e)(4) and (e)(5) of Regulation S-K are incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation Committee Interlocks and Insider Participation” and “Compensation Committee Report.”\n57\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nEquity compensation plan information. \nThe following table summarizes the equity compensation plans under which the Company’s common stock may be issued as of February 1, 2025:\nShares in (000s)\n(a)\nNumber of securities\nto be issued upon\nexercise of\noutstanding options and rights\n(b)\nWeighted-average\nexercise price per\nshare of outstanding options and rights\n(c)\nNumber of securities\nremaining available for\nfuture issuance\n(excluding securities reflected in column (a))\nEquity compensation plans\n \napproved by security holders\n495 \n— \n10,744 \n1\nEquity compensation plans not \napproved by security holders\n— \n— \n— \nTotal\n495 \n— \n10,744 \n1 \nIncludes 3.4 million shares reserved for issuance under the Employee Stock Purchase Plan and 7.3 million shares reserved for issuance under the 2017 Equity Incentive Plan.\nThe information required by Item 403 of Regulation S-K is incorporated herein by reference to the section of the Proxy Statement entitled “Stock Ownership of Certain Beneficial Owners and Management.”\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 404 of Regulation S-K is incorporated herein by reference to the section of the Proxy Statement entitled “Related Person Transactions.” The information required by Item 407(a) of Regulation S-K is incorporated herein by reference to the section of the Proxy Statement entitled “Information Regarding Nominees and Incumbent Directors” including the captions “Audit Committee,” “Compensation Committee,” and “Nominating and Corporate Governance Committee.”\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation concerning principal accountant fees and services, and the pre-approval of those services by the Audit Committee, will appear in the Proxy Statement under the caption “Summary of Audit, Audit-Related, Tax, and All Other Fees.” Such information is incorporated herein by reference.\n58\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following consolidated financial statements, schedules, and exhibits are filed as part of this report or are incorporated herein as indicated:\n1.\n      List of Consolidated Financial Statements.\nThe following consolidated financial statements are included herein under Item 8:\nConsolidated Statements of Earnings for the years ended February 1, 2025, February 3, 2024, and January 28, 2023.\nConsolidated Statements of Comprehensive Income for the years ended February 1, 2025, February 3, 2024, and January 28, 2023.\nConsolidated Balance Sheets at February 1, 2025 and February 3, 2024.\nConsolidated Statements of Stockholders’ Equity for the years ended February 1, 2025, February 3, 2024, and January 28, 2023.\nConsolidated Statements of Cash Flows for the years ended February 1, 2025, February 3, 2024, and January 28, 2023.\nNotes to Consolidated Financial Statements.\nReport of Independent Registered Public Accounting Firm (PCAOB ID: \n34\n).\n2.    List of Consolidated Financial Statement Schedules.\nSchedules are omitted because they are not required, not applicable, or such information is included in the consolidated financial statements or notes thereto which are included in this Report.\n3.    List of Exhibits (in accordance with Item 601 of Regulation S-K).\nIncorporated herein by reference to the list of Exhibits contained in the Exhibit Index within this Report.\n59\nSIGNATURES\nPursuant to the requirements of Section 13 or 15 (d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nROSS STORES, INC.\n (Registrant)\n \nBy: \n/s/James G. Conroy\nDate:\nMarch 31, 2025\n \nJames G. Conroy\nChief Executive Officer\n60\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/James G. Conroy\nChief Executive Officer, Director\nMarch 31, 2025\nJames G. Conroy\n(Principal Executive Officer)\n/s/Adam Orvos\nExecutive Vice President and Chief Financial Officer\nMarch 31, 2025\nAdam Orvos\n(Principal Financial Officer)\n/s/Jeffrey P. Burrill\nSenior Vice President, Chief Accounting Officer and\nMarch 31, 2025\nJeffrey P. Burrill\nCorporate Controller (Principal Accounting Officer)\n/s/Michael Balmuth\nExecutive Chairman, Director\nMarch 31, 2025\nMichael Balmuth\n/s/K. Gunnar Bjorklund\nDirector\nMarch 31, 2025\nK. Gunnar Bjorklund\n/s/Michael J. Bush\nDirector\nMarch 31, 2025\nMichael J. Bush\n/s/Edward G. Cannizzaro\nDirector\nMarch 31, 2025\nEdward G. Cannizzaro\n/s/Sharon D. Garrett\nDirector\nMarch 31, 2025\nSharon D. Garrett\n \n/s/Michael J. Hartshorn\nGroup President and Chief Operating Officer, Director\nMarch 31, 2025\nMichael J. Hartshorn\n/s/Stephen D. Milligan\nDirector\nMarch 31, 2025\nStephen D. Milligan\n/s/Patricia H. Mueller\nDirector\nMarch 31, 2025\nPatricia H. Mueller\n/s/George P. Orban\nDirector\nMarch 31, 2025\nGeorge P. Orban\n \n/s/Doniel N. Sutton\nDirector\nMarch 31, 2025\nDoniel N. Sutton\n61\nINDEX TO EXHIBITS\nExhibit\nNumber\nExhibit\n3.1\nCertificate of Incorporation of Ross Stores, Inc. as amended (Corrected First Restated Certificate of Incorporation, dated March 17, 1999, together with amendments thereto through Amendment of Certificate of Incorporation dated May 29, 2015) incorporated by reference to Exhibit 3.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended August 1, 2015.\n3.2\nAmended and Restated Bylaws of Ross Stores, Inc. (as amended March 8, 2023) incorporated by reference to Exhibit 3.2 to the Form 8-K filed by Ross Stores, Inc. on March 14, 2023.\n4.1\nDescription of Common Stock of Ross Stores, Inc., \nincorporated by reference to Exhibit 4.5 to the Form 10-K filed by Ross Stores, Inc. for its year ended February 1, 2020.\n4.2\nIndenture, dated as of September 18, 2014, between Ross Stores, Inc. and U.S. Bank National Association, incorporated by reference to Exhibit 4.1 to the Form 8-K filed by Ross Stores on September 18, 2014.\n4.3\nOfficers’ Certificate, dated as of April 6, 2020, establishing the aggregate amounts, terms and form of the Notes, incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on April 7, 2020.\n4.4\nForm of 4.600% Senior Notes Due 2025, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on April 7, 2020.\n4.5\nForm of 4.700% Senior Notes Due 2027, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on April 7, 2020\n.\n4.6\nForm of 4.800% Senior Notes Due 2030, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on April 7, 2020.\n4.7\nForm of 5.450% Senior Notes Due 2050, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on April 7, 2020.\n4.8\nOfficers’ Certificate, dated as of October 21, 2020 establishing the aggregate amounts, terms and forms of the Notes., incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on October 22, 2020.\n4.9\nForm of the 0.875% Senior Notes Due 2026, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on October 22, 2020.\n4.10\nForm of the 1.875% Senior Notes Due 2031, included in and incorporated by reference to Exhibit 4.2 to the Form 8-K filed by Ross Stores, Inc. on October 22, 2020.\n10.1\nCredit Agreement dated February 17, 2022, among Ross Stores, Inc., various lenders and Bank of America, N.A., as Administrative Agent, incorporated by reference to Exhibit 4.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 30, 2022.\nMANAGEMENT CONTRACTS AND COMPENSATORY PLANS (EXHIBITS 10.2 - 10.35) \n10.2\nForm of Indemnity Agreement for Directors and Executive Officers, incorporated by reference to Exhibit 10.26 to the Form 10-K filed by Ross Stores, Inc. for its fiscal year ended February 2, 2013.\n62\n10.3\nThird Amended and Restated Ross Stores, Inc. Non-Qualified Deferred Compensation Plan effective December 31, 2008 (as amended effective January 1, 2015 and October 1, 2017), incorporated by reference to Exhibit 10.3 filed by Ross Stores, Inc. for its fiscal year ended February 3, 2018.\n10.4\nSecond Amended and Restated Ross Stores, Inc. Incentive Compensation Plan, \nincorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 31, 2020.\n10.5\nRoss Stores, Inc. 2017 Equity Incentive Plan, incorporated by reference to Exhibit 99 to the Registration Statement on Form S-8 filed by Ross Stores, Inc. on May 17, 2017 (Registration No. 333-218052).\n10.6\nAmended Ross Stores, Inc. 2017 Equity Incentive Plan, \nincorporated by reference to Exhibit 10.3 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 31, 2020.\n10.7\nForm of Restricted Stock Agreement, incorporated by reference to Exhibit 10.4 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended July 29, 2017.\n10.8\nForm of Restricted Stock Agreement, incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 5, 2018.\n10.9\nForm of Restricted Stock Agreement for Nonemployee Director, incorporated by reference to Exhibit 10.5 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended July 29, 2017.\n10.10\nForm of Performance Shares Grant Agreement, incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 5, 2018.\n10.11\nRoss Stores, Inc. Notice of Grant of Performance Shares, incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended July 31, 2021.\n10.12\nForm of Notice of Grant of Restricted Stock Units and Form of Restricted Stock Units Agreement (For Non-employee Directors) pursuant to the Ross Stores, Inc. 2017 Equity Incentive Plan, incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended August 3, 2024.\n10.13\nForm of Executive Employment Agreement for Executive Officers (CA), incorporated by reference to Exhibit 10.4 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 2, 2020.\n10.14\nForm of Executive Employment Agreement for Executive Officers (NON-CA), incorporated by reference to Exhibit 10.5 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 2, 2020.\n10.15\nForm of Executive Employment Agreement for Executive Officers (CA), incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 1, 2021.\n10.16\nForm of Executive Employment Agreement for Executive Officers (NON-CA), incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 1, 2021.\n10.17\nForm of Executive Employment Agreement for Executive Officers (CA), incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 30, 2022.\n10.18\nForm of Executive Employment Agreement for Executive Officers (NON-CA), incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 30, 2022.\n10.19\nForm of Executive Employment Agreement for Executive Officers (CA), incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 29, 2023.\n63\n10.20\nForm of Executive Employment Agreement for Executive Officers (NON-CA), incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 29, 2023.\n10.21\nForm of Executive Employment Agreement for Executive Officers (CA), incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 5, 2024.\n10.22\nForm of Executive Employment Agreement for Executive Officers (NON-CA), incorporated by reference to Exhibit 10.2 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended May 5, 2024.\n10.23\nEmployment Agreement effective June 1, 2012 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 27, 2012.\n10.24\nSecond Amendment to Employment Agreement effective January 1, 2016 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.49 to the Form 10-K filed by Ross Stores, Inc. for its fiscal year ended January 30, 2016.\n10.25\nFourth Amendment to the Employment Agreement effective April 15, 2017 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.4 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 29, 2017.\n10.26\nFifth Amendment to the Employment Agreement effective July 3, 2018 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.1 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended August 4, 2018.\n10.27\nEighth Amendment to the Employment Agreement effective September 24, 2020 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.5 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 31, 2020.\n10.28\nNinth Amendment to Employment Agreement effective May 2, 2022 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.6 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 28, 2023.\n10.29\nTenth Amendment to Employment Agreement effective August 29, 2023 between Michael Balmuth and Ross Stores, Inc., incorporated by reference to Exhibit 10.7 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended October 28, 2023.\n10.30\nEmployment Agreement effective March 16, 2023 between Michael Hartshorn and Ross Stores, Inc., incorporated by reference to Exhibit 10.4 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 29, 2023.\n10.31\nEmployment Agreement effective March 16, 2023 between Adam Orvos and Ross Stores, Inc., incorporated by reference to Exhibit 10.3 to the Form 10-Q filed by Ross Stores, Inc. for its quarter ended April 29, 2023.\n10.32\nEmployment Agreement effective October 21, 2024 between James G. Conroy and Ross Stores, Inc.\n10.33\nFirst Amendment to Employment Agreement effective February 27, 2025 between James G. Conroy and Ross Stores, Inc.\n10.34\nRepayment Agreement effective October 21, 2024 between James G. Conroy and Ross Stores, Inc.\n10.35\nRoss Stores, Inc. Notice of Grant of Restricted Stock Units to James G. Conroy.\n64\n19\nRoss Stores, Inc. Insider Trading Policy (December 2024).\n21\nSubsidiaries\n.\n23\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of Chief Executive Officer Pursuant to Sarbanes-Oxley Act Section 302(a).\n31.2\nCertification of Chief Financial Officer Pursuant to Sarbanes-Oxley Act Section 302(a).\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350.\n32.2\nCertification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350.\n97.1\nRoss Stores, Inc. Policy for Recovery of Erroneously Awarded Incentive Compensation, adopted November 5, 2023 incorporated by reference to Exhibit 97.1 to the Form 10-K filed by Ross Stores, Inc. for its fiscal year ended February 3, 2024.\n101.INS\nXBRL Instance Document. (The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.)\n101.SCH\nInline XBRL Taxonomy Extension Schema\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase\n104\nCover Page Interactive Data File. (The cover page interactive data file does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.)\n65"
  }
}