{
  "ticker": "RSG",
  "cik": "0001060391",
  "company_name": "REPUBLIC SERVICES, INC.",
  "filing_date": "2025-02-14",
  "accession": "0001060391-25-000091",
  "primary_doc": "rsg-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\nBUSINESS\nOverview\nRepublic is one of the largest providers of environmental services in the United States, as measured by revenue. We operate across the United States and Canada through 367 collection operations, 248 transfer stations, 75 recycling centers, 208 active landfills, 2 treatment, recovery and disposal facilities, 23 treatment, storage and disposal facilities (TSDF), 5 salt water disposal wells, 14 deep injection wells, and 1 polymer center. We are engaged in 79 landfill gas-to-energy and other renewable energy projects and had post-closure responsibility for 125 closed landfills. \nWe believe the total addressable North American environmental services market in which we operate generates approximately $165 billion of annual revenue, which includes the $105 billion United States and Canada recycling and waste industry, $35 billion of the broader environmental solutions industry, and $25 billion in sustainability innovation (described below) and emerging waste and recycling technologies. Within our recycling and waste business, we prioritize investments in market verticals with above average growth rates and higher return profiles. Environmental solutions remains fragmented, which provides consolidation opportunities to drive scale. We believe customer demand for products and services that respond to evolving environmental trends, including decarbonization and circularity, should support above average growth rates and attractive returns in our sustainability innovation businesses. We believe we can further expand our addressable market into other segments of the environmental services industry over time by leveraging our differentiated capabilities, including (1) customer zeal, (2) digital and (3) sustainability.\nWe operate throughout North America, but the physical collection and recycling or disposal of material is very much a local business, and the dynamics and opportunities differ in each of the markets we serve. By combining local operating management with standardized business practices, we drive greater overall operating efficiency across the Company while maintaining day-to-day operating decisions at the local level, closest to the customer.\nOur purpose-driven vision is to partner with customers to create a more sustainable world. We believe that our products and services are valuable to our customers and essential for long-term sustainability. \nWe further believe our focus on and commitment to sustainability allows us to attract and retain the best talent, win more customers, increase customer loyalty and, ultimately, drive higher revenue and profits. \nFoundational Elements\nOur strategy is designed to generate profitable growth by sustainably managing our customers’ needs, and it is underpinned by three foundational elements – (1) our market position, (2) our operating model and (3) our people and talent agenda.\nMarket Position\nOur goal is to develop the best vertically integrated market position to enable us to build density and improve returns. We strive to have a leading market position in each of the markets we serve, or have a clear path toward how we will achieve a leading market position over time. In situations where we cannot establish a leading market position, or where operations are not generating acceptable returns, we may decide to divest certain assets and reallocate resources to other markets. \nWe have a robust market planning process to identify opportunities to grow internally through capital investments and infrastructure development and externally through acquisitions and public-private partnerships. Additionally, our market planning process allows us to analyze market conditions and proactively adjust to trends as they emerge, including the effects of legislation, demographic shifts and changes in the market and the competitive landscape. \nInternal Growth\n•\nVolume Growth\n - \nWe believe volumes are driven by population growth, household formation and new business formation. Volume growth through increases in our customer base and service offerings is the most capital efficient method to grow our business. We seek to obtain long-term contracts for collecting recyclable, solid waste and industrial waste material under residential collection contracts with municipalities, exclusive franchise agreements, small-container and large-container contracts and environmental solutions service contracts. We also look to enter into long-term disposal and recycling contracts with municipalities and other third parties. By obtaining such long-term agreements, we can grow our contracted revenue base at a rate consistent with the underlying economic growth in \n2\nTable of Contents\nthese markets. In addition, by securing long-term agreements, we are better able to help ensure we earn an appropriate return on the capital deployed.\n•\nPrice Increases\n - \nWe seek to secure price increases necessary to offset increased costs, improve our operating margins and earn an appropriate return on our substantial investments in vehicles, equipment, recycling centers, transfer stations, TSDFs, deep well injection facilities, landfills, and other post-collection infrastructure. \n•\nExpansion of Recycling Capabilities\n \n-\n \nBased on the most recent United States Environmental Protection Agency (EPA) data, approximately 32% of municipal solid waste is recycled and/or composted. We expect that percentage to increase over the long-term as communities enhance and expand their recycling programs for their residents. As a key player in the circular economy, we are strategically focused on expanding recycling volume through innovative material handling processes and programs to help our customers achieve their goals related to sustainability and environmentally sound waste practices while also generating an appropriate return. In 2024, we commenced operation at our first Polymer Center in Las Vegas, Nevada, and completed construction at our Polymer Center in Indianapolis, Indiana. Our Polymer Centers are part of a vertical integration that will advance circularity for plastics and help us manage the plastics stream from curbside collection to delivery of recycled content for consumer packaging. Our Polymer Centers will enable us to produce food-grade drop-in substitutes for virgin plastics, while allowing us to expand recycling of plastics across North America. In 2023, we announced the development of Blue Polymers, a joint-venture with Ravago JV Holdings, LLC, creating vertical integration that will further advance circularity by acquiring all olefins produced by the Polymer Centers to further process and manufacture custom blended pellets for food-grade and non-food-grade packaging. Blue Polymers production facilities are currently being constructed in Indianapolis, Indiana, and Buckeye, Arizona. We will continue to look for opportunities to expand or enhance our recycling capabilities in markets where customers are demanding these services, demonstrating a willingness to pay and where we can earn an appropriate return on our investment. \n•\nInfrastructure Development - We seek to identify opportunities to further our position as a vertically integrated service provider in markets where we are not fully integrated. Our goal is to create market-specific, vertically integrated operations typically consisting of one or more collection operations, recycling centers, transfer stations, TSDFs, deep well injection facilities, and landfills. Where appropriate, we seek to obtain permits to build recycling centers, transfer stations, TSDFs, deep well injection facilities, and landfills that would vertically integrate our waste services or expand the service areas for our existing disposal sites. Additionally, we seek opportunities to expand and permit new airspace at our existing landfills in order to replace airspace consumed. Development projects, while generally less capital intensive than acquisitions, typically require extensive permitting efforts that can take years to complete with no assurance of success. We undertake development projects when we believe there is a reasonable probability of success and where reasonably priced acquisition opportunities are not available. Through landfill and fleet innovation, recycling and circularity of key materials and renewable energy production, we are committed to continuous development of environmentally responsible operations that increase our efficiency as well as our ability to partner with customers to create a more sustainable world.\nExternal Growth - Acquisitions and Public-Private Partnerships\n•\nOur acquisition growth strategy focuses primarily on acquiring privately held environmental services businesses that complement our existing business platform. We believe our ability to successfully complete these acquisitions is enhanced by the challenges facing many privately-held companies, including increasing competition in the environmental services industry, increasing capital requirements due to changes in regulatory requirements and technology and the limited number of exit strategies for privately-held companies. We also evaluate stand-alone opportunities to acquire businesses and/or facilities that are being divested by other publicly-owned companies. \nWe continue to invest in value-enhancing acquisitions in existing markets. Given our free cash flow, availability under our credit facilities and our ability to access the public capital markets, we have the financial flexibility to make additional acquisitions that will complement our existing business platform, including larger acquisitions if the right opportunities present themselves. \nWe also focus on growth through public-private partnerships, which include the recycling and waste operations and facilities of municipal and other local governments. We believe over time we have an opportunity to acquire operations and facilities from municipalities and other local governments as they seek to raise capital and/or reduce risk.\nWe realize synergies from consolidating businesses into our existing operations, whether through acquisitions or public-private partnerships, which allows us to reduce capital expenditures and expenses associated with truck routing, personnel, fleet maintenance, inventories and back-office administration.\n3\nTable of Contents\nOperating Model\nOur operating model allows us to deliver a consistent, high-quality service to all our customers through the Republic Way: \nOne Way. Everywhere. Every Day\n. This approach of developing standardized processes with rigorous controls and tracking allows us to leverage our scale and deliver durable operational excellence. The Republic Way is the key to harnessing the best of what we do as operators and translating that across all facets of our business. Key elements of our operating model are our organizational structure, safety, fleet automation, fleet electrification and standardized maintenance.\nOrganizational Structure\nA key enabler of the Republic Way operating model is our organizational structure that fosters a high performance culture by maintaining 360-degree accountability and full profit and loss responsibility with local management, supported by a functional structure to provide subject matter expertise. This structure allows us to take advantage of our scale by coordinating functionally across all of our markets, while empowering local management to respond to unique market dynamics.\nThrough this operating model, we have rolled out several productivity and cost control initiatives designed to deliver the best service possible to our customers in an efficient and environmentally sound way.\nOur senior management evaluates, oversees and manages the financial performance of our operations through three field groups, referred to as Group 1, Group 2 and Group 3. Group 1 is our recycling and waste business operating primarily in geographic areas located in the western United States. Group 2 is our recycling and waste business operating primarily in geographic areas located in the southeastern and mid-western United States, the eastern seaboard of the United States and Canada. Group 3 is our environmental solutions business operating in geographic areas located across the United States and Canada. These groups each provide integrated environmental services, including but not limited to collection, transfer, recycling and disposal.\nSafety\n \nRepublic is dedicated to the safety of our employees, customers and the communities we serve. We have a dedicated team of safety professionals at our corporate headquarters and in our field operations, led by our Vice President of Environmental Health and Safety who reports directly to our Chief Operating Officer. Due to the nature of our industry, we make safety a top priority and we recognize and reward employees for outstanding safety records. Over the past 10 years, our safety performance (based on OSHA recordable rates) has been 24% better than the industry average. Our \nThink, Choose, Live\n slogan encapsulates our everyday safety messaging to our employees to: \nThink\n about what you are doing, \nChoose\n the safe answer and \nLive\n to go home to your family. With the phrase printed on numerous items, including hard hats and the equipment our employees use, there are constant reminders for employees to go home in the same condition in which they came to work. Our goal is to ensure every one of our employees returns home safely each night.\nThrough our Safety Amplified program, we are providing more tools and driving greater awareness to help our teams better execute our safety standards. Regular training, multifaceted programs and strategic partnerships are key components to this program. It is simple by design and comprised of actions and activities that ensure safety is embedded in all we do. The program includes six initiatives to help us achieve our goal to have zero employee fatalities and reduce our OSHA Total Recordable Incident Rate.\n•\nFocus Together: This effort is the very core of our safety program and is designed to help frontline employees eliminate the six most common types of serious incidents.\n•\nLead Together: We provide best-in-class communication channels and advanced training techniques for all frontline supervisors and managers to help them guide their teams.\n•\nPartner Together: Staying safe requires involvement by employees at all levels. We’ve increased leadership visits with frontline employees and supervisors to support each divisions’ safety goals.\n•\nCelebrate Together: We take pride in recognizing employees who demonstrate a relentless commitment to safety. Employees with the best driving records are eligible for the industry’s most prestigious award, the National Waste & Recycling Association’s Driver of the Year. Republic drivers have won 69% of the Driver of the Year awards issued for the large truck category since 2009. In addition, our best drivers are recognized and rewarded with competing in our National Road-EO competition.\n•\nAnalyze Together: We analyze real-time data to make short- and long-term decisions and identify opportunities for improvement. Examples include analysis of roadway awareness training, data mapping and other employee protection and preparedness insights. \n•\nInnovate Together: We employ the latest technologies in our fleet, including automation, rear cameras, in-cab backup alarms and event recording systems, and we take a data-driven approach to support our employees. We also work with \n4\nTable of Contents\nequipment manufacturers to incorporate safety elements such as seat belt alarms, blind spot awareness, lane departure alarms and other potentially lifesaving equipment in our fleet.\nWe believe our Safety Amplified program provides additional benefits for our Company and stakeholders including:\n•\nfurther strengthening relationships within the communities we service;\n•\nenhancing customer trust;\n•\nstreamlining operational processes and increasing productivity;\n•\ndelivering a reputational advantage, including positioning our Company as an employer-of-choice;\n•\nbuilding and sustaining a safety culture in all areas of our business; and\n•\ncontributing to employee engagement.\nFor more information regarding our safety performance, refer to our Sustainability Accounting Standards Board (SASB) report, which can be found at republicservices.com/sustainability. The information contained on our website shall not be deemed incorporated by reference in this Annual Report on Form 10-K or in any other filing we make under the Securities Exchange Act of 1934, as amended (Exchange Act).\nFleet Automation\nApproximately 77% of our residential routes have been converted to automated single-driver trucks. By converting our residential routes to automated service, we reduce labor costs, improve driver productivity, decrease emissions and create a safer work environment for our employees. Additionally, communities using automated vehicles generally have higher participation rates in recycling programs, thereby complementing our initiative to expand our recycling capabilities.\nFleet Electrification\nWe believe we are taking a leadership position in electric technology innovation for our recycling and waste collection fleet. This is a critical step toward reducing our environmental impact through lower fleet emissions. We believe it will also improve our total cost of ownership while providing a competitive advantage in certain communities. We are partnering with multiple manufacturers to pilot electric-powered recycling and waste trucks. As electric vehicle technology continues to develop, we expect to further deploy electrification to our fleet. As of December 31, 2024, we operated 52 electric collection vehicles and had 22 commercial scale electric charging facilities.\nStandardized Maintenance\nBased on an industry trade publication, we operate the third largest vocational fleet in the United States. As of December 31, 2024, our average fleet age for recycling and waste collection vehicles in years, by line of business, was as follows:\nApproximate Number of Vehicles\nApproximate Average Age\nResidential\n7,300 \n7.7\nSmall-container\n5,500 \n7.2\nLarge-container\n4,800 \n9.0\nTotal\n17,600 \n7.9\nOneFleet, our standardized vehicle maintenance program, enables us to use best practices for fleet management, truck care and maintenance. Through standardization of core functions, we believe we can minimize variability in our maintenance processes, resulting in higher vehicle quality and a lower environmental footprint while extending the average service life of our fleet. Additionally, our focus on preventative maintenance is improving the reliability of our fleet and enabling us to provide superior service to our customers, differentiating us from our competition.\nPeople and Talent Agenda\nBeing human-centered is at the core of our robust people and talent agenda. We strive to maintain an environment that attracts and retains the best talent. Our approximately 42,000 full-time employees are a critical component in successfully executing our strategy and running our operations. We work hard to remain a company where the best people, with exceptional talents and diverse backgrounds, can thrive and foster a culture of caring where people feel respected, supported and encouraged to bring their best selves to work every day.\nWe are dedicated to driving our people and talent agenda, which includes (1) representing the diversity of the communities we serve and sustaining a safe and inclusive culture, (2) maintaining a highly engaged workforce, (3) developing our talent through learning and development experiences and (4) offering rewards that attract and retain the best workforce. We review key \n5\nTable of Contents\nprogress metrics such as engagement and turnover and regularly report on these metrics to our Board of Directors. This level of reporting holds all of our leaders accountable for the continued growth and development of our people.\nInclusion and Diversity\nWe believe the composite strength of our employees’ ideas, built on their unique experiences and backgrounds, is essential to our ability to meet and anticipate our customers’ needs.\n \nWe are proud of the diversity of our frontline workforce, as it closely represents the demographics of the communities we serve. We continue to improve representation of diverse groups across all levels of the Company. Our commitment to inclusion and diversity starts at the top of our organization, as outlined in our Mission of Supporting an Inclusive Culture (MOSAIC), established in 2013 and supported by the MOSAIC Council. The MOSAIC Council consists of leaders from across the Company who serve as ambassadors and thought partners for inclusion and diversity. This enables us to continue to develop new strategies and activities that are tied to the needs of our employees, customers and business with the goal of creating an even more inclusive work environment and diverse workforce.\nWe support inclusion and connectivity for our diverse populations through our Business Resource Groups (BRG) and focus on the involvement of our field locations in all of our BRGs, including Women of Republic, VALOR (Veterans, Advocacy, Learning, Outreach and Recruiting), UNIDOS, the Black Employee Network and PRISM in support of the LGBTQ+ community. In May 2024, we launched a new BRG called AAPI in support of the Asian American and Pacific Islander community. \nEmployee Engagement \nWe believe an engaged workforce is a key element of our success as engaged employees deliver better customer service and are more productive. We measure employee engagement through a third-party survey, assessing employee sentiment on a variety of topics such as pride for the Company, job satisfaction and intention to stay. Our data reinforces that business units with a highly engaged workforce experience less turnover. We also found that employees whose leaders are highly inclusive are more likely to speak up and share their perspective. Regularly hearing from our employees allows us to understand how to support and strengthen an exceptional employee experience. Our goal is to achieve and maintain employee engagement scores at or above 88 by 2030. Our employee engagement score was 86 in 2024, which is above a national benchmark by seven points. Approximately 99% of our employees participated in the engagement survey process in March and September 2024, which represented an all-time high participation rate and is 24% higher than the national benchmark. Employee engagement is a core part of our business strategy, which is why we compensate our General Managers, in part, on their employee engagement scores. This reinforces our commitment for leaders to listen and take action on employee feedback and helps to ensure that our leaders are held accountable and rewarded for their efforts to drive a more engaged workforce.\nTalent Development\nWe are committed to providing our employees with opportunities to develop throughout their careers. Our programs, including new hire onboarding and new leader assimilation, reinforce our Company values, expectations and business approach. We relaunched our successful Leadership Fundamentals program in 2022, targeting field leaders. With a goal of reaching all leaders through this program, approximately 1,226 leaders completed this training in 2024, with approximately 1,600 more slated to participate in 2025. Targeted development experiences support the growth of people in key roles, including Driver Training, Technician Training, Supervisor Training, Sales Acceleration and General Manager Onboarding, among others. We believe these programs provide the fundamental skills necessary to be successful across roles. Additionally, to meet the specific needs of the business, we opened a comprehensive Technical Training Institute in April 2021 where we train and develop our technicians. We have had 267 participants in the course since its inception.\nOur leadership programs are a critical part of growing our people. We remain focused on attracting, hiring and developing early career leaders. Our rotational training and development programs, including our General Manager Acceleration Program (GMAP) and Operations Manager Acceleration Program, help us attract, develop and advance a diverse and talented pool of individuals from across our organization. Our Executive Leadership team sponsors these programs, providing visibility and support for the career advancement of our high-potential talent across the organization. Since the beginning of these programs in 2017, 109 leaders have graduated into leadership positions. Additionally, our MBA intern program, with 51 participants since 2019, introduces strong talent to the organization and is a path of opportunity into the GMAP program. We have found that these programs and experiences help ensure that the next generation of leaders build the necessary skills and experiences to be successful in their roles today and in the future.\nWe continue to leverage innovative training methods using mixed mediums to deliver trainings and instruction to our employees across the country. We remain committed to expanding employee participation in learning programs that are relevant to our business strategy and contribute to career advancement for our employees.\n6\nTable of Contents\nCompensation and Benefits\nWe offer compensation and benefits that help improve our employees' overall financial, physical and emotional wellbeing, as well as recognize hard work with opportunities to grow. Our commitment to paying market competitive wages enables us to attract and hire talent all across the country, including an expansion of many opportunities to work remotely. Our approach to paying for performance supports our focus on pay equity. Our compensation packages are designed to provide employees with a stable and livable wage and growth potential. Our focus on wellness also provides our employees with a competitive paid time off plan, access to preventative care, advice on financial planning and support for mental health, contributing to our efforts to provide a total rewards package that improves and enhances the lives of our employees.\nDifferentiating Capabilities\nTo effectively execute our strategic plan, we prioritize the development and investment in capabilities that will differentiate us in the marketplace. These capabilities include – (1) customer zeal, (2) digital and (3) sustainability.\nCustomer Zeal\nThe goal of customer zeal is to drive customer loyalty by offering differentiated products and services specifically designed to meet our customers’ needs. We offer a broad set of environmental services across the United States and Canada as the sole provider, which we believe sets us apart in the industry. Customers appreciate our track record of safe and environmentally compliant operations, with the expertise to manage complex waste streams. We believe our value proposition increases customer loyalty and willingness to pay for our differentiated offerings. Customer zeal is a cultural commitment to enable and empower our employees to own their role in the customer experience.\nTo help our sales team identify specific customer needs and configure the right offering, we use a Priority Based Selling (PBS) technique and our Capture pricing tool nationwide.\n•\nPBS enables us to identify and segment customers’ buying priorities and attract customers that are willing to pay for enhanced offerings.\n•\nCapture is a cloud-based pricing tool that creates a more professional sales experience, helps realize better pricing levels at the point of sale and provides enhanced controls over the price quoting process.\nWe continue to expand our offering of products and services to meet customer demand for a single provider for their environmental service needs. We have made progress on this front, including through the expansion of our environmental solutions segment supported by the acquisition of US Ecology, along with subsequent acquisitions. Our acquisitions of leading environmental solutions providers enable us to offer a complete set of products and services, including treatment, recycling and disposal of hazardous, non-hazardous and specialty waste. For services that we do not provide, we fulfill demand through our alliance partnerships while maintaining the customer facing relationship.\nTo help ensure a consistent customer experience, we have invested in our customer service capabilities and our centralized Customer Experience function. This modern technology provides our customer services employees with the tools and capabilities they need to provide better levels of service through a variety of communication channels. The standardized approach enhances the customer experience and provides us a platform to reduce the cost to service our customers.\nTo help ensure our efforts are making an impact and building customer loyalty, we solicit feedback from our customers, including Net Promoter Score℠, so that every General Manager receives recent, relevant feedback that allows him or her the ability to reach out to customers directly and address issues immediately.\nDigital\nThe goal of prioritizing our digital capabilities is to allow us to provide a consistent experience across our business. We believe investments in our digital platforms support improved processes for our employees that lead to enhanced employee engagement and enable our customers to do business with us through more channels and with better access to information, ultimately driving increased customer loyalty. \nBy increasing the ease of use and functionality of our web-based market presence, we believe we enhance customer satisfaction, interaction and connectivity while lowering our costs. These tools reinforce to our customers that they can rely on us to handle their recycling and waste service needs in a way that is easy and convenient for them.\n•\nOur website and mobile app are online account management tools, allowing customers access to their accounts and our services.\n•\nOur e-commerce sales channel allows customers to secure services on a real-time basis, provides capabilities to meet our customers' evolving buying preferences and provides a lower cost sales channel.\n7\nTable of Contents\nWe are leveraging technology to digitally connect our customers, drivers, logistics analysts, supervisors and trucks via our \"RISE\" dispatch platform and in-cab technology. With the roll-out of this technology we have improved productivity through more real-time routing information and data visualization tools, increasing customer connectivity and enabling automated service verification communications and enhancing the employee experience by providing better tools and technology designed around employee interaction.\nWe have installed advanced technology on recycling and waste collection vehicles that utilizes cameras to identify recycling contamination and overfilled containers. We expect this technology will reduce recycling contamination over time and drive incremental revenue.\nWe are in the early stages of deploying our “MPower” enterprise asset management system to digitally connect our maintenance team to our collection fleet of vehicles. This technology is designed to streamline our fleet maintenance record keeping and parts management processes and allow improved technician efficiency and enhanced warranty recovery across our fleet. We expect the deployment of this technology to be complete in late 2025.\nSustainability\nThe goal of our differentiating sustainability capabilities is to provide our customers with fully integrated sustainable solutions that support a cleaner, safer and healthier world. We have long been a leader in environmental services and sustainability. We introduced our Elements of Sustainability, the foundation of our sustainability platform, in 2014. Our elements, Safety, Talent, Climate Leadership and Communities, are deeply integrated into our business and anchor our ambitious 2030 sustainability goals.\nOur Board of Directors’ Sustainability & Corporate Responsibility Committee has oversight responsibility with respect to our sustainability performance, our corporate responsibilities and our role as a socially responsible organization. The Committee meets at least quarterly to be updated on progress and conducts a formal comprehensive review of the Company’s performance in these areas on an annual basis.\nOur 2030 Sustainability Goals\nAs we grow, so does our opportunity to make a meaningful, positive impact on the environment and society. Our ambitious 2030 goals are aligned with the UN Sustainable Development Goals\n(1) \nand our greenhouse gas reduction goal is aligned with The Paris Agreement. Each goal is aligned with one of the Company's elements of sustainability. Together they are designed to significantly benefit the environment and society, while enhancing the foundation and profitability of our business for the long-term.\n•\nSafety Amplified: \nAchieve zero annual employee fatalities\n•\nIncident Reduction: \nReduce OSHA Total Recordable Incident Rate (TRIR) to 2.0 or less by 2030\n•\nEngaged Workforce:\n \nAchieve and maintain employee engagement scores at or above 88 by 2030\n•\nScience Based Target:\n Reduce absolute Scope 1 and 2 greenhouse gas emissions 35% by 2030\n(2)\n, approved by SBTi\n(3)\n, with an interim goal of achieving a 10% reduction by 2025\n(4)\n•\nCircular Economy:\n Increase recovery of key materials by 40% on a combined basis by 2030\n(2)\n•\nRenewable Energy:\n Increase beneficial reuse of biogas by 50% by 2030\n(2)\n•\nCharitable Giving:\n Create sustainable neighborhoods through strong community partnerships for 45 million people by 2030\n(2)\nWe believe that reducing our impact on the planet and improving the quality of life for its inhabitants are the right things to do, and they are also necessary actions to ensure a vibrant future for our organization.\nRefer to our Sustainability Report for our progress toward our 2030 sustainability goals, and refer to our full suite of climate-related sustainability reporting for updates regarding our progress toward our climate goals, including the Task Force on Climate-Related Financial Disclosures (TCFD), SASB, Global Reporting Initiative and CDP Climate Change, all of which can be found at republicservices.com/sustainability/reporting. The information contained on our website shall not be deemed incorporated by reference in this Annual Report on Form 10-K or in any other filing we make under the Exchange Act.\n(1) We have aligned our 2030 goals with the following UN Sustainable Development Goals: (3) Good Health and Well-being, (4) Quality Education, (7) Affordable Clean Energy, (8) Decent Work and Economic Growth, (9) Industry, Innovation and Infrastructure, (10) Reduced Inequalities, (11) Sustainable Cities and Communities, (12) Responsible Consumption and Production, (13) Climate Action and (14) Peace, Justice and Strong Institutions.\n(2) Targets are relative to the 2017 baseline year.\n(3) SBTi, or Science Based Targets initiative, is a collaboration between CDP, the United Nations Global Compact, World Resources Institute and the World Wide Fund for Nature.\n8\nTable of Contents\n(4) Interim target achieved early, in fiscal year 2023.\nCash Utilization Strategy\nWe take a consistent and balanced approach to capital allocation to drive long-term, sustainable value for our shareholders. The predictability of our free cash flows allows us to efficiently execute our capital allocation strategy, which includes investing in value-creating acquisitions and returning free cash flow to our shareholders through dividends and share repurchases. We are committed to an efficient capital structure and maintaining our investment grade credit ratings on our senior debt, which was rated BBB+ by Standard & Poor’s Ratings Services, A- by Fitch Ratings, Inc. and Baa1 by Moody’s Investors Service, Inc. Such ratings have allowed us, and should continue to allow us, to readily access capital markets at competitive rates.\nWe manage our free cash flow by ensuring that capital expenditures and operating asset levels are appropriate in light of our existing business and growth opportunities and by closely managing our working capital.\nDividends\nIn July 2024, our Board of Directors approved an increase in the quarterly dividend to $0.580 per share, which represents an increase of approximately 8% over the prior year. This increase represented the 21\nst\n consecutive year of a dividend increase. Over the last five years, our dividends have increased at a compounded annual growth rate of 6.4%. We expect to continue paying quarterly cash dividends and may consider additional dividend increases if we believe they will enhance shareholder value.\nShare Repurchases\nIn October 2023, our Board of Directors approved a $3.0 billion share repurchase authorization effective starting January 1, 2024, and extending through December 31, 2026. Share repurchases under the current program may be made through open market purchases or privately negotiated transactions in accordance with applicable federal securities laws. While the Board of Directors has approved the program, the timing of any purchases, the prices and the number of shares of common stock to be purchased will be determined by our management, at its discretion, and will depend upon market conditions and other factors. The share repurchase program may be extended, suspended or discontinued at any time. On a quarterly basis, our Board of Directors reviews the parameters around which we repurchase our shares. Refer to \nItem 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities \nfor repurchase authority remaining as of December 31, 2024.\nShareholder Value\nWe are committed to creating long-term shareholder value by generating consistent earnings and cash flow growth while continually improving returns on invested capital. Our incentive compensation programs are aligned with these objectives at all levels of management. We have an active shareholder outreach program and routinely interact with shareholders on a number of matters, including environmental, social, governance, talent and executive compensation.\nManagement Team\nWe believe that building and blending a diverse team of strong industry veterans, along with talented people from other industries who bring unique skill sets, will contribute to what we call our Composite Strength. Composite Strength combines the vast, varied experience and capability of both strong environmental services industry veterans and talented people from other industries. Additionally, Composite Strength helps ensure the continuity of leadership and preservation of institutional knowledge, while also bringing in skills and new ideas from other companies outside of our industry - many of them from leading companies.\nJon Vander Ark \nwas named Chief Executive Officer in 2021. Since joining Republic in 2013, Mr. Vander Ark has held management roles of increasing responsibility, including Executive Vice President, Chief Marketing Officer, Executive Vice President, Operations, Executive Vice President, Chief Operating Officer, President and his current role as President and Chief Executive Officer. Prior to joining the Company, he served as a partner at McKinsey & Company’s Detroit office, managing clients across a variety of industries, including transportation, logistics, manufacturing and consumer products. Mr. Vander Ark serves on the Board of Directors of Lennox International Inc.\nBrian Bales \nwas named Executive Vice President, Chief Development Officer in February 2015. Mr. Bales has been with Republic for over 25 years, serving as Executive Vice President, Business Development from December 2008 to February 2015 and Vice President, Corporate Development from 1998 to December 2008. Prior to his time at Republic, Mr. Bales held roles of increasing responsibility in finance and business development for Ryder System, Inc. from 1993 to 1998 and served as chief financial officer for EDIFEX & VTA Communications from 1988 through 1993. Prior to that, Mr. Bales was an accountant for PwC (formerly Price Waterhouse) from 1986 to 1988. Mr. Bales serves on the Board of Directors of RB Global, Inc.\n9\nTable of Contents\nGregg Brummer \nwas named Executive Vice President, Chief Operating Officer in August 2023. Prior to his current role, Mr. Brummer served as Senior Vice President, Operations from June 2019 to August 2023 where he was responsible for maximizing field performance, ensuring superior service delivery, executing the operating plan, and achieving financial and operational results across the Company. Mr. Brummer joined the Company in January 2014 as Area President, a role he held until June 2019. Prior to joining the Company, Mr. Brummer was a Regional Vice President as well as General Manager at BlueLinx Corporation and held various leadership positions at Georgia Pacific Corporation.\nBrian DelGhiaccio\n was named Executive Vice President, Chief Financial Officer in June 2020. Mr. DelGhiaccio has over 25 years of experience with Republic in a variety of roles of increasing responsibility. He was named Executive Vice President and Chief Transformation Officer in June 2019. Before that, Mr. DelGhiaccio served as Vice President, Investor Relations from 2012 to 2014, progressed to Senior Vice President, Finance from 2014 to 2017 and then to Senior Vice President, Business Transformation in 2017. Prior to his time at Republic, Mr. DelGhiaccio worked in the audit practice of Arthur Andersen. Mr. DelGhiaccio serves on the Board of Directors of Aramark.\nCatharine D. Ellingsen\n was named Executive Vice President, Chief Legal Officer, Chief Ethics & Compliance Officer and Corporate Secretary in June 2016. Ms. Ellingsen has over 20 years of experience with Republic in a variety of roles of increasing responsibility. She was named Managing Corporate Counsel in January 2003, Director, Legal and Associate General Counsel in January 2005 and Vice President and Deputy General Counsel in June 2007. Ms. Ellingsen was named Senior Vice President, Human Resources in August 2011 and served in that position until June 2016. Before joining the Company, Ms. Ellingsen was an attorney at Steptoe & Johnson LLP from 1996 to 2001 and at Bryan Cave LLP from 1993 to 1996.\nAmanda Hodges \nwas named Executive Vice President, Chief Commercial Officer in August 2024. In this role, Ms. Hodges leads the Company’s sales organization and customer service team to drive profitable growth and customer loyalty. Prior to her current role, Ms. Hodges served as Executive Vice President, Chief Marketing Officer from November 2020 to August 2024. Prior to joining Republic, Ms. Hodges spent 15 years in leadership roles for Dell Technologies, most recently serving as Senior Vice President of North America Marketing and the Global Customer Briefing Program. Before joining Dell, Ms. Hodges worked as a consultant for McKinsey & Company.\nCourtney Rodriguez\n was named Executive Vice President, Chief Human Resources Officer in March 2023. In this role, she is responsible for all aspects of the Company’s talent strategy, including talent acquisition and retention, learning and development, and total rewards. Prior to joining Republic, Ms. Rodriguez served as Senior Vice President, Global HR, for Dell Technologies. She has over 20 years of HR experience, including frontline, customer operations, culture transformation and M&A support. Ms. Rodriguez started her career in finance as a senior auditor for Arthur Andersen before moving to Dell as a financial analyst. \nJulia Arambula\n was named Senior Vice President, Operations, Environmental Solutions in August 2024. Ms. Arambula joined the company in 2002 and has held a variety of roles of increasing responsibility. In her current role, Ms. Arambula is responsible for maximizing field performance, ensuring superior service delivery, executing the operating plan, and achieving financial and operational results for Group 3, our environmental solutions business. Prior to her current role, Ms. Arambula was Senior Vice President, Operations over Group 2 from November 2021 to August 2024. Prior to that, Ms. Arambula served as Senior Vice President, Operations Support from March 2020 to November 2021, where she led the operations support function for the Company, including collections, post collections, recycling operations, fleet & asset management and engineering & environmental compliance. Ms. Arambula held the position of Vice President, Financial Planning and Analysis from March 2015 to March 2020, and prior to that held a variety of finance and accounting roles of increasing responsibility. Prior to Republic, Ms. Arambula was a senior auditor with Arthur Anderson.\nLarson Richardson\n was named Senior Vice President, Operations in December 2023. In his current role, Mr. Richardson is responsible for maximizing field performance, ensuring superior service delivery, executing the operating plan, and achieving financial and operational results for Group 1, which covers recycling and waste field operations in the western portion of the United States and Canada. Prior to his current role, Mr. Richardson was Area President over the Company’s Heartland Area from June 2019 to December 2023, where he was responsible for leading the execution of the operating plan and results for the recycling and waste operations within the Heartland. Prior to that, Mr. Richardson was Area Vice President for the Southeast Area from September 2017 to June 2019, and held the position of Senior Manager Municipal Sales from June 2015 to September 2017. Mr. Richardson started with Republic as a General Manager in the Southeast Area, a position he held from May 2012 to June 2015. Prior to Republic, Mr. Richardson was an Area General Manager at Waste Industries USA.\nOur local and area management teams have extensive industry experience in growing, operating and managing environmental services companies and have substantial experience in their local geographic markets. This allows us to quickly respond to and meet our customers’ needs and stay in touch with local businesses and municipalities. We believe our strong area management teams allow us to effectively and efficiently drive our initiatives and help ensure consistency throughout the organization. Our area management teams and area presidents have extensive authority and responsibility over operations within their respective geographic markets. As a result of retaining experienced managers with extensive knowledge of and involvement in their local \n10\nTable of Contents\ncommunities, we are proactive in anticipating customers’ needs and adjusting to changes in our markets. We also seek to implement the best practices of our various business units throughout our operations to continue improving our operations and our operating margins.\nComprehensive Environmental Services\nWe serve customers with a strong, vertically-integrated operating platform and offer a complete set of products and services, including the collection and processing of recyclable, solid waste and industrial waste materials; transportation and disposal of non-hazardous and hazardous waste streams; and other environmental solutions. We offer a wide array of products and services with a proven track record in safety, compliance and environmental stewardship.\nRecycling & Waste Services\nWe have a strong, national, vertically-integrated operating platform that allows us to compete more effectively and efficiently in the local markets in which we operate. Where appropriate, we seek to achieve a high rate of internalization by managing material streams from the point of collection through recycling processing or disposal. During the year ended December 31, 2024, approximately 67% of the total solid waste volume we collected was disposed at landfills we own or operate (internalization). Our fully integrated markets generally have a lower cost of operations and more favorable cash flows than our markets that are not fully integrated. Through acquisitions, landfill operating agreements and other market development activities, we create market-specific, vertically-integrated operations typically consisting of one or more collection operations, transfer stations and landfills. We also operate recycling centers in markets where diversion of waste is a priority, customers are willing to pay for the service and we can earn an appropriate return on our investment.\nCollection Services\nWe provide residential, small-container and large-container collection services through 367 collection operations. In 2024, approximately 68% of our total revenue was derived from our collection business, of which approximately 18% of our total revenue related to residential services, approximately 30% related to small-container services, approximately 19% related to large-container services and approximately 1% related to other collection services.\nOur residential collection business involves the curbside collection of material for transport to transfer stations, or directly to recycling centers, organics processing facilities, or landfills. We typically perform residential collection services under contracts with municipalities, which we generally secure through competitive bids, which give us exclusive rights to service all or a portion of the homes in the municipalities. These contracts usually range in duration from one to five years, although some of our exclusive franchises are for significantly longer periods. We also perform residential services on a subscription basis, in which individual households contract directly with us. The fees received for subscription residential collection are based primarily on the market, collection frequency, type of service, the distance to the disposal facility and the cost of processing or disposal. In general, subscription residential collection fees are paid quarterly in advance by the customers receiving the service.\nIn our small-container business, we supply our customers with recycling and waste containers of varying sizes. We typically perform small-container collection services under one- to three-year service agreements, and fees are determined based on a number of factors including the market, collection frequency, type of equipment furnished, type and volume or weight of the material collected, transportation costs and the cost of processing or disposal. Our small-container services are typically offered to small business complexes, multi-family housing and strip malls and include industries such as restaurants, retail, real-estate and professional and other services.\nOur large-container collection business includes both recurring and temporary customer relationships. For the recurring portion, we supply our customers with recycling and waste containers of varying sizes and rent compactors to large generators of material. We typically perform the collection services under one- to three-year service agreements, and fees are determined based on a number of factors including the market, collection frequency, type of equipment furnished, type and volume or weight of the material collected, transportation costs and the cost of processing or disposal. Our recurring large-container services are typically offered to larger facilities, hotels and office buildings and include industries such as manufacturing, retail, hospitality, professional and other services.\nFor the temporary portion of our large-container collection business, the majority of the material relates to construction and demolition activities and is typically event-driven. We provide temporary collection services on a contractual basis with terms ranging from a single pickup to one-year or longer.\nTransfer Services\nWe own or operate 248 transfer stations. Revenue at our transfer stations is primarily generated by charging tipping or disposal fees, which accounted for approximately 5% of our revenue during 2024. Our collection operations deposit material at these transfer stations, as do other private and municipal haulers, for compaction and transfer to disposal sites or recycling centers. \n11\nTable of Contents\nTransfer stations provide collection operations with a cost-effective means to consolidate material and reduce transportation costs while providing our landfills with an additional mechanism to extend their geographic reach.\nWhen our own collection operations use our transfer stations, this improves internalization by allowing us to retain fees we would otherwise pay to third-party disposal sites. It also allows us to manage costs associated with material disposal because: (1) transfer trucks have larger capacities than collection trucks, allowing us to deliver more material to the landfill or processing center in each trip; (2) material is accumulated and compacted at strategically located transfer stations to increase efficiency; and (3) we can retain volume by managing the material to one of our own landfills or processing centers rather than to a competitor’s.\nRecycling Processing Services\nWe own or operate 75 recycling centers. These centers generate revenue through the processing and sale of old corrugated containers (OCC), old newsprint (ONP), aluminum, glass and other materials, which accounted for approximately 2% of our total revenue during 2024. Approximately 82% of our total recycling center volume is fiber based and includes OCC, ONP and other mixed paper. During 2024, we processed and sold 2.1 million tons, excluding glass and organics, from our recycling centers. An additional 2.2 million tons were collected by us and delivered to third parties. We are investing in innovative recycling technology and have expanded our organics operations to help customers meet their diversion goals. We processed 1.1 million and sold 0.3 million tons of organic materials, respectively, from our recycling centers in 2024.\nChanging market demand for recycled commodities causes volatility in commodity prices. At current volumes and mix of materials, we believe a $10 per ton change in the price of recycled commodities would change both annual revenue and operating income by approximately $11 million.\nIn certain instances, we issue recycling rebates to our municipal or large-container customers, which can be based on the price we receive upon the final sale of recycled commodities, a fixed contractual rate or other measures. We also receive rebates when we dispose of recycled commodities at third-party processing facilities.\nWe have met increased consumer demand for recycling services by integrating recycling components across our collection service offerings. Our goal is to provide a complete material stream management solution to our customers in a vertically integrated, environmentally sustainable way.\nWe continue to invest in proven technologies to control costs and to simplify and streamline recycling for our customers. For example, robotics and advanced sorting equipment, such as disk screens, magnets and optical sorters, identify and separate different kinds of paper, metals, plastics and other materials to increase efficiency and maximize our recycling efforts.\nLandfill Services\nWe own or operate 208 active landfills. Our landfill tipping fees charged to third parties accounted for approximately 11% of our revenue during 2024. As of December 31, 2024, we had 41,158 estimated permitted acres and estimated total available disposal capacity of 5.0 billion in-place cubic yards. The in-place capacity of our landfills is subject to change based on engineering factors, requirements of regulatory authorities, our ability to continue to operate our landfills in compliance with applicable regulations and our ability to successfully renew operating permits and obtain expansion permits at our sites. Some of our landfills accept non-hazardous special waste, including utility ash, asbestos and contaminated soils.\nMost of our active landfill sites have the potential for expanded disposal capacity beyond the currently permitted acreage. We monitor the availability of permitted disposal capacity at each of our landfills and evaluate whether to pursue an expansion at a given landfill based on estimated future waste volumes and prices, market needs, remaining capacity and the likelihood of obtaining an expansion. To satisfy future disposal demand, we are seeking to expand permitted capacity at certain landfills; however, all proposed or future expansions may not be permitted.\nWe also have responsibility for 125 closed landfills, for which we have associated closure and post-closure obligations.\n12\nTable of Contents\nEnvironmental Solutions\nWe have the capabilities to address the complex environmental and sustainability needs of our customers. Our environmental solutions offerings include collection, treatment, consolidation, disposal and recycling of hazardous and non-hazardous waste; field and industrial services; equipment rental; emergency response and standby services; and in-plant services. Environmental solutions volume is generated by the daily operations of industrial, petrochemical and refining facilities and oil and natural gas exploration and production sites, including maintenance, plant turnarounds and capital projects. Volume also is generated by private and government funded projects including site remediation, redevelopment or emergency spill response. In 2024, approximately 11% of our revenue was derived from environmental solutions.\nWaste Treatment & Disposal\nWe own or operate 6 active hazardous waste landfills, 9 active energy waste landfills, 2 treatment, recovery and disposal facilities, 23 treatment, storage and disposal facilities, 5 salt water disposal wells and 14 deep injection wells. We recycle, treat and dispose of hazardous and non-hazardous industrial wastes. The waste streams handled include substances which are classified as “hazardous” because of their corrosive, ignitable, reactive or toxic properties and other wastes subject to federal, state and provincial environmental regulation. The waste we handle comes in solid, liquid and sludge form and can be received in a variety of containerized and bulk forms and transported to our facilities by truck and rail.\nWe also operate thermal desorption units that recover oil and metal bearing catalyst from refinery and other organic and oil-based waste. The recycled oil and recycled catalyst are sold to third parties.\nField Services\nOur field services include a wide range of specialty and total waste management services provided to refineries, chemical plants, manufacturing plants, pharmaceutical manufacturers, technology companies, research laboratories and other government, commercial and industrial facilities either on-site or at our network of facilities. These services include industrial cleaning and maintenance, retail services, lab pack, site remediation, equipment cleaning and maintenance services, specialty equipment rental, transportation and emergency response.\nAs an integral part of our services, we employ highly trained staff and operate a network of service centers that characterize, package and collect hazardous and non-hazardous wastes from customers and transport such wastes to and between our facilities for treatment or bulking for shipment to final disposal locations. \nSustainability Innovation\nWe are uniquely positioned to offer products and services to address the complex sustainability needs of our customers. Our sustainability innovation product and service offerings include operations that allow for greater material circularity and support decarbonization. We believe demand for post-consumer content in consumer packaging and low carbon energy alternatives continues to increase. We are able to invest independently or through joint ventures to create solutions for the evolving marketplace. \nCircularity\nIn 2024, we commenced operations at our first Polymer Center in Las Vegas and completed construction of our second Polymer Center in Indianapolis. Through its Polymer Centers, Republic is the first company to manage the plastics stream through an integrated process from curbside collection of recycled material to production and delivery of high-quality recycled content for consumer packaging. Rigid plastics – polyethylene terephthalate (PET), high-density polyethylene (HDPE) and polypropylene (PP) – collected from residential and commercial customers and sorted at local recycling facilities are delivered to the Polymer Center for secondary processing. Each facility is expected to produce more than 100 million pounds per year of recycled plastic, including 100% post-consumer PET flake delivered to the food-grade marketplace to enable bottle-to-bottle circularity. In addition, HDPE and PP packaging such as detergent jugs or butter tubs, which today are collected in multicolored bundles, can be separated by plastic type and color. We plan to commence operations at the Indianapolis Polymer Center during 2025 and anticipate opening two additional Polymer Centers in the coming years.\nIn 2023, we announced the creation of Blue Polymers, LLC, a joint venture with Ravago, that will further advance circularity in the plastics industry. The Blue Polymers facilities will utilize the color-sorted recycled HDPE and PP from our Polymer Centers to create custom recycled resins for consumer packaging and other applications. The process is expected to convert recycled HDPE and PP into fully formulated products for use in both food-grade and non-food-grade sustainable applications. Four Blue Polymers facilities are planned to open over the coming years, beginning with an Indianapolis facility in 2025. Once operational, these facilities are expected to produce a combined 300 million pounds per year of recycled plastics. Products are expected to include custom-blended and compounded materials for individual customers to help them achieve their sustainability goals and comply with federal, state or local requirements for recycled content.\n13\nTable of Contents\nDecarbonization\nOur customers are increasingly looking for decarbonization solutions, and Republic is leveraging our network of landfills to meet that need. Republic is committed to harnessing landfill gas, a natural byproduct of decomposing waste, and converting it to energy. More than 87% of our landfill acreage is covered by gas collection systems. Collecting and converting landfill gas into renewable energy provides economic and environmental benefits, including reducing fugitive greenhouse gas emissions. \nAs of December 31, 2024, we operated 79 landfill gas-to-energy projects. The majority of these projects were developed and are owned by a third party, where we earn a royalty based on renewable energy sold. We presently have 45 landfill gas-to-renewable natural gas (RNG) projects in development that are expected to begin operations in the coming years. The majority of the development portfolio is part of a joint venture with Archaea Energy, a bp company, in which Republic is a minority equity owner. RNG is a low-carbon, pipeline-quality fuel that’s fully interchangeable with fossil fuel-derived natural gas; it can be used as a transportation fuel in commercial fleets, including our own.\nWe also are producing renewable energy at our landfills through solar projects we host at six sites, which generate clean electricity for local communities.\nOther Services\nOther revenue consists primarily of National Accounts revenue generated from nationwide or regional contracts in markets outside our operating areas where the associated material handling services are subcontracted to local operators. Consequently, substantially all of this revenue is offset with related subcontract costs, which are recorded in cost of operations.\nCompetition\nWe operate in a competitive industry. Competition in the environmental services industry comes from a few other large, national publicly-owned companies, several regional publicly- and privately-owned companies and thousands of small privately-owned companies. In any given market, competitors may have larger operations and greater resources. In addition, we compete with municipalities that maintain material collection or disposal operations. These municipalities may have financial advantages due to the availability of tax revenue and greater opportunities for tax-exempt financing.\nWe compete for collection accounts primarily based on our product offering, quality of service and price. From time-to-time, our competitors reduce the price of their services in an effort to expand market share or to win a competitively bid municipal contract. Our ability to maintain and increase prices in certain markets may be impacted by our competitors’ pricing policies. This may have an effect on our future revenue and profitability.\nSeasonality and Severe Weather\nOur operating revenues tend to be somewhat higher in the summer months, primarily due to higher volumes of construction and demolition waste. The volumes of large-container and residential recycling and waste in certain regions of the country also tend to increase during the summer months. Our second and third quarter revenues and results of operations typically reflect this seasonality.\nWe provide essential environmental services in the communities we serve and our operations can be adversely affected by periods of inclement or severe weather and natural disasters, which could increase the volume of material collected under our existing contracts (without corresponding compensation), delay the collection and disposal of material, reduce the volume of material delivered to our disposal sites or delay the construction or expansion of our landfill sites and other facilities. These risks may increase with the physical impacts of climate change. The impacts from adverse weather and natural disasters have the potential to last several months and to affect several facilities. We have business continuity plans in place for severe weather, natural disasters and other emergencies—hurricanes, tornadoes, flooding, winter storms, earthquakes and wildfires, among others—to help limit disruptions in our operations and\n \nhelp\n \nensure the continuity of our services. Our operations can also be favorably affected by severe weather and natural disasters, which could increase the volume of material in situations where we are able to charge for our additional services. Refer to our TCFD Report for more information on climate impacts and our risk management strategies, available at investor.republicservices.com/sustainability. The information contained on our website shall not be deemed incorporated by reference in this Annual Report on Form 10-K or in any other filing we make under the Exchange Act.\nRegulation\nOur facilities and operations are subject to a variety of federal, state, provincial and local requirements that regulate, among other things, the environment, public health, safety, zoning and land use. Operating and other permits, licenses and other approvals generally are required for landfills and transfer stations, recycling centers, certain waste collection vehicles, fuel storage tanks and other equipment and facilities that we own or operate. These permits are subject to denial, revocation, modification and renewal in certain circumstances. Any revocation, modification or denial of permits could have a material \n14\nTable of Contents\nadverse effect on us. Federal, state and local laws and regulations vary, but generally govern wastewater or storm water discharges, air emissions, the handling, transportation, treatment, storage and disposal of hazardous and non-hazardous waste and the remediation of contamination associated with the release or threatened release of hazardous substances. These laws and regulations provide governmental authorities with strict powers of enforcement, which include the ability to revoke or decline to renew any of our operating permits, obtain injunctions, or impose fines or penalties in the event of violations, including criminal penalties. The United States EPA and various other federal, state, provincial and local authorities administer these regulations. Regulations with respect to hazardous waste are particularly relevant for our Group 3 reportable segment that provides treatment, recycling and disposal of hazardous waste.\nIn order to comply with these regulations, we must incur substantial capital expenditures relating to our vehicles, landfills, transfer stations, recycling centers and other assets, and in connection with our capping, closure, post-closure and environmental remediation activities. Compliance with existing and future legal and regulatory requirements, including changes relating to per- and polyfluoroalkyl substances (commonly referred to as PFAS) and other chemicals of emerging concern, and limitations or bans on disposal of certain types of wastes or on the transportation of waste, could increase our costs to operate or require additional capital expenditures. \nA decrease in regulation may lower barriers to entry for our competitors. Further, we compete with counties and municipalities that operate their own collection and disposal facilities, and have the benefits of tax revenue and greater opportunities for tax-exempt financing.\nWe strive to conduct our operations in compliance with applicable laws, regulations and permits. However, from time to time we have been issued citations or notices from governmental authorities that have resulted in the need to expend funds for remedial work and related activities at various landfills and other facilities or in the need to expend funds for fines, penalties or settlements. Citations and notices may be issued in the future, notwithstanding our strong regulatory compliance efforts. We have established final capping, closure, post-closure and remediation reserves that we believe, based on currently available information, will be adequate to cover our current estimates of regulatory costs; however, actual costs may exceed our reserves.\nFederal Regulation\nThe following summarizes the primary federal, environmental and occupational health and safety-related statutes that affect our facilities and operations:\n•\nThe Solid Waste Disposal Act, including the Resource Conservation and Recovery Act\n (RCRA). RCRA establishes a framework for regulating the handling, transportation, treatment, storage and disposal of hazardous and non-hazardous solid waste, and requires states to develop programs to ensure the safe disposal of solid waste in sanitary landfills.\nSubtitle C of RCRA establishes a framework for regulating the disposal of hazardous waste, and Subtitle D of RCRA establishes a framework for regulating the disposal of municipal solid waste. Regulations under Subtitle C set requirements for hazardous waste generators, transporters and treatment, storage and disposal facilities. Regulations under Subtitle D currently include minimum comprehensive solid waste management criteria and guidelines, including location restrictions, facility design and operating criteria, final capping, closure and post-closure requirements, financial assurance standards, groundwater monitoring requirements and corrective action standards. The EPA may authorize states to implement certain hazardous waste requirements of Subtitle C, and if a state program does not exist, the EPA directly implements the hazardous waste requirements. Nearly all of the states in which we operate have implemented permit programs pursuant to RCRA and Subtitles C and D. These state permit programs may include landfill requirements that are more stringent than those of Subtitles C and D. Our failure to comply with any of these environmental requirements at any of our locations may lead to temporary or permanent loss of an operating permit, which would result in costs in connection with securing new permits, reduced revenue from lost operational time and increased third party disposal costs.\nAll of our planned landfill expansions and new landfill development projects have been engineered to meet or exceed Subtitles C and D requirements, as applicable. Operating and design criteria for existing operations have been modified to comply with these regulations. Compliance with Subtitles C and D regulations has resulted in increased capital expenditures and operating costs and may in the future require substantial additional expenditures in addition to other costs normally associated with our waste management activities.\n•\nThe Comprehensive Environmental Response, Compensation and Liability Act of 1980\n (CERCLA). CERCLA, among other things, provides for the cleanup of sites from which there is a release or threatened release of a hazardous substance into the environment. CERCLA may impose strict joint and several liability for the costs of cleanup and for damages to natural resources upon current owners and operators of a site, parties who were owners or operators of a site at the time the hazardous substances were disposed of, parties who transported the hazardous substances to a site and parties who arranged for the disposal of the hazardous substances at a site. Under the authority of CERCLA and its implementing regulations, detailed requirements apply to the manner and degree of investigation and remediation of \n15\nTable of Contents\nfacilities and sites where hazardous substances have been or are threatened to be released into the environment. Liability under CERCLA is not dependent on the existence or disposal of only hazardous wastes, but also can be based upon the existence of small quantities of more than 700 substances currently characterized by the EPA as hazardous, many of which are found in common household waste. The EPA may also designate additional substances as hazardous; in 2024, the EPA finalized a rule that designated two PFAS as hazardous substances. Among other things, CERCLA authorizes the federal government to investigate and remediate sites at which hazardous substances have been or are threatened to be released into the environment, or to order persons potentially liable for the cleanup of the hazardous substances to do so themselves. In addition, the EPA has established a National Priorities List of sites at which hazardous substances have been, or are threatened to be, released and which require investigation or cleanup.\nCERCLA liability is strict liability. It can be founded upon the release or threatened release, even as a result of unintentional, non-negligent or lawful action, of hazardous substances, including very small quantities of such substances. Thus, even if we have never knowingly transported or received hazardous substances, it is possible that hazardous substances have been deposited or released at landfills or other facilities that we presently or historically have owned or operated, or at properties owned by third parties to which we have transported waste. Therefore, we could be liable under CERCLA for the cost of cleaning up, or protecting against the release of, such hazardous substances at such sites and for damages to natural resources, even if those substances were deposited at our facilities before we acquired or operated them. The costs of a CERCLA cleanup can be very expensive and can include the costs of disposing of hazardous substances at appropriately-licensed facilities. Given the difficulty of obtaining insurance for environmental impairment liability, any such liability could have a material effect on our business, financial condition, results of operations and cash flows.\n•\nThe Federal Water Pollution Control Act of 1972\n (the Clean Water Act). This act regulates the discharge of pollutants from a variety of sources, including solid waste disposal sites, into streams, rivers and other waters of the United States. Runoff from our landfills and transfer stations that is discharged into surface waters through discrete conveyances must be covered by discharge permits that generally require us to conduct sampling and monitoring, and, under certain circumstances, to reduce the quantity of pollutants in those discharges. Storm water discharge regulations under the Clean Water Act require a permit for certain construction activities and for runoff from industrial operations and facilities, which may affect our operations. If a landfill or transfer station discharges wastewater through a sewage system to a publicly-owned treatment works, the facility must comply with discharge limits imposed by that treatment works. In addition, states may adopt groundwater protection programs under the Clean Water Act or the Safe Drinking Water Act that could affect the manner in which our landfills monitor and control their waste management activities. Furthermore, if development at any of our facilities alters or affects wetlands, we may be required to secure permits before such development starts. In these situations, permitting agencies may require mitigation of wetland impacts.\n•\nThe Clean Air Act.\n The Clean Air Act imposes limitations on emissions from various sources, including landfills. In 1996, the EPA promulgated regulations that require large municipal solid waste landfills to install landfill gas monitoring systems along with landfill gas control systems unless emissions are below established thresholds. These regulations apply to landfills that commenced construction, reconstruction or modification on or after May 30, 1991, and, principally, to landfills that can accommodate 2.5 million cubic meters or more of municipal solid waste. The regulations apply whether the landfills are active or closed. The date by which each affected landfill must have a gas collection and control system installed and made operational varies depending on calculated emission rates at the landfill. In July 2016, the EPA issued final amendments to its regulations that require large landfills that commenced construction, reconstruction, or modification on or after July 17, 2014 to capture additional landfill gas to reduce emissions of methane and certain non-methane gases, which are recognized as greenhouse gases. In a separate rule finalized at the same time, the EPA issued updates to its 1996 Emission Guidelines to reduce emissions of landfill gas from existing active landfills. Both actions were part of the Obama Administration's Climate Action Plan - Strategy to Reduce Methane Emissions. As part of the Biden Administration's focus on climate change, the EPA has taken further steps to implement these regulations. These and other efforts to curtail the emission of greenhouse gases and to ameliorate the effect of climate change may require our landfills to deploy more stringent emission controls and monitoring systems, with resulting capital or operating costs. Many state regulatory agencies also currently require monitoring systems for the collection and control of certain landfill gas. Certain of these state agencies are also implementing greenhouse gas control regulations that would also apply to landfill gas emissions. See",
    "item1a": "Item 1A of this Annual Report on Form 10-K.",
    "item1b": "ITEM 1B.\n  UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.  CYBERSECURITY\nCybersecurity Risk Management and Strategy\nRepublic’s technology and cybersecurity programs are crucial to maintaining secure operations, which enable us to deliver on our promise to customers and maintain stakeholder trust. \nOur Cybersecurity organization, led by our \nChief Information Security Officer (CISO)\n, is responsible for establishing, implementing and executing our cybersecurity program and strategy.\n \nOur CISO has over 20 years of information technology, information technology audit, and cybersecurity experience, and is involved in assessing the latest developments in cybersecurity, including potential threats and innovative risk management techniques.\nOur cybersecurity program is a critical component of our enterprise risk management process overseen by our Board of Directors, and we have integrated cybersecurity-related risks into our overall enterprise risk management framework. Additionally, cybersecurity-related risks are included in the risk universe that the risk management function evaluates to assess top risks to the enterprise on an annual basis.\nOur Cybersecurity organization proactively identifies, manages, and mitigates cyber risk in a variety of ways, including but not limited to: \na.\nA formal enterprise-wide cybersecurity policy and related standards; \nb.\nCybersecurity training and employee phishing simulations; \nc.\nScheduled and ad hoc internal and external penetration tests; \nd.\nCyber incident response, IT disaster recovery, and business continuity plans; \ne.\nCybersecurity assessments and remediation planning as part of our M&A due diligence process;\nf.\nIdentity and access management controls; \ng.\nThird-party risk assessment and management for vendors and third-party service providers\n; and \nh.\nCyber incident tabletop exercises for our Board of Directors and management. \nA primary element of our cybersecurity program is the implementation of controls that are aligned with industry guidelines and applicable regulations to identify threats, deter attacks, and protect our information security assets. We have procedures in place for selecting and managing our relationships with third-party service providers and other business partners, including to monitor compliance with our agreements and regulatory and legal requirements. We also actively engage with industry participants and intelligence and law enforcement communities as part of our continuing efforts to evaluate and enhance the effectiveness of our information security policies and procedures.\n \nOur cybersecurity program is designed based on the concepts of control maturity and control efficacy. For control maturity, our cybersecurity program is aligned to the National Institute of Standards and Technology Cybersecurity Framework (NIST CSF) and is assessed annually by an independent third party against our yearly control maturity targets in the context of current cyber threat and industry trends. The NIST CSF assessment results are used to validate the progress made against the current year maturity targets, inform the program’s strategic priorities and establish maturity targets for the following year. These assessment results are provided to our Audit Committee and our Board of Directors on an annual basis. \nFor control efficacy, the cybersecurity program leverages a variety of metrics and measurements to demonstrate whether the control objectives are being consistently achieved within the target range. Monthly security operation (SecOps) reviews are utilized to monitor metric trends and root causes to determine potential capability improvements. The monthly SecOps reviews and related actions are aggregated into a subset of key metrics reviewed quarterly by the Audit Committee.\nCybersecurity Governance \n31\nTable of Contents\nOur Audit Committee oversees the management of our cybersecurity risk exposures and the steps management has taken to monitor and control such exposures. At each quarterly meeting, the Audit Committee receives an update from our CISO and other members of management on relevant topics, including cybersecurity program maturity progress, new capabilities implemented, penetration testing results, key cyber risk metrics (e.g., simulated phishing testing and vulnerability management) and notable incidents or events should they occur.\n \nOn an annual basis, our Board of Directors meets with our CISO and our third-party cybersecurity consultant to review our cybersecurity strategy and the results of our NIST CSF assessment. In accordance with our cybersecurity incident response plan, our Board is promptly informed of potentially material cybersecurity incidents, including with respect to our third-party service providers.\nAlthough we have experienced cybersecurity incidents from time to time that have not had a material adverse effect on our business, financial condition, or results of operations, there can be no assurance that a cyber-attack, security breach, or other cybersecurity incident will not have a material adverse effect on us in the future.\n For a discussion regarding risks from cybersecurity threats that have or are reasonably likely to affect the company, see our risk factors, including the risk factors titled “Our strategy includes an increasing dependence on technology in our operations. If any of our key technology fails, our business could be adversely affected.” and “A cybersecurity incident could negatively impact our business and our relationships with customers.” in"
  }
}